{"ratings": 106, "userreviews": [{"userName": "Phil Syphe", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/20436649-phil-syphe", "userReview": "Apart from the superb photos of MM, this work also includes one of Marilyn's latter-day interviews, plus a summary of her biography."}, {"userName": "J.V. Seem", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/2890076-j-v-seem", "userReview": "This is a wonderful collection of photos, both private and professional, of Marilyn Monroe throughout her life. There's even a few I haven't seen before, and that was a wonderful treasure trove.I'm not sure how accurate the biography part is, but since that's a minor detail, it hardly matters: the photos are center stage here.And they're just wonderful. For Marilyn fans, or just lovers of good photography."}, {"userName": "Michael Mayer", "userReviewDate": "May 04, 2008", "userURL": "http://www.goodreads.com/user/show/356187-michael-mayer", "userReview": "Hands down one of the best collection of photos Marilyn Monroe compiled. If you see this in a used book store buy it! Another Marilyn book that is so beautifully sad I can only bear to look at it occasionally."}, {"userName": "Moamen", "userReviewDate": "May 20, 2012", "userURL": "http://www.goodreads.com/user/show/6883136-moamen", "userReview": "a very interesting boook , important and amazing books that doesn't act only as a beautiful art but also as an important witness of the life and character of that star . also a very powerful and insightfull interview at the end of the book ."}, {"userName": "Patrícia Pereira", "userReviewDate": "Sep 11, 2014", "userURL": "http://www.goodreads.com/user/show/12377621-patr-cia-pereira", "userReview": "have some interesting content about MM, though I've not seen all of the photos yet."}, {"userName": "Bhagirathy", "userReviewDate": "May 12, 2011", "userURL": "http://www.goodreads.com/user/show/4536004-bhagirathy", "userReview": "miss monroe. beautiful."}], "description": "Many different, often contradictory, things have been written about Marilyn Monroe, but one truth remains constant -- the camera loved her. Whether posing kittenishly in a pinup shot or dramatically for a classic portrait, this shy, vulnerable, enormously insecure woman was transformed by the lens.Marilyn posed for nearly every major photographer of her day, and this pictoral chronicle of her affair with the camera, featuring shots from Richard Avedon, Cecil Beaton, Henri Cartier-Bresson, Alfred Eisentaedt, Elliott Erwitt, Philippe Halsman, Weegee, and thirty other artists, brings together the most beautiful and unusual images available. From her early days as a \"fashion model\" for ads and pinup calendars, through the film stills that follow her career as a minor actress and then major starlit, to the now-famous portraits by Avedon, and Cecil Beaton, as well as the paparazzi shots from the hordes of photographers who trailed her every move -- Marilyn emerges in all her many moods: girlish and gay, sexy and serious, glamorous and girl-next-door. And, in a fascinating and revealing interview with French writer George Belmont, Marilyn sets the record straight about much of her early life, and about her ambitions, fears, and dreams. Jane Russell, Marilyn's friend and costar in Gentlemen Prefer Blondes, enhances this portrait with an affectionate foreword that describes what it was like to work with the young actress. Although we will never know the \"real\" Marilyn, this sumptuous volume goes a long way toward preserving the memory of an utterly unforgettable woman.", "title": "Marilyn Monroe and the Camera", "url": "https://www.goodreads.com/book/show/494076.Marilyn_Monroe_and_the_Camera", "average": 4.32, "cover": "https://images.gr-assets.com/books/1175213676l/494076.jpg", "reviews": 6, "authors": [{"url": "https://www.goodreads.com/author/show/51117.Georges_Belmont", "name": "Georges Belmont"}, {"url": "https://www.goodreads.com/author/show/275597.Jane_Russell", "name": "Jane Russell"}], "type": ["Nonfiction", "Biography", "Art", "Art", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/494076.Marilyn_Monroe_and_the_Camera", "http://www.goodreads.com/book/show/16109457-marilyn-monroe-and-the-camera", "http://www.goodreads.com/book/show/932904.Marilyn_Monroe_And_The_Camera", "http://www.goodreads.com/book/show/632656.Henry_Miller_in_Conversation_with_Georges_Belmont", "http://www.goodreads.com/book/show/379255.Monsieur_Proust", "http://www.goodreads.com/book/show/29887761-souvenirs-d-outre-monde", "http://www.goodreads.com/book/show/14287.Almost_Transparent_Blue", "http://www.goodreads.com/book/show/227463.A_Clockwork_Orange"]}