{"ratings": 12916, "userreviews": [{"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "2/7/18 - ON SALE for $2.99:\nhttp://amzn.to/2yNUx65Reviewed by: Rabid ReadsKara Gillian is summoner of demons. She's also a detective who recently (and fortuitously) transferred to homicide after a three year stint in property crimes. Since she was a rookie, she's been fascinated by a string of unsolved serial murders that were committed in her town, so when a new victim turns up after a prolonged silence, she is THRILLED horrified, but eager to get on the case.From there things started going south, which is unfortunate, b/c I'd only made it through the first chapter or two.The writing is so terrible that I don't think I can accurately communicate how bad it was, so I'm letting it speak for itself. While the premise held promise--a detective with Extras, in a world that didn't acknowledge Extras, working a case involving Extras--the execution was awful. The Awful manifested in a variety of ways, but most of it boils down to a singular source: Kara is a snowflake, wrapped in a trope, inside a great many clichés. And that, my friends, is just the tip of the super special iceberg. 1. Redundant information.Like when half a dozen medical and law enforcement personal independently comment on how the intruder from the opening scene of the book, \"sure picked the wrong house,\" to break into. Hmm . . . So, ideally, a criminal shouldn't break into a cop's house? That would be a Bad Idea? I'm so glad that observation was REPEATEDLY made. Otherwise, I might've missed the irony. 2. & 3. Kara makes flash assumptions, often pertaining to her belief that she's done something wrong/Lengthy explanations for gestures and/or facial expressions that are both ridiculous and UNNECESSARY.First we have the knee-jerk insecurity: the demon asks a simple question, and in the first of many non sequiturs, Kara assumes that she's done something wrong.Her reaction is strange for a multitude of reasons, but particularly b/c earlier in the chapter, she'd gone on, at length, about the various ways a demon will take his bloodthirsty revenge on a summoner who performs an imperfect summoning. This demon is on his way OUT. If Kara had messed up, she'd know it, and by \"know it,\" I mean screaming in agony.It's kind of like a reverse narcissism, where the world revolves around her not b/c she's just that awesome, but b/c she's a twit. Then we have the unnecessary qualifications for all of her mannerisms. Kara never just says something, or grins, or scowls. She controls her expression. With effort. \n“You have not failed me,” I said, carefully choosing my words and trying not to show my glee.\nAgain, she's ALREADY explained about demons and the touchy subject of their honor, not to mention that when dealing with demons, it's common sense to be careful. But just in case we're incapable of adding 2 and 2 to get 4, she spells it out for us. And notice how the description of what she's feeling, the actions accompanying her words, is twice as long as the statement itself. I'm not opposed to the occasional wryly arched brow to punctuate a thought, but when it's as frequent and elaborate as it is here, it becomes a distraction. More time is spent on meaningless gestures than on moving the plot forward.Then, circuit completed, we're back where we started, getting our second (in as many pages) dose of Kara's inexplicable belief that she's screwed something up.After her \"careful\" choice of words, the demon goes still and hisses, the abruptness a clear indication that something unrelated to Kara, a concept she can't seem to grasp, is happening. But she misses the behavioral cues and wonders, yet again, what she did to elicit the change in Demon's demeanor. Only this time, she wants to know what she's done \"now.\" Like she's forgotten that she didn't do anything the first time. Something is wrong, ergo it must be her fault.Reverse. Narcissism. 4. Acknowledging the lameness of a thing doesn't make it less lame. \n“My God, you’d think the media could have come up with something more exciting than ‘Symbol Man.’”\nYes. One would think \"the media\" could do better. 5 & 6. ALL the boys want her despite her steadfast insistence that she is physically mediocre.Kara has no less than three blatant suitors, and a handful of other encounters with admirers as well, but every time a man casts an appreciative eye in her direction, she laments her average appearance.First we have Demon Lord, whose description paints him as an impossibly beautiful fallen angel-type. He almost certainly has ulterior motives, but that doesn't keep him from trying to get it regular from our self-deprecating Detective Gillian.\n“So beautiful,” he murmured as he bent to kiss me again. \nWho does he think he’s kidding?\nThen there's the hapless graphic novel artist:\n“I’m so sorry,” he said. “I was listening to music on my iPod and was caught up in a little project, and then I heard the knocking on the door so I leaped up, thinking it was some kind of emergency, and then instead it’s a gorgeous woman, and I’m sitting here wondering what kind of lottery I won!”\n*throws up in mouth a little bit*And finally we have FBI Agent Ryan Kristoff, which brings me to my next issue . . . 7. The painfully awkward pseudo-romance between Kara and Ryan.It begins--predictably--as insta-hate. Kara even comes up with the clever moniker, Agent Obnoxious.BUT. Then he shows up on her doorstep--to discuss the case, of course--and, well, a change of venue can make all the difference. Plus, you know, he's HAWT, so who cares about the asshole parts?\nHe was wearing a long-sleeved black oxford-style shirt and khaki dress pants—a really good look for him, I thought in an incredibly private part of my mind. The porch light did interesting things to his facial features as well.\nTHANKS for the \"private\" part of your mind qualifier. Before you clarified, I thought you meant the public access part of your brain.But why is he there? What can he possibly want from her?\nWas he flirting with me?\nDefinitely Not. You said it yourself: you're \"not beautiful.\" 8. Poor, poor Kara is a victim of her extra specialness.Maybe it's Rowland's intent to use Kara's poor socialization as a crutch for her awkwardness, but if that's the case, she was unsuccessful:\nI had too many secrets to get intimate with just anyone, and I sure as hell couldn’t risk anyone finding out about the summoning chamber in my basement. I’d simply accepted that a dearth of companionship was one of the prices I paid to be a summoner of demons.\nBy itself, that could have cast Kara as a serious practioner who made the requisite sacrifices for her scholarship. BUT. Rowland immediately follows with this:\nIt was the same reason why I’d never had any sleepovers when I was a kid and why I’d had so few friends—none of them close—in high school. There are worse things to endure, I told myself, not for the first time. Being a summoner is worth it. I shoved aside the doubt that always accompanied that thought . . .\nAnd any sympathy I may have felt got swallowed up by her own much greater self-pity.9. Kara wastes time by both stating the obvious and on pointless ruminations that emphasize her stupidity.Like when Demon Lord destroys her protections with barely a glance:\nMy stomach clenched. All of the bindings, the wardings, the protections were gone—useless. Even my police training would do me no good against this creature.\nAre you telling me that after HEP BIG Mr. Demon Lord obliterated your meticulously crafted arcane protections with a hand gesture the piddly training you received as a HUMAN cop will do NOT ONE THING to protect you?Well, shee-it.Then it gets exponentially worse . . . \n“Ryan’s on his way. He and I were grabbing dinner when he got your text, and he said he’d meet us here.” I caught myself in time before saying something like, \nOh, I figured he’d still be asleep.\n That would be a sure way to give people the wrong impression.\nGood catch, lady! That would've given them the wrong impression, for sure. 10. Belief that liberal use of \"fucking\" as an adverb makes for a clever set down.Between her habit of saying things out loud that most people designate as understood, and her cluelessness when interacting with peers, it's not a surprise that her verbal sparring skills are similarly subpar.But this is just sad.A senior detective reacts poorly to the news that Kara was given the lead on the Symbol Man case, and how does she respond?\n“It’s not my fucking fault, Crawford,” I said, nearly snarling. “I didn’t ask for it, and if it bugs you that fucking much, then take it up with the fucking captain!”\nWay to go, Kara! Your captain shows a great deal of (unwarranted) confidence in your abilities, and what do you do when confronted a colleague's poor sportsmanship? You absolve yourself of any and all responsibility. You profess to have done nothing to EARN the privilege, going so far as to imply that didn't even want it, when we all know that's not true. You can't even snarl properly, content with the suggestion of a snarl rather than fully committing, b/c your too damn weak to defend yourself from a bully. But Kara's pitiful attempts to throw sass don't end there:\n“It’s Detective Gillian,” I said through bared teeth, yanking my badge off my belt and thrusting it into the woman’s face. “I am here on official police business for the purposes of investigating a series of murders. But for you, Ms. Dailey, I have just one thing to advise.” Ms. Dailey’s eyes widened. “From now on, why don’t you try minding your own fucking business?” I turned and marched back to my car, leaving the woman behind me gaping and speechless. And, for the first time, I felt like the warrior woman in that picture.\nThis altercation might score infinitesimally higher--she does more than drop the f-bomb and blame shift, after all--except that the aggressor is a little old lady. An admittedly unpleasant little old lady, but a little old lady, nonetheless, and for unfathomable reasons, I'm unable to work up any enthusiasm for Kara's improved performance.I find the idea of feeling like a \"warrior woman\" after cursing at the elderly to be . . . I'm torn between vulgar and reprehensible.Either way, it's bad form.And that's where I'll stop, b/c ten grievances is a little ridiculous. BUT. Let the record show that I had half a dozen other points of contention, the most difficult to abandon being that the few men who didn't want Kara were fat, their imperfections described in excruciating detail. So as ranty as I've been, I've actually exercised restraint. FYI.I'm giving it two stars rather than one, b/c buried in the muck there were several brilliant magic system details. In fact, some of the foundations Rowland laid for future development were interesting enough that if I ever get truly desperate for new urban fantasy material, I might research the series to see if readers claim, \"it gets really good after the first few books.\" BUT.I'd have to be REALLY desperate."}, {"userName": "✘✘ Sarah ✘✘ (former Nefarious Breeder of Murderous Crustaceans)", "userReviewDate": "Oct 09, 2014", "userURL": "http://www.goodreads.com/user/show/7298986-sarah-former-nefarious-breeder-of-murderous-crustaceans", "userReview": "[if you're as non-dyslexic as Dan, you might realize there's a slight problem with the maths here. Please pretend you never noticed a thing. Thank thee kindly\n(hide spoiler)]"}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "May 19, 2009", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "I have to thank my Goodreads friend, Jess R, for encouraging me to read this book. All she said was, Rhyzkahl was like an Anne Stuart hero, and I was there. And I am so glad about it.Mark of the Demon gave me one heck of a read. Diana Rowland managed to take the concept of demon summoning and write a story that got past my personal hang-ups about that idea. I like that she made it clear that her concept of demons veers from the Christian concept, because I don't know if I could have been down with reading about a heroine who was dealing with Satanic demons. Okay, my hangup, not yours. But, anyway, that helped me to get on board this book. Occult detective novels are like candy to me. I devour these things. Essentially, an occult detective novel is a mystery with paranormal aspects. In this case, Kara Gillian is a police homocide detective who has a hobby/calling of demon summoning. She does this because it's in her blood. Her aunt was a summoner, and she finds out that her grandmother was one too. When her aunt taught her this art, it helped her to get her life on track, and to find a sense of purpose, something she could feel confident about. It turns out her summoning skills, and her ability to sense arcane energy, will come in handy in investigating a series of very grisly murders by the Symbol Man. I flat out loved Kara. She was insecure, foul-mouthed, socially awkward, but strong and intelligent, and very likeable. I like that she wasn't the resident sex bomb that all the men wanted. I get really tired of that over-used device in female lead urban fantasy (which causes me to search out male leads just for a break from it). She was very good at her job as a police officer, even though she didn't always have confidence in her abilities. I liked that she thought things through, and had a habit of 'faking it until you make it'. In other words, showing you had things under control, even if you are a shuddering wreck inside. I liked that because I often use that technique. I have to be honest, I saw a lot of myself in Kara. She hadn't had an easy or normal life. She wasn't good with people, and because of what she was, she hadn't had a busy social life as far as men. I liked that she was pretty good with being one of the guys, and handling that wall of chauvinism that women often face when they are working in male-dominated environments. She didn't act like a bimbo to get her way. She used the natural abilities and skills she had and didn't play up to men's flawed perceptions of women in the work environment.The mystery was tightly-plotted and well-executed. I had some suspicions about who was behind the murders, but I was pleasantly surprised to find I was wrong. Although the arcane elements tied heavily into solving the case, Kara also used good, old-fashioned police investigative techniques just as much. Ms. Rowland managed to integrate her experience in criminal investigations into this story in an interesting and believable fashion. The arcane elements were very interesting. I have zero personal interest in pursuing studies in the occult, but I find it fascinating to read about arcane/occult lore in fictional books. This story has some elements that felt unique and personal, crafted by the author to create her own world with its own rules. I liked that a lot about this story.And then there's Rhyzkahl. Hello! Yummy much? Scary much? Yes to both questions. He's not a demon, by the way. He's a Demonic Lord, which are like the top of the top in demonic hierarchy. He's not scaly and gross with horns, either. He's hot. Really hot. I was thinking, sex with a demon? Not sure about that part. But, when I read about this very sexy, human-looking (well better than human looking since he's absolutely perfect), and smooth, polite (unless he's ripping you to pieces), and charming, the sex part didn't weird me out at all. It was more like, Wow! I can see the appeal with Rhyzkahl. I can also see why Kara is scared of him and wants him out of her life. But, Rhyzkahl has an interest in Kara. We find out what that is to a certain degree, but there are still questions there. Does he like her for who she is, or what she can do with her summoning skills? He seems kind of possessive of her. Is that a sexual thing or a power thing for him? The verdict is still out on that one. But I will keep reading to find out.As for Ryan Kristoff? I grew to like him. At first, I was thinking, 'Stuffed Shirt.' But, he actually has an appeal. He's smart and he has knowledge in the occult world, and he ended up being a very good ally and partner to Kara. It will be interesting to see where their association goes.Mark of the Demon is occult detective urban fantasy in all the best ways. The sensual/romantic aspects don't overwhelm the story, but tie in beautifully. The characters are appealing and life-like. I care about Kara. I want to keep reading about her. I want to see what her association with Rhyzkahl is going to bring into her life in the future. Ms. Rowland wrote one heck of a book here. Mark of the Demon gets my stamp of approval. Give it a read!"}, {"userName": "Krissy ", "userReviewDate": "Mar 19, 2011", "userURL": "http://www.goodreads.com/user/show/4970024-krissy", "userReview": "I'm sorry, but this book just bores me to tears. My mind wandered constantly while I read it. Those who are impressed with her attention to detail regarding police procedure should read one of the first 8 Anita Blake books, where the police procedure feels genuine but is also ENTERTAINING in an urban fantasy setting. Also, the protagonist Kara Gillian is a loner, so you spend way too much time alone with her thoughts. The only scene that grabbed my attention is right at the beginning, when she meets Rhyzkahl. I liked the way he starts the scene being terrifying but winds up being intrigued by Kira, which in turn makes the reader wonder why. It doesn't matter; beyond that scene this demon lord who rips people to shreds is already the Perfect Man in Kira's presence (unerringly polite, respectful, perfect in bed, offering her everything). Who knew taming homicidal demons was that easy? Maybe if Rachel Morgan had just banged Algaliarept in Dead Witch Walking, she could have saved herself a lot of trouble for the next 9 books. I never finished the book. I bought it for $5, so I may try again at some point, but it just feels like punishment."}, {"userName": "Erin ☕ *Proud Book Hoarder*", "userReviewDate": "Nov 10, 2011", "userURL": "http://www.goodreads.com/user/show/3048260-erin-proud-book-hoarder", "userReview": "Some people go gung-ho over angel UF, my thing is the darker stuff. Reeling from my encounter with the Hollows series, where the books carved a permanent place in my psyche, I itched for more demon themed Urban Fantasy stuff. Not easy to find done well, especially since so much of it is poorly done Paranormal Romance stuff that I have no interest in reading.Mark of the Demon did scare me with its beginning. Jumps into a sex scene in the very beginning, which usually turns me off, and I worried dullness/cheapness would follow. Thankfully that's not the case as the sex scene that popped up so soon is promptly shut in the closet and hidden. The rest is pure story, thankfully with the absence of senseless nookie.This one holds a unique touch - a blend of urban fantasy with the investigative crime scene. Sure all of them have mysteries and many heroines are in law enforcement of sorts, but this one more so. She's a homicide detective working her first case involving a serial killer in a small town of Louisiana, along with a yummy FBI agent who grows on you, forensics, morgue trips, you name it. The book focuses as much on police procedure as it does the arcane magic she investigates.Kara is a genuinely likeable heroine - tough but flawed and insecure, not beautiful at all but yearning to have companionship, having to hide a large amount of what she is and can do to avoid enduring small town ignorance. Rhyzkahl was awesome - powerful, sexy, terrifying, and you never know where you stand with him. At first it seemed she was very valuable, then almost like she wasn't, so I suppose other books will fill in more of the secrets so I can finally catch on.I'm a character-orientated gal, so this book totally works in that respect. Plot wise it's different, edgy, dark and demented. The ending was incredible, and there's nothing light and fluffy about this story and the evil man they're investigating. Again, awesome."}, {"userName": "Felicia", "userReviewDate": "Dec 02, 2009", "userURL": "http://www.goodreads.com/user/show/666892-felicia", "userReview": "I have had this on my shelf since the author Tweeted at Comicon she wanted to give me a copy, haha. I got a little burnt out on Urban Fantasy novels though, so I put it on the pile of \"things I want to get to when I'm again in the mood for supernatural ladies doing it with demon/vampire/were-men\". First, I love the cover art, classy, thank you! (since half the UF stuff out there is utter awfulness. Even though I read most stuff on my Kindle, it's the principal of the thing.)The book is quite good, I enjoyed it a lot. It had a nice balance of procedural mixed with demons and supernatural. I thought the main character was nicely grounded in reality, without a total cookie-cutter \"problem\". The atmosphere and setting were cool, I love the Southern angle (better than another popular series set in New Orleans I recently read, forget the name of it).Only negative was that I wasn't CRAZY about the love interest guy, but I didn't hate him (Like in the Adrian Phoenix book, that was it), so I'll be interested to see how things develop. Will definitely read another!"}, {"userName": "Bradley", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "This is a stronger UF than I would have guessed from my other impressions. It's very much a police procedural with demon summoning thrown in the mix. I was actually rather surprised that it felt a little bit like a burgeoning romance, too, but there it is! Demon lovers, unite! :)I was getting the whole Kim Harrison vibe here for a while but I was pleased to see that this is very much its own beast.... or demon. An uber-powerful demon slumming it, a serial murderer, and a mystery. Pretty simple, but I don't mind. I had fun! It's an easy popcorn read and I'm curious to see just where the blood will go. :)"}, {"userName": "Literary Ames {Against GR Censorship}", "userReviewDate": "Feb 11, 2010", "userURL": "http://www.goodreads.com/user/show/2109885-literary-ames-against-gr-censorship", "userReview": "Many people seemed to like this one but unfortunately I didn't. About 50 or so pages in childhood sexual abuse is described immediately followed by what was supposed to be a hot sex scene with a demon lord who at first tries to rape Kara using mind control, she calls him on it, he stops but she sleeps with him anyway. This made me extremely uncomfortable and soured the rest of the book for me. I skimmed until I got to the last 100 pages where, I think, the author had gained more confidence as the writing had improved. However, I didn't much like Mr. FBI after he revealed he knew about the arcane; he became overly sappy for my tastes. I can't see him and Kara being more than just friends. Kara, too, annoyed me. She could've saved herself a lot of pain and trouble if she'd just called the demon lord before the ritual started. I kept waiting and waiting for her to do it but she was a last minute girl, living and dying on the edge. Although the plot was good, the writing suffered from being the first book and the only thing that really interested me was the demon lord who we sadly didn't really see much of."}, {"userName": "ᴥ Irena ᴥ", "userReviewDate": "Jun 06, 2015", "userURL": "http://www.goodreads.com/user/show/5252054-irena", "userReview": "Mark of the Demon has both sides of the coin when it comes to the plot and its characters. As far as I am concerned most of the things that aren't good are explained in the book. Unless you read selectively, that is (you know, when people read about one situation and then conveniently forget it mentioned in another because they won't be able to whine about it otherwise, i.e. the reason why I tend to form my own opinions). A Beaulac PD Detective Kara Gillian gets a surprise of a lifetime when a Demonic Lord appears during a summoning of another demon. The thing is, that shouldn't be possible. And right there you get a first thing that I didn't quite like. The mistake here is that I've just met the protagonist and I haven't formed any sort of an attachment to her. What happens then is simply too soon so you could end up being surprised without any explanation. I'm neither attacking nor defending Kara's actions, but Rhyzkahl has a knack to see what a person wants the most at the moment. Kara Gillian's behaviour is explained, but I won't get into it much since the author herself gave just enough to form a clearer picture of her heroine. She is insecure and sometimes foolish and tends to shorten words when she is nervous (although I don't think eight or so y’alls are too many in an almost 400 pages book). I don't mind. People actually talk like that. Imagine that. Her social awkwardness sometimes causes Kara to act the way you don't expect. I, for one, liked that. Sometimes I want to read about a heroine who isn't the toughest (the thing that most often turns into I'll hit you in the face in most books anyway) or the most experienced around. These serial murders are Kara's first murder case.As for the case itself, a serial killer they named the Symbol Man is killing people, leaving arcane trail (and symbols on the bodies) that only Kara could see. I am glad the author let her deal with a couple of jerks at work right away and didn’t use that to drag it through the whole book. Of course some of her more experienced colleagues would be pissed she got the case.Overall, even though Mark of the Demon is definitely not a perfect book, as a beginning of a series it is not bad. Both our plane of existence and the demon world have so much to offer. The flaws this book has are not enough to stop me reading the next one."}, {"userName": "Penny", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/7463065-penny", "userReview": "It's ok, but I did't particularly liked it.This is not my kind of UF. The supernatural part was interesting, however that was such a small area of the book that it barely counts for nothing. The entire book is detective stuff which I really find not interesting at all. I am not into crime books and this was way more that than fantasy. I am debating whether to give the second installment a chance or not. I really don't want any more of that detective work."}, {"userName": "Katie(babs)", "userReviewDate": "May 29, 2009", "userURL": "http://www.goodreads.com/user/show/179852-katie-babs", "userReview": "I can certainly say that Mark of the Demon is a great novel for those who enjoy a suspenseful crime solving mystery. Diana has written a strong heroine with Louisiana Homicide Detective Kara Gillian who is able to summon demons. Even though Kara does have this ability it doesn’t overtake the story. Diana has a great way of balancing everything from how Kara handles her powers, to the way she investigates her latest case about a serial killer named the Symbol Man who carves up bodies in a sort of ritualistic killing where he can gain power for his own horrible means. The Symbol Man can also summon demons and soon he is matching wits with Kara. It becomes a cat and mouse game between them.Kara is not a pro when it comes to her powers of summoning. She still has a very long road ahead of her in controlling what type of demon she can summon. Kara makes a big mistake and screws up big time because instead of summoning a lesser powerful demon fourth-level demon, she calls for one of the most powerful and deadly types. His name is Rhyzkahl and is one of the Demonic lords who will not submit to any creature. He is not the type who should be summoned, because usually the one that summons him ends up dead. Kara is now in a whole heap of trouble because she expects to die by Rhyzkhal’s hand. Rhyzkhal doesn’t end her life, but quite the opposite. Rhy gives Kara the “little death” on the floor of her basement. And even though Kara is beyond frightened, because Rhy could tear off her head at any moment, the sex they have is mind blowing.I must say that I found this first intimate scene out of place between Rhyzkhal and Kara mainly because this demon is a bit unstable and kills without warning. Sorry, I don’t care if this bad boy is beyond gorgeous. I would be pissing my pants instead of wanting an orgasm. But he has an angelic beauty and Kara hasn’t gotten any in awhile. Perhaps he used a bit of mind voodoo on her?After Rhy has his wicked way with Kara, she has become a bit more wary of summoning any more demons. Her Aunt Tessa, who is a bit of a mystical eccentric, wants her niece to practice so she can become knowledgeable and grow her powers. But she also wants Kara to recognize her limits. Tessa has had the misfortune to have met Rhyzkhal in the past and that event is connected to the Symbol Man case in ways Kara could have never expected.Time is running out for Kara because there is a countdown in regards to what the Symbol Man has planned. This is the first time Kara is in charge of a homicide case, so she has everyone looking at her to solve it. The FBI has sent Special Agent Ryan Kristoff to help out. He treats Kara with disdain at first. Soon Ryan and Kara learn to appreciate each other’s merits and they become a team, each wanting to solve the Symbol Man case for their own reasons.Kara has a lot of issues to deal with such as her Aunt Tessa having a connection to one of the Symbol Man’s victims, Ryan who is too nosey for Kara’s tastes, especially when he questions her about her personal life and figures out what she is capable of doing. And let’s not forget that murderous sex god demon Rhyzkhal who has invaded Kara’s dreams and lays claim to her.This is one great mystery and Diana Rowland is a very welcomed author to the publishing world. She has you guessing who the killer is till the very end and I had no clue who the Symbol Man until the last few pages. There are twists and turns and great chemistry between Gillian and Ryan. As for Rhyzkahl and what he has planned for Kara, that is still up in the air and left open ended.Mark of the Demon is one book that is not to be missed."}, {"userName": "Carmel (Rabid Reads)", "userReviewDate": "Apr 16, 2014", "userURL": "http://www.goodreads.com/user/show/4561998-carmel-rabid-reads", "userReview": "I was drawn to the demon summoning aspect of this series because of its uniqueness within the Paranormal genre, and I also never miss an installment of Diana Rowland's WHITE TRASH ZOMBIES, so I knew that I'd make my way to KARA GILLIAN eventually. This story was way more serious than my previous experiences with this author's writing, but it was extra sexy as well which helped to even it out. At this point in time, I'm picking Ryan over Rhyzkahl, although neither has proven themselves yet, therefore things could go either way on the romance front. I liked Liv Anderson's narration, and have already purchased the second audiobook."}, {"userName": "Gary", "userReviewDate": "Aug 13, 2015", "userURL": "http://www.goodreads.com/user/show/43194437-gary", "userReview": "five stars all round what a great story everything I want in a book and it kept me guessing up until the end will be reading the rest of them if there like this one"}, {"userName": "Jess the Romanceaholic", "userReviewDate": "Mar 01, 2010", "userURL": "http://www.goodreads.com/user/show/2807469-jess-the-romanceaholic", "userReview": "It's a strange feeling for me to read a book that's more UF than PNR.. I've always been a Romance Reader -- that is, I typically want a strong romantic storyline in my novels, with a clear \"hero\" and \"heroine\", possibly some steam, definite monogamy, and a clear Happily Ever After (HEA)And yet, despite the fact that this book had none of those save the bit-o-steam, I adored it.Kara Gillian is definitely one of my new favorite heroines. She's kick-butt awesome (I mean, she is a cop y'all) without being all Xena-Warrior-Princess.. She's able to hold her own with the Good Ol' Boys she works with, but still shows just the right amount of vulnerability -- emotional and physical -- to keep her real without making her a pathetically delicate little flower always in need of saving.Rhyzkahl. Is awesome. *falls over* I absolutely adored how scary sexy cool he was and was so thrilled to see Diana Rowland throw in a nice tasty reminder that HELLO! HE'S A DEMON LORD! DON'T F*** WITH HIM! lol He kind of reminds me of an Anne Stuart hero *snickers* Y'all AS fans know what I'm talking about here -- the man (er.. demon) is not a traditional \"hero\" -- rather he's completely self-serving, and while he does have distinct moments of being super awesome to the heroine, you can NOT forget that he's not only a demon, but a demon lord and as such you shouldn't try to manage him or treat him as you would a human because \nhe will f*** you up\n!When I started the book, I was absolutely Team Rhyzkahl, but as I continued to read, I started to understand why so many people are Team Ryan (gah. I'm getting flashbacks to my Twilight days :P). Ryan is.. *dreamy sigh* Yeah. Ryan's great.I'm actually about a third of the way through the next one, Blood of the Demon.. It's going to KILL me waiting for Secrets of the Demon (the third book in the series) which is still being written. I typically try not to start a series until there are at least three or four books in already out because I'm not a very patient person. At all. I would recommend this one for fans of police procedurals (Law & Order and CSI fans for example) who also enjoy a healthy dose of the arcane, and don't mine a few mildly explicit love scenes thrown in for seasoning.A Solid 5 Stars."}, {"userName": "Marsha", "userReviewDate": "Feb 07, 2010", "userURL": "http://www.goodreads.com/user/show/1991207-marsha", "userReview": "I have to admit, I am a urban fantasy snob. I have authors I love (Patricia Briggs, Jeniene Frost and Rachel Caine) and those I just like. Lately, I have been restless and unfulfilled. My favorite authors and finalizing their next installments of novels and I have desperately looking for new material. Unfortunately the results have been less than stellar and have left me totally disillusioned. So, I decided to take a chance on Mark of the Demon and boy, was I pleasantly surprised. I loved Ms. Rowland's writing style and the quirkiness of the main character, Kara Gillian. It was refreshing to see that the Gillian was not only strong but embraced her vulnerabilities as well. For once in a very long time I did not know who the killer was until the very last minute and was totally shocked and surprised.I waited to order the second book, Blood of the Demon, until I knew for sure that I was going to like the book. Now, I cannot wait to get my hands on it! Thanks Ms. Rowland! I needed a good read and boy, did you supply it and then some."}, {"userName": "Catherine", "userReviewDate": "May 31, 2010", "userURL": "http://www.goodreads.com/user/show/3282244-catherine", "userReview": "This book started out a little slow for me, but once I got into it I couldn't put it down. I really liked the fact that Kara is just a regular girl (who's also a summoner, of course) who gets caught up in a crazy situation. Her normalness is one of the reasons you can't help but root for her. She's a cop, but she's not automatically a bad ass. She has to work out to battle the stomach bulge like most everybody else. She has a weakness for chocolate donuts and she doesn't have the best social life. She's just doing her best to catch criminals while trying to be fair.I found the demon lord, Rhyzkahl, to be an interesting character. I liked that the author made him dangerous and kept him dangerous. The author reminds us right alongside Kara that he'll make you regret it if you try to use him. He's not human and he lives by a whole different set of rules. He kind of reminded me of Raphael in Angels' Blood. He's not some one to toy with. I'm interested in seeing more of him in the next book. He won some cool points for what he did for Kara at the end of the book.I liked all the time spent on describing the different levels of demons and the difficulty summoning them. I appreciated that those facts seemed to get as much attention as the police facts. I found the explanation of the origins to be interesting. They're not demons in the sense of heaven and hell. They're from another world entirely. The sex scene in the beginning didn't really seem to fit with the rest of the story. It was kind of jarring. Kara seemed like an intelligent girl, but her actions didn't really fit with what I learned of her personality. She's scared for her life (with good reason) but suddenly that doesn't matter because she's turned on and ready to do it? It didn't seem like a very smooth transition from in mortal peril to hot sex.I thought the police stuff was very well done. I, of course, speak from the position of no personal knowledge of that sort of thing, but it seemed authentic. The crime scene and autopsy descriptions were interesting. I feared that I might become bored by the surplus of details about it, but the author kept me engaged. The one thing that I found really odd about the investigation had to do with the man who had a connection to the victims of the Symbol Man. Shouldn't she (as a well trained cop) have considered him a suspect long before she did?I liked that I didn't guess who the Symbol Man was. I enjoyed being surprised by it right alongside Kara. I found her relationship with Agent Ryan Kristoff a little odd. I didn't find him very interesting or compelling, but I thought it was really weird that Kara was totally fine with him basically turning into her roommate. You don't know this guy from Adam, why are you so accepting of him? Because I found him bland and a little irritating I hope that she doesn't get involved with him. I guess I'll find out as I read more of the series.I'm looking forward to reading more by this author and thought this was a great start to a new series."}, {"userName": "Lauren", "userReviewDate": "Jan 27, 2013", "userURL": "http://www.goodreads.com/user/show/4731410-lauren", "userReview": "Mark of the Demon4 StarsAlongside her day job as a detective with the Beaulac PD, Kara Gillian is also a demon summoner. Now her two vocations are about to collide when the Symbol Man, a dormant serial killer, returns with a vengeance and marks his victims with demonic symbols. Kara will need to use both her wits and her powers to combat a killer bent on accumulating power.Excellent amalgamation of of paranormal elements with forensic investigation. The serial killer plot is well-written with numerous twists and turns and several red-herrings cleverly woven into the story line. It is possible to follow the clues to the villain’s identity although my guess was incorrect. The story builds slowly but surely, and the climax is fast-paced and exciting. Kara is an engaging heroine. Socially awkward and professionally insecure, Kara nonetheless stands her ground with her chauvinistic male colleagues and works diligently toward solving the crimes. She does have one or two TSTL moments but that is not unexpected given her lack of experience.The two male leads are comprised of Ryan Kristoff, the suspicious FBI agent who gets off on the wrong foot with Kara, and Rhyzkhal, the seductive yet dangerous demon lord who has his own agenda and reasons for coming to Kara’s aid. At this juncture in the series, it is unclear where Kara’s relationships with these two very different men are going. As someone who really dislikes love triangles, I sincerely hope that they do not develop in this direction. My one issue with the writing is Rowland’s excessive and unnecessary use of vulgarity. This is not something that typically bothers me when it is used effectively and in appropriate context, but here is is simply out of place and jarring. Liv Anderson’s narration is adequate if somewhat slow, which led me to listen at 1.25 speed. Her tone and inflection are decent and her voices are quite distinct although there is a decided lack of Southern accent, which is a pity as the story is set in Louisiana. In sum, a promising beginning to the series and it will be interesting to see what happens next."}, {"userName": "Lady Heather ", "userReviewDate": "Nov 03, 2012", "userURL": "http://www.goodreads.com/user/show/2736715-lady-heather", "userReview": "WOW!Really enjoyed the Author's take on Demon's, summoning, and the 'honor' rules between Summoner and Demon.The characters, writing, and story were fantastic! RIGHT TO THE VERY END the Author had my full attention.Brilliant!Can't wait to read the next story in the series!"}, {"userName": "Marcela (BookaholicCat)", "userReviewDate": "Jan 06, 2011", "userURL": "http://www.goodreads.com/user/show/4015316-marcela-bookaholiccat", "userReview": "This review is also published at http://thebookaholiccat.com Detective Kara Gillian had just been promoted from the Property Crimes Division to the Violent Crimes Division at the Beaulac Police Department in Louisiana. Kara is also a Demon Summoner. She has the ability to open portals from our world to a parallel world where the demons reside. But these demons are not the same as described in religious contexts, these are not evil beings just different from us.She has been training for years under the tutelage of her aunt Tessa, who is also a Summoner. The ability to control the Arcane and Summon demons is inherited.Kara has been summoning unassisted by her aunt for a short period of time, and when trying to summon a lesser demon something goes very wrong and what comes through her portal is not a lesser demon but the most dangerous of all, a Demon Lord called Rhyzkahl. Demon Lords hate to be summoned, it’s an insult to their honor and when a summoning occurs it usually ends with the summoner being dead. Honor is everything for them. Kara knows this and knows she is going to die, but Rhyzkahl’s fury suddenly starts to abate and he doesn’t kill her, no, he gives her something else, something she haven’t got in a long time, an incredible sexy time.Rhyzkahl returns to his plane of existence leaving a very confused Kara. She cannot understand what just happened, the attraction she felt for him was something she had never experience before. Ok, he is dead look gorgeous, but he is a Demon Lord for god’s sake… but… maybe better to be ravished than being dead.The serial killer Symbol Man has returned after a hiatus of three years. Bodies are been found tortured and marked with the sigil he has used on his previous victims.Kara is surprised and very glad when her Capitan assigned her the case. She knows these murders have something to do with the arcane and with the summoning of demons, now she needs to solve the case.FBI gets involved in the case and a task force is formed. Special Agents Ryan Kristoff and Zack Garner are assigned to assist her with the case.Kara feels attracted to Ryan almost from the beginning making everything even more complicated.During Rhyzkahl summoning he created link with Kara and now he is visiting her in her dreams, making them very vivid and realistic. She likes his “visits”, she cannot deny it, but at the same time she is very confused with the situation. She knows he wants something from her, that is the only explanation, but she doesn’t fathom what it is.Things don’t get easier for Kara, she is trying to solve the case. She needs to prove to everybody that she is a capable Detective, while doing so she is also dealing with Rhyzkahl’s visits and his intentions. Further more she is also dealing with her attraction to Ryan.I had this book in my TBR list for a long time; I’m not sure why I didn’t read before (what was I thinking?) but I’m very glad I finally succumbed to its magic.I love Kara, she is a very real woman with the insecurities that go with the gender description and all. But at the same time she is a badass heroine. She loves being a summoner but it has its negative points, she is afraid to get close to people because of their reactions to her ability, making her a loner in dire need of friendship.Rhyzkahl is a powerful demon-sex on a stick combo with his own agenda. But he is more complex than what we can imagine. He shows little glimpses making me believe that there is more of him we don’t know. Maybe he even cares for Kara a little bit, with him is very difficult to know, but time would tell.I’m not sure about Ryan. He didn’t do much for me. He wants to know everything about Kara but he doesn’t share anything about him. And he has too many secrets for comfort.I want to see how Mrs. Rawland is going to develop him in future books. In my opinion he needs to be more alluring to be able to compete with Rhyzkahl.My final thought: Mark of the Demon is an amazing book. I loved the characters, the world, the dialogues, in general I really loved everything about it. Mark of the Demon literally had me glued to its pages for hours until I finished it.This series had become one of my favorites Urban Fantasy Series. And if you love this genre you have to add it to your TBR now and please don’t do what I did, don’t wait, read it ASAP."}, {"userName": "Katie Michaels", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/4669344-katie-michaels", "userReview": "I’m always on the hunt for an urban fantasy series to love and this one has potential. While I’m not ready to call it love yet, I will say that it had some really good things going for it and I definitely liked it enough to tackle book two in the series.Our heroine is Kara Gillian. She is a cop who summons demons in her spare time. That doesn’t make her a bad person. Demons aren’t intrinsically evil; they’re just powerful beings from a different dimension. But most people don’t even know they exist. Anyway, Kara has just been promoted to a homicide detective and the first case she lands is one she has been studying for years.A serial killer, known as the Symbol Man, has started killing again for the first time after a three year break. The last time he killed, Kara was new to the force and only caught a glimpse of the arcane magic hovering around the victim’s body. Now, she can get a closer look to determine whether magic plays a part in the horrific crimes. Sure enough, it does.The story follows Kara as she works to unravel who the killer is and why he is torturing and killing his victims the way he does. In the meantime, she is dealing with the other members of a newly formed task force –and curious FBI agent Ryan Kristoff. Plus, her summoning activities are catching up with her in a big way. You see, what should have been a summoning for a lower level demon ended with a demon lord in her basement. Rhyzkahl is terrifying –and beautiful. And for some incomprehensible reasons, Kara has sex with him, making a big mess, even bigger.So there is a killer carving up homeless people. There is an FBI agent nosing into her secrets. And there is an insanely powerful demon haunting her dreams and getting her off. No one can say this book is boring. What they can say is that other than her bizarre lapse in judgement in sleeping with Rhyzkahl, our heroine is smart and tough and generally pretty likeable. I mean, it’s nice to read a book about a woman who is pushing 30, downs a half dozen chocolate donuts, and then actually has to worry about them making her sick or fat. She isn’t perfect, beautiful, or insanely powerful, which is actually kind of a nice change for the genre.The mystery is actually quite good. I didn’t figure it out, but I still felt like it made sense. I was intrigued by Ryan, despite his inauspicious introduction. But Rhyzkahl… I had mixed feelings, especially when it came to the sex. Don’t get me wrong, I like sex in my urban fantasy. But the sexy times between him and Kara felt off. We get a pseudo-explanation for his motives in the end, but it was still didn’t quite fit. The fact that there was some sex in the book does give me hope, though, that there will be romance in later installments. (Here’s hoping!)That one thing aside, I thought the book was well done. The word-building is interesting and easy to understand. The plot moves along nicely, and the pacing picks up once all of the players are established. I like Kara and I am interested in what will happen with her next."}, {"userName": "Cathy ", "userReviewDate": "Jul 02, 2009", "userURL": "http://www.goodreads.com/user/show/1526945-cathy", "userReview": "It was a terrific story. I couldn't put it down, I stayed up until 4:00 a.m to finish it and I even had to go downstairs to grab book two and read the back cover even though I knew it would disturb the dogs. Thank goodness I saw some friends' reviews here and loved the authors new book My Life as A White Trash Zombie (even enough the style of that is completely different, that one is sarcastic and funny with a lot of heart). This cover is completely misleading, a major marketing error. I'd seen the book at the library several times and passed it over because I thought it was a paranormal romance. I almost missed out on something really terrific.So it's not a romance at all, it's really a paranormal police procedural. If you like CSI or cop dramas, you'll like this. It's impossible not to like Kara, she's smart and determined, with  enough sass to stand up to her occasionally harassing fellow police officers. I really enjoyed the combination of watching Kara unravel the case and how the paranormal elements were explained and woven into the story. The real world and imagined world were seamlessly intertwined and it worked beautifully. I never once rolled my eyes or questioned the logic or had one snarky comment, that rarely happens! The only thing that stood out to me was the sexy scene at the beginning, which was really out of place for Kara's character as it was explained, but I understand because it was necessary to set the dynamic between her and the demon. So what else? I liked the way the story was revealed in layers, both with the case and with the characters. It was a real page turner, constantly kept my interest peaked. As for the case, there were hints but the reveal was actually a surprise, another rarity for me. There were several surprises and there are also things that were not revealed yet, like why was Ryan so strong when he knocked down the door and what did Rhyzkahl mean about him? My only content complaint was that there should have been more people of color, especially among the cops. Or maybe I'm wrong, Rowland is from the south, maybe where she lives somehow there isn't the mixed population I've come to expect from a post-Katrina town, but from what I've read most places are pretty integrated so having all of the characters except one be white seemed odd to me. Obviously a minor point, I'm just sensitive to it lately. Anyway, it was great, just the kind of book I really like. I do actually have to go to sleep now, but I will be starting book two tomorrow. And a big thank you goes out to the librarian who found it in the back for me when it didn't show up on the reserve cart like it was supposed to before the holiday weekend, I'd be so sad if I had to wait two more days to read the next book!"}, {"userName": "Kelly H. (Maybedog)", "userReviewDate": "Apr 04, 2012", "userURL": "http://www.goodreads.com/user/show/1059653-kelly-h-maybedog", "userReview": "[She was essentially being raped and then she was able to get him to let her go. He said he wouldn't force her, but he would still like to have sex with her. She knew he was very bad, but she said yes because even though the end result was the same, she now had a choice. (hide spoiler)]"}, {"userName": "Bonnie", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/5136858-bonnie", "userReview": "‘Mark of the Demon’ is the first in Diana Rowland’s Kara Gillian Series. Kara Gillian is a newbie Detective in small town Beaulac, Louisiana. She’s also a skilled summoner of demons who uses her occult skills in her cases. She’s put in charge of a case of recent murders that appear to be the same killer, The Symbol Man, who killed 13 people but hadn’t killed anyone in over 3 years. All of the victims show evidence of being killed for demonic purposes so Kara attempts to summon a demon to assist her but ends up summoning something else: a powerful Demonic Lord, Rhyzkahl.I am SO glad that I decided to read this series. For those of you who don’t know, I started out a huge mystery/thriller fan and that’s about all I read. Then I discovered urban fantasy and realized I loved that as well. Well this series combined by two favorites. This had demons, crazy serial killers, hot cops, crazy CSI shit, and a demonic lord to boot… right up my alley. I don’t typically read back to back books in a series, I like to mix it up a bit every now and then, but I’m going straight to book number 2."}, {"userName": "Bunnycore", "userReviewDate": "Dec 13, 2016", "userURL": "http://www.goodreads.com/user/show/50919516-bunnycore", "userReview": "I reserve the right to revise my last 3 stars. I reread this book and I found that I loved it the second time. I feel there was so much going on that it became interesting. It starts out slow and then begins to pick up the pace. I love that there is some mystery going on in this book. I love that there is a little love triangle angst, I feel that it gave this book some substance. That became interesting. the big question that this little bunny has... who the eff is Kristof?I guess I will, in fact, be readin the second book because why? I have to know!"}, {"userName": "İlkim", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/5318323-lkim", "userReview": "It was really a good start. I loved this new world and I'm happy the story contains a lot of mystery. Definitely I'll be reading the next ones. Çok ilginç ve güzel geldi. Paranormal olduğu kadar polisiye de barındırdığı için cidden beğendim. Serinin sonraki kitabına geçmeden durmam mümkün değil."}, {"userName": "Inara", "userReviewDate": "Feb 10, 2009", "userURL": "http://www.goodreads.com/user/show/32494-inara", "userReview": "Actually 4,5 stars!After the death of her parents Kara Gillian was raised by her aunt. Kara´s family is gifted with the ability of demon summoning and her aunt and Kara herself have inherited this rare power too. So her aunt becomes her mentor and Kara is slowly rising in rank to be able to summon a twelfth level demon which is quasi her demon summonig diploma.But one night during her summoning something goes awry, not the expected low level demon appears but Rhyzkahl, a demon lord. Nobody can summon a demon lord and survive this experience and so Kara prepares to die. But to her big surprise the devastingly beautiful and utterly tempting demon lord seduces her – he even gives her the choice to say no. (So no rape here but still the question remains would he have taken no for an answer?). Kara can´t resist his advances having lived alone for a long time (demon summoning is a lonely business) but afterwards she´s not so sure anymore if she just didn´t make a huge mistake because Ryzkahl is coaxing her to call him anytime she wants. This leaves a feeling of unease in Kara, why would this powerful and beautiful demon lord wanted to be called by her – an average looking woman with a bit too much weight on her hips?But life goes on and Kara who is a police officer at day gets promoted to homicide detective, a goal she wanted to achieve for a long time. Her first case are the unsolved \"Symbol Man\" kills, a serial killer who killed many people some years ago but had never been captured and kept a low profile for the last three years. Now it seems he´s back and when Kara detects fading arcane energies around a corpse she knows there is much more at stake not just only cruel murders. Her life doesn´t get easier when FBI-agent Ryan Kristoff joins her team who of course has no idea about demons…I really liked this book although I could have done without the detailed forensic descriptions I admit! It was suspenseful and I didn´t figure out the villain till the end (okay I never do, I´m a bit slow here) and I liked Kara although I found some of her behaviour quite questionable (keyword: burglar)! She´s not one of these perfect and beautiful heroines every men starts salivating just by taking a look at her. She worked hard to achieve her goal and has to deal with resentful co-workers who don´t like her upgrade to homicide detective. I really felt with her when she admitted to herself that Ryzkahl may be using her for his own purposes and felt her twinge of disappointment. Yes, he´s a demon and she knew not to trust him but nevertheless she got attached to him and there was this tiny hope that maybe he´d care for her in some way too. I´m looking forward to the next book in the series because I´m just too curious how this \"relationship\" will develop and what role her FBI-partner will play in her future. I liked Ryzkahl too, he´s a demon with his own honor code and not tamed by tender feelings for his summoner. He´s not necessary evil but has his own agenda. I found Ryan in comparison a bit boring but that´s just me, I hopefully will find out more in the second book of this series \"Blood of the Demon\" which is due February 2010.Note: This book is written in first person!"}, {"userName": "Fangs for the Fantasy", "userReviewDate": "Jan 30, 2012", "userURL": "http://www.goodreads.com/user/show/5912634-fangs-for-the-fantasy", "userReview": "Kara Gillian is a police detective in Beaulac, Louisiana and has finally had her big break - she’s moving from property crimes to homicide - and her first case is a doozey - the Symbol Man, a serial killer who has been inactive for years has restarted his killings. And Kara is in charge of solving the case - not bad for her first murder case.Of course, she has advantages. Not only has she read all the files on the Symbol Man killings, but she also has her own Arcane connections. Kara Gillian is a summoner - as in, she summons demons. of course that doesn’t simplify anything, especially when she comes to the attention of the Demon Lord Rhyzkahl.But then, it seems there is something arcane behind the killings and she has to tread the delicate balance between using her magic to discover the killer and what he’s up to, while at the same time keeping her case reality-based enough not to alert the police.Reading this book, it is really clear that Rowland has a background in policing. The victims of the Symbol Man are drug addicts, drunks and homeless. This means they constitute a class of citizenry that are oft overlooked. Rowland makes it a point of saying repeatedly that this is why they were chosen and had the Symbol Man chosen someone from a different class location, that this case would be getting a lot more attention from both the higher up and the media. It is one of the better comments we have seen about class, with society’s callous contempt being starkly and unmercifully underlined. And, as in My Life as a White Trash Zombie, these issues are presented clearly and starkly, but without lecturing. It is however, disturbing that when questioned by Lord Rhyzkahl as to why she is working so hard to save people that she would not invite into her home, her only response is that this is the right thing to do. It troubles me that Rowland went to such great lengths to affirm the neglect of the police department but did not take this opportunity to affirm the humanity and self worth of those who were essentially the prey of the Symbol Man.This story takes place in Louisiana and as such the population demographics necessitates the inclusion of people of colour. Rowland does take care to do so but unfortunately they only appear as the victims of the Symbol Man, which makes them, prostitutes, homeless, drug addicts etc,. This does not count as inclusion and in fact works to further stigmatize people of colour. Read More"}, {"userName": "Kathryn ", "userReviewDate": "Jul 29, 2010", "userURL": "http://www.goodreads.com/user/show/3378835-kathryn", "userReview": "[I mean, before I hit page 100, there was a love scene between Kara and the Demon Lord that I was sure it was going to make Kara all lovey-dovey for the Demon Lord and ruin the whole investigation!  (hide spoiler)]"}, {"userName": "mlady_rebecca", "userReviewDate": "Aug 08, 2011", "userURL": "http://www.goodreads.com/user/show/732709-mlady-rebecca", "userReview": "I absolutely loved this one. And I was reluctant to pick it up after my last urban fantasy \"demon\" book was horrible (2 stars). For that matter, the last book I picked up with a Louisiana setting was horrible (1 star), as well. But that's neither here nor there.Kara is a detective in a small town Louisiana police department. Until recently she was doing property crime, but she just got promoted to homicide. Her first case is the reopening of a serial killer case which had been dormant for the past three years. A serial killer case she believes is demonic in origin.Kara also happens to be a type of psychic called a summoner. Like her Aunt before her, she can summon demons. In this instance, the demons are creatures from another realm, no Christian good/evil implied. As the book opens Kara is summoning a 12th level demon, supposedly the highest level safe to summon. This is a closed world. Kara keeps herself fairly isolated physically and emotionally because she can't share her arcane side with anyone but her aunt, who was her mentor. The ability to be a summoner runs in families. But the greater New Orleans area seems to be a sort of hot spot for the arcane, so despite the fact that there are very few summoners world wide (she says about 100), more than a few are nearby.There are two potential love interests developing during this book, but this is urban fantasy, so don't expect a HEA. The book is more heavily mystery (the serial killer case + an issue Kara had with a summoning), as opposed to romance. The mystery wasn't obvious. I didn't figure it out before Kara did.Hmmm, not much else to say. Once I got into the meat of the book it was impossible to put down. I missed out on several hours of sleep last night, but it was well worth it. Looking for book 2 right away."}, {"userName": "All Things Urban Fantasy", "userReviewDate": "Sep 11, 2010", "userURL": "http://www.goodreads.com/user/show/2732683-all-things-urban-fantasy", "userReview": "Review courtesy of All Things Urban FantasyMARK OF THE DEMON reads like Dexter meets the Rachel Morgan series by Kim Harrison (Dexter's sister Debra reminds me a lot of Kara). That's a dangerously good combination in my opinion. I foolishly read the second book in this series first so I did have a little more information going than I should have, but I still found the mystery gripping, the police investigation authentic, the demon mythology extremely well thought out and creative, and the romance seductive and scary in turn. On her website, Diana Rowland describes herself as an author of urban fantasy/police procedurals, which is a perfect description of this series. Having worked as a street cop, a detective, a computer forensics specialist, a crime scene investigator, and a morgue assistant give her a wealth of knowledge to draw from in creating a brilliantly believable character in Homicide Detective Kara Gillian. Where she got her knowledge of demonology is anyone's guess, but it’s every bit as detailed and plausible.Rowland manages to weave together two very separate types of stories: the investigation and manhunt for a serial killer, and the uneasy romance/alliance between a demon summoner and the criminally handsome demonic lord she unwittingly summons. One a gritty and grim police procedural, and the other a supernatural and sensual and urban fantasy. The two could have felt very disconnected and yet the blended seamlessly. I already know the sequel (Blood of the Demon) is every bit as good as the this first book, and the third book (Secrets of the Demon) due out on January 4, 2011 is one of my most anticipated titles of next year.Sexual Content: A few moderately graphic sex scenes."}], "description": "Cop and conjurer of demons, she's a woman in danger of losing control to a power that could kill....Why me? Why now? That's what Beaulac, Louisiana, detective Kara Gillian was asking herself when an angelic creature named Rhyzkahl unexpectedly appeared during a routine summoning. Kara was hoping to use her occult skills to catch a serial killer, but never had she conjured anything like this unearthly beautiful and unspeakably powerful being whose very touch set off exquisite new dimensions of pleasure. But can she enlist his aid in helping her stop a killer who's already claimed the lives'and souls'of thirteen people? And should she? The Symbol Man is a nightmare that the city thought had ended three years ago. Now he's back for an encore and leaving every indication on the flesh of his victims that he, too, is well versed in demonic lore.Kara may be the only cop on Beaulac's small force able to stop the killer, but it is her first homicide case. Yet with Rhyzkahl haunting her dreams, and a handsome yet disapproving FBI agent dogging her waking footsteps, she may be in way over her head...", "title": "Mark of the Demon\n      \n          (Kara Gillian #1)", "url": "https://www.goodreads.com/book/show/6048518.Mark_of_the_Demon__Kara_Gillian___1_", "average": 3.82, "cover": "https://images.gr-assets.com/books/1390961684l/6048518.jpg", "reviews": 781, "authors": [{"url": "https://www.goodreads.com/author/show/852078.Diana_Rowland", "name": "Diana Rowland"}], "type": ["Fantasy", "Fantasy", "Paranormal", "Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/6048518-mark-of-the-demon", "http://www.goodreads.com/book/show/6583289-mark-of-the-demon", "http://www.goodreads.com/book/show/18075904-mark-of-the-demon", "http://www.goodreads.com/book/show/9640626-my-life-as-a-white-trash-zombie", "http://www.goodreads.com/book/show/6540270-blood-of-the-demon", "http://www.goodreads.com/book/show/8107779-secrets-of-the-demon", "http://www.goodreads.com/book/show/11019938-sins-of-the-demon", "http://www.goodreads.com/book/show/12766833-even-white-trash-zombies-get-the-blues", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}