{"ratings": 342, "userreviews": [{"userName": "Emily Scheinman", "userReviewDate": "Jul 31, 2016", "userURL": "http://www.goodreads.com/user/show/4427182-emily-scheinman", "userReview": "My favorite bilingual picture book this season."}, {"userName": "Rebecca Gomez", "userReviewDate": "Nov 05, 2016", "userURL": "http://www.goodreads.com/user/show/22527440-rebecca-gomez", "userReview": "This book is perfecto. A perfect bilingual picture book that tells a simple story. Lovely illustrations too! This book would be a perfect way to introduce a child to the Spanish language."}, {"userName": "Banny Kirsten Marie Reviews", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/68664225-banny-kirsten-marie-reviews", "userReview": "First of all yes i am awake... No you don't have to remind me its almost one in the morning... Yes i have enough energy to write this review...................... Ahhh i'm awake, i'm awake you don't have to yell...................... Ahh sorry gosh you don't have to get nasty about it i'm just a tired girl trying to write a review..... Fine i won't waste anymore of your time here goes nothing................. I'm not asleep....Okay just had a good cup of coffee and i am now ready to type... Marta big and small by Jen Arena was a great educational book for younger kids seeking to learn a few easy words in spanish such as small, big, tasty, and many more. I don't know a whole lot of spanish so i was glad to add onto my vocabulary. This book was cute and every spanish teacher in the world should own it. This is a fun way to modivate children because pictures always seem to catch their attention. The story was not very long so i cannot realy write a full review like i do for other picture boks but i can say that this book gets four stars for the story.The pictures did not catch my attention in ways that they should have. They were not poorly done but they could have used some work. Yes i know what your thinking...... In every review that you have read by me the pictures have always been judged so harshly.... Thats because in my opinion the pictures are the story and if they are not done perfectly then it drives me insane so the pictures get a one star rateing. Don't look so dissapointed... Oops my phone is ringing...... One second... Hello... No mom i don't need anything from walmart.... I am kind of in the middle of a review....Don't yell at me...... Mom i have to hang up now.... Yes i took my vitamin pills... Bye mom... Yes love you to..... That was my mom she always seems to butt in whenever i am giveing my reviews... Anyways five out of five stars are rewarded to Marta big and small and this story is reccomended to everyone.My Rateing 5/5Hey readers you may have noticed that my review was thrown off topic a little bit this time... Well if any of you have read my Wishing Foxes review then you know i was pretty angry with the whole story concept and was not much fun but i thought i would make up for it in this review.... Yes i know my sense of humor is poor but hey i am practicing you gotta give me credit for that... Until next time! All of you have a GREAT WEEKEND!  -Love Always Britney Kirsten Argueta Reviews"}, {"userName": "orangerful", "userReviewDate": "Apr 25, 2017", "userURL": "http://www.goodreads.com/user/show/314247-orangerful", "userReview": "This book quickly became a staple in my PreK outreach visits and on regular rotation for my storytimes. Young children love figuring out the meaning of the Spanish words and then we practice saying them together. They all get VERY concerned when the snake shows up and it is hilarious to me that they really think I am going to read them a story about a girl being eaten! You can hear the sigh of relief when I reveal she is hiding in the tree."}, {"userName": "Niki Marion", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/26191060-niki-marion", "userReview": "❤️A bilingual book that presumes an English-speaking reader but doesn't condescend to that reader or diminish the Spanish words that it teaches. It's also a book of opposites and a book of animals, so this picturebook is pulling some major triple duty. And to top it all off, the crowning line of this book highlights cleverness as an inherent quality trait of girls. Hermiones of the world, get this book on your radar."}, {"userName": "The Library Lady", "userReviewDate": "Dec 08, 2016", "userURL": "http://www.goodreads.com/user/show/288297-the-library-lady", "userReview": "This would get 4.5 or even 4.75 from me. The art is bold and active, and I can easily see using this in story time. My many Spanish speaking nannies will love hearing me use the Spanish animal names and adjectives, and the animal movements will be perfect for a bit of kids yoga. I think I need a copy of this for my \"reading room\" collection. Gracias, Jen Arena!"}, {"userName": "Danielle", "userReviewDate": "Sep 03, 2016", "userURL": "http://www.goodreads.com/user/show/6868711-danielle", "userReview": "A winning combination of opposites, English/Spanish vocabulary, animals, and one clever little girl! Charmed me."}, {"userName": "Angie", "userReviewDate": "Oct 20, 2016", "userURL": "http://www.goodreads.com/user/show/2176931-angie", "userReview": "OppositesJungle themeSimple colorful imagesEnglish book with sprinkled-SpanishIngenious Latina girl"}, {"userName": "Patrick", "userReviewDate": "Aug 28, 2016", "userURL": "http://www.goodreads.com/user/show/2037487-patrick", "userReview": "I loved that this picture book had a Latina character as the girl in the story. I also liked that it taught the concept of opposites while also teaching Spanish words at the same time."}, {"userName": "Alyisha", "userReviewDate": "Sep 02, 2016", "userURL": "http://www.goodreads.com/user/show/5460502-alyisha", "userReview": "Cute bilingual book that teaches simple Spanish vocabulary...with a surprise girl power message at the end! :)"}, {"userName": "Casandria", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/746715-casandria", "userReview": "A great bilingual storytime book about opposites!"}, {"userName": "Sarah", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/1093264-sarah", "userReview": "One of my go-to read-alouds for Storytime, particularly for talking about opposites and different sizes. The intermingling of English and Spanish is great for a bilingual audience (or an audience interested in learning new Spanish words)."}, {"userName": "Lori", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/5558886-lori", "userReview": "a nice one for perspective"}, {"userName": "Emily", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/7607436-emily", "userReview": "In this wonderful story, we meet an ordinary girl named Marta who meets and compares herself to an elephant, horse, turtle, lion, rabbit, and snake--which leads to a funny discovery and escape. Throughout the book we are taught new Spanish words, both the animals and adjectives, with the translations in the back of the book. A delight to read to primary grades and perfect for storytime with an ECE, Kinder, or young first grade class. A new favorite with simple text structure that will be repeated time and time again."}, {"userName": "Katherine", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/5354673-katherine", "userReview": "An adorable bilingual picture book about Marta, who explores the jungle and compares herself to animals. I can guaruntee I'll be using this in storytime.I've read criticisms before that make the argument that presenting two languages in two different fonts can be problematic, especially when one of those fonts is difficult to read. While the Spanish words in Arena's text are in a different font, they're also legible. There aren't full sentences either; the text more seems to be an opportunity to introduce Spanish words to children who might not otherwise be hearing them."}, {"userName": "Angela", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/6868015-angela", "userReview": "Marta is many different things, depending on your point of view. She's a clever girl and this is a very clever book. And most enjoyable. Amazing illustrations. Love the blend of English and Spanish."}, {"userName": "Mary", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/3935747-mary", "userReview": "A high energy bilingual preschool concept book that teaches basic vocabulary about animals and opposites in English and Spanish. The vibrant illustrations make Marta's joy literally leap off the pages. An engaging picture book that will leave readers wanting more Marta."}, {"userName": "Katherine", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/21734371-katherine", "userReview": "Awesome sauce! An English book that introduces Spanish in a very clever and adorable way! I can't wait to read this aloud. Though I might need to brush up on my pronunciation (of course two of my Spanish-speaking little friends will be sure to correct me)."}, {"userName": "Mandy Robek", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/22112628-mandy-robek", "userReview": "An interesting way to support bilingual students and their friends. I learned many Spanish words myself and in context with picture support I felt successful."}, {"userName": "Dana", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/5298781-dana", "userReview": "Spanish and English in a cute opposites book filled with animals."}, {"userName": "Emily", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/4105905-emily", "userReview": "great for international story time"}, {"userName": "Robin", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/1271940-robin", "userReview": "Completely appealing story and perfect for storytime sharing! Love the illustrations, and Marta, la nina ingeniosa, and the effortless flow between Spanish and English."}, {"userName": "Mary", "userReviewDate": "Aug 25, 2016", "userURL": "http://www.goodreads.com/user/show/23157878-mary", "userReview": "Perfect for a bilingual size or opposite-themed Storytime for toddlers/preschoolers."}, {"userName": "Chelsea Kirkland", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/63671859-chelsea-kirkland", "userReview": "-bilingual- in English with Spanish vocabulary- would be easy to read to non-Spanish speakers and have them understand.-Ms Tea's crowd pleasers"}, {"userName": "Rachel", "userReviewDate": "May 08, 2017", "userURL": "http://www.goodreads.com/user/show/5817622-rachel", "userReview": "Lovely incorporation of Spanish & English words - great for bilingual storytimes."}, {"userName": "Nanci Booher", "userReviewDate": "Sep 04, 2016", "userURL": "http://www.goodreads.com/user/show/6001593-nanci-booher", "userReview": "Marta is a smart girl. she is also loud, big, and small...or ruidosa, grande y pequena. What a great story to introduce some spanish to the youngest of readers."}, {"userName": "Melissa", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/376192-melissa", "userReview": "Great for beginning to teach Spanish for kids!"}, {"userName": "Amy Chesman", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/23867872-amy-chesman", "userReview": "Wonderful storytime selection. Simple illustrations, opposites, and spanish language all in one!"}, {"userName": "charlene.librarian", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/17372885-charlene-librarian", "userReview": "Spanish and English in spare text with appealing large illustration."}, {"userName": "Rachel", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/647191-rachel", "userReview": "Fun to follow Martha's adventures, good compare and contrast as well as a natural inclusion of Spanish words."}], "description": "Marta is una niña, an ordinary girl . . . with some extraordinary animal friends!As Marta explores the jungle, she knows she's bigger than a bug, smaller than an elephant, and faster than a turtle. But then she meets the snake, who thinks Marta is sabrosa—tasty, very tasty! But Marta is ingeniosa, a very clever girl, and she outsmarts the snake with hilarious results.With simple Spanish and a glossary at the end, this fun read-aloud picture book teaches little ones to identify opposites and animals and learn new words.", "title": "Marta! Big & Small", "url": "http://www.goodreads.com/book/show/25688982-marta-big-small", "average": 4.03, "cover": "https://images.gr-assets.com/books/1448969259l/25688982.jpg", "reviews": 95, "authors": [{"url": "https://www.goodreads.com/author/show/3160208.Jen_Arena", "name": "Jen  Arena"}, {"url": "https://www.goodreads.com/author/show/4115946.Angela_Dominguez", "name": "Angela  Dominguez"}], "type": ["Childrens", "European Literature", "Animals", "Childrens", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/25688982-marta-big-small", "http://www.goodreads.com/book/show/18866869-100-snowmen", "http://www.goodreads.com/book/show/26109088-lady-liberty-s-holiday", "http://www.goodreads.com/book/show/20454073-besos-for-baby", "http://www.goodreads.com/book/show/31852016-sleep-tight-snow-white"]}