{"ratings": 657, "userreviews": [{"userName": "8o's", "userReviewDate": "Aug 10, 2015", "userURL": "http://www.goodreads.com/user/show/7073792-8o-s", "userReview": "I can't decide if I like this book or not. I think my mind is still sleeping after reading 45 chapters of Mr. Mogul. If I had a time machine I would go back and close the book as soon as I saw it was 45 chapters. The concept was great. The main heroine was great, the hero promising, the delivery...not so much. Actually the hero was probably great but 42 chapters of pointless background fluff kind of made him forgettable. I kept reading thinking it was going to get better but after reading 20 breakfast scenes, I should have just given up. I like details but sometimes there is such a thing as too much detail. And pointless friends. And detailing those pointless friends. And then to top it off the book ends in a happily for now type of cliffhanger which tells the reader to read more about them in the next book. OMG no no no. I can't take anymore continuation series. Is it too much to ask for a standalone HEA? This book would be a five star if someone takes a pair of scissors and cuts out the boring fluff and just concentrates on Andy and William."}, {"userName": "Allie", "userReviewDate": "Sep 08, 2015", "userURL": "http://www.goodreads.com/user/show/30024685-allie", "userReview": "I'm confused... What did I just read?!? Why was that book so long? Why didn't anyone edit it? I think I liked it because I kept reading it... But why were they fighting for so long about the same thing?!? What was that epilogue that wasn't a real epilogue?!? What even happened at the end?!? What was the purpose of all that build up for no real resolution at the end?!? I don't get it!!!"}, {"userName": "Marguerita", "userReviewDate": "Aug 18, 2015", "userURL": "http://www.goodreads.com/user/show/4290857-marguerita", "userReview": "After passing up this book twice, I finally decided to give it a try and read it. From the start, I had a hard to getting into it. Firstly, I don't understand why he was so mean from the beginning and continued it. Second, the chick had a big chip on her shoulder I wish she could have lighten up more. Thirdly, for me, the book needed to be edited. I felt it could have been easier to read if the sentences were condensed and didn't repeat the same thing one after the other. Lastly, the ending just threw me, why does it need to be another book? This could easily be one. At this point I don't know if I liked the book or disliked it."}, {"userName": "Catherine", "userReviewDate": "Sep 03, 2015", "userURL": "http://www.goodreads.com/user/show/12245213-catherine", "userReview": "DNFThis book was so badly written that I could not finish it."}, {"userName": "Aiswarya Nayani", "userReviewDate": "Jul 16, 2015", "userURL": "http://www.goodreads.com/user/show/44317071-aiswarya-nayani", "userReview": "wonderful story!! author did a did job building Andy's character. William is kinda arrogant billionaire but we eventually fall in love with him too :) storyline is great too."}, {"userName": "sarah", "userReviewDate": "Apr 06, 2016", "userURL": "http://www.goodreads.com/user/show/49045770-sarah", "userReview": "Ugh. Rarely do I hate a book enough to DNF it. (Usually it's just a lack of motivation.)But whoa. This book is spectacularly unrealistic. Not to mention as boring as watching a snail crawl a mile. My main problems with this book are:1- The main character. Whatever her name was is supposed to be an older twenty-something year-old / thirty year old, but she acts so unprofessional. She is always late to work, whines about everything, and worst-- is rude to her boss. (Well, technically not her boss- but his goddamn SISTER is her boss, so she should at least be careful around him.)\" …shook my head in disbelief and got out of the room before things got weirder for me. As I finally took myself out of the current situation I was in, I recounted on what I just did today. First, I had a make-out session with the man I thought I loathed and then I slapped him “accidentally.” Also, I rudely asked him to get out of my father’s hospital room, where he clearly overstepped a boundary. And now, I’m taking the responsibility of taking care of him because he is both sick and drunk and he is my boss’s brother. I didn’t know it would take a day to make life shift so quickly. And I almost forgot, I think I just flirted with him. Yeah, because agreeing to sleep with him is a form of flirting. I felt the stupidity of my actions. Why do I feel so attuned to his presence? Do I really hate him in the first place? And I did admit to Terry that I had a thing for him. What is happening to me?\"Just no. But, technically, in her defense (which she does not deserve), the main hero is pretty uncooperative too. I guess. He doesn't really have a personality besides the generic Mr. I-am-the-hottest-piece-of-ass-around-and-also-pretty-rich stereotype. Yeah.How about no."}, {"userName": "Christine", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/10480068-christine", "userReview": "The verbiage was so awkward. The editing needs A LOT of work. Great premise, but poor execution.The heroine complained about every customer. Nothing was going to make her happy. She was not likable."}, {"userName": "Evelin Guzman", "userReviewDate": "Jul 13, 2015", "userURL": "http://www.goodreads.com/user/show/44748531-evelin-guzman", "userReview": "I need help ... I'm new to this and I've added a bunch of books to my library but I can't seem to read them ??"}, {"userName": "Tasya Camila", "userReviewDate": "Jul 08, 2015", "userURL": "http://www.goodreads.com/user/show/42124141-tasya-camila", "userReview": "I love this book!! I cried, i laughed, i sobbed like a child! This book is not too heavy nor too light to read, I enjoy myself while reading this. I definitely will buy this book!"}, {"userName": "Shani", "userReviewDate": "Sep 13, 2015", "userURL": "http://www.goodreads.com/user/show/12490346-shani", "userReview": "I DID NOT FINISH this free book. Hands down - most poorly written book I've ever attempted to read. Where was the editing? What the hell was the point of this story - it made no sense. I'm not even sure editing would have done this book any good. I kept reading hoping I could get over the poor writing and lack of editing but as I continued to read I was getting more and more angry that his book was so highly rated. I hated both of the characters and could have cared less about them. Sorry to be so harsh but that just how I feel."}, {"userName": "Zhaina Zanica", "userReviewDate": "May 07, 2016", "userURL": "http://www.goodreads.com/user/show/55631279-zhaina-zanica", "userReview": "Amazing book! Gave me so much feels. It's nice that the author, Mel Ryle, made it like a mature story, and at the same time readable for young readers like me. It's one of the first books I've ever read on Wattpad, and I couldn't be happier that it reached the success that it always deserved. Really a must read book!"}, {"userName": "Ani", "userReviewDate": "Dec 27, 2016", "userURL": "http://www.goodreads.com/user/show/21811723-ani", "userReview": "Didn't like it... The heroine is just unprofessional, is always complaining about something, is extremely rude to her boss, is always late.... and to top it all the book is absolutely unrealistic, let's just say that the heroine will earn forty-five thousand a month to be an assistant... LOL and is hired by the boss's sister just because"}, {"userName": "Annika", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/55666496-annika", "userReview": "DNF - or more like \"kept skipping hoping things would improve - they did not.\"Reads like fanfiction of ...something. Weak, clumsy writing, telling not showing. Characters felt like cardboard cutouts who, on top of that, act irritatingly juvenile. Weird and unrealistic motivations. Didn't want to waste more of my time on that."}, {"userName": "Sayara", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/36781696-sayara", "userReview": "just a simple rom-com , actually not that much, a simple and quick read to keep you occupied . Dont expect much and you wont be disappointed......"}, {"userName": "Nara", "userReviewDate": "Sep 28, 2015", "userURL": "http://www.goodreads.com/user/show/31975307-nara", "userReview": "Nice one, although this is the kind of romance novel I read back then when I haven't notice erotica yet, but this is sweeeeeeet.... kinda long story with looping plot over and over again, but really, I wasn't get bored with this novel. at all. and I dont know why, but once I start reading this novel, I kinda cannot put it down till I finished! And I did!Their love is definitely NOT an insta love which is refreshing, especially for the heroine. Go Andy!! Yeah, I kinda bored with heroine insta love for the hero and we have to wait for oh-too-long time before the hero realize his feeling towards the heroine. I can feel the desperate feeling of Mr. Mogul who fall for an ordinary girl. Keep and keep searching for her shadow everywhere she's around. super cute khekhekheeeee *EvilGrin*What lack in this novel is the intimation which I can say, almost nothing. But the tension, hm...sexual tension, especially from Mr. Mogul was so thick. I really like that. Not a lame heroine, yeah, Andy? You go, gurl!! And the plot really simple, yet sweet, even I cant say it was super sweet. But yeah, average sweet. And kinda unrealistic. Yeah, what kind of Mr. Mogul who have the time for fooling around for a girl who doesn't want him? hello, He has all the money in the world but no time?! Unrealistic, see? And without really sexual activities, it was a plus and a minus. But after all, it was sweet and romantic."}, {"userName": "Daisy Wallis", "userReviewDate": "Sep 27, 2015", "userURL": "http://www.goodreads.com/user/show/32978990-daisy-wallis", "userReview": "I was sent this book by the BLVNP Publishing group and was really excited to start reading the novel. As some of you may already be aware I am not a huge fan of contemporary and usually I prefer fantasy or classics. Despite this, I did really enjoy the story. Its light-hearted nature and simple story line made the book easy to read and follow throughout. The characters, although a little cliché, were likeable, especially Andy whose personality seemed very life-like and relatable. I also liked the relationships within the novel – unlike other contemporary books I have read, the relationships depicted were not overly cheesy and felt very real (although I wasn’t too keen on the nickname “peanut”). Despite this, there were aspects of the novel that made it a little predictable and, in parts, boring. It took me very little time to become invested in the storyline and the main characters, but I found the middle of the novel to be incredibly slow and repetitive. By the middle of the novel, I had worked out what would happen in the end but the author seemed to deliberately to add unnecessary twists and turns to the plot that added no new suspense or tension – how many times can one guy be knocked back? Although I was very interested in what the outcome would be, I felt that the story lacked momentum in some parts and thus made it a bit boring. A more detailed version of my review can be found here - http://daisywallis.blogspot.co.uk/201..."}, {"userName": "Jeannie", "userReviewDate": "Sep 29, 2016", "userURL": "http://www.goodreads.com/user/show/43212926-jeannie", "userReview": "Andy Peterson is a young woman struggling with low income jobs, trying to make ends meet as she pays for her father's expensive medical treatment. In one day she manages to insult her bosses boss and quit her waitressing job, only to catch the intrigue of her bosses boss' sister. Alex Maxwell decides to hire Andy much to the displeasure of her brother William Maxwell... What starts out as a temporary job has twists and turns and by the end of it Andy and William are falling for each other...I wanted to like this story but geez Andy was like a tightly wound coil, she just couldn't let things go and the disagreements with William were so petty! Ugh the angst and for what? Sure you like the guy and want to play hard to get, I understand that, but woman I would have slapped some sense into you! The book was cryptic, what disease did her father have and why was he in hospital for so long? What did the email from Maggie say about his condition? Where is home? \"South\" isn't very specific! So many vague references and details, not that it usually bothers me but geez it was frustrating to read! Don't think I'll continue with these books, I can't even find them in the iBooks store anyway! Moving right along"}, {"userName": "Britney Sao", "userReviewDate": "Oct 04, 2015", "userURL": "http://www.goodreads.com/user/show/37291015-britney-sao", "userReview": "Who doesn't love a fun, sexy, and humorous boss? I mean, if it were up to me, I'd have no problem with attending to work. But, William's persistence to command Andy is just too humorous. She's so feisty and that is a good trait in a character in a novel, wishing that most realistic people would love to be. She takes crap from no one and doesn't let the biggest billionaire interfere with her job. This story left me with the feels and I wouldn't mind reading it again through paperback. It's be an amazing feeling to read on of my favorite books on paper instead of on an electronic device. I can't wait until the physical copy is released. Definitely a five star review!"}, {"userName": "Grace", "userReviewDate": "Nov 03, 2016", "userURL": "http://www.goodreads.com/user/show/26408920-grace", "userReview": "Horribly written and in desperate need of an editor. As an example, here are some direct quotes: \"Did my cousin said any nonsense to you?\" \"Hi Dad, seat and eat.\" \"Did Eve went all out? he countered with haughtily.\" \"And then, Ally overheard our argument, since it took place at work on during the break. She supported Sydney's decision and helping me dressed for work.\" Typos are going to happen, I can handle that. But this book was so full of them it became incredibly annoying to read. Additionally, there wasn't much chemistry been the couple. Hard to stay engaged reading this book."}, {"userName": "Nicole", "userReviewDate": "Aug 30, 2015", "userURL": "http://www.goodreads.com/user/show/24030454-nicole", "userReview": "I would really give it 2.5 stars it was ok. This is my first time reading a book by Mel Ryle. First the editing was not that great there were still lots of errors in the book that needed to be fixed. Then the main female character really got on my nerves. I read the whole book because I thought she would get better but she didn't. If you read this bool that is ok but if you don't you did not really miss anything. I don't think I will be keeping up with this series not really that impressive. Just my honest opinion but hey you could like it."}, {"userName": "Paige Burton", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/44731296-paige-burton", "userReview": "I'm going to start out with a disclaimer. My grammar and spelling is atrocious! With that said, I'm not author nor have published a book for those reasons. I gave this book 2 stars because of the spelling and grammatical errors. If you are going to write and publish a book,ebook or what ever. Make sure you have a dammed good editor and proofreader. I won't be reading anymore of this authors books. It was to difficult to decipher her spelling and grammatical mistakes."}, {"userName": "Dawn Gee", "userReviewDate": "Jun 07, 2016", "userURL": "http://www.goodreads.com/user/show/23511984-dawn-gee", "userReview": "The plot had potential but the author fell short in execution. The story line was confusing even after finding out about the bet between the siblings. It was a very disjointed book. It felt as though a bunch of people wrote sentences about a plot then they put them all together to try to make a novel. The grammar usage was bad and there were a lot of incomplete sentences. Here's one example: “Is this because you’re embarrassed I overhead you conversation this?”"}, {"userName": "Mary Joy", "userReviewDate": "Jul 18, 2015", "userURL": "http://www.goodreads.com/user/show/43727880-mary-joy", "userReview": "Honestly, at first I thought this book is one of those cliche stories that I read but when I got to the first scene when Andy and William meet everything change. Like I really thought that Andy will fall in love head over heels with William on their first meeting, but she didn't. I love everything about this book especially the characters how they show their different personalities and attitudes. <3"}, {"userName": "Carol Kevnick", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/15580039-carol-kevnick", "userReview": "I really enjoyed this book, but I wanted a little more back story and a little less bickering between the mains., that's why I give this 3.5. My biggest issue was the editing, there were times I read the same sentence 3 times to figure out what the author was saying (http://amzn.to/1ZeyQma). If those were corrected I would be giving this a 4.5-5 stars."}, {"userName": "Tanya", "userReviewDate": "Aug 25, 2015", "userURL": "http://www.goodreads.com/user/show/14805194-tanya", "userReview": "Would be 5 stars but.. This was a great book and I really enjoyed it. I would have given it 5 stars if it wasn't for the horrible editing issues. Normally this wouldn't bother me but there we r missing words, wrong words, and significant typos. It made it difficult to follow the story."}, {"userName": "McKenzie", "userReviewDate": "Oct 03, 2015", "userURL": "http://www.goodreads.com/user/show/47570319-mckenzie", "userReview": "I read this book on Wattpad less than a year ago. I've read it about three times and every time I reread it, it makes me love it even more. I've read quite a few of the stories where the poor girl meets the rich guy or where she meets the CEO. And this one by far is my absolute favourite. I'm so happy that Mel got this book published. So congratulations on such a great book!"}, {"userName": "Holly", "userReviewDate": "Aug 24, 2015", "userURL": "http://www.goodreads.com/user/show/16915457-holly", "userReview": "Love this book. Thank you for writing a in depth story about feeling and emotions. We watch Andy and WIlly battle it out. I love how funny Andy is. My favorite part has to be the name tag. I was laughing so hard. Willy is so shy and sweet. I love everything about him. I can't wait to read about his sister who so funny in the next installment."}, {"userName": "Mary Jean", "userReviewDate": "Oct 06, 2015", "userURL": "http://www.goodreads.com/user/show/47341998-mary-jean", "userReview": "Its one of the books that i fell inloved with and inspired me to write some stories. I'm so grateful to Mel who wrote this fantastic and world of art story. May u continue to make this kind of stories. Will support you till the end. God bless always and goodluck in ur career.Ps. Its really really nice books. To those who are still doubtful, i assure u this book makes u go head over heels."}, {"userName": "Huri Kurşun", "userReviewDate": "Oct 13, 2015", "userURL": "http://www.goodreads.com/user/show/27190020-huri-kur-un", "userReview": "I started reading this novel on wattpad but didn't get to finish it because it was published. So far it has been great. I love Andy and William's unique chemistry. Andy's feistiness really attracted me. I can't wait to finish this book. I wonder if there will be a sequel."}, {"userName": "KathLeen Friend", "userReviewDate": "Aug 23, 2015", "userURL": "http://www.goodreads.com/user/show/46234574-kathleen-friend", "userReview": "I love love love this book! hahaha kinilig ako! there is no better word to describe the story but it's so \"kakilig\"! XD though at first to be honest, at the beginning it's a bit boring and lacking but as I read along the story it gets fun and very enjoyable."}], "description": "“Just because you’re the boss does not mean you can just treat me however you want!” With those words, Andy Peterson made an enemy out of William Maxwell, a billionaire who is the epitome of leading men in romance stories for many—ridiculously enough. If it were up to her, she wouldn’t have to deal with him at all. Unfortunately, he is one of the most powerful men in the city, which means he can crush her like a bug if he wants to. And just when things are about to take a turn for the worse, she gets help from the most unlikely source. Alexandra Maxwell, William’s older sister, was so impressed with her feistiness and seeming immunity to billionaire douche’s charms that she hired Andy as an assistant. Although the job seems too good to pass up, the problem is she would have to work with that SOB. Will Mr. Mogul continue to make her life a living hell? Or will their explosive chemistry lead to something else entirely? If you love reading funny romance novels with a twist, then this story of two hard headed enemies with a meddling sister would surely rock your boat! Buy Meeting Mr. Mogul now and get sucked in to the crazy world of Andy and William!", "title": "Meeting Mr. Mogul: A CEO Billionaire Contemporary Romance\n      \n          (Mr. Mogul)", "url": "http://www.goodreads.com/book/show/26068357-meeting-mr-mogul", "average": 3.71, "cover": "https://images.gr-assets.com/books/1441609625l/26068357.jpg", "reviews": 75, "authors": [{"url": "https://www.goodreads.com/author/show/14136901.Mel_Ryle", "name": "Mel Ryle"}], "type": ["Romance", "Did Not Finish"], "outlinks": ["http://www.goodreads.com/book/show/26068357-meeting-mr-mogul", "http://www.goodreads.com/book/show/23728776-meeting-mr-mogul", "http://www.goodreads.com/book/show/26489755-meeting-mr-mogul", "http://www.goodreads.com/book/show/30066816-dating-mr-mogul", "http://www.goodreads.com/book/show/26026828-william-maxwell", "http://www.goodreads.com/book/show/30184246-marrying-mr-mogul", "http://www.goodreads.com/book/show/25788692-how-to-find-a-husband-in-100-days", "http://www.goodreads.com/book/show/25788684-still-into-you", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/11781578-lover-s-leap", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/36685093-the-unimaginable"]}