{"ratings": 685, "userreviews": [{"userName": "Teo", "userReviewDate": "Apr 11, 2011", "userURL": "http://www.goodreads.com/user/show/4647185-teo", "userReview": "Metal Gear Solid is, without a doubt, THE BEST GAME EVER. As someone who has played it through and through numerous times, I was thrilled to find out there was a novelization. Since Hideo is quite careful concerning his precious, and is reluctant to give someone else rights to mess with the franchise as they please, I had hopes the author commissioned to pen the novel would be someone of the highest caliber. Raymond Benson is NOT the person I had in mind.The plot is the same as the game: the FOXHOUND unit has gone rogue, and have overtaken a Nuclear Disposal Facility on the Shadow Moses island in the Fox Archipelago in Alaska. They have issued their demands, and if they're not met a nuke will be launched. Ex-FOXHOUND operative Solid Snake is taken out of retirement and given a solo espionage mission to infiltrate the facility, rescue the hostages, and stop the terrorists at all costs. Of course, Snake is briefed on a need-to-know basis, and there is more of what he doesn't know, than what he does. During his ordeal, secrets old and new will come to the fore.Those who've played the game are aware of the magnitude and depth of MGS's plot. Even though the the back cover boldly states that \"this explosive MGS novel ventures beyond the thrilling videogame and delves into the dark heart of Solid Snake's world\", that is a fat and blatant lie!The MGS novelization had to be given to someone who actually has some appreciation for the source material, to someone who had played and loved the game. Raymond Benson, obviously, didn't touch it. He already had expertly written material to work with, as MGS's scripts are incredibly deep and detailed. Unfortunately, he had been given some great creative freedom, which he also used to a great extent. When the dialgoue isn't copy/pasted from the game script, it's dreadfully butchered by Benson's ineptitude. To illustrate what I mean, here's some of Benson's addition to the script...During his mission Snake uses the following words or terms:- he calls Liquid \"the terrorists' head honcho\";- he calls Col. Campbell on the CODEC and tells him his niece Meryl is \"one wacky babe\";- he says Mazel tov when blowing the wall which leads to where Baker is being kept;- he says Gesundheit to a guard before killing him (yes, killing - more on that later);- he says \"Merry Christmas\" to another guard, knocks him out, and says \"I forgot to tell you - Christmas came early this year!\";- he says Nada;- he says hunky dory;- he ruminates whether he'd like to kiss Meryl, or spank her... and if maybe he'd do both;Need I go on? Cheesy one-liners - more so, BAD cheesy one-liners - do not belong in a MGS novel. Not only that, but Snake is totally out of character. His sneaking mission is more of a slaughter mission, because he keeps piling up the body count, killing almost every guard he comes across. His reasoning is faulty - when he infiltrates the facility itself he overhears guards talking about \"an intruder that's killed 3 people so far\". Snake immediately dismisses they're talking about him, because he had killed 6 people. As if they couldn't have discovered only 3 out of the 6 bodies. Before the mission, the Colonel informs him this is an On Site Procurement mission, only to issue him with a SOCOM. Later, Snake pulls a mine-detector out of nowhere, and so on.I realize the game couldn't have been literally translated to the novel medium, and I wouldn't have minded if Benson took certain liberties with the flow of the story; some alterations had to be made. But he made the wrong ones. While Snake is now spewing one-liners, he conveniently continues to find weapons (like chaffs, frags, Stinger and Nikita missle launchers, etc.) just lying around the base - the only difference from the game is that the items do not spin.Furthermore, he took the transcript of the game, took some lines, added some of his own, and filled the rest with atrocious prose. His action is repetitive, he can't build suspense for shit, his vocabulary is extremely limited and he writes with a plain and uninteresting style. Events are rushed and detached, the characters have no personality since Benson almost completely omits any descriptions or attempts at character development. All in all, this reads more like an average fan-fiction, than the work of a professional.To tell the truth, this novel is a travesty, going through it once was torture, and judging by it - Benson shouldn't be allowed to write ever again; I for sure know this was my first and last novel of his I've read. He's not a new and aspiring author, he's been around the block for quite some time, and it is unlikely he'll get better. And if this is his best, than I pity the man, and even more so his fans who pay for his works. Avoid this novel by all costs, and stick to the game.Rating: 1/10"}, {"userName": "Arik Manley", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/6396795-arik-manley", "userReview": "Metal Gear Solid is my favorite video game of all-time. It's an intense and intelligent sci-fi espionage thriller with a gritty, dark atmosphere, a complex story that weaves through deep conspiracy theories and philosophies, unique and memorable characters, and it has just enough silly camp and self-awareness to make it absolutely fun alongside being totally compelling. Hideo Kojima's masterpiece is a work that truly transcends the video game medium into interactive cinematic art.Unfortunately, the Metal Gear Solid novelization is garbage. Raymond Benson doesn't understand the characters at all and most of the action and whatnot just reads like a transcription of someone playing the video game, which isn't very interesting when I'm trying to read a book. Reading about how Snake keeps sneaking around grabbing stray hand grenades in boxes and a billion different guns just doesn't work when the prose is bad and boring.There's also the aggravating fact that Snake keeps spouting off cringy, totally out-of-character one-liners that most of the time don't even make sense, such as: \"Merry Christmas,\" Snake said as he delivered two power-house punches, left and then right, into the guards' faces. The soldiers plopped to the floor. \"I forgot to tell you — Christmas is early this year.\"Or he just has really dumb thoughts all the damn time, like when he finds the Kevlar vest and thinks: You don't find too many of these in Cracker Jack boxes! There's one particularly mind-blowingly awful moment in the sequence where he's running from the Hind-D helicopter between two towers that are being increasingly engulfed in flames and basically thinks \"these towers are on fire, but at least it's not as bad as 9/11!\" I just...what the actual fuck.The only time it's actually any good is when he's just copying the cutscenes and dialogue verbatim, but none of that is even actually his own creation so he doesn't even get any points there, especially when in most of these moments he's throwing in his own shitty dialogue and prose, completely ruining any tension or drama in the scenes.This book is an embarrassment to the legacy of Kojima's creation, and the fact that he was brought back to write the Sons of Liberty novelization is absolutely amazing (and I hate myself for feeling the need to read it at some point as well)."}, {"userName": "F0xh0undvix3n", "userReviewDate": "Aug 20, 2012", "userURL": "http://www.goodreads.com/user/show/12041913-f0xh0undvix3n", "userReview": "As a very devoted fan of the Metal Gear Solid series, I have to say this book is incredibly lacking in accurate characterizations. Most notably, Snake goes from the serious mostly-professional soldier he was in canon to an action hero spouting one-liners. In fact, I daresay everyone is spouting one-liners, up to and including the narration. If one were to approach this book expecting an accurate adaptation, they would be not entirely let down--about 85-90% of the dialogue is straight from the game script. Anything and everything expanded from that is less 'hammy' as it is 'ham on cheese on more ham on more cheese in a six-foot long sandwich of overacting'.And you know what?It is spectacular.If you approach this book without taking a thing seriously, it is the most wonderfully hammy scenery-chewing piece of literature I have ever laid eyes on. Assuming that one played a game where cyborg ninjas, gasmask-wearing Russian psychics, and a blond acrobatic Cam Clarke shouting about inaccurate genetics, then I would assume one did not take said game very seriously. Read this while reminding yourself the source material is only slightly less ridiculous, and you may find this book as unironically hilarious and fantastic as I did."}, {"userName": "An Odd1", "userReviewDate": "Jul 19, 2011", "userURL": "http://www.goodreads.com/user/show/4863716-an-odd1", "userReview": "\"Metal Gear Solid\" by Raymond Benson is based on original story and video game by Hideo Kojima, and highly resembles latter. Solo mission for \"Solid Snake\": neutralize \"Metal Gear\" nuclear weapon and rescue hostages - VIPs Anderson and Baker with detonate-disarm codes and cards, plus Colonel's niece Meryl. Theme is \"When the going gets tough, the tough beat the shit out of everyone else\" p224. Like a computer game, Solid conquers increasingly challenging levels, grunts, and bosses, to the top, his brother Liquid. All soldiers are genetically tampered with, so the biggest bugaboos are secret government and scientific, especially gene, experimentation. The moral is this condensed quote: \"DNA governs only potential destiny. Until today, I looked for a reason to live. Now, I'll stop looking and just live\" p317. The secrets keep on unfolding, layer after layer, But the bangup conspiracy surprise is the epilogue paragraph one-sided phone conversation.Hard to get caught up when I question action after action, perhaps because predetermined by game, sectioned into levels and \"dungeons\", like original Dungeons and Dragons role-playing game before computerized versions. Routine shoot and smash, Personalities feel slotted, like NPCs, non-player characters. Ninja-cyborg is \"chaotic\" in D&D parlance. Fighting illusions may be fun in video game, but sucks in books. Shadow Moses secret facility hides, typical fort under remote island. Standard procedure of giving best soldier cigs and drugs for quick boost is disturbing.The chief villain is Solid's clone brother Liquid. The assumption, from start to finish, that dominant genes are better than recessive, is oversimplification. That dominant and recessive would divide exactly between fetuses, impossible. Diseases may be dominant; a non-viable fetus would spontaneously abort. Dominant should have dark thick curly hair, dark skin, oval face, dark brown large almond eyes, freckles, cleft chin, broad wide lips, broad straight nose, straight thumb, wet ear wax, short, bald, astigmatic. (If one parent had straight thumbs, one bent, why do I have one of each?) http://en.wikipedia.org/wiki/Human_ge... http://www.sciencebrainwaves.com/blog... A \"Boss\" is the last, biggest, most powerful opponent on each game level (from ~8 year old given Nintendo DS same time as me). Epiphany: name \"Big Boss\" is self-explanatory, alias villains each a level \"boss\". Like games, with long dying speech, they gift him with key to unlock next level p235. A subterranean current of hidden agendas trickle up to the climax when S inputs codes. (Spoiler: He thinks he is deactivating, but the same process does activates, uh-oh - written before I knew answer.) I've never been an acronym fan, abbreviations are easier to remember and decipher. (Aside: while my mom had a stroke, people remembered STOP, but not the symptoms represented = Fail.) Cast (some have past history) and acronym lists would help; here's a starter: Good Guys & Gals & expertise1 Solid Snake genetically engineered US special forces FOXHOUND soldier2 Colonel Roy Campbell 60s FH commander3 Dr Naomi Hunter geneticist4 Mei Ling tech, comms - Codec codifying satellite comm system has locating tech5 Natasha Romanenko hardware - explains weapons to reader, S already knows6 Master McDonnel Benedict Miller survival 7 Meryl Silverburgh teen Roy's niece Bad Team rebel FH elite - Why from different countries? Why wierdo fancy supervillains have cartoon superhero monikers?PsychoM controls:  - genomes = genetically improved troops, novice grunts true definition: entirety of an organism's hereditary information DNA, RNA, and more http://en.wikipedia.org/wiki/Genome - Space Seals \"genome\" veteran squad, elite in black - mercenaries (why bother distinguishing from others? all treated as bad guys even though co-opted by Psycho)Big Boss - cryo-frozen corpse of S&S dad provides genes for super soldiers, chief villain on previous missions - Is not dad as prime enemy p185 old news from Star Wars days?1 Liquid Snake - Solid's clone2 Psycho Mantis - Russian brain controller3 Sniper Wolf - Kurdish Female sharpshooter4 Decoy Octopus - Mexican disguise, languages 5 Vulcan Raven - Alaskan Indian/Inuit commands animals, birds\"giant\" p17 2.1m (but Farenheit p30) 6'11\" is common (even female) basketball player height.http://www.astrotheme.com/heights/6&#"}], "description": "From original story and game by Hideo Kojima, skilled retired FOXHOUND agent Solid Snake returns to his expertise - neutralize an epic crisis. Six deadly FOXHOUND renegades control a nuclear disposal facility on Shadow Moses Island in the icy Aleutians. If their demands are not met, a powerful, top-secret weapon will be unleashed upon the world. The solo mission is to breach the heavily fortified base, rescue hostages, and destroy the superweapon. His only obstacles are brainwashed commandos, DNA-enhanced troops, and six extraordinarily able assassins. But nothing is as it seems - secrets, a hidden agenda, and revelation to Snake of secrets from his dark past that would shake any man to his core.", "title": "Metal Gear Solid\n      \n          (Metal Gear Solid #1)", "url": "http://www.goodreads.com/book/show/3048010-metal-gear-solid", "average": 3.61, "cover": "https://images.gr-assets.com/books/1320530636l/3048010.jpg", "reviews": 57, "authors": [{"url": "https://www.goodreads.com/author/show/18292.Raymond_Benson", "name": "Raymond Benson"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/3048010-metal-gear-solid"]}