{"ratings": 322, "userreviews": [{"userName": "Sam Quixote", "userReviewDate": "Jul 23, 2014", "userURL": "http://www.goodreads.com/user/show/5759543-sam-quixote", "userReview": "Meteors containing aliens crash on Earth. Are these extra-terrestrials peaceful or hostile? They’re actually peaceful but the US Military knows one goddamn thing – it’s got some goddamn missiles and it’s gonna goddamn use them!As everyone freaks out about an alien invasion that isn’t happening because the aliens are too busy walking on air (literally!) as if they’re stoned superheroes who’ve just figured out their powers, one alien befriends lonely American teen Alden Baylor, a kid whose name sounds like someone with a mouthful of toffee trying to say “Alan Taylor”.You’d think he was miserable because of his crap name, or maybe because that’s the attitude that works best on the laydees but he’s not getting any, for some reason, even though he resembles an Abercrombie & Fitch model with no parents to tell him what to do and a massive amount of land he’s just inherited, plus media attention. (That said, can a teenager own land? I don’t know the US laws but doesn’t seem right)Middle middle middle, terrible anticlimactic ending, stare into space wondering what the point was, and it’s over.Meteor Men is probably the least interesting aliens come to Earth storyline you’ll ever read. Our “hero” archetype, Alden, might as well have empty speech bubbles for all its worth reading his dialogue. He’s the most vacuous person to have as a main character and there should be a sign hanging around his neck saying “WARNING: Listening to me talk for any amount of time will put you a coma”.The aliens are criminally dull too. I’m sure the idea that when aliens invade, the reader is supposed to be interested in finding out who they are and why they’re here but they do so little and display such little character – they’re like alien versions of Alden – that you’ve all but given up on them proving to be in the least bit worth knowing. I can say having read it, the reason why they do what they do is one of the most mind-numbingly boring reveals ever.The book overall has a strong Spielberg-ian feel to it. The kid who makes friends with the alien and the government/military hunting them down cliché is very ET and the fact that the comic is aimed at younger readers makes it a very safe read. Nothing original is attempted, there are no complex themes or characters, there’s little in the way of tension or obstacles to overcome, and the message is as universally positive as you can get – don’t judge appearances and be tolerant and kind to others. A fine sentiment but bland as hell – sorry, kids – “heck”, to read.Maybe that’s why the book has no resonance with me, being an adult reader, and teenagers will lap this up? It does seem to portray the life of a teenager fairly accurately – the awkwardness of a shy boy around girls, the parties, etc. - so perhaps for a reader going through these things themselves, they’ll identify more closely with the protagonist (who is luckily a blank slate – maybe that was the point?) and feel more strongly about the book as a result.Sandy Jarrell’s artwork is pretty good – I liked how the alien first spoke to Alden psychically, the background was whited out with a giant word to show how big an impact it had on his mind, and overall the comic is easy on the eyes. The alien designs aren’t that original though and seem fairly generic and forgettable.And those two words sum up Meteor Men – generic and forgettable. At no point was I engaged with any aspect of the narrative and the most powerful feeling I had when reading it was sleepiness. Maybe a teen who hasn’t read much sci-fi will enjoy this, but for the rest of us? It’s a miss. Like the meteors in the book when they lay on the ground split open, Meteor Men is quite hollow."}, {"userName": "Wayne McCoy", "userReviewDate": "Oct 24, 2014", "userURL": "http://www.goodreads.com/user/show/4054541-wayne-mccoy", "userReview": "'Meteor Men' is a perfect story for the graphic novel format. It's mystery and wonder are perfect for this medium. Some slight spoilers follow.Alden Baker lives on his deceased parent's farm until he's old enough to own it. On the night of the Perseid meteor shower, he and others are out in the pasture to observe it. Along with the shower, meteors crash on Earth, including not far from where he is. A fight ensues over who owns the meteor, but what are they really and why did so many land? The mystery deepens over weeks as mysterious things are seen on the planet, and Alden finds himself in a unique place in the middle of a global crisis.The art and story work well together, and it's the kind of visual story that works better with sequetial art. It's a good story completely suitable for YA. Alden is a likeable character. There are some strange jumps in the story. Some are possibly because of the story, but some were just a bit strange to me. I liked it well enough and I do recommend it.I received a review copy of this graphic novel from Diamond Book Distributors, Oni Press and NetGalley. Thank you for allowing me to review this graphic novel."}, {"userName": "Eve", "userReviewDate": "Sep 01, 2014", "userURL": "http://www.goodreads.com/user/show/5032595-eve", "userReview": "There is nothing remarkable about the story or artwork for Meteor Men, except possibly its consistent blandness. Aliens come to earth in a meteor shower and co-opt human bodies for their use. Fairly typical or at least as typical as sci-fi can be and certainly more than a little boring. The most interesting parts of the story are brief tidbits about Alden Baylor’s history and previously mundane life. Yes, that’s right; the mundane parts are about as exciting as it gets. The author appears to be trying to make a grand statement about human aggression, violence, and even our existence, but the effort falls flat. The character development and plot are too abrupt to make readers feel much sympathy or even dislike for either the humans or the aliens. I kept reading thinking there had to be more revealing information and excitement further on in the plot. Unfortunately, the ending was as quick and abrupt as the rest of the book and left me feeling like the story was unresolved and underdeveloped.Thanks to Netgalley.com for this ARC in exchange for an honest review."}, {"userName": "Kay", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/6920736-kay", "userReview": "[Alden's choice to \"merge\" with a Meteor Man/alien parisite was supposed to be peaceful and bigger than himself -like Wilton was saying, that his memories would live on in the future with the parisite- but I just really didn't like it. (hide spoiler)]"}, {"userName": "Daniel", "userReviewDate": "Jul 30, 2014", "userURL": "http://www.goodreads.com/user/show/638550-daniel", "userReview": "This review originally published in Looking For a Good Book. Rated 4.5 of 5It is books like Meteor Men that have restored my faith in the graphic novel as a literary form.  This book is beautiful to look at and delightful to read.  To me, this is precisely what the graphic novel medium is intended to be.  I know that the bulk of the graphic novels out there are compilations of superhero comic books, but the more I've been reading lately, the more I really appreciate the non-superhero graphic novels.  A book such as this might be just the ticket to get the young adult/teen readers in to the graphic novel market.The story is a rather basic 'first contact' story.  A group of teens gather to watch the annual meteor shower only this year it appears that one has struck the earth.  Bright, loner Alden discovers that the meteor has landed on his property.  After exploring and experimenting with the meteor, he intends to give it to a local museum.  But when Alden learns that similar meteors have struck the earth all over the world and there are coinciding reports of disappearances of local people, Alden realizes that there may be more to this than a random meteor.  When Alden discovers and befriends an alien, neither Alden, nor the Earth, will ever be the same.The story flows so naturally and author Jeff Parker not only creates an interesting and page-turning story, but he has also created unique, distinct, and involved characters.  Even our minor characters here have more personality and depth than some of the long-runnig superheroes I've read lately!  And while it's a teen-type book, the adults are not always the villians here.The art is really delightful.  Appropriate and effective and the sort of book you might thumb through just to look at the art.This is one of those books which I didn't know what to expect when I requested it from NetGalley and it turned out to be a beautiful surprise.  This is highly recommended to graphic novel fans and teen readers.Looking for a good book?  Meteor Men is a beautiful graphic novel with compelling characters and a strong story."}, {"userName": "Nicola Mansfield", "userReviewDate": "Feb 04, 2015", "userURL": "http://www.goodreads.com/user/show/1682713-nicola-mansfield", "userReview": "This is a strong piece of pure science fiction (something I don't come across often enough these days). Aliens arrive on Earth during a meteor storm and the author brings a mature variation on the alien invasion theme. I found this to be a quick read and a story I was quickly hooked on. Usually when aliens arrive on earth one of two things happen: the aliens are bad and earth has to find the elusive way to kill them or the friendly, peace-loving aliens are misunderstood by the bad army/government people who want to kill them just because they are alien. I enjoyed Parker's take here as neither the aliens nor the authority figures are so easy to understand. We don't find out the alien objective until the end, which has a wonderful twist ending that leaves you thinking whether it was good or bad. Quite impressive. The art was excellent. Done realistically with a variety of frame structures that enhances the text."}, {"userName": "Kevin", "userReviewDate": "May 23, 2015", "userURL": "http://www.goodreads.com/user/show/674412-kevin", "userReview": "One night during the Perseid meteor shower, thousands of meteorites make contact all over planet Earth. One of those meteorites crashes in the farm of young Alden Baylor. After investigating, he makes contact with an alien that came down inside the meteorite. What does the alien want? Is it peaceful? These and many more questions are ones that both Alden and the world's ever-twitchy and defensive governments and militaries would like answered. It's not the best alien invasion story I've read but it's also not the worst. Sure, that might not sound like I'm giving it much credence. But I just felt it was a bit choppy and rushed. It had a lot of potential that was squandered by the conciseness of it. But I did breeze through it in one hour which is the quickest I've torn through a graphic novel. That could be either good or bad. I did enjoy the artwork from Sandy Jarrell."}, {"userName": "Olivia", "userReviewDate": "Oct 30, 2016", "userURL": "http://www.goodreads.com/user/show/5607334-olivia", "userReview": "This title was originally brought to my attention by the artist whom I met at Heroes Con months before the book was published. After he heard I was a librarian he showed me a copy and thought it would be good for teens. Fast forward two years later and ComiXology has it on their unlimited service!This was a quick read; I almost finished it in one sitting. For the most part it feels like a typical \"boy meets alien\" story. The last bit of the 4th issue makes it stand out a little bit and definitely by the end it feels more unique. The art is nice. I enjoy the colors and the thick lines that give it more of an iconic look. It was a good quick read but I'm glad I didn't spend any money on it specifically. I could see how teens would enjoy it though."}, {"userName": "Melissa", "userReviewDate": "Aug 12, 2014", "userURL": "http://www.goodreads.com/user/show/1361342-melissa", "userReview": "Ok so this was just weird, and not my cup of tea. But I'm sure plenty of others will enjoy it. This was just the weirdest alien species premise ever! They look like octopi but then morph and completely cover their host living being (usually a human) so they end up looking like humans just with big heads. Anyway, it never was adequately explained why Alden was connected to the aliens when no one else was, and I was confused as to why some people could hear the aliens thoughts and then later only Alden could. Also, they kept mentioning Alden's four cows so I was convinced they were going to be an important part of the plot. Lastly, I disagreed with the ending (I just don't see Alden making that decision), but I won't spoil that here."}, {"userName": "Corinna Bechko", "userReviewDate": "Jan 05, 2015", "userURL": "http://www.goodreads.com/user/show/2948172-corinna-bechko", "userReview": "It's always nice to discover a new, original science fiction comic and this one has something rare: a grounded story with a satisfying twist. The art is a good fit with the somewhat contemplative mood of the narrative while also delivering strong action sequences. In short, I wish there were more comics like this."}, {"userName": "Anne", "userReviewDate": "Jan 31, 2016", "userURL": "http://www.goodreads.com/user/show/17817088-anne", "userReview": "This was fine. For me, the characters were a little on the shallow side and the plot a little thin, a little typical, but it was still entertaining and the art was cool and: ALIENS! I think this would be a great comic for younger sci-fi readers."}, {"userName": "Abigail Monhollen", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/49577070-abigail-monhollen", "userReview": "Boring to read. I didn't fully finish it because it was hard to get through. It had potential to be good sci-fi, but failed."}, {"userName": "Sonic", "userReviewDate": "May 24, 2015", "userURL": "http://www.goodreads.com/user/show/1823662-sonic", "userReview": "A not so unusual premise handled in a unique way. This is a nice sci-fi story that actually made me think!"}, {"userName": "Sharon", "userReviewDate": "Sep 03, 2015", "userURL": "http://www.goodreads.com/user/show/1753152-sharon", "userReview": "Meh."}, {"userName": "Katrina", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/5509524-katrina", "userReview": "One of the reviews on the back of the book called this an \"optimistic\" story, which I don't particularly see. I suppose that's an Earth-centric view; if you step outside of humanity and look at the story from the wider universe's perspective, or from that of the alien invaders, there's certainly a sense of community. But at what cost? The conclusion seems to be that humans don't really deserve to maintain our hold on this planet when our instinct is to destroy the unusual rather than attempting to understand it.It's an interesting book to read after (belatedly) watching Arrival, because it starts off with a similar idea but follows a quite different path. I don't know that it feels totally complete to me. It's a sliver of a story, with insufficient attention given to laying out the relationships between the important characters. It makes the conclusion feel less rational to me. I don't see this as a story of a teenager finding his place in the world; I don't think the aliens are strictly evil, but they're still a parasitic invading force that plans to eventually populate the entire universe, which requires displacing the existing inhabitants. That's not exactly making them any better than the trigger-happy government officials on Earth.I also didn't see Alden's final choice as one he made when in full possession of his faculties. This was a quiet, sad sort of story. Worth reading, but not one I'll return to."}, {"userName": "Don", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/845308-don", "userReview": "My son picked this up at the library on a whim. Three hours later he told me \"you've GOT to read this!!\". He was right, it was a great story about a kid who has a meteor land in his back yard. I have a tendency to be very linear in my reading: I read these authors and these series in order... but, my son broke me out of that with this book. Indie comic company called ONI Press made it. Definitely worth checking out their stuff."}, {"userName": "Amanda", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/1753322-amanda", "userReview": "Would you think less of this if I tell you that while I was reading it--in the back of my head--I kept thinking of The Host? *face palm*Anyway, this was a super quick read, and I never felt that I quite connected with the characters. The art helped me through, but something wasn't quite there for me."}, {"userName": "Daniel Watkins", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/25268163-daniel-watkins", "userReview": "Loved the artwork, and I think the story was well thought out in terms of the overall arc. But I think it’s a bit too brief to really develop a bond between characters. Hopefully the story continues..."}, {"userName": "Amanda", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/74703895-amanda", "userReview": "I loved it so much!!!!!!"}, {"userName": "Molly", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/1015287-molly", "userReview": "I know this was published well before The Girl With All the Gifts, but it is very much that kind of book. Except instead of hungries it has aliens. It's neat."}, {"userName": "Mike Jozic", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/4530526-mike-jozic", "userReview": "A very satisfying read. Although I enjoy most of Jeff Parker's books I always prefer it when he deviates from the super-hero malaise of the larger body of his work and just tells a really good sci-fi, mystery, or adventure story. Underground, Interman, and Meteor Men are great examples of this. Great characters, art, and solid storytelling make this (and the others) a strong reccommendation. Check this one out, you won't be disappointed."}, {"userName": "Online Eccentric Librarian", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/15784017-online-eccentric-librarian", "userReview": "More reviews (and no fluff) on the blog http://surrealtalvi.wordpress.com/\nMeteor Men is a beautifully presented, engaging, and sophisticated graphic novel featuring a perfect marriage of story and art. I was greatly reminded of the movie \"The Iron Giant\" due to this title's distinct style, sense of adventure and wonder, underlying message, and appeal for both children and adults. If but for a somewhat abrupt ending, this would be a perfect title.Story: When a group of kids go outside to see a yearly meteor shower, they are stunned when one of the meteors lands nearby. Alden, a somewhat lonely and introspective tween, saw the meteor land on his property and tracked it down. What he and the other kids find is a meteorite, split in half, and hollow in the center. Soon, Alden discovers that meteors landed all across the world and both educational and government entities want the meteor fragment on his property. Then Alden sees an alien - and he realizes there was a reason the center of the meteor was empty. Suddenly, everything changes as he begins to communicate with the alien, discovery a fearful truth about their reason to be on Earth, fend off the government, and fight to retain control of the meteorite.The art was beautifully rendered in full color and clean line drawings. It was so perfectly suited for the story that I could not imagine any other artist doing more justice to the plot. I was hooked from the very beginning of the story and could not put it down; I had to see what adventure the author was going to take me on with main character Alden. Although it may seem Alden is the 'hero' of the story, there are actually several characters who interact with him and, for once, the adults are not always the enemy. The underlying messages means this is a book you'll want to read several times.The story felt very original and the author made some very interesting moral observations that didn't club the reader over the head. Alden isn't a wide-eyed innocent and has to think his way through the plot. That he is older and has to deal with teen drinking and the death of his parents mark this as a much more mature story than with The Iron Giant movie. The author builds the mystery slowly and assuredly and the book never drags in the middle.This is an excellent graphic novel featuring sophisticated art and an original story. Although the ending felt a bit abrupt, the story had a defined arc and completed within this volume. This is one of those rare books without pretension and whose story appeals to many ages and genres.Reviewed from an ARC."}, {"userName": "Zach Dionne", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/22508069-zach-dionne", "userReview": "Pretty straightforward alien landing/only the kid knows what's up story (and largely drawn/written with similar straightforwardness) but reminded me a lot of Arrival by the end, in that it suddenly became something very uniquely special and genuinely touching/thought-provoking toward the very end."}, {"userName": "Jessica", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/3345952-jessica", "userReview": "I can't really pinpoint exactly what it is about Meteor Men that I liked, even though I've been thinking about for a little over a day now. If I had to take a guess, I'd say it's the fact that this graphic novel captured my imagination. I'm sure we've all had moments where we wonder if we're alone in the universe. Where we truly debate what would happen if we weren't. More than anything, I felt like this story was something different from tales of aliens I've read previously, and I appreciated that wholeheartedly.Let's start with the illustrations since, in all honesty, those were my least favorite part of this story. It's not that the panels in Meteor Men aren't well done. They're just a different art style than I'm used to. The scenes were a bit blurry looking, with starkly contrasted speech bubbles hovering over them. On the bright side, it did make for a very easy read. The dialogue doesn't hide within the panels. Still, I'm used to bright, crisp art in my graphic novels. It made this one a little distracting.On to the story line, shall we? That was my favorite part of this, hands down. I loved that the aliens arrival was so spectacular. That there were no flashy UFOs or mother ships. I also really enjoyed the reactions of the general public. This story felt true to life as I followed along. I won't spoil, but there are a lot of grey areas explored in this novel. What if the aliens that came to Earth didn't fall into a \"bad\" or \"good\" category? What if there was something in between? Any story that challenges me to think outside the box gets a seal of approval from me, and this one did just that.There's not really much else that I can say about Meteor Men. I'm sure it's going to be a graphic novel that people either fall in love with, or pass over. As a fan of Science Fiction, I enjoyed being lost in the story, and that's all I can really say for sure."}, {"userName": "Jessica", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/7602902-jessica", "userReview": "[I for one would by no means take a (what seems to be a slimy mass composed up of living organism) and put it on my head, and become a part of the humanoid blobby aliens that seem to be of no relation to the symbiotic relationship that plagues Carnage & Venom----kudos for Alden in making that decision. :) (hide spoiler)]"}, {"userName": "Alice Marsh-Elmer", "userReviewDate": "Aug 26, 2014", "userURL": "http://www.goodreads.com/user/show/12831316-alice-marsh-elmer", "userReview": "Beginning with a group of young adults watching a meteor shower, I immediately knew Meteor Men was going to be both familiar and different. The expected dialog between teens ensues, with one teen (the underage owner of a rather large farm) standing out as a bit of a loner; forced to grow up before his time by the death of his parents, we meet our young protagonist Alden.Quickly we come to realize this was no ordinary meteor shower, and Alden ends up being the sort-of-owner of one of these mysterious \"space rocks.\" That same night, Alden is the first to encounter and establish a small relationship with the creatures from outer space who seems to have taken a particular liking to Alden, who is shortly catapulted to international stardom as a result of his link with the alien species.I'll spare further details (leaving them for readers to discern)--but what's most unique about this novel is the way the aliens have been developed. Some expected circumstances arise (the politics of an alien invasion, other accidents caused by a species that doesn't understand humans) but the aliens, themselves, provoke some unique insight. Rather than a group of individual creatures, all of the alien beings share a mental link and a history that goes back in time for ages. The Aliens do \"take over\" the host bodies in a way some people will find grotesque, but rather than eradicating they introduce new intellect to the collective knowledge; through this link the Aliens have been able to travel through the universe gathering information and will probably continue to do so...forever."}, {"userName": "Ikao", "userReviewDate": "Jul 16, 2014", "userURL": "http://www.goodreads.com/user/show/9235501-ikao", "userReview": "*Got this free from netgalley in exchange for honest review*A meteor-type disembarked in Alden's field property. It was like how Superman came to earth, but ofcourse in this book the aliens weren't hot and handsome guys like Clark Kent. They were like classic big-head aliens. The meteor was empty, but an alien inside had already gone somewhere. It wasn't only happened in Alden's property, but also around the world. The aliens threatened people, a war happened. But one alien was connected with Alden. Did they come to destroy the world? Or they had other reason? That was what Alden would discover through the book.I had never read comic before. It was a different experience than reading a manga (I thought it would be the same!). Reading this comic was like going to a paintings exhibition. The way the story was told through the arts was an artistic experience. The drawings were undoubtly very good. My favorite was the backgrounds! It was very stunning that I wanted to frame it. The colors were also neat and picturesque.There weren't many characters involved in this story, and most of them were forgetable. It was focussed on Alden and the alien's relationship. It wasn't like a friendship. The alien protected Alden in some incidents. The reason would be uncovered later in the book. It was sore truth, guys."}, {"userName": "Janis", "userReviewDate": "Jul 16, 2014", "userURL": "http://www.goodreads.com/user/show/3295005-janis", "userReview": "This graphic novel by comic book veterans Jeff Parker (Aquaman, Hulk) and Sandy Jarrell (Batman '66) is geared to the young adult market. Teenager Alden Baylor is watching a meteor shower when he encounters...an alien. It's a life-changing experience for him as he learns why aliens would visit Earth and deals with interfering adult authority figures.The adults seem more realistically portrayed than does a teen such as Alden. The book is far-fetched beyond the possible idea of aliens (if you are an alien naysayer)--Alden owns property and his parents have died? It's been noted that orphans make great book characters for juvenile literature because they are able to do so much without parental interference, but it seems quite unlikely here.Like many graphic novels, it's difficult to figure out the setting, since there's only dialogue--an inserted \"Back at home...\"-type of information would have helped clarify this. That used to be so standard in comic books that I'm surprised Parker didn't employ it here.That said, this was a fun read--the more of it I read, the more I enjoyed it. The twist at the end is a hoot. I do think teen guys will enjoy this graphic novel.Note: I received an advanced copy of this book for review purposes."}, {"userName": "Theediscerning", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/31778097-theediscerning", "userReview": "Trending high on the 'it's been done before – just not like this' scale is this comic, which has a great simplicity to it – and in a good way. Alden kind-of owns a farm, even though he's only at secondary school, when a meteorite lands at the start of the Perseid shower. While he also owns that, the local scientist wants it for the planetarium, and science might be the winner – but the rock has secrets beyond science. When it's found to have burst open, there is a chance that something has managed to get out of it – and Alden's woody homestead might well provide him with a greater, more eye-opening upbringing than he thought possible.Alden is a great fish out of water character, guiding us through the drama in a succinct fashion – but he's not alone in that. From the clear artistic line, to the subdued and underplayed palette to the great script – all serve the plot with a calm, mature manner that really makes this an enjoyable read. We should be well used to the idea of things coming to Earth in a meteor shower, but never have the results been this interesting."}, {"userName": "M", "userReviewDate": "Apr 07, 2015", "userURL": "http://www.goodreads.com/user/show/5919013-m", "userReview": "Jeff Parker, Sandy Jarrell, and Kevin Vold team up for a unique look at the worlds beyond our stars. Teenaged orphan Alden Baylor is enjoying a meteor viewing party with classmates. When one crashes onto his acreage, Alden's professors light up at the possibility of fame, fortune, and scientific grandeur. Alden finds himself feeling more alone - until he encounters a strange being that came from the cracked rock. Caught up in a groundswell of fear and curiosity as the alien makes its presence known, Alden must discover his own inner strength if both he and his extraterrestrial visitor wish to survive. Parker uses loneliness and intrigue to craft an unsettling tale about humanity, using aliens to help explore our solitude. Jarrell and Vold render a familiar yet unique look at the alien form, using its oddness to juxtapose the supposed normalcy of humankind. Meteor Men is a tale that crashes into your sensibilities, and reminds readers that wonder and awe can still be found within ourselves as well as the stars."}], "description": "On a summer night, Alden Baylor sits in a field watching the largest meteor shower in human history. What begins as teenage adventure becomes something more - the celestial event brings travelers who will change the world completely, and Alden discovers a connection to one of them. How does a young man who had to grow up fast handle the invasion of his planet? Can Alden keep humanity from oblivion? From writer Jeff Parker (Aquaman, Hulk) and artist Sandy Jarrell (Batman '66) comes this story of adolescence, friendship, and hard decisions.", "title": "Meteor Men", "url": "https://www.goodreads.com/book/show/22358169-meteor-men", "average": 3.45, "cover": "https://images.gr-assets.com/books/1404576088l/22358169.jpg", "reviews": 70, "authors": [{"url": "https://www.goodreads.com/author/show/47763.Jeff_Parker", "name": "Jeff Parker"}, {"url": "https://www.goodreads.com/author/show/6884625.Sandy_Jarrell", "name": "Sandy Jarrell"}, {"url": "https://www.goodreads.com/author/show/8278781.Kevin_Volo", "name": "Kevin Volo"}], "type": ["Sequential Art", "Sequential Art", "Science Fiction", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/22358169-meteor-men", "http://www.goodreads.com/book/show/17604979-willow", "http://www.goodreads.com/book/show/401192.X_Men", "http://www.goodreads.com/book/show/18373347-batman-66-vol-1", "http://www.goodreads.com/book/show/754151.Agents_of_Atlas", "http://www.goodreads.com/book/show/21524959-aquaman-volume-5", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}