{"ratings": 867, "userreviews": [{"userName": "Antje", "userReviewDate": "Dec 07, 2014", "userURL": "http://www.goodreads.com/user/show/25944834-antje", "userReview": "Dieses Büchlein hat mich bestens unterhalten und vergnügt. Vor allem die Nebenfiguren wie Franziska, Werner, Just und sogar der Wirt amüsierten mich und sind in meinen Augen die reizvollsten Charaktere in diesem Lustspiel. Sie verfügen über eine ungeheure Portion Witz und Scharfsinn, die der Handlung eine besondere Würze verleihen. Das Fräulein Minna und ihr Tellheim hätten es nimmer allein zu Wege gebracht, zueinander zu finden und mich von dem Stück zu überzeugen. Zudem zog mich Lessings Erzählweise und Sprache prompt in seinen Bann. - Ein feines Werk, das mir spät in die Hände fiel und um so mehr überraschte."}, {"userName": "Everett Darling", "userReviewDate": "Jun 08, 2010", "userURL": "http://www.goodreads.com/user/show/771227-everett-darling", "userReview": "Minna is a character of qualities, she's smart and has a will of her own. She's crafty and runs circles around the men with her wit. The plot isn't complicated, just appears so, since the reader is unfolding the secrets at the same speed as the characters, which is quite a clever technique, but I fear it will lose some readers who prefer omniscience to opacity. Best line, it is easy to like good people, but it's a challenge to like bad ones. Minna is successful with people because she accepts their natures."}, {"userName": "Nadja", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/5903744-nadja", "userReview": "Ganz unterhaltsam, aber hat kein wirklich bleibenden Eindruck hinterlassen."}, {"userName": "Laura Deen", "userReviewDate": "Dec 11, 2015", "userURL": "http://www.goodreads.com/user/show/31854495-laura-deen", "userReview": "\"Wenn dein Mund nicht plaudern kann, so kann dein Herz doch reden.\" (der Graf, blz. 84)"}, {"userName": "John Hatley", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/4161383-john-hatley", "userReview": "This is a very pleasant comedy, possibly one of the favourite comedies from the German Enlightenment, by one of Germany's literary masters. It is still played in German theatres today."}, {"userName": "Anne Katrin", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/19613843-anne-katrin", "userReview": "Eine Liebesgeschichte mit Happy End, treuen Freunden und dickköpfigen Charakteren. Unterhaltsam, aber nicht einprägsam."}, {"userName": "Arta", "userReviewDate": "Mar 27, 2015", "userURL": "http://www.goodreads.com/user/show/8124377-arta", "userReview": "3.5 stars Hilarious play!"}, {"userName": "Arbraxan", "userReviewDate": "Aug 08, 2015", "userURL": "http://www.goodreads.com/user/show/21979386-arbraxan", "userReview": "Synopsis Minna von Barnhelm oder das Soldatenglück (\"Minna von Barnhelm or the Soldier's Fortune\" in English) is a comedy written by the German playwright Gotthold Ephraim Lessing and published in 1767. It is often judged to be the most important comedy of German Enlightenment and a hallmark of German 18th century literature. Set in mid-18th century Berlin, the comedy tells the story of Lady Minna von Barnhelm, a young, rich and beautiful noblewoman from Saxony, and her betrothed, Major von Tellheim, the embodiment of duty and virtue. Recently discharged from the Prussian Army, von Tellheim is plagued by war wounds, contested claims and debts, yet he refuses help from his friend Werner, a sheriff and former constable, and only accepts assistance from his loyal manservant Just. Fearing he won't be able to properly provide for Minna, he wishes to annul their betrothal. Thus Minna and her servant Franziska have to cleverly overcome his honorable stubbornness by presenting von Tellheim's acquiescence to marriage as the only possibility to safeguard her honor - of course, von Tellheim obliges.REVIEWIt is likely that a contemporary person - even a contemporary German - reading the play would not think much of it and miss many of its subtler nuances. A part of General Tauentzien's entourage at that time, Lessing began to write Minna von Barnhelm in 1763, right after the end of the Seven Years' War (1754/56-1763); the play reflects several of his experiences in a military environment. The Seven Years' War in its European theater - also known as the Third Silesian War - began with the invasion of Saxony by Frederick II of Prussia, thereby preempting an Austrian attack on Silesia. By making light of both Prussian and Saxon stereotypes, namely by extrapolating von Tellheim's integrity and sense of duty ad absurdum and depicting Minna von Barnhelm as frivolous, Lessing might have tried to contribute to the reconciliation of Saxony and Prussia. Alternatively, as Goethe put it in his 1812 review of the play: \"The spiteful tension between Prussia and Saxony during the war could not be lifted by its end. Now more than ever the Saxon felt the pain of the wounds the proud Prussian had inflicted. The political peace could not immediately produce peace between minds. But this should be done through imaginary spectacle. The Saxons' grace and loveliness surpasses the Prussians' value, dignity, stubbornness, and a happy union of bizarre and reluctant elements is demonstrated on both the main characters and their subordinates.\"At the same time, the play attributes to the Frenchman Riccaut de la Marlinière the role of the wasteful and dishonest scoundrel in a blunt manner (this was particularly criticized by the play's French reviewers, e.g. Madame de Staël, who were otherwise rather positive about it). This begs the question whether Lessing intended to foster reconciliation by focusing enmities on another nation; indeed, some of the play's first performances were without Riccaut. An even greater fear of censorship concerned the play's allusion to the king's discharge of the Freibataillone (\"free-batallions\") after the Seven Years' War, which seems to have flooded the country with disgruntled veterans. Nonetheless its success in Germany was astounding, in particular in 1768 Berlin.Another interesting facet of the play are the reviews it inspired in the early 19th century, e.g. by Franz Grillparzer or Otto Ludwig. These reviews, written after the Napoleonic Wars and during the heyday of burgeoning German nationalism, bear testimony to the struggle of isolating something genuinely German amidst the Austro-Prussian dualism, the legacy of the Holy Roman Empire and the persistent religious divide made evident by the Thirty Years' War and its horrors.Grillparzer (1822): \"[...] So truly German in all its characters, and therein unique in the German literature. There is no French windbag of a servant, his master's confidant; instead the bawdy, rough, German Just. The innkeeper certainly has a typical businessman's character; but then again Franziska! How loquacious and snippy, yet still a good soul and valiant and modest. No trait of a French waiting-maid, to which the German ones in life and on stage still owe their origin. [...] The language unsurpassable! German: plain and honest. [...]\"Based on the servants Just and Franziska, this characterization of the stereotypical German as \"plain and honest\" is still pervasive in the imaginary of present day Germans, often alongside \"Michel\", Germany's average Joe. Commentary sections below German media reporting on the Greek debt crisis are replete with narratives of the gullible and well-meaning German being defrauded by malicious foreigners preying on his naivete. Likewise, plenty of Germans have justified their rudeness or impolite manners by invoking the \"roughness\" of German culture, which sometimes is really nothing more than a lack of savoir-vivre.Yet the play is relevant to modern times in more ways than this. Its narrative essence contains several streams, which I would like to see further developed in today's context, though they have been the source of artworks already:- the struggle of veterans with injuries and reintegration into civilian life and the effects thereof on veterans' relationships at home;- the reluctance of men to depend on women vs. women's still-ubiquitous economic dependence on men as the main breadwinners;- the absurdity of strict honor codes unless tempered by pragmatism;- the influence of society's and peers' judgment on the well-being of girls and women, especially if their \"virtue\" is questioned;- manipulation between both genders (Minna's manipulation of von Tellheim, flighty soldiers' manipulation of gullible girls while on campaign).Of course, the union of these streams into one seamless body is the mark of a true literary artist like Lessing."}, {"userName": "Luca_schneider", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/36771930-luca-schneider", "userReview": "Would like to see a play of it."}, {"userName": "Wickie", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/55116539-wickie", "userReview": "A Great Book about a Woman that Stands for her dreams and knows to Manipulate."}, {"userName": "Kathi Organa Sattler", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/49008527-kathi-organa-sattler", "userReview": "Lessing ist einer meiner liebsten deutschsprachigen Autoren, Nathan der Weise ist einfach ein Meisterwerk. Zu Minna habe ich vor allem deshalb gegriffen, weil es (wie Nathan) bei meinem Großvater im Regal stand und ich habe es wirklich genossen.Für mich hatte es etwas sehr shakespeare-haftes - ich war erst verunsichert, ob das nur mir so vorkam, aber die Anmerkungen hinten Buch erwähnten das auch. Jedenfalls ist es eine schön Komödie mit interessanten Verstrickungen und Verwirrungen. Es hat mich auch ein wenig an einen meiner Lieblingsfilme Hoch klingt der Radetzkymarsch aus den 50er Jahren.Auch die Charaktere sind sehr sympathisch, insbesondere die weiblichen Charaktere sind sehr schön ausgearbeitet und auch keine langweiligen charakterlosen Frauen, wie so oft in Werken dieser Zeit. Sowohl Minna selbst, also auch Franzi sind humorvoll und ihre \"List\" ist wirklich schön zu lesen.Ich hatte wirklich sehr viel Spaß diese Komödie zu lesen und hoffe bald Emilia Galotti zu lesen."}, {"userName": "·Karen·", "userReviewDate": "Aug 12, 2010", "userURL": "http://www.goodreads.com/user/show/1652898-karen", "userReview": "Miss Sara Sampson was heavy going, but this is a light-footed critique of masculine, military Prussian values in opposition to fulfilment and happiness in the private sphere. It's considered to be the first 'national' German drama, set in the contemporary world of the Seven Year War, and treating questions of regional resentments between Prussia and Saxony. It's a marvel how Lessing managed to spin a very simple tale into five entertaining acts, with a deal of tension."}, {"userName": "David Redden", "userReviewDate": "Aug 20, 2013", "userURL": "http://www.goodreads.com/user/show/1183419-david-redden", "userReview": "Lessing was very influential in divorcing European theater from the stifling limitations of the supposed three unities, and this is reportedly a well-loved play in Germany, but I couldn't get into it. I suspect it is meaningful for reasons I don't understand because of my distance from the time and culture. Or it could be that it is a good-natured and fun play, but that quality doesn't come shining through in the English translation. Either way, it was hard to appreciate."}, {"userName": "Ahmed", "userReviewDate": "Oct 29, 2010", "userURL": "http://www.goodreads.com/user/show/3108645-ahmed", "userReview": "ترجمة د/ مصطفى ماهر - مسرحية جيدة بها الكثير لتقراءاقتباس لبعض من جمل اعجبتني-\"وددت لو كنت اكثر تحفظا فقليلا ما يتكلم المرء عما يتحلي به من فضائل و كثيرا ما يتكلم عن تلك التي تعوزه\"-\"انت تحسنين فهم الاخيار من الناس فمتي تتعلمين تحمل الارذال؟ فهم ايضا بشر\""}, {"userName": "Ann", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/14269090-ann", "userReview": "I saw this performed on stage in Munich shortly after reading it and realized how much of the humor I'd missed on the printed page. I think plays must always be seen, not read."}, {"userName": "Dragana", "userReviewDate": "Dec 14, 2007", "userURL": "http://www.goodreads.com/user/show/684328-dragana", "userReview": "Comedy of manners too outdated for our time (especially for teenagers)."}, {"userName": "Patrick Bättig", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/31809262-patrick-b-ttig", "userReview": "Geschichte von Offizier und seinem Diener, der edle Frau und sein Diener dessen Magd heiratet"}, {"userName": "Naz Gul", "userReviewDate": "Aug 24, 2013", "userURL": "http://www.goodreads.com/user/show/23212587-naz-gul", "userReview": "كتاباته الاخرى كانت تحتوي معاني غاية في الروعة و لو انها كانت مجانبة قليلا للحقيقة..."}, {"userName": "Dania F", "userReviewDate": "Aug 10, 2014", "userURL": "http://www.goodreads.com/user/show/33479117-dania-f", "userReview": "Great classical comedy in five acts. Centered on the theme of honour and money. Entertaining short read with a great strong female character."}, {"userName": "Jessica", "userReviewDate": "Jan 25, 2009", "userURL": "http://www.goodreads.com/user/show/1238708-jessica", "userReview": "Irgendwie lustig, aber auch so antiquiert... pff!"}, {"userName": "Turtelina", "userReviewDate": "Jan 06, 2009", "userURL": "http://www.goodreads.com/user/show/1950-turtelina", "userReview": "A book that I had to read for Uni. One of the better Reclam booklets that we had to read so far. Even amusing at times. Enjoyable."}], "description": "Lessing was a German philosopher, writer and art critic. He writings during the Enlightenment Era were a major influence in German literature. Major von Tellheim is a disabled officer staying at an inn. His possessions are removed from his room because the manager believes he will not pay his bill. The plot twists around several turns and a betrothal ring is spotted by his former fiancé. She is overjoyed, but the honorable Tellheim will not marry, because of his poor financial condition.", "title": "Minna Von Barnhelm", "url": "http://www.goodreads.com/book/show/11121558-minna-von-barnhelm", "average": 3.37, "cover": "https://images.gr-assets.com/books/1421516664l/11121558.jpg", "reviews": 25, "authors": [{"url": "https://www.goodreads.com/author/show/7723.Gotthold_Ephraim_Lessing", "name": "Gotthold Ephraim Lessing"}], "type": ["Classics", "European Literature", "Plays", "Drama", "Academic"], "outlinks": ["http://www.goodreads.com/book/show/11121558-minna-von-barnhelm", "http://www.goodreads.com/book/show/18691316-minna-von-barnhelm", "http://www.goodreads.com/book/show/906321.Minna_von_Barnhelm", "http://www.goodreads.com/book/show/1509619.Minna_von_Barnhelm", "http://www.goodreads.com/book/show/10450496-minna-von-barnhelm", "http://www.goodreads.com/book/show/2326118.Minna_von_Barnhelm_oder_das_Soldatengl_ck", "http://www.goodreads.com/book/show/1097229.Nathan_der_Weise", "http://www.goodreads.com/book/show/1436901.Emilia_Galotti", "http://www.goodreads.com/book/show/12158.Laocoon", "http://www.goodreads.com/book/show/1011721.Miss_Sara_Sampson", "http://www.goodreads.com/book/show/2702147-die-juden"]}