{"ratings": 70959, "userreviews": [{"userName": "Erin", "userReviewDate": "May 17, 2007", "userURL": "http://www.goodreads.com/user/show/88024-erin", "userReview": "After reading the back cover of this book and learning that the story was about a man who had been killed in a horrific car crash, went to heaven and then returned to life 90 minutes later, I had high expectations for a riveting read. I was really disappointed. I survived a harrowing car accident 2 years ago so expected this to be somewhat cathartic. Instead, I found the story to be recounted poorly and disjointedly. By far the largest problem with the book however was that the author is a Southern Baptist minister and it often reads as a \"testimonial\" to the Evangelical tradition. While the one chapter that described his experience in heaven was fascinating, it was also disconcerting as it was heavy with traditional Evangelical tradition and belief (Christian songs were being sung by everyone in heaven and he approached the proverbial pearly gates). So I was left wanting to believe that heaven was truly as wonderful a place as he conveyed it to be - a most comforting thought in the face of loss and mortality - yet was somewhat convinced by his description that it was a heaven only an Evangelical could dream of and one that I would and could not experience. I was left to ponder the question - was this really heaven (and he was correct in the remaining 17 chapters that Evangelicals have been right all along and you have to \"give your life to Jesus\" to be saved and experience this) or was this simply his subconscious mind in some state portraying heaven as he wanted to see it or is heaven individual to everyone who experiences it? Thought provoking yes but counteracted by feeling like I was reading one very long piece of propaganda intended to convert me to the Southern Baptist/Evangelical tradition. No thank you."}, {"userName": "Books Ring Mah Bell", "userReviewDate": "Jul 06, 2009", "userURL": "http://www.goodreads.com/user/show/372363-books-ring-mah-bell", "userReview": "My mom is struggling with her faith as she fights cancer. She is concerned about dying, if she's going to heaven or hell, lots of questions like that. I had heard awesome things about this book from my Christian friends, so I told her to pick it up. Of course, the chemo brain mom purchased the short version of the book. (Which worked well for me, as she wanted me to read it when she was done. Shoot.) So.I think this is a lovely book for people of the Christian faith who are dealing with grief or end of life issues. Comforting, I suppose.At this point, those easily offended and/or those not open to religious debate may now leave the review.Seriously. If you are offended, go. Now.Last chance!Okay. I hated this book!I was going to mock Don Piper for needing help with a 100 page book, but then I realized we have the short version. (GOD BLESS YOU, Chemo Brain!) Look, I cannot get past the guy saying he was dead for 90 minutes.90 MINUTES!I work with people who have been \"dead\" for three minutes and can't wipe their butt, let alone recall being dead and write a book about it! (I know, I know, insert miracle here.) The author DOES say the gates are pearly white and the streets are golden! Whoo! Gold! These descriptions amke me imagine Heaven as a gaudy ass cruise ship.(Hello, Satan!)These lines actually made me LOL, and I'm pretty sure I was not supposed to LOL at this book: \"I'm really chilled. Could we stop for coffee? I think that would warm me up.\" Dick spotted a bait shop right on Lake Livingston, so they pulled over.I always get my coffee at bait shops. I prefer the nightcrawler blend. It's bold."}, {"userName": "Jessica Savage", "userReviewDate": "Apr 02, 2008", "userURL": "http://www.goodreads.com/user/show/922457-jessica-savage", "userReview": "Well, hmmmm, not real sure what to say about this book because I don't want to be negative but I was definitely disappointed. I guess I expected more of the book to be about the heaven experience, not all about the recovery process. I kind of felt like I picked up a book on rehabilitation after a severe accident. There were parts that were interesting, and I did take some powerful messages from it here and there, but for the most part it was just repetitive and kind of dragged on."}, {"userName": "Bert Gary", "userReviewDate": "May 01, 2008", "userURL": "http://www.goodreads.com/user/show/946773-bert-gary", "userReview": "Rev. Piper's description of \"heaven\" is brief and early in the book. If you want afterlife details, there are few to be found here. The problems are many with this book, but let me affirm Piper's ministry to persons confined to the fixator--a torturous contraption they use to try to save severely broken limbs. Piper presents several opportunities that he had to encourage and inform those who have to wear that thing. I commend him for that. I broke my neck and wore a halo for months. More than once I've had the opportunity to share my experience with someone having to wear that thing screwed into your skull. Not fun.The biggest problem with this book is biblical. I don't have enough space here to show you this (that's why I'm writing a book about it: Heaven for Skeptics, due out late 2008), but biblical heaven isn't defined as an afterlife destination in the Bible. For example, Matthew's Gospel uses the word \"heaven\" (ouranos) seventy-seven times in sixty-eight verses, and not one of them has anything to do with where you go when you die. Instead, most of them have to do with a relational reality that is both present and coming in Jesus.Jesus only spoke of the afterlife three brief times, yet modern evangelical Christianity plays the fear and death card up front, as if it's what Jesus talked about all the time, as if the whole point of Christianity is where you go when you die. Jesus rarely mentioned death and the afterlife. He spoke constantly about having Life real, rich, abundant, and eternal. He talked about what the kingdom of heaven is like, where it is, what you can do with it now, and how to enter it an live. Death, for example is mentioned by Jesus only only a couple of times (as defeated) in John's Gospel, but Life is front and center: nearly fifty times.I have no doubt that Piper had a real experience that changed him forever. My concern is that he's merged his experience with his own theological ideology and agenda, focusing on death and the afterlife via his testimony. Is death and the afterlife the point of Christianity biblically? No. It's not. So it disturbs me when preachers do that. Threats and emotional manipulation by fear-based and death-focused tactics is neither biblical nor Christian. The scriptures don't say we go to heaven when we die. They say that the kingdom of heaven is coming to us when Jesus comes on resurrection day: \"Thy kingdom come . . .\"Most of this book describes not Piper's \"90 minutes in heaven\" but pain, depression, recovery, and his present mission to tell his story. He had help writing it, but it doesn't show. It's rather wandering and repetitious. The good news, however, is that it's a quick read. It's a compelling story, admittedly. And while I don't recommend it for biblical and theological reasons, I wish Piper God's speed in his recovery and ministry."}, {"userName": "Wilma", "userReviewDate": "Sep 14, 2007", "userURL": "http://www.goodreads.com/user/show/231066-wilma", "userReview": "This book has received wonderful reviews but I had to force myself to finish it. Normally I love stories about near death experiences but I found this story poorly written and very repetitive. The author is a Southern Baptist minister and it appears that the music played in heaven is Christian. So if you're of another faith . . . forget it! Oops, sorry."}, {"userName": "William", "userReviewDate": "Oct 09, 2012", "userURL": "http://www.goodreads.com/user/show/4479674-william", "userReview": "Don Piper's book has a lot of problems. Let's start with the rather misleading title. Based on a title like \"90 Minutes in Heaven\" one might think that most of the book is about the author's experience in heaven. It's not. In fact Piper's description of his \"90 Minutes in Heaven\" takes about 15 pages out of a total of about 200. What the book's REALLY about is the lengthy recovery from his injuries, both physical and mental.From that perspective it's not really a bad book. (Not great, but not bad.) As Piper describes, his experience has given him the ability to empathise with and help many people who have been through very serious injuries and face lengthly and painful recoveries. His own struggle with depression during that time can--and apparently has--been inspiring to others dealing with the same problem. The best part of the book for me was reading how Piper was confronted by an older minister whom he respected. Piper wasn't comfortable letting people do things for him, but throughout his recovery his friends, family, and parishioners were constantly visiting and wanting to help. He wouldn't let them. On seeing this, the old man literally got in Piper's face and rebuked him for not letting his Christian brothers and sisters minister to him. PIper accepted the rebuke, began letting people minister to him and it made a big difference in both his life and theirs. But this where we also see one of the book's serious flaws: Piper offers no biblical or theological basis. Lots of good things are revealed in these pages, but Piper never takes the opportunity to show the biblical truth of them. The issue of the ministry of others would be an excellent opportunity to talk briefly about a biblical theology of the body of Christ...but he passes over it. In fact, with one or two exceptions, the only time the Bible is ever cited or even mentioned is in the chapter headings. What a missed opportunity.And speaking of missed opportunities: Piper speaks often about his visit to heaven allowing him to give others assurance of its reality, yet nowhere in the book does he communicate the Gospel. He does mention Jesus a few times. At one point he seem to \"kind-of-sort-of\" suggest that to get to heaven Jesus is involved...but he doesn't explain how. He speaks of one woman who \"became a Christian\" through his ministry and got assurance of heaven, but again he doesn't explain how. In the end I felt that with all the talk about reassurance of the reality of heaven Piper was pretty much enforcing the common assumption of our culture that justification is by death, not by grace through faith in the death and resurrection of Jesus.And what about the \"90 Minutes in Heaven\". I don't doubt Piper's sincerity. But I remain very skeptical. He wasn't aware of what was going on and admits to having pieced together the events from what others later told him. He was assumed to be dead at the scene when a prison medic couldn't find his pulse. As much as Piper was seriously injured, he had no serious head or thoracic trauma and no injuries to his brain or internal organs. Why would he have been dead? Sure he could have bled to death, but not that quickly. Piper was never pronounced dead by a coroner or a doctor. Frankly, the evidence presented is weak and very sketchy--as always seems to be the case with those who have supposedly been resurrected. Of note, Piper's vision of heaven seems to reinforce the common cultural image of being reunited with lost loved ones, but not much else. He speaks of the worship he heard, but notably absent from his vision is any of the three members of the Godhead. And the whole idea raises some theological issues. Those aside, the idea also runs counter to Hebrews 9:27: \"It is appointed for man to die ONCE, and after that comes judgment.\"As a book to encourage those who are dealing with pain and injury, this isn't a bad book, but there are far better. As for Piper's desire to assure people of the existence of heaven, I'm reminded of Jesus' parable of the rich man and Lazarus. The rich man died and found himself in hades. As he suffered torment he called out to Abraham and asked him to send to his still-living brothers, that they might know the reality of eternal damnation. Abraham replied, \"If they do not hear Moses and the Prophets, neither will they be convinced if someone should rise from the dead\" (Luke 16:31). Today we not only have Moses and the Prophets; we have the witness of Jesus and the Apostles as well."}, {"userName": "Jen", "userReviewDate": "Sep 16, 2007", "userURL": "http://www.goodreads.com/user/show/103117-jen", "userReview": "This book probably doesn't deserve the two stars that I gave it, and some people may be angry that I didn't rate it higher. I saw it at the bookstore, waited to get it on hold at the library, and in the meantime had it highly recommended by a patient's spouse among other people, so I was quite excited when it was available to me. Then the holidays hit and I didn't have much time and well, the book was due yesterday...no worries, it's a short read, and it promises to be a very interesting read to boot. Let's just say at times I needed to take some Ritalin to keep focused and finish the book today. Bottom line: great message, especially if you are a devout Christian or are a Christian and having some doubts about the afterlife, however, sometimes it was very repetitive and sophomoric writing. Don't get me wrong, there were things in this book that struck a chord with me and that at times gave me chills or brought me to tears, but I have read much more descriptive and eloquent delivery of a life story from people whose second language is English. Sorry, Don Piper, great underlying message through and through, but the writing could use some work."}, {"userName": "John Mark", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/7582778-john-mark", "userReview": "Have you ever wondered where you are going after you die? Do you even know where you're going after you die? Well in 90 Minutes in Heaven: A True Story of Death and Life written by Don Piper we find the story of Don Piper who died in a car accident, went to heaven, and came back to earth. He was driving home to Houston from the Baptist General Convention of Texas on Wednesday morning when he had to cross the bridge over Trinity River in a cloudburst. Right after the bridge there was a sharp incline going up that lacks drivers' visibility in both directions. Just before he cleared the bridge, an 18 wheel semi- truck sandwiched his small car head on. That's when he got a glimpse of what heaven is like. The next second he was standing in heaven with joy as he recognized a large crowd who stood just outside of heaven's gate as if they were waiting for Don. He saw people who died before him and they rejoiced being together again! \"It was the greatest family reunion of all,\" he stated, \"I had never seen, heard, or felt anything so real before.\" He saw dazzling colors and sensed that age had no meaning in heaven because there's no time in heaven. Heaven never gets dark because God is the light. As Don stepped closer to God he heard music. All the songs were praises to Christ as King of Kings. \"Everything was perfect,\" he pronounced. He joined the choir as he got closer to the gates, but all of the sudden he left them just as he got to the heavenly gates. The officers found no pulse in Don and his body was all mangled. Dick, a friend of Don, was in traffic so he got out to see what happened. God told him to pray for Don and guess what?! He came alive. Don felt a strong, powerful hand clasping onto his. He was taken to the ICU room in the hospital where he had many surgeries and an Ilizarov installed to keep his left leg together. Don suffered this extremely painful recovery for years. While he laid in the hospital bed he was very depressed and mad about why he came back to earth to feel all the pain. During that time many people visited him and asked if they could help him in some way, but \"no\" was all he said to them. Then Jay, a retired minister came to visit him. Pastor Jay noticed that Don was shutting out all the people who wanted to help him, which hurt both Don and his friends. So Pastor Jay told Don, \"you need to get your act together and you're cheating them out of an opportunity to express their love to you.\" When Don opened up more he realized that God had forgiven him for not giving the visitors an opportunity. He was depressed and in pain. Don complained so much for not knowing anything that would happen or why he had returned to earth. When he got tired of watching t.v he decided to listen to a song called \"Praise the Lord,\" and that's when his depression vanished. The next morning he was determined to keep on living and realized that God had a purpose for him in coming back to earth."}, {"userName": "booklady", "userReviewDate": "Jun 24, 2013", "userURL": "http://www.goodreads.com/user/show/350218-booklady", "userReview": "As I read this book I did my best to empathize with its author. I am very glad that he was able to learn lessons from his experience and allow God to bring Good from all the pain he had to suffer, for indeed, it sounds like he suffered a lot. That he has helped so many people since and his tragedy inspired so much prayer seem to be irrefutable and wonderful things.What I'm wondering is, why are these books so popular? What draws people to them? More to the point, ‘Why am \nI\n reading books on life-after-death again? What do they offer me?’ No doubt I have some expectations, probably unknown to myself, that this person's experience of ‘Heaven’ will fit my vision of it. When it doesn't, I am disappointed. And yes, maybe even a little put out with the authors that they are satisfied with their ‘Heaven’. Then I am reminded of the early Christian missionaries bringing ‘salvation’ to the Native Americans. When the priests, or the ministers (because denomination didn't matter in this case) described ‘Heaven’ to these tribes, they weren't impressed either. Our Western heritage ‘Heaven’ didn't sound like a place they cared to visit, much less be motivated to work toward.‘In my Father’s house there are many dwelling places. If there were not, would I have told you that I am going to prepare a place for you? And if I go and prepare a place for you, I will come back again and take you to myself, so that where I am you also may be.’ John 14:2-3Don Piper's description of ‘Heaven’ falls short of a heavenly realm to me. But then I am not him and I've not had to endure what he has. However, if this experience inspired so many to pray for him and helped him endure all the pain he had to go through—and is still living with (which seems to be akin to what St. John of the Cross called the Purgative Way)—then it would seem to be good fruit from a good tree. cf. Matthew 7:17Then again, I could be wrong ... because it wouldn't be the first time and I've never been to Heaven."}, {"userName": "Shay", "userReviewDate": "Jan 01, 2009", "userURL": "http://www.goodreads.com/user/show/776963-shay", "userReview": "I commend this author for the inner strength that he found within himself to be able to pull through such a horrific accident and recovery period. It made me realize how fortunate I am to have zero physical restrictions in my life, as well as my family. I was also touched by his willingness since the accident to reach out to many other people who had similar accidents. But I wonder how this story would have been told if he had not been a Southern Baptist Minister? I believe that his background in religion made this story very biased based on his religious beliefs. The last chapter left me feeling a little bitter. I was disappointed that he denounced other NDE's he has heard from other people over the years by saying they were too \"rehearsed\", when his own experience sounded as if it was pulled from scripture. It is quite arrogant of him to say he knows what he experienced was \"real\", not like anyone else's story. This is such a personal and intimate experience for any individual who have had a Near Death Experience (NDE). Everyone's story is \"real\" to them and should be accepted as such."}, {"userName": "Katie E", "userReviewDate": "Sep 01, 2011", "userURL": "http://www.goodreads.com/user/show/6182845-katie-e", "userReview": "90 Minutes in Heaven was a fantastic book! I loved it! It kept me interested throughout the whole thing. If you like books that touch your heart this book is for you. Also, if you've ever wondered what heaven is like, this is also for you. What made me want to read this book is the recent passing of a close family member. In the book, Don Piper gets in a car crash and is pronounced dead. He is welcomed to Heaven and spends 90 minutes there. He says that they are the greatest moments of his life and prays for God to take him back throughout his recovery. It shows how amazing things the Lord can do for us. He suffers alot of pain but, he makes great progress. The rest is for you to find out..."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Sep 22, 2015", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "Okay let me open with this (and a friend has pointed out how often I open with this information). I'm a Christian. I'm an assistant pastor in our congregation. So I approach this advisedly.First I can not speak to the experience but I approach the book with an attitude that Don Piper is speaking truthfully. I believe what he says. Some will argue that what he experienced was simply a dream supplied by his mind and that he was not dead for 90 minutes. They will assume that the EMTs simply either missed his pulse or that his heart somehow restarted sooner than the eyewitnesses noticed.Again I wasn't there. BUT Don Piper is relating what happened to him and telling the truth as he knows and believes it.One reviewer noted that the account can't be true as a person who had died for 90 minutes would have massive brain damage, that the brain under normal conditions can not be deprived of oxygen for much more than 3 minutes without irreparable damage. Of course the answer to that is that if God chose to bring this man back God could also deliver him from brain damage.I will simply suggest that you try to read the book with an open mind.Of course some will assume that the book is false and that the story is simply a scam. I don't believe that but of course I don't want to believe that of a Christian. Whichever way you go as noted try to keep an open mind.Now I do see one problem with the book and I'd like to give a heads up about it. The book is aimed at a Christian audiance and a non-Cothalic audiance at that. There is a lot of what I call \"Christianeese\". That is words and phrases that will ring with church goers (I'd say especially Baptist church goers). It's something many of us have to deal with as there are words and shorthand phrases that we get used to using among ourselves (for example \"prayer warrior\") that may not be clear to people who don't use those phrases regularly.I'd say don't let that put you off and try not to get annoyed. This book can be encouraging and I'd say try it yourself and see what you think."}, {"userName": "Mike Hernandez", "userReviewDate": "Mar 12, 2008", "userURL": "http://www.goodreads.com/user/show/988359-mike-hernandez", "userReview": "This book is about a guy who clinically dies in a car wreck for 90 minutes, until he miraculously comes back to life. While \"dead\" he experiences heaven and then proceeds to preach to everyone that will listen. I suppose if you are the spiritual Christian type, then you will find this book appealing and inspirational. I am extremely skeptical about these sorts of things and therefore can't relate well. The book was written by Don Piper with the help of an established writer. It was apparent the writer didn't have much of a say in the final product, as the author repeats himself numerous times until you want to beat yourself over the head with it. The other aspect of the book that I am not sure whether I liked or disliked, was the fact that I was under the assumption that the book was going to be almost entirely about the heavenly experience. Instead, there was ONE chapter about the experience, and about 19 other chapters talking about the pain of recovery (mostly the same thing over and over again). In all, I found the book redundant and boring, but the thought of an afterlife seems mildly interesting and the one chapter describing it is really the only redeeming quality of this book. My suggestion: read only the first two chapters and consider it a 'short' story."}, {"userName": "Leila", "userReviewDate": "Apr 15, 2008", "userURL": "http://www.goodreads.com/user/show/1029279-leila", "userReview": "**spoiler** reveals some of what’s in the book.The subject of this book had help with the writing. There is a lot that's repetitive. I don’t know if it was an effort to ‘pad’ the book and create more pages or to drive home certain points Don Piper wanted to make. It didn’t detract from the main message about Mr. Piper’s experience in heaven after he died and then his return to mortality and the anger he had. He struggled to learn what the mission God wanted him to accomplish by ‘sending him back’. You couldn’t help but laugh when he relates the speed in which the minister who was praying & singing over his dead body exited the wrecked car when the dead man began singing with him. He did learn many lessons, endured much pain in his rehabilitation & touched many hearts.I learned many lessons. One exceptional one I have to quote: “Some things happen to us from which we never recover, and they disrupt the normalcy of our lives. That’s how life is.Human nature has a tendency to try to reconstruct old ways and pick up where we left off. If we are wise, we won’t continue to go back to the way things were (we can’t anyway). We must instead forget the old standard and accept a ‘new normal”."}, {"userName": "Lyn", "userReviewDate": "Feb 19, 2009", "userURL": "http://www.goodreads.com/user/show/1075397-lyn", "userReview": "This book wasn't what I expected. One chapter describing a horrific accident, 2 chapters about a visit to heaven followed by several chapters describing a grueling recovery, rehabilitation and fight with depression, then a few chapters of personal back patting about how much the authors experience has helped others. Not exactly the inspiration someone suffering a loss would need. I read this book because I have a friend grieving the loss of her son and I thought perhaps this book might help her, I won't be passing it on because I think it would only depress her further."}, {"userName": "Kim", "userReviewDate": "Jun 11, 2013", "userURL": "http://www.goodreads.com/user/show/21223674-kim", "userReview": "a good book that gives you chills while reading"}, {"userName": "Andrea Cox", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/16407549-andrea-cox", "userReview": "I'm always skeptical of stories like this one, in which a person claims to have been to Heaven. When I saw the movie version of this book, I was emotionally moved and found hope in the story. Now that I've read the book, I have found the same hope in its pages that I saw on the screen. Whether or not Don Piper has been telling the truth about his experience in 1989, is not for me to decide. Only God and he know for sure. What is for me to decide is if I will be touched by Reverend Piper's ministry.There is hope to be found in his story. Not only that Heaven is a real place, but also that God desires to have a personal relationship with each of us. Also, that He is still in the business of miracles. I've seen miracles of various sizes in my own life, and I hope that you have too. They're there. We just have to look closely to find them sometimes. [This is not new information to me, but it might be for someone reading this review or this book.]What really pressed into my heart even more for having read this book is that keeping my eyes on God and keeping my prayer life strong and always growing are crucial to my relationship with God and my life and ministry here on Earth. May I always remember to \"seek first the kingdom of God and His righteousness,\" as advised in Matthew 6:33.May this book bless all who read it. May they find hope and a message from God that their hearts need to hear.I was not compensated for my honest review."}, {"userName": "Hstillson88", "userReviewDate": "May 12, 2017", "userURL": "http://www.goodreads.com/user/show/27510392-hstillson88", "userReview": "Red Dot Book Review— By: Hannah Stillson90 Minutes in Heaven By: Don PiperDon Piper, a local pastor in Texas, gets pushed to his limits as he realizes the difference between self-pity and hope. On a January morning, Don Piper was driving home from a pastoral conference. As he was driving over a bridge, a truck lost control and hit Don's car, flipping it over 3 times. Supposedly Don died and went up to heaven for 90 minutes. After Don's “death,” many people were called and informed, but what they didn't know was that they didn't have to say their goodbyes just yet.About an hour and a half minutes after the crash, Don comes back to life, miraculously alive and responsive. EMTs rush Don to the hospital and put him on life support. Through what seems to be the toughest year of Don's life, Don learns how to hold onto hope and not put a negative image on his mind.Throughout the book, many people say that surgeries are what saved Don's life, but I think that it was all of the prayers and support that made Don become a walking miracle.I would totally suggest this true story about death and life and how to hold on to what is important. This book definitely deserves 5 stars out of 5 because the content is clean, and the life lesson from the story is something that can be put into practice. Whether sitting down and relaxing or looking for a fast book to read, this book is good for anyone."}, {"userName": "Grumpus", "userReviewDate": "Jan 18, 2016", "userURL": "http://www.goodreads.com/user/show/146952-grumpus", "userReview": "Believers (like myself) will find this will find this inspirational. Non-believers, don’t waste your time because you’re only going to complain about it. Although I found the story inspirational, I think the title of the book is a little misleading. I was expecting much more detail about the heaven experience. This was only a small portion of the overall book. The majority of the book described the incredibly horrible accident that led to his visit to the “pearly gates” and even more so of his painful recovery (both mentally and physically) experience. Although he now knows why God sent him back, the recovery process was full of pain, suffering, and anguish. As this read was actually a listen, with the author doing a fantastic job doing his own narration, I don’t have exact quotes but two things stood out for me that gave me piece of mind.How can you lose someone when you know where they are?When I die, I know I’ll be with God. While I’m alive, I know God is with me."}, {"userName": "Kathleen Fuller", "userReviewDate": "Jan 24, 2016", "userURL": "http://www.goodreads.com/user/show/2131513-kathleen-fuller", "userReview": "I almost gave up on this book. Having lost several people in 2015, I wanted to know more about heaven. Instead, there's some description about what Piper saw and experienced in heaven (and all of it is wonderful) but this book is mostly about his accident and recovery--in vivid detail. That's when I nearly stopped reading, mostly because I'm squeamish. But I'm glad I continued, because I realize now that every bit of information about Piper's accident, pain, recovery, struggle with depression, and finding new purpose again is vital to understanding why we are here on earth when we yearn to be in heaven. I appreciate Piper's honesty in discussing his emotions. Although I initially wanted him to gloss over the more difficult parts of his story, I'm so glad he didn't. This book affected me in ways I never expected, but needed. Then again, God knew that. :)"}, {"userName": "Alayne", "userReviewDate": "Jul 21, 2008", "userURL": "http://www.goodreads.com/user/show/1125159-alayne", "userReview": "I think the author did a great job in describing a very difficult personal experience and how God used him to help others dealing with issues in life to bring them closer to God. I can only imagine how difficult it was for him to write this book. I think people who expected the entire book to be about his 90 minutes in heaven were disappointed. If you read this book with an open mind and no expectations, I think you'll get a lot out of it. Don Piper's message is to relate how God used him to help others...not to convince anyone of his experience."}, {"userName": "Kelly", "userReviewDate": "Jul 30, 2016", "userURL": "http://www.goodreads.com/user/show/47269270-kelly", "userReview": "These are the kinds of books that are so incredibly difficult to review because each reading experience will differ so much based on your background and beliefs. As a Christian, these books make me a little bit wary. I find them preachy and polarizing instead of encouraging, but if someone who reads this is uplifted or inspired by it, that is wonderful. This is just not my cup of tea."}, {"userName": "Franklin", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/12336450-franklin", "userReview": "This book is very sad, but also inspirational. You read about the torture the man must go through in recoverying from his crash, but it's inspirational because of the experience he had with God. Great book."}, {"userName": "Joshua", "userReviewDate": "Mar 26, 2013", "userURL": "http://www.goodreads.com/user/show/8427743-joshua", "userReview": "I really enjoyed the story and the style it was written. I also really enjoyed the fact that after his recovery, Don Piper was able to minister to many others going through similar issues. Did Piper really spend 90 minutes in Heaven? Only God knows."}, {"userName": "Keegan Otsuka", "userReviewDate": "Dec 14, 2011", "userURL": "http://www.goodreads.com/user/show/7165465-keegan-otsuka", "userReview": "Have you ever thought of one of the most frequent questions in the world such as, what happens when you die? Well within one book this incredible survivalist that has been to Heaven and back was able to exemplify and describe heaven in just 205 pages. This amazing book really helps improve your faith and has changed many lives, including my own. Through the imagery and tone 90 Minutes in Heaven has shocked and stunned many readers. \t90 Minutes in Heaven written by Don Piper takes you through the tragic yet beautiful tragedy from when Don Piper is mauled by a semi-truck in his Ford Focus. Don Piper is killed instantly but is miracally revived 90 minutes later. Just outside of Heavens gates, Don experiences the beautiful greetings by all his passed away loved ones. Don also explains how in Heaven he had no feelings of regret or sadness for his life. A great portion of Dons book is describing the feelings and looks of Heaven. Don goes on to describe the most incredibly beautiful music he's ever heard. Don Piper really makes many of his readers more faithful and helps his readers and believers become more comfortable with the struggle of religion.\tDon Piper has really opened many readers eyes to what lay upon them in the future. Don teaches us readers that through faith and prayers we can one day be able to me move to this precious paradise. Although the book has changed my life in many ways, I believe that after about 3 quarters of the book I got very bored. Don did not keep my attention very well and almost made me drop the book. I did finish the book and i give the book an overall grade of a B. It was awesome and changed my life including others but I think the ending could've been written better. I do believe Don Piper and do not have any doubts that he had been to heaven and back. I did enjoy reading this book and would recommend it to many christian believers and any one who is having a tough time with faith and religion. Many people can relate to this book who have had fallen loved ones, because they know from Don Pipers incredible experience that their loved ones are in a better place and that you will see them again."}, {"userName": "Liz Butler", "userReviewDate": "Feb 20, 2011", "userURL": "http://www.goodreads.com/user/show/3517357-liz-butler", "userReview": "Personally, and quite honestly, I think the title of this book should be \"I had a terrible accident and went to Heaven, where I spend 90 minutes, but really, let me tell you all about my recovery\".I had such high hopes for this book. I believe in Heaven and I believe it's glorious and I wanted to learn about it. But in the end, I was so disappointed by the fact that the author dedicated 1 out of 18 chapters to his time in Heaven, and left me wanting So. Much More! More than him telling me that the colors in Heaven were too amazing to really describe because he couldn't do them justice and I wouldn't understand. Or that the smells in Heaven are too delightful to really describe because he couldn't do them justice and I wouldn't understand. Or that the sounds of Heaven were too unbelievably beautiful to really describe because he couldn't do them justice and I wouldn't understand. And yes, the book is entirely too repetitive. Also, I felt that the author had little to no emotional attachment to his own story. I read fact after fact after fact, always wondering when he would really \"talk\" about his true emotions. In the end, I found it to be too repetitive, superficial, and detached."}, {"userName": "Kylie W", "userReviewDate": "Oct 23, 2009", "userURL": "http://www.goodreads.com/user/show/2761137-kylie-w", "userReview": "I gave this book a five because its my favorite book and is a very interesting story about a guy that was actually living. I just got done with 90 minutes in heaven and now is currently my all time favorite book. This book can be very emotionial because it involves death. The book 90 minutes in heaven is about middle aged guy that is going to go to his friends church to preach for him. On his way there he gets in a car crash and dies immedietly. His friend then came to the car scene and was praying for him. He then tells about how heaven is sooo beautiful and he loved it. When his friend was praying for him and singing for him even though he was dead he still did. 90 minutes later he came back to life. This day and forward he is now alive and healthy. If you are a very relious person you would love this book. This is a very interesting setting. This book is written by: don piper. Then person that wrote this book is the person that died. 90 minutes in heaven is a book or scene that is real and has actually happened in real life."}, {"userName": "Karen Wingate", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/51582064-karen-wingate", "userReview": "90 Minutes in Heaven by Don Piper moved me in a profound way. At first I was skeptical of the book but when I met the author last summer, I knew I had to read it. I found it the other day in a box of books a fellow church member was disposing of. I read this book in less than 24 hours and felt on the edge of tears through most of it.Two things surprised me. First, Don is so transparent and honest. His description of Heaven is actually reserved which proves to me he was not embellishing his description of Heaven one bit. Second, he spends only two chapters talking about his actual experience in Heaven. The rest of the book deals with his recovery from the horrific car accident and how his experience in Heaven impacted his attitude toward his recovery. He emphasizes the place of prayer in his recovery and that yes, miracles can and still do happen. Finally, it’s so obvious – Heaven is for real. As Don said last summer and as this book intimates, you really do want to go there. Are you sure you are going? If you aren’t sure, do something about it. Get to know Jesus and understand what He did for you – now."}, {"userName": "Christina", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/8184561-christina", "userReview": "Whether or not you believe Don Piper spent 90 minutes in Heaven, this book is truly eye opening. Having experienced a traumatic injury, his story hits home. The struggle with depression, the endless nights of pain, the desire to cry because you know your life will never be the same, people staring and asking questions. It truly is inspirational just to read about the struggles he went through."}, {"userName": "Lisa", "userReviewDate": "Jan 17, 2010", "userURL": "http://www.goodreads.com/user/show/1843178-lisa", "userReview": "I would have never read this book except my daughter gave it to me as a gift. I was a bit wary of the premise of the book - a man in a car accident is clinically \"dead\" for 90 minutes, and supposedly spends those minutes in heaven.On the positive side, most of the book is not so much about his time in \"heaven\", but about how he deals with his very long recovery from a very serious car accident. I liked that aspect of the book. He is a pastor, and his Christianity shines through the book. He shares wonderful insights regarding how Christians can deal with suffering, and reminds us that we need to comfort others who are suffering. He also reminds us that heaven is a real place, and anticipation of future joy in heaven can get us through lots of hard times on earth. Those insights and the challenge to spend more time comforting those who are suffering are the high points of the book.My main concern with the book is I'm not sure the author was in heaven, though he repeats continuously that he was there. I think he is right to use his experience to help people remember that a wonderful, real place like heaven can be our final destination. However, I am not convinced that he was there. Perhaps while unconcious, he started \"thinking about\" or \"dreaming about\" all the people he knew on earth who had died, and then after waking up, the dream seemed very real to him.So if you want to read a book about someone who suffers deeply, has strong faith, and shares how he dealt with the tragedy by turning to God for strength, then I recommend this book. One last comment - the book is not too well written. The writing style, character development, etc., don't pull you in and keep you turning pages."}], "description": "As he is driving home from a minister's conference, Baptist minister Don Piper collides with a semi-truck that crosses into his lane. He is pronounced dead at the scene. For the next 90 minutes, Piper experiences heaven where he is greeted by those who had influenced him spiritually. He hears beautiful music and feels true peace. Back on earth, a passing minister who had also been at the conference is led to pray for Don even though he knows the man is dead. Piper miraculously comes back to life and the bliss of heaven is replaced by a long and painful recovery. For years Piper kept his heavenly experience to himself. Finally, however, friends and family convinced him to share his remarkable story.", "title": "90 Minutes in Heaven: A True Story of Death and Life", "url": "http://www.goodreads.com/book/show/89375.90_Minutes_in_Heaven", "average": 3.91, "cover": "https://images.gr-assets.com/books/1441247008l/89375.jpg", "reviews": 3117, "authors": [{"url": "https://www.goodreads.com/author/show/39054.Don_Piper", "name": "Don Piper"}, {"url": "https://www.goodreads.com/author/show/11099.Cecil_Murphey", "name": "Cecil Murphey"}], "type": ["Nonfiction", "Religion", "Spirituality", "Christian", "Autobiography"], "outlinks": ["http://www.goodreads.com/book/show/89375.90_Minutes_in_Heaven", "http://www.goodreads.com/book/show/6583320-90-minutes-in-heaven", "http://www.goodreads.com/book/show/290361.90_Minutes_in_Heaven", "http://www.goodreads.com/book/show/26386160-90-minutes-in-heaven", "http://www.goodreads.com/book/show/447834.Heaven_Is_Real", "http://www.goodreads.com/book/show/182640.Daily_Devotions_Inspired_by_90_Minutes_in_Heaven", "http://www.goodreads.com/book/show/7089923-90-minutes-in-heaven-member-workbook", "http://www.goodreads.com/book/show/12963822-encouragement-from-90-minutes-in-heaven", "http://www.goodreads.com/book/show/10228547-getting-to-heaven", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}