{"ratings": 12786, "userreviews": [{"userName": "Susanne Strong", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/4514828-susanne-strong", "userReview": "5 Stars (I’d give it more if I could)!!Mississippi Blood. It is over. This is it. The end. How can that be? I am at a loss, yet I am amazed and stunned. Mississippi Blood and the entire Natchez Burning Trilogy is a masterpiece.“Mississippi Blood is Different. … There’s Strength in it too. Strength that’s been beat but not Broke. That’s Mississippi Blood.”Like I said, this is it for Penn Cage. There is nothing left. And in his life he has endured a lot. More than most. He has lost almost everything. His family is under attack by Snake Knox and Double Eagles and he is under armed guard. Every Second of Every Day. Penn fears for his daughter, Annie’s safety. And even the FBI can’t keep them safe. Penn’s father Dr. Tom Cage is on trial for murder and doesn’t even want his son’s assistance. Quinton Avery, the most reputable attorney in the State, is his father’s attorney and both are keeping Penn out of the loop. Dr. Cage is self-destructing. And no one knows why. Not even Quinton. And Penn’s half-brother, Lincoln Turner, is hell-bent on destroying the Cages. As the trial moves forward, more buried secrets come to light. Yet the past never stays in the past. Even though the Double Eagles want it to and will harm whoever they have to, in order to try and keep it there. Race relations still run rampant here and the violence exists all too often. Yet Penn is resilient. And his family means the world to him. Thus Penn does what any son would do. Find people who can help his father, regardless of the consequences. Luckily for him, he gets some help, in the form of Serenity Butler, a famous writer and former army officer, who steps in to help him battle the Double Eagles, as does his old friend Rusty. In Mississippi Blood, Penn learns some more hard truths about his family and his friends. Most of which he doesn’t like. Some of which surprises the heck out of him. And us too, if I’m being perfectly honest. Sometimes however, he finds that there is still goodness in people. And Strength too. Mississippi Blood. Penn Cage desperately wants to believe in his father. He wants to believe in truth and in justice. In family. But in this trilogy, those ideals are shaken to the core. This trilogy leaves nothing on the table. It takes every single emotion from you. I don’t know how Greg Iles does it. This trilogy is complex yet simple. The books are bold.. so many interwoven storylines that meld together so well. With characters you loved. And characters you loved to hate. I love Penn Cage.. he’s like a friend who I’ve known for over ten years and have had coffee with and Tom Cage is like my dad, who has broken my heart a thousand times over. These are character you live with. Greg Iles makes you feel what they feel. When they suffer you suffer. I cried so many times reading these books.. Sometimes sobbing, and sometimes just releasing small tears. Sometimes smiling with wonderment at these characters who I know. With every cell. Every nerve ending. I admit that these books aren’t for the faint of heart. There is violence, there is defilement, there are assassinations and murder. But there is also the love, laughter and loyalty. And “Strength that’s been beat but not Broke.”In short, this trilogy has it all. They are suspenseful. They are masterful. There is never a dull moment, nor is there ever a moment when my attention drifted or the storyline dulled. The Natchez Burning Trilogy (Natchez Burning, The Bone Tree and Mississippi Blood) is brilliant. Like I said, It is Greg Iles at his most incredible, his most talented. It doesn’t get better than this. He is one of the best authors I have ever encountered in my lifetime and this trilogy/series is the best I have ever read. It is a masterpiece. *This Trilogy can be read without having read any of the other Penn Cage novels and if you haven’t read any books by Greg Iles, I IMPLORE you to do so. Start with Natchez Burning. Yes the trilogy is long. Yes it will take time. But it is worth your investment. Trust me. My favorite characters in the Trilogy (in no particular order) include but are not limited toPenn Cage;Caitlin Masters;Sleepy Johnson;Henry Sexton;Albert Norris;Serenity Butler;Quinton Avery;Annie Cage; andTom Cage.You guys rocked. Each and every one of you for different reasons. Thank you Greg Iles for giving the readers this most incredible gift. I loved each and every second of it. Thank you also for persevering.Published on Goodreads and Amazon on 4/7/17."}, {"userName": "Nancy McFarlane", "userReviewDate": "Nov 06, 2016", "userURL": "http://www.goodreads.com/user/show/3130731-nancy-mcfarlane", "userReview": "I would give this ten stars if they were available. I couldn’t wait for the third installment of this masterfully written trilogy. And now, I’m sorry it’s over. Greg Iles is a magnificent story-teller; a genius with a pen. A history lesson, a love story, betrayal, a murder mystery, harrowing action, spectacular courtroom drama, corruption, incredible sadness… Everything one could ask for in a well-written story. Iles definitely saved the best for last. Mississippi blood is definitely thicker than water."}, {"userName": "Tammy", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/19481265-tammy", "userReview": "AAAAAAAAHHHHHHH!!!! So good it makes me want to scream! The tension has been building throughout the series and this is a perfect culmination. Isles is a master at character development and describing action. I love that Penn is not a noble character who always does the right (lawful) thing,..he does what's necessary to protect his family. One of the best thrillers I've ever read! ❤️❤️❤️❤️❤️"}, {"userName": "Brenda", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/5240149-brenda", "userReview": "I started reading the Penn Cage books in 2009 and really enjoyed the characters and the setting. I felt awful when I read that Greg Iles sustained life-threatening injuries in an automobile accident in 2011, but the accident changed his outlook toward his writing and this trilogy within the series was born.With this trilogy, Natchez Burning was a 5-star book for me, the second book was 3 stars, and this final third gets 4 stars. I applaud the author for his honest portrayal of life in Mississippi, including the racial tensions between some people and the accepting and friendly behavior between the races in other people. Even the cruel and disgusting acts of whites towards blacks in 1968 were not glossed over. As for the Cage family and their allies, it’s been a long involved history over the six books. There may be more Penn Cage books in the author’s head, but I’d be satisfied if Penn’s story ended with this book.The problem I had with all three books in this trilogy is their length. The books are physically huge and heavy, so for me ebooks were the only way to comfortably read them. I learned that the hard way by reading Natchez Burning’s 791 pages in hardcover."}, {"userName": "Mel", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/7182738-mel", "userReview": "Sometimes I catch myself about to write a review, wondering, \"and just who do you think you are, Miss Never Published Anything Substantial who thinks punctuation marks can be used like crayons or Legos?\" Then I read the professional writers on writing and whole books about so-you-want-to-be-a-novelist that contradict each other; well-known phrases like *kill all adjectives,* and read Faulkner; *say it simply,* then read Nabokov; and so on with the controverting. If I'm really in an contemplative state, or over caffeinated, I wonder about the function of editors; the relationship between an author and an editor, particularly an accomplished author and a novice editor. I'll have to look into this further...does Ms. Editor casually return a red penciled manuscript to Ms. NY Bestseller List then simply wait for the suggestions and corrections, or drop the packet and make a serpentine run for cover? What is an editor held accountable for in the publishing world? What is their culpability? Does size matter? Sometimes, I'd like a star designated just for the editing (or lack thereof), but then I'd be accountable for qualifying more of my opinion when I'd really just like to sit back in a creaky rocker on the porch, sip on some sweet tea, and watch the pee-cans drop, ignore that comment by a friend, \"It could've been edited to 2/3rds the book\" that interrupts my fading hold on Iles' South. My humble opinion: Iles' editor could cut a little. Contrariwise, I always am a little sad when I've finished inhabiting Iles' Mississippi -- gators, deviants, words and all.I've read the trilogy, and advise readers against reading this third book in the Natchez Burning Trilogy as a stand alone novel.  Natchez Burning, 791 pgs.; The Bone Tree, 804 pgs.; Mississippi Blood, 704 pgs. The history contained in these books is interesting and great storytelling. Iles continues this third book, true to form: wordy and repetitive in places, violent, but good atmospheric read rich in history. I am intrigued by the South of many authors, thereby a reliable habitué. Plots seem satisfactorily tied up, though emotionally you want more for these characters you've been involved with for the past few years and 2300 plus pages. The myriad, or community, of characters dead or accounted for, some mourned, some hissed and booed in their dying throes. There remain some questions (if you can remember back through the evolution of the trilogy), possibly hinting at a new direction for Penn Cage. Personally, I hope Iles lets Cage go out while on top, but I say that today knowing I'll miss him enough to regret that thought. There's always the brother....The author writes an entertaining Southern crime thriller, some of the best as far as layered storytelling. He could be accused of excessively requiring suspension of logic and reality. You know this if you've sat in on legal proceedings. But reality is overrated, especially in Fiction. I noticed some changes with the author's style, subtle throughout the trilogy, undeniably obvious once the author killed off Caitlyn at the end of the second book. The death of Cage's long-time fiancé marked a shift in this lawyer's libido, as written by Iles. Respectable lawyer Cage is looking lustfully at the babysitter (and she's looking back). Is the author feeling his age rather than the character feeling his? It felt awkward and out of character, as did his sudden in flagrante delicto affair. I wasn't quite convinced or appreciative of this new romantic direction. It was lacking Cage's otherwise impeccable style.Prepare for plenty of violence, rape, and defilement that is almost painful to read, a staple of Iles' South, and a spotlight bright on the racial disgraces of our past. Several times characters refer to their story as the most vile story ever. When characters point that out to me, the reader, I get an uncomfortable feeling that there is a oh yeah, well top that! thing going on and the substance gets lost in too many dark shadows that are already cast by actual history. Iles has always written about *Justice* and *Equality,* a conscience of the horrific deeds committed by horrible people against good people, so that's not a new theme, just expect it to be expanded. I'm still thinking about that epilogue, if it served the story or capitalized on the current political pulse. That may be a chicken or the egg question to ponder on my next spell of contemplation. Just for fun: Greg Iles is an interesting character himself, and a prolific writer with a pack of likewise gifted and prolific friends that occasionally put down their pens and pick up a musical instrument. The Rock Bottom Remainders: Stephen King, Scott Turow, Mitch Albom, Amy Tan, Matt Groening, Dave Barry, Roy Blount Jr., James McBride, Ridley Pearson, Greg Iles, Sam Barry, and Roger McGuinn. Not a bad line-up, with the claim: \"The Greatest Rock Band Ever (of Authors).\" After watching a video clip and reading the comments, the repartee might be better than their music. “We play music as well as Metallica writes novels.”-Dave Barry“Rock Bottom Remainders? Who the hell are they?” -Kirk Hammett, Metallica“There’s an audience out there, and the key is to kick it in the ass.” -Stephen King“Roy actually coined the term for our genre of music; ‘hard-listening music.’” -Dave Barry https://www.youtube.com/watch?v=VJ_FcdFIJqULooks like the most fun you can have with either ear plugs or a couple of good stiff pre-performance drinks. ☺"}, {"userName": "Skip", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/1389748-skip", "userReview": "The sixth and final book in the Penn Cage trilogy. I really think Greg Iles is among the best writers of \"Southern secrets.\" However, I think the scope of this book was a bit too narrowly focused on the trial of Penn's father, highly respected Dr. Tom Cage, and the legal strategies of his defense lawyer and prosecutor Shadrach Johnson. In fact, I though the book was strongest away from the trial: the visiting award-winning writer, the new witness that can sink the Double Eagles, and the young reporter who suffers a viscious, life threatening attack early in the book. That said, the book still resonates with tension, and I will miss this series. Too bad that the bad guys got off without real punishment. Please write again soon Greg!!"}, {"userName": "Amy", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/1176005-amy", "userReview": "I have read the entire series and felt nothing was gained by this book. Almost 700 pages of rehashing the same thing (the entire series) and extremely repetitive (how many times do you threaten to take the case from someone?). All telling and the action only served to kill off or harm people. The ending was just unsatisfactory. I even figured out who Tom was protecting early on. Not a fan of Penn in this book as Caitlin's body is barely cold in the bag before he is in bed with someone."}, {"userName": "J.T.", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/1864586-j-t", "userReview": "Maginificent finish!"}, {"userName": "Kevin", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/896357-kevin", "userReview": "Penn Cage, Natchez, Mississippi mayor, continues the fight against the \"Double Eagles,\" a militant branch of the KKK. These villains are the worst of the worst, vilest of the vile racists who have terrorized the area for decades. Penn has surrounded himself with true friends who would die to protect his family and fight against these villains.Penn's father, who became one of the most respected doctors in Natchez, is on trial for the death of his nurse Viola. He seems bent on self destruction. His trial is one of the key subjects of this book. The subject matter is extremely violent, the racial slurs are painful, but the fight against injustice is inspiring."}, {"userName": "Mainlinebooker", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/600545-mainlinebooker", "userReview": "The final chapter in Greg Iles's trilogy includes Natchez Burning, The Bone Tree and finally Mississippi Blood. I was biting my nails waiting for this superb conclusion to one of the best series I have ever read. It took over 8 years to finish and I am sure readers who have been following this have been wondering what would happen to their main characters. This series is so special that it is being adapted for a TV series by Sony Pictures. You really need to read the books in order to achieve the full depth and comprehension of the events that took place. Despite being 800 pages, I was so absorbed that I stayed up to 1am to finish. The setting takes place in Natchez, Mississippi where Tom Cage's father is accused of the murder of his former African American nurse with whom he has had a love affair. Despite centering on the trial, the former issues of the white supremacy group whose cunning leader\"Snake\" are explored along with reconciliation, forgiveness,and family love. A conclusion that is so worthy that I want to shout it from the rooftops.If you miss this series, it is your loss..."}, {"userName": "Liz", "userReviewDate": "May 03, 2017", "userURL": "http://www.goodreads.com/user/show/20625013-liz", "userReview": "To say it’s been difficult for me to disengage from this book over the last several days would be putting it lightly. Am I surprised by this? No. This is simply what happens when I pick up a book written by Greg Iles. I’ve read all the full length Penn Cage novels, but this one is the culmination of a three-part story that began in Natchez Burning. It’s an extensive and intricate story that reaches back through generations into the civil rights era, exploring the hate, murder, and racial violence that festered during that time. It’s also a painful story and Iles does not shy away from descriptive violence or harsh language, so consider yourself warned. Because this book is so closely tied with its two predecessors, it is nearly impossible for me to review this book on its own merit. I think it’s enough to say that this whole trilogy is a driving and relentless pursuit of the truth. The road to that truth is soaked in the blood of many people, some of whom you have come to love, some who are evil, and some who are only caught in the crossfire. I’ve been yearning for revenge, out for murder, and rooting hard for Team Cage. I’ve been on the edge of my seat, kicked in the gut, had my heart broken. All in the span of about 2,000 pages overall. I’m not sure I know of another author who can make me feel and hold my attention the way that Greg Iles can.All of the stars for Natchez Burning - The Bone Tree - Mississippi Blood."}, {"userName": "Moonlight Reader", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/5664767-moonlight-reader", "userReview": "[The biggest problem that I had with the end, though, was the sense of disappointment in the fact that a full reckoning was avoided. Forrest Knox is dead, and his corruption went to the grave with him. Snake Knox is dead, and never had to face his crimes through any sort of institutional system of justice. Billy Byrd is still the sheriff and remains corrupt - lower level corruption, sure, but still corrupt. The Double Eagles have largely been dismantled, but their foot soldiers remain able to wreak small scale havoc on the community. I wanted a Byron de la Beckwith moment, where even though justice delayed is justice denied, even something so imperfect is better than nothing. I wanted Snake Knox led away in shackles to die in a tiny cell in the bowels of Angola, and Billy Byrd indicted, convicted and incarcerated. I wanted the truth about the Louisana State Police to have been revealed, and the money men behind Forrest Knox's plan revealed for the cynical, monstrous plutocrats that they are. (hide spoiler)]"}, {"userName": "Tim", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/17042835-tim", "userReview": "Too long, too brutal, 2 stars of 10."}, {"userName": "Bruce Humbert", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/4069626-bruce-humbert", "userReview": "Wow, not sure what book others were reading - but I found this to be a huge disappointment and waste of time - jumped ahead about 8 hours worth and found the ending very disappointing"}, {"userName": "Judy Collins", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "The 30 Best Books of 2017EPIC! 10 stars — Secrets of Mississipi’s violent past and a KKK group called Double Eagles are revealed. At the heart, the big question: Who killed Viola Turner? Natchez Burning   The first installment in an epic trilogy that weaves crimes, lies, and secrets past and present into a mesmerizing thriller featuring Southern mayor and former prosecutor Penn Cage, whose quest for the truth sends him deep into his father’s past.  Top Books of 2014  The Bone Tree   In this second volume, Penn is caught in the darkest maelstrom of his life, as he fights his way out of the war he unwittingly started with a violent offshoot of the KKK, the Double Eagles, and continues to hunt for the truth about dark deeds from the 1960s.  Top Books of 2015 MISSISSIPPI BLOOD  The endgame is at hand for Penn, his family, and the enemies working to destroy them. Featuring a trial scene that Publishers Weekly calls “among the most exciting ever written in the genre,” this novel delivers the shocking resolution Greg Iles’s fans have eagerly awaited.  Top Books of 2017The King of Southern Fiction, Greg Iles returns with his highly anticipated Natchez Burning trilogy,  with his finale: MISSISSIPPI BLOOD  – where we pick up following the murder of Viola Turner and the high profile trial of Dr. Tom Cage. The Penn family is in crisis. Sins of the past still haunt the present. Greg Iles is a master  Southern storyteller and no one can compare! Skillfully crafted, a brilliant mix of Southern, historic, crime thriller, suspense, and classic literary fiction at its finest. He uncovers the moral outrage of racism, corruption, and hatred which has been a part of our history and still exists today- years after the Civil Rights era. “Mississippi blood is different. It’s got some river in it. Delta soil, turpentine, asbestos, cotton poison. But there’s strength in it, too. Strength that’s been beaten but not broke.” ― Greg Iles, Mississippi Blood Picking up from  The Bone Tree, the Mayor of Natchez, Mississippi, former Houston prosecutor, and novelist Penn Cage is still grieving the loss of his fiancée Caitlin Masters. He still wonders if ghosts exist. He spends time visiting graves. Henry Sexton is dead. Caitlin is dead. Annie’s mother is gone —cancer took her to her death. Presently, Penn is dealing with his dad’s upcoming murder trial. Local physician, Thomas J. Cage is being held in protective custody in Louisiana by the FBI for the murder of Viola Turner, his former black nurse, and mistress. He was not even allowed to attend Caitlin’s funeral. Penn has not spoken to his dad, Tom since Caitlin’s death. The case has drawn national attention.  Dr. Cage is accused of murdering his former 65-year-old black nurse in the wake of a pact that would have required him to euthanize the terminally ill woman who had been his employee thirty-eight years earlier.In the final stages of lung cancer, she had returned to Natchez to die from Chicago. Being Cage is white and Nurse Turner was black, also complicated matters. In addition, it was recently revealed she had a child (Lincoln Turner) by Dr. Cage in 1968 while he was married. She was a widow at the time after her husband had been killed in the Vietnam War. Assisted suicide?  Or if administers the drugs, it is murder. A mercy killing? He was charged with first-degree murder.However, what really happened that night?  Did he administer drugs, or when he left, who came in next? Did Viola inject herself or something more sinister at play? A botched injection? A heart attack? An overdose or the wrong drug? So many questions and few answers. What about the Double Eagles?  Are they to blame? They have a history. Viola’s family wants justice. Lincoln set the investigation in motion. Does he have his own agenda? There is John Kaiser of the FBI. Cage is being held in protective custody because he is a material witness in a major federal investigation and his life is in danger. He is being represented by African-American civil rights attorney Quentin Avery of Jefferson County, Mississippi, and Washington, DC. Dr. Cage is keeping quiet.  Avery his African American attorney in a wheelchair cannot discuss his case with Penn. What does Snake have to do with Viola’s murder? A recording of that night? Who are they protecting? The civil rights era of the 1960s remains present. Viola Turner’s brother (a civil rights activist) was murdered by the Double Eagle in 1968. She was also raped repeatedly by the same group and the KKK. Upon returning to Natchez, this brought fear to the group. They want her dead.  They had warned her. Penn’s family is still under attack by Snake Knox and Double Eagles and the FBI cannot be counted on to protect them even though they live surrounded by bodyguards. Penn is raising his 11-yr. old daughter, Annie and his mom is staying near the prison in a motel, so he brings in the babysitter, Mia who has worked with them previously. His mom wants him to forgive his Dad enough to visit him in prison. However, if his father  had not hidden the truth of what inspired on the night Viola Turner died, Caitlin would never have become obsessed with Henry Sexton’s quest or picked up his torch after he martyred himself to save them, or followed a bloody trail to the abomination called The Bone Tree.  She would be alive. They would be together in Edelweiss, their dream home with Annie and well on their way to a child together. Penn’s work is suffering, and he is questioning his sanity. Who is Quinton trying to protect? His family has imploded. His father had two sons  and one of them was doomed to be an orphan. The happiness of his childhood was bought with the pain of a black boy who had hurt no one. He had a brother and long after his father passes his blood will flow through both their veins.. . . “A man who has known love and grief and understands that one is the price of the other.” An upstanding physician  and friend to many. A man, not perfect. Dr. Cage is self-destructing and has every puzzled. Penn’s half-brother, Lincoln Turner, is hell-bent on destroying the Cages. Race relations, violence, corruption, evil, and those with hatred. Even though Lincoln and Penn have the same blood running through them, they grew up differently. To Lincoln,  he had nothing growing up and Penn had it all. They are opposites. When Penn was striving for a baseball championship, with a highly respected physician and mother, Lincoln was scrapping in the streets and running from the Chicago PD. His stepfather was in and out of prison or gambling away his wife’s salary. All along  while Penn was moving from a successful legal career to an author of legal thrillers, Lincoln was slaving in a small firm, chasing small-time cases until he was finally busted for embezzling escrow funds from a client trust fund. Doing so in a desperate attempt to save his stepfather (which he thought was his father), from a long prison term and had his license suspended. Penn can only image Lincoln’s rage.  Now his mother is dead, and he wants someone to pay. Justice. Payback. Lincoln is the living symbol of his father’s sin. Perhaps, his crime. After all, it was Lincoln who set in motion the murder investigation. And now Lincoln haunts his city, his family like some dark, retributive spirit. Yet, Penn is resilient.  Family and friendships are important. He must find a way to help. He can only hope that Lincoln can free himself from the lies that shrouded his youth and become what Viola dreamed he would be. A man who embodies the best of both his parents. Can the two brothers join forces  and work together to solve this horrible wrong, to find the truth and attain justice for both father and mother? Time is running out for Dr. Cage. Unless Penn is successful at exposing the past to exonerate his father, his family will be destroyed. “ . . .Right meant more than might; that being faithful and good meant more than being rich; that honor superseded all.” Readers are introduced to a new character, Serenity Butler,  (love her), a famous writer (light-skinned African American), and former army officer who steps in to tackle the Double Eagles. The beautiful and talented writer in Atlanta, from Mississippi originally. He cannot trust anyone, even his mother. However, he joins up with a young black author and former soldier named who has come to Natchez to write about Dr. Cage’s case. She may be his best ally. To help expose the dark secrets. Formed in the 1960s,  the group’s mission is terrorizing and murdering African-Americans, and they are still at it today. The Double Eagles have reasons to want Viola Turner dead, and if their involvement can be proved, it will save Tom. Penn has to find a way. Heartwrenching, raw, emotional, complex, intelligent  – Penn Cage desperately wants to believe in his father, the family martyr. The decisions his dad makes have terrible consequences for the entire family. Penn is tested. He wants to believe in truth and justice, but his beliefs and values are threatened and shaken to the core. No one can rest until the last of the Knoxes are jailed, and the Double Eagles smashed for all time. Rich in Southern history,  –From crusading journalists, racism, half-brothers, old lovers, old grudges, corruption, blacks-whites, fathers/sons, sons/mothers, strong family ties, protecting others, revenge, power, justice, and survival – Iles is at the top of his game with this extraordinary trilogy. Superb character development, action-packed with page-turning suspense —bringing the saga to a satisfying conclusion. While at the same time exposing the ugliness, cruelty and shameful episodes of our past. Unfortunately, not only does it exist in the American South - it is widespread. In 2011  the author was badly injured in an automobile accident and almost died, losing his right leg below the knee. Afterwards, he chose to go deeper with the story about family, race, prejudice, and secrets. His work is commendable! Of course, we fans are delighted with the news: Sony Pictures TV is developing a cable series based on the books, with producers Tobey Maguire and David Hudgins (a Dallas native) and director John Lee Hancock (“The Blind Side”) attached. Can't wait! Let's hope they film it where it all took place, due to the author being an expert. Would not have the same impact, filmed elsewhere. If you have reviewed Iles' website you know (house/office) property is for rent in Mississippi, due to the steps. One of these days, my wish is to visit and experience the journey, while touring the places and landmarks in the book. Enjoyed reviewing The Map.   “Mississippi Blood”  is the capstone to what could legitimately be called a magnum opus. Iles has emerged from an excruciating ordeal to create a superb entertainment that is a work of power, distinction and high seriousness. These are angry novels, filled with a sense of deeply-considered moral outrage. They are also prime examples of what the thriller— and other forms of “genre” fiction — can accomplish when pushed beyond traditional limits. Often grim and frequently horrifying, these Natchez Burning novels set their larger historical concerns against the credibly detailed backdrop of a family in crisis. As the Cage family endures its own trial by fire, Iles shows us both the weaknesses and strength of people tested by extreme circumstances and by secrets and lies that have festered for too long. In successfully illuminating both the inner life of a family in peril and “the troubled borderland between black and white,” he has created something memorable and true.” –  Washington Post  Well said.  As always, with Greg Iles books in this series, you need to experience MISSISSIPPI BLOOD in all formats. The audiobook is a must (narrated by Scott Brick) for an amazing performance (have listened several times). Then of course, you \"must\" purchase the Kindle format in order to highlight the beautiful lyrics; and last but not least, the print copy is a given, to add to your personal library collection. USA Today:  Greg Iles has his first-ever No. 1 USA TODAY best seller with Mississippi Blood the final book in his searing Natchez Burning trilogy.  JDCMustReadBooks"}, {"userName": "Glenna Pritchett", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/9932367-glenna-pritchett", "userReview": "In anticipation of this, the long-awaited final book in the Natchez Burning trilogy, I did a full, back-to-back reread of the whole Penn Cage series. I am so glad I did, because there's at least a million and one details that I had forgotten. Maybe more. I think all Greg Iles' books are wonderful, but he has outdone himself with this trilogy-within-a-series. It is impossible for me to review just this one book, so I'm going to talk about the trilogy as a whole. It's a complex story that's part family saga, part suspense, and part legal thriller, with the overarching theme of race relations in the American South from the segregated 1950s till now. (And with a bit of theory about the assassination of President Kennedy thrown in for good measure.) At times I felt as if I were reading George R.R. Martin; death is everywhere, and I'm giving you fair warning that the body count isn't all incidental characters or bad guys. Iles does not hesitate to throw a devastating punch to the reader's gut. But I suppose that makes the books even better, because who wants to read a story where you know what's going to happen and everybody rides happily into the sunset at the end? Not me.The trilogy is fascinating reading, indeed the whole Cage series. I recommend it to almost everyone. But do be aware that there are some events and language that might be too disturbing for sensitive readers."}, {"userName": "Jessica", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/3345952-jessica", "userReview": "Friends, I am winded from the epic sprint that Greg Iles sent me on with this book. I tell you, I was already eagerly awaiting this final installment in Penn Cage's family saga. What I wasn't prepared for though, was how much Iles was going to throw at me all at once. This book is a rapid fire rush to the finish the line. It sweeps you off your feet, and all you can do is hang on for dear life as everything that you've been waiting for unfolds in this maniacally beautiful fashion. This book right here, more than anything else, has proven to me what an expert writer Greg Iles is, and I happily bow down to that expertise.First off, let me say that I was originally a bit put off by courtroom melodrama that started in Mississippi Blood. Admittedly, I wasn't sure I actually wanted to read a whole murder case laid out on the page. I worried that it would slow things down. That is, of course, until I realized that even these portions of the book were utterly riveting. Watching Shad Johnson and Quentin Avery go at it soon became something that I looked forward to. Iles wrote two brilliant lawyers who, despite any flaws they might have otherwise had, were masters of the judiciary art. I felt like a part of the jury, as surprise witnesses were thrown into the mix and tantalizing details were unearthed. I felt like a part of Penn's family, as I watched them struggle to keep themselves together while dealing with what everyone around them was terming the \"case of the century\". In other words, I was completely engrossed. I've never run through a 700+ page book more quickly in my whole life. If I could have lived without sleeping for the three days I read this, I would have. I needed to know what happened next.More than that though, was the fact that Iles didn't let go of a bit of the character development that he'd been nursing throughout this whole series. Despite the trial, and all the violence surrounding it, he didn't stop at all in his quest to make the reader actually care about these characters. I admit, I teared up more than a few times during this book. I hadn't realized how much I actually empathized with Penn and his family until everything was ramping up to a conclusion. It amazed me how quickly I fell in step with even the new characters who were put in place, and how much I wanted them to succeed. It's no secret that I was a little angry after the last book, where Iles took something away from Penn that I really thought was unfair and unnecessary. Reading this installment though, I understood. I saw the reason. It didn't mend the hole in my heart, but I saw Penn in a new a light. A man who has been through hell and back, but still has a heart as big as anything. It's tough not to love a man like that, even when his decisions seem insane.Look, the point of this rambling review is to fairly confess that I started out this book with a bit of doubt as to whether or not I was going to fully enjoy it. I expected over the top courtroom melodrama, and worried that the climax might not be what I expected it to be. I'm happy to report that I was wrong. I was so very wrong. This book is amazing. Mississippi Blood is not only the ending that Penn Cage deserved, but the type of ending that any author should be damn proud of. My heart is still pounding from what happened, even after the epilogue tried to assuage my fears. This is mastery, plain and simple, and Greg Iles quite rightly has my heart.Am I sad that there won't be anymore Penn Cage? Yes. Will I happily read anything else that Greg Iles puts out into the world? Absolutely. If you haven't started this series yet, please do. This is a genre that I all but never read, and so you can trust me when I say that this is worth your time. 2,100 pages later, and I'm not even the least bit sorry that I put in the time."}, {"userName": "Susan Crowe", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/4036154-susan-crowe", "userReview": "The perfect ending to an awesome series. I feel like I've been reading the Penn Cage series forever. This book is actually part of a trilogy and can be read on their own but I highly suggest you begin with The Quiet Game, which actually begins the series about Penn Cage and his family. I must warn you though, they have extreme and graphic violence, but sadly, it's real life. These things do happen. Goodbye Penn. I will definitely miss you."}, {"userName": "Luanne Ollivier", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/1621569-luanne-ollivier", "userReview": "I have been impatiently awaiting Mississippi Blood, the third book in Greg Iles' epic 'Natchez Burning' Trilogy. The last few chapters of the middle book, The Bone Tree, left me gasping, crying and re-reading to make sure what I thought happened, really happened. It did and I've been desperate to see where Iles would take the narrative. For those of you who haven't read this series (you need to) here's a quick overview from the publisher:\",....tale of love and honor, hatred and revenge that explores how the sins of the past continue to haunt the present.\"So, Mississippi Blood picks up a few weeks later. Penn Cage is speaking to the reader and says...\"If you don't want the truth, stop reading now. If you go on, don't say I didn't warn you.\" Not a chance in heck I could stop reading.I have no idea how I'm going to truly do this book justice with my own words. There is hands down one of the best courtroom scenes I've ever read at the heart of the book. Tom Cage seems determined to not defend himself in court. The defence mounted by attorney Quentin Avery seems to be not mounting any defence at all. Tom's son Penn is desperate to save his father - and what is left of his family. Is Tom guilty of murder? Who else could have killed Viola? (Who really did will stun you!) Surrounding the trial is more danger, death, love, hate, lies, fears, hopes and more. Iles captures the attitudes, history (much of this trilogy is based on fact) and racial tensions of Mississippi through his characters, their dialogue, settings and situations. The words fairly simmer on the page. But amongst all of the ugliness are those who want better for themselves, their families and their communities.I was all over the place reading - angry, scared, hopeful and teary again. (Seriously, another beloved character gone?!) I could not put the book down. I was sucked back into the story on page one and only emerged three days and almost seven hundred pages later.The title? \"Mississippi blood is different. … there’s strength in it too. Strength that’s been beat but not broke. That’s Mississippi Blood.\" If you haven't read this trilogy, you are missing out on some phenomenal storytelling. Storytelling that unfortunately is based in reality. Absolutely recommended. And don't you dare read this book until you've read the first two."}, {"userName": "Wendy", "userReviewDate": "Apr 22, 2017", "userURL": "http://www.goodreads.com/user/show/19889444-wendy", "userReview": "Mississippi BurningWow! What a truly amazing and great book! I haven't enjoyed a series the way I did this one in quite a very long time. Greg Iles has always been one of my favorite authors but he is definitely at the top of my list now. What a talented writer. This story has to be one of the best I've ever read and I'm so sorry to have it end."}, {"userName": "Steven Z.", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/17428284-steven-z", "userReview": "When I finished reading Greg Iles’ THE BONE TREE the second volume of his Natchez Burning trilogy it was clear the third installment would be equally suspenseful and the type of book that I would not want to put down. I was not disappointed as MISSISSIPPI BLOOD drew me in, grabbed my attention, and would not release me. Iles begins the conclusion of the trilogy by using old newspaper articles as a vehicle to review or present material from the first two books. It is 2006, and Penn Cage, the mayor of Natchez, Mississippi is dealing with the murder of his fiancé, and is deeply troubled by his father’s refusal to talk about his past, and defend himself at his upcoming murder trial. Compounding his father’s actions is the effect it is having on the Cage family. Lurking in the background, soon to reemerge as one of the keys to the novel is a KKK offshoot, the Double Eagles, led by Snake Knox, a racist sociopath who will stop at nothing to keep his actions and past secrets hidden.A number of characters from the previous novels reappear; Shadrack Johnson, the District Attorney who prosecutes Cages father as a means of furthering his career and reputation; Dr. Tom Cage, Penn’s father; Walt Garrity, a retired Texas Ranger who fought with Tom Cage in Korea; Sheriff Billy Byrd, who hates Penn and is in bed with the Double Eagles; Quentin Avery, the diabetic attorney who defends Dr. Cage; Lincoln Turner, Cage’s half-brother from Dr. Cage’s affair with his nurse, and Penn’s mother Peggy, eleven year old daughter Annie, and a number of others. As the novel progresses Iles integrates material from the first two books refreshing the memories of those who have read them.Iles does introduce a number of new characters who help bring the state of excitement to new levels. Serenity Butler, writer, college professor, native of Mississippi, and an Iraq war veteran; Terry “Toons” Teufel, the muscle behind the VK (Varangian Vindred or Viking Justice) a racist biker group somewhat aligned with the Double Eagles; Dolores St. Denis, whose fiancé was murdered by the Double Eagles at the “Bone Tree” in 1966; Cleotha Booker whose son Sam was murdered by the Double Eagles in 1966; Aaron and Roosevelt Harvin the older brothers of Keisha Harvin, a reporter who was brutally attacked by a woman acting for the VK, and a few others. What is clear to everyone that Penn questions as he tries to figure out what his father is hiding is that if you went against the Double Eagles you would die.As the plot develops Iles takes the reader into the seamy underworld of racist terror from the Civil Rights era and the present. What emerges is the depravity of southern racism that in many ways still remains today. Through the relationship between the VK and the Double Eagles we see their world view and are exposed to the legal and political corruption that existed in Mississippi and Louisiana. As Iles’ narrative progresses he provides the social texture that was Mississippi in the 1960s and some of which is contemporary. Iles provides a number of important insights into southern culture by employing a realistic and engaging dialogue between his characters, particularly involving Penn, his father’s supporters, and those who want to convict Tom Cage and bury the past.The problem that dominates the novel is that Penn’s father is hiding important information about his life and how it impacts his trial. Further, his close friend and lawyer Quentin Avery refuses to disclose his strategy that seems remarkably weak. It grows worse as Doris Avery, Quentin’s young wife and Penn come to the conclusion that perhaps there is a pact between the two men, that in return for making sure he is found guilty, Dr. Cage will provide him with a painless death and release from the diabetes that has already cost him both of his legs. For Cage it seems likely his father wants to be convicted in order to save his family from the Double Eagles, or assuage his own personal guilt. As Doris states; “I think we’re all hostages, even though we’re walking free. Annie, you, me…all of us.” In response Penn states; “You mean literally? Hostages to the Double Eagles?” They conclude that most of the world has moved past the racist hatred that permeated Mississippi during the Civil Rights era, but not the Double Eagles and too many others. Once the plot is laid out, the reader is taken on an imaginative, but realistic ride where it seems that the intensity of the narrative increases as you turn each page. The events of the novel are put forth through, at times, intense dialogue, conversations, newspaper articles, and courtroom testimony that is conveyed in detail. The book is an ode to Natchez as Penn tries to overcome the city’s past and provide optimism for its future. The book is riveting and can be tackled on its own, but I would recommend reading the three books in order. No matter how you approach Iles’ trilogy, which is quite an achievement, you will not be disappointed."}, {"userName": "Robert Scragg", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/41007397-robert-scragg", "userReview": "First thing's first - If you haven't read any of the Penn Cage series, it's worth going back to the start, even before this trilogy, and reading \"The Quiet Game\" then working your way through; I promise you won't regret it.Mississippi Blood is the concluding part of one of the most compelling trilogies I've come across. Penn Cage is the mayor of Natchez, Mississippi. He returned to his hometown after a successful career as an attorney and an author, but not everyone was glad to see him come home. He has his fair share of enemies, who would gladly see him, and his family brought to their knees.Greg Iles does a masterful job of shuttling us between present day, and the harsher reality of life in 1960's Mississippi, complete with simmering racial tension, the KKK, and an ultra-radical splinter group known as the Double-Eagles, who still wield a frightening amount of power here and now. Penn's father, Doctor Tom Cage, is a pillar of the community, respected throughout. When he's accused of murder, secrets that have been hidden away for decades threaten to surface, and the Double-Eagles will stop at nothing to keep them hidden. It seems that Tom Cage has secrets of his own though, and time is running out for Penn to piece it all together before the ghosts of the past destroy all he's fought to build.All in all, Mississippi Blood is an utterly enthralling story, expertly told, and cannot recommend highly enough."}, {"userName": "Laurie", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/6244600-laurie", "userReview": "The conclusion of Greg Iles’ Natchez Burning trilogy is spectacular. He weaves a tale of destruction and revenge at the hands of the Double Eagles and it has hit the Cage family relentlessly. In order to survive they must stand strong and find the truth to what has happened not only in recent months, but also forty years ago. Mississippi Blood is everything an exceptional southern novel should be. In-between the covers, there burns mystery, murder, deceit, racial tensions, adultery, violence, crimes and a trial that is not to be missed. You will be captivated by the excellent interconnection that Greg Iles has set before you. A story teller of the highest regard.I am devastated that this in the final book in the Natchez Burning series. I have come to know and love all the characters in Natchez, Mississippi. This quote is the heart and spirit of each character that Isles’ has breathed life into.“Mississippi blood is different. It’s got some river in it, Delta soil, turpentine, asbestos, cotton poison. But there’s strength in it, too. Strength that’s been beat but not broke. That’s Mississippi blood.”All three of the books in the trilogy are long. Don’t let that intimidate you. I suggest starting with Natchez Burning, then The Bone Tree. The conclusion in Mississippi Blood will moor you to Natchez and you will not want to leave. Now, the withdrawal begins."}, {"userName": "Donna", "userReviewDate": "May 10, 2017", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "I enjoy reading this author. My sister recommended him to me back in 2011, and I've read quite a few of his books since. He writes great characters into great stories. This particular series is one of those series that get better and better with each new book. My favorite part of this book was the courtroom scenes. I kept thinking, \"Well done.\" I could feel the tension. This one was definitely worth the listen, as I did the audio, and I happen to love Scott Brick as a narrator. So 4 stars."}, {"userName": "Arnis", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/6257859-arnis", "userReview": "https://poseidons99.wordpress.com/201..."}, {"userName": "Tom Swift", "userReviewDate": "Mar 25, 2017", "userURL": "http://www.goodreads.com/user/show/31185245-tom-swift", "userReview": "Stunning.Greg Iles is my favorite author, and the Penn Cage series is a wonderful ride. Do yourself a favor and read this series starting with the Quiet Game. History, courtroom drama, racial tensions of the South are captured brilliantly by Iles. His storytelling skills come from his Mississippi roots. 6 books and 3,500 pages later, I want more. But only Iles knows if that will happen. Either way, it was worth it.I am going to have a major book hangover for the next couple of weeks."}, {"userName": "Chad Malkamaki", "userReviewDate": "Apr 21, 2017", "userURL": "http://www.goodreads.com/user/show/12840159-chad-malkamaki", "userReview": "[Penn Cage is supposed to be this brilliant prosecutor that seems to be pretty smart throughout the six books of the series. He makes dumb mistakes, having too much faith in people that are pretty greasy figures. With that I don't understand why he doesn't trust people that he should put his faith in, the ones that never have been disloyal and in fact have been stalwart friends of the Cage family for decades. In particular, Quentin Avery. Penn's trusted him in the past and Avery's always put the Cage families best interests forward. When Tom Cage's trial starts, Avery told Penn that it was going to be unorthodox and to be patient. Also, throughout the trilogy Tom has kept things from Cage but always for the protection of the family. Maybe I'll give Penn that he's still in grief over Caitlin, but she put herself in that situation and you cannot blame Tom. During the early stages of the trial, Penn questions every move Quentin makes and even goes so far as thinking Avery is senile. Avery told him that this was not going to be normal. I could see right through Shad Johnson's evidence and prosecution of the case and at times it felt like a bad episode of Matlock. The other issue I had was with the ending. Something just felt flat, but the biggest issue with the hunt for Snake Knox, why did Cage not think Snake would try to get away and that Penn and Lincoln had the situation under control, um duh, look at the guy's name. The Double Eagles and Snake in particular have been super shady this entire series and the ending felt a little gung ho, rushed, and flat out stupid. (hide spoiler)]"}, {"userName": "Ken Fredette", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/5129938-ken-fredette", "userReview": "I've read all Greg Iles books but this one was the best yet. A lot has happened in the last few books but this one Penn has met several people who have tried to replace Caitlin as a reporter trying to follow her after her death. If you like action and action and action you've come to the right author. I was very pleased with what Greg did with the story. I like it so much I read it without stopping except to sleep. I think the people who have read Greg will like this book."}, {"userName": "Ann Wright", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/5000369-ann-wright", "userReview": "Like Mississippi Itself, It's ComplicatedI couldn't put it down and raced through the over 600 pages in little more than a day. We finally learn most of what had transpired in 1968 during the height the KKK action in Mississippi. Like the state, the story is complicated. There are no heroes and even the villains are partly a product of their time. Ultimately the story is about family...what makes a family, what breaks a family."}, {"userName": "Ann", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/1937006-ann", "userReview": "The sheer enormity of this story gives me pause, the family and racial dynamics are complicated and the dramatic courtroom drama playing out throughout this final installment bring the tensions building for decades to a head. The tragic loss of life, the cavalier and cruel actions of corrupt and evil people are sickening and sad. Exposure rather than ignoring these often times painful revelations allow us the opportunity to consider how and how much should change. I hope this might not be the last we hear of Penn Cage, but this story has been told, and told well."}], "description": "The endgame is at hand for Penn Cage, his family, and the enemies bent on destroying them in this revelatory volume in the epic trilogy set in modern-day Natchez, Mississippi—Greg Iles’s epic tale of love and honor, hatred and revenge that explores how the sins of the past continue to haunt the present.Shattered by grief and dreaming of vengeance, Penn Cage sees his family and his world collapsing around him. The woman he loves is gone, his principles have been irrevocably compromised, and his father, once a paragon of the community that Penn leads as mayor, is about to be tried for the murder of a former lover. Most terrifying of all, Dr. Cage seems bent on self-destruction. Despite Penn's experience as a prosecutor in major murder trials, his father has frozen him out of the trial preparations--preferring to risk dying in prison to revealing the truth of the crime to his son.During forty years practicing medicine, Tom Cage made himself the most respected and beloved physician in Natchez, Mississippi. But this revered Southern figure has secrets known only to himself and a handful of others.  Among them, Tom has a second son, the product of an 1960s affair with his devoted African American nurse, Viola Turner.  It is Viola who has been murdered, and her bitter son--Penn's half-brother--who sets in motion the murder case against his father.  The resulting investigation exhumes dangerous ghosts from Mississippi's violent past. In some way that Penn cannot fathom, Viola Turner was a nexus point between his father and the Double Eagles, a savage splinter cell of the KKK. More troubling still, the long-buried secrets shared by Dr. Cage and the former Klansmen may hold the key to the most devastating assassinations of the 1960s. The surviving Double Eagles will stop at nothing to keep their past crimes buried, and with the help of some of the most influential men in the state, they seek to ensure that Dr. Cage either takes the fall for them, or takes his secrets to an early grave. Unable to trust anyone around him--not even his own mother--Penn joins forces with Serenity Butler, a famous young black author who has come to Natchez to write about his father's case. Together, Penn and Serenity battle to crack the Double Eagles and discover the secret history of the Cage family and the South itself, a desperate move that risks the only thing they have left to gamble: their lives.Mississippi Blood is the enthralling conclusion to a breathtaking trilogy seven years in the making--one that has kept readers on the edge of their seats. With piercing insight, narrative prowess, and a masterful ability to blend history and imagination, Greg Iles illuminates the brutal history of the American South in a highly atmospheric and suspenseful novel that delivers the shocking resolution his fans have eagerly awaited.", "title": "Mississippi Blood\n      \n          (Penn Cage #6)", "url": "http://www.goodreads.com/book/show/36204014-mississippi-blood", "average": 4.46, "cover": "https://images.gr-assets.com/books/1516949581l/36204014.jpg", "reviews": 1443, "authors": [{"url": "https://www.goodreads.com/author/show/19696.Greg_Iles", "name": "Greg Iles"}], "type": ["Fiction", "Mystery", "Thriller", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/36204014-mississippi-blood", "http://www.goodreads.com/book/show/31139037-mississippi-blood", "http://www.goodreads.com/book/show/30653828-mississippi-blood", "http://www.goodreads.com/book/show/34668410-mississippi-blood", "http://www.goodreads.com/book/show/33537944-mississippi-blood", "http://www.goodreads.com/book/show/18505832-natchez-burning", "http://www.goodreads.com/book/show/43993.The_Quiet_Game", "http://www.goodreads.com/book/show/80630.Turning_Angel", "http://www.goodreads.com/book/show/43992.True_Evil", "http://www.goodreads.com/book/show/80631.Blood_Memory", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}