{"ratings": 796, "userreviews": [{"userName": "Crina", "userReviewDate": "Jul 20, 2009", "userURL": "http://www.goodreads.com/user/show/2542303-crina", "userReview": "I could not put this book down! Moonlight in Odessa is about a woman from Odessa, Ukraine, who is slowly seduced by the American dream when she starts working at a foreign shipping firm. Daria loves English and longs to escape the hardships of life in her country. She applies for jobs in Western countries but is turned down because she does not having working papers.When she begins moonlighting at a matchmaking agency, she meets American men and wonders if this is a way to get to America. When Daria hesitates, her grandmother pushes her to leave Ukraine. Once Daria travels to America, she sees that people struggle in America, too. Her husband isn't exactly who he said he was. She asks herself if she should stay in America or return home.I loved the way the author constantly worked in other Russian and Ukrainian poems and novels, from Dostoevsky's 'The Idiot' to Babel's 'How Things Were Done in Odessa.' Fans of Russian lit will see many of their favorite works in this novel."}, {"userName": "Heather", "userReviewDate": "Sep 28, 2009", "userURL": "http://www.goodreads.com/user/show/746698-heather", "userReview": "Daria is a young woman living an oppressive life in Ukraine, where the economy is so poor that most people struggle to survive. Though she has a stable and well paying job as a secretary, her future seems uncertain; she worries that her boss, Mr. Harmon, will fire her after she refuses his sexual advances. In order to keep him at bay, she decides to set him up with a long-time friend, who immediately latches onto the man and then strangely turns on Daria. In fear for her job, Daria begins to moonlight as an interpreter for a Russian/American dating site that connects lonely American bachelors with eligible Ukrainian women. As she becomes more involved in her off-hours job, she constantly wonders if true love will ever come her way and questions whether her only opportunity will be with Vlad, the Russian mobster who relentlessly pursues her. After months of contemplation, Daria begins corresponding with a man from the U.S. and starts to dream of a future in America. But taking the plunge and leaving her friends, family and country behind is quite a big step, and one that might carry consequences that she doesn't expect. Soon Daria is leading a very different sort of life, but underneath it all she finds herself still asking the same questions about her future. Both smart and captivating, this is a tale of the the industry of modern love and a woman caught in the middle of it all.I found that I really enjoyed this book. From the moment I started reading about Daria, I found that she was very different from your typical protagonist and that this was far from your average tale. First of all I found the main character to be very well defined and three dimensional, and I thought her personality had a lot of verve. She was both classy and intelligent and had a great independence and jocularity about her that I found appealing. I also found the supporting characters to be well fleshed out and I ended up feeling very strongly for all of them, albeit in different ways. I think that part of the reason this book worked so well for me was because it was impossible for me not to root for Daria and become invested in the situations she faced. Her plight was uncommon, which is another thing that drew me into the story, and I was constantly wondering how she was going to handle the next curve ball that life threw her.The plot was very fast paced During the first half of the book; although there weren't very many shifts of scene, there was a lot going on and a lot to get absorbed in. By the second half of the book, the pace had slowed down a bit. Without giving too much away, I can only say that a shift took place in Daria's personality during the second half of the book and I was bit torn as to how to feel about it. She seemed somewhat less decisive and I got a little weary of her waffling back and forth in her attempts to resolve her problems. Although I recognized that she was reacting to her changed circumstances and it seemed genuine and believable, it did get a bit tedious.I think the most interesting part of this book was the light that it shone on the Russian mail order bride industry. There was a complex web of complicity between these people and often it was unclear who was deceiving who. Most of the women seemed to look at marriage to an American man as a ticket to stability and family, though some were only moved by the desire to obtain a green card and have access to greater amounts of money. The men formed two camps as well: the ones who thought they were going to get a subservient woman who had to completely rely on them, and the ones who went into the venture hoping to make a real connection. It was interesting to see that bad intentions could litter both sides of this transaction, and though it was usually the men who were being deceptive, the issue wasn't starkly black and white.I also enjoyed all the cultural detail in the book and felt that through the clever impregnation of the narrative, there was actually a lot of information about Ukraine imparted. I came to the book with limited knowledge about the impoverishment of this area of Russia but it was made very clear to me what it would have been like to live in a place where food was scare and luxuries were almost non-existent. From the dismal monthly sum the pensioners received from the government on which they had to survive to the daily utilities blackouts, the book gave a very clear picture of what it must be like to survive day after day in this area of the world.It also highlighted in detail the reasons that women in this part of the world would go to such extremes to marry a man that in some cases could not even communicate with them. For them, the promises of America must have been too great to ignore, the opportunity to escape too strong. In a examination not often seen, the book also explored the lives of the women who left their native homes and just how difficult survival in their new surroundings could be. Most were alienated and found they had a crippling dependence on the men who made their escape possible. Most were very unhappy and found that the lives they were living bore no resemblance to the lives they had hoped for. Reading about it was revealing, but also cautionary.I ended up really enjoying the conclusion of this story as well. I hadn't been expecting it, but it was what I hoped for and it was the ending that I would have written, had I penned this book. I closed the book feeling satisfied that the tale had been given a fitting and worthy ending and that Daria had finally gotten what she truly deserved.This was a much more emotionally complex read than I had expected when I first opened the book. Though there were many light and funny moments, I think the author did a great job of examining some difficult issues, and I really enjoyed the exposure to a culture so different from my own. I also think that the book gave me a more healthy appreciation for all the little things I take for granted in my daily life and for all the little luxuries that I never even think about. I think this book would be great for a wide audience and that it would really be enjoyed by those with a hunger for information on on life in Ukraine or those who want to get a better idea about the logistics of the mail order bride phenomenon. A very interesting read. Recommended."}, {"userName": "Irene", "userReviewDate": "Nov 30, 2009", "userURL": "http://www.goodreads.com/user/show/37196-irene", "userReview": "Most of Janet Skeslien Charles’ debut, Moonlighting in Odessa is extremely well-written and substantially believable. Daria, the main character defies overwhelming odds in post-perestroika Ukraine, and with disciplined forethought, she not only achieves her goals, but also develops into a successful exception to what most of her peers seek, but never achieve. When her questioning relentless mind jumps into overdrive, her enchanting perception of the “American Dream” casts a meandering pale over her initial pragmatic viewpoint.Thus, we encounter another Daria, “the mail-order bride” whose previous chutzpah fizzles within the claustrophobic confines of an unfulfilling meaningless marriage where she becomes the “trophy wife” of a non-affluent, delusional American who desires not only to own and disparage the young woman he so ardently pursued, but also lacks the integrity to admit his deceptive misrepresentations.Should you read this book? The fascinating aspects of Odessa, its courageous people and its historical culture will undoubtedly capture your imagination. Comprehensive details recounting the bogus process which essentially exploits and often devastates the majority of Eastern European “mail order brides” will enlighten you. As a child, I believed in fairy tales, but I regret that I no longer do. So, the “neatly-wrapped-and-tied-with-a-bow” conclusion was an absolute disappointment."}, {"userName": "Colleen", "userReviewDate": "Jul 06, 2009", "userURL": "http://www.goodreads.com/user/show/640637-colleen", "userReview": "Lackluster novel that started out strong but faded fastI really wanted to like this book which has such an interesting premise and started out strong. Daria is a great character, and I felt truly invested in her struggles and her life in Odessa. The descriptions of trying to work in the post-Soviet era Ukraine are hysterical. The entire mail-order bride business is both amusing and tragic, and is very well depicted in this novel.Unfortunately, once Daria makes a choice about how to live her life, my interest in the book rapidly waned. Daria immediately lost all of the vivacity and humor that made her such an interesting character, and without a strong character interestd to drive it, the narrative petered out. I feel like this was two different novels- one a lighthearted chick-lit offering with set in Odessa, the other a darker look at the questionable world of international mail order brides. Either book as a stand-alone tale would have been an enjoyable read, but the combination here weakened the impact of story. 2.5 stars."}, {"userName": "Kristine James", "userReviewDate": "Jun 19, 2009", "userURL": "http://www.goodreads.com/user/show/2311079-kristine-james", "userReview": "A must read by by a new author - Ms. Skeslien Charles' book is both funny and sad. The struggles of single parenthood, trying to find \"the right person\", living in the Ukraine, adjusting to a new life all rolled into one and yet still funny. I loved learning about life in a different country - i felt like i was there. The love of family. A great first novel - i can't wait for more!!Kristine Heitkemper James"}, {"userName": "Anne", "userReviewDate": "Jul 31, 2009", "userURL": "http://www.goodreads.com/user/show/548040-anne", "userReview": "This is an intriguing debut novel about mail order brides from the Ukraine. Why would an educated and highly intelligent woman from a beautiful, historic seaside city choose to give up everything for a stranger she barely knows? The story is written from the perspective of one such woman, but reveals much more. It is about family and business relationships, financial security, lonliness, language and cultural stereotypes and even Ukrainian mobsters who (along with their Russian counterparts) are known to be even more brutal than the Italian mafia. This was a fascinating story that I had difficulty putting down until the end... and I wanted more!"}, {"userName": "Sophie", "userReviewDate": "Jul 31, 2009", "userURL": "http://www.goodreads.com/user/show/2385123-sophie", "userReview": "I loved the first half of this book. The setting and plot were intriguing, and Daria was such a strong, interesting character. I'd like to steal her grandmother, too! The second half... petered out, in my opinion. It was less engaging, though there were still good moments. In the end it all works out for the best. So despite the lull in the middle, I did really enjoy this book and would recommend it as a quick read. Also for anyone thinking of visiting the Ukraine! (Thanks FirstReads for the advance copy!)"}, {"userName": "Amanda", "userReviewDate": "Oct 29, 2015", "userURL": "http://www.goodreads.com/user/show/5793497-amanda", "userReview": "What I found was a book that was indeed truly delightful, but that also brought a realistic, humanizing face to modern day marriages that are not for love.The book lingers in Odessa much longer than I was initially expecting, and I’m so glad it did. This gives a firm basis for who Daria is before she comes to America and really puts the reader in her shoes. The author clearly has a love for and strong knowledge of Odessa, Ukrainian culture, and the Russian language. Within just a few pages, it immediately becomes clear that Daria is whip-smart. Her understanding of the ins and outs of both English and Russian are amazing. She is witty, and it’s easy to see how she would have succeeded in any life circumstance. But it also quickly becomes apparent that although she loves Odessa, it doesn’t let her truly grow into who she wants to be. Every life experience she has had has taught her that Odessan/Ukrainian men will only use her and leave her, and she wants a lifetime partner and commitment. Similarly, she can’t use her engineering degree in Odessa, due to the economy, and she wants to live someplace where she can. The clear and slow unveiling of these conjoining life situations helps the reader to come to understand why she is willing to have a business-style marriage, rather than a love marriage. The American man she meets needs a wife, and she needs a life partner and a ticket to a better life.Of course, not all is as it seems with the American man. The second half of the book dives into life in America for Daria and depicts the harsh realities of using a business-style marriage to immigrate. Even if her marriage had been perfect (which wow it isn’t), Daria still suffers culture-shock and the realization that America is definitely not perfect. There are pros and cons to living anywhere in the world.Although her marriage is on the worse side of the arranged marriage bell curve, the author still shows the variety of marriages that can result from this type of arrangement by having Daria naturally seek out other women who came to America in similar ways. She thus meets women in both better and worse marriages than her own, and so the reader sees how, although it can possibly work out, the whole situation is ripe for abuse. For instance, if a marriage that included a K1 visa (bringing a non-US citizen into the US) is dissolved within 3 years then the spouse who was brought over on the K1 visa loses their citizenship. This means that women in these types of marriages are afraid to leave abusive situations because they believe that they will automatically be deported. There are exceptions for cases of abuse, but the women often do not know that, and the men in these situations often threaten the women with deportation. This information is all given within the book with subtlety and within the context of what will Daria do now, which lends a human face to the situation.Given how interesting and realistic most of the book was, I must admit that I felt the end of the book went a bit soap opera, and the ending in general left me wanting. I can’t put my finger on what exactly about it left me feeling as if the story was incomplete, but it did. I don’t have any regrets about reading the book, though, because I so enjoyed seeing the world through Daria’s eyes.Overall, anyone who enjoys contemporary fiction and is interested in either the Ukraine or the modern day “mail order bride” as done through online agencies will enjoy this book. The main character is rich and well-rounded and brings a human face to the often underrepresented immigrant side of the K1 visa story.Check out my full review. (Link will be live February 15, 2016).*original GR comment on finishing book*Maybe 5 stars? Still thinking about the ending."}, {"userName": "Elizabeth", "userReviewDate": "Aug 15, 2009", "userURL": "http://www.goodreads.com/user/show/2447647-elizabeth", "userReview": "My overall impression of this book is postitive. I feel like the writing was strong, good use of detail and atmosphere. My conflict about a more postive review is due to plot. I found the first half of the book really enjoyable. I loved Daria and her grandmother. Really strong, likable characters. I felt less enamoured with who Daria became and how the plot and writing reflected that. I think what I really liked about the first half was the palatable mix of dark and humour. It was candid writing about the more sinister and bitter side of her life, without sacrificing infusing humor and love and warmth into the narrative. As the plot progressed, I simply did not care as much what happened to Daria. I felt the plot veered into a conventional framework that I was so enjoying seeing toyed with. I still think it was a good book. It was a good lighter read when in my opinion, it could have been much more than that. I still look forward to further writing from this author. Did not turn into the kind of book I could love, but still a book I liked.In compliance with FTC guidelines, I am obligated to disclose in my review that I have received the book for free through Goodreads First Reads. This in no way effected the views expressed or influenced the nature of the review of the book received."}, {"userName": "Mag", "userReviewDate": "Nov 19, 2010", "userURL": "http://www.goodreads.com/user/show/2422276-mag", "userReview": "A very talented writer. Had I not read it in an interview, I wouldn’t have known that Janet Skeslien Charles wasn’t born in the former Soviet Union. She gives her main character, Daria, a fantastically believable voice. The story is about mail order brides and about the perils of those unions, about new capitalist ventures and new post communist life in Ukraine. It’s set in Odessa and then in the United States. Written in a witty and entertaining style, it’s a quick, pleasant, and educational read."}, {"userName": "Sue", "userReviewDate": "Dec 08, 2009", "userURL": "http://www.goodreads.com/user/show/3002640-sue", "userReview": "Informative read with an exotic locale. I'd recommend it to patrons who like rather serious chick lit. You'll want the best for Daria, the engaging main character."}, {"userName": "JG (The Introverted Reader)", "userReviewDate": "Sep 03, 2009", "userURL": "http://www.goodreads.com/user/show/48404-jg-the-introverted-reader", "userReview": "Daria just graduated with a degree in engineering, but in Odessa, Ukraine, jobs are almost impossible to find. She eventually starts work as a secretary for an Israeli import/export firm and as an interpreter for an email order bride company, Soviet Unions. Good men are hard to find in Odessa too, so Daria finds herself corresponding with a few men, even as some she already knows start to make advances. Full disclosure: I won this in a GoodReads firstreads giveaway.Really, this was 3.5 stars for me, but I'm rounding up because it's something I'm interested in.I really liked Daria. She's a sharp-tongued, sharp-witted survivor. Throughout the book she changes in ways that follow a natural progression considering what she's going through. But I felt like the whole \"a good man is hard to find and I'm so lonely\" side of her got over-developed. That's all she thinks about. At one point, some friends of hers showed up at her house for a birthday party, and I was surprised that she had friends. All I'd seen up until that point was work, and all she'd thought about was work and love. Where did those ladies come from? I really enjoyed reading about life in Ukraine. We have a surprisingly large community of Ukrainian immigrants where I live. They aren't mail order brides. Whole families come here to escape religious persecution, from what I understand. Anyway, I like listening to one of my co-workers, Sofiya, talk about her life in Ukraine. She never complains, she seems to love her native country, but in a roundabout way, she makes me realize again and again exactly how good I have it. She's only 21, so she never really knew life in the Soviet Union. But she still knows what it's like to be hungry, and her stories of selling old toys on the side of the road, trying to earn money for food, break my heart. I should add here that she comes from a family that seems to be hard-working and caring. But if there's no money, there's no money. She's very open about it all, but I don't even know enough to ask her intelligent questions. I feel like I have a bit more of a starting point after reading this. I feel like we've already had one good discussion because of this book.The author did a great job of showing why some women feel like becoming a mail order bride is their only option. For various reasons, women outnumber men in Odessa. The men who are left, at least in the book, tend to be alcoholics, abusers, and/or criminals. There aren't any jobs available. Women must choose whether to stay in Odessa, a city they love but where they will never get any further ahead, or whether to take a chance on the unknown dream of America and an American husband. Through Daria's eyes, we see that it's not an easy choice. When former female clients call home with reports of abuse from their American husbands, we see that the dream can become a nightmare. Abuse is bad enough, but imagine being in a country where you don't speak the language, you don't know the system, and you don't know your rights. Terrifying.Right after starting this book, I caught part of a documentary on TV about this very subject. Maybe I'm projecting my own feelings onto what I saw, but the combination of fear, hope, and uncertainty I saw on the women's faces made me feel for them. It got worse as I watched the soon-to-be husbands start to kiss, hug, and just generally hang all over these women whom they barely knew, and yet who would soon be their brides. The women looked very uncomfortable, but you could tell they were trying to hide it.All of that came through here. I have to admit that I have the men who use these sites stereotyped as desperate, lonely men. I can't help but feel that they can't get a woman in their own country because there's something wrong with them. I'm sure I'm wrong--they can't all be like that--but this book didn't do anything to dispel that notion. They were all desperate lonely men who couldn't get women in their own country because something was wrong with them.I've made this sound all serious, and it mostly was, but it had a few lighter moments. Daria's exchanges with Ukrainian men and her friend Olga could be pretty funny. And I'm ready to visit Odessa, based on the loving descriptions of the city found here. Apparently, they have the third-most beautiful opera house in the world. Their climate on the Black Sea sounds positively balmy. Well, compared to what I think of when I think of the former Soviet Union, anyway! They have beaches as we know them! And I want to make my husband carry me up all 192 steps of the Potemkin Staircase. I probably shouldn't say that, or he'll never want to go!If you're interested in Ukraine or mail order brides, go ahead and pick this up. It was a solid story, I felt like I learned a lot, and it would be great for a group discussion. Look how long I've rambled on here, trying to discuss it by myself without giving anything away!"}, {"userName": "Dan", "userReviewDate": "Mar 26, 2011", "userURL": "http://www.goodreads.com/user/show/5182675-dan", "userReview": "[Her decision to leave her husband, quite out of character, opens the door to a fairytale ending which is disappointing in its \"no loose ends\" approach. (hide spoiler)]"}, {"userName": "Meg", "userReviewDate": "Apr 02, 2011", "userURL": "http://www.goodreads.com/user/show/3423663-meg", "userReview": "Janet Skeslien Charles’ Moonlight In Odessa is addictive, unexpected and a deeply acquired taste — I’ll say that right off the bat. It’s bawdy. A little over-the-top. Funny but also tragic; fascinating, but almost morbidly so. Deeply entrenched in romance, love, sex — and everything in between. It’s about making choices and where those choices lead you.I started this book on a sunny afternoon, intimidated by its girth, but it wasn’t long before I was hopelessly sucked into Daria’s story and enchanted by her Boba, a strong woman who raised her granddaughter alone. Daria’s devotion to her only close relative is heartwarming, and I longed to spend time enjoying feasts in their tiny flat. Though Daria’s new job comes with terrible compromises, I understood why she took it: it was an opportunity. And in a city rife with suffering and financial troubles, that opportunity meant a better life for Boba. Boba — to whom she owed everything.When Daria begins her second job with the mail-order — or email-order — bride agency, the plot spun in a wildly different direction. We’d spent more than 100 pages establishing life in Odessa, and Charles skillfully detailed Daria’s circumstances — and what would bring her to the decisions she made. Never rushed and always entertaining, we’re given a solid look into our narrator’s world without ever getting weighed down with detail. These were people I felt I really knew.But I never knew where we were headed, never knew what was around the next bend — and neither, it seems, did Daria. Intelligent, beautiful and strong-willed, it was hard to imagine her making certain decisions . . . but then again, it wasn’t. Charles deftly spun web after web, ensnaring readers, and even I couldn’t help but feel Daria had made the right choices . . . until she didn’t. It was a hard story to put down.Moonlight In Odessa places a huge emphasis on the cultural differences between American and Ukrainian culture, and the author herself — an American — spent two years studying in the title city. Daria’s voice feels very authentic — so much so that I was shocked to learn Charles is not from Odessa. Reading about Daria’s culture shock further endeared her to me, and I loved her perceptions of American idioms and behaviors. It’s always interesting to view your own world through another’s lens.But though I really enjoyed it, I concede that this wouldn’t be a book for everyone. The novel closely looks at sex, love and the differences therein, and some of the situations made me a little uncomfortable. Having just watched a documentary on online brides, I was fascinated by Charles’ novel — and would recommend it to contemporary fiction lovers seeking an unconventional sort of story."}, {"userName": "CuteBadger", "userReviewDate": "Feb 26, 2011", "userURL": "http://www.goodreads.com/user/show/4084869-cutebadger", "userReview": "Daria is an educated Ukranian in her twenties who lives with her Boba (grandmother) and works for a foreign shipping firm. She tries to see her home city of Odessa through rose-tinted spectacles, but can’t help but see the poverty and inequality that followed the break-up of the Soviet Union. To make ends meet she moonlights at an introduction agency which puts American men and Ukranian women together with a view to marriage.Though she is a modern woman fighting to survive in a harsh world, another kind of moonlight is often on her mind and Daria can’t help wondering if finding the right man would solve all her problems. The reader follows her as she interacts with several men, including her boss and a local heavy who collects protection money from both her employers. She also starts an email correspondence with a man in the USA and wonders whether she should leave her home, and her Boba behind.Though the cover of this book makes it look like unreconstructed chick lit, and the first half of the novel also gives this impression, I felt that it was really anti-chick lit as the message wasn’t the usual one that finding the right man will instantly make everything ok. It’s also a lot less “fluffy” than chick lit, which usually has a heroine with a secure home, job, enough money and the freedom to be what she wants to be. Daria does not have any of these, so her story is much more visceral and therefore more moving.The book is also very funny, particularly in the first half when Daria is on her home ground and standing up for herself (albeit in a sometimes underhand way). The book is also refreshingly free of chick lit’s obsession with its heroine’s appearance and weight. How Daria looks is mentioned, but not dwelt on (other than one element you’d never see in UK chick lit). She herself doesn’t obsess about how she looks as has other, much bigger things to concern herself with.While I really enjoyed the first half of the book, I enjoyed the second half less and felt that it didn’t have the same spark about it that the beginning had. However, there were still good things in the second half and I enjoyed the choices the author made about the ending.So, though this books looks like chick lit, and in some places reads like chick lit, I don’t think it really belongs in that category. It’s a great read with lessons to teach the reader about women’s place in society, marriage and culture.I look forward to reading more from Janet Skeslien Charles."}, {"userName": "Lynette", "userReviewDate": "Sep 17, 2010", "userURL": "http://www.goodreads.com/user/show/4289441-lynette", "userReview": "Right from the start, I found Moonlight in Odessa to be a very pleasant read. I don’t always find books that catch me from the start, but I was caught by the characters in this book from the beginning. After only the first few chapters, I found myself following the lead character, Daria, and seeing the world through her eyes. Each character in the book was very well developed so that you could like or dislike them and I found that I had very vivid images of each one in my mind. As the story progressed, I found myself secretly rooting and encouraging Daria along in her ups and downs with Mr. Harmon, Olga, Boba, Vlad and the match making company. I also found that from the moment they introduced Tristen, I was suspicious of him and was constantly hoping that Daria wouldn’t go that route. I loved Vlad, and how the author only introduced him every once in a while which I found added to the mystery of him as a character. This book quickly transported me to a place where I was seeing Eastern and Western culture from an immigrant’s point of view. It showed me the desire, longing and passion to come to North America and have all of the freedoms and amenities that it has to offer. It just reminds me of how much we have as a society, and how we take so many things for granted. On the other hand though, it also reinforced the idea that in North American culture, there is always the drive to be like everyone else. Overall, it was a very good book that seemed to flow along easily. I thoroughly enjoyed reading it."}, {"userName": "Monique", "userReviewDate": "Aug 07, 2009", "userURL": "http://www.goodreads.com/user/show/936715-monique", "userReview": "I liked this debut novel very much. I found the descriptions of Daria's experience as a mail order bride to be quite compelling and accurate. I could not help but flash back upon a family member's description of her acquaintance's new wife who was \"ordered\" from Thailand (or was it Taiwan --my relative could never quite remember --which also strikes a sadly familiar note from the novel!). This unfortunate woman also was alone and desperate. She had no one to talk to and was stuck cooking and cleaning for a boorish, overweight, older man who was (surprise!) also a redneck, uncultured and loud-mouthed. So, the novel gets big points for accuracy from me. I was struck by the author's depiction of the ignorant, untraveled Americans that populate much of the novel. \"How true!\" I found myself thinking as I read her descriptions of the classic stupid Americans who can't figure out that Ukraine is a separate country from Russia or that other countries have different customs and culture. Not inferior, not superior, just different. At any rate, the plot is a good one and will keep you reading until late into the night. I have to admit I was rooting for Vlad --but that probably says more about me and less about the novel. I was disappointed by the ending a bit. I really can't imagine Daria getting together with David Harmon. He was a creep at the beginning of the novel and I don't think a smart girl like Daria would seriously consider dating him --even if desperate. Which, by the end of the novel, she wasn't!Do yourself a favor and get your hands on this book."}, {"userName": "Vicki", "userReviewDate": "Aug 07, 2009", "userURL": "http://www.goodreads.com/user/show/265580-vicki", "userReview": "I really enjoyed this story, really got into it. You know a book is good when you can't figure out why your mood is so strange, so pensive, or even just down, and then you realize it's because you have the main character's plight in your head, and you've absorbed it.Daria is a beautiful Ukrainian girl -- smart with perfect English. She has a really dense history -- personal, geographical, political, you name it. And she works in a job that pays well, for a boss who's sort of an inept yet aggressive jerk, deals with anti semitism and has nobody to trust but her Boba (grandma). She gets caught up in the world of \"mail order brides\" -- the internet has brought a new dimension to finding American husbands, or Eastern European brides, and Daria is enmeshed in that scene. She helps run \"Soviet Unions\" -- a social agency, and then things start to get complicated. I really loved this. There are a few conceits that get a little old, but you forget them because you're so interested in Daria. There are a few realizations that don't quite ring true, but they make sense -- they're just not 100% well shown in the book. But forget those things and don't let your mind intrude -- it's too minimal to let it bother you away from reading this excellent story."}, {"userName": "Courtney", "userReviewDate": "Jan 15, 2010", "userURL": "http://www.goodreads.com/user/show/311695-courtney", "userReview": "This is a first novel from this author and it reads like a first novel. It's a little choppy at first, but smooths out as it goes on. It's about a Ukrainian woman who deals with foreign men at work and in her social life and eventually realizes her dream to come to the U.S. Having lived in Ukraine and other countries of the Former Soviet Union, I am admittedly sensitive to the cultural comments and comparisons. I don't necessarily disagree with them, but felt sometimes they were awkwardly inserted, breaking up flow of the story. However, they also became more nuanced the deeper I got into the book and I identified with almost all of them. It also helped when I realized that the book took place in 1996, an important detail because Ukraine is a very different place today. In the end, I found the book enjoyable and looked forward to the times when I could pick it up. If you like this kind of novel, \"A Brief History of Tractors in Ukrainian\" isn't quite a love story, but is a more nuanced novel about cultural differences. \"Moonlight in Odessa\" is a fun read, not too hard core or serious, but enjoyable."}, {"userName": "Claire", "userReviewDate": "Oct 22, 2009", "userURL": "http://www.goodreads.com/user/show/1913774-claire", "userReview": "I won this book in the goodreads book giveaway. I ended up liking this book better than I thought I would when I started. At the beginning, it was a pleasant read, but I read it more out of a sense of duty than desire.But as it went on, I started to feel way more connected to the heroine, and interested in her life and circumstances. The story is well written, in a way that really allows you to understand the motivations behind, not just the main character's decisions/actions, but those of most of the other characters in the book, as well.It was an interesting study of love and marriage, choices and consequences, and learning to be happy with what you've been given in life vs. deciding what you truly desire and going for it.I went back and forth between 3 and 4 stars on my rating. It was a good book. I did like it a lot, and enjoyed my thought process as I read it. But I'm not sure I can say I REALLY liked it...enough to recommend it to anyone and everyone.Some people will find this a great book. Others will probably not find it interesting at all."}, {"userName": "Fredsky", "userReviewDate": "Aug 08, 2010", "userURL": "http://www.goodreads.com/user/show/1392564-fredsky", "userReview": "This is a wonderful, charming book. The narrator, Daria, is a very savvy young woman in Ukraine who takes a secretarial job because she can't find work as an engineer. She's smart, she's funny, she's gorgeous, she's proud and warm-hearted and casually ruthless as she struggles to make her way. She loves Odessa. She and her grandmother are happy together in their one-room apartment. But it's dangerous to be so beautiful in an impoverished town. Her boss pursues her and so does the gangster who collects protection money. Her grandmother wants her to get married and break the single-mother curse that has plagued her family for generations. Daria does her best to follow her grandmother's advice.There are many great, comic scenes in Moonlight in Odessa, and the characters are all just right. Daria is a joyful narrator, and reading her was great fun. It's well worth reading Moonlight just for the relationship between Daria and her grandmother. This novel revived my spirit. I want a sequel."}, {"userName": "Wendy", "userReviewDate": "Dec 13, 2010", "userURL": "http://www.goodreads.com/user/show/1182381-wendy", "userReview": "It's a hard knock life in Odessa. Daria struggles to avoid her boss's unwelcome advances, keep the Ukrainian mafia at bay, and look after her Boba. She gets a second job (moonlights, you see) at a place called Soviet Unions, a matchmaking service providing American men the chance to meet and marry women in the Ukraine. Despite seeing the pitfalls in such relationships, she ends up dating one of the men herself, and soon has to decide between the city she loves and the chance at realizing her dreams in America. I liked Daria; she's smart and resourceful and has the habit of conjugating irregular English verbs when she's nervous, but I didn't like or understand some of her decisions. (choose-chose-chosen) After a while I gave up and skimmed to the end, always a sign that my interest isn't being held. The second half of the book seemed increasingly depressing, I'm glad I didn't spend the time really reading it. Strong main character and interesting setting, boring second half and no good resolution."}, {"userName": "Daisy ", "userReviewDate": "May 23, 2009", "userURL": "http://www.goodreads.com/user/show/1013908-daisy", "userReview": "I'm having a good time with this so far. Since I learn all my culture and history from novels, I'm getting a good dose of Odessa and its character and characters. As an easy target for anything \"Russian,\" this is just my kind of book.But I like the writing too. It's fresh, humorous, clever/smart (not like the \"clever\" explained in the book). The story is enlightening. Maybe it's kind of Ukrainian chick-lit? No, it's better than that--so far. I'll say more when I've finished it.Okay, I'm finished.Part One is more interesting that Part Two. It drags, it's more predictable than the first part, and it all winds up too neatly. Probably the whole book could be tightened up, edited into something more streamlined.But, I like it a lot anyway. I like the main character, Darya, and I like what the book says about the strength of women and friends. The grandmother character is also warm and likable. Despite its tedious moments sometimes--I spent a good time reading this."}, {"userName": "Linda", "userReviewDate": "May 17, 2009", "userURL": "http://www.goodreads.com/user/show/1292442-linda", "userReview": "I'm looking forward to reading Moonlight in Odessa by Janet Skeslien Charles. There is an interesting interview with the author at the following website: http://www.jskesliencharles.com/inter... December 2009Getting to know the character of Daria, her family, her dreams, her relationships was enjoyable and insightful. I anticipate the next chapter of the story. More than just the characters though is the setting - it was interesting to read about Odessa and life in the Ukraine. I thoroughly enjoyed the author's style of writing and her delving into the intricacies of language."}, {"userName": "Kate", "userReviewDate": "Sep 07, 2009", "userURL": "http://www.goodreads.com/user/show/2299324-kate", "userReview": "I loved this book so much that when I finished it I longed for more. The story is about Daria, a young woman in Ukraine, who struggles to find love and happiness. She must decide between an older husband in America and a young beau in Odessa. The book highlights the struggles of women in post communism eastern Europe, who must make ends meet while earning almost nothing. In particular, the novel tells the stories of women who chose to become 'mail order brides' as a way out of the poverty, but find that life in America is not all they dreamed it would be. Its an engaging read that draws you in quickly. I highly recommend it."}, {"userName": "Kasa Cotugno", "userReviewDate": "Jun 24, 2009", "userURL": "http://www.goodreads.com/user/show/2345554-kasa-cotugno", "userReview": "To liken this book to Desparate Housewives does it a disservice. Although I love that tv show, the story of Daria and her journey from post Soviet Union Ukraine to the United States is more serious and thoughtful. As there are no sexual harrassment laws protecting female employees from predatory bosses, Daria must use her wits to maintain her dignity. I felt that she was the most realized of the book's characters, and that others she interacted with were not as clearly thought out or presented. As the conslusion has been revealed by other reviewers (a practice I strongly disagree with), I will only mention that I thought the ending was not realistic given what precedeed it."}, {"userName": "Muphyn", "userReviewDate": "Sep 05, 2009", "userURL": "http://www.goodreads.com/user/show/1253753-muphyn", "userReview": "[Daria to get away from Tristan. I kept thinking that she might go back to Odessa and marry Vlad (hide spoiler)]"}, {"userName": "Aksana", "userReviewDate": "Sep 01, 2009", "userURL": "http://www.goodreads.com/user/show/1022881-aksana", "userReview": "I won this book on goodreads. I really really loved this book, I don't know if it's because it was written from the perspective of an Ukrainian woman (who it was like to live over there, in Odessa actually, and what it was like to move to the States). Of course, the whole story was not similar to mine in many ways, but it really spoke to me. Although I have to say that some words that the author used in Russian (writing them out in English letters) were misspelled or used incorrectly. Overall, I am looking forward to other books by Skeslien Charles."}, {"userName": "Karina", "userReviewDate": "Nov 06, 2009", "userURL": "http://www.goodreads.com/user/show/83526-karina", "userReview": "My mom enjoyed this book greatly, I guess because it reminded her of her own story. She was gushing to me about it, so that I told her in the end I'll give it a try. :)I'm only a little bit into the book (page 20), and wow, it's soo funny! Mom didn't mention the humor in the book; she was instead commenting on how well the author who isn't from Russia/Ukraine learned our culture in just two years she was here, including how many Russian idioms she used in the book etc. etc.Recommended to anyone interested in the Russian culture; and how it differs from American."}, {"userName": "Parsley Spasbinder", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/64839272-parsley-spasbinder", "userReview": "I wanted to like this very much. The beginning third was well written, if a little fragmented. In fact, it read as quite highbrow fiction and not at all like a typical massmarket book (which it was being marketed as where I bought it). Occasionally it started to read like a worthy but not so well-written thesis about mail order brides. I liked the characters. But I got that itchy feeling of a far-too-formulaic plot and had to skip to the end to find out what happened before I wasted any more time reading through..... Ergh. I was right to stop. But I did like the beginning."}], "description": "A Short History of Tractors in Ukrainian meets Desperate Housewives in this exploration of the booming business of Russian e-mail-order brides, an industry where love and marriage collide with sex and commerce.Odessa, Ukraine, is the humour capital of the former Soviet Union, but in an upside-down world where waiters earn more than doctors and Odessans depend on the Mafia for basics like phone service and medical supplies, no one is laughing. After months of job hunting, Daria, a young engineer, finds a plum position at a foreign firm as a secretary. But every plum has a pit. In this case, it’s Mr. Harmon, who makes it clear that sleeping with him is job one. Daria evades Harmon’s advances by recruiting her neighbour, the slippery Olga, to be his mistress. But soon Olga sets her sights on Daria’s job. Daria begins to moonlight as an interpreter at Soviet Unions(TM), a matchmaking agency that organizes “socials” where lonely American men can meet desperate Odessan women. Her grandmother wants Daria to leave Ukraine for good and pushes her to marry one of the men she meets, but Daria already has feelings for a local. She must choose between her world and America, between Vlad, a sexy, irresponsible mobster, and Tristan, a teacher nearly twice her age. Daria chooses security and America. Only it’s not exactly what she thought it would be… A wry, tender, and darkly funny look at marriage, the desires we don’t acknowledge, and the aftermath of communism, Moonlight in Odessa is a novel about the choices and sacrifices that people make in the pursuit of love and stability.", "title": "Moonlight in Odessa", "url": "https://www.goodreads.com/book/show/6443363-moonlight-in-odessa", "average": 3.76, "cover": "https://images.gr-assets.com/books/1312030633l/6443363.jpg", "reviews": 209, "authors": [{"url": "https://www.goodreads.com/author/show/2920231.Janet_Skeslien_Charles", "name": "Janet Skeslien Charles"}], "type": ["Fiction", "Womens Fiction", "Contemporary", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/6443363-moonlight-in-odessa", "http://www.goodreads.com/book/show/7970652-moonlight-in-odessa", "http://www.goodreads.com/book/show/7084614-moonlight-in-odessa", "http://www.goodreads.com/book/show/9303353-moonlight-in-odessa", "http://www.goodreads.com/book/show/9303385-moonlight-in-odessa", "http://www.goodreads.com/book/show/15717798-moonlight-in-odessa", "http://www.goodreads.com/book/show/34145069-montana-noir"]}