{"ratings": 785, "userreviews": [{"userName": "Paromjit", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "Jess Kidd returns with The Hoarder after her sublime and outstanding debut, Himself. There is much that echoes Himself in this story, its Irish background, the writing style with its themes of the supernatural and fantastical, its quirkiness, eccentric elements along with a dark gothic tale. It features rabid, volatile, relcalcitrant and cadaverous geriatric pensioner, Cathal Flood, who resides in the huge house, Bridlemere, heaving with the detritus of the Flood family history, spirits, ghosts, cats, a fox, macabre curiosities and so much more. Cathal has seen off all those sent to sort out the house and care for him, including Sam Hebden by assaulting him with a hurley stick. Psychic Maud Drennan, his latest carer, is made of much sterner stuff as she battles to clean and access the main parts of the house, impeded by Cathal and the Great Wall of National Geographics. Maud is caught by the Flood family drama, like the accident that killed Mary, but her nosiness is not appreciated by Cathal. Little by little, Cathal and Maud begin to connect as Cathal paints her portrait and tells her stories. Maud is often in the company of a coterie of saints only she can see, such as St Dymphna, who on occasion offer valuable advice, warnings and insights at critical times. Maud's colourful agoraphobic, transgender landlady, Renata, is certain murder has been done in Bridlemere, and whilst Maud is unconvinced, soon a board is set up charting the progress of their investigation. Maud meets Cathal's estranged son, and finds herself getting involved with Sam Hebdon. Maud is surrounded by a web of deceit, betrayal, loss and the increasing presence of danger swirling all around her, where not everyone is as they appear. Bridlemere is a home overflowing with grief, loss and pain. Running parallel in the narrative is the dark and haunting past of Maud in Ireland, when as a 7 year old child, her sister, Deirdre, disappeared.This was a great read, but it fails to climb the heights of the magical brilliance that is Himself. There are similar themes, characters and style present here, but it somehow lacks the same alchemy of Kidd's debut. There were occasions when the writing felt a little more laboured and perhaps there was an absence of greater creativity. Don't get me wrong, I still loved it enough to give it 5 stars, and Jess Kidd is undoubtedly imaginative, I just hope she either has something more to offer or she takes on something significantly more different in her next book. In any case, I will be wanting to read her next book as soon as it becomes available! I did absolutely adore the characters of Cathal and Renata. A wonderful read that I recommend highly! Many thanks to Canongate for an ARC."}, {"userName": "Larry H", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "I'm between 4 and 4.5 stars.Some authors know just how to tell stories. Jess Kidd is one of those. Fresh on the heels of her magnificent, magical book \nHimself\n (see my original review), which made my list of the best books I read last year, she dazzles with her storytelling ability again in her new book, \nMr. Flood's Last Resort\n.Maud Drennan is a caregiver whose seemingly unflappable attitude hints at a world-weariness you wouldn't expect of someone her age. But Maud isn't sunny and naive—a childhood tragedy left her slightly traumatized, and it somehow left behind a crowd of saints who appear to Maud at random times each day, befitting of the situation she's in. These aren't always welcome saints, mind you, but they do provide a sort of companionship.Maud has been assigned to the irascible Cathal Flood, a cantankerous old man who has taken pleasure in running off his previous caregivers any way he can—through fear, intimidation, even threats of physical violence. Mr. Flood lives in a dilapidated old mansion, filled to the brim with collector's items, decaying trash, and what seems like hundreds of cats who roam through the house. Maud is Mr. Flood's last resort, because if he doesn't let her get the house in order, his son has threatened to put him in an old-age home, something the old man will never let happen.At first, Mr. Flood torments Maud, changing moods so quickly her head spins, and trying the tricks that scared his previous caregivers away. But Maud doesn't scare too easily, and after a while, he realizes she has respect for some of the items he's been keeping all these years, and the two form a tentative bond. (It doesn't hurt that neither trusts his son.)But strange things do happen in the house. Maud hears noises when there's no one around, and even the cats react to invisible stimuli which startle and upset them. And how can she explain the photos which keep appearing mysteriously, photos which hint at secrets held deep within the house? Do these photos point to long-forgotten crimes, crimes which only she can help solve?Do people of a certain age have the right to live their last years however they want, or must they adhere to others' wishes? If you sense a mystery, is it your responsibility to try and solve it, even if it means betraying the trust of someone you've started to care for? Can you help someone pull their life together if you don't have yours fully together?Along with a cast of remarkable characters, Kidd addresses these questions in \nMr. Flood's Last Resort\n, and shows that the special environments she created in her first book weren't a fluke. This is a story about how important it is to come to terms with what happens in our lives, and that sometimes we must forgive ourselves as well as forgive others. It also is a story which demonstrates that our eccentricities don't make us less of a person, or less worthy of happiness.Although I felt the book moved a little slowly at the start, and lost steam a time or two, this was such an enjoyable read. Kidd drew me in to this world she created, and it felt so true—when Maud was combing through the piles and piles of junk, trash, oddities, and neglected collectibles, I felt as if I were in the mansion with her, smelling the dust and decay. There's certainly some predictability to this book, but that didn't detract from its immense charm.This type of book won't be for everyone. Those who like more realistic fiction and can't let themselves loosen the bounds of belief may find this odd or bizarre. But Kidd is such a marvelous storyteller, you should let yourself experience her books—if not this one, definitely \nHimself\n.NetGalley and Atria Books provided me an advance copy of the book in exchange for an unbiased review. Thanks for making this available! See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"userName": "Diane S ☔", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "4.25. Clever and imaginative. When I read this authors first book I was blown away by her clever mixing of the worldly with the unworldly. She does the same thing here, in a different way. Maud, who after a devastating incident in her childhood has a special connection with some who have passed. She is sent by her agency to the home of Mr. Cathal Flood, a hoarder, an elderly gentleman who has an irascible personality. The house if full of meaningful and meaningless stuff of all sorts. It is also over until with cats. Maud herself is accompanied often by a cortege of saints, among them Saint Valentine, Saint Rita,Saint Monica, Saint George and Saint Dymphya. They often provide comic relief. This is a mystery of sorts, the house seems to want Maud to know certain things, and provides her with unexpected items. From these things she becomes fixated on a missing girl, and finding out the secrets she is sure Cathal is hiding. Could he be dangerous? As Maud takes up the Hu for answers, the readers are introduced to her past and as secrets are exposed, clues found, the story is put together in a very entertaining and I unexpected way.This author has such a brilliant imagination. Her characters are different, a little strange but poignant and delightful all at the same time. There is darkness and light in her fiction, help from beyond, and somehow, at least for me it all works. She has become an author whose books I eagerly await. Can't imagine what she will come up with next. ARC from Edelweiss."}, {"userName": "Cheri", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "“Memory is like a wayward dog. Sometimes it drops the ball and sometimes it brings it, and sometimes it doesn’t bring a ball at all; it brings a shoe.”\nOn May 30 2017 I finished reading Jess Kidd’s “\nHimself\n,” one of my favourite reads of 2017. Not quite a year later, I’ve closed the last page on her latest, “\nMr. Flood’s Last Resort: A Novel\n” or “\nThe Hoarder\n,” the title depending on where you purchase your book. If you’ve read “\nHimself\n” then you know that Jess Kidd knows how to weave a magical tale, with a wonderful cast of characters, and “\nMr. Flood’s Last Resort: A Novel\n” testifies that her debut novel was only the beginning of what she has to share. This one also pulled me in from the very beginning. Maud Drennan’s life is infused with and interrupted by the visitations of saints, St. Valentine, St. Dymphna, and more, who come marching in and out of her life seemingly without an invitation, and who seem to have an opinion about everything and everyone that Maud has a connection with. They’re full of opinions and advice, if not information or advice that is particularly helpful. They are often amusing and help us learn more about Maud, her wishes and dreams for her life. When she’s not busy shuffling saints, or pondering how useful their advice is, she is working as a caregiver for Cathal Flood, an older gentleman who is impressively tall with large gnarled hands, and a house filled nearly to the brim with… “stuff.” All of which he’s very fond of keeping, as is, thank you very much. But it’s now out of his hands, and part of Maud’s job involves “decluttering” the house, turning the untidiness into something one could imagine living in. Once she has taken on the challenge of Mr. Cathal Flood, she finds herself standing inside his home, looking over the cloakroom, which she describes as a \n“straight-up, falling-down, Gothic crap heap…on a grand scale. Part-ballroom, part-cave…”\n Still, she is reluctant to part with her optimism of this venture.\n”I would certainly have agreed that Mr. Flood and myself, both being Irish, share a love of fiddle music, warm firesides, and a staunch belief in the malevolence of fairies. Not to mention the innate racial capacity to drink any man alive under the table whilst we dwell, in soft melancholy on the lost and wild beauty of our homeland.”\nAnd then there are the cats. Tabby cats, black cats, all kinds of cats seemingly everywhere, always a few keeping watch on the goings on of what has become their abode. I fell a little more in love with Maud’s quirky charm when she realized the cats had never been named, and so she set about naming them, all after famous writers.None of the clutter, the cats, the antagonism she feels from Cathal himself seems to phase Maud much, she’s intent on removing the clutter she finds – although she doesn’t really have to search for it as it’s more or less everywhere, it’s more choosing where to start. Over time, even Maud begins to see that not everything is trash; there are some things of value that is more than just sentimentality, beyond the wall of National Geographic Magazines threatening to topple and kill someone. And who would think to look under the magazines for a body? There’s more to this story, of course, a bit of mystery and intrigue. Photographs appear randomly that weren’t there before, and there always seems to be a new room or two to discover, new information about this family and how things became the way they are. In this sense, the house itself, an old house that has seen many better days and has also seen many things, becomes a presence almost as crucial to this story as the human characters (and feline, canine, the saints, and those whose presence is felt, if not seen or heard.) Life can be wonderful, but it can also be damaging, and few people go through life unscathed from the betrayal of someone they loved, or losing someone they love. How can we begin to forgive others if we can’t even begin to forgive ourselves? How can we accept that others may be happy in circumstances in which we can’t imagine ourselves being happy? It’s how these characters maneuver these murky waters, and how these unpredictable characters slowly reveal themselves to us, that made this such a charming read. It’s Jess Kidd’s brilliance that made this impossible for me to put down.\nHoarder\n - Pub Date: 1 Feb 2018\n Mr. Flood’s Last Resort\n Pub Date: 1 May 2018"}, {"userName": "Norma * Traveling Sister", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "4.5 stars! This novel had the perfect mix of genres that I absolutely love to read!MR. FLOOD’S LAST RESORT by JESS KIDD is a magical, clever, imaginative, and an absolutely wonderful novel that had me totally engaged, entertained, and interested throughout this entire book. JESS KIDD delivers a well-written and creative story here with an absolutely wonderful gothic mansion setting, quirky characters and an extremely mesmerizing storyline. I really enjoyed the magical realism and the Irish folktales that was seamlessly blended into the storyline. To sum it all up it was an interesting, charming, dark, comical, and an enjoyable read with a satisfying ending. Would recommend!Thank you so much to NetGalley, Atria Books and Jess Kidd for the opportunity to read an advanced copy of this book in exchange for an honest review!Review written and posted on our themed book blog Two Sisters Lost In A Coulee Reading.https://twosisterslostinacoulee.comCoulee: a term applied rather loosely to different landforms, all of which refer to a kind of valley."}, {"userName": "Karen", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/12851291-karen", "userReview": "This is the story of a lonely, Irish caregiver named Maud and a widowed old lonely hoarder that she is assigned to take care of named Mr. Flood.Mr Flood lives in this rundown gothic mansion with feral cats and all sorts of strange things and is just trying to stay in his own home without his son putting him in a care facility. There is a mystery involved here to be solved.Maud has her own story simultaneously throughout the book, her own mystery to deal with.I had so many moments of laughter reading this involving Maud’s relationship with many Saints (since girlhood she wanted to be a nun and fiercely read about the saints). The saints make their appearances throughout the book...really funny stuff!This author has such a fantastic imagination..and creates fantastic characters!! I really enjoyed this book, but her first book, HIMSELF, I enjoyed much more."}, {"userName": "Zoeytron", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "Copy furnished by Net Galley for the price of a review.Old man Flood, slightly crazed and eccentric to a fault, he hoards, he roars, he gnashes his dentures.  His home is full of cats that he doesn't bother to name, curiosities, secrets, and a fox that likes to be followed.  Something untoward is afoot here.  Maud, a caring and capable caregiver, lives with visits from vestiges of uninvoked saints who hover and watch, and some who make themselves a general nuisance.  Renata is Maud's agoraphobic transgender landlady.  She sports outrageous makeup and wardrobe, and has twin shrines to Jesus Christ and Johnny Cash.  She has a nose for mystery.I was hoping for a darker tale, but this ended up with more of a cozy feel to it.  I much preferred the author's debut novel, Himself, and this is what my rating is based on.  Still and yet, this one is fresh, original, and well worth the read."}, {"userName": "Brenda - Traveling Sister ", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/10841164-brenda---traveling-sister", "userReview": "Norma and I were lost in the heavy dense wooded coulee reading Mr. Flood’s Last Resort with four of our Traveling Sisters and we were swept up in the mystery and magic of this story that explores grief and loss. Jess Kidd does a good job bringing out some emotions here for us with the emotional depth that touches on grief and loss. Jess Kidd does a fantastic job creating well-developed enduring characters here with our main characters Cathal and Maud. We really loved the dynamics between these two very different characters that really added some contrast to the story. We loved the dynamics that the other colorful and eccentric characters brought to the story as well. What really stood out for us was Jess Kidd’s ability to blend a murder mystery set in a gothic mansion full of secrets and chaos with some black humor that adds some comic relief to the story. Thank you so much to NetGalley, Atria Books, Simon & Schuster Canada and Jess Kidd for the opportunity to read an advanced copy of this book in exchange for an honest review!This is Traveling Sisters GR Reading Group Review and it can be found posted on our themed book blog Two Sisters Lost In A Coulee Reading.https://twosisterslostinacoulee.comCoulee: a term applied rather loosely to different landforms, all of which refer to a kind of valley"}, {"userName": "Dorie", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/16912659-dorie", "userReview": "Initially I rated this book a 4 because it was such a slow starter but as I continue to think about everything that is so wonderful, the story telling, the characters, the uniqueness of the plot, I have decided that it deserves a 5* rating.It took me at least three starts to get into this book. It takes a while to get all of the characters straight and all that is going on with Maud and Cathal Flood. As you know from the very extensive blurb for the book, Maud is the caregiver that is hired as a last resort to get Cathal to clean out his once beautiful mansion. Maud is an amazing, unique and complicated character. She enjoys her job as a caregiver and cleaning lady and she usually handles things with a quite sunny disposition, a quote from her as she is in the office of the agency that hired her “Not for the first time I count myself lucky that I am free-range in my enterprises and not imprisoned in some administrative battery farm, breathing air heavy with regret and thwarted dreams. In my work I make a simple and constructive difference to people: to eat or not to eat, to have a clean arse or not to have a clean arse”. However she has had some trauma in her childhood. Perhaps as a result of this, we’re not sure why, she is constantly in the company of various saints. These appearances aren’t always welcome, sometimes the saints are helpful, sometimes they are annoying but they are always there as companions.Cathal Flood is such a complicated old soul. He hides behind a cantankerous disposition and has run off all previous caregivers. After he has tried many of his tricks on Maud and she still remains, they begin to form an alliance. He will let her clean out a small area of the house at a time and she handles his treasures with respect and listens to his many stories. It takes quite a while before we understand what is behind some of his actions and eccentricities but in the end I enjoyed and felt sorry for him as his “son” tries to get him out of the house and into an old age home. We all soon wonder why his son Gabriel is so intent on moving his father and why his father hates him so much?? He even tries to pay off Maud to help him get into the house while the old man is away, tries to convince her to take him on an outing so he can search the house, what is he looking for? Maud’s best friend and landlady, Renata, is a flamboyant transgender who is convinced that Mary Flood did not fall down the stairs on her own, she is certain that a crime has taken place. As Maud continues to work in the house she sees some strange signs of ghosts, hears unsettling noises and begins to share Renata’s belief that something is terribly wrong here.The storytelling in this book is phenomenal and the character development top notch, even the saints have personalities that are well defined. This book is a mystery and a wonderful literary accomplishment. The writing is so good I found myself feeling as though I were cleaning out the house with Maud, snooping through the upstairs rooms and encountering the odd things that happen with her. I know a novel is good when it elicits many feelings, sadness, joy, hope, forgiveness, even laugh out loud moments. I highly recommend this book but be sure to set aside a good stretch of time to get through the beginning, it will be worth it.Addendum: For those of you who love animals you will enjoy Cathal's companion fox which he raised from a cub. I liked some of the interactions between them, how wonderful to have a wild animal trust you enough to keep coming back and allow him to touch his beautiful fur. There were also a huge number of kitties because of the state of the house, but in his own way he cared about them, leaving food out for them.I received an ARC of this novel from the publisher through Edelweiss."}, {"userName": "Phrynne", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "Magical realism can be so good when done by the right author. Jess Kidd is one of those authors.Like her brilliant debut novel, Himself, The Hoarder features a number of quirky Irish people and quite a few ghostly spirits. In this book the ghosts are mostly saints who communicate or not with our main character Maud. They also supply a lot of the humorous touches throughout the story.Maud is a Care Worker who finds herself looking after the outrageous Cathal Flood. His home appears to be a classic case of hoarding with rubbish dating back to 1990 piled in every direction. Eventually Maud discovers much more is going on and her investigations eventually lead to a grand climax. There is so much to love in this book - delightful characters, ghosts who speak, mysterious deaths, tame foxes, many, many cats and more. I loved it and am adding Jess Kidd to my list of favourite authors."}, {"userName": "Susanne Strong", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/4514828-susanne-strong", "userReview": "4 Stars.Fantastical, Magical, Wondrous & Whimsical. It captures your heart and holds on tight. Cathal Flood is an angry, cantankerous, difficult old man who lives alone in Bridlemere, a dirty, disgusting old mansion, which houses lots of secrets, perhaps a few ghosts and several quirky cats too. Maud Drennan has always lived a lonely sort of life. Having lost her sister at a young age, grief has always been with her. She is a special sort, seeing and hearing things that others don’t, including Saints, or Spirit Guides, as the case may be. Maud is the carer who is assigned to Cathal Flood. She is his last hope. If she can’t control Cathal, his son Gabriel is planning to send him off to a home. His less than sunny disposition is a more than bit scary for Maud - as are all of the noises and strange things she encounters at this old house, yet she can’t help but find Cathal and Bridlemere intriguing. When photographs from the past start popping up at Bridlemere, Maud finds herself deeply enveloped in old mysteries.. ones she just can’t help but want to solve, even though she is not a detective. With the help of her friend Renata, Sam Hebden, Mr. Flood’s former carer and several spirit guides such as St. Dymphna and St. Valentine surrounding her, Maud takes off investigating. She must do this - it is her calling. \nMagic ensues. Whimsy abounds. Psychic elements mystify. In “Mr. Flood’s Last Resort,” Hearts get broken along the way, mine included.\n Tears fell. More than once. Cathal Flood is a man whose oddities endeared me when perhaps they should have scared me, at least a little. Maud Drennan is quirky and surprisingly bold at times when you least expect. Renata is the dearest of friends - I wish she was one of mine. This is Jess Kidd’s second novel and she proves that she has the ability to write magical supernatural fantastical stories with characters like no other. “Himself” Jess Kidd’s debut novel was one of my favorite reads of last year and while this one came close, it wasn’t quite as captivating. Though this seems to simply be a quirky novel involving fantastical supernatural elements, it also involves serious storylines about grief and loss and deals with both in an enchanting and lovely way. Having read both “Himself” and “Mr. Flood’s Last Resort,” I am now completely entranced by Jess Kidd and am eagerly awaiting her next novel. This was a Traveling Sister read which made for an incredibly interesting and informative discussion. I loved reading this whimsical fantastical novel with my sisters. It made this read even more amazing! For full traveling sister group reviews, please see Norma and Brenda’s blog: https://twosisterslostinacoulee.comThank you to Atria, NetGalley and Jess Kidd for an ARC of this novel in exchange for an honest review. Published on NetGalley, Goodreads, Twitter and Amazon on 6.3.18."}, {"userName": "Esil", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "Mr. Flood’s Last Resort is the first book I’ve read by Jess Kidd. She has a great imagination and lots of talent. The plot feels a bit like a rollicking romp with a bit of a mystery at its core. Maud is assigned to provide home assistance to a raging aging hoarder, Cathal Flood. Flood has some complicated family secrets that Maud unearths as she goes through his house. Maud has her own childhood secrets. Despite the topic, the tone of this book is not sad, but rather has a dark humorous edge. Top amongst my favourite aspect of the book are a couple of pesky angels who surface every now and then to debate what course Maud should follow. I also liked her agoraphobic neighbour who also offers Maud a steady supply of advice. Smart and original is my final verdict. I’ve heard good things about Kidd’s Himself, which I will definitely read some time soon. Thanks to Netgalley and the publisher for an opportunity to read an advance copy."}, {"userName": "Juli", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/38617426-juli", "userReview": "I love it when I come across a book that is brilliantly bizarre and incredibly creative. It only took a few paragraphs for me to get completely engrossed in this story. I couldn't stop reading. Cathal Flood is 80+ years old and lives in a large, horrific house, Bridlemere. He's a hoarder....like the ones you see on reality television shows where people come in wearing protective clothing and face masks to shovel out years of junk, animal poop, and moldy horrors straight from hell. Maud Drennan is his latest caregiver. The last one ran out of the house, driven half mad by the place. Maud just does her job clearing a bit of the mess at a time, never caring about things like why there is a mug tree in the toilet or what brings someone to collect a 12-foot wall of National Geographic magazines. She tries hard to ignore Mr. Flood's curmudgeonly fits and rants. He's mean, but Maud and her assistance is his last chance. If she fails to clean up his house and help him live independently, his son Gabriel is going to put him in a care home. But there's something more going on. Maud isn't quite sure what it is....or if she cares. She starts finding strange things while cleaning....a photos with faces burnt off with a cigar that just seem to appear in random places, an abandoned caravan with the windows boarded up amid the junk in the yard, information in the old man's care plan about his dead wife. Weird, unusual things. But she really can't speak to the old man's madness....she sees saints. They appear everywhere, speak to her, follow her, and are a strange comfort for her. Her agoraphobic transsexual neighbor urges her to investigate, but Maud just wants to mind her own business. A crazy old man living among cat turds and piles of garbage is not something she wants to dig into too deeply. Or is she afraid she might learn something horrible? About him? About herself?This book was SO good! I absolutely love a great story that's totally something new. I have never read a book that was in any way like this one. So weird.....and so mesmerizing at the same time. I loved Mr. Flood's stories, and the little bits of Maud's life revealed here and there. The suspense was wicked cool. Just an entertaining, strange little book....I was sorry when I reached the end and it was over! The characters are quirky and unusual. The pace was perfect. The suspense and wondering WTF was going on kept building until the end. No spoilers from me -- read the book! :) Just lovely! This book is my favorite of 2018 so far. This book was also published under the title The Hoarder. Jess Kidd is the author of one other book, Himself. After enjoying this book so much, I will definitely be reading her other book and any future ones! **I voluntarily read an advance readers copy of this book from Atria Books via NetGalley. All opinions expressed are entirely my own.**"}, {"userName": "Marialyce", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "4.5 stars to a fantastical book! You can find my reviews here https://yayareadslotsofbooks.wordpres...Well this is a book for those of us who like a little bit of everything in their stories. Do you like magic, possible ghosts, a strange house, characters that are weird, loving, cantankerous, nasty, and dirty? Yes, they are in there. Do you like relationships that develop into friendships, saints, sinners, and everything in between? Well yes, again, they are in there. Do you like novels of loss, of eeriness, and things Irish? Well then you are in luck because that is in there too! I think of this book as the Prego sauce of books! Through the writings of Jess Kidd, we meet some very interesting people such as the curmudgeon Mr Flood. He is dirty, intimidating, has a potty mouth, and might even have bumped off his wife. Then there is Maud, a young girl with a hard past sent to care for Mr Flood seeing that his needs are met. Initially they have a pull and tug relationship but as Mr Flood gets to know Maud and she him their relationship becomes one of care and concern. Maud herself is no stranger to weirdness. She carries around saints with her that converse with her and follow her into various situations. She has a great friend Renata, who is agoraphobic and a transvestite. ...and then there are the villains! Not wanting to say much about this happenings but if you are a fan of the whimsical, the sad, and the value of friends, then this novel might be to your liking. It was to mine. This was a Traveling Sister read and one where we all seemed to get enjoyment from Mr Flood, Maud and the rest. Thanks goes to my local library for coming through with this book. I can always count on them to provide this reader with lots of fun and happy hours of reading. I think Jess Kidd should at some point write a book with Neil Gaiman. They both see our world through the lens of its differences and idiosyncrasies. Could you imagine the book they would write!"}, {"userName": "Ova Incekaraoglu", "userReviewDate": "Dec 11, 2017", "userURL": "http://www.goodreads.com/user/show/5316099-ova-incekaraoglu", "userReview": "Please see the full review on my blog:https://excusemyreading.com/2017/12/1...First of all, I'd like to thank Netgalley and Canongate for providing me with an ARC of this book in exchange for an honest review.I really liked this book. It is funny but sad at the same time, full of emotions, witty descriptions and quirky characters. It reminded me a lot of Neil Gaiman's works but the writing and storytelling is even better. (Sorry Neil) Our story takes place in a world where teenage girls go missing, grumpy old men feed foxes(very much like ours) and Saints stroll the streets without a soul being able to see them. Well,everyone except Maud. The hesitant clairvoyant Maud is an underpaid social worker with a sharp sense of humour:It's funny how humans and care workers adapt. On my first day I thought the reek of Mr Flood's house would take the top of my head off. By the end o my shift I could eat a fig roll if I breathed through my mouth.Maud can see the beings from after life, mostly saints carelessly wandering around as a part of her daily life. She can see St Valentine by the fridge, or St George can pass by when she's sipping her coffee in a cafe. Most of these Saints are quite interesting types, you would expect them to be boring and bland maybe, but they are full of sarcasm and nosiness. The grumpy old man, 'The Hoarder' of this story, Cathal Flood is Maud's new assignment. He lives in a grand house which is not looked after and filled with all sorts of objects, trinkets and junk. He hates his son but looks after his cats and a wild fox. Maud befriends Cathal, and gets interested in his family's past. As the old man opens up to her, with the help of her clairvoyance she will discover there is more in the past of Flood's than it seems. This book is a parade of quirky characters. The transgender sidekick - landlady Renata, Cathal Flood - swinging between being an artist and a complete lunatic, the Saints, appearing everywhere, with their expressed views and openness. I loved each one of them! Also the story got me hooked, although some of it was fairly predictable I found it impossible to drop the book before the last page.I would love to read more of Jess Kidd. Her writing is funny and pure. I also loved the ending and would hope very much to read another novel with same characters!I think you might like Elizabeth is Missing by Emma Healey if you liked this book, although that one didn't have any fantastic elements in it.I also love the references in the book to the other literary heroes I loved. It always makes me instantly bond with the author when I discover they like my favourite literary characters too...A 4.5 out of 5 starts from me.Here are some bits from the book I highlighted: In Renata's eyes there is the creak and pitch of thousand ships and the moon on the water and the song of a sad drunken deckhand. \"It's grief, you see, Maud.\"\"What is?\"\"That causes people never to throw anything else away, ever again. Not even a crisp packet. They can't take another loss. Believe me. I'm no stranger of bereavement.\"\"...the loveliest eyes are found in the heads of women who have suffered.\" He smiles. Damage lies at their shining core...\" \"Jobs are very dangerous.\" She closes her eyes. \"Disappointment, lung disorders, boredom, stress, futility, suicide, heart disease, disillusionment, diabetes, strokes.\"The Hoarder will be published in February 2018 and I have a feeling it's going to be one of the most liked books in this genre in 2018.#JessKidd #Canongate #NetGalley"}, {"userName": "Lucy Banks", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/57486568-lucy-banks", "userReview": "I received a copy of this book from Netgalley, in exchange for an honest review.Beautifully written, wonderful Irish narrative voice - a clever, engrossing novel.I adored Jess Kidd's Costa Short Story Prize winner last year, so it came as no surprise to me that I'd love her latest book, The Hoarder. Every so often, I'll come across a book that's so well written it makes me smile, and I'm pleased to say this was one of those!Maud, a social worker, is sent to care for Cathal Flood, a cantankerous old man who lives in a complete hovel, surrounded by endless years of rubbish, several cats, and (after a bit of exploration from Maud) a bizarre collection of 'collector's items'.However, there's more to the house than just junk and oddities. Turns out, there's several whopping great secrets concealed there too, involving missing siblings, dead parents and possible murder. Maud herself is a wonderful protagonist - her no-nonsense Irish voice was strident and rich throughout, which was one of the novel's stand-out charms. So too were the fabulous ensemble of supporting characters - the gorgeously depicted Renata; an ageing transvestite with a love of mysteries, the dishy social worker Sam, the hilarious 'psychic' who turns out to be rather different than initially imagined - I could go on and on. I also adored the congregation of sarcastic, occasionsally distasteful saints, not to mention all the ghosts!In fact, it's these glorious characters and fantastic narrative voice that drive the plot forwards, more so than the plot itself - but don't let that put you off, it makes a refreshing change from the usual mystery / thriller books out there. Definitely read, people!"}, {"userName": "Tania", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/6450088-tania", "userReview": "\"A house, a labyrinth of rubbish, a crazy old man and a message in a bottle: all the ingredients of a twisted crime story.\"I really enjoyed Jess Kidd's debut, Himself and I am happy to say that even though The Hoarder is set in modern times it is as quirky and original as it's predecessor. The writing is atmospheric and evocative. Two other elements present in both her books are humor and interesting characters. Cathal - a darker version of Ove with many more eccentricities, Renata - an older, more vulnerable version of Priscilla, queen of the desert and Maud - an instantly likable, strong and intelligent psychic who communicates with the ghosts of catholic saints. I think what makes this author so unique is that how quickly you lose your heart to these offbeat characters and may even shed a tear or two when the time comes to say goodbye. A beautifully written, Irish mystery with a Gothic feel, lots of wit and a touch of the supernatural.The Story: The plot centers on Maud, an Irish care worker tasked with the unenviable job of decluttering cantankerous geriatric Cathal Flood’s neglected and junk-filled London home. Her subtle gift of mediumship sends her warnings, though, in the form of newspaper cuttings about a missing girl, whispers in the kitchen, and hidden letters. With the help of her detective story-obsessed landlady, Maud delves further into the house – and Cathal’s history – than she really should."}, {"userName": "Sonja Arlow", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/6449756-sonja-arlow", "userReview": "3.5 starsThe author most definitely turned the weird and quirky up a notch with her 2nd book.There are several mysteries all jumbled up in a house stuffed to the brim with things. From the Great Wall of National Geographic Magazines to eyeballs in glass – Cather Flood is a hoarder of the first order. He is old, grumpy and chases away more assisted living companions than he cares to count.That is until Maud shows up, armed with her own secrets and every ghostly saint you can think of. With the help of Maud’s flamboyant landlady Renata, they try and puzzle out exactly what’s going on in Cather’s house. Was Mary’s death really an accident, why is Gabrielle so desperate to get into the house and is Sam really who he says he is.The only criticism I have is that the inclusion of Maud’s often confusing dreams made an already full story more crowded.I liked Himself a little more than this one but I had to round up my rating because this author’s books are always imaginative, unique and like a breath of fresh air. Worth the read."}, {"userName": "Dana", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/10503220-dana", "userReview": "A fantastic blend of magic and mystery.Review to follow...."}, {"userName": "Sharon", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/10827825-sharon", "userReview": "Book reviewed for NetGalley and Canongate BooksPublication date 1st February 2018The Hoarder seems like your average ghost story. As you dig deeper, it soon becomes clear that it is anything but average. You are confronted with a labyrinth of family secrets, ghostly apparitions, betrayal and a group of most unhelpful saints. Like Cathal wading through the mountain of rubbish that fills every conceivable space in his home. The reader wades through this atmospheric story with their heart racing and their mind working overtime trying to figure out what secrets are hiding in Bridlemere. As a psychic and ardent believer in the afterlife, I knew I had to read this book as soon as I read the blurb. All characters were extremely well written, coming to life on the page. Maud and Cathal were amongst my favourites. Maud for her straightforward no-nonsense attitude and Cathal for his cunning nature. The story itself has an almost oppressive feel to it but in a good way. It draws the reader in making them feel part of everything that is going on around them. When I was reading the parts set in the house, I could sense the overwhelming feeling of grief, loss and foreboding that came from Cathal. As the story builds to its surprising conclusion, many secrets are brought into the light. Will definitely be re-reading this again in the future."}, {"userName": "Maria Chnoic", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/46346297-maria-chnoic", "userReview": "A magical read? This is the second Novel of Jess Kidd’s that I have loved. However, I always find them quite intimidating to review as she has such a distinctive style. I do not have the language skills to communicate what this book is like. How does one give a sense of the Magical Realism employed? A world where a Saint will butt in and give their own onion’s on your love life and where house will provide an essential clue to a mystery by more or less throwing it into the amateur sleuths face. “a jar of pickled beetroot edges forward diffidently. Its neighbour, a box of savoury crackers, follows suit with more conviction…..sliding boldly out of their places as if they are offering themselves up for a dangerous mission”As always Jess populates her world with larger than life characters. The cantankerous Cathal, the House (Bridlemere ), a small cast of medieval saints, Maud’s landlady Renata, “emerging like a New Age butterfly from her ground floor cocoon” and of course Maud herself. I even love to hate the antagonist. There is a wicked sense of humour through out the Novel. “Like David turning up at Goliath’s with rubber gloves and a risk assessment and wondering where the hell to aim”As for cozy mysteries let me just say that Maud Drennan and her sidekick Renata - are probably my favourite amateur detectives ever. So let’s just sum up that after reading Jess Kidd's second novel that she is still an auto buy author for me. Recommended to those who like cozy mysteries with humour and magic and those who have also read and loved Jess’s first novel Himself."}, {"userName": "Marianne", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/5067228-marianne", "userReview": "“Memory is like a wayward dog. Sometimes it drops the ball and sometimes it brings it, and sometimes it doesn’t bring a ball at all; it brings a shoe.”The Hoarder is the second novel by London-born author, Jess Kidd. Care worker Maud Drennan has survived a week with Cathal Flood, and that’s no mean feat. He’s a hostile old man, argumentative, insulting, uncooperative. He lives is a grand house, Bridlemere, that’s filled up with junk including the Great Wall of National Geographics which blocks access to the upper floors. Maud has managed to clear just a few rooms, is tolerated by the cats and tries to feed Cathal a good meal for his dinner. But then the house or, more likely, the restless ghosts within, begin leaving her artefacts: a defaced family photograph, or two; a newspaper clipping. Maud’s agoraphobic, jump-to-conclusions landlady, Renata believes they are clues to a mystery surrounding Cathal Flood and his family: an estranged adult son; a wife deceased in a fall down the stairs; and a daughter whose existence is hotly denied. Oh, and a fifteen-year-old schoolgirl from Dorset, missing some thirty years.As Maud investigates (somewhat reluctantly), she meets people who are not always what they seem and hears stories that are incomplete, incorrect or conflicting. Despite his build and his attitude, Maud feels she has nothing to fear from Cathal (but should she?); his son Gabriel, she’s sure she can’t trust. And why is Cathal’s previous care worker still on the scene? Missing sisters, missing fifteen-year-olds: it takes Maud’s mind back to her childhood and her own missing sister, so disturbing dreams fill her sleep and unsettling memories plague her thoughts. And as usual, Maud is surrounded by a cast of saints, not quite a Greek chorus (they’re too individual for that); some are silent but communicate in looks and gestures, others offer advice and a running commentary on events; some uncannily resemble figures from Maud’s past. What a deliciously intriguing mystery Kidd serves up to her readers: a cast of quirky characters (and that includes Maud’s saints and Bridlemere itself), sparkling dialogue and a clever plot that twists and turns to keep the reader guessing. Maud’s inner monologue is a delight and there’s plenty of humour (some of it quite dark): “The best time to acquire a puppy is when you’re in the middle of a missing-person investigation and the man you’re sleeping with is planning to dispatch you with a crowbar and wrap you in plastic sheeting” she tells the puppy as they drive along in said man’s stolen car.While the Bridlemere mystery is tidily solved with a rather exciting climax, Maud’s personal one is not so neatly put away, leading the reader to wonder if there will be more of Maud Drennan, a prospect that would not be unwelcome. In fact, anything Kidd offers up will be eagerly anticipated. Funny, moving and hugely entertaining."}, {"userName": "Sue", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/27024624-sue", "userReview": "With thanks to Canongate Books via NetGalley for the opportunity to read this. I very much enjoyed Jess Kidd’s first novel ‘Himself’ and many of the things I liked so much in that one are here in this new book too. Her deadpan humour, for sure. One quotation that made me laugh: ‘Besides, the old man is looking a lot less peaky, still cadaverous, but filling out a little around the eye sockets.’I was very taken with the ghostly saints, their behaviour, their reactions to events and her description of their special interests - St George (cavalry, chivalry, herpes), St Monica (disappointing children, victims of adultery).Her characters held my interest and I warmed to cantankerous old Cathal and the exuberant Renata. If there was one thing that disappointed, it was that the darkness at the core of her earlier book was missing. The mysterious elements were not really mysterious enough, the bad ones rather obvious and the ending tied up loose ends too neatly for my taste. An fun romp through the spiritualist world but doesn’t quite match up to ‘Himself’."}, {"userName": "Lisa *OwlBeSatReading*", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/4695379-lisa-owlbesatreading", "userReview": "Time wavers and retreats at Bridlemere, coughing and shambling. Here is history mutely putrefying and elegance politely withering.Two weeks it took me to read The Hoarder by Jess Kidd. Two weeks of beautiful, poetic writing, which ambled along at a pace slower than I normally would like. That said, the speed at which this story unfolds was exactly how it should be. I devoured every sentence, re-read many paragraphs, I wasn't itching for a conclusion or big reveal, I was deep in the moment, sucked in by incredible writing.I loved everything about the story, the writing style, the characters, the humour, the sadness and poignancy. Whilst reading, I felt as though I was transported to Bridlemere, the aromas of a once grand mansion seeped into my senses, the quirky characters had my undivided attention, and the paranormal elements added an unusual and often amusing twist.Sometimes the wind dropped down and hid behind the dunes, sometimes it sent playful handfuls of sand skipping. Sometimes it raised colossal storms to scour your arse all along the strand.I'm not entirely sure whether I've read anything with Irish protagonists before, if I have, it's gone unnoticed or forgotten. The sometimes slightly crass dialogue brought smirks and smiles, just breaking up the flow enough to give it an edge, perfectly placed, no profanity for the sake of it.The Hoarder is faultless, I am finding it difficult to review in all its perfection. I didn't read too much about it prior to starting it, and went in blind. I just had a funny feeling it would blow me away. And it did just that.Huge thanks to the author, Jess Kidd, the publisher, Canongate Books Ltd and NetGalley for the opportunity to read this in exchange for an honest review."}, {"userName": "Tracey Allen at Carpe Librum", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/4986986-tracey-allen-at-carpe-librum", "userReview": "Do you ever see a book cover and just 'know' it was designed for you? I'm in love with the cover - and title - of The Hoarder by Jess Kidd, and the wallpaper design with the sinister burn mark in the centre dings all of my bookish bells.In The Hoarder by Jess Kidd, Maud has been brought on to look after Cathal Flood and clear his old house of rubbish and refuse. Cathal is a reclusive and grumpy old man living in a run-down mansion packed with clutter, mementoes and secrets; all of which are threatening to overwhelm him.The Hoarder is a mystery novel at heart with a mystery surrounding Cathal's family and the disappearance of Maud's sister in childhood. Maud is a terrific character and her no-nonsense approach with her client was an absolute joy to read. The inclusion of a little magical realism in the form of the 'saints' Maud could see was interesting, but not altogether necessary to the plot in my opinion. I didn't quite understand why she could see and talk to saints but not to the ghosts of the departed. I did enjoy the character of Maud's friend and neighbour Renata though, who could easily command a book of her own. However, the mystery surrounding Maud's sister wasn't resolved to my satisfaction, leading to the deduction of 1/2 star in my rating.All in all, I adored reading The Hoarder and often found myself thinking about the cantankerous old man and looking forward to the time when I could pick up the book and continue the story.* Copy courtesy of Allen & Unwin *"}, {"userName": "Mary Lou", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/6068952-mary-lou", "userReview": "I hope it is not too early to review this book, it is not published until February next, but having enjoyed Himself so much, when I got a copy of The Hoarder I stopped what I was doing and read it straight away.I love Jess Kidd for her wonderfully extravagant imagination, her blunt, but still elegant atmospheric writing, her magnificent character creations and her gobshites.The Hoarder misses the irresistible Mahony and the outrageous Mrs Caughey from Himself, but this whodunnit set in London around a manor house and its elderly owner, both of whom have seen better days, is another page turner. Once again Jess Kidd takes the reader on a crazy trip, purpose and destination unknown for a long time. There are times when the carousel goes too fast and the fabulous characters and artefacts blur as you whiz past them. The saints in particular often appear random, especially as they are mostly of little help. The central character Maud Drennan displays more equanimity than I could muster if St George dumped a dead serpent on my table in St***ucks. Look out for this one. With thanks to Netgalley and Canongate Books"}, {"userName": "Karen Mace", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/3360267-karen-mace", "userReview": "Where do I even begin??!! I loved Himself and it made it on to my Top Books of 2017, so I've been so eager to read this and was lucky to have been sent an early copy from the publisher.  I just couldn't put this down!! I read it in one sitting!! That pretty much tells you my thoughts on this book! I frigging loved it!! It made me laugh, it made me cry, it even made me forget to breathe at times as the tension started to build and the mysteries began to be revealed! A pretty comprehensive and perfect reading experience all wrapped up in one book!!It starts off quite quietly as we get acquainted with Maud Drennan who has the unenviable job of 'helping' the prickly Mr Flood who has a serious hoarding problem. Of course he doesn't see it as a problem so does all he can to prove as unhelpful as humanly possible, but there is something slightly different about Maud who doesn't flinch at the abuse he throws her way, and Cathal Flood slowly responds to her in the way where others have given up and been forced out. During their time together he starts to share stories and opens up to her. Maud has her own secrets too and she becomes fascinated by the stories she hears, and the house itself begins to give up its' secrets as she clears things out and she finds herself involved in mysteries going back many years.Maud also shares the stories she hears with her landlady, the wonderful Renata who is agoraphobic, and the ghostly Saints that follow Maud wherever she goes, and a world of intrigue soon opens up that maybe they should have left well alone. Even the Saints warn her off from exploring more - if only she listened to them!!All the characters in this book were so different and complex but lovable in their own special ways. Maud had her own difficult and secretive past and that was quite obvious at times, but that helped her put on a front especially when she first entered the world of Cathal. Renata is a delight to read about - the way she took on trying to solve the mysteries was hilarious and there were many touching scenes involving her where it was obvious how much Maud and her were devoted to each other. And as for Cathal, despite his abuse and prickly demeanour, you get to see different sides to him through his concern for a fox, his hatred for his son and the sadness over losses he has suffered over the years.This book had it all for me - it was so cleverly paced so there were never any dips in where the story was heading, and it just had me captivated from start to finish! I became so attached to all the characters that I've not really stopped thinking about them since I put the book down so can't wait to pick this up again and enjoy all the dark humour, mystery, supernatural twists and human drama all over again!! More please Jess!!Thank you to the publishers and author for the advanced reading copy in return for a fair and honest review."}, {"userName": "Elaine Mullane", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/873807-elaine-mullane", "userReview": "The Hoarder is my first introduction to Jess Kidd. I want to thank Netgalley and the publisher for providing me with an early copy to review in exchange for an honest review.Maud Drennan is an Irish carer living in Wests London. Her latest assignment is to cook and clean for Cathal Flood, a bitter and belligerent pensioner living in a huge old house, within which he has managed to amass a collection of junk. From general rubbish to walls of National Geographics, as well as certain macabre curiosities, the hoarder's home is swelling with oddness. Within the walls of this once-grand house, also lie deep hidden secrets, stories of the Flood family, from a dead wife to a missing child. Immediately I was intrigued.Adding to strangeness surrounding Cathal, we soon learn that Maud is a psychic of sorts. Throughout the story she communicates with and gets help from a number of Catholic saints (dead, obviously), but only she can see them. As Maud begins to look into the history of Cathal's home, she enlists the saints, along with her glamorous but agoraphobic landlady, Renata, to help her uncover the truth. As the plot moves forward, we also delve into Maud's past, learning about her sister, Deirdre, who disappeared at the beach one summer in Wexford. Kidd's strength as a writer lies in her incredible imagination and ability to evoke the most vivid accounts of the supernatural and eerie. Some scenes in this novel genuinely frightened me, they were presented with such terror and clarity. Ghosts are often difficult to conjure in a realistic manner, but Kidd's ghosts are truly believable. She also has a knack for writing wonderful characters. Maud herself is instantly likable, while Cathal is lovable despite his cantankerous nature, purely owing to his comic interactions with our protagonist. Renata is a sheer scene-stealer, making every moment of the pages she graces memorable. I thoroughly enjoyed this novel. The story is wonderful, the premise is both thrilling and addictive. I loved the Gothic, paranormal feel to it and how Kidd effortlessly blends the frightening with the funny. Brilliant wit, excellent characters and a perfect pace. I am deducting one star for the saints: they cluttered the story a little and were often distracting. But, for that, Kidd can be forgiven. Recommended."}, {"userName": "Producervan in Sedona, AZ from New Orleans & L.A.", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/10047843-producervan-in-sedona-az-from-new-orleans-l-a", "userReview": "The Hoarder by Jess Kidd. ©2018. Cannongate Books, published 01 February 2018.I really adored Jess Kidd’s debut book, Himself—truly one of my favourite books of 2017. If you enjoy Irish fiction, magical realism and eccentric characters that are full of secrets—interesting, endearing, sharply drawn, and at times a little unnerving-you will not be disappointed!Thanks to Netgalley for providing this ebook for review."}, {"userName": "Marc", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/8744144-marc", "userReview": "This is a magical, mysterious, wonderful novel. Jess Kidd is a new addition to my favorite authors. \"Himself\" was an amazing read and this one lives up to it."}], "description": "The spellbinding tale of a lonely caregiver and a cranky hoarder with a house full of secrets.Maud Drennan is a dedicated caregiver whose sunny disposition masks a deep sadness. A tragic childhood event left her haunted, in the company of a cast of prattling saints who pop in and out of her life like tourists. Other than visiting her agoraphobic neighbor, Maud keeps to herself, finding solace in her work and in her humble existence–until she meets Mr. Flood.Cathal Flood is a menace by all accounts. The lone occupant of a Gothic mansion crawling with feral cats, he has been waging war against his son’s attempts to put him into an old-age home and sent his last caretaker running for the madhouse. But Maud is this impossible man’s last chance: if she can help him get the house in order, he just might be able to stay. So the unlikely pair begins to cooperate, bonding over their shared love of Irish folktales and mutual dislike of Mr. Flood’s overbearing son.Still, shadows are growing in the cluttered corners of the mansion, hinting at buried family secrets, and reminding Maud that she doesn’t really know this man at all. When the forgotten case of a missing schoolgirl comes to light, she starts poking around, and a full-steam search for answers begins.Packed with eccentric charms, twisted comedy, and a whole lot of heart, Mr. Flood’s Last Resort is a mesmerizing tale that examines the space between sin and sainthood, reminding us that often the most meaningful forgiveness that we can offer is to ourselves.", "title": "Mr. Flood's Last Resort", "url": "http://www.goodreads.com/book/show/36373281-mr-flood-s-last-resort", "average": 3.91, "cover": "https://images.gr-assets.com/books/1520867298l/36373281.jpg", "reviews": 215, "authors": [{"url": "https://www.goodreads.com/author/show/15044123.Jess_Kidd", "name": "Jess Kidd"}], "type": ["Fiction", "Mystery", "Fantasy", "Magical Realism", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/36373281-mr-flood-s-last-resort", "http://www.goodreads.com/book/show/36269325-the-hoarder", "http://www.goodreads.com/book/show/38128947-mr-flood-s-last-resort", "http://www.goodreads.com/book/show/36362736-the-hoarder", "http://www.goodreads.com/book/show/38921121-the-hoarder", "http://www.goodreads.com/book/show/33023729-himself", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}