{"ratings": 186, "userreviews": [{"userName": "Susan", "userReviewDate": "May 27, 2010", "userURL": "http://www.goodreads.com/user/show/2255151-susan", "userReview": "If you are a fan of the classic style of the mystery greats you will find yourself right at home. Unlike most stories you will not find that you have figured out most of the details of \"who did it\" before you are half way through it. You will be drawn right into trying to fit the clues into the puzzle with Edna. Edna is a very relatable character who has not been given any special traits or skills necessary to solve a crime. She could be you or me. Mary, her would be side kick, a bit of a hoot, is the perfect contrast to Edna's more serious nature. All of the characters are crafted with normal human behavior, whether it be good or bad. The plot is simple and believable, not entangling the reader in complicated unbelievable twists and turns. The knowledge of the various uses of the plants is intriguing and adds a touch of allure. Once you get started you will not want to put it down."}, {"userName": "Shirley  S.", "userReviewDate": "Jun 27, 2010", "userURL": "http://www.goodreads.com/user/show/3866317-shirley-s", "userReview": "Murder by Yew is an absorbing mystery that speaks directly to the baby-boomer generation. Edna Davies, a competent mother and housewife, happily married to a doctor who has recently retired, is settling into a small Rhode Island town to enjoy their \"Golden Years.\" Her instinctive politeness and her skills in art and gardening suggest an easy life, but two frighteneing events happening while her husband is away drag her into a search for dangerous criminals. It is fascinating to see Edna, armed only with the foritude and skills she has developed as a wife and mothther and the stalwart determination she has inherited from her New England ancestry, tackle the hidden evil. Miss Maarple has entered the 21st century."}, {"userName": "Stacy Juba", "userReviewDate": "Mar 15, 2010", "userURL": "http://www.goodreads.com/user/show/2531101-stacy-juba", "userReview": "Suzanne Young has created a warm, charming and feisty heroine in amateur herbalist Edna Davies, and the Rhode Island setting provides the perfect backdrop for the novel. Full of twists and turns, this book is hard to put down."}, {"userName": "Lori Henrich", "userReviewDate": "Aug 27, 2011", "userURL": "http://www.goodreads.com/user/show/5703400-lori-henrich", "userReview": "I loved this story. The main character Edna reminded me of a cross between Jessica Fletcher and Miss Marple.Edna and her husband just recently moved into their new house. The former owner was an avid gardener and kept extensive journals on the different plants and their uses. Edna was excited to learn more about the plants and to spend more time with her husband, now that he had retired. Edna had been settling in very well to her new home and had already had made some good friends in her neighbor Mary and Tom who was the handyman who handled minor repairs.When Tom becomes sick and dies, suspicion is directed in Edna's direction because of her habit of mixing her own tea blends. Edna decides she is going to find out who else might have a reason to poison Tom with the help of Mary. A bad storm makes her snooping slightly difficult, but not impossible.This is a great story and I can't wait to read the next one in the series. I just found out today that there is a third installment due out soon! Jessica Fletcher watch out! Here comes Edna Davies."}, {"userName": "Lyn", "userReviewDate": "Mar 12, 2013", "userURL": "http://www.goodreads.com/user/show/689372-lyn", "userReview": "This was my first time reading a mystery by Suzanne Young. I'm happy to find another cozy mystery series I can cozy up to! If you enjoy heroines who have lived long enough to possess wisdom, you will like Edna Davis, the wife of a newly retired physician. The setting is Rhode Island on the Atlantic shore. Lovely quirky characters, strong emotion, and an interesting mystery. The only flaw I found was a too providential coincidence, which kept it from 5 star. HOWEVER, I will be purchasing and reading more of Suzanne Young's mysteries. Thanks for doing such a great first book in a series, Ms. Young!"}, {"userName": "Carl", "userReviewDate": "Oct 08, 2012", "userURL": "http://www.goodreads.com/user/show/6991135-carl", "userReview": "Young’s “Murder by Yew” is a well written and well edited cozy mystery, so cozy that you will be drawn right into the mystery. You may very well try to help the protagonist Edna find and sort through the clues to solve the mystery. Edna Davies is happily married to a doctor who has recently retired; they are settling into a small Rhode Island town to enjoy their \"Golden Years\" of retirement. Edna Davies, an amateur herbalist, becomes the prime suspect shortly after her handyman dies of poisoning. After she was questioned by the police, the townsfolk begin to avoid her; her art class even fails to show up at her house. Nearly certain that she hadn't concocted a poisonous tea potion, Edna struggles against mounting circumstantial evidence. Now it is a struggle to keep her sanity, find the clues, and solve the mystery with the help of few.The dialogue is lively and credible; the characters are well-developed and seem to fit the small town locale. The plot is simple, straight forward, and believable; it does not entangle the reader in complicated unbelievable twists and turns. The knowledge of gardening and the various uses of the plants is intriguing. The mystery revolving around plants and herbalists reminds me of an enjoyable mystery series from PBS: “Rosemary and Thyme.” In “Murder by Yew,” unlike the herbalists Rosemary and Thyme or Christie’s good old Miss Maple, Edna is drawn into this mystery as she becomes a suspect herself. I did not expect to like Edna based on some of the negative reviews; however, it did like her as a character. Certainly it is not the quality of some of the others I mentioned; however, I fully enjoyed Young’s story, and if you like a “light,” but delightful, “cozy” mystery, I do recommend “Murder by Yew” to “yew”!"}, {"userName": "Connie N.", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/3154417-connie-n", "userReview": "Very enjoyable first of a mild cozy mystery series. I liked Edna as the main character--very pleasant, unassuming, ordinary. Her talent for drawing and interest in gardening help with her deductive reasoning and provide some interest to the reader. There's not a whole lot of sleuthing, but the mystery did keep my interest, and I was glad that she didn't go off half-cocked like so many cozy mystery protagonists do. Secondary characters of next-door neighbor Mary and daughter Starling were good and fairly well defined. I got absolutely no sense of Edna's husband since he was gone for the entire book; I can't even remember his name.I'll definitely continue with the series when I'm looking for a quiet, easy read."}, {"userName": "Mascanlon", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/201110-mascanlon", "userReview": "Edna and her husband have retired to Rhode Island where she becomes interested in the medicinal properties of the herbal garden on their new property.Being a prime suspect in a murder investigation isn't quite the idyllic retirement anyone would envisioned but when her handyman dies of taxine poisoning, Edna Davies is placed in just such a predicament. As an amateur herbalist, she is certain she didn't concoct a poisonous potion but she is shunned by the townsfolk, questioned by the police and threatened by thieves. As she desperately tries to save herself from arrest ... or worse, she follows a trail that leads her back 40 years in the victim's history."}, {"userName": "Linda C", "userReviewDate": "Aug 16, 2013", "userURL": "http://www.goodreads.com/user/show/10638019-linda-c", "userReview": "Edna Davis and her husband, Albert, retired to a small town in Rhode Island and bought a 3 acre property with massive herb and flower gardens. Edna finds that many of the plants seem to have poisonous aspects if used in the wrong way. The former owner left lots of information about their uses and recipes as well. When the handyman, Tom Greene, dies after having tea at her home a cloud hangs over her head, threatening her acceptance in her new community, she determines to help find his killer. In the process she develops a friendship with the spinster next door. The mystery was pretty simple but the writing style was interesting and I would read more of the series."}, {"userName": "John Dowding", "userReviewDate": "Apr 11, 2013", "userURL": "http://www.goodreads.com/user/show/14261192-john-dowding", "userReview": "Mixed review on this, certainly the price was right at 99 cents for the kindle, and, as a RI native, I enjoyed the local color. Reading on the kindle obscures details like how many pages, but this was a very quick read, less than a day. For a murder mystery, this was pretty uneven. For instance, I was annoyed that several plot points depended on older crime-fighting heroine not knowing how to recharge a cell phone (her husband was out of town, ya-see, so obviously impossible to recharge the phone). Still, I'll probably read the next two in series too, the cost is low."}, {"userName": "Jeff Evans", "userReviewDate": "May 21, 2012", "userURL": "http://www.goodreads.com/user/show/9676734-jeff-evans", "userReview": "I found Murder by Yew to be a very enjoyable read. My wife is inclined to read the Hi-Tech, over complicated (at least in my mind) plots and I am usually reading scripts. I took a break to read Ms. Young's book and was delighted. Unlike Miss Marple, Edna is thrust into this mystery by virtue of being a suspect herself. Stories intertwine as does the list of \"who dun its\". I think you will enjoy it as well."}, {"userName": "Suzanne", "userReviewDate": "Dec 19, 2011", "userURL": "http://www.goodreads.com/user/show/1250107-suzanne", "userReview": "A solid 3.5 stars. I very much liked Edna Davies and all the herb lore. Edna doesn't really do much sleuthing, but does get the mystery solved. It was a nice mystery with some red herrings that led me astray more than once. I'll definitely go to the second book in this series."}, {"userName": "Timeforme", "userReviewDate": "Sep 21, 2012", "userURL": "http://www.goodreads.com/user/show/7131570-timeforme", "userReview": "Predictable mystery but still an okay read."}, {"userName": "ChrisGA", "userReviewDate": "May 09, 2012", "userURL": "http://www.goodreads.com/user/show/9280036-chrisga", "userReview": "Lots of information about herbal remedies and poisons as they form background to this cozy murder mystery. Interesting characters, good plot."}, {"userName": "Shirley", "userReviewDate": "Aug 19, 2011", "userURL": "http://www.goodreads.com/user/show/3255797-shirley", "userReview": "Such a nice # 1. More please and please continue to use Melba Sibrel as narrator."}, {"userName": "Alison", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/3006127-alison", "userReview": "Murder for the middle aged. ... A very tame tale about a middle aged woman who was far too pathetic for my liking!"}, {"userName": "Loraine", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/1922494-loraine", "userReview": "If you like Agatha Christie's Miss Marple or Jessica Fletcher in Murder She Wrote, you will definitely enjoy Edna Davies' sleuthing skills. A enjoyable, easy to read cozy mystery."}, {"userName": "Jean", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/3037264-jean", "userReview": "Well written, well edited cozy mystery. I enjoyed it and would read another by this author."}, {"userName": "Tanya", "userReviewDate": "Nov 16, 2012", "userURL": "http://www.goodreads.com/user/show/7548400-tanya", "userReview": "A very nice read! Well rounded characters, a great plot."}, {"userName": "Kay (Brigidsmomma) Compton", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/37593918-kay-brigidsmomma-compton", "userReview": "i really liked this one. Good story, with a tight plot and well thought out characters. The first in a series, I am pretty sure I will be looking for more in this series."}], "description": "When her handyman dies of taxine poisoning, Edna Davies, amateur herbalist, becomes the prime suspect. Nearly certain that she hadn't concocted a poisonous potion and desperate to save herself from arrest, Edna taps into strengths she never before realized she possessed. Shunned by the townsfolk, questioned by the police, and threatened by thieves, she follows the clues of a forty-year-old disappearance to capture a killer.", "title": "Murder by Yew\n      \n          (Edna Davies #1)", "url": "https://www.goodreads.com/book/show/7864963-murder-by-yew", "average": 3.59, "cover": "https://images.gr-assets.com/books/1327426524l/7864963.jpg", "reviews": 21, "authors": [{"url": "https://www.goodreads.com/author/show/3426012.Suzanne_Young", "name": "Suzanne   Young"}], "type": ["Mystery", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/7864963-murder-by-yew", "http://www.goodreads.com/book/show/13449165-murder-by-yew", "http://www.goodreads.com/book/show/8700839-murder-by-yew", "http://www.goodreads.com/book/show/10374348-murder-by-proxy", "http://www.goodreads.com/book/show/13636319-murder-by-mishap", "http://www.goodreads.com/book/show/18469841-murder-by-christmas", "http://www.goodreads.com/book/show/32298237-murder-by-decay", "http://www.goodreads.com/book/show/25237177-murder-by-arrangement", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}