{"ratings": 4, "userreviews": [{"userName": "Alyssa Palombo", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/49687552-alyssa-palombo", "userReview": "I absolutely adored this book! Get this one on your TBR for its release in October, for sure. This book is like Libba Bray's THE DIVINERS meets Greer Macallister's GIRL IN DISGUISE (which are two of my favorites!). My blurb for it is below:\"Murder on Millionaires' Row pulled me in right from the excellent first line and didn't let me go until I'd turned the final page - and even then I couldn't stop thinking about this marvelous cast of characters! Lindsey paints a vivid and complete picture of Gilded Age New York, from the mansions of Fifth Avenue to the immigrant world of Five Points and its environs - with a paranormal twist. This novel is perfect for readers who love historical fiction, mysteries, or TV shows like Supernatural - or all three!\""}], "description": "Erin Lindsey takes readers on a chase through Gilded Age Manhattan, filled with wonderful historical details, ghosts, romance, and Pinkerton detectives in Murder on Millionaires' Row, a delightfully charming debut mystery. Rose Gallagher might dream of bigger things, but she’s content enough with her life as a housemaid. After all, it’s not every girl from Five Points who gets to spend her days in a posh Fifth Avenue brownstone, even if only to sweep its floors. But all that changes on the day her boss, Mr. Thomas Wiltshire, disappears. Rose is certain Mr. Wiltshire is in trouble, but the police treat his disappearance as nothing more than the whims of a rich young man behaving badly. Meanwhile, the friend who reported him missing is suspiciously unhelpful. With nowhere left to turn, Rose takes it upon herself to find her handsome young employer.The investigation takes her from the marble palaces of Fifth Avenue to the sordid streets of Five Points. When a ghostly apparition accosts her on the street, Rose begins to realize that the world around her isn’t at all as it seems―and her place in it is about to change forever.", "title": "Murder on Millionaires' Row", "url": "http://www.goodreads.com/book/show/37638197-murder-on-millionaires-row", "average": 5.0, "cover": "https://images.gr-assets.com/books/1521108913l/37638197.jpg", "reviews": 1, "authors": [{"url": "https://www.goodreads.com/author/show/7915669.Erin_Lindsey", "name": "Erin Lindsey"}], "type": ["Mystery", "Historical", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/37638197-murder-on-millionaires-row", "http://www.goodreads.com/book/show/20949421-the-bloodbound", "http://www.goodreads.com/book/show/24611461-the-bloodforged", "http://www.goodreads.com/book/show/28439795-the-bloodsworn", "http://www.goodreads.com/book/show/31177603-unfettered-ii"]}