{"ratings": 12, "userreviews": [], "description": "I see dead people...and so does everyone else, because more and more teenagers who have returned from the grave are converging on the small town of Oakvale, Connecticut, inspired by the words the \"voice\" of Generation Dead, Tommy Williams, writes on his blog MySoCalledUndeath.com. Tommy's people-Mal, Karen, Sylvia, Takayuki, Tayshawn, Colette, Popeye, Melissa and the gang at the Haunted House-aren't zombies that want to eat your brains or feast on your entrails, they just want to do the same things everyone else does-create, make friends, play sports, have fun, fall in love-live. But not everyone in Oakvale-especially Reverend Mathers and his flock at One Life Ministries-is willing to stand idly by and let them do any of those things. Not when so many members of the community would approve of the undead being \"reterminated\" and sent back to the graves they worked so hard to climb out of... Generation Dead Book 4: My Best Friends Are Dead contains, for the first time in print: The collected My So-Called Undeath blog Generation Dead: Stitches Three brand new Generation Dead stories, and one new bonus story set in the world of Break My Heart 1,000 Times", "title": "My Best Friends Are Dead\n      \n          (Generation Dead #4)", "url": "https://www.goodreads.com/book/show/31851903-my-best-friends-are-dead", "average": 3.92, "cover": "https://images.gr-assets.com/books/1473691829l/31851903.jpg", "reviews": 0, "authors": [{"url": "https://www.goodreads.com/author/show/93220.Daniel_Waters", "name": "Daniel Waters"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/31851903-my-best-friends-are-dead", "http://www.goodreads.com/book/show/3157877-generation-dead", "http://www.goodreads.com/book/show/6750738-kiss-of-life", "http://www.goodreads.com/book/show/7031827-passing-strange", "http://www.goodreads.com/book/show/13455504-break-my-heart-1-000-times", "http://www.goodreads.com/book/show/13063786-generation-dead"]}