{"ratings": 728, "userreviews": [{"userName": "Laurie", "userReviewDate": "Jan 09, 2008", "userURL": "http://www.goodreads.com/user/show/386073-laurie", "userReview": "One of the best books, Christian or otherwise, that I've read in a long time. One of those stay-up-late-to-finish-it, convince-others-to-read-it kind of books. A gripping adventure, an exotic location, and a believable heroine with very relatable struggles...what are you waiting for?"}, {"userName": "Beth", "userReviewDate": "Nov 02, 2007", "userURL": "http://www.goodreads.com/user/show/279402-beth", "userReview": "What a great book! I am not one to LOVE \"Christian\" fiction, but this one was so well written, and the plot was very interesting, not one I had ever read about before. It is the story of a group of teens on a mission trip that goes horribly wrong. I thought the narration was excellent and it ended without tying up every loose string, which seems so sitcom-like. The characters each reacted a different way to tragedies, especially what they believed about God. I highly recommend this to anyone who is a believer and wants to learn a little about Indonesian culture."}, {"userName": "Kara", "userReviewDate": "Apr 10, 2012", "userURL": "http://www.goodreads.com/user/show/7102344-kara", "userReview": "Wow. That was my first thought upon finishing this story. As much as I enjoyed Ms. McKay's memoir, this book.....well. It stayed in my brain for hours afterward, even amongst the craziness of airplanes, airports, baggage, seeing my family, etc., and didn't turn off until I fell asleep that night. Even almost two weeks later, this story haunts me. I think I'm going to have a hard time putting it into words, it was that amazing! I'm really going to try to not spoil much of this story, as it truly needs to be experienced from start to finish with no idea of what will come. What these teenagers go through, what they see and experience, it changes them. In ways they would never have imagined and cannot explain to anyone else who wasn't there. Even you as the reader find it hard to to come to grips with the fact that while this is a fictional story, it is also so steeped in reality; in what human beings are experiencing and doing to each other even right now half a world away from you. Cori realized that Christians and Muslims don't get along, but she had no idea exactly how fearful these groups are of each other and what that fear will cause them to do. She's a teenager whose life has been simple and comforting and stable. When that stability is ripped away, she finds out exactly how strong or weak she really is. As do the rest of the group. Left with a 17 year old guide and his baby sister, off they go to try to get home to their families. What they see, how they react, how they survive, their story will make you laugh and make you cry. That's a credit to Ms. McKay's wonderful writing. You get sucked into this story and experience it as if you are right there part of this ragtag group of teenagers.Ms. McKay doesn't shy away from describing death and disease and pain, but it never gets too gory. She also throws in little bits of humor here and there which nicely breaks the tension, for you and for the characters. And it doesn't end with everything all fixed and everyone happy. It is a happy ending, but also a real one. You may stop reading about these characters, but you can picture them stumbling on and making messes and living life. Also while this may be a christian book, it really can be enjoyed by anyone. Because what goes on in third world countries should upset anyone, no matter what they believe."}, {"userName": "Elevetha ", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/11828657-elevetha", "userReview": "[Sure I can imagine that she left and then came back and her and Kyle became the cutest couple in town, but what did I get? Her leaving. Bah. (hide spoiler)]"}, {"userName": "Brandon", "userReviewDate": "Feb 12, 2008", "userURL": "http://www.goodreads.com/user/show/82923-brandon", "userReview": "Great fictional book on the lives of a handful of teenagers who endure a traumatic experience together. As the teenagers are on a missions trip overseas, their world becomes forever turned upside down by a quasi-civil war. I thought the author did an excellent job portraying the likely responses of any individual put in this situation. The symbolism between the psychological issues the teens in the book encounter and what any individual who has been involved in mission or foreign aid work is apparent ... whether it is feeling guilty for putting on a new sweater, feeling selfish because you went a day without thinking about what \"they\" are enduring overseas, or losing motivation to pursue life goals that all of a sudden feel insignificant. I highly recommend."}, {"userName": "Kimberly", "userReviewDate": "Jan 12, 2008", "userURL": "http://www.goodreads.com/user/show/737986-kimberly", "userReview": "What a great book! So often I will hear news stories or read about violence in other countries and, although this is horrible, not even pay attention. Sometimes those stories are coming from so far away that it is easy to gloss over the real pain and suffering that occurred. This book, although fictional, really made the violence, fear and confusion of those upheavals seem real.The characters' struggles to understand what they are seeing and experiencing was beautifully presented. Their questions about God and faith were spot on. A very impressive book."}, {"userName": "Michelle", "userReviewDate": "Nov 01, 2007", "userURL": "http://www.goodreads.com/user/show/326544-michelle", "userReview": "Wow! I finished this book at 6:15 am after staying up late reading it and then getting up at 5 am to finish. Best book I have read since A Thousand Splendid Suns. It is about a group of college-age students on a missions trip when things go horribly wrong. I laughed, I cried, and most of all, I was moved to consider how much I take my life (and my ability to worship freely) for granted. God definitely spoke to me through this book. Read it...you'll see what I mean!"}, {"userName": "Robynne", "userReviewDate": "Jan 18, 2008", "userURL": "http://www.goodreads.com/user/show/772971-robynne", "userReview": "Wow - this was a heart-wrenching book, but SO GOOD! If there were 4 1/2 stars I'd give it that. The characters are great (and so real and relatable, I felt like I was one of them!), the writing is great, the story is great (but as I said, heart-wrenching), what else can I say? I definitely recommend it!!!"}, {"userName": "Nicole", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/1944553-nicole", "userReview": "A victory for Christian fiction! A great title and a great story. Adventurous, heart-breaking, and thought-provoking. The survival part was a tad bit unrealistic but it didn’t hinder my enjoyment of the novel. Fantastic job, Lisa McKay! I will be recommending this one to fellow readers."}, {"userName": "Renee", "userReviewDate": "Apr 30, 2008", "userURL": "http://www.goodreads.com/user/show/91455-renee", "userReview": "In this fast-paced, thought-provoking debut novel, McKay, a psychologist who works with humanitarian relief, explores injustice, religious reconciliation, suffering and faith through the eyes of an 18-year-old girl whose mission trip goes tragically awry. For Cori and a team of Christian teens, building a church in Indonesia sounds like a fun project. After an overly long prologue, McKay describes how they journey to the island of Seram and bond with the Indonesian villagers. However, even as they put the finishing touches on the newly built church, Muslim and Christian tensions flare, culminating in a horrific tragedy witnessed by Cori and her friends. They flee through the mountainous jungle, hoping to escape the escalating hostilities. McKay's carefully chosen words, devoid of unnecessary sentiment, lend power to her story. The external hardships the characters face on their trek are secondary to the internal struggles they battle over how a loving God could let terrible things happen; and why their sacrificial choice to give up a summer to help others would cost them more than they ever dreamed. While written from a Christian perspective, McKay gives an evenhanded treatment to Muslims, showing that violence and hatred transcend religious boundaries. This is one of Christian fiction's best novels of the year. (Sept.) Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved."}, {"userName": "Kara", "userReviewDate": "Sep 12, 2015", "userURL": "http://www.goodreads.com/user/show/5919287-kara", "userReview": "Back in 1992 I went on a Teem Missions trip to Israel and attended the very same boot camp as the girl in this story went to. I found out about this book on a Facebook page for Former Teem Missions Members. I had always wondered if someone had written a book about their own experience or a fiction based on a Teem Missions summer. Low and behold here it is. This story is about a girl who decides to go on a mission trip to Indonesia but first has to go through a boot camp in Florida, which I as I said before attended myself. It was fun to read about it in a book to reminisce with someone else in a way of the same experience. However I did not experience what the teens went through later in the story. But I can truly identify with the relational side of it. After spending 2 months with the same people working, sleeping and eating together you bond with them and then at the end of the summer you have to separate from them. I liked how each of the team members where in different places spiritually and how their faith or lack of came out when tragedy happens because that is what happens your faith is put to the test. I don’t read much “Christian\" fiction because a lot of it is just fluffy. This one however is not. I found this to be very real and found it refreshingly different from ones I have read in the past."}, {"userName": "Jill Williamson", "userReviewDate": "Dec 26, 2008", "userURL": "http://www.goodreads.com/user/show/955038-jill-williamson", "userReview": "Review by Gigi HoffmanEighteen-year-old Cori wanted to get away after her high school graduation. Things were complicated and confusing with her boyfriend, Scott, so she signed up to go on a ten-week missions trip to build a church on a small island in Indonesia.After several weeks on the island, the church is completed, but an event leaves the group of teenagers away from their team leader and his wife for a few days. No biggie. However, during those couple days, a conflict that has been festering for years erupts between Muslim and Christian villages on a nearby island. The result? The new church gets burnt to the ground, the villagers are mercilessly slaughtered, and the teens are stranded in the forest with the pastor’s seventeen-year-old son.The group must hike through the forest, find a way off the island, and get to the airport on the same island where the political and religious violence is occurring. The team goes through many trials and difficulties, questioning all the things they thought they knew. This has to be one of the best books I’ve ever read (and I read a lot). Ms. McKay made the characters incredibly realistic. They questioned and doubted their personal beliefs; they didn’t just accept things and be happy. It was deep, thought-provoking, and beautifully written. A must, must, must read for everyone!"}, {"userName": "Spynonu", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/3566275-spynonu", "userReview": "4.5 starsBLURB: Teenagers on a mission trip find themselves in the middle of of riots and warfare with no adults to guide them to safety.SOLD!I really liked this book. It has a Christian theme but the references to God/prayer fit well with the story line. The main character, Cori, is conflicted about her belief in God- a conflict that surprisingly seems to be stronger by the end of the book than at the start. I have noticed a lot of books, supposedly written from the perspective of a teen, carry way too much adult emotional weight and thought- this book does not. I really felt as though I was reading a teenagers point of view. The story drags in a few places but there is plenty of action and angst to keep the pages turning.The book doesn't wrap up with a perfect HEA, because real life doesn't work that way, but it does end with hope and promise for a better tomorrow."}, {"userName": "Danielle", "userReviewDate": "Dec 01, 2012", "userURL": "http://www.goodreads.com/user/show/9999586-danielle", "userReview": "Mediocre writing, great plot, poor diction, average character development. If you are looking for a human rights book to bring awareness to violence in 3rd world countries, this book is for you; but if you are looking for a spiritual growth bildungsroman (coming-of-age story) about turning to God in desperate times, you will be sorely disappointed. This book is everything that's wrong with the Church. In this book, God is a background object that is used as a prop when convenient; there is no growth in the main characters--just anger, numbness, and activism. While the characters are realistic in that a vast majority of \"Christians\" do not have a personal relationship with Jesus and are more humanistic than anything else, there is no real Christianity in this book, and any opportunity for it was ignored."}, {"userName": "TheReadingKnitter/ Kasey", "userReviewDate": "Mar 26, 2009", "userURL": "http://www.goodreads.com/user/show/1070966-thereadingknitter-kasey", "userReview": "I started this book on 04/12/2009. I finished this book on 04/18/2009.WOW is the best word to describe this book. I actually gave it five stars and I'm very picky with what books get my five stars...It's that good. It's amazing and although the characters are fiction the fighting in Ambon is so real. Through the whole book I was just amazed at the choices this group of teens had to make. Although I wished Cori and Kyle had of ended up a couple it was okay in the end. This is one of the few books I was happy with the ending. I can't wait to see what Lisa McKay comes out with next."}, {"userName": "Anne", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/9381513-anne", "userReview": "This is a wonderful book. If you are a Christian teen who wants a good story without a message that sounds like it came out of Reader's Digest, then this is for you. The author could have you laughing one minute and crying the next. It is a great story. I loved the characters. Their personalities, emotions, hopes and fears, etc. came across in such a way that they were completely believable. Very well done. For those who have already read the book, my fave scenes are \" Kyle's Wild Pig\", \"Mark, Tina, and the M&Ms\", and...oh, I have so many I can't choose! Please read this book!"}, {"userName": "A.J.", "userReviewDate": "Jul 21, 2012", "userURL": "http://www.goodreads.com/user/show/11151892-a-j", "userReview": "This is my favorite book. I have easily read it 20 times and I could quote half the book. It is an amazing story. Even though it is very sad, it still made me laugh out loud in parts. I really like the characters, there are so many good ones I can not even pick a favorite. I recommend it to anyone and everyone! :)"}, {"userName": "Cousin Leah", "userReviewDate": "Nov 20, 2007", "userURL": "http://www.goodreads.com/user/show/632555-cousin-leah", "userReview": "This is an excellent book about kids on a mission trip in Indonesia when religious conflict breaks out and their adventure of trying to get home with only a seventeen year old Indonesian boy as their guide. Excellent, thought provoking."}, {"userName": "Kathy", "userReviewDate": "Oct 11, 2012", "userURL": "http://www.goodreads.com/user/show/9311418-kathy", "userReview": "Excellent! Could not put it down!"}, {"userName": "Heather", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/25183882-heather", "userReview": "this one is a little disturbing and violent. Just warning you. But suspenseful."}, {"userName": "Kent Raymond", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/69293170-kent-raymond", "userReview": "I met the author's Grandmother while on book tour in Australia, so I bought the e-version off iTunes considering the long trip and airport time on my trip to and from South America (where I am now). I give it three stars because it is about a youth group (possibly the only teenage drama I've read since middle school required reading of \"The Outsiders.\" So although I am not a fan of the teenage genre it was well-written so I did not give up early. And I am glad, because it got better as it went along.  The first third is about the teenagers and the Christian outreach bootcamp (2 stars probably because I am 57 years old). The second third is about getting caught up in political religious violence while overseas on the outreach (4 stars). The third part is about coming home and struggling to make sense of it all (6 stars). The talking and processing with a psychologist, writing her story to deal with the grief, reintegration, culture reentry process and discovering how she fundamentally changed as a person was outstanding. This last section was very insightful, very accurate (having gone through a cultural re-entry process myself and accompanying my children through it as well) and very well written.  Most of the good material on dealing with trauma and culture reentry that I am aware of are academic or journal articles. But having the narrative of the story and the vicarious experience of what the author detailed through the book really helped me identify feelings, grief and the disconnect in my personal identity that I experienced, and even still experience to a certain degree, in my own significant cultural experience and cultural reentry process.  On the very last page (about the author) I discovered she is a psychologist. So it makes sense why the last section is so accurate and well-written. Her grandmother informed me that she is Australian but grew up in many countries overseas as her father is a World Bank economist. So her multi-cultural insights and experiences referred to in the book are real."}, {"userName": "Katy", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/10711235-katy", "userReview": "Even though this was fiction, it felt so real! I could not put the book down until I finished! It's a story of a teen mission group on an island in Indonesia where their village is attacked & murdered. Thankfully, they were in the jungle at the time, but now they are left only with the island preacher's son and little sister as a guide. The book tells in detail the treacherous journey these kids had for over 3 weeks before being found. You can feel their anger towards God but their need to believe, how they had to learn to cope again once they returned home, especially without each other. I would definitely recommend this book to anyone! On a side note, I am glad I did not read this before one of my best friends went on her year long mission trip! But God is Good!!!!"}, {"userName": "Kathy", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/1630073-kathy", "userReview": "I wish Goodreads had half stars. I would probably give this a 3.5. It's a slow starter, but reels you in at about Chapter 4. Based on real events, how can one not be drawn in and feel for Indonesia and the refugees."}, {"userName": "Sarah", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/76512068-sarah", "userReview": "This book was an amazing and quick read. I recommend it to everyone."}, {"userName": "Pauline Deglint", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/43660530-pauline-deglint", "userReview": "Was an easy, interesting read, but I found it quite predictable and somewhat unrealistic."}, {"userName": "Jennifer", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/9288350-jennifer", "userReview": "This fictional story does have some basis for reality. There was fighting in Indonesia that started in 1997 and lasted roughly 10 years. In this book, a missionary team formed primarily of teenagers and young adults is caught in the middle of religious fighting and must travel to safety via the jungle. They clung to each other as they struggled to survive physically, emotionally and spiritually. I appreciated the reference to Psalm 55 and the struggle many of the missionaries felt as they wrestled with how a good God could allow godly people to die. However, the story could have done without the romance since a single person can successfully serve on the mission field and survive intense situations without dating."}, {"userName": "Olivia Noack", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/39640010-olivia-noack", "userReview": "When I picked this up, I was really confused with the way that it was being told. Basically, the prologue starts with a girl named Cori in the present day. Then the first chapter starts almost six months earlier, and Cori is telling the story of her 'real life' events. Then with less than five chapters left, the story returns to present day. I was not really expecting to like this, especially because I basically knew nothing about the plot line. In the end though, I really did like almost everything about the book. I only had two real problems with the book (which is the only reason it got four instead of five stars), the first being the ending. To me, the ending of a book is one of the most important parts of the book. Endings are usually not done well, so I really love a book that is ended well, but I just did not find this ending satisfactory. I just didn't like where the characters were sitting with each other especially the relationship between Cori and Kyle. The second problem was the romance. I would say that from the very first chapter, I could sense a strong romance on the horizon. This pressed me to read faster, in my eagerness to read some juicy romance. I saw the romance right away, but here's the thing. Imagine you are a dog. Your owner (The book) is holding a treat (romance). Your owner makes you come closer to get to the treat. You go, but the treat goes farther away. But you keep chasing it even as it moves farther away. Sometimes I felt this entertaining, but sometimes I was just really frustrated, because I really wanted the two characters to have a nice romance, but no matter how far I read, they didn't really get closer together, which was really frustrating. Near the end, the romance got significantly better, but it never got very deep which I had been waiting for, and turned out to be a huge disappointment. Other than that, the plot was a really cool thing to read, and I liked how after the story was over, you got to see the way that Cori kind of went into depression, and tried to hide from everything. I kind of wish there could be a sequel to this, just so I could read about the characters again (mostly Cori and Kyle). The bond that they formed during the story was really cool, and I really do want to read more about them."}, {"userName": "Shyla", "userReviewDate": "Apr 17, 2009", "userURL": "http://www.goodreads.com/user/show/2225350-shyla", "userReview": "Just finished this book. I would have given this book a 4 1/2 stars if I could have but since I can't I have to give it five since I think it worth more than just four. I really enjoyed this book. It is about 6 american teens going on a mission trip to Indonesia to help build a church in a small village. Once they arrive they meet Mani a local native their own age who's father is the pastor, and he helps them build the church and show them the ways of the village. The story is told from Cori's point of view, she just graduated from high school and is on this trip to help her decide her college choice and the future relationship with her boyfriend who is not a christian. Once they have just completed the church, tensions arise when a neighboring muslim village apear in Mani's christian village raising angry voices. The muslim villagers attack Mani's vilage and burn the church they just finished. The teens must escape into the jungle with only Mani and his 4 year old little sister. They must survive the jungle with little suplies and violence errupting everywhere and come to terms with what they wittenssed. This book was very realistic and I found myself forgetting it was not a true story. The characters were well developed and had realistic reactions to the the trauma they endured. This book made me think how lucky we are and how much I take for granted and how there are so many people in this world enduring horrible things just for their belief in God."}, {"userName": "Trinity Rose", "userReviewDate": "Jan 27, 2012", "userURL": "http://www.goodreads.com/user/show/3546781-trinity-rose", "userReview": "This is the first book I’ve read by Lisa McKay and I really loved it. It was just astonishing. I was completely engrossed in My Hands Came Away Red. If I didn’t know better I would have believed this to be a true story. It was so captivating.  This book was published in 2007 and the next year it was a Christy Award Finalist. Even though it is an older book it still is of great magnitude and needs to be read. It makes you think about your cozy little life and you realize so many people are fighting for their faith, for food, shelter and just life. My Hands Came Away Red is full of suspense, faith, never giving up attitude, friendship and such realism. It is an unforgettable story. I was quite moved by this wonderful novel and wish it didn’t have to end. I really became attached to the characters and they become friends. If a book does that than you know it’s super. My Hands Came Away Red is one of my favorites of 2012 and I will be looking for Lisa’s next book to read and review. I highly recommend this book and just love it. It will make a wonderful gift for yourself or someone else.Thank you to Moody Publishers for providing this book for review. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission's 16 CFR, Part 255"}, {"userName": "Jennifer", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/2459558-jennifer", "userReview": "This book is solidly written, beautiful, soulful, and palpably real - the author obviously threw everything into it. But, I was left empty-handed in the end. The reason for this being, I believe, the author's utter failure to present a realistic view of God. She portrays the human experience with great skill, but God is way off in the distance, an unknowable, mysterious being. Does God feel distant when we go through times of sorrow? - Yes. Does it have to stay that way? - No. As we throw ourselves upon Him in despair, seeking Him and His Word in faith and trust, we begin to grasp the depths of His love and the beauty of His holiness. And we are filled with hope and peace as we carry on towards His light. I believe Christian fiction is an utter failure if it does not in the end point me back to God and His beauty and does not leave me with hope. What is the point of just presenting what is in suffering without showing me what it could be?I hate preachy books; I don't want every page filled with Bible verses; I despise clunky Sunday school lessons camouflaged in a \"novel.\" But I do expect a Christian author to leave me with hope, to inspire my imagination and stir my heart. This book makes feeble attempts to do so, but failed miserably."}], "description": "Cori signs up for a mission trip to Indonesia during the summer after her senior year of high school. Inspired by happy visions of building churches and seeing beautiful beaches, she gladly escapes her complicated love life back home. Six weeks into the trip, a conflict that has been simmering for years flames to deadly life on the nearby island of Ambon. Before they can leave, Cori and her teammates find themselves caught up in the destructive wave of violence washing over the Christian and Muslim villages in the area. Within days the church they helped build is a smoldering pile of ashes, its pastor and many of the villagers are dead, and the six teenagers are forced to flee into the hazardous refuge of the jungle with only the pastor's son to guide them. Lisa McKay is a forensic psychologist who combines her world-traveling experiences with her training expertise to weave a character driven story that will become a part of you.", "title": "My Hands Came Away Red", "url": "https://www.goodreads.com/book/show/1690090.My_Hands_Came_Away_Red", "average": 4.26, "cover": "https://images.gr-assets.com/books/1328823294l/1690090.jpg", "reviews": 130, "authors": [{"url": "https://www.goodreads.com/author/show/4736758.Lisa_McKay", "name": "Lisa  McKay"}], "type": ["Christian Fiction", "Christian", "Fiction", "Young Adult", "Adventure"], "outlinks": ["http://www.goodreads.com/book/show/1690090.My_Hands_Came_Away_Red", "http://www.goodreads.com/book/show/8172929-my-hands-came-away-red", "http://www.goodreads.com/book/show/14739446-love-at-the-speed-of-email", "http://www.goodreads.com/book/show/18397596-201-great-discussion-questions-for-couples-in-long-distance-relationship", "http://www.goodreads.com/book/show/22852474-from-stranger-to-lover", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}