{"ratings": 7410, "userreviews": [{"userName": "İntellecta", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/67897611-ntellecta", "userReview": "The wise Nathan in Lessing's \"dramatic poem\" of 1779 knows how to help: He tells Sultan Saladin a story that has become known as a \"ring parable\" and as a plea for tolerance and moral action. In Lessing's classic, five-act drama, the conflicts finally break into a true embrace. After the Christian wants to marry the Jewess but can not, Lessing unravels the threads with the unveiling of an unprecedented family history: almost everyone is related to everyone. Moral action, reason, humanity and religious tolerance are the cornerstones of Lessing's Enlightenment Drama, which has been proving again and again for centuries and precisely today."}, {"userName": "Lisa", "userReviewDate": "Jun 25, 2014", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "A ring to rule them all ... in three identical versions. Tolerance taught in a story within a story containing the one and only ring, or three of them, as the case may be - \"Nathan Der Weise\" is required reading in German schools, supposedly celebrating the love and peace that can exist between Jews, Muslims and Christians, even in times of crusades! I remember writing an essay on the metaphorical story Nathan told Saladin in one scene, - to illustrate the interchangeable character of the three religions clashing over details of worship, tradition and power play. The general idea behind the play is that all three religions derive from a common root, symbolised by a mighty king in the story. He has a beautiful ring, and is expected to hand it over to his most beloved son when he dies. With the ring, the power in the palace is transferred to the next generation. The supposedly loving father however can't find any distinction between his three \"obedient\" sons, so he secretly makes two copies of the original ring, to give each of his sons a version. The copies are perfect, and even the king doesn't know how to tell the rings apart. When the king dies, conflict arises as all three sons claim their right to rule the palace. This is where I got annoyed the first time, reading this as a teenager. How incredibly stupid of the father not to foresee this outcome! He delayed conflict, and caused confusion by adding those two rings. He must have understood that. It doesn't make sense.The other thing that frustrated me when reading the story in school was the happiness with which my teacher claimed it was a symbol for the beauty of religion if it remains open-minded and tolerant towards other beliefs. Each son can be happy believing that he is in possession of the true ring. I didn't get that either. That means each son is secretly intolerant of the others, as he is convinced his ring is the right one, and the others wear fakes? Also, all rings are man-made, aren't they? And can be reproduced in as many copies as needed? And they are of course not given to any daughters of the family either, so how on earth can they be called \"tolerant\" and \"open-minded\"?All those questions arising, and only stereotyped \"study guide\" answers offered to the indignant female student of the 20th century, not feeling represented in the story at all. I think my teacher was rather helpless towards the idea of challenging the logical structure of Lessing's naively beautiful story. \"It is supposed to be a symbol of religious tolerance. Period. You are not to prove that is not possible. Full stop.\"Now I would say: Lessing involuntarily wrote a play showing how fake news spreads in the world and is used to cement patriarchal power. Those three rings are indeed identical in their claim to justify a power handover from one male tribal member to another, using religious allegiances to keep the strength within the family.The original ring symbolises the need for religion to identify community structures and scare people into bowing to random authority instead of looking for their own chosen identity, based on education and critical thinking skills. It was progressive at the time Lessing wrote it, but to me, it just shows the wrong approach of \"the ring\" in the first place. For it to work at least approximately, we would need thousands of replicas for the other religions in the world, and the right to refuse wearing a ring at all.That is my choice."}, {"userName": "Nathan \"N.R.\" Gaddis", "userReviewDate": "Jul 12, 2012", "userURL": "http://www.goodreads.com/user/show/7607437-nathan-n-r-gaddis", "userReview": "Another timely little nugget aus Deustschland. And much shorter than the Quran. ________Set in Jerusalem around those crusaderish times, Nathan der Weise is read by every little German Gymnasium student as a lesson in tolerance. Those who discover they can tolerate each other are Muslim, Jew, and Christian. Were it written today we'd have to throw in that most intolerant believer, the atheist. But I think we could do it!"}, {"userName": "Mohammad Ali", "userReviewDate": "Sep 20, 2016", "userURL": "http://www.goodreads.com/user/show/30094118-mohammad-ali", "userReview": "نمره ی وافعی: دو و نیمنمایشنامه ای است پیرامون تساهل مذهبی - مشوق دوستی سه آیین ابراهیمی و دست برداشتن از تعصبات. داستان در اورشلیم و در آستان صلاح الدین ایوبی می گذرد، او نماینده ی اسلام داستان است، یک جنگجوی صلیبی نماینده ی مسیحیت و یک تاجر یهودی نماینده ی یهودیت. در پایان داستان آشکار می شود که این سه نفر، سببی یا نسبی، با هم خویشاوندند. اوج داستان را باید در تمثیل انگشتر جادویی و سه پسر جست که گویا اصلش از دکامرون بوکاچو استبرای من آغاز نمایشنامه جذاب نبود اما از اواسط کتاب به بعد، خصوصا بعد از بیان تمثیل انگشتر، داستان جذاب تر شد - در واقع تعلیقش کِشنده بود. اما پایان داستان و فامیل درآمدن همه با هم نه جذاب بود و نه با روحیات زمانه ی ما در مورد عشق و ... سازگارمن چهار صفحه از کتاب را هم با اصل آلمانی اش مقابله کردم و دو نکته را دریافتم؛ یکی اینکه اصل آلمانی جدا فراتر از سطح درک متوسط من است و دوم اینکه در همان سطح فهم من مترجم اشتباهی نداشت. باید منتظر بود کسی که دانشش به زبان آلمانی خوب، بلکه در حد آثار ادبی است، نظرش را در مورد این ترجمه بگوید. اما سوای مطابقت، زبان ترجمه برایم جذاب نبود"}, {"userName": "Khan", "userReviewDate": "Aug 24, 2010", "userURL": "http://www.goodreads.com/user/show/3963550-khan", "userReview": "Ah ja, Nathan der Weise einer der besten Stücke, die ich je gelesen habe. Was mich zu erst verwundert hat, war der Titel \"Ein dramatisches Gedicht...\". Wenn man sich allerdings die Formatierung anschaut, dann ist einem sofort klar, dass die Strukturierung einen dichterischen Aspekt hat und zwar das Metrum.Nathan der Weise besteht aus Blankversen. Eine besondere Form, die ursprünglich aus England stammt. Normalerweise fällt niemanden außer der hartgesottenen Germanisten Dinge wie ein Metrum auf, aber bei Blankversen weiß jeder sofort bescheid, dass man mit einem Jambus konfrontiert wird. Ein anderweitig interessantes Mittel ist der Gebrauch von Enjambements, denn mir persönlich viel es schwer Nathan zu lesen bis mir klar war, dass ich nicht einfach am Zeilenende aufhören konnte. Es hat auch dafür gesorgt, dass ich schneller gelesen habe, um immer bei einem neuen Auftritt oder Akt wieder vom Neuen zu lesen. :) Ob das positiv oder negativ ist, sei jedem selber überlassen.Aber genug über die äußere Form! Wichtig ist die Bedeutung, die das Stück für den Leser hat oder haben sollte. Die Ringparabel ist das Zentrum und der Angelpunkt der Geschichte. Eine logische und friedfertige Lösung, die allen drei monotheistischen Religionen zufriedenstellen sollte.Ich werde nicht die Handlung verraten, da die Handlung selber sehr kurz ist und jeder das Stück selber lesen sollte, um geistig zu wachsen.Nathan der Weise ist auf jeden Fall etwas, was jeder Mensch ein Mal gelesen haben muss. Wunderschön geschrieben mit einer bedeutenden Botschaft: \"Die Wahrheit ist verlorengegangen. Lebt in Frieden miteinander, statt euch um etwas zu streiten worauf es keine logische Antwort gibt.\"Ich bin mir sicher, dass Nathan der Weise ein zufriedenstellendes letztes Stück Lessings ist. Er ist in der Tat mit einem gewaltigen Knall untergegangen."}, {"userName": "Vittorio Ducoli", "userReviewDate": "Feb 14, 2013", "userURL": "http://www.goodreads.com/user/show/4640212-vittorio-ducoli", "userReview": "L'illuminismo applicato al rapporto tra le religioni: una proposta sconfitta dalla storia ma di grande attualitàGotthold Ephraim Lessing è il più noto rappresentante dell'illuminismo tedesco, e Nathan il saggio è la sua opera più famosa, quella che riassume, sotto forma di una commedia teatrale, il pensiero di questo importante letterato della seconda metà del XVIII secolo.La vita e le opere di Lessing sono bene illustrate nel bel saggio di Emilio Bonfatti che fa da introduzione a questa classica edizione Garzanti, dotata di testo originale a fronte, e ad essa rimando chi volesse approfondire la conoscenza dell'autore e del contesto culturale in cui ha operato.Basti qui ricordare che Lessing anche in vita fu una sorta di irregolare rispetto ad una cultura dominante, quella tedesca dell'epoca, che – anche a causa della frammentazione politica da un lato e dell'incipiente ruolo egemonico della Prussia dall'altro – diffidava delle idee e delle elaborazioni provenienti da oltre il Reno, considerandole il prodotto di una società profondamente diversa. Di lì a poco lo Sturm und Drang e il Romanticismo avrebbero fatto virare il pensiero tedesco verso lidi affatto diversi, e quindi possiamo dire che l'illuminismo in Germania fu una corrente di pensiero che si affaccia sulla scena culturale per un breve periodo, incarnato da poche figure e che mantiene un ruolo del tutto minoritario (come anche la storia tedesca del XIX e XX secolo si incaricheranno di dimostrare).Ciò non impedisce, tuttavia, che le opere di Lessing fossero ammirate dai primi romantici, e che buona parte della fortuna dei suoi testi teatrali tra '700 ed '800 sia dovuta all'attenzione che ad essi ha riservato Goethe.Nathan il saggio viene scritto da Lessing tra il 1778 e il 1779, e sarà l'ultima opera teatrale di un autore che, a dimostrazione della sua irregolarità, ha speso gran parte della vita a polemizzare con i rappresentanti della cultura ufficiale ed accademica, soprattutto rispetto al ruolo che il teatro deve svolgere come strumento di cultura e quindi rispetto a cosa deve trattare e a come deve trattarlo. Anche per questi aspetti, dalla contrapposizione tra teatro francese e inglese al tentativo di Lessing di fondare un teatro tedesco, rimando al saggio di Bonfatti che approfondisce queste tematiche con ben altro spessore di quanto potrei fare io.Il Nathan, infine, viene scritto da Lessing contemporaneamente alla censura che alcuni suoi saggi di riflessione sulla religione subiscono da parte dell'autorità politica dietro intervento della chiesa luterana, e questo episodio è sicuramente una delle molle che spingono Lessing alla scrittura dell'opera.Nathan il saggio è infatti definito ufficialmente innanzitutto un inno alla tolleranza religiosa, alla rinuncia alla pretesa, da parte di una fede, ad agire contro le altre in virtù di una convinzione di verità. Secondo me il concetto di tolleranza non sintetizza bene il pensiero di Lessing rispetto alla religione: infatti si tollera qualcosa quando con spirito di condiscendenza si accetta che qualcuno pensi o agisca in modo diverso dal nostro, convinti tuttavia della giustezza e della superiorità dele nostre convinzioni o azioni. In Lessing non c'è tolleranza, ma la proposta di un mutuo riconoscimento tra le religioni, il riconoscimento della reciproca legittimità dovuto al fatto che esse hanno un fondamento comune, tendono ad un fine comune e che le differenze sono dovute ai diversi contesti culturali in cui si sono materialmente sviluppate. A differenza di molti degli illuministi francesi, Lessing non è ateo, non contrappone ragione e religione. Egli, figlio di un pastore luterano e immerso nella cultura della Germania della riforma, attribuisce alla religione un ruolo fondamentale nella formazione dell'etica, ma contesta che questo ruolo debba essere attribuito ad una sola religione, in quanto tutte, o perlomeno le grandi religioni monoteistiche, hanno come detto lo stesso fondamento teorico e tendono allo stesso fine, distinguendosi solo formalmente.Il Nathan, infatti, è la storia dell'incontro fra il protagonista, un saggio ebreo, il Saladino e un templare, che attraverso complicate vicende giungeranno a riconoscere di essere parte di un unico progetto di vita in cui ciascuno, mantenendo la propria identità culturale e religiosa, contribuisce alla felicità individuale e collettiva.Fulcro del messaggio di Lessing sulla legittimità delle diverse religioni è la famosa parabola dei tre anelli, che Nathan racconta al Saladino nel terzo atto, e che l'autore ha mutuato da Boccaccio. Non è un caso, a mio avviso, che lo strenuo propugnatore tedesco dei valori borghesi ricorra ad una novella di quello che può essere considerato il primo intellettuale borghese della storia.A fare da contraltare a Nathan e al Saladino, alla loro tolleranza, vi è nella commedia la figura del Patriarca, dogmatico ed intollerante, che pretende di applicare alla lettera la legge della sua religione anche quando questa genera male e sofferenza. E' sintomatico, a mio avviso, che l'unica figura negativa della commedia sia rappresentata da un alto gerarca della cristianità, a riprova del fatto che la critica lessinghiana era rivolta in primis all'apparato religioso che egli conosceva meglio.Troviamo poi nella commedia una esemplificazione dei tratti essenziali dell'elaborazione teorica dell'autore sul teatro, sulle modalità della rappresentazione e sui caratteri dei personaggi. Lessing propugnava – in piena coerenza con i principi illuministici, che il teatro dovesse rappresentare la complessità e anche la contraddittorietà dell'agire umano, che i personaggi dovessero quindi non essere nettamente connotati come solo buoni o solo cattivi, ma dovessero avere comportamenti mediani, come è nella realtà. Per questo preferiva la commedia, in grado di far ridere e piangere alternativamente lo spettatore a seconda delle situazioni, alla tragedia classicistica in cui i ruoli sono nettamente caratterizzati. Nel Nathan, a parte le figure del saggio protagonista e del patriarca, funzionali alla caratterizzazione di due estremi comportamentali e filosofici, tutti gli altri personaggi, compreso il tollerante Saladino, presentano tratti contraddittori, nei quali a volte prevale una visione dei fatti distorta da angolazioni personali e condizionata da pregiudizi.E' questo un aspetto di grande modernità del testo, ed a mio avviso questa concezione non manichea dei comportamenti umani rappresenta uno dei lasciti culturali più importanti di Lessing.Lessing, infine, in quanto illuminista è portatore di valori borghesi, ed a fondamento di tali valori, non va dimenticato, c'è la necessità di una società che favorisca gli scambi commerciali, l'accumulazione, la produzione. Questi aspetti emergono, sia pure in maniera apparentemente sotterranea, da una lettura attenta del testo: Nathan, il saggio, è un ricco commerciante, e trae la sua saggezza proprio dalla sua ricchezza. Più volte nel testo il rapporto tra saggezza e ricchezza è messo in evidenza in maniera esplicita. E' proprio grazie a questa ricchezza che viene chiamato a colloquio dal Saladino, che si trova in difficoltà perché sperpera abitualmente il suo denaro ed ha bisogno di un prestito. Oltre che alla tolleranza religiosa, la commedia può quindi essere considerata un inno alla saggia amministrazione dei beni materiali, alla capacità di accumulare ricchezze che inevitabilmente genera saggezza. Nathan è il borghese che, non importando se sia ebreo, cristiano o musulmano, è saggio perché in grado di fare affari, in questo quasi contrapposto al Saladino, aristocratico animato da uno agire che sia pur altamente filantropico – dona il suo denaro ai mendicanti – lo mette in difficoltà nell'amministrazione dello Stato. Come mette in evidenza ancora Bonfatti nella sua introduzione, il rapporto con il denaro è un tratto che distingue nettamente Nathan dal Saladino: io aggiungerei che Lessing, coerentemente con il suo pensiero complessivo, con il suo illuminismo protestante, esalta nella figura di Nathan colui che è in grado di generare valore, anche morale, tramite l'accumulazione di denaro.Nathan il saggio è ancora oggi un testo teatrale da gustare ma anche su cui riflettere, perché ci fa entrare in un filone della cultura tedesca che si può oggi dire fu indubbiamente sconfitto dalla storia (come del resto furono sconfitti i principi più egalitaristi dell'illuminismo rispetto all'evoluzione concreta del pensiero e della società borghese), e che se avesse avuto modo di contare di più sul palcoscenico del pensiero germanico avrebbe sicuramente potuto contribuire ad una evoluzione storica diversa rispetto ai grandi drammi che attendevano la Germania in particolare nel XX secolo. Ovviamente ci fa anche riflettere sul rapporto che oggi esiste tra mondo occidentale e mondo islamico, rapporto che appare molto più rozzo e manicheo di quanto Lessing ci proponesse oltre ducentocinquanta anni fa: ma questo è abbastanza scontato, visto il regresso culturale che caratterizza a tutti i livelli la nostra epoca."}, {"userName": "David Alexander", "userReviewDate": "Sep 22, 2012", "userURL": "http://www.goodreads.com/user/show/9618315-david-alexander", "userReview": "In some ways you could not ask for a better and nobler representative of the Enlightenment than Gotthold Ephraim Lessing in his \"Nathan, the Wise\" (1779). That is at least my initial, current impression of Lessing. In the face of the atrocious anti-Semitic caricatures and treatment of Jews by professing Christians that would eventually fester into Nazi Germany and the Holocaust, Lessing portrays a Jewish character who is humane and generous. In a way similar to Shakespeare, Lessing gives a more human face to his Jewish character. Unlike Shakespeare's The Merchant of Venice, Lessing goes further in a way and explodes stereotypes of Jews as usurious, greedy money-lenders. However, Lessing is more preachy and didactic than Shakespeare in my opinion and Shakespeare's Jewish villain is portrayed with human motivations which I think goes a long way to undermining prejudice, and perhaps further than Lessing in that the characters are more real. A human villain is better than a didactic good guy for exploding anti-Semitic myths of unearthly cabals, I suspect. Not to stress this point unduly- everyone looks bad in comparison to Shakespeare. I also acknowledge that I am have read Lessing in translation and that may be a factor. In any case, Lessing's characters are not so wooden as to be un-moving. However, how much is Lessing really embracing the Jews? Does he not want to convert them to an Enlightenment view of religion just as much as the true believing Christian wants to convert the Jew to Christianity? Nathan is wise in an Enlightenment-style wisdom, and is that really wise? He is deemed wise because he is not truly a Jew, or a believing Jew anyway. He is culturally a Jew. The good guys, the wise in this story, end up trivializing their professed faiths in words and deeds. For instance, the the Templar, ostensibly a Christian, ends up often repudiating his faith in words, even calling it superstition, and he says in one place that he would become a Muslim to please Saladin. So much for Christ. I think of Lessing in conjunction with the German Jewish poet Heinrich Heine who converted to Christianity but had an ambiguous relationship to Christianity and Judaism. Whatever the case for him personally, he made some startlingly prescient predictions of Nazi Germany one hundred years before it occurred. In his day he said, \"Now they burn books; then they'll burn bodies.\" But the most interesting of all is a passage which concludes his book Religion and Philosophy in Germany [1832] and which is \"one of the most remarkable prophesies in all literature.\" In it in vivid terms he predicts a play will be played out in Germany and abroad which makes the French Revolution look like child's play and he attributes this to the break up of the staying power of \"that talisman, the cross\" by the influence of Kantians and Fichteans and philosophers of nature. (See here: http://www.cyberussr.com/hcunn/quo-he... ).That is, he indicts Immanuel Kant, the prince of the Enlightenment. One might even surmise he lays the coming \"German thunder\" at the feet of Lessing as well. Lessing brings into relief the vicious and murderous cruelty of Christian fanatics in the Crusades in his play as part of his argument for an Enlightenment view. (Even if we are in postmodern, or post-postmodern times, much of this Enlightenment view of religions remains intact and is perhaps becoming more virulent). At the same time Lessing observes contradictions between the Christians and their Scriptures, which naturally raises the unintended question whether their belief is the really the point of error or their believing in such a way as not to obey. Heinrich Heine, on the otherhand, sees the void opened up by the Enlightenment neutralization of the Cross in the hearts of the Germans, a void later to be most fully elaborated and hailed by Friedrich Nietzsche. Heine sees that the void will be filled by the unbaptized, unconverted \"Beserker rage\" of the Germans, as he calls it. Perhaps some of this Teutonic volatileness he refers to is reflected in the Templar's character in the play. The anti-Christs, the little Übermensches, are an ugly host, the prophecy seems to have implied in retrospect, that were summoned by the Enlightenment, or at least made possible by it, though one might add the Holocaust was first made possible by Christian anti-Semitism before the Enlightenment solution to Christian historic sins concatenated the sins into something far more virulent.Lessing in some ways provides just one of the more eloquent iterations of a doctrine whose most religious version is that many roads lead to salvation and God is like an elephant which blind men grab different parts of and think the whole. This view is held by those who think they see the whole more comprehensively. There is still great contemporaneity to this idea. The condescending doctrine is the wraith's embrace of religion, the deadly kiss which drains the life and meaning from a religion while claiming to defend the religions.Recha's epithet toward Daja in the play one could say is Lessing's judgment and epithet and is, more broadly, representative of the Enlightenment epithet in general toward religious belief: \"She's one of those fanatics who imagine they know the universal and only true path to God!\" Implied in Recha's statement of course is a belief in a universal negative of the possibility of there being such a way and it's being known. There is the supreme condescension toward religions which poses itself as an embrace of the religions but finally trivializes all that it embraces. The Enlightenment seems to me a reincarnation of Greek universalism. All there is is thought to be universal principles and temporal, mundane processes. Belief in a unfolding particularity in history, or an advent in history, is derided as foolishness. The cross of Christ is \"foolishness to the Greeks.\""}, {"userName": "Lotte", "userReviewDate": "Nov 27, 2010", "userURL": "http://www.goodreads.com/user/show/3541516-lotte", "userReview": "Nathan der Weise\" ist der Titel eines fünfaktigen Dramas in klassischem Aufbau. Es wurde 1783 in Berlin uraufgeführt und beschäftigt sich mit den Themen Humanismus und Deismus.Die Idee des Deismus ist, dass Gott das Universum geschaffen hat, er im Folgenden aber keinerlei Einfluss mehr auf die Geschehnisse nimmt.Die Handlung spielt zur Zeit des Dritten Kreuzzugs. Die Frage nach der \"wahren\" Religion steht im Mittelpunkt. Das Ende zeigt schließlich die enge Verwandtschaft der drei monotheistischen Religionen.Wegen der Form des Blankverses lässt sich \"Nathan der Weise\" leicht und flüssig lesen. Man hat sich schnell in Lessings Sprache reingelesen und kann sich voll und ganz auf die Handlung konzentrieren. Wegen der äußeren Form hatte ich automatisch etwas mehr Dramatik erwartet. Es gibt ein paar spannungsaufbauende Elemente, aber richtig spannend wird es dann doch nicht. Die Verwandtschaftsverhältnisse sind sehr interessant dargestellt. Es macht Spass sie zu entwirren und dabei festzustellen, dass alle Charaktere im Nachhinein, trotz unterschiedlicher Religionen, auf irgendeine Art und Weise miteinander verwandt sind.\"Nathan der Weise\" ist ein bedeutendes Werk, das zu seiner Zeit wohl Provokation ausgelöst hat und heute immer noch ein wichtiges Plädoyer für mehr Toleranz darstellt."}, {"userName": "Maggi", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/16969868-maggi", "userReview": "So today I finally had my German exam, that means that I'll (hopefully) never ever have to read this again."}, {"userName": "Miss Bookiverse", "userReviewDate": "Jun 20, 2008", "userURL": "http://www.goodreads.com/user/show/1250419-miss-bookiverse", "userReview": "Had to read it for school in 8th grade AND in 12th grade. In 8th grade I hated it. When I reread (actually I didn't read the whole book in 8th grade) some years later I thought it was okay. It has some unexpected twists at the end and a nice philosophy about tolerance and religion.(oh and I remember calling him \"Satan der Heiße\" instead :P)"}, {"userName": "Justine", "userReviewDate": "Aug 09, 2015", "userURL": "http://www.goodreads.com/user/show/32176744-justine", "userReview": "Probably the worst book I ever had to read in school."}, {"userName": "Stephanie ", "userReviewDate": "Jul 22, 2016", "userURL": "http://www.goodreads.com/user/show/56731669-stephanie", "userReview": "I liked the story and what the author Lessing wanted to tell but the language was difficult to understand."}, {"userName": "Sarah", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/51254693-sarah", "userReview": "Ohne die Diskussionen im Deutsch-LK nur halb so schön :'("}, {"userName": "Elliott Bignell", "userReviewDate": "May 30, 2016", "userURL": "http://www.goodreads.com/user/show/32553593-elliott-bignell", "userReview": "Reviewing in English for consistency with my stream. (Wiedersehen auf englisch zur Förderung der Dickflüssigkeit mit meiner Strömung.)This short piece of work is a keystone of the Enlightenment, and is also the most accessible of the German classics that I have read to date. The German level is fairly advanced and at the same time slightly archaic, but readable at an undergraduate or experienced second-language level. The metre, in particular, is entirely consistent and tends to draw one along comfortably.The entire work is basically a call for religious tolerance issued at a time when sectarianism in Europe was still rife and critics of the Church were not quite out of danger of death at the stake. The centrepiece is the Jewish Nathan's presentation to the sympathetically-portrayed Saladin of a parable of the ring. Ring symbolism was already old by this time, and in this case its wearing was said to make the bearer beloved of God. A father, unable to settle on one of the three sons who deserves it, has two counterfeits made and distributes the three rings. The sons, unable to tolerate the ambiguity, seek to have the True Ring identified, but are told that the counterfeit is too perfect. Instead, they should live as if their own ring were real and thus become beloved of God by the fact of wearing it. By this token, in fact, even the original ring may have been a counterfeit, and its master lost.As a metaphor for the three \"great\" faiths, this is powerful, as Nathan explains that there may be no \"true\" faith, as God may have become tired of the very question. Instead, he may have vouchsafed us the three rings of Judaism, Christianity and Islam and left it to each of us to live up to his own True Ring according to his nature and perception of God. The whole plays out against the backdrop of the Third Crusade, during which Richard was hacking up entire civilian populations of cities and an Emperor died trying to cross Asia Minor. A Templar has saved a Jewish woman, the adopted daughter of Nathan, and at first repudiates his own deed in scorn of the Jews. Soon, however, he falls in love with the woman and becomes friends with Nathan. When the daughter turns out to be an adopted Christian, he inadvertently betrays Nathan to the Christian Patriarch, who being Christian wants to have the Jew Nathan burned alive for bringing her up a Jew. In a Shakespearian twist, the Templar turns out to have returned to his own bloodline in Nathan's family. In the end, the different religious identities turn out to be little deeper than a ring worn on the hand.A pivotal work at the hinge of the history of the Western mind, and well worth the couple of lunchtimes needed to get through it."}, {"userName": "Samuele", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/12010306-samuele", "userReview": "Questo libro l'ho letto per il corso di letteratura all'università e devo ammettere che sono veramente contento di averlo preso in mano.Lessing ha avuto un'ottima idea per la trama di questa opera mescolando il dibattito sulle varie religioni, l'amore e i vari misteri che si nascondono dietro i protagonisti delle vicende.La scena finale mi ha lasciato a bocca aperta per tutto il tempo grazie ai colpi di scena che sono stati ben piazzati e di impatto (grazie anche al lavoro di Schiller che ha rinfrescato l'opera con diversi tagli).Che dire, 5 stelle più che meritate e lo ammetto: i tedeschi sono sempre un passo avanti nelle opere teatrali!"}, {"userName": "Maura", "userReviewDate": "Sep 21, 2013", "userURL": "http://www.goodreads.com/user/show/10608891-maura", "userReview": "INHALT:Nathan kehrt von einer Reise zurück. Während seiner Abwesenheit wäre sein Haus beinahe abgebrannt und mit ihm seine einzige Tochter Recha. Sie wurde jedoch von einem unbekannten Tempelherren gerettet, für den sie auch prompt Gefühle entwickelt, die der Tempelherr jedoch nicht erwidert, ja zeigt er sich sogar besonders abweisend.AUFBAU UND SCHREIBSTIL:Das Buch ist in 5 Aufzüge gegliedert, die dann wiederum in verschiedene Auftritte unterteilt sind.„Nathan der Weise“ ist ein dramatisches Gedicht aus dem 18. Jahrhundert. Folglich ist die Sprache etwas „veraltet“ und, dass es in Reimform geschrieben ist, erschwert das Lesen zusätzlich.MEINE MEINUNG:Ich habe „Nathan der Weise“ als Schullektüre gelesen und ich kann zweifelsohne sagen, dass es die bisher „schwierigste“ Schullektüre war (zum Vergleich: bisher bin ich mit „Der Besuch der alten Dame“ und „Die schwarze Spinne“ sehr gut weggekommen bzw. habe richtig gute Bücher kennengelernt).An die Sprache gewöhnt man sich zwar relativ schnell, jedoch gibt es immer mal wieder etwas Verwirrung, was bei so einem Buch jedoch normal ist.Die Handlung gefällt mir ehrlich gesagt rückblickend überhaupt nicht. Zunächst hat sie es mir sehr angetan, doch die Entwicklung der Handlung fand ich dann eher abstoßen. Ich kann jetzt leider nicht genau sagen, was mich gestört hat, ohne die ganze Handlung zu verraten, aber so viel sei gesagt: für mich sind es definitiv zu viel Familientragödie und zu viele verworrene und unrealistische Handlungsstränge.Was mir jedoch sehr gut gefällt, ist das aufklärerische Gedankengut. Ich finde es immer wieder sehr faszinierend, wie fortschrittlich die Menschen damals teilweise schon gedacht haben.„Sind Christ und Jude eher Christ und Jude, als Mensch?“ - S.55MEIN FAZIT:Auch wenn ich „Nathan der Weise“ jetzt nicht direkt weiterempfehlen würde, so ist es doch eine gute Schullektüre, die das aufklärerische Gedankengut der damaligen Zeit gut zum Ausdruck bringt. Und wenn man vielleicht nicht so viel liest wie ich, ist man durch den Handlungsverlauf auch nicht ganz so genervt."}, {"userName": "Benjamin", "userReviewDate": "Aug 11, 2010", "userURL": "http://www.goodreads.com/user/show/4105102-benjamin", "userReview": "Nathan the Wise (OT: Nathan der Weise)of G.E. Lessing is maybe the most important drama of the epoch of the Enlightment. Despite its age of 230 years the message of the book, the religious tolerance between the 3 big religions, is in consideration of the problems in the Middle East and terror still actual. I point out the line-up, which perfectly symbolizes the connection between the 3 religions and the famous Ring Parable. The spelling style is a little exhausting, for which reason I remove one star."}, {"userName": "Oceana2602", "userReviewDate": "Jun 28, 2009", "userURL": "http://www.goodreads.com/user/show/177596-oceana2602", "userReview": "More school reading! I remember being really into this book when we read it in school. I just loved everything we studied while we read it, all that what we call \"meta\" these days. And there's so much meta surrounding Nathan the Wise.Without doubt one of the most important books of German literature, and due to its main subject, religion, one that I feel very close to. It's certainly not one of the books that you read purely for the reading pleasure. It's all about the context, historical and philosophical."}, {"userName": "Freya", "userReviewDate": "Oct 29, 2013", "userURL": "http://www.goodreads.com/user/show/24309724-freya", "userReview": "Sagen wir es so: man merk am Schriftbild, dass es ein altes Buch ist. Und dshalb hab ich es nicht gern gelesen aber gehört nunmal zum vorgeschriebenen Lesestoff der Schule dazu.Aber im Nachinein kann ich nur sagen, dass mir die Grund-Story sehr gefallen hat. Und am Meisten die Ringparabel. Viel kann ich nicht zu dem Buch sagen.Aber wenn ihr gern so etwas lest und euch vorher erstmal grob informiert, ob es etwas für euch ist, dann lest es einfach! :)"}, {"userName": "Tim Nowotny", "userReviewDate": "Feb 07, 2016", "userURL": "http://www.goodreads.com/user/show/687796-tim-nowotny", "userReview": "Huh, not the wisest strategy to name your son after a novel before reading it.Fortunately for me the book is good. A nice allegory about religion that still holds up today. Sometimes it felt very strange to speak about it in public since a lot of the vocabulary would be considered incorrect nowadays.The ending especially is a nice conclusion that fitted the content of the book well."}, {"userName": "Niki", "userReviewDate": "Oct 13, 2015", "userURL": "http://www.goodreads.com/user/show/41916454-niki", "userReview": "Ich hab es nicht komplett gelesen. Dafür manche Stellen fünfmal, wenn es das vielleicht relativiert. Ich weiß nicht, wie meine Klausur darüber gelaufen ist, aber ich fand es sooo unfassbar langweilig, eine schlimmere Schullektüre habe ich tatsächlich noch nicht gehabt. (Wilhelm Tell in der achten Klasse hab ich durch Krankheit zum Glück komplett verpasst)"}, {"userName": "Molly", "userReviewDate": "Jun 29, 2012", "userURL": "http://www.goodreads.com/user/show/4135485-molly", "userReview": "This story of cross-cultural (and more importantly cross-religion) communication was written by an extremely progressive thinker, and did not fall prey to the many anti-Semitic cliches that one so often finds in similar literature. This is a very illuminating play, and has a great deal of bearing on the tribulations of today's world as well."}, {"userName": "Hannah", "userReviewDate": "Aug 08, 2012", "userURL": "http://www.goodreads.com/user/show/11539259-hannah", "userReview": "Ich lese Dramen nicht so gerne, da ich aus dem Lesefluss gerate, wenn ich immer den Namen einer Person lesen muss, bevor es im Text weitergeht. Allein deshalb schon hat mir \"Nathan der Weise\" nicht allzu sehr gefallen.Allerdings mochte ich die Thematik von Toleranz gegenüber anderen Religionen. Das, finde ich, ist ein wichtiger Grund, der für das Buch spricht."}, {"userName": "Anni", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/18000138-anni", "userReview": "Ich weiss nicht wie ich das bewerten soll. Im Endeffekt mag ich die Geschichte, auch wenn sie seltsam ist und die Ringparabel ist in dem Zusammenhang auch gut, nur mag ich sie nicht analysieren nach den Ferien."}, {"userName": "Jessica", "userReviewDate": "Jan 27, 2009", "userURL": "http://www.goodreads.com/user/show/1238708-jessica", "userReview": "Endlich weiß ich über die Ringparabel Bescheid! Fühle mich schlau (-:"}, {"userName": "Fatma", "userReviewDate": "Jul 27, 2015", "userURL": "http://www.goodreads.com/user/show/40932929-fatma", "userReview": "Keine Frage die Ringparabel muss man gelesen aber noch verstanden haben"}, {"userName": "✿ Eva ✿", "userReviewDate": "Nov 15, 2014", "userURL": "http://www.goodreads.com/user/show/15812965-eva", "userReview": "OH plot twist in the end but i like the actual important meaning so"}, {"userName": "Joerg", "userReviewDate": "Aug 01, 2010", "userURL": "http://www.goodreads.com/user/show/2586414-joerg", "userReview": "the most important work about tolerance"}, {"userName": "daniela", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/67741210-daniela", "userReview": "It actually wasn't as bad as I thought it would be when I started it, the language is a bit hard even for germans, but the storyline wasn't bad. Had some really smart sayings in it. The ending was trash tho so three stars"}, {"userName": "Ira Therebel", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/5902527-ira-therebel", "userReview": "Wasn't really expecting to like the book. The classic literature is sometimes too hard to go through which takes away some of the pleasure. Ended up seeing why it is such a respected work. I am glad though I didn't get it in school. Would most likely have ruined the book for me.It is very easy to read. Considering that it was written in the 16th century I expected that I will have to look up a lot of explanations for what I am reading, but I managed to go through the book without it. It is pretty clear what they talk about and what the message is supposed to be. The main idea is that people are people and regardless of their religion they can still get along. It was written during the Enlightenment period and talks about how these three religions are related. It seems pretty astounding that such a book was written back then. Besides the religious tolerance it talks about how God is not responsible for human actions, like for example people shouldn't praise angels but the actual humans who did the good work. Just like it is up to the humans to get over their differences and live together. It is also interesting how it goes into how true family is not just about being blood related. Again, was exciting to read this in such an old book.It is interesting how we still have similar issues almost 250 years later. It can feel a bit depressing at first, but then if we look more into it the humanity definitely has progressed in this."}], "description": "Gotthold Ephraim Lessings Nathan der Weise (1779 erschienen und 1783 uraufgeführt) ist eines der zentralen Werke der deutschen Aufklärung. Der Text, der sich mit seiner Bezeichnung als \"dramatisches Gedicht\" der Festlegung auf eine der dramatischen Gattungen entzieht, trug wesentlich dazu bei, den Blankvers als den klassischen deutschen Dramenvers zu etablieren. Mit seinem Nathan reagierte Lessing auf die religiöse Orthodoxie und Intoleranz seiner Zeit. Ort der Handlung ist Jerusalem während der Kreuzzüge – eine Stadt, in der Christentum, Islam und Judentum direkt aufeinandertreffen. Höhepunkt des Stücks, in dem es um eine moral- und geschichtsphilosophische Botschaft, um die Aufforderung zu Toleranz und Humanität geht, ist die berühmte Ringparabel, die der reiche jüdische Kaufmann Nathan erzählt: Sie soll die hintergründige Frage des Sultans Saladin beantworten, welche der drei Religionen die wahre sei. Nathans Antwort ist die Forderung nach einem gleichberechtigten Nebeneinander aller Religionen.", "title": "Nathan der Weise", "url": "http://www.goodreads.com/book/show/1097229.Nathan_der_Weise", "average": 3.52, "cover": "https://images.gr-assets.com/books/1180953820l/1097229.jpg", "reviews": 131, "authors": [{"url": "https://www.goodreads.com/author/show/7723.Gotthold_Ephraim_Lessing", "name": "Gotthold Ephraim Lessing"}, {"url": "https://www.goodreads.com/author/show/542130.Peter_von_D_ffel", "name": "Peter von Düffel"}], "type": ["Classics", "European Literature", "Plays", "Academic", "Drama"], "outlinks": ["http://www.goodreads.com/book/show/1097229.Nathan_der_Weise", "http://www.goodreads.com/book/show/32078676", "http://www.goodreads.com/book/show/17374461-nathan-il-saggio", "http://www.goodreads.com/book/show/12992720-nathan-the-wise", "http://www.goodreads.com/book/show/15766054-nathan-il-saggio", "http://www.goodreads.com/book/show/891899.Nathan_the_Wise", "http://www.goodreads.com/book/show/2999783-nathan-der-weise", "http://www.goodreads.com/book/show/1097239.Nathan_der_Weise", "http://www.goodreads.com/book/show/7661205-nathan-the-wise", "http://www.goodreads.com/book/show/1436901.Emilia_Galotti", "http://www.goodreads.com/book/show/906321.Minna_von_Barnhelm", "http://www.goodreads.com/book/show/12158.Laocoon", "http://www.goodreads.com/book/show/1011721.Miss_Sara_Sampson", "http://www.goodreads.com/book/show/2702147-die-juden", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}