{"ratings": 14, "userreviews": [{"userName": "James", "userReviewDate": "Apr 30, 2015", "userURL": "http://www.goodreads.com/user/show/34146417-james", "userReview": "I thought this book was very poetic. It had a lot of meaningful, well thought out, poems in it that were really nice. I would only recommend this book to someone who like poetry and who are in to western stuff, because if you don't like poems or western stuff you will hate this book."}, {"userName": "Tyenpalmer", "userReviewDate": "Nov 24, 2014", "userURL": "http://www.goodreads.com/user/show/34140651-tyenpalmer", "userReview": "This is a pretty good short poem book. I had a couple favorites. I can really understand the poems because I can relate to them in a lot of ways."}, {"userName": "Statler", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/34404057-statler", "userReview": "This is a great book of poems for young adults. Bailing Twine was one of my favorites. I recommend this book to non city folk."}, {"userName": "Tarin Arneson", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/37901047-tarin-arneson", "userReview": "I read poems out of here because I figured I would relate to it. I really enjoyed these poems and hope to read some later on as well."}, {"userName": "Riley", "userReviewDate": "Apr 19, 2014", "userURL": "http://www.goodreads.com/user/show/25923943-riley", "userReview": "A great book"}], "description": "The National Cowboy Poetry Gathering is the granddaddy of all cowboy poetry events, recognized by the US Senate for its pioneering role in the preservation and revitalization of this important American tradition. In conjunction with the 30th anniversary of the event, this commemorative volume collects over 100 poems by various cowboy poets who have appeared at the gathering over the last three decades. In addition to poems that will make you laugh, sigh, or sit up straight in your saddle, the anthology features expressive photos, biographical head notes, artwork from the Folklife Center’s archives, and illuminating sidebars on topics such as working cattle; life on the land; the relationship between cowboy poetry and song; gear and horses; and profiles of important poets from earlier times. A foreword by cowboy poet extraordinaire Baxter Black and an introduction give context both to the event itself and to cowboy poetry in general from the days of the trail drives in the nineteenth century to the lives of the hardworking men and women who still ranch and live on the land in the West today.", "title": "National Cowboy Poetry Gathering: The Anthology", "url": "https://www.goodreads.com/book/show/18341886-national-cowboy-poetry-gathering", "average": 3.86, "cover": "https://images.gr-assets.com/books/1385598457l/18341886.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/7225764.Western_Folklife_Center", "name": "Western Folklife Center"}, {"url": "https://www.goodreads.com/author/show/33135.Baxter_Black", "name": "Baxter Black"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/18341886-national-cowboy-poetry-gathering"]}