{"ratings": 897, "userreviews": [{"userName": "Elyse", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "I'm so blown away.....but it's not just me.... MOST READERS will be!!!  ZERO SPOILERS .... it's not a long book!!!! Go in BLIND! \"Night of the Fiestas\", by Kirstin Valdez Quade, is a MUST BE READ!!!!10 short stories in this collection. My poor husband-- OH MY GOSH... I literately spilled-the-beans on each story .....( forgive me Kirsten Valdez Quade). I HAD SO MUCH FUN, being my \"husband's story-re-creator\". I'm bad - but, if you know your husband's not going to read your book himself, how else are we going to tell them what they are missing, girls? Paul loved these stories ( second hand), very much. In fact --he said 'it was one of his favorite \"wife-sharing-books\". SERIOUSLY.... THIS BOOK MUST BE READ: EVERY PERSON I'm friends with - ALL TYPES .... are in for an AMAZING EXPERIENCE when you read these stories!!!!....emotionally real....Hispanic culture of Northern New Mexico ....brave and beautiful ....GORGEOUS writing....The sentences read with such ease... so naturally... you forget you're reading at all. ....Strong unforgettable characters....and unforgettable stories. ALL ARE POWERFUL!!Unreal ... that they can 'all' be so exceptional! I may have a 'couple' of favorites but NOT SPILLING the beans to READERS!!! I 'promise' ... you'll enjoy this collection of stories!.....(Esil...you must read this)....and a thousand other friends! ....Themes about families include faith - grief - confusion- sabotage - struggles - race -religion- betrayal- class - secrets - coming of age - love ....etc......THESE STORIES do not feel like 'same old- same old'..... YET.....the author speaks to our heart in the way Anne Tyler, Elizabeth Strout, and Alice Munro does. FRESH & ORIGINAL - DO NOT MISS THIS ONE!!!! Thank You Jill >>>Good friends recommend good books!! MANY THANKS!!!"}, {"userName": "Iris P", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/2641948-iris-p", "userReview": "Night at the Fiestas★★★★ 4 Stars!So I've been in a sort of a short-stories binge these last couple of weeks. After reading the wonderful Anything Is Possible, I was not expecting to jump into another book of short fiction so soon, but my friend Elyse had recently recommended this collection and I decided to at least sample a few of these stories. As it happens, the first one, called \nNemecia\n, pulled me in immediately and I found myself unable to stop reading and listening. Mostly set in New Mexico, part of the attraction for me was the stories' geographical and cultural backdrop. I've always admired the rich, deep-seated presence of Mexican culture in the American West and how ingrained it is in so many places in that region. Sometimes this influence manifest itself in obvious, imposing ways, and others, it is more subtle, almost imperceptive. And so that is what author Kirstin Valdez Quade does here. The Hispanic culture of Northern New Mexico is always playing in the background: the deep-rooted religious traditions, the historical sites, the Spanish sounding names, the highly anticipated annual fiestas. The landscape that surrounds these characters is an intrinsic part of who they are, and yet their circumstances and experiences have a universal quality that I believe, can speak to anyone.The protagonists, many of whom come from broken homes, share a profound sense of abandonment and so the notion of family, both the traditional and more modern, blended kind, is very much at the center of these stories as well.Faith and religion are also important elements here. I thought it was particularly interesting how for many of these characters, faith offers the possibility of redemption while religion represents a shelter that fulfills their need to belong and provides the social acceptance they desperately craved.Finally, I would add that the author brings a refreshingly honest perspective that for the most part, avoids painful clichés and stereotypes. The stories in Night at the Fiestas are compelling and superbly written. Their sense of place and evocative imagery paired with wonderfully constructed characters is a great choice for anyone looking for a unique selection of short stories.***********************************************The audiobook is well narrated by Alma Cuervo, who is an American actress that comes from a Hispanic background. As a native Spanish speaker, I am always grateful for narrators who don't spoil a book by mispronouncing and mangling up my mother tongue."}, {"userName": "Hannah", "userReviewDate": "Nov 30, 2016", "userURL": "http://www.goodreads.com/user/show/41788446-hannah", "userReview": "The three stars are an emotional rating. It is the only way I know how to rate books. While I understand intellectually how great these stories are and how well constructed and how insightful, they made me uncomfortable. And again, I understand how that is a sign of a book well-written, this being able to ellicit emotions in me; it still wasn't something I enjoyed. At the heart of these stories are families; or people at crossroads. Usually I really like reading about family dynamics but for some reason this collection didn't always work for me. Some stories resonated with me (the first story in particular!), some left me feeling distanced. Quite often I thought the stories ended too soon and left me wanting to know more - at least a page or two! This made for a frustrating read in parts. Still, Kirstin Valdez Quade's prose is on point, her sentences sharp and evoking, and her characters well developed. So in all fairness, it should have been a four-star-read, but like I said, I rate books emotionally before I rate them intellectually. And in this case my heart won."}, {"userName": "Roxane", "userReviewDate": "Jul 21, 2015", "userURL": "http://www.goodreads.com/user/show/1151637-roxane", "userReview": "Outstanding collection. Nearly flawless. The story about Amadeo is so amazing. Worth checking out. Last story fell flat for me."}, {"userName": "Kate Koza", "userReviewDate": "Dec 14, 2014", "userURL": "http://www.goodreads.com/user/show/5747149-kate-koza", "userReview": "One of the most affective collections of stories I've read in a long time. Quade's language is that of dulled teeth, taped-over childhoods, and chapped lips, her characters united by their various iterations of otherness. I felt most of the collection to be somewhat female in character, but the kind of female who has forgotten to be defined by - or even take note of - her gender. The kind of woman who is first and foremost a man. This is perhaps one of the rarest (and most valuable) kinds of voices in contemporary literature, and one that I don't take for granted when I stumble upon it. That being said, her characterizations of men are appropriately generous and certainly a great deal more humanizing and complex than most, which I also appreciated. The author is subtly and creatively more flattering to fathers than mothers, and, accordingly, more thought is devoted to digging beneath the surface of fathers' identities and extracting small-but-towering shards of humanity.Each tableau bleeds New Mexican blood, but it's the story of America as a whole that beats deep within the cavity of all of Quade's tales. Highly recommend for anyone sick of reading about the hoards loathsome, privileged urbanites currently crowding bookshelves with their overly analyzed and self-inflicted interpersonal non-problems."}, {"userName": "Jill", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/2228181-jill", "userReview": "I’ve read a lot of short story collections but this one just blew me away. There are only two types of stories that comprise the collection: those that are excellent and those that are outstanding. Every single one was so haunting and memorable that it’s hard to decide which ones to highlight.The Five Wounds may arguably be the one that stands out the most. A neer-do-well named Padilla is chosen to reenact Christ’s passion, carrying a heavy wooden cross through dusty New Mexican streets and experiencing Jesus’ pain in a quest for personal redemption. When his young pregnant daughter, Angel, shows up and clamors to be taken into the morada, Padilla must contemplate whether to risk his redemption and violate the community code, sacrificing his “Jesus moment.” I cannot imagine this story not appearing in “best of the best” compilations.Other stories are equally searing and fresh. In Canute Commands the Tides, for example, a wealthy East Coast white woman moves to New Mexico and hires a Latina housekeeper who has a troubled adult son. Their symbiotic relationship soon rears its ugly head: “they were motionless, as minutely wrought as figures in a medieval miniature. His face was buried in her lap, and she bent over him, so close, their heads were nearly touching, the two of them as destructive and unstoppable as any force of nature.” Wow!In the eponymous story, Night of the Fiestas, a young girl named Frances who was “pretending to be someone else” and who is “twitchy with impatience”, takes her father’s bus to the Fiestas in Santa Fe, where she hopes that something will happen. Something does happen, giving Frances a glimpse into the way the world really works.I can go on and on about this remarkable debut, where readers will meet an unmarried pregnant woman who comforts a priest in the office of the Catholic church, a young girl who meets her exotic cousin Nemecia who may have had something to do with her parents’ untimely death, a man who finds his unrepentant father and a pregnant boa constrictor entrenched in a guest house and more. I cannot recommend this collection highly enough."}, {"userName": "Xueting", "userReviewDate": "Jun 23, 2016", "userURL": "http://www.goodreads.com/user/show/4691420-xueting", "userReview": "Kirsten Valdez Quade writes her narrative and dialogue like a spread of butter on toast, seamlessly connected and constantly enjoyable. I'm probably overreaching my own abilities but I feel like she writes in a style very much like mine - or at least the style I love to write and want to write. That's a big reason why I'm so drawn to her stories here. Her first sentences grab me and the rest of the stories continue to pull me in in very straightforward, honest language that I can only describe as bright and sharp. The writing is energetic, youthful and perceptive. It's a very contemporary voice that I've been looking for! Maybe it's because most of her protagonists are interesting young females, but all the characters are colorfully portrayed.Most of the stories are about family relationships especially between parent(s) and child. I love love love the first story 'Nemecia'. There's a brilliant air of mischief surrounding a pretty simple premise. Others I really love are 'The Five Wounds', 'Night at the Fiestas', 'Jubilee' and 'Family Reunion'. The others are wonderful too, each one unique. Except for the last story, 'The Manzanos' - that one was quite all over the place. One thing about the writing that stuck out oddly a bit, to me, was how the author ended most of the stories. The endings were pretty abrupt and confusing... But maybe it's just my poor understanding. Great debut collection! I can't wait to read more from the author :)"}, {"userName": "Ellie", "userReviewDate": "Apr 17, 2017", "userURL": "http://www.goodreads.com/user/show/2908629-ellie", "userReview": "This collection of short stories set in the southwester United States (northern New Mexico) has many fine stories. The first story deals with the complicated relationship between two cousins, one who bullies the younger who both admires and resents her cousin. There is a story I found somewhat frightening involving a reenactment of the crucifixion of Jesus. All the stories are extremely well-written and completely absorbed me, a feat that can be especially difficult with a short story. The beautiful settings contrast and compliment the intensity of the stories.I am grateful to my friend Elyse for bringing these stories to my attention. They are a must-read for anyone who loves fiction."}, {"userName": "Stephanie", "userReviewDate": "Mar 29, 2015", "userURL": "http://www.goodreads.com/user/show/1412896-stephanie", "userReview": "When I was a little girl growing up in northern New Mexico, we used to hear whispered rumors of the Penitentes, the Catholic brotherhood that lives semi-secretly in these mountains. Famous for whipping themselves, they also get very *very* into their sacraments, such as the one depicted in Quade's story \"The Five Wounds\" in which that year's Christ is nailed to a cross—with real nails. The passion of the Penitentes was so bloody that it was said our mountains, the Sangre de Cristos, were named for the blood that poured off their backs in their frenzies of flagellation. Considering the color and character of this area, it's remarkable that more fiction hasn't been set here. I suppose the deeply rural nature of the area, and the privacy and insularity of the people who live here, have something to do with that. How wonderful, then, to come across Quade's collection. Not only does she delve directly into the heart of what makes northern New Mexico so special, she has the writing chops to carry it off. From structure to setting to pace, she nails each piece consistently. Short stories aren't about character, they don't have the room for it, but she develops characters nonetheless. Her greatest character, arguably, is the girl Nemecia, the title character of the first story. The viewpoint character for that story initially sees Nemecia only as a figure both terrifying and captivating, but by the end understands her as a traumatized survivor of a terrible event. Most stories, in fact, follow characters as they go from ignorance to understanding, as lightbulbs begin to pop on over their heads. Amadeo, the Christ figure in \"The Five Wounds,\" begins to understand what his tormenter Manuel Garcia is really up to. In \"The Guesthouse,\" Jeff begins to understand the depths to which his father has sunk. In \"Family Reunion,\" the child Claire initially thinks her friend's mom Patsy is just the best thing ever, but events of the story reveal just how wrong she is about that—and about a lot of other things. In \"Canute Commands the Tides,\" Margaret comes to a late, terrible understanding of how little she knows about her new friend Carmen. And in \"Mojave Rats,\" the reader herself has an epiphany as a secret long-buried in the viewpoint character's mind suddenly comes out, illuminating the troubled relationship between mother and daughter.Quade cites Tobias Wolf and Alice Munro as role models, and you can see the influence of those writers in these stories. Sometimes so much so that I began to confuse Quade's stories with the Alice Munro collection I was currently reading. As she continues to write, Quade will undoubtedly develop a voice that is unmistakably her own; to that end, I hope she continues to root her work in the fertile ground of northern New Mexico."}, {"userName": "Zora O'Neill", "userReviewDate": "Sep 06, 2014", "userURL": "http://www.goodreads.com/user/show/2724918-zora-o-neill", "userReview": "I'm from NM, so maybe these stories resonate with me more than with the average reader? I'll be curious to see other comments when the book comes out. For now, it's great to read fiction set there. The story about the Penitente crucifixion that ran in the New Yorker a few years ago has stuck with me, so I was really happy to see this full collection of stories (including that one). A couple of them felt a tiny bit thin or caricatured, but overall, they're carefully drawn portraits with very smartly observed social and cultural details."}, {"userName": "Kara", "userReviewDate": "Feb 18, 2016", "userURL": "http://www.goodreads.com/user/show/32501773-kara", "userReview": "If you feel that short stories are an acquired taste, these intense and uncomfortable tales just might make you a fast fan. The writing is straightforward, no fancy tricks of prose here. Her poignancy lies in an ability to make you squirm in your reading chair. The common thread throughout is subtle Hispanic cultural ties. The situations the characters find themselves in transcend the cliché. Vladez Quade absolutely earned her National Book Foundation '5 under 35' award."}, {"userName": "Lisa Eckstein", "userReviewDate": "Jan 05, 2015", "userURL": "http://www.goodreads.com/user/show/10050737-lisa-eckstein", "userReview": "The stories in this collection succeed at the difficult task of taking small moments in ordinary lives and rendering them fascinating. These are all beautifully detailed portraits of people and relationships that I was able to quickly care about and remain engrossed in, something I can't often say about short stories.The stories are set in New Mexico and other parts of the American West, in a variety of eras ranging from the 1920s to the present day. Many deal with class differences or cultural divides. In \"Jubilee\", a young woman attends a fancy party with the intention of showing up the rich hosts who employ her father, but as the event goes on, what's exposed are her own insecurities. The main character in \"Canute Commands the Tides\" moves to New Mexico to paint, and when she hires a woman to help clean and unpack, she envisions a charitable friendship with her housekeeper that turns out not to match the reality of their relationship.Quade makes all the stories real and specific with perfectly crafted and sometimes funny observations of the characters and moments. In \"The Five Wounds\", she writes of a pregnant teenager's belly, \"The buttons of her jeans are unsnapped to make way for its fullness, and also to indicate how it got that way in the first place.\" The title story features a great narrative voice that gently mocks the protagonist, a teen girl who is constantly imagining herself as a character in a book or movie: \"She pictured herself: her slow blush, lashes lowered against her cheek.\"Families play an important role throughout this collection. My favorite of the stories is probably \"The Guesthouse\", about a man who must deal with his grandmother's house and affairs following her death. He can't count on his mother and sister to help out because he and Grandma were the responsible ones in the family, an identity he's quite invested in, and the situation is made more complicated by the reappearance of his estranged father. Another standout is \"Family Reunion\", in which a girl tries to navigate her family's weirdness as non-Mormons in Salt Lake City. But really, it's hard to pick out the best stories. They're all excellent, and I look forward to more of Quade's work."}, {"userName": "Galen Johnson", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/1134669-galen-johnson", "userReview": "This was a wonderful read, full of well-developed characters at emotional precipices in their lives. I usually prefer the character development and plot of a novel, but I found all of these stories satisfying. The author does an excellent job of creating individuals out of her characters but capturing universal moments and emotions. Her writing is flowing and readable, with apt descriptions of both people and events that are original and lovely. In a story centered on a single mother-to-be who works in a Church office, she writes \"This morning, when Father Leon had glared at her from behind his desk, he hadn't been merely irritated at the interruption; she saw now that he'd been horrified by her messy mammalian fecundity looming in his doorway.\" Most of the main characters in the stories are women, many struggling with subtle progressive thoughts about a woman's (or girl's) place in life while stuck in a traditional setting, but I think anyone could enjoy the stories and find something to relate to in the characters.Note: I received an ARC from the publisher through Goodreads."}, {"userName": "Taryn Pierson", "userReviewDate": "Sep 16, 2015", "userURL": "http://www.goodreads.com/user/show/13977687-taryn-pierson", "userReview": "I feel like with short stories, you either immediately buy in to whatever weirdness the author presents, or you don't. I was able to find that entry point quickly with this collection by 5 Under 35 Honoree Kirstin Valdez Quade. The stories, most set in rural New Mexico and centered around themes of family ties and obligations, had me hooked within the first page.My favorite story, “Canute Commands the Tides,” wasn't my favorite because it left me feeling warm and fuzzy. It actually made me pretty damn uncomfortable. I related to the central character so hard—this well-meaning, liberal white woman who, in romanticizing the life of her Hispanic cleaning woman, ends up abandoning all her cozy ideals when confronted with a hard dose of reality. I could see myself doing the same things she did, congratulating myself on my broadmindedness, then turning tail and running once I learned how things really are. Yeah...not always comfortable when we recognize a piece of ourselves in a less than perfect character. Even though it's not always pleasant, I don't mind a book that humbles me every now and then.More book recommendations by me at www.readingwithhippos.com"}, {"userName": "Chris", "userReviewDate": "Feb 20, 2016", "userURL": "http://www.goodreads.com/user/show/257120-chris", "userReview": "Damn. Damndamndamn. That's one helluva book. Like the best, Quade introduces to us characters we have never seen or imagined but who seem immediately real in their stifled yearnings and smothered longings. Nearly all of the stories here manage to startle, some indelibly, and even the lesser stories show promise. I'm still processing this one and suspect I will be for quite a while, but you could do worse than to just trust me and go pick this up right away. For what it's worth, this book was awarded the National Book Critic's Circle Award for best first book the day before I finished it, which is clear proof of my powers."}, {"userName": "Mindy Kannon", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/11060246-mindy-kannon", "userReview": "I keep trying to like short stories but somehow they just doesn't work for me. These stories are OK but I'm sure it's just me. Short stories just don't seem to have enough depth to keep me engaged. They always leave me feeling like, there's got to be more to the story."}, {"userName": "RM Fortes", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/16089962-rm-fortes", "userReview": "I didn't love all the stories in this collection, but the ones that I did love, I REALLY loved."}, {"userName": "Holly", "userReviewDate": "Nov 09, 2015", "userURL": "http://www.goodreads.com/user/show/7240219-holly", "userReview": "Yet another striking debut short-story collection. Some of the best contemporary writing these days is coming from short-story writers, and Kirstin Valdez Quade is no exception. Her stories explore physical and emotional poverty in New Mexico, California, and the dry, godforsaken Southwest. Her main themes: fractured families, hovering Catholicism, uncomfortable pasts, frustrated youths, and world-weary troubadours. Her characters are so genuine, frustrating, mistake-prone, real—I couldn't help aching for even the most misguided and obnoxious protagonists. All of the stories are unique and bring something different to the collection. My favorites were \"Jubilee\" (featuring a protagonist who is so painfully haughty that I felt nauseous when I saw myself) and \"The Manzanos\" (a conclusory heartbreaker). Religion-angst buffs (is that a thing?) will love \"The Five Wounds\" and \"Ordinary Sins.\" Quade also writes well from the point of view of children and teens, which is a really really really difficult thing to do convincingly."}, {"userName": "Julia", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/11135798-julia", "userReview": "A brilliant collection; what a talented writer. I envy the way Quade can create an environment that is all at once stark & stunning, and plays so cleverly with themes of class, race, family & tone. An annoyingly good book."}, {"userName": "Book Concierge", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/1628041-book-concierge", "userReview": "Ever since I studied O Henry and Edgar Allan Poe in junior high, I have loved short stories. With this collection, Kristin Valdez Quade is added to my list of authors who have perfected this format. It’s difficult to rate a collection, because some of the stories resonate more with me than others. Quade gives us ten beautifully written stories in this collection. In The Five Wounds Amadeo tries to atone for past (and current) failures by playing the part of Jesus in the annual Good Friday re-enactment of the crucifixion, while his pregnant teen-aged daughter looks on. Andrea struggles between hating the wealthy land owner who employs her father, and desperately wishing she could be more like his daughter, Parker in Jubilee. In Mojave Rats Monica is feeling trapped with her two daughters, seven-year-old Cordelia and the infant Beatrice, in a sparsely populated trailer park, while her husband is off doing fieldwork for his Ph.D. Pregnant Crystal has found work and maybe a little hope as a secretary for the local parish priest in Original Sins. When the reader meets Frances in Night at the Fiestas, “she is pretending to be someone else, someone whose father is not the bus driver.”What Quade’s characters share is that desire to “be someone else” and/or somewhere else, but no real means of achieving that. They dream, but are somehow powerless to change their circumstances, falling back on old patterns of behavior, afraid to let go of their past to head into the future. Quade’s short story collection won the National Book Critics Circle Award for John Leonard Prize in 2015, and Sue Kaufman Prize for First Fiction (2016). She was named a National Book Foundation “Five Under Thirty-Five” Author."}, {"userName": "Rebecca", "userReviewDate": "Jul 13, 2015", "userURL": "http://www.goodreads.com/user/show/181758-rebecca", "userReview": "I was drawn to this collection because of Valdez Quade's story \"The Five Wounds,\" which appeared in the New Yorker several years ago. Its sense of culture, religion, place and character development are so powerful that I decided to teach it for my class, and my students love it as well.Not all the stories resonated with me as much as \"The Five Wounds.\" Several deal with dysfunctional families, often with some kind of abuse, and I found myself wanting a little less despair, a little more hope. However, this impulse was coupled with the realization that maybe that's too naive of me. Maybe the stories, which often emphasize the permanence of dysfunction, are a slice of reality that's important for me to pay attention to. In fact, there are several well-meaning, charitable, yet extremely short-sighted characters, all of whom are white outsiders looking in on a culture and family dynamic not their own and trying to \"fix\" it. I glumly realized that I'm more like these characters than any others. One of my favorite stories was \"Ordinary Sins,\" which again deals with religion and identity, in ways similar to \"The Five Wounds.\" Valdez Quade does an amazing job at creating flawed religious characters who are not flawed in any of the traditional ways that religious characters are flawed. I also loved \"The Manzanos,\" a truly beautiful story to end the collection with.Valdez Quade is a contemporary southwestern Flannery O'Connor. Her characterization is profound and often embodies a southern gothic aesthetic, but with a particular southwest sensibility. Besides a few passages in the stories where the characters overthink their options, I was thoroughly engaged and couldn't wait to find out what would happen."}, {"userName": "Lauren", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/25223589-lauren", "userReview": "When I was maybe five or six, I had a best friend by familial association. My mother's friend's daughter, we were bound to be friends because our parents were. We'd play pretend, reenacting television show cartoons or our own creations. And while it began easy-going, action-packed, creative, exhilarating, it became increasingly obvious she was susceptible to dramatic Hallmark shows, or Lifetime movies, where weeping girls flung themselves out of windows because of... a boy, or a bully, or a mean mother. Our game would devolve, no matter the circumstance. If we were the Powerpuff Girls, fighting some monster, we'd then be presented with the Professor dying, or maybe one of the Rowdy Ruff Boys stopped loving her, and we'd become victims of a soap opera.Reading Kirsten Valdez Quade's collection of short stories was like this childhood experience. Not only was I obligated to associate myself with it (a class requirement) but when at the beginning, it was fun and inviting, well-written and dramatic, it became tiresome and predictable. Every short story would end the same way: surmounting fear, apprehension, or disappointment in a little girl/woman leading to an ending that tapered off before any consequence. This style didn't leave room for ambiguity. It just came off like she didn't know how else to finish it. The only story worth reading in this collection is The Guesthouse. Maybe Nemecia. Either way, just read them online for free. It's tiresome giving this woman money for her book; I feel she'll use the crisp bills to dab her tears away with."}, {"userName": "Tailwinds Press", "userReviewDate": "May 19, 2015", "userURL": "http://www.goodreads.com/user/show/29191865-tailwinds-press", "userReview": "You could do far worse than this book. I'd recommend buying it before a flight.I find it hard to say anything bad or critical about this well crafted, taut and evocative collection of short stories focused on dramas taking place in the Southwest. More specifically, New Mexico. The author's use of language is impeccable. The plots are compelling. The characters are bathed in ambivalence and complexity.I only give it 4 stars because it seems if there is only one way for this author to confront the world through writing. The South west. Coming of Age. New Mexico. Social economic dramas. Are writers attributing a complexity to day-to-day life that is perhaps a little too granular and detailed? Maybe every moment, every person, every interaction is not pregnant with an infinite amount of dripping ambivalence and emotion. Just a thought that comes to mind while reading this great collection. I feel emotionally exhausted after putting it down. Is every moment so fraught? Perhaps that is the modern MFA-taught short story.Perhaps I am somewhat jaded by having read just before this \"The Three-Body Problem\", a page-turning Chinese science fiction novel--still steeped in emotion but not overanalyzing every blink of the eye. I loved the writing in this book, but it's reached some level that I'm left wondering if there's any limit to this style."}, {"userName": "Darri", "userReviewDate": "Jun 10, 2015", "userURL": "http://www.goodreads.com/user/show/5932251-darri", "userReview": "God what a bummer. \"The Five Wounds\" was published in the New Yorker a few years ago and was such a banger and so affecting and I was PUMPED to read this collection. Sadly, it's a clunker! I had two stories left to read and found myself flipping through back issues of People magazine in order to avoid this massive disappointment of a book. These stories are so staid, so formulaic, so devoid of joy or exuberance or breathlessness. The writing is controlled to a fault. And then homegirl's throwing garbage dialogue at us, like: \"People change, Jeff. I changed, not that you notice. I'm not still seventeen years old and suicidal. Grandma changed. Maybe Papa has, too.\" Sad sad sad sad sad ;("}, {"userName": "Superstition Review", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/13953354-superstition-review", "userReview": "Night at the Fiestas is a miraculous collection of stories that delve into the diversity that is the human race. In this book, we see a variety of characters that deal with real-life human emotions and situations. As we read, we see each character’s unique perspective on life and we also learn to understand them. They become three-dimensional people right before our eyes. Quade accomplishes all this flawlessly while keeping us hooked on a good story. Review by Dennise Garcia"}, {"userName": "Sophia Tallon", "userReviewDate": "Feb 10, 2015", "userURL": "http://www.goodreads.com/user/show/4508396-sophia-tallon", "userReview": "I was lucky enough to receive an Advanced Reader's copy of this through goodreads first reads and I honestly loved this collection of short stories! They all flowed together perfectly yet could stand alone brilliantly! They all were so varied and each one had something interesting, exciting, and real happening. If asked which was my favourite I couldn't say. But what I can say is that I would seriously love to take all of these stories and make them into a whole film!"}, {"userName": "Courtney Maum", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/27776627-courtney-maum", "userReview": "Luminous, heart wrenching, hugely full of life and most interestingly-- very disturbing on some moral levels. A gorgeous read that demands a weekend put aside to immerse oneself fully in Quade's scintillating world."}, {"userName": "Maggie", "userReviewDate": "Apr 05, 2015", "userURL": "http://www.goodreads.com/user/show/10271024-maggie", "userReview": "This is good writing. Each story had the depth and weight of a fully-fleshed out novel. Universal issues, beautiful imagery, \"real\" people as characters. Loved it."}, {"userName": "BookBully", "userReviewDate": "Mar 27, 2015", "userURL": "http://www.goodreads.com/user/show/5561936-bookbully", "userReview": "4.5 stars for this magnificent debut. Quade is a master of the short story and is definitely an author to watch."}, {"userName": "Alexandra", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/58956129-alexandra", "userReview": "This book consists of multiple stories that are meant to relate to the lives of New Mexicans. 10 stories are shared out, with different perspectives of mostly young teens, that are trying to find their way in society and family. While reading this book I found that the literature in some stories is told at a more cultural or political view, that I did not find interest in or could not clearly understand. Though in other stories I could really process my understanding of the characters feelings and thoughts. With each story as its own developing novel, the author Kristin Valdez Quade describes and empathizes different situations of New Mexicans during their time.Night at the Fiestas Stories book has its mysterious, authentic stories take place in rural New Mexico. In part of the short stories, characters often find themselves in a family conflict where they try to determine their importance as a family member, so they could either help out or be the best in the crowd. For instance in the chapter Nemecia, a girl Maria is trapped in a thought of confusion when she learns her older cousins Nemecia big secret, that scares her to death. But when an important family tradition comes up, Maria can't wait to finally prove herself to her parents, to be the miracle child, but only finds out to be challenged by Nemecia to give up that dream and feel abandoned. Furthermore, in the title story, a teenage girl Frances rides her father’s bus to the downtown fiesta, and on her way meets a sophisticated “painter” that she then flirts with at the fiesta with her cousin. Towards the end of the party though Frances then realizes some of her mistakes but tries to prevent them from showing. Thus both teenage characters in these two stories examine their prejudiced attitude towards others. Additionally, the author Kristin Valdez also presents stories that include characters who try to take control of their family situation, by themselves. An example, like The Guesthouse story is about how two siblings, Jeff and Brooke, experience their grandmother's death and are now trying to preserve some of her things, but at the same time, not selling items means no money for their family. Meanwhile Jeff discovers his father is hiding out in the guesthouse with a female boa constrictor, and over the years he's been “helping” their grandmother. The divorced father thinks he can make up for everything, but Jeff would rather take matters into his hands without giving his hopeful father trust. The role of religion is demonstrated in 3 different stories. In one of them called Family Reunion, Claire goes on a vacation with her Mormon neighbors, and although she is having a blast, some uncertainty comes to her, when Morgan her best friend judges Clair’s religious future. My judgment of this book is positive although in some chapters, of the variety of stories I felt confusion and misunderstanding. While reading some of the stories, I liked the way the author related some of the events to real life so then I could analyze some of the literature to the real world.  On the other hand, I do have some negative aspects of Night at the Fiestas Stories. I wish the author had elongated some stories and eliminated others to make the book more enduring. For example in Family Reunion I would have liked to keep on reading a longer version of that chapter because it was well written, so when I continued to the next story I felt a little bit disappointed that the story had ended. Also I did not really like the way the author made the stories often differ in language of religion or politics. Sometimes I felt like the stories were at a sustainable level, but at other times I would have to skip over a story because it would be that hard to understand what was going on. Since Kristin Valdez did use writing of high quality, I would recommend this book to people that have more knowledge of society, and read higher level books. Night at the Fiestas Stories is recommended to a variety of tennagers, so the way the author presented each story always put the reader into a position that they could easily relate to or in a way “communicate” with the teenage character. Overall, Night at the Fiestas Stories book is very significant with the New Mexican culture, religion and creates plot twists. The author really engages the fact that adults don’t have the same thinking process as young tennagers so this characteristic between teenager and adult does really come to play in this book, which involves the reader to challenge their thinking while reading."}], "description": "With intensity and emotional precision, Kirstin Valdez Quade's unforgettable stories plunge us into the fierce, troubled hearts of characters defined by the desire to escape the past or else to plumb its depths. The deadbeat father of a pregnant teenager tries to transform his life by playing the role of Jesus in a bloody penitential Passion. A young man discovers that his estranged father and a boa constrictor have been squatting in his grandmother’s empty house. A lonely retiree new to Santa Fe becomes obsessed with her housekeeper. One girl attempts to uncover the mystery of her cousin's violent past, while another young woman finds herself at an impasse when she is asked to hear her priest's confession.Always hopeful, these stories chart the passions and obligations of family life, exploring themes of race, class, and coming-of-age, as Quade's characters protect, betray, wound, undermine, bolster, define, and, ultimately, save each other.", "title": "Night at the Fiestas", "url": "https://www.goodreads.com/book/show/25622829-night-at-the-fiestas", "average": 4.1, "cover": "https://images.gr-assets.com/books/1453021037l/25622829.jpg", "reviews": 177, "authors": [{"url": "https://www.goodreads.com/author/show/8252558.Kirstin_Valdez_Quade", "name": "Kirstin Valdez Quade"}], "type": ["Short Stories", "Fiction", "Literary Fiction", "Adult Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/25622829-night-at-the-fiestas", "http://www.goodreads.com/book/show/23003863-night-at-the-fiestas", "http://www.goodreads.com/book/show/22253739-night-at-the-fiestas", "http://www.goodreads.com/book/show/35822041-christina-the-astonishing", "http://www.goodreads.com/book/show/23363860-ordinary-sins", "http://www.goodreads.com/book/show/35910993-the-five-wounds", "http://www.goodreads.com/book/show/35260984-jubilee", "http://www.goodreads.com/book/show/34043889-tales-of-two-americas"]}