{"ratings": 6, "userreviews": [{"userName": "Laura", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/2521894-laura", "userReview": "NIGHTY NIGHT AND GOOD NIGHT by this award winning dual Michael W. Smith and Mike Nawrocki. I wish a CD of Mr. Smith's song had been included in the book, but there is a golden sticker on the cover where you can listen to the original song online. The story itself is adorable as Ben isn't sleepy but it's bedtime. His stuffed animal pals try to give him advice such as counting sheep (but Ben only knows how to count to ten), fluffy pillows (which was kind of fun, tossing them around in the air) and having a yawning contest. But finally one of them sings him a lullaby and Ben gets sleepy.This would be a great book for parents' bookshelves, grandparents', aunts or uncles or other caregivers, or maybe for a church children's library for parents to check out on occasion. Also a great gift at baby showers."}, {"userName": "Jalynn Patterson", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/8725733-jalynn-patterson", "userReview": "About the Book:Nighty Night and Good Night is the first book in a series of bedtime books by multiple Grammy and Dove Award-winning recording artist Michael W. Smith and VeggieTales co-creator Mike Nawrocki. In Nighty Night and Good Night, the stuffed animal band the Nighty Nights are called upon to help their friend Ben try to fall to sleep. This cute and sleepy adventure leads Lamby, Bear, and Sleepy Puppy to discover that a classic lullaby might just do the trick.This book includes a link that allows readers to listen to Michael W. Smith sing the same lullaby that helps put Ben to sleep.Founded by Michael W. Smith, Nurturing Steps is an infant and toddler series of children’s music and books with a simple mission to enliven a child’s journey with hope and faith through music and storytelling.The cover of Nighty Night and Good Night includes an adorable image of the Nighty Nights and a title that shines with foil.My Review: A sweet book about a little boy by the name of Ben that is having trouble falling asleep one night. He has a few sweet fluffy friends to help keep him company while he figures out the best way to get some sweet shut eye.  Co written by the brilliant Michael W. Smith, we are introduced to a lullaby written by him in this sweet, little story. A brilliant idea for a baby shower gift. I plan on passing this on to my church for the nursery located there. A very good bedtime story book that is God based. Ben knows he is safe and secure in God's arms and soon falls fast asleep to this sweet lullaby.**Disclosure** This book was sent to me free of charge for my honest review from the publisher. All opinions are my own."}, {"userName": "Beckie Burnham", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/2952739-beckie-burnham", "userReview": "Dove Award winner and grandfather Michael W. Smith has a new venture — Nurturing Steps. The debut book in this series of music and books for infants and toddlers, Nighty Night And Good Night, is an adorable book that will become a favorite night time addition for your family. Targeted towards preschoolers, the book features young Ben and his 3 stuffed animals as he searches for a way to go to sleep. The four friends try their hardest to get Ben in a sleepy state of mind, but it is only after a lullaby that Ben indeed falls asleep. The soft words and pastel illustrations are perfect for drawing your child into the quiet of bedtime while reinforcing the care that God has for His children (the book begins and ends with prayer). The book also includes a link to the Smith’s original lullaby so you can combine reading time with music. Nighty Night And Good Night will be a wonderful addition to your family library.Recommended.Audience: preschoolers.(Thanks to Zonderkidz for a complimentary copy. All opinions expressed are mine alone.)"}, {"userName": "Courtney R.", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/81930443-courtney-r", "userReview": "As a Christian Mom of 3 young girls, I am always looking for new ways of getting the words and character of God into my children. When I heard that one of my favorite Christian artists was coming out with a children’s book, I had to have it. This is Michael W. Smiths debut book and it does not disappoint. Although simplistic, this is a story young children can relate to as it’s not always easy to fall asleep. My children even chimed in saying, “Wow, they really have a lot of ways to fall asleep.” They also liked the reminder to “Pray to the Lord”. The illustrations were a perfect compliment to the story. They reminded me of Precious Moments. The book also includes a link to the Michael W. Smith’s original song which my children and I played at the end. It might be helpful if a CD had been included. Overall, I highly recommend getting a copy of this book. I will be giving this book out at my next baby shower. (Thanks to Zonderkidz for a complimentary copy. All opinions expressed are mine alone.)"}], "description": "Nighty Night and Good Night is the first book in a series of bedtime books by multiple Grammy and Dove Award-winning recording artist Michael W. Smith and VeggieTales co-creator Mike Nawrocki. In Nighty Night and Good Night, the stuffed animal band the Nighty Nights are called upon to help their friend Ben try to fall to sleep. This cute and sleepy adventure leads Lamby, Bear, and Sleepy Puppy to discover that a classic lullaby might just do the trick.This book includes a link that allows readers to listen to Michael W. Smith sing the same lullaby that helps put Ben to sleep.Founded by Michael W. Smith, Nurturing Steps is an infant and toddler series of children’s music and books with a simple mission to enliven a child’s journey with hope and faith through music and storytelling.The cover of Nighty Night and Good Night includes an adorable image of the Nighty Nights and a title that shines with foil.", "title": "Nighty Night and Good Night", "url": "http://www.goodreads.com/book/show/37805372-nighty-night-and-good-night", "average": 4.83, "cover": "https://images.gr-assets.com/books/1525611299l/37805372.jpg", "reviews": 4, "authors": [{"url": "https://www.goodreads.com/author/show/12338.Michael_W_Smith", "name": "Michael W. Smith"}, {"url": "https://www.goodreads.com/author/show/3954271.Mike_Nawrocki", "name": "Mike Nawrocki"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/37805372-nighty-night-and-good-night", "http://www.goodreads.com/book/show/12382195-kamus-slang-idiom-bahasa-inggris-inggris-indonesia", "http://www.goodreads.com/book/show/23966774-ankylosing-spondylitis-pyramid", "http://www.goodreads.com/book/show/31690914-this-is-your-time", "http://www.goodreads.com/book/show/40059017-nighty-night-and-good-night", "http://www.goodreads.com/book/show/38915796-let-s-get-ready-for-bed"]}