{"ratings": 58874, "userreviews": [{"userName": "Kat Kennedy", "userReviewDate": "Aug 11, 2010", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "The problem with the current vampire genre is that it's like emo kids. It takes itself VERY seriously, tries waaaaaaaay too hard and in the end looks all the same. Oh, and it's fun to laugh at.It wasn't that nightworld was bad. The writing flowed nicely, was descriptive and the world was well-realized. The characters were mostly interesting and different and all three stories stood well on their own as well as adding to each other.That's not to say, though, that I didn't have issues with this book.The third story, for me, really dragged and wasn't as good as the first two. In fact, all three stories gave me strong recollections of Gossip Girl and Vampire Diaries mixed together. Not that, you know, I've ever seen either show...Has anyone else noticed that Chuck Bass usually looks really pissy? I'm serious. I've never seen someone master that bratty, \"I hope your head explodes from the sheer force of pissy that is emanating from my entire body right now\" expression that he does. Anyway, back to the review...The one thing that really annoyed me about this book was the soulmate concept. In this book, one look is all it takes to see and recognize your soulmate, binding the two of you together in some kind of super powerful love that can probably conquer everything from the forces of darkness to paying for your phone bill.Sorry, folks. I just don't subscribe to that mentality. I certainly don't think I could fall in love like someone would fall into a ditch."}, {"userName": "Andrew", "userReviewDate": "Dec 02, 2008", "userURL": "http://www.goodreads.com/user/show/1768670-andrew", "userReview": "this volume ,opps i almost said book this volume hold the first three books in the night world series my favorite was most deffinatly secerate vampire one thing i love about thease books is they dont have actual romance untill the end when everything is sorted out"}, {"userName": "Kate", "userReviewDate": "Jan 14, 2009", "userURL": "http://www.goodreads.com/user/show/615709-kate", "userReview": "This book had three stories combined into one huge book, and though they have different people as the main characters you can see all the stories start to combine into one huge story. Its about Vampires, werewolves, witches, anything that you can think of that is not normal. These creatures live on the fringes of society and they don't interact with humans too much except to feed or eat them, but some Night people fall in love with Humans and they challenge the rules and their death by telling the humans about their world, the Night World. I loved this book it was fast pace and i literally couldn't put it down until i had finished one of the stories. it was very exciting full of action making it a good read for just about anyone. It gave me a new perspective on certain life elements. So crack open those pages and fall into a book filled with romance and life threatening encounters."}, {"userName": "Karlyflower *The Vampire Ninja, Luminescent Monster & Wendigo Nerd Goddess of Canada (according to The Hulk)*", "userReviewDate": "Feb 08, 2013", "userURL": "http://www.goodreads.com/user/show/17243568-karlyflower-the-vampire-ninja-luminescent-monster-wendigo-nerd-godde", "userReview": "3 Stars This is a three-in-one compilation book, of which I seem to own most of L.J. Smith’s series’ in, and as such I will once again be attempting to review them in their singular parts rather than a cohesive whole. I am downgrading this particular volume to a three as when I joined GRs I just sort of slapped a bunch of ratings in here and left it as that. Though I like this series, this particular volume is not a favourite. This series is all about SOLE MATES!!!Oh, ermm, sorry, I mean SOUL mates… Whatever!The belief that there is one soul out there floating around in the world destined to be linked to your own. And while I find this concept distasteful I have to appreciate that Smith is seemingly using it’s reoccurrence to mend or break the old-school rules that inter-species or race dating is punishable by death within the Night World. Although I have to wonder if she herself finds it distasteful too; because it certainly reads like being tasered while simultaneously having pink glitter thrown in your eyes, a concept which does not sound even remotely pleasing. The Secret Vampire2 StarsThis is easily my least favourite story of this volume. While I appreciate Smith’s introduction to her world here and the explanations of the varying natures of Night World creatures and how they differ from the standard definitions in other stories I am left unsatisfied by the characters themselves. James is quite literally the most boring vampire I have ever read about. Other than the bizarre almost-parental relationship between James and Poppy – who have grown up together and are the same GODDAMN age – that begs the question of how in the world they could ever have a lasting relationship or love and respect, there is nothing really offensive about this story. It’s just exceedingly boring, is all. The truth is that I like Poppy, I think she’s strong and quirky and fun, and I kind of hoped she would end up with someone who is more interesting, to be honest. James is the cookie-cutter broodtastic vampire love interest that this genre is so famous for. Daughters of Darkness3.5 StarsThis story takes place in a small town, far from the reaches of the Night World. Three sisters, lamia vampires, have left their family behind and traded in patriarchal rule for the freedom of living with their Aunt amongst the humans. However when they get to town they find their Aunt has been staked and left in the basement, maybe this safe little human town isn’t so safe after all. I enjoy the whodunit aspect of this story quite a bit and also the introduction to a new species of the Night World. It’s relatively light, and definitely easy to guess what is going on here but still fun to watch the characters stumble around each other. My biggest complaint is that my favourite character in Secret Vampire becomes a big chump – thank you, soul mate principle – in this one. I think that could have been handled in a better way, with him retaining his personality (at least for most of the story) and not doing a 180* the second he meets his soulmate. Suuuuure, it does. Spellbinder3 StarsIt this story we meet up with Blaise and Thea, cousins who were raised like sisters. Hellewise women, WITCHES. As far as stories go this is interesting in a vague way but doesn’t really provide all too much new information. In this story my favourite characters are human, Eric and his sister Roz. I found Thea relatively boring, and Blaise more of an evil (or dark-witch) caricature than an actual character. She’s compared to Aphrodite a number of times, which is relatively valid I suppose, but there isn’t really any other explanation of her. It’s all a bit overdone and unreal to me. I wonder if Smith has any concept of paganism itself or if she is rather trying to create a whole different history for this term too?"}, {"userName": "Adrianna", "userReviewDate": "Jun 17, 2010", "userURL": "http://www.goodreads.com/user/show/1694890-adrianna", "userReview": "GENERAL OVERVIEW\nAt first glance, this book appeared daunting because of its sheer length, 729 pages, and the fact that it's comprised of three novels in one. Once I started reading \"Secret Vampire,\" I discovered that this was going to be a quick and rather boring read. It was similar to Twilight, although it should be noted that the original printing predated Meyer's series. The characters were flat and undeveloped making it difficult to relate to them. The plots of each story were rushed and relationships magically happened. They were simply explained away by the idea of \"love at first sight\" or the fact that everyone was pairing up with their soul mates. The only writing technique that stood out was the connections Smith made to the characters throughout all three stories. Coincidentally enough, they shared familiar blood ties. I couldn't tell if this was employed to transition between the three novels, or if Smith was planning to create a new version of the Night World adapted and changed by this specific family. I guess I will have to read the rest of the series to discover this \"mystery,\" but that will probably not happen since I was so disappointed with the first book. There was no \"wow\" factor to keep me engaged, especially considering all the hype built around the never ending battle of Smith versus Meyer. I'm still considering The Awakening, which I hear is a better reflection of Smith's talents, to give the author another chance. For now, I'm happy to regale eager readers with specific criticisms on each novel before concluding with some final remarks. I have also included separate ratings next to each story to indicate its individual score. The rating attached to this review is for the entire collection of three novels in one book read back to back.\nSECRET VAMPIRE: 1 STAR\n\"Secret Vampire\" is about your everyday family who receives some horrible news--daughter Poppy (also affectionately called Poppet, can't stand either name!) is sick with an incurable cancer (pancreatic). She only has a few days to live, and the news has devastated her family, comprised of Mom, Cliff (step-dad), and twin brother Phillip. The biological father doesn't play a role in the book until the very end. Since this isn't reality, we can pretend that someone can escape cancer by suddenly embracing the vampire lifestyle. She's able to make this decision thanks to the \"secret;\" her best friend James has been hiding it from her since they were little kids (yes, vampires can age in the Night World). Shock! Gasp! No! He's a vampire! Yeah, the title gave that away, right? The rest of the book is about her decision to become a vampire (everything she will leave behind), the transition, and the complications that arise. Amidst all this is the realization that (gasp--another surprise!) James is her soul mate! But can they still love each other despite the strict rules of the Night World? Despite all my sarcasm, James was a more intriguing male character than Edward from Twilight, but admittedly the standard was set really low if you're comparing a male to Edward. The background information that Poppy and James as childhood friends was useful; there's a cute story where Poppy defends James against some bullies. Aw, the vampire needed human protection! The fact that they haven fallen in love makes the most sense than the relationships in the latter stories because of this additional background detail. I also liked the way James handles speaking with his parents, they are not on good terms, Poppy's brother Phillip, who always seems to get in the way, and his cousin, Ash, introduced at the end of the story as a villain. Incidentally enough, Ash is the lead protagonist for the second story, \"Daughters of Darkness.\" Ash also introduces Poppy to some witches who are the main characters in the third story \"Spellbinder.\"My main complaints with this story is its simplistic nature. It was predictable and \"too cute\" for a \"dark,\" paranormal, vampire story. The reason behind Poppy's transformation, the fact that she was sick with cancer, also angered me. Cancer is not something that should be taken lightly, which it was in this case. It was glossed over and simply used as a reason for her to \"switch to the dark side.\" Phillip's character was also weakly developed. He's against the transformation from a moral standpoint, but he quickly changes his tune when faced with the real-life consequence: Poppy's death. It's better that she lives as a \"monster\" than dies as a human. His own struggle to accept the new reality is glossed over in lieu of Poppy's and James' romance.The strengths of this story are their love (I'm not always against the cute stuff), some of the descriptions of the Night World, which will be analyzed in depth on my Lunch reviewing site, and Ash, who is truly the sole redeeming character in this story and the entire collection. In fact, he is the reason I enjoyed the second story the best, especially the unique and different ending. If you are going to read this book, read it because of Ash in \"Daughters of Darkness.\"\nDAUGHTERS OF DARKNESS: 3 STARS\nThis novel starts out with the names of new characters, three vampire sisters Rowan, Kestrel, and Jade (oldest to youngest). Side note: I love their names! Two humans (sister and brother Mary-Lynnette and Mark) are talking about the sisters impending arrival to stay with their Aunt Burdock. Like all the paranormal characters in this book, they are desperately seeking an escape from the restrictive Night World, which incidentally enough doesn't believe in feminism because the girls are expected to agree to arranged marriages and listen to their male elders. Come on! I thought this was a 20th century novel, so why would the Night World have such archaic rules, especially if they consider themselves to be light years beyond human development? As can be expected from the rushed quality of this book, it's glossed over and ignored as a detail that needs no explanation. So, the story is about the women escaping male oppression while their very masculine and chauvinistic brother, who happens to be Ash from \"Secret Vampire,\" is left with the difficult task of convincing them to come home where they belong. Since Mary-Lynette is a feminist, she gets into skirmishes with Ash, some of which are quite physical. In the end, this story had similar themes as the first one: 1) soul mate principal 2) vampire reveals 3) death 4) destruction 5) a little bit of a mystery 6) and...believe it or not...a werewolf. The only thing missing was the kitchen sink.The weaknesses of this book singles on the idea of the soul mate principle, which is just another way of saying \"love at first sight.\" My main contention is that the love is not described accurately enough for the relationships to feel believable. Romeo and Juliet fell in love at first sight and are star-crossed lovers. They are believable. Most of the relationships in this collection of stories are too pedantic. Specifically in \"Daughters of Darkness,\" there are two characters who get together (not who you are probably thinking of) that are a constant annoyance throughout the entire tale. It feels more like puppy love and less like true love. It was nauseating, and I wanted to skip the pages that contained their interactions.This novel actually had quite a few strengths, and it is the shining star of the collection. If you are going to read this book, do it purely because of this story. The interactions between the females and the males are priceless, like a children's or young adult's take on \"feminism.\" I enjoyed that the story focused around women, but that there were quirky male presences to offer good character interaction and conflict. The mystery was surprising and actually difficult to fathom despite some of the clues. Best of all, the ending was a complete surprise. I really love endings with a deeper meaning; this one was about not compromising who you are, not even for love. Though I started the book loving Ash (and still ended it loving him), the characters that are the real heroes and who stand out the most are the female ones. \nSPELLBINDER: 2 STARS\nThe final story, \"Spellbinder,\" was my second favorite one purely because the ending was a bit surprising, at least more so than \"Secret Vampire.\" It's about two very different witches, one \"light\" and one \"dark,\" loosing these terms lightly (concept idea reminds me of Something Wicked This Way Comes). Thea is the \"good\" witch while her cousin Blaise is the \"bad\" witch; we were introduced to them by Ash in \"Secret Vampire.\" The girls have just been expelled from high school again, thanks to Blaise and her \"bad magic.\" They are now banished to live with Gran, who is one of the most powerful witches and teachers in the area. If they get expelled again, well, the punishment is being locked in a convent with Aunt Ursula, a fate worse than death itself. The rest of the story is about Blaise's shenanigans as an attention starved witch. She must be noticed by men. She must use them. She's all about sexual prowess. She's used to getting her way and enjoys the thrill of breaking the men she \"dates.\" In fact, it sounds like she might have gotten some boys killed in the past. She's not upset about this fact because she sees humans as vermin. Their only purpose is to serve those in the Night World, and sometimes you lose servants. Obviously, Thea disagrees with her cousin, or else there wouldn't be much of a story. She believes all life is cherished and special. She's a healer. She can speak with animals, and she is about to meet her soul mate. Can you guess whether he will be a human or someone from the Night World? Ding, ding, ding! You are correct, dear reader! Needless to say, once Blaise realizes that Thea wants a man, well, she gets jealous and tries everything she can to steal him away. So, this book is about two women fighting over one man. It's a little sickening and trite, especially because Thea is such a pushover. I was very frustrated by her character because she constantly lets her cousin get away with anything and takes the blame right purely because they are like sisters (they were raised together from a young age). It's not until the end of the story that Thea begins to fight back and fight dirty; of course it all goes haywire and causes more problems rather than fixing any.The weaknesses of this story are the premise (age old story of two girls fighting over one man), the truly despicable and almost unredeemable character of Blaise (you should see what she did to Randy Marik!), and the rather docile character of Thea, who doesn't get any spunk until the last couple of chapters when she's trying to right all the wrongs she's caused.Strengths of the story include Rosamund, or Roz, the spunky, feminist younger sister of love interest Eric. She's simply fascinating because she is such an extreme and unlikely feminist. At one point she tries to change her identity to \"Fred\" because she believes the world is unfair to women. That's when Thea tells an interesting story about a girl called Hellewise (modeled from Thea's character) and a vampire called Maya (modeled from Blaise's character). The entire exchange is the most fascinating part of the story, and it will be explored in more depth on my Lunch reviewing site. The final engaging portion is the ending, some of which was guessed and other parts which are a surprise, especially the shift in Blaise's character. It was a nice reminder that no person or creature is ever truly evil in this world, maybe misguided or blind to the truth but not evil.\nGENERAL OVERVIEW CONTINUED\nOverall, these three stories rate higher than the portions I've read from Stephenie Meyer purely because of the emphasis on strong female roles and feminist themes. In two of these three stories, the women don't need to be rescued by the male characters. They are capable of fighting their own battles, and in fact, help the men out. There are situations where they fight as equals, such as in \"Spellbinder,\" or cases where the females dominate the action, as in \"Daughters of Darkness.\" There was also more development of the interconnectedness of the paranormal universe of the Night World, especially the story about Hellewise and Maya, which explains the birth of vampires and the history of witches. The most disappointing aspects that colored my reading of the volume were the promises that were never delivered. On the very first teaser page, it's stated that \"The Night World...love has never been so dangerous.\" Love was not very dangerous in these stories. In fact, it was the magic that was dangerous. Later on in this teaser description, it states: \"The laws of the Night World are very clear: humans must never learn that Night World exists. And members of Night World must never fall in love with a human. Violate the laws and the consequences are terrifying.\" Liar! There were no terrifying consequences. In fact, in two of the stories, the elders never learned that the younger members of the Night World were breaking this forbidden law. So, there are no consequences. It's all about teens getting away with their hooligan activities. In \"Spellbinder,\" where the adults discover that the Night World rule has been broken, they condone the engagement, to some degree, and encourage the member of the Night World to break free from the constrictive older traditions. Only then can she create a Night World where humans can participate and learn about their cultures, especially if they are in love with said member of the Night World. Talk about a cope out! The adults are too lazy to create this version of a better and more equal society, so they throw it on the young and unprepared teenager? I guess they want to stay under the radar or leave the work to the next generation. It's never explained why more members of the Night World won't join in this endeavor. If you are a parent wondering if this book is suitable for your youngster, I would say it depends on their age and what type of message you want to send to your child. I do think that anyone could read this book because the writing is simplistic enough to follow. However, I suggest older teens read the last story \"Spellbinder\" because of Blaise's actions toward men. \"Secret Vampire\" and \"Daughters of Darkness\" are suitable for a middle school audience.Personally, if you are torn between reading this book or not, I recommend passing it up. I'm sure there are better books out there with similar themes. If you are still intrigued enough or want to make a comparison with Stephenie Meyer, I recommend reading either \"Daughters of Darkness\" or \"Spellbinder.\" The \"Secret Vampire\" is really a waste of valuable reading time."}, {"userName": "Tatiana", "userReviewDate": "Apr 24, 2009", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "\"Night World\" is basically a series of short paranormal romance stories for young adults. The premise here is that there are Night People (vampires, witches, werewolves) who live among regular humans and who are prohibited from disclosing any information about the secret world or fall in love with mortals. Each story in the series is about a supernatural creature falling in love with a regular person.The first story \"Secret Vampire\" is centered around Poppy, who just found out she has a terminal form of cancer and has weeks to live. The only way for her to continue her existence is to be turned a vampire, and accidentally her long-time best friend and crush James is a vampire who could help her out. It's a nice story, with quite a morbid air about it due to scenes of death, funeral, grave digging, etc.\"Daughters of Darkness\" is a kind of a mystery which follows 3 vampire sisters arriving to a small town. Their vampire aunt is recently killed, and a series of equally disturbing events follows. Human sister and brother Mark and Mary-Lynnette get accidentally involved in the whole ordeal. They discover the true nature of their strange neighbors and to add to it, Mary-Lynnette finds out that she is a soulmate of the sisters' arrogant brother Ash and can't do anything about it. This story is more light-hearted and Ash has some great lines here. The last story in the book \"Spellbinder\" is about two witch cousins. When her cousin Blaise, a witch of the black arts, sets her sights on star athlete Eric, white witch Thea casts a spell on the young man to protect him and falls in love despite the rules that forbid their relationship. A lot of witchcraft and spells is in this book which I liked quite a bit.By current YA standards L.J. Smith's books seem almost juvenile. There is no sex, no drugs, or any gruesome violence, but I like her stories anyway. She knows how to develop her characters, her stories are imaginative and romance scenes are very sweet and touching in an innocent way. I still think that Smith's \"Dark Visions\" and \"The Forbidden Game\" trilogies are better, but these \"Night World\" are nicely done too and I will definitely continue on with the series.Reading challenge: #14, 1 of 4"}, {"userName": "J", "userReviewDate": "Jul 09, 2010", "userURL": "http://www.goodreads.com/user/show/3897189-j", "userReview": "I can hardly believe alot of the reviews I have been reading...You have three stories which are tied together loosely. Each story has basically the same and the plot line, which is the point, but then they are never expounded upon. You would need less than ten pages, per story line, to tell each of the three stories that were told...the rest was ridiculous and repetitive to the point of being ludicrous. I am sorry that I always finish what I begin to read in this instance...but I stopped right there and haven't bothered to wonder what the titles are to the rest in this series."}, {"userName": "Emily", "userReviewDate": "Jan 17, 2009", "userURL": "http://www.goodreads.com/user/show/1095171-emily", "userReview": "Love, love, love this book!! It good be because I enjoyed it so much 12 years ago, but I think it still holds up. Within this book, my favorite story is Daughter of Darkness. I just hope that L.J. Smith is finally able to publish the last book in the series. I've been waiting soooo long to finally find out what happens."}, {"userName": "Jen", "userReviewDate": "Jan 25, 2009", "userURL": "http://www.goodreads.com/user/show/124360-jen", "userReview": "This is catalogued in our library as a mystery. Why? I have no idea. It is really not a mystery series at all. That said-I really liked this series. These are reprints and were highly recommended in an issue of Booklist. There are Werewolves, vampires, and witches that all live in the secret society of the Night World. Humans are not just the enemy, but are considered vermin. Each book seems to pick up a different story line about the world. It was odd, but I think Stephanie Meyer has to have read this series at some point. There is the idea in the series that everyone has a soulmate. IT really really reminded of the whole idea of imprinting in the Twilight series. It is the same theme of undeniable love whether you want it to be like that or not. The concept itself is nothing new whatever you call it, but it was the way in which it was described that made me think there were a lot of similarities. Or maybe not."}, {"userName": "Gladys", "userReviewDate": "Aug 11, 2011", "userURL": "http://www.goodreads.com/user/show/5675635-gladys", "userReview": "It's just one of those books that you don't really love but will keep reading the sequels because you're curious to see what happens.The first section/book was alright. Although the relationship between Poppy and James wasn’t anything I haven’t read before, it was still cute. The events seemed predictable and the story line went by in a flash. I felt like there wasn’t even a climax in there. Daughters of Darkness was better and my favorite. Particularly because of Ash. He made it bearable. I really liked Mary-Lynnette, though. Even if she was stubborn and at time you feel like slapping her, her actions are funny. The last one, Spellbinder, I liked, too. It was better than Secret Vampire and it was nice to take a break from all the Vamps stuff. Overall, the entire book was a good read. There was nothing special about it, besides, Ash, in my opinion, but it wasn’t as horrible enough to haul it across a room. I’m kind of in the middle with this one. I will, though, want to read the next books because it left me curious. I wanted to know more. If you like simple reads about supernatural/forbidden love then you’ll probably like this one. It isn’t amazing, wow factor but it’s good enough to like and continue reading.What I liked: Ash Redfern. Why am I going to lie? His character kept me going through the book(s). I really enjoyed him. (If you read this book, you’ll see what I mean.) Another thing that I liked was that all the character from all three books seems to connected somehow. Most of them were either mentioned or did cameos in the first book only to later have the 2nd or 3rd book centered around them. What I didn’t like: The story lines were too short for my taste. It made it a very fast read, though, which can be a good thing. Also, a lot of cliches were involved with the Vampires but, at least, there was no sparkling going on so that was good.Comments: There are, I think, two more volumes (books) following this one. I haven’t read them yet but I will. Like I said, the books are not horrible or special, but it definitely keeps you wanting a bit more."}, {"userName": "Rachel (The Rest Is Still Unwritten)", "userReviewDate": "Jun 13, 2009", "userURL": "http://www.goodreads.com/user/show/2406353-rachel-the-rest-is-still-unwritten", "userReview": "I really liked this book. I love paranormal romance and definatly reccomend it. My fave story was the second, Ash had me cracking up and i loved how his relationship with Mary-Lynnette changed. Oh, and i really liked Poppy in the first story :}"}, {"userName": "Sarah Marie", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/6515737-sarah-marie", "userReview": "Night World Volume 1 by L.J. SmithFirst, second, and third in the Night World series4 starsNight World is a collection of the first three novels into an omnibus. Vampires, werewolves, witches, shapeshifters- live among us without our knowing. Their world is known as the Night World, a secret society with strict rules. The number one rule is falling in love with humans and the consequences for breaking this rule can mean death. Secret Vampire is the first novel and is about Poppy who discovers that she has a very rare form of cancer and that she will die soon. Her best friend, James, is a vampire and he’ll do anything to save her. The second novel is Daughters of Darkness. Mary Lynette meets three very odd girls at her neighbor’s house who turn out to be vampires. Then their brother, Ash, comes to town to bring them back home and she has an attraction that she wish wasn’t there to him. The third novel is Spellbinder, which is about Thea and Blaise two cousins who are very different from each other. When they transfer to a new school Thea is attracted to Eric and Blaise wants to toy with him like every other boy. There’s something about Smith’s writing that captivates me. It sucks me in and I finish this huge collection in a day or two because it’s just so good. Her writing and storytelling just traps me and puts me under a spell that not very many writers can do. If you don’t know who Smith is I’m convinced you live under a rock or just don’t watch TV. Her show and series, The Vampire Diaries, is a big hit in the US. I have to admit I don’t see why the Vampire Diaries is a show when it’s obvious that Night World is a hundred times better. My favorite novel would have to be Daughters of Darkness. I’m going to break down each book and my thoughts on it.Book One- Secret Vampire*Read summary above if forgotten what it’s about*The main female character is Poppy. Poppy was a normal teenager and I immediately found her easy to relate to. I think she was very brave for what she went through. Her actions at the end made me think of her as an idiot, but she’s impulsive. It’s part of her personality, so it made her actions understandable, but I still think it was an idiotic move. Kick-Butt Heroine Scale: 4The main male character is James. I like James, but I didn’t love him. James is a character that was likeable, but didn’t really elicit very much emotion from. I liked him a lot, but I didn’t love him and he’s not my favorite male character in the collection of stories.Swoon Worthy Scale: 4The Villain- Ash… ;) He’s not a “bad” villain, but he’s an entertaining one and it doesn’t hurt that I think he’s awesome.Villain Scale: 3.5Poppy’s twin brother, Phil, is a huge character in this book. I appreciated their relationship and loved how protective he was of her. It’s nice to read about a relationship between brother and sister that seemed real.Character Scale: 4Final Thoughts: I liked Secret Vampire a lot, but I wish it would’ve been longer.Book Two- Daughters of Darkness*Read summary above if forgotten*The main female character is Mary Lynette. I liked Mary Lynette. It took me a little bit longer to connect with her than it did with Poppy, but I thought she was a great character. Kick-Butt Heroine Scale: 3.75The main male character is Ash. Yes the Ash from Secret Vampire. I really like Ash and I think he’s awesome. He can be a jerk, but at least admits to it and doesn’t sugar coat anything. I liked reading Ash’s POVs more than Mary Lynette’s.Swoon Worthy Scale: 4.75The Villain- I decided to leave that one a secret… and only the people who’ve read it know.Villain Scale: 3.5There were a lot more characters in this novel than in Secret Vampire. There were Ash’s sisters, Jade, Rowan, and Kestrel. Jade was the most prominent of the sisters and I felt that the other sisters should have gotten more of a chance to shine. Then there was Mary Lynette’s brother, Mark. Mark was a cool little brother, but I didn’t understand why he and Jade were a couple it seemed kind of thrown in. Character Scale: 4.25Final Thoughts: That ending! I need more of Ash and Mary Lynette. That ending was totally unfair, but also a really good one. The characters were a little lacking, but everything else was perfect.Book Three- Spellbinder*Look above for summary if forgotten*The main female character is Thea. Thea was a good character, but she wasn’t really anything special. I didn’t connect to her and she didn’t feel real to me.Kick-Butt Heroine Scale: 2.5The main male character is Eric. I honestly didn’t see why Thea and Blaise were fighting over Eric. He was honestly nothing special. He was as bland as unbuttered toast. I didn’t feel anything while reading about him and I could care less about his relationship with Thea.Swoon Worthy Scale: 1.5The Villain- Blaise could be considered the villain, but I liked her more than Thea. I feel like the book would’ve been more interesting with alternating POVs between Thea and Blaise. Villain Scale: 2.5Character Scale: 2.25Final Thoughts: This book lacked and I have a lot of problems with it. The characters weren’t good and didn’t do anything for me. The witchcraft wasn’t really well mentioned and just seemed thrown in because it’s supposed to be paranormal. The romance sucked, but the ending was actually good and the only redeeming quality Spellbinder had to offer.You’re probably wondering why give this book 5 stars if you didn’t like Spellbinder? I’m giving this book five stars because even though Spellbinder sucked I still enjoyed Secret Vampire and Daughters of Darkness. I also somewhat enjoyed Spellbinder. Mostly I’m giving it five stars instead of 4.5 because of Smith’s writing.Cover Thoughts: I like the cover it’s simple and I don’t know why but I really like it."}, {"userName": "Kate", "userReviewDate": "Dec 01, 2008", "userURL": "http://www.goodreads.com/user/show/104823-kate", "userReview": "I got this free e-book from Simon & Schuster--apparently to tie in with Twilight's popularity, they are re-releasing this Night World series that was originally published around 1997 (I had read L.J. Smith's Vampire Diaries series back in the day, but not this series). You could tell where car models had been updated as well as computer technology and the usage of \"cellular telephones\"), but the plot was exciting enough.One thing that completely fascinated me about this book: the music. Was the genre Ethnotechno, or was that just a band name? Here are some descriptions: \"madcore stomping music from England,\" \"a Dutch club song\" (which is \"fine for doing the Netherlands skippy dance to\"), \"a velvety Portuguese lament,\" \"plaintive Bantu wailings,\" and \"the strange rhythms of Burundi drumming.\" Whaaaat? I may just have to download some of this, just to comprehend what madness is lurking here."}, {"userName": "Tracy", "userReviewDate": "Dec 18, 2008", "userURL": "http://www.goodreads.com/user/show/74794-tracy", "userReview": "Ok, this is 3 books in one and the stars are averaged out. It's YA Vampire/Werewolf/Witch novels, so you know, good stuff. I couldn't stand Poppy in the first one, she annoyed me from the very first mention of her. Her twin Phil is the only reason I kept reading, because she is ANNOYING. The other books were better - MaryLynn was awesome, and while I thought the ending was a little rushed, I appreciated the characters a lot more.The third book was the most balanced in terms of story, and characters I could empathize with on 90% of the level. And so I'm looking forward to how it will be dealt with in the other books which, sadly, are not available on Kindle yet so who knows when I'll read 'em!"}, {"userName": "Elizabeth", "userReviewDate": "Nov 18, 2008", "userURL": "http://www.goodreads.com/user/show/1730850-elizabeth", "userReview": "This first \"Nightworld\" release has the first three novels: \"Secret Vampire\", \"Daughters of Darkness\", and \"Spellbinder\". They introduce us to the Nightworld, a secret society of supernaturals who live alongside humans--many harboring the idea of humans as inferior creatures. The Nightworld has 2 rules which, once broken, are a death sentence: never tell a human about the Nightworld, and never fall in love with a human. But the soulmate principle has come into effect and many Nightworld beings are discovering that their destined true loves are humans. These books are about what happens when the rules are broken. \"Secret Vampire\" tells the story of James and Poppy, best friends since childhood and partners in crime. Of course, Poppy doesn't know that James is a vampire until she finds out she's dying of terminal cancer and he reveals the only way of saving her is to turn her. Once done, Poppy is thrown into the realm of the Nightworld and understands that James has just sacrificed everything to save her. And now the both of them are in danger of being hunted and killed by Nighworld authorities. (I have to say that this is my favorite story out of all three.)\"Daughters of Darkness\" is about three vampire sisters (The Redferns--Rowan, Kestrel and Jade) who flee the Nightworld to live among humans. Once they reach Briar Creek, Oregon, they discover their aunt has been mysteriously staked by someone who obviously knew she was a vampire. They befriend Mary-Lynnette and her brother Mark, two humans who discover their identities quite by accident. Since Mary-Lynnette and Mark are humans, they are now in danger of being killed by the Nightworld. Of course, the Redfern sisters' brother Ash is hunting down Rowan, Kestrel and Jade with the single minded plan of getting them to return home where \"everyone misses them violently\". The sisters know that if he discovers Mark and Mary-Lynnette know the truth, he'll kill them on the spot. Ash is notoriously malicious, and as stated by Jade, \"He HATES humans.\" Imagine Mary-Lynnette's surprise (and Ash's too, for that matter) when she discovers she and Ash are soulmates, and despite their differences they can't seem to stay away from each other. \"Spellbinder\" is the third book in the edition. Thea and Blaise Harman are sisters and witches. Blaise is a \"bad\" witch, and--well--imagine a teenager. And then imagine a teenager with enough power to control the people around her with little moral interruption and you have Blaise. She destroys the lives of human men by getting them to fall in love with her through various spells and then tossing them away when she tires of them. Her sister Thea could probably be described as a \"not so bad\" witch, holding contempt for humans but has a naturally gentle disposition which compels her to help them nonetheless. When helping heal a human from a snake bite, Thea realizes that Eric is her soulmate and tries her damndest to stay away from him. That is, until Blaise becomes determined to control Eric. Thea knows what happens to the men Blaise controls and can't help herself when she decides to throw caution to the wind and fight her own sister to protect her soulmate. Good book. If you enjoy anything to do with the supernatural this is the book for you."}, {"userName": "Bex", "userReviewDate": "Mar 08, 2010", "userURL": "http://www.goodreads.com/user/show/3283584-bex", "userReview": "\"Night World\" is basically a series of short paranormal romance stories for young adults. The premise here is that there are Night People (vampires, witches, werewolves) who live among regular humans and who are prohibited from disclosing any information about the secret world or fall in love with mortals. Each story in the series is about a supernatural creature falling in love with a regular person. The first story \"Secret Vampire\" is centered around Poppy, who just found out she has a terminal form of cancer and has weeks to live. The only way for her to continue her existence is to be turned a vampire, and accidentally her long-time best friend and crush James is a vampire who could help her out. It's a nice story, with quite a morbid air about it due to scenes of death, funeral, grave digging, etc. \"Daughters of Darkness\" is a kind of a mystery which follows 3 vampire sisters arriving to a small town. Their vampire aunt is recently killed, and a series of equally disturbing events follows. Human sister and brother Mark and Mary-Lynnette get accidentally involved in the whole ordeal. They discover the true nature of their strange neighbors and to add to it, Mary-Lynnette finds out that she is a soulmate of the sisters' arrogant brother Ash and can't do anything about it. This story is more light-hearted and Ash has some great lines here. The last story in the book \"Spellbinder\" is about two witch cousins. When her cousin Blaise, a witch of the black arts, sets her sights on star athlete Eric, white witch Thea casts a spell on the young man to protect him and falls in love despite the rules that forbid their relationship. A lot of witchcraft and spells is in this book which I liked quite a bit. By current YA standards L.J. Smith's books seem almost juvenile. There is no sex, no drugs, or any gruesome violence, but I like her stories anyway. She knows how to develop her characters, her stories are imaginative and romance scenes are very sweet and touching in an innocent way. I still think that Smith's \"Dark Visions\" and \"The Forbidden Game\" trilogies are better, but these \"Night World\" are nicely done too and I will definitely continue on with the series."}, {"userName": "Jenn", "userReviewDate": "Dec 12, 2010", "userURL": "http://www.goodreads.com/user/show/1758041-jenn", "userReview": "Ug. I bought these quite a while back. The Vampire Diaries tv show was just starting up and I wanted to give the books a shot. I saw the omnibus of the first three of these books by the same author at the grocery store one day and picked them up to try. The premise sounded interesting. I stuck it on the shelf and didn't think about it for quite a while. I read the first two Vampire Diaries books and they sucked hard. I wouldn't have tried these except I already owned them. And after the first, I wouldn't have read the next two, but they were in the same book. And they're quick reads. These stories are just awful. They're full of stupid teenagers that have no clue about anything. They're even dumber than most teenagers, making snap decisions that will effect the rest of their lives. Sometimes turning from intense hatred of a person to true love always in the plan of a minute. They're just awful. I don't recommend that anyone reads these. Please. Just don't."}, {"userName": "Xiarog1908", "userReviewDate": "Jan 20, 2009", "userURL": "http://www.goodreads.com/user/show/946222-xiarog1908", "userReview": "this book was definitely something different, but in a good way. It's pretty much three stories about humans, and paranormal creatures breaking the rules, and falling in love, and getting into all sorts of exciting trouble. One thing that i really enjoyed about this book is that it opened me to a new style of supernatural romance. Usuall i read books that are filled with couples that show affection throughout the entire book. And that made me kinda iffy about reading this one after i read the first story since there wasn't a whole bunch of sparks going. But the story plots are awesome and it keeps you interested! And the small bits of romance just compliment it. It's hard to explain... read the book! its awesome!"}, {"userName": "Misty", "userReviewDate": "Aug 09, 2009", "userURL": "http://www.goodreads.com/user/show/1124284-misty", "userReview": "I think I would have liked this as a kid. It reminds me of what I read then (RL Stine, Christopher Pike), and though I haven't reread any of those recently, I feel like Smith's writing is not quite at the level as the other two (not that Stine is necessarily great, though I remember continuing to be impressed with Pike). It was light and fun and utterly predictable, which may be fine when you're twelve, but for not much longer after that. It was often overly simple, in structure and substance. But as it's the first in the series (and as I have an omnibus edition with the first three volumes in it) I will give the others a try and see if they improve. Either way, they are a super quick, couple hour read."}, {"userName": "Merve S.", "userReviewDate": "Sep 04, 2011", "userURL": "http://www.goodreads.com/user/show/4425286-merve-s", "userReview": "Evvet sonunda bitti... Aslında kitabı ilk hikaye dışında beğendim. Ama cidden bazen insanı boğacak şekilde sıkıcılaşabiliyordu. Okuduğuma pişman mıyım? Doğruyu söylemek gerekirse hayır :D Hikayeleri puanlamak gerekirse Gizli Vampire 2, diğer iki hikayeye de 4 verirdim :)) İyiydi yani daha doğrusu Ash çoook iyiydi, keşke bütün kitap onun üzerine yazılı olsaydı :D Bakalım diğer kitaplar nasıl olacak :))"}, {"userName": "Alyssa Hillen", "userReviewDate": "May 06, 2008", "userURL": "http://www.goodreads.com/user/show/1144458-alyssa-hillen", "userReview": "This, in my opinion, is what teen/young adult paranormal romance is supposed to be. L. J. Smith (Vampire Diaries) wrote these books about ten years ago and it shows. The reason they're collected in omnibus format is that they're short: when they were first published, the books were small paperbacks that came in at under 250 pages. I personally would have preferred that to this clunky book, but after years where the books were out of print and impossible to get my hands on, I'll take what I can get.I'm not going to try and dress it up: these are quick reads. I find the characters and their lives interesting, but the plots are pretty straightforward - especially in these early volumes. As the series progresses, more thematic elements present themselves, culminating in a four part finale. But for now: we've got episodic stories about vampires, werewolves and witches. The stories all center on 'forbidden' relationships that the members of the Night World have with humans and the consequences of these forbidden unions.They aren't steamy reads by any means. We're talking about books that first came out long before the Gossip Girl era: ratings wise, you're not going to see anything steamier than a PG-13. What you WILL find, though, is a well established universe where the guidelines are spelled out for you right from the title page:\"The Night World isn't a place. It's all around us. It's a secret society of vampires, werewolves, witches, and other creatures of darkness that live among us. [...] There are only two things [those in the Night World] can't do with [humans]. 1) Never let them find out the Night World exists.2) Never fall in love with one of them.These are stories about what happens when the rules get broken\"Bam: that's really all you need to get into the story. Of course, each story will break it down for you, and Smith is able to feed us exposition in ways that remain interesting even three books in - perhaps because there's a lot to play with in her universe. The premise of three supernatural groups co-existing with humans is simple enough to be digested, but there are enough intricacies and details to keep things interesting as time wears on. In addition to the rules of Night World society (and traditions of each of the groups) you get ideas like Soulmates: two people who are destined to be together - the stuff that makes my inner thirteen-year-old girl squee with delight to read. Cheesy? Yes. But it's fun.I could be biased because I loved these books when I was younger - I have yet to actually read all of Twilight, though I can see why there are comparisons being drawn between Stephenie Meyer and L. J. Smith. Personally, I'm glad Twilight's success has made publishers feel like they can take a chance with some of these books again. But that's beside the point.My point is: I can't accurately compare the two series to tell you which is better. I can tell you that if you're looking for varied stories that are quick to read (we're talking an afternoon, judging on how most of my friends read) with interesting characters, you'll find it here. If you prefer your stories with lots of extra adjectives and filler, I recommend Twilight."}, {"userName": "Lei", "userReviewDate": "Dec 17, 2008", "userURL": "http://www.goodreads.com/user/show/1730311-lei", "userReview": "This book was one of the best books ever written, according to me. It is made up of three different books. The first book, Secret Vampire, was really good. It was mostly about how a girl nicknamed poppy was dying of pancreatic cancer. Her best friend, James, a born vampire turned her into a vampire in order to save her. At first Poppy's twin brother,Phil, didn't like the idea. He convinced Poppy that James was a monster and that she shoukld stay away from him. I really hated him then. I coukldn't believe that he preferred his sister to die insted of becoming a vampire. But at the end of the story he agreed. I found out that Poppy and Phil were witches from their father's side of the family.The second book was Daughters of Darkness. It was good but it was my least favorite. It was about three vampire sisters that escaped from their home to go to live with their grandmother. While their the younger sister fell in love with a human neighbor named Mark. The vampires' brother, Ash, came to take them back. He fell in love with Mark's older sister Mary-Lynette.The last book, Spellbinder, was my favorite of them all. It was about how a witch named Thea fell in love witha human named Eric. Her cousin, Blaise, wanted to make Eric her boy toy. She makes potion so she could seduce them into doing really stupid and dangerous stuff. Once she made a boy burn down a whole school. At the end of the book Blaise tricked the adults into thinking that Thea and Eric forgot everything about magic an the Night World."}, {"userName": "Rachel Thompson", "userReviewDate": "Nov 25, 2008", "userURL": "http://www.goodreads.com/user/show/1631189-rachel-thompson", "userReview": "In Secret Vampire Poppy is diagnosed with terminal cancer soon after summer vacation starts. Her best friend James is a vampire of the Night World. He can save her by making her immortal, breaking the two basic rules of the Night World: don't fall in love with a human, and don't tell a human about the Night World.In Daughters of Darkness three vampire sisters leave their isolated home to live with their aunt in a rural town. Their brother Ash is sent to track them down, but falls in love with their new human friend.In Spellbinder two witches fight over a human boy at their new school, using black and white magic.I read this book after reading the Twilight series and it kind of reminds me of that. The writing is a little simplistic, but it's written for teens. The stories are good enough that the writing style can be overlooked, and it's easy to follow. I really enjoyed watching the different relationships play out. The first two stories deal with vampires, which I'm a big fan of. The third is about witches, and even though I don't really like witch stories, I found this one to be an enjoyable read. The laws of Night World are very strict, and anyone that breaks the laws is sentenced to death. This puts an urgency into the storyline as each character must choose how far their willing to go for true love. I'll definitely be picking up the rest of the Night World series."}, {"userName": "Debbie Lois", "userReviewDate": "May 21, 2010", "userURL": "http://www.goodreads.com/user/show/3493895-debbie-lois", "userReview": "I LIKED this book. Truth is I read the second book first and then I read the third one and this one.None of the stories in this book are great like L.J Smith's other books.In 'Secret Vampire' I liked the plot line but I didn't find James to have much depth and I didn't find him very belivable.Everything else was good but I wish I had gotten a little more from Cliff, the stepdad.Even so this was my favorite story in this book. In 'Daughters of Darkness' not only did every single character seem fake but the plot seemed forced and I couldn't understand a thing.You would think that with such a horrible beginning and middle that the author would put a litttle something in the end. Nope, no such luck,The love interest goes away to'redeem himself' and the she's just watching him leave. Excuse moi? Did I miss something? Anywho, onto 'Spellbinder' I had no real problems with this book it was good but just good.I keep re-reading too see if maybe there were some key points I missed that really gave the stories an oomph. Tough luck."}, {"userName": "Raquel", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/11379453-raquel", "userReview": "I remember going to B&N and seeing this series all the time. I bought Twilight(guilty), among other books, and those books just wouldn't budge from the same shelf as the rest of the supernatural. I decided to give them a try to see what all the fuss was about. The whole never tell a human about you or fall in love with them thing is kinda cool and cheesy. Read the books about 4 years ago and re read them this year just to remember marvelous Ash. He is who kept me going through the series more and more. His character is just so arrogant and mysterious as to his past actions. Love the series. All 9 short books of them. Great job, L. J. Smith.-------------------------------------------------------2016. Still good."}, {"userName": "Heather", "userReviewDate": "Mar 05, 2009", "userURL": "http://www.goodreads.com/user/show/2098381-heather", "userReview": "Secret Vampire was the first book I had read by LJ Smith and with it, began the start of my love affair with her writing. Her characters are enchanting and her stories are vibrant and addicting. The NightWorld series was unlike anything I had ever read and continues to be one of my all time favorite books from childhood."}, {"userName": "Abeer A.", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/43727401-abeer-a", "userReview": "DNFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF"}, {"userName": "Cinda", "userReviewDate": "Jul 21, 2010", "userURL": "http://www.goodreads.com/user/show/1258344-cinda", "userReview": "I liked these predecessors to the Twilight series. It was interesting to see the parallels. The characters here were complex, strong and interesting."}, {"userName": "fleurette", "userReviewDate": "Aug 28, 2012", "userURL": "http://www.goodreads.com/user/show/4692637-fleurette", "userReview": "Didn't finish it. The writing is so poor and the characters are paper-thin. I couldn't get into these stories, so there was no point in reading the whole book. Too immature for my taste."}, {"userName": "Oda Renate", "userReviewDate": "Dec 18, 2013", "userURL": "http://www.goodreads.com/user/show/21223277-oda-renate", "userReview": "Story 1:pretty good, I was posetive surprised. Original,different. Good introduction to night world.story 2: still good and interesting.story 3: meeh..Skimmed this,just meeh..."}], "description": "Includes:Book 1 - Secret VampireBook 2 - Daughters of Darkness Book 3 - Spellbinder Vampires, werewolves, witches, shapeshifters -- they live among us without our knowledge. Night World is their secret society, a secret society with very strict rules. And falling in love breaks all the laws of the Night World.In Secret Vampire, Poppy thought the summer would last forever. Then she was diagnosed with terminal cancer. Now Poppy's only hope for survival is James, her friend and secret love. A vampire in the Night World, James can make Poppy immortal. But first they both must risk everything to go against the laws of Night World.Fugitives from Night World, three vampire sisters leave their isolated home to live among humans in Daughters of Darkness. Their brother, Ash, is sent to bring the girls back, but he falls in love with their beautiful friend.Two witch cousins fight over their high school crush. It's a battle between black magic and white magic in Spellbinder.", "title": "Night World, No. 1\n      \n          (Night World #1-3)", "url": "https://www.goodreads.com/book/show/3099787.Night_World__No__1_Secret_Vampire__Daughters_of_Darkness__Spellbinder__Night_World___1_3__", "average": 4.05, "cover": "https://images.gr-assets.com/books/1434962482l/3099787.jpg", "reviews": 2109, "authors": [{"url": "https://www.goodreads.com/author/show/50873.L_J_Smith", "name": "L.J. Smith"}], "type": ["Young Adult", "Paranormal", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/3099787-night-world-no-1", "http://www.goodreads.com/book/show/12495241-gece-d-nyas-no-1", "http://www.goodreads.com/book/show/395871.The_Awakening_The_Struggle", "http://www.goodreads.com/book/show/7726143-origins", "http://www.goodreads.com/book/show/3575676-night-world-no-3", "http://www.goodreads.com/book/show/2985500-night-world-no-2", "http://www.goodreads.com/book/show/1895792.The_Fury_Dark_Reunion"]}