{"ratings": 59, "userreviews": [{"userName": "Liviu", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/1229019-liviu", "userReview": "like other Inoue novels, a bit dry but this one focusing on the life of Lady Yodo/Chacha - the main later concubine of Taiko (Toyotomi Hideyoshi - the regent of Japan until his death in 1598) and the mother of his heir Hideyori"}, {"userName": "Louise", "userReviewDate": "Apr 18, 2016", "userURL": "http://www.goodreads.com/user/show/53133049-louise", "userReview": "Très bon livre bien détaillé qui relate parfaitement une époque compliquée du Japon. Inoue romance parfaitement un épisode historique du Japon. Il faut, néanmoins, un peu connaitre l'histoire Japonais de la fin du XVIème, début XVIIème siècle pour mieux comprendre et apprécier ce chef d'oeuvre!"}, {"userName": "Diana", "userReviewDate": "Apr 25, 2016", "userURL": "http://www.goodreads.com/user/show/12091145-diana", "userReview": "\"Sublim! Sublim! Sublim!\""}, {"userName": "Ana-Maria", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/23790027-ana-maria", "userReview": "This historic novel describes the life of Yodo-dono who lived in medieval Japan (1567-1615). I knew very little about how many internal fights there were in that time, but also about the Japan-Koreean war, about how many castles were raised and destroied, how complicated the etiquette was among the high class rulers ... how much art and love for the beauty ( cherry blossoms, the light of the moon, the plants in a garden, the poetry) intermingled with sheer cruelty, death for honor, and contol over other’s lives, especially over women’s lives. The most powerful men in Japan would have as many as 30 concubines, and emotionally it was not too easy for them with dealing with their rivals. Their becoming a concubine did not seem as much of a choice, neither were most marriages, arranged for security and political matters. All these create a very interesting society than the one we know, that is very well described in the book. The writing style is sketchy, with a rapid tempo and it manages to focus both on the historical events, as well as on the psycholgy of the characters. Dialogues are rare, and they are usually used during times of high psychological pressure. The most mundane reply, usually hides a very complicated internal process, that is a mixture of etiquette, strategy and self control. The human nature is the same - people are jealous, they love, they hate, they want glory, they seek power; but the japanese society regulates the manifestation of human nature in a very interesting manner, thus the external behaviours are not what we would expect or what we are used to, even compared with the same time frame in the western culture. Overall, a true piece of art and a worthy reading."}, {"userName": "Civisurbi", "userReviewDate": "Dec 17, 2015", "userURL": "http://www.goodreads.com/user/show/14757880-civisurbi", "userReview": "Масштабное художественное произведение с историческое подосновой. Читать вдумчиво."}, {"userName": "Laurence", "userReviewDate": "Sep 10, 2007", "userURL": "http://www.goodreads.com/user/show/335730-laurence", "userReview": "Interesting epic saga of a Japanese woman in the Medieval unifying Japan."}], "description": "Publicat în 1955 în foileton într-un supliment al prestigioasei reviste Bungeishunjū, romanul Nobila doamnă din Yodo (Yodo-dono nikki) este o capodoperă care, îmbinând realismul sever cu lirismul dramatic, surprinde cu acuitate psihologică parcursul spectaculos și totodată tragic al concubinei seniorului Hideyoshi, personaj real, intrat în legendă.Chacha, eroina din Castelul Yodo, a ajuns, din victimă aruncată într-o mizerie lucie, a doua soție a comandantului Hideyoshi, unul dintre cei mai curajoși seniori din Japonia. În ambele ipostaze, ea și-a rămas întotdeauna fidelă sieși, respectând parcă un cod personal al samurailor. Ecranizat în 2007 în regia lui Hajime Hashimoto, romanul vorbește despre Japonia zbuciumată a secolului al XVI-lea, despre bătălii și campanii militare, castele impunătoare și incendii magnifice, dueluri și seppuku, banchete fastuoase, intrigi, trădări și iubiri imposibile – toate zugrăvite de Inoue cu un veritabil talent de pictor care, dincolo de amplele panorame, cu mii de figuranți, așterne pe pânză, cu delicatețe, destine.", "title": "Nobila doamnă din Yodo", "url": "http://www.goodreads.com/book/show/29587462-nobila-doamn-din-yodo", "average": 3.93, "cover": "https://images.gr-assets.com/books/1458638932l/29587462.jpg", "reviews": 6, "authors": [{"url": "https://www.goodreads.com/author/show/117105.Yasushi_Inoue", "name": "Yasushi Inoue"}, {"url": "https://www.goodreads.com/author/show/14243840.Magdalena_Ciub_ncan", "name": "Magdalena Ciubăncan"}], "type": ["Cultural", "Historical", "Classics"], "outlinks": ["http://www.goodreads.com/book/show/29587462-nobila-doamn-din-yodo", "http://www.goodreads.com/book/show/1056558.Le_Ch_teau_de_Yodo", "http://www.goodreads.com/book/show/28233167", "http://www.goodreads.com/book/show/502118.The_Hunting_Gun", "http://www.goodreads.com/book/show/9697687-amore", "http://www.goodreads.com/book/show/8881064-furin-kazan", "http://www.goodreads.com/book/show/2419439.The_Counterfeiter_and_Other_Stories", "http://www.goodreads.com/book/show/8291591-tun-huang"]}