{"ratings": 52, "userreviews": [{"userName": "Julie Ehlers", "userReviewDate": "Jun 06, 2015", "userURL": "http://www.goodreads.com/user/show/2120450-julie-ehlers", "userReview": "I first learned about James Wilcox from a 1994 New Yorker profile about his struggles to support himself solely with his work as a (critically acclaimed) novelist. At the time he’d already published about six novels, none of which I’d even heard of, much less read, but I sought out his first, Modern Baptists, and became completely enamored with it. It’s one of the funniest books I’ve ever read, and over the years I’ve returned to various passages whenever I needed to laugh. I accumulated the other five novels he’d published at the time—some of them came back into print as a result of the article—as well as the three others he subsequently published. And then I didn’t read any of them. Seriously, it’s now been more than twenty years since I first learned of James Wilcox, and until just now, I’d still only read the one novel. I mean, what, did I think I was never going to die or something?But all that has changed, because I have now read two novels by James Wilcox. I was a bit apprehensive when I picked up North Gladiola--could it really live up to the promise implied by Modern Baptists? (In fact, come to think of it, that’s probably the reason I put off reading his other novels for so long.) I am happy to say that this novel, while not the classic Modern Baptists is, more than holds its own. Of course, the two novels are very different; while the first was about the search for happiness of the hapless loser Mr. Pickens, this one is about Ethyl Mae Coco, a middle-aged married mother of six, town busybody, and one of the most repressed Catholics you could ever hope to meet. The novel doesn’t have a plot, exactly—it’s more a sense of ongoingness, as various characters from the small town of Tula Springs come in and out of Ethyl Mae’s life as well as cross paths with each other. (“Altmanesque” was the word that sprang frequently to mind.) Some of the major events of the novel actually happen “off screen”—each new chapter begins by filling us in on what happened in the space between chapters. Surprisingly, the pieces of all of the characters’ lives all fall together at the end, which is quite a feat, and the book is full of patented James Wilcox humor, where all the humorous lines are played totally deadpan and serious, because the characters are being totally serious. All in all, a fantastic, funny read.My only real problem with this book is that I read an edition put out by LSU Press and, while I commend them for publishing this and other Wilcox novels that otherwise would’ve stayed out of print, they seemed to format this book exactly as they would the more scholarly offerings in their catalog—bright white paper and the unfriendliest font imaginable. I literally felt like I was reading an assigned text for a humanities elective. It put a pane of glass between me and the characters that only cracked when I imagined the text as being set in a more traditional trade paperback style—more inviting font and warmer, admittedly not acid-free paper. This enabled me to lose myself in the book a little more, and eventually its formatting ceased to matter. Something to keep in mind, publishers of fiction.I would recommend this book, even in its university press edition, but I would still recommend Modern Baptists more. Given that these are Wilcox’s first two novels, written in his early 30s, I do wonder how his writing has changed (improved?) over the years. Hopefully it won’t take me another 20 years to find out."}, {"userName": "Ronald Wilcox", "userReviewDate": "Jun 22, 2013", "userURL": "http://www.goodreads.com/user/show/14757595-ronald-wilcox", "userReview": "Fun book to read. James Wilcox has a nice satirical, comedic tone to his writing with interesting characters. The setting is Tula Springs, LA, a small town outside of Baton Rouge. Mrs Ethyl Mae Coco has six kids dispersed across the Earth, an amateur string quintet that she plays in and manages, a husband who she has mostly lost interest in, and several others in her life who bring her into funny situations that try her Catholic patience. Not a deep book but a pleasant diversionary reading experience."}], "description": "Ethyl Mae Coco's rambling Victorian home on North Gladiola -- the Main Street of Tula Springs, Louisiana -- is the only residence left at the business end of town, but it's a hotbed for chaotic comedy. Mrs. Coco, aged fifty-seven and feeling somewhat left behind herself, directs her considerable energy into keeping those around her in line -- her remote, obsessively bargain-hunting husband; members of the Pro Arts Quartet chamber music group, which Ethyl Mae aspires to turn into an accomplished cultural jewel; her six unruly grown children, none of whom keeps the Catholic faith to their staunch convert mother's satisfaction; and the other assorted, eccentric, and endearing people of Tula Springs. Nothing is simple -- or quite as gossip portrays it -- in Tula Springs, but after all upheavals and sunders pass, this wired family and community remain strongly connected.", "title": "North Gladiola\n      \n          (Tula Springs)", "url": "http://www.goodreads.com/book/show/266435.North_Gladiola", "average": 3.94, "cover": "https://images.gr-assets.com/books/1348381155l/266435.jpg", "reviews": 2, "authors": [{"url": "https://www.goodreads.com/author/show/81310.James_Wilcox", "name": "James Wilcox"}], "type": ["Fiction"], "outlinks": ["http://www.goodreads.com/book/show/266435.North_Gladiola", "http://www.goodreads.com/book/show/6102045-north-gladiola", "http://www.goodreads.com/book/show/266431.Modern_Baptists", "http://www.goodreads.com/book/show/266444.Polite_Sex", "http://www.goodreads.com/book/show/266437.Sort_of_Rich", "http://www.goodreads.com/book/show/140999.Miss_Undine_s_Living_Room", "http://www.goodreads.com/book/show/968417.Plain_and_Normal"]}