{"ratings": 362727, "userreviews": [{"userName": "Candace", "userReviewDate": "Nov 19, 2016", "userURL": "http://www.goodreads.com/user/show/16384209-candace", "userReview": "See more of my reviews at www.bookaddicthaven.comThe second of the books that we listened to on my recent multi-generational, girls road-trip, was 'Number the Stars'. I could not have chosen better. This story was suspenseful, educational and deeply emotional. With an age range of 5 years-old to 88 years-old in the car, this book managed to hold all of attention.Like most readers, I've read plenty of books set during the WWII era. Some were graphic and shocking in their descriptions of the horrendous acts that took place. Others, like 'Number the Stars' go a far more subtle route, choosing to leave much to your imagination, while providing just enough information so that the reader can figure out exactly what is going on. With two children in the car, subtle and less graphic was an obvious benefit. However, I was amazed by the depth of understanding my 9 year-old had of the story that unfolded. I was incredibly impressed by the way the author was able to craft a story that appealed to such a broad audience. Set in a German-occupied Denmark in WWII, 'Number the Stars' tells the story of a teenaged Annemarie Johansen. She and her family helped rescue her best friend, Ellen Rosen, and her family. The two girls had grown up together. Like their daughters, the parents were best friends also, having been neighbors for years.When the German occupation becomes increasingly hostile, the writing is on the wall for the Jews. The Johansen's are ordinary people that took extraordinary risks to stand against injustice in the only way they knew how. They become active in the resistance movement, helping to smuggle targeted groups of people to safety.I don't want to give too much away, because this is a story that I believe should be read and experienced by everyone. I will say that it was deeply sentimental and thought-provoking. There was plenty of action and suspense to keep you on the edge of your seat, but nothing too terrifying or gory for children. This is the first WWII book that I've read about the Danish resistance movement. I greatly enjoyed learning about the Danish culture and the role that Denmark played in WWII. The stories about the King of Denmark were especially inspiring. Mostly, this story was inspirational. It is about everyday people that do incredibly courageous things when backed into a corner. It is about the strength of the human spirit. This is the kind of book that makes you reevaluate your values and what you consider important in life. Everyone needs a reminder every once in a while, especially as the holidays approach. I loved every minute of this story. It is another one that should probably make the \"mandatory reading\" list for school-aged children, lest we forget the lessons of the past. The audio was fabulous as well. I highly recommend this book to everyone."}, {"userName": "stephanie", "userReviewDate": "Jun 08, 2007", "userURL": "http://www.goodreads.com/user/show/86145-stephanie", "userReview": "i read this in hardback, when it first came out, and i'd say it was probably the reason i became addicted to WWII/holocaust literature/history at such a young age. i think it helped that i was so young when i read this, as imagining a ten year old standing up to nazis was something remarkable, but imaginable for me. i loved annemarie, i identified with her in ways i can't really explain. i read this book again and again, and it never changed. there are scenes burned into my memory: the fake funeral, the ripping of ellen's necklace, annemarie with the special packet, the idea of all the jews packed into uncle henrik's boat. and annemarie running, running fast like she did at school when she beat all the boys, running with a basket and a red cape (only later would i figure out the clever little red riding hood allusion), her blond hair trailing. it also helped that i had great-grandmothers who remembered the war, a swedish au pair who told me about seeing denmark from sweden, and an insatiable curiosity about things like this - so i was looking up things on maps and reading about german shepherds and the \"scent rags\" and. even when it was card-catalogs and old books, i was a cross referencer. i have notes somewhere of my favorite quotes from the book. i also love the ending - because it doesn't condescend. the ending, unlike the book, is ambigious in its ending. we know the war is over, we know annemarie survived - but what does that mean for a little girl, after all?"}, {"userName": "Dem", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "I thoroughly enjoyed this beautifully written Historical Fiction story which I believe was written for children and yet adults may well find it such a worthwhile and enjoyable read as wellThe evacuation of Jews from Nazi-held Denmark is one of the great untold stories of World War II. On September 29, 1943, word got out in Denmark that Jews were to be detained and then sent to the death camps. Within hours the Danish resistance, population and police arranged a small flotilla to herd 7,000 Jews to Sweden. Lois Lowry fictionalizes a true-story account to bring this courageous tale to life. She brings the experience to life through the eyes of 10-year-old Annemarie Johannesen, whose family harbors her best friend, Ellen Rosen, on the eve of the round-up and helps smuggles Ellen's family out of the country. A short book will just enough historical detail to educate a young (and not so young reader) and interesting and likeable characters, I loved the bravery and courage of Danish people and how they looked out for their neighbours. Its a beautiful story full of hope and suspense and I certainly enjoyed every moment. I look forward to reading some Non Fiction books about this time in Denmark's history.I listened to this on audible and at under 3 hours its such a great book to escape with back to a different time."}, {"userName": "Jennifer", "userReviewDate": "Aug 08, 2008", "userURL": "http://www.goodreads.com/user/show/1300229-jennifer", "userReview": "I know- I can't believe I'm just now reading this. What kind of a children's librarian am I?This is a nice little story about a family who smuggles some Jewish friends out of Denmark during the Nazi occupation in 1943. I always avoided reading this because it looked depressing, but it wasn't. It wasn't a light story, but it didn't have the horrible scenes that fill most holocaust books.However, the author's note at the end affected me deeply. I don't know a lot about my Danish heritage- I've always thought it was a sort of boring one. Most people I've known are descended from Danes, or some Scandinavian mix. Other than the Vikings, there's never seemed to be much of interest there. I've always envied my non-Scandinavian friends' more (in my mind) exotic backgrounds.I was amazed to read, though, of the courage and kindness of the Danes during WWII. The afterword spoke of the weeks in 1943 when the Danes smuggled almost their entire Jewish population out of Denmark- nearly 7000 people- to save them from the Nazi death camps. Astonishing. It makes me want to learn more about where I came from."}, {"userName": "Chris Horsefield", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/14058695-chris-horsefield", "userReview": "Lowry doesn't waste a word in NUMBER THE STARS, starting with Annemarie and Ellen's frightening run-in with German soldiers in the opening chapter. In quick strokes, Lowry establishes the setting and characters and foreshadows Annemarie's subsequent encounters with soldiers, each of which increases the tension. The symbol of stars weaves in and out: When the crowd of escaping Jews gathers, they are comforted with the words of Psalm 147: \"O praise the Lord ... he who numbers the stars one by one.\" \"How can anyone number the stars?\" Annemarie wonders.My favorite part of the book is when Ellen and AnneMarie are looking out over the bay and they say that's Swedan over there. The fact that they talk about Swedan shows me that they are hopeful, curious, and anxious.Anyone who is interested in the Holocaust or the lives of Jewish families and their friends should read this book. I think this is a book I will always remember. I would recommend this book to anyone and everyone who is looking for a good read."}, {"userName": "Werner", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/903390-werner", "userReview": "C. S. Lewis famously wrote something to the effect that a children's book so bland and simplistic that it could appeal only to children probably has nothing of much real worth to offer to a child reader, either. He was right; the best and truest (in the sense of Mary E. Wilkins' Freeman's comment that \"All fiction should be true\") stories written for children speak just as profoundly to adults. This book is a powerful illustration of that reality. At 137 pages (counting the Afterword) of fairly large print, it's a quick read, which I blazed though in three days; and the language and diction, while not dumbed down in any sense, is simple enough for readers as young as the 10-year-old protagonist to understand. But the depth of meaning in a story isn't determined by the length of time and verbiage it takes to tell, and the very simplicity of the tale heightens its impact immensely. (It's the perfect length for the effect Lowry wanted to create.) Like all great fiction, it's set in a particular time and place (here, Nazi-occupied Denmark in 1943), and happens to a viewpoint character with particular demographic characteristics --a little girl-- but it leads all of us, of whatever age, gender, and nationality, to identify with her in the universal human issues and experiences that lie behind the particulars.The Holocaust is a subject that's inherently harrowing. Until now, I've avoided Holocaust fiction (and read very little nonfiction devoted to it, except for The Hiding Place: The Triumphant True Story of Corrie Ten Boom), simply because I already know what happened and don't want to drown myself in stark tragedy. This book, however, manages to bring a ray of light into that dark time: it's fictionalized, but it focuses on the real-life rescue of virtually the entire Jewish population of Denmark, smuggled by the Danish Resistance to safety in Sweden. (This isn't a spoiler, since the jacket copy provides that information.) It remains a story that looks human evil full in the face; incidents large and small drive home to the reader the ugliness of the Nazi's treatment of both Jews and Danish Gentiles. And even for readers who've read the jacket, Lowry conjures a palpable atmosphere of gripping tension and danger, especially in Chapters 8-15. But ultimately this is a story of the triumph of the human spirit and of human decency.Lowry's messages are about toleration of differences between people, about cross-cultural and inter-religious friendship, and about the obligation of \"ordinary\" people to find the stuff to be heroes and heroines when circumstances call for it --lived out here in the object lesson, especially, of a small girl who's believably called upon to face enormous danger, in the face of her own fear. (The plot is excellently crafted.).Lowry (1937- ) has twice won the coveted Newbery Award, once for this book. (IMO, that award was well deserved.) She's writing here of events in her own lifetime; but because she's going back to the time when she was an even smaller child than Annemarie here, and lived through World War II in the U.S. rather than in Denmark, she didn't grow up knowing the background of this book, and had to research it much as she would have a historical fiction novel. (The Afterword tells how she came to be inspired with this project, and what aspects of the book are factual --and a LOT of it is.) She did her homework well. I'd recommend this book to readers, young and old, who like World War II historical fiction, as well as general fiction; but really, to every reader. And this late-in-life first introduction to Lowry has definitely whetted my interest in reading more of her work!"}, {"userName": "Presley", "userReviewDate": "Dec 19, 2007", "userURL": "http://www.goodreads.com/user/show/468484-presley", "userReview": "Number the Stars \t\t\t Bantam Doubleday Dell,1989, 152 pp., $5.99Lois Lowery \t\t\t\t ISBN 0-06-447073-3\t“Annemarie looked up, panting, just as she reached the corner. Her laughter stopped. Her heart seemed to skip a beat. ‘Halte!’ the soldier ordered in a stern voice ” (2, Lowery). And so begins Lois Lowery’s Number the Stars. When I first began to read Number the Stars a few years ago, I found that I could hardly get passed page three without dozing off. Recently, I had a friend tell me I should give the book another chance. I decided to give it another go. This time around, I had a very different reaction and I couldn’t put the book down!\tThe story is about a ten-year-old girl living in Copenhagen, Denmark during the Nazi invasion. Young Annemarie Johansen’s life is drastically altered, between her disappearing neighbors, rations on food and Nazi soldiers on every corner. When the invasion in her neighborhood begins to progress and get serious, Annemarie learns that the war is effecting her a lot more than she ever imagined it would. Her best friend’s family, the Rosens, are forced to separate for their safety, and Annemarie learns that when the world you live in needs improvements, bravery is always appreciated, regardless your age. \tAt the beginning of the story, Annemarie seems used to and and accepting of the Nazi soldiers on every corner. By the end of the story she knew that there needed to be change and she would help in any way to make that happen. This included risking her life. \tNumber the Stars is a gripping and moving novel that truly deserves its Newbery Medal. I would definitely recommend It grasps the reader and satisfies them with a suspenseful, sad and hopeful novel."}, {"userName": "Erin ☕ *Proud Book Hoarder*", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/3048260-erin-proud-book-hoarder", "userReview": "I had to read this one to fit a challenge I was taking part in – had to find a book set in Denmark, and my options for that were slim. I’m happy I chose this classic children’s story – it left a positive and lasting impression on many for a good reason. It mainly focuses on Annemarie Johnansen and her parents helping another family during the dreadful Nazi period in 1943. Apparently her uncle is part of an underground support group for Jews in the area as well. Despite it being such a dark period in history, reading about the experiences – especially with people who make a difference – are interesting. The author keeps it relatively short due to the age group, but a full fledged story happens in the 137 pages. The beauty of the title is tied into scripture verses relating to the stars, as the main character sits in wonder and asks herself how it would be possible for someone to be able to number the stars. The drugged handkerchief helping throw off the scents from hunting dogs was a new one by me.The simplistic writing style fits well with children’s fiction but the author has a healthy hand with foreshadowing and putting a lot of hope into the words. Not everything is realistic but that’s not unusual with Historical children’s fiction either. It may inspire blurry eyes a time or two, but it’s not overly depressing - there’s a redeeming hope. It would be a good introduction for children who aren’t quite ready for the excellent but little dryer Diary of Anne Frank or older, more explicit holocaust fiction and non-fiction they may not be fully mentally ready for."}, {"userName": "Nusrat Mahmood", "userReviewDate": "Nov 15, 2016", "userURL": "http://www.goodreads.com/user/show/23589232-nusrat-mahmood", "userReview": "বিকেলে অভ্যাসমতো বারান্দায় বসে ঢুলে ঢুলে পড়ছিলাম! মা এসে কানের কাছে কিছুক্ষণ ঝিঁঝিঁ পোকার ডাক ডাকলো! আমি তো বইয়েই তন্ময়! কানে টান খেয়ে হুশ হলো যখন ততক্ষণে বা কানের লতিটা টকটকে লাল। মুঠোফোনে যে বইও পড়া যায় তা বুঝাতে লাগলো ৩মিনিট, ৪ মিনিটের মাথায় চোখ নষ্ট করছি বলে আবার মাথায় চাঁটি! মন খারাপ নিয়ে বইটা পড়তে শুরু করেছিলাম, শেষ করবার সময়ও কেমন মেদুর মেদুর ভাব! মাতাজির এসমস্ত আদর তাতে যেন গরম ভাতে ঘি! দ্বিতীয় বিশ্বযুদ্ধ নিয়ে যে কোন বই আমার কাছে পোলাওয়ের শেষ পাতে ঘরে পাতা মিষ্টি দইয়ের মতোন! পেলেই লুফে নেই! এই বইটি ভুগাচ্ছিল খুব। মানে আমিই একে ভুগাচ্ছিলাম আর কি। ইচ্ছে করে জমিয়ে রেখেছিলাম। Lois Lowry এর লেখার উপর তো চোখ বন্ধ করে ভরসা করা যায়, তাই মনে হচ্ছিল এ বাবা! পড়লেই তো ফুরিয়ে গেল! তারচেয়ে থাক না আর কিছুদিন! তো হটাত করে হলো কি, মনটা সেদিন বিগড়ে গেল। তো বেগড়বাই ঠিক করতে ভাল মিস্তিরির কাছে তো নিতে হবে, নাকি? ডিজিটাল বুকশেলফ খুলতেই দেখি এ মস্ত ডাক্তার প্রকটমান। আর কি! শুরু করলাম পড়া!দ্বিতীয় বিশ্বযুদ্ধে ডেনিশ লোকদের দিনযাপনের কথাগুলো আগে সেভাবে জানা হয়নি। বেশ লাগে! যত পড়ি, তত নতুন নতুন কত কিছু শিখি! মগজে কতটুকু ধরে রাখতে পারি সে কথা জিজ্ঞেস করে কেউ লজ্জা না দিলে ভাল। কিন্তু পড়বার সময় যেন মুখে কেউ আমিত্তি পুরে দেয়। যুদ্ধের ডামাডোলেও ডেনিশ রাজা যখন দেহরক্ষীর তোয়াক্কা না করে ঘোড়ায় চড়ে রোজ ঘুরতে বের হন মনে হয় আমিও জানালা খুলে একটু দেখি, পারলে নেমে গিয়ে কথা বলে আসি। জার্মান সৈন্যর প্রশ্নের জবাবে ছোট ছেলেটা বলে আমাদের রাজার দেহরক্ষীর দরকার নেই, আমরা পুরো ডেনমার্ক তার দেহরক্ষী- ভিতরটা কেমন যেন সাহসে গরম হয়ে ওঠে! পরিবার গুলোর কষ্ট, পালিয়ে বেড়ানো, ধর্মের- নিজের অস্তিত্তের আড়াল করবার গল্পগুলো কি যে নাড়া দেয়! দুধের উপর পরা সড় ছেকে ছেকে যারা খায় তেমন যেন খুঁজে বের করে আনতে হয়! এই যে মাঝখানে সাগর, অপারে দেখা যায় সুইডেন, জার্মান শাসনমুক্ত সুইডেন, এপারে ডেনমার্ক! দুইদেশের জীবন কত আলাদা না? ধর্ম আলাদা বলে বন্ধুর পরিবারটিকে লুকিয়ে পৌছাতে হবে তাই ঐ ওপারে, যেখানে রাস্তায় হুটহাট থামিয়ে সৈন্যরা নাম জিজ্ঞেস করবেনা। মাঝরাতে ঘরে ঢুকে চুল টেনে বিছানা থেকে নামিয়ে নিয়ে আসবেনা। বিপ্লবীর সিলগালা দিয়ে জনতার সামনে গুলি করে মারবেনা। অ্যানামেরির পরিবার ও তার নিজের যে গল্পটা এই বইতে বলা হয়েছে তা যেন কোথায় গিয়ে বড্ড চেনা ঠেকে! বুঝিয়ে দেয় সব নিঃশেষিত -নিপীড়িত জাতির ইতিহাসে এক জায়গায় না এক জায়গায় মিল থাকবেই। তবে হ্যাঁ! টেক্কা দেবার গল্পগুলো কিন্তু মন ভাল করে। এই যে কুকুরের নাক কে ফাঁকি দেবার জন্য রুমাল মন্তর, বা মিটিঙের জন্য কফিনের জাদু! কে ভেবেছিল যে ভাত কাপড়ে মারার পরেও লোকগুলোর মাথা ঠেকে এত বুদ্ধি বেরোবে। প্রতিটা চরিত্র এত সৎ যে নিজেকে তাদের জায়গায় বসিয়ে ভাবতেও ভয় লাগে। দশ বছরের অ্যানা যখন নিজের সাহসের পারদটা একদম ঠিকভাবে তুলে ধরে ইচ্ছে করে জড়িয়ে ধরে বসে থাকি। তবে কি , বইয়ে খারাপ কিছু ঘটলে শেষে এটাই ভাবতে ভাল লাগে যে ধুর! সব বানানো গপ্প! কিন্তু দুই-তিন প্যারায় যখন দেখি সব সত্যি, এমনকি চলে যাবার আগে পিটারের চিঠিটা পর্যন্ত আবার কেমন যেন মনটা গুমগুম করে। চোখ বন্ধ করলে একটা শীর্ণ হলদে কাগজে আমি কিছু জ্বলজ্বলে শব্দ দেখতে পাই। শব্দগুলো ভীষণ সাহসী!"}, {"userName": "Sarah Grace", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/59507807-sarah-grace", "userReview": "So cute! Not quite what I expected, but still super sweet! <3"}, {"userName": "Mischenko", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/1194517-mischenko", "userReview": "Please visit my blog www.readrantrockandroll.com for reviews on children's books like this regarding the Holocaust and WWIINumber the Stars by Lois Lowry is a book I read years ago. It's historical fiction but highlights the horror of WWII. It's a meaningful story that demonstrates what friends will do for each other when in need. This is an easy chapter book for middle grade students and older. I have recently re-read it as an adult and was captivated once again. 5*****"}, {"userName": "☮Karen", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/1076079-karen", "userReview": "Yes the target audience is young adults but I as an old adult found it an amazing and educational story of the Nazi occupation of Denmark.From the Afterword, a part of a letter written by a young man from the Resistance to his mother, on the eve of his execution:\"You must not dream yourselves back to the times before the war, but the dream for you all, young and old, must be to create an ideal of human decency, and not a narrow-minded and prejudice one.\"I'm all for human decency, anytime, anywhere."}, {"userName": "Allison Tebo", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/60149806-allison-tebo", "userReview": "A delicately written and touchingly poignant book. Several moments made my eyes well-up (how I loved that dear Papa!). As usual, a child’s viewpoint is one of the most gripping and beautiful ways to tell a story set in WW2 as we are gaze with the bland honesty and persistent spirit of youth at something unthinkable. This combined with the writing style creates a deeply resonating story of heroism and the reality of being normal in a world gone mad. This is a story of ordinary people doing extraordinary things – and that is a story that never grows old, and should never stop being told. Content: A few swear words. Some intense content regarding the Nazi regime (including how they ran over a young girl with a car). The author implies that world peace and universal human decency is possible."}, {"userName": "Adam ", "userReviewDate": "Oct 18, 2007", "userURL": "http://www.goodreads.com/user/show/558058-adam", "userReview": "Is it just me, or do most books about Jewish girls during World War II suck? I'm serious, it's like this book and \"Summer of my German Soldier\" were written with the same purpose in mind: educate students about the Holocaust in just about the most boring way possible. Thank God there's the History Channel, or else my generation would've have thought the Holocaust as if it were simply a story about little girls and their twisted lives. I'm probably overexaggerating a bit, but ut's the best way I can think to describe this book. How it ever won the Newberry Medal is beyond me. C'mon, the freaking climax of the book is when the main characher (Annemarie) skips through the forest, pretending to be Little Red Riding Hood. Yea, I go through 100-something pages to reach that. Yea, I'd like my money and my time back, please? Don't ever read this book.EDIT: How did this book get an award? It must have been a slow year the year it won."}, {"userName": "Lisa Vegan", "userReviewDate": "May 13, 2007", "userURL": "http://www.goodreads.com/user/show/83445-lisa-vegan", "userReview": "This is a safe, easy way for children to be introduced to a little of what happened during the holocaust. When I was growing up, one of my mother’s friends was from Denmark (she traveled back there once a year), and she was very proud of how her homeland had behaved during World War II. I really enjoyed this book and thought of Edna while reading it."}, {"userName": "Paige  Bookdragon", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/15550986-paige-bookdragon", "userReview": "I rarely read classic books nowadays. Seeing as my mom's idea of educational learning was to shove classic books down my throat (note: The first novel I finished reading was The Complete Sherlock Holmes and I was fucking eight years old) I have to say that it's understandable if I steer clear of classics for awhile.The last classic novel I've read is this book. Mom is devious. She wrapped this little shit with a vintage wrapper, stashed it under my bed and asked me to clean my room because it resembles a pigsty. Of course, dutiful daughter that I am (ha!), I cleaned my room. While during the said activity, I saw something under my bed. (Guess what it is.) Our house is an old ancestral house and there's a lot of thing's I haven't seen yet at that house at the age of ten.So gullible me took the wrapped parcel and opened it. And lo and behold! It is a book! An old book with yellow crisp pages! I love old things and when you combine  old + books  you get a curious girl. So  voila!  I read it and loved it and reread it again and I was hooked.Mom was happy.Dad is happy because Mom is happy. I was happy.The cat is happy because I was happy and the book is now missing because someone took it from my shelf.Happy ending."}, {"userName": "Lilia", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/29189886-lilia", "userReview": "Five glorious stars! This book was incredible!!! Lois Lowry did an excellent job of writing a WWII book and make it for a younger audience! But honestly anyone can enjoy it! Just the themes throughout this book and diversity is beautiful! Lois Lowry is probably one of my new favorite authors cause I enjoyed The Giver and I enjoyed this, so I'm bound to enjoy other books by her!"}, {"userName": "Duane", "userReviewDate": "Jul 07, 2015", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "4.5 stars for this jewel. One reason I enjoy historical fiction is the educational aspect; learning about something for the first time. This is not your typical WWII/Holocaust book. This one tells the story of how the Danish people, after their small country was invaded by Germany, smuggled nearly the entire population of Jews (7,000) across the sea to Sweden, saving them from deportation and almost certain death.The story is told through the eyes of 10 year old Annemarie Johansen, and how her family participated in the hiding and smuggling of the Jewish people, and their involvement in the Danish Resistance. Well done Lois Lowry. Winning the 1990 Newberry Medal for outstanding children's literature was well deserved."}, {"userName": "Pooja", "userReviewDate": "Nov 19, 2015", "userURL": "http://www.goodreads.com/user/show/30059190-pooja", "userReview": "I guess I am destined to love all the books with the concept of WW-I and WW-II.The story gave insights of how people lived in Denmark in back those days. With simple language, the author is succeeded in making beginners about WWs understand what was the scenario back then. The idea of drugged handkerchief was new to me.The German were so desperate to catch Jews that they brought hunting dogs into the picture, 'who could find out a person by smelling a dried fish'. So this drug was made of rabbit's blood and cocaine, the dogs used to get attracted to blood and with the cocaine's smell they'd loose their sense of smelling and couldn't find the suspected person. Wasn't it cool to know!!The way the protagonist of this book Annemarie Johansen, tells stories and her bravery makes one think to become brave himself too."}, {"userName": "Katelyn Buxton", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/60768204-katelyn-buxton", "userReview": "There was something so... sweet and innocent about the tone of this book, even in the midst of the terrible things going on all around Annemarie, the 10-year-old protagonist. I suppose a lot of that comes from her age, and the fact that this was written for children, but as I read it I felt that I would have absolutely loved this when I was younger. (As it is, I still found it highly enjoyable)!One thing I loved was the fact that the story takes place in Denmark. I honestly knew next to nothing about Nazis outside of Germany, so I actually learned a lot by reading this.Also, I felt as if I was stepping right into Annemarie's world. All the little bits were there—all the little things that bring color to the world in your imagination. The scenery, the characters, family history, names of cities and streets, small phrases in German, the food (or lack of), the fact that electricity was rationed... and I found the backstory of Lise and Peter, and Peter's ultimate fate, to be sweet in the saddest way. And also, can we just talk about Annemarie's little sister Kirsti for a minute?? That child was something else. xD She added a certain spice to the book that I enjoyed. I also liked seeing the Danes band together and help their Jewish neighbors at risk of great personal cost, as well as learning more about the role Sweden played. I may be a little biased, but I found myself thinking, \"Aw yeah!\" whenever Sweden helped out. (I'm 1/8th Swedish).The only reason I didn't give it five stars (and this might sound petty), was the fact that it didn't quite swallow me up the way good books usually do. I enjoyed reading it, 100%—I learned a lot, and was really invested in the characters' lives by the end—there was just a certain something missing in that department.The final verdict: I was super excited to find this book in Goodwill one day, and I was not disappointed!"}, {"userName": "Mulligan", "userReviewDate": "Aug 16, 2008", "userURL": "http://www.goodreads.com/user/show/1431592-mulligan", "userReview": "Number the Stars by Lois Lowry takes place in Denmark during World War II and the Holocaust. The story begins with an introduction to the cruelty of German soldiers who are occupying Denmark, the story's heroine, Annemarie, her younger (and more bratty), and her best friend Ellen Rosen. From there, this young adult novel tells a tale of bravery.Soon after the beginning of the story, the Nazi soldiers begin attempting to take Denmark's Jewish citizens away to concentration camps (read: starvation and eventual death). As this happens, other Danish citizens and members of a secret movement, the Resistance, protect their Jewish neighbors and begin smuggling them to safety in Sweden. Eventually, Annemarie's family smuggle Ellen Rosen, a young Jewish girl, to their relative's house near Sweden. It is there that the story unfolds and the suspense begins. One of the best things about Number the Stars, for me, was the way Annemarie demonstrated quiet bravery in the face of danger. Her character showed that it doesn't take brute strength and power to be a hero. Because of that message alone (and maybe also the simple, but beautiful writing), I would highly recommend this book."}, {"userName": "Yoda", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/7508449-yoda", "userReview": "Story takes place in 1943, Nazi occupied Denmark, we follow story of ten year old Annemarie and her best friend, Ellen, who is jewish. This is story all about what danish people did to protect their jewish friends and neighbors. Its a short story but still had a great story line. Reading about Holocaust is always incredibly sad no matter if the story has a happy ending or not."}, {"userName": "Carol Brill", "userReviewDate": "Jul 27, 2015", "userURL": "http://www.goodreads.com/user/show/4427869-carol-brill", "userReview": "A very good YA story about a Danish family secretly working with the resistance to help their Jewish friends escape the Nazis. I realistic and gentle enough for younger adolescents introduction to the Holocaust. Wonderful examples of courage, loyalty, friendship and family."}, {"userName": "Beth", "userReviewDate": "Nov 25, 2008", "userURL": "http://www.goodreads.com/user/show/612636-beth", "userReview": "On the back of the library's copy of this book is a review from The Horn Book Magazine that says \"the whole book is seamless, compelling, and memorable -- impossible to put down; difficult to forget.\" Well, I was about to put that bold statement to the test: \"difficult to forget,\" huh? What if you read this twenty years ago and have had two kids and subsequent serious sleep deprivation since then??Well, I can't remember items on my shopping list while I'm at the store, but I remembered a surprising number of details from this book once I started reading: the whole first scene of the three girls being stopped by Nazi soldiers on a Copenhagen street corner, the image of the Star of David charm imprinting itself on Annamarie's hand, the climactic walk to the fishing boat and being stopped by the soldiers with dogs. The scenes that had been subconsciously hidden in my mind for years unearthed themselves as I turned the pages -- indeed, it is a memorable book.The story is a courageous tale of fictional ten-year-old Annemarie -- and of the real citizens of World War II Denmark, who swiftly united to smuggle their Jewish population to Sweden, which was well worth learning about. Additionally, the writing is superb: somehow, Lowry manages to weave detail and plot together in a way that enriches young (and old) readers while not overwhelming them. Each word, each scene is crafted as though this were a poem rather than a novel-- don't be deceived by the thinness of this little book.Loved this book even more than I did in elementary school. It was definitely worth revisiting."}, {"userName": "Tisha", "userReviewDate": "Nov 12, 2016", "userURL": "http://www.goodreads.com/user/show/16297867-tisha", "userReview": "Reading first few lines of the book made me think that I’m going to love this book. And yes I did!I always feel sad after reading books related to Nazi invasion. But this book left me with some beautiful feelings! It is a gleaming jewel which tells a story of a brave 10 years old, Annemarie who risks her life to save her best friend Ellen. She not only saves her friend but also saves the lives of others with her bravery and wittiness. Yeah, I know it’s a fiction and the plot seems very unreal in perspective of the real situation which was awful, but there’s no harm in thinking like this, right?Maybe there were some brave youngsters like Annemarie who stood up valiantly against the Nazis to save others, to save their best friends! It may have happened!"}, {"userName": "Jennifer", "userReviewDate": "Oct 24, 2008", "userURL": "http://www.goodreads.com/user/show/1653142-jennifer", "userReview": "I love books about WWII and this has been one of my favorites since I read it in 6th grade!"}, {"userName": "Rachel'sbookishworld", "userReviewDate": "Apr 15, 2016", "userURL": "http://www.goodreads.com/user/show/51800583-rachel-sbookishworld", "userReview": "4.5 starsSuch a powerful story that can be enjoyed at any age. Weather you're reading this to your 5 year old or you're reading it at age 55, you can still learn from and enjoy this wonderful book."}, {"userName": "Tugba", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/67137298-tugba", "userReview": "1940'lı yıllar. Danimarka Nazi işgali altında. Almanlar'ın Yahudilerin iş yerlerini kapattığı, onlara sokağa çıkma yasağı uyguladığı, evlerinden barklarından edip oradan oraya sürdürdüğü kara günler. Tarihi gerçeklerden esinlenerek yazılmış kurgusal bir hikaye. Danimarka ve halkının hikayesi.10 yaşındaki Annemarie, Yahudi olan arkadaşı Ellen için kendini hiç düşünmeden tehlikeye atar. Dostluğu, cesareti, sadakati bu olumsuz şartlar altında bizzat yaşayarak öğrenir. Annemarie'nin ailesi Yahudi komşuları Rosenlar'a bu zor günlerde adeta kol kanat gererler. Onlar için yapmadıkları şey kalmaz. Okur, yetişkinlerin sınırlamalar, kısıtlamalarla yaşadıkları dünyaya, bir çocuğun gözünden bakmaya davet ediliyor. Sıradan insanların, işgal altındaki vatandaşlar için hiç düşünmeden yardım ederek devleştiği bir öykü bu. Kısacası insanlığa dair güzel umutlar vaadeden bir öykü. Yazarın, bu kitabı yazmadaki çıkış noktalarını ve karakterleri/kurguyu oluştururken tarihte kimlerden ve nelerden etkilendiğini açık açık anlattığı \"Sonsöz\" de mutlaka incelenmeli.Sevgilerimle,T."}, {"userName": "Kellyn Roth", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/52072956-kellyn-roth", "userReview": "Whoa, that was awesome! The cover doesn't represent it very well, so I was a little surprised. I expected it to be dramatic and maybe even a little scary. And yes, it was a bit frightening at times and it was intense, but ... it was also really sweet. Annemarie's voice was quite adorable.Overall, this was a great book that I really enjoyed. It was too short, though! *sighs*~Kellyn Roth, Reveries Reviews"}, {"userName": "Lucy", "userReviewDate": "Jan 22, 2010", "userURL": "http://www.goodreads.com/user/show/307208-lucy", "userReview": "I love Lois Lowry. The Giver is one of my all-time favorite books. She has a way of explaining a complex idea or lesson in a simple, but not at all dumbed down way. Lowry's story of a young girl living in Denmark during the Nazi occupation, and trying to understand who the Nazis are and what their presence means does just that. When Annemarie Johansen's best friend, Ellen Rose,who is Jewish, moves in with her family and pretends to be her dead sister because her parents are forced to go into hiding in order to avoid being \"relocated\", the questions that arise about why the secrecy is necessary becomes a perfect first exposure to a young reader not experienced with the brutality and horror of the holocaust. Lowry doesn't shy away from any of the fear, cowardliness, bravery, anger, deception, confusion, or strength shown by those who lived through this dark time in history. However, she unfolds the story through the eyes of ten year-old Annemarie so the story is appropriate for that age group. I think this is the very best of young adult or children's literature. Compelling, honest, well-written and important. Highly recommended."}], "description": "Librarian's Note: For an alternate cover edition of the same ISBN, click here or here.Ten-year-old Annemarie Johansen and her best friend Ellen Rosen often think about life before the war. But it's now 1943 and their life in Copenhagen is filled with school, food shortages, and the Nazi soldiers marching in their town. The Nazis won't stop. The Jews of Denmark are being ”relocated,“ so Ellen moves in with the Johansens and pretends to be part of the family. Then Annemarie is asked to go on a dangerous mission. Somehow she must find the strength and courage to save her best friend's life. There is no turning back now.", "title": "Number the Stars", "url": "http://www.goodreads.com/book/show/1192774.Number_the_Stars", "average": 4.12, "cover": "https://images.gr-assets.com/books/1388433764l/1192774.jpg", "reviews": 11225, "authors": [{"url": "https://www.goodreads.com/author/show/2493.Lois_Lowry", "name": "Lois Lowry"}], "type": ["Historical", "Young Adult", "Fiction", "Classics", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/1192774.Number_the_Stars", "http://www.goodreads.com/book/show/9813798-number-the-stars", "http://www.goodreads.com/book/show/47281.Number_the_Stars", "http://www.goodreads.com/book/show/2830855-number-the-stars", "http://www.goodreads.com/book/show/186118.Number_the_Stars", "http://www.goodreads.com/book/show/10249031-number-the-stars", "http://www.goodreads.com/book/show/13146527-number-the-stars", "http://www.goodreads.com/book/show/22732038-y-ld-zlar-saymak", "http://www.goodreads.com/book/show/3636.The_Giver", "http://www.goodreads.com/book/show/12936.Gathering_Blue", "http://www.goodreads.com/book/show/12930.Messenger", "http://www.goodreads.com/book/show/13324841-son", "http://www.goodreads.com/book/show/12931.Gossamer"]}