{"ratings": 605, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Oct 22, 2016", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”Gusts of wind rustled in the bedroom’s old chimney, and with our heads beside it, we vaguely thought of birds or bats descending in the night. The ceiling above us, Chris said, seemed to breathe and sigh and she heard soft shuffling sounds somewhere in the rafters. The sense of disturbing ancestral ghosts snuggled us closer together. Don’t go to sleep until I’m asleep, she said to me. And so, alert and listening to every sound, from the thrashing branches of the sycamore trees to the distant bellowing roar of some bull, we lay in the dark, waiting, waiting, waiting for the silent visitor of sleep on our first night in Kiltumper Cottage.”\nAfter the death of an Irish uncle, the germ of an idea began to form. Chris Breen and Niall Williams were working well paying, but stressful, jobs in Manhattan. The Breen ancestral home in West Ireland was available if they were willing to make the leap. This was the 1980s, and there was a flood of Irish trying to immigrate to the United States. They were swimming against the tide. The plan was that they could finally have the time to devote to writing and painting, and hopefully in the process, figure out how to make a living from those endeavors. The vision they had of this life didn’t prove to be the reality. ”Dreaming in New York, however, having never spent an entire day just turning earth, I confess to imagining that words and images would fill my head while I was out digging the spuds or turning the turf, that the work itself would be so poetic that the writing would flow from it, naturally, as it were. In our experience, this is a fallacy. I know no one who is handy enough with a shovel that it doesn’t take most of their concentration to dig straight ridges or even a proper planting-hole.”Where others will see this as a romantic notion, uprooting your life and returning to the country, my perspective is different. I grew up on a farm. I know how difficult it is. On a farm you are always battling the weather, whether it be too much rain, too little rain, hail, or high winds. As the Manhattanites try to raise a garden or even cut bog bricks for the fireplace, they encounter just how fickle nature can be. Many things go wrong and not because they don’t know what they are doing, though that contributes, but because even experience can’t always win against the weather. Some days it was so cold that they couldn’t even hold a book. The community did help them when they could, but all those people were busy, too. So the book created some annoyances for me. I found myself squirming at times and rolling my eyes. It is a bit of a cozy, written for people who like to dream of escape to a foreign place and live happily ever after. As I advanced through the pages, I started to be caught up in the charm of these two people really trying to make this work. They didn’t fold up their tent and go home after a month or three but stayed on and did their level best to learn as much as they could about living in the County Clare. ”The overwhelming gloom of sheer aloneness that hangs in the air in rural Ireland is a potent force. It is at once the greatest positive and negative thing about the countryside. For with it comes not only the tremendous peacefulness of life here, the undeniable sense of the spiritual, but also the consequent darker aspects of hopelessness and madness.”It is best to be busy when you live in the country, for the sheer quiet gives your brain free rein to roam over unaccustomed ground and paranoia, like pneumonia, sweeps in when we are at our lowest point. Being cut off from all that you have known can be a relief, but it can also eventually become detrimental as a mind scrambles for the comfort of the past. When Chris goes back to Manhattan for a visit, Niall experiences real fear that...she...will...never...come...back.\nNiall’s starts to sell poetry. Chris sells some paintings. The chickens don’t die. They harvest a few things from the garden, and the sun pokes out for a glorious day that allows them to fetch their turf bog bricks to the shed. Everyone needs a little hope once in awhile. If you love Ireland or just dream of living in the country, you will find this book not only illuminating but oddly inspiring as it replaces your romantic ideals with a more real vision of what you will be up against if you too wish to abandon a soulless existence and search for something with more meaning. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Cheri", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "4.5 Stars\n”In the town of Scariff the sun was shining in the skyWhen Willie Clancy played his pipes and the tears welled in my eyesMany years have passed and gone since the times we had thereBut my heart's tonight in Ireland in the sweet County Clare”\n-- My Heart’s Tonight in Ireland (In the Sweet County Clare) – Andy Irvine https://www.youtube.com/watch?v=NdVZ0...”It is now nearly thirty years since Chris and I arrived in Kiltumper, nearly thirty years since her father allowed us to move into his father’s house in Clare and staked us our first four cows, thirty years since we came in the old Peugeot down past O’Shea’s and began the adventures recounted in these pages. And reading the book again now two things at once come to mind. The first is the natural response of anyone reading something they wrote so long ago: 'Were we ever that young?'The second, in light of the very many and remarkable changes that Ireland has undergone since we first arrived, is: 'Was it really like that?'“The answer to both is yes.” This is, in Niall Williams words ”as true and accurate a snapshot of our life as I can imagine.”Written by both himself and his wife, Chris Breen, in alternating segments, this paints a picture of a life so very different from the one they lived in New York City, a life of not only knowing your neighbors, but depending on them. A life of hard work, more rain than they could imagine, hardships, but also of rewards not so easily summed up in a word. They envisioned an idyllic future, surrounded by nature that rewarded them with plenty, and if it wasn’t quite that, I doubt they would have changed a moment looking back.”It was written by both of us when the events recounted were not even fully past, written at a time in our lives when we were most vulnerable, most filled with dream and hope, and uncertainty as to how our life in Kiltumper would go. In a way, we were writing it in order to convince ourselves that we could make this life work. We were writing a life into happening.”They could never have imagined what life there would be like, how difficult it could be to get what was so easily obtained in New York, a phone line hooked up and working, how difficult that first year would be. And while the next year that followed brought them more friends, connections, and expectations weren’t quite as high, they couldn’t imagine everything they still had yet to learn, the joys they had yet to experience, the books they had yet to be published, or the love for this place that would grow like her gardens, enriching their lives, filling their heart and souls.Almost a year ago, I read Niall Williams’ ’History of the Rain’ which I loved. I wanted to read something else by him by him, with my focus (mostly) on everything Irish this month, and had semi-planned on his novel ’As It Is in Heaven’, or possibly his ’Four Letters of Love’ and then came across this memoir-journal / story of their life in this land and I’d say that this won me over. Kiltumper, named after a chieftain who is buried on the hilltop there, is in County Clare. County Clare, which is often called the home of Irish traditional music, is close to the Atlantic ocean, a beautiful part of this world, at once both wild and lovely. I spent some nights there, in Doolin, most known for the music, a small town that has a bit of everything in small doses – except music, food, and refreshments. ”Kilfenora and Corofin, Lisdoonvarna and Miltown Malbay. Music sounds in those names. It jigs and reels all across the county from Kallaloe to Kilee, from Carrigaholt to Ballyvaughan. It’s the music of pipes and flutes and fiddles playing in even the smallest pubs all along the Atlantic coastline of Clare. Say Doolin, and everyone knows that you are talking about music.”Finding the thatched roof cottage was not an easy task, but Doolin was a lovely place to spend a few days, and the drive through the Burren where wildflowers abound weaving their way through the craggy limestone rock walls, which walls weave their own way throughout this countryside. It’s unlike anyplace else I’ve ever been. Fierce in its nature, it is lovely if not welcoming in its appearance. In one of her journal entries included, Chris is pondering what their family and friends think of them, their new life, questioning what they could possibly be doing all day there. She writes: ”We ask ourselves, and answer in the words of Thomas Merton, ‘our business is life itself.”And that more or less sums up this part of their story, this is the story of, more or less, their first year, years, of living in a land so very different from where they’d lived in New York City, different from where she’d grown up in Westchester County, NY, and different even from where he’d grown up in Dublin. ”Walking with quiet loneliness back along the western road in the still of early evening, together we are Inspectors of Wildflowers, Secretaries of Sunshine, Surveyors of Meadows, Auditors of Birdsong, Clerks of Clouds, Vice-Presidents of Hilltops and Valleys, Bogs, Trees and Everything.“…We go back to work tomorrow. To writing. To gardening. To living this life we have chosen.”"}, {"userName": "Amy", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/8231627-amy", "userReview": "This was a beautiful memoir of two New Yorkers, of Irish descent, deciding to pull up roots and move to Christine’s family cottage in West Ireland. The language and writing of this memoir was so beautiful and of course, the descriptions of Ireland are enough to swoon over. However, throughout this book, I appreciated the honesty and real feelings that Niall and Christine shared about the culture shock, loneliness, daily struggle to eek out a living on a old, run down farm and cottage. The shear difference between their lives in New York with all it’s convenience and speed versus the backbreaking labor for something as simple as heat for their cottage was astounding. The slow pace of the culture was unreal to them. Mr. Williams did a wonderful job sharing the ups/downs and real feelings. I was especially touched and sadden as they walked through the realization that they were unable to have children. I was elated to find out that there are three more books on their life at this time. I’m itching to start them."}, {"userName": "Colleen", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/2196362-colleen", "userReview": "O Come Ye Back to Ireland by Niall Williams and Christine Breen is an engaging memoir about the couple's first year in County Clare, Ireland. They moved to the quiet, rural setting from their busy, urban lives in New York City. The book recounts their losses and their revelations during the year and everything the learned along the way. It almost made me pick up and move to my own little oasis in Ireland . . . almost.Christine Breen is the American born daughter of Irish parents attending University College Dublin when she meets Niall Williams who was born in Ireland's capital city. Ultimately, they marry and set up life in NY with jobs in Manhattan and a home just outside the city. Christine's family home in Kiltumper, West Clare becomes available after the death of her uncle and a seed is planted as she finds herself inexplicably drawn back there. At the same time, the couple has begun to grown weary of their lives in the city. Niall writes: It [Kiltumper] struck us as so utterly different from anywhere we had ever been, so remote, so very rural. Each time we shook our heads, and returned to New York. Why then did we change our minds and commit ourselves to the West of Ireland? Because when we walked up the streets of Manhattan too many people pushed too hard to cross the street or squeezed too hard to get into too few subways ...And there would suddenly be the sense of a place far from the rushing streets, a place remote from the extravagant, urgent business of today, an old place growing older in the rain.Clare Coastline - creditAfter wrestling with the pros and cons of such a big move - afterall, the couple were moving to Ireland in the 80's at the height of great emigration from Ireland - they decide to take the leap and head for the West of Ireland. The book recounts their initial shocks and struggles as they try to adjust to life in a very rural, albeit picturesque, rugged West Clare. They arrive to their cottage which is in need of a lot of work and has little furniture and try to make it a home. Something as seemingly simple as purchasing a car becomes an ordeal as they try to navigate the rules of road taxes and licenses; this is made all the more difficult by the lack of direct dial telephone service in their small village. The convenience of picking up the phone and trying to get something \"sorted\" was not to be had. So the couple waited in relative isolation as they tried to get the many pieces of their life in Ireland in order - home, car, furniture. Niall speaks here to that isolation: We saw a clearing in the south; the more land we saw from the window, the less isolated we felt. .... to Chris and me the overwhelming gloom of sheer aloneness that hangs in the air in rural Ireland is a potent force. It is at once the greatest positive and negative thing about the countrysideVillage, Clare - creditThe people of their village, however, are their salvation. The steady couple next door visits with freshly made food and brings welcome company on cold, otherwise lonely evenings. Michael and Pauline head to the bog to help Niall and Christine with the back breaking work of cutting the turf - turf which is necessary to heat their home and cook their food but requires a grueling series of steps over many weeks and months to get it ready to burn. The story of their first Christmas and the story of the death of a much loved woman in the village perfectly highlights the tight knit farming community they had become part. In both instances, all the families in the village pull together to cook and bake readying themselves for visitors and they go to each others homes to share a bit of food and some stories. It is the neighbors that ultimately sustain Christine and Niall in that first year of adjustment. I was captivated by this book on many levels. First and foremost, it is very well written - there is almost a lyrical tone to many of the passages. There is a touch of humor as the couple muse at the new world in which they find themselves. Perhaps most of all, however, is the setting. The West of Ireland, although rugged and spare, has a certain draw. As I have mentioned before on the blog, my Mom is from the West and we went \"home\" to Ireland most summers to visit my grandparents, aunts, uncles and cousins in a small farming village not unlike Kiltumper. Much of what amazed and frustrated them about the area were things I could relate to and reminded me of the happy times we spent in Ireland. Every time I visit I consider whether or not I could live there and feel pulled to the country; each time, however, I decide it is too big of change. Perhaps that is why the story of this couple seems especially compelling.Emigration is the theme on which this book is built and that seems appropriate in a country which has in many ways been defined by waves of emigration. This scene described by Niall so perfectly captures the reality of emigration: To know the real story of the West of Ireland, spend a day in Shannon Airport at the foot of the stairs to the departure lounge. They come in little clusters, farming families dressed in their best clothes, with a son or daughter moving slightly ahead in anticipation of the dreaded moment of goodbye. Mothers' faces are damp with tears, fathers are stiff with emotion, and they all grasp the rails of the moving stairs. It is joyous and sad at once. An old Irish image, the farewell has lived on through centuries of immigration and is as real today as it ever was . . . . Shannon airport is a an emotional place for people in the West. More than an airport, it is an escape hatch to America for the young and the symbol of Ireland's massive unemployment problem.The image of traveling to Shannon in our best is very vivid for me as I remember seeing my grandfather in his suit when we came through arrivals in Shannon at the beginning of our trip and in that same suit with tears in his eyes as we went back up to Shannon six weeks later to return to NY. I never realized it then but my grandparents had to relive the farewells and departures every year without knowing if we would make it back - or they would be there- the next year. Obviously I felt a personal connection to this book but even without that this is a charming memoir about the bravery to start all over and what you learn along the way. It gives a peek into real Irish country life and all that comes along with it. If you like Ireland or memoirs or stories about starting over, you will find something to love in this book."}, {"userName": "Lexish", "userReviewDate": "Jul 03, 2008", "userURL": "http://www.goodreads.com/user/show/84010-lexish", "userReview": "This book was almost escapist for me. =) Though it sounds very cliche to say that this is a book about a couple from Manhattan who return to their families' native rural region in Ireland, it's so much quieter and nicer than that. The picture the authors paint is certainly not all rosy--trying to cut the sod, keep the farm going, raise animals, and in general keep life going turns out to be much more in depth than the couple ever thought. It was interesting to see how the authors' viewpoint had shifted by the end of the book. They mention how they went on vacation for a few days and found they worried about their crops and their animals the whole time. Having put so much time and investment into them and having tended to it all themselves, they wanted to be there to protect it. Overall, it's just a relaxing read when you--and your mind--want to be somewhere else."}, {"userName": "Autumn", "userReviewDate": "Sep 28, 2008", "userURL": "http://www.goodreads.com/user/show/657683-autumn", "userReview": "This is an amazing book. A couple leaves their jobs in NYC and moves to Ireland in the 80's. We're talking rural Ireland. Farms, burning peat to heat the house, some people with no electricity or phones... It's a memoir, not a novel. I love books about Ireland. I love that people there tell stories as a national pastime. There's a lyricism and beauty and can you tell I want to move there? Anyway, it's great to read a first hand account of outsiders who find a place where things move more slowly, where people seem to care more, and where it's always misty out. The rest of the series is also worth reading."}, {"userName": "Katie", "userReviewDate": "Mar 31, 2011", "userURL": "http://www.goodreads.com/user/show/962265-katie", "userReview": "A gentle, tender kind of narrative. Memoir of the authors (husband and wife each write parts) who left NYC in 1985ish to take up the rural life of County Clare, Ireland. Painters/writers, novice farmers, they chronicle their struggles and adjustments honestly and sweetly. Oh the endless rain, the ruined garden, the amusing tale of Niall (husband) attending \"farmer school.\" I really liked it."}, {"userName": "Lia", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/3834993-lia", "userReview": "It was interesting to read about the differences between a hectic life in 1980s New York and the rustic ways of coastal County Clare. The life of the two authors is what I imagined my life would be like when I graduated high school -I'll meet some artistic Irishman who takes me back to his home country and I spend the rest of my life raising sheep and growing flowers."}, {"userName": "Swgreen", "userReviewDate": "May 19, 2012", "userURL": "http://www.goodreads.com/user/show/9553141-swgreen", "userReview": "A must read for those interested in Ireland. A very personal, well written part one of a trilogy of Niall and Christine's return to her family's home and landscape. Having travelled to Ireland many times over the past 30 years, I am still learning from this book."}, {"userName": "Heather Adkins", "userReviewDate": "Mar 13, 2010", "userURL": "http://www.goodreads.com/user/show/2564411-heather-adkins", "userReview": "Phenomenal writing. As someone who yearns to live in Ireland, this story of an American/Irish couple moving to County Clare and learning to farm was moving."}, {"userName": "Rebecca", "userReviewDate": "Apr 27, 2012", "userURL": "http://www.goodreads.com/user/show/8086485-rebecca", "userReview": "I loved every book they wrote in this charming series of a couple that moved from New York to Ireland and the accompanying social/culture shocks. Funny and very entertaining."}, {"userName": "Melody", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/3884378-melody", "userReview": "A memoir of life in rural western Ireland in the mid 1980s, this book is a snapshot of a country on the brink of emerging into modern society. The authors were particularly suited to capturing the lore, as well as the lovely people and the difficulty of a small farmer's struggle to wrest a living from the land. Their Irish heritage gave them a love and dedication to a fast-disappearing way of life, while their former lives in NYC gave them a perspective in high contrast to their new adventure, and their background working in the arts made for a pleasurable reading experience. Nicely written, humorous and heartbreaking, and a lovely trip back in time, so to speak."}, {"userName": "Elizabeth Marcus", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/3878022-elizabeth-marcus", "userReview": "I loved reading the story of Niall Williams and Christine Breen, who left their jobs and home in NYC to live in rural Ireland. Though they both had relatives in the country and had visited there several times, it was extremely difficult getting used to the old house into which they moved, the way things ran, growing crops, cutting turf and farming, among other tasks. I got a real sense of the region's people and history, and knowing what true Irish hospitality meant in tough times. The book was well written and inspiring. I look forward to reading more about the couple."}, {"userName": "Julie O'Leary", "userReviewDate": "Mar 25, 2014", "userURL": "http://www.goodreads.com/user/show/27506345-julie-o-leary", "userReview": "This recollection of a young Irish American moving to rural western Ireland in the mid 1980's (pre-internet days :-)) & try to build a new self sustainable life while becoming fully immersed in their traditional western Irish community was written with humor & a bit of self-deprecating wit. This was a real quick heartwarming read -very identifiable to me as an American living in a foreign country!"}, {"userName": "Jina Howell-Forbes", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/15331514-jina-howell-forbes", "userReview": "A very slow moving story. I had a hard time finishing it. I like stories about the difficulties of rural farm life, and stories about Ireland are usually very special. But I found no reason to like these characters, hard as I tried. I wanted to care what happened to them. I did. But the true-life story was just not interesting. It just plodded on and on."}, {"userName": "Sherri", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/5874439-sherri", "userReview": "This book was destined for a 1 or 2 star rating for the first half. I felt as if I were reading a book written by a couple of very spoiled, whiny kids. Not what I wanted out of it. It picked up tremendously for the second half. I would almost recommend it...almost."}, {"userName": "Jacqueline", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/18137450-jacqueline", "userReview": "A really charming book, an insight into the struggle of living off the land in County Clare. Having recently read (and hugely enjoyed) Niall's book \"History of the Rain\", I could now see from where this was drawn. Would highly recommend."}, {"userName": "Stacy", "userReviewDate": "May 12, 2016", "userURL": "http://www.goodreads.com/user/show/55502227-stacy", "userReview": "I really liked the book. It made me want to go there myself and absorb the culture. Good stuff."}, {"userName": "Kathy Kayser-konig", "userReviewDate": "Jan 22, 2012", "userURL": "http://www.goodreads.com/user/show/6396098-kathy-kayser-konig", "userReview": "Thus was very enjoyable and a must-read for anyone wanting to know more about the REAL Ireland. A bit dated but still a lovely adventure."}, {"userName": "Heather", "userReviewDate": "Jul 05, 2011", "userURL": "http://www.goodreads.com/user/show/5743591-heather", "userReview": "A book about my dream...leaving it all behind to start a farm in Ireland!"}, {"userName": "John Mulholland", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/3763514-john-mulholland", "userReview": "Interesting from the viewpoint of life in rural Ireland"}, {"userName": "Robert", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/5485506-robert", "userReview": "Not as I expected. More on the couple who moved to Ireland than on the characters in the community Bit disappointing"}, {"userName": "Maura", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/1061106-maura", "userReview": "Having visited the west of Ireland, I enjoyed reading about day to day life there as experienced by a couple of newcomers. This book was written about 20 years before my visit, so the standard of living in much of the West has changed markedly. But I remember our guide telling us as we drove through the mountains on the Ring of Kerry that the area was the last in the country to get electric service, and it hadn't been so many years before. In the book, the authors manage to avoid much of the romantizing that often comes with the \"abandon modern life for simpler times\" story. Although they started out with that idea, they recognize that tendency in themselves, and are pretty blunt with describing the hardship of having no central heating, dealing with dismal weather, and adjusting to the isolation and lack of stimulation that they faced that first year. Despite the hardships, the charm of Ireland and the rural way of life they have chosen comes through in this book."}, {"userName": "Della O'Shea", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/9536424-della-o-shea", "userReview": "Read this in a couple of days. Loved the first-person narrative chapters by Niall, inter-laced with journal entries written by Christine.I cared about them and the neighbors, family members and village folk depicted in the first year of their dream of quitting the New Yorkrat-race and settling into the Breen cottage in Co. Clare, West Ireland, Christine's ancestral home. I'm delighted to see that subsequentbooks follow the story forward through adoption of two children and travel around the country. I look forward to reading more of these non-fiction works. On their website, I recognized the photo and information about Christine, and realized I had been to the website before. I then realized I had read \"The Fall of Light\" a novel by Niall and kept it on my shelf, as I only do with books I especially like."}, {"userName": "Maureen", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/51719804-maureen", "userReview": "I loved this book. I loved this book more than I can describe. Perhaps because I've come to a point in life in which I desperately want a quiet, simple and pastoral life. I understand why Niall and Christine left New York and moved to County Clare in search of a life true to themselves and their spirits. They never glossed over the difficulties they encountered in their adopted County Clare. Yet, it is obvious they were a team and completely invested in what they were doing and in the life they wanted together. I cheered for them in their victories and ached for them in their hardships and heartbreaks. What they achieved they did together, with the help of kind and generous neighbors. They conveyed a true sense of community."}, {"userName": "Roberta", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/2614758-roberta", "userReview": "I read As it is in Heaven, a novel by Niall Williams, a few years back and really loved his story and his style. This book is a memoir of Niall and his wife moving to a farm in County Clare on the west coast of Ireland. It's real, not sugar coated in any way, detailing their struggles and occasional despair. The timing was terrible. They arrived during one of the wettest years ever and that is saying a lot in Ireland. The conditions were primitivie. What shines out for me is the values they brought with them and continued to live by - living in the moment, making time for what is important, living more simply and connecting to community in an authentic way. I will definitley be looking for the rest of the series."}, {"userName": "Charlene", "userReviewDate": "Apr 13, 2016", "userURL": "http://www.goodreads.com/user/show/66616-charlene", "userReview": "This was such fun to read, partially because I'm planning a trip to Ireland soon. I do like memoirs, particularly ones that deal with \"ordinary life\" albeit in an unusual place (a stone cottage in western, very rural Ireland). Authors are talented and come across as very likeable and so are the Irish neighbors in the book. Hardships are not glossed over (neither is the weather!) but there's happiness in the book as the young authors establish their lives away from their previous home in New York City. The book was published in 1987 so when it is describing a rapidly vanishing way of life one can only assume that it is now gone.  I honestly enjoyed this much more than Niall Williams's much regarded recent novel, The History of Rain, and intend to look for the 3 sequels."}, {"userName": "Tim", "userReviewDate": "Aug 21, 2012", "userURL": "http://www.goodreads.com/user/show/7896272-tim", "userReview": "I have had this oddly shaped paperback since Lil was at Philly Mag in the late ’80s. It has some odd light brown stain across some of the pages, like tea or potpourri juice. An Irishman and his Irish-American wife chuck New York and move to the western coast of Ireland in the mid-’80s, old house blah, small farm blah, writing painting blah. Not bad for the genre, and in fact entertaining enough (and honest enough about the struggles, so unlike the “rich guy moves to country and surrenders to the local builders” entries) to make me read the sequels, but little concrete springs to mind now."}, {"userName": "Julie Schmidt", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/34360269-julie-schmidt", "userReview": "I read this as we're considering moving from the US to western Ireland and thought this couple's experience would be helpful. However they decided to go into farming and try to live as their ancestors had, and they were in a much more remote area than we plan to live in, so I personally didn't connect. Also, because it's set in the 80s, I felt some of the information about relocating was dated. However there were nice, sweet stories about their interactions with the neighbors. It just wasn't what I'd hoped it would be, so that's not really a reflection on the author(s)."}, {"userName": "Kara", "userReviewDate": "Jan 14, 2012", "userURL": "http://www.goodreads.com/user/show/7300612-kara", "userReview": "Wonderful book. Niall & Christine meet at University in Dublin, he a Dubliner & she an American. They move to America and begin the typical non-life of working in New York. They wake early to catch the train, work all day, then have another long ride home. They are lucky to finish dinner before falling asleep & starting all over again. When a relative in Ireland leaves Christine's family a cottage in county Clare - they take it. And so the adventure begins. While they may not be much at farming, he is an entertaining and charming writer."}], "description": "A story of a young couple who abandoned their careers in New York and moved to Ireland tells of their idyllic life in a cottage, surrounded by the beauty and character of the land of their ancestors.", "title": "O Come Ye Back to Ireland: Our First Year in County Clare", "url": "http://www.goodreads.com/book/show/202565.O_Come_Ye_Back_to_Ireland", "average": 3.91, "cover": "https://images.gr-assets.com/books/1330036657l/202565.jpg", "reviews": 69, "authors": [{"url": "https://www.goodreads.com/author/show/27620.Niall_Williams", "name": "Niall Williams"}, {"url": "https://www.goodreads.com/author/show/118152.Christine_Breen", "name": "Christine Breen"}], "type": ["Cultural", "Autobiography", "Travel", "Nonfiction", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/202565.O_Come_Ye_Back_to_Ireland", "http://www.goodreads.com/book/show/20455995-o-come-ye-back-to-ireland", "http://www.goodreads.com/book/show/3291207-o-come-ye-back-to-ireland", "http://www.goodreads.com/book/show/19314428-history-of-the-rain", "http://www.goodreads.com/book/show/49168.Four_Letters_of_Love", "http://www.goodreads.com/book/show/973889.As_It_Is_in_Heaven", "http://www.goodreads.com/book/show/524956.The_Fall_of_Light", "http://www.goodreads.com/book/show/524958.Only_Say_the_Word"]}