{"ratings": 151782, "userreviews": [{"userName": "Rachel (BAVR)", "userReviewDate": "Oct 09, 2012", "userURL": "http://www.goodreads.com/user/show/6303796-rachel-bavr", "userReview": "Some spoilers ahead!Oh, good grief. Before I even get started, let's just establish a couple of facts about this review:1) I know my opinion is not the popular one (at the moment).2) I do not feel guilty about Fact #1. 3) Therefore, I am going to be brutally honest. If I could go back in time one week and erase the crazed idea I got to read On Dublin Street, I would. Even though I'm an avid romance reader, I have incredibly shitty luck with contemporaries, mainly because I expect modern characters to be more enlightened than they ever turn out to be. But here was this new, shiny thing with all kinds of 5-star reviews and a generous amount of buzz. \"It can't be that bad,\" I thought.Then I read it. This doesn't end well. While I know On Dublin Street is right up some readers' alleys, almost everything about it is my own personal Kryptonite. The only thing I liked about it was the ending because that meant I was finally done with it. So, with no further ado, let's get to the meat of this rotting carcass. Things Rachel Didn't Like About On Dublin StreetThe QualityApparently, this thing had two editors. I couldn't tell. A constant stream of errors kept me detached from the story about 90% of the time. Punctuation is misused (or not used at all), words and phrases are repeated with wild abandon, dialogue tags are left beaten and bloody behind crumbling storage sheds, sentences are mangled, and needless descriptions and characters are rolled out of a clown car even though they bring nothing to the story. The narration tested my patience time and time again with its repetitiveness. Joss can't just say \"shit\" or \"fuck\" when she feels like using a curse word (which is often). She'll take off on some Fuckity, shit, shittity, fuckity, fuck, shit exclamation that makes it look like the prose is suffering from Tourette's. In addition, she uses the annoying curse \"Jesus C\" all the freaking time. It's Jesus CHRIST, Joss. You can't throw around all those fucks and shits like a politician throwing out candy to little kids at a parade and then act all coy when it comes to Jesus. We all know it's Jesus Christ. \"Jesus C\" would have been fine if used once (or never), but it wore out its welcome VERY FAST. The whole story needed to be compacted and fine-tuned. Alas, it wasn't and ends up reading like a first draft fan fiction instead. If you're thinking, \"Rachel, it can't be that bad,\" allow me to present to you the following:\nExample 1: As I had been for the last few weeks I was working Saturday's now at Club 39.Example 2: \"Wait,\" My look castigated, \"You didn't pick up every time Adam called?\"Example 3: He seriously hated clubbing which had brought me to ask him the question 'why he owned a nightclub?'Example 4: He should you have been a therapist.\nThese are just a few that really made my head splinter. You can find more on just about every page of the book, or you can check out my epic collection of status updates. Near the end, I felt like everyone just stopped trying. \"You're\" was used instead of \"your\" multiple times. Run-on sentences ran crazy. The plot just kept going and going for no reason other than to drag out the page count.Call me a nit-picky bastard. I'm not ashamed. If a book goes out on the market for people to buy and spend their time reading, then it should be properly edited. Isn't it enough that we have to put up with wonky plots and asshole characters? Can't grammar and proper syntax rise above all that? I refuse to give more than one star to a book that uses \"My look castigated\" as a fucking dialogue tag, or that uses \"Saturday's\" as the plural for Saturday, or that neglects the use of commas like they're just \"special gifts\" we give out every once in a while. Joss is a CowThis narrator has the special honor of reading like both The Most Horrible Person in the World and a generic Mary Sue. Joss comes fresh out of the Tragedy Factory with a dead family, a dead best friend, and a shit-ton of \"I've got issues\" baggage. In order to facilitate Joss' fucked up persona, Young just has her do everything in the most irrational manner possible. She has all kinds of nice friends but insists that she can't let anyone in. She has a hefty inheritance that she \"never\" uses (which is a fucking lie) and acts like some great martyr because she works in a pub and wants to write for a living. She acts like a total hypocrite with her friends and even makes the problems of her roommate, which are actually serious, ALL ABOUT HER. Joss is such a bullshitter that she'll tell you one thing in the first-person narrative and then completely contradict it in her totally unnecessary inner monologue. That brings me to another complaint: Why the hell do I keep reading first-person narrative stories with frequent inner monologues? They do the same goddamn thing!Joss makes a good decision when she starts going to therapy, but the therapy sessions annoyed me because it read like Young pulled every aspect of it from what she's seen on TV. If that damn therapist cocked her head like a bird one more time, I was going to scream. I'll give Joss credit for being a caustic bitch to Braden a majority of the time, though. Sure, her \"I don't deserve LOOOOOVVVEE!\" reasoning is irrational, but Braden seriously deserves every ounce of difficulty she throws at him. Braden Carmichael: Alpha-Douche-BitchThis guy. He's a real piece of work. I hate this New Alpha character we've been seeing in books ever since Edward Cullen made stalking \"sexy\" again in Twilight. Perhaps my fantasies don't line up with popular opinion these days, but I don't find these guys attractive at all. The alpha male used to be confident, and yes, demanding, but he knew where to draw the line. Now, the alpha male is written as some wangsty, twagicy bitch with more insecurities than a teenager going through puberty and a majority of the characteristics you find in those lists that tell you if your partner might be abusive. I don't find this sexy. At all. I find it revolting, disappointing, and above all, ANNOYING. I don't give a shit if Longshacks McGiantWang is a tortured soul with a sad past. That doesn't give him an excuse to shuck all personal responsibility and mistreat the people around him. Braden Carmichael: Manipulative A-hole is one of these gems. From the beginning, he refuses to respect Joss' boundaries. All of their conversations go something like this:Joss: Braden, I need space. I am being entirely up-front with you about this.Braden: I don't give space to women I want to fuck, Jocelyn.Joss: I can't have sex with you.Braden: I'm going to fuck you so hard you won't be able to stand straight in the morning, Jocelyn.Joss: I told you to call me JOSS. I hate it when people call me Jocelyn.Braden: I'm never going away, Jocelyn. Joss: You're a dick.Braden: I am Alpha Male. Hear me roar! (throws her down on bed) Now let's fuck.Braden has a very foul mouth that never gets sexy, and this is coming from a person who uses liberal profanity in her reviews. He actually made me tired of the word \"fuck\". His list of sins against Joss (and women in general) is long and well-documented in my reading updates. I'll just tell you the ones that pissed me off the most here: He threatens to beat up just about every guy who flirts with or looks at Joss. He ACTUALLY beats up a guy who flirts with Joss. He tells her what to do with her hair and how to dress because he doesn't want \"other men\" knowing how sexy she is. He shows up at her apartment unannounced even AFTER she tells him she needs space. He goes on and on in these really creepy exchanges about how he'll never \"share\" her, like she's a pair of his gym shorts or something. He initiates sexual encounters with her WHILE SHE'S SLEEPING. He manipulates her BIG TIME near the end of the story, telling her that he slept with another woman just to make her break down emotionally so he could discern if she \"loved\" him. Frequently, Braden's body language and behavior are described in a way that suggests he's about to murder Joss. \nExample 1: \"That's it, we're done. This was a complete mistake.\" I moved to get up but found myself tackled back onto the couch, flat on my back with Braden lying over me.Example 2: ... and then I strangled a squeal of fright as he lunged upwards, his strong hands gripping my upper arms as he dragged me down onto the floor with him. \"Braden!\" I yelled, as he rolled me onto my back. And then he did his worst.\nAfter that second quote, he actually tickles her, which may disturb me even more. His moods rapidly fluctuate between \"charming Scotsman\" and \"slasher pic serial killer\". It was very hard for me to handle. Braden is just a walking laugh factory of everything I've never wanted in a boyfriend. \n\"Because ... I like being the only man who knows how beautiful your hair is. How gorgeous you look with it down.\"\nThat seems sweet on the surface, I guess. But then think about it. If Braden could push it that far, I bet he would like to be the only one who knows how gorgeous Joss is, PERIOD. What I'm implying is that he would never let her be within seeing distance of another man if he could get away with it. \n\"You try to leave, I'll tackle you.\" Even though he wasn't looking at me when he said it, I could tell he was deadly serious.\nDeadly serious? She believes that he's DEADLY SERIOUS about threatening to TACKLE her? This is so unromantic that MY vagina has put up a \"Closed Until Further Notice\" sign so I can recover from this shit. Things Don't Make SenseJoss' back story makes very little sense. It seems that Young knows very little about American trust laws and the American foster care system. We're told that after the death of her parents, Joss was funneled into the \"awful\" foster care system. This requires a great suspension of disbelief on the reader's part. For one, her family had a great deal of friends and neighbors who probably wouldn't want to see Joss end up with strangers. For another, her parents apparently took the time to set up provisions for her to inherit a great deal of money at 18 in the event of their deaths but neglected to arrange something major like CUSTODY OF THEIR CHILD? Lawyers and executors would be involved in this type of deal, and they would exhaust every last option before putting an heiress with family friends and a fucking UNCLE in the foster care system. Nothing is explained, though. We're just expected to believe that Joss obviously went there because she's a poor little thing. I don't buy it. The Sex is the Same Thing Over and Over AgainOn Dublin Street doesn't really push any erotic boundaries. Most of the sex is missionary and involves Braden basically sexing Joss into submission. While he constantly talks about how much he wants to \"fuck\" her, Joss has the same physical reactions EVERY DAMN TIME she sees him. \"Oh, Braden wore a new shirt! My panties dampened and my nipples pebbled in response.\" Joss' panties are referred to as \"damp\" so often that I've started a working theory that her vagina is the Dead Sea. It didn't help that Braden makes all kinds of comments about how \"wet\" she is during the love scenes. Is there no other description to use? I get it! Joss is in a perpetual state of horny for the possessive bastard. The ElitismBasically, rich people like Braden and Joss are totes awesome and principled. The only poor people are described as gold-diggers and drug dealers/users. I read another review that went into this in detail, so I won't rehash it here. In short (and I know, there's nothing \"short\" about this review), this book is not my cup of tea. If I could give it ZERO stars, I would. However, GR won't let me, so one star will have to do. Now, if you'll excuse me, there's a truckload of neglected commas in Scotland looking for a good home right now. I think it's my duty to rescue them. Just for fun, I'll leave you with this randomly plucked-from-the-text quote:\n... when a bolt of lust shot between my legs and I looked down to see a gorgeous merman's head there.\n>:DEdited on 10/19/12 because I woke up in the middle of the night to the realization that I forgot to include a couple of the repetitive phrases that annoyed me. If you've already read the review and really want to know what would wake me up in the middle of the night, the additional material is in the first paragraph under the heading The Quality."}, {"userName": "Blacky *Romance Addict*", "userReviewDate": "Sep 04, 2012", "userURL": "http://www.goodreads.com/user/show/8310179-blacky-romance-addict", "userReview": "[the big shocker just to see her reaction (hide spoiler)]"}, {"userName": "Karla", "userReviewDate": "Oct 08, 2012", "userURL": "http://www.goodreads.com/user/show/2846441-karla", "userReview": "Letting my shelves and updates state my case for this one.Although....if you want a short version:Heroine: I haz problems.Hero: *sexy eyes*Heroine: *feminine core immediately melts & nipples pebble* But...I haz problems. No sexx0ring with this stud for me.Hero: *constantly offers Cock of Healing™*Endless Supporting Cast of \"I-Don't-Give-A-Fuck!\" Doom: We might just be names on paper with no personalities whatsoever, but we're adorably quirky with interesting personal lives! Everyone likes to talk about us! A lot!Ellie: And I am the Best Innocent and Eccentric Roommate Evah out of Central Casting! I have \"Readers ❤ her!\" written all over me! I wear my cardigans inside out and wrinkle my nose at the icky sex stuff! What's NOT to love?Heroine: Hello? Problems....I haz 'em.Hero: I want to fuck you inside you. Cock fuck inside wet come.Heroine: *creams self* CURSE MY PROBLEMS AND UNWILLINGNESS TO COMMIT!Author: I guess I'd better wrap this up soon. I know! A medical emergency creates last minute conflict and quick resolution!Readers: So.....beautiful.....Bank Account: *ka-ching!*Granted I don't read much erotic contemporary, but this one read so much like smutty fanfiction. Cardboard characterizations...totally contrived set-up...nothing happens...nothing happens...sex sex sex...drama flail....pointless conversations....sex sex...drama flail....sex sex...biggest dwama of them all....boring epiphanies....sex sex....and BLAH."}, {"userName": "Auntee", "userReviewDate": "Oct 09, 2012", "userURL": "http://www.goodreads.com/user/show/886675-auntee", "userReview": "This book has ruined me for others...I haven't been able to read anything since. Until then...Braden...\nWell, what can I say that hasn't already been said? There's over 1,500!! reviews for this book, the author has just signed a 7-figure, 2 paperback book deal with a major publisher, sold 150,000 downloads of this self-published book in one month, and I'll bet movie rights might be next. So I doubt my little review will make much difference in its success...but I'll add my 2-cents anyway. I loved this book! In fact, I fear it's ruined me for all others (temporarily, of course) since I haven't picked up another book in over a week. That's how caught up I am (still) in this one!The characters, the story, the setting, the plot, and OMG the heat in this one...everything worked for me. I was totally absorbed in it and did...not...want..it...to...end! The story is told in 1st person (not my favorite, but it worked) from the heroine's (Joss/Jocelyn Butler) POV (sure wished we could hear from the hero, though). Joss is snarky, rude at times, stubborn, and self-contained, with a tough outer shell trying desperately to hide a soft and sweet inside, and very, very vulnerable. It takes a while to appreciate her in this book, but keep an open mind because she's young (22) and has been through a lot. She had a major upheaval in her life at age 14, and she hasn't really dealt with it for 8 years. She's 22 now, fresh out of college in Edinburgh, Scotland (she's half American, half Scottish) working in a bar part time while she's trying to write a novel. The story starts with her moving into a beautifully renovated apartment (on Dublin Street) that she will be sharing with a friendly young blonde (Ellie Carmichael) who is working on her PhD. Ellie has a half-brother, Braden (a very successful, sexy real estate developer), who is very devoted to her (I loved their brother-sister relationship). Braden and Joss had shared a cab (where all kinds of sparks flew) once and when Joss finds out that the man she dubbed \"the Suit\" in her mind is her flatmate's brother!, and she will be seeing a lot of him in the future, well that just opens up a lot of problems for Joss. Joss is determined to keep herself closed off from people. She wants to be acquaintances rather than \"friends\", doesn't want to share anything about herself or her painful past, and lord knows she's not looking for a relationship. But Ellie and Braden have other ideas...\"Oh Joss, what am I going to do with you...\"\nI won't say any more about the plot, except to say there's something for everyone. I laughed, I cried, I sighed, I swooned... I loved the whole atmosphere surrounding the book, and all the little details the author provided. She doesn't skimp on describing anything--whether it's Ellie's and Joss's apartment or the clothes they are wearing or the TV shows they are watching or the places they visit or their circle of friends--everything is told in such a way that you can easily visualize it. And the physical descriptions of the characters? Here's an example:For Braden:The Suit wasn't classically handsome, but there was a twinkle in his eye and curl to the corner of his sensual mouth that, together with the rest of the package, oozed sex appeal. Perhaps in his late twenties or early thirties, I could tell from the lines of the extremely well-tailored, expensive silver-grey suit that he wore, that the Suit worked out. He sat with the ease of a fit guy, his stomach iron flat under the waistcoat and white shirt. His pale blue eyes seemed bemused beneath their long lashes, and for the life of me I couldn't get over the fact that he had dark hair.I preferred blondes. Always had.Yet none of them had ever made my lower belly squeeze with lust at first sight of them. A strong masculine face stared into mine--sharp jaw-line, a cleft chin, wide cheekbones, and a roman nose. Dark stubble shadowed his cheeks, and his hair was kind of messy. Altogether, his rugged unkemptness seemed at odds with the stylish designer suit. Braden...\nJoss...\nBraden with his sister Ellie...\nSpeaking of Braden...OMG what a romance hero! Quite honestly he makes the whole book. He's everything you want in a romance hero--sexy, successful, funny, devoted to his family, a little overprotective with those he loves, a little cocky (he does have a healthy ego), intense, generous, understanding, bold...and one sexy, persistent dirty-talkin' (\"I don't know what I like better...\" he mused, stroking his chin in teasing contemplation. \"...the naked you, or you in that tank top. D's right?\") fantastic lover (oh yowza, their first time!) He was just perfect for Jocelyn (as he insisted on calling her); I felt that he really understood her and was patient enough with her while she worked out all the stuff she was going through. Yes, at times I got frustrated with her and wondered why Braden didn't just give up on her (while hoping that he didn't!) but he hung in there, knowing when to push her and when to ease up, even though at times she made it very tough on him. But their HEA was soooo worth it...getting there was a real struggle sometimes but filled with many, many hot (and increasingly intimate) times which made it so much sweeter.Braden and Joss kiss...\nNow, anyone on the fence, let me try to convince you. If you like a fully developed story, with plenty of hot, sexy, steamy scenes that are crucial to the plot (and not just added in to titillate) then this is for you. If you like a complicated, vulnerable heroine who finally learns that it's okay to open up and let people inside, who's ready to put the past behind her and face the promising future that she could have, then this one's for you. If you like a good cry in your reads (no spoilers but you will tear up a time or two), then this is for you. If you like a well-thought out romance, where everything is not always perfect, then this is for you. And finally, if you like a to-die-for-hero, one that you wish could be yours, then by all means this is your book. I can honestly say that Braden Carmichael is one of my all-time-favorite romance heroes, and that this book, On Dublin Street, is one of the best books I've read in 2012. Highly recommended 5+ stars!"}, {"userName": "Jill", "userReviewDate": "Oct 24, 2012", "userURL": "http://www.goodreads.com/user/show/3820197-jill", "userReview": "2.5 starsIT'S NOT YOU, IT'S ME....REALLY!"}, {"userName": "Christy", "userReviewDate": "Sep 12, 2012", "userURL": "http://www.goodreads.com/user/show/11284813-christy", "userReview": "5 stars!\u2028\nOn Dublin Street is one of my favorite books. I’ve been meaning to re-read it for the longest time, so when a friend told me how incredible the audio version was, I made time to squeeze it in straight away. I’m so glad I did. This is one of those books that was even better the second time around.Braden Carmichael is one of the very first book boyfriends I ever claimed as my own. In my original short review, I referred to him as my ‘new literary love’. He is just so damn perfect! I could go on and on about how much I love him. He's smooth, sexy, funny, alpha, and sweet. \nJoss is a heroine I completely adore. I know a lot of people have issues with her, but not me. She is perfectly imperfect. She is flawed in the best way. Her entire life changed when she was younger and she is the person she is because of those changes. She does the best she can and the growth she has is inspiring. She is also so funny. All through the book, her snarky and fun attitude just makes me smile and laugh. I love seeing her open up to not only Braden, but Elle as well. \nSamantha Young is a fantastic storyteller. I find myself getting lost in the world of her characters. This book is wonderful. One of my favorite contemporary romances. Joss’s journey and progression was great to see. And did I mention how steamy it is? Braden and Joss together.. gah! SO hot. If you haven’t read this book, I have to insist you pick it up right away. And if you like audio books, I can’t recommend this one enough. It was fantastic. Meet Braden Carmichael, fall in love with him, and thank me later ;)"}, {"userName": "Lisa", "userReviewDate": "Aug 31, 2012", "userURL": "http://www.goodreads.com/user/show/6010839-lisa", "userReview": "Samantha Young, you can write! I knew this already. It’s really a simple fact. HOWEVER, YOU DEFINITELY WROTE THE HELL OUT OF THIS ADULT CONTEMPORARY ROMANCE!!! Damn!On Dublin Street is Samantha Young’s first venture into the adult contemporary romance genre and it was superbly written, definitely a page turner that I could not put down. This amazingly poignant story had me invested right from the beginning. I laughed, I cried, my heart broke and then it was pieced right back together again!\n“I want this. I want our arrangement. I want you...” I sucked in a breath, feeling my control slip. “...to fuck it out of me.”“Fuck what out, Jocelyn?”Couldn’t he see it? Was my mask really that good? I shrugged. “All the nothing.”\n*******\n“I might never stop fearing tomorrow... The future and what it can take from me, scares me.”\n Jocelyn Butler (a.k.a. Joss) is a twenty-two year old woman living in Scotland after moving there from the United States. She has been through copious amounts of loss and heartbreak in her life. After losing her family and then experiencing another tragedy with her best friend, Joss is very determined to keep people at an arm’s length and basically has vowed to in no way again forge any lasting ties with people. If she stays away from loving people and stops them from getting close they have no power to hurt her and cause her to experience devastating loss once again. Essentially, the girl is a loner and she is in deep denial! She is living in this abysmally lonely world where she shoves her past deep inside her. I can’t say that I always understood where Joss was coming from throughout the book, but I definitely sympathized and saw her as a young girl who had to learn to take care of herself and unfortunately experienced devastating hurt way too young. Joss’ life spirals out of control when her new roommate’s, Ellie Carmichael, brother enters the picture. Hello Braden Carmichael!\n“Our attraction was nuclear. I had never known anything like it. It made Braden Carmichael extremely dangerous to me.”\nEnter Mr. Sex on a Stick with a potty mouth.\n“Asshole.”“Just for that, I expect you to wrap that dirty mouth of yours around my cock tonight.” He narrowed his eyes on me.\nBraden and Joss have an instant primal sexual attraction and I loved the sparring that occurred between the pair due to Braden’s alpha-maleness and his persistence. Joss eventually agrees to entering into a “friends with benefits” relationship with Braden, one that she quickly discovers is being maneuvered and set out by Braden. Needless to say, both Joss and Braden end up developing deeper feelings for one another and the story intensifies from there. Samantha Young does an amazing job giving us a story with many developed layers which are slowly unwrapped. I love how the hidden depths to both Joss and Braden are slowly revealed, making the storyline so much richer. Even though I did not understand Joss’ decisions sometimes, I absolutely loved her. She is a young woman who is very aware that she is messed up and I admired the fact that she sought help when she could no longer deal with matters on her own. Joss is a strong character but Young definitely shows us her soft side and vulnerabilities throughout the book.I also loved the fact that Young did not make out Braden to be this hero with no issues of his own. He has a past, one with hurt and loss as well. Despite this, or maybe because of it, he refuses to see Joss as broken and beyond repair. I loved his persistence and tenacity and his willingness to not give up on Joss, even when she was doing everything in her power to walk away from him. He was most definitely the perfect man for Joss. Sigh!\n“I spent last night going over and over the last six months in my head and I know that you’re lying to me. I know you love me, Jocelyn, because there’s no fucking way I can be this much in love with you, and not have you feel the same way. It’s not possible.”\nSamantha Young has written a very real and profound love story. All I can say is that I hope this is not the last adult contemporary romance book she writes. This wonderfully crafted book is a stupendous achievement and I truly believe that it should be enjoyed by all romance lovers.\nSometimes the clouds weren’t weightless. Sometimes their bellies got dark and full. It was life. It happened. It didn’t mean it wasn’t scary, or that I wasn’t still afraid, but now I knew that as long as I was standing under it with Braden beside me when those clouds broke, I’d be alright. We’d get rained on together. Knowing Braden he’d have a big ass umbrella to shelter us from the worst of it."}, {"userName": "Kristen", "userReviewDate": "Sep 03, 2012", "userURL": "http://www.goodreads.com/user/show/5477946-kristen", "userReview": "41/2 to 5 stars with a caveatOh my gosh, what an emotional, angsty, and enthralling read! I won't go into plot detail considering many reviews have already done a good job explaining what this book is about, but I will share my overall impressions. On Dublin Street owned me from the first page to the last. It had my emotions all over the place–from tremendous frustration to pure elation. Most of my jumbled emotions were due to the heroine, Jocelyn, and her understandable yet exasperating behavior. My heart truly ached for all that had happened to her throughout her young and impressionable years. That said, her constant negative outlook on personal relationships, her fickleness, and her unwillingness to commit to the hero throughout the book drove me crazy! I found it difficult to like or even admire her character because of the way she treated those who cared so deeply for her. Like I said before, I understand why she felt the way she did; she had good reason. Still, I didn't enjoy her dismal and sometimes hurtful attitude. In fact, I found myself desperately wishing for more happy and positive interactions between her and the other characters to help counterbalanced all the angst. On the other hand, Braden, the hero, completely swept me off my feet. At first, I wasn't sure what to make of his flirty, cocky, and beguiling character. His bluntness and arrogance was shocking at times. It didn't take him long, however, to completely win me over and have me rooting for his happily-ever-after. His devotion, compassion, and loyalty to the ones he loved–not to mention his overwhelming sexiness–earned him a place as one of my favorite heroes. The secondary characters were delightful and gave this book, in my opinion, its heart and soul. Especially Jocelyn's roommate and Braden's sister, Ellie. She was such a fantastic and vibrant character. I adored everything about her charismatic and endearing character. If only everyone could be so fortunate to have a friend like her.On Dublin Street is an emotional, angsty, passionate, sexy, and captivating read. The ending was perfect and made all the angst and heartache worthwhile. Although I struggled deeply with Jocelyn's attitude and behavior, I truly loved so much about this book. I highly recommended this story to anyone looking for a realistic, emotional, and memorable read that's overflowing with heart and soul."}, {"userName": "xrysa", "userReviewDate": "Sep 06, 2012", "userURL": "http://www.goodreads.com/user/show/9016476-xrysa", "userReview": "[fart (hide spoiler)]"}, {"userName": "Jessica's Totally Over The Top Book Obsession", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/28967089-jessica-s-totally-over-the-top-book-obsession", "userReview": "3 Emotionally Unavailable Stars\n Lots of Spoilers I was really looking forward to reading On Dublin Street. There were so many amazing reviews on this book. 5 stars here, there, and everywhere. so I just knew I was going to love this book. Then I read it and I wanted to choke the life out of the heroine Joss. Jocelyn Butler aka Joss just about ruined this book for me with her emotional constipation. Don't get me wrong she had a lot of bad things happen to her. Her parents, little sister and best friend died when she was a teen. So some emotional issues is totally understandable, but damn. \nJoss came off in this book as a cold bitch. I get she was suppose to be emotionally damaged and have all kinds of walls up. But she ended up coming off with no personality traits. She was so standoffish that I as a reader didn't get to really know her either. Other than the fact that she hurt Braden and Ellie over and over again with her cowardly ways and coldness. She shut herself off from everyone. For 8 years she didn't deal with her loss or anything really. She just lived in a cowardly state of denial. I would have been fine with that. I would have understood and been sympathetic had that crap stopped when she fell in love with Braden. But nope she hurt him over and over. She pushed him away when he needed her the most. She did it so much that I lost all sympathy for her and just wanted to bitch slap her and tell her to get over it already. \nBraden and Ellie I loved. Braden was sexy and I loved his single minded pursuit of Joss. He wanted her and he wasn't going to take no for an answer. I however didn't get what he seen in her at all. She must have had the magical pussy, because she treated him like shit for almost the whole book. Braden was caveman sexy and had a charm that jumped off the pages. So while I really liked the hero and his sister and I enjoyed parts of this book Joss really brought this read down for me. Although I will say that I didn't hate Joss she just drove me nuts."}, {"userName": "Stacia (the 2010 club)", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/4013351-stacia-the-2010-club", "userReview": "My thought process in stages as I was reading this book :\nStarts out strong...okay, this is interesting...nice, he's pretty smokin' in that alpha male kind of way...hell yeah, this is some hot sex...wow, I like how this story has different layers to it...hold up, he did not just - SIGH...and I think I'm going to start skimming now...okay, the end was sweet.3.5 stars I'm sure people will be surprised that I even went as high as I did because there were a few things in this book that would normally set me off into the danger zone. I'm not sure why I was more forgiving with this book but even I can have my forgiving moments. That said, there was one random section where Braden flipped out of his \"sexy alpha\" mode and right into \"scary alpha\" mode that did make me uncomfortable. The crazy scene went by fast enough though, that I decided not to make a huge issue out of it. Since we had to flip the crazy switch...would you be surprised if I mentioned that the always sure to make me flinch \"love is like a drug\" reference was present! It's as if I'm constantly playing this game of Russian Roulette, waiting for it to show up in my romance novels. We've gone through a few rounds in the chamber, so it's about time for that bullet to make itself known!But wait, if there's a love/drug reference, it means that....YOU GUESSED IT - there must be a bunch of babe/baby/nickname usage happening! It's as if these two things go hand in hand. You can't have one without the other.I'm going to start calling this phenomenon the \"trifecta\" of contemporaries. If one of the above things is present (crazy alpha behavior - love is a drug reference - nickname usage), then there's a chance that the other two things might show up.With that aside, I can honestly say that I did enjoy this one. This was a hot and sexy little romance with enough of a story to balance out the two people dancing around their sexual tension. Normally, I don't like when a therapist is used as a character who will further the plot by allowing the character to bring up the past, but in the case of this story it worked.Other than the one small blip of rage craziness, I liked Braden as an alpha male. While alpha males often work for a pnr or historical book, it's usually tricky to write alphas in contemporaries without them coming across as too controlling for the modern world. He was a balanced character because he had moments when he wasn't serious. I loved the way he would shake with laughter when Joss would get sarcastic and rude with him. Often, I saw Braden's behavior as endearing when he was trying to push Joss. There's probably no way for me to explain this correctly, so I'll just say that his brand of controlling was not too far over the line for me to where it was sending up red flags (again, that one crazy incident aside). I thought it was hot in that \"get down to business\" kind of way.\n\n\"Let me rephrase.\" He took a seething step toward me. \"When it comes to you...I don't like to share.\"\n\nThe sex was verrah nice. And it happened enough to where I didn't feel cheated, even with all of the excess characters and stories happening. I was more than okay with the sex-to-story ratio for a romance book.\n\n\"I want you in my bed. Gentleman are boring in bed.\"\"That's all it takes to make me hard,\" he told me softly, his lips brushing my ear. \"You : saying my name.\"\n\nOne last thing : the use of the word vajayjay should never happen in a book. Ever."}, {"userName": "~ Becs ~", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/2626261-becs", "userReview": "I read a lot of contemporary romances, most of them really very good, but every now and then a book comes along that just WOWS you and you know that what you’re reading is really very special. This is THAT book. I loved every second, stayed up way too late to finish it and then couldn’t sleep because it consumed me with its emotional intensity and I couldn’t get it out of my head.Braden is an incredible hero – I loved him so much. There are book heroes that you like, some that you really love and then there are those mind-blowing, pantie-wetting, exploding ovaries kind of heroes that just make you melt. Braden is one of those! I fell hook, line and sinker for him – from the first moment that he crouched down in front of Jocelyn when she suffered a panic attack at a family dinner and just stared deep into her eyes, brow etched with concern and quietly asked ‘Better?’ without prying or pushing or judging all the way to the incredibly passionate sex scenes, I was his and he was mine!Oh sure, he’s not without fault – he’s arrogant, possessive as hell, has severe caveman tendencies and is very bossy but all this just makes me love him more. He’s definitely been inducted into my Harem of Fictional Boyfriends Hall of Fame.Even the prologue stunned me. We have Jocelyn as a High School teenager in class, kicking back in her chair, not really concentrating on the lesson, thinking more about what boy she fancies –it’s a moment frozen in time. Everything is about to change, nothing will ever be the same again –fate is about to intervene in the cruellest way possible. It’s an incredibly atmospheric scene – Jocelyn’s last moment of normality.She’s about to get the news that her family has been killed in a road accident. This loss, and another incident not long after, cause unimaginable pain that radiates out from her centre to tarnish and darken all aspects of her life for years to come. Pain is threaded through everything and Jocelyn never stops fearing tomorrow, the future and what it can take from her. She locks down her feelings, walls herself off emotionally and never allows anyone to get close – the pain of loving and losing being more than she could possibly cope with again.Then she moves in with Ellie in her flat in Dublin Street and meets her older brother Braden and begins to get close to them which reignites the panic attacks she’d long considered buried in the past. Braden, sensing her reluctance to allow herself to ‘feel’ but knowing beyond doubt that they share a very strong attraction, proposes a sex-only no-strings affair with no commitment and no emotions and Jocelyn agrees. They embark on an incredibly passionate affair and the sex scenes are intensely steamy and delicious but there’s an ambient sadness that pervades the whole story – true happiness and redemption from all her pain is so close but Jocelyn refuses to reach out and grasp it. Her fear of loss is still holding her back.So, this is an incredible journey, so very hard to put down, as the words washed over me like smooth, velvety chocolate. Every character is vividly and consistently drawn and they lived in glorious technicolor in my imagination as I lived every second with them. I smiled at them, laughed with them and most definitely cried what felt like oceans of tears with them – it’s an all-consuming, deeply soulful and emotional story. I’d much rather see this book made into a film than Fifty Shades of Grey.This book is special. You must read it.5 wonderfully emotional starsFor more reviews, please visit Sinfully Sexy Book BlogThanks must go to Debb for the awesome rec!"}, {"userName": "Melissa", "userReviewDate": "Sep 07, 2012", "userURL": "http://www.goodreads.com/user/show/9512968-melissa", "userReview": "Jesus C!Braden Carmichael has got to be one of the hottest book boys I've read since Kellan Kyle AND Christian Grey. Yes. You read that correctly. Braden Carmichael had my \"knickers\" in a twist from the moment his sexy Scottish accent entered my life... \"Most women would be taking advantage of my imprisonment in the taxi with them-chew my ear off, shove their phone number in my face...as well as other things.\"\"Wow, you really think a lot of yourself.\"He grinned back at me, his teeth white but imperfect and his crooked smile sent an unfamiliar shot of feeling across my chest. \"I'm just speaking from experience.\"Knickers. Twisted.Jocelyn \"Joss\" Butler is trying to escape a tragic past. She is private, she doesn't get close to people, she doesn't speak about her family or friends, and is perfectly fine keeping it that way. Joss needs to find a new place and as luck would have it, she answers an ad for a place on Dublin Street which brings her to Ellie. Ellie is fun, beautiful, kindhearted, eccentric and easy to get along with. I personally fell in love with Ellie upon meeting her. \"It's not about her strength. Maybe it's the way she looks or talks that fools people into thinking Ellie's fragile. I know different. Ellie can take the bad stuff and bounce back better than anyone I know.\"As happenstance would have it, Ellie is Braden's younger sister. Of all the dumb luck. You think you run into a hottie and are done with it? Not for good old Joss.Throughout the book, we are taken back and forth through Joss' inner turmoil of her past and how it has affected her. We also have a very perceptive Braden who seems to be able to read her very well and call her out on her bullshit. It is definitely not what she bargained for...\"But you...I think you've made an art form out of deflection and self-possession.\"She wants simple, unattached, uncomplicated. Braden, oh Braden. He can work with that. He is as possessive as he is sexy and it is HOT.He took a seething step toward me. \"When it comes to you...I don't like to share.\"Dirty talk? Absolutely. \"That's all it takes to make me hard,\" he told me softly, his lips brushing my ear. \"You: saying my name.\"Are you intrigued yet? You should be. It wasn't all dirty talk and possessiveness (although I would be okay with that too), as with any \"relationship\" you argue and you banter...\"Sex and holidays.\"\"Uh, what?\"\"I'm making a list of things that make you agreeable.\" I scoffed, pushing my foot into his leg, \"And all you got is sex and vacations?\"\"The length of the list is not my fault.\"Okay so I know it seems I went a little quote happy with this review, but you should see my Kindle. There were so many highlight worthy moments in this book. On Dublin Street was a brilliant mix of passion, love, and trust. How does one deal with inner demons? Jocelyn was taken on a personal journey of how to overcome all of her insecurities and doubts with Braden being a big player in helping her do so. No matter the ups and downs, curve balls will always at some point be thrown your way...\nBut life wasn't a Hollywood movie. Shit happened. You fought, you screamed, and somehow you worked like hell to get out the other side still intact.\nThis book would get WAY more than 5 stars if I could, it is easily one of my favorite books!! EVER."}, {"userName": "\"That's All\" Ash", "userReviewDate": "Mar 13, 2013", "userURL": "http://www.goodreads.com/user/show/5606933-that-s-all-ash", "userReview": "Seriously: my cheeks hurt from smiling so much!And there are dishes in my kitchen that are about, I kid you not, ten feet high because I just haven’t been able to get to them in the last day. The same goes for my laundry. And there’s a distinct *butt* print in my favorite chair, because that damn thing really is a little too comfy for its own good.And you wanna know what caused this?THIS DAMN BOOK!That’s what.Gah, guys… it’s SO FUGGIN’ good!! Like, finger-lickin’ good. :)  ♦ “No human relation gives possession in another – every two souls are absolutely different. In friendship or in love, the two side by side raise hands together to find what one cannot reach alone.” -- Khalil Gibran ♦ \n♦ \n Jocelyn \n ♦\nAt fourteen, Joss found out that her family had been killed in the only way that bent metal, burnt rubber, shattered windshields, and gritty asphalt can kill a family in a single fatal attempt.A year later, she lost her best friend to a broken rope and a reckless river.So, three years later after her best friend’s death, Joss packs up her seemingly half-empty boxes… and moves to Scotland, her late mother’s home country.She finds herself on Dublin Street, hailing for a cab, on her way to meet a potential room-mate. And once again, her life changes on a dime.But in a very, very different way.♦ \n Braden \n ♦\n\n Why the hell did he have to be the human version of a sexually charged nuclear weapon? \nOn a rare sunny day in Scotland, on a very crowded Dublin Street…Braden comes face to face with Jocelyn.And he can’t get her or her sad eyes out of his mind. Especially seeing as she’s his sister’s newest roommate.And despite the newest, gold-digging model of a girlfriend on his arm;Despite the fact that he’s a business mogul with a thousand other things to do;And despite the fact that Jocelyn seems to want completely nothing to do with him;He wants her and her heart that’s trapped between mile-high granite walls and her slow smiles. He wants to see her completely unraveled, relaxed after he’s just fucked the God out of her, and he wants her to be ♦his♦.So he makes an arrangement:\n “You and me. Just sex. Whenever we want. No strings attached.” \nNotwithstanding the fact that Jocelyn would rather just ignore her attraction to Braden… she gives into him and his “arrangement”. She’ll give him her body for three months, but nothing more. Because she knows just too well what happens when you get attached to people.They disappear.But for three months, per agreement, she’ll put herself completely at Braden’s mercy.\n\n “Do you want me to fuck you?” he growled in my ear. \n\n\n “Fuck,” Braden responded, the burr of the word virating against my lips. \n\n\n “Harder,” I gasped. His lips skimmed my ear. “Ask for it, Jocelyn.” \nAnd then the unpredictable happens.During the three months, Jocelyn finds herself falling for Braden. It happens without her knowing.It happens during those lightning smiles, between the merciless laughing and teasing, behind the first time he holds her hand.Jocelyn finds that Braden is taking down all her walls faster than she can rebuild them. And he’s finding out her secrets and holding them as he would his own.But every time she tries to push him away,\n “Let me go,” I whimpered, my lips swollen and sore.“No,” he breathed harshly. “I can’t do this with you.”“Why?”“I just can’t”“Then I don’t accept that.” \nEvery time Jocelyn runs, Braden will catch her. And he’ll do it again. And again. Until he wears her down.Until she doesn’t want to run anymore.Until she falls in love with him. Because she will."}, {"userName": "Aestas Book Blog", "userReviewDate": "Aug 31, 2012", "userURL": "http://www.goodreads.com/user/show/5604583-aestas-book-blog", "userReview": "Almost 4 stars   \"I know you love me, Jocelyn, because there's no fucking way I can be this much in love with you, and not have you feel the same way. It's not possible.\"  I feel pretty torn about how to rate this book. The guy was FUCKHOT!! I loved him. He reminded me a lot of Gideon Cross. But that being said, to me, the heroine's actions and denial of their feelings for each other brought the story down for me. I still did like the story, but her issues and reluctance to commit to the relationship just prevented me from connecting more strongly with the story...When the ultimate tragedy strikes Joss's family, she needs a fresh start and moves to Scotland. Right near the beginning of the story, we meet the hero when he and Joss accidentally end up sharing a cab... and can I just say: deep, gravelly voice + Scottish accent *shivers*!! He comes off as a arrogant (in a lovable way) and unapologetically charming and just totally fuckhot and while Joss is very physically attracted to him, she refuses to allow herself to become emotionally interested in him.After finding herself a gorgeous new apartment, she find that it comes with an even more gorgeous perk - her flat-mate's swoony brother: the taxi guy, Braden Carmichael. At first, there is just a long period of flirty banter but Joss resists quite a lot, until finally they come to a friends-with-benefits arrangement that Braden agrees to, but really is just using it to try and convince her to be in a relationship with him. His grip on my chin tightened, quieting me. “I’ll come over tomorrow night.”This was not happening. How could I let this happen? “Braden, I don’t want anything to happen between us.”He raised an eyebrow, clearly unconvinced. “Tell that to your damp knickers, babe.”I narrowed my eyes on him. “You are such a dick.” The writing starts out quite strong and just totally immerses you into the world and sweeps you into the story. The thing about this story is that on the outside, its kind of flirty and sexy, but you can sense the multiple undercurrents of hurt in everyone's buried back stories. They are all coping with their own personal hell - especially Joss.Although Joss and Braden meet right at the start of the story, their relationship is very slow building. And because of how strongly she resists him, he has his work cut out to woo her. But he does it quite subtly - as if he senses how something in her past is causing her pain, and knows not to push until she's ready.Braden was just a totally gorgeous character - both inside and out. He was swoony, protective.. and did I mention fuckhot?! And you gotta love a man who is bossy in the bedroom but also loved to snuggle. In the relationship, he does make mistakes, but he apologizes for them and does his best to keep Joss from spiralling downward into her personal hell.Joss was very independent, very emotionally closed off and so very deeply hurt and affected by the tragedy in her past that her efforts to shielf herself from ever reliving it leads her to many moments of stupidity on her part. Luckily, for most of those times, Braden is there to call her on it and keep her facing the reality of the increasing intensity of their growing relationship. When she slips, he does his best to bring her back.At first, I very much got a Bared To You feel from this book, but having finished it, I'd say it veers off in quite a different direction.I'd say that I loved the first 5% or so, then the next 30%, I was pretty sure I liked it - but I wasn't sure, and then BAM!! The hotness hit and I was in love with it for a while, but then it took a bit of a downward turn for me again as Joss' insecurities took over her life and caused her to make a bunch of decisions that I really didn't like.Joss takes a long time to fight her demons and learn to be ok in a relationship. I loved that Braden would push her to the edge of my comfort zone, but never over it. BUT, I felt that she took WAY too long to finally give in to the relationship. Overall, I adored the \"fuckhot Scot\" (teehee). And at first, I found Joss's \"moments of stupid\" more forgiveable because at the same time as having her issues, she recognized that she had them and was seeing a therapist to try and work through them. But eventually, her inability to admit she had feelings for Braden despite her CLEARLY having them brought the story down for me and there wasn't enough time of the book dedicated to her and Braden being in a functional relationship after she finally was through them.If you are ok with reading through stupidity from the heroine, you'll probably love this book, but I think part of what annoyed me was I went into it expecting them to have fallen into a bit of a functional relationship for at least part of the book. And I kept wait and waiting and waitng. Then around 30%, I thought I got a wiff of one, then even more at 45%. But then it wasn't until the late 90%'s that she finally gave in. I guess I'd I had expected that from the start, I'd have liked the book more but that just wasn't the kind of book this was. This being said, I think this is the kind of book that would make a really awesome movie (haha and not just cuz I want to hear the Fuckhot Scot's voice ;P )Casting for Braden and Joss:For more of my reviews, visit Aestas Book BlogAnd come join the Aestas Book Blog  Facebook Page"}, {"userName": "Ceilidh", "userReviewDate": "Nov 19, 2012", "userURL": "http://www.goodreads.com/user/show/3229028-ceilidh", "userReview": "So… this was awful.To say that I didn’t like “Fifty Shades of Grey” is the understatement of the year. It was one of the worst books I’ve ever read – a sexist, woman shaming badly written fan-fiction that romanticised an abusive jerk, made “Twilight” look like Dostoyevsky and left us all a little relieved that our own pornographic fan-fiction wasn’t so terrible in comparison. For some reason I have yet to figure out, the series has become wildly popular, with all three books occupy spaces in the top five biggest selling Kindle books of all time, and has led to a smorgasbord of self-published erotica sensations filling the bestseller lists. The big 5 publishers, suffering greatly from the rise of the e-book and seeing their importance in the industry diminish, are scrambling to survive and throwing big advances at self-published big sellers as if it’s going out of business, and one of the biggest books to profit from this has been Scottish author Samantha Young and her Edinburgh set contemporary romance “On Dublin Street”. If I were the publisher, I’d be asking for my money back.Contrary to popular belief, I actually love romance novels. The romance genre is one of the hardest to do well, although I’d argue that most genre fiction is far tougher to write than the literary establishment gives it credit for. However, there are many elements in the genre that have become very popular recently as “Fifty Shades” continues to dominate the industry, no pun intended, and most of them are my personal form of literary hell. Unfortunately, “On Dublin Street” ticks off almost every single square on my bingo card, from the prose to the characters to the ridiculous plot and the so-called romance. Let’s start with the general quality of the writing. This book supposedly had two editors. I can only assume that both of them are prone to frequent bouts of unconsciousness. From the far too frequent misuse of punctuation to the simplest of spelling errors (there were at least three instances of you’re/your mix-ups that I can remember), the book fails on the basic literary level. I don’t care if a book’s self-published or done through the traditional manner. If it’s being sold and marketed as a novel, I expect it to meet the simplest of standards, particularly now that a big publisher has showered this with money and doesn’t seem to care about the quality. Then again, if you’re going to attempt to make a fast buck then perhaps there isn’t time for a quick spell-check. The book is also about a third too long, with massive contrivances, leaps of logic, and just straight-up stupidity from the characters occurring just to get the plot moving. For what is supposedly a relatively simple contemporary romance, there’s a lot in the book that doesn’t make sense. The final quarter of the novel is a jumbled up mess of cheap emotional punches, emotional and illogical flip-flopping, and forced drama, all in the name of dragging the action out a few more pages. It’s unnecessary and in the end just plain boring.There’s no easy way to say this, but the protagonist is irritating beyond belief. She’s so derivative of the genre that I can still see the serial numbers from the assembly line. Joss (renamed Jocelyn by the romantic hero despite her repeated protests – because lack of respect is sexy) is the proto-typical messed up perfect girl – beautiful, snarky but only when convenient, with a traumatic past that conveniently keeps the family out of the scene (Disappearing Parent Syndrome strikes even in adult romance) and absolutely no financial worries. We frequently hear about her big breasts and panic attacks but that is the extent of her characterisation. The dead family is a very convenient plot device to use in fiction because it’s assumed that it will automatically give the character some depth. It doesn’t. It’s just lazy, and in “On Dublin Street” it serves no purpose other than to occasionally move the plot forward and add more angst. Joss frequently goes to therapy to provide some handy summaries of events we’ve just read about (much in the same way fan-fiction does, but this book is 100% original, from what I’ve been told), but the therapy itself does nothing to advance Joss’s character. These scenes also felt slapdash at best. I’ve been to counselling for something similar to what Joss has, but on a much milder level, and it mainly involves crying and spewing out your problems whilst someone listens and hands you tissues. It’s cathartic and incredibly boring to everyone not directly involved. Here, it just doesn’t achieve its intended purpose. Joss is also an incredibly judgemental character, particularly in regards to other women. When I say other women, I mean anyone that’s vaguely considered a threat to her burgeoning relationship with Fifty Shades Alpha Douche Model #3217, Braden. Fortunately for Joss, the author is equally as judgemental towards these women, who are all automatically characterised as gold-digging selfish whores. Joss and Braden happen to be very wealthy, but of course they’re good, generous people. In contrast, every woman who’s interested in Braden seems driven by money. The class element of this really got to me – Dublin Street is part of a rather wealthy area of Edinburgh, and Joss works in the nearby George Street. I’m fine with the typical rich guy romance, even though it’s not my thing, but I truly resented the elitism on display here. Of course, pretty much everything bad that happens in the novel is the result of a woman, because that stereotype’s apparently still fresh for reuse.Braden is a nasty piece of work. Once again we have the wealthy, entitled, extremely handsome and slightly older alpha male imposing himself on the heroine despite her repeated protests, with a conveniently angst-filled back-story packed full of mummy issues, drug-addicted rape victim girlfriends and beating someone to within an inch of their life because it’s the “honourable” thing to do. Braden, of course, has frequent bouts of temper that manifest as violence, and these are far too quickly swept under the carpet for my liking. Violence is not acceptable in these circumstances, particularly when it’s part of the “Get your hands off my woman!” plot strand. Of course (there’s a phrase I’m going to be using a lot), he has absolutely no respect for the heroine’s boundaries, despite her repeated demands. Pretty much every conversation they have follows the same pattern of him imposing himself on Joss, only to be met with protests, then Braden’s smarmy smugness that he knows best and will fuck her until she can’t walk. Once again (OF COURSE!), we have the love interest making possessive demands of the heroine, which include, but are not limited to, walking into her flat without permission, making demands of her choice of clothing and how she does her hair, beating the crap out of another man for approaching her then making veiled threats about how he doesn’t like to share, stealing and destroying her property, initiates sexual encounters with her while she’s sleeping (no discussion of consent, by the way), and, solely to get a reaction from her, tells her she’s a cold, manipulative bitch and says he slept with someone else. None of those things are okay. None of them have a place in a trusting relationship. None of these things are “hot” or “sexy” and none of them are excused or justified by the character’s pitiful backstory. The “messed up bad boy” trope is not a blanket cover for justifying possessive, borderline abusive traits of a relationship. I don’t care how good the sex is (and really, you can read better stuff on Archive of our Own). Telling a woman, after you’ve tricked her into going on a date with you, that if “you try to leave, I’ll tackle you”, is not acceptable. The fact that we continue to normalise such things as romantic terrifies me. At the end of the day, “On Dublin Street” is nothing new. It’s derivative, sloppily written, poorly plotted, dull, full of women shaming, thinly veiled elitism, and the alpha jerk dynamic that we’ve become sadly all too used to in the genre. If the publisher hopes to make a quick buck from this then good luck to them, and hopefully they’ll forget it as quickly as I did. It’s awful, but luckily entirely frivolous and easy to push from your mind. We must take these small pleasures where we can.1/5. My thanks to Edelweiss for the ARC."}, {"userName": "Sophie ", "userReviewDate": "Feb 02, 2015", "userURL": "http://www.goodreads.com/user/show/33135672-sophie", "userReview": "Update 8/6/15: Full review now posted. Jocelyn \"Joss\" Butler is an orphan girl who moves in Scotland four years after the terrible accident that took her family away from her. While trying to restart her life, Joss is ignoring her past on purpose and doesn't face her demons, something that makes her struggle in her present life, trying not to get attached to people around her in fear of also losing them. Her whole world is about to change when she's going to move in her new flat, at Dublin Street. With Ellie, her new roomate and Braden Carmichael, who's pursuing her relentlessly, she will need to face her demons sooner or later if she wants a future with them in her life. She's good at pushing people away, so why is it hard with them? And is she going to succeed in the end or people are going to get hurt?\n\n\"Babe, nice lingerie is for seducing a man. I'm already fucking seduced.\" \n\nI'm still in a book hangover after meeting Braden. This sexy, arrogant man who was sex on legs, he was a swoon worthy book boyfriend. If you haven't mete him yet, go ahead. I dare you to meet him and note fall for him. I also liked the heroine. It's certainly not easy if you have to face the life she did. Losing your whole family in one day is simply unthinkable to me and I have no idea how I would go on with my life, that's why I understood where she was coming from and I could excuse her irrational at times behavior. But I can't deny my heart was bleeding for Braden and Ellie, when she wouldn't let them in. There are so many awesome reviews out there & I'm still at loss for words, even though it's been a week or so since I read this book. It's sexy, witty, funny, emotional & you're going to love the main & the secondary characters. This now belongs officially to my favorite books! I would recommend it to any romance lover. You don't want to miss this, trust me.PS: Thank you, Alice for the recommendation!! I owe you a good one! :))♥"}, {"userName": "Tough Critic Book Reviews", "userReviewDate": "Sep 02, 2012", "userURL": "http://www.goodreads.com/user/show/5336035-tough-critic-book-reviews", "userReview": "I went into this book with absolutely no expectations, not a single one, I just wanted to read a book, any book. Well knock me flat on my ass because I didn't expect that. I didn't expect awesome on a stick (a really hot stick named Braden). Expectations be damned!If we're talking cock full of awesome, then why not 5-stars? Well...the first 30ish percent I just wasn't sure. Do I like this book? Where's it going? Is more coming? Is it getting better? What do I think? I DON'T KNOW!! Then all of the sudden the gigantic hand of awesome came out of the book, grabbed me, and didn't let go!! Not to mention the hand of awesome knew exactly what it was doing.It was one of those books that just kept getting better and better. It was like a ball gaining speed rolling down a steep hill...except there were two balls and those balls belonged to Braden. He was the perfect mix of hard and soft, alpha and prince charming, protector and lover. This book gave me everything I needed and more. It gave me everything I needed on the desk...against a wall...against a cabinet...on the couch...EVERYWHERE! But it wasn't just about sex! It had a great story line, awesome characters, and several funny moments. There was a \"tickle\" scene that caused laughter to shoot from all my orifices! Not to mention I fell in love with Els and Adam. I was almost just as wrapped up in the secondary characters as I was with Joss and Braden.My only complaint was that everything happened too fast, I wanted more. More time with Braden and Joss...more Els and Adam...more epilogue...MORE!!! Please, PLEASE Samantha Young give me more!!!READ ON!"}, {"userName": "♡Karlyn P♡", "userReviewDate": "Sep 25, 2012", "userURL": "http://www.goodreads.com/user/show/1131400-karlyn-p", "userReview": "5 big stars! ON DUBLIN STREET is easily one of the best books I read all year!!! I was blown away by this story.What started off as just another typical girl-meets-boy type romance story, ended up being so much more. The emotions I went through reading this was a roller-coaster ride. I cried, laughed, screamed, swooned, worried, and even got pissed off. I wanted to shake Joss at times, and tell her to let go and just trust Braden. But it was her story, and she had a lot to overcome. In the end, I was a wreck of emotions. And I absolutely loved it. Joss suffered some great tragedies in her young life, first with the deaths of her family and then later a best friend. Realizing her life was spinning out of control, Joss relocated herself from the United States to Scotland where she completed her college education. She got her panic attacks under control. Now a graduate, she hopes to become a writer. When circumstances require her to move and find a new roommate, she finds a beautiful place on Dublin Street and a great roommate named Ellie.Braden and Joss first meet when sharing a taxi cab, and then later she realizes the hot guy is her roommates older brother. The attraction between them sizzles, but he has a girlfriend and Joss is not interested in a relationship. She is just too scarred from some past mistakes of her own, and not ready to get close with a guy. Joss and Ellie become fast friends, despite Joss’s reluctance. There is something about Ellie that makes people just like her, and Joss finds herself opening up for the first time in years. Her friendship with Ellie is just one part of this story that I so admired. It was important for Joss to learn to trust and to allow herself to become close to others. Joss has a part-time job bartending at a local pub, which brings in more fun characters. Braden, Ellie and their mutual friends tend to stop in when she’s working just to say hello. In time, Joss begins to hang out with the gang when she has time off. The attraction between Braden and Joss continues to grow, and soon she learns he has broken it off with his girlfriend.Braden is one of the BEST romantic heroes I have read in a long, long time! He is such a complex person. We watch him try to understand his own attraction to Joss. He wants her physically with a passion, but he also wants her heart. He wants her trust. He simply just wants her -- completely. His devotion to her was swoon worthy stuff!! And boy, can the man talk dirty!! Yummmmmm!!!The romance story starts off as a rocky one, but the heat is turned up to SIZZLE! I loved these two together. But when things seemed to finally work between them, unexpected news hits that shatters their fragile relationship. It nearly broke my heart!The only bit I can complain about is that Joss did get a bit annoying at times, but it was absolutely understandable considering her past. She sees a therapist to help with panic attacks, and we learn much about her progress through her sessions. Her recovery is slow but steady, and I enjoyed watching her come to terms with her past so she can embrace her present and future. There was just soooo much to like in this book! It's the kind of story that sticks with you for a long, long time. What started off as a simple story grew into something very deep and complex. ON DUBLIN STREET was so much more than just a hot, sexy romance. The character development, especially between Braden and Joss, was so well done. And Ellie and the rest of the gang were great fun to read about too. The ending was so pitch perfect and realistic. I seriously recommend this to any romance contemporary fans who like some meaty stories. This was not a fluffy romance read, not by a mile."}, {"userName": "Karla", "userReviewDate": "Oct 03, 2012", "userURL": "http://www.goodreads.com/user/show/3024056-karla", "userReview": "5 Stars! RAWRRRRRR! I am in LOVE with Braden Carmichael, my bags are packed and I'm moving to Dublin Street!Aside from some repetitiveness with Jocelyn's dialogue, it was almost the perfect book! There was tragedy, drama, lust, passion, love, humor, fun, fantastic dialogue and it was SSSSSSSSSIZZLING!I'm not going to get into the story too much, but this book had two of the best and most realistic scenes I've ever read. One had me laughing so hard, I had tears running down my face. We always fear the embarrassing happening when we get involved in a new relationship...well it happens here...I'm chuckling as I'm writing this, no...actually I'm LMAO just thinking about it! The moment and what occurs afterwards is very funny, or at least it was to me. Then the author brings us right into a heartbreaking moment, one second your laughing, then your heart is pounding...the author knows how to toy with the readers emotions. What ensues after that with Braden and Jocelyn...had me gritting my teeth and wringing my hands...again very real and well-written. For a character who initially came off as an egotistical ass, Braden was amazing, caring and loving...what a man. What I enjoyed about him most was his playful side, he got angry, but he also knew how to get even and push Jocelyn's buttons. He was just what she needed to push her full circle and deal with her family's death and other tragic moments in her life. Jocelyn was on a path to self-destruction, then built a wall around herself to protect her from bonding and caring about anyone. Braden didn't just knock that wall down, he annihilated it! There was also a lovely secondary romance with Braden's sister, Ellie, who was also Jocelyn's roommate. I'm hoping the author considers making this a series. There were so many interesting characters that I would love to see featured in a book of their own. Whatever happened to Nicholas? I felt bad for him, even though we barely got to know him. Please Samantha Young, give him somebody to love! Oh and there is a lovely HEA!! *grinning like mad*"}, {"userName": "María Ángeles", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/23830302-mar-a-ngeles", "userReview": "5!!!! 5 estrellas!!!!!!!!!Por el enganche total desde el minuto uno!!!!Porque pasa en Edimburgo!!!! Y como adoro yo Edimburgo...Por Braden!!!!!! Quiero que sea mi hermano!! O mi amigo!!! O mi jefe!!! El casero para ponerme esa casa!!!!!! QUIERO QUE SEA MI AMANTE!!!!!Por Joss!!! Bravo por las mujeres con carácter!!! Bravo por ese paseo del baño a la habitación!!!Y por Ellie, porque es AMOR.No he podido evitarlo... Reseña en el BLOG!!!! http://unablogueraeventual.com/calle-...Yo a este libro recurro siempre que estoy OFF. Me gustaaaa."}, {"userName": "Lady Heather ", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/2736715-lady-heather", "userReview": "5 shiny stars!! I finished this book a couple of days ago, and it has been with me in the back of my mind ever since. I wanted to take the time to ponder what this story meant to me, because I gotta tell you...I was on an emotional roller-coaster while reading it!\nThe characters were..well...AMAZING!  The author introduces us to Jocelyn at the young age of 14. Everything is 'perfect' in her life. She has loving parents and a beautiful little sister whom she adores, then suddenly tragedy strikes, and her whole family is killed in a car crash. Jocelyn is notified at school, where she is in shock, and from that point on she just shuts down in order to survive. She is then placed in foster care where she remains until the age of 18.At 18 she is able to access a trust fund her parents left for her and she leaves the US and travels to Scotland to attend school for a fresh start, and also because she had dual citizenship because her Mom was Scottish.....to present date and 8 years after her parents car accident. Jocelyn is still living a very 'safe' life. She has friends, but trusts no one to open up her heart and herself to....until one fateful day she is apartment shopping and meets Ellie Carmichael. The apartment is fantastic and Ellie and Jocelyn hit it off. Gradually Ellie starts to weave her way into Jocelyn's heart with kindness, compassion, and non-judgement. Ellie starts including Jocelyn in family gatherings, and outings with friends. Ellie also has a wonderfully attractive, domineering, successful businessman, and über-alpha brother who has set his eye on Jocelyn and the chemistry between them is NOVA.This is how I pictured Braedon\n Ellie's brother Braedon has been hurt in the past. Women 'stalk' him because of his success and wealth and try to trap him, so Braedon has 'arrangements' with them so that no one gets hurt, and there's no assumptions or relationship. Jocelyn & Braedon come to an 'arrangement' because their attraction is SO intense. They both agree to have a 'just sex' relationship with no strings. This seems like the perfect solution for Jocelyn.Gradually the 'just sex' relationship turns into spooning, sleeping all night together, and Jocelyn attending social functions with Braedon. Jocelyn fights each one of these actions tooth & nail because deep down she's so afraid of loss that she refuses to get attached.This is were the story gets intense!  Braedon starts to lower his own wall and starts falling for Jocelyn. He knows that Jocelyn has gone through a really tough time, and is so patient with her by making her realize she's safe with him and that he won't judge her. He begins to share and open up to Jocelyn, and Jocelyn soon realizes she wants more in life, and that she needs help dealing with the grief she's buried for far too long. She starts by seeing a councilor, who suggests she write her family's story. While writing the story Jocelyn experiences anxiety attacks whenever she allows her memories of her family to enter her mind. Their journey is so wonderful to read, and it's such a great story of healing, forgiveness and love.Braedon and Jocelyn are now two of my favorite fictional couples. Their passion was so friggn hot to read, it blew my mind how 'hungry' they were for each other.Amazing writing, story and characters!Look forward to reading more from Ms. Young!\nFavorite quotes \"Do you know what's scarier than taking a risk and losing\"? I shook my head. \"Regret, Joss. Regret does awful things to a person.\" \"I know you love me, Jocelyn, because there's no fucking way  I can be this much in love with you, and not have you feel  the same way. It's not possible.\"  \"Because...\" he sighed, \"You, make me laugh, you challenge me,  you turn me on like no else can. I feel like I'm missing  something really important when you're gone. So important I don't feel like myself. I've never felt like someone was mine before. But your mine, Jocelyn. I've known that from the moment we met. And I'm yours. I don't want to be anybody else's,  babe.\""}, {"userName": "Sandra ", "userReviewDate": "May 06, 2013", "userURL": "http://www.goodreads.com/user/show/9752625-sandra", "userReview": "2.5 STARSThis book made me create new shelves, named 'are you fucking kidding me?' and 'disappointments'.After finishing On Dublin Street, i have to ask you guys a question. What the heck is all the hype about?\nTo all the fans of this book, i'm glad you enjoyed it. \nMeet Jocelyn...\nWho is she?A 20 something year old woman who is afraid of people. Of letting them in and getting attached to them. She likes being alone because no one asks her personal questions she doesn't want to answer. She doesn't do relationships, not even one night stands anymore. But when she meets a gorgeous man named Braden, and he proposes an offer of a non emotional sex only relationship, what does she do? Except. Because he's just too sexy to resist. \nMeet Branden...\n\nI'm not talking here about the Braden character from the book. I'm just talking about how hot this guy is. The actual guy from the pic. What can i say? I choose the best castings *wink*. Braden is a rich and successful business man (sound familiar? Read that shit about a million times already), and -like he said- even though he has a girlfriend he's not blind and can recognize a sexy and beautiful woman. He meets Jocelyn in a cab and even though she's not his 'type', he still wants her. There's just something different about her.\nThis book wasn't the worst book ever. It was readable and...Okeeyy.What i hated the most was Jocelyn. SHE WAS ANNOYING THE FUCK AND SHIT OUT OF ME. Ahh, i can't love him.I don't want love, i don't deserve it.He can't love me and i can't love him.It's just sex.I'm better aloneNo one can know the real meI don't want to remember.\n\nLittle spoilers alert - nothing important!!!When Jocelyn FARTED when Braden was tickling her, i was like..\nI was so damn mortified that i actually hid my face between the book! My jaw near damn hit the floor. Is the author serious? Was that really necessary? What's next? She's gonna pee herself all over when she's having an orgasm?And when Jocelyn started throwing dishes at Braden's head when they were fighting i couldn't help but crack up like crazy. I don't know if the author intended that to be funny, but i found it hilarious. \nHowever, there were some things i really liked and that made the book an OK read. Firstly, the writing. I love it! It pulls you into the story, with descriptions well done so you can visualize things pretty easily. I think the book is well written, but the plot has to change and characters have to reborn or something. Secondly, i think the sex was great too! And the ending - it was really sweet.Overall, On Dublin Street was a disappointing read that i really hoped i would enjoy but didn't. The main characters felt cliche to me and i hated them most of the time. The plot was also flat and old. But the style of witting and sex made it so it was an OK read."}, {"userName": "Angie - Angie's Dreamy Reads", "userReviewDate": "Sep 03, 2012", "userURL": "http://www.goodreads.com/user/show/8524618-angie---angie-s-dreamy-reads", "userReview": "5 DELICIOUS BRADEN STARS\n \"I can't get the thought of you beneath me, and that hair spread out across my pillow while I move inside you, out of my head.\" Oh. God. \"But I think mostly it's your eyes. I want something from them no one else gets from them.\" \"And what's that?\" I asked, my voice low, almost hoarse. His words had affected me as deeply as any aphrodisiac.\"Soft.\" His own voice had deepened with the highly sexual atmosphere. \"Soft the way only a woman's can be after she's come for me.\" ~ Braden \nOn Dublin Street by Samantha Young is a fun, steamy and sweet story. Braden Carmicheal was sexy, smooth and heart stoppingly delicious. He's a Scottish man that loves to be in control and is so sexy doing it. A successful buisness man that always gets what he wants and he wants gorgeously broken Jocelyn Butler. Jocelyn aka Joss has had a very hard childhood, she lost her parents and sister in a tragic car wreck when she was fourteen. And because of that is very shutdown and has a hard time dealing with personal attachments to people, she never lets anyone get close. Going through a bit of a life change Joss has to find a new place to live and while looking for that place, as fate would have it, has a run in with Braden. The story really takes off and is impossible to put down.\n\"I can still smell and taste you Jocelyn. And I'm still f*ucking hard.\"My stomach flipped and I squeezed my legs together. \"God Braden....\" I breathed without thinking.\"I can't wait to hear you say that while I'm inside you. See you, babe.\"\nBraden pretty much stole my heart from the first line in the book. I found him to be funny, captivating and the perfect hot alpha male. The sexual tension and chemistry between Joss and Braden is electric and palpable!! I loved how the sexual situations with them played out. I also loved the continual back and forth banter between them, I found it to be endearing, sweet and actually extremely funny. They're quite honestly one of my favorite book couples. I thought this book had just the right amount if angst and drama in it. It was well paced and extremely well written. Overall I fell in love with it. This book is definitely a 5 star read! If you are thinking about reading it, don't wait!!!!! I guarantee you, you won't be disappointed.\nJoss <3 \n\nBraden <3 \n\nFavorite Quotes :\n“I know you love me, Jocelyn, because there’s no fucking way I can be this much in love with you, and not have you feel the same way. It’s not possible.” ~~ Braden“I feel like I'm missing something really important when you're gone. So important I don't feel like myself. I've never felt like someone was mine before. But you're mine, Jocelyn. I've known that from the moment we met. And I'm yours. I don't want to be anyone else's, babe.” ~~Braden “Sometimes the clouds weren't weightless. Sometimes their bellies got dark and full. It was life. It happened. It didn't mean it wasn't scary, or that I wasn't still afraid, but now I knew that as long as I was standing under it with Braden beside me when those clouds broke, I'd be alright. We'd get rained on together. Knowing Braden he'd have a big ass umbrela to shelter us from the worst of it. That there was an uncertain future I could handle.” ~~Joss “Sure it could get rough sometimes, but life wasn't a Hollywood movie. Shit happened. You fought, you screamed, and somehow you worked like hell to get out the other side still intact.” ~~Joss"}, {"userName": "Maria Clara", "userReviewDate": "Oct 08, 2016", "userURL": "http://www.goodreads.com/user/show/46308842-maria-clara", "userReview": "Reconozco que este libro es vicio en estado puro, que te atrapa como pocas novelas, pero, y malditos peros, también que Braden se pasa de macho alfa. En serio, hay momentos en que suspiras por no gritar de pura frustración! E indignación!"}, {"userName": "Dd", "userReviewDate": "Nov 02, 2012", "userURL": "http://www.goodreads.com/user/show/9444787-dd", "userReview": "Fuck,shittity,fuck,shit!!Here I was, thinking that I would be enjoying a nice, uncomplicated romance.Well instead,I was completely BOWLED OVER!!!The story starts with a prologue---(Virginia)Jocelyn Butler is in her class.Her greatest worry—Kyle Ramsey likes her.But her best friend Dru has a huge crush on Kyle.So,she is trying to deflect his attentions.The Principal comes to her class with cops.Her name is called…..and suddenly she has greater worries.Why were they calling her?Had something happened to her parents or her baby sister?\n “Jocelyn,I am so sorry to have to tell you this...but your parents and sister,Elizabeth,were in a car accident.”“They were all killed instantly,Joselyn.I’m so sorry.”\nAnd in just that one moment,her entire world crumbled.....Eight years later---(Scotland)Joss Butler(Jocelyn),is an emotionally closed off woman.No one,NO ONE,is allowed inside the huge walls she has erected around herself.Even her best friend Rhian does not know anything about her.She is calm,cool,collected and very rational.If she does not let anyone come close to her,then she’ll never have to fear losing them.She will be safe.She has been safe for all these years...DUBLIN STREET---She is an aspiring writer.She needs a good place to live.She has been searching for quite a long time,but nothing meets her expectations.She has this last place to check on Dublin Street....On her way she meets Mr. Suit(they were heading the same way and both hailed the same cab.And no,that is not his name.She called him that because of his super-expensive suit).\nMr. Suit-“Are you shy?”. “Most women would be taking advantage of my imprisonment in the taxi with them-chew off my ear,shove their phone number in my face...as well as other things.”\nSoooo…..he is arrogant,tall,super-hot,rich and unbelievably humble**sarcasm**.Between them flares an instant and powerful attraction.She is glad to get off the cab and far away from him.Now,Joss immediately takes a liking to the apartment,and also to her new roommate,Ellie Carmichael.Though chatty,she is sweet and fun to be around.The apartment was gifted to Ellie by her brother Braden,a very rich and successful businessman.She rents the place and starts living there.Everything is fine till she finds out that her roommate’s brother Braden is...Mr.Suit.Well,the safe world of Joss is no longer safe.Braden not only calls her Jocelyn but will do anything to get past her walls.Even if it means making a deal with her--- three months of no-strings-attached sex.So starts their fiery relationship...Jocelyn will never accept her love for Braden,she’s too scared.Braden won’t have anything less.(Well ,I won’t divulge any more.I do not want to spoil the emotional upheaval the readers will be facing.)But Braden,oh...he is so real,so earthy.For once ,I did not feel that a man like this can only exist in my fantasy.I loved him...\n “Babe,nice lingerie is for seducing a man.I’m already fucking seduced.”\nAnd Jocelyn.I part loved her and part hated her.\nSometimes the clouds weren’t weightless.Sometimes their bellies got dark and full.It was life.It happened.It didn’t mean it wasn’t scary,or that I wasn’t still afraid,but now I knew that as long as I was standing under it with Braden beside me,when those clouds broke,I’ll be all right.We’d get rained on together.Knowing Braden he’d have a big ass umbrella to shelter us from the worst of it.This uncertain future,I could handle.\nI did not cry even once while reading it.Then why am I so emotionally wiped out?I have no idea......"}, {"userName": "Beatriz", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/46560610-beatriz", "userReview": "Reto #16 PopSugar 2018: Un libro acerca de una enfermedad o trastorno mental\nUna novela que entretiene, que se lee de un tirón, pero muy pobre argumentalmente. Absolutamente todo se centra en la pareja principal y su círculo de amigos/familiares: que si van a cenar allá, que si van a tomar unas copas por acá, que si se provocan celos, si se ponen ese vestido o el otro, ufff... Entre medio trabajan “en algo” y tienen sexo, tratando de convencerse que es solo sexo. Incluso la situación que genera más conflicto hacia el final, está servida para desencadenar más de lo mismo.Salvo Braden, todos los demás personajes son absolutamente anodinos, incluida Jocelyn, con su problema psicológico y ataques de pánico que, al menos a mí, como personaje, no me llegó ni me convenció. Por el contrario, Braden es un personaje fuerte, cuya personalidad (y una buena dosis de paciencia e inteligencia) es la que permite romper la coraza de una obstinada e irritante Jocelyn.No sé, he leído y me han gustado otras novelas del género que tampoco abarcan más que el avance de la relación de la pareja protagonista, pero mejor escritas y más consistentes. De todas maneras, no descarto leer más de la autora."}, {"userName": "Mandi Schreiner", "userReviewDate": "Sep 11, 2012", "userURL": "http://www.goodreads.com/user/show/2704703-mandi-schreiner", "userReview": "Top Ten Reasons to read On Dublin Street:10. Braden is….possessive.“Braden, I’m not yours.”His arms tightened. “For the next three months you are. I mean it, Jocelyn. No one else touches you.”…“In public, you’re Joss Butler. Cool, self-possessed. In bed, you’re Jocelyn Butler – you’re hot, babe. Uncontrolled. Needy. Sweet,” he breathed. “I like that I know that. I don’t like the fact that other men do too.”9. Did I mention possessive?“Let go of her, asshole, before I tear the flesh from your hand and nail it to your balls.”8. At dinner Braden says things like:“You’re sexy as fuck.”7. There is sex on a desk.One minute I was staring incredulously up at him, the next the soda can was hitting the floor and my ass was on the desk as Braden collided with me. The heat and strength of him overwhelmed me as his large hand gripped the back of my neck and his other tugged my left thigh up, allowing him to push in between my legs and position me over the desk.6. This.“Do you want me to fuck you?” he growled in my ear.I shuddered hungrily. Yes!Instead of telling the truth, I shook my head, trying to maintain some kind of control.5. Braden is intense….“Do you know what it’s been like for me since that day in the flat? Sitting across from you in bars, at dinner, knowing that underneath all the attitude is every man’s fucking fantasy?Oh, he was good.His eyes narrowed as he reached for the buttons and zip on his suit pants. The zip slid down loudly. “I’m going to make you pay for making me wait to have you.The throbbing between the legs got worse.Sounds good.4. Braden likes to snuggle.He did not look happy. “Will you go to fucking sleep?”I glared up at him. “Not with you in my bed. This was not part of the deal.”“One: I bought the bed. Two: it’s just sleeping, Jocelyn.”I ignored the bed comment since it was true. “No. It’s spooning. You said it was just sex. No spooning. We fuck, we have fun, you go home, That’s the deal!”He studied me intently for a moment and then lowered his head until his lips were almost touching mine. “We fuck, we have fun, and then we spoon. I don’t go home. I don’t go home because sometimes in the middle of the night I wake up, and when I wake up, I want to fuck. And for some baffling reason, the person I want to fuck is you. Now, I’m only going to say this once more time. Go to sleep.3. Joss not only finds love with Braden, but a family with him and his sister, Ellie. Her journey is hard in this book, but I really liked it.“Do you need me to come home?”Do you need me to come home?Was I home? Did I need her?2. Joss shows her sense of humor sometimes too…“Babe,” he gave me a look that suggested I was missing the obvious, “I never kid about blowjobs.”The sound of someone choking brought my head up. Our waiter had descended on us just in time to hear those romantic words and his rosy cheeks betrayed his embarrassment. “Ready to order?” he croaked out.“Yes,” Braden answered, obviously uncaring he’d been overheard. “I’ll have the steak, medium-rare.” He smiled softly at me. “What are you having?” He took a swig of water.He thought he was so cool and funny,“Apparently sausage.”1. The final reason why you should read this book – two nights ago, Tori emailed me – Hey, there is this book called On Dublin Street..I think you’d like it! The next day, I saw Angela James give it 4 stars on Goodreads, and Jane from Dear Author said on Twitter she also enjoyed. And that is one of my favorite things about this romance community – getting the word out. This book is fun. Sexy. A little dark. The heroine is prickly, defensive, and refuses to let anyone get close. It’s a rough journey. While the hero is extremely dominant, he also shows his softer side just when she needs it. It’s what I like to call a “crack” book. A book that is over the top emo that you can’t put down. I hope you give it a try."}, {"userName": "AJ", "userReviewDate": "Aug 31, 2012", "userURL": "http://www.goodreads.com/user/show/3143126-aj", "userReview": "Absolutely, freaking LOVED IT!!!I read this in a day, unable to put it down. And I don’t think any review I write can fully represent how much I loved it, but I’m giving it a try. There was just so much about this book that I loved – it’s funny, romantic, swoony and sexy, it’s got drama, and there is a sensational cast of characters. But most of my love can be summed up in two words – Braden Carmichael. HOT DAMN!!! The man is perfect, absolutely perfect! He’s a fiercely protective Alpha, who also has a soft, romantic, swoony side. He’s also sex-on-a-freaking-stick, with a bit of a dirty mouth and is clearly talented in the bedroom. He’s witty, funny, gorgeous and passionate and he does that one eyebrow raised, arrogant smirking thing *melting*. And for a pleasant change, he’s also got it completely together (it’s nice to have a hero who is not a bad boy or deeply traumatised). Oh, and he’s Scottish, so the accent just tops it all off! Perfection! “You’re good with the words, I’ll give you that.”“I’m good with my hands. Will you let me give you that?”“Babe, nice lingerie is for seducing a man. I’m already fucking seduced.”Our hero and heroine meet early on in the book and there is instant, freakishly intense chemistry between them -  “Our attraction was nuclear. I had never known anything like it”. This leads to some brilliant banter, funny moments, more banter and even more chemistry until it all explodes in THE HOTTEST first kiss I have EVER read. O.M.G. My kindle was steaming! Things progress pretty quickly into a very hot, very passionate, yet playful ‘fuck buddy’ agreement. There's heaps of steam, gorgeous tender moments and scenes that had me laughing out loud (the entire conversation when they went out for dinner was hilarious!). And it is clear to all that there is more to it than that. \"After last night, there’s no denying the promise of what’s between us. I’m not backing off, so rather than coming up with a new defence – which I’m sure I’d find highly entertaining – just give in, babe. You know you’re going to eventually.\" Our heroine, Jocelyn (Joss), is messed up. She is very independent, driven and intensely protective of her past. She has major issues letting people in, and I loved how the story of her past and the extent of her trauma is slowly unravelled throughout the story. She does have some annoyingly stupid moments, and her reluctance to open up to Braden goes on for a bit, but it’s all part of her dealing with her past, and I love how Braden never gives up on her… “I know you love me, Jocelyn, because there’s no fucking way I can be this much in love with you, and not have you feel the same way. It’s not possible.” SWOOOOON!!!The side characters were awesome – Rhian and James, and particularly Ellie and Adam – and their stories were a huge part of the book. The developments with these characters had a major impact on Joss, and I loved watching it all play out. There’s a gorgeous epilogue that will make you squee, and my only complaint with this book is that I want more! I highly recommend this book to anybody who loves a great romantic story. 5 awesome stars!* * * * * * * * * * * * * * *Bonus scenes:Three pivotal little scenes from the sensational On Dublin Street, straight from the head of the Fuckhot Scot himself - Braden Carmichael.OMG, if there's anything better than reading about the man, it's reading his POV.This little collection of awesome contains:- The (Naked) Second Meeting- The First Kiss- For Ellie and JocelynGorgeous, arrogant, sexy and in love. The man is perfect, and these scenes are a must read for any Braden fan. They can be found here - http://www.ondublinstreet.com/p/bonus..."}, {"userName": "Katrina Y", "userReviewDate": "Sep 04, 2012", "userURL": "http://www.goodreads.com/user/show/4932646-katrina-y", "userReview": "OH MY GOODNESS!!!!!!!!!!!!!!! It's that good."}], "description": "Jocelyn Butler has been hiding from her past for years. But all her secrets are about to be laid bare ...Four years ago, Jocelyn left her tragic past behind in the States and started over in Scotland, burying her grief, ignoring her demons, and forging ahead without attachments. Her solitary life is working well - until she moves into a new apartment on Dublin Street, where she meets a man who shakes her carefully guarded world to its core.Braden Carmichael is used to getting what he wants, and he's determined to get Jocelyn into his bed. Knowing how skittish she is about entering a relationship, Braden proposes an arrangement that will satisfy their intense attraction without any strings attached.But after an intrigued Jocelyn accepts, she realizes that Braden won't be satisfied with just mind-blowing passion. The stubborn Scotsman is intent on truly knowing her . . . down to the very soul.", "title": "On Dublin Street\n      \n          (On Dublin Street #1)", "url": "http://www.goodreads.com/book/show/15760001-on-dublin-street", "average": 4.23, "cover": "https://images.gr-assets.com/books/1490401910l/15760001.jpg", "reviews": 8434, "authors": [{"url": "https://www.goodreads.com/author/show/4167378.Samantha_Young", "name": "Samantha Young"}], "type": ["New Adult", "Contemporary", "Romance", "Romance", "Adult"], "outlinks": ["http://www.goodreads.com/book/show/15760001-on-dublin-street", "http://www.goodreads.com/book/show/15938668-on-dublin-street", "http://www.goodreads.com/book/show/15775781-on-dublin-street", "http://www.goodreads.com/book/show/22663045-calle-dubl-n", "http://www.goodreads.com/book/show/17617111-calle-dubl-n", "http://www.goodreads.com/book/show/16140408-down-london-road", "http://www.goodreads.com/book/show/23355069-hero", "http://www.goodreads.com/book/show/17970255-into-the-deep", "http://www.goodreads.com/book/show/17665083-until-fountain-bridge", "http://www.goodreads.com/book/show/18115061-before-jamaica-lane"]}