{"ratings": 6569, "userreviews": [{"userName": "Nat", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "Any writer promised to bear similarities to either Mindy Kaling or Roxane Gay will have my immediate interest in the palm of their hand. And Scaachi Koul did not dissaopint with her wry humor and telling insights on a plethora of subjects. Dealing with fear, anxiety, grief, parenting, insecurities, racial discrimination, racial advantage, shadism, white privilege, sexism, feminism, online harassment, sexual harassment, diversity in media, and so much more. Koul won my heart over almost instantly with her essays.\nSourceBut most of all, I knew I was a goner when she talked about her family. Getting to read about a small piece of her Kashmiri family history was intoxicating. I wanted more and more and more. Her parents remain two of the most caring and daring ones I've had the pleasure to read as of late.And I'm not even kidding when I say that most of my favorite pieces were about them. I mean:“My dad first saw her at his cousin’s house—my mom was her friend—and was flustered by her beauty. Ask my dad and he’ll wax poetic about my mother’s cheekbones, her rich eyes, her long hair, how he needed to get to know her. My mom didn’t even know he was there.”#GOALS.“Nothing bad can happen to you if you’re with your mom. Your mom can stop a bullet from lodging in your heart. She can prop you up when you can’t. Your mom is your blood and bone before your body even knows how to make any.”Daughters showing love for their mothers is how my heart remains fulfilled.“In the fifth grade, I got my hair chopped off in an ill-advised pixie cut, some two feet of dark black hair sheared off me like a sheep. Mom gathered it all and stuffed it into a heavy-duty Ziploc bag. “What are you doing?” I asked her as she tucked the bag into her purse. “When you’re older,” she said, “you’re going to get married, and this we can use for hair extensions on your wedding day.” She put the hair in the deep-freezer in the garage and it’s still there; sometimes when I root around for Pizza Pockets I will instead pull out a bag filled with my DNA. My mother would like a wedding, please, and it is not optional.”This is so extra. I love it.\n\n“Papa ends most of his calls with me the way you might close a conversation with someone you want to menace. “Anyway,” he’ll say, “I’ll be here. Staring into the abyss.” Or, when I have given him good news, “The talented will rule and the rest will perish in the sea of mediocrity.” Or, when I have given him bad news, “I am sorry for everything that happens to you, as everything is my fault.” HE’S SOMETHING ELSE…“When he started watching The Wire he answered the phone with “What up?” or “Who dat?” or some other linguistic appropriation that does not actually appear in the show. If I don’t acknowledge this greeting (perhaps with a similarly enthusiastic, “It’s ya boy”), he will say it another two or three times. It’s important that you notice this good mood he is in, because it is fleeting.”Real talk, I want a whole book where Scaachi Koul gets to talk solely about her dad, please. 5/5 stars just for him. And so I loved how each essay ended with a snippet from one of her emails with her dad. I got to a point where I was looking forward to see what would be shared next at the end of each written piece.“None of this—the impatience, the frustration, the willingness to hold a grudge against an inanimate object—is new to me. He’s always been waiting for something to ruin his life. When I was little and would pretend to be a doctor and he my patient, he’d ask me surprisingly real questions about his hypertension and cholesterol, when all I wanted to do was “test his reflexes” by hitting him in the shin with a plastic mallet. He colours with Raisin but wants her to do something more “cerebral” with her talents. “No, don’t colour like that,” he says. “Colour in the lines. The lines! Well, if you’re going to do it that way, at least do some Cubist-inspired art. Show your inner angst. Show how angry you are at the establishment!” She frowns at him and tries to ignore his commands. “Yes,” he says. “Colour Dora’s face.”This is the quality content I'm here for.Also, I lived for this iconic moment when her dad was introduced to Scaachi's older (by thirteen years) boyfriend:“They shook hands. Papa led him into the kitchen, where all serious family matters tend to take place. He offered Hamhock tea. “You look good,” Papa said. “For someone your age.” Let me rephrase, this is not an iconic scene this is THE iconic scene. However, since I kind of disliked her boyfriend a lot, my enjoyment was lowered every time he was mentioned. (Which turned out to be quite a lot for a memoir...)But circling back to the positives, all of the pieces are entertaining, riveting and humorous, but some worked better for me than others. Like, the piece on body hair -which I'm still beyond grateful that someone finally wrote about in a book- remains one of my favorite essays.“I didn’t shave more of it off. I didn’t want James to know he had gotten to me, so I figured I’d wait until the summer, the way I did for my moustache and brows, so that everyone would just forget I ever had hair in the first place. In class, though, James noticed the bald patch on my forearm. He laughed. “Did you try shaving your arm because I told you that you were hairy?”James works in finance now. He lives in Boston. We are all eventually punished for our sins.”THIS GIRL.\nAnd last but not least, this crucial piece on social media and interaction:“Who do you even talk to on Twitter?” Papa asked me after I told him I had rejoined. “Who could be so important there?” I thought about my family’s traditional Kashmiri last name, how any other Kashmiri can point us out in a phone book and know where we’re from. This has, literally, happened: when I was still living at home, a recent immigrant looked up our listed number, called us, and asked if he could come over to talk to my parents and get some help integrating. Mom made him fried vangan and Papa offered him chai and I was perplexed that my otherwise very private, very protective parents let a complete stranger stroll into their home just because he came from the same region they did. But they were trying to find connection, to talk to someone who understood them. I will likely have to tell you, here, that vangan is eggplant, but online, I can find someone in mere seconds who already knows that. Our worlds become a little smaller, we feel closer, we feel less alone.”One Day We'll All Be Dead and None of This Will Matter is something I won't be forgetting anytime soon. Candid, outspoken, laugh-out-loud funny essays are the way to my heart. And I hope we'll get to see similar books released in the very near future because I crave more and more and more. \nNote: I'm an Amazon Affiliate. If you're interested in buying\n One Day We'll All Be Dead and None of This Will Matter, just click on the image below to go through my link. I'll make a small commission!\nThis review and more can be found on my blog."}, {"userName": "Maxwell", "userReviewDate": "Apr 26, 2017", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "This was delightfully funny and surprisingly heartfelt. The first essay really got to me, which I wasn't expecting. She's a talented writer and storyteller, and she tackles some pretty serious themes—sexual assault, race, gender dynamics, and cultural difference. But I did feel like they lacked a bit of substance and could've done with a bit more reflection rather than simple narrative. That's not to say that there aren't really strong points and important lessons in this collection; I can see this resonating with a different audience much more than it did for me. But it's still one I would recommend, especially if you are looking to get into non-fiction/essay collections at all. 3.5 stars"}, {"userName": "Esil", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "3.5 stars. One Day We'll All Be Dead and None of This Will Matter is an engaging collection of personal essays. The author is a young Canadian woman who's family is originally from India. She grew up in Calgary and lives in Toronto. Her personal essays deal with, amongst other topics, family, relationships, race, body image, hair, drinking, family weddings and her parents' reaction to her older white boyfriend. Her essays feel young, irreverent, angry and honest -- at times bordering on a bit too much honesty for me. There is also plenty of humour and the odd swear word. Many times, Koul made me feel old, but I enjoyed the window into her world. Thanks to Netgalley and the publisher for an opportunity to read an advance copy."}, {"userName": "Melki", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "There's nothing earth-shattering here, just some fun, and (mostly) funny essays by a young Canadian writer who describes herself as a woman who somehow manages to get both of her hands stuck in two different salsa jars at the same time.Koul covers a range of topics from romance to hair removal. She really won my heart with her essay about clothing, and the hopes we women pin on finding just the right shirt, skirt, or jeans.It's happening, I thought. The item, the big item that changes the way I dress and thereby changes the way I am as a person. It's not just a skirt; it's the entry fee for a better existence. I would exude a new confidence, it would smooth out the wrinkles in my body, it would hide all the ways I have disappointed and failed people in the past. While wearing it, women would approach me and beg me to tell them where I got it. I would act coy and wink to the camera (in this version of the fantasy, I am perpetually in a commercial; don't worry about it) and say something like, \"I'll never tell\" or \"Oh, just something I picked up.\" People would see me on the street shoving fistfuls of Teddy Grahams into my mouth on the way to the podiatrist, and they would think, \"Boy, that lady sure does have her life together.\"Koul sparked a real shit-storm in early 2016, when she asked that submissions to BuzzFeed Canada be from people \"not white and not male.\" She received so many angry online tweets, she began responding with quotes from Good Will Hunting, but she closed her Twitter account after getting too many rape and death threats. I was getting a few hundred notifications a day, all largely negative, all vaguely menacing. Many of the essays deal with family, particularly the author's strained though frequently hilarious relationship with her father. Papa Koul is fond of using the silent treatment as a way of punishing his daughter's transgressions. Despite the grief she has obviously caused him, he was kind enough to write a very funny author bio for this book. Maybe everyone is just mellowing with age.Few things get less complicated as you age, but your family, that at least should become easier. You should eventually make peace with everyone, with their decisions and their quirks. With your parents in particular, you should fight less because you have less time to fight.In all, not a bad collection of essays from a gal who's only 26 years old.AND, she really knows how to rock red lipstick, something I've never been able to master."}, {"userName": "emma", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/32879029-emma", "userReview": "I mostly just found this profoundly...eh. So I'm not going to review it, probably."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "Perfect for fans of Lindy West, Roxane Gay, and Jenny Lawson. With the added commentary on skin color in India vs. Canada, I felt like I was gaining one more perspective on what it means to have brown skin and how that changes based on where you are (and her surprising excursions into privilege.) The parenting emails made me laugh, her compassion towards her parents was impressive in that she could see the humor while also being annoyed. I will definitely be recommending this to other readers when it comes out.Thanks to the publisher who gave me early access via Edelweiss."}, {"userName": "Julie Ehlers", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/2120450-julie-ehlers", "userReview": "I was initially going to give this two stars, but now that I have some distance from it, I like it even less. I'm just going to one-star it and not waste any more time thinking about it."}, {"userName": "Mariah", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/22371819-mariah", "userReview": "One of my favorite genres that I read a ton of is autobiographies. So of course when I saw the really unique title of this autobiography I had to read it. Well, this one was nothing special. It wasn't funny. It did dig deep. This was just an \"okay\" book. One that since I started it I might as well finish.This book collection of essays about Scaachi Koul growing up with Indian immigrants in Canada. Then moving halfway across the world for college. Like I said, nothing special. No need to read this."}, {"userName": "Rachel León", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/21291796-rachel-le-n", "userReview": "(4-4.5 stars, rounded up because Scaachi Koul is smart and funny as hell)I interviewed the author this morning, which is why I think I'm qualified to say, yes, she really is smart and funny. This collection of essays tackles issues like racism, sexism, body image, and rape culture, while also infusing each one with personal stories and a generous dollop of humor. My favorite essays were \"Fair and Lovely\" and \"Mister Beast Man to You, Randor,\" but there wasn't an essay I didn't enjoy. Scaachi Koul is so great and so is this book. If you don't believe me, check out my interview with her: https://chireviewofbooks.com/2017/05/..."}, {"userName": "Nenia ✨ Queen of Literary Trash, Protector of Out-of-Print Gems, Khaleesi of Bodice Rippers, Mother of Smut, the Unrepentant, Breaker of Convention ✨ Campbell", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/2190064-nenia-queen-of-literary-trash-protector-of-out-of-print-gems-khalees", "userReview": "Instagram || Twitter || Facebook || Amazon || PinterestI was notified recently that my library just added a ton of books that I recommended, including several memoirs written by people of color and YA about LGBT+ characters. One of those books was ONE DAY WE'LL ALL BE DEAD AND NONE OF THIS WILL MATTER by Scaachi Koul, a culture writer for BuzzFeed Canada.I'd been looking forward to this book for a while. I love BuzzFeed and I had heard that this book was going to address many topics like feminism and racism and cultural identity. Plus, it's written by someone who's roughly my own age, give or take a few years, and it's always amazing to read books written from someone in your generation - especially if their observations are written from a different perspective than your own. It's like seeing the world with new eyes...for better or for worse.ODWABDaNoTWM is about Koul growing up in Canada in the 90s and early 2000s. The daughter of immigrant parents from India, she was in the unique position of being the only \"brown person\" in an area of Canada that didn't have many minorities at the time (I'm blanking on the exact location, but I believe it was a part of Calgary that was mostly white). She writes, with candidness and humor, about internal and external racsim; sexism; interracial relationships; rape culture; substance abuse; beauty standards; and dating. She's incredibly witty and makes some very cutting observations on Canadian and Indian culture, but she also talks about what she loves about these two different cultures, too, and how they have helped shape her identity and make her into the person she is now. Also, her relationship with her family, especially her parents, is both endearing and hilarious. I love how she includes some of her emails to her dad.I really loved this book. Koul brings a fresh perspective to the millennial memoir collective, which seems to be mostly overrun by YouTube celebrities and pop stars. Not that there's anything wrong with that, but I prefer books with a little more substance. This is the second book I've read that was written by current- or ex-BuzzFeed staff (the first was I HATE EVERYONE BUT YOU by Allison Raskin and Gaby Dunn) and let me tell you, I am impressed. Both ODWABDaNoTWM and I HATE EVERYONE BUT YOU are pitch-perfect and culturally relevant, discussing many relevant and controversial issues that millennials - especially female millennials - face on a day to day basis.You should definitely read this.4 to 4.5 stars"}, {"userName": "Lata", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/13126933-lata", "userReview": "I found myself laughing out loud as I read. I enjoyed Scaachi Koul's take on her family, misogyny, the conflict between being a good daughter and finding her own way in life. There were some points at which I found myself saying, \"Yup, I know EXACTLY what you mean!\" when she described the often ridiculous and sometimes crushing expectations foisted on Indian daughters."}, {"userName": "Alaina Meserole", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/50620706-alaina-meserole", "userReview": "One Day We'll All Be Dead and None of This Will Matter: Essays definitely attracted me with the title. I mean, who wouldn't want to read this book - it just got me hooked.I've also been on like a non-fiction kind of binge lately and when I saw that this was available at my library I just had to have it! Scaachi is a blessing in disguise. I loved everything about this book. She talks about a whole range of things within this thing, like: dealing with fear, grief, parenting, insecurities, discrimination, sexism, feminism, and a whole bunch more. Overall, I really enjoyed everything that Koul wrote and probably laughed a whole bunch of times. I liked getting to know more about her and I found it so freaking interesting that she used to work at Buzzfeed! I freaking love that place - I constantly watch their videos on youtube or check their website whenever I'm bored.Loved this book and can't wait for the next!"}, {"userName": "Book of the Month", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/46126209-book-of-the-month", "userReview": "Personal Essays That Are Equal Parts LOL and WTFBy Judge Kevin NguyenAn essay collection hinges entirely on the voice of its author, so let me characterize Scaachi Koul's: rude, angry, sometimes crass, always fiercely intelligent and hilarious. In her debut, Koul tackles regular essay collection stuff—meditations on relationships, family, identity – but the best part of it is that she’s funny as sh*t.I laughed out loud on a dozen occasions throughout this book, from her descriptions of a torturously long five-day family wedding in Jammu to stranger details. For instance, Koul refers to her boyfriend affectionately as \"Hamhock,\" a “sweet, precious moron”; she hides packets of sweet-and-sour sauce in her bra. One essay starts with this line: “Like farts and the incorrect retellings of classic literature, racism is a lot cuter when it comes out of a little girl.”Koul was raised in Alberta, Canada, her Kashmiri parents having immigrated from India. She writes often about her family, and if there’s a strong thread that runs through the book, it’s one of lineage. Koul has inherited parents’ anxieties and fears, the baggage that comes with being born brown.Beyond the personal, some essays cover topics about the larger evils of the world. For instance, “Mute” details the Twitter backlash Koul experienced when she encouraged non-white, non-male people to contribute to BuzzFeed (where Koul works). Alt-right poster-boy Milo Yiannopoulos sent his followers after her, which turned into a terrifying flood of rape and death threats. Learning about her experience firsthand will make you shiver and want to lock your virtual internet twitter deadbolt door. Koul reveals a core truth about Internet trolls: “what they say to me online is the purest distillation of the rage they feel.”But the most powerful essay in the book is “Hunting Season,” which illuminates the way men prey on women. We're talking about observation on the most primal level. “Men watch women at the gym, at work, on the subway: in any space occupied by men and women, the women are being watched,” Koul writes. The perils of course are steepest at the bar: as Koul says, “When a guy asks to buy you a drink, suggest he buy you a snack instead and see how that goes over.”In the end, it becomes clear the title of the book is a bit of a joke. One day we will all be dead, but after reading Koul's essays, you'll recognize that these things do matter. They matter so damn much.Read more at https://www.bookofthemonth.com/one-da..."}, {"userName": "Carol (Bookaria)", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/1880531-carol-bookaria", "userReview": "Wonderful memoir from Buzzfeed senior writer Scaachi Koul. She is a first-generation daughter of Indian immigrants and in the book she discusses her experiences growing up in Canada, racism she faced, body image issues, day-dreaming fantasies, hair issues, and her relationships. Specially interesting is the relationship with her parents, I found hilarious some of the interactions she had with them. I could relate to some of her experiences and enjoyed reading her essays.I listened to the audio book which is narrated by her and, some sections, are narrated by his father. It was so funny and cute, I loved his sections. I mean, her actual dad! Awesome :)(image source)More about the author:InstagramTwitterFacebookWebsite"}, {"userName": "Megan", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/5060801-megan", "userReview": "1.5 stars. I really wanted to like this, and I hate writing negative reviews, but I really struggled. I just couldn't figure out why I was reading the personal essays of a young 20-something who hasn't done anything. The most interesting parts happened to other people, like the Indian wedding, or her friend in college who struggled with alcoholism. But nothing happened! We don't even have a resolution to the alcoholic's story- she never explained what happened to him, only about how she was mad for a while and now she's over it? I literally forced myself to finish this, because I'm trying to read all of my BOTM on time to justify the subscription cost, but I really regret not choosing American War instead...and I chose ODWABDANOTWM because I thought it would be an easier read! It was not. Her voice is good and she's funny, but that's not enough to justify an entire book about nothing. She's no David Sedaris, not yet at least. I think in a couple of years, after she's done and seen more, she will be a great talent."}, {"userName": "Leonicka", "userReviewDate": "Oct 20, 2016", "userURL": "http://www.goodreads.com/user/show/7223729-leonicka", "userReview": "Scaachi's voice is wholly unique. She is cringingly funny (in a good way, I swear) but I found myself tearing up quite often. This isn't a treatise on millennial Indian women or a manifesto on the first-gen immigrant story or some bullshit like that.She makes no attempts to tell a universal story and I so appreciate that. She just offers her own story and it is more than enough."}, {"userName": "Caroline", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/38672507-caroline", "userReview": "THERE were one or two essays in here that I really enjoyed. I would say that 'Fair and Lovely' was my favourite because it was interesting and funny and just great overall. The book as a whole left me feeling a little underwhelmed. I did really enjoy it but not nearly as much as I'd expected to. The essays were quite funny which I enjoyed but they were too casual a lot of the time and didn't always hit the message home. There were some great anecdotes and I'm glad I read this book. I just think my main problem was that although they made good points and were interesting, they didn't seem to build to any conclusion."}, {"userName": "Samantha Price", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/5619506-samantha-price", "userReview": "About halfway through this book I became obsessed with Scaachi Koul. I delved deep into her twitter, going one - two - years back, laughing at and with her and her unique take on life. Scaachi is Indian, lives in Toronto, and is a Buzzfeed writer. This book touches on race, gender roles, privilege - all thoughtful and not always tasteful (but hilarious and charming nonetheless). My favourite parts, though, were the very real and honest accounts of her family life, how it shapes us, how we become nostalgic for the safety our family can provide us (such as in her essay \"Tawi River, Elbow River\"). I'm calling this a must-read for 2017."}, {"userName": "Laima", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/5032407-laima", "userReview": "I never heard of this book or author, Scaachi Koul, until a free copy landed in my lucky lap.It’s not the sort of book that would have been on my radar to search for at the local library. I do love surprises though, especially books that catch me off guard. And this was one of those lovely surprises!Where do I begin… Well, this book was very funny. Scaachi Koul doesn’t hold back - she describes her life experiences with candor and honesty (don’t hold back tell us what you really really think type of honesty). Raised as first generation Canadian of Indian descent, we learn a lot about her life, especially the cultural clashes between her and her parents. She loves her family even though they annoy her. She especially adores her niece Raisin (a cute nickname) and Hamhock, her boyfriend. Each chapter is a slice of Scaachi’s life. We learn about her fear of flying, leaving home to attend university in Toronto, her beloved cousin’s week long arranged wedding in India, as well as her issues with hair and whiteness.It was an enjoyable read. I recommend it to everyone for a fun break from their usual genres. Thank you to Doubleday Canada for sending me a free copy of One Day We’ll All Be Dead And None Of This Will Matter. **I won this book from GoodReads Giveaways**"}, {"userName": "Taylor Knight", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/12627819-taylor-knight", "userReview": "I'm so glad I picked this book up. I don't read a lot of non-fiction but this is one of the best non-fiction books I've ever read. I loved it from the very first page and I never wanted to put it down. I thought it was incredibly funny and a few of the stories Scaachi told had me laughing out loud. There was also a good deal of serious stories about Scaachi's experiences as an Indian women with immigrant parents. I really appreciate the opportunity to read about Scaachi's perspective and for her voice to be heard. One Day We'll All Be Dead and None of This Will Matter is very unique and sincere. It's one of the best books I've read and I absolutely loved it. I would highly recommend this book to anyone looking to pick up a non-fiction read."}, {"userName": "Katie", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/29387065-katie", "userReview": "I can't even begin to describe how much I loved this book. Everyone I know is going to get it for their birthday for the next five years. My dad will probably be a little confused at first but whatever."}, {"userName": "Lorilin", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/5887880-lorilin", "userReview": "This is a collection of essays from 26-year old Scaachi Koul, a Canadian-born daughter of Indian immigrants who currently writes for Buzzfeed Canada. The essays cover a wide range of topics including family relationships, dating, internet trolls, alcoholism, rape, anxiety, race, and culture. I think my favorite sections of the book are about Koul's family. Oh, how I wish her dad had a Twitter account...The book is entertaining and youthful, but also surprisingly thoughtful. I appreciated Koul's honesty and willingness to poke fun at herself. There are some preachy moments that irritated me, but Koul's earnestness keeps the collection grounded. It's easy for me to see that she's just genuinely trying to figure life out, and I like and respect her for that. So One Day We'll All Be Dead (etc.), is a quick, light read. It's pretty much what you expect a memoir written by a 20-something to be, but it's one of the best books in that category that I've read. I hope Koul keeps writing, because I am definitely interested in reading her future books.ARC provided by publisher through Net Galley.See more of my reviews at www.BugBugBooks.com."}, {"userName": "Alice Lippart", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/27078093-alice-lippart", "userReview": "A funny, interesting and heartfelt collection. Loved the parts about the author and her father. I do think it lacks a bit of depth and reflection, but it's worth the read."}, {"userName": "Roxanne (The Novel Sanctuary)", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/40407379-roxanne-the-novel-sanctuary", "userReview": "4.75This book was great. It was hilarious and insightful and I was able to relate to so much more of it than I would have ever thought. I laughed out loud many times, Koul was able to put into perfect words so many thoughts I've had in my life. I didn't always feel as if the essays flowed well from one to the other to make the most cohesive collection but maybe they weren't supposed to. Loved this, definitely recommend it."}, {"userName": "Krista", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "While Canada purports to be multicultural, Toronto in particular, a place where everyone is holding hands and cops are handing out ice cream cones instead of, say, shooting black men, our inability to talk about race and its complexities actually means our racism is arguably more insidious. We rarely acknowledge it, and when we do, we're punished, as if we're speaking badly of an elderly relative who can't help but make fun of the Irish.\nWith One Day We'll All Be Dead And None Of This Will Matter, Scaachi Koul joins the ranks of other web-based writers – like Lindy West or Jenny Lawson – who have lately collected essays into book form, and as with these other writers, I find Koul's writing to be smart, funny, and self-deprecating; a suitable tone for exploring weighty ideas without getting all heavy about them. Yet I confess to finding a samey-sameness to this writing – to the web-shaped voice; the breezy confessionals; the casual f-bombs – and when one could be reading their ideas for free and at leisure on BuzzFeed, Jezebel, or The Bloggess (when I never personally seek out long-form web-based writing; pretty sure I'm not the target audience for your average BuzzFeed article), I need a reason to pick up one of these books. I was led to ODWABDANOTWM by a glowing newspaper review, and happily for me, as she is the Calgary-born daughter of Kashmiri immigrants, Koul does have an interesting and unique viewpoint – on being a Canadian, and a woman, and a bridge between two cultures – and I was enlightened and entertained by the whole thing.\nOnly idiots aren't afraid of flying. Planes are inherently unnatural; your body isn't supposed to be launched into the sky, and few people comprehend the science that keeps them from tumbling into the ocean. Do you know how many planes crash every year? Neither do I, but the answer is more than one, WHICH IS ENOUGH.\nKoul opens her book with an essay about a trip she took to Thailand with her boyfriend Hamhock, and this allows her to introduce the three most important people in her life: the boyfriend who encourages Koul to do the things that scare her, and the overprotective parents who try to keep her safe by promoting fear. She deals with outright racism and subtle shadeism – in India Koul is considered very light-skinned, but in Alberta she was the brown kid; she recognises and is uncomfortable with her own shadeism (and especially as it relates to her niece, Raisin, whose mother is white) – and details the time that trolls (calling for her rape and murder) forced her off Twitter for a while. She writes about party-culture at university and rape-culture in general (and the two times she was roofied); she writes about learning to accept her body and the futility of fighting against it with clothes and compulsive grooming. And throughout it all, Koul speaks long distance to her parents every day; needing to hear their voices as much as they need the reassurance of hers. The essays are broken up by email exchanges she has had with her father throughout the years, and each of them made me laugh at his quirkiness. After reading about their visits back to India (and Koul's rejection of sexism and patriarchy and all the old, traditional ways she finds there), the final essay – in which Hamhock forces Koul to finally tell her parents about him (after four years together) – didn't end the way I expected: Although they liked Hamhock when they met in person, Koul's parents were adamant that the older, white man wasn't suitable for their daughter. And when she moved in with him despite their objections, Koul's father stopped talking to her for months, with the following serving as the semi-hopeful ending to the book:\nPapa has never been the strongest person in the family – that's always been Mom, who carries everyone's burdens on her back. He's never been the most stubborn either – that's always been me. He's not even the most sullen – that's my brother, at least since my birth. But Papa will crack, putting his surly contemplations about my relationship aside for good and not just in temporary bursts, as suggested last week when he answered the phone with, “The vagaries of time are taking their toll” (believe that this is him in a good mood), or a month before when he ended our call with, “You are brave, you are too brave.” Or at least I need to believe in his ability to let things go when they are ultimately out of his control, because otherwise we're both just alone, spinning separately when we're supposed to be in this together.\nI found that a sad note to end on. Like Koul, I have lived in Alberta, and although I currently live within an hour of her on the other side of the country, my experience as a (older, white) Canadian woman couldn't be more different. I might not have found much unique about the web-shaped voice Koul writes in, but her story is entirely her own, and worth hearing."}, {"userName": "Susan Feng", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/64511856-susan-feng", "userReview": "It's nearly 1 AM, but it felt important to get this down in the moment. It's been a while since I've finished a book in the middle of the night, and when I closed this book after reading the last few pages of acknowledgements, I cried. Heavy, hot, mysterious tears, my sinuses stinging.I can't pin point why I'm weeping. Maybe it's because I too grew up as the child of first-generation immigrant parents who worked hard, harder than they should've ever had to. Parents who loved me the best way they knew, but often clashed with this incomprehensible hybrid of a daughter they had as I grew older.Her experiences from her trips to India were at once not at all the same and exactly the same as mine the two times I've flown to China in the last sixteen years. The frustration of the stifling customs mingled with the melancholy of knowing you've lost parts of yourself, your history, your people's history.Beyond that, her explorations into what it is to be a woman in Western society: a woman with opinions, a woman who drags uncomfortable topics into the spotlight, or simply a woman who's had too much to drink. I've been lucky to not have experienced abuse or trauma, but I remember every injustice, professional or personal, that have happened to the women in my life. I remember all too well the time I half-carried my roofied friend out of a house party and took her to the emergency room.Scaachi's voice is unique, fierce, unapologetic. Her humour cuts like a knife, threaded deftly through the sometimes heavy topics of her essays. She achieved the rarity in writing, producing something that made me feel a striking connection, a clarity, a sense of recognition.I look forward to her future work, and I wish all the good things for her. And her parents + Hamhock + Raisin + Sylvia Plath The Cat."}, {"userName": "Victoria", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/4979626-victoria", "userReview": "Honest review of ARC (Goodreads Giveaway): I hoped to like this book, but didn't anticipate just how much I would love it. I knew a bit about Scaachi Koul from some of her Buzzfeed essays, but didn't quite know what I was in for with this book. Yet, from the very first essay, I was emotionally hooked. Koul weaves a kind of intimacy through these essays that is sometimes absent in other memoir essay collections (sorry, Mindy Kaling and Ellen DeGeneres). Despite having had very different upbringings and experiences, I felt a sense of relief reading her essays-- someone else knows how I feel and what I worry about. It is this kernel of raw humanity at the centre of each essay that makes the collection so good. We may not all have been to an Indian wedding, but we all know what parental/family pressure feels like; we may not all have been cut out of a skirt with a stuck zipper in a fitting room, but we all know what feeling insecure about our bodies feels like. The title, depending on how you read it, has two contradictory meanings: one day ... none of this will matter / one day this will matter . Accordingly, Koul tells stories about her life that are seemingly small and ostensibly won't matter in the grand scheme of things, and yet the way she tells them and connects them to shared human experiences (pains, fears, desires, questions) suggests a hope that these small things do matter."}, {"userName": "Bailey", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/3506967-bailey", "userReview": "I used to read a lot of these, quirky contemporary essay collections by women, all rising stars in the literary community, fresh voices, unique perspectives. But then I stopped, because, really, they all started sounding the same. They all had the same structure and beats. But I picked up this one for book club, and I remembered why I fell in love with this type of book. This is funny and insightful, smart and thought-provoking, an actual fresh perspective on the regular topics. I really enjoyed this in every possible way. It's not perfect, but it is really excellent. There are so many moments in here that I won't stop thinking about for a long time."}, {"userName": "Lisa", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/8051792-lisa", "userReview": "One Day We'll All Be Dead and None of This Will Matter is an easily digestible collection of essays on Koul's angst about a variety of subjects like body image, drinking, Twitter, skin color and her parents. The author has an appealing, vulnerable style but I soon I became weary of her focus on self without the balance of wisdom or reflection. I know this sounds jaded - but there was nothing new here for me."}, {"userName": "Preeti", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/2110092-preeti", "userReview": "***This book is out today, May 2, and you should totally get it and read it!***I’d been salivating over this book for a while, ever since I’d seen it on multiple lists last year of forthcoming books. A month ago I thought it was out but realized that was just in Canada and not the U.S. Found it on Netgalley and finally was able to read it after begging the publisher to approve me on Twitter. :DScaachi Koul is a Buzzfeed writer who’s probably best-known for when she put out a request on Twitter for non-white writers and started a completely undeserved shitstorm. The very people who often disparagingly call liberals “special snowflakes” lost their freakin’ minds. Anyway, before I go off on that tangent (and she talks about this whole episode in her life in the book)...Koul is the child of Indian parents, specifically parents from the Kashmir region of India, so that’s another reason I wanted to read this: I’m really interested in reading writing of people with whom I can identify, even a little bit.In that, the book didn’t disappoint. The struggles of an immigrant or the child of immigrants are uphill, especially when you’re younger, and Koul really gets into that, throughout multiple essays. One thing that I think a lot of brown people who grew up here can identify with is this particular line: “I tried to force myself out of brownness at her age, but the older I get, the more I tuck myself into it.” When you’re younger, you try to separate yourself from your culture to fit in (despite all the shit you face from your parents for doing so), but as you grow older you realize what a mistake that was.Fitting is a luxury rarely given to immigrants, or the children of immigrants. We are stuck in emotional purgatory. Home, somehow, is always the last place you left, and never the place you’re in.Some of the strongest parts of the book were when she talked about her parents: their experiences as immigrants, their relationship with her, their perceptions as people living away from their homeland. I saw a lot of my parents reflected in her parents, and it made me consider them in ways that I probably hadn’t enough thought to before. This line especially resonated:So much of immigration is about loss. First you lose bodies: people who die, people whose deaths you missed. Then you lose history: no one speaks the language anymore, and successive generations grow more and more westernized. Then you lose memory: throughout this trip, I tried to place people, where I had met them, how I knew them. I can’t remember anything anymore.Her experience of returning to a place in India as an adult that she’d previously visited only as a kid could have been me doing the same thing in my life. Knowing that others have these same feelings and experiences, and reading about them, is so validating. I’m so glad that voices like Koul’s have a place now in mainstream culture. You don’t think about it actively, but it’s like all the arguments being made for having more than just white people on TV and in movies: Representation matters.The essay on rape culture, Hunting Season, was another stunning, strong piece. I’d actually read it before on Buzzfeed (which leads me to believe that much of the book may be from pieces she’s already written online), but it can certainly be read over and over and shared with everyone you know. Her insights on how men watch women are so on point.Surveillance feeds into rape culture more than drinking ever could. It’s the part of male entitlement that makes them believe they’re owed something if they pay enough attention to you, monitor how you’re behaving to see if you seem loose and friendly enough to accommodate a conversation with a man you’ve never met. He’s not a rapist. No, he’s just offering to buy you a beer, and a shot, and a beer, and another beer, he just wants you to have a really good time. He wants you to lose the language of being able to consent. He’s drunk too, but of course, you’re not watching him like he’s watching you.And of course, the aforementioned chapter on the disgusting harassment she faced on Twitter was another fantastic essay. I highlighted the hell out of that section but I’ll leave just this one quote here:But all things built by humans descend into the same pitfalls: loathing, vitriol, malicious intent. All the things we build in order to communicate, to connect, to find people like us so we feel less alone, and to find people not like us at all so we learn how to adapt, end up turning against us.Basically, throughout most of this book, I would sigh softly and highlight something and reflect on what I’d just read. There were definitely things that Koul writes that I disagree with but hers is an interesting, and often hilarious, perspective to read. I’ve been shouting about this book to everyone, even before I finished it, and I already know a couple people I’ll be buying it for. Highly recommended.Note: I received this book from NetGalley in exchange for an honest review."}], "description": "A collection of essays about growing up the daughter of Indian immigrants in Canada, \"a land of ice and casual racism,\" by the cultural observer, Scaachi Koul.In One Day We'll All Be Dead and None of This Will Matter, Scaachi deploys her razor-sharp humour to share her fears, outrages and mortifying experiences as an outsider growing up in Canada. Her subjects range from shaving her knuckles in grade school, to a shopping trip gone horribly awry, to dealing with internet trolls, to feeling out of place at an Indian wedding (as an Indian woman), to parsing the trajectory of fears and anxieties that pressed upon her immigrant parents and bled down a generation. Alongside these personal stories are pointed observations about life as a woman of colour, where every aspect of her appearance is open for critique, derision or outright scorn. Where strict gender rules bind in both Western and Indian cultures, forcing her to confront questions about gender dynamics, racial tensions, ethnic stereotypes and her father's creeping mortality--all as she tries to find her feet in the world.", "title": "One Day We'll All Be Dead and None of This Will Matter", "url": "http://www.goodreads.com/book/show/30658435-one-day-we-ll-all-be-dead-and-none-of-this-will-matter?from_choice=true", "average": 3.78, "cover": "https://images.gr-assets.com/books/1469411966l/30658435.jpg", "reviews": 899, "authors": [{"url": "https://www.goodreads.com/author/show/15117590.Scaachi_Koul", "name": "Scaachi Koul"}], "type": ["Nonfiction", "Writing", "Autobiography", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/30658435-one-day-we-ll-all-be-dead-and-none-of-this-will-matter", "http://www.goodreads.com/book/show/29635591-one-day-we-ll-all-be-dead-and-none-of-this-will-matter", "http://www.goodreads.com/book/show/34510591-one-day-we-ll-all-be-dead-and-none-of-this-will-matter", "http://www.goodreads.com/book/show/32794516-one-day-we-ll-all-be-dead-and-none-of-this-will-matter", "http://www.goodreads.com/book/show/40391714-one-day-we-ll-all-be-dead-and-none-of-this-will-matter"]}