{"ratings": 49, "userreviews": [{"userName": "Fiona Moran", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/80538395-fiona-moran", "userReview": "I really don't understand how this book got so many 5 star reviewsThis book didn't grab my attention for the very first chapter. I didn't like any of the characters and thought that Charlotte and Q had absolutely no chemistry. It was honestly cringey to read. Did you know that Charlotte was thin? No, I wouldn't have figured it out either if it wasn't pointed out 100+ times. The characters come off as really superficial, and I even found it painful to skim."}, {"userName": "Nate", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/32726092-nate", "userReview": "Love Quentin & Charlette. This one was so good I couldn't put it down. Wow. I'm voluntarily leaving an honest review for a copy of the book."}, {"userName": "MJM", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/50109257-mjm", "userReview": "Quentin used to be a rock star and fit into the lifestyle perfectly.  But he cleaned up his act and is now owner of his own business as CEO, is a single dad and is a good guy.  But when Charlotte comes as a intern for his firm, he wishes he hadn't set in place the no fraternisation policy as she is driving him nuts!!!  The attraction between them is off the charts and in this fast paced book by Kira Blakely we learn their journey to their own HEA. It is a terrific story that I really enjoyed with great characters - Quentin has still got that bit of rock star in him and he let's that free again when they meet.  The passion between them is RED HOT and all I'm going to say is fans/air cons on now - you know what I mean!  get ready to also fall in love with his daughter Morgan.  There is a fabulous extra bonus from Charlotte's POV, an exclusive book plus a bonus story which I'm going to enjoy reading.  I received a free copy of this book via Booksprout and am voluntarily leaving a review.  But as I loved this story so much I bought my own copy and look forward to reading the extras plus Kira's next book!Definitely recommended - get a copy now to read!"}, {"userName": "Cassie", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/49238907-cassie", "userReview": "** spoiler alert ** Reformed manwhore and drug addict, Quentin McDonnell now takes his job as chief editor and father seriously. Charlotte has dreamed of working for Mad Music Magazine since she was little and has always had a crush on Quentin. One rule stands in there way: no fraternizing between employees! Will Quentin and Charlotte be able to resist the pull between them? Will they be able to work out a way to be together?This book was hot! I was happy that Charlotte was able to pull Quentin back a couple of times when his past behavior popped up. Quentin drove me insane with his back and forth, BUT I understood why and I was honestly happy with his dedication to her once he gave into his feelings. Didn't like Pamela at all and would have loved to see something happen to her and Maggie! Great book and cannot wait for more from this author!"}, {"userName": "Magali", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/63353655-magali", "userReview": "It’s a great written story, quite simple and sweet with some hot sex scenes. I liked the characters and their alchemy and the magnetism between them.Charlotte is an aspiring writer and she starts working as an intern in a music magazine. The boss is Quentin, an ex rockstar. Charlotte was a fan and she knows that since he’s a father, he stopped all exces. They’re attracted, but they try to resist because she wants to build her career by herself and if anyone knows she has a relation with Quentin, her career will be destroyed. Quentin doesn’t want to be involve even if she’s the only woman he's attracted to since the birth of his daughter. Despite this, he can’t stop to go to her.So between the company, his family and their love, it’s complicated.I voluntarily reviewed an Advance Reader Copy of this book"}, {"userName": "Margaret McGovern", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/22067441-margaret-mcgovern", "userReview": "4 stars This was a very good contemporary writer/rockstar romance. Quentin was a rock star years ago and was into the drinking, drugs and women. Now in his 30's he's the editor of a music magazine. He has a 7 year old daughter he adores. Charlotte came from small town Ohio to become a writing intern at the same magazine. The moment they met they felt a change in themselves. Unfortunately, there's a no fraternization rule. Pasts, secrets and a whirlwind surprise romance keep the attention of the reader. I received a complementary copy of this book and chose to write a review. I look forward to reading future books by Ms. Blakely."}, {"userName": "Jurae", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/81146026-jurae", "userReview": "Good readI enjoyed reading this book it gave me a sense of deja vú. Charlotte is an intern at the magazine run by former rock legend Quentin. Their attraction is immediate and it seems that they are destined to be together when Charlotte finds herself living down the hall from Quentin but the non-fraternization clause in their contracts would test their limits. The characters were believable and the story line was great."}, {"userName": "Bonita", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/73884987-bonita", "userReview": "PerfectionAuthor Blakey drew me in on this book from the first few pages and kept my interest until the very last page, it is that well written. I fell in love with main characters Charlotte and Quinten with their witty banter and their sexual chemistry. Quinten’s daughter Morgan is such a little imp and her and sassy mouth had me laughing throughout the book. I highly recommend you read this gem.l"}, {"userName": "Kristine", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/11441447-kristine", "userReview": "Short pass the time readDefinitely should be longer. Mean girls and doom and gloom for 25% of it. Good thing Tony was thought of. I didn't understand the contract, the ten years that went by and why Maggie would even still be hanging on. As for the mean girl intern with limited music background, why would a magazine keep her once the internship was done?"}, {"userName": "Gladys", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/60886838-gladys", "userReview": "I enjoyed this steamy read. A workplace/boss romance that has a fun storyline, likable characters, and some heat filled scenes. with hot chemistry, a bit of drama, and a lot of passion, this book is a read that is entertaining and enjoyable. A engaging story of rules, temptation, and surrendering to it. I'm posting a voluntary, honest review."}, {"userName": "Wendy", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/14276776-wendy", "userReview": "I LOVE KIRA BLAKELY!!All of her books are effin amazing!!I loved this book! it had it allthe angst between the hero and heroine was just so well written. their chemistry is out of this world.the story just flows and Morgan is the cutest little thing!a definite recommend"}, {"userName": "Christine", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/19611573-christine", "userReview": "arc review honest review. Charlotte is a 23-year-old intern ,Quiten took over the magazine for musicians and artists to make top magazine today. he also was a musician too .they live next-door to each other this is a 10 star story."}, {"userName": "Anne Schofield", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/48748484-anne-schofield", "userReview": "Dads I love them A great book and more than one nice to read and interesting enough to keep me reading a lovely read"}, {"userName": "Vanessa", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/78097433-vanessa", "userReview": "I absolutely loved this 📖."}], "description": "I want to shove her against the wall and f*ck the innocence right out of her.There's just one problem.She interns for my company and we have a no fraternizing policy.As a single dad, I don't have time to get wrapped up in scandal.This is going to be... hard!Imagine my shock, ok, desire, when I stumble upon her in the elevator where I live and find out she's just moved in.I can't take it anymore. Her firm bre@sts, peeking out beneath her business suit. Her bright smile, greeting me, making me hard the minute she looks at me.It's too much!This is so wrong. And WTF was I thinking making a no-fraternizing policy?Well, we know which head will win this battle. I've been wearing the good guy hat too long.F*ck being Mr. Nice Guy. Nice guys finish last.I'm going back to the old me. I'll show her what a real man is like.I'm going to finish. Again, and again.\nIn celebration of Father's Day, this newly revised insta-lust will have you wishing you were single. Totally over the top. Totally satisfying. AND if that's not enough to keep you hot and bothered, you'll get an extra scene with a twist from Charlotte's point of view. Exclusive new book and one bonus story inside! The main story is a 60k word full-length novel and ends at 34% on your Kindle.", "title": "One Hot Daddy: A Single Daddy Romance", "url": "http://www.goodreads.com/book/show/40214539-one-hot-daddy", "average": 4.24, "cover": "https://images.gr-assets.com/books/1527338062l/40214539.jpg", "reviews": 14, "authors": [{"url": "https://www.goodreads.com/author/show/15957286.Kira_Blakely", "name": "Kira Blakely"}], "type": ["Romance"], "outlinks": ["http://www.goodreads.com/book/show/40214539-one-hot-daddy", "http://www.goodreads.com/book/show/36619702-surprise-package", "http://www.goodreads.com/book/show/34892307-one-hot-daddy", "http://www.goodreads.com/book/show/35920526-she-s-mine", "http://www.goodreads.com/book/show/36496433-forbidden-daddy", "http://www.goodreads.com/book/show/35515583-protecting-her"]}