{"ratings": 1147, "userreviews": [{"userName": "Emily May", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "[Unless Trump isn't really president. Then you can wake me up. (hide spoiler)]"}, {"userName": "Brina", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "What a special reading year it has been. It seems like it was just last year at this time, when I said that I had read more than I had ever dreamed of. Never did I think that I would surpass that just one year later. In 2017, I undertook a personal Pulitzer challenge and read 20 books across all platforms and also only read books by women authors during International Women's History Month, and hope to continue with these next year. I have read novels and memoirs by favorite authors including Isabel Allende, Amy Tan, Anna Quindlen, Jhumpa Lahiri, and Chimamanda Ngozi Adichie, and discovered new favorite authors including Carson McCullers, Alice Hoffman, Colin McCann, and Julian Barnes. Some made my best of the year, and others enriched my reading experience even if they missed the cut as best of the best. I also took on co-moderating positions in goodreads groups the baseball book group and retro chapter chicks and stayed active in some old favorites including reading for pleasure and catching up on classics and much more. Each group and its members has contributed to my reading year, and I would not have nearly all of the suggestions I have without input from all my groups and all of my goodreads friends, whether they take the time to read and comment on each review I write or participate actively in groups or are just silent friends. Thank you all.From a personal standpoint, the Cubs did not repeat as World Series champions but I have been able to keep the memory current by watching videos and through the book The Cubs Way: The Zen of Building the Best Team in Baseball and Breaking the Curse, which I gave a special mention award to. The Patriots did manage to win the Super Bowl with an epic comeback, but I have been reliving their adventure through videos rather than books, at least for now. On a more personal level, my youngest daughter started first grade this year and is now reading chapter books with ease. I decided to include favorite books read by my kids this year because they all love to read, and they read a variety of quality books. My reading story of the year actually belongs to my seventh grade son. Recently, he completed I Don't Care if We Never Get Back: 30 Games in 30 Days on the Best Worst Baseball Road Trip Ever as an independent reading assignment. One of the book report choices was a fictional q and a with the author, but he took it one step further. I emailed the author Ben Blatt to see if he could answer my son's questions, and he was happy to participate, this after just publishing a new book and being involved in his own busy life. This memory will stay with my son long after he finishes school and I hope will contribute to all of my kids being lifelong lovers of reading.I wish everyone a wonderful rest of their reading year, an amazing 2018 reading year, and an enriching holiday season, whichever one you celebrate. So without further ado, my favorites of 2017:Nonfiction: The Warmth of Other Suns: The Epic Story of America's Great Migration by Isabel WilkersonI Never Had It Made by Jackie Robinson97 Orchard: An Edible History of Five Immigrant Families in One New York Tenement by Jane ZiegelmanShoe Dog: A Memoir by the Creator of NIKE by Phil KnightThis Is What a Librarian Looks Like: A Celebration of Libraries, Communities, and Access to Information by Kyle CassidyElectric October: Seven World Series Games, Six Lives, Five Minutes of Fame That Lasted Forever by Kevin Cook84, Charing Cross Road by Helene HanffThe Death and Life of the Great Lakes by Dan EganThe Undoing Project: A Friendship That Changed Our Minds by Michael LewisLords of Finance: The Bankers Who Broke the World by Liaquat AhamedPlays:Anna in the Tropics by Nilo CruzSweat by Lynn NottageIncident at Vichy;: A play by Arthur MillerPoetry:The Woman Who Fell from the Sky: Poems by Joy HarjoOlio by Tyehimba JessLife on Mars by Tracy K. SmithNative Guard: Poems by Natasha TretheweyDigest byGregory PardloContemporary:The Namesake by Jhumpa LahiriAmericanah by Chimamanda Ngozi AdichieA Gentleman in Moscow by Amor TowlesLillian Boxfish Takes a Walk by Kathleen RooneyThe Housekeeper and the Professor by Yōko OgawaThe Ministry of Utmost Happiness by Arundhati RoyThe Mambo Kings Play Songs of Love by Oscar HijuelosDo Not Say We Have Nothing by Madeleine ThienGreat House by Nicole KraussThe Whale Rider by Witi IhimaeraThe Noise of Time by Julian BarnesA Tale for the Time Being by Ruth OzekiClassics:One Hundred Years of Solitude by Gabriel García MárquezZorba the Greek by Nikos KazantzakisAnna Karenina by Leo Tolstoy Lonesome Dove by Larry McMurtryThe Godfather by Mario PuzoA Tree Grows in Brooklyn by Betty SmithThirteen Days: A Memoir of the Cuban Missile Crisis by Robert F. KennedyA Room of One's Own by Virginia WoolfThe Member of the Wedding by Carson McCullersUnexpected Hidden Gems:New Negro Poets U. S. A. edited byLangston HughesThe Parnas by Silvano ArietiSpecial Mention:The Cubs Way: The Zen of Building the Best Team in Baseball and Breaking the Curse by Tom VerducciDisappointment of the Year:Malinche by Laura EsquivelSome Favorites Read by My Kids:I Don't Care if We Never Get Back: 30 Games in 30 Days on the Best Worst Baseball Road Trip Ever by Ben Blatt -- seventh graderTheodore Boone: Kid Lawyer and others in series by John Grisham-- seventh graderThe Brooklyn Nine by Alan Gratz-- seventh and fifth gradersMr. Lemoncello's Great Library Race by Chris Grabenstein-- seventh and fifth gradersThe Mysterious Benedict Society and series by Trenton Lee Stewart-- fifth graderThe Whale Rider by Witi Ihimaera-- fifth graderFrom the Notebooks of a Middle School Princess and series by Meg Cabot-- fifth, third, and first gradersThe Doll People by Ann M. Martin-- first graderHarry Potter and the Sorcerer's Stone by J.K. Rowling-- first graderDear Mr. Henshaw by Beverly Cleary-- first grader and myself as well!"}, {"userName": "Bookdragon Sean ", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "This review marks the end of my fourth year of goodreading! 222 books & 70000 pages = 2017I’ve read so many books this year, some great and some terrible, though I’ve learnt so much and gained so much. I finished my undergraduate degree, started a master’s degree and undertook some freelance review work. It’s been so much fun!\nSo here’s my breakdown: \n-My top five:1. Siddhartha is beautiful and wise, one of the best pieces of fiction I have ever read. 2. Lolita employs such creative and artful language to describe some truly horrific things. 3. To Kill A Mockingbird made me cry and it made me laugh, such a powerful story. 4. The Long Earth is imaginative and vast. It made me think of all sorts of possibilities and even made me consider picking up a pen myself. 5. Murakami has wrote some fantastic books. I've not read enough of them. This year I got through five, next year I may do more! And my least favourite : 1. La Belle Sauvage was the most disappointing book released this year. 2. Animal farm I found to be rather boring and overrated. 3. Never Let me Go didn’t deliver what it ought to have done. My ten book challenge was also a blast:1. A Clockwork Orange by Anthony Burgress2. Animal Farm by George Orwell3. Beloved by Toni Morrison 4. Lolita by Vladimir Nabokov5. Norwegian Wood by Haruki Murakami 6. The Road by Cormac McCarthy 7. The Murder of Roger Ackroyd by Agatha Christie8. Why Be Happy When You Could Be Normal by Jeanette Winterson9. The Sellout by Paul Beatty 10. To Kill a Mocking Bird by Harper LeeI'm looking forward to telling you all what next year's is going to be! :)Happy New year!"}, {"userName": "Mischenko", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/1194517-mischenko", "userReview": "You can also see this at https://readrantrockandroll.com/2017/...This has been one incredible year of reading. Even though I joined Goodreads in 2008, I didn't remain active, and this year has been my first full/active year here. I've thoroughly enjoyed discussing reviews, learning about new authors and books, making new friends, and increasing my TBR up to 13,559!This year I started my own book blog which includes most of my book reviews and much more. I think this was a pretty good decision for me and I've made some wonderful blog friends and met some incredible authors too. I enjoy sharing my reviews here on Goodreads and in the blogging world. I also started the \"Meet The Reader\" series where I introduce some of my friends from Goodreads so that other people can discover them as readers and see their likes and dislikes. This year I've read 418 books after setting my challenge to 400. Honestly, a great number of those are children's books which makes the number seem insanely high! There's no way I could read that many full length books in one year! I may have missed a couple, but here are the book's that stand out for 2017. Favorite Adult Reads:Dark MatterA Little LifeSweet Bean PasteWatching Glass ShatterUntil Tuesday: A Wounded Warrior and the Golden Retriever Who Saved HimThe Bear and the NightingaleThe White RavenThe Song of the SirinTuesday's Promise: One Veteran, One Dog, and Their Bold Quest to Change LivesA World Without Color: A True Story Of the Last Three Days With My CatAll the Ugly and Wonderful ThingsThe Last Bar In NYCThe Appointment: Lost and Found (Book 1): Volume 1WintersongThe Sword of GoliathThe True Story of Hansel and GretelPanther in the SunEye-Openers:Just Around The Bend: Más o Menos The Dead InsideS.O.P.H.I.E. / The World Might Not Live Through the NightTrance: Formation of AmericaWhat a Waste: Where Does Garbage Go?Thanks For The Memories ... The Truth Has Set Me Free! The Memoirs of Bob Hope's and Henry Kissinger's Mind-Controlled SlaveStanding Strong: An Unlikely Sisterhood and the Court Case That Made HistoryFavorite Children's Reads:The Frightened Little Flower BudThe Little Red WolfThe Secret Life of the Red FoxSwimming with Sharks: The Daring Discoveries of Eugenie ClarkTarra & Bella: The Elephant and Dog Who Became Best FriendsThe Unicorn in the BarnMeatless?: A Fresh Look At What You EatVampyreIvan: The Remarkable True Story of the Shopping Mall GorillaSaving Audie: A Pit Bull Puppy Gets a Second ChanceWoolvs in the SiteeThe Bear ReportEscaping the Nazis on the KindertransportPig the PugMoto and Me: My Year as a Wildcat's Foster MomWe're All WondersThe Raven and Other PoemsTuesday Tucks Me In: The Loyal Bond between a Soldier and his Service DogIda, AlwaysFavorite Biography:Otis Redding: An Unfinished LifeWestern:The Wild CountryMilitary/Police Thriller:The PolicewomanFavorite YA:A Monster CallsBeauty and the Beast: Lost in a BookIt Starts With LHearts Are Like BalloonsThe First Time She DrownedCrime Fiction:The Pull and Kick Murder: Competition can be deadlyFavorite Cookbooks:A Really Big Lunch: Meditations on Food and Life from the Roving GourmandMy Mother's Kitchen: Breakfast, Lunch, Dinner, and the Meaning of LifeHeal Your Gut with Bone Broth: The Natural Way to get Minerals, Amino Acids, Gelatin and Other Vital Nutrients to Fix Your DigestionEveryDayCookInfuse: Herbal teas to cleanse, nourish and healCultured Food in a Jar: 100+ Probiotic Recipes to Inspire and Change Your LifeChristmas Reads:A Boy Called ChristmasMerry and BrightRonaldo: The Reindeer Flying Academy: Ronaldo the Flying Reindeer children's book seriesThe Deal of a LifetimeSelf Help:Note to SelfHealing Lyme Disease NaturallyUnfu*k Yourself: Get Out of Your Head and Into Your LifeMost Disliked:The Happiest Mommy You Know: Why Putting Your Kids First is the Last Thing You Should DoPoetry Books I Enjoyed:The Child of HappinessEater of Mushrooms: A Poetic NovelPiss On It: New And Selected PoemsWhen the Moon Takes Over the Dream: \"Love Poetry\"My most favorite review I wrote in 2017 was for:Everybody Loves Our Town: An Oral History of GrungeI did roughly 30 author interviews this year and won a handful of giveaways here on Goodreads too. It's been a great year!What do I love most about Goodreads? Without a doubt, the friends I've made. Merry Christmas, Happy New Year, and see you in 2018!"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "The year with medical & family has been not that great but here's hoping for a better 2018My book reading has been awesome! I have read a lot of amazing books! And this will probably go on forever as I am not going to sit here for hours doing it right now. Lol FAVORITES: (In no particular order) My Reviews are listed under the title.1) Life In Outer Space2) Final Girls3) The Rook4) The Dragons Of Nova5) Heir of Novron6) Red Sister7) Oathbringer8) Renegades9) Furyborn10) A Court Of Wings And Ruin11) The Winter King12) Artemis13) The Female Of The Species. . . . to be continued"}, {"userName": "Elyse", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "This was an unpredictable year:I continue to be disheartened by so much on the national scene and hope that as a nation we will focus on facts and evidence, have regard for competence, and treat others with respect and dignity. I am grateful to the Goodreads community - for the nudge and inspiration to look deeper -- for the pure joy of sharing together --playful moments --interesting discussions --and the reminder that sometimes we need a humbling reality check for a necessary and valuable change in direction. I'm not much of a statistic person -- I don't keep track of the number of books I read ....but in the area of 'reading' -- I am SATISFIED --more than satisfied!! I usually enjoy most books I read. At the top of my head --I'll name a few books/and or authors that stood out for me this year:*****\"The Hearts Invisible Furies\"***** by *John Boyne*, knocked my socks off. I thought it was a wonderful page turning novel!! Another Irish Author, besides Boyne, who I discovered this year was ***Niall Williams*** -- Love his writing --enjoyed a couple of books by him. \"The History of Rain\" and \"As It is In Heaven\"*James Baldwin* was high on my list this year --'amazing'! Other books that were profound and or special to me were: (in no specific order) \"Gods of Howl Mountain\" by Taylor Brown\"The Green Phoenix\" by Alice Poon\"My Mother's Son\" by David Hirshberg\"When All The Days have Gone\" by Lars Boye Jerlach\"Lighter Than My Shadow\" by Katie Green\"Do You Realize\" by Kevin A. Kuhn\"Watching Glass Shatter\" by James J. Cudney\"The Case Against Sugar\" by Gary Taubes\"The Ladies Auxiliary\" by Tova Mirvis\"The Book of Separation\" by Tova Mirvis\"Heft\" by Liz Moore\"The Child Finder\" by Rene Denfeld\"***Diary of the Fall\" by Michel Laub\"***The Garden of Evening Mists\" by Tan Twan Eng\"Song of Batoche\" by Maia Caron\"A House in the Sky\" by Amanda Lindhout\"The Thorn Birds\" by Colleen McCullough\"A Piece of the World\" by Christina Baker Kline*****ALL of Marilynne Robinson's books!!!!!!!!\"Truman\" by David McCullough\"*****You Don't Have to Say You Love Me\" by Sherman Alexie ****AUDIOBOOK!!!\"4 3 2 1\" by Paul Auster\"The Scapegoat\" by Daphne du Maurier\"Moonglow\" by Michael Chabon\"Beartown\" by Fredrik Backman\"The River Kings\" Taylor Brown\"Sing, Unburied, Sing by Jesmyn Ward\"The Best of Us\" Joyce Maynard\"The Stolen Marriage\" by Diane Chamberlain\"The Rules of Magic\" by Alice Hoffman\"In The Fall They Come Back\" by Robert Bausch\"Malagash\" by Joey Comean\"The Girl in the Tower\" by Katherine Arden\"The Liars Asylum\" Jacob M. Appel\"Love\" by Hanne Orstavik\"Food\" by Mark Hyman\"Girlish\" by Lara Lillibridge\"***Freshwater by Akwake Emezi***\"Sadness Is A White Bird\", by Moriel Rothman ZecherMany thanks for the friendships we share -- Goodreads is a wonderful community --May 2018 be a beautiful year --comforting- and restorative!!!Boundless Blessings!!!!! Hugs and Super hugs!!!!!!!!!!"}, {"userName": "Annet", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/1166369-annet", "userReview": "So I used this place as a wish list during 2017, and I'm hoping there will be a 2018 on Goodreads soon that I can start to plan out my year. 2017 was a good year for me. After summer I did have less time to read due to a Master studies I started, which is taking up a lot of time next to my job but did manage 70 reads. This year, probably a bit less. But... the good part is, the studies are very challenging indeed and I do try to keep reading in between the study books. A big thank you to all dear friends I got to know here for the great and the lovely contacts, Goodreads truly is one of my top spots to be, such a lovely addiction! Like I did last year, I'll highlight my top reads for 2017! Here are my five star reads: •\tAlias Grace by Margaret Atwood. What a writer! What a book! Impressive writing, intriguing story. •\tThe Childfinder by Rene Denfeld. Again... what a writer! A great talent, proven in The Enchanted and again an impressive dark story. •\tSpoonbenders by Daryl Gregory. Such a fun and weird book, I will follow this writer. •\tSam Wyndham series 1 and 2 by Mukherjee, Abir. A great find, this writer and very atmospheric books. Looking forward to part 2 mid this year!•\tDeath comes for the Archbishop by Willa Cather. Another author I got to know in 2017 and will definitely read more of Cather soon. Grand, beautiful book. •\tBeartown by Fredrik Backman: much said about this book, many great reviews. Loved it. •\tThe Chilbury Ladies' Choir, Jennifer Ryan: delightful and entertaining. •\tThe Ambush, Donna Tartt, what a find, those short stories of Tartt I ran into. Usually she writes long long books but the short stories are equally disturbing and great!•\tThe Summer before the war by Helen Simonson: one of my first reads of 2017 and a great next novel after Major Pettigrew. •\tThe life we bury, Allen Eskens. Another great new author for me. Impressive dark story. Will definitely read more of this author this year. •\tBlood Meridian, Cormac McCarthy. One of my favorite writers. Seriously bloody and impressive. •\tDe tuinen van Dorr, Paul Biegel: What a delightful fantasy story by this famous Dutch writer. One of my audio books. And I have selected a few four star reads from the long list of really good 4-star reads:•\tOracle night by Paul Auster. The master of unfollowable mystery. Great read. •\tOne hundred poems from the Chinese by Kenneth Rexroth. Simply takes your breath away...•\tGrave goods by Ariana Franklin. Great historic series. So sad she's no longer among us... •\tThe last days of California, Mary Miller. Great debut read. •\tLost in Translation: An Illustrated Compendium of Untranslatable Words. Such fun!!•\tThe Unexpected Inheritance of Inspector Chopra: such a great new series with a baby elephant as assistant detective. •\tThe trouble with goats and sheep by Joanna Cannon. Delightful, dark and fun. •\tThe book of the unnamed midwife by Meg Elison. Dark and grim, but hopeful. •\tShe rides shotgun, Jordan Harper. Again... dark and grim, but hopeful. •\tTitaantjes, Nescio. A Dutch literary masterpiece. •\tDesperation road, Michael Farris Smith. Again... dark, grim and hopeful. Great writer. •\tTall Oaks, Chris Whitaker. Weird out of the box, great read!Well, I could go on, but I say, onwards and upwards in 2018 for many great reads! Happy reading!"}, {"userName": "softlykaz (on hiatus)", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/42130592-softlykaz-on-hiatus", "userReview": "2017 literally does not feel real at all. this is an alternate timeline and we've all been raised in the opposite universe and came to this one as innocent travelers!!! it's time we go back!!!on the bright side though, this time last year, I thought 'hibernate' was spelt 'hybernate'.... so really, there has been progress whichever way you look at it.with all seriousness, I wasn't planning to \"review\" 2017 at all but you know what? my life could go anywhere next year. like, I could go to prison and start my own drug ring or marry bill gates or just sit on this bed for the next 20 years and there is really just no way to know!!but also I've really wanted to share a bite sized piece of myself with you guys because I know a lot of you must've formed opinions on me based on my internet presence and that's completely valid because it's still an extention of who I am!! however, I think you should know that my online persona is just an incredibly exaggerated version of myself. I only speak in hyperbole and I sure do peddle every profitable aspect of my personality out for validation and the very attention I would hate to receive in real life lmaoso this is me, completely unedited. okay not completely but the closest thing to complete that I can manage. ya girl is trying to be mysterious!!!2017 was the year of many firsts. it was the year I graduated high school and moved out three weeks later for college in France and away from an abusive household. I've lived on my own for the first time, paid my own rent, did my grocery shopping, found out that laundry is truly a pain in the ass, slept through so many wake up alarms, took so many wrong buses, made genuine connections with so many people, had a crush on a pretty girl with dark matte lipstick & a denim jacket, cried sitting on the bathroom stall of my college, skipped classes to take a depression nap at 11pm, and wasn't too surprised to discover that the color of my skin and my native tongue are good enough for some ppl to define my worth.It was also the year of making my own choices. it was the year that I decided I'm going to drop out of medschool because I didn’t want to be the Self the people in my life didn't work hard enough to become, and in the spirit of fulfilling the stereotypes laid out for me as a millennial, I'm going to take a gap semester to figure out what I actually wanna do without stressing out about school and grades and just. be. it was the year I begun to ascribe to the ideal that I don’t owe anyone any sort of explanation on the things I do and the choices I make unless the situation has a direct negative impact on their lives. and for the first time ever, I had my own space to sort my own emotions out, to sift through the lumps of my personality and solidify my thoughts, to congeal my passions and hobbies and really understand my own boundaries and what’s acceptable to me without the weight of someone else watching and judging my every move. 2017 was the year I let myself feel validated in my queerness. it's the year I realized that sexuality is a spectrum and labels are just the markers we put along it so it's easier to explain and define but I should define the label rather than have the label define me. I've learned that I don't need to be assigned who I can love and what it is that I can do or cater to the superfluous sort of binary in the way society thinks about gender. but more than anything, that human beings are amazing and love is an honor. and I am no longer interested in convincing people that how I feel and who I am is valid and as long as I know my truth and what works for me, that’s what matters. 2017 was also the year I have come to know so many people here who have such a warm and kind presence that it genuinely brightens my entire day every time I see/talk to them. it really is a gentle reminder of all the lovely people that are out there waiting to be met someday. and it’s what helps me keep going. I know I don't say this enough but I really appreciate everyone who takes the time out of their days to write me so many kind words on here. I am treasuring it all. more than you know.2017 was the year I've learned that the way people treat you is how they feel about you. that some \"friends\" only love themselves through you and will only use you as an audience when their thoughts and feelings are needed to be injected somewhere, with no regards to yours. And I have simply become tired of making efforts and excuses and investing emotional labor into friendships that are only based on consistency. it's also the year that taught me that it's 100% okay to let people go when they support things that I strongly disagree with, especially when their opinions attack a way of life that I participate in. people who have no issue encouraging systems and structures that continually oppress marginalized groups and who often speak from a position of privilege in that they aren’t directly affected by these opinions. some relationships only stunt your personal growth and you need to let them go.2017 was overall a year of Lessons.I've learned that jealousy & passive aggressiveness are so toxic and cleansing myself should be top of my list.I've learned that just because I did something wrong in the past doesn’t mean I can't advocate against it now and I shouldn't let people use my past actions to invalidate my current mindset. more importantly, I've learned that no matter how progressive I think I am, I will still be unlearning problematic behaviour my whole life.I'm still learning how to get outside more and exist in the real world for a while and stop getting pressed over trivial things that genuinely don’t matter in the big picture that is life. I'm still learning how to stop glamorizing negativity and start promoting inward and outward kindness and self care and finding fulfillment in my own company. I’m still learning how to be a good friend and how to contribute good things into the universe. I’m still learning.but I think the greatest lesson this year has taught me is the ability to say \"I'm a brown queer Muslim woman\" without a shred of doubt or shame or hatred and that’s something I’ll never take for granted.okay. I'm sorry, you probably didn't sign for all of this lmao fjghgh LETS JUST TALK ABOUT BOOKS NOW!!!! I might not have a girlfriend. or a boyfriend. but I've had a pretty decent year when it came to booksaccording to goodreads, I've read a total of 75 books this year and not to unmask a global conspiracy or anything but that sounds fake and made up and I AM OBJECTING. see, I know for a fact that I've read at least thrice that amount in FANFICTION!! it's not my fault goodreads can't get their shit together long enough to realize some fanfics are not even fanfics. they're classic literature and must get the recognition they deserve!! honestly I don't know where I would be as a person and in society without the ability to open up ao3 or scroll through tumblr for more fanfics/headcanons to inject into my bloodstream. shout out to all of you for sticking with me through my weird distant introvert/depression/anxiety mood swings!!! y'all are the real mvp’s!!!also, I've reread so many of my favorite books this year and that was before this hideous hellsite figured out that reread option trick!!! so naturally, I'm going to blame it on goodreads (listen, 90% of my problems can be somehow traced to this website believe me)since I'm a human slug and thus can't afford the energy to write down every single book I've read this year (in this economy? no ma'am), I'll just leave my 2017 shelf here for y'all to stalk!!!listen I know I talk a lot of shit about goodreads. this website is really uniquely terrible in nearly every way but I'm very grateful it let me meet all of you wonderful human beings!! besides, where else am I gonna SCREAM about fictional people??? do I post that on facebook? do I email a relative?? NOanyway. may the universe be tender to all of you. be kind, always. support marginalized communities, always. and help protect and soothe the earth as much as you can. shout out to the version of you that y'all will become on december of next year. I hope they are all content!!!!!"}, {"userName": "Luís C.", "userReviewDate": "Jan 01, 2017", "userURL": "http://www.goodreads.com/user/show/34132356-lu-s-c", "userReview": "This year I just read (by author):Émile Zola - 5 booksMario Vargas Llosa - 4 booksJorge de Sena - 4 booksJosé Régio - 4 booksJose Maria Eça de Queirós - 4 booksVergílio Ferreira - 4 booksJosé Saramago - 3 booksErnest Hemingway - 3 booksThomas Mann - 2 books"}, {"userName": "Melanie", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/3030788-melanie", "userReview": "Let’s be real, 2017 was kind of a garbage fire year for our world, but at least we had some good books! I had a pretty good reading year! I’m very happy with the 130 books that I read, and I feel like with each year I get better and better at picking out books, and requesting ARCs, that I am confident I will at least enjoy, therefore, my average rating tends to get higher and higher. ➽ And thanks to the amazing Brock at Let's Read, here are some other statistics that I was able to gather from his amazing spreadsheet:And if you’re interested, here is his spreadsheet for 2018! (File>make a copy for your use)➽These are the five books that were published this year that were a tier above the rest. These five blew my mind, and expectations, out of the water. I truly believe these five are perfect books in every single way. And I personally recommend them with my entire heart, body, and soul. #5.) \nThe Bear and the Nightingale (Winternight Trilogy #1) by Katherine Arden \n\n\n“Before the end, you will pluck snowdrops at midwinter, die by your own choosing, and weep for a nightingale.”\n\nThis book taught me that girls can be anything they wish to be, no matter the expectations society, family, and everything else in this world puts on them. And to always surround yourself with people that accept you and believe in you. #4.) The Hate U Give by Angie Thomas \n\n“That's the problem. We let people say stuff, and they say it so much that it becomes okay to them and normal for us. What's the point of having a voice if you're gonna be silent in those moments you shouldn't be?”\n\nThis book taught the world that we want black stories, from black authors, with black casts, with black people on the covers… no matter how many old, racist, white dudes continue to get published. But this book taught me how much more work needs to be done, and how I need to do more to boost marginalized voices, and how the world needs to change and it can begin with me and our generation.#3.) Tyrant's Throne (Greatcoats #4) by Sebastien de Castell \n\n“From nothing we become men and women who write poems and wage wars and conceive of futures both wondrous and terrifying.”\n\nThis book taught me that found families with unconditional love is the most powerful force in any world. And that friendship can heal wounds you never thought would stop bleeding. And that your past will never define you, or hinder you, from being good and kind and ultimately becoming the person you want to be. #2.) The Stone Sky (The Broken Earth #3) by N.K. Jemisin \n\n“But for a society built on exploitation, there is no greater threat than having no one left to oppress.”\n\nThis book taught me to never stop moving forward, to always speak up, and help marginalized voices that need to be heard. And that we don’t get to choose how people love us. And how one voice can change the world. And that blood is only blood, and that we should spend our days with people who love us! And that we are always deserving of love. Always. No matter what. #1.) \nStrange the Dreamer (Strange the Dreamer #1) by Laini Taylor\n \n\n“Sarai was seventeen years old, a goddess and a girl. Half her blood was human, but it counted for nothing. She was blue. She was godspawn. She was anathema. She was young. She was lovely. She was afraid.”\n\nThis book reminded me why I love reading, and that books are magical, healing vessels. This book taught me that everyone has the right to change their future, and that we will never be our parent’s mistakes. And that we can rise up, and become so much more, and that all of our stories deserve to be told. And ultimately, you get to choose who is in your story. These books mean a lot to me, and I feel so very thankful, privileged, and blessed that I was able to read them all this year. These books have all changed who I am as a person, and I will carry, pass them down, and sing their praises for my entire life. Books like this render me speechless to be honest, but I hope I did a decent job letting you guys know how much they mean, and will continue to mean, to me. ➽ And the rest of my favorite books published in 2017:✨The Language of Thorns: Midnight Tales and Dangerous Magic by Leigh Bardugo✨Down Among the Sticks and Bones (Wayward Children, #2) by Seanan McGuire✨Red Sister (Book of the Ancestor, #1) by Mark Lawrence✨Kings of the Wyld (The Band, #1) by Nicholas Eames✨Wild Beauty by Anna-Marie McLemore✨Skullsworn (Chronicle of the Unhewn Throne 0.5) by Brian Staveley✨Godsgrave (The Nevernight Chronicle, #2) by Jay Kristoff✨Oathbringer (The Stormlight Archive, #3) by Brandon Sanderson➽ But my favorite book that I read in 2017 happened to be a 2018 title: ⚔The Cruel Prince by Holly Black!➽ My Top Five Least Favorite Books Published in 2017:🙃 Into the Fire (Night Prince #4) by Jeaniene Frost🙃 Raven's Mark: (The Raven Queen's Harem #1) by Angel Lawson🙃 Blood Rose Rebellion (Blood Rose Rebellion #1) by Rosalyn Eves🙃 The Ghostwriter by Alessandra Torre🙃 Bad Habit (Bad Love #1) by Charleigh Rose➽ My Top 18 Most Anticipated Releases of 2018:🌟The Cruel Prince (The Folk of the Air #1) by Holly Black - January 2nd, 2018 ★★★★★🌟Beneath the Sugar Sky (Wayward Children #3) by Seanan McGuire - January 9th, 2018 ★★★★★🌟Iron Gold (Red Rising Saga #4) by Pierce Brown - January 16th, 2018🌟The Armored Saint (The Sacred Throne #1) by Myke Cole - February 20th, 2018 ★★★★★🌟Heart of Iron by Ashley Poston - February 27th, 2018 (I have an ARC!)🌟Children of Blood and Bone (Legacy of Orïsha #1) by Tomi Adeyemi - March 6th, 2018 (I have an ARC!)🌟High Voltage (Fever #10) by Karen Marie Moning - March 6th, 2018🌟The Heart Forger (The Bone Witch #2) by Rin Chupeco - March 20th, 2018 (I have an ARC!)🌟Dread Nation by Justina Ireland - April 3rd, 2018 ★★★★★🌟Circe by Madeline Miller - April 10th, 2018🌟The Thief (Black Dagger Brotherhood #16) by J.R. Ward - April 10th, 2017🌟Grey Sister (Book of the Ancestor #2) by Mark Lawrence April 19th, 2018 (I have an ARC!)🌟Bloody Rose (The Band #2) by Nicholas Eames - April 26th, 2018🌟Magic Triumphs (Kate Daniels #10) by Ilona Andrews - May 8th, 2018🌟The Winter of the Witch (Winternight Trilogy #3) by Katherine Arden - August 14th, 2018🌟Toil & Trouble: 16 Tales of Women & Witchcraft edit by Tess Sharpe - August 28th, 2018🌟Blanca & Roja by Anna-Marie McLemore - October 9th, 2018🌟The Muse of Nightmares (Strange the Dreamer #2) by Laini Taylor - No Date (If this gets pushed back until 2019 I’m actually going to be WEEPING for the rest of the new year!)➽ And the highlight of my year on Goodreads and my blog was just connecting with so many amazing people who love to celebrate their love for reading. I love you all, but these people truly changed my life this year, and I just wanted to give them a special shout out and you should all follow them (if you’re not) to start your 2018 off right!💗 Paloma became like my best friend this year, and our Snapchat streak is getting pretty intense. She’s beautiful, funny, my book twin, and gives me the best romance recommendations in the world.💗 Destiny became not only a huge part of my reading life, because we buddy read like 50 ARCs together, but she became a staple in my real life, too, and I love her more than words. She’s also brought me into her bookish community on FB and helped introduce me to so many wonderful people. I have no words to describe how much she has changed my life, but I truly think we will be friends for life. 💗 Elise was totally along for the ride with me and Destiny’s buddy reads, too! She’s my spider queen, my sapphic book recommender, my theater star, and I love her so much! 💗 Em is like becoming the biggest reviewer on Goodreads, so I hope she remembers me and my love for her when she’s famous. Also, she’s the number one person I go to when I gush over any book and we leave each other 100 messages back to back when we love a book, and she makes every book I read that she has already read 100 times better. 💗 Petrik completely buried himself inside my heart and my only wish is for him to move to the US immediately. Not only does he write the best reviews, read the best books, and shows me so much kindness, he also is one of the most talented people I’ve ever met. 💗 Mary completely just blatantly stole my heart and I hope she relocates to Vegas soon so we can be wed. Mary has helped me with so many reviews this year, while also doing some amazing buddy reads with me. She’s also the most beautiful person on Goodreads, but she’s also passionate, and intelligent, and honestly goals in every single way. 💗 Jules was honestly my buddy reading queen in 2017. I read so many books with her, and she made each and every one so much better. Also, we bonded over Nevernight and Godsgrave and now she can never leave me and she must read just as much with me in 2018! I don’t make the rules. 💗 Alexis is my newest book friend of 2017, but I’m completely obsessed with her opinions and content and her BookTube channel. I feel like I’ve known her way longer than I have, but I can’t wait to get to know her even more in 2018. Also, she’s adorable, funny, has amazing taste in everything, and is such a good kitty mom. 💗 Lilly is also a newer friend of mine this year, but I honestly can’t picture blogging without her now. Also, me and her have like every book in common and if my 2018 isn’t filled with buddy reads with her I’m just going to cry the entire year away. 💗 Chelsea is a confirmed angel that I was able to meet this year in person and it was honestly one if the highlights of 2017 for me. Not only is she gorgeous; she’s smart, funny, so kind, and is 100% my go-to for anything and everything Thriller!💗 Sue completely makes Goodreads for me. She puts in more work than anyone else I know on this site, and is always so kind and giving. I couldn’t possibly make a list without giving her a shout out, because she does so much, and I can’t picture Goodreads without her. And thank you all for making my 2017 so great! I hope 2018 is filled with unconditional love and good health and happiness for you all! Oh, and a good book always! I’m so very grateful for each and every one of you who gush over books with me and show me so much kindness and friendship. From every molecule of my body, thank you. 💖➽ My 2016 Reading Challenge➽ My 2015 Reading ChallengeBlog | Twitter | Tumblr | Instagram | Youtube | Twitch"}, {"userName": "Julie", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "Books have always been a safe haven and this year I have needed that solace more than ever. Gone, are the days of blissful complacency and I think my reading choices reflected my introspective mood and internal struggles. The year of 2017 shows a marked change, compared to years past, as the bulk of my reading was dark, serious, angry, and somber. However, it has not all been gloom and doom. Along the way, I have discovered some amazing authors, learned so many new things, made so many wonderful friends and have found the inspiration to keep fighting the good fight. Please note that not all books listed here were PUBLISHED in 2017, but I READ them during this past year. So, without further ado- MYSTERY/SUSPENSE/THRILLER STANDOUTSBook: My Sister's Bones by Nuala EllwoodBook: Bluebird, Bluebird by Attica LockeBook: Good Me, Bad Me by Ali LandBook: Home by Harlen CobenBook: Magpie Murders by Anthony Horowitz ROMANCE STANDOUTSBook: Someone to Wed by Mary BaloghBook: The Duke by Katharine AsheBook: Lost and Found Sisters by Jill Shalvis OVERALL FAVORITES OF 2017Book: The Dry by Jane HarperBook: Hidden Figures: The American Dream and the Untold Story of the Black Women Mathematicians Who Helped Win the Space Race by Margot Lee ShetterlyBook: We Should All Be Feminists by Chimamanda Ngozi AdichieBook: The Marsh King's Daughter by Karen DionneBook: The Radium Girls: The Dark Story of America's Shining Women by Kate MooreBook: Beach House for Rent by Mary Alice MonroeBook: The Night the Lights Went Out in Georgia by Karen WhiteBook: I Liked My Life by Abby FabiaschiBook: Beartown by Fredrik BackmanBook: The House at the Edge of Night by Catherine BannerBook: The Last Days of Night by Graham MooreBook: She Rides Shotgun by Jordan HarperBook: Ginny Moon by Benjamin LudwigBook: On Tyranny by Timothy SynderIf the Creek Don't Rise by Leah Weiss TOP FIVE BOOKS OF 2017Midnight at the Bright Ideas Bookstore by Matthew J. SullivanThe Road to Jonestown by Jeff GuinnMy Absolute Darling by Gabriel TallentLittle Fires Everywhere by Celeste NgThe Seven Husbands of Evelyn Hugo by Taylor Reid Jenkins"}, {"userName": "Angela M", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "This is my final version with two additional favorites added.One of the best things about my reading year in 2017 is the connection I have made on Goodreads with new friends and old . There are few people in my life to whom I can gush about books that I love, complain about the ones that are just so so or the ones I could not finish, and few people who enlighten me with their perspectives on what they have read. What’s with my friends and family who are not avid readers ? This makes me very thankful for my fellow book lovers on Goodreads. I’m wishing all of you good health and happiness and a lot of good reads in 2018! 2017 was a fantastic year for my literary heart and soul and I owe more than a bit of gratitude to the authors I loved and the publishers who provided me with so many advanced copies . I'm always drawn to new releases, both by authors I’ve enjoyed reading and by authors new to me and in the last two years my penchant for these new titles has taken precedence over the long list of titles on my kindle and the stack of books on my coffee table and bedroom floor . In 2018 , I’m going to make more of an effort to read some of those if I can keep my fingers off the request buttons on NetGalley and Edelweiss. Good luck with that - right?There were so many books that moved me to joy, to tears, to the heartbreaking reckoning that a happy ending wasn’t to be, and many times to a belief in the tenacity of the human spirit. Here are my favorites of the year in no particular order: The Signal FlameBeartownThe BarrowfieldsLetters to a Young Writer: Some Practical and Philosophical AdviceAll the Rivers If The Creek Don't RiseLittle Fires Everywhere A Boy in WinterThe Heart's Invisible Furies To Lay To Rest Our GhostsSing, Unburied, Sing The Last BalladThe Ninth HourWolf SeasonFuture Home of the Living God Sadness Is a White BirdThe Rules of MagicThe Great AloneThe Tattooist of AuschwitzPoints North: Stories84, Charing Cross RoadAnything Is PossibleDaring to Drive: A Saudi Woman’s AwakeningThe One-in-a-Million BoyChasing the King of HeartsThe Boat RunnerThis Is What a Librarian Looks Like: A Celebration of Libraries, Communities, and Access to InformationIn the QuietThe RefugeesEleanor Oliphant is Completely FineObama: An Intimate Portrait: The Historic Presidency in PhotographsI spent some time trying to decide on a favorite. I couldn't, so here are my three favorites :Sadness Is a White BirdBeartownSing, Unburied, Sing"}, {"userName": "Virginia Ronan ♥ Herondale ♥", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/69106439-virginia-ronan-herondale", "userReview": "2017 was an amazing reading year for me!!! =)))I got to know so many awesome new series (The Raven Cycle, Six of Crows, Red Queen, Wicked Lovely, ACOTAR, Shatter Me, you name it!!), managed to continue series I loved (Everything, literally everything from Cassandra Clare!!! and J.R.Ward), read my first m/m book and realised that I’m actually addicted to LGBTQ stories! *lol*, discovered Santino Hassell over the summer *moans* ;-P; finished series I wanted to finish for ages (Divergent), squeezed in a classic (Othello), begun new series I’m sure I’ll love (Throne of Glass, Percy Jackson) and received my first ARCs! (Countryside, Alyria series, The Experiment of Professor Polgas and So Near the Horizon)All told 2017 was a very efficient reading year and I was able to reach the unbelievable number of 92 read books. My initial goal were 50, but as it seems I exceeded my own expectations. *lol*\nStay tuned, the year isn’t over yet! ;-P\n- Lady Midnight (The Dark Artifices #1), Cassandra Clare- Lord of Shadows (The Dark Artifices #2), Cassandra Clare- Clockwork Prince (The Infernal Devices #2), Cassandra Clare- Clockwork Princess (The Infernal Devices #3), Cassandra Clare- After the Bridge (The Infernal Devices #3.1), Cassandra Clare- Tales from the Shadowhunter Academy, Cassandra Clare- The Bane Chronicles, Cassandra Clare- The Shadowhunter’s Codex, Cassandra Clare- Wicked Lovely (Wicked Lovely #1), Melissa Marr- Ink Exchange (Wicked Lovely #2), Melissa Marr- Fragile Eternity (Wicked Lovely #3), Melissa Marr- Radiant Shadows (Wicked Lovely #4), Melissa Marr- Darkest Mercy (Wicked Lovely #5), Melissa Marr- Faery Tales’s & Nightmares, Melissa Marr- Stopping Time (Wicked Lovely #2.5), Melissa Marr- Old Habits (Wicked Lovely #2.6), Melissa Marr- The Bourbon Kings (The Bourbon Kings #1) , J.R. Ward- The Angel’s Share (The Bourbon Kings #2), J.R. Ward- Lover Enshrined (Black Dagger Brotherhood #6), J.R. Ward- Lover Avenged (Black Dagger Brotherhood #7), J.R. Ward- Lover Mine (Black Dagger Brotherhood #8), J.R. Ward- Lover Unleased (Black Dagger Brotherhood #9), J.R. Ward- Lover Reborn (Black Dagger Brotherhood #10), J.R. Ward- Lover At Last (Black Dagger Brotherhood #11), J.R. Ward- White Hot Kiss (The Dark Elements #1), Jennifer L. Armentrout- Stone Cold Touch (The Dark Elements #2), Jennifer L. Armentrout- Every Last Breath (The Dark Elements #3), Jennifer L. Armentrout- The Kiss of Deception (The Remnant Chronicles #1), Mary E. Pearson- The Heart of Betrayal (The Remnant Chronicles #2), Mary E. Pearson- Captive Prince (Captive Prince #1), C.S. Pacat- Prince’s Gambit (Captive Prince #2), C.S. Pacat- King’s Rising (Captive Prince #3), C.S. Pacat- Insurgent (Divergent #2), Veronica Roth- Allegiant (Divergent #3), Veronica Roth- A Court of Thorns and Roses (A Court of Thorns and Roses #1), Sarah J. Maas- A Court of Mist and Fury (A Court of Thorns and Roses #2), Sarah J. Maas- A Court of Wings and Ruin (A Court of Thorns and Roses #3), Sarah J. Maas- The Assassin’s Blade (Throne of Glass #0.1 - #0.5), Sarah J. Maas- Throne of Glass (Throne of Glass #1), Sarah J. Maas (2x)- Red Queen (Red Queen #1), Victoria Aveyard- Glass Sword (Red Queen #2), Victoria Aveyard- King’s Cage (Red Queen #3), Victoria Aveyard- Steel Scars (Red Queen #0.2), Victoria Aveyard- Queen Song (Red Queen #0.1), Victoria Aveyard- Das geheime Vermächtnis des Pan (Pan Trilogy #1), Sandra Regnier- Die dunkle Prophezeiung des Pan (Pan Trilogy #2), Sandra Regnier- Die verborgenen Insignien des Pan (Pan Trilogy #3), Sandra Regnier- Missing You, Harlan Coben- The Path Keeper, N.J. Simmonds- Shatter Me (Shatter Me #1), Tahereh Mafi- Destroy Me (Shatter Me #1.5), Tahereh Mafi- Unravel Me (Shatter Me #2), Tahereh Mafi- Fracture Me (Shatter Me #2.5), Tahereh Mafi- Ignite Me (Shatter Me #3), Tahereh Mafi- Countryside: The Book of the Wise (Countryside #1), J.T. Cope IV- Girl of Nightmares (Anna #2), Kendare Blake- Sutphin Boulevard (Five Boroughs #1), Santino Hassell- Sunset Park (Five Boroughs #2), Santino Hassell- Fangirl, Rainbow Rowell- Carry On, Rainbow Rowell- Six of Crows (Six of Crows #1), Leigh Bardugo- Crooked Kingdom (Six of Crows #2), Leigh Bardugo- Everything, Everything, Nicola Yoon- Chasing the Omega (Small Town #1), Jessica Edwards- The Kite Runner, Khaled Hosseini- Simon vs. The Homo Sapiens Agenda, Becky Albertalli- The Chase (Fox and O’Hare #2), Janet Evanovich- Dead in the Family (Sookie Stackhouse #10), Charlaine Harris- Dead Reckoning (Sookie Stackhouse #11), Charlaine Harris- A Girl Named Calamity (Alyria #1), Danielle Lori- A Girl in Black and White (Alyria #2), Danielle Lori- Red Rising (Red Rising Trilogy #1), Pierce Brown- The Gentleman’s Guide to Vice and Virtue (Guide #1), Mackenzi Lee- Biting Cold (Chicagoland Vampires #6), Chloe Neill- House Rules (Chicagoland Vampires #7), Chloe Neill- The Raven Boys (The Raven Cycle #1), Maggie Stiefvater- The Dream Thieves (The Raven Cycle #2), Maggie Stiefvater- Blue Lily, Lily Blue (The Raven Cycle #3), Maggie Stiefvater- The Lightning Thief (Percy Jackson and the Olympians #1), Rick Riordan- The Experiment of Professor Polgas, Sarah Brownlee- Coffee Boy, Austin Chant- Drums of Autumn (Outlander #4), Diana Gabaldon- Othello, William Shakespeare- So Near the Horizon (The Danny Trilogy #1), Jessica Koch- The Glittering Court (The Glittering Court #1), Richelle Mead- Light Years Away (Mated to the Captain #1), Christine Wright- The Deal (Off-Campus #1), Elle Kennedy- Heartstopper, Alice Oseman- Murder on the Orient Express (Hercule Poirot #10), Agatha Christie- V Games (The Vampire Games Trilogy #1), Caroline Peckham"}, {"userName": "Val ⚓️ Shameless ⚓️ Steamy Reads", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/11626803-val-shameless-steamy-reads", "userReview": "***Updated with top reads, 2018 goals, etc.***Well, well, well, 2017...time to part ways, eh? Happy New Year, folks!I hope you all got drunk and sloppy rung in the new year safely and responsibly.Before we get into some books goals I have for 2018, let's recap 2017 right quick, eh?2017 was an interesting year.Personally...professionally...and of course, reading and book-wise - for me at least.Stat-wise, according to goodreads, I read a total of 219 books, with an average 3.5 rating.Not bad.Not bad at all.In fact, all in all all, I feel pretty good about this year.As I said above, it has been interesting...and by that I mean, I had a lot going on in my personal life. Thus, I know I didn't do as many reviews as I have in years past. I also know I haven't been as active on here.But that's just life, and real life will always come first.I don't believe in forcing myself to review something I have nothing to say about.Or forcing myself to blog posts when I have nothing I want to share or talk about.Also, I experienced a defined shift in my reading tastes and interests this year.As I've said before, I have been a huge reader since I was nine years old.And since that time (I am now 35 years young, my friends), I have always been drawn mostly toward fantasy, paranormal and, of course, my beloved romance.If a book didn't have at least SOME kind of romance in it?Pfffft.This year though?I discovered HIGH fantasy...a newfound interest in historical fiction...and - thanks to book subscription boxes and a brief stint down the rabbit hole that is booktube - a renewed interest in YA fantasy and fiction.I also became very interested in minimalism and living a life with less stuff and less stress.Of course, being that is a process...I was able to curb my spending on clothing and shoes and other nonsense I used to waste money on......but I seemed to funnel some of that need to spend into buying more books.Don't believe me?Yeah...that's ridiculous.And no, this is not me humble-bragging about my mad sale/deal finding skills or saying \"look at how many books I have;\" this is me saying......the first step in battling an addiction is admitting you have an addiction...lolBecause what you DON'T see in that above picture?Is my OTHER TWO FULL bookcases which have hundreds more books in them.Which reminds me about my 2018 book goals, which I will get to in a second...First, let's recap my favorites of 2017.Favorite fiction discovery of the year...The amazing-ness that is Lauren Gilley. I saw a review for a book of hers a friend posted and decided to try it out...That book was,\n...and 11 books later, I can say with certainty that Ms. Gilley is now one of my favorite authors of all time. Seriously, if you haven't read her yet...do yourself a favor and get on it. Other books by her I loved this year:\n\n\n\n\n\n\n\n Favorite high fantasy...\nHoly shit. Mind blown. Favorite romance reads...\n\n\n\n\n\n\n\n\n\nFavorite YA fiction read...\nThis didn't blow my mind or anything, but thought it was really cute and I thought the format was kinda cool. So consider this an honorable mention, I suppose. Favorite new series...I am hugely late to jump on this bandwagon, but whatever. \nEve and Roarke...swoon. Favorite nonfiction book...\nAs mentioned above, I became interested in minimalism this year...purging stuff I don't use/need/want...indulging in less consumerism...being more mindful of my purchases and my time. Except as applied to books, obviously...what can I say...I also discovered Book Outlet this year. #LateToThePartyAsUsualBut I know ya'll understand. I, at some point, will come back and link my reviews for these books on here...but right now, I am short on time.And lazy. Which brings me to my...\nMY BOOK GOALS FOR 2018\nNice segue, right? *snort*Anylame, off we go.1) READ ALL the books on the above pictured shelvesYes, I realize this is probably not going to happen. There are literally hundreds of books on there and on another shelf...But I'm gonna do my damndest to get it done.Cause it feels ridiculous to have so many unread books on my shelves.2) FINISH all of the series I have started and not completed.I have so many series I have read book one or all but the final book in...and it's driving me fucking nuts, you guys.Some of these include:The Mistborn seriesThe Grisha TrilogyThe Throne of Glass seriesThe Shatter Me series (I am currently reading book one)The Harry Potter series...yes, I JUST read book one for the first time year, and yes, you are reading this correctly.3) Read at least ONE classic book a month.If you couldn't see in that picture up there...I have a whole shelf of classics...and more on one of the non-pictured shelves. All of them I have either not read or read so long ago that I want to re-read them as a quasi-mature adult, namely my all time favorite, Paradise Lost, which I haven't read since my sophomore year in college.4) Utilize my LIBRARY more often.I have a legit AWESOME library system where I live.Seriously, they usually have every book I go looking for, either in physical form or via ebook, and so there is just NO reason for me to waste money on books I'm not sure about not make better use of it.I did manage to read the first quarter of the JD Robb In Death series via the library, but there are some other books and series I definitely should have checked out from the library instead of purchasing because I ended up not loving them.If I DO end up loving something and just HAVE to have it (because I'm a greedy and privileged little child) - I will just go buy it AFTER I make sure I love it AND WILL RE-READ it. I did this with the ACOTAR series and plan to read it again this year before book four comes out.Which I already pre-ordered. Because EXCEPTIONS.Now. All that said.I'm not going to be a Nazi about any of these rules.Reading is my main source of fun and entertainment - so I'm not going to force myself to do anything that might make it feel NOT fun.Plus, I work really hard for my money.So, at the end of the day, if I wanna blow it all on books, fuck it.Imma do it.But there you have it, folks.My list of \"resolutions\" that I already - on the first day of the new year, no less - said I probably won't stick too."}, {"userName": "Paul Bryant", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "2017 IN FICTION : THE GOOD STUFFI ploughed through a number of why-haven’t-I-already-read-this? books – the three by H G Wells turned out to be short, sharp and shocking - The War of the Worlds, The Invisible Man and The Island of Doctor Moreau.  You don’t read these things because you think you already know the stories well enough but when you do get round to it you find they’re so much weirder and crazier and funnier than you had any right to expect, so those three are RECOMMENDED. The Strange Case of Dr Jeckyll and Mr Hyde was in the same category, but curiously Do Androids Dream of Electric Sheep?  (aka Blade Runner) was actually less weird than I was expecting. It seemed Dick was just dicking around. It coulda bin a contender but it was like one of those party balloons you stick a pin in and it just goes phsssssssss instead of bang. Oops, I’m supposed to be discussing the good stuff here. Okay – They Shoot Horses, Don’t They?  was a) a great title, b) a great movie and b) a great bitter blast of rage against the machine. Family Life by Akhil Sharma was horrible horrible horrible in a good way, a bleak view of what a meaningless accident can do to destroy a person and his family. Giovanni’s Room by James Baldwin – well, I expected to feel I kind of had to like that one, it’s a known stone classic, but I was actually knocked out by it – recommended! The North Water by Ian Maguire was a Booker 2016 short lister which was great stuff if you like your stuff nasty and brutal; Train to Pakistan by Khushwant Singh was also really nasty and brutal – er, I think I’m seeing a corroboration of my Theory of Novels here.You see, my theory is that novels exist merely to catalogue the number of ways humans can be unpleasant to each other. Simple! I read three fine long American novels about what modern life is like, all recommended : A Book of American Martyrs by Joyce Carol Oates (in which an abortion doctor is murdered by a Christian evangelical); We are Not Ourselves by Mathew Thomas (in which a father suffers from Alzheimers); and You Don’t have to Live Like This by Benjamin Markovits (in which hipster white guys try to recolonise the deserted parts of Detroit). I love big novels which try to get their arms round big modern problems – like Fourth of July Creek by Wayne Henderson which was my best book of 2015. If there are more like this, please let me know. THE BAD STUFFThis year I continued to be really bad at choosing novels to read, 14 of them I rated 2 stars and seven a whole 1 star, and the only 5 star read the whole year was a reread, Titus Groan by Mervyn Peake. I really must get better at this game – I enjoy writing a nice amusingly bitter review of the bad ones, but I’d much prefer to read actually good books instead. I abandoned in HORROR eight novels this year – notably -Tropic of Cancer by Henry what’s his name – ugh, some people still think that because this book got banned by the anti-sex uptight puritan establishment and then later by the anti-sex uptight feminist establishment it must be a rock n rolling blast of beautiful joyful abandoned liberated comic genius whereas it’s actually bile-filled misogynistic claptrap.Here I Am by Jonathan Saffron Fooey – I thought he’d have got rid of his sickeningly twee children in Extremely Noisy and Permanently in your Face which I also abandoned, but no, they’re here again, so no more Saffron Fooey for me.I finished three one star abominations, two because they provided me with many unintended yelps of astonished laughter. Let’s hear it forThe Thirty Nine Steps by John Buchan, or as it might have been called 003 ¾The Carpetbaggers by Harold Robbins, one of those experiences where I was so far outside my comfort zone I needed breathing apparatus. As I reported in my review, never have I read a novel where so many beautiful women enjoyed being naked so much. In a strange way, it was a lot less misogynistic than Tropic of Cancer . Also way way way funnier. There were ho-hum novels along the way of course, the most ho-hummiest being Stoner , that much praised novel by John Williams who as well as composing the soundtrack to Jaws and Star Wars and a zillion other movies wrote this apparently moving story of a humdrum English professor back in 1965, when it was deeply ignored. But now everybody loves Stoner! Yay! Except me! Boo. WHAT ELSEBritish journo Gary Younge wrote Another Day in the Death of America : A Chronicle of Ten Short Lives , in which he took one random day and examined all the deaths by gunfire of young people in America on that day. Very moving and appalling, and my non fiction book of the year. I also kept unearthing excellent biographies, this year of H P Lovecraft (In the Mountains of Madness), and Diane Arbus : Portrait of a Photographer and Katherine Mansfield : A Secret Life. Nothing like reading about other people’s real life unhappiness. AUTHORS OF THE YEARHas to be Kathleen Rooney and Stephen Jarvis – when I trashed their novels Lilian Boxfish Takes a Walk and Death and Mr Pickwick they both voted for my review – you got to give them credit for that – and Stephen actually convinced me to give his (enormous) novel another go. And I will do so!*PS - I forgot to say thanks to everybody for all your comments on my reviews through the year. They always cheer me up."}, {"userName": "Nayra.Hassan", "userReviewDate": "Dec 28, 2017", "userURL": "http://www.goodreads.com/user/show/44531801-nayra-hassan", "userReview": "و بعد ان انقذني الموقع الجميل و ناسه الاجمل من الغرق في بئر مظلمة في 2016صار عام 2017هو عام العودة للماضي بامتياز. . لم تكن سنتي القرائية بنفس بريق الأعوام الماضية و لكنى عاهدت نفسي إلا يمر يوم بدون ان اطل على موقعي الاثير فاهله صاروا من اهلىهذه مراجعتي رقم 400 واعتقد انه معدل طيب لعامين فقط عشر آلاف صفحة عبر 50كتاب و 20قصة.. https://www.goodreads.com/user/year_i...و لكنهم في الواقع كانوا أكثر من 150 كتاب فقد حرصت في هذا العام على تقديم مراجعات عن أهم ما قرأت زمان و لابد لي من قراءة 25%من الكتاب القديم لاراجعه جيدا كان للأدب في 2017 نصيب الأسد كالعادة و تنوعت قراءاتي بين الواقعية و الفانتازيا و الاثارة و الرعب طبعاعالم الفانتازيا الغربي كان لي معه 6لقاءات و منها🌟 \"لعبة الملاك\" ضمن رباعية مقبرة الكتب المنسية لكارلوس زافون و احتلت المركز الاول كأفضل و اغرب ما قرأت لهذا العام اسعدني الحظ بثلاث لقاءات مع👑 الملكة: ج.ك.رولينج ☆☆☆ كانت كتب غير روائية. .. كتابا دراسيا عن الوحوش المذهلة و كتابين عن ما وراء سكان هوجوارتس ☆☆☆♡ملك الأدباء عندي تشيكوف👑 برصيد 15قصة و ايضا مراجعات لاهم مسرحياته حتى نلت من أصدقائي لقب \"حفيدة تشيكوف\"لاني حاولت حل فوازيره و احاجيه المبطنة في كل أقصوصة من اقاصيصه و أفضلها على الاطلاق قصة \"الالم\"او \"المصيبة\"في ترجمات أخرى ...و اسوأها ابنة البيون! اكان لكتابات الشباب نصيب ب حوالي 8 كتب☆☆☆ أفضلها مجموعة\" 20ميجا بيكسل\" للكاتب اليمنى محمد ال زيد : كان إحدى مفاجآت العام الطبية و كذلك\" رسول الخطيئة\" للكاتب شريف سالم و مخلب القرد الاحمر🙊فانتازيا مرعبة و مختلفة للاديب عارف فكري كان لي لقاءا واحدا و مختلفا مع التنمية البشرية💥 في \"سندريلا سيكريت \" و منحني حيرة لا بأس بهاحُرم على النار كل هِين لين سهل قريب من الناس } احاول ان اطبق حديث نبينا الكريم منذ ان دخلت هذا الموقع و احرص على الكلمة الطبية قدر امكاني و لكن سيظل 2017منفرد بالرواية التي منحتني وقتا عصيبا مليئا بالغيظ و الضغط العالي **موسم صيد الغزلان* ..رواية كانت مثل ثوب الحرير الذي ماتت في سبيله 20مليون دودة قز. .ثم قرر احمد مراد ان يطرزه بارخص انواع الترتر و يثقبه ثقب اسود شنيع بغرض جذب الانتباهو لكي تكتمل النكبة كانت مراجعتي سبب في رؤيتي لوجه اخر بغيض من موقعي الاثير وكان لي 7لقاءات مصرية أخرى مع الفانتازيا و الخيال تميزت بينها أسفار النهايات غيوم ميسو لم يخذلني بعد بدات معه العام ⏳في \" و بعد\" ثم انقذني في الصيف و سأعود معه في مطلع 2018كتميمة للحظالكتب الدينية و السيرة لم تتعدى الستة كان أفضلها صفة الصفوة و اني رزقت حبها و نظرات في الاسلامكان للعبقري هاروكي موركامي 5جولات طيبة غريبة كالعادة أفضلها نعاسو لكينج أربع جولات أفضلها عندما جريت معه حتى تعبت في الهاربة Gingerbread girl و كان لقاءي مع التاريخ كتابين و هكذا وجدت \"أبناء الأيام \"من أقيم ما قرأت و اكثره عذوبة ا😿ما خذلني حقا هو حصيلة الرعب المصري لهذا العام 10روايات و مجموعة واحدة بدأتها بمنزل ابو خطوة و كانت النهاية مع \"كساب و ابو فودة\" مما ترتب عليه كوم محترم من روايات الرعب التي لم تقرا صار يزين الكومودينو. .- - - -و لهذا سانتهز الفرصة و اجيب هنا على تساؤل تكرر من الاصدقاء ماهي افضل روايات الرعب في رايي؟؟\nافضل روايات الرعب على الاطلاق و خارج المنافسة : هي\" الشيء\" لستيفن كينج و بشرة الخير انها ستصدر مترجمة في 2018 بفضل المترجم البطل نادر أسامة .. هكذا سيستمتع الملايين بمجمع الرعب الاكبر \"بكل انماطه \" حتى يومنا هذا اما في رواياتنا المصرية ا😱1-الذي لم يمت: ثلاثية الكتاب الأسود رائعة تامر ابراهيم التي لن تكتمل على ما اظن ..و لو اكتملت ستصبح درة أدب الرعب ..الرعب الكامن في الكتب..في خزانة ابيك. .في اجدادك؟ الرعب المنذر للحيوانات للأطفال للحشرات . .الحلو مايكملشا🎃2 ثلاثية ابن اسحق يكفي انها رائدة ..يكفي انها بدأت ساذجة و انتهت أسطورية ..لم يجرؤ أحد على التعرض رواءيا للجن و القرين و عمار المكان قبل حسن الجندى حتى العراب و لكنه نجح بأقل قدر من الأذى و الابتذال في صنع موسوعة جيدة لمفردات نتحاشاها جميعا اما في قطاع البيوت المسكونةفهي: ابتسم فانت ميتا👀 طغراء و صندوق الدمى لشيرين هنائي :رعب مصحوب برؤية سياسية و تاريخية و فانتازيا احيانا في إطار قد لا يروق للجميع و لكنه الرعب الباقي في ذهنك و لا يتبخر بعد ايام ا🏰عهود الدم و الشيخ الأسود لحسين السيد : بساطة البيوت المسكونة و الكتب الملعونة و الشيوخ الغامضين و الأجداد المزاغيد في إطار محمود من الاختصار ا👻و بالطبع كل ما كتب العراب في الرعب : سلسلة ما وراء الطبيعة و مجموعات نفتح الصندوق و 207 غيرها------------اتمنى ان كلماتي طوال العام كانت خفيفة امتعت أصدقائي حيناو افادتهم و لو قليلا ..كما افدتموني بما لا يقاس بمراجعات ثمينة و تعليقات و مناقشات منحتني وقتا لن أنساه ..و لا اتمنى في 2018الا ان يظل هذا الموقع مجمع صفوة القلوب قبل العقول و ان يواصل مهمته الساحرة في انقاذ المكروبين و ان اقابل كل أصدقائي في موقعي الاثير ..بمعجزة ما"}, {"userName": "Crumb", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/53025065-crumb", "userReview": "I have known about Goodreads for a few years now, but not until this past year have I really dedicated myself to becoming an active participant of this site. I'm not sure why I waited, because this year has defined me as a reader in more ways than one. First, I've started writing reviews. It's interesting to look at how my writing as progressed throughout the year. Second, I've read and responded to a lot of my friend's reviews. That singular action has honed my ability to write reviews. So, for that..thank you, to all my friends! I have also participated in buddy reads, which is such a wonderful experience. Overall, this has been an amazing year in terms of reading. I've read many winners and some not so much.. Here are my favorites of the year (in no particular order):Note: Not all of these books were published in 2017.. I'm also including books that I read and really enjoyed in 2017.The Good Daughter by Karin SlaughterThe Life She Was Given by Ellen Marie WisemanThe Identicals by Elin HilderbrandThe Secrets She Keeps by Michael RobothamBehind Closed Doors by B.A. ParisThe Orphan's Tale by Pam JenoffThe Mother's Promise by Sally HepworthAn Untamed State by Roxane GayNineteen Minutes by Jodi PicoultWe Were the Lucky Ones by Georgia HunterA House Without Windows by Nadia HashimiPerfect Match by Jodi Picoult"}, {"userName": "Berit☀️✨Traveling Sister✨", "userReviewDate": "Dec 11, 2017", "userURL": "http://www.goodreads.com/user/show/38946743-berit-traveling-sister", "userReview": "2017 receives five fabulous stars from me!!! 🌟🌟🌟🌟🌟 Goodreads is such a wonderful community! In January I will be celebrating three years of my very active participation on this amazing site!*** warning I’m going to gUsh so you can skip this part and get directly to my favorite books, but I’m a gusher! Got to do it! *** First of all thank you to every single one of you that takes the time to read my reviews, like them, and comment on them, I appreciate it more than you’ll ever know .... I love reading and it is so fun to share my passion with everybody!  Also thank you to all of you that take the time to write those wonderful reviews, I love reading your thoughts and getting your perspective on books, it is so helpful, you are all quite brilliant! Make new friends but keep the old... one is silver and the other gold. 💛 to all my snakey friends, thank you so much for always being there for me no matter what! You are all my day one GR friends!💙 to all you ladies who help me mod AMMP and Game Night thank you so much for everything you do! And thanks for still liking me even though you have probably seen the ugly side of me at times, LOL! 💜 this year I was blessed to have a new group of amazing ladies enter my life the Traveling Sisters... it is so amazing reading and sharing books with you girls, this really has been such a huge blessing in my life, thank you so much for that... to each and every one of you! 💚 also last but definitely not least thank you so very much to the entire reviewing community, you are so very welcoming and so very supportive it really is quite impressive! I have written reviews for the past three years, but just started taking it seriously and I am so grateful for this because I have met so many wonderful and amazing people just in the last few months, thank you all so much for welcoming me with such amazing positivity and support! *** gush over!*** My top 12 books of 2017 (in no particular order)🌟\nGail Honeyman Eleanor is truly amazing, strongly recommend this fantastic character driven book! 🌟\nJodi Picoult I read this book in January and it still sticks with me, slightly disturbing, but very well told, and fabulous audiobook narration! 🌟\nJean E. Pendziwol0 Beautifully told story, with amazing characters! And my very first Traveling Sister read! 🌟\nRene Denfeld Just WOW! Brilliant writing, wonderful story, interesting characters, if you are a thriller lover, what are you waiting for? 🌟\nCeleste Ng Think if I had to pick my absolute favorite book of the year, this might be it! SO GOOD! 🌟\nCath Crowley If you love books, you will love this book! And that cover, right? 🌟\nAngie Thomas Just such a well told thought-provoking book! Probably the best audiobook narration of the year! 🌟\nNatalie Barelli The second book in a fabulous series I strongly recommend! If you love complex somewhat psychotic characters, this is the series for you my friends! 🌟\nAlessandra Torre WELL this was just plain old awesome! 🌟\nBryn Greenwood This book was ugly and it was wonderful! The subject matter is tough and disturbing and was hard to read at times, but WOW so well told, bravo to this author! 🌟\nLisa Wingate🌟  Another brilliant book that really made me think, definitely learned some things in this book that I had never known! 🌟\nC.J. Tudor This book is released in January 2018, but it was way too good not to put on this list, definitely pick this up all my mystery/thriller friends!💕 my favorite romance of the year was \nJ. Bengtsson  The book was as sweet as the title sounds, wonderful story with amazing characters! Loved it! 🧙🏻‍♂️ My favorite UF series that I started and finish this year, all deserve a mention as well, all were fabulous and 5*Reads! (this isn’t necessarily my go to genre...) The first book in the three series are \nHelen Harper\nIlona Andrews\nAnne Bishop 🌟 whew I am done, I read 268 books this year and these were my favorites, this was really fun to put together, thank you if you actually took the time to read all the way to this point, much love to all of you! Something book related that has happened in my life in 2017 is I just began a book blog, so of course now I need to shamelessly ask you to follow me!https://audiokilledthebookmark.comWe will be raffling off five $10 Amazon gift cards for everyone that follows us before January 1,2018! So I guess I’m bribing you as well, LOL😇If you have a blog I will follow you back happily! Thank you so much for taking the time to read this..."}, {"userName": "Raya راية", "userReviewDate": "Dec 25, 2017", "userURL": "http://www.goodreads.com/user/show/23224678-raya", "userReview": "\"أكبر الجامعات على الإطلاق هي عبارة عن مجموعة من الكتب.\"#توماس_كارليل\n\nنحن الآن على أعتاب الأيام الأخيرة من عام 2017، وقد قرأت بها -ولله الحمد- 108 كتب حرصت على تكون في مجالات متنوّعة قدر الإمكان، وهي:الرواياتصمت القبر – أرنالدور أندريداسون، موسم الهجرة إلى الشمال – الطيب صالح، اللص والكلاب – نجيب محفوظ، العائش في الحقيقة – نجيب محفوظ، في انتظار البرابرة – ج.م كوتزي، عصفور من الشرق – توفيق الحكيم، ملائكة وشياطين – دان براون، لاعب الشطرنج – ستيفان زفايغ، خالتي صفية والدير – بهاء طاهر، دكتور جيكل ومستر هايد – روبرت لويس ستيفنسون، أسطورة لعنة الفرعون – أحمد خالد توفيق، حلقة الرعب – أحمد خالد توفيق، مذكرات الأرقش – ميخائيل نعيمة، الأمير الصغير – أنطوان دو سانت إكزوبيري، السيانيد الساطع – أغاثا كريستي، الليالي البيضاء – دوستويفسكي، أنا لا أخاف – نيكولو أمانيتي، أغنية الجليد والنار 2: صدام الملوك – جورج ر.ر مارتن، الثلج الحار – يوري بونداريف، الحمار الذهبي – أبوليوس لوكيوس، Great Expectations – Charles Dickens، Hallowe'en Party – Agatha Christie، The Book Thief – Marcus Zusak، Gone Girl – Gillian Flynn، A Little Princess – Frances Hodgson Burnett.القصص القصيرة والمجموعات القصصيةهذا هو الحب – يوسف السباعي، الحب وسنينه – أحمد بهجت، كتاب الرمل – خورخي لويس بورخيس، قضايا بوارو المبكرة – أغاثا كريستي، قصص ضائعة – غابرييل غارسيا ماركيز، حلم رجل مضحك – دوستويفسكي، ليلة الزفاف – توفيق الحكيم، ليل الغرباء – غادة السمان، اثنتا عشرة قصة قصيرة مهاجرة – غابرييل غارسيا ماركيز، المكتبة الغريبة – هاروكي موراكامي، The Golden Goose – Jacob Grimm، The Librarian of Basra: A True Story from Iraq – Jeanette Winter.الكتب الفكرية – الدينيةالإسلام وأصول الحكم – علي عبدالرازق، معالم في الطريق – سيد قطب، بحار الحب عند الصوفية – أحمد رجب، الوهابية بتقارير القنصلية الفرنسية في بغداد – هشام ناجي، مستقبل الإسلام خارج أرضه: كيف نفكر فيه – محمد الغزالي، الإسلام بين العلم والمدنية – محمد عبده، لصوص الله: إنقاذ اليوتوبيا الإسلامية – عبدالرازق الجبران، دوامات التدين – يوسف زيدان، مشكلة الأفكار في العالم الإسلامي: مالك بن نبي.الكتب التاريخيةأساطير بابل وكنعان – شارل فيروللو، أيام لها تاريخ – أحمد بهاء الدين، فجر الضمير – جيمس هنري برستيد، أقباط مسلمون قبل محمد (صلى الله عليه وسلم)- فاضل سليمان، مرايا: ما يشبه تاريخًا للعالم – إدواردو غاليانو، اليهود أنثروبوجيًّا – جمال حمدان، أبناء الأيام – إدواردو غاليانو.الكتب السياسيةالعقد الاجتماعي – جان جاك روسو، الأمير – نيكولو ميكافيللي، مقالة في العبودية المختارة – إتيان دو لا بواسيه.علم النفسالإشاعة: سلسلة الحرب النفسية 1 – مصطفى الدباغ، تشريح التدميرية البشرية – إرك فروم، الإنسان يبحث عن المعنى – فيكتور فرانكل.الكتب الدينيةتعريف عام بدين الإسلام – علي الطنطاوي، الشفاعة – مصطفى محمود، أول مرة أصلي: وكان للصلاة طعم آخر – خالد أبو شادي.الشعررباعيات الخيام – عمر الخيام، أشهد أن لا امرأة إلا أنتِ – نزار قباني، ديوان الساعة – أحمد مطر، لافتات من 1-7 – أحمد مطر، الرسم بالكلمات – نزار قباني، ليس كل الأحلام قصائد – قصائد كتبها الأطفال – ترجمة عبدالرحمن الماجدي.كتب الخوارق – إن أمكنني تسميها ذلك30 ظاهر خارقة حيرت العلماء – راجي عنايتالمسرحياتيا طالع الشجرة – توفيق الحكيم، كاليغولا – ألبير كامو، ثورة الموتى – إروين شو، The Seventh Man – Micheal Redgrave، Soir – Paul Vialar، Something Unspoken – Tennesse Williams، The Oyster and The Pearl – William Saroyan، Private Lives – Noël Coward، l'impromptu de Versailles – Molière.الكتب الاجتماعيةحكايات مسافر، مصطفى محمود، ثقوب في الضمير: نظرة على أحوالنا – أحمد عكاشة، أناشيد الإثم والبراءة والخروج من التابوت – مصطفى محمود.كتب الخواطر والدراسات والمقالات والكتب الثقافية والأدبية واللغويةصولو: بكاء منفرد – مهند العزب، اقرئي يا بلادي – شادي عبدالسلام، في أحضان الكتب – بلال فضل، داخل المكتبة.. خارج العالم – راضي النماصي، دمعة وابتسامة – جبران خليل جبران، تمرد الأنثى في رواية المرأة العربية وببلوغرافيا الرواية النسوية العربية 1885-2004 – نزيه أبو نضال، كتابات من السجن – بوبي ساندز، فقه اللغة – أبو منصور الثعالبي.كتب السيرنساء رائدات من الشرق 2 – إملي نصر الله، وجاء أبو بكر – خالد محمد خالد، بجعات برية – يونغ تشانغ، ولدت هناك، ولدت هنا – مريد البرغوثي، رجال حول الرسول – خالد محمد خالد، مذكرات الولد الشقي – محمود السعدني، رحلتي الطويلة من أجل الحرية – نيلسون مانديلا، مذكرات عبد أمريكي – فريدريك دوغلاس، رأس المال لكارل ماركس: سيرة – فرنسيس وين، إيران تستيقظ: مذكرات الثورة والأمل – شيرين عبادي، اجتهادات بين الحظوظ والعثرات – عبدالفتاح محمود جابر عبده.ملاحظات حول قراءة هذا العام:•\tهذا العام مميّز جدًا على الصعيد الشخصي أيضًا والذي أثر بدوره على مستوى قرائتي واختياري للكتب، فأخيرًا وجدت شخصًا يشاركني القراءة والحديث الذي لا ينتهِ عن الكتب والكتّاب والقراءة وعن كل شيء، فأصبحنا نقرأ سويّة ونتكلّم في كل سطر، هذه المتعة التي اكتشفتها للمرة الأولى هذا العام وأتمنى أن تستمر إلى ما لا نهاية.•\tمتوسط تقييمي للكتب هذا العام هو 4/5، وهذا مؤشر جيد على ارتفاع نسبة الكتب الجيدة التي قرأتها.•\tفي هذا العام أيضًا وقعت في سحر كتابات إدواردو غاليانو من جديد – كنت قد قرأت له في العالم الفائت، كرة القدم في الشمس والظل-، وأنصحكم جميعًا بالقراءة له.•\tفي هذا العالم السعيد، وصلني 50 كتابًا كهدايا ثمينة أعتز بها جدًا، فلم أتوقع يومًا أن أُهدى كتبًا!•\tشاهدت العديد من الأفلام والمسلسلات المقتبسة من أعمال أدبية سواء عربية أو أجنبية، وفي كل مرة تترسخ في ذهني جملة \"إن الكتب أجمل وأفضل من الأفلام\".•\tفي هذا العام لم أقرأ أي عمل أدبي صدر حديثًا، خصوصًا تلك الروايات التي يصدّعون رؤوسنا بها على مواقع التواصل الاجتماعي، فالوقت لا يكفي لإهداره على هراء متكرر، فأصبحت أكتفي بقراءة مراجعات لبعض القراء الكبار عن هذه الأعمال لأقرر بعدها أن أقرأها أو أصرف النظر عنها تمامًا، ودائماً الخيار الأخير هو الأرجح.•\tلأول مرة في حياتي، أفوز بثلاثة كتب من صفحة للقراءة: وهي رواية مذلون مهانون – دوستويفسكي، الجهل – ميلان كونديرا، كرة القدم في الشمس والظل – إدواردو غاليانو.•\tأصبحت أجيد التعامل مع حالة جفاف العيون التي تصيبني عند زيادة التركيز، فأتوقف عن قراءة الكتب الورقية والإلكترونية وألجأ للكتب الصوتية المفيدة جدًا جدًا جدًا.•\tوصلت للكتاب رقم 600 في حياتي.•\tفي هذا العام تحديدًا شعرت وللمرة الأولى بأنني أصبحت أجيد التعبير عن أفكاري وعن كل شيء تعلمته من قراءاتي في السنوات السابقة، وأصبحت أجيد تكوين رأي شخصي عن نفسي وعن العالم بشكل أوضح.•\tMy Year in Bookshttps://www.goodreads.com/user/year_i...•\tأصبحت مكتبتي الصغيرة تضم 259 كتابًا.صورة لمكتبتي الصغيرة العزيزة\nكانت رحلة غنيّة جدًا بين أحضان هذه الكتب، فبكيت وضحكت وغضبت وحزنت وتألمت وسَعِدت .. وإلخ من المشاعر التي لا تعد ولا تصحى، وكم هائل من الأفكار والمعلومات والعلوم والمعارف والخبرات والإحساسات والإدراكات تضمها هذه الصفحات. الحمد لله الذي وفّقني بفضله لإتمام هذه الكتب، وشكرًا جزيلًا لكل من أحبني وأحب الكتب، ولكل الأصدقاء القرّاء، ولكل من قرأ الكتب الصوتية، ولقطرات ترطيب العيون، صديقاتي الحميمات.\n..."}, {"userName": "Adina", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/22189348-adina", "userReview": "This year was wonderful as a Goodreads member but not as good as a reader. I meet new friends and I had thought provoking conversations with my older ones. I grew my book knowledge thanks to my presence here and I am thankful for all the meaningful time I spent on this platform. However, this year was less impressive in reading terms. I made some poor choices and they were due to GR as well. Inspired by other friends, I followed some rewards and forced myself to read books that were not for me. I also jumped into some books because other friends swore by them only to realize that they weren't for me. I also discovered some incredible good reads that I wouldn't had touched without encouragement. The Unseen would be the best example in this respect. Without further ado, here is my TOP 10 of 2017:1. The Three-Body Problem by Liu Cixin 2. The Unseen by Roy Jacobsen ; review 3. The Handmaid's Tale by Margaret Atwood4. The Remains of the Day by Kazuo Ishiguro5. The Silkworm by Robert Galbraith6. Player Piano by Kurt Vonnegut7. Home Fire by Kamila Shamsie8. Dissolution bu C.J. Samson9. Fingersmith by Sarah Waters10. History of Wolves by Emily FridlundI also need to mention 2 series that I enjoyed reading this year: Mistborn by Brandon Sanderson and The Dark Tower (partially read) by Stephen King."}, {"userName": "Matthew", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "A very good reading year with primarily 4 and 5 star books. Also the most books I have ever read in one year at 137. However, I also had two 1 star books which I haven't had for a few years.Here is the basic breakdown: Best book this year:   and my 2017 overall Bradbury experience. Also, I think I need to give honorable mention to  Worst book this year: Tie    Pleasant surprises:            Expected more:      Series I liked:  Series I didn't care for:"}, {"userName": "Ilse", "userReviewDate": "Dec 28, 2017", "userURL": "http://www.goodreads.com/user/show/22848274-ilse", "userReview": "Comforting books, disconcerting books, having not set any reading (or other) goal for 2017 I mostly just ventured into reading what seemed to chime with my mood and whims, besides from the choices fixed by the book club. 2017 turned out a rather excellent year as far as reading and books – ever true friends - were concerned, although the friendship was at times disgracefully unilateral, life often too demanding to write reviews or catch up with the ones written by friends (for which I sincerely apologize). Calling this reading year memorable, I would do so if only for Franz Kafka’s Letters to Milena. Reading these letters, from which Kafka emerges not solely as an anxious and restless insomniac man on the edge but as well as a witty, loving and playful human being bestowing his epistolary companion with endearing tenderness and affection, was an overwhelming experience. I got entirely lost in the fulgurant intensity of the letters, the brilliant beauty of the sentences, their unexpected lyricism and tenderness, the sensuous and horrifying poetry of certain fragments. Reading the letters to Milena, together with coming across Maurice Blanchot (De idylle, The Madness of the Day) put me back on track of reading Kafka’s stories (In the Penal Colony, The Judgement). A dear, wise friend inspired me to read more poetry again, and I was mesmerised by a few bilingual collections, namely by the French surrealist Paul Éluard (Wereld met ogen van sneeuw), by Paul Verlaine (Het zal een zomerdag vol zonlicht zijn) and W.H. Auden (Tell Me the Truth about Love). I was amazed by a collection of love poems by Raymond Carver (Het woord liefde), who I only knew and read as a short story writer – honest and powerful, suggestive poetry. Further I was enthralled by poetry by Anna Akhmatova, Emily Dickinson, Gerrit Kouwenaar, Toon Telleghen and Piet Paaltjens (how remarkable fresh and funny his Snikken en Grimlachjes still is!) and I loved the way the Dutch poète maudit Menno Wigman catapulted me back into the delight of decadent nights of youthful urban decay coming home weary from the Christmas family parties. The five collections by Wyslawa Zymborska I have read, left me somewhat with mixed feelings, however I liked the humour and philosophical playfulness of her poetry. Most tugging at the heartstrings (as painfully close to the bone) was the poetry collection Undying: A Love Story novelist Michel Faber wrote to commemorate and deal with the loss of his wife – an intimate and deeply courageous and moving recount on his thoughts and feelings regarding her long illness, death and the aftermath. Voicing what seems ineffable, he inspired me with awe and gratefulness, as did other books on bereavement, Roland Barthes’s Mourning Diary, Julian Barnes’s Levels of Life, Jens Christian Grøndahl’s Often I Am Happy - in their diversity all in a sense helpful. As is yoga. The most rewarding read in the book club this year was a rediscovery, a Flemish classic, Willem Elsschot and his Villa des Roses, but the most animated discussion we had concerned Ian McEwan’s Sweet tooth, which I found in a way deeply and disturbingly misogynistic. The genre of the graphic novel still strongly appeals to me, particularly the biographical ones, like Guillaume Sorel’s The Last Days of Stefan Zweig and Salva Rubio’s Monet:Itinerant of Light. Other graphic novels that resonated with me, emotionally and/or aesthetically were Wrinkles (Paco Roca), Irmina (Barbara Yelin), Het zotte geweld (Joris Vermassen) and the gut-wrenching Les Cahiers russes (la guerre oubliée du Caucase) by Igort. Other highlights were T.S. Elliot, Fallada, Austen, Zweig, Fontane, Hesse, Dürrenmatt, Dickens. With working through the ‘Perlouses’ series (20 slender volumes distilled from French literature), I spent quite some time in France, mostly enjoying the diversity of the authors presented in this series (Balzac, Voltaire, Kundera (on Francis Bacon), Robert Pinget, Abbé Prévost, Jean Echenoz (Plan of Occupancy), Pierre Michon, Diderot, Stendhal, Yves Pagès, Marguerite Duras, Yasmina Reza (Dans la luge d'Arthur Schopenhauer), Alain Fleischer. Marquis De Sade (Augustine de Villeblanche of Liefdes list), Vivant Denon). Of these stood out for me Marcelle Sauveagot(Commentary), Zola (Comme on meurt) and Madame de la Fayette’s La Comtesse de Tende. The latter lady, having me curious on Jansenism, pointed me to Richard Wilkinson’s biography on Louis XIV I had intended reading for a long time – a captivating book of which I learned a lot despite not exactly liking the jesting tone of the writing. As to non-fiction the year started grandiose with Andrew Graham-Dixon’s biography on Caravaggio (Caravaggio: A Life Sacred and Profane), one of my favourite painters, and a book on the pioneers in photography (Freddy Langer, Icons of Photography: The 19th Century). I thoroughly enjoyed a short biography on one of my favourite composers, Brahms, and a very brief one on Pushkin (by Robert Chandler). What at first seemed a promising travelogue in the footsteps of Dostoevsky turned out rather disappointing in the somewhat awkward repetitiveness of the author’s (however interesting) premise to parallel Dostoevsky’s ideas to the current regime’s (Peter d’Hamecourt, In het spoor van de Russische ziel). The centennial of the Russian Revolution inspired me to read Lenin on the train by Catherine Merridale, Historically Inevitable?: Turning Points of the Russian Revolution (edited by tony Brenton) and Victor Sebestyen’s huge and engrossing biography on Lenin - which in a way all both completed and challenged each other.I have started dipping my toes into philosophical waters by reading a great introduction by David Palmer, Looking at Philosophy: The Unbearable Heaviness of Philosophy Made Lighter, also finding much food for thought in the Wat blijft (by Patricia de Martelaere) and with Kris pint (De wilde tuin van de verbeelding), at the moment continuing slowly with Bertrand Russell’s  A History of Western Philosophy. Growing more and more fidgety halfway the year not having much time to read because of the rush at home and at work, I engaged into a few collections of short stories, first reading them from cover to cover – having great encounters with Katherine Mansfield (In a German Pension: 13 Stories), Thomas Bernhard (Op de boomgrens) and Richard Yates (Eleven Kinds of Loneliness). When restlessness increased I found myself gradually singling out novella’s or short pieces by favourite authors, as a substitute for a pat on the back whenever I thought I deserved so, for finally filling in that tax form or simply getting the family dinner on the table every evening (Pushkin (Queen of spades, unfinished short pieces, fairy-tales), some short stories by Dostoevsky, (The Christmas Tree and the Wedding), hazarding further into Poe, Baudelaire (The Generous Gambler), Woolf (A Haunted House), and quite some short stories and novella’s I found online, via the project Gutenberg or in the New Yorker. Feeling that with this turning into an almost daily routine instead of calming down I am on the way on developing another addiction next to sipping too much coffee, I will abstain from on line reading next year, and if reading short stories, stick to the ones safely glued in books. Reading Ovid’s Metamorphoses, a re-telling of the Odyssey for children (Michael De Cock, De lange weg naar huis) and Aesop’s fables this year has enthused me to attempt further straying from my usual inclination to stick to 19th – mid-20th century authors. Thanks to Kris 2018 will be marked by reading Homer and hopefully some other books related to Ancient Greece/Rome. In the second half of the year I hope to be able again to involve into a few more voluminous reads – having quite some tempting recommendations from friends waiting (David Grossman, Tim Parks, Javier Marías, Hemker, Verbogt - l’embarras du choix!) as well as other bricks on the shelf one cannot smuggle unnoticed in the handbag (George Eliot, Thomas Mann).Many, many thanks to all of you, for your warmth, for your friendship and support, for sharing your love for books, and for so generously writing such tempting, inspirational and perceptive reviews here. Wish everyone of you a blissful 2018, may it be another year filled with joy, love and exquisite and juicy books. En avant la musique, and happy reading!"}, {"userName": "Lyn", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "Hooray for Goodreads! I’m celebrating my sixth year on this fantabulous site and am now wishing all of my GR friends a Laurel and Hardy handshake and good tidings in this holiday season.2017 was another great reading year for me. In addition to meeting so many new friends and keeping up with my established GR friends, I also spent a great deal of time in Discworld, so much so that my passport was inked over and I got a tax notice from Lord Vetinari.It was my plan to read all of the Discworld novels and many of the short works and companion books and I did – so a very special shout out to Terry Pratchett and his wonderful creation.I also spent a great deal of time with Stephen King and am still enjoying reading his exceptional canon. Along with King, I am also binge reading the fine works of John D. MacDonald and am very much enjoying not only his Travis McGee books, but am realizing what a phenomenal writer he is overall.I awarded FOUR 5 star ratings this year, so here’s a shout out for those outstanding works:The Dispossessed by Ursula K. LeGuin. This was already on my all-time favorite list and so this 2017 read was a return visit. I liked this even more this time around and I’ll likely reread again.The Kite Runner by Khaled Hosseini. I was blown away by this superb work and recommend to all. I will read more from this author.Rendezvous with Rama by Arthur C. Clarke. I had read this in HS, decades before GR, and so this was a reread. I recall liking it, but from this older perspective I saw how truly brilliant was this book, influential and innovative.News of the World by Paulette Jiles. This quiet and unassuming poetic prose was a pleasant surprise and thoroughly enjoyable. A lesson to all readers that you just never know where you’ll find your next 5 star reading experience.According to GR 2017 review, I read over 130 books with over 45,000 pages and I enjoyed them all – NO 2 or 1 stars this time around. Here are some honorable mentions:Peter Pan – a MUST read for all speculative fiction fans.Fritz Leiber’s Fafhrd and the Gray Mouser stories – excellent sword and sorcery fiction.A Monster Calls – wonderful YA book, but have your tissue ready, it almost made me tear up!Neil Gaimen’s Norse Mythology.Rhett C. Bruno’s science fiction.F. Paul Wilson’s Repairman Jack stories. I’ll read these all at some point.A Gentleman in Moscow by Amor Towles, I’ll definitely read more from Mr. Towles.Fredrik Backman’s Bear Town and A Man Called Ove – I’ll be reading more from this writer.So another great year has come and gone and the good news is that there are still MILLIONS of books to explore and share. To all my Goodreads friends:Sláinte mhaith!"}, {"userName": "Dan Schwent", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "2017 was a busier year than usual for me. I went to Maine, lost my dog of 17 years, and gained a wife and a cat. Thus I didn't read nearly as many books as I would have liked during quieter years.However, I like to think the overall quality was much higher than in previous years. I was a little more selective and a lot less willing to push through things I wasn't enjoying. Reading is for pleasure, after all, not self-torture.While I already compiled my 2017 Dantastic Book Awards, here are some highlights.1. I finally saw the light and devoured most all of the books of Laird Barron.2. The Elephant Who Liked To Smash Small Cars was finally reprinted.3. I read more than my share of neo-Lovecraftian fiction. Winter Tide, The Night Ocean, The Final Reconciliation, and After the End of the World were the creme of the crop.4. I tore through most of Hunter Shea's creature features.5. While the demise of DarkFuse was a shame, I took full advantage of the discounted ebooks. The Winter Box, Corpse Rider, and Fairy Lights were all more than worth what I paid for them.6. With the rise of ebooks, novellas are back! The following novellas are highly recommended: The Tea Master and the Detective, River of Teeth, Revolver, and Just Add Water.7. I did a fair amount of rereading, mostly books I initially read in the dreamlike time before Goodreads. I'm happy to say Hyperion, The Talisman, and The Handmaid's Tale all stood the test of time.8. Other Books I enjoyed in 2017 - The Sound of Broken Ribs, Lost Boy: The True Story of Captain Hook, The Last Place You Look, The Dunfield Terror, Fungoid, and Tampa.Addendums:1. Another milestone - I started wearing reading glasses2. The Far Empty was superb3. I should have included Mrs. Caliban in my list of books I enjoyed."}, {"userName": "Kevin Kelsey", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/10445368-kevin-kelsey", "userReview": "edit: I just finished Timothy Snyder's On Tyranny, and had to include it in my list for the year. It's very, very good. The last few years I've been tracking my reading not only on Goodreads, but through a Google Sheets doc I designed to generate some highly detailed stats, graphs, etc for nerds: It's available here.This year I was a lot more selective about finishing the books that I started. Really, I was a lot more selective in general. I bailed on 10+ books about halfway through because they just weren't holding my interest, or because it wasn't the right time to read them, etc. I never rate/review books that I haven't finished, because I don't think I deserve an opinion on something if it isn't informed, and it's not informed unless I've completed the book.Unless I read something ridiculously good in the next couple weeks, here are my top ten 2017 reads broken into Fiction/Non-Fiction:Fiction:Superabundance, by Heinz HelleThe Resurrection of Joan Ashby, by Cherise WolasGrowth, by AJ SmithThe Intuitionist, by Colson WhiteheadUniversal Harvester, by John DarnielleA Visit from the Goon Squad, by Jennifer EganLittle Sister, by Barbara GowdyVoid Star, by Zachary MasonThe Dark Dark, by Samantha HuntDune, by Frank HerbertNon-Fiction:On Tyranny, by Timothy SnyderEthics in the Real World, by Peter SingerMy Struggle: Book 5, by Karl Ove KnausgårdThe Subtle Art of Not Giving a F*ck, by Mark MansonReality Hunger, by David ShieldsThe Devil’s Dictionary, by Ambrose BierceThe Cruft of Fiction, by David LetzlerMan of the Year, by Lou CoveInformation Doesn’t Want to be Free, by Cory DoctorowWe Did Porn, by Zak Smith"}, {"userName": "Lisa", "userReviewDate": "Dec 22, 2017", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "Well, 2017!You've been a roller coaster of a year for sure, hilarious, nauseating, up and down, fast speed, confusing, - and you leave me somewhat disoriented and shaky on my legs. Best reading experience of the year? Well, there is a lot to choose from, but I have to say that the adventure of reading all of Henry Green's novels over summer was a blast:LovingParty GoingLivingBlindnessBackCaughtDotingConcludingNothingThe other reading marathon that stands out is the Dostoevsky tour de force:Notes from UndergroundCrime and PunishmentThe IdiotDevilsThe Brothers KaramazovApart from that concentration on specific authors, I have had a blast reading some of my favourite authors again, most notably Heinrich Böll:The ClownThe Lost Honor of Katharina BlumGroup Portrait with LadyThe Safety NetAs for classics, I finished two Roman epics:MetamorphosesThe Aeneid... and some plays by Shakespeare that I hadn't read before:The Winter's TaleThe Taming of the ShrewI discovered Nella Larsen and Colleen McCullers, and was pleased to see these fine authors' work being directly catapulted into my favourite shelf:PassingQuicksandThe Heart Is a Lonely HunterMany of my old favourite dystopian novels were reread with the scary realisation that they have turned into realistic fiction by now:1984Brave New WorldFahrenheit 451The Handmaid's TaleNever Let Me GoIt has been a year of angry reading as well, of frustration with a world gone blind to historical mistakes, and in this context, Christa Wolf's Kindheitsmuster touched me more than any other book, showing how fascist indoctrination works even in a regular, loving childhood home in a decent small town.The reading list for 2017 will of course not be completed before I have finished my December Dickens 2017, but I actually cheated a bit mid-year and squeezed in Martin Chuzzlewit, Dickens' perfect rendering of the American (un)spirit. And of course, 2017 finally is also the year I managed not only to start The Life and Opinions of Tristram Shandy, Gentleman, but also to finish it. A truly amazing fact, considering how many years it stood untouched on my shelf, waiting for me to stop digressing.What will the future bring? Wishes for 2018? A bit less of the dystopian reality, maybe, and a bit more time for reading and discussing books. Goodreads remains my most favourite place for book talks, and I can't thank you all enough for making reading even more rewarding by your friendly, intelligent, polite, enthusiastic, dedicated, passionate participation in the world of books!Happy reading!"}, {"userName": "Kevin Ansbro", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/43579369-kevin-ansbro", "userReview": "The end of the year is barreling along like Keanu Reeves on a bus, so I thought I'd post an inventory of the books I've read in 2017.*Sigh* I'm not trying to make anyone envious here, but I have comfortably exceeded my target of one whole book by reading thirty-six, so well done me!And where's my blasted prize? I would like to thank my many groovy Goodreads friends (whose eloquent reviews are often better than the books they've critiqued). We don't always agree with each other's literary taste, but this exchange of conflicting opinions is what makes Goodreads so fascinating! Besides, were it not for the recommendations of my bookish buddies, I mightn't have read my fabulous top three. : )I love you all and look forward to an even better 2018! Without further ado, here is my list of books read in 2017.They are set out sequentially, in the order that I liked them (favourite one at the top, least favourite at the bottom).HimselfThe Heart's Invisible FuriesA Gentleman in MoscowShalimar the ClownBeauty is a WoundThe New York Stories of Edith WhartonA Handful of DustThe War of Don Emmanuel's Nether PartsThe Line of BeautyThe Merchant and the Alchemist's GateDublinersXinguBloodchildThe Improbable Wonders of Moojie LittlemanDeadman's Tome: Campfire Tales #2The Glassblower's BreathThe LotteryNeverwhereThe DinnerThe EmigréThe God of Small ThingsThe Golden HouseTwo Years, Eight Months and Twenty-Eight NightsLie With MeThe Story of Edgar SawtelleBelgraviaApple Tree YardA Partisan’s DaughterThe Crying TreeEight Months on Ghazza StreetAfter Me Comes the Flood The Girl With the Dragon TattooLight of the FirefliesThe End We Start FromLincoln in the BardoDomina Maestra #2 (what was I thinking? Last-minute grab at Heathrow Airport)."}, {"userName": "Charlotte May", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/14002983-charlotte-may", "userReview": "This has been my first year as an active member of goodreads! Turns out I've been registered for years but just never grasped the amazingness of this webiste until now!I've discovered tonnes of new books (and friends) and relived some old favourites! Plus I've won a selection of giveaways which were very exciting!Top books of the year so far (in no particular order)1) The Raven Boys and The Dream Thieves2) Assassin's Apprentice and Royal Assassin (really keen to continue with this series)3) The Last Place You Look4) A Song of Ice and Fire Series - George R.R. Martin (currently on A Feast for Crows)5) Birdsong6) The Edge Chronicles - Twig Saga - Paul Stewart Beyond the Deepwoods The Edge Chronicles 5: Stormchaser: Second Book of Twig The Edge Chronicles 6: Midnight Over Sanctaphrax: Third Book of Twig7) All the Light We Cannot See8) Inheritance (series started in 2016 but completed in 2017)9) Countless10) Six of Crows11) The Clan of the Cave Bear12) The Handmaid's Tale13) Quicksand14) Sabriel15) A Monster CallsDisappointments this year:1) A Heartbreaking Work of Staggering Genius2) I Am Number Four3) The Fifth Mountain4) The Hundred-Year-Old Man Who Climbed Out of the Window and Disappeared5) Never Let Me Go6) Girls on Fire7) The Valley of HorsesStill plenty more to come before the end of the year :D"}, {"userName": "Steven  Godin", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/26706841-steven-godin", "userReview": "Last year, the novel was my best friend. We shared morning coffee together, decadence on the banks of the Seine, and evenings with fine wine under starry skies. It played a big part this year, but also took a vacation, paving the way for non-fiction, short-stories, poetry, plays and essays. Yep, 2017 was a time of diversity. Four years on from joining, and goodreads continues to be a great place to hang out. I take just as much pleasure reading your great reviews as I do writing them, and thank the GR community for their warmth and attitude towards others. I just wish the damn morons sexually harassing women would cut it out. If you have no real interest in books, screw off somewhere else!.I raise a Zombie Cocktail to all friends and followers, best wishes, stay safe, and hope you have a delightful year end!. 2017 highlights - Best reads (In no particular order),A Heart so White - Javier MaríasMemoirs of a Dutiful Daughter - Simone de BeauvoirAlone in Berlin - Hans FalladaTwenty Love Poems and a Song of Despair - Pablo NerudaImmortality - Milan KunderaThe Case of Comrade Tulayev - Victor SergeContempt - Alberto MoraviaDream Story - Arthur SchnitzlerBeware of Pity - Stefan ZweigLiars in Love - Richard YatesThe Sea, the Sea - Iris MurdochComplete Poems - Dorothy Parker4.48 Psychosis - Sarah KaneThe Skin - Curzio MalaparteOn Heroes and Tombs - Ernesto SabatoNo Exit and three other plays - Jean-Paul SartreThe Prime of Miss Jean Brodie - Muriel SparkHHhH - Laurent BinetCollected Poems 1920-1954 - Eugenio MontaleIf Not Now, When? - Primo LeviBiggest disappointment, (still liked it, but not the masterpiece I thought it would be)The Savage Detectives - Roberto BolañoWorse read, (so bad I set fire to it)Fury - Salman Rushdie Looking forward to 2018, we get to do it all over again!.Hopes for next year, Kundera finally wins the Nobel Prize."}, {"userName": "SueBee★bring me an alpha!★", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/15735368-suebee-bring-me-an-alpha", "userReview": "⭐️ ⭐️ ⭐️ MY BEST READS IN 2017! ⭐️ ⭐️ ⭐️I cannot believe another year has gone by! Thank you to all my Goodreads friends for your support and for many great recommendations! Thank you all authors!\n ❤️ Mists of Serengeti ❤️“Sometimes you come across a rainbow story—one that spans your heart. You might not be able to grasp it, but you can never be sorry for the color and magic it brought.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ Dirty Filthy Rich Men ❤️“His lips were frantic and frenzied against mine, as though no matter how much a gave him-- and I gave him everything-- it wasn’t enough. It could never be enough.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ One with You ❤️“Angel, if you’re not missing the feel of my cock inside you, I need to step it up, not hold back.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ An Exaltation of Larks ❤️“Is not the Larks that kill you. It’s the exaltation.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ The Unrequited ❤️“Because unrequited love is like a dead, useless organ. It’s functionless. It’s sicker than a disease. You can cure a disease, but you can’t fix a defective soul.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ Savage ❤️“Despite the light she brings into my world, I only bring darkness into hers.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ Still ❤️“Still?” she asks with a watery smile. “Yeah.” Always. Evermore. Even after. “Still.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ Move the Stars ❤️“I wanted those words she’d swallowed and saved, as much as I wanted to be the only man to ever get them.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ True Love Story ❤️“The evening feels like a long love letter, with sweet touches and looks speaking volumes of truth.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ American King ❤️“Perhaps Embry’s always had the part of me that wielded the sword, but she… she’s always owned the part that wears the crown.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ El Santo ❤️“He was the beginning to my end or maybe it was the end to my beginning.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ Commander in Briefs ❤️“You’ll never fuck another man.”“I’ll bury a bitch that looks at you with more than a glare.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ Children of Ambition ❤️“I would have left you out there and thrown this ring back at you if I saw weakness. I see what your enemies see, a sleeping dragon. I’m the only woman who can make sure everyone knows you’re awake.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ Jahleel ❤️“In that moment, it dawned on me that even if I won him, I wouldn’t be able to contain him. He was a beast, and I didn’t have the skills to tame him.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...I need to include two 5-star novellas:\n ❤️ Cameron’s Contract ❤️“Our fight was not for supremacy but to prove to each other how deep our love went, as though words failed us. The only truth was this, my mouth taking hers in a desperate fucking of souls.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...\n ❤️ If I’d Known ❤️“I’ve come to accept that, regardless of how honest or silent I am, the truth is fated to destroy my life.”⭐️⭐️⭐️⭐️⭐️ https://www.goodreads.com/review/show...Best Books read in 2016: https://www.goodreads.com/review/show...Best Books read in 2015: https://www.goodreads.com/review/show...And in closing: My Year 2017 in Books, according to Goodreads: https://www.goodreads.com/user/year_i...THANK YOU to all my Goodreads friends from near and afar for another year of exchanging next read ideas and chatting books and heroes! xo"}], "description": "Whether or not you've had time to write your own reviews, here's a chance to review your entire 2017 reading and post it under this title so that others can see what your reading year was like. Together, all the reviews of 2017 on Goodreads should make an interesting and varied catalogue of books to inspire other readers in 2018.For those of you who don't like to add titles you haven't actually 'read', you can place 2017 on Goodreads on an 'exclusive' shelf. Exclusive shelves don't have to be listed under 'to read', 'currently reading' or 'read'. To create one, go to 'edit bookshelves' on your 'My Books' page, create a shelf name such as 'review-of-the year' and tick the 'exclusive' box. Your previous and future 'reviews of the year' can be collected together on this dedicated shelf.Concept created by Fionnuala Lirsdottir.Description: Fionnuala LirsdottirCover image: Cézanne", "title": "2017 on Goodreads\n      \n          (Goodreads Year in Review)", "url": "http://www.goodreads.com/book/show/33642317-2017-on-goodreads", "average": 4.24, "cover": "https://images.gr-assets.com/books/1498945264l/33642317.jpg", "reviews": 1341, "authors": [{"url": "https://www.goodreads.com/author/show/5481957.Various", "name": "Various"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/33642317-2017-on-goodreads", "http://www.goodreads.com/book/show/23308785-best-jokes-2014", "http://www.goodreads.com/book/show/16268895-101-best-jokes", "http://www.goodreads.com/book/show/33232571-2016-on-goodreads", "http://www.goodreads.com/book/show/28181315-2015-on-goodreads", "http://www.goodreads.com/book/show/18711711-101-dirty-jokes---sexual-and-adult-s-jokes"]}