{"ratings": 213, "userreviews": [{"userName": "Elaine", "userReviewDate": "May 24, 2012", "userURL": "http://www.goodreads.com/user/show/2352900-elaine", "userReview": "Really wanted to like this one - have lived my life in a largely male profession, not Wall Street per se, but close enough that the traders, quants, masters of the universe, and big swinging [you know whats] cross my path with some regularity - so I was intrigued by this tale of a female pioneer in the City. And while my exposure to the roaring 80s was just a single summer job at Lehman, the legendary excess of those times informed my coming of age. But Aifric Campbell, despite knowing her milieu inside and out, doesn't deliver. Gerry is too sodden with tears and alcohol, so blindly (to us) weak and manipulated, we are sick of her long before she is sick of herself and also can't fathom how she ever became a star...only her decline, and not her talent or her success, makes sense. The ending is merely tacked on. No real development - just an inexplicable change of scene. What's next for Geri? Silicon valley? Anyway, the story of those early lonely female masters of the universe remains to be written."}, {"userName": "Kelsea", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/13988402-kelsea", "userReview": "I’m honestly a little surprised that this currently has a 2.85 rating. I know I’m only giving it a three, but I tend to rate more harshly than Goodreads. Perhaps it was the hype surrounding this book that led to such disappointment in other readers? I didn’t have any expectations going in.Since I read this a few months ago, my memory isn’t the freshest, but I think I remember enough to give it a short (a relative term for me) review. Other reviewers already offer a nice plot overview, so I’m just going to add my opinion.Yes, Geri is absolutely as depressed, pathetic, and weak throughout the book as the other reviewers say. She makes it impossible for the reader or any characters in the novel to respect her. Yet… while this is just me forming a possible conclusion about the writer’s intent (a slippery slope), I don’t think we’re intended to particularly like or respect her. She can’t see how everyone else sees her because she’s too drowned in her own sorrows to be able to comprehend what she has become, let alone to care. That, to me, seemed like the whole point of the culminating scene. I’m writing vaguely and don’t consider this a spoiler, but I’ll put it a few lines down for anyone sensitive to it.Geri can’t be introspective when she’s that blinded by pain. She has to get to the point where (who she considers) the lowest of the low has no respect for her (in an albeit, very odd scene) before she can start to understand what she has become.And that’s why I don’t think you’re supposed to pity her. Everyone but Geri can see that she’s beyond pitiful. And it is hard to read about a character dragging herself through life by barely a thread of hope, especially when it’s from her perspective. We're as frustrated and annoyed by her pain as everyone around her. Yet, somehow, for some reason, a part of me is rooting for her. In a world where emotion is a liability, she dares to allow others to see her vulnerability, if only because she’s past desperate and past caring. She falls so easily that conquering her is hardly a victory and she doesn’t even know when she’s lost.Campbell put all the cards on the table up front – the title, with its clever double meaning, tells you exactly where Geri is, both professionally and personally.I also recall that part of what kept me attracted to the story was her intriguing ability - the reason she climbed the ranks in the first place.The (admittedly abrupt) ending definitely leaves open the possibility of a sequel, and I would be interested in reading it. I’m giving On the Floor an optimistic three stars."}, {"userName": "Cath Murphy", "userReviewDate": "Jan 24, 2013", "userURL": "http://www.goodreads.com/user/show/5152481-cath-murphy", "userReview": "I started this with loads of anticipation - Orange prize nommed, promising Irish writer and a subject (young financial trader struggles to hold her life together) that sounded fresh and original.Oh why do I listen to the hype? It wasn't the writing that let this book down - Campbell is skillful enough - it's not the premise, it's the handling of the premise.After a promising set up (broken love affair, sinister overseas client, bottles of vodka under the bed) the story just falls slowly apart as one tired literary cliche (for example there's a Tragedy In Her Past - who would have thunk it?) after another rears its weary head. The overall effect was to alienate me from the MC. Instead of feeling sorry for her, I ended up wanting to give her a good shake. Not quite the effect Campbell was after.And it's a shame, because with more attention to the plot and a stout resolve to avoid the obvious, Campbell is a good enough writer to compete with some of the best (Atwood, Mantel et al)."}, {"userName": "Rose", "userReviewDate": "Mar 10, 2012", "userURL": "http://www.goodreads.com/user/show/7637016-rose", "userReview": "Although this was longlisted for the Orange Prize, I found it disappointing. The writing style was a bit flowery for me, but having said that Aifric did manage to capture the macho willy waving of the City, a world she clearly knows well, and some of the descriptions were excellent. However, overall the plot was insubstantial and clunky, and as for Geri, well you had to wonder how someone so weak and gullible got to her exalted position in the first place. Shame really, because I feel the novel had the potential to be so much better ..."}, {"userName": "Peter", "userReviewDate": "Apr 19, 2012", "userURL": "http://www.goodreads.com/user/show/4905469-peter", "userReview": "There's much I liked about this book, but particularly that I found the writing very literate and creative and not formulaic. This author is new to me, but I might have guessed she would be good if I had spotted beforehand that the book was based on a short story published in a UEA anthology called Contains Small Parts dating from 2003. Good pedigree!"}, {"userName": "February Four", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/141244-february-four", "userReview": "Passive heroine who never does anything useful. I thought this would be different. Disappointed."}, {"userName": "A. Suiter Clarke", "userReviewDate": "Oct 28, 2015", "userURL": "http://www.goodreads.com/user/show/37626852-a-suiter-clarke", "userReview": "On the Floor follows Geri Molloy, a young woman who got started early and quickly rose to the top as a trader for an investment bank in London. She is gutsy, fierce, and happens to be the only trader that one of the richest investors in Hong Kong will speak to. She's also recovering from a horrible breakup and is facing having to move to China to appease her top client.Campbell clearly knows her topic and writes about the life and energy of an investment bank with an expert hand. It's a new world to me, and that's one of my favorite things about reading books -- being immersed in a new world. As someone who's been through some crappy breakups (haven't we all?), I'm a bit envious of how well she captures the feelings that go along with that. She's excellent at describing physical reactions to emotion:I felt a lurch somewhere below my ribs and a dizzying drop in temperature as if warm fluids were being drained from my body and replaced by formaldehyde chill.This is something I constantly try to achieve, but my characters all seem to feel their feels the same way, with twists to the chest or the gut. So, respect.On the Floor had some great moments, snappy dialogue, interesting characters, and surprising plot points. I would say the last third of the book is actually very powerful, with a back story coming out that I wished would have been more prevalent in the beginning of the book.However, there was one main problem I had with it: it was such a heavy-hearted book. The lightest part of it took place in the last few pages. Geri is depressed and heartsick for the entire novel, abused both emotionally and professionally by the men she's surrounded by. While this is likely accurate for the time period (the early '90s), it makes for kind of a bummer of a read.Certainly not a bad book, but as a reader, I almost cared too much for Geri, got frustrated for her as I would for a friend who was wallowing in misery after a rough breakup. The book is about so much more than her failed relationship, but at the end of the day, that's the part that really stuck out for me, and it was difficult to let go in order to see all the other great points about it."}, {"userName": "Rachelle Ayala", "userReviewDate": "Sep 29, 2013", "userURL": "http://www.goodreads.com/user/show/6790432-rachelle-ayala", "userReview": "The author does a fantastic job of painting the investment banking scene from a female point of view. Unfortunately, the protagonist, Geri Molloy, is in over her head. Despite a talent for mathematics, which she hides, she is kept by her company because a major client in Hong Kong happens to like her and will only deal with her firm through her. This recluse, Felix, appears to play the role of a fairy godfather. He has a paternalistic relationship to Geri and gives her Yoda like guidance, reading from Kant or Descartes, and generally keeps her around as a plaything or curiosity.Meanwhile Geri is a puppet on the string of her bosses, and betrayed by everyone around, especially her slimey ex-boyfriend who takes advantage of her at every turn. After Geri screws up the deal, she goes AWOL in a surreal scene that could have come out of a Stephen King book. We find a lot of gory and sad backstory. Geri is told to snap out of it, and takes up Felix's offer to keep her job by moving to Hong Kong.The ending is unresolved. I think it is supposed to show that she has finally grown up, but somehow I see her as still dancing to strings, this time Felix's. There is a enigma at the very end, and the reader is left wondering which ticket she chooses.Geri is a hard protagonist to follow. She oftentimes delves into backstory as if it were happening in the moment. There are some great scenes of drinking too much and misjudging her surroundings, who she is with and what she should or should not be talking about. I find it hard to believe that Geri, as written, would have ever been seen as a rising star. I did not get the feeling she was that competent. All I saw was that Felix for some reason liked her and his influence kept her in good graces with her employer.Meanwhile, her despicable ex-boyfriend is the epitome of wall street jerk, and her ex-best friend, Zanna, the ultimate backstabber. There were no likeable characters in this story other than Rex, Geri's dog who has a happy ending.As literary fiction, it has great description and sets a somber mood, and therefore I don't expect a plot with the crisp pacing of genre fiction."}, {"userName": "Ligra Nera", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/34868622-ligra-nera", "userReview": "Šios knygos autorė pati yra dirbusi banke, todėl puikiai išmano finansų pasaulio gudrybes. Knygą galmėtų vadinti pusiau autobiografija, nes daugybę faktų rašytoja ėmė iš savo patirties dirbant finansų srytije. Campbell yra parašiusi tris (kiek man žinoma) knygas iš kurių į lietuvių kalbą išversta tik ši.Skaitydama pirmus penkiasdešimt puslapių nesupratau visiškai nieko. Negalėjau įsimint vardų, glumino daugybė finansinių terminų. Perpratus ir įsidėmėjus kas už ką atsakingas ir kas ką veikia finansų pasauly pusę knygos vistiek buvo nuobodu skaityti. Vyravo brokerių darbo aprašymai, jų gyvenimas siekiant užkalt kuo daugiau baksų dirbant po 14-18 valandų per parą ir žinoma daug alkoholio. Galiausiai nuo vidurio knygos pradėjo lysti, aiškėti veikėjų bruožai, išgyvenimai,patirtys, senos nuoskaudos ir psichologinės traumos. Vat tada ir pasidarė idomiau.Didžiulį minusą knygai duoda tik nuspėjamumas."}, {"userName": "Sophia", "userReviewDate": "May 26, 2012", "userURL": "http://www.goodreads.com/user/show/5180153-sophia", "userReview": "Our protagonist is a woman, Geri Molloy, and one of the main themes of the novel is how a woman can make it as a trader in an overwhelmingly male-dominated world. Geri has been abandoned by her lover and is in the throes of heartbreak, trying to perform under pressure and fighting her natural urge to crumble and fall apart. Geri has caught the eye of one of the financial world's biggest fishes. Felix, something of an eccentric recluse who lives in Hong Kong, is attracted (in a purely platonic way) by Geri's natural talent for mathematics and refuses to trade with anyone else at her firm. So when a big deal comes up involving a company he holds controlling interest in, only Geri is in a position to get the information her bosses need to make millions. Her job, naturally, is on the line.I was afraid this novel would be hard to follow for someone like myself who knows nothing about stocks, shares and economics, but it was surprisingly accessible. It took me a little while to get into, but I soon found myself quite engrossed as poor Geri gets pushed from pillar to post by employers, colleagues and her cold-hearted ex. Geri was a sympathetic and well-rounded character, particularly in the second half of the novel once we learn about her background and what makes her tick. Felix is an enigma, but that's his function, and the character of Pie Man, a maths wizard who's employed to design a revolutionary new kind of economics software, was intriguing and just the right amount of creepy. Special mention goes to Rex, Geri's lovable retriever, who added heart to a novel that could easily have become a little clinical. Peripheral characters are more stereotypical, and there are plenty of male chauvanist, hard drinking swaggerers to populate the trading floor.There's an surprising turn of events towards the end of the novel which edges the book into thriller territory. It was an interesting diversion, but I'm not sure it completely worked. However, overall I found On The Floor remarkably absorbing, and I'd definitely read more books by Aifric Campbell."}, {"userName": "Gloria Feit", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/6469333-gloria-feit", "userReview": "This novel, written by an author with substantial background in the securities industry, flits between the hard-nosed life of a floor trader with a unique talent, a female in the midst of macho men, and a lovelorn female, torn between living up to her talent and a yearning for an ex-lover. And she has to choose, by the end of the book, between capitalizing on her abilities and going off in some new direction.Geri Molloy, 28 years old and with little or no training or education, lands a job on the trading floor in the London operation of a U.S. investment bank. She quickly becomes the largest producer and lands an enormous Hong Kong mutual fund manager as her main client. He wishes her to locate to Asia where he can interact with her. Presumably he is fascinated with her personality, and wishes to observe her more closely. Her dilemma is whether to make a new home in Hong Kong, remain in London hoping for reconciliation with her ex, or even use her mathematical talent to go off in a new direction as a quantitative analyst. Such is the plot.There are times when the dialogue reflects the frenzy and excitement of the trading floor. But more often than not, the descriptions appear to be manufactured to fill the space in between the times that Geri gets drunk or feels sorry for herself. Too much of the novel seems formulaic, and it can’t make up its mind what it wants to be when it grows up. But, after all, that’s what Geri is all about as well."}, {"userName": "nomadreader (Carrie D-L)", "userReviewDate": "Jun 07, 2012", "userURL": "http://www.goodreads.com/user/show/6561542-nomadreader-carrie-d-l", "userReview": "Originally published at http://nomadreader.blogspot.com)On the Floor has a fascinating premise: it's set against the Gulf War of 1991 and focuses on a career I know little about: investment banking. I was immediately drawn to Geri as a character. She lives large, plays hard, and works hard. It's clear she can't keep up the pace, but I was looking forward to the journey. While there was much I liked in this novel, the pacing was uneven. Some parts were filled with suspense, while others were dragged down by detail.I particularly enjoyed Geri's observations (and premonitions) regarding the Gulf War. Knowing both the end of that war and the coming second Gulf War, there were some chilling scenes. It's a slippery slope when the reader knows more about the coming events than the characters. In On the Floor, it mostly worked, but at times the premonitions began to feel heavy handed.The verdict: A strong setting, intriguing characters and good writing gave this novel all of the elements of success, but together it never quite came together for me. Ultimately, I appreciated what Campbell was trying to tell with this complicated story and setting, but I think she lost focus in unnecessary details too often to truly succeed.Rating: 3.5 out of 5"}, {"userName": "Chaundra", "userReviewDate": "Jul 18, 2013", "userURL": "http://www.goodreads.com/user/show/123663-chaundra", "userReview": "This is another one for which I wish you could give half stars - two is probably overly harsh and it isn't quite good enough for three.I started this book with rather low expectations, but was intrigued by the concept - a woman in high finance in the 1990s and written by a woman. Something I have some personal experience of, though in the present day. As some of the other reviewers have noted, Ms. Campbell really knows her stuff and gets a lot of the details right. However, there is a lot of sensationalism and the characters never really develop any depth. The writing style is very sparse, which at times works really well and at others grates on my nerves. All in all a not quite satisfying read."}, {"userName": "Holly", "userReviewDate": "Jul 15, 2013", "userURL": "http://www.goodreads.com/user/show/1744565-holly", "userReview": "I wanted to like this book more than I actually did. The premise is intriguing...female in a male dominated world of trading/investments making oodles of money because she has a special gift with numbers and the biggest client of her firm will only do business with her. Even the main characters name, Geri, is evocative of a male/female conundrum. However, what transpires is really a story of a very sad female individual who allows herself to be used and abused in many ways. In fact, it's a whole cast of unpleasant characters. None of the personalities in this book are to be envied, at any cost, and it paints a rather unsavory picture of the trading world."}, {"userName": "Leona Sheehy", "userReviewDate": "Apr 21, 2012", "userURL": "http://www.goodreads.com/user/show/2223307-leona-sheehy", "userReview": "This book was a bit disappointing. I found it hard to get into at the start as it is written in a 'cut and thrust' way, although this is the perfect way to write the action on the floor of a big stockbrokers. The main character herself is not likeable. This probably a good thing as she needs to start to not like herself in order to move on. I felt that the book could have been a bit longer for the denouement to really get under my skin and all in all i felt that it was a bit lackluster and predictable. Sorry."}, {"userName": "Hannah", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/10829960-hannah", "userReview": "I thought this book was quite cleverly written in the way that the author uses the backdrop of the reaction of the world to the first war in Iraq to symbolise the utter destruction happening in the protagonist's life. Geri is a wreck and it's hard to have much sympathy for her, you just want her to pull herself together. None of the characters are that personable, but I think this adds realism to the novel. I liked the ambiguity of the ending and I was glad that it didn't end up being about her starting a life-affirming relationship."}, {"userName": "John", "userReviewDate": "Dec 11, 2013", "userURL": "http://www.goodreads.com/user/show/3271211-john", "userReview": "The rather hackneyed world of London securities trading is covered in this romance / drama novel. Geri is an Irish trader who does some sort of work and has a special relationship with some guy who is important for the bank or trading house or whatever they are. She has broken up with an unprepossessing colleague and becomes involved with a takeover deal for a armanents manufacturer on the eve of the first Gulf war. The bits on the trading floor are almost as dull and tedious as the real thing."}, {"userName": "Sita Narayanan", "userReviewDate": "Apr 12, 2013", "userURL": "http://www.goodreads.com/user/show/3849101-sita-narayanan", "userReview": "The book was a good read, it was easy to follow the plot. It was my first book with a setting in the financial world and kudos to the author for making it easy to follow without bogging us down with financial details. But for a strong character like the heroine who has a past and present to reconcile with, an eccentric client, a prodigious mathematical talent and working in a man eat man world,among men, somewhere the heroine comes out as fragile, as if she cannot work things out. It confirms the female stereotype - not able to move on, emotional, naive."}, {"userName": "Cecily Paterson", "userReviewDate": "Jan 01, 2013", "userURL": "http://www.goodreads.com/user/show/7770727-cecily-paterson", "userReview": "Beautifully written - quite pacey with a slow build. The characterisation was very strong, and backstory worked well. Two things that weren't perfect: the author should have introduced the PieMan character in the first two chapters and foreshadowed the specifics of the ending a little more. But I'll definitely seek out more A Campbell in the future."}, {"userName": "Washington Post", "userReviewDate": "Jul 18, 2013", "userURL": "http://www.goodreads.com/user/show/22033614-washington-post", "userReview": "The first chapter of Aifric Campbell’s debut novel, “On the Floor,” is the literary equivalent of a movie filmed with a hand-held camera. The action is choppy, it’s hard to get your bearings and you’re left with the uncomfortable sensation of having missed something important. But the setup is clear — and, ultimately, hard to resist. Read the review: http://wapo.st/16MklJl"}, {"userName": "Nancy Freund", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/8055545-nancy-freund", "userReview": "If you want a fly-on-the-wall view of London finance, through a woman's POV, this is it. It starts out a tableau of characters (caricatures, maybe) but soon enough, the plot evolves. Leaves you with a protagonist you'll think and wonder about after the novel's final page. How IS Geri Molloy doing today?"}, {"userName": "Huluriasquias", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/6765073-huluriasquias", "userReview": "This is a very peculiar book. It starts we the promise (or at least the anticipation) of the adventures of a woman in the trade floor.The story soon veers into the inner landscape of the protagonist and shows a transition in her life that lasts maybe 5 days but told with lots of hindsight and back stories. It was not what I expected but it kept me entertained anyway."}, {"userName": "Shana", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/1411953-shana", "userReview": "The beginning and the very end (the last few pages, really) were both good, but the middle dragged. And what was with the revelations about her relationship with men in her life... (those forced on her and those she had internalized...). This review is as mixed up as the book made me feel. Not really recommended."}, {"userName": "Joe", "userReviewDate": "Feb 19, 2014", "userURL": "http://www.goodreads.com/user/show/691865-joe", "userReview": "A sort-of plucky heroine suffers some unpleasant betrayals. I liked the Irish woman in England-ness, the details of the trading world, and the crisp writing. The end left me a little cold. It might remind you of Tara French's novels."}, {"userName": "Amanda Blohm", "userReviewDate": "Jul 16, 2013", "userURL": "http://www.goodreads.com/user/show/6866398-amanda-blohm", "userReview": "Total crap. The author waxes what they think is poetic, but is, in fact just annoying and distracting. The plot is an attempt at being clever but falls far short. Not at all impressed and do not recommend."}, {"userName": "Sheera", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/12028438-sheera", "userReview": "The novel starts off well enough at first then deteriorates into cliched emotions and absurd situations. The writing is good, the story is horrible. Given the author's background in capital markets, I was hoping for something much better."}, {"userName": "Nancy", "userReviewDate": "Nov 21, 2014", "userURL": "http://www.goodreads.com/user/show/10162654-nancy", "userReview": "This is a whip smart, highly readable book reeking of authenticity and intelligence.I am mighty jealous of an author who can rise to being the first MD of a London trading floor and then turn her hand to creative writing gaining a PHD from the University of Easr Anglia in the process."}, {"userName": "Allison", "userReviewDate": "Jul 01, 2013", "userURL": "http://www.goodreads.com/user/show/1135725-allison", "userReview": "I found this to be an utterly fascinating and riveting story about a troubled woman working in high-stakes investment banking in London. Light on plot and she makes you mad to save her in her free fall, but I couldn't put it down..."}, {"userName": "Jackie Cain", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/8727766-jackie-cain", "userReview": "I found this book uncomfortable because it evoked a world falling apart, geopolitically, changes in the financial system and personally for Geri. Then I thought that it did evoke that so well that it deserved good stars. Worth a read but glad that I live my life, not hers."}, {"userName": "Debbie", "userReviewDate": "Jun 18, 2013", "userURL": "http://www.goodreads.com/user/show/13867245-debbie", "userReview": "I received this book as a free giveaway. Geri establishes herself as a star on the trading floor only to suffer ultimate betrayal. Through betrayal and after being kidnapped, Geri finally reevaluates her life and starts to move forward after months of drinking herself into oblivion."}], "description": "In the City, everything has a price. What’s yours? At the age of twenty-eight, Dubliner Geri Molloy has put her troubled past behind her to become a major player at Steiner’s investment bank in London, earning $850k a year doing business with a reclusive hedge fund manager in Hong Kong who, in return for his patronage, likes to ask her about Kant and watch while she eats exotic Asian delicacies. For five years Geri has had it all, but in the months leading up to the outbreak of the Gulf War in 1991, her life starts to unravel. Abandoned by her corporate financier boyfriend, in the grip of a debilitating insomnia, and drinking far too much, Geri becomes entangled in a hostile takeover involving her boss, her client and her ex. With her career on the line as a consequence, and no one to turn to, she is close to losing it, in every sense. Taut and fast-paced, ON THE FLOOR is about making money and taking risks; it’s about getting away with it, and what happens when you’re no longer one step ahead; ultimately, though, it’s a reminder to never, ever underestimate the personal cost of success.", "title": "On the Floor", "url": "http://www.goodreads.com/book/show/15983322-on-the-floor", "average": 2.94, "cover": "https://images.gr-assets.com/books/1370171686l/15983322.jpg", "reviews": 46, "authors": [{"url": "https://www.goodreads.com/author/show/1986547.Aifric_Campbell", "name": "Aifric Campbell"}], "type": ["Fiction", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/15983322-on-the-floor", "http://www.goodreads.com/book/show/13161304-on-the-floor", "http://www.goodreads.com/book/show/34312906-bankinink", "http://www.goodreads.com/book/show/19208039-on-the-floor", "http://www.goodreads.com/book/show/5972465-the-semantics-of-murder", "http://www.goodreads.com/book/show/7781463-the-loss-adjustor", "http://www.goodreads.com/book/show/10388146-new-irish-short-stories", "http://www.goodreads.com/book/show/17379770-uea-creative-writing-anthology-2003"]}