{"ratings": 16629, "userreviews": [{"userName": "Julie Christine", "userReviewDate": "Feb 21, 2011", "userURL": "http://www.goodreads.com/user/show/1213607-julie-christine", "userReview": "It is one thing to read a book written by a contemporary author, set in the not-too-distant past; it is another entirely to read one written in and completely of its time. To read Ordinary People is to step through the looking glass into the sweetly familiar terrain of mid-1970s. But beneath the surface details is a book of timeless themes and incomparable elegance. As a fan of the 1980 movie, I could hear the voices of the actors as I read the dialogue: Mary Tyler Moore's controlled high-pitched fury, Donald Sutherland's velvet sorrow, Judd Hirsch's nasal sarcasm. But Judith Guest's brilliant, unaffected writing brings life to the characters in a more personal and profound way. You become a participant, not a passive observer, in the inner lives of a family as it falls apart, slowly, wretchedly, inevitably.I was just eleven years old when Ordinary People appeared in cinematic form in the autumn of 1980, but I remember it as a seminal cultural event of the era, hand-in-hand with Kramer vs. Kramer, released at the end of 1979. It was the year my parents divorced, my oldest brother joined the Marines, the American hostage crisis in Iran dominated the headlines, we waited hours in line at the Cinerama to see The Empire Strikes Back, Reagan took office and John Lennon was murdered - my political and socio-cultural self awakened at the start of a new decade to my formative years and to a world about to enter hyper-speed. I can't imagine Ordinary People is still being read in high school English classes, but more's the pity. The clothing and music have changed, but the universal nature of adolescence - the sense of isolation, the discovery of love and the longing to be accepted coupled with the struggle to assert one's individuality - remains. Anyone who has suffered depression, whether as a teen or as an adult, will walk in step with Conrad Jarrett as he struggles to return from a shadow life to one with dimension and hope. And what a gift to have one's conflict and confusion validated by Guest's honest, aching, clean prose."}, {"userName": "Fabian", "userReviewDate": "Feb 12, 2014", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "Boo.But rather interesting, is it not, how I find myself choosing below-par novels lately which have, somehow, spawned off better-than-average silver screen adaptations*! Here--the underrated work of the artist otherwise known as the screenwriter in its glory.This is bizarrely lame--the subjects become known superficially, their problems are mundane. Not a wise choice, people. But, apparently, vanilla can be swiftly transformed into gold (Oscar-wise).*\"Bridges of Madison County\" and \"Up in the Air\", to mention the first that come to mind."}, {"userName": "Juju", "userReviewDate": "Jul 19, 2007", "userURL": "http://www.goodreads.com/user/show/188653-juju", "userReview": "This book was first recommended to me by my high school English teacher. I had just read Lord of the Flies, and she could tell I needed something to restore my faith in humanity. This book is incredible!It is a real, unflinchingly honest look at life and all of the horrible things that happen. It is also a reminder of the reasons that life is still worth living in spite of those horrible things."}, {"userName": "Anne-Marie", "userReviewDate": "Jan 21, 2010", "userURL": "http://www.goodreads.com/user/show/558379-anne-marie", "userReview": "Books like Ordinary People are why I read.This is the first book I've read on the subject of depression that isn't written as a memoir, from a clinical stand point, or with the intention of \"self-help\". With that said, Ordinary People was the most concise version of depression I've ever seen. Judith Guest has to have had first-hand experience with depression or else she needs to get out of my head. There is so much comfort in seeing your own inexplicable emotions laid out before you page after page.Although Conrad's depression was most likely situational, it was severe:-sleep is no longer just a necessity, it becomes his only refuge-the only safe place is in his bed-using routines as a method to appear and feel normal-constant negative self-talk-believing that everyone hates him as much as he hates himself and using that belief to justify his isolation- seeing a friend (who he met and then grew close to in \"The Bin\") after they were both discharged --> there is an awkwardness in that situation that is unhealthyThe whole dynamic of a cold, distant mother and the overly-concerned father was refreshing.And Berger, if only everyone could have a doctor like him! Some of Berger's wisdom that really stood out for me:\"Depression is not sobbing and crying and giving vent, it is plain and simple reduction of feeling.\"\" . . . crazy world or maybe it's just the view we have of it, looking through a crack in the door, never being able to see the whole room, the whole picture.\"\"I keep telling you that feeling is not selective. You can't feel pain, you aren't gonna feel anything else either.\""}, {"userName": "Norah Una Sumner", "userReviewDate": "Apr 03, 2015", "userURL": "http://www.goodreads.com/user/show/28782884-norah-una-sumner", "userReview": "“Life is not a series of pathetic, meaningles actions. Some of them are so far from pathetic, so far from meaningless as to be beyond reason, maybe beyond forgiveness.”\nThis is a wonderful book about loss,family,forgiveness,depression and life.Judith Guest's writing style was very surprising to me at the beginning because she narrates in present tense(very risky!).But the more you read the more you get attached to Cal and Conrad and the more you want them to make everything work and be happy.I liked them both very much,but I also like Jeannine and Berger.Beth,however,is a mystery to me...I didn't like her but I did hoped that she and Cal would overcome their issues.Apart from that,I am very satisfied with the ending and the fact that Conrad went to see Lazenby in the end.I was hoping through the whole book that they would become friends again(not that they ever stopped being friends,but you know what I mean.)Favourite quotes:“Feelings are scary, and sometimes they’re painful. But if you can’t feel pain then there’s no way you’ll feel anything else either. You’re here and you’re alive, and don’t tell me you don’t feel that.It is good, believe me.”“Depression is not sobbing and crying and giving vent, it is plain and simple reduction of feeling.People who keep stiff upper lips find that it’s damn hard to smile..”"}, {"userName": "Lisa Vegan", "userReviewDate": "Jun 28, 2007", "userURL": "http://www.goodreads.com/user/show/83445-lisa-vegan", "userReview": "Very psychologically astute book about a family and what happens to the parents and younger son after the older son dies in an accident. Good character development and it's well written. I really felt for the surviving son and I really liked his psychiatrist as well. (And this is one of the few times I can say that, even though I read the book first, I enjoyed the movie as well.)"}, {"userName": "SheriC (PM)", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/3899677-sheric-pm", "userReview": "[(Con over surviving when his stronger brother drowned and Cal over somehow failing his son when he attempted suicide). (hide spoiler)]"}, {"userName": "✿Ivy Roots✿", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/48258638-ivy-roots", "userReview": "Title: Ordinary PeopleAuthor: Judith GuestPublisher: Penguin Books\tEdition: PaperbackPages: 263Rating: 5/5Recommended?: YESReview:I was walking in the library, glancing and running my fingers across all the different spines of all the different novels, my ride was waiting for me, and I had no idea which book I wanted to pick up. And there it was, sitting on of the shorter shelves, with its bland cover and bland title.Ordinary People.I didn’t know that it was a novel. I’ve never watched the movie but I knew that it was an Oscar win for best picture a couple of years back. Ordinary People.I know nothing about this story, and never intended to read this book; however, something urged me to check it out, take it home, and read it. My first attempt to read this book was unsuccessful. I had only gotten to about 30 pages through and I decided that I just wasn’t in the right mood to devour this particular story. I wasn’t feeling… well. I felt emotionally shut off from everything. And the fact that there was such an overwhelming, intoxicating atmosphere to this story didn’t help my situation. I put it down for a few weeks. 2017 came around and I picked up the book that someone had recommended me at school, Homegoing by Yaa Gyasi, it was just right as I wasn’t feeling like I was at the bottom of a well anymore. I listened to Malala Yousafzai’s memoir and considered it a good, nice read. (Not as good as her actual story, but good enough).After those two reads, I decided to pick up Ordinary People, hoping that it wouldn’t make me feel as downtrodden as it had initially. I realized then that books don’t change for people. They stay the same, and are always the same. It was almost as if I could feel my soul crush under the emotional weight of this book, as if I could feel my entire body being submerged into the sorrows of each and every character; their sorrows became my sorrows, their happiness, my happiness. I was an ordinary person living an ordinary life reading about ordinary people living their ordinary lives, and the experience was absolutely, enchantingly, extraordinary. It’s rare when I get to say that a certain book was an experience, that I looked forward to the time that I could cuddle up in my bed and read 30 pages a day. Ordinary People is a book that is not afraid of being ‘mediocre’, that decided to look at the lives of one grieving, mourning family, and turn the outcome of their sadness into something completely indescribable. Ordinary People is devoid of clichés and over-worn axioms. This is a novel of complex simplicity and extreme beauty; the story grows on itself, never forgetting the emotions of everyday people in our everyday world, and successfully implementing that concept of unique banality into the all the characters present in the novel. Many people read fantasy and magical-abstract fiction to completely escape the reality, the truth of today. While there is absolutely nothing wrong with that, I always find myself slipping into a reverie of reality, I always find myself craving a fiction of truth. As you can obviously see, I am not that good at writing actual reviews of the books I so deeply love. Instead, I write out my stories, I write out my un-edited, plain, (and just for the heck of it) ordinary thoughts."}, {"userName": "Nathan", "userReviewDate": "Apr 20, 2015", "userURL": "http://www.goodreads.com/user/show/25213052-nathan", "userReview": "Last night, I watched the movie based on Ordinary People and it's one of those situations where it's leaps and bounds above its source material. It highlights all the good parts, while cutting out the bits and that are contrived and silly. Redford deserved his Oscar for best director for pulling a great movie out of an alright book. Was nobody else bothered by the parents in this book? Cal is perfect, the great orphan who pulled himself up from the muck to achieve greatness. He still has depth, despite his cloying bits, and throughout the whole novel, he gets to show his real human thoughts and struggles. Beth does not have anything below the surface in the book. She is only an evil harpy who dares to have a life outside of her family. Don't you know that women are supposed to identify as a wife/mother first, a daughter second and and individual third? (All women in the novel are either awful shrews or the second incarnation of the Virgin Mary.)Mary Tyler Moore, by the sheer virtue of the fact that she can act like nobody's business is able to give humanity to Beth that Guest never did. She is visibly repressing everything, fighting along the way. It's much more moving than the pieces in the novel that get devoted to her. The Conrad part of the book really was great, even though he grew up with a pretty two-dimensional mother. Guest explores ways to keep humanity when dealing with a person with mental illness, and she has some pretty stellar moments along the way. His life is funny and normal and complex, despite the fact that he has problems . Often times in lit, people with depression cease to be really people, and it's refreshing that Guest is able to avoid doing so. The movie also portrayed Conrad incredibly well, and in both it's clear that his life is the central focus. Guest's prose also bothered me a little throughout the whole book. It seems like nothing was really deliberate. Haphazard sentence length with really no flow, and sometimes awkward word choice dominates her important message. It's a shame too, because every now and again she has a moment that is powerful and deeply felt, but it takes some digging to get to it. I loved Calvin's epiphany towards the end where Guest writes: “Life is not a series of pathetic, meaningless actions. Some of them are so far from pathetic, so far from meaningless as to be beyond reason\" but it took a while for something original to come through instead of moments where Guest clearly thinks she is being insightful, but is really just repeating another platitude. So, mixed feelings here. Some great moments, some overwritten and odd ones. Watch the movie instead. It's much more well thought and skips over a good deal of the parts that were poorly done."}, {"userName": "J.G. Keely", "userReviewDate": "Jun 27, 2007", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "This book, for me, represents the pinnacle of a 'literary' book that captures real life so effectively that it is entirely banal. Granted, making something both realistic and interesting is one of the greatest challenges any author faces. Whether through dialogue, plot structure, or motivation, it is always more difficult to write a book that seems at once 'real', but does not fall into the 'truth is stranger than fiction' valley of attempted realism.Modern authors of this vein (i.e. Salinger) become more an act of dadaist 'difference for difference's sake' than any actually sort of conceptual exploration. And as has been noted many times, simply acting differently does not make one a revolutionary. Oft times, it's just a sign of self-centered contrariness."}, {"userName": "Ingrid", "userReviewDate": "Jun 13, 2007", "userURL": "http://www.goodreads.com/user/show/92779-ingrid", "userReview": "I liked this book. I hated the mom."}, {"userName": "Katelyn Beaty", "userReviewDate": "May 16, 2007", "userURL": "http://www.goodreads.com/user/show/86841-katelyn-beaty", "userReview": "Judith Guest's Ordinary People explores a topic so familiar to us that I'm not sure she succeeds at breaking any molds. But due to my ignorance, perhaps she's one of the writers who set the mold in the first place. If this is true, then we have Guest to thank for telling the story of the private grief of three members of one family, all trying to deal with the loss of another member in disparate ways. So disparate is their grief that it drives the members apart from one another, instead of bringing them together when they need each other most.Ordinary People is primarily told from the viewpoint of Conrad, an awkward and reserved teenager trying to cope with the loss of his older brother. Though not many details are given, we gather that Conrad's isolation and guilt is severe enough to land him in rehabilitation to keep from attempting suicide. His father, Cal, a naively easygoing accountant, is terribly concerned about his son and makes earnest attempts to \"reach out,\" though he ends up stifling Conrad more than freeing him. The mother, Beth, is one of those characters you have both compassion and hatred toward. So private and complex is her grief that she copes by taking a limitless number of holidays and vacations, all the while blaming her family for \"changing\" and becoming so \"somber.\"Guest's prose is simple, based internally on the characters' private emotions, and captures well the ethos of upper middle class suburbia, which tends to create a climate where grief is failure, and there's nothing a few rounds of golf at the country club won't alleviate. While the themes are a bit cliched, we also need these stories, to remind us of the depths of human fragility, brokenness, and deep longing for connection."}, {"userName": "Rebecca McNutt", "userReviewDate": "Nov 28, 2015", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Conrad is grief-struck after his brother is killed in a boating accident, and tries to commit suicide. After finally getting out of the hospital where he was subjected to shock therapy and drugs, he wants to talk about his brother, but while his father agrees that he still needs to talk about Buck, his mother won't hear of it, and would rather pretend that everything is normal than speak to her son about his grief.This book is really great, even better than the 1980 film. It was sad though, the ending was certainly unexpected."}, {"userName": "Riva Sciuto", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/2660322-riva-sciuto", "userReview": "\"So truth is in a certain feeling of permanence that presses around the moment. They are ordinary people, after all.\" ***This is one of those books that finds its way right into the center of your heart and remains there forever. Judith Guest's 'Ordinary People' is a story about a family ravaged by tragedy, irrevocably altered after a devastating and incomprehensible loss. Guest's portrayal of grief -- of its enormity and permanence and finality -- is one of the most real and powerful I've encountered in fiction. \"So, how does a Christian deal with grief? There is no dealing; he knows that much. There is simply the stubborn, mindless hanging on until it is over. Until you are through it. But something has happened in the process. The old definitions, the neat, knowing pigeonholes have disappeared. Or else they no longer apply,\" Guest writes. \"Today is Jordan's birthday. Today he would have been nineteen.\" While this novel is simple in its construction -- told via alternating perspectives between father and son -- its power is extraordinary. \"We are a family, aren't we? And a family turns inward toward itself in grief, it does not go in separate directions, pulling itself apart. Like hell it doesn't. Grief is ugly. It is isolating. It is not something to be shared with others, it is something to be afraid of, to get rid of, and fast.\" As the plot unfolds, the reader becomes part of this family. Part of its grief, depression, anxiety, resentment, discord, and fear. We feel the depth of their pain as this family of four becomes a family of three. We feel Conrad's guilt over the tragic loss of his brother; we are given insight into how a tragedy of this magnitude can destroy a marriage; and we feel the family's palpable longing to return to the past, to the time when Jordan was alive and Conrad was happy and Calvin and Beth's marriage was simpler. And we see, all too clearly, how everyone’s response to tragedy is different. Where this book succeeds marvelously is in its very real depiction of grief and the pain of feeling the many emotions that accompany it. The author personifies grief beautifully, with images of the \"murderous, lead-colored moon. The sky, wispy with cloud-strings. The black water all around them, indistinguishable from the black sky.\" As Conrad reflects on the day he lost his brother, he says, \"That was punishment...being forced to submit over and over to a hopeless rerun of that day to what could have been done to make the sum of it different. Nothing. That is the nature of hell, that it cannot be changed; that it is unalterable and forever.\" (My heart!)Perhaps most beautiful, albeit painful, is the reminder that we must feel things even if they hurt us deeply. After all, if we suppress our ability to feel pain, we also prevent ourselves from feeling joy. Conrad's psychiatrist, Dr. Berger tells him, \"'Maybe you gotta feel lousy sometime, in order to feel better. A little advice, kiddo, about feeling. Don't think too much about it. And don't expect it always to tickle.'\" Later, he advises, \"'Listen, what happened this morning was that you let yourself feel some pain. Feeling is not selective, I keep telling you that. You can't feel pain, you aren't gonna feel anything else, either. And the world is full of pain. Also joy. Evil. Goodness. Horror and love. You name it, it's there. Sealing yourself off is just going through the motions, get it?'\" This book reminds us all that a full life is fraught with imperfection, tragedy, pain, and suffering. But if we allow ourselves to feel the pain, we open up room in our hearts for joy and for love. My only criticism of this book (if you can even call it that) is that I wish it had been longer and more detailed, particularly with Beth's character. And I wanted to know more about Jordan and his life before the accident. But its brevity and stylistic simplicity did not detract from its gravitas. It is a beautiful and deeply emotional story that gets right to the heart of what it means to be human. 4.5 stars + a burning desire to see the movie. Immediately."}, {"userName": "Aj Sterkel", "userReviewDate": "Mar 14, 2016", "userURL": "http://www.goodreads.com/user/show/5790437-aj-sterkel", "userReview": "This is one of those quiet books that doesn’t seem like much on the surface, but there is a lot going on underneath. It’s one of those books that require some thinking to really get it.Ordinary People alternates points-of-view between a father and a son. The father, Cal, is a successful attorney who is attempting to hold his disintegrating family together. Cal’s son, eighteen-year-old Conrad, has been dealing with depression since his brother drowned in a boating accident. Conrad’s suicide attempt and his father’s efforts to understand it put even more strain on the family. This book is a modern classic that was first published in 1976.I can see why this book is a classic and why people love it. It has one of the most relatable portrayals of depression and perfectionism that I’ve ever come across. It was frighteningly easy to see my teenage self in Conrad. A lot of his thoughts were my thoughts when I was eighteen.“Depression is not sobbing and crying and giving vent, it is plain and simple reduction of feeling.”“Because it has always been easier to believe himself capable of evil than to accept evil in others.” I’m very happy with the way that the author handled Conrad’s character. He’s depressed, but there’s more to him than just his depression. He has a wonderful sense of humor. He cares about people. He sets goals for himself and works hard to achieve them. He actually feels like a real person and not just a stereotype of a depressed teen. I also appreciate that his father takes an interest in his life and makes an effort to understand him.Conrad is an interesting character, but I wish I could say that about the other characters in the book. This is a short novel with a lot of minor characters. There were a few times when I struggled to remember who was who. I wanted many of the characters, especially Conrad’s mother, to be more complex. Sometimes his mother comes across as an uncaring witch, and I don’t think her character is that simple.The writing style also caused a few issues for me. The book is written stream-of-consciousness style. Some sections have very little punctuation. This isn’t my favorite writing style because it slows down my reading. Also, since the reader is so deep inside the characters’ minds, the style becomes a bit maudlin at times. There are a few places where I remember thinking, Okay, you’re upset. You’re suffering. You’re in pain. I get it. Talk about something else now. Despite those issues, I really liked Ordinary People. I know that I will reread it in the future. I have a feeling that it’s one of those books that get better with rereading. There are probably a lot of subtle things that I missed on the first read. And, I need to track down a copy of the movie. Everyone has been telling me that it’s amazing."}, {"userName": "Emily", "userReviewDate": "Jul 14, 2009", "userURL": "http://www.goodreads.com/user/show/1424337-emily", "userReview": "The first time that I read this, it was from a torn, ratty looking paperback book that I bought at a cheap book fair,it was missing a page here and there (including the last page),and I didn't really like it. I thought that Conrad needed to man up and get over wallowing in his sadness, I thought that the mom was one of the cruelest characters in any novel I had ever read, and I got a little too touchy about some of the language Judith Guest used in the novel. I realize that this sounds a little insensitive, but that's what made reading it a second time a really great experience,I grew up. I had come to understood that Conrad was truly struggling, and I had learned that death isn't something you just bounce back from, it takes time,and the second time I was old enough to understand Conrad a little better. My dislike for the mom didn't change. It's true that I'm not a mother, and I have never experienced a child dying, but her total lack of affection towards Conrad really, REALLY angered me. Even in such a situation, I can't understand how she can treat her son as she does... and I probably never will. The whole \"language\" issue, is still something I struggle with (I think a lot of it is SO unnecessary) but I've come to realize that if I put down every novel that drops a couple of swears, I would be limiting myself and I would also probably be missing out on some really good literature. So basically the second time, because I could understand the issues and deal with the language,I liked Ordinary People...I liked it a lot. By the way... Berger was always awesome... both of the times that I read it."}, {"userName": "Abigail", "userReviewDate": "Sep 20, 2008", "userURL": "http://www.goodreads.com/user/show/1546957-abigail", "userReview": "For the first couple chapters of this book, I was rather confused and repelled by Guest's writing style. The EXTREME stream of consciousness is rather intrusive to first-time readers. Conrad and Calvin's struggles, though revealed at painstakingly slow rates, made me have to read more and more and more. When the true conflict is actually revealed, there was a new appreciation for the writing style. All I wanted was to get MORE into the characters' heads! By the end of the book, I not only felt kindred to Con and Cal, I felt connected to them. The ending, though somewhat wanting, left me wanting to read it again just so I could revisit the characters.I do warn prospective readers of questionable content though, language and specific scenes create a very dark tone. One must keep in mind the horrible, horrible struggles the characters are going through."}, {"userName": "Jacquelyn", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/7822663-jacquelyn", "userReview": "I read this book for my summer reading and although it was enjoyable, it just took me SO long to read it. Once I put it down, it took a lot out of me to pick it up and read more. That's not really saying it was bad... because it wasn't. Once I did pick it up and was reading it, I enjoyed it and it went a whole lot quicker. However, thinking back on it, there's really no plot. It's mainly just character growth and development. It didn't have too much going on yet it was still 260 pages. I feel as if this could have been maybe half of that length and it would have been a lot better. This didn't blow me away but it was an interesting read that kept me intrigued to see where our characters landed up."}, {"userName": "Julie", "userReviewDate": "Apr 06, 2007", "userURL": "http://www.goodreads.com/user/show/51555-julie", "userReview": "I read this book my senior year in high school. I picked it up off of my dad's bookshelf. I have since reread it and it remains one of my favorites. The family and friendship dynamics are good and the themes are universal. There is an honesty about all things (including depression and relationships) that the main character has that is striking. It could be a fairly quick read, but I still feel that it has a lasting impact.The movie, to me, is not as good as the book. I almost always think that though. . ."}, {"userName": "Jaymie", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/67053919-jaymie", "userReview": "I read Ordinary People in high school. I remember watching the film adaptation when I was quite young and although it's heartbreaking, I was always fascinated by the story--I found an old dusty copy of the book in my grandparents basement (yes, it STILL has that glorious old book smell, even though it's been years since I saved it). The story focuses on a middle aged family dealing with the accidental death of their eldest son. The father, a good-natured man is the glue that's trying to keep the rest of his family together. The mother, harsh at times, plays into the guilt their younger son conveys. Although the family attempts to continue with everyday life, they find that through broken communication and emotions, it's really difficult. What I really enjoy about this book is the character development and dynamics. As the title suggests, the characters are ordinary, every day people. However, even the ordinary are still complex beings and this book is a great example of it."}, {"userName": "Anna (Curiosity comes before Kay)", "userReviewDate": "Jan 20, 2011", "userURL": "http://www.goodreads.com/user/show/4846819-anna-curiosity-comes-before-kay", "userReview": "Review also posted @Diamond&Coal Book ReviewsA lot of people are depressed by this book. I am not one of them and every time I ﻿re-read it (so far about six times!) it uplifts me and reminds me that nothing is ever quite so bad as I think it may be. This book is about the Jarret family, Mom and Dad with their two sons. When we meet them they only have one son left, Conrad, the younger son who has recently been released from a sanitarium after attempting suicide. The book is mostly from Conrad's point of view, with some glimpses into his Father, Calvin's head. The entire family is dealing with the loss of Con's brother Buck, but instead of bringing them together it's tearing them apart. His Mother, Beth, is using every excuse to escape the situation with constant vacations and denial that anything is wrong. One scene in particular at a friend's party, where Cal is slightly drunk and discusses Con's therapy, really makes her angry. You don't share personal business with anyone but family, and even then you NEVER talk about it - that's her life motto. Without perfection in her life anymore, Beth has no clue who to blame. She becomes withdrawn and harsh when Cal tries to show any interest in Conrad, who is trying to piece his life back together in a way that makes him happy. Which isn't necessarily the way his Mom wants things. Maybe Cal isn't as happy as he always thought either. When he begins looking past the face value of the things in his life, the situation finally combusts.I loved this book. It's an honest and hard look at the consequences of real-life tragedies and how they change people forever. The family dynamic is extremely interesting, with Cal being the slightly hovering, interested parent and Beth seeming like she wishes Conrad would just disappear. Conrad himself is messed up and after living his whole life in a house that kept repression and perfection as rulers (*cough* *Beth* *cough*) this is really the first time he has ever dealt with his emotions in an honest way. As he works through the guilt, sadness and anger of Buck's death, as well as his twisted relationship with his Mom, we see him grow as a person and learn to let himself be happy. Cal's transformation from clueless, middle-aged lawyer with the perfect wife and good son also is something to see. He really starts to take off the rose colored glasses and feel what's going on in his life. Dr. Berger, the not-so-crazy therapist that Con (and, later on, Cal) go to see is what makes the book in my opinion. His obvious contentment with life and it's ups/downs is the opposite of Cal and Con but it balances them out. The ending of this book, reconnecting with the old while moving on with the new is beautiful. One of my favorite books that I've read since becoming an adult. Super glad that when I was nineteen the cover and synopsis intrigued me. Overall and extremely well written novel, a character piece that is in the style of The Virgin Suicides or White Oleander. It is something special that only comes around every so often. I highly encourage anyone who hasn't read it to give it a shot! You won't regret it! :)VERDICT: 5/5 Stars**No money or favors were exchanged for this review. This book is now available in stores, online, or maybe even at your local library.**"}, {"userName": "Kitty Jay", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/21566627-kitty-jay", "userReview": "A deeply moving, thoughtful book, Ordinary People takes a brutally close look at the dynamics of a family coping with the loss of a child. Conrad, the surviving child, struggles with his own guilt and pain by attempting suicide and has just been released from a mental hospital. Calvin, the father, feels as if he has let down both his sons and suddenly feels uncertain, reeling from the fact that he could not protect his own family. Finally, there is Beth, the mother, who comes across as cold and aloof to even her own family, and struggles with finding out that not everything in the world can be perfect and controlled. Richly drawn, each of the characters feels real and three-dimensional. Conrad is by turns a normal, sarcastic teenager, a kid wracked with guilt over his brother's death, and a little boy who doesn't know where to go from here. His grief can be heartbreaking to read, but his desperate attempts to hide it are even more so. The true stand-out, however, is the mother. Beth is a mystery. While Guest often allows us into Cal's and Conrad's minds, we never see Beth's thoughts, only the perceptions filtered through others' eyes. Much of what she does is up to interpretation: is she truly cold and emotionally unavailable? Or is she simply coping with her loss by trying to ignore it? If you have ever seen the equally astounding film directed by Robert Redford and starring Timothy Hutton, then you'll find that the screenplay was remarkably faithful to the book; however, I would argue that the book has slightly more nuances with regard to Beth's character.I am not normally a fan of dramas, but this is one of the most engrossing, oftentimes painful, books I have ever read."}, {"userName": "Jamie Fessenden", "userReviewDate": "May 24, 2011", "userURL": "http://www.goodreads.com/user/show/4692982-jamie-fessenden", "userReview": "My first experience with present tense narrative, which took some adjusting to, this book had a tremendous impact on me, inspiring me to write the first (somewhat derivative) short story I ever entered into a competition. This is a powerful story with very memorable characters. UPDATE: I reread this novel, after not having read it since I was a teenager. It holds up well over time. But I noticed that the novel is told entirely from the viewpoints of Conrad and Calvin (his father). We never fully understand what motivates Beth or whether she really does care about her family. She remains as much an enigma to the reader as she does to Calvin. While this was no doubt intentional, I watched the film after reading the novel and I was incredibly impressed by the additional depth Mary Tyler Moore added to the character through facial expressions and the tone of her voice. Additionally, the writers who adapted the novel (Alvin Sargent and Nancy Dowd) did an amazing job of adding scenes between Beth and Conrad that I was surprised to discover weren't even in the novel, particularly because they were some of my favorite scenes. So while I would certainly not discourage anyone from reading this excellent novel, in this rare instance, I would say that the film adds something to the story and I would recommend watching it after reading the novel."}, {"userName": "Sofia Generali", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/13207034-sofia-generali", "userReview": "3.5/5 stars\"The thing that hurts you is sitting on yourself. Not letting yourself connect with your own feelings. It is screwing you up, leading you off on chases that don't go anywhere\"Although I was feeling iffy about this book at the beginning, it definitely grew on me as it went on. I could really feel for Con throughout the novel, as we struggles to find his place back in society after getting out of the hospital. The book alternated between Con's and Cal's perspective-- two different perspectives on life after tradgedy and difficulty. Although both of them share a home, their lives outside of it are very different, and both of them have their own challenges. I can't help but admit that I strongly disliked Beth at many moments within this novel. It was hard to connect with her when I felt so infuriated with the way she was (more like wasn't?) parenting. However, a he never does get her own pov, so it's hard to judge her actions without knowing her thoughts and feelings. The last quarter of the book was probably my favorite, because so many questions/conflicts were finally answered (well, somewhat). Even though this was a school book, I still found it to be an interesting read!"}, {"userName": "Raluca", "userReviewDate": "Jan 05, 2015", "userURL": "http://www.goodreads.com/user/show/8988257-raluca", "userReview": "I thought this book was going to bring back that anxious feeling just below my sternum that I hate, but it had just the opposite effect. It calmed me down and taught me a few things: how I should be more open, how I should just try and accept people for how they are and not try to make them into how I want them to be but probably most importantly that you can still be lost in this world and hang in there because you're not alone; when something happens we internalize and live with the pain but there are others who either share the pain or have similar experiences and it helps a little to look out for each other, be it friends or family. And just because you're considered a grown-up doesn't mean you know what you're doing so don't take you elders for granted cause sometimes they're just as lost inside as you are and they need taking cared after."}, {"userName": "Steph", "userReviewDate": "Apr 30, 2012", "userURL": "http://www.goodreads.com/user/show/5428996-steph", "userReview": "...it is love, perfect and unordered, that keeps them apart, even as it holds them somehow together.\nThe theme of personal isolation within small families is one of my greatest weaknesses. How can they live their lives together, but still be so lonely?\nWell, what do you expect? We are a family, aren't we? And a family turns inward toward itself in grief, it does not go in separate directions, pulling itself apart. Like hell it doesn't. Grief is ugly. It is isolating. It is not something to be shared with others, it is something to be afraid of, to get rid of, and fast.\nOh, my heart."}, {"userName": "Phil Williams", "userReviewDate": "Dec 06, 2013", "userURL": "http://www.goodreads.com/user/show/1356696-phil-williams", "userReview": "This was one of my favorite movies when I was a kid (yes, I have always been in love with sadness) and I don't know why it took me so long to read the book. I am glad I finally have though because not only is it a beautiful story about a family who can not forgive itself, but wonderfully written as well. Judith Guest has a way of choosing just the right sentiments to allow the words to flow like oil over the pages and make you hope the son Conrad might finally be happy. Wonderful book. Great way to lift you spirits by watching those who are so terribly, beautifully unhappy."}, {"userName": "Chance Lee", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/2355889-chance-lee", "userReview": "I read this book last month (last year!) and forgot to review it. Ordinary People is the quintessential book of suburban angst. It might as well be re-released and re-titled #firstworldproblems because it's trying to decide where to go on Christmas vacation, playing tennis in the cold, and coming in third in a golf tournament.Okay, that's oversimplifying it. I think the book tackles depression very well and is still relevant today, 40 years after its initial publication."}, {"userName": "Stephanie A. Higa", "userReviewDate": "Dec 20, 2007", "userURL": "http://www.goodreads.com/user/show/686879-stephanie-a-higa", "userReview": "This book is told entirely in present tense, which is a dangerous choice unless you're a very good writer. Fortunately, Judith Guest is a very good writer. She gets right into Calvin and Conrad Jarrett's troubled minds (the wife/mother, Beth, remains elusive). It's also an easy, light read. Unfortunately, the story itself is just too depressing, and there were many aspects of the Jarretts' lives that piqued my curiosity but were never developed beyond a few spare references here and there."}, {"userName": "Sophie Carter", "userReviewDate": "Mar 19, 2016", "userURL": "http://www.goodreads.com/user/show/4797492-sophie-carter", "userReview": "Accurate book about being a perfectionist kid. The fact that it's written in present tense threw me off a little, but once I got into it I immediately started marking up the text with quotes I liked. The characters were well developed and the book is relatable and timeless."}], "description": "An extraordinary novel about an \"ordinary\" family divided by pain, yet bound by their struggle to heal.In Ordinary People, Judith Guest’s remarkable first novel, the Jarrets are a typical American family. Calvin is a determined, successful provider and Beth an organized, efficient wife. They had two sons, Conrad and Buck, but now they have one. In this memorable, moving novel, Judith Guest takes the reader into their lives to share their misunderstandings, pain...and ultimate healing.", "title": "Ordinary People", "url": "http://www.goodreads.com/book/show/160251.Ordinary_People", "average": 3.9, "cover": "https://images.gr-assets.com/books/1348308380l/160251.jpg", "reviews": 861, "authors": [{"url": "https://www.goodreads.com/author/show/30830.Judith_Guest", "name": "Judith Guest"}], "type": ["Fiction", "Classics", "Psychology", "Contemporary", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/160251.Ordinary_People", "http://www.goodreads.com/book/show/415301.Ordinary_People", "http://www.goodreads.com/book/show/2238951.Ordinary_People", "http://www.goodreads.com/book/show/2049746.Ordinary_People", "http://www.goodreads.com/book/show/6584914-ordinary-people", "http://www.goodreads.com/book/show/1332303.Errands", "http://www.goodreads.com/book/show/599068.The_Tarnished_Eye", "http://www.goodreads.com/book/show/54654.Second_Heaven", "http://www.goodreads.com/book/show/2682630-killing-time-in-st-cloud", "http://www.goodreads.com/book/show/2526810.The_Mythic_Family"]}