{"ratings": 180, "userreviews": [{"userName": "Luís C.", "userReviewDate": "Aug 20, 2014", "userURL": "http://www.goodreads.com/user/show/34132356-lu-s-c", "userReview": "But Tatiana was not one of such that bends with shots. His eyes, which before a glass of champagne throwing lights a spotless purity, became soon a discussion began between them, gloomy well."}, {"userName": "Nuno Martins", "userReviewDate": "Aug 13, 2011", "userURL": "http://www.goodreads.com/user/show/2730540-nuno-martins", "userReview": "Miguel Torga com este livro traz-nos uma espécie de Fernão Mendes Pinto do início do séc. XX, uma estória de aventura e amor, e que mostra bem a \"alma\" e o \"fado\" dos portugueses."}, {"userName": "Patricia Posse", "userReviewDate": "Nov 08, 2016", "userURL": "http://www.goodreads.com/user/show/22406186-patricia-posse", "userReview": "Uma história de vida, onde se sublinha a dureza do carácter, a vontade de alargar horizontes, a capacidade de (des)acreditar no amor, o apego às raízes."}, {"userName": "Elisabete", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/5148282-elisabete", "userReview": "«Escrito em 1943, O Senhor Ventura apresenta-nos a figura de um português errante por terras do Oriente, uma figura com uma longa tradição na literatura portuguesa, desde Os Lusíadas ou a Peregrinação de Fernão Mendes Pinto até O Mandarim de Eça. O Senhor Ventura, personagem que parece extraída do melhor romance picaresco, sai do seu Alentejo natal para se lançar a uma vida de aventuras pela China, que o levará ao desempenho das mais diversas atividades, nem sempre legais. A viagem serve-lhe também como descobrimento da amizade e do amor que o protagonista vive de forma atormentada. A figura do senhor Ventura personifica o triunfo da vontade, mas também propicia uma reflexão sobre uma certa ideia de Portugal. Nesta personagem, Miguel Torga reivindica a recuperação do espírito intrépido e aventureiro dos portugueses da época dos Descobrimentos. Em palavras do autor: \"Não me resigno à ideia de ter vindo à luz neste tempo e numa terra durante séculos inquieta de descobrir e saber, e depois tragicamente adormecida para tudo o que não seja olhar-se e resignar-se... Encho-me da lembrança mágica do Senhor Ventura, que nenhuma razão impediu de correr as sete partidas que esperam em vão por nós.\"»"}, {"userName": "Erwin Maack", "userReviewDate": "Feb 18, 2013", "userURL": "http://www.goodreads.com/user/show/2477265-erwin-maack", "userReview": "\"Agora era na verdade aquilo que a natureza sempre lhes pedira: dois. A linha fina mas resistente, que os unira através de todos os desentendimentos, acabara finalmente de se partir. Tensa como era até ali, mal se quebrou, as duas metades retraíram-se de tal modo que nada as poderia nunca mais juntar. Livres! (pág. 157)"}, {"userName": "Luís Bandeira", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/51350938-lu-s-bandeira", "userReview": "Existe outro exemplar em gd23."}, {"userName": "Mady", "userReviewDate": "Nov 13, 2010", "userURL": "http://www.goodreads.com/user/show/1154662-mady", "userReview": "The life of a man who couldn't help being adventurous."}], "description": "", "title": "O Senhor Ventura", "url": "https://www.goodreads.com/book/show/25867784-o-senhor-ventura", "average": 3.44, "cover": "https://images.gr-assets.com/books/1436296224l/25867784.jpg", "reviews": 9, "authors": [{"url": "https://www.goodreads.com/author/show/417737.Miguel_Torga", "name": "Miguel Torga"}], "type": ["European Literature", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/25867784-o-senhor-ventura", "http://www.goodreads.com/book/show/6377369-o-senhor-ventura", "http://www.goodreads.com/book/show/3671722-bichos", "http://www.goodreads.com/book/show/2706386-contos-da-montanha", "http://www.goodreads.com/book/show/6135003-novos-contos-da-montanha", "http://www.goodreads.com/book/show/2575740-antologia-po-tica", "http://www.goodreads.com/book/show/13432082-a-cria-o-do-mundo"]}