{"ratings": 2061, "userreviews": [{"userName": "Roz Nay", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/17062813-roz-nay", "userReview": "Obviously I'm rating it 5/5. I wrote it."}, {"userName": "Deanna ", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/15662887-deanna", "userReview": "My reviews can also be seen at: https://deesradreadsandreviews.wordpr...4.5 Stars!!!!!\n“They say you never forget your first love. What they don't say though, is that sometimes your first love won't forget you”\nSometimes the biggest lies are the ones we tell ourselves. Angela Petitjean says she has done nothing wrong. She doesn’t understand why she’s being questioned by police in regards to a missing woman. She tells the police again that she’s done nothing wrong and until she knows what’s going on she’s not going to speak with them.But then a different Detective comes in. His name is Detective Novak. He tells Angela that they really need her help. For some reason, she feels like she can talk to him. Angela will talk to him but it is going to be on HER terms. She is going to start at the very beginning. Angela is actually desperate to tell her story. She believes that if Detective Novak listens to everything ….then it will give him the answers he is looking for.She talks about when she first met HP. It was in Grade 10 and she had just started at Lakeside High. HP was the guy everyone wanted to be friends with. As the new girl, Angela got picked on quite a bit. But one day HP stepped in and rescued her. After that, no one picked on Angela anymore. And soon Angela and HP they were inseparable. They had no secrets…. they told each other everything.\n“I know what real happiness looks like. I lived it with HP that summer, and the memories are burned into my mind.”\nAs she tells her story, Detective Novak keeps interrupting. He wants to know how she feels about Mr. Parker (HP) now. How close they are.....if she’s still in love with him. Angela starts to feel like Detective Novak is missing the point.\n“If he spent more time actually listening, he’d be able to see the truth. Everything would become clear”\nDoes Angela know where the missing woman is? Is she protecting herself or someone else?What is Angela hiding?This was a really quick read at only 272 pages. I was still really intrigued by Angela’s story and anxious to find out what happened. The author kept me guessing and although I’m not entirely sure how I felt about the ending, I’m still really glad I read this novel.Roz Nay has written an absorbing psychological suspense novel about first love, secrets, obsession, and revenge. This was a very good dark and twisted debut novel. I am really looking forward to seeing what this author comes up with next.\n \nI'd like to thank St. Martin’s Press for giving me the opportunity to read this book in exchange for my honest review."}, {"userName": "Meredith", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/30978160-meredith", "userReview": "3.25 starsHighly entertaining and compulsively readable, Our Little Secret is a psychological thriller about first love and obsession. \nThe story opens with 26-year-old Angela being questioned by the police over her role in the disappearance of the disappearance of Saskia, the wife of her best friend and former lover, HP. Angela denies any involvement, but her case is soon turned over to Detective Novak.Angela shares her version of events with Detective Novak, going back in time to when she was 15 years old and had just moved from Boston a tiny town in Vermont. At the time, she felt like an outsider until taken under the wing of fellow student and swim team captain, HP. She finds solace in his friendship, and eventually, their friendship transforms into love. However, young love can only last so long. Angela slowly reveals the story of their demise, coyly playing a cat and mouse game with Detective Novak. Did she play a role in Saskia’s disappearance? Is HP not the innocent man that Angela paints him to be? Our Little Secret is a fast-paced, quick easy read that I couldn’t put down. However, the lure of Angela’s voice began to wane about halfway through. I love a masterful, manipulative narrator, but something was missing for me. I got sick of all of Angela's telling and wanted more showing--I think that would have taken things to the next level for me. I would still recommend Our Little Secret if you are looking for a quick, entertaining psychological thriller. I will definitely be reading more by Roz Nay in the future!Many thanks to Ariana from St. Martins Press for sending me an ARC of  Our Little Secret!"}, {"userName": "Liz", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/4125660-liz", "userReview": "2.5 stars, rounded upThis book starts off very strangely. Angela is being interrogated by the police about a missing woman. But instead of answering the detective’s questions, she launches into a story about her days in high school with her best friend, HP. The story of her life goes on with the detective only occasionally asking her questions about Saskia, the missing woman and the HP’s wife. I’m sorry, am I really supposed to believe this? I never found I could connect with Angela. It’s not that she’s an unreliable narrator, she just felt flat. The book takes a long time for it to gear up and pick up the pace. But once it does, I couldn’t believe the ending. I see I’ve questioned the believability of this story twice now. Guess that pretty much sums it up. My thanks to netgalley and St. Martin’s Press for an advance copy of this novel."}, {"userName": "Melisa - Traveling Sister", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/42481357-melisa---traveling-sister", "userReview": "A captivating and addictive mystery with a coming of age story at its heart. I absolutely loved the structure of the narrative in this one - we have Angela who is being questioned by the police, and the story unfolds as she reveals her history to the detective. I thought this was super creative and really kept the pace moving for me. There are some characters here who are a hot, hot mess which are sometimes my favorite to read about! - - What makes these people tick? Why are they the way they are? Nay has done a great job in a short amount of pages to develop these characters and to make us feel like we know them. And what a doozy of a conclusion - great up until the last sentence!Speaking of a short amount of pages, coming in at 228 p., I loved the length of this book, I feel like it really helped move things along and keeps the reader engaged. Thank you to Roz Nay and Simon & Schuster for providing me with a copy of this book in exchange for an honest review."}, {"userName": "Jennifer ~ TarHeelReader & Traveling Sister", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/32340179-jennifer-tarheelreader-traveling-sister", "userReview": "4 bewitching stars to Our Little Secret! 🌟 🌟 🌟 🌟 Our Little Secret drew me into its pages from the start. Angela is interrogated by the police because her ex’s wife is missing. She hasn’t seen this ex for years, so why is she being dragged into this? Is Angela telling the truth to Detective Novak, or is she yet another unreliable, manipulative narrator? Our Little Secret is a slim novel and quite the page-turner. Once I started reading it, I lost some sleep in order to finish it! I found Angela’s character enthralling. She’s a tough nut to crack, and I tried my best to analyze her and her hidden motives. Bottom line, Our Little Secret is a fresh thriller from a new voice in the genre, one that kept me captivated and doubting myself throughout. I’ll definitely be looking for this author’s next book! Thank you to Roz Nay, St. Martin’s Press, and Netgalley for the ARC. Our Little Secret is available now!"}, {"userName": "Diane S ☔", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "Okay I may have been a little hasty or maybe just plain wrong when I said I was swearing off thrillers because they were all blendng together. Really meant to stick to it but then the publisher sent me this book and if they send them I shall read and review, seems only fair. Then this book proved me wrong, and it has been quite a while since I have read a book I didn't want to put down. Part of itt was the format of the book, big enough print, nice paragraphs, just a wonderfully design for an optimal reading experience. But......that doesn't mean much if the book is not good.This one was, pulled me right in, kept me reading, nice steady pace and an interesting way that the story is told. A young woman is brought into the police station for questioning in the disappearance of a young wife and mother. The young woman insists on telling the story her own way, from the beginning, but from the beginning claiming she did not have anything to do with what happened. So the story starts out rather inucoulsly, but the suspense build from there. It also partly takes place in Oxford, which I enjoyed, a different venue from my usual school type reads. I enjoyed this for what is wasn't as much as for what it was. I like that it kept me off balanced, one I use sure I knew and the next not sure of anything. It was just different enough from the overstuffed psychological thriller that I have recently read. A rather simple story but with some depth and told well.ARC from St. Martin's Press."}, {"userName": "James", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "Why This Book\n\nI was either approached by the publisher or received the book, Our Little Secret written by Roz Nay in 2018, through NetGalley. I liked the premise of the story and saw it was getting positive reviews, so I took it on. It was published this week, which meant I needed to read and review it to share my feedback with others. I would give the book 3.5 stars and encourage fans of thrillers and questionable narrators to give it a chance.\n\nApproach & Style\n\nI read the Kindle Reader version on my iPad in about 3 hours over a few days. It has ~30 chapters split across ~225 pages or ~3k lines. It is told in 1st person POV with the perspective on Angela or LJ or Little John (she has many names) where she conveys what she knows about the disappearance of an Australian woman named Saskia.\n\nPlot, Characters & Setting\n\nThe book takes place in a small New England American town over a 24-hour period where the main character, Angela tells a story to Detective Novak after being brought in for questioning. We have no idea who Saskia, the missing woman, is or what her connection is to Angela. It's obvious Angela has either got information she's hiding (protecting someone?) or has killed Saskia. Novak wants answers and holds her without arrest for maximum time. We learn of Angela's relationship as teenager with HP whom she fell in love with. She traces the last decade of how they dated, fell apart, how she dated Freddy, etc. Then we learn how Saskia fits in. We see what happened between everyone. And in the end, we discover what likely happened to Saskia. Add in Angela's parents, a few other friends, and a couple of trips to Australia and Europe, the plot thickens. The book ends with readers knowing how it happened, but the cop is still uncertain, yet he makes an arrest.\n\nKey Thoughts\n\nThere are many parts of this book which I enjoyed reading. The story draws you in. The plot builds in all the right places creating suspenseful moments where as a reader you think you've got the answers. Then it changes and you're back to the drawing board. Nay's writing style is very strong and clean. It makes you feel part of the action and tension. You want to keep turning the pages to know what's going on.At the same time, I struggled a little with character attraction. Each character had a voice, personality, and physical descriptions, but I couldn't quite find myself supporting Angela or even HP. I liked their romance, wanted them to get together... as kids, they were adorable. As a witness, Angela was evasive in a very good way in the beginning. As the story unfolded, I felt a little less connected to her and couldn't quite get behind the decisions being made.When the book ends, you're left with a few \"hmmm... not sure I understand that\" moments and sorta think \"eh, okay, well, I guess it was obvious in the beginning.\" I think with a little more suspense and depth to have a bigger climax scene, this would have been a solid 4 star read. But it was missing a little something for me that either made it stand out because of who the main character was and the secrets being kept, or to give us that jaw-dropping moment. All-in-all, it was a good read and has lots of promise for the author to build an audience.\n\nSummary\n\nThis is Nay's debut, and her writing skills are strong. Her plot development is also impressive. I would chance another novel, but I'd like to see some stronger character development as noted above. Thank you to NetGalley, Roz Nay, Minotaur Books, and St. Martin's Press for getting me an early copy (ARC) to review."}, {"userName": "Sue", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/3908840-sue", "userReview": "OUR LITTLE SECRET, is the debut character-driven psychological thriller by author Roz Naya, that definitely packs a punch for such a short read at 228 pages. about a missing woman, a tangled love triangle, and the secrets we keep and the secrets we share. I couldn’t put this book down. I loved it! “It was the greatest love affair of the century.”The compelling story takes place in a police station where Angela, the narrator, is being held in a police interrogation room, being questioned by an investigator, Detective Novak.“Her ex’s wife has gone missing and Detective Novak is sure Angela knows something, despite her claim that she’s not involved.”Instead of simply answering questions, Angela decides to tell the whole story from start to finish...but is it the truth? Angela tells a story going back ten years, explaining how she met and fell in love with her high school friend HP. The story slowly reveals itself… a disturbing love triangle and a dark, web of betrayals. “The detective wants to know what happened to Saskia, as if I could just skip to the ending and all would be well. But stories begin at the beginning and some secrets have to be earned.”The complexity of the story slowly over time reveals itself. It is a cat-and -mouse game between Angela and her police detective Novak. Who is telling the truth. The drama is intense! My heart went out to Angela, as she has lived a hard life, and I trusted her.\"Put a crowd of a hundred people in a room and wait. Eventually the psychopaths will emerge, and I'm telling you now, they won't be who you first suspected and there'll always be more than one.\"I'm not saying a lot about the plot of this book, because it is best to experience this drama for yourself. The writing is superb and the character development is spot on. Don’t miss out on this gem!Thank you to Roz Nay, Simon & Schuster Canada and NetGalley and for providing me with an ARC."}, {"userName": "Carrie", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/36817401-carrie", "userReview": "Our Little Secret by Roz Nay is a novel of psychological suspense that is not what one would call a super twisty tale but that of one that is super twisted. A story of love, betrayal and obsession that kept the pages turning.As the book begins Angela Petitjean is sitting in a cold interrogation room with a revolving door of police officers asking her the same question over and over. Where is Saskia and what has happened to her? When Homicide Detective J. Novak enters for his turn at the questions Angela decides to start telling her tale.Going back a decade Angela weaves the story of how she met H.P. and how their love affair began in high school in Cove, Vermont. Angela's parents even approved and her mother just know H.P. was the one for her. But somehow when Angela gets accepted to college overseas it all starts to unravel for her.Our Little Secret is one of those books that isn't going to be for everyone but I personally devoured this one in just a few hours and absolutely loved it. This one is another that I can't help but think it's a bit like coming across a train wreck and not being able to look away when you know that you should. Angela was an obvious mess of a character but her story was mesmerizing until the very end. This one was a definite winner for me and I'd rate it at 4.5 stars and will be keeping an eye out for more from this author in the future.I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.com/"}, {"userName": "Linda", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "Some secrets should be buried and not revealed.Angela Petitjean sits in a glaringly bright room facing Detective J. Novak. Her backbone aches from time spent leaning against the rigid back of the chair. Novak zips out question after question at Angela in the hopes that she will reveal what she knows about her ex-boyfriend's missing wife. What happened to Saskia and did Angela play a part in her disappearance?Roz Nay begins this story in that interrogation room. And we, as readers, will hear what must have been hour upon hour of Angela's relationships with her parents, her first love HP, her high school years, her first year at Oxford, and everything in its aftermath. It's quite a distance in steppingstones.Perhaps this particular book was just not quite a fit for me. It happens. Other readers seemed to feel the thrill in this thriller where I did not. There was the weight of so many backstories and characters that felt one-dimensional and flat. Many avenues that we went down were a bit of a stretch with Oxford being one of them. The main character shows no elements of growth after England and is stilted back into life in small town Cove. They all seemed to go down that rabbit hole in fact.As I always say, check this one out for yourselves. It may just catch your interest on a different level. Let's see what this author offers in the next go-round.I received a copy of Our Little Secret through St. Martin's Press, one of my favorite publishers."}, {"userName": "Mel", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/10697179-mel", "userReview": "So it's now been a few days since I read this and I think I'm ready to review it. I said in my initial review that this was the best thriller I've ever read and that still stands. At the heart of the story is a girl named Angela and she is being interviewed in the disappearance of a woman. We don't know who this woman is, but Angela starts to tell us a love story and slowly things start to unravel from there. I won this through a Goodreads giveaway and like I only entered because the odds seemed to be good in my favour and they so were. This was outstanding. I expected nothing from this small 238 page psychological thriller and yet I was given this addicting captivating read. The number one thing that makes book amazing is that it's so manipulative. The author writes like I've never seen before. She got me to feel things, to think things about characters, to just experience this book in ways I've never felt before. She made me hate people I shouldn't have, like people I shouldn't have. I seriously wished death upon some of these characters. I was completely captivated and manipulated into feeling what the main character was feeling, even when that was clearly not the best choice, and that was so amazing to me. Angela is by far such a special character. She is extremely unreliable but at the same time you trust every word she speaks. She is messed up and has so many flaws but I looked through them because I grew to care so much for her. It feels like I have an unhealthy relationship with her and it's so weird to have that with a book character. I mean all the characters were perfectly written to me. I am trying to review this with no bias, but it's so hard to judge characters when you read a book and it leaves you feeling manipulated. For example, the detective interviewing her, like I know detectives are doing their jobs to solve crimes but I just naturally hated him in this. In another situation, with another character's POV, I might have felt completely different, but because of the way this is written I just hated him. Overall I will recommend this to the moon and back to everyone who reads psychological thrillers. It's such a good one. It's honestly the best I've ever read. Like I will honestly read anything this author reads. She's up there with some of my favourite authors because this blew me away. I think this is even a debut and that just baffles me because the talent you have to have to manipulate my entire thoughts and beliefs have to be off the charts."}, {"userName": "Michelle", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/53328737-michelle", "userReview": "This book begins with Angela being interrogated at the police station in the disappearance of Saskia who happens to be her ex-boyfriends wife. From here she tells Detective Novak a tale of love, obsession, and ultimately revenge. This is Angela's spotlight and it's time to set the record straight. Angela had all the characteristics of an unreliable narrator that I look for and reading her story had me absolutely glued to the pages. I loved the way she was toying with the detective only giving bits and pieces of the puzzle. I, as a reader, was constantly trying to put the pieces together. My mind was a constant buzz. I love it when I pick up a book that I hate to put down and that was this book for me. I will gladly seek out Roz Nays work in the future. Highly recommended! Thank you to NetGalley & St. Martin's Press for providing me with a digital ARC in exchange for my honest review."}, {"userName": "Carol", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "HA! A \"deliciously dark conclusion\" indeed!OUR LITTLE SECRET is a story about a close friendship that grows into love....with a dark kicker. There's a missing person, some strange personal and family relationships that surface, AND a big mystery to solve leaving the reader to question who and what to believe....or it did me.The whole novel takes place within a 24 hour time span while the beautiful and quiet spoken Angela gives testimony in a police interrogation room spilling the whole truth (or so we think) of her relationship with the hunky HP.As the story evolved, I became more and more engaged finding OUR LITTLE SECRET not so little and a super fast read, but must admit to having an issue with some of the totally insane living arrangements encased herein....as you will see. BUT, overall (for me) a worthwhile read that sure delivers in the end....hehehe. 3.5 Stars with a roundup to 4.0Many thanks AGAIN to St. Martin's Press via NetGalley for the complimentary reading opportunity in return for a review."}, {"userName": "Book of Secrets", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/3453249-book-of-secrets", "userReview": "A woman is questioned by police after her ex-boyfriend’s wife disappears. Lots of great reviews for this book, but unfortunately it wasn’t for me. The story lacked suspense, and the characters didn’t grab my attention. I usually enjoy unlikable or unreliable characters, but not so much this time. I couldn’t understand the reasoning behind many things the characters did or said. Maybe if I was clearer about who the “our” was in the title, and also which “little secret” it’s referring to. I liked the final twist though."}, {"userName": "Dennis", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/67496521-dennis", "userReview": "Roz Nay's \nOur Little Secret\n is a delectably dark and twisted thriller that I am now obsessed with! Right from the very beginning, you meet the main deck of characters that will come into play here, with the protagonist Angela Petitjean being pulled in by Detective Novak for questioning. Detective Novak is seeking answers to the disappearance to Saskia Parker, but Angela is confused as to why they are keeping her in interrogation. Angela is just leaving out one piece of the puzzle, Saskia is her ex's wife. As things start to unravel, Angela starts letting Detective Novak (and us) in on the past she had with her ex, HP, and how Saskia and HP became a couple and back into Angela's life. I seriously loved \nOur Little Secret\n so much! At 228 pages, it is a quick fast read (read it within a day) that I recommend anyone to pick up if they have a lazy day, beach day, or just want to relax after work. The story is very engaging from start to finish, and leads you to many different possibilities, with an ultimately shocking end. The book is a light read in a sense that it doesn't really dig too deep, which can be a good thing or a bad thing depending on what you're in the mood for. Luckily for me, it's exacting what I wanted. I really loved hearing about Angela's backstory with HP and it made my heart skip a beat or two thinking of what a beautiful romance they shared before things hit the fan. With an unreliable(?) narrator, characters with dark secrets, and a deeply sinister and depressing storyline, it proves that everyone has a past, and some just can't get passed it."}, {"userName": "Matthew", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "“Is this the real life? Is this just fantasy? Caught in a landslide – no escape from reality . . .”-\tBohemian Rhapsody (as if you didn’t already know that!)Many thanks to St. Martin’s Press for this ARC in exchange for an honest review!Welcome to the Friend Zone! Who here has wanted something from someone you just couldn’t have because you were “best buds”? This is the plight of Angela Petitjean (a.k.a Little John) Unfortunately, her attempts to find a way out of the Friend Zone may be coming back to haunt her.I was entertained by this mysterious and dark tale. The format at first reminded me of Dolores Claiborne by Stephen King – i.e. we know something bad has happened, we are not quite sure what, and we join the interrogation in progress. It was very interesting to put all the pieces together knowing the truth was right there on the edge of my vision.Another fun thing about this book was trying to figure out which side I was on. And, in figuring this out, who in the story was most worthy of my sympathy. Many times throughout I found myself trying to figure out if I felt bad for Little John, or if her behavior was just way too shady. All in all, an enjoyable and easy read. I can pretty much guarantee that fans of thrillers with a twist will enjoy this book."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\n“You can’t get in trouble for thinking things. Because if you could, wouldn’t everyone in the world be in jail?”\nI knew NOTHING about this book before requesting it from the library other than the title. That was enough for me. It popped up on the “recommended to you” front page of the website and I assumed it would be some sort of mystery/psychological thriller since it didn’t have a nekkid feller on the cover (because apparently those are pretty much the only two types of books I request). Having now read it, is it wrong that I would lean toward putting this on the romance shelf????\nOh stuff it, God Warrior.The book even says . . . . \n“What love story ends in a police station interview room?”“You’d be surprised.”\n(^^^^That was probably the point where I realized this was going to receive many of the Starzzzzzzzzzzzzzzz.)Our Little Secret is the story of what takes place during the hours while Angela is being interrogated regarding a missing person. As Angela states . . . . \n“I’m telling this like it’s the beginning of a love story; I’m catering to your needs as a listener. But we both know that’s not where the narrative’s heading, right? I mean, it’s bound to get much darker – why else would I be telling it in a police interview room?”\nAnd no I haven’t been dabbling in all the meth I like in my fiction when I say it reads like a romance – because it does. Angela tells the story of how she met HP, and their friendship and eventually their love . . . and then some other stuff and things . . . . \nI got so wrapped up in Angela and HP’s story that I completely forgot that someone was missing and I wasn’t reading a romance. And even better? I didn’t care if the big reveal was done with bells and whistles, or straightforward and simple, or a complete red herring – I was able to sit back and just enjoy the ride. Bonus: For those who aren’t fans of the wibbly wobbly timeline, this one doesn’t have it. It’s simply Angela telling her story from past to present with no timehops.Thanks for the rec, pornbrary! You never steer me wrong."}, {"userName": "Sarah Joint", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/19758811-sarah-joint", "userReview": "I definitely had a hard time putting this one down. I planned to just get it started and ended up reading until the very early hours of the morning, only saving the last thirty pages because I was so exhausted. It's chock-full of characters a lot of people will have a hard time relating to or liking, but it's such an interesting story that it doesn't even matter. It's a bit of an odd book when it comes to how the story is told, entirely by the main character to a police detective in an interrogation room. It took me awhile to get used to the style and buy that Novak (the detective) was just letting Angela drone on and on but it ended up being a unique and effective way to tell the tale. It flows a lot better than you might think. It's a 4.5 out of five from me! I can say with confidence that the story won't be for everyone, and some may be a little confused by it... but it was a winner for me. Angela has been sitting in an interrogation room for hours, being questioned by rotating investigators asking the same questions over and over. How boring. Her ex-boyfriend's wife is missing, and they don't have any answers. When someone new comes in, a detective that specializes in homicide cases, she decides to give him her story. But she has to start from the very beginning... when she met her ex, HP. Back to high school, back where it all started. Back when he was her best friend before he was anything else. Because this is the only way anyone has been able to get any info out of the woman, Novak listens, and so do we.Angela is a fascinating character. I had to read some of her thoughts over and over, mostly her wry impressions about life and people in general. She's not the only complex character here, but she's the most interesting. Our Little Secret is about love, hate, desperation, and a lot more. What will Roz Nay put out next? I'll read it. I hope it's as twisted and unique as this one. I received an early reader's edition of this book from St. Martin's Press to review. My opinion is honest and unbiased."}, {"userName": "Shannon", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/60039400-shannon", "userReview": "Our Little Secret had me glued to the pages!! I read this within about a day. It’s fairly a short read with only having 228pages. Short chapters which always pleases me.The story begins with Angela, our main narrator, in an interrogation room. She is being questioned by Detective Novak for the disappearance of her ex boyfriend’s wife. Instead of answering questions directly, Angela decides to tell the story of a twisted love affair. She starts at the very beginning on how she met and became friends, with HP, her ex boyfriend.I really liked how most of the story was set in the interrogation room and the rest was set in flashbacks. Our Little Secrets gave me the feels of A Love Letter to Whiskey gone dark. I was literally cringing at one scene, yelling at Angela in my head! “Omg Angela, don’t that!!”.I don’t want to say much more of the story as I don't want to spoil anything. 4 Stars and I recommend!"}, {"userName": "Bill Kupersmith", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/12460952-bill-kupersmith", "userReview": "The first half of this story centres round two end of term parties: a high-school graduation party at a lake in Vermont and the next year at a May Ball in Oxford - surprisingly with three of the same characters present at both. You've read Dorothy Sayers' Gaudy Night, so you know at least vicariously that a May Ball is about as close to being in a fairy tale as you can come and still be more or less in real life. Unlike in Gaudy Night tho', in Our Little Secret the May Ball results not in a betrothal but a betrayal. Like the ball, this novel skirts just along the edge separating realistic fiction from dark fantasy. The principal character is Angela Petitjean aka Little John or LJ. Her high-school love is a swimmer known as HP (which kept me thinking of steak sauce and a rather sleazy British prime minister), standing for Hamish Parker tho' he tries to keep his first name hidden. (Probably not a whole lot of people in Vermont who know it's derived from the vocative case form of the Gaelic version of James.) LJ's father supposedly has a friend who could pull the necessary strings to get her a place at Hertford College. I found that most unbelievable (unless he were senior tutor or something) and equally unlikely that LJ resided there but a year, especially after an Australian blonde named Saskia snatched HP off to Sydney. Instead, LJ takes an implausible job in the town library as an archivist. A few years later they're all back in Vermont, with HP and Saskia married with a little girl named Olive for whom LJ babysits. But as the story opens, Saskia has disappeared and LJ is the prime suspect. She is being interviewed at the police station by Detective Novak, who keeps asking open-ended questions to which he gets even more expansive answers which provides the substance of the book. Even if we're not already suspecting that LJ may be a burrito shy of the combination platter, under the circumstances anyone would likely become a somewhat unreliable narrator. Thanks to Oxford, there's also an Englishman in the story named Freddy, who reminded me that Hertford was Evelyn Waugh's college because Freddy talks like a minor character in Brideshead Revisited. (I have never heard anyone in real life say, 'I'm feeling peckish'!) Both the moral guilt of the villain and the villain's fate seemed ambiguous to me, but then I'm very broadminded about victims who need killing and very biased towards the defence in criminal cases. But especially in the earlier sections, LJ shone for me as bright as a new penny, the perfect high-school sweetheart and with HP composing the ideal couple. Like in a fairy tale (as LJ alludes later) a wicked witch enters to part the lovers, tho' readers may differ as to which character plays which role and whether they change partners. It's clear from her bio and Q&A that Roz Nay is an international sophisticate and the range of characters and settings pushed my limits of credulity a bit. But then we've had so many psychological thrillers about teenagers in small American towns, that it was a pleasure to spend a year at Oxford and have a character who 'stalked strine' in an unputdownable fast read."}, {"userName": "Christine", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/40994055-christine", "userReview": "ALL THE STARS!!! I absolutely loved Our Little Secret, Roz Nay’s debut! The characterization was on point; each character was full of depth- I felt like I knew each one personally. Angela Petitjean (Peh-ti-shon) is being held on probable cause for the disappearance of a woman named, Saskia. After being held for hours in an interrogation room, Angela decides she will tell her story to Detective Novak, but ONLY if she can tell the story from the very beginning, that’s the only way to truly understand. The story alternates chapters between the past and present as Angela unravel her story over a two day period. I don’t want to give away any of this delicious story and ruin it so here are a few of my favorite quotes from Our Little Secret…“I’ve learned everything’s a competition. And that everyone has an agenda even if they don’t admit it.”“Put a crowd of a hundred people in a room and wait. Eventually the psychopaths will emerge, and I’m telling you now, they won’t be who you first suspected and there’ll always be more than one. Watch the successful people who push to the front; keep an eye on the hierarchy as it establishes itself.”“No one wants to see the truth: wrong, right, guilty, innocent, honest, dishonest; with the right circumstances, we’re all capable of anything.” I really loved Our Little Secret and would highly recommend this book if you are a fan of character domestic thrillers and good characterization. I read it in two sittings; definitely a binge read you could easily finish in just one. Riveting, dark, obsessive, gripping, and oh so clever!!! I can’t wait for what Roz Nay puts out next- definitely an author to watch! ***Thank you St. Martin’s Press and NetGalley for a copy in exchange for my honest review."}, {"userName": "Jaclyn", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/11169412-jaclyn", "userReview": "OMG this book is AMAZING. I read so many thrillers that it's rare for one to blow me away. Roz Nay's Our Little Secret did. And it wasn't so much a gripping, unputdownable page turner that sent my blood racing, but rather a slow burn build up of psychological darkness. What begins as a rather innocuous break up between high school sweethearts turns into a tale of psychological manipulation and potential murder. Nay's genius is in the subtlety of her writing and character development, such that it's hard to pinpoint the part where things go wrong, and we have a niggling suspicion that something isn't quite right without being able to identify what that is.Full review to come on my blog in June for the publisher's blog tour from June 5 - 9."}, {"userName": "Rachel Wallace", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/24415743-rachel-wallace", "userReview": "4 StarsWhat a fun twisty little 4 Star thriller! I loved reading it!SUMMARYAngela Petitjean aka \"Little John\" or \"LJ,\" finds herself in a police station answering questions when Saskia, the wife of her childhood best friend HP, goes missing. The majority of the book is Angela recounting the long, complicated relationship between herself and HP in a police interview. Their story begins when Angela moved to Cove, NH in 10th grade and recounts the events of the past ten years leading up to Saskia's disappearance. WHAT I LOVEDThis book has a lot of good points but I think my favorite part was the gradual shift in perspective / opinion I had about the characters and the events as the story progressed. When it started, I was very comfortable in my opinions about everything but as the story gained momentum, author Roz Nay began to drop subtle little nuggets of information causing me to wonder if I had the whole thing wrong all along. So fun!The first part of the story centers around student life at a small town high school and the author got it just right. There are mean girls sticking together in groups out of insecurity and acting crappy to others to deflect negative attention, boys who change girlfriends more often than they change their shirts and friendships that meant everything. She also really captured first love. Oh the angst, the emotions and the stupid knee jerk reactions! Thank God we eventually outgrow all that crap!The last couple chapters were PERFECTION! I couldn't love them more!!WHAT I DIDN'T LOVEI really didn't like any of the characters by the time the book ended but I was still enthralled with the book. Actually, that may be a plus!I really can't think of any other complaints. OVERALLIf you like true psychological thrillers, this is the book for you!! It would be great for a book club selection, dissecting the characters over a glass of wine would be SOOOO fun!"}, {"userName": "Lashaan Balasingam (Bookidote)", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/43439266-lashaan-balasingam-bookidote", "userReview": "You can find my review on my blog by clicking here.This is one of those rare thrillers that actually succeeds in telling a fast-paced, completely immersive and strongly manipulative story in the most concise and addictive way possible. I’d mention that I’m slightly exaggerating, but I’m really not. In under 230 pages, Roz Nay will initially make you feel things towards certain characters and later compel you to embrace polar opposite emotions as the story unfolds. Her writing is brilliant and draws you into the story like none other. Expect time to fly and emotions to be played around with. But what is Our Little Secret about? This psychological thriller focuses on the disappearance of a woman and a love triangle that is in the midst of it all. The whole tale is our protagonist, also the narrator, who’s being interviewed by a detective who’s trying to figure out what happened to this missing woman. What comes next is our lead character telling us the story of her teenage days as she builds the intrigue in an completely addictive and manipulative fashion. For a thriller this short, this one delivers its story brilliantly!The narrative consists of scenes in an interrogation room between Angela and detective Novak as well as flashback sequences that transports us wherever Angela wants us as she recounts how she came to know all the people of interest. Written fluidly, Roy Naz delivers one of the most addictive and fast-paced psychological thrillers ever. While you’d imagine that the story would focus a lot more on present events and try to relay to us moments that occurred hours or days before the disappearance of the women in question, Our Little Secret offers us a much more complex story that draws its origins way back during the teenage years of these characters. This structure quickly grows on you and grabs you by the hand as you learn about each character and the meaningful moments that Angela shared with everyone. It’s through her story-telling that clues are pitched left and right while the intrigue is built up at a steady and unforgiving pace.Although some of Angela’s decision throughout her life can be quite questionable, you can’t help but tel yourself how complicated love can get. The most fascinating element about this book resides in its ability to manipulate the reader in an incomprehensible manner. Topped off by the fast-pace, there is too little time for the mind to think twice, and even less for emotions to be filtered and mitigated. It’s realizing how far some characters will go and how twisted some things can get that truly blows your mind upon reading Our Little Secret. I thoroughly enjoyed the fact that anyone could’ve turned out to be the culprit and that Roz Nay does a beautiful job in making us doubt them without having to try too hard. Even the relationship between the detective and Angela in real time was cleverly integrated throughout the story and invited us to watch the development of their relationship and the chemistry between them as it spices things up for the reader. No hypothesis will seem impossible as the curtain slowly come down. Trust me when I tell you this was a fantastic page-turner. Having a love triangle at the center of your story in order to build a crime mystery where the disappeared woman might potentially be killed offers readers plenty of options and angles to cuddle with. Roz Nay’s writing style also greatly helps in delivering an absolutely addictive reading experience where the intrigue will keep you on the edge of your seat without you knowing. Filled with secrets, lies told to others and to yourself, Our Little Secret toys around with how you perceive the truth and how it’ll unexpectedly stimulate dark thoughts towards certain characters. In the end, it isn’t about the dark thoughts but what you do with them that matters, right? Our Little Secret will definitely go down as one of the best psychological thrillers to successfully keep me thrilled in so little words. If you’re craving for a compelling and quick-paced thriller, look no further.Thank you to Simon & Schuster Canada for sending me an Advance Copy for review!Yours truly,Lashaan | Blogger and Book ReviewerOfficial blog: http://bookidote.wordpress.com____________________________This is one of those rare thrillers that actually succeeds in telling a fast-paced, completely immersive and strongly manipulative story. I'm not even kidding. You'll feel things towards certain characters in the beginning and feel something polar opposite once you reach the end. Roz Nay's writing is brilliant and draws you into the story like none other. Our Little Secret is about the disappearance of a woman. The whole story is our protagonist, also the narrator, who's being interviewed by a detective who's trying to figure out what happened to the missing woman. What comes next is our protagonist telling us the story since her teenage days as she builds the intrigue in an completely addictive and manipulative fashion. For a thriller this short, this one delivers its story brilliantly!P.S. Full review to come closer to release date.Yours truly,Lashaan | Blogger and Book ReviewerOfficial blog: https://bookidote.com/"}, {"userName": "Sam (Clues and Reviews)", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/20224869-sam-clues-and-reviews", "userReview": "Our Little Secret by Roz Nay was not a hard book to completely become absorbed in. The narrative style, the content, the pace and the general menacing tone had me completely captivated from the first pages. I loved this novel. And, at 228 pages, it made the perfect binge read! The novel opens with a woman, Angela, sitting in an interrogation room. She is the suspect in a disappearance. Her ex-boyfriend’s wife has gone missing and all signs point to Angela. As Angela is interrogated she begins to weave a story of a distorted love triangle and a tangled web of betrayals. I found this one to be a nice breather from the typical flash forward/flashback type of narration that is so common in psychological thrillers lately. We do move back and forth through time in Angela’s story telling but this character is so manipulative, calculating and so intent on wasting the police time, it does not come off as overdone. Instead, Nay brilliantly captures an unreliable narrator as she plays her game of cat and mouse; she gives a little, takes a little and leaves the reader wanting more. The character development of Angela was my favourite part of the plot; the juxtaposition of scorned lover meets insecure woman made me unsure of who or what to believe. This one kept me guessing until the end. In terms of psychological thrillers, this is one of the best that I have read lately. If you like psychological thrillers, this is a must read. 5/5 sta"}, {"userName": "Kaycee Bowick (Off_The_Press)", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/14978558-kaycee-bowick-off-the-press", "userReview": "Do me a favor-- If you haven't already read the given synopsis for this book.. \ndont.\nTrust me..I did not 'refresh myself' with the synopsis before I started reading and going back now and reading it as I am writing this review... it reveals a few things that I think are better left unsaid, as it takes away from the authenticity of the emotions you experience while reading if you know them before hand.This is all you need to know going into this novel:★ Angela, our MC, is in in an interrogation room in police station★ She is being questioned regarding the disappearance (and assumed murder) of a woman named Saskia★ Angela is somehow connected to Saskia through a man called 'HP'★ HP was Angela's first love★ In order to 'get to the bottom of things', Angela has to take Novak, the criminologist questioning her, back to the very start-- when she and HP were teenagers and falling in love.This is one of those novels where you can't quite put your finger on whether or not our narrator is unreliable or not--is the guilty of what they are trying to pin on her, or is someone else responsible. But through the process of taking us through her history with HP and the things that occurred between them-- you will experience an influx of emotion that will almost make the crime in question seem... understandable??I think that everyone will be able to relate to Angela--- Everyone, as some point in time, has experienced a loss in love, everyone has experienced betrayal, jealousy, and injustice. I could easily project the things that Angela was going through onto different memories in my own life and that created just an emotion-provoking reading experience for me, as I am sure it will for others.The very last chapter of this book \nmade\n the story!  You will likely think that you know what is going on, and the ending may or may not confirm that, but I promise you... Roz Nay has a final little plot twist for you that was SO satisfying.This was a one day read for me and I could NOT put it down!!!! Fantastic read!Thank you to Roz Nay and St. Martin's Press for providing me with a DRC of this novel via NetGalley in exchange for an honest review. Off The Press Reads: Blog ★ Instagram ★ Bloglovin'"}, {"userName": "Julie", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/38727080-julie", "userReview": "Read this review on Julie's BookshelfAngela Petitjean has found herself in a police interrogation room with Detective Novak. While being questioned with respect to her potential involvement in the disappearance of Saskia, the wife of Angela’s first crush and adolescent boyfriend, Angela divulges into ten-years of history between herself and HP in a read between the lines, scratch your head kind of tale. Are you listening?From Chapter One I. Was. Hooked!! Seriously, if I could give this book more stars I would. I especially loved the setup; it was captivating and flowed beautifully. Chapter to chapter the reader gets to know the characters in this story so well and I became so caught up in Angela Petitjean retelling of her past that I often forgot the main reason she was being questioned in the first place.This is a super quick read at only 228 pages and Roy Nay had me entrapped in every word she wrote. There is no fluff, no useless additions, every single word contained, and every single chapter included was executed perfectly. The instability, the quintessentially unreliable narrator, the thrilling ride to an ending that will stick with you and leave you pondering long after you have finished.Roz, you and your clever web of lies have a fan in me for sure. Roz’s writing style and storytelling reminded me of another one of my favorite authors, Chevy Stevens. If you too are a fan of Chevy you are not going to want to miss out on falling in love with a new author and her electrifying debut novel. I cannot wait to see what you come out with next, Roz! Such a spectacular debut!Many thanks to Roz Nay and St. Martins Press for an advanced readers copy of this novel in exchange for an honest review.Blog | Instagram | Twitter"}, {"userName": "Zoe", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/18237582-zoe", "userReview": "Mesmerizing, dark, and brilliantly clever!This is a character-driven psychological thriller that illustrates just how fine the line between love and obsession can truly be and reminds us that every choice, good or bad, has a consequence.The writing is crisp, polished and fluid. The characterization is spot on with a multitude of characters that are multi-faceted, insecure and vulnerable. And the plot is an intricately interwoven tale that unravels piece-by-piece creating tension, unease, and suspicion as it subtly reveals all the personalities, relationships, motivations and actions within it.This is, ultimately, a story about deception, danger, competition, desperation, dependence, loneliness, manipulation and the fragility of young love and it's hard to believe this is Nay's debut novel. It's sophisticated, highly entertaining, and a must-read that I guarantee you won't be able to put down.Thank you to NetGalley and Simon & Schuster Canada for providing me with a copy in exchange for an honest review.All my reviews can be found on my blog at http://whatsbetterthanbooks.com"}, {"userName": "Sherri Thacker", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/36561653-sherri-thacker", "userReview": "Angela is accused of murder and is interrogated while at the police station. She tells her story to Detective Novak over a 2 day span. It’s pretty fast paced and I read it in a day. It hooked me from the beginning and I couldn’t wait to get to this very dark twisted first time novel for this author. I will be thinking about this one for days!!! I will be looking for more books by this author."}], "description": "THE TOP TEN INTERNATIONALLY BESTSELLING PSYCHOLOGICAL SUSPENSE YOU CAN'T MISS...\"A cracking read...Our Little Secret builds to a deliciously dark conclusion.\" --Ruth Ware, New York Times bestselling author of The Woman in Cabin 10Roz Nay's Our Little Secret is a twisted tale of love, pain, and revenge that will stay with the reader long after they turn the last page.They say you never forget your first love. What they don't say though, is that sometimes your first love won't forget you...A police interview room is the last place Angela expected to find herself today. It's been hours, and they keep asking her the same inane questions over and over. \"How do you know the victim?\" \"What's your relationship with Mr. Parker?\" Her ex's wife has gone missing, and anyone who was close to the couple is a suspect. Angela is tired of the bottomless questions and tired of the cold room that stays the same while a rotating litany of interrogators changes shifts around her. But when criminologist Novak takes over, she can tell he's not like the others. He's ready to listen, and she knows he'll understand. When she tells him that her story begins a decade before, long before Saskia was in the picture, he gives her the floor.A twenty-something young professional, Angela claims to have no involvement. How could she? It's been years since she and H.P., Mr. Parker that is, were together. As her story unfolds, it deepens and darkens. There's a lot to unpack... betrayal, jealousy, and a group of people who all have motives for retribution. If Angela is telling the truth, then who's lying?", "title": "Our Little Secret", "url": "http://www.goodreads.com/book/show/34964971-our-little-secret", "average": 3.69, "cover": "https://images.gr-assets.com/books/1520487518l/34964971.jpg", "reviews": 575, "authors": [{"url": "https://www.goodreads.com/author/show/16176717.Roz_Nay", "name": "Roz Nay"}], "type": ["Mystery", "Thriller", "Fiction", "Suspense", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/34964971-our-little-secret", "http://www.goodreads.com/book/show/33305530-our-little-secret", "http://www.goodreads.com/book/show/33960369-our-little-secret", "http://www.goodreads.com/book/show/36466329-our-little-secret", "http://www.goodreads.com/book/show/39280609-our-little-secret", "http://www.goodreads.com/book/show/39863208-our-little-secret"]}