{"ratings": 43387, "userreviews": [{"userName": "Julie Christine", "userReviewDate": "May 01, 2015", "userURL": "http://www.goodreads.com/user/show/1213607-julie-christine", "userReview": "Kent Haruf wrote Our Souls at Night under a death sentence. Despite knowing his life was coming to a sooner end than it should, or perhaps because of this, he created a story about finding love in the final chapter. Our Souls at Night is simply, profoundly, an exquisite homage to love. And it broke my heart. Because, the story. Because, there will be no more. I read Our Souls at Night in one sitting and wept in the final pages. Even now, thinking of endings, of the ending of this book, the ending of an author I adore, I weep. I weep for aging bodies, for small, mean minds that do such damage, for the elderly, forgotten and alone. I weep for all the stories we will never witness. And I come full circle, to mourn a cherished voice silenced by disease and death. Kent Haruf is the author I take to other countries, pressing his name into the ears of readers not familiar with his work. \"Plainsong,\" I say, \"Eventide. Benediction. Purity. Wisdom. Grace. An American voice like no other.\" And to this, I add the perfection of Our Souls at Night. Addie Moore and Louis Waters are neighbors, familiar but not friends, in Haruf's conjured Holt, CO. In their 70s, they are both widowed and living alone with their fractured pasts. One day, Addie approaches Louis and asks if he would consider coming to her house occasionally, to share her bed. \nI’m talking about getting through the night, she says. And lying warm in bed, companionably. Lying down in bed together and you staying the night. The nights are the worst. Don’t you think?Yes. I think so, he says.\n That's all you really need to know about the plot. What follows is achingly beautiful and gracious and solemn; a meditation on living in the present, a requiem to the held hand. My heart is so full of admiration and affection for Kent Haruf, his stories, his characters, his dry, dusty, flat eastern Colorado. I ache for what was, what will never be again. I am thankful for this final, perfect book—written for his wife and true love, Cathy—and her generosity in sharing it with her husband's readers. Kent, you are so missed. Thank you."}, {"userName": "Will Byrnes", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "And then there was the day when Addie Moore made a call on Louis Waters.\nLouis and Addie are both getting on, in their 70s, Louis having lost his wife a year back, Addie a widow for some time. Both are lonely and could do with some company. While they have known each other for a long time, they have never been close. Acquaintances more than friends. Until Addie suggests that it would be a great help, given her trouble sleeping, if Louis would consent to sleep with her, not hide-the-salami sleep together, but sleep, and talk, in the same bed, overnight, companionship. Louis decides to give it a try. Addie and Louis slowly begin to share their histories. The biddies of Holt, male and female, are taken aback, of course, at the presumed impropriety, as if, once elderly and alone, it was somehow sinful to still want to have a life. There are scenes in which they each are put on the spot and made to defend themselves to snickering locals about their arrangement. Feel free to cheer. Fueling his unhappiness with permanent rage about his childhood, Addie’s son, Gene, in particular, cannot tolerate his mother and Louis being together, projecting into it his fantasy that Louis is in the relationship to somehow swindle Addie out of her money. Problems ensue.Kent Haruf - 1943-2014A consistent focus in Haruf’s novels is the unconventional family, whether of elderly brothers taking in a pregnant girl, or grandparents taking care of an eight-year old. Well, that may not be all that unconventional these days, but it still ain’t Ozzie and Harriet. In this one, Addie’s son, Gene, has his hands full with problems at home, so sends his son, Jamie, to stay with Addie for a stretch of summer. Addie, Louis and Jamie form a very close relationship. There are moving sequences of outings and bonding moments that exude love and comfort, a contrast to the difficult relationships experienced between closer blood relations and spouses. Another Haruf concern is loneliness, at all ages. It is not only the raison d’etre of Louis and Addie’s arrangement, but is considered in relation to their former marital relationships. The loneliness of others comes in for some attention as well. Connections from generation to generation are considered. There are causes and effects, but life carries on. Haruf said, in relation to Benediction\n in the very next house, there is this 8-year-old girl who is the representative of hope and promise and youth and joy. And so what I am wanting people to feel is that the beginning and the ending in all of our lives are set side-by-side. They are not distinct from one another.\nThe same could very well be applied here, connecting the lives of folks at both ends of their mortality. Haruf had been hoping to get to the January 2015 premier of the Denver Center production of a theater version of his novel Benediction. The cast is much reduced in Our Souls at Night relative to that of his prior novels. The focus is on the two main characters, with Jamie in a large supporting role, and remaining there for the entirety. Of course their history brings in other players, but most remain off-stage or pop by for cameos. Addie and Louis trade stories each night in bed. It is a simple and effective mechanism for looking at two lives, their effect on others and others’ effects on them. Haruf used spare language, this, then that. If his writing were a font, it would be sans serif. And he is a master of showing instead of telling. After a rage-inducing encounter,  At home he went out to the garden and hoed for an hour, hard, almost violently…. After a difficult scene, Haruf does not tell us how Louis feels. There was a woman on the elevator, she looked at his face once and looked away.His symbolism is also simple, and effective. The title refers not only to the time of day when Louis and Addie share their lives. It reminds us that time is short. A discussion about a nest of baby mice speaks to unpredictability. Robert Redford and Jane Fonda as Louis and Addie from the Netflix production - Image from VarietyIn an interview Haruf did with John Moore for The Denver Center, he talks about his use of references to his own work in the novel:\n Kent Haruf: … I will tell you there is a reference to the play Benediction in this new book. It's something these two old people have a little comment about.  John Moore: That's part of the fun of reading of your stories. Even in Benediction, which features all new characters, there are those small references that reward those people who have been with you from the beginning. Kent Haruf: It does. And it was a chance for me to have a little fun. Exactly as you say, people who know these other stories will immediately recognize what I am talking about.\n He sets his tale in Holt, Colorado, a place that will be familiar to readers of his earlier work. In another meta moment, his characters refer to the location in reference to seeing a play of a Kent Haruf story! (not Benediction) as a way of letting readers know about his usual locale\n he took the physical details from Holt, the place names of the streets and what the country looks like and the location of things, but it’s not this town. And it’s not anybody in this town. All that’s made up. \nWell, of course Holt is fictitious but Haruf is making sure readers do not assign the place entirely to a single real location. I guess he wanted to clear that up before he left us.\nas a writer, I want to be thought of as somebody who had a very small talent but worked as best he could at using that talent. I want to think that I have written as close to the bone as I could. By that I mean that I was trying to get down to the fundamental, irreducible structure of life, and of our lives with one another.  - from the Denver Center interview I would disagree about the dimensions of his talent, but there is no question that Kent Haruf has offered the readers a world-view that may be bare bones in its form, but which is glorious in its realization. Our Souls at Night, his sixth novel, is the last book we will ever have from Kent Haruf. It is hopeful without being saccharine. Sharing love as darkness approaches may be one of love’s highest forms, offering no short term trade for a probably unrealistic long-term promise. It makes the sharing sweeter, in a way. I got the sense, without digging into specifics, that one thing Haruf was doing here was stopping off at some favorite spots in Holt for a final goodbye. Holt will remain available for generations of readers. Haruf passed away in November, 2014 at the age of 71. He will be missed.Review posted – 6/26/15Publication date – 5/16/15=============================EXTRA STUFFOther Kent Haruf books we have enjoyed-----Plainsong-----Eventide-----BenedictionHere is the complete  Denver Center interviewIn an  interview with Robert Birnbaum for the Identity Theory site In the  Reader’s Guide  of Random House’s page for the book, Haruf talks about how he worked:\nThe idea for the book has been floating around in my mind for quite a while. Now that I know I have, you know—a limited time—it was important to me to try to make good use of that time. So I went out there every day. Typically, I have always had a story pretty well plotted out before I start writing. This time I knew generally where the story was going, but I didn’t know very many of the details. So as it happened, I went out every day trusting myself to be able to add to the story each day. So I essentially wrote a new short chapter of the book every day. I’ve never had that experience before. I don’t want to get too fancy about it, but it was like something else was working to help me get this done. Call it a muse or spiritual guidance, I don’t know. All I know is that the trust I had in being able to write every day was helpful.” \nThere is more info to be had on Haruf from wikipedia and Barnes and NobleThe Netflix film first aired on September 29, 2017. It is a wonderful translation to film, capturing the essence of the book extraordinarily well, and with performances that are as wonderful as the written characters. A couple more images from the film:Image from La Biennale Di VeneziaImage from The Times"}, {"userName": "Ron Charles", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "Readers took their time finding Kent Haruf, but he was a patient man who didn’t care much for the trappings of fame anyhow. His popularity swelled quickly, though, when he published his third novel, “Plainsong,” in 1999 at the age of 56. The book was a bestseller for months and a finalist for the National Book Award, which meant he had to dress up for the ceremony in New York and wear a medal on a ribbon around his neck and feel genuinely uncomfortable. Afterward, he told the New York Times, “We’re nuts, crazy in this country about fame. We expect writers to be something between Hollywood starlet and a village idiot.”By the time he died last November at the age of 71, he had successfully avoided either of those fates and published five quiet, beloved novels about the people of Holt, Colo., a fictional town drawn from his itinerant adolescence. In his obituary, there was mention of a manuscript he’d completed just before dying, and now we have a chance to read that final book. Such posthumous publications come trailing clouds of skepticism, but “Our Souls at Night” is such a tender, carefully polished work that it seems a blessing we had no right to expect. . . . To read the rest of this review, go to The Washington Post:http://www.washingtonpost.com/enterta..."}, {"userName": "Angela M", "userReviewDate": "Dec 01, 2014", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "There are a few contemporary writers who will make a lasting mark and Kent Haruf is most certainly one of them . His quiet stories in their simplicity are meaningful , thoughtful stories reflecting the complexity of the human condition. In his final novel , published posthumously, Haruf has given us another gift . I fell in love with this book from page one , the first sentence and then the perfect description of Cedar Street in Holt , Colorado the place where all his books take place . I fell in love with Louis Waters and Addie Moore and how they talk into the night about their lives and pasts , their transgressions , their hopes and desires , their losses , their families and how they bring joy to each other to ease the loneliness . I love how the title so perfectly reflects this. I love the humor and the honesty in their conversations. I love that Haruf could even make fun of himself as readers of other of his works will appreciate .It's a beautifully told story , sad yet uplifting and even sadder that this will be the last time we hear from this elegant writer . I'm sad it was such a short book . I will miss Louis and Addie's conversations. I'm not sure how I managed to miss reading one of his books but for some reason the only book of his that I haven't read is Where You once Belonged. I'm glad now that I have left myself one more . I've decided to save it for the next time I'm just not able to decide on what to read next . I'll read it then because I know it will be a good one .I am so grateful to Random House and Edelweiss for giving me the opportunity to read this ARC."}, {"userName": "Glenn Sumi", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/28854579-glenn-sumi", "userReview": "You’d have to be stone-hearted not to respond to this beautiful little novel about late-in-life love and companionship.In a small Colorado town, widowed neighbours Addie Moore and Louis Waters, who've known each other for decades, agree to share their nights together rather than sleep alone. This arrangement doesn’t involve sex, although gossiping neighbours assume it does; it’s more about sleeping in the same bed, talking, revealing stuff they don’t tell anyone else. This is how Addie explains her proposition to Louis: I mean we’re both alone. We’ve been by ourselves for too long. For years. I’m lonely. I think you might be too. I wonder if you would come and sleep in the night with me. And talk.He stared at her, watching her, curious now, cautious.You don’t say anything. Have I taken your breath away? she said.I guess you have.I’m not talking about sex.I wondered.No, not sex. I’m not looking at it that way. I think I’ve lost any sexual impulse a long time ago. I’m talking about getting through the night. And lying warm in bed, companionably. Lying down in bed together and you staying the night. The nights are the worst. Don’t you think?Yes. I think so.Except for that awkward, five-syllable beaut “companionably,” this is terrific writing. Both have adult children from their marriages, and both have survived the big and little tragedies life has dealt them. As the nights pass and their defenses come down, they open up about their hopes, dreams and compromises, often withholding the really painful stuff until they’re ready. Meanwhile, they have to deal with the townsfolk spreading rumours and the grumblings from their children, who live hours away. Addie’s son is going through a separation and for a while her sad, insecure grandson comes to stay with her.The writing is exquisite: clear, funny, and unfussy, just like his characters. This was Kent Haruf’s last book, and you can sense him dispensing with artifice to get to the heart of a character and situation. Even the book’s opening lines get right to the point: And then there was the day when Addie Moore made a call on Louis Waters. It was an evening in May just before full dark.Simple. Folksy without being cloying, as if we’re mid conversation and this story just… comes up. I don’t want to say too much about the thin plot. But there are scenes that make my eyes water just thinking about them.Our Souls At Night is about living the examined life. It’s about reaching out and really communicating, not just existing, not just breathing. To hell with what people think. It’s your life. Live it. And while you’re at it, read this book.***UPDATED Sep 9, 2016:: This is going to be an original Netflix film starring Jane Fonda as Addie and Robert Redford as Louis! Also in the cast will be Bruce Dern (Dorlan), Judy Greer (Holly), Matthias Schoenaerts (Gene) and Iain Armitage, from Big Little Lies, as Addie's grandson Jamie. It's produced by one of the producers of the recent film Brooklyn, and directed by Ritesh Batra, who proved he knows how to handle a delicate love story in the film The Lunchbox."}, {"userName": "Cheri", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "Growing up, the earliest years of my childhood, my paternal grandparents lived close by, my father was a pilot and was frequently gone for days, and I spent many days in my grandparent’s tiny caretaker apartment. I would follow my grandfather around while he polished the pews of the church, spruced up the grounds, sat by his side and “helped” him write his poetry, or just “sit a spell and ponder’ with him. With my grandmother I’d help piece her quilts together, or help her in their tiny kitchen making cookies, dough for bread, baking bread. She would invariably send me home with a small ball of dough for my as a reminder that “love grows when you hold it in your open hands.” When they moved to Florida, I was crushed, but I still saw them several times a year. Not as often as weekly, but we wrote often. The year my grandmother died, my father called to tell me the news and I cried. Two days after she died, I got a letter in the mail. I recognized the shaky cursive handwriting at once and whatever composure I’d managed to grasp in that in-between time dissolved. There is nothing in that letter from my grandmother that was portentious, it was much the same as several other letters I’d received from her, how the oranges in their grove were doing, and so on… but these were her last words to me. I cherish them. I opened \"Our Souls at Night” this last novel of Haruf’s, much the same way, with reverence for these last words. Haruf’s writing, as always, has a quiet gentleness and compassion with so much basic “goodness” that is rare, a treasure. In all of Haruf's novel, you must set aside the world and its busy-ness, and just sit a spell and ponder."}, {"userName": "Jennifer Masterson", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/28953843-jennifer-masterson", "userReview": "This is an absolutely beautiful story of two people who give comfort to each late in life. I laughed and I cried! I just loved this novel! It is so well written and so lovely!Louis and Addy are living in Holt, Colorado. They've known each other for many many years. One day 70 year old Addy approaches Louis and asks him if he will come stay with her at night to sleep with her. This is not a sexual thing. Addy is having trouble sleeping. Louis ends up going along with this. I loved the stories that they told to each other, including their tragedies that made me cry. I also loved Addie's curious Grandson and the dog that they got him. The neighbors gossiped, but that didn't keep them apart. I listened to the the audio version of this book. It is exquisitely narrated by Mark Bramhall. This is a short book. It is only three and half hours long, but there is a lot of meaning and substance to it.I'm ashamed to say that I have never read a Kent Haruf novel. Since he has passed on, I will have to start reading some of his older works.Highly recommended to everyone who has yet to read it. I am late to the party again, but I'm so happy that I went! I have a feeling these characters are going to stick with me for a very long time."}, {"userName": "Bill  Kerwin", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "This novella by the author of Plainsong (1999) may be short, but it is large enough to contain two “souls” and enough of the small town of Holt, Colorado to bring it vividly to life.The story is a simple one. One evening Addie Moore, a widow of seventy, makes a visit to widower Louis Walters—a longtime neighbor, but not someone she knows well—and makes him a “kind of proposal”: “I wonder if you would come and sleep in the night with me and talk.” It’s not about sex, she adds—she thinks she lost the impulse long ago—but about “getting through the night,” about “lying warm in bed, companionably.”The next night, Louis takes her up on her offer. And so begins the story of two “souls at night,” sharing their histories, their fears, and simple affection. Their lives, however, soon become complicated, what with nosy neighbors, a visiting daughter, a small grandson, and a son who thoroughly disapproves.As we watch Addie and Louis move closer to one another, through night time conversations and day time adventures, we grow to care about their friendship and how it moves gently toward love. The ending, though surprising, is perhaps inevitable. But I had difficulty reading it through my tears."}, {"userName": "Elyse", "userReviewDate": "May 22, 2015", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "A tender and touching story .....for that phase in life we might face ourselves one day. This book could be a little preparation. Simple Brilliance!"}, {"userName": "Orsodimondo", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "THERE IS A LIGHT THAT NEVER GOES OUTHaruf è scomparso ormai da circa tre anni e mezzo, eppure io lettore sono stato invitato di nuovo alla sua tavola di scrittore.L’antipasto è stato raffinato e saporito: l’incipit conquista e trascina, è ghiotto.Ma poco dopo ho capito che la cura della tavola e delle sue decorazioni superava la qualità delle pietanze, via via rovinate da incompletezza ed eccesso di zucchero: quest’ultimo inaspettato Haruf è più carino, e gentile, che profondo e penetrante.Cathy Haruf, la vedova dello scrittore, in visita sul set del tvmovie. Ms Haruf ha fatto la comparsa nella scena del ristorante, quella in cui Addie e Louis sfidano i malpensanti di Holt.Sulle uscite postume di un artista si potrebbe scrivere un trattato. E forse è stato fatto. Ma non ha comunque sconfitto la perplessità: è giusto o sbagliato?Per esempio, di Jimi Hendrix in vita sono usciti una manciata di album (3 più 3 live), dopo la morte dieci volte tanto!Che dire di questo breve ultimo romanzo di Haruf, una novella che l’editore fa più corposa disseminando pagine bianche? La mia sensazione più acuta è che non l’avrebbe pubblicata così, che non era pronta per la stampa.Di ritorno a casa dopo la prima notte d’amore.In così poche pagine ci sono diversi momenti che mi fanno pensare Haruf avrebbe volentieri riscritto. Per esempio, spero tanto che avrebbe eliminato lo stonato civettuolo ammiccamento al lettore, dove si autocita, e autocelebra, e autocompiace.Credo che avrebbe lavorato meglio il momento in cui i due anziani decidono finalmente di provare ad avere anche un rapporto fisico, oltre l’amicizia che si è venuta consolidando. Un momento clou che mi è parso guastato da un eccesso, come dire, di buone maniere, di cortesia, di riguardo per i suoi due personaggi.Credo anche che avrebbe eliminato, dopo la magistrale scena alla cassa del supermercato (l’anziana Ruth s’inventa una macchia sulla camicetta della cassiera per umiliarla dopo l’acida e pettegola uscita dell’impiegata), avrebbe eliminato lo scambio tra Ruth e Addie, dove ci viene spiegato quanto abbiamo appena letto, compreso, e apprezzato proprio per la sottigliezza, la precisione, e l’understatement.Poi, però, c’è anche da dire che ritrovare Haruf è come andare in bicicletta, se hai pedalato da piccolo, saprai farlo per tutta la vita: ho ritrovato il suo stile e il suo passo da subito, ho potuto attraversare una lunga notte insieme ad Haruf. Mi sono immerso in queste due anime di settantenni, con pregi e difetti, convessità e concavità, spigoli e accoglienza.Scrivere sembra facile, quando leggo Haruf: le sue sono parole che mi viene da definire giuste, precise, essenziali, semplici. Dell’inizio molto bello ho già detto. E anche dopo continua a essere bello, le reazioni bigotte del paese (Holt, sempre quello), che crede Addie e Louis amanti, mentre loro due sono ancora nella fase di avvicinamento ed esplorazione, hanno (momentaneamente) messo da parte il sesso.Per me le cose si sono guastate con l’arrivo del nipotino: l’attenzione di Haruf si sposta sul bambino, e con lui la mia di lettore, che invece voleva restare legata alla coppia di anziani. E con lo scorrere delle (poche) pagine è purtroppo salito il mio tasso glicemico di lettore, alla fine l’eccesso di carineria mi ha soffocato.E adesso parla con me. Dimmi qualcosa che non ho ancora mai sentito.Robert Redford-Louis e Jane Fonda-Addie passeggiano sulla Main Street di Holt nel filmTV Netflix.Il film, ovviamente, da una parte perde qualcosa rispetto al libro, dall’altra guadagna: per esempio, l’imbattibile meraviglia di vedere ancora una volta sullo schermo due leggende come Jane Fonda e Robert Redford, insieme per la quarta volta, dopo La caccia, A piedi nudi nel parco, Il cavaliere elettrico, splendidi ottantenni, con quasi sessanta anni di carriera alle spalle, interpreti del cinema che ho amato di più.Guadagna anche la trama, il racconto sembra filare più del romanzo, sembra più lineare.Se per un verso il bel personaggio minore di Ruth sullo schermo è solo un’apparizione che non lascia il segno, il figlio di Addie, invece, è rivalutato rispetto alla pagina, meno schematico, più rotondo, forse anche grazie alla scelta dell’attore belga Matthias Schoenaerts (Hollywood, al contrario del resto del paese, non ha muri, mai come in questi ultimi anni, gli attori stranieri hanno porte aperte).Purtroppo, il film Netflix è decisamente di confezione e taglio televisivi: rari campi lunghi, per lo più campi medi visto che i protagonisti sono due star agé, campo e controcampo, luce smorzata e pastellosa per non far risaltare le rughe, ma anche senza nessun fascino.Attori leggendari.Sam Brewster"}, {"userName": "Katie", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/56035852-katie", "userReview": "As you’d expect from an author who knows he is dying this is a tremendously wise novel about the pursuit of everyday happiness and all the petty and ingrained obstructions such a pursuit can meet when it’s unconventional. Some of the things he did really well – showed us how much responsibility we have as parents but also how many handicaps, because it’s virtually impossible to escape from stifling generational patterns of behaviour; showed us how similar a censorious view of unconventional relationships is to racism or homophobia and all other forms of bigoted mean-spirited social hostility; showed us how much poetry there is in the everyday if we choose to live with a little bit of courage. And, on top of that, he showed what a transfiguring effect the presence of a dog can have on a child’s life! This was so easy and such a delight to read."}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "Well I guess we should have done this little gem of a book as a \"sister read\" as my thoughts are very similar to that of Brenda's! I listened to the audio version of OUR SOULS AT NIGHT by KENT HARUF and the narrator was absolutely wonderful! His voice was so gentle and soothing!I don't think I can say anymore or anything better than Brenda......so let's just call it a \"sister read\".BRENDA'S REVIEW BELOW:Our Souls at Night is a simple, graceful and tender story of elderly Louis and Addie who while seeking companionship share a touching relationship, quietly at night, sharing their stories of their past, happiness, missed opportunities, mistakes and grief. I love their quiet acceptance of each other and how they start to enjoy the quiet and simple pleasures in life until the noise and judgment of others threaten to destroy it. Listening to this was a special one for me and I became emerged into their lives that left me feeling peaceful and hopeful with the possibility that with change and growth there is quiet later in life. Our Souls at Night is a beautiful novella, short and quick that will have me thinking of the beauty in it for a long time. I highly recommend, especially the audio version. All of Brenda and my reviews can be found on our Sister Blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "Candi", "userReviewDate": "Jun 18, 2015", "userURL": "http://www.goodreads.com/user/show/3639005-candi", "userReview": "\"I do love this physical world. I love this physical life with you. And the air and the country. The backyard, the gravel in the back alley. The grass. The cool nights. Lying in bed talking with you in the dark.\"These simple yet sublime words expressed between two lonely souls managed to evoke such a feeling of peace in me. Addie and Louis, both widowed for some time, wish only to spend the remainder of their lives in companionship and quiet pleasure. What more can we really ask for in this life that is sometimes filled with hardships and heartache? This is my second Kent Haruf novel and there is no doubt in my mind that this gifted man understood people. With a straightforward yet elegant style, Haruf manages to convey the heart of his characters. Even in this short piece of fiction we discern the innermost hopes, fears and desires of Addie and Louis. I adored Addie's little grandson - his love for his dog and his curiosity about the baby mice. I thought their neighbor, Ruth, would be just another busybody but came to appreciate her clever advice to Addie – she managed to make me laugh! And then there were the gossips and the \"bucket dippers\" as my daughter would say. Why can't folks just leave well enough alone? Addie's son Carl with his heaping pile of baggage grated on my last nerve and I simply could not grasp why he was so opposed to Louis and Addie's gentle and unimposing relationship. I won't give away the last 4 sentences of this little gem, but let me just say they were quite poignant and clearly bittersweet. I highly recommend Our Souls at Night and Haruf's Plainsong which I liked even better than this. They will make you think about humanity and those things that matter the most to you. Hearing about catastrophes and senseless killings, I want to stop and think about living each day the best that I can and appreciating the basic and happiest things in life – my family, long summer nights, the tinkling of the wind chimes outside my door, my daughter's extra kisses and \"neck\" hugs, the sound of my son whistling, the taste of root beer floats, my teetering stack of books, and slow dancing with my love, just to name a few of those things for which I am most grateful. 4.5 stars"}, {"userName": "Zoeytron", "userReviewDate": "Jul 01, 2015", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "Stop for a moment and take stock of the simple things in life. Talking with someone who is truly listening. Holding hands and not talking at all. Warmth and companionship. This quiet, unassuming story will make you consider the value of such things. Gold."}, {"userName": "Jen", "userReviewDate": "Apr 03, 2015", "userURL": "http://www.goodreads.com/user/show/27709782-jen", "userReview": "Haruf’s writing is like a soft breeze on a warm summer day. A simple yet superb story where 2 people - Adie and Louis - find each other in their twilight years and share their life’s passions, regrets, sorrows and desires nightly. Beautiful and bittersweet as it is Haruf's last novel, but what a message he delivers. 5 ★"}, {"userName": "Dolors", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/18383778-dolors", "userReview": "I devoured this short novella in one sitting and my feelings made an acute arch from start to end. The excitement of meeting again the familiar, direct but warm style of Haruf’s unpretentious writing sent me soaring cloud high at first, but as the story of Addie and Louis evolved and those closer to them, those who should have shown more empathy and understanding for their situation, betrayed them for incomprehensible reasons, I became impatient and somewhat infuriated by the sheer levity with which Haruf treated these wrongdoings.This book lacks the inner light that shines in the Plainsong trilogy that is imbedded in the essential goodness of people who suspend judgment in order to help each other. This work is more skeptical of that community sentiment and it highlights the selfishness of adult sons and daughters towards their elderly parents. Two widowed neighbors decide to act against their prolonged loneliness and start a relationship that has all the village gossiping about them. Addie and Louis have lived too much to care about the opinion of others, but when Addie’s son Gene interferes in his mother’s life, first by demanding her to take care of his son while he tries to sort out his ruined marriage, and later, by forbidding her to carry on with her affair with Louis, my indignation almost made me stop reading.Begrudgingly, I read until the last page and a huge sadness invaded me. And many questions. What if there is a huge lesson to learn from this story? Could I act like Gene one day? Am I really free of the kind of prejudice that urges Gene to act so unfairly with his elderly mother?Haruf writes about a sorrowful reality that is too common without taboos. He unflinchingly addresses the loneliness of elderly people and their lack of freedom to do what they want with what is left of their lives. Used as their children see fit while it’s convenient for them, and then discarded and treated like toddlers, they are deprived of their last shred of dignity and denied their wishes “for their own good”. Such condescendence, such injustice shouldn’t be overlooked. Read this book and resolve to write a different ending if one of your parents ever becomes the protagonist of this story. That’s what I aim to do."}, {"userName": "Cecily", "userReviewDate": "Nov 17, 2016", "userURL": "http://www.goodreads.com/user/show/1199525-cecily", "userReview": "[: After a forced and probably permanent separation, they talk on the phone: “It's like when we started… Except we're careful now... We're still talking. For as long as we can. For as long as it lasts.” (hide spoiler)]"}, {"userName": "Simra S", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/27535878-simra-s", "userReview": "\"We're still talking. For as long as we can. For as long as it lasts.\"Ever read a book that felt like a warm hug? This book is exactly that. Tender, calm, comforting and it will hit you in all the right places. A book like Our Souls at Night may not offer a groundbreaking plot but this bittersweet novella will leave you with a sense of tranquility and calmness. Addie Moore and Louis Waters are neighbours, in their 70s, living in Haruf's fictional town called Holt. They are both widowed and mere acquaintances. One day, Addie approaches Louis and asks if he would spend some nights with her, to just have someone to talk at nights, to have a companion, and hence the name Our Souls at Night. Addie and Louis start spending nights together, they share their aching past, broken relationships and the people they have loved and lost. One significant character, Jamie, Addie's grandson, enters their life and makes the story even more beautiful. Under the bedcovers and darkness of night, their relationship grows gracefully and they both immensely value each other's presence in their lives. A lot of things happen in the course of the story; people gossip and pry, family discord even force them to end their relationship. Our Souls At Night is a transcendent ode to aging. It was Kent Haruf's last book and it was published posthumously. I picked this book without giving it any thought and it was my first time reading Kent Haruf, it definitely won't be my last. His writing is direct and moving, it is simple yet profound. This was an odd little book from an obscure writer who poignantly captured the emotions of two old people, their loneliness, their need to have a confidant, a hand to hold, and a person to just talk to when it gets difficult to get through the night. I finished the book and I wept, I just sat in my room and wept. He is a writer that will invoke so many feelings in you with his simple and subtle words. I am so glad I stumbled upon this book. I highly recommend it.I watched the movie as soon as I finished the book, and it was not as good. It was not as honest and sensitive as the book. Book is always better."}, {"userName": "Margitte", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "I did not want to say goodbye to one of America's greatest authors. By reading this book, I knew I would have to do it. So I postponed and postponed. And postponed. But today was the day and I closed this book weeping. Kent Haruf wrote his final book - a short one, taking his readers with him through the ending of time, and his last capture of friendship and companionship between two elderly people who tried for one last time to enjoy the love they never had and face the loneliness that claimed their nights. As usual he took his readers into the magic of his fictional town, Holt, and invited us to experience the grace, sweetness and dignity of life in better times, when people still had honor, and men were men and women women. When different rules drove the narrative of marriage and small town living. And kindness walked hand in hand with mutual respect and understanding. They did not have lily white lives, they just handled the consequences of their choices differently. Life left good and bad memories, but they were wise enough to know what was important in the end.By closing the book I felt deprived of Kent Haruf, good writing and good stories. I will miss his gentleness, his gentleman -ess. I can only take the good memories and make it part of my life for now. What an honor it was to discover this author's work. It changed my life. Let us go then, you and I,When the evening is spread out against the sky...~~ From The Love Song of J. Alfred Prufrock by T. S. Eliot, 1888 - 1965It was one of Kent Haruf's favorite poems."}, {"userName": "Debbie", "userReviewDate": "Jun 12, 2015", "userURL": "http://www.goodreads.com/user/show/8665845-debbie", "userReview": "Oh dear. This book and I just aren’t a good fit. Books keep teaching me things about what I like and don’t like. This book taught me I just don't do quiet, simplistic, low-key. I guess I'm just a drama queen, liking my stories over the top. And I apparently don't like small town settings. Give me city, give me nuts! I like complicated over simplistic, no doubt because I make everything way too complicated :)I had a problem with the premise: I had trouble believing anyone would invite a stranger to bed instead of to coffee. Bed seems too personal a space to share with the unfamiliar. Would anyone seriously invite a stranger to share snoring, restlessness, bumping, sleep machines, and all the other embarrassing sounds and sights that are part of the night? And would anyone accept? I know I'm just analyzing it too much. But this is realistic fiction and I just don’t find the premise realistic.The idea of committing to learn about a stranger is intriguing, maybe, say, if they sat at a table and had some coffee cups, as barriers, between them. Once I suspend disbelief, it's not a bad little story. I know and appreciate that this book is near and dear to many, but it's just not my cup of tea. Or coffee."}, {"userName": "Jaline", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/7234171-jaline", "userReview": "Only a few people can say they attended their grand-mother’s wedding. I am one of them. My Grannie was a widow for 15 years, met Gramps at a church outing and they married about 2 months after Grannie’s 70th birthday. Grannie was a joy in our lives – lots of stories, songs, and best of all for me, a wonderful correspondent. She was my most faithful pen pal for years. Gramps was about a year and half younger than Grannie and she would tease us about her marrying a ‘younger man’.Gramps was a gentleman and a gentle man. I remember how he would tuck her arm in his and walk on the outside of the sidewalk; how he would always pull out her chair and seat her at meal times; how he was unfailingly polite, respectful, and loving toward her. Gramps didn’t drive, but Grannie drove until she was 90. Gramps would always open the driver’s door and ensure Grannie was settled before going around to the passenger’s seat. They had their 26th Wedding Anniversary in July and a couple of months later, Gramps died with Grannie following him in December. Our families loved them both and I still think of them and miss them at times.Reading Kent Haruf’s last novel, “Our Souls at Night”, was different yet it recalled to mind many aspects of Grannie and Gramps’ lives together. Addie Moore, 70, is a widow and Louis Waters, a widower. They have lived in the same small town for several decades and knew each other, their spouses, and their children.Addie and Louis are both lonely and they come together to talk, sharing their stories from the past, musing on the town’s people and events, and going on outings together. Their relationship is one that grows into something that is precious to both of them.Several things happen in the course of the story that draw them together. There are also forces at work trying to pry them apart – divided loyalties and family discord.The ending was poignant and sad in some respects, yet left room for hope. When in doubt, I reach for the hope every time – and a fistful of tissues."}, {"userName": "Brenda - Traveling Sister ", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/10841164-brenda---traveling-sister", "userReview": "After reading a review from a Goodreads friend who found Our Souls At Night the perfect first audiobook for her. I decided to listen to the audiobook myself. It's not my first but it was a perfect one for me and an excellent choice to listen too.Our Souls at Night is a simple, graceful and tender story of elderly Louis and Addie who while seeking companionship share a touching relationship, quietly at night, sharing their stories of their past, happiness, missed opportunity, mistakes and grief. I love their quiet acceptance of each other and how they start to enjoy the quiet and simple pleasures in life until the noise and judgment of others threaten it. Listening to this was a special one for me and I became emerged into their lives that left me feeling peaceful and hopeful with the possibility that with change and growth there is quiet later in life. Our Souls at Night is a beautiful novella, short and quick that will have me thinking of the beauty in it for a long time. I highly recommend, especially the audio version. All of Norma's and my reviews can be found on our Sister Blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "Liz", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/4125660-liz", "userReview": "With Our Souls at Night, Haruf proves that simple isn’t the opposite of deep. This straightforward story tells of two folks in their seventies who decide they’re not going to succumb to loneliness because of social mandates. Haruf’s writing is the antithesis of flowery. It’s direct, but it’s still moving. I loved Addie from the first sentence of the novel. And Louis, too. They’re folks who admit the mistakes they’ve made. “I believe there are failures of character, like I said before. That’s a sin.”The conflict in the book involves how others perceive Addie and Louis, especially their children. And for whom we are willing to sacrifice our happiness. I had seen the movie before I read the book, which was a mistake. It was impossible not to see and hear Fonda and Redford when reading. And while Redford made a believable Louis, Fonda is too well preserved for Addie. This is a great little book that I highly recommend."}, {"userName": "Hugh", "userReviewDate": "May 02, 2017", "userURL": "http://www.goodreads.com/user/show/32318315-hugh", "userReview": "This is another book I would probably not have heard about without GoodReads. It was discussed last year by the 21st Century Literature group before it was readily available in the UK. The glowing recommendations from friends in the group stayed with me, and I was a little apprehensive that it would not match my raised expectations. Such concerns were needless.The novel is a perfectly judged, beautiful, poignant study of two widowed old people in a small town in the mid-West, who are brought together by loneliness and find a renewed sense of purpose together, until being thwarted by family pressures. The prose is simple but luminous, and the characters are memorable, and my only regrets were that the book is so short, and that it was Haruf's last work. Highly recommended."}, {"userName": "Rebbie", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/6582211-rebbie", "userReview": "[ I would have told her son to learn his place! Go pound sand, you adult brat! She supports him financially, yet he chases away one of the only good things she has going for herself. He has a lot of nerve, and my jaw dropped when I read how her son Gene was keeping Addie's grandson away from her just to chase away Louis. I thought it was very telling how Gene was mostly concerned about his inheritance and had zero problem with making his sweet little son cry with heartbreak over not being able to talk to his grandmother. I bet that jerk would have changed his tune real fast if she said \"No grandson, no check. How do ya like them apples now, boy?\" Ugh, I can't stand Gene!!!  (hide spoiler)]"}, {"userName": "Diane S ☔", "userReviewDate": "Dec 01, 2014", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "My first review from the ICU, It even rhymes.Once again, or rather for the last time, we return to Holt, in another simply told narrative, featuring ordinary people that are doing something less than ordinary. This is always where Haruf's talents were so admirably displayed. He took the ordinary, the common and made poignant, readable stories. Adele and Lewis, lived in the same town, the same neighborhood for most of their married lives. At the age of seventy both have now lost their spouses. But does, this mean they most join the ranks of the lonely, backward looking, no future to look forward to, or can they do something about it. Of course small towns are notorious for gossip, some who love to do nothing but criticize and make sure others, close to the couple know exactly what is going on.Loved this story, so much hope, little joys and sorrows shared, just the fact that regardless of age there can be a future, one need not just give up and live only in the past. Such a powerful message, so tenderly and respectfully rendered. In the last quarter there is a little surprise, a bit of author's whimsy shall we say, but only those familiar with his other books will understand and grin.Both sincere and wonderful this last book, shorter than his others , but still imparting every day's wisdom and challenges. ARC from the publisher."}, {"userName": "PorshaJo", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/5464046-porshajo", "userReview": "Beautiful, heart-breaking story. Loved every minute of it.The audio narration is just wonderful. Sad that is it over and just wish I could start again, not knowing the story and hearing it again fresh for the first time. There is something so special about a basic, simple story."}, {"userName": "Lindsay - Traveling Sister", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/54886546-lindsay---traveling-sister", "userReview": "4.5 stars! I absolutely loved the two main characters, Addie and Louis!This novel melted my heart! I couldn’t help but smile while reading the conversations and interactions between Addie and Louis, both widows living alone in their senior years. What a unique arrangement they created which aided both of them in combating nighttime loneliness that shadowed over both of their lives. I found it so refreshing to watch them find unashamed comfort in each other.The lack of quotation marks took me a little bit to get used to, but it grew on me and I found it to be a truly unique and interesting reading experience. My reason for not giving this book a full 5 stars is that I was uncomfortable with Addie’s decision to bring her six-year-old grandson Jamie into their arrangement. I loved the bond that Louis created with Jamie, but felt it went a bit too far.Overall, I loved this unique and heartwarming book and would highly recommend it!"}, {"userName": "Carol", "userReviewDate": "Dec 02, 2014", "userURL": "http://www.goodreads.com/user/show/3845138-carol", "userReview": "Mr. Haruf, I will miss you. Thank you for this final gift. Your bittersweet little novella touched my soul."}, {"userName": "Jill", "userReviewDate": "Feb 23, 2015", "userURL": "http://www.goodreads.com/user/show/2228181-jill", "userReview": "It takes a special writer who has the power to touch me to the core. Kent Haruf has a way of doing that. In spare, unadorned yet poignant language, he gets right to the heart of things, capturing succinctly what makes us feel most human.This last novella-sized work, posted posthumously and written just months before his death of lung cancer at age 71, is particularly affecting. In other hands, this narrative might have been maudlin: a septuagenarian widow, Addie Moore, reaches out to her neighbor, widower Louis Waters, with a simple request: to lie together in bed, companionably, and talk in the dark to ward off the loneliness. Gradually, their lives are laid bare to each other – their dreams and disappointments, their hopes and compromises, and everything that composes the tapestry of an individual life.When Addie’s young grandson, Jamie, comes to stay with Addie temporarily, heir relationship both deepens and is tested. I’ll say no more about the plot; it enfolds so naturally, beautifully and yet heartbreakingly that each reader must come to it on his or her own.I will say this: Kent Haruf had a way of expressing what is true and what is important. Addie says, “I just want to live simply and pay attention to what’s happening each day;. And come sleep with you at night.” And at another point: “I do love this physical world. I love this physical life with you. And the air and the country. The backyard, the gravel in the back alley. The grass. The cool nights. Lying in bed talking with you in the dark.”The only thing to say to that is a gentle “amen.” I am so sad that Kent Haruf’s voice is now stilled but happy that he left his readers one last magnificent gift."}], "description": "A spare yet eloquent, bittersweet yet inspiring story of a man and a woman who, in advanced age, come together to wrestle with the events of their lives and their hopes for the imminent future.In the familiar setting of Holt, Colorado, home to all of Kent Haruf's inimitable fiction, Addie Moore pays an unexpected visit to a neighbor, Louis Waters. Her husband died years ago, as did his wife, and in such a small town they naturally have known of each other for decades; in fact, Addie was quite fond of Louis's wife. His daughter lives hours away in Colorado Springs, her son even farther away in Grand Junction, and Addie and Louis have long been living alone in houses now empty of family, the nights so terribly lonely, especially with no one to talk with. Their brave adventures - their pleasures and their difficulties - are hugely involving and truly resonant, making Our Souls at Night the perfect final installment to this beloved writer's enduring contribution to American literature.", "title": "Our Souls at Night", "url": "http://www.goodreads.com/book/show/23602562-our-souls-at-night", "average": 3.95, "cover": "https://images.gr-assets.com/books/1418766517l/23602562.jpg", "reviews": 7111, "authors": [{"url": "https://www.goodreads.com/author/show/16266.Kent_Haruf", "name": "Kent Haruf"}], "type": ["Fiction", "Contemporary", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/23602562-our-souls-at-night", "http://www.goodreads.com/book/show/23568220-our-souls-at-night", "http://www.goodreads.com/book/show/23836861-our-souls-at-night", "http://www.goodreads.com/book/show/34095611-le-nostre-anime-di-notte", "http://www.goodreads.com/book/show/23879379-our-souls-at-night", "http://www.goodreads.com/book/show/28146611-our-souls-at-night", "http://www.goodreads.com/book/show/27807379-our-souls-at-night", "http://www.goodreads.com/book/show/24545406-our-souls-at-night", "http://www.goodreads.com/book/show/77156.Plainsong", "http://www.goodreads.com/book/show/89884.Eventide", "http://www.goodreads.com/book/show/15762186-benediction", "http://www.goodreads.com/book/show/126862.The_Tie_That_Binds", "http://www.goodreads.com/book/show/126861.Where_You_Once_Belonged", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}