{"ratings": 2034, "userreviews": [{"userName": "Emily May", "userReviewDate": "May 13, 2013", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "“They come out of the sky and take you. Everyone knows that.”So, here's what I want you to know: I enjoyed every single minute of this creepy, funny, very different sort of book. Yes, it is another young adult urban fantasy with angels but the approach - which combined elements of light and dark tones - felt completely unique and I found myself mesmerised by the story and characters. BUT. The more I read, the more the pile of small issues would grow. Things that made me raise an eyebrow, that just didn't make sense and that occasionally turned the story I was loving into something slightly ridiculous. HOWEVER, I also think that, numerous though these small things may be, none of them are big issues and all could be corrected easily before final publication. Which is why I've kept my rating high.The story is about angels and I can immediately predict comparisons being drawn between this and Angelfall. For one thing, the conversations between the protagonist (Riley) and Gabe reminded me a great deal of the hilarious banter between Penryn and Raffe. For another, I think Kress really makes use of the mythology available to her and isn't afraid to manipulate and re-write it slightly to tell a tale which is some parts familiar and some parts entirely unique. There are key differences between both books that enable the same reader to enjoy both without feeling the same old story is being exhausted.What sets this book apart from Angelfall first of all is that Kress' novel is set in a small, religious, Southern US town. Religion has always been a big part of life in this small community and I really liked the way the author told this aspect of the story. When the angels first came and took people away from this small town, nobody knew what to think. Was God punishing them? Or were they the chosen ones being carried away to eternal paradise? Should they share these strange occurrences with the world's media? Or keep it to themselves and savour what it feels like to be the ones God chose especially? Eventually, they settle on the latter. A church is built to honour the angels and more and more people start to see their arrival as a blessing. Meanwhile, every year, more people are carried off by the angels and no one knows who they will be coming for next.Riley has seen many people taken by the angels but the one she misses most is her best friend and first kiss - Chris. She is not so eager to believe the angels mean the townsfolk well. So, on the day the angels come, when one turns up at Riley's house, she decides enough is enough. And, like any self-respecting heroine, shoots the enemy in the face. Yes! But when the dead angel turns into a very alive, very naked human guy who has no memory of being an angel and thinks it's still the 1950s, Riley realises that something weirder than she ever could have imagined is happening in their small town.Like I mentioned before, I think there's a fantastic balance of light and dark here. On the one hand, this is about a young girl who's a bit of an outsider, who's lost her only real friend and who has to deal with all the normal, teen issues. The book made me laugh several times and made me cringe with sympathy at the realistic portrayal of high school cliches and body issues. And I feel genuinely grateful towards the author for the way she handled the standard mean girl stereotype and allowed Lacy the popular cheerleader to gradually become so much more. I hate throwaway mean girls that are inserted into a novel to make our protagonist look better in all her good girl glory, so this approach was refreshing and pleasing. I also really liked the growth of Riley herself, how she learned from her mistakes and admitted that she'd been wrong about people, it made her far more likeable than if she'd never made any mistakes at all.And that dark side I mentioned? There are some creepy bits in this book. Really, really creepy. Riley is a much braver person than I am, that's for sure. Sometimes I think those kinds of books are even more effective - when the light balances out the creepy, it somehow serves to highlight it when the change in tone happens. So, now I've been through many reasons why I adored it, I'm going to come back to some of the problems I had that are even more silly because of how easily they could be rectified. One: I don't know if anyone with the power to change this is going to care enough to read my review, but the editing in this ARC was terrible. I normally don't care at all and especially not in ARCs, but there was one point where I counted seven basic grammatical/repeated words errors in four pages. It was really distracting and tighter editing is definitely needed before the final copy goes out - unless, of course, she really did \"advert\" her gaze. Two: Riley shouldn't have taken so long to utilize google - cut down the time frame and be realistic. Three: Riley's mum should have definitely called her husband to check if he did actually hire that guy in the garden before she let him LIVE WITH THEM. Later, her husband assumes Gabe was sent by a friend of his - well even that's a believability stretch, but fine, he could still have made that assumption over the phone. Four: I think Gabe should seem a bit more concerned about what has happened to him, he seems to just want to forget it all and I don't believe his reaction is realistic.But, despite these problems, this is a really good, enjoyable novel that I think could be something extra special with a few small changes here and there. One other thing I loved was how Riley saw Gabe as her friend first and her romantic interest second. I thought it was great that she saw it like that and it made me like their relationship even more. And damn, that ending. What can I say? There's a part of me inwardly screaming \"GIVE ME MORE!\" like a crazy person, but there's another part that recognises how perfect that ending was. It's the kind of ending that leaves room for a sequel but also makes sure one isn't necessary. As much as I loved this book, I think it ended right where it needed to and any sequels risk ruining it. But I'd still read them, of course."}, {"userName": "Hershey ", "userReviewDate": "May 15, 2013", "userURL": "http://www.goodreads.com/user/show/19468761-hershey", "userReview": "Simple, nice, plain and a bit cliche First, I must say that the synopsis might sound a little bit like Angelfall by Susan Ee and I assure you that this book is nothing like Angelfall which is a very fast paced novel.Outcast is a slow paced novel with a not - so - captivating story line. I didn't find the story line or the characters interesting. The whole thing felt flat to me. They were okay. But they could have been better. More lively.I was just completely disappointed :( I expected so much! Maybe I should stop expecting much from books and just go in with neutral feelings.Riley's world is completely different. In her world, angels come every year and take someone with them. You never see them coming but you always see them leaving with a human. Then she shoots an angel in her back yard. But the angel's not dead. In fact, it doesn't look like an angel at all. It looks like a human. A hot naked human. And poor Riley has no idea what to do. And the hot naked human thinks it's 1956.Except for the 1956 part, I found the rest of the plot very trite.Gabe was amusing. Of course he is. Because he's naked and hot. I liked Gabe. He brought humor and a little bit of fun to the book. Riley was nice too but sometimes her narration made me a little sleepy eyed. There were many interesting events in this book but it was nothing that made me gasp or jump up and down. It just flowed like a smooth river, the story I mean with no impediments. A calm river. I think if it had a little bit of an obstacle here and there in the story line like something scary or in plain words - anything intriguing, I might have given this book five stars. But I liked the plot nonetheless. It was simple. Nothing heavy to read about. It was a good read . I'm a little disappointed because I had very high expectations of this book. Mainly due to its awesome cover :)"}, {"userName": "Mitch", "userReviewDate": "May 28, 2013", "userURL": "http://www.goodreads.com/user/show/8170554-mitch", "userReview": "You know that awesome, awesome feeling you get when you pick up a book and just know, even one chapter in, that you'll get along with it wonderfully? Outcast is that book for me. It's equal parts charm and spunk, but more importantly, I really think Adrienne Kress has brought something new to the angel genre here, even if the best way I have of describing this is as the quirkier cousin of Angelfall. Granted, I did have a slight issue towards the end that affected my overall rating, but I don’t think I can give any book a stronger endorsement than this one, that's how much I enjoyed it.Anyway, looking at the summary, Outcast really does look like Angelfall, doesn't it? We have a small Southern town plagued by angels, one tough, no nonsense chick in Riley Carver who takes matters into her own hands and shoots one, and Gabe, the angel she captures and - I'll just leave the rest blank, anyone who's read Angelfall or really any angel book for that matter should be quite familiar with what happens next. But what sets Outcast apart, and really what made the book for me, is that while Angelfall is firmly postapocalyptic and dystopian, Outcast incorporates a genre I don't think I've seen much of from angel books, or from most young adult even, magical realism. It's the kind of story that reads like a contemporary, but transitions to the magical elements so smoothly that the only clue something is going on is whatever's transpiring really doesn't happen that way in real life. Take for example Gabe ingratiating himself into Riley's family - feels odd doesn't it? - but that's magical realism for you, mixing and matching normal and paranormal elements until you're not quite sure where one ends and the other begins, giving the whole thing a haunting, supernatural air. The other thing I love about Outcast is how Kress goes out of her way to dispel so many different stereotypes and cliches that would've been embraced by a lesser young adult book. I happen to have lived in a small Southern town and trust me, it wasn't a backwater of small minded, Bible thumping folks (although there were more than a few...), so I was really impressed not just by the way Kress captures that small town feel but also by the way she incorporates religion into her story (it's an angel book, yeah of course there'll be religion). The way Pastor Warren slowly sinks his claws into the community was really creepy, almost like watching a cult form, and the different townspeople’s reactions to their predicament, the associated questions of spirituality and theology, Pastor Warren's foil in Father Peter, all of it goes a lot deeper than what I would've expected from an angel book and yet perfectly complements the mystery of the story rather than overwhelms it. And of course, the characters do a lot to help, Riley’s sort of an outsider to the town, Lacy her mean girl nemesis, and Amber another outsider who should've been Riley's best friend, but Kress really turns what could've been stock characters completely on their heads by going in a completely different direction with their characters - turns out, Riley's far more charming because she's detached but not disconnected, Lacy not the mean girl for the sake of being the mean girl, and Amber, I really pitied Amber.Now, my problem is that the book sort of goes on a tangent right before it really got interesting. Stuff happened between Riley and Gabe that I either skimmed (a three chapter date between the two - yeah, I get it’s fanservice, but it messed up what was otherwise really good flow for me because otherwise the stuff between the two of them is actually sort of in the background but really sweet, although I’m pretty sure it’ll be the opposite of a problem for everyone else, so don’t take this as a real complaint) or didn’t buy at all (this one is a real complaint, what happens to Gabe right afterwards felt really awkward and contrived), and the whole thing just reeked of manufactured drama right before the big showdown I really could’ve used without. Which makes me sad, because frankly, the ending was awesome, bittersweet yet satisfying as a standalone yet hopeful if there is ever a sequel, and I just didn’t see the point of sowing Riley with those doubts and weakening her character so late in the game only to explain it away the way it was explained away *shrugs* but it’s probably just me.Still, I have no problems with saying Outcast is really good. Like really really good. It’s a different spin on the angel genre that definitely agreed with me far more than the usual stuff, so hats off to a great book."}, {"userName": "Katerina Kondrenko", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/36306002-katerina-kondrenko", "userReview": "5 out of 10\nРевью в моем блоге/This review on my blogLiving A Thousand Lives (please use Chrome/Yandex browser or Android/IOS to see the page; otherwise, spoiler-tags I use to make my post compact may not work)Genre: fantasy, teen-ish YAStuff: angels-aliensFail: childish stuffWOW: GabePOV: 1st person, femaleLove-Geometry: annoyingQuote-Core: \n“Sing 'em to remember. Sing 'em because you remember.”\nIn a place located in a middle of nowhere, which name I didn’t even remember, over a span of six years “angels” kidnap people. In happens every year in a certain day, they grab some folks, fly up-up-up and disappear. The process is so much like the UFO stuff, but angels… why do they call them like that?! Oh, large wings and massive bodies… if it’s not some hawk-mutants then angels is their best guess. Okay, but why angels need people from this middle of nowhere? I mean, there’s New York City (let alone China!), where the choice set is obviously better and looses aren't so visible. No one knows. Except Pastor Warren. This man founded an Angel Church (smells like sect) and he is brainwashing the population with: let’s kiss angels’ foots, they chose us so we are chosen ones and blah-blah-blah. This crap doesn’t bother at all our main character named Riley. The year before her best-friend-almost-boyfriend Chris was taken by angels, so now she’s blue and angry and decides not go to the stupid yearly fest where winged creepy things are taking poor folks. But what a nice surprise: one of these heaven douches shows up right on the Riley’s home yard. For a while she is terrified, but then grabs her mother’s shotgun and shoots her guest in the face. After that she runs inside the house where she is terrified again for a while. When Riley finally comes out to clean up the mess (‘cause parents won’t be pleased with the corpse abandoned next to their house), angel is gone. Instead of it on the ground lays a naked guy (and he's hot). How do you like this set-up?! I know it’s awesome! We’ll find out who the naked guy is, what the heck is going on in this town, who the Thrall are, what the bee-keeper (thing with a cloth on its face) is, why it is stalking Riley, and so on.The beginning is pretty fast-pacing, MC (and a teller) is a WOW-narrator, snarky and ironic one; it is a pleasure to read the book from her POV. But between 50% and 85% the plot becomes dragging, alas. The final rehabilitate the story, but I disagree with how the book ends. I like retro-stuff and slang; it puts a charm into the pace. But the book is more for teens than for young adults, I think. First love, first date, school problems… If not for the angels, I wouldn’t read this story, but you should know it wasn’t bad! Did you see the rating of Immortal City? I mean, that book where angels are celebrities. It’s 4,5 or even high, but trust me, Outcast is so much better! What I'm trying to say is... I’m old for this story, but some younger readers may love the book. Just remember that 50-86% are still boring, even for teens xDBTW, I saw that readers demand a sequel. IMO, this book is a nice standalone with a logical final. But I can see why people need the book #2. I’m a bit disappointed with the ending too..."}, {"userName": "Tink Magoo is bad at reviews", "userReviewDate": "May 22, 2015", "userURL": "http://www.goodreads.com/user/show/38603325-tink-magoo-is-bad-at-reviews", "userReview": "[ the ending. Fair enough it fit with that moment, but really, thats it?! I needed more than thay. Is she just accepting that he's gone and is going to be punished, just like that? How about bargaining with them. And some sort of epilogue (even a year later) would have been good. Just to see how her and Chris are.  (hide spoiler)]"}, {"userName": "Stephanie", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/1471666-stephanie", "userReview": "One of my biggest pet peeves - incorrect use of local vernacular. Please authors, if you are not familiar with the way an American southerner speaks, don't try to use the word \"y'all\". Y'all means \"you all\", addressing at least two or more people. Every time I read this used incorrectly, it completely threw me out of the story... ugh."}, {"userName": "Jeann (Happy Indulgence) ", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/6186603-jeann-happy-indulgence", "userReview": "Full review has been posted on Happy Indulgence. Check it out for more reviews!I’m an emotional wreck. Adrienne Kress has charmed me with her unusual writing, warm characters and quirky storyline, and then wrung my heart strings with that emotional ending.Outcast is about a small town that is visited by angels each year, who abducts a few humans in a yearly event called ‘the taking’. Riley Carver has lost Chris, her best friend and love interest from the taking, and in the sixth year of the taking, she’s determined to find answers. So when an angel turns up for her, she shoots it in the face.That angel turns out to be Gabe McClure, a boy who is compared to James Dean on a variety of occasions, who lived about 50 years ago. While it all sounds like a typical YA fare, Outcast is like the Zombieland or Hot Fuzz of conventional genres. It is charming, quirky, and yes – a little out there but we love it all the same.I definitely didn’t expect Outcast to hit me in the way it did. The first few chapters took a bit of getting used to, with a slightly awkward way of putting things and stunted conversations. It took me a while to realise that the character voice was perfect for Riley Carver herself, the tough, awkward, no nonsense teenage girl who doesn’t care what anyone thinks. And that’s what makes her charming in her own little way.This is a girl who, instead of preoccupying herself with crushes, social groups and clothes, spends her time planning how to get Chris back and finding out more about Gabe and how he came to be. I grew really attached to Riley over time, she has that gung ho no nonsense attitude about her yet she’s awkward, smart, and resourceful, and a leader and motivator without knowing it. I had so much more fun reading about Riley and delving into her thoughts, and the way she accepts supernatural things happening around her, rather than the million insecure and boy-obsessed ’Mary Sues’ that we see so much in YA fiction today.Gabe himself was cute, and the way he ruffled Riley’s feathers was adorable. He’s in denial about what he’s went through and adopts everything high school life has to offer, unlike Riley and it’s interesting to see how these two mix.Outcast is one of those novels that adds magical elements into real life, but in a way that is believable (as unbelievable as the Taking sounds) but doesn’t take itself too seriously. For example, Riley is stalked by this ‘ghost thing’ that has a white sheet over its face with two holes. She talks to the ghost, who talks back in a literal manner. I found the whole exchange between them to be quite hilarious (and although it’s slightly creepy, it wasn’t really presented that way).What was creepy though, was Pastor Warren and the way he weaseled his way into the town. The story has come alive so vividly for me that I’m picturing this whole thing like a movie, and in the movie, he’s the villain who needs to be defeated by Riley and Gabe.I could go on about it but I think I’ve communicated that I absolutely loved Outcast and everything about it! I highly recommend it to everyone looking for a charming, witty novel. I received this novel from Diversion Books via Netgalley in exchange for an honest review, thank you so much for this opportunity. I only wish this was a series so I could read more!"}, {"userName": "jesse", "userReviewDate": "Apr 18, 2013", "userURL": "http://www.goodreads.com/user/show/1185127-jesse", "userReview": "[drunken (hide spoiler)]"}, {"userName": "Rose", "userReviewDate": "May 13, 2013", "userURL": "http://www.goodreads.com/user/show/3399699-rose", "userReview": "I want to mentally hi-five Adrienne Kress, because this book, apart from some pacing issues, is exactly the kind of book I anticipate from a YA read. It was so much fun and I'll admit I had a grin on my face in many places within the story, and was surprisingly gut-punched by the way things turned out in the end.The story revolves around 16-year old Riley Carver, a young woman living in a small, secluded town with deep religious roots, and a problem of descending angels abducting the residents. It affects Riley directly when the first boy she ever kissed gets abducted, and in the following year, Riley ends up shooting an angel in the face. When the first chapter ended on that note, I thought \"Well, this is going to be interesting.\"Riley discovers that the \"angel\" she shot turns into a human, teenage boy named Gabe who was abducted and went missing over 70 years time, which makes him a \"time traveling angel\" if you will. Gabe is incredibly self-aware and charming (and it's not just the priceless one-liners he delivers when Riley ties him up while naked). The two team up to try to figure out exactly what happened, with Riley being more apt to discover if there's a link to the missing boy she knew and loved. In the meantime, Gabe struggles to connect to the life he lost since his abduction and what he doesn't remember. This causes a rift between the two in spurts, alongside other matters when Riley realizes there's something not quite right about Gabe's being there or his respective identity. Maybe even something that might be connected to her.I really enjoyed watching the character dynamic in this novel, especially when it was on point for the main characters as well as the secondary ones. I had a clear idea of the motivations and the stakes. Coupled with the humor and natural narrative and interactions, it really pulled me into the story.Yet the biggest detractor that kept me from rating this higher? Pacing. There were times when the pacing in this novel was incredibly slower than it needed to be in turns, and I could tell that it struggled in trying to deliver the revelations and establish connectivity with the characters in places. But when the connections worked, they worked remarkably well. I kinda wish there were more characters like Riley and Gabe in YA, in that they have flaws, but they're also likable and funny in that you feel invested in watching not only their interactions and personal trials, but their connection as well.Overall, I would certainly recommend this as a solid read in YA paranormal/supernatural measures. It's one of the better reads I've had as of late.Overall score: 4/5Note: I received this as an ARC from NetGalley, from the publisher Diversion Books."}, {"userName": "Susana", "userReviewDate": "May 16, 2013", "userURL": "http://www.goodreads.com/user/show/7301000-susana", "userReview": "[And i'm not even referring to the romantic aspects, because by then i couldn't care less. But the whole, you want Chris back you have to let Gabe go, was just too easy (hide spoiler)]"}, {"userName": "Keertana", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/7584700-keertana", "userReview": "Outcast is a novel I enjoyed, but don't have very much to say about. It's about angels. Only...with a slight twist. Riley lives in a small Southern town where, once a year, angels drop down from the sky to take a handful of young humans up to the heavens with them. In her god-fearing town a Church of Angels has been built and instead of fearing the day the angels arrive, her neighbors have learned to celebrate it. On the third year the angels came, though, they took Chris, Riley's best friend and soon-to-be boyfriend. On the fourth year the angels came, Riley shot one. And it turned into a very attractive, but naked, young boy who believes it's the 1950s. Gabe.Admittedly, this book wasn't what I expected. I think I flipped that first page thinking I'd get Angelfall only in a modern-day Southern setting instead of an apocalyptic one. Well, let's just say that Outcast has a lot less action, gore, or plain bad-assery. Yet, it was a very entertaining story. Gabe doesn't remember being an angel at all, so his admittance into modern-society is amusing to witness as is his developing friendship with Riley. And yes, you read that right: friendship. Riley still misses Chris and, moreover, she is angry. What she really wants are answers and if anything, those seem to be missing. Gabe has no celestial powers and even by attending the Church of Angels, he doesn't remember anything that happened to him in the last fifty years. As such, the plot of solving the mystery at hand is slow to emerge, focusing instead on the slow trust gained between Gabe and Riley.When the mystery prevalent in this novel slowly begins to come together, I found myself far more immersed in the story. Not only is the pacing faster, but Riley's growth and change as an individual is far more apparent. Kress's portrayal of Southern society and high school is typical, but only at first as she soon embeds depth into even the most stereotypical of characters, making for a truly engaging read. Nevertheless, where Outcast truly shines is in its ending. It is a bittersweet one which made my heart ache, but in all the right places. Ultimately, Kress manages to write a novel with memorable characters whose story arcs are complex, but realistic with just a tinge of paranormal/fantasy thrown in. It wasn't enough to earn a spot on my favorites shelf and it definitely didn't rock my socks like I'd hoped, but it is a perfect read to lose yourself in. Recommended? Very much so."}, {"userName": "Sandes gii", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/24031054-sandes-gii", "userReview": "4.5/5esta historia es increíble! me encanto de principio a fin. Ame los personajes y como esta manejada la historia, ciertas cositas no me cerraron por eso saco ese 0.5 punto y además odie el final.Y NO ME PUEDEN DEJAR ASI!!!! NECESITO UNA SEGUNDA PARTE! NO PUEDE TERMINAR ASI!!!!!"}, {"userName": "Lisbeth Avery {Domus Libri}", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/8282085-lisbeth-avery-domus-libri", "userReview": "[Especially since they aren't angels. (hide spoiler)]"}, {"userName": "Tsana Dolichva", "userReviewDate": "Jun 03, 2013", "userURL": "http://www.goodreads.com/user/show/5179009-tsana-dolichva", "userReview": "[.The one upside is that this is another book about angels (along with Rise of the Fallen) that did not annoy me because of the way the angels were treated (I get the feeling that without direct evidence of weird shit going on Riley might have been an atheist). Yay, \"only\" bad writing! Oh and most of the supporting characters were pretty good, especially the non-cookie-cutter cheerleader and the Catholic priest disenfranchised by the angels. Although I also thought that some of their interactions, notably at critical moments, could have been more complex in terms of motivation.If you're the kind of person that notices when a book is poorly written, definitely give this one a miss (unless you're into that kind of thing). If you're not usually one to notice poor writing and the plot has got you interested, then by all means, give it a go, just don't set your expectations too high.2.5 / 5 starsYou can read more of my reviews on my blog. (hide spoiler)]"}, {"userName": "Vishakha ~ ReadingSpren ~", "userReviewDate": "Aug 19, 2016", "userURL": "http://www.goodreads.com/user/show/20822146-vishakha-readingspren", "userReview": "Half of this book was generic YA. The other half was something else entirely. The blurb doesn't do it justice. I really thought I was in for some light-hearted paranormal romance. I didn't expect anything profound which surprisingly this book was. The author has stitched together two worlds; one of high school drama, other of angles and beasts and ghosts. The mundane gels into the extraordinary seamlessly. The world she created is fascinating, mysterious and eerie. But unfortunately not as believable as I would like it to be. And surprisingly it was the mundane aspect of the story that seemed more unlikely than the fantastical one. But despite its flaws, this book was very enjoyable. Riley is a good protagonist. She starts out as a judgemental cynic, but her friendship with the school's head cheerleader made her grow as a person, made her realise that people were more than what they appeared to be. The cheerleader, Lacy, in turn also grows a lot as a character. I am so glad she was not another one-dimensional bimbo. They are both very brave, especially Riley. She is also very kind, in her own hard-headed way.In a small town where religion plays a major role in the peoples' lives, a person who is relatively free from the mob-psychosis will automatically turn into an outcast. Slowly, steadily. The phenomenon is beautifully depicted here, with Pastor Warren becoming a highly revered religious figure. Romance is a very important part but not the most dominant. I like how Gabe turned out to be so much more than a hot YA love-interest. Gabe and Riley are family first. Their relationship grows and matures over time, the kind of relationship you can respect. It also doesn't hurt that both of them have a good sense of humour.This was a weird combination of heart-warming and heart-breaking for me. T_T"}, {"userName": "Bec", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/4619726-bec", "userReview": "This was such a bittersweet ending. It fit the plot and stuff but still, I wanted them to be happy"}, {"userName": "Mary", "userReviewDate": "May 29, 2013", "userURL": "http://www.goodreads.com/user/show/8471229-mary", "userReview": "[Gathering the army that may or may not be good enough to fight the angels? Alright, before that fight happens, let’s tell Riley why it’s literally IMPOSSIBLE for her to lose.  (hide spoiler)]"}, {"userName": "Stuti (Turmeric isn't your friend. It will fly your ship", "userReviewDate": "Apr 18, 2013", "userURL": "http://www.goodreads.com/user/show/6372822-stuti-turmeric-isn-t-your-friend-it-will-fly-your-ship", "userReview": "[image error]"}, {"userName": "Ornella (Nyx)", "userReviewDate": "May 28, 2013", "userURL": "http://www.goodreads.com/user/show/6282007-ornella-nyx", "userReview": "This was quite the fun read, while still dealing with the coming of age issue and touching on some religious aspects. I'm gonna right ahead and say that the best part of the book was Riley. She was a spunky, kick ass girl, who would sometimes come off as being a bit of a snob at times, but could still really relate to her. She reminded me a lot of how I used to be in some aspects. Was a lot of fun to read everything through her eyes since I could understand her perfectly. She has a unique sense of humor and I loved how cautious she was. She didn't take anyone's word fro granted. Sure she would ask people questions, but she would always test and nit and pick at the answer till she was sure it was right. Really liked that about her. She has one slip in character towards the end. One I was wrinkling my nose at. She had been such a strong character since the start and then that happens and she just crumples like that. Don't think so.Plot wise, it was actually quite interesting. The idea that angels would come down to earth and randomly take people and the reason behind this was a new concept for me and Kress somehow makes it work. She was able to slip in so many different aspects that you don't really notice it till you are done with the book. It just all flowed so smoothly it was impossible to not let yourself be swept along.The romance was another great point for this book. There was no insta-love, no love triangles. Just a sweet slow romance that developed naturally and I really appreciated this. You don't get to see this in YA novels now a days for some strange reason. What ever happened to normal romance? No one ever said it was bad...Speaking of which, the MC actually has active parental units! And they are both pretty awesome! They are there for her and really loving and supportive through out the whole book. Again, something rare in YA books.I'll leave you with one of my favorite parts that isn't spoilery:\"He reappeared maybe ten feet away in front of me. I heard laughing in my head. You're a strange one. That's the last straw, buddy. \"Yeah, well, you're dead.\" And I shot that angel right in the face.\"*Thank you to Netgalley and the Publisher for a copy!*"}, {"userName": "Katja Weinert", "userReviewDate": "Jun 04, 2013", "userURL": "http://www.goodreads.com/user/show/9350051-katja-weinert", "userReview": "For our heroine, Riley Carver, a yearly event over the past six years sees“angels” coming out of the sky to take away her townsfolk. When her boyfriend is taken she starts to hate the status quo, and the odd Church of Angels, which asks the town to accept the strange yearly taking.As far as her relationship with the 'angels 'goes, it's not worshipping she intends, as the blurb explains \"When one decides to terrorize her in her own backyard, it’s the final straw. She takes her mother’s shotgun and shoots the thing. So it’s dead. Or … not? In place of the creature she shot, is a guy. A really hot guy. A really hot alive and breathing guy. Oh, and he’s totally naked.\"From the write up I just knew this story would be humorous, and it certainly was. Her naked, living, breathing guy is called Gabe and he's an irreverent flirt - and a total mystery. Riley's determined to uncover the reason her town's been chosen for these yearly abductions and her journey held my attention from start to finish. Her investigations aren't put on hold whilst having to cope with the annoying fervour of the Church of Angels followers, a snarky cheerleader - who simply won't let her catch a break - and several unexplained phenomena.Outcast is set in the deep south, and is filled with humid summer days, drawling accents and catty southern belles. There are gun totting and swamp dwelling folk, as well as many supernatural beings. It's a quirky blend of comedy, romance, and spookiness. The characters are lovable and the plot sucked me in from the start."}, {"userName": "Laura V.", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/18629656-laura-v", "userReview": "3.5/52015 Reading Challenge: #11 Libro con una palabra por títuloNo me decido entre si Riley me gusta o me fastidia. Cuando creo que he calado su personalidad sale con otra cosa. Me mareó.Bien, con la historia en sí, me gustó (a medias). Tiene una cosa que me encanta: cuando los protas conviven juntos. Es tan beauty. Pero me decepciona porque realmente no los vemos muy juntos como en conviviendo juntos (parezco más trabada que Riley para explicar las cosas XD).Todo el tema de los ángeles y la Toma, atrapa. Me entra curiosidad y leo para saber más. La fastidió con Gabe. El chico no tiene profundización, carácter o personalidad aparente. Solo está ahí, sonriendo todo el tiempo, siendo un buen chico, \"coqueteando\" con Riley y soltando un \"cariño\" o \"nena\" cada vez que abre la boca (como si la cría no tuviera nombre).Aún así disfruté leerlo, porque aunque Riley es ambivalente y Gabe soso en todo lo importante, hay un trasfondo que intriga. ¿Quienes son estos ángeles? ¿Por qué solo sucede en su ciudad? ¿Qué hay con toda esa fácil aceptación de la gente?La ENORME pega es ese final. ¿Tantas páginas para eso? De haber sabido que tiene posible continuación no lo leía, porque gente:1. Tengo muy mala memoria, y2. Odio esperar.Así que si el final final de esta historia sale este año o el próximo lo más probable es que no lo lea porque ya no recordaré este libro, y no es tan interesante como para volver a leerlo, habré perdido el interés. Lástima."}, {"userName": "Jessica", "userReviewDate": "Feb 01, 2015", "userURL": "http://www.goodreads.com/user/show/18525445-jessica", "userReview": "Primero que todo: Dios mío.Segundo: Adrienne, definitivamente lo eres todo.Tercero: Creo que mi corazón acaba de romperse un poquito.\"Cantas para recordar.Cantas porque recuerdas.Recuerdo, Gabe, recuerdo.Y nunca voy a olvidar.\"Entoncesssssssssssssssssssss, podemos comenzar por el hecho de que tengo el corazón roto. No comprendo por qué ese final, y por qué siempre tengo que leer cosas tan dolorosas. Necesito algo que me quite este ser masoquista que llevo dentro, urgente (!!!).Tengo que admitir que lo que me compró fue la portada, o sea, mírenla. Es hermosa. Pero la sinopsis me trancó un poco el paso, a decir verdad los ángeles son que si mi cliché favorito pero últimamente ya me están cansado un poco y no quería pues.Peeeeeeeeeeero no me arrepiento, si pudiese darle más de cinco estrellas lo haría sin pensarlo.La trama atrapa, los personajes atrapan, la escritura de Adrienne atrapa, la forma en que todo transcurre atrapa... todo atrapa.No sé si entra entre el grupo de libros ligeros, no estoy segura. Pero si sé que es una lectura que atrapa, muy amena, divertida y con una escritura perfecta. No fue difícil perderme en ella, de verdad (tendría que estar durmiendo desde hace una hora y ajá, no pude, tenía que terminarlo).En fin, tienen que leerlo, en serio.Pd: Solamente recuerden que el final los joderá porque ni idea de cuando sale el próximo, jeje."}, {"userName": "Ellis", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/10165983-ellis", "userReview": "Disclaimer: I received this ARC in exchange for an honest review. I was not compensated for this review in any way and the only things that influenced my final judgement were my thoughts, feelings and overall love of angels and good humour.Usually I have my own little ratings system going on, but in this case, the Goodreads label says it best: It was amazing. It gets the full five stars from me.I'm always ready for a story with angels, and as of late I've been pretty lucky with what I've found. Angels are still popular in YA, but where they originally were just another creature involved in a forbidden love plot, usually because it tied them to the concept of the Fallen, it seems authors have decided to delve further into their origins and mythology without necessarily making it the reason why two lovesick teens can't be together. I can only applaud this. Look, I understand the allure of the Fall, and much of its material lies exactly in the fact that humans and angels decided to get it on, even though they weren't allowed to. Add to that the parallels that can be drawn with the Fall of Man, and you've got some pretty powerful stuff to work with. With that being said, this is not a story about the Fallen, and I'm actually glad it's not. Kress puts her own spin on angel mythology, but you can tell she has done her research and she incorporates it very well. What I was most excited about was the fact that she depicts angels as fundamentally inhuman creatures. Sure, there are some similarities between the species and the angels here can take on humanish forms, but they are not just people with a couple of shimmery wings. They are something different and, maybe the most important asset of any supernatural creature, they can never be entirely understood by \"mere\" humans. To be honest, the angels aren't even the most important part of Outcast. This is the story of Riley, the town she lives in and how the supernatural weirdness has affected her life. For six years now, angels have swung by each year to pick up some town folk and the year before the events of this book, they decided to kidnap Chris, Riley's best friend. Big mistake. Riley feels out of place in her community and Chris seemed to be the only person her age that accepted her. The rest just thinks she's weird. They don't get her sense of humour - which is, by the way, completely awesome and all kinds of hilarious - and they have a hard time with the fact that Riley is just brutally honest. Seriously, she doesn't have a filter and if people aren't completely put off by it, it surprises them to say the least. So, when that time of year comes around again and she spots an angel loitering around her house, this is what happens:I believe instinct took over because the shotgun fired in the opposite direction, and he disappeared.Good effort.\"I don't think sarcasm is helping your situation right now!\" I called out at no one as I racked my second round. The sound was comforting.He reappeared maybe ten feet away in front of me. I heard laughing in my head.You're strange.That's the last straw, buddy.\"Yeah, well, you're dead.\"And I shot that angel right in the face.I loved Riley and not just because parts of her reminded me of myself around that age. I think she's a very solid description of what many teenage girls go through, supernatural freakiness or not. She's very self-aware, which makes it hard for her to just go along with what everyone else is doing, and I recognise that. An example is the fact that she's not super skinny, and while she knows that's not a bad thing, she's still insecure of what others might have to say about it. She admits that there is a difference between knowing and the reality of things, and that felt very authentic to me. Riley really believes honesty is the best policy and she doesn't see the merit of censoring herself, but that doesn't mean she goes around insulting everyone and imposing her opinion just for the sake of it. You can easily follow her train of thought and she corrects herself when she feels she is too judgemental of people, but it doesn't get into territory where she's just internally monologuing her way through the chapters. The alternation between events, actions and Riley's inner life is balanced enough to make the whole believable and the reader really gets an idea of Riley's decisions and motivations.Then there is Gabe. He's the cheeky, charming teenage boy that so many authors want to write, but very few actually succeed in transferring onto the page. He's really nice and he challenges Riley enough without ever pushing his ideas or himself on her. The banter beween these two is delightful, which is another strength of this book. This is a fun read, but the jokes and the humour never come across as forced or trying too hard. To give you an idea of the hilarious impulses of some of these characters: at one moment, Riley and Amber are on their way to a houseparty and they come across the local Catholic priest, Father Pete(r). So like any normal teen, Amber just invites him to the party. Another example: Riley regularly swears in the presence of priests or just in the middle of a church. It was awesome and I definitely had some \"ooh\" \"aah\" moments while reading this.It is the combination of the Riley-Gabe relationship and the darker elements surrounding the angels and their effect on the town which makes Outcast a very poignant read. If you're a fan of the dynamics between Clara and Tucker in Unearthly or Penryn and Raffe of Angelfall and are interested in angel mythology that shares some elements with Daughter of Smoke and Bone, and if you don't mind a brutally honest protagonist and an extremely open end that will leave you heartbroken and asking for more more MORE, this just might be the perfect read for you.I loved it and if there ever was a book I wish was part of a series, it would be this one. However, I actually appreciate the fact that this is a standalone because it works very well on its own and it leaves enough to the imagination to be memorable. Many thanks go to Netgalley and the people at Diversion Books for providing me with an ARC of this."}, {"userName": "Kitty (I solemnly swear that I am up to no good)", "userReviewDate": "May 25, 2013", "userURL": "http://www.goodreads.com/user/show/16734001-kitty-i-solemnly-swear-that-i-am-up-to-no-good", "userReview": "Holy mother of Jesus Christ on a bicycle!! This book blew my socks off!This is a young adult book, part paranormal romance and part creep, dark urban fantasy. It is written from the perspective of a smart chick called Riley, not especially hot or ugly she is kinda your in-between average high school loner. The town she lives in is anything but average. Every year at the same time 'Angels' come down from the skies and grab people, what happens to them or why they do it nobody knows...most people see it as an honour.But when Riley's only friend is abducted a seed of mistrust is planted in her heart, so the next year when an Angel comes for her she shoots him in the goddamn face. Is he dead? Nope. Does he turn into a hot naked dude? Yup. Is it amazing? YES!To be fair I had read some good reviews but I did not come to it with exceptionally high expectations. It just sounded too cliche for me, HOW WRONG I WAS! This book was amaaaazing. It is a quick read, only taking me a day to get through and I resisted skipping the slow bits. In actual fact I didn't want to skip any thing and this is one of the things I loved most! Usually even if I really like a book I find myself skim reading, especially if there is a lot of action and I am emotionally invested in the out come, I just can't resist finding out. BUT with this book there wasn't any of that, but it was still addictive and intriguing.The actual best thing about this book is Kress's ability to build such a convincing world. All the characters are well developed, nobody is what you expect at first but it is all very convincing! The story of the 'angels' or what ever they are is great and the potential the plot has is amazing!Riley is one of the better young adult MC's I've read about in a while. She is well rounded and she does have her downsides. She is judgmental, self-depreciating, she can be selfish and conceited but she is also loyal, smart, strong willed and with a keener insight into things than most of the people in her town...I really enjoyed seeing the world through Riley's eyes. \"...logically I knew that today's standard was stupid skinny, but emotionally...look I was a teenage girl dealing with insecurities as much as the next person.\"Well yeah, I hear you, girl...this sorta stuff was refreshing. We see her do a lot of growing up in the book and some of it was awkward but mostly it was kinda cute or charming. Everything about Riley seemed healthy and normal...but then she started to become pretty kick ass and very much less than your average girl. However things really start to get good when Riley finds purpose in the grander scheme of things.The mystery of the angel abductions is slowly unraveled and while doing so Riley pulls together a team of misfits and one blonde girl in a cheerleaders uniform to train and to fight. It isn't overly cringe, unlike some teenage plots like this, it is actually just damn cool. You find your self really believing in the kid.Like at first you're just impressed she's standing up to them...And then once the training starts it gets pretty serious and exciting...And when the shit hits the fan it is all just like Fuck Yeah!So then I come to Gabe, the boy she shot in the face. Well he was just swell sweetheart. Totally perfect and their friendship/relationship was beautifully written and developed all the way through the book...RIGHT UP UNTIL THE END...THE END UGH....IT DESTROYED ME. Not only did i feel like it was rushed and confusing (I actually found the tenses confusing throughout the whole story, like is Riley narrating this with hindsight or in the present tense or whaaat?) Any way the ending was brutal.I almost want to warn people to wait until the series is finished before starting this book...It is very good and I trust that Kress is going somewhere great with her story line but...this book will make you feel things.I have heard a lot of comparisons with this book to Angelfall, however I found it more similar to Daughter of Smoke & Bone, and I hope this series will live up to this first books potential... I say potential because although I clearly loved this book it was not perfect, just very enjoyable!"}, {"userName": "Whitley Birks", "userReviewDate": "May 22, 2013", "userURL": "http://www.goodreads.com/user/show/5193512-whitley-birks", "userReview": "See this review and more at Whitley Reads.My Reaction: This was a very teenager book. And hot-damn, this book owned its teenager-ness. The focus and voice and general attitude of the novel was not only spot-on for teenagers, but was, I think, something that teenagers really need to see more of. The issues Riley thought about and dealt with were handled in a way that was true to her age, but while still giving them the proper “it’s cool, this is how teenagerhood is supposed to go” context. On the one hand, that made parts of the book very annoying for me. On the other hand, there’s all sorts of people who read YA, and this will be a perfect fit for many of them.The one major flaw in this book was what I call “Harry Potter Pacing.” The plot was good, but it was the kind of plot that should have taken up about two months. Three at the outside. Instead, the book insisting on stretching it out over an entire school year, which meant that characters had to stay ignorant of things until the proper time. So instead of looking into the mystery and trying to get stuff done, they…shrugged, went to school, and filled time with fluff and family drama. All of the scenes, taken individually, were pretty good. It’s just as a whole that you start to think “man, this is seriously dragging.”Highlights:•\tRiley was a delight. She was just the right balance of flawed and normal. She stood her ground when she needed to, and she showed her insecurities at other times, and she managed to even have teenaged break-downs while knowing that it was a teenaged break-down. And that’s great, because that’s part of being a teen, too: knowing that you’re being ridiculous, but not being able to stop because you’re a teenaged ball of hormones and ridiculousness. There were a few points where she seemed to be ignoring the plot and holding the idiot ball, but on the whole, I’m willing to blame those more on the pacing than the character.•\tLACEY FUCKING GREEN. I cannot express to you how much I adore this character. She took a very stereotyped cheerleader and gave her depth and nuance in subtle ways, showing her as an insecure, normal teenager with the same kinds of flaws as Riley, and she did it all with a few lines tucked in here and there. I hated Lacey when she showed up, because I thought she was just another same-old, same-old cheerleader antagonist. Two lines later and I was her biggest fangirl. Lacey made every scene she was in 1000 times better.•\tRiley’s first-person narration was enjoyable, witty, and easy to fall into. Very fitting for the character and the overall tone of the novel. I enjoyed the humor that was maintained even in serious scenes, the way it managed to be funny without taking weight away from the situations. •\tGabe started out as every horribly stereotype of a “fallen angel” to come out of this genre, but don’t let that scare you off. He cleans up good. He even manages to throw in some sex-positive stuff, as he’s a player but he’s also careful to make sure his flings want flings and are cool with that. I’m all kinds of okay with a guy who just wants fooling around and isn’t tricking anyone to get it. Girls like that sort of thing, too.•\tThe romance, while a bit too prominent for my tastes, is distinctly non-rage-y and mostly without problems.•\tThe set up to the idea of angels coming and being ignored by the larger world is hasty and poorly explained. There’s a few too many holes in that exposition, and it feels like a patch job that got rushed over so we could get to the good stuff. It wasn’t bad enough to throw me out of things, but still annoying.•\tThe ending was great! And…then the second ending was also great! I’m just confused as to why there were two. Events happened, and came to a natural conclusion, and then the book just kept on going. I wasn’t happy with the double-whammy, as I thought that either ending alone would have been stronger than both of them together. As it stood, a lot of the potential emotional punch was lost.Rants and Raves:Why is it that every book about angels ignores God? (Well, almost every.) It’s not like it would be that hard to just say “they’re magical creatures with wings that got mistaken for angels,” but no. Most of these books are talking about actual, literal angels. Abrahamic angels. And then God is completely missing from the picture. There’s usually not even any religious upheaval of characters going “OMG, so all that bible stuff is real?” Books, if you throw out angels and then don’t explain “no, wait, I mean my kind of fictional angels,” then you really should address God. Because if you don’t give us a new canon to work with, all we’ve got is the canon that says angels are messengers of the Lord.I’m not even annoyed at this from a religious angle; I’m annoyed that people are using a concept that already has plenty of lore around it and then they’re ignoring the lynchpin of all that lore. At the very least, the “human” characters should be aware that angels and God go hand-in-hand, and they should be curious about that. Leaving issues of God out of this feels like books are just hijacking and then watering down an existing mythology that lots of people believe in. Either make up your own canon, or bite the bullet and deal with the God question."}, {"userName": "Sandra ", "userReviewDate": "May 13, 2013", "userURL": "http://www.goodreads.com/user/show/5034547-sandra", "userReview": "Wow. That was simply stunning. With quirky story telling, this somewhat dark and creepy and often laugh out loud funny story is no Angelfall. And that's a good thing. In a small southern town, angels are said to be taking several young people once a year. No one has ever seen the angels, but every August, a few people disappear in the great taking. The town's minister has convinced the people that he's talking to the angels, and that their town is special. The good townspeople even built him a church. The author subtly reminds us of sheep mentality, when she describes the rising influence the minister enjoys, even going so far as giving him special powers on the town's council. I drew parallels to similar situations, where one person convinced the masses of his own goodness and people simply followed along because they didn't want to be seen as different. Riley Carver is one of the dissenters, ever since her almost boyfriend Chris (he of the first and only kiss) was taken the previous year. She's not attending the gathering this year, no sirree. She's angry and grieving, and sick of living in fear. And when an angel shows up in her yard, she takes her shotgun and shoots him straight in the face. I cheered and fistpumped, and I had only just started this book. When Riley realizes that instead of a dead angel, there's an unconscious, seriously hot and very naked guy lying in her yard, she does what any smart girl would do and drags him into her daddy's shed. All tied up, the guy comes to, confused because he thinks it's 1956. I was giggle-snorting at their witty banter. Riley gives as good as she gets and Gabe McClure is no shrinking violet either. As the story progresses and we find out more about Gabe and where he came from, the mystery about the angels and the yearly disappearances only deepens. I applaud the author for letting the relationship between Riley and Gabe progress slowly, and for avoiding the YA pitfall of instalove. Thanks so much for that.The angel and nephilim mythology is slightly twisted to suit the plot, but made overall sense. The author did a good job with world-building in this novel, and I didn't see any apparent plot holes. I was also quite surprised (and rather impressed) that the author used the standard mean girl (Lacy) and allowed her to become so much more than the stereotype, letting her grow into an integral part of the novel and the finale. Riley herself is a very complex and very well crafted heroine. She's dealing with grief and anger without the usual woe-is-me teenage can't-get-over-myself mentality, and she is also not afraid to admit to making mistakes and misjudging people. And brave. Wow, she sure is brave. She's a natural leader, resourceful, doesn't shy back from a difficult situation and completely defies the YA stereotype of the female teenager. It was quite a privilege to live inside her head for the duration of this book. Gabe is also portrayed as more than just a guy from the wrong side of the tracks. He's smart, even though he has no idea about technology beyond the '50s, and he's just as brave and self-sacrificing as Riley.Both characters grow throughout the book, in a way that doesn't seem forced or contrived. The progression of their characters made sense in the situations they faced, and even though Gabe has an Edward Cullen moment, Riley doesn't let him get away with it. The ending was unexpected, to say the least, and I really liked how the author chose to conclude the story. It was an ending that made me happy and a bit sad at the same time. Happy with the perfection of it, and sad that the book was over. There were a couple of things that were unrealistic, primarily Riley's mom's reaction to Gabe showing up at their house, and buying his explanation without verification. Her father isn't much different, just taking him at his word, despite never having seen him before. Gabe's reaction to being fast forwarded 50 years or so was also slightly unbelievable. He seemed very accepting of this fact, more so than I expected him to be. I thought he would have questioned it a bit more, instead of diving head-on into high school and working. I assume part of this was to establish his character traits, showing him as someone who's laid back and takes things as they come. This then does make sense considering his backstory. I did quite like the fact that the author let him speak in a way that fit the time period in which he grew up, and I giggle quite a few times when he said 'swell'. Oddly enough, nobody questions this, but I supposed that people sometimes feel a bit shy about bringing up someone else's differences, especially in the PC world we live in today. Then there was quite a bit of proofreading/editing that was missed. I'll forgive this in an ARC, but hope that these issues were addressed prior to publication. Overall, I very much enjoyed reading this book and would highly recommend it. If you enjoy a kickass heroine with an awesome sense of humor, and a riveting and slightly creepy angel tale, this is a book for you. I received a free ARC from the publisher via Netgalley. A positive review was not promised in return."}, {"userName": "JenacideByBibliophile", "userReviewDate": "Apr 28, 2016", "userURL": "http://www.goodreads.com/user/show/42974042-jenacidebybibliophile", "userReview": "I LOVE a good adolescent fantasy story, as I am sure a lot of you can relate with. This story centers around angelic creatures, an angel-crazed town, a young man with a lost memory, and a young girl who wants to find the truth behind it all. This is another one of those books that just hooks you in, and one you can’t put down until you have read the last word. It has been one year since Riley Carver lost her best friend and almost boyfriend, Chris, to the Taking. It has been six years since the first angels came from the sky and took people from her town, and this year it’s about to happen again. One day per year, everyone in Riley’s town gathers for a celebration called the Taking; which is when angelic creatures come down from above and take whom they please. But this year, Riley decides to stay home and not partake in the town’s delusional festivities; in which they think being taken by the angels is a good thing. Unfortunately for Riley, an angel comes for her. So naturally, she shoots the angel in the face with a shotgun. Now, all that is left of the angel is a naked boy, Gabe, with no recollection of being an angel. But to make matters worse, he thinks it’s 1956 still. Now Riley must get to the bottom of what is really going on in her town, and why so many people are being taken and never returned. I highly enjoyed this read, and wish there was about fifteen more to accompany it! The story-line does spin off of the typical good/bad angel vibe, and the Nephilim idea works into it as well, but I really liked what the author did with those ideas to make this read creative and different. The character of Riley is living in a town that has, over the years, become crazed worshipers of the angels that come and basically kidnap their loved ones. Of course, Riley and her family don’t think the angels are something to worship or to love. The character of Riley is very interesting. She is just sixteen, and has only been kissed once in her life. She is the epitome of innocence and awkward adolescence, but this girl has spunk! After a year of her best friend and almost boyfriend being taken, Riley starts to get back into the life she had put on hold. But when Gabe comes into the picture, it changes everything, and she finds out about a lot more than what the angels are there for. Speaking of Gabe. GOODNESS GRACIOUS! Ladies, we have a James Dean clone on our hands! Gabe is one of those male characters that you can just imagine as being dreamy and making your knees weak. I was constantly smirking at his wit and sarcasm, this character is AWESOME! If you can’t get into the character of Riley, you will definitely be obsessing over Gabe and his charming yet eye roll worthy self. There were a few things about the writing style that got on my nerves though. Though, as most books go, I stopped noticing it as I continued to read and got sucked into the story. This author took on a style where she was speaking through the character, but not giving complete sentences. Sort of like a train of thought, because as we know, sometimes they just aren’t complete. However, in a book I am NOT too keen on reading that. It was just bugging me to no end! Here is an example:\"We still looked at the angels like they were a bad thing, like those that were taken had died opposed to being chosen. Didn’t like the media taking advantage of that.” I figured maybe this was a typo, as there are a few tiny mistakes throughout the story. But this happens quite a few times, so I came to the conclusion that it was quite on purpose. For me, I NEED complete sentences. Unless the entire story is going to be random thoughts and discombobulation, DO NOT give me uncompleted sentences. Please. ;) Overall, I really really LOVED this book. The romance isn’t completely in your face the entire story, so it really focuses on the plot. I thought the characters were well-developed, and the idea was executed perfectly. I think this author could totally through in another few books (PLEASE) because I am addicted!"}, {"userName": "Ally", "userReviewDate": "May 23, 2013", "userURL": "http://www.goodreads.com/user/show/5720495-ally", "userReview": "Before I begin this review, I’d like to note the extreme distinctions between Outcast and Angelfall. If you think you will like this book because you liked Angelfall, you might be a little off base. Outcast is entirely its own story. It is not set in a post-apocalyptic setting, and is more like urban fantasy. Gabe and Riley are very different from Raffe and Penryn, but no less kick ass. And Outcast brings something new and unique (for me, anyway) to the angel paranormal genre. The beginning of this book earns a riveting 4-5 stars. The middle, 2.5-3 stars, and the ending 4-5 stars again. We lost the plot a little in the middle, with more focus on the relationship between Gabe and Riley. But the plot picked right back up and resulted in a bittersweet ending.To describe how much respect I have for Adrienne Kress, I’d like to tell a story. I attended university across the country, which is saying something when you live in Canada. I didn’t know anybody, and I was really nervous to be on my own for the first time. So naturally, the first person I befriended was my neighbour in residence, who just happens to be named after the male lead in this novel. Now, this neighbour had the unfortunate habit of  never  cleaning his room or showering, to the point where I could smell him when I opened my door. Honestly, his odour, coupled with his attention-seeking behaviour turned me off of the name ‘Gabe’ forever. When I realized that was the name of the male protagonist in this story, I almost stopped reading. After all, no one could make me attracted to a guy named ‘Gabe’, when all I could picture was my old neighbour. So I was pleasantly surprised when Adrienne Kress did just that. At first I found Gabe kind of annoying, especially when he dated every girl in the school and called Riley ‘sweetheart’ and ‘babe’ constantly. But then he really grew on me, and the author really managed to overcome my prejudice for the name so I could enjoy the sexiness that is Gabe. Anyway, I quite liked him as a character once I got over my initial quips. He was complex, not portrayed as a selfless gentleman nor as a selfish jerk. And he was just so darn cute!I also found Riley’s character to be interesting and refreshing. She wasn’t your stereotypical Mary Sue that has been plaguing YA and paranormal novels. Instead, she doesn’t care what anyone thinks about her, and doesn’t focus on how pretty she is/isn’t. Her narrating style is very blunt and matter-of fact, which took me a while to get used to. But she was very cool and kick-ass, especially when she’s shooting ‘angels’ in the face. She doesn’t take shit from anybody, and I really enjoyed that about her.How cruel of Adrienne Kress to leave us with such a bittersweet ending. There had better be a second novel, or I may just end up going crazy."}, {"userName": "Nafiza", "userReviewDate": "Apr 19, 2013", "userURL": "http://www.goodreads.com/user/show/2483439-nafiza", "userReview": "I just finished this book and I would like to take a moment and sigh. Yes, sigh because this was a good book and it hit me in all the right ways in all the places. I wish I didn’t have to speak about it because it is the kind of good that you want to keep to yourself. To savour it because somehow speaking about it brings home the point that it’s over and it’s gone and just, the story is done. I think it’s a standalone and for once I wish it wasn’t. I wish it was a series. Please let it be a series.I read Adrienne Kress’s debut and while I found the characters engaging, the plot didn’t much do it for me and so I didn’t finish it. For that reason, I was understandably wary about her sophomore work but the title is intriguing as is the synopsis and so when it popped up on Net Galley, I jumped on it. Also, Ashleigh Paige seemed to enjoy reading it and I was craving something YA-ey, so I thought, hey, read it, you have a two hour commute! So I did. Useless ramble aside, you guys, this book is fantastic.It’s an angel book and if you know me, you will know that I dislike angel books mostly. I mean, there is the odd one that will confound my expectations but I am just really burnt out on them and the authors have pretty much exhausted the mythology available for angels. Unless they go invent angel zombies or angel vampires (would that even work?), I don’t’ see them moving past Nephilims, Guardian Angels, Lucifer, Watchers and stuff like that. Anyway, so the mythological terrain was familiar in this one but it contained something new. Something different. Hard to believe I know but there you have it.Also, it has a kickass protagonist who is just…amazing. She doesn’t make me want to gouge out anyone’s eyes. Or kick someone in the balls. Or even scream. Not even once. That’s a good thing. Riley was one of the biggest reasons I enjoyed the hell out of the novel. Kress has this way of creating characters who are real, who act naturally and grow as the narrative unfurls. She also challenges stereotypes and turns them upside down on their head. Like where the mean girls trope is concerned. Kress totally took that and used it as a platform from which she launched her friendship plot. Which was a totally cool side-plot that I dug.I also like how the sneaky details are set in place so when the twist comes, it doesn’t blindside you. It is more like an unveiling and things fall into place with a click. Also, I love the romance in this one. I am not a fan of romances in YA novels because I often feel that they subsume the original premise of the story but in this one, I thought it was handled beautifully. I liked how Riley’s mother totally calls her up on letting boys dictate her life and I wish other mothers in other YA novels did the same. And the love interest, you guys, is a character in his own right. And he just made my heart catch and stutter in so many places in so many different ways. I’m still sighing over him. The ending is what made the novel for me. Funny as it may seem, it ensured that I will not forget this novel no matter how many others I read in the future.This book, to me, is what YA is all about. Hopeful, poignant and brave. Sure, it could have spent more time on the mythology and the ending sequence was a bit rushed but on the scale of things I really loved about this novel, the things that could have been done better are insignificant. This novel puts Kress firmly in my list of authors to look out for and if you like good YA that packs a punch, it should do the same for you. Strong recommended."}, {"userName": "Alexandra", "userReviewDate": "Apr 27, 2015", "userURL": "http://www.goodreads.com/user/show/32855174-alexandra", "userReview": "Well,what a waste of time!! It didn't work for me. Besides  Hush, Hush #1  that i really liked!! I suppose i'm not into angels. Or i haven't found the perfect book yet.There is nothing that happens that moves the plot along. I was immensely disappointed with the turn of events.And the heroine! Geez,she drived me crazy. Annoyingly-crazy! Another problem with this book was how utterly boring it was. I'm talking fall asleep whilst skim reading boring.I honestly struggled to read this,i even skipped chapters.I have to admit that yes,It had a lot of charming moments,and Gabe was amazing in the first 100 pages,but then again,he just bored me.I think he said sweetheart more than i can count. \"Look,Sweetheart,if you want to ask me out the asnwer is yes.\", \"Sweetheart,i'm the one who's all tied up,doesn't know where he is,who has some crazy girl threating to deprive him of his manhood,and you're the one who's crying?\" (okay,this one was funny) \"Sweetheart,you're nuts\" \"Sweetheart,i've been called many things,but i ain't angel\" For fucks sake,this is just from the first pages he is in.“Did you shoot me again sweetheart?”  IS THIS THE ONLY ADJECTIVE HE KNOWS?!! The side-characters are awful too,i didn't liked Lacy,i didn't liked Chris.I didn't liked anyone. And the angels theme,was okay but it didn't make me root for it. I think i like to suffer because why else would I put myself through so many terrible books?  Black Lies, Something Like Fate  ...Here,there's Damon,to make everything better :Some lessons you just never learn. Never judge a book by its cover. Especially when that cover is beautiful, cute, and intriguing."}], "description": "After six years of “angels” coming out of the sky and taking people from her town, 16-year-old Riley Carver has just about had it living with the constant fear. When one decides to terrorize her in her own backyard, it’s the final straw. She takes her mother’s shotgun and shoots the thing. So it’s dead. Or … not? In place of the creature she shot, is a guy. A really hot guy. A really hot alive and breathing guy. Oh, and he’s totally naked.Not sure what to do, she drags his unconscious body to the tool shed and ties him up. After all, he’s an angel and they have tricks. When he regains consciousness she’s all set to interrogate him about why the angels come to her town, and how to get back her best friend (and almost boyfriend) Chris, who was taken the year before. But it turns out the naked guy in her shed is just as confused about everything as she is. He thinks it’s 1956.Set in the deep south, OUTCAST is a story of love, trust, and coming of age. It’s also a story about the supernatural, a girl with a strange sense of humor who’s got wicked aim, a greaser from the 50’s, and an army of misfits coming together for one purpose: To kick some serious angel ass.", "title": "Outcast", "url": "https://www.goodreads.com/book/show/17774495-outcast", "average": 3.61, "cover": "https://images.gr-assets.com/books/1366204849l/17774495.jpg", "reviews": 380, "authors": [{"url": "https://www.goodreads.com/author/show/777907.Adrienne_Kress", "name": "Adrienne Kress"}], "type": ["Young Adult", "Paranormal", "Fantasy", "Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/17774495-outcast", "http://www.goodreads.com/book/show/18046035-outcast", "http://www.goodreads.com/book/show/5623269-the-friday-society", "http://www.goodreads.com/book/show/1687350.Alex_and_the_Ironic_Gentleman", "http://www.goodreads.com/book/show/3196330-timothy-and-the-dragon-s-gate", "http://www.goodreads.com/book/show/25268434-the-door-in-the-alley", "http://www.goodreads.com/book/show/35896551-the-reckless-rescue"]}