{"ratings": 39695, "userreviews": [{"userName": "mark monday", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "a slight but winning intro into a phenomenal series. this opening book follows the Drew children on summer holiday in Cornwall as they hurtle breathlessly from place to place, ancient map in hand and Arthurian treasure awaiting them as they skillfully avoid the forces of evil.this is probably my 3rd or 4th time reading this book, and this particular time found me more amused than impatient. once upon a time, a long time ago, I started this series by reading The Magician's Nephew and then The Dark Is Rising - and Over Sea, Over Stone was rather unimpressive to read after the intensity of those classics. but perhaps enough time has passed. the swift pace and uncluttered prose, the nonchalant realism of how the children relate to each other, the process in which the clues on the map are discovered, the mysterious Grey House, the pleasant atmosphere of Cornwall itself... I found it all to be quite charming. I appreciated the often ambiguous menace of the forces threatening the protagonists, in particular the idea of Evil wearing a pleasant, cheerful face while bringing you sandwiches or tucking you in for bedtime. this book also features Rufus, who is not just a good dog, but a smart dog as well. he knows something bad's afoot when owls hoot in the daytime. plus he is able to control his barking when necessary, for example when Evil is looking for him and the children as they hide in the grass. good Rufus!"}, {"userName": "karen", "userReviewDate": "Jul 02, 2010", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "how great is ariel?? ariel is exactly this great:i had never read this series, but had always wanted to. so ariel straight up mailed it to me! like santa! in june! ariel, i have also always wanted a choker made of rubies and emeralds and sweet sweet diamonds.while i am waiting for that,i will write a review for this book. obviously, there are going to be comparisons to that narnia series - british siblings shuttled off to a spooky house with secret passageways behind a wardrobe with an eccentric older relative and some christian mythology thrown in for funs.but.even better than narnia, this reminded me of my very favorite series of children's books by peggy parish (but not her amelia bedelia stuff - that just paid the rent). the better series of books were the ones featuring liza, jed, and bill (the only twins that are not evil). they had the best relatives who were always leaving them mysteries to solve in the form of secret notes and clues and maps and little carved wooden toys.... i believe i read all of them, but reading this made me want to read them all again and cross fingers that there was one i missed so i can go back and have an all new exciting adventure with my favorite detectives!!but i will finish this series,too, naturally.thank you ariel. i will go run to mailbox now.jewels!! they come!!"}, {"userName": "Rebecca McNutt", "userReviewDate": "Mar 25, 2017", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "This is a short yet fast-paced, exciting and thrilling middle-grade novel, definitely much more amazing than I initially thought."}, {"userName": "Ashley *Hufflepuff Kitten*", "userReviewDate": "May 09, 2016", "userURL": "http://www.goodreads.com/user/show/29787548-ashley-hufflepuff-kitten", "userReview": "4.5 starsI have to admit I wasn't expecting a lot from this book -- I thought it would be much more geared toward the middle-grade crowd and probably fall in with the books I would've loved as a kid but if I read them now I'd be bored. But! I was happily surprised (and by surprised I mean snagged hook line and SINKER by this brilliance).It starts out feeling very Narnia-esque; a family siblings go to stay with an eccentric uncle professor and then the kids discover a passage behind the wardrobe. Even if that wasn't the world's biggest Narnia nod, it's still clever and sweet. Once the kids found the map in the attic, it felt very Boxcar Children-esque (my favorite books when I was a kid). They have to work out the clues to solve this mystery before the bad guys get there first (and how bad they were -- creepers!) And by the halfway point it had just morphed into a full-on Grail quest and I'm over here fist pumping. :DSo yeah. If you put Narnia, the Boxcar Children, and Indiana Jones into a blender, this would be the amazing smoothie that comes out. It was so brilliant (especially Prof Lyon, OMG) and so fun and really unexpectedly creepy. There were several points where I found myself legitimately creeped out (the bad guys were EXCELLENT bad guys). The kids acted and sounded like kids. There were a few grammatical errors, quotation marks missing and things like that, but this was overall a really cool book. Excited for the rest because I looooooove Celtic mythology.Thanks tons for the recommendation, Meg! <3"}, {"userName": "Nick T. Borrelli", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/5427149-nick-t-borrelli", "userReview": "The first book of my all-time favorite children's fantasy series. Yes Harry Potter is amazing, The Chronicles of Prydain is exceptional, Redwall is pretty fantastic. But for my money, Susan Cooper's The Dark is Rising series ranks as my #1 favorite. It has everything - an Arthurian theme, witches, the Holy Grail, Celtic Mythology, fun characters, and the writing is just superb. It's no wonder these books garnered a ton of awards because it really does stand out like a shimmering diamond in the children's fantasy genre. I can't recommend this series enough."}, {"userName": "Jason Koivu", "userReviewDate": "Nov 17, 2016", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "A Nancy Drew-esque adventure in which some kids with the last name Drew attempt to find the Holy Grail. \"Another book on the Arthur legend?\" I groaned before commencing a hearty dismissive snore. I guess I didn't read the description close enough on Goodreads or on the back of the book. I knew it was YA, but expected magic. Even sampling of it. This was not the fantasy novel I was looking for.These days reading about three English kids romping around the Cornwall seaside in search of King Arthur's grail is just not my cup of tea. Don't get me wrong, it's a damn fine book! I think if I was growing up in the '60s when this was published, I would've been over the moon to get my hands on Over Sea, Under Stone. Now though, there's a plethora of much more fun fantasy to be had."}, {"userName": "Ben Babcock", "userReviewDate": "Jul 05, 2013", "userURL": "http://www.goodreads.com/user/show/1188122-ben-babcock", "userReview": "Over Sea, Under Stone reminds me of that endless string of ’80s and ’90s movies featuring plucky groups of child protagonists outwitting bumbling adult villains. You know the ones I mean—The Goonies is probably the most famous example, but there are others. Children get into real danger and use a combination of courage and clever planning to defeat the bad guys and save the day. In this case, Simon, Jane, and Barney work together to decipher a medieval treasure map that could lead to the Grail of Arthurian legend. They run up against a contained cast of characters all bent on acquiring the Grail for unspecified, but no doubt nefarious reasons—and they don’t think twice about stooping to the level of threatening children.Cooper obviously understands the ingredients needed to capture a child’s imagination. It’s evident in the way her characters speak and the way she describes their environment. From the beginning, the story has a fantastic, Narnia-like quality to it: an old house not their own, with a hidden world (in this case, a room) behind a forgotten wardrobe. The children find an ancient manuscript and decide it has to be a treasure map, a deduction later confirmed by their ephemeral Great-Uncle Merry, who keeps disappearing at the most inopportune times. The children begin working to decipher the clues on the manuscript and follow the trail they put down in order to find the Grail; meanwhile, they have to work hard to dodge the antagonists who dog their every step. Each chapter feels packed with adventure and a hint of danger.The mythology of a Celtic King Arthur pervades the story, which is set in 1970s Cornwall. It would be a mistake to pick up this book solely for this reason, however. Cooper uses the mythology as a backdrop and a reason for the quest, but she doesn’t explicate so much as signpost. Familiarity with Arthurian legend is neither helpful nor required, and aside from the romanticism such allusions allow, any historical connection might have done just as well. I was disappointed that Cooper couldn’t come up with a richer way of integrating the legends than she does.What impressed me more was Cooper’s dedication to deductive reasoning and methodical planning on the part of the children. Too many books pitched at young adults have shallow, even insipid plots that require little originality or problem solving on the part of the protagonist. The adventure usually consists of a series of physical feats, and the mental obstacles, if any, are tired and repetitive. Here, the children face a number of obstacles that they overcome through rigorous reasoning and ingenious innovation. For example, at one point they use a ball of cotton thread Jane has to hand to try to measure the depth of a hole they find. Another scene has them reasoning out how the relative placement of three standing stones on a slope affects their apparent heights, and thus the heights of the shadows they cast. By including these details and showing the children’s thinking process, Cooper exposes her younger audience to deductive reasoning. I devoured juvenile mystery series as a boy—Hardy Boys, Nancy Drew, and Encyclopedia Brown were among the best—and I could see myself enjoying this dimension of Over Sea, Under Stone.Alas, much like the movies this book resembles, the relentless, positive portrayal of the children and their adventure is far from satisfying. Every setback is quickly turned into a triumph; every apparent defeat is actually a victory in disguise upon further reflection. Though there is the hint of danger, it never really emerges. I can understand the appeal of this type of storytelling when pitched at younger readers, but I’m not overly fond of it. And I firmly believe it’s essential to scare kids once in a while. Though I can’t accuse Cooper of leaving out the conflict in this book, I wish it had been more fully developed. I wish the children hadn’t succeeded so easily. There is certainly plot here, in the form of adventure, but the story itself leaves much to be desired.I’m reading this as part of The Dark is Rising Sequence omnibus. As I write this, I’ve read both this and The Dark is Rising. I’m not quite rushing to add this to my nephew’s future reading list. Which is not to say the books are bad, or dull, or even particularly unimpressive. I enjoyed them. But they don’t achieve the intense highs or agonizing depths that I want from my books, young adult or otherwise. I can’t speak for whether younger me would have had a less critical opinion of them, sorry. And perhaps, at the time when they were published, this was innovative and inspirational. As it is, I think the market and genre have widened to the point where there are certainly more worthwhile stories in which children can immerse themselves. But if there aren’t, then I suppose this would do in a pinch.My reviews of The Dark is Rising sequence:The Dark is Rising →"}, {"userName": "Nikki ", "userReviewDate": "Dec 01, 2015", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "It’s time for a The Dark is Rising sequence readathon again! If you wish to join, you can do so via this blog. It’s the perfect time of year to reread the books, at least the second one in particular, with the winter solstice coming up. I always try and read them around this time of year!With that said, here goes my millionth (ish) review of Over Sea, Under Stone. I’ve noted before that it’s basically an Enid Blyton adventure/mystery story, with Arthurian trappings. This time through, I noticed a bit more than that; despite the fact that it is much lighter than the later books in tone, for the most part, there are moments of darkness and fear: the moment on the top of the cliff with the standing stones, Barney captured, Barney in the cave, the last few pages before the epilogue… Because of that link to Arthur, because of the figure of Merriman, the seriousness that we see later in the story is still there. The Dark doesn’t go away safely in the way that the criminals always do at the end of a Famous Five book.I think it’s partly that which makes the books survive for me — under the concerns of the children, there’s that darkness and fear.Another thing which gets me is how all the people act like people. Jane and Barney and Simon get scared, they get jealous of each other, they puff themselves up and act important… The adults are indulgent, complacent. And then there’s the poetry of the quiet moments, the moon on the water and the quiet dusty attic and… Yeah. Brilliant writing. Not as compelling as the later books, but even here it’s very fine.Originally posted here."}, {"userName": "Nikki ", "userReviewDate": "Dec 05, 2008", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "Very few people [who know me at all:] are unaware that The Dark Is Rising is possibly my favourite series of books in the history of ever. Still, I haven't done a series of proper reviews for them, which is a horrible shame, and I'm going to do that this time through.This is probably the fifteenth time I've read Over Sea, Under Stone, give or take a few times. Someone I knew recommended skipping it, since it's the most childish book in the series -- written, if I recall correctly, well before the other four, and most definitely aimed at kids. The scenario reminds me a little of a faintly Arthurian Enid Blyton story: three kids are on holiday and stumble into a mystery. On the other hand, it's much fuller than an Enid Blyton story. It's a fantasy story, at its most basic, really: the Dark vs. the Light. There's hints at an underlying story about King Arthur.Character-wise, at this point it's relatively simple. Simon, Jane and Barney are pretty typical kids: the bossy older one, the practical and prepared girl, the youngest daydreamy boy. Still, they're endearing: Barney would have had my heart from the moment he opens his mouth and calls his big brother \"cleversticks\" -- if he hadn't had it already from being as devoted to King Arthur as I am. They may be simple characters, but they're also realistic. They get scared about what they're getting into, they doubt things, they underestimate the danger...The writing itself is lovely. Not too fancy, and yet still describing things well. There's a real sense of ominous danger in parts of it, and yet the writing also brings across a feeling of childhood, summer vacations and sunburns and going to see the sea.All in all, reading it now and knowing what the rest of the series is like, I look for the hints and things that will connect up, later. Something I've noticed this time through especially is the hints at Barney being something special, which is followed up on in Greenwitch and Silver On The Tree. It's interesting how often he knows or intuits things which seem hidden from everyone else.Over Sea, Under Stone isn't my favourite book of the sequence, but it's still worth reading if you can get into it for the light it sheds on the later books.Now, onto The Dark Is Rising itself! Spending a book with Will and the other Stantons feels like a lovely idea right now.Reread again in December 2009. Oh, Barney Drew..."}, {"userName": "Lightreads", "userReviewDate": "Dec 28, 2008", "userURL": "http://www.goodreads.com/user/show/1836077-lightreads", "userReview": "I am on a serious childhood nostalgia bender over here. Let that be a warning to you.This series came back to me like a bolt from the blue on a perfectly normal day last week, and I suddenly had to read it right now. But, fantastic, no problem, I thought. When I originally read these books -- and read them, and read them, and read them -- it was on cassette. The good old National Library Service for the Blind cassettes in their snap plastic cases. And the NLS has been busily digitizing the collection (only about a decade late) and I could swear I saw these books go up . . .Indeed. The NLS had digitized four out of the five, and I was sure I could ahem find Greenwitch on the back of a truck in one of the internet's ahem alleyways. So I snagged this first one and put it on my handheld and trotted off to groom the dog.And then I turned on the book.And it was not my narrator.I remember her very clearly: she was British, a contralto. A gentle delivery, but with a lot of life for the children, particularly Barney, and even more gravitas for Gumerry. She read this book to me a good twenty times between the ages of eight and thirteen, and she was all that is right and proper.And sometime in the last few decades, the NLS re-recorded the books and reissued the titles. Those old cassettes were wearing out, I'm sure, even the master copy.And it was not okay. He was American, and he was doing his best, I'm sure, but he was not right. Which consumed my attention for the entire book, so I don't actually have much to say aside from outraged nostalgia. This is younger and lighter than I remember. A quest story with cartoonishly simple us/them dynamics and some cute kids. Reminded me a startling amount of Arthur Ransom, because the whole thing had that quality of taking place in a bubble of childish creation, where great adventures happen and then you have tea. I was also interested to see the near-total lack of magic here, given the scope of the powers at work. Made me think about the work the rest of the series does to make sure the Drews, the mortals, remain separate. Three from the circle, three from the track. How that matters to these books in ways I'm still unpacking. But that's a subject for a later book.But the narrator was wrong."}, {"userName": "Barb Middleton", "userReviewDate": "Aug 24, 2013", "userURL": "http://www.goodreads.com/user/show/4361541-barb-middleton", "userReview": "I wanted to like this but couldn't sink my teeth into the plot or characters. Jane, Simon, and Barney, go with their parents to Cornwall to visit their Uncle Merry. The three explore the old grey house and discover an ancient map that puts them on the quest for the Holy Grail. The forces of Dark want the map too for its unlimited power and with the help of Uncle Merry it is a mad race to see who can find it first. The threesome are not sure who is good or bad and their innocent trust oftentimes leads them to dangerous situations. Not that the kids know the situations are dangerous. That's one thing I liked about the characters. They are kids with short attention spans who forget about their quest because they are distracted by a carnival or want to lay out in the sun. Their imaginations interfere with their focus at times and it is endearing and also diffuses what might scare some. Others might find it annoying because it slows down the plot and as a reader you might be tearing your hair and shaking the book saying, \"What are they thinking? They have to hurry or the bad guys will get there!\" I found myself more annoyed with the tension technique that comes from the kids or adults misleading the three kids on purpose or people miscommunicating with each other. This was used too many times and it is something I'm biased against. For instance, Jane should be telling Uncle Merry, Simon, and Barney about the vicar and his interest in the map but she doesn't because she doesn't think it is important. She's pretty bright through most of the story so I'm not buying that reasoning. Later, she makes the connection and it is pretty obvious the device was used to move the story forward. This happens again with other characters such as Barney and Mrs. Palk and I found it contrived and boring after awhile. The setting has great descriptions and its easy to imagine this village on the harbor. The villains are one dimensional. They represent the Dark and sometimes appear nice and fun to the three kids. This is a good reminder that not everyone can be judged by outward appearances. The parents in the story are oblivious to what is happening with their kids and the quest. I wasn't quite sure why one villain had more power over the flunkies who served him. Perhaps the sequel will explain more of their relationships.Jane is more stereotypical of a girl raised in the 1970's. She objects to her brother's dirty hands, wants to please those around her, it a bit of a sissy on the adventure having to be carried because she's so afraid, carries a spool of thread in her jacket, and who wants to tell parents about old manuscript. The mother is also presented as the stereotypical flakey artist. I did enjoy the voice of the characters with a Cornish accent, especially how they always said, \"midear.\" The plot was predictable and the clues weren't very interesting. The fantasy elements are all there in this book, it just didn't grab my interest. I'm going to read book 2 because it won a Newbery award. Cooper must have nailed it better than this one. I'm sure hoping so!"}, {"userName": "Cherie", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/6460330-cherie", "userReview": "I really enjoyed this story. I know that it is aimed a young reading group, but it was exciting and fun. There was enough mystery and danger to keep me wanting to listen. I am looking forward to the next book in the series to see what is next in store for the Drew children and their Great Uncle Merry."}, {"userName": "David", "userReviewDate": "Apr 05, 2010", "userURL": "http://www.goodreads.com/user/show/3335664-david", "userReview": "It's been many, many years since I first read this series. It was one of my favorites as a child, so I just recently bought the boxed set to work my way through it again.Over Sea, Under Stone is, if I recall correctly, not really part of the main series, being more of an introduction to the war between Light and Dark, with few of the characters appearing in the later books, except of course for Merriman Lyon. I remember even as a kid thinking that this was the least interesting book in the series, and rereading it as an adult, it was decent light entertainment, but very much a fairly typical children's adventure. Three pre-adolescent children, Simon, Jane, and Barney, visiting a Cornish seaside town on vacation, are caught up in an adventure when they discover a mysterious map, which their Great-Uncle Merry tells them is a clue to a priceless treasure that Must Not Fall Into the Wrong Hands. The justification for the wise and ancient Dumbledore figure letting three kids get themselves involved with a battle against the forces of darkness that they barely understand is a bit thin, but it's typical for this kind of book.These early depictions of Merriman (who is the only character of major importance in the later books) and relatively banal servants of the Dark are a gentle easing into the series for younger readers. There isn't much in the way of magic in this first book: supernatural elements are only hinted at. The kids are plucky and clever about gathering clues and finding the MacGuffin, but mostly they benefit from nick-of-time rescues and the reader's knowledge that even minions of evil won't really hurt children in a children's book. But for all that, it's a fairly intelligent book and draws on old Arthuriana and ancient history, so definitely one I can recommend to kids who are willing to read a book that's rather more thoughtful than exciting.I'm going to plunge ahead into the other books, but with the hope that they pay off, and that this first book isn't an indicator of the entire series being simply not as interesting and fun as it was when I was twelve."}, {"userName": "Nikki ", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "It'll surprise no one who knows me that I'm rereading this set of books at this time of year: Over Sea, Under Stone is more of a summer book, I suppose, but the one most rooted in a particular time of year is The Dark is Rising, the second book, in winter. (The runner-up would be The Grey King, set in the autumn around Samhain.) So I imagine that a few more reviews of these books will be added to my total before the end of the year...I read Over Sea, Under Stone in one go, this time. There are still a couple of things that bother me, aside from the Enid Blyton-esque tone of the boys-own-adventure stuff. Like, why would Merriman leave them alone up on top of the hill? Why wouldn't he ask more questions about who is attacking them? Why --But it's probably best not to ask those questions of this book, the earliest and least subtle. There are many subtle touches which I love later in the sequence, but this book is decidedly less mature. Which is not to say that it doesn't have some very powerful sections: the last two chapters have an unbearable build up of tension that gets to me even at twenty-four years old. Mostly, I love that the characters feel real, squabble and support each other and have fears and weaknesses like real kids, real siblings. Simon's such a superior brat, but he's the more real for it. Jane's a little bit stereotyped, I think: she's more easily frightened than the other two, carries around \"practical\" things like a roll of cotton (but no mention of a sewing kit of any kind?), isn't interested in male pursuits like fishing and sailing, etc. But even that isn't so bad -- she's not Blyton's Anne or George, but something closer to a rounded individual.(Has anyone written an essay where each member of the Famous Five reflects a facet of a single psyche, or something? Because I just came up with that idea on the spot, and I'm too lazy to explore it myself.)And, finally? Barney's \"cleversticks\" is still the best pseudo-insult ever."}, {"userName": "Laura", "userReviewDate": "Apr 26, 2008", "userURL": "http://www.goodreads.com/user/show/999233-laura", "userReview": "On vacation with their Great Uncle Merry three young children stumble upon an old map and suddenly they are thrust into an adventure they never could have imagined.The beginning was a little slow getting into it and I even considered discarding it, but as I trudged along through it I found myself getting more and more intrigued. It had a feeling of The Chronicles of Narnia mixed with Nancy Drew, making it suspenseful, but fitting into the Fantasy mold. I wanted to read it because of the recent movie, \"The Seeker\" which is based upon the second book in the series, \"The Dark Is Rising\". I also wanted to read this series because two of the books have won Newbery Medals/Honors. Once I was half-way through the book it felt like I was pedalling downhill on a bicycle, it was getting harder and harder to put the book down because I was so anxious to see how it would turn out. The ending was a slight letdown, but I didn't feel as if it took away from the book, it was realistic. I'd recommend this book for young readers, as a young adult, it wasn't as thrilling as it might have been if I had been younger when I read it.*Taken from my book reviews blog: http://reviewsatmse.blogspot.com/2008..."}, {"userName": "Richard", "userReviewDate": "Sep 15, 2015", "userURL": "http://www.goodreads.com/user/show/6014887-richard", "userReview": "This book is the first of a series. It has a weird family resemblance to the Chronicles of Narnia: some children explore a mysterious old house while on holiday by the Cornish seaside. There is even a wardrobe, albeit not one that functions as a conduit to a magical world. The book seems to start off somewhat slowly but builds up to a very tense climax near the end, as Simon, Jane and Barnabas Drew grapple with the powers of evil aided by Great-Uncle Merry and a lovable dog named Rufus."}, {"userName": "Stephen", "userReviewDate": "Oct 14, 2008", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "2.0 to 2.5 stars. A well written, original fantasy story. While written for a younger audience, it is in no ways condescending to them. First in the \"Dark is Rising \" sequence, this book introduces readers to the ages old battle between the Light and the Dark. Not a bad read."}, {"userName": "Kaitlin", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/19126246-kaitlin", "userReview": "This book was bad... Really bad. I think maybe if I had read this as a young child it wouldn't have bothered me, but reading this as an adult it wasn't a good read....I picked this book up as a recent Magical Space Pussycats read and I had hoped to enjoy reading a kid's fiction for once. Unfortunately this story really suffered from prejudices and poor writing so I found myself getting more and more frustrated page by page.In this story we not only see three young British Middle-class children making fun of the working class, anyone foreign, anyone gay and anyone even remotely different, but we see them doing so completely obliviously. These three children aren't 'bad', in fact they are the 'heroes' of the book, but the problem of the time it was written (60s) is that a lot of people (clearly including this author) held many of these prejudices themselves and had no issue writing these into their own works.This is a story following three kids who go on an adventure to the coast and they stay in a very old house owned by their Great Uncle Merry. Whilst there they discover a map which they think will lead them to the Holy Grail of King Arthur so they follow the clues and try to find out where it leads. For me this wasn't a good read and I definitely won't be reading more in the series or by this author. Sadly there are many other books from the 60s which are much, much better in terms of plot, writing, and not being entirely phobic of everything. 1* overall - wouldn't recommend."}, {"userName": "Mathew", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/42270985-mathew", "userReview": "It was an absolute treat to revisit this book and begin again on the Dark is Rising journey. There is much to like about Cooper's writing, her characters and sense of place are strong but deep within the veins of the words is this sense of a connection with our history and heritage. I'm a suckler for anything with monoliths and megaliths in and this was is full to the brim. Not only that but much like The Weirdstone of Brisingamen, there is this search and connection with an ancient past that I love so dearly. There is also a deep sense of fear here in the character of Mr Hastings and the battle between good and evil here is not a simple one nor one that speaks down to the child reader. Instead, it is rooted in something more primal. Although some of the language and dialogue between the characters may have dated somewhat, the story still beats truer than most."}, {"userName": "Orinoco Womble (tidy bag and all)", "userReviewDate": "May 12, 2016", "userURL": "http://www.goodreads.com/user/show/20738920-orinoco-womble-tidy-bag-and-all", "userReview": "Three stars from the adult me. When I first read and raved about this series (or as much of it as I could find when I was in middle school--I think I never got hold of Vol 5), it would have been a solid five--or perhaps 7! I was King Arthur-mad in those days, and \"fantasy fiction\" was a relatively new phenomenon in my environment. The story of three siblings (and a dog) who search for the Holy Grail in Cornwall, dodging bad guys as they go, was just my drop in those days. I didn't remember anything at all about it when I came across it again, so it was like an unknown book, except I remembered loving it.It's still well-written, and in its way a rattling good yarn--but. There's a definite smell of The Famous Five about it when I read it now. Mom and Dad are never around; Mom's a painter, so she's either shut up in her \"studio\" or off painting somewhere on the coast, and Dad? Well, Dad is just sketched-in, but mostly he's off fishing, or acting like a big kid. They even have a borrowed dog, a big bouncy mutt called Rufus who apparently \"came with the house!\" We're never actually told how old the kids are, I figured probably between 10 or 11 and 15, the cut-off point for getting all excited about treasure maps and legends of the Maltese Falcon sort. I suppose not stating ages would help young readers identify more? At this reading, I noticed that it's mostly Simon and Barnabas (the boys) who do the running, the dodging, the rescuing--and even most of the searching. Jane mostly thinks. Oh, she comes up with some very useful ideas and answers, that send her brothers crashing off to do stuff. But she mostly stands or sits and waits for them to come back. They need her, but in a passive tarry-by-the-stuff role. (She does go out at night a couple of times--with Simon and Uncle Merry; yeah, girls can't/shouldn't act on their own, I guess.) However, the book was published in 1965, and possibly written before then, by a woman born in 1935, so her gender-roles were probably pretty fixed. This also assures it's a good clean adventure, though the end is rather truncated, I felt. We go from the hugely exciting (for kids) adventure at sea scene to a leap into the future--how long? never told--and nothing in between.And of course the adult me figured Uncle Merry out in the first chapter, the first time he refused to answer a direct question and put that faraway Eagle-on-a-crag look on his face.It strikes me that I probably only read this once, back in the day. True, there were more volumes to the saga, but it says something if you're me. I enjoyed it then, but the fact that I remembered nothing at all about it tells me it made little lasting impression. It wasn't the crashing comedown that some childhood re-reads have been, though."}, {"userName": "Paul", "userReviewDate": "Jan 26, 2014", "userURL": "http://www.goodreads.com/user/show/3643002-paul", "userReview": "\"Over Sea, Under Stone\" is the first of five books in Susan Cooper's classic \"The Dark is Rising\" sequence. In it, three children on holiday in Cornwall stumble upon an ancient map, and quickly find themselves embroiled in a race against both time and the forces of The Dark to find an ancient treasure. Aided by their mysterious Great-Uncle Merry, Simon, Jane and Barney can only depend on themselves, as familiar faces turn out to hide menacing intent, and the sunny shores of their vacation spot conceal unexpected dangers.For readers of modern young adult fantasy fiction, many elements of \"Over Sea, Under Stone\" will seem familiar, but this is truly one of the originals. The characters are particularly well-written - with each capable of making both mistakes and heroic effort - and there is a realism here that is uncommon.That said, the author, a reporter at the time, wrote this novel in her spare hours at the urging of a colleague, not knowing then that it would soon become a quintet of volumes describing the arc of a larger story. As a result, many readers will perceive that \"Over Sea, Under Stone\" is essentially an introduction to the battle between The Light and The Dark, and it is the succeeding volumes - which include both a Newbury Honor winner and a Newbury Award winner - that truly make this series worthy of the esteem in which it is held."}, {"userName": "Nikki ", "userReviewDate": "Dec 02, 2012", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "I don't know how many times I've read this book, but it's a good candidate for the argument in the Feedback forums for sorting out multiple read dates -- I must've read it at least twenty times, I suppose, and one day I'm going to run out of editions on GoodReads to shelve. Never mind.I really have nothing new to say about this book, of course: it's comfort reading of the first order, for me. I think I used to say that as this is the most childish book of the sequence, it can be skipped, but honestly, I don't know that it can. It introduces four of the six main characters we see at the end, and gives a unique view on things that we don't get again -- an innocent sort of view, which Will and Bran never have. The struggle between Light and Dark from the outside, from an ordinary person's point of view... whereas in the next book Will is a part of it; he couldn't escape it if he wanted to.And there are really good bits, and it's well-written, and Barney is so adorable that all in all, I really can't recommend skipping it."}, {"userName": "Ashlee Willis", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/14060160-ashlee-willis", "userReview": "My 8 year old son would have given this book a higher rating I am sure. I think he must be more patient than I am. But I had trouble making it through this book for some reason. From the too-drawn-out events that happened in the story, to the maddening way the children had of foolishly doing the exact wrong thing time and again, to the author's attempt to utterly drown the readers in adverbs...I was ready for this book to be over when we were barely halfway through. That being said, it wasn't a particularly BAD book....it just missed so many ripe opportunities to be more exciting than it was! As it is, I am afraid I found it rather bland. My son insists that we finish the series, so I suppose we will. But I don't have high hopes of being captivated by the following books anymore than I was with this one."}, {"userName": "Maree", "userReviewDate": "Aug 19, 2011", "userURL": "http://www.goodreads.com/user/show/5001811-maree", "userReview": "This is a great kid's book. I'm really surprised I've never read it before, actually, and now I really want to finish the series. It's a really typical story in that the kids find a treasure map and get to it. But it's got the more serious aspect, a fight against evil, buried in the history of King Arthur and his fight. I'm also a fan of Arthurian legend, so it was neat to have that side of the story as well.The real thing that made me like this book was that I was actually worried for them. I was yelling at the kids in the book to keep their voices down, or to hide the map, because I was so concerned that the bad people hunting the treasure were nearby. That's the mark of a great book, in my opinion, especially with me at my non YA age these days."}, {"userName": "Rosemary Atwell", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/15847499-rosemary-atwell", "userReview": "I've been wanting to read this series for many years and the book is a perfect escape from stressful uni study! I really enjoyed the brisk, engaging writing that vividly described this lovely part of England and I wanted more than anything to follow Barney, Jane and Simon as they moved from harbour to rocky outcrops to little bays and beaches in search of the Grail.It helps if you're familiar with the Arthurian legend and Merlin, but really anyone can enjoy this timeless adventure story and, let's face it, any book that features a group of children, a rented holiday house and a dog are destined to an adventure or three. If you've read too many Bookclub tomes or simply want to rediscover your inner child, come in here and enjoy."}, {"userName": "Michelle", "userReviewDate": "Sep 26, 2007", "userURL": "http://www.goodreads.com/user/show/423274-michelle", "userReview": "I still can't quite believe I missed these books when I was a kid. They are so up my alley.This is the first book in the series, which I didn't know until I'd already read the second one (The Dark is Rising). But really that's ok because this book involves an entirely different set of kids.One of the things I like best about these books is that they stand the test of time. They don't feel particularly dated, which is really nice.And I also like all three of the children in this book. They're smart and they think for themselves. Still making my way through the entire series. I'm at the mercy of the library system."}, {"userName": "Rachel (Kalanadi)", "userReviewDate": "Jan 10, 2014", "userURL": "http://www.goodreads.com/user/show/17810287-rachel-kalanadi", "userReview": "I loved Over Sea, Under Stone when I first read it as a kid. It was coincidentally during my big Boxcar Children/Nancy Drew/Hardy Boys phase, so you can see that another story about kids following clues and finding long lost treasure would appeal so much at the time.Well, upon rereading for the third time, and the first as an adult, I can say it was a pretty simple, decent book, and I prefer all the later books in the sequence more. I also think it shows its age more than the others... there are some specific scenes when kids say some things that reflect attitudes of the time, and yeah, it doesn't sound so great now. Fortunately, the next book (The Dark Is Rising) is a huge improvement!"}, {"userName": "Samantha wickedshizuku Tolleson", "userReviewDate": "Jun 09, 2009", "userURL": "http://www.goodreads.com/user/show/2237173-samantha-wickedshizuku-tolleson", "userReview": "SSSSSSOOOOOOOOOOOOOOOOOOO SLLLOOOOOOWWWWWWWWWWW!!!!!!!!!!!I've had to restart the book three times.It has taken me quite a while just to get to the point that I'm at. GIFSoupI will give Cooper credit that is due. The adventure is interesting, but it is so dragged out."}, {"userName": "Amy", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/8231627-amy", "userReview": "Reread - love! ♥️♥️♥️♥️"}, {"userName": "Corey", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/13689523-corey", "userReview": "Clever, funny, very well written, and at times well nigh epic.This was in the Juvenile section of my local library. I'd wager it's nowhere near as juvenile as half the books in the Adult Fiction section."}], "description": "On holiday in Cornwall, the three Drew children discover an ancient map in the attic of the house that they are staying in. They know immediately that it is special. It is even more than that -- the key to finding a grail, a source of power to fight the forces of evil known as the Dark. And in searching for it themselves, the Drews put their very lives in peril. This is the first volume of Susan Cooper's brilliant and absorbing fantasy sequence known as The Dark Is Rising.", "title": "Over Sea, Under Stone\n      \n          (The Dark Is Rising #1)", "url": "http://www.goodreads.com/book/show/11312.Over_Sea_Under_Stone", "average": 3.86, "cover": "https://images.gr-assets.com/books/1443993959l/11312.jpg", "reviews": 1895, "authors": [{"url": "https://www.goodreads.com/author/show/7308.Susan_Cooper", "name": "Susan Cooper"}], "type": ["Fantasy", "Young Adult", "Fiction", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/11312.Over_Sea_Under_Stone", "http://www.goodreads.com/book/show/28615.Over_Sea_Under_Stone", "http://www.goodreads.com/book/show/896455.Over_Sea_Under_Stone", "http://www.goodreads.com/book/show/13321000-over-sea-under-stone", "http://www.goodreads.com/book/show/7069906-over-sea-under-stone", "http://www.goodreads.com/book/show/423120.Over_Sea_Under_Stone", "http://www.goodreads.com/book/show/1248128.Over_Sea_Under_Stone", "http://www.goodreads.com/book/show/9601780-over-sea-under-stone", "http://www.goodreads.com/book/show/17278239-over-sea-under-stone", "http://www.goodreads.com/book/show/210329.The_Dark_Is_Rising", "http://www.goodreads.com/book/show/222576.The_Grey_King", "http://www.goodreads.com/book/show/11313.Silver_on_the_Tree", "http://www.goodreads.com/book/show/24963.Greenwitch", "http://www.goodreads.com/book/show/11306.The_Dark_Is_Rising_Sequence"]}