{"ratings": 18016, "userreviews": [{"userName": "Evgeny", "userReviewDate": "Nov 18, 2015", "userURL": "http://www.goodreads.com/user/show/9340136-evgeny", "userReview": "After I finished the previous book of the series my reaction was, \"Where the heck is Cowardly Lion and more importantly Dorothy?\" I am an adult of twenty first century, but the reactions of kids of the early twentieth century were very similar. In fact L. Frank Baum admitted this in the preface for this installment. And so the author had to include these in this book somehow. He did, which gradually lead to overpopulation of the Land of Oz in the following books: more characters were introduced, but all of the ones from the previous books had to have some screen time. Anyway, Dorothy accompanied her uncle on his trip to Australia. Their ship ended up in a huge storm with captain ordering all the passengers to stay inside of their cabins. What is the first thing Dorothy did when left alone? She went outside to be promptly washed overboard. Luckily for her instead of drowning she managed to reach dry land which also happened to be quite close to Oz. She hoped people of Oz would help her to get back to her uncle. For me this tale was a definite improvement from the previous one. There were no inconsistencies and plot holes that plagued The Marvelous Land of Oz. I hesitated between 3 and 4 stars as I read the book and ended up with a lower rating for two reasons.Dorothy acquired godawful accent. What the heck happened? She did not have one before. Why oh why did she begin speaking like a hardcore hillbilly when she became a little older? Everybody's favorite ruler of Oz, Ozma is plain arrogant. She came to a foreign land to ask its ruler for a favor and she demanded an audience. Really? I guess just asking for it is below her. This girl is supposed to be a model for impressionable young girls. Other than these problems the book was good enough. You will have interesting adventures and meet interesting characters: Billina is good and so is Hungry Tiger, but Tik-Tok feels like a slightly altered Tin Woodman. My final verdict is the following: if you like book 2, this one is worth reading."}, {"userName": "Jason Koivu", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "The original title for this was...Ozma of Oz: A Record of Her Adventures with Dorothy Gale of Kansas, Billina the Yellow Hen, the Scarecrow, the Tin Woodsman, Tik-Tok, the Cowardly Lion and the Hungry Tiger; Besides Other Good People too Numerous to Mention Faithfully Recorded Herein.You gotta think Baum was just fucking with his readers at this point. L. Frank Baum: Full-Time Author, Part-Time PrickThis time around Dorothy is on a voyage to Australia to help soothe her Uncle Henry's rattled nerves (running a farm with hair-brain, heartless, cowardly help will do that to you!) when a storm washes her overboard. She ends up in a fairyland, as per usual, and from there her journey takes her on an adventure, which does not quite live up to the epic nature of the well-known film, The Wizard of Oz, but is entertaining nonetheless.Along the way she meets many interesting and fun new characters like Tik-Tok the wind-up machine, a many-headed princess, the subterranean Nome King, and my favorite, Billina the smart and sassy talking chicken. As that ridiculously long subtitle suggests, Dorothy also reunites with her old pals from her previous adventures. The story drags occasionally and the plot is not masterly. Seldom does the action near nail-biting excitement. It's Baum's inventive character creations that are the real draw. He's also good at sprinkling into his dialogue some clever double entendre and light gibes, though his intended victims probably barely smarting from the ineffectual attacks.Baum knew his audience was young and female, and while his stories can be enjoyed by all, there is definitely a feminine leaning. The female:male ratio of characters is heavily in favor of women, or more specifically, girls. The main character is a girl. The rulers of the fairylands tend to be princesses. The wizards are often women and, you may recall, the one male wizard turned out to be a fraud! Quite frankly I think this is a refreshing kind of world-building for its time!Rating Note: This feels more like 3.5 stars."}, {"userName": "Tabby", "userReviewDate": "Jun 13, 2016", "userURL": "http://www.goodreads.com/user/show/3982894-tabby", "userReview": "So im reading all the Oz books plus the side books but feeling a little sick so review to come when i'm feeling better"}, {"userName": "Obsidian", "userReviewDate": "Feb 18, 2015", "userURL": "http://www.goodreads.com/user/show/35942740-obsidian", "userReview": "[Probably because in book two we find out that the Wizard of Oz hid the Princess of Oz and gave her to Mombi who changed her into a boy named Tip.  (hide spoiler)]"}, {"userName": "Akiko", "userReviewDate": "May 20, 2017", "userURL": "http://www.goodreads.com/user/show/64517461-akiko", "userReview": "3.5-4 stars I enjoyed book one and two of this series better.Dorothy is on a ship with her uncle, headed to Australia, when a storm hits and she ends up going overboard with a hen (Billina, originally named Bill). The two unlikely companions wash ashore and have an adventure together, meeting the less than ferocious Wheeler creatures, a copper man named (Tik-Tok), a vain Princess of the Land of Ev (missing a rightful queen) who wants to trade Dorothy's head with one from her sprawling collection (head 17 being particularly terrible), and the cruel Nome King who enjoys turning people/creatures into ornaments. Old friends from previous books in the series show up too.I would have liked more Ozma, she was more of a secondary character.Another fun story in the series."}, {"userName": "Stephanie", "userReviewDate": "Jun 18, 2009", "userURL": "http://www.goodreads.com/user/show/1006484-stephanie", "userReview": "I just finished reading Ozma of Oz, third book in the Oz series by L. Frank Baum. There was a funny quote near the end. Ozma, speaking to Dorothy, says, \"You see, in this country are a number of youths who do not like to work, and the college is an excellent place for them.\" There are a number of such youths in our country today!I like the Oz books quite a bit so far, although I was a little distracted by the way Dorothy spoke in this book, leaving out vowels all over the place, pronouncing words like \"b'lieve\" and \"prob'ly.\" I do not remember her speaking this way in the first book. But it's not a big deal you get used to it by the end of the book.Dorothy makes a new friend, Tik-Tok, who is considered the first robot to appear in modern literature, although he's not called a robot. I think he's described as a machine man. But for early 1900s, I'm impressed with all the technology Baum imagines up. It's an example of how fantasy easily blurs with the genre of sci-fi.Another funny thing in the book is the army Ozma brings with her. There's 26 or so officers that are in command over one private, and Baum pokes fun at this military parody throughout the story.Overall, I enjoyed this book and would recommend it to anyone, although I think you should read the previous Oz books first. It is a book that can stand on it's own, for Baum refers to the occurances of the previous stories briefly to give the reader the background she needs. I'm looking forward to reading the next segment of the Oz series."}, {"userName": "Sara Santos", "userReviewDate": "Sep 05, 2016", "userURL": "http://www.goodreads.com/user/show/18775374-sara-santos", "userReview": "4,5"}, {"userName": "Amy", "userReviewDate": "Aug 24, 2014", "userURL": "http://www.goodreads.com/user/show/563794-amy", "userReview": "This is my favorite Oz book so far and would make an amazing movie. It makes me a little sad that kids aren't still reading this series and that the internet isn't filled with Ozma kitch. If I dressed like Ozma for Halloween, would anyone recognize me? I'm guessing not, and that makes me a little sad. The book starts with Dorothy and a yellow hen surviving a shipwreck by riding a chicken coop to shore. Upon landing, the (previously ordinary) yellow hen becomes enchanted and begins to talk. The first thing the hungry companions encounter is the most magnificent tree in the world: a lunchbox tree. Among the companions, acquaintances, and foes Dorothy meet along the way are a wind-up copper robot named Tiktok, a princess who likes to wear a different head for every occasion, and a Very Hungry Tiger. How hungry is the tiger? Very hungry indeed. I laughed myself silly at the conversation Dorothy has when she first meets the Very Hungry Tiger, mainly because it is uncomfortably horrible (much like the macabre story of how Nick Chopper turned into the Tin Woodsman):\n\"Oh! Are you hungry?\" she asked, turning to the other beast, who was just then yawning so widely that he displayed two rows of terrible teeth and a mouth big enough to startle anyone.\"Dreadfully hungry,\" answered the Tiger, snapping his jaws together with a fierce click.\"Then why don't you eat something?\" she asked. ...\"But you eat harmless things, so it doesn't matter,\" replied the Tiger. \"For my part, I'm a savage beast, and have an appetite for all sorts of poor little living creatures, from a chipmonk to fat babies. ...Fat babies! Don't they sound delicious? But I've never eaten any, because my conscience tells me it is wrong. If I had no conscience I would probably eat the babies and then get hungry again, which would mean that I had sacrificed the poor babies for nothing. No; hungry I was born, and hungry I shall die. But I'll not have any cruel deeds on my conscience to be sorry for.\"\nThe best part of the story comes when Dorothy and friends try to release the Queen and royal children of Ev from the enchantment of the evil Nome King who has turned them all into palace ornaments. Dorothy, her companions, and all the members of Ozma's small army go in one-by-one to try to guess which of the Nome King's ornaments were once people. The one caveat is that if a person doesn't get any of the guesses correct (which is the usual case), they also turn into palace ornaments. Oh, I love this book. I hope the rest of the series is as delightful. Onward now to \n Dorothy and the Wizard in Oz which starts with an earthquake. Now I'm wondering if every book featuring Dorothy is going to start with a disaster: first a tornado, then a shipwreck, then an earthquake."}, {"userName": "Marley", "userReviewDate": "Aug 12, 2007", "userURL": "http://www.goodreads.com/user/show/72975-marley", "userReview": "Still loopy but a tad darker. Again, haven't read this in ages; if anything, I remember it better from the cult classic Return to Oz movie, which made for an interesting comparison.But this one gives you lots of fun with Dorothy and the delightful queen Ozma, not to mention an intrepid hen given powers of speech by transition to the fairylands, one of the most Grimm's-ian villains yet with the Nome King and his dangerous guessing game, and my deep and abiding favorite Tik-Tok, whose wind-up personality has a lot more fun to it than he admits--not to mention the endless bickering between the Tin Man and the Scarecrow over who's better off than the poor mechanical fellow (Brains! a heart! etc).It's no wonder this is a lot of people's favorite, and I won't argue with it. Might like the pure bizarreness of Marvelous Land a hair better, but that's a matter of taste."}, {"userName": "Gary Sundell", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/38515256-gary-sundell", "userReview": "Dorothy returns in this 3rd book in the classic Oz series. This book introduces the Gnome King who is a recurring villian in future books."}, {"userName": "Lydia Presley", "userReviewDate": "Dec 28, 2010", "userURL": "http://www.goodreads.com/user/show/50581-lydia-presley", "userReview": "Shortly into reading Ozma of Oz I started having strange flashbacks. You know those kind of flashbacks when parts of your youth you have forgotten come creeping in and making you think.. did this happen or was it deja vu?Turns out - it did happen! This book was the biggest influence on Disney's 1985 movie, Return to Oz. I knew the changing heads woman was something I hadn't thought up of on my own!So, once my curiosity was appeased I settled in to enjoy the wildly fun ride Ozma of Oz gave me. And oh, what fun it was.This book has everything - from old friends to new, such as the fun Tik-Tok (whom I fell in love with). And you can't forget the private (because the 26 officers need someone to boss around). I giggled, laughed and felt like a child again. I thoroughly enjoyed Billina, the smart hen that.. well, when you read the book you'll know what she does.I think this is exactly how fairy-tales should be written - full of fun, magic, talking chickens, mechanical objects and happy endings."}, {"userName": "Greg", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/39346323-greg", "userReview": "I believe what makes a great children's classic is that it can be read by anyone at any age and be enjoyable. I found the first book in this series amazingly creative. And I liked the second volume, as the author emphasizes such political issues as equality for all. But for me, this one was specifically written for children, as it all seems rather silly. Baum brings back the original characters, including Dorothy, just to bring them back to his audience but not in service to a good story. That's not necessarily a bad thing: still, this entry to the series feels, well, childish."}, {"userName": "Joni", "userReviewDate": "Aug 07, 2014", "userURL": "http://www.goodreads.com/user/show/33226384-joni", "userReview": "I have to say I was quite disappointed with this book. The storyline and characters were just as good as ever - Billina the chicken is perfectly adorable! However, Dorothy makes a reappearance in this book, and it seems that she has made some major regression in her ability to speak proper English. I think Auntie Em should be concerned enough to have a developmental evaluation and consider some interventions. Seriously, though, my only guess is that Baum chooses to have Dorothy speak poor English (poorly constructed sentences and many abbreviated words with apostrophes cutting out letters or syllables) to convey that she is a child. However, this is bothersome to me on several levels. First of all, she spoke perfectly good English in book 1, and we had no problem understanding that she is a child. Second, being young does not excuse poor grammar, and I don't like the heroes of books being shown as a model of not speaking properly. (Side note: This is my major complaint with the Junie B. Jones books and why I don't encourage my first grader to read them.) Third, since the intended audience in the book is children, I would expect that the unorthodox words would make it harder for them to read, therefore making the book less accessible to them. So I fervently hope that Dorothy has an intellectual awakening before the fourth book, or I may not be able to continue the whole series the way I had intended to."}, {"userName": "Shoshana", "userReviewDate": "Feb 01, 2012", "userURL": "http://www.goodreads.com/user/show/4988551-shoshana", "userReview": "Several thoughts on this one.I love how Dorothy is completely resilient, calm, and optimistic in the face of extreme danger. I mean, it's also pretty ridiculous - at the beginning of the book, a storm throws her overboard with nothing but a chicken coop to keep her afloat on the vast ocean, and she is \"more amused than frightened at her sudden change of condition,\" gives \"a sigh of regret at parting with Uncle Henry,\" and promptly goes to sleep. Like, what? Yeah, uh, ok. Still, I really appreciate that a book from a hundred years ago has something going for it that so many contemporary books still don't have: an interesting female character who goes on adventures without crying and withering. She's physically active, too: \"...Dorothy had to climb over the high slats [of the chicken coop]. Still, for a country girl, that was not much of a feat....\"So in my review of The Marvelous Land of Oz, I noticed that the desert surrounding Oz was not yet instantly deadly, but rather uncrossable presumably due to distance and barrenness. In Ozma of Oz, this first appears not to have changed: \"...I've been to the Land of Oz,\" says Dorothy, \"and it's all surrounded by a horrid desert that no one can cross.\" Later, though, we see Ozma\" & co. proceeding across the desert on a magical green carpet, which logically would protect their feet from deadly sands but shouldn't protect their bodies from starvation and exhaustion. This is corroborated shortly thereafter: \"...there was always just enough of [the carpet] for the procession to walk upon, in order that their feet might not come in contact with the deadly, life-destroying sands of the desert.\" So there you are! Desert: Now deadly.Anyway, back to things I love about these books. Let me tell you, I freaking love Princess Langwidere, of the 30 interchangeable heads (she keeps them in cupboards and switches them out when she gets bored of the one she has on). Here is a bit that I think illustrates her beautifully - one of my favorite moments in the whole book:[Ozma has just told Langwidere that she intends to free Langwidere's family from the Nome King, and she continues as follows.]\"'But first you must liberate another prisoner - the little girl you have locked up in your tower.''Of course,' said Langwidere, readily. I had forgotten all about her. that was yesterday, you know, and a Princess cannot be expected to remember today what she did yesterday. Come with me, and I will release the prisoner at once.'\"Here's another thing I love about this book and later Oz books: The Nome King! The Nome King is hilarious. He is probably one of my favorite villains of all time. As I recall, his character changes dramatically several times throughout the course of the books - making him actually one of the few (or only?) characters to evolve in any significant way in this series - but I particularly enjoy him in Ozma of Oz. He is polite, witty, powerful, mischievous, and thoroughly dishonest while remaining technically true to his word.And while we're at it, how about Billina, whom I've been so looking forward to? After the Nome King shouts about her eggs being poison, she gets all indignant and tells him that \"all [her] eggs are warranted strictly fresh and up to date.\"I love the whole plot with the knick-knacks. I like the gimmick with the 26 officers and one private. Basically, I love this whole book. I don't know that it was one of my favorites as a kid (The Lost Princess of Oz and The Magic of Oz headed that list), but it might be one of my favorites now.P.S. The Hungry Tiger: Old-school, funnier Edward Cullen? \"'Your present appearance makes my mouth water,' said the Tiger, looking at Billina greedily. 'My, my! how good you would taste if I could only crunch you between my jaws. But don't worry. You would only appease my appetite for a moment; so it isn't worth while to eat you.... besides, it wouldn't be right,' continued the Tiger, looking steadily at Billina and clicking his jaws together.'Of course not,' cried Dorothy, hastily. 'Billina is my friend, and you mustn't ever eat her under any circ'mstances.''I'll try to remember that,' said the Tiger, 'but I'm a little absent-minded, at times.'\""}, {"userName": "Hollie Turner", "userReviewDate": "Sep 03, 2016", "userURL": "http://www.goodreads.com/user/show/53097189-hollie-turner", "userReview": "I loved this book ... possibly even more than the first two. My only reasoning for not giving it 5 stars was that The Cowardly Lion seemed to be a coward again, despite being given courage by the Wizard from the first book and that made me sad. This was the only problem I had but as a whole. This is my favourite Oz book so far. I also noticed that a lot of 'Ozma of Oz' was used as inspiration for the second Wizard of Oz movie ('Return to Oz') which I really liked.I loved the concept of the Wheelers and Princess Langwidere and her thirty heads. I thoroughly enjoyed this addition and just a little sad I couldn't give it 5 stars because of the little inconsistency with the Lion.All in all, a beautiful book with unforgettable characters!"}, {"userName": "Nostalgia Reader", "userReviewDate": "Nov 22, 2016", "userURL": "http://www.goodreads.com/user/show/6560108-nostalgia-reader", "userReview": "3.5 stars.Slower and bit more \"obvious\" in the plot line, but still an enjoyable installment in the series! I particularly loved Tik-Tok describing Smith and Tinker--falling into paintings and building a ladder to the moon? WHERE IS THIS IN FULL STORY FORM, I DEMAND IT. <3"}, {"userName": "Jessica", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/2744708-jessica", "userReview": "This was always my favorite of the series, and I loved revisiting this magical world."}, {"userName": "Tatuu", "userReviewDate": "Jan 30, 2013", "userURL": "http://www.goodreads.com/user/show/7460806-tatuu", "userReview": "Oh Billina! Billina is such a sweetie! I imagined she had an African American accent- makes her conversations more interesting."}, {"userName": "Ady Weasley", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/55864874-ady-weasley", "userReview": "Seré muy honesta leí el maravilloso Mago de Oz y Ozma de Oz solo porque tengo una ligera obsesión con Dorothy debe Morir! De Danielle Paige y quería entender un poco de la historiaPero por lo menos este libro se me hizo un poco tedioso, me faltaba emoción y la historia a mi gusto fue un poco floja.Si a eso le sumamos un incidente en la edición es decir páginas en blanco con el cual perdí por lo menos un capítulo....pues que puedo decirlesQuizás es un libro adecuado para la época en la que fue escrito originalmente, pero no me entretuvo mucho 😳😳"}, {"userName": "Scott", "userReviewDate": "Jan 20, 2015", "userURL": "http://www.goodreads.com/user/show/7264087-scott", "userReview": "This is the only currently known draft (1909) of the play that eventually became The Tik-Tok Man of Oz, which toured the western part of the United States from 1913-4. In this early draft, the influence of \nOzma of Oz\n is quite clear, and it shows more as an adaptation of that book than its influence on \nTik-Tok of Oz\n. Betsy Bobbin is called Betsy Baker, and she arrives in the Rose Kingdom (Oz is never mentioned in the text) in a chicken coop with a hen called Baden-Baden (Ironically, there is a Betsy Baker in the cast of Oz: The Great and Powerful--Sam Raimi bringing together the cast of his first feature, The Evil Dead) who contributes almost nothing to the story. Baum's attempts to appeal to popular taste are clear when Queen Ann of Oogaboo and Ozma the Rose Princess (known to Oz readers as Ozga) do a very anti-feminist duet. There's a concerted effort to pair off all the principals into romantic couples, as ridiculous as it sounds. The Shaggy Man is clearly presented as a younger man than he is in the books, and he is paired with Ann. Ruggedo, the Metal Monarch, who is king of \"Imps\" (all female) rather than \"Nomes,\" hates everyone, but falls for Polychrome with the aid of the Love Magnet, but she insists that she can only be loved from afar. Files and Ozma are paired off as in the book. In the climax, the Shaggy Man causes Tik-Tok to explode by hitting a button in his forehead that says \"Don't Touch,\" and Baum refers us to Arthur Voegtlein's descriptions of the special effects, which I would love to see. Betsy loves him and gathers his remains as though she is Isis collecting Osiris, and when he is put back together, he is mistaken for a ghost, a plot element that will be familiar to readers of \nLittle Wizard Stories of Oz\n. (John R. Neill seemed to actually believe he was a ghost, as all subsequent books show Tik-Tok looking silvery in the color plates in spite of being described as a copper man.) Finally, the Love Magnet is dropped into Tik-Tok's head so that he and Betsy can be lovers. IT is already established early on that Tik-Tok runs based on love. Tik-Tok is also full of spoonerisms that he blames on his machinery and the patentee (the word follows seven Zs each time the running gag is done), and Baum makes more use of \"Pick me up\" than Walter Murch did in Return to Oz. The Shaggy Man's brother has only one line. I've read elsewhere that he is called \"Wiggy,\" but that name appears nowhere in this draft, which, as established, is not the final one.The play is kind of fun, but it's still, in literary terms, far inferior to the Oz books. As shown above, Baum is here trying to appeal to popular tastes, and the show did tour for two years, although the critical response was that it was a knockoff of his earlier hit with the Broadway and touring versions of The Wizard of Oz, which was mostly rewritten by someone named Donnegan, and most of the songs he wrote were removed, apart from \"The Traveler and the Pie,\" which had nothing to do with the story. One of the songs here is clearly an imitation of that song. I know only a small sampling of the music here, but I could easily imagine music of that early 20th century pop style to accompany the lyrics presented, and no one would say that the music that I compose sounds anything like that style. The play's puns are better than that of The Woggle-Bug, but the plot structure is quite a bit weaker and dependent upon coincidences."}, {"userName": "R. Kitt", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/68218385-r-kitt", "userReview": "3.5-4 starsI enjoyed the previous two books more but I liked this one too!"}, {"userName": "Mimi", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/55654304-mimi", "userReview": "I'm actually quite enjoying the Oz books. And I'm discovering that the details in the numerous film and tv adaptations I've seen, are a lot more accurate than I expected.(In this case particularly, an adaptation by Syfy (I think it was called 'the Witches of Oz' or something similar, where the witches had detachable heads. I thought it was far-fetched, turns out it's from this book in the series. Granted, it's not a witch, but Princess Langwidere who has the replacable heads, but still...)"}, {"userName": "Orinoco Womble (tidy bag and all)", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/20738920-orinoco-womble-tidy-bag-and-all", "userReview": "This was the other Oz book I was given as a child, and my favourite of the two. I loved idea of the lunchbox tree and the dinnerpail tree! Reading it again forty-some years later, I still do, though my attitude toward Billina-the-hen has changed. First time around I found her amusing; this time she sounds like a bossy mother-substitute. Which works, because suddenly Dorothy talks like a four-year-old with her \"auto'biles\" and \"baby cabs.\" Um...excuse me. I'm from the Midwest myself and \"baby cab\" was never a word for a buggy or carriage or stroller, not even in 1907. And why the sudden regression?As a kid I liked the Princess Langwidere (languid dear) with her changeable heads, rather like Miss Potato Head! I still wonder how she could see to put the new one on once she'd removed the old one, though. She was and is deliciously creepy. The Gnome King (no \"nomes\" for me, thank you) is a sort of perverse Santa Claus figure as Dorothy finds out--fat and \"jolly\" but not trustworthy. Was Baum having a poke at the old \"fat people are jolly fun\" myth? Or did he not like Kris Kringle much?Billina saves the day in the end, and everyone goes back to Oz for a celebration, with gifts for all the friends. I did wonder though, why the Scarecrow was given a silver jar of \"complexion powder\" and what Baum thought he would use it for."}, {"userName": "Shari", "userReviewDate": "May 29, 2013", "userURL": "http://www.goodreads.com/user/show/10356564-shari", "userReview": "We began reading Ozma of Oz on a five year old birthday, which meant waiting a whole week since finishing The Land of Oz from Christmas. The chief appeal as a child had been for me the guessing game, and the Nome King did not disappoint my five year old.  Billina knowing a secret had us talking about secrets all week, but more important than knowing a secret is knowing that the least imposing character, a chicken, can save the day. Precisely because she's unnoticed and not taken to be significant she learns that which ends up being most important. With evil defeated by ordinary goods, this had us cheering for the wonderfulness of that which seems commonplace. Who knew what could frighten the evil Nome King? Evil may not be what you expect, he was funny not scary, but his defeat is unexpected also.  The Hungry Tiger has become our favorite though. He is thoroughly concerned with right behavior, even though it is in his nature to cause no small harm. An excellent counterpoint to those who might be led to believe that all natural behavior is thus deemed good.And the character who might have been most disturbing? Langweidre? Not a threat at all. \"She's not good at being queen, because she doesn't govern.\" well. indeed."}, {"userName": "Holli", "userReviewDate": "Jul 27, 2015", "userURL": "http://www.goodreads.com/user/show/37554808-holli", "userReview": "I like that Dorothy is back in Oz for this story and that it was in answer, by the author, for the clamoring of his young readers. Although Dorothy came across as an extreme snob in several scenes. As do the Tin Man and Scarecrow, which also happened in the second book making me wonder if their individual kingdom ruling ruined them from their first appearances. Dorothy is too young to be this snooty. I may be the only one who sees this, but they really come across as feeling themselves more important than the rest of the world a few times. The book is still good and I enjoyed it, except I don't like how some of the chapter titles pretty much give away what's going to happen in the chapter. It's like going to see a movie you've never seen before and having the person near you go \"oh, this is the part when such-n-such happens,\" or \"oh! this is when they catch the bad guy!\"COYER: Read a book with no pictures only words on the cover. (Ex. Damsel in Distress, Kissing in America) - Kindle version (3 points)"}, {"userName": "Heidi", "userReviewDate": "Mar 09, 2013", "userURL": "http://www.goodreads.com/user/show/4226761-heidi", "userReview": "A great adventure story to read aloud, especially for girls. We loved the horrible princess with the interchangeable heads, and all the other characters. We found a free ebook of an illustrated edition which made it nice to look at too, maybe from the Internet Archive."}, {"userName": "Kathy Worrell  ツ ", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/4994087-kathy-worrell", "userReview": "Very adventurous and wholly entertaining!! Dorothy has somehow managed to undergo another unexpected trip into the World of Oz. And what a creative story it was! I love the mind of L. Frank Baum. Thanks Alexandra for a great buddy read!"}, {"userName": "Jason Pettus", "userReviewDate": "Sep 19, 2009", "userURL": "http://www.goodreads.com/user/show/147289-jason-pettus", "userReview": "(Reprinted from the Chicago Center for Literature and Photography [cclapcenter.com:]. I am the original author of this essay, as well as the owner of CCLaP; it is not being reprinted here illegally. This review covers all 14 of the Baum Oz books, which is why it's found on all 14 book pages here.)I think it's fairly safe by now to assume that nearly everyone in Western society is familiar with The Wizard of Oz, most of us because of the classic 1939 movie adaptation; and many realize as well that author L. Frank Baum ended up penning a whole series of sequels, because of the original book's astounding success back at the turn of the 20th century when it was first published -- 13 sequels altogether, before his death in 1919, which after the movie's success twenty years later became a literal merchandising empire, spawning hundreds more official sequels by various authors and hundreds more unofficial ones once the characters moved into the public domain. And like many others, I've always been interested in what these 14 \"canonical\" Oz books have to say; and that's why I decided this winter to sit down and read them all in a row for the first time, easy to do because of them being available for free at both Project Gutenberg and the email subscription service DailyLit (which is how I myself read them, and in fact is how I read many of the older books you see reviewed here; I'm a big fan of theirs, and highly recommend them).But of course, to even approach these books with the right mindset, it's important to understand that like so many other one-hit-wonders, Baum was not only eluded by success in most of his other endeavors but was an active failure at them -- in the 1870s, for example, he unsuccessfully tried his hand at breeding fancy poultry (a national fad at the time), then in the 1880s opened his own theatre and became one of the first-ever Americans to produce modern-style stage musicals, apparently a little too ahead of its time, then in the 1890s moved to the Dakota Territory and opened a dry-goods store that eventually failed, as well as starting a newspaper that folded too. So it was sort of a case of random lightning in a bottle when he decided in the late 1890s to try his hand at children's literature, and ended up with his very first title being the most popular kid's book in America for two years straight, and no surprise that Baum then spent the rest of his life desperately trying to figure out how to bottle that lightning again. Because now that I've read it myself, I can confirm that the original Wonderful Wizard of Oz is astonishingly great, a sort of miraculous combination of traits that makes for an almost perfect children's story; and although most of it follows the same storyline seen in the '39 movie, there are also significant differences, making it worth your while to sit and read the book version if you have the interest. (And by the way, for some really interesting reading, check out the academic analysis that was done of this book in the 1960s, arguing that most of its details symbolically correspond almost exactly to various political and economic issues of the late 1800s, including the yellow brick road representing the much-discussed gold standard of that age, the scarecrow representing the then-hot Populist Party, Toto representing the teetotaler [prohibitionist:] movement, and a lot more.)But of course, there are a couple of details about this book that have been forgotten over the decades too, which also help explain its record-shattering success -- it was an unusually lavish book for its time, for example, with two-toned illustrations on every page and several full-color plates, and let's also not forget that Baum himself mounted a Broadway-style musical of Oz just two years after the book was published, a huge hit which toured nationally for a decade and that was even more insanely popular than the book itself (including making national stars out of vaudeville performers Fred Stone and David Montgomery, playing the Scarecrow and Tin Man; the stage production left out the Cowardly Lion altogether, which is why he is also barely seen in any of the 13 canonical sequels). And so that's why when Baum attempted starting up other fantasy series in the wake of Oz's success, hoping to turn all of them into lucrative franchises like the original, the audience mostly responded with yawns; and that's why Baum eventually went back to writing more and more Oz books as the 20th century continued, because by now the strength of the brand far outweighed the relative writing skills of Baum when it came to any particular volume.That's why, at least to adults, it's perhaps actually the introductions to each book that are the most fascinating thing about them; because to be frank, most of the books follow a pretty familiar formula, with a danger-filled quest involving various kooky characters that is usually finished about two-thirds of the way through, followed by a massive parade or party that lets Baum trot out the growing number of main characters added to this universe with each title. (And by the way, prepare yourself for Baum's unending love of the deus-ex-machina plot device; over half the books end along the lines of, \"And then our heroes took possession of a super-duper magical device, which they waved in the air and all their troubles went away.\") In fact, for those who don't know, that's why the official map of Oz and its surrounding lands eventually grew so large, because Baum still hadn't given up on his dream of having a whole series of kid-lit cash cows out there generating revenue for him, and so would use many of these Oz sequels to introduce entirely new casts of characters who live in entirely new lands, \"just over the mountains\" or \"just past the desert\" of Oz itself. By the end of the original 14 books, in fact, Baum had built up a virtual aristocracy of licensable characters, all of whom would have to be dragged out for a cameo at some point in each book to remind the audience of their existence -- not just the cast of the original book and '39 movie but also various other princesses like Ozma and Betsy Bobbin, boy characters like Ojo the Unlucky and Button Bright, adults who help them like the Shaggy Man, Cap'n Bill and Ugu the Shoemaker, and of course a whole litany of quirky fantastical sidekicks, including but not limited to Tik-Tok, Jack Pumpkinhead, the Great Jinjin, Billina the Angry Hen, Scraps the Patchwork Girl, and Polychrome the Rainbow Fairy. Whew! And so did the Great Oz Merchandising Experiment keep limping along for two decades, with each sequel selling less and less and getting lazier and lazier (for example, the tenth book in the series, 1916's Rinkitink in Oz, was actually a non-Oz book written a decade previous, published almost unchanged except for a hasty final chapter full of Oz regulars slapped onto the end); and thus did Baum's bad luck in business come back with a vengeance as well, with three more Broadway productions that were all flops, and even the establishment of a film production company in 1914 that eventually went bankrupt.You can see the progression of all this reflected in Baum's first-person introductions to each book, which like I said is why they might be the most fascinating parts of all for adult readers -- how in the first sequel, for example, he expresses legitimately gleeful surprise and joy at how passionate his fans were, and how thousands of children had literally written to him out of the blue demanding more Oz stories, while with each subsequent sequel his tone becomes more and more snarky, ala \"Well, dear and wonderful children, you've yet again demanded another Oz book like the sheep you are, so here it is, you screeching little monsters.\" In fact, in book six of the series, 1910's The Emerald City of Oz, Baum flat-out states that it's going to be the very last Oz book, and it's no coincidence that many fans actually consider this one to be the best of the original fourteen, because of Baum's extra attention to and enthusiasm for this particular storyline, thinking as he erroneously did that it would be the grand finale of the entire Oz universe; but after his later financial failures forced him back into the Oz business again, the gloves finally come off in his introductions, with most of the rest sounding to today's ears something like, \"Well, okay, here again is the sugary teat you all apparently can't get enough of suckling, you infuriating little animals, so open wide and take your medicine.\" Now, of course, you shouldn't feel too bad for Baum; by the last years of his life, his combined books and plays were generating for him in today's terms roughly a quarter-million dollars a year just in personal royalties.So all in all, an experience I'm glad I had, reading all fourteen original Oz books in a row, but not something I'd recommend to others; instead, maybe better just to read the first, then skip to the sixth, then skip straight to the 14th, 1920's Glinda of Oz, because of its unusual darkness (probably caused, many scholars agree, by Baum knowing that he was near death). As with many authors I've looked at here at CCLaP, history seems to have correctly adjusted itself in Baum's case, with most of his books now rightfully falling into the obscurity they deserve, even while his one true masterpiece is still rightfully recognized as such."}, {"userName": "Natalie (weneedhunny)", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/6548813-natalie-weneedhunny", "userReview": "It's clear this is my first time reading any of the Oz books critically. There were so many things that nagged on me - for example, Dorothy's righteousness that feels typical of someone privileged and sheltered (\"Your name can't be Bill, you're a girl. I'll call you Billina\" - I'm not sure what the English original was of this part of the dialogue, I read the Swedish translation). I can't really see how anyone would enjoy Dorothy as a protagonist; there's not much to her - much more in fact is there to her companion and really the heroine of this book - the yellow hen. She's got a personality, she doesn't mind being disagreeable, she's smart and doesn't let other people's prejudice get in her way. Another character I liked was the princess Landwidere - the vain princess with a head's collection, who wanted to free up her time to reign the kingdom for more mirror-time. At least she was upright with her priorities. In comparison to the 'good' characters that are on a saving-quest and then end up leaving one of their own behind in a jiff - although everything is well and good in the end, but not for commendable actions but for luck. I mean - if you're going to go on a quest to save people and end up leaving one of your most true and kind members behind after facing a little bit of trouble - what was the point in all the things you went through to get there? Is the royal blood more worthy than tin? I just feel like this is typical of some works of fiction directed towards children where there's no moral dilemma in actions that are contradictory and I wish there was, I wish people realized how acting cruelly even when it's towards enemies doesn't make you a hero - like really, you're going to enchant the people who were threatening you with enchantments to get back at them? It wouldn't be much of a problem if they didn't think themselves as so much better, so pure and kind and dignified, so superior to the 'bad' characters.And then the illustrations. Honestly I love the 20s feel of the illustrations (I'm just guessing at dates, could be totally off) but I really do like the illustrations, on their own. However they don't always make sense along with the story. A few times the illustrations didn't reflect the story - the dinner boxes for example didn't look at all like they were described (Dorothy supposedly plucks one down but the illustration shows the boxes being tied around the branches so she would then have to either break the string or loosen the tie to get them down, or even worse the illustration of the wheelers). It might be small details at times (like the Princess Ledigwere's hair color) but it bothered me - it felt so unnecessarily sloppy, as if the illustrator had never read the story. And the illustration used for the front cover seems to be of Glinda the Good - why? The book's title is Ozma of Oz, so surely if anyone should be on the cover it's Ozma?All this is not to say I didn't enjoy myself. I can see why I would've loved this so much as a child - there's so much magic in Frank Baum's worlds, magical and fantastical and also - orderly. For example the fact that everything is done in certain color schemes, everything to do with Oz is green, things to do with this new land - Ev, are purpur. The entire structure of the novel too - the tests along the way, the way they figure it out, get to the enemy, return home, is done in a very orderly fashion and I must say it's rather satisfying for that. The magical aspects is definitely what I loved so much about these books as a child - the fact that a man could draw a ladder so realistic he could just climb up to the moon and move there, isn't that just marvelous?All in all, I enjoyed this reading experience but I also see so many things to criticize and I just couldn't look over them after a while. There's a lot to love in Baum's imagination but quite a lot of the ideas behind and the ways of thinking that shape the way these characters behave are outdated and could easily annoy or pick at a modern reader. As such, I'm not sure I'll be reading more of these books in the future and if I do, probably not in a hurry, but take that as you will."}, {"userName": "Tarissa", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/2630602-tarissa", "userReview": "Another grand adventure in the Land of Oz (and also getting to visit the Land of Ev for the first time!). For me, Ozma of Oz is much more in the strain of the original Wonderful Wizard of Oz than book #2 (Marvelous Land of Oz) was. Book 3 now allows me to appreciate the Oz books all over again, and it gives you the same happiness and whimsical elements of the beloved, original story we cherish.If there's one thing I wish I could have in real life that I read about here, it would a tree that grows meal boxes for you. Truly, you just pick a box off its branches and there's a whole meal for you! Yum, yum.A word of caution for young readers: \n(1)\n There are some rather frightening images of creatures called Wheelers who live in the Land of Ev. Even as an adult, I found them really creepy to look at. Wheelers are something like the combination of a hideous clown face and a skeleton donkey body with wheels for hooves, according to the illustrations. Just sayin'. \n(2)\n Princess Langwidere has 30 heads. 29 of which are kept in a cabinet. The other 1 she wears on her body, until she tires of it or wishes for a different face. In which case, she pops off her head and adorns herself with a different head that better suits the occasion. The description or imagery of this has the possibility of frightening small children.My favorite line in the whole book is as follows. Note that the Nome King lives in the Underground World, with rocks and precious gems totally being his business.\n\"The Nome King laughed until he choked; and he choked until he coughed; and he coughed until his face turned from grayish-brown to bright red. And then he wiped his eyes with a rock-colored handkerchief and grew grave again.\"\nThe king who lives among rocks GREW GRAVE AGAIN! I about lost it on the irony. Thanks, Mr. Baum!"}], "description": "A raging sea storm carries Dorothy Gale (charming heroine of The Wonderful Wizard of Oz) to the fairy land of Ev, where an exciting new adventure awaits her and all young readers who venture into this enchanting realm of fantasy.Dorothy meets some new friends — Billina, a friendly talking hen; Tiktok, a remarkable Copper Man; the lovely Princess Ozma of Oz; and some strange characters too — Wheelers, with wheels for hands and feet; and Princess Langwidere who wears a different head each day.When Dorothy learns that the Queen of Ev and her ten children are prisoners of the wicked Nome King, she sets out on a magic carpet with her new friends and some old favorites — Scarecrow, Cowardly Lion, and Tin Woodman — to rescue them.The danger mounts as Princess Ozma herself falls victim to the Nome King's magic and is transformed into an emerald grasshopper. Youngsters will be swept up in the action as Dorothy and her entourage match wits with the Nome King and his devilish Nomes in a forbidding underground fortress.Ozma of Oz will delight children of all ages from the very first chapter in which Dorothy battles the sea, to its surprising conclusion, when she struggles to free the royal family and her friends.The original text is reprinted here in its entirety from the first 1907 edition, with John R. Neill's amusing and imaginative illustrations that capture the flavor of this wonderful, witty tale.", "title": "Ozma of Oz\n      \n          (Oz #3)", "url": "http://www.goodreads.com/book/show/1189885.Ozma_of_Oz", "average": 3.97, "cover": "https://images.gr-assets.com/books/1328868819l/1189885.jpg", "reviews": 827, "authors": [{"url": "https://www.goodreads.com/author/show/3242.L_Frank_Baum", "name": "L. Frank Baum"}, {"url": "https://www.goodreads.com/author/show/5044885.John_R_Neill", "name": "John R. Neill"}], "type": ["Fantasy", "Classics", "Childrens", "Fiction", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/1189885.Ozma_of_Oz", "http://www.goodreads.com/book/show/60177.Ozma_of_Oz", "http://www.goodreads.com/book/show/17693844-ozma-of-oz", "http://www.goodreads.com/book/show/560635.Ozma_of_Oz", "http://www.goodreads.com/book/show/36430913-ozma-of-oz", "http://www.goodreads.com/book/show/35454032-ozma-de-oz", "http://www.goodreads.com/book/show/24601739-ozma-of-oz", "http://www.goodreads.com/book/show/1206563.Ozma_of_Oz", "http://www.goodreads.com/book/show/28008959-ozma-fr-n-oz", "http://www.goodreads.com/book/show/1886289.Ozma_of_Oz", "http://www.goodreads.com/book/show/236093.The_Wonderful_Wizard_of_Oz", "http://www.goodreads.com/book/show/179565.The_Marvelous_Land_of_Oz", "http://www.goodreads.com/book/show/116597.Dorothy_and_the_Wizard_in_Oz", "http://www.goodreads.com/book/show/179639.The_Road_to_Oz", "http://www.goodreads.com/book/show/179668.The_Emerald_City_of_Oz"]}