{"ratings": 502, "userreviews": [{"userName": "Patrick Brown", "userReviewDate": "Sep 24, 2012", "userURL": "http://www.goodreads.com/user/show/175283-patrick-brown", "userReview": "I have been meaning to write a long review of this book, because I think there's a lot in it to pull out and examine, but I am a busy man, and it doesn't look like that's going to happen. So in lieu of something more meaningful, let me just say that I defy you not to like this book. Oppen Porter, the narrator of Panorama City, is so endearing, so charming that by page five, you'll be completely engrossed. I always have a thing about \"likeability\" with regards fictional characters. The short version of the story is that I don't need it to enjoy a book. I can read a book about an asshole and love it just as much as something with \"people to root for\" or whatever. But Oppen is the kind of character even I couldn't help but love.One of the best books of the year, and a triumph of first-person narration. Read it!"}, {"userName": "Roxane", "userReviewDate": "Dec 14, 2012", "userURL": "http://www.goodreads.com/user/show/1151637-roxane", "userReview": "This is a brilliant novel. The protagonist, Oppen Porter, is fully realized and we are quickly pulled into his way of seeing the world. This is a seductive novel in that we know things about Oppen that he doesn't know about himself and still, he is easy to believe and to like and to love. On a craft level, there are these gorgeous, long, LONG sentences, so perfectly crafted, I kept thinking, \"May these sentences never end.\" That is much how I felt about the novel. I absolutely loved this and am re-reading it again, after just finishing."}, {"userName": "Vanessa Torres", "userReviewDate": "Oct 02, 2012", "userURL": "http://www.goodreads.com/user/show/13078442-vanessa-torres", "userReview": "In the beginning, I found it a tad difficult to follow. I was a little confused by the rhythm and the many commas, but after a while I got the hang of it and I truly enjoyed the read. It got to the point where I'd wake up and first thing I did was start reading, cuddled up with my blanket. I really came to admire the main character and narrator, Oppen. He was intelligent, a great thinker, but also very humble with a hint of naive. I liked being inside his mind and I loved following his journey. I received the book for free through Goodreads First Reads. (Thanks so much!) LOVED it all in all! Also, this book got me in the habit of walking with my hands behind my back :)"}, {"userName": "Jim Hiller", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/2049862-jim-hiller", "userReview": "On surface, there is much in this book that would absolutely drive me crazy; plots that seemingly don't go anywhere, characters of not much redeeming value. However, the character of Oppen Porter, the narrator in this book, truly had me cheering for him within the first couple of pages, and so, I was willing to go on the ride. Part religious parable, part philosophical examination, part adventure story, Wilson deftly handles the story by focusing on Oppen's delightfully innocent reactions to the world around him. I loved this book; but I'm not sure I would go out and recommend this to everyone. However, I found this to be an enjoyable use of reading time."}, {"userName": "Kim", "userReviewDate": "Nov 04, 2012", "userURL": "http://www.goodreads.com/user/show/352261-kim", "userReview": "This is a *must* read. I believe it would cause even the most jaded cynic to shed a little of her thick skin. I was sad to say goodbye to Oppen Porter when I closed the book. You'll want to keep seeing the world through his eyes long after you've finished reading Panorama City. Bravo to Antoine Wilson for creating such an endearing, believable character!"}, {"userName": "Karen", "userReviewDate": "Nov 07, 2012", "userURL": "http://www.goodreads.com/user/show/294515-karen", "userReview": "I am so excited that Antoine Wilson has another book out! Loved, loved, loved  The Interloper  and now a new novel. Review coming soon--reading the book first will help the review immensely.Updated 5/24/13 I actually started to write a full review of this book some time back and to my utter horror and frustration--okay, just frustration--my computer ate the review; or I pushed the wrong button. \"Pushing the wrong button\" puts the onus on me, though,which is not acceptable, is it? Anyway, let's not point fingers. Let's get to the review and hope things don't go awry this time. Panorama City  is the story of Oppen Porter, who lives a very comfortable life riding his bicycle around his small town where he is known as \"the Mayor,\" a nickname Oppen loves and which the reader suspects is more insult than Oppen understands. Oppen is different in a way the book never outright identifies, probably because the book is from his first person POV. Is Oppen \"slow\"? Most people would think so. He views the world differently than many do, certainly quite differently than his aunt does. Oppen's aunt, a straight-laced, buttoned-down, no-nonsense (and really, no fun) middle-aged woman, shouldn't be in charge of Owen's life but she tries to take over after Oppen's father dies. Oppen's entire life changes when his father dies in the house, especially since Oppen, following his father's wishes, buries him in the yard next to the hound dogs. Oppen happens to mention the unusual burial arrangements and the authorities get involved. Then the aunt steps in and arranges for Oppen to live with her. Things might go poorly for Oppen at this point but luckily for him on the bus ride to his new life, Oppen meets an intriguing stranger, a man who looks like a crocodile, who introduces Oppen to the notion of becoming \"a man of the world.\" See, he and Oppen are thinkers, and the rest of the world will always try to smash the thinkers. Oppen is hooked. From this moment on, his aunt's best attempts to give Oppen a normal \"productive\" life are in vain. Sure, Oppen rises up to become employee of the month at the fast food joint where he is supposed to make an honest wage. But Oppen and his friend are determined to pursue their lives as thinkers, and this means behaving in a way counter-intuitive to the best intentions of people like Oppen's aunt--with hilarious results. I absolutely loved Panorama City, which did not surprise me. I absolutely loved The Interloper too. Now, there is always the small fear that an author's second book won't be as enjoyable or thought-provoking as the first. Not so, thank goodness. Now I am left waiting for the next novel Antoine Wilson has to offer. In the meantime, I can highly recommend his first two."}, {"userName": "Carl", "userReviewDate": "Oct 31, 2012", "userURL": "http://www.goodreads.com/user/show/658061-carl", "userReview": "You have to give credit to an author whose narrator can shamelessly manipulate the reader, even when the reader knows it’s happening. Here, the device is quite similar to Haddon’s The Curious Incident of the Dog in the Night; the narrator makes it clear he’s mentally challenged, but makes astute and humorous observations that clearly point the reader in certain ways, while using words, phrases, and lines of thought that realistically would be beyond his scope, even if he attributes many of them to others. (Using precocious child narrators is another way of doing it, and I’ve been a willing sucker for some of them, although others have clearly overdone it (you can read my reviews)).Of course, some of the observations and conclusions may come easier to a “slow absorber” than to most people, as he can cut away a lot of the extraneous clutter that interferes with our view of life. I spent several enjoyable hours with this interesting man, smiling and chuckling while he observed the people around him, many resembling people we come across on a regular basis. The narrator comes across as genuinely sweet, and wryly observant, leaving the obvious satire to the perception of the reader. And there had to be at least one memorable sentence every few pages. All in all, just plain fun to read."}, {"userName": "Amanda Kay", "userReviewDate": "Oct 18, 2012", "userURL": "http://www.goodreads.com/user/show/3720305-amanda-kay", "userReview": "If a review could be only one word, the word for this book review is: \"Endearing.\" I fell in love with the main character quickly. In the first few pages as he describes Officer Mary's slumped shoulders in an array of similes. I love this novel, and this quote from it: \"Life is long, even when it's short.\""}, {"userName": "Edan", "userReviewDate": "Sep 29, 2012", "userURL": "http://www.goodreads.com/user/show/27925-edan", "userReview": "This book was a 4.65 star rating for me, but I am rounding up because--because, why not? Antoine and I are friends, and this book was so delightful and surprising, and sneaky-wise. One of the best first person narrators to emerge in the last 10 years: you will love Oppen Porter!"}, {"userName": "Basyirah", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/62044561-basyirah", "userReview": "4.5 stars\"With great freedom comes great responsibility, someone said once, well, it doesn't work the other way around.\"When I read this, it reminded me of Mitch Albom's books. The vibe was there. Realistic and filled with life lessons. The story of Oppen Porter, who seemed sure that he wouldn't live through the night to see the morning sun, so he recorded his life story into several tapes for his unborn son. His life basically met a turning point when his father died and he had to live with his aunt in Panorama City where he embarked on his first adulthood life. He's a slow absorber, as he put it. It's somehow sort of poetic the way he described everything that happened to him. It was honest and funny in a way. Beautifully written, I must say. It's neither fast nor slow paced, imo. It just keeps going until you reach the ending. At some point I got a little bored with details but it's not bad, I'm just not good with lengthy details. Overall, a great book. If you get the chance to pick it up, please do."}, {"userName": "Chris Go", "userReviewDate": "Oct 02, 2012", "userURL": "http://www.goodreads.com/user/show/287955-chris-go", "userReview": "I was really intrigued by this book because for about two years of my life (while in high school), I rode on a bus through Panorama City. It is the main character, Oppen, though, that really sucked me in. I had no idea where this mixed up adventure was heading, even though the summary in the jacket flap gave a few things away. One thing I can tell you for sure, is that I will never look at thumbtacks the same way again. Much of the book is Oppen's thought process about the 40 days he spent in Panorama City, which he dictates into a tape recorder for his yet to be born son because Oppen believes he is going to die before his son arrives. Oppen admits time and time again that he is \"a slow absorber\". As a result, he often gets things wrong, or misses the meaning of things, and it causes all sorts of problems. It does make you think about how often each of us often gets wrong the thought process of those around us, even though we wouldn't consider ourselves like Oppen. Some of the book is downright hilarious, although there is something truly sad about the entire thing if you think about it. It is a brilliant cast of characters. As unreal as some of them seem, they come across as genuine. I think it would make for great book group discussions."}, {"userName": "Ben Loory", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/171197-ben-loory", "userReview": "I have talked before about how the head gets filled with other people's words, how in sleep we transform those words and make them our own. The measure of a man's thinking is in how those words are transformed, the measure of a man's thinking is what he does with other people's words, they must penetrate him to the core, they must filter through his piled-up experiences and opinions, and they must return transformed. I didn't have this philosophy straight while at the Lighthouse Fellowship, it came later, I knew only that JB had repeated Scott Valdez's phrases without transforming them at all. What came out was what had gone in. Which meant that the phrases hadn't even grazed JB's core, they'd only bounced off a series of mirrors inside JB."}, {"userName": "Kasa Cotugno", "userReviewDate": "Aug 22, 2012", "userURL": "http://www.goodreads.com/user/show/2345554-kasa-cotugno", "userReview": "Upon the death of his father, Oppen Porter finds himself uprooted from his childhood home where his innocence has been accepted. In a voice that resembles that of Forrest Gump, Oppen is narrating his story to his unborn son into a tape cassette, relating how he finds himself in Southern California in a life he has to navigate without much help from his aunt. The story is more about how the world looks to new eyes than anything else. His acceptance of 21st Century life refreshes it for a reader patient enough to accept the style and sometimes cliched handling of material. I liked, but didn't love, it."}, {"userName": "Andd Becker", "userReviewDate": "Oct 05, 2012", "userURL": "http://www.goodreads.com/user/show/11287861-andd-becker", "userReview": "Outstanding is the author's style. Oppen, the 1st person narrator, tape-records his life story for his unborn son. His analysis of persons and events is appealing. Oppen is a self-proclaimed \"slow absorber.\"  Outwardly, he appears to be unaware. But to his unborn son (and to the reader), he reveals, through explanations of his actions, that within his limited awareness there is keen perception. In his own way, Oppen possesses the gift of perspicacity. A chance meeting (or was it a synchronicity?) with a stranger becomes a transformative event. I received this book free through the goodreads FIRST READS program."}, {"userName": "Cathe Olson", "userReviewDate": "Sep 24, 2012", "userURL": "http://www.goodreads.com/user/show/2192498-cathe-olson", "userReview": "As 28-year-old Oppen Porter lays \"dying\" on his hospital bed, he tape records his version of the events leading to his anticipated premature demise, so his unborn son would know what happened. I liked the unique premise of this story and I found Oppen's \"voice\" original and endearing, but unfortunately the book was just so-so for me. It was easy to put it down and it never really called to be picked up again--though I did finish the book. The story was enjoyable and the writing was good--it just wasn't terribly compelling. For those who really enjoy character-study type books, this would be for you."}, {"userName": "Harry Annan", "userReviewDate": "Dec 04, 2012", "userURL": "http://www.goodreads.com/user/show/3092208-harry-annan", "userReview": "Quirky, brilliant story. Complex characters & interesting narrative voice...looking for more by this author.,"}, {"userName": "James", "userReviewDate": "Feb 13, 2013", "userURL": "http://www.goodreads.com/user/show/8027567-james", "userReview": "An almost picaresque tale told with great humor. Drole and funny in a way that evoked a much grimmer tale for me, Kafka's \"The Trial.\""}, {"userName": "Ti", "userReviewDate": "Jun 05, 2012", "userURL": "http://www.goodreads.com/user/show/122928-ti", "userReview": "The Short of It:Oppen Porter is probably one of my favorite protagonists since Owen Meany. In fact, you could say he’s a cross between Owen Meany and Forrest Gump. Witty, funny, brutally honest yet likable.The Rest of It:What a wonderful book. Where do I even start? You know it’s good when I can’t even formulate my thoughts.After a mysterious accident, Oppen finds himself in a Madera hospital, in traction and on the verge of dying. Well, to HIM, the end is near which is why he is recording a letter to his unborn son, Juan George. The events of his 28-years are unremarkable in one sense, and spectacular in another. At 6’6″, he is a grown man and intelligent in his own way, but his simple curiosity allows him to befriend all sorts of strange characters. Riding everywhere on his bicycle, with a pair of binoculars around his neck, Oppen exists by asking the questions that no one else wants to ask. He’s blunt, far from innocent yet gullible, but even when people set out to take advantage of him, his goodness seems to rub off on them just a tiny bit. Enough to make you wonder if there is good in everyone.From his hospital bed, Oppen tells his story.When his father dies at home, Oppen takes it upon himself to fulfill his father’s wish, which is to be buried at home in his own backyard. This seems perfectly logical. Why would anyone have a problem with it? When the authorities catch wind of it, the body is exhumed and buried to code. Frustrated that he is unable to do the one thing his father requested, he suddenly finds himself living with his Aunt Liz in Panorama City, California. If you’ve ever visited the San Fernando Valley, you know how dry and boring Panorama City can be. It’s “strip mall” city, crowded, and eternally stuck in the 70′s (if you ask me).Aunt Liz believes that what Oppen needs is a job to fix him right up, so she gets him a job at a local fast food joint. There, he is forced to interact and consider, those around him. Both customers and coworkers become objects for analysis. Oppen’s desire to please the customer could mean giving them the chosen fry, the one that’s a bit longer than the others just to see if they are paying attention but what it usually does is get him in trouble with whoever he’s trying to analyze at the time. But his fill-in-the-blank personality saves him, in that no one ever thinks he’s trying to be annoying on purpose; quite the opposite actually.As Oppen moves through life in Panorama City, his time there becomes an Odyssey which lasts 40 days and 40 nights. He finds Christ through the Lighthouse Christian Fellowship, learns about fleeting youth from his freethinking friend, Paul Renfro and although many attempt to take advantage of him, in the end, Oppen seems to always come out on top.\"I don’t run, because when you run people chase you. People and animals. Always better to extend your stride.\"This is a charming read in many ways but what I found most charming, was Oppen himself and yes I’ll admit it, even Panorama City was a lot more interesting with Oppen in it. His ability to take it all in, distill whatever it is right down to its essence, and then regurgitate it back up for his unborn son’s benefit… priceless. To me, this book reminded me so, so much of A Prayer for Owen Meany, which is a book that I hold dear. So for me to even compare this one to Meany means that this one is pretty special.I wanted to include some gems from the book but there are far too many to mention. I suggest you pick-up a copy and just read it for yourself. I, for one will be reading Wilson’s other book, The Interloper as soon as I can get my hands on it.Audio Note: I listened to a portion of this on audio and it was just as fabulous on audio.For more reviews, visit my blog: Book Chatter."}, {"userName": "Jenny Shank", "userReviewDate": "Sep 01, 2013", "userURL": "http://www.goodreads.com/user/show/4521669-jenny-shank", "userReview": "Becoming a man of the world: A Review of \"Panorama City\"\tOppen Porter is the irresistible narrator of Antoine Wilson's funny and winning second novel Panorama City, which takes the form of the life story Oppen records on tape for his unborn son.Until Oppen was 27, he lived with his father, rode his \"blue-flake three-speed Schwinn\" everywhere, worked the occasional construction job, and everyone in the town of Madera, Calif. referred to him as \"Mayor,\" even the actual mayor. Oppen, a \"slow absorber,\" was born with some unnamed developmental condition that leaves him guileless and nearly illiterate (\"my gift has always been gab\").One day Oppen finds his father dead, builds him a coffin and digs a grave on their land next to the graves of his dad's favorite dogs, as he wished. There are \"general practices outlined in the law,\" Madera's sympathetic police tell Oppen, as they disinter his father and contact his Aunt Liz, who decides he must move in with her in Panorama City near Los Angeles to escape this life of the \"village idiot.\"Brassy Aunt Liz, whose dictates for Oppen's life he hilariously reports, sets him up with a job at a fast food restaurant, a standing appointment with an unskilled psychologist, and friends at the Lighthouse Christian Fellowship.Obliging Oppen goes along with Liz's plans during what he considers a one-month \"clinical trial,\" while secretly focusing on his mission to \"become a man of the world,\" regain his freedom and make his way back to Carmen, a Madera prostitute whom he loves and recently lost his virginity to after he told some friends he'd \"reached twenty-seven without having experience in sexual matters.\"Oppen's observations on life (school is \"an accountability cult\"), religion (the testing of Job was a \"clinical trial [God] wanted to run\"), and work (\"promotions don't come from hard work or honest effort but because a crack has opened up and must be filled\") are wise, fresh, and funny. Panorama City is a delightful journey of philosophical inquiry with a singular narrator who sees past the modern world's scams and deceptions and embraces the less-prosperous people of the San Fernando Valley—minimum-wage workers, homeless, and assorted losers—with an open heart."}, {"userName": "John Martin", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/6065205-john-martin", "userReview": "Without having read many reviews, it seems likely that an easy comparison for Oppen's character would be Forrest Gump - a curious, benevolent, simple man whose quest to become a 'man of the world' propels him through the lives of many different characters whose lives he changes in unexpected ways, and vice versa. But the more I read, the more I thought of Ignatius J. Reilly. Absent the harsh judgment of Reilly, but with an internal monologue of observation and reflection, adventures of both high and low comedy lead Oppen from one beautifully crafted setting to the next. For me, at least, Gump's travels through history became gimmicky and the point in and of themselves. With Oppen, we're limited to more or less 40 days, which leaves more time for Wilson to develop themes and enrich Oppen's character rather than focusing on historical events and figures. I loved the narrative structure and conceit, as well as the biblical overtones, neither of which distracted from the entertaining story. Buried within this seemingly simple-minded character's monologue are hefty philosphical ideas and observations on life, love, god and life's purpose. Acutely rendered descriptions of Panorama City and Southern California, wholly-formed characters and a pervasive sense of absurd humor made this a fantastic read. Part satire, part picaresque and completely entertaining, Panorama City shines from beginning to end."}, {"userName": "Jason Edwards", "userReviewDate": "Oct 23, 2012", "userURL": "http://www.goodreads.com/user/show/377051-jason-edwards", "userReview": "There are two connotations of the word “idiot.” Panorama’s Oppen is not the willfully ignorant idiot, the one who holds intelligence in foul regard and ironically is proud of his stolid foundation. Oppen is the other kind of idiot, the one who’s guileless, more innocent than merely stupid. He’s the village idiot (his aunt’s words) and his “adventures,” although confined to a few small places, are a kind of modern picaresque.Oppen doesn’t tilt at windmills, exactly, and is closer to a Sancho Panza assisting others as they assail pointless endeavors. He’s a fool in as much as he doesn’t understand the people around him are fools as well, trusting in their own trust in themselves. But unlike most of them, he’s no hypocrite, and his earnestness is genuine.Antoine Wilson’s novel is almost as simple as his main character, and through those simple eyes we see how rural American and big city America is more or less the same when it comes to people and their small-world aspirations. The novel begins with death and ends with new life, a nice backwards trajectory, with the main character’s time in-between spent in a sort of purgatory as he finds a way to re-assert his own small-world aspirations."}, {"userName": "Dana Trumpower", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/10793211-dana-trumpower", "userReview": "I liked this story a lot. It was told from the point of view of a man who probably has some form of mild autism. He is socially awkward, but doesn't realize he is different and treated differently. His point of view is so innocent and also very black and white. He really only sees the good in people, except the people who don't make sense to him. The people in his life are so lost and confused, which is maybe why these people don't make sense to him. This novel presented a refreshing point of view, an adult who has to live like an adult yet thinks like a child in his honesty and simplicity."}, {"userName": "Brooks", "userReviewDate": "Jun 04, 2013", "userURL": "http://www.goodreads.com/user/show/1465702-brooks", "userReview": "I feel like how much you like this book will be largely based on how much you like the narrator and his voice. In the tradition of Room and The Curious Incident of the Dog in the Nighttime, the narrator doesn't grasp everything that is going on around him, that is left to the reader. Oppen Porter is the village idiot, his aunt's words, but certainly capable of carrying this narrative and dropping in some funny and clever observations here and there. I loved it from start to finish, even I did see where it was going pretty early on."}, {"userName": "Lisa", "userReviewDate": "Nov 04, 2012", "userURL": "http://www.goodreads.com/user/show/6933402-lisa", "userReview": "A quirky, original book about a mentally challenged guy, who may just be smarter than everyone around him. Interesting characters, as well as landscapes and situations. There's a desert burial, a disheveled but compassionate cop, a strange bus trip, an overbearing aunt, a crazy man in an attic, a brothel, a fast food employee of the month, a religious cult, an ex-con and a beautiful fortune teller. Not to mention, the main character who's certain he will die at daybreak. All of this, and it's snark free. Go figure. I enjoyed my time in this world. I give it four stars."}, {"userName": "Chet", "userReviewDate": "Jan 21, 2013", "userURL": "http://www.goodreads.com/user/show/9405703-chet", "userReview": "Author Antoine Wilson creates a memorable character, a self-acknowledged \"slow absorber\" named Oppen Porter (with a little of Forrest Gump and a little bit of Owen Meany)who will resonate with me for a long time. His story of a forced-at-first, then more-accepting journey toward becoming a man of the world is well told and quickly read, and full of simple, yet deep life-affirming thoughts. I highly recommend this book!"}, {"userName": "Lisa Tener", "userReviewDate": "Feb 02, 2013", "userURL": "http://www.goodreads.com/user/show/2060751-lisa-tener", "userReview": "This book was a surprise. My husband had taken it out of the library but didn't read it. I started it and wondered myself whether I wanted to stick with it. I'm glad I did. It got better and better and I so enjoyed this refreshing character, Oppen Porter, reminiscent of Peter Sellers' character in Being There, but truly a man unto himself. Panorama City was heartfelt, entertaining, uplifting, witty, fun and time well spent. Enjoy."}, {"userName": "Stephanie Steinberg", "userReviewDate": "Mar 19, 2014", "userURL": "http://www.goodreads.com/user/show/16508612-stephanie-steinberg", "userReview": "While this was a well written character study, the character described was of little interest to me. I also found the people he encountered to be quite dull. The descriptions of the book likened it to Forrest Gump. Sure, Forrest Gump if he never went anywhere or met anyone of interest and worked in a fast food restaurant! I kept waiting for something to happen but it never did."}, {"userName": "Brooke", "userReviewDate": "Aug 13, 2012", "userURL": "http://www.goodreads.com/user/show/10202935-brooke", "userReview": "A comical and endearing read. It took me a few pages to get used to the narration (a slightly stream-of-consciousness retelling, given that the narrator is recording his story via cassette tapes from his so-called deathbed), but once I was past that, I really enjoyed Oppen's take on life. The ending was beautiful."}, {"userName": "Josie", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/719392-josie", "userReview": "Panorama City’s protagonist, Oppen Porter, brings to mind the Puerto Rican saying, “Cada persona es un mundo.” This guy’s a self-described slow-absorber who lives a weirdly interesting life that has an internal coherence and yet seems alien to the rest of us. He’s a guy you won’t forget."}, {"userName": "Caroline", "userReviewDate": "Apr 17, 2013", "userURL": "http://www.goodreads.com/user/show/5839959-caroline", "userReview": "My 3 year old daughter handed me this book at the library and said, \"read this\". I'm glad she did! Very well told story! Oppen reminded me a lot of Forrest Gump. Open, lovable man of the world. I would recommend this quick read"}], "description": "With its blend of fool’s wisdom and deeply felt humanity, Panorama City is heir to Marilynne Robinson’s Gilead and Steve Martin’s The Jerk.　From his deathbed*, 28-year-old Oppen Porter—an open-hearted, bicycle-riding, binocular-toting, self-described \"slow absorber\"—unspools into a cassette recorder a tale of self-determination, from \"village idiot\" to \"man of the world,\" for the benefit of his unborn son.　Written in an astonishingly charming and wise voice, Oppen’s account traces forty days and nights navigating the fast food joints, storefront churches, and home-office psychologists of the San Fernando Valley. Ping-ponging between his watchful and sharp-tongued aunt and an outlaw philosopher with the face \"of a newly hatched crocodile,\" Oppen finds himself constantly in the sights of people who believe that their way is the only way for him.　Oppen Porter is \"an American original\" (Stewart O'Nan) for whom finding one's own way is both a delightful art and a painstaking science. Disarmingly funny and surreptitiously moving, Panorama City makes us see the world, and our place in it, with new eyes.* Not really", "title": "Panorama City", "url": "https://www.goodreads.com/book/show/13429688-panorama-city", "average": 3.59, "cover": "https://images.gr-assets.com/books/1333734941l/13429688.jpg", "reviews": 92, "authors": [{"url": "https://www.goodreads.com/author/show/269226.Antoine_Wilson", "name": "Antoine Wilson"}], "type": ["Fiction", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/13429688-panorama-city", "http://www.goodreads.com/book/show/17165931-panorama-city", "http://www.goodreads.com/book/show/773383.The_Interloper", "http://www.goodreads.com/book/show/481741.S_E_Hinton", "http://www.goodreads.com/book/show/1056620.The_Assassination_of_William_McKinley", "http://www.goodreads.com/book/show/15839000-everyone-else", "http://www.goodreads.com/book/show/1056619.The_Young_Zillionaire_s_Guide_To_Distributing_Goods_And_Services"]}