{"ratings": 749, "userreviews": [{"userName": "J.G. Keely", "userReviewDate": "May 13, 2007", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "Milton wrote this while blind, and claimed it was the result of divine inspiration which visited him nightly. There are few texts that could reasonably be added into the Bible, and this is certainly one of them (the Divine Comedy is another). Paradise Lost outlines portions of the Bible which, thanks to its haphazard combination of mythic stories, are never fully explored. In fact, most of Paradise Lost has become tacitly accepted into the Christian mythos, even if most Christians do not recognize it as a source. It also updated not only the epic, but the heroic form, and its questioning of the devil is a great philosophical exploration, even if it may ultimately prove a failure, as I shall try to explain.The question remains: even if the Vatican did not explicitly include it, why are there not smaller sects which so often spring up around such and inspiring and daring work? The answer is that one need not explicitly include something that has been included implicitly. Many readers accept Milton's view of events as accurate and that it was wholly derived from the Bible, when in fact, it is largely an original work.Under Constantine, Hell and the Devil were re-conceptualized. The representation of Hell in the Bible is often metaphorical, and does not include 'fire and brimstone'. Hell is defined as 'absence from God' and nothing more. This is supposed to be a painful and unfulfilling experience, but not literal physical torture. Much of the modern conceptualization of Hell is based upon Hellenic mythological influences and verses from Revelation taken out of context. The place of 'fire and brimstone' is where the Devil and the Antichrist are put after the apocalypse, and is never stated as being related to human afterlife.Likewise, the Devil is most commonly depicted as a greedy idiot chasing after farts. The only tempting he ever does Biblically is during Job, where he must first ask God if he is permitted to interfere. The concept of the Devil as a charming, rebellious trickster and genius is entirely Milton.He portrays him this way to align Satan with the heroic figures of Epic Poetry. This is not because he thinks of the Devil as a hero, but rather so he can show that our heroes should not be rebellious murderers as they were in ancient stories, but humble, pious, simple men.He gives the Devil philosophical and political motivations for rebelling, but has him fail to notice that God cannot be questioned or defeated. However, this requires that one absolutely believe this assertion without ever testing it. Anyone who accepts it unquestioningly (such as C.S. Lewis) is bound to believe that the Devil is foolish to question the natural order.However, Milton himself states that the Devil had no choice but to doubt, and due to our own rational minds, man cannot help doubting either. In this case, we might fall in with Blake, and suggest that Milton was the Devil's man, not because he wanted to be, but because he carried biblical rhetoric to its rational conclusion.This is illustrated in a rather shocking way in the creation of Eve: finding herself, utterly new to the world, she sees her own reflection in a puddle and, finding it beautiful, leans down naively and tries to kiss it. This amusing retelling of the myth of Narcissus indicates that God made women naturally autoerotic and bisexual.Sadly, this never made it into modern Christianity, for some reason, but it does show the strength of Paradise Lost: Milton provides rhetorical support for every idea he explores, even those he did not side with. It is a great book of questions, and a book which demands the reader think and try to understand.We are supposed to sympathize with the Devil because he is heroic and dangerous, but we also know he is the Devil. We know that to sympathize with him is wrong, and that he is supposed to be wrong. Milton here invented the concept of the Devil we cannot help but sympathize with, and who we must fight daily to overcome.He defined sin as doubt, but without realizing that doubt will always deconstruct an old answer and suggest a new one. The fact remains that metaphysically, doubt can only injure us in a realm we cannot know exists. As the enemy of any tyranny--of men, of ideas--doubt is the helpmeet of all who struggle. The Devil is the father of doubt, and the final outcome of doubt is always accepting that we are fundamentally ignorant: either in our believing, or in our not believing.He also uses the English language in an entirely idiomatic and masterful way, his is one of the few unique voices of English. Reading him sometimes proves a challenge for those without a background in Latin, since his sentence structure and particularly his verb use are stripped-down and multipurpose, taking the form of metaphysical poets to its logical conclusion.He is also one of the most knowledgeable and allusive of writers, especially when it comes to the longer form. His encyclopedic exploration of myths, reinvention of scenes, and adoption of ideas make this work one of the most wide-reaching and interconnected in English.This can make his work somewhat daunting for readers, who are often unwilling to read the books he references in preparation for tackling him, which I find rather ironic, since no one complains about having to read ten-thousand pages of Harry Potter before tackling the last book."}, {"userName": "P.S. Winn", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/23133809-p-s-winn", "userReview": "Great poems, written in the 17th century that still seem to reflect today's world."}, {"userName": "Biblio Curious", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/26626256-biblio-curious", "userReview": "Let me think on this one. *goes back to the drawing board*"}, {"userName": "Chris Brimmer", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/2354880-chris-brimmer", "userReview": "A good edition and well annotated. This is one of the foundations of both English literature and the modern English language. If read in context of British culture and politics of the time, one can gain some deep insight into the transition of England from a Catholic medieval society into a Protestant enlightenment one. Paradise Lost is a work by yet another dead white guy that you should none the less be required to read."}, {"userName": "Jules", "userReviewDate": "Aug 02, 2009", "userURL": "http://www.goodreads.com/user/show/9620844-jules", "userReview": "Paradise Lost may have its stakes as the greatest poem written in the English language, but it pales in comparison to Virgil, Homer and Dante. Milton's attempt to emulate the elevated Latin and Greek style (syntactically) only makes his verse sound pompous and arrogant. The only character that entices the dormant imagination is the Byronic Satan who exudes charisma and rebellious charm."}, {"userName": "Travis", "userReviewDate": "Jun 15, 2008", "userURL": "http://www.goodreads.com/user/show/1189380-travis", "userReview": "Although I'm not into spirituality, the writing is absolutely elegant and superb. One of the strongest products of literature I've ever seen. Every line, despite being only a handful of words, evokes such rich and deep imagery I need to force myself to slow down so I can enjoy the deep immersion."}, {"userName": "Hundeschlitten", "userReviewDate": "Jan 09, 2008", "userURL": "http://www.goodreads.com/user/show/446434-hundeschlitten", "userReview": "I was persuing this last winter, and Paradise Lost remains as mind-expanding as ever, action packed, with possibly the richest prose in the English language."}, {"userName": "Sharon", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/6957211-sharon", "userReview": "In 'A Preface to Paradise Lost', C.S. Lewis suggests reading 'Paradise Lost' as if it were true. He used this illustration, \"Instead of stripping the knight of his armour you can try to put his armour on yourself...You must, so far as in you lies, become an Achaean chief while reading Homer, a medieval knight while reading Malory, and an eighteenth century Londoner while reading Johnson.\"  I think this is good advice. If, dear reader, you are not used to reading old books—specifically, epics—I suggest reading 'A Preface to Paradise Lost' before reading Milton's Epic. It will help you cross the \"gulf between the ages\" and experience the story as the author intended.  I enjoyed this story immensely. I liked the plot, rhythm, and imagery. I'll probably read it several times over."}, {"userName": "Sam :)", "userReviewDate": "Feb 01, 2016", "userURL": "http://www.goodreads.com/user/show/33142853-sam", "userReview": "Rating: 3.5 stars\"Better to reign in Hell, than serve in Heaven.\" (1.263)John Milton has set himself to the impossible task of writing the first classic epic poem in the English language. He is determined to justify the ways of God to man, demote the monarchy, and discredit the Christian Church. Using the poetic writing style of English Heroic Verse (without rhyme), Milton will attempt to characterize God (!!!), make Satan, the epitome of evil, his epic hero, tell the story of a war in Heaven, describe the desolation and horror of Hell and the perfection and beauty of Heaven, and create complex characters out of the Biblical classics. All while dictating the entire twelve book epic to his daughters, since Milton is blind. This may seem an impossible task, and Milton certainly ends up contradicting himself on multiple occasions, but overall Paradise Lost ends up being just what Milton envisioned; a classic (and hard to read) epic poem about the ways of God and the corruption of mankind.The Characters: By trying to characterize some of the most recognized figures in all of recent history, Milton has set himself up to disappoint at least some. Satan himself must become more complex than just pure evil, grappling with his decisions and how they affect others. God is, as Milton strives for, a distant and powerful figure. He sends the Son to do all the \"dirty work\", and the reader never actually sees God himself speak. This actually supports Milton's view as a Protestant that God is a more distant figure who shouldn't directly deal with such trivial affairs. Adam as a character was devoted to God, although once he is encouraged by Eve to eat the apple, his faith waivers and he actually becomes submissive to Eve. Eve herself is wanton, vain, and basically not very smart. Milton believed women should be submissive to their husbands and that they were the source of the world's problems (due to his own life experiences), and blatantly shows this through Eve's actions. Probably the most interesting concepts to go along with Milton's characters was the way physical degeneration mirrored moral degeneration. As Satan moved away from his angelic origins and became increasingly evil, the animals he shape-shifted into also degenerated, from an angel to a serpent. Adam and Eve lost their perfect angelic looks once they ate of the Tree of Knowledge, and the culmination of the rebel angels' degeneration happens when Satan returns from Eden and they all transform against their will into monsters.\"...the ascent is easy, then.\"Connection to Ancient Epics: Milton connected many of the classic Biblical stories to classic Greek epics by making references to Greek myths. For example, the Son himself defeats Satan and his rebel angels in battle by riding in on a chariot and striking them with lightning bolts.\"The mind itself is its own place, and in itself can make a heaven of hell, a hell of heaven...\"All in all, despite the horrendously difficult language (although it did get better as I got used to it, I must say) I definitely enjoyed this book and appreciated what Milton was trying to do. I wouldn't have picked it up if I didn't need to read it for school, but that doesn't mean I can't enjoy it! :)P.S. As I wrote this review, my cat was laying on my left arm and purring the entire time..."}, {"userName": "Scriptor Ignotus", "userReviewDate": "Apr 26, 2014", "userURL": "http://www.goodreads.com/user/show/7422525-scriptor-ignotus", "userReview": "Any lover of epic poetry, and the likes of Hesiod, Homer, Virgil,and Dante, will certainly enjoy Paradise Lost, Milton's contribution to the western poetic canon. Seeking nothing less than to justify the ways of God to man, Milton recounts in verse the rebellion of Satan and his angels, their subsequent expulsion from heaven (courtesy of the Son of God), and Satan's vengeance against God in the form of his moral poisoning of God's newest and most favored creation - mankind. I loved much of the imagery Milton creates. I was hooked from the very beginning, when Satan and his followers, newly banished to Hell, hold a meeting in the hall of Pandemonium to debate whether they should hazard a second attempt to overthrow the Almighty, but instead resolve to send Satan on an odyssey to learn more about God's rumored new creation. Much has been made about how sympathetic of a character Milton's Satan is. Integral to the discussion is the fact that Milton was an ardent republican, and served in the interregnum government of Oliver Cromwell after the overthrow and execution of Charles I. The dialogue in which Satan and those angels still loyal to God discuss freedom, the legitimacy of God's rule, and the necessity of rebellion, all have to be approached in this context. Was this poem an \"apology\" of sorts to the restored monarchy of England; a way of demonstrating how easy it is for well-meaning people to get caught up in causes which seem noble, but are in practice ruinous? Or, as others have suggested, was Milton really on the Devil's side, brooding over the lost cause of republicanism? Also of interest are Milton's views on women. It is made abundantly clear, in the characters of Adam and Eve, that Adam exists to serve God, and Eve exists to serve Adam. This will inevitably rub modern readers the wrong way. It is interesting that when Eve first sees Adam, she flees from him, deciding that she would rather look at her own reflection in the water. Adam essentially has to convince her that although men are not as easy on the eyes as women, God nonetheless made the two of them to be together. Women are taken to be pure and somewhat childish people, to be put on a pedestal and admired, but not to be trusted with critical decisions - these must be deferred to the man. Hardly worth mentioning is the fact that in the poem, as in scripture, it is Eve who first tastes the forbidden fruit, before convincing Adam to follow suit. Milton's language takes some getting used to, but once the reader gets used to it, which doesn't take long, it turns out to be exquisite and beautiful. If you love language, Milton's latinized prose and wordplay are a treat."}, {"userName": "ElSeven", "userReviewDate": "Apr 18, 2010", "userURL": "http://www.goodreads.com/user/show/3200705-elseven", "userReview": "Note that this is only a review of Paradise Lost. Lycidas and Samson Agonistes are also included in this volume. They are both great in their own right, but fall beyond the scope of this review.Paradise Lost is truely, truely great, and anything that I could say in this review would only do it an injustice. The Language is daunting, yes. It's stilted, latinate English that would have sounded overblown when it was written, but my word. I can excuse all that and more in this, because it's the language that makes it all work. The words seem to fit, giving everything a sort of primal power that's fitting to a poem that seeks to 'justify the ways of God to men,' and to change any of it, would somehow diminish it.This might be hero worship, because I frankly and freely admit to be a slobbering Milton fanboy. But it's an amazing journey that rewards all the struggles that you make to get though it. The coucil of hell and the confrontation between Satan, Sin and Death in book two; Milton's introduction to book three, and his meditation on his blindness there; Satan's ultimate renunciation of all good, in his pursuit of revenge, in book four; Raphael's war stories to Adam. Adam's constant sort of bumbling self-importance and Eve's patient eye rolling at Adam's condescension. It's an amazing work, with full, complete characterizations, beautifully crafted dialogue, and moments of transcendent literary beauty where all that you can do is wonder at Milton's mastery of his language.It really amazes me that this hasn't been made into a movie, but knowing everything that would be cut out to make it work, it makes me glad that it hasn't. It's a work as full and complete as anything else in the history of language and one of the only books that made me want to turn it over and read it though again immediately after finishing it. Five stars. It really is that good."}, {"userName": "Bret James Stewart", "userReviewDate": "Feb 05, 2015", "userURL": "http://www.goodreads.com/user/show/19232021-bret-james-stewart", "userReview": "The works of Milton are one of those things I had always wanted to read yet never seemed to get around to. I have no idea how I made it through high school without reading more than excerpts, but that is what happened. I remember one of my friends reading Paradise Lost, and he was in the gifted class, so maybe those of us who were less gifted got the shaft. In any case, as it is with any major poet, oceans of ink have been spilled upon the man and his works. There is nothing meaningful I can add in this regard, except to recommend the University of South Carolina’s Milton page, which does include some in-depth information as well as some gorgeous images about the poet and his era: http://library.sc.edu/spcoll/britlit/...I greatly enjoyed this book. I had expected Milton to be dry (a Puritan poet seems almost an oxymoron) as religious poetry sometimes suffers from its lack of creativity, relying, rather, on truth than artistic merit to carry it. There is nothing inherently wrong with this, but this book does not fall within this category. This version is glossed, which I appreciate since my 17th century understanding of the English language is not especially grand. I was happy that I recognized almost all of the biblical references without looking at the footnotes. As with most books of a literary nature, recognizing some of the allusions makes me wonder how many I am missing, although the glossed version rectifies this fear somewhat. Anyone interested in poetry or important English or world literature should read this book. Milton is not old hat nor is he overly difficult. He has been established long enough for there to be many articles and glossaries about his work, and these can help the reader digest the poems. I loved this book, and I hope you do, too."}, {"userName": "Amanda", "userReviewDate": "Nov 24, 2008", "userURL": "http://www.goodreads.com/user/show/1607835-amanda", "userReview": "Paradise Lost was one of the most amazing books I've ever read! It was interesting to see the beginning of the world though a novel. I felt it gave new depth to the actual account in Gen./Moses.I read a chacter and plot synopsis off of Sparksnotes before reading it, and that helped a lot. Adam and Michael were two seperate people, so it made me less confused on who was who. There were MANY things that were wrong in this story, but the language made up for its faults. I thought it was easier to understand than Shakespeare. I felt that God was a little too...aloof? non-understanding? Lacking? It was interesting that God and Jesus were two seperate beings. I liked the fact that Satan, Death, and Sin were family members. It was also cool that after Adam and Eve ate the fruit, Sin and Death built a bridge from Hell to Earth. I thought it symbolized sin and death entering the world rather well. Adam was too arrogant and stupid, while Eve was self loathing. Adam didn't treat her very well... I think our first parents were a little more equal and held more respect for each other than this book portrayed. Eve was almost worshipful of Adam. Again, it was an amazing book! I will most likely read it again."}, {"userName": "Ana", "userReviewDate": "Dec 06, 2009", "userURL": "http://www.goodreads.com/user/show/2138497-ana", "userReview": "Satan I get you. You feel you were treated unfairly. But instead of communicating those feelings to the group, you went ahead and started a war, got yourself kicked out of heaven, disfigured and now your stuck in hell.Forever!So the big G decided to have a few pets (Adam, Eve etc.) No big deal! You had a good thing going. But NOooo! you had to go get all jealous and outspoken. Now what? War? Really? Do you really think you have a chance... in hell?  *Authors note: LMAO :)Nope, you know you don't."}, {"userName": "Tucker", "userReviewDate": "Sep 07, 2009", "userURL": "http://www.goodreads.com/user/show/308912-tucker", "userReview": "This poem has a reassuring, dreammlike meter and beautiful imagery. I'm pondering how Adam and Eve both wanted to know God, but took different approaches: Adam wanted to know God through philosophical or worshipful methods, while Eve took the shortcut of eating from the Tree of Knowledge. Where's the sin, Eve asked?"}, {"userName": "Darren", "userReviewDate": "Apr 04, 2008", "userURL": "http://www.goodreads.com/user/show/931616-darren", "userReview": "This book has an interesting perspective on the devil. There is a line in there that I thought was particularly masterful:\"The mind is its own place, and in itselfCan make a Heav'n of Hell, a Hell of Heav'n.\"I haven't got the hang of the rhyme yet, but the words are majestic and broad (albeit a little difficult to decipher in its entirety). I'm looking forward to finishing it."}, {"userName": "Ryan", "userReviewDate": "Jun 25, 2008", "userURL": "http://www.goodreads.com/user/show/1270513-ryan", "userReview": "Turly an epic, that's for sure. Milton's language is poetry at its best--sweeping, dramatic, and fully of beauty and substance. I'm not a religious person, but I can say that I've been to sunday school and mass, and this book was a much more entertaining way to read about god."}, {"userName": "Paul Franco", "userReviewDate": "Nov 24, 2010", "userURL": "http://www.goodreads.com/user/show/4516300-paul-franco", "userReview": "A few months ago I was taking the funicular in downtown El Lay and saw the sign that called it \"Angel's Flight,\" but I read it wrong, thinking \"Angels Fight.\" I thought, what a cool idea for a story!Then I remembered Paradise Lost. Never mind!"}, {"userName": "Robin", "userReviewDate": "Jun 06, 2010", "userURL": "http://www.goodreads.com/user/show/3833596-robin", "userReview": "While his use of language and creating an interesting story can be looked upon with praise, his portrayal of Eve is nothing short of appalling. I realize it would be impossible for someone not in the 20th century to portray 20th century ideals, but still. It's appalling."}, {"userName": "Jennifer", "userReviewDate": "Sep 23, 2007", "userURL": "http://www.goodreads.com/user/show/341438-jennifer", "userReview": "I am only part way through, but just the descriptions of the generation of Sin and Death are worth reading the book. The language that Milton uses is beautifully precise, although it does not always create beautiful pictures."}, {"userName": "Caleb Aarsand", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/41555548-caleb-aarsand", "userReview": "Paradise lost is an astounding work, and if true that he wrote it while blind from pure divine inspiration- well it just speaks to the power in his words."}, {"userName": "ElizaBeth", "userReviewDate": "Mar 07, 2007", "userURL": "http://www.goodreads.com/user/show/18615-elizabeth", "userReview": "To be fair, I would have enjoyed this more if it weren't taught to me by a drab, sickly old man who smelled of cheap pipe tobacco and puncutated every sentence with a chest-rattling hack."}, {"userName": "Valerie", "userReviewDate": "Jul 15, 2008", "userURL": "http://www.goodreads.com/user/show/1159787-valerie", "userReview": "Such a sympathetic main character."}, {"userName": "Asa Merritt", "userReviewDate": "Dec 16, 2007", "userURL": "http://www.goodreads.com/user/show/10590-asa-merritt", "userReview": "Fantastical. Audacious. Milton linked his piety with his imagination to great success..."}, {"userName": "Cws", "userReviewDate": "May 15, 2008", "userURL": "http://www.goodreads.com/user/show/823026-cws", "userReview": "821.4"}, {"userName": "Mr.", "userReviewDate": "Oct 19, 2008", "userURL": "http://www.goodreads.com/user/show/1596746-mr", "userReview": "2 copies."}, {"userName": "Bob", "userReviewDate": "Jul 01, 2007", "userURL": "http://www.goodreads.com/user/show/161940-bob", "userReview": "A book worth rereading frequently. Its interesting to ponder how the depiction of the prince of darkness by a deeply religious man reads like a modern hero. This Satan has balls, a ethics."}, {"userName": "Olivia", "userReviewDate": "Feb 13, 2015", "userURL": "http://www.goodreads.com/user/show/23304396-olivia", "userReview": "Epic."}, {"userName": "Richard", "userReviewDate": "Aug 16, 2013", "userURL": "http://www.goodreads.com/user/show/5838647-richard", "userReview": "Really Horrible.........."}, {"userName": "Sandy", "userReviewDate": "Oct 19, 2008", "userURL": "http://www.goodreads.com/user/show/1618563-sandy", "userReview": "It's a hard read but once you learn the language...the book is freakin' hilarious and moving."}], "description": "These three major works by the seventeenth-century English poet show why Milton takes his place beside Shakespeare, Dante, Homer, and Vergil. They ring with the unmistakable clarity of genius, with majesty of language, splendor and wealth of detail, and with the deep conviction of a powerful mind. Milton's masterpieces reflect the light of a many-faceted tradition; the intellectual freedom of Greek classicism, the moral passion of Hebrew prophets, the Protestant sense of an abiding religious belief.Here is the ageless art, vital throughout the centuries, of the Puritan who undertook to \"explain the ways of God to man.\"The new annotations for this Mentor edition include the more interesting textual variations of the poems; and record, for the first time in any edition, the far-flung repetitions of phrases, and the scattered fixed epithets, within (and between) Paradise Lost and Samson Agonistes.", "title": "Paradise Lost and Other Poems", "url": "http://www.goodreads.com/book/show/449008.Paradise_Lost_and_Other_Poems", "average": 3.99, "cover": "https://images.gr-assets.com/books/1174869853l/449008.jpg", "reviews": 34, "authors": [{"url": "https://www.goodreads.com/author/show/9876.John_Milton", "name": "John Milton"}, {"url": "https://www.goodreads.com/author/show/61777.Edward_Le_Comte", "name": "Edward Le Comte"}], "type": ["Poetry", "Classics", "Fiction", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/449008.Paradise_Lost_and_Other_Poems", "http://www.goodreads.com/book/show/9835025-paradise-lost-and-other-poems", "http://www.goodreads.com/book/show/106719.Paradise_Lost_and_Other_Poems", "http://www.goodreads.com/book/show/3311653-paradise-lost-and-other-poems", "http://www.goodreads.com/book/show/15997.Paradise_Lost", "http://www.goodreads.com/book/show/336518.Paradise_Lost_and_Paradise_Regained", "http://www.goodreads.com/book/show/16802.The_Complete_Poetry", "http://www.goodreads.com/book/show/258123.Samson_Agonistes", "http://www.goodreads.com/book/show/138144.Paradise_Regained"]}