{"ratings": 7963, "userreviews": [{"userName": "Linda Hart", "userReviewDate": "Sep 19, 2014", "userURL": "http://www.goodreads.com/user/show/2455252-linda-hart", "userReview": "I like what Jennifer, a goodreads reviewer, said,\"one of my guilty pleasures. When I should be reading something 'literary' or something for work, I curl up with one of her books and take a little vacation. She does a great job of making the low country of the Carolinas sing a siren song.\" Her stories are formulaic, filled with great Southern humor, her characters are memorably quirky and real, and everything always ends well. The audio book is charmingly read by the author."}, {"userName": "Karen", "userReviewDate": "Oct 14, 2007", "userURL": "http://www.goodreads.com/user/show/533554-karen", "userReview": "Rebecca suddenly found herself dumped by her husband Nat, and her two kids taken away from her by the courts. She leaves Charleston and heads off to a friends to try and get on with her life. While there, she stops in at a local art gallery in the neighboring Pawleys Island to try and sell some of her watercolor prints and its there that she meets Huey, a man that is about to change her life for the better. He hires Rebecca to work at the gallery, shows her work at an opening, and most importantly introduces her to his best friend Abigail. Abigail, a retired divorce attorney who is hiding on the island as well after both husband and son died. She takes Rebecca under her wing and decides to help Rebecca our with her divorce. As more information is found out about Nat, the better the story becomes. You cant help but love all the characters in Pawleys Island and fight for the underdog."}, {"userName": "Marleen", "userReviewDate": "Feb 04, 2014", "userURL": "http://www.goodreads.com/user/show/1616365-marleen", "userReview": "Always looking for writers that capture that unique southern feel, I stumbled upon Dorothea Benton Frank. As it turned out this was a surprisingly enjoyable read. Not only did it render that incomparable southern atmosphere with Pawleys Island and Charleston as backdrop, but it also provided us with delightful characters, well-established in the area, with ancestors going back centuries. I just loved the eccentric Huey and his entourage of family and friends.There were many captivating elements to this book: a nasty divorce case that is being tried in family court; that was so thrilling and had many comical situations. Then there are the unconditional friendships that were forged and the life-lessons the characters drew after suffering immense losses. It's in the healing process that the growing and self-reflection takes place - I liked that because it's often true. We only learn from our sorrows.Granted, the author did an amazing job - all with wit and good humor - bringing back to the forefront very important values like marriage vows, parental obligations, and that mutual respect in families should be high up there. All great stuff so easily forgotten these days."}, {"userName": "Tammy", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/10001468-tammy", "userReview": "Oh my goodness this was just a joy to read. It is filled with great southern humor. You laugh, you cry, and you just plain enjoy the book. After all of the dark books I have been reading this light airly book has been wonderful. She is writing about dark subjects, but using southern strenght in humor to make you see the light at the end of the tunnel. If you was a short uplifitng book go pick this one up. IF you are from this area you will understand completely.....be perpared for a good chuckle and a box of tissues...."}, {"userName": "Lilli", "userReviewDate": "Oct 02, 2015", "userURL": "http://www.goodreads.com/user/show/761821-lilli", "userReview": "As a person of color, I do not enjoy reading books whose only diverse characters are the manservant and maid to privileged white people. The fact that this story has a modern day setting makes it even less enjoyable - reading about 21st century servitude. The worst part was reading that the protagonist believed the manservant, who was cooking and serving everyone else dinner, enjoyed being included in an out of town travel event when the group stayed in a historic hotel. I'm sure he lived enthusiastically each day to be less than the people he was constantly around."}, {"userName": "Dawn", "userReviewDate": "Aug 24, 2007", "userURL": "http://www.goodreads.com/user/show/306894-dawn", "userReview": "I've loved Dorothea Benton Frank's books since her first one, \"Sullivan's Island,\" came out, and I've always awaited the arrival of her next book. Her books are easy, happy reads that are enjoyable. However, by this book (what, her 5th book?) my interest is starting to wane. They all seem to follow the same formula - woman (sometimes has a child, sometimes not) is unhappy with her life in either NYC or NJ; woman goes back to the Carolina's island on which she grew up (often begrudgingly); woman \"unexpectedly\" finds herself happy and where she belongs; she lives happily ever after. I still have 2 books of hers that I have purchased but haven't yet read, and I will probably read them. However, if one of them doesn't break the chain of predictablility, I will probably stop there."}, {"userName": "Jennifer", "userReviewDate": "Feb 01, 2010", "userURL": "http://www.goodreads.com/user/show/1788274-jennifer", "userReview": "Dorothea Benton Frank is one of my guilty pleasures. When I should be reading something \"literary\" or something for work, I curl up with one of her books and take a little vacation. She does a great job of making the low country of the Carolinas sing a siren song. The smell of the sea and the mud, the sound of waves against the shore and ceiling fans in the night, the taste of shrimp 'n' grits or fried everything...all are vivid and tantalizing in Frank's books.This story is about the healing power of friendship and the importance of our \"inner makeup\" as opposed to our outer shells we show the world once we're gussied up. A great read!"}, {"userName": "WK", "userReviewDate": "Apr 29, 2009", "userURL": "http://www.goodreads.com/user/show/654480-wk", "userReview": "Almost done with this book in audio format. It was read by the author, which sometimes is a big mistake. In Ms. Benton Frank's case, her voice has charm, but I wish she had done a better job of differentiating between characters, all of which are either, likable, quirky & fun, or outragious."}, {"userName": "Schmacko", "userReviewDate": "Jul 17, 2008", "userURL": "http://www.goodreads.com/user/show/1242165-schmacko", "userReview": "A bit of a romantic book and unrealistic. I think this is for housewives in unhappy marriages who want to be rescued by homos and power lawyers. As a homo, I found the lack of self-reflection, the pat villian, and the dismissal of all protagonist flaws offensive."}, {"userName": "Jen Reardon", "userReviewDate": "Jul 09, 2012", "userURL": "http://www.goodreads.com/user/show/4571844-jen-reardon", "userReview": "Loved Hughey..Frank's books are always a good, easy read with a happy ending..helps to clear the mind between too many intense stories.."}, {"userName": "LadyCalico", "userReviewDate": "May 09, 2009", "userURL": "http://www.goodreads.com/user/show/2288360-ladycalico", "userReview": "I had a hard cover given to me as a gift by a friend since I am blessed to live in the paradise of Pawleys Island, at least until a hurricane blows me away. I might have enjoyed it more as a paperback since this kind of light, fluffy chicklit just isn't a book to keep but rather the kind you zip through on a dreary evening and then take to My Sister's Books to trade in for another quick read. Mrs. Frank doesn't seem at home in this part of the Lowcountry and doesn't capture the ambiance and character of the Blessed Isle as well as she does the Charleston area, so it is not her best novel. It was not great literature, but a quick entertaining read."}, {"userName": "Moop", "userReviewDate": "Feb 21, 2014", "userURL": "http://www.goodreads.com/user/show/15835587-moop", "userReview": "A great read about a woman, Rebecca who has been left out in the cold by her husband. She goes to Paulsey Island and begins working in an art studio where she actually sells some of her own work. she then meets a woman, Abigail who was on a leave from lawyering but decides to help Rebecca out and represents her in her divorce case. Her X was quite the scum, having a mistress who he tried to repair with many plastic surgeries. The divorce was quite a case! Her husband had tried to take the house, the two children and the money but lost it all. Rebecca ends up ok as do the kids. Fast and great read!"}, {"userName": "Jeannie", "userReviewDate": "May 26, 2009", "userURL": "http://www.goodreads.com/user/show/1439949-jeannie", "userReview": "I grabbed this book off the shelf at the library, for no particular reason. When I started reading it, I thought it would be about the trials of life, and what we go thru to recover. It also had a good (although admittedly simplified) story of the damage an emotionally abusive spouse can inflict on the self-esteem and self-worth of their partner. It was a good story of friendship, and the ability to persevere."}, {"userName": "Sharron", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/3134338-sharron", "userReview": "Charming characters and story. I will continue enjoy DBF's low country novels. This was another audiobook for me, read by the author. I think I would have enjoyed it more as a DTB. Ms. Frank did not change her speech for the various characters and at first I had trouble knowing who was who. That, and pauses, like a comma, in odd times of the sentences drove me crazy!"}, {"userName": "Kristin", "userReviewDate": "Mar 05, 2009", "userURL": "http://www.goodreads.com/user/show/1969337-kristin", "userReview": "I really like this author, keeps me very entertained and always enjoy the story. This one was fun for me because the entire time I was reading I kept thinking that I knew this story, I had read this book but didn't remember a thing about it. When all finished reading it I knew that I had read it before and still loved it. Very much worth the read, I recommend it to anyone."}, {"userName": "Judy", "userReviewDate": "Feb 23, 2009", "userURL": "http://www.goodreads.com/user/show/749665-judy", "userReview": "I figured this was a fictional island, but now find it is real. between Charleston and Myrtle Beach. I imagine the folks in NC really like it. It was real chicklit, sometimes trying to be more but not succeeding. I finished it (a tribute) and enjoyed it, mostly for its sense of place."}, {"userName": "Tammy", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/48793681-tammy", "userReview": "If all books were this good I wouldn't get anything done. Filled with characters you will love and hate with laughter, anger and everything in between. Add a nasty divorce with a hurricane or two done with page turning southern charm."}, {"userName": "Lisa", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/33340187-lisa", "userReview": "I listened to the audio book instead of reading it myself. The author narrated the book and I think that was a mistake. She really did just \"read\" it out loud to us. I think I would have enjoyed the audio book more if a \"pro\" had narrated it."}, {"userName": "Jane", "userReviewDate": "Mar 25, 2016", "userURL": "http://www.goodreads.com/user/show/2861311-jane", "userReview": "Light beach read and fun to visit the coast of the Carolinas!"}, {"userName": "Marsha Moyer", "userReviewDate": "Apr 10, 2016", "userURL": "http://www.goodreads.com/user/show/8173397-marsha-moyer", "userReview": "Love this author."}, {"userName": "Tasha Thibodeau", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/30991970-tasha-thibodeau", "userReview": "LOL this book. Where to even begin the saga that has been reading this book. I read about halfway through and by that time I felt like all of the characters were one dimensional and so, so snobby. After spending half of the book with these snobby old coots, I thought I would give it up and begin another book; however, giving up on a book is something I save specially for real trash, so I found myself going back to finish it. Hurricane Gaston was probably my favorite character, yes the weather in the book was more personable than the so called people in the book. I enjoyed the few parts about the spirit of the Grey Man, as well as the romantic setting of Pawley's Island, which does indeed sound like a dream but trust me- hurricanes, romantic settings and mention of a ghost did not save this book for me, which is why I gave it one star. Towards the end of the book, one character references their dinner as a \"traditional, 1800's plantation meal, including being served by African Americans\" at this point, I must remind you this book takes place in 2004... just gross. Save yourself some time and read something else."}, {"userName": "Tamara", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/2423009-tamara", "userReview": "Having spent a good part of my childhood in the low country I enjoy books set in those locales. The author captures some of the magic of the Pawley's Island area in the pages which is not an easy thing to do. I also enjoyed the addition of the ghost legends of Alice and the Gray Man which I grew up hearing. I liked that through the main characters we see some of the odd ways that grief can manifest itself. It's not always what you expect. One thing that annoyed me was the way the African American characters were portrayed. It felt like they were stereotyped \"in their place\" on the perimeter. There is one plot twist at the end that I won't give away but I didn't find it believable given the characters' actions and interactions throughout the rest of the book. It felt like a last minute attempt at inclusion that fell flat. Coincidentally, the characters were riding out a hurricane in the story as a tropical storm whipped through the trees outside my windows in real life. That was quite an experience. Overall, I found this to be a pretty good beach read. I needed something light after the dystopian novel I read before it and this did the trick."}, {"userName": "Eileen Mandell", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/51725097-eileen-mandell", "userReview": "Rediscovering life.....I thoroughly enjoyed this book because of visiting Pawleys Island so often. I smiled as the story traveled over roads that I travel & even experienced weather that I had experienced. I enjoyed how this book demonstrated the growing of women of all ages. New carreers, new relationships & new homes were discovered & molded into life changing experiences. It is the story of a brutal divorce and how it effected so many. Even the worst of times allows us to grow, meet wonderful new people & even open our hearts to solid new relationships. Love the book....."}, {"userName": "Carol", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/853793-carol", "userReview": "I was in desperate need of a good story - with good characters that I could care about - and this one filled the bill. The subject matter is not fun, divorce, and all the fall out that brings, but the story and characters are really good and you are rooting for them to overcome. Even the bad guy, the dad, is so bad that there is never a doubt as to his 'badness' and you just have to feel sorry for this girlfriend for being so gullible. I like books where the characters grow and become better people and heal and come to terms with life experiences. One of the few stories lately that I was sad to see end."}, {"userName": "Jennifer", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/2601917-jennifer", "userReview": "Abigail Thurmond and Rebecca Simms are two women at a crossroads in their lives, who both came to Pawleys Island, South Carolina to heal, not knowing how their two lives would interconnect with one another and help them each move forward and become stronger women in the process. This is done with a lot of humor, of course, along with the help of Huey Valentine and his mother, Miss Olivia, whose family has lived on Pawleys Island for generations. This is a fun story about learning how to stand your ground and finding happiness and inner peace again in a beautiful lowcountry setting."}, {"userName": "IrishFan", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/248517-irishfan", "userReview": "Another good story in this series. I liked all the characters from the beginning, except Nat (of course). I kept waiting for Nat to get away with his behavior, that the judge would rule for him, or something like that. glad to see Sami and Evan realized that their Dad was forcing wrong beliefs about their mom onto them and that they could repair the relationship. Sad to see Miss Olivia die at the end, but at least Huey and Byron were free to live their lives in the open."}, {"userName": "Terry", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/6216343-terry", "userReview": "Southern CharmIf you enjoy books about the South, you will enjoy this one too. I loved each and every character as well as the story line. Even when the story is set in modern times, the people capture the essence of a past and a sense of place that I would love to visit and one which, of course, cannot be visited as a tourist."}, {"userName": "Diane Harris", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/21564749-diane-harris", "userReview": "I loved this story line and the characters. Colorful, interesting and relatable. I flew through this one in two days! I could relate to the lead character's dilemma of what to do now that she was 'retired' and how you can take the girl out of the office but you can't take the office out of the girl."}, {"userName": "Jean Tretler", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/47771925-jean-tretler", "userReview": "Good summer reading at the beach or poolside. The story got a bit bogged down in the middle , dismal divorce was a downer. Keep reading, the mood of the story picks up and ends on a heart warming note."}, {"userName": "Diane", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/2547338-diane", "userReview": "Couldn't work a beach vacation into my schedule this summer, so I escaped to Pawley's Island by way of Dorothea Benton Frank's book! While I love other Low Country authors like Pat Conroy and Anne Rivers Siddons, Frank's work is infused with an essential humor the others lack."}], "description": "Dorothea Benton Frank presents a refreshingly honest and funny novel about friendship, family, and finding happiness by becoming who you're meant to be.Catapulted from her home, her marriage and her children, artist Rebecca Simms has come to Pawleys Island, South Carolina, to hide herself from herself. Little does she know that on this \"arrogantly shabby\" family playground, she'll encounter three people who will change her life: a wise and irresistible octogenarian who will pry her secrets from her, a gallery owner who caters to interior decorators and heaven save us, tourists, and a retired attorney from Columbia who's complacent in her fat and sassy life until Rebecca's stormy advent...", "title": "Pawleys Island\n      \n          (Lowcountry Tales #5)", "url": "https://www.goodreads.com/book/show/65403.Pawleys_Island", "average": 4.1, "cover": "https://images.gr-assets.com/books/1442857375l/65403.jpg", "reviews": 354, "authors": [{"url": "https://www.goodreads.com/author/show/36935.Dorothea_Benton_Frank", "name": "Dorothea Benton Frank"}], "type": ["Fiction", "American"], "outlinks": ["http://www.goodreads.com/book/show/65403.Pawleys_Island", "http://www.goodreads.com/book/show/580330.Pawleys_Island", "http://www.goodreads.com/book/show/65402.Pawleys_Island", "http://www.goodreads.com/book/show/6503974-pawleys-island", "http://www.goodreads.com/book/show/996985.Pawleys_Island", "http://www.goodreads.com/book/show/65399.Sullivan_s_Island", "http://www.goodreads.com/book/show/16248139-the-last-original-wife", "http://www.goodreads.com/book/show/18635039-the-hurricane-sisters", "http://www.goodreads.com/book/show/65397.Plantation", "http://www.goodreads.com/book/show/13338545-porch-lights", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}