{"ratings": 7770, "userreviews": [{"userName": "Colby Sharp", "userReviewDate": "Dec 15, 2011", "userURL": "http://www.goodreads.com/user/show/5186758-colby-sharp", "userReview": "When I started reading this book I was thinking 4 stars. Why you ask? If I give all of Jenni Holm's novels 5 stars people are going to start thinking I have an author crush on her.Penny from Heaven was way too good for four stars. It is 23 chapters of amazing. I felt like chapters 19 and 20 were as good as anything I have read this year. I listened to them on my way to school today, and I cried a solid 30 minutes. Here is my list of authors that I think are better than Jenni Holm:-"}, {"userName": "Pamela", "userReviewDate": "Sep 15, 2014", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "I love this book!! Warm – Endearing - Amusing – Honest: “Penny From Heaven.” Set in 1953 New York, it’s historically insightful and feel-good nostalgic. Jennifer Holm, inspired by her own American/Italian family, wrote this for a middle school audience. However, young and old alike will find this coming-of-age story a delight to read. And following the story in the author's notes, Holm includes the connections to her family, as well as many eye-opening facts about the era and Italian/American culture.“School is out, and for the first time in months. I don’t have to worry about Veronica Goodman being mean to me. I used to like school, until this year. I probably wouldn't have survived if Mrs. Ellenburg, the librarian hadn't let me hide out in the library. Lucky for me, Veronica Goodman doesn't like to read.”Eleven-year-old Penny is a hoot! Her humor and philosophical musings had me in stitches. She loves the New York \"Bum\" Dodgers (yes, the Dodgers were in Brooklyn before LA), and listens to all their games on the radio with her grumpy/deaf grandfather or with her favorite uncle who lives in his car. She loves butter pecan ice cream and Scarlett O’Hara the aging family dog. And she’s fond of both sides of her family, but she gets quite annoyed with their inability to come together. Why can’t everybody just get along? And why can’t anyone give her a straight answer about her father? When you’re eleven, there always seems to be more questions than adults are willing to answer. Where’s the honesty in that? Then when a near tragic event occurs, honesty finally spills forth like pennies from heaven. But is it too little, too late?Five – Bright Shiny Copper Stars"}, {"userName": "Josie", "userReviewDate": "Mar 25, 2009", "userURL": "http://www.goodreads.com/user/show/1982795-josie", "userReview": "Penny From HeavenBy Jennifer L. HolmPublished by Random House2006Historical FictionJennifer Holm has taken her personal family history and crafted an excellent work of historical fiction in Penny From Heaven. Holm's book is funny, moving, and a joy to read. Incoming sixth graders, girls especially, will have a hard time putting it down. The writing is quick and smart and the characters are round and very dynamic. This, in addition to the vignette style chapters that comprise Penny's summer make for a page turner of substance.The book follows Penny and her family throughout the summer of 1953. She lives with her mother, grandmother and grandfather, since her father died when she was young. She still remains close to her fathers large Italian family and is always being encouraged to eat more by them. Penny is an 11 year old like many other; she likes baseball, ice cream, a special boy, her dog, family and getting into trouble. She dislikes: mean girls from school, not being allowed to go to the swimming pool, her grandmother's cooking and her mother's new boyfriend. Penny has a lot of fun working in her Uncle's store and playing with her cousin over the summer, but this all comes to an abrupt end after a serious injury. Throughout the novel, Penny learns more about her family, the past and eventually looks towards a new future.This book has laugh out loud moments balanced expertly with real emotion and sadness as well. Holm grabs her readers with detailed and thoughtful writing and runs them through the gamit of feelings one experiences as an 11 year old and a 22 year old as well (from my own experience). Every time Penny mentioned how awful her Me-me's cooking (and it was often) was I laughed. Writing in the first person, one really gets to know Penny and how smart, funny and thoughtful she is. A great scene is when Mr. Mulligan the milkman, her mother's new beau comes to dinner. Penny makes sure to make him squirm, giving him a large helping of Me-me's infamous peas and onions, \"Mr. Mulligan, would you care for some peas and onions?\" I ask in a sweet voice\" (134). While there are funny moments, there are also extremely touching moments, especially while Penny is in the hospital. She learns the truth of her father's death and grapples with serious issues like death, prejudice, forgiveness and her mother falling in love again. Penny from Heaven is a book that has such a wide range of events and feelings, but never seems crowded or over done. I think this will allow for every reader to grab on to at least one theme, character or event that they can relate to. For me, I found myself relating a lot to Penny's loss of a pet and her first crush. Though set in a different time period, the themes and emotions certainly transcend time."}, {"userName": "Peter Panic", "userReviewDate": "Jun 15, 2008", "userURL": "http://www.goodreads.com/user/show/344061-peter-panic", "userReview": "For some ungodly reason I keep reading Newberry books. At one point I wanted to be the Newberry specialist, but instead I became hooked on them since I figured out the formula. I'm especially surprised that this was nominated though. While it contained one of the three elements that secretly qualified it for what is ALWAYS ine a Newberry book (war) it wasn't that interesting and frankly the 50-isms would go over kids heads. Heck most of that crap was just foreign to me, if I didn't recall my mother complaining about her crinoline dresses and patent leather shoes, I'd be lost in the pages and would have to rely on back to the future as my guide to 1950. However I did learn that the Brooklyn Dodgers were reffered to as \"Dem Bums\" and only in the last few pages did I learn about the racism and internment camps the italians had to endure during Roosevelts presidency. I almost want to wiki the information, almost. ANyway while it was enjoyable enough for me to read, I pretty much wished that I never bought the proof."}, {"userName": "Ch_hayley Medsker", "userReviewDate": "Feb 26, 2010", "userURL": "http://www.goodreads.com/user/show/3156482-ch-hayley-medsker", "userReview": "Penny From Heaven by Jennifer Holm is a story of a young Italian American girl growing up in New Jersey in 1953. Penny is orphaned by her father from the time she was a baby. Throughout the novel, 11 year-old Penny struggles with many questions about her father, whom no one will speak about. Thus, this leaves her questioning her own identity as well. While Penny lives with her mother and her “boring old American” grandparents, Me-me and Pop-pop, her life is consistently filled with her enormous, loud, and “typical” Italian family. She visits them often, as they live nearby, and they treat her like a princess. Penny also spends her days with her mischievous and trouble-making cousin Frankie. Yet, throughout the novel, several important events occur in the protagonist’s life. While still dealing with the unspeakable and tragic death of her husband, Penny’s hard-working mother attempts to normalize her life, by going out with the girls and dating men, specifically, Mr. Mulligan, the neighborhood milkman. This predictably bothers Penny to no end. Additionally, she develops a crush on a boy and is left-out by many of the girls at school. However, her relationship with her family seems to be the priority in Penny’s life. A tragic event uncovers family secrets, and in the end brings them all together again. Holmes did a fantastic job at portraying what life was like for a pre-teen girl during this time period. Her realistic and authentic manner in which she depicts life for this young girl and many Italians is remarkable. Small insertions, like the family’s fear to speak Italian in public, the love of the baseball team the Dodgers, or the fear of contracting Polio make this a very believable work of historical fiction. Yet, the manner in which the family communicates with each other and raw emotion all appeal to the novel’s literary and narrative elements. The book was inspired on her family’s own story and based on her mother’s real life experiences. This book is geared toward middle school aged students. The prior knowledge that a reader brings to the novel is essential in truly grasping the concepts and events that occur in Penny From Heaven."}, {"userName": "Mary", "userReviewDate": "Nov 01, 2009", "userURL": "http://www.goodreads.com/user/show/2750233-mary", "userReview": "From BooklistGr. 5-8. Penny lives with her \"plain old American\" mother and grandparents, but she has an open invitation to visit her deceased father's Italian family, where the delicious aromas are as inviting as the boisterous relatives who welcome her. Against the backdrop of these contrasting 1950s households, the author of Newbery Honor Book Our Only May Amelia (1999) charts the summer of Penny's twelfth birthday, marked by hapless episodes as well as serious tensions arising from the estranged families' refusal to discuss her father's death. Penny is a low-key character, often taking a backseat role in escapades with high-spirited cousin Frankie. However, Holm impressively wraps pathos with comedy in this coming-of-age story, populated by a cast of vivid characters (a burping, farting grandpa; an eccentric uncle who lives in his car--\"not exactly normal for people in New Jersey\"). Concluding with a photo-illustrated endnote explaining Holm's inspirations in family history, this languidly paced novel will appeal most to readers who appreciate gentle, episodic tales with a nostalgic flavor. Hand selling may be necessary to overcome the staid jacket illustration. Jennifer MattsonCopyright © American Library Association.I really enjoyed this book for a number of reasons. The characters were strong and well-defined. I really associated with Penny through her struggles with her family and the differences between the two. The relationship between Penny and her cousin, Frankie, was awesome. What I really enjoyed about this book, and the whole genre of historical fiction, is the ability to teach about history through fiction. If I wasn't in this class, I would probably enjoy reading this story simply for the story of Penny and her family. The storyline and characters are strong enough to support a story. However, what I will walk away with, after reading this book, is the knowledge about how Italians were treated at this time in history! I had no idea! Curfews, internment camps! This was a great story, but an even better history lesson."}, {"userName": "Betsy Ross", "userReviewDate": "Feb 04, 2016", "userURL": "http://www.goodreads.com/user/show/52279554-betsy-ross", "userReview": "A very enjoyable and fun read peppered with enough adventure, humorous mishaps, and tender coming of age moments to send you on an emotional journey along with Penny. Set in 1953, the book gives you a chance to experience Penny's life, her triumphs, and downfalls, all through her eyes. Living with her grandparents on her mother's side- Me-me and Pop-pop, and spending time her crazy Italian side of her family, Penny has plenty of opportunity for thrills and lots of trouble. With her main partner in crime, her cousin Frankie (who collects prayer cards from funerals), an Italian Nonny who bursts into tears every time Penny's dead father is mentioned, doting uncles, and an impending romance between her mother and the milkman, Penny's days resemble a roller coaster with all the ups and downs imaginable. This particular time in her life forces big changes and new understandings to her perspective. Through laughter, tears, and all the in-betweens, Penny learns, changes, and grows. By the time you're finished reading, you can't help but feel as though you have as well. Chop-packed with humor, adventure, romance, and tragedy, this tender story following an 11-year coming to terms with her father's death, along with her personal discovery of who she is and her place between cultures and in the world will touch you to the core."}, {"userName": "Quigmiss", "userReviewDate": "Nov 22, 2008", "userURL": "http://www.goodreads.com/user/show/1592463-quigmiss", "userReview": "I really really really liked this book!! i read it for a historical fiction book report, and history isn't my absolute fave,but it was not bad because penny falucci, a girl living in the fifties, has the same worries, thoughts and view points of life as most 11 and 12 year old girls. her dad died when she was really young so her many spontaneous, aunts and uncles always are trying to cheer her up whenever they're with her, which is most of the time. my favorite falucci family member is aunt gina. i even think her fights with nonny are funny. but even though penny likes baseball she has a girly side and looks up to aunt gina as a role model. and i like how she gives her a makeover and makes her feel pretty. i also think ellie's parents are funny with their little quirks: burping, bad jokes and terrible cooking. but they still were funny and sweet i think.this book is funny and touching, i got a little emotional towards the end... but that's how you know it's a good book. ;) read this book and i guarantee you'll love it."}, {"userName": "L-Crystal Wlodek", "userReviewDate": "Feb 20, 2010", "userURL": "http://www.goodreads.com/user/show/3151534-l-crystal-wlodek", "userReview": "Penny From Heaven is a Newbery Honor book and is intended for students in grades 6-8. This book is based on the author’s own Italian American family. It depicts the 1953 time period when being Italian meant you were the enemy. The book also is rich in its description of families, more specifically about the things that separate them and being them together. Penny’s life is not easy, having a father that is deceased, an uncle living in a car, and the two sides of her family not speaking to each other. Overall the book has many layers and themes including history, love, laughter, and the importance of family. This is both a heartwarming and sad story, as many coming of age events occur for Penny. With her father being deceased, Penny is torn between her maternal side of the family and her father’s large Italian family, who is still extremely important to her. In addition, not having much money, having an uncle who lives in a car, as well as having a tragic accident happen to her forces her to grow up much faster and have maturity beyond her years. Overall, this book is very enjoyable because while it contains historical information, it pulls the reader in by being emotionally appealing. Any reader will be able to relate to this book because of the importance that is placed upon love and family, despite the difference in the time period and experiences. The author’s note at the end also greatly adds to the book."}, {"userName": "Saira Shah", "userReviewDate": "Feb 10, 2012", "userURL": "http://www.goodreads.com/user/show/7528907-saira-shah", "userReview": "A Penny From Heaven is an outstanding book! Penny from Heaven is the story of 12-year-old Penny Falucci, an Italian-American girl growing up in the 1950s. Her father died when Penny was very little. She and her mother live with her grandparents. Her grandmother, Me-Me, is a horrible cook, and Pop-Pop, the grandfather, is constantly working on the plumbing and causing leaks. Penny’s mother works very hard and is struggling to make a life for herself. This summer begins like any other with Penny and her favorite cousin Frankie playing baseball, delivering meat from their uncle’s butcher shop, and hanging out, but things start to take a turn when Penny starts to spend more time with her dad's side of the family and when her mom starts dating Mr. Mulligan, the milkman. Penny and Frankie encounter many exciting adventures throughout the book. I highley recomend reading this book to all kinds of readers!"}, {"userName": "Lydia", "userReviewDate": "Mar 05, 2016", "userURL": "http://www.goodreads.com/user/show/30400355-lydia", "userReview": "This book nearly made me cry which is quite a feat! I admit to tearing up at least three times. I loved getting to learn about an Italian family during and after WWII and all of the struggles they went through. A fascinating way to learn some history! The only con I can think of is a little bit of superstition which was mostly treated with doubt and humor. I would recommend this book to anyone. Oh, and I want and Uncle Dominic please! :)"}, {"userName": "Rebecca McNutt", "userReviewDate": "Dec 06, 2015", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Penny from Heaven is about a girl with a dysfunctional family, and her dream is to have a great summer without them spilling over into it. Taking place in the 1950's, this book evokes all the freedom and emotion of the season and has a great message for readers."}, {"userName": "Abby", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/26010786-abby", "userReview": "I loved this book :) I think it is okay for 9 and up, but I liked it. It's been a while since I read it"}, {"userName": "Michael Fitzgerald", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/151004-michael-fitzgerald", "userReview": "The stereotypes never stop. Italian side of the family with names like Nunzio, Ralphie, Sally, Dominic. Is this the Sopranos? Goodfellas? The Godfather? Of course, there's an Italian man who wears a wifebeater who beats his meek and submissive wife. Of course. At the meat shop, Uncle Ralphie is constantly giving away extra meat and extending all kinds of credit to his customers. \"No, no, no. Take it. I insist.\" Straight from a movie (or three). The other side of the family has a caricatured senile grandfather.Holm's historical sense is again weak and shallow. We get specifics named: \"1940 Plymouth Roadking,\" \"1950 Cadillac Coup de Ville,\" \"Fibber McGee and Molly,\" \"Toni home perm,\" but that's it. It's just name-dropping and box-checking. The Dodgers game is particularly egregious in its pointless naming of (relative) celebrities. Must we be told the name of the ballpark organist? I found the 11-year-old having discussions with her mother about mom's dating to be at least a quarter of a century too early. Likewise, how Penny (mis)behaves in front of a guest isn't believable for the time period. There seem to be only a few topics that Holm wants to tell us about, so she returns to them over and over in her various historical fiction books: dead bodies (especially the idea of corpses coming back to life), buried treasure, and mixed marriages. It does get tired. And there is an abundance of urination and defecation. Must we?"}, {"userName": "Sarah", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/1748363-sarah", "userReview": "This was really interesting historical fiction. I was fascinated by the afterword, and also by what a good author Jennifer Holm is, particularly in thinking about all the different kinds of stories she writes. I loved it that this was historical, but let's be honest-not a very popular (for kids, anyway) time period. 1950s and all the details of Italian American life in NJ are there. I'm so glad I finally read this because I'll definitely be recommending it many readers."}, {"userName": "Laura", "userReviewDate": "Aug 17, 2010", "userURL": "http://www.goodreads.com/user/show/187043-laura", "userReview": "Now that the New York Times has deemed it acceptable for adults to read young adult books, I guess I can review without shame. Anyway. Penny Falucci, a hardcore Brooklyn Dodgers fan growing up in New Jersey, is having a hard time as she turns 12 in 1953 -- her father died when she was a baby; her father's family and her mother's family won't talk to each other; her favorite uncle lives in a car in his mother's driveway; her favorite cousin is a budding gangster (he thinks being a criminal would be \"neat\"); and her maternal grandmother, with whom she lives, is the worst cook in the history of the world. What's more, her mother has just started to date the milkman, and she's grounded for the rest of the summer because she went, against her mother's strict orders, into a public pool, where she's sure to catch polio. Most oddly of all, no one in the family will talk about her father or how he died. The book is somewhat langorously paced until the middle, when Penny's life takes a dramatic turn, but the characters are so well drawn and Penny's voice is so distinct and likeable that the relatively slow narrative doesn't matter all that much. (And the reveal about Penny's father will recount about an incident in American history you likely don't likely know about already.) Nicely done, if not overly exciting, period piece."}, {"userName": "Samantha", "userReviewDate": "Feb 23, 2010", "userURL": "http://www.goodreads.com/user/show/135429-samantha", "userReview": "Penny from Heaven is a middle school/junior high novel is about a young girl named Penny in the 1950s. Penny lives with her mother and maternal grandparents. She has a relationship with her father's family, but her mother does not. She struggles with finding out the truth about her father's death, the way her life is evolving, and her own cultural identity. Her father's side is a stereotypical Italian family, while her mother's family does not seem to have a cultural identity. She gets into some trouble with her cousin through some childish antics. Penny eventually finds out the truth and comes to terms with some of the changes in her life after a terrible accident. I liked this book. I thought it was a hopeful story. I am not Italian, but I felt as though I could relate to different parts of her story. I really wanted to know what was going to happen to her. The story is set in the 50s, but the references to the war and other dated material does not impact understanding. I would use this novel during a unit about the world wars or injustices that have happened to certain ethnic and racial groups."}, {"userName": "Heidi", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/1705036-heidi", "userReview": "It’s the summer of 1953 and Penny (whose real name is Barbara Ann) Falucci turns twelve. She lives with her widowed mother and maternal grandparents, Me-me and Pop-pop. However, she spends a lot of time with her father’s Italian family who are humorous and colorful characters. Her overprotective mother won’t let her swim in the public pool or go to the movie theater for fear of catching polio.When Penny’s right arm gets pulled through a washing machine wringer, she learns the truth about her father’s death which has been kept a secret from her and why her mother has stayed away from her former in-laws. She learns that her father died in an internment camp after being sent there due to owning a radio that Italians weren’t allowed to have. Since he never became an official American citizen when he left Italy as a two year old, he wasn’t allowed to travel to certain places or own certain items such as radios, flashlights, cameras, etc. Even though this story does mention an ugly time in American history, there are humorous moments throughout. This coming-of-age story is about families and offers a feel of nostalgia. A heartwarming read."}, {"userName": "Jan", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/41584-jan", "userReview": "This is a classic children's fiction novel, one that quietly and eloquently gives us a snapshot of what it is like growing up in an Italian American family living in Brooklyn just after World War II. Based upon the author's own family, we are introduced to eleven-year-old Penny, whose father has died mysteriously during the war. He was not a soldier, so all Penny knows is that he became sick and died. Although both sides of Penny's family love her, she must often walk a tightrope between her father's Italian American relatives and her mother's \"plain old American\" family. Penny doesn't want to choose sides. She loves all her eccentric relatives, including a homeless uncle who lives in a car and a burping, farting grandpa. She also loves going on adventures with her troublemaker cousin, Frankie.This novel is most definitely for those who enjoy characters in fiction. The story moves slowly and takes it's time. Kids who like high action fiction may have trouble with this one at first, but they should stick with it, as it is a rewarding book to read."}, {"userName": "Chelsey Stotler", "userReviewDate": "Apr 08, 2012", "userURL": "http://www.goodreads.com/user/show/7731946-chelsey-stotler", "userReview": "This book is told from the perspective of eleven-year-old Penny Fulucci. The setting is 1950 in post WWII New Jersey where Penny lives with her mother and grandparents. Penny’s father the one that named her “Penny” died when she was a baby. Penny’s fathers side of the family is Italian and gets to see Penny quite often. While visiting her Italian family Penny gets to spend time with her cousin Frankie and other relatives. They embrace Penny with their heritage. With time Penny finds out about her fathers death when a tragic event uncovers family secrets and in the end brings them all together again. This book really shows what it was like to be a pre-teen girl living during this time. Penny deals with many issues including: boys, her mother dating, loss of a father, finding her identity. Her family even had a fear of speaking Italian in public places. This book was a fun read. I did not really connect with the characters on a personal level, but I was quite interested in Penny's story. This would be a great read for young readers."}, {"userName": "Breanna Haynes", "userReviewDate": "Apr 14, 2013", "userURL": "http://www.goodreads.com/user/show/17134397-breanna-haynes", "userReview": "I thought that the story was compelling and relatable to children. A lot of children go through family struggles, and this book covers that. It is also a book about going through adolescence and self-discovery. I also think that the information is presented very accurately. This book take place in the 50’s right after WWII and it really makes you feel like you are there. However, it still keeps the characters relatable. The plot is developed really nicely, and answers all of your questions. The story is resolved by her family making up and coming back together in the end which gives the story a very nice ending. The characters feel really real and like you actually know them. They are very relatable. The setting is wonderful; you get so many details that you feel like you were really there. I also think that the style was wonderful because you are getting the story form the point of view of an eleven year old girl. I think that this book would be a really great read for young adults, and would serve a very great place in my future classroom library."}, {"userName": "Katina", "userReviewDate": "Mar 02, 2010", "userURL": "http://www.goodreads.com/user/show/3151522-katina", "userReview": "I enjoyed learning about Penny's two families. Penny's father has died and no one in her family has ever told her the real reason how. The book begins by explaining how Penny was given her name. \"I think about Heaven a lot. Not because of the usual reason, though. I\"m only eleven, and I don't plan on dying until I'm at least a hundred. It's just that I'm named after that Bing Crosby song, \"Pennies from Heaven.\"She spends Sundays with her father's family enjoying the typical Italian feast. When her mother begins dating the milkman she fears her life will change. She loves the attention she receives from her father's family who treat her like a princess. The story continues sharing stories about Penny's everyday life. I don't believe there will be a climax to the story but there is, an unexpected one, near the end. Penny finally learns the truth about her father's death and accepts life is full of changes."}, {"userName": "Ellie eden King", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/23287307-ellie-eden-king", "userReview": "Penny From Heaven is about a girl named Penny who lives with her mom and her grandma. It is set in the 1960's where lots of people are getting polio. For that reason her mom won't let her swim. To make matters worse her uncle lives in a car, her other grandma cries when she hears her dads name, and her mom hates her dads side of the family. Find out what happens when her and her cousin find treasure in her dads household. There is one lucky penny that saves her. This book is one of my favorites."}, {"userName": "Wendy", "userReviewDate": "Dec 07, 2008", "userURL": "http://www.goodreads.com/user/show/378822-wendy", "userReview": "Fairly interesting, with plenty of funny bits, but I have no clue why this got attention from the Newbery committee. It was like watching a so-so episode of the (excellent) TV series Brooklyn Bridge. It's all sweet and nostalgic, but where's the plot? I haven't gotten a chance to read the author's note (I listened to the audio book, which was really well done), but I say again, as with Roller Skates, that if you're going to turn memoir into fiction, you ought to tighten and plot; otherwise, just write a memoir and be done with it."}, {"userName": "Alina Torres", "userReviewDate": "Oct 28, 2015", "userURL": "http://www.goodreads.com/user/show/46500758-alina-torres", "userReview": "i think this book is pretty interesting because it is about a girl who is dreaming about the perfect summer. with butter pecan ice cream basketball and swimming. But it doesn't exactly go that way her father died when she was young so every time her nonny his name she cry's also she cant go swimming because her mom is afraid that she will get polio. Her mom is dating the milk man and her favorite uncle is living in his car. So if you like books about drama and problems than i think you will like this book alot."}, {"userName": "Cherylann", "userReviewDate": "Aug 10, 2010", "userURL": "http://www.goodreads.com/user/show/2426596-cherylann", "userReview": "I was underwhelmed by this novel. First person narration, in my opinion, usually means a strong protagonist. This protagonist did not have a strong voice. Additionally, I felt like the author spent a lot of time telling me what was going on instead of showing me the action and characters. Redeeming quality: The book focused on an aspect of World War II that I was unaware of. Since I walked away with a little more knowledge and a curiosity to find out more, I gave the book 3.5 stars."}, {"userName": "Sarah Stewart", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/4597485-sarah-stewart", "userReview": "I enjoyed this book very much. It felt very authentic historically and its refreshing to read something about an era that isn't written about very much. Everyone seems to skip the 50's in a rush toward the 40's and 60's. The character development was fantastic--I actually cared about the characters and they had interesting learning curves. Frankie was pretty awesome!"}, {"userName": "Carrie", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/12859472-carrie", "userReview": "This was a wonderful book. I absolutely loved it. My sister married into an Italian family, and so many of the stories ring true. Penny is a great protagonist, sweet but not too sweet, in fact, altogether realistic. It is a tragedy of sorts, but not one that leaves you sad. Be sure to read the authors notes and check out the pictures at the end."}, {"userName": "Niki (Daydream Reader)", "userReviewDate": "Dec 06, 2011", "userURL": "http://www.goodreads.com/user/show/6152323-niki-daydream-reader", "userReview": "I recommend the audio. I enjoyed the reader. This is the first chapter book that I read by Jennifer Holm and I loved it. I really enjoyed all the kookie characters in this story and the wild situations that they get in. I also kept thinking....what happened to her dad and how did he die?! My favorite character was Uncle Dominique...such a sweet character and my heart ached for him."}, {"userName": "Willa", "userReviewDate": "Jan 21, 2015", "userURL": "http://www.goodreads.com/user/show/35048086-willa", "userReview": "I LOVE this book. It takes place in 1953 and 11 year old Penny is living with her mom, grandpa, grandma, and has plans for the best summer ever. But that doesn't go the way she wants it too.(don't want to spoil book ;) )"}], "description": "It's 1953 and 11-year-old Penny dreams of a summer of butter pecan ice cream, swimming, and baseball. But nothing’s that easy in Penny’s family. For starters, she can’t go swimming because her mother’s afraid she’ll catch polio at the pool. To make matters worse, her favorite uncle is living in a car. Her Nonny cries every time her father’s name is mentioned. And the two sides of her family aren’t speaking to each other!Inspired by Newbery Honor winner Jennifer Holm’s own Italian American family, Penny from Heaven is a shining story about the everyday and the extraordinary, about a time in America’s history, not all that long ago, when being Italian meant that you were the enemy. But most of all, it’s a story about families—about the things that tear them apart and bring them together. And Holm tells it with all the richness and the layers, the love and the laughter of a Sunday dinner at Nonny’s. So pull up a chair and enjoy the feast! Buon appetito!", "title": "Penny from Heaven", "url": "http://www.goodreads.com/book/show/89377.Penny_from_Heaven", "average": 3.98, "cover": "https://images.gr-assets.com/books/1320470906l/89377.jpg", "reviews": 746, "authors": [{"url": "https://www.goodreads.com/author/show/137561.Jennifer_L_Holm", "name": "Jennifer L. Holm"}], "type": ["Historical", "Childrens", "Young Adult", "Historical", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/89377.Penny_from_Heaven", "http://www.goodreads.com/book/show/2328359.Penny_from_Heaven", "http://www.goodreads.com/book/show/790364.Penny_From_Heaven", "http://www.goodreads.com/book/show/24612600-sunny-side-up", "http://www.goodreads.com/book/show/6871737-turtle-in-paradise", "http://www.goodreads.com/book/show/476909.Queen_of_the_World_", "http://www.goodreads.com/book/show/19156898-the-fourteenth-goldfish", "http://www.goodreads.com/book/show/409184.Our_Only_May_Amelia", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}