{"ratings": 129423, "userreviews": [{"userName": "Anne", "userReviewDate": "Oct 02, 2015", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "I knew a little about Iran. Not much, but a little. I knew it had been through a lot of changes, and that most of those changes had been steps backward when it came to personal freedom.Here's a cool little 1 minute video that gives you a visual look at some of the changes in style, if you're interested.Alright. What I didn't know was the hows and whys. And to be honest, it never occurred to me to delve much deeper. There was a revolution, some religious nutters took over, and then everyone started dressing like they were back in the stone ages.People in my country choose to wear burkas, so I just assumed most of the people in Iran thought it was a good thing.Now, maybe my original views sound sort of stupid, but in my defense, I honestly don't understand why anyone does anything when it comes to religion. So covering yourself head to toe doesn't sounds any weirder than not using birth control, avoiding certain foods, or refusing medical treatment. And don't get me started on that My Husband is the Head of the House shit...My point is, if people willing do those things because of religious beliefs, why not clothing stuff? Hello? Amish, much?But really this story is about much more than just clothes. It's about the slow and methodical war waged on freedom of any kind in Iran, and it's told through the eyes of a woman who lived through it as a child.Since she comes from a wealthy and educated household, you get a different perspective than maybe you would otherwise. Her parents are actively protesting the changes, while also trying to maintain a sense of normalcy in their home. Growing up in a home like that made an impression on her, and you can see how she bucks and rebels as she approaches her teenage years. She wasn't raised to be quiet and docile, so she chafes under her country's regime. My son and I read this one right around the same time, and he thought it was an incredibly enlightening story, as well.Actually, he said something like this:Hey, that was pretty cool. I didn't know any of that stuff happened in Iran. High praise from the teenager!Anyway, I'm looking forward to reading the second part of this story, because...That Ending!"}, {"userName": "Nat", "userReviewDate": "Jun 13, 2016", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "Persepolis is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. It was an eye-opening, heartbreaking and thought provoking book— I had many thoughts and feelings while reading, so much so that I had to put it down multiple times to take a breather.I was in a haze for a very long time after finishing it— and I kept questioning everything in my surroundings.Here are some instances that made me put down the book and think for a while (they contain *spoilers*):\n\n\n(Those final moments broke my heart.)\n\n\n\n\n\n\n\"He never got to see his son\" resonated with me deeply.The relationships between the families, especially between Marji and her mother, also hit home for me.There was one instance in particular that stayed with me— when her mother was willing to sew posters into her own coat just to bring them back to her daughter without marks.\n(It actually hurt when she thanked her father first.)And the feelings of fear and terror and bravery Marji felt during the war were captured in such an honest way that I couldn't help but feel them with her.\n\nThe incredibly supportive women and men in Marji’s life were inspiring. They all held a significant part in her journey, and it just made me tear up towards the end, especially when Marji left for Vienna.\n\n\n(I just... I keep looking at that last frame and tearing up.)\n\nAll in all, this graphic novel was a complete game-changer for me, and I seriously cannot believe it took me so long to pick up.*Note: I'm an Amazon Affiliate. If you're interested in buying Persepolis, just click on the image below to go through my link. I'll make a small commission!*\nThis review and more can be found on my blog."}, {"userName": "Bookshop", "userReviewDate": "Jul 29, 2007", "userURL": "http://www.goodreads.com/user/show/233375-bookshop", "userReview": "They are among the rare books that I give a 5 which means:a. they will come with me wherever I gob. I will read them again and again until I remember every single sentencec. I will not lend them to people :p.Tita introduced me to these books. I have been very interested on Iran and was even contemplating to read the autobiography of Farah Pahlavi, the Empress of Iran. After repeated visits to the bookshop to flip the pages of this autobiography, I wasn't sure if I wanted to part with my money for the typical self-indulgent autobiography.So Persepolis immediately caught my interest and I wasn't disappointed.The books tell an honest and poignant story of a well-to-do family during the political turmoil in Iran from the perspective of the little and, in book II, adult Marjane Satrapi. The story is told thru' a stark black and white drawing. I marvel at her ability to present only relevant and interesting highlights of her life and Iran and meld them all to one solid, flowing story. They are sometimes tragic moments but told without self-pity. In between, there are generous doses of light, funny moments. I laugh and I cry reading this book.One of the most powerful parts for me is when the parents, who love her so much, let her go to study in Austria. She talks about how horrible goodbyes are and how important it is not to look back after you say your goodbyes. You can be scarred with the image you see when looking back. How true...I won't say more about these books. All I can suggest is read them. You won't regret it. They open mind to what hardship can be when freedom of self is not allowed. They are enganging. They are entertaining. They are sad. They are funny. They are everything I hope a book can be.Thanks Tita."}, {"userName": "Mohammed Arabey", "userReviewDate": "Jul 27, 2016", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "A story about a very sweet lovable rebellious young girl from Iran..No, sorry..it's a story of a free family under tyrant rule..A story of once great country,Kingdom that retreat 1000 years back.Marjane has dreams..Dreams of Good life, Good deed, equality, prospect, freedom.Then came the revolution which call for all that. To down the coup tyrant government.But alas, the revolution got its own coup, named after a way-better-than-this-religion..even more tyrant..\nWhy - for me, as Egyptian- all this political events feels so familiar? Like having a Deja Vu?One thing I learned here..History has its means to keep repeating itself..Anywhere it wishYeah, we felt so...25 Jan. 2011, 30 June 2013...and yet it was just for few day, And still it's from worse to worst..--------The Story\nIn very simple comics, even childish, comes a very excellent heavy family life story, Country history, a very well done melodrama.About coming of age that really touching.I loved Marjane so much and her amazing parents.It take place from 1979 to 1985, where the young girl witnessed all the depressive rules of the new “Islamic Government”The good thing is the richness of her family both in money and culture...even their ancestors.That makes a very helpful great insight into the history of Iran, and the major political turns. Most of these things I didn't know - or even if I read it once in text books I may never remember it as I will after reading this novel-I loved her wanna be a prophet.. it's of course unspeakable in my religion but it comes in a childish nice way...that's okay since she wanted the good deeds as Zarathustra.This first part is divided into 9,10 pages chapters, each with a title that may makes small appearance or bigger one but it has strong effect in the story. It's brilliant really I loved the naming of the chapters so much.There was a good diversity of the characters' opinions and how the new government effects them, but I felt that adding a Jewish family into the story was just “inserted” for the purpose of showing diversity and how everyone been effected by the horrors of the war.. it really could have been presented better to not feel that “alien”.I loved that nostalgic feel that everyone in the middle east must got with the passion about the western music and culture. And was hard to see how much trouble it get those who liked it in that time in Iran.I really had teary eyes by the last scenes of book one, I really liked the parents so much, how much affection they gave Marjane that I believe what really saved her by the end.I have to say I may have a minor refuse of some of the very liberal acts of the family, mostly for religious reasons.. yet Part one still very acceptable compared to part two which…Well let that when it comes to talk about book two.Mohammed Arabey20 July 2016"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Sep 30, 2015", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\nOf all the banned books I’ve read over the years, THIS one might be the one that I really can’t figure out a reason for banning. There have been some selections that my children aren’t quite old enough to read or fully understand, but they are still tiny humans. In a couple of years I’ll gladly let them peruse my bookshelves and read whatever all of the nutters tell them not to. It was thinking of those nutters that left me shaking my head at the choice of banning Persepolis. I mean, there’s no sex, no drugs, no foul language – it’s simply a memoir of a girl who lived through the Islamic Revolution in Iran. Generally when the whackjobs take a break from their cultlike book burnings they are all about sharing anything that points out how horrible the Middle East is. I guess at some point they just decided to go all Oprah with respect to book bans . . . .\n*shrug*I, for one, am absolutely delighted that Banned Books Week led me to discover Persepolis. What a brilliant (and so very important) little book. Marjane Satrapi was able to detail the history of the Revolution and its lasting effects on not only her family but Iran as a whole with humor . . . \na lot of humor . . . \nand compassion . . . \nand the heartbreak of a nation combined with the reality of her own life . . . \nIt showed that no matter what might be broadcast on the evening news that people are people and even those of us who are separated by half a world have more similarities than differences. It also tackled how important it is to talk to your children about big issues . . . \nand to open their mind even further by using the thing the banners continue to try (but fail) to take away . . . .\nMy friend Matthew was the first to express his love for Persepolis when he saw it on my “Currently Reading” list and he unleashed his rebellious side and read a banned book this week too. I hope my kids are half as awesome as he is when they grow up. And to any other “kids” out there reading this – just say damn the man . . ."}, {"userName": "Lia  ", "userReviewDate": "May 18, 2016", "userURL": "http://www.goodreads.com/user/show/48295288-lia", "userReview": "4.5 starsI went into Persepolis with all the ignorance of an European girl born in the '90s. With all the ignorance of someone who sees war and conflict from afar, who is been used to being safe her whole life - because war just doesn't happen around here. Because we may send our soldiers to fight, but it's always somewhere else. Things are changing. I don't feel that safe anymore. And in a time of fear and escalating paranoia, when people all around me murmur and whisper that they're all terrorists, they're all fundamentalists, they're all the same, blinded by ignorance and hatred, I feel the need to do something for my own ignorance. To educate myself on all the things I still don't know about the world. I didn't know a lot about the Islamic Revolution in Iran. The history books I read at school and university do not seem to care about it very much; it's always about the West. Students barely have any idea of what the past was like in the rest of the world, because the general opinion is that they do not really care. The few things I knew about it were just from the news and the newspapers, a book here and there, a fleeting mention by my parents; but still, a very faraway reality. I am a fairly political person, if you can call it that, but I'm not trying to turn this into a political debate. Terrorism has always been real. Strangely enough, though, we hardly ever hear of all the people that are killed in the Middle East, because their lives seem somehow to be less important than ours. Because until something hurts us - the ones with the money, the power, the technology and the weapons - it remains invisible. Persepolis is Marjane Satrapi's autobiography, set in Iran in the late 1970s and early 1980s. The art style is simple, in black and white, almost childlike, and its simplicity manages to make the narrated events even more impactful. Satrapi tells the story of the Islamic Revolution with the innocent voice of a young girl and yet, it is immediately evident how easily her mind was influenced by the world around her - her school, her parents, the news, the things people told her. She did not know what to believe. Had the Shah truly been chosen by God? Did she really have to wear the hijab, if she didn't want to? Why did she have to go to an all-girls school? Why couldn't she wear tight jeans, or denim jackets, or go to parties? My impression is that the Western world often wants us to think that it's us against them, the oh-so-civilized West against the Middle East, and to forget that the people who are not fundamentalists are, in fact, the vast majority. Satrapi doesn't try to make her childhood in Iran look better than it was, but she doesn't try to make Iranians look like pliant puppets either. They fight. They resist. Satrapi's parents are revolutionaries, and since childhood she experiences the fear of imprisonment and death, sees her classmates go to their fathers' funerals, the people around hear flee to Sweden, the United States, England. After a while, she starts to rebel, too. In the middle of Teheran, the fighter-bombers cross the sky and people are forced to hide because of the bombings, and still, Marjane speaks up at school, listens to Iron Maiden, and reads books she's not supposed to read. In her own way, just like her parents, she fights back too. I can't recommend this graphic novel enough. It does not spare the reader the horrors of war, but it also shows things from the naive and yet extremely perceptive perspective of a child. It is not an history lesson - though it does give a lot of information about the Islamic Revolution in Iran, which I really appreciated - and it is both moving and educational."}, {"userName": "Pramod Nair", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/37107782-pramod-nair", "userReview": "“In life you'll meet a lot of jerks. If they hurt you, tell yourself that it's because they're stupid. That will help keep you from reacting to their cruelty. Because there is nothing worse than bitterness and vengeance... Always keep your dignity and be true to yourself.” – Advice to Marjane’s from her grandmother.‘Persepolis: The Story of a Childhood’, the first volume, is the intimate memoir of a spirited young girl who had to grow up in the chaos of a society under a stiffly ruled regime which was going through phases of unrest in the form of oppression, revolution, horrors of war and religious rigidity. ‘Marjane Satrapi’ was born in 1969, in Rasht, Iran and the country was going through a momentous political transition during that time. Through bold and contrasting black and white inking and simple artwork the artist opens a window through which the reader can witness the daily life, it’s emotions, the history and terror from those days leading to and following the Islamic revolution as seen through Marjane’s own eyes. ‘Persepolis: The Story of a Childhood’ brings some of the key moments of Iran’s history during the 70s and 80s – like the oust of Shah’s regime, the triumph of the Islamic Revolution and subsequent morphing of the society towards orthodoxy through banning of secular education and imposing the veil, the devastating effects of war with Iraq, it's refugee situations – all beautifully intertwined with the personal moments from Marjane’s family with strong humor which makes the narrative more special for the reader. Marjane was born into a well-to-do family and her parents were quite liberal in their outlook and this makes Marjene who is intelligent and outspoken as a child to have her own opinions and views on everything that is happening around her. At times her outspoken character and passion for freedom lands her in trouble at school and even with authorities. Being born into a well-to-do atmosphere helps her in bringing out the sharp contrast in her family’s life and the general life of the outside public in a vividness, a contrast which is contributed by the clever use of the black and white frames. Though each frame Marjane try to find an explanation and solution for the madness happening around her. Some of the visuals – like those which show her having imaginary conversations with god about matters around her when she is nine; conversations with her uncle who was imprisoned in U.S.S.R; the way she shows her anger at God asking him to ‘get out’ from her room on the night of hearing her uncles death; her visual interpretation of the state fed recruitment campaign of ‘to die a martyr, is to inject blood into the veins of society’; she furtively smoking a cigarette in protest against the ‘dictatorship’ of her mother and then self declaring ‘with the first cigarette, I kissed childhood goodbye’; she glimpsing the horrors of war through victims of chemical warfare at a hospital facility - are quite powerful in their depiction.In the scene where Marjane comes across the body of her friend from the neighborhood among the rubbles after a missile attack there is a single frame of illustration, which can be seen as one of the most brilliant uses of the visual format of storytelling. When she covers her face in horror with her hand, the total numbness and pain that Marjane feels over her friend’s death can be experienced in next cartoon panel, which is totally blank and black with a small subtext, “No scream in the world could have relieved my suffering & anger”.This cleverness and creativity of the author as an illustrator can be further seen in the depictions of the young Marjane herself. The various emotions – surprise, anger, frustration, confusion, helplessness, terror - that the artist capture on the face of young Marji gives the character a soul which can make her feel like a long known friend for the reader. The narrative of the first volume ends when Marjane leaves for Austria when she is 15 to continue her studies at a more liberal and open European environment.‘Persepolis: The Story of a Childhood’, is a powerful and heartbreaking graphical rendering of the dark times of a society which was shrouded in the horrors of war and oppression from the viewpoints of a young girl who is confused and trying to understand what is happening around her. The tasteful humor and dominant insights that the author artfully infuses into her visual panels gives this book a freshness, which will invigorate reader rather than completely sliding him into the chasms of depression and sadness. This is one of those graphic novels, which can find audience even among those readers who are quite skeptical about the comic-book genre. A note to the reader: Since ‘Persepolis: The Story of a Childhood’ is told from the perspective of the young Marjane, the author intent seems to focus around expressing her confusions, her doubts and her attempts in trying to understand the world into which she was born. Understanding the fact that the author was not trying to create an accurate historical or political volume on Iran will help you in enjoying this book in a better way. This can be read from the words of Marjane Satrapi herself in an interview from 2008.\"I use myself to talk about other things. I'm not a historian, not a sociologist. I'm a person born in a place where I've seen some stuff. That's why I put myself in as a character.\""}, {"userName": "Rachel Reads Ravenously", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/14514998-rachel-reads-ravenously", "userReview": "4 stars! So in an effort to diversify my reading (aka read something other than romance for once) I joined the Goodreads group Our Shared Shelf, a feminist book club run by Emma Watson. With the recent political climate in the US, I wanted a way to expand my mind and find other readers to relate to. I highly recommend this group, and while I am more of a lurker than a discusser, it’s a lot of fun and great to be surrounded by intelligent, like-minded people. Persepolis is a book this group read about a year ago, but when I saw it amongst the material the group read I knew immediately I wanted to read it. When I was in college my World Literature class watched the movie (I know, the movie and not the book? *sigh*) and I have been meaning to read it ever since. On top of that I live in Los Angeles, a heavily Persian community and many of my real life friends are from Iran, so I was interested in learning more about the history of this country.This book is an autobiographical memoir by Marjane Satrapi, mostly of her childhood living in Iran in turbulent times. It takes place mostly during the late seventies and early eighties, and depicts what life was like for her in a changing country. Marjane and her parents are rebels against the new regime, seeing that what the government is telling them isn’t always true. This book shows how Marjane adjusts to a new restrictive lifestyle as well as a history of the country told by her. It was very personal, you feel what Marjane feels. I fell in love with her as a character, you cannot help it while reading this book.I highly recommend this to anyone who is willing to read something outside the box, and anyone eager to gain perspective on events in other countries that you may have not known before.Follow me on ♥ Facebook ♥ Blog ♥ Instagram ♥ Twitter ♥"}, {"userName": "Tatiana", "userReviewDate": "Jan 08, 2010", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "\"Persepolis\" is a widely acclaimed memoir/graphic novel, it was rated highly by several of my fellow readers and therefore I've had my eye on it for a while. Sadly, now, after reading this book, I am a little underwhelmed by it.As a graphic novel, it is a notable work. The cartoonish style of the drawing is superb, the subject matter is very current, the combination of tragedy and humor is clever. However, as a political memoir, \"Persepolis\" lacks. I don't know exactly why, but I never got a grip on what Satrapi's personal views on the politics within her country are. In fact, I am not even sure if she really knows what what was happening in her country. Maybe it has something to do with the fact that this memoir ends when the author is 14 (although writing it as an adult, she should be able to present her views clearly). Or maybe it is because Satrapi herself never personally experiences any hardship in this book. I find it very interesting that in times of turmoil, during the civil war for democracy, during the rise of religious fundamentalism, during the war with Iraq, Satrapi's family never seems to experience any discomfort. Quite the opposite, when people die and suffer, the writer's most hardship is to hide the liquor at a party (which they are not supposed to have), or to wear a headscarf, or to get an \"Iron Maiden\" poster through customs. This narration from a perspective of a person in power is a little disheartening and has a bit of a fake tone to it, as if the author doesn't know what is really happening in her country and writes about from her million dollar mansion while being served by one of her maids.It's not a bad book, especially for younger readers who want to know a little bit about Iran and its current political events. It is presented in a very appealing, easy format. But for me personally this book appears to be too superficial to leave any kind of lasting impression. I will however read the second part of the memoir. Maybe it will have some more insight.Reading challenge: #5 - 1 of 2."}, {"userName": "Paul Bryant", "userReviewDate": "Oct 01, 2007", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Well, having read the book, I went also to see the film last night. But I will probably not wish to go to see the musical or buy the soundtrack of the musical with specially commissioned songs by Sting and Bono and Madonna and Cher and several other rock stars who only have one name, all their other names having been given to their favourite charities to auction off.  I didn't read Persepolis Book Two so was interested that the film incorporates both books. However my joy turned to large bananas which have been left too long in the fruit bowl of life and are now blackened and soggy, as I came to realise that the perky sassy girl of Part One grew up to be the miserable pain in the ass shoegazing student of Part Two. So the movie demonstrated the curious fact that you can have the most exotic of backgrounds (Iran! revolution! fundamentalism! war!) and still be a dullard. (I should interpose that the visual aspect of the movie is very pretty, and when one has determined that the political content is close to zero, one can transfer one's attention to the exhuberant cartooning without a qualm). There are two very odd things about this two-book-one-movie : the word AYATOLLAH is never mentioned, not once. As neither is the other word ISLAM. But if I recall correctly, Iran experienced an ISLAMic revolution led by the AYATOLLAH Khomeini. So this is like \"My Life in Germany 1930-1940\" without mentioning Hitler or the Nazi Party. That's odd! Maybe she'd be on the receiving end of an icepick haircut if she named names, but still. Also odd is the apparent fact that the author's family could send the author out of Iran to Vienna for years at a time - not once, but twice! What implications does this have for our view of the intolerable oppression of the regime?  So in spite of all its trappings, Persepolis in the end is as political and insightful as Shopaholic, i.e. not political and not insightful, and gets away with it because the author can not unreasonably retort that political acumen was quite outside of her purview as she was growing up trying to score Iron Maiden cassettes and trying on lurid shades of lipstick; whence come all the cardboard cutouts which populate the movie, and whence all the unexplained actions and motivations. The dialogue from the adults in her early life is either \"the regime tortured your uncle without mercy. He was a communist\" or \"I put jasmine leaves in my bra every day\". It seems Persepolis has gained its popularity from sheer quaintness. I was looking for more."}, {"userName": "Nenia ✨ Queen of Literary Trash, Protector of Out-of-Print Gems, Khaleesi of Bodice Rippers, Mother of Smut, the Unrepentant, Breaker of Convention ✨ Campbell", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/2190064-nenia-queen-of-literary-trash-protector-of-out-of-print-gems-khalees", "userReview": "Instagram || Twitter || Facebook || Amazon || PinterestAmericans, as a whole, don't really know anything about the Middle East. According to this article, a Roper study conducted during the Iraq War (2006) found that 75% of students could not find Iran on a map (the link they provided was a dead link). I knew a bit about the Islamic Revolution, because I read INSIDE THE KINGDOM: MY LIFE IN SAUDI ARABIA by Carmen Bin Ladin, who was half-Persian and grew up in Iran at this time, but still, the extent of my knowledge could probably fit into a thimble and still have plenty of room for a thumb. I wanted to learn more and this seemed like a great way to educate myself.Marjane Satrapi was a preteen when the Islamic Revolution happened. Before the change, she went to a school where everyone spoke French and women were free to wear mini-skirts. The Islamic Revolution imposed new restrictions - mandatory hijabs, religion being taught in schools, and the Iranian secret police, or SAVAK, investigating people on the streets or in their homes for illegal activities, for which they might be jailed, publicly whipped, or even executed.I think what makes this such a touching - and important - book are the flashes of normality in between the chaos of war and revolution. Marjane was a mischievous kid who liked to fool around in the classroom with her friends and prank the teachers, she chafed at her parents' authority and would rebel or sneak out, and when she became a teenager, she wanted to dress in the latest fashions and buy the things that made her feel good about herself and her burgeoning identity.I cried while reading this book. Marjane lost her beloved uncle; he was executed for seditious activities, and the last time she saw him, he made her a swan he carved out of bread in prison. I also cried when she was out shopping with her friends and heard about an Iraqi SCUD missile hitting one of the houses on her street. Not knowing if her family was alive, she forgot to take home the jeans she purchased as she hopped into a taxi. When she arrived home, she found that her family was safe - but her neighbors, a Jewish family, had all been killed because it was a Saturday, and they were observing the Sabbath. As her mother hurried her away, she saw the friend's bracelet in the rubble, attached to \"something\" (which I am guessing was probably pulverized flesh and blood).PERSEPOLIS is not an easy read, because it delves into many subjects that I think a lot of people would rather not think about. It's never fun to read about war, but that's probably why we should. Many books and movies glamorize life on the front, but real war is full of casualties and suffering, and should only be employed as a last-resort. Last summer, I went to the Hiroshima Peace Memorial Museum, which is filled with \"found\" objects from the resulting conflagration, including schoolbooks, buttons, and uniforms, along with photos of what the city looked like before and after the blast of the A-bomb. Survivors of the blast, who were either still in utero or small children when the bomb went off, took us - a group of Americans - around the city, giving a neutral but heartrending account of the war, the A-bomb, and the terrible aftereffects. I had to step respectfully aside at one point during the tour because I had begun to cry (I was so embarrassed, but I imagine the guides are probably used to that reaction). I'm really glad I went, because Hiroshima took this awful event and turned it into a powerful statement about the importance of peace. People come there from all over the world to look at the exhibits and learn. PERSEPOLIS made me feel the same way.Like Art Spiegelman's MAUS, Marjane Satrapi uses the \"memoir as graphic novel\" medium to great effect. The illustrations manage to capture the whimsical childhood outlook, and the scenes of horror and war are also illustrated as a child might perceive them - fantastical, larger-than-life, and terrifying. This is yet another graphic-novel that feels literary in terms of subject and scope, and I'd encourage you, even if comic books aren't your usual cup of tea, to pick this book up - especially if you don't know much about the Middle East, and would like to learn a bit more about Iran.4.5 to 5 stars"}, {"userName": "Roya", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/12222982-roya", "userReview": "I HATE ALL OF THESE DEPRESSING IRANIAN ENDINGS. Ugh. So irritating. Review to come.EDIT:Two points that should be made.1. This book will make you sad.2. That's okay.Persepolis is the first book in a graphic novel series about the childhood of Marjane Satrapi, the author of this book. In this book, Satrapi reminisces her life in Tehran during the Islamic Revolution and the Iran–Iraq War - a time of oppression and dejection. Of course, with the Islamic Revolution came the arrival of the high and mighty chador.As I continued reading, you could strongly feel the push and pull between a rebellious culture and it's new dictatorial government. Satrapi did a marvelous job of graphically making this a reality.And as the revolution continued, Satrapi got older.And the more she was restricted, the more she rebelled.Being an Iranian myself and having heard many tragic stories such as this, this is a topic I can genuinely say I was able to sympathise with. Persepolis isn't perfect, but I'm willing to read the others in the series. Overall, it's a unique memoir that will forever be a reminder of my heritage."}, {"userName": "Book Riot Community", "userReviewDate": "Nov 02, 2016", "userURL": "http://www.goodreads.com/user/show/33447134-book-riot-community", "userReview": "I always feel a little silly and, well, superfluous adding my voice to years of praise for a well-loved work like Persepolis but in this case I can hardly help it. I absolutely adored this insightful, enchanting book. In Persepolis, Marjane Satrapi tells the story of her girlhood and adolescence in revolutionary Iran in a way that is immediately accessible and recognizable, even if you grew up in a totally different decade and on a different continent. There’s a warmth and frankness to her way of turning a phrase or expressing an idea that is totally unique. Her artwork is at the same time simple and deeply evocative: straightforward and expressive. It’s a rich, captivating novel and I recommend it to anyone who loves a good coming-of-age story.–Maddie Rodriguez from The Best Books We Read In September 2016: http://bookriot.com/2016/10/03/riot-r..."}, {"userName": "Rebecca McNutt", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "I've wondered about reading Persepolis for a number of years now (I saw the film trailer back in high school). Finally I ordered a copy and it's a shocking account of extremism and the toll it takes on families and friendships, but more than that it's also a brilliant coming-of-age tale about maturity, expression and individuality. It's also an interesting shift in character from the eyes of a daring and innocent child to that of a teenager marred by death, politics and religion gone corrupt. Opting to embrace western music and fashion despite the dangers, Marjane finds herself desperately trying to find her place in the world as she witnesses everything from the tragic death of her relatives to brutal executions and punishments for not conforming to the new order of Iran during a revolution that still has a legacy affecting us even today."}, {"userName": "Forrest", "userReviewDate": "Dec 15, 2012", "userURL": "http://www.goodreads.com/user/show/811928-forrest", "userReview": "I intentionally avoided the movie version of this book. I wanted my reading experience to be unspoiled, even by trailers. Now, having read the book, I shall have to go see the movie.I am the same age as Marjane Satrapi. As I reflect the events of this book, I remember my perception of events in Iran: the revolution, the hostage crisis, the war with Iraq. Having lived in Italy from 1977-79, I feel a little closer to these events than I would have, had I been \"buried\" in American concerns at the time. My father was a military man, and we were living in a foreign country. While I never will know how Satrapi felt about the events in her own country (nor would I want to know), I can at least more closely approximate the emotions she must have felt at the time than if I had been born under other circumstances, in a different place, in a different time.Persopolis has faint echoes of Maus. Satrapi's voice even sounds similar to Spiegelman's. If you liked Maus you will probably like Persepolis. I was amazed by how much I didn't know about events in Iran at that time. I consider myself a pretty well-informed person, when it comes to history (flashes MA in History from UW-Madison), but I was unaware of the sheer complexity of the Iranian situation in the late '70 and early '80s. This book doesn't just outline these issues, but goes into some depth regarding how difficult it was for one girl and her family to navigate the fluid and quickly-changing political and social landscape of Iran at the time. There are lots of lessons to be learned here. Satrapi fancied that she would grow up to be a prophet when she was younger, and I think she might well have succeeded with this work. Not a prophet who foretells doom, but a prophet who recounts the errors of the past and puts them up as a warning to the world."}, {"userName": "Erin", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "One can forgive but one should never forget. Graphic novel that details the author's experiences during the Iranian Revolution. Quite an emotional read!"}, {"userName": "drbarb", "userReviewDate": "May 15, 2007", "userURL": "http://www.goodreads.com/user/show/58806-drbarb", "userReview": "I am as middle class (we call it affectionately, the \"poor rich\" where I live.) I am intellectual. I am like Richard Rodriquez and bellhooks because education took me away from my roots, but gave me who I am today.So, how could Iranian middle class intellectuals and professionals in the late 1970s have been so different than me and my family? For the young, under the Shah, there was a strong and progressive, very Western group of middle class Iranians. Just like me and mine.So, how could these people have allowed the \"revolution\" in Iran to become a \"devolution?\" The question bothered me all the time. Under the Raygun (Reagan)administration I entertained the possibility that I would have to emigrate for political reasons (ha, and let's just say the thought has cropped up again recently.) How was America different from Iran -- no, that is too broad a way to state it. The question on my mind was how does your country become totalitarian, authoritarian, repressive -- and you still live there and didn't resist?Read Persepolis to find out. Yes, it is a girl's growing up story. Yes, it isn't really about the parents. But when you read it, you can see that great evil can just sneak its way into your life because it comes just a babystep at a time. No, the Iranian intellectuals and professionals were not very different from their American counterparts. There is a lesson there, and I hope we learn it before it is too late for us."}, {"userName": "Carmen", "userReviewDate": "Dec 07, 2013", "userURL": "http://www.goodreads.com/user/show/25353295-carmen", "userReview": "This is a good book. Satrapi writes with a powerful voice. One can easily imagine her childhood and early life. Many times I do not enjoy graphic novels because I think they are weak and poorly-written, relying on pictures to tell a story and not utilizing good dialogue and text. That is not the case here. Satrapi's unique illustrations make the Iran of her youth come to life. Many difficult and painful issues are dealt with in this book: torture, death, martyrdom, etc. Instead of cheapening these concepts, the graphic novel Satrapi wrote makes them hit you harder. She knocks the wind out of you with her straight talk, her child self's views on what's happening and the stark brutality of humanity. A worthwhile read for anyone."}, {"userName": "Abeer Abdullah", "userReviewDate": "Jul 15, 2015", "userURL": "http://www.goodreads.com/user/show/16996132-abeer-abdullah", "userReview": "Extremely clever and genuine book about a young middle eastern woman going through an oppressive misogynistic extremist regime, something I relate to a lot. It gives me strength and hope and makes me love and relate to people I, as a person who grew up in sunni saudi arabia, was always told were enemies or at least people who don't wish us well, that's the picture that's been painted. luckily i was introduced to irani art pretty early on, particularly cinema, so I've felt nothing but admiration for the culture, but this quick and clever graphic novel gave me a deeper look into something very close to who I am, as person who is barely ever represented in art, I appreciated my reflection being given such strength, as appose to the submissive helpless victim image that's always associated with saudi women. This irani woman inspired me a lot."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Dec 06, 2015", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "I thought this book was very sad, I felt sorry how Marjane had to grow up. I'm going to link this to a friends review that can tell it better :)Anne's Review"}, {"userName": "Jess ❈Harbinger of Blood-Soaked Rainbows❈", "userReviewDate": "Dec 06, 2011", "userURL": "http://www.goodreads.com/user/show/7125124-jess-harbinger-of-blood-soaked-rainbows", "userReview": "I've now read this book three times. And every single time I remember something I'd forgotten or I get something new out of it. I read it this time because I wanted to read it's sequel and felt like a brush-up of book one would certainly be in order.This book is so good, guys. It is one of the best (if not THE best) graphic novels I've ever read. Marjane Satrapi's voice is so strong and important, and down to earth and hysterically funny. She relates the goings-on in a very tumultuous time in history so well and with such craft. I loved learning about the Islamic Revolution through her words and pictures and it really opened my eyes to the terror and the hardships that Iranian people went through, and STILL go through today.And I loved learning about the political drama, the tensions, the religious uprising, what really happened during the war with Iraq, but never for one second did I feel like I was reading a dry political memoir. Because this isn't a political memoir. It is the memoir of a young girl. Who just so happened to grow up differently from how I did. Though her stories often are centered around what was going on in her world at the time, more was devoted to the everyday life in Marji's world. What color nail polish to buy, what kind of music to listen to, the excitement she felt every time her grandmother came to visit. I loved the bits of history and dark, murky, drama that went along with it, but above all, this is the memoir of a girl growing up in Iran. In a country she absolutely loved, who was lucky enough to have parents who raised her to be exactly who and what she is, who loved her for being unique and special and unlike everybody else. This is a girl who snuck out to buy Iron Maiden cassettes on the black market, who secretly despised wearing a veil, and who told a heartbreaking tale of an uncle she loved to pieces. It is in turns heartbreaking and hilarious and her voice resonates off the page.My favorite part about the story was Marjane's own voice. This volume is about her childhood in Iran and ends with her boarding a plane to Austria (her parents sent her there for school to protect her) and I loved that she wrote in the voice of a young girl. I know exactly what type of child Marjane was through her telling of stories, and I know exactly what kind of people her parents were, and I loved reading the stories she tells about every day life, from family dramas, to teasing friends on the playground, to that eventual loss of innocence when she discovers what her world has become. It is no surprise that she grew up to be an artist and a writer because it is evident early on that Marjane has a vivid imagination, one that is kindled and fostered by parents who did not always fit in with the fundamentalists who surrounded them.I actually decided to pick this book up because I was reading another book, a classic, that tells a fictional apocalyptic tale of a future where women are basically enslaved and treated as less than human. And I was feeling quite disillusioned by the whole thing.Even though that book is obviously fiction, it made me think. Because it describes an America I think all Americans can agree on as being a living hell. And it seems extreme. But it made me think about all the places in the world where people actually live lives that are not so very different from the lives portrayed in that book. And Iran is one of those places and Marjane and her family are people who lived through hell and survived. And where the former novel was bleak and disturbing and dramatic and portrayed women as weaklings, I loved reading about all the different ways that Marjane and her family and friends protested the system in which they live and all they ways they showed strength. It was an inspiring read, and one I will remember far better than the fictional tale. It showed the cold hard truths of being a woman growing up and living in a totally patriarchal society. And was NOT so far off from the fictional world created by Margaret Atwood in the eighties.And can I just say that providing a graphic novel as the vehicle in which to tell her tale was brilliant. Absolutely brilliant. My sister actually read this book in tenth grade as a part of her English class, and I know that her teacher was really shamed by other teachers and parents for encouraging her students to read a graphic novel instead of reading prose. They said that she was encouraging laziness in the students, that an English teacher should be encouraging more challenging reads in high school than those offered by this book. And I totally disagree. My sister LOVED this book. And she learned SO MUCH about how people lived back then and what they go through and the type of world that is so different from the one she grew up in. Things she would never have learned had she been forced to read a traditionally published book about Iran. She loved it so much that when I bought her the complete Persepolis a few years later, she was so excited she read the whole thing that night. She still talks about this book and how it changed her way of thinking. AND THAT! THAT! is what books do. It is part of their magic. And so kudos to that tenth grade English teacher who took a step out of the box and assigned this book, knowing the potential backlash that would ensue. She singe-handedly may have influenced a whole classroom to think outside themselves and the worlds they grew up in.And so I highly recommend this lovely book. It is a quick read and one that will stick with you, I promise. And I dare you not to fall in love with little Marji as a child. I dare you.4 stars."}, {"userName": "Sara M. Abudahab", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/15562609-sara-m-abudahab", "userReview": "A graphic novel describing how it was like growing up during the Islamic Revolution in Iran, it was nice and I might give it another try soon."}, {"userName": "Maryam Shahriari", "userReviewDate": "Jun 02, 2016", "userURL": "http://www.goodreads.com/user/show/145223-maryam-shahriari", "userReview": "مرجان ساتراپی خاطراتش از ایران قبل و بعد از انقلاب ۵۷ رو در این کتاب روایت کرده و به تصویر کشیده. در اون دوره مرجان نوجوان بوده و روایت‌ها مال حدود ۱۳ تا ۱۶ سالگی اونه. به همین خاطر مسائلی که بیشتر بهش پرداخته شده در حد مسائلی هست که بچه‌ای در اون سن براش مهمه و درک می‌کنه. مثل تغییر حجاب و گشت‌های حجاب، محدودیت توی خوردن شراب، جنگ و ترس از بمباران و بعد هجوم جنوبی‌ها به شهرهای شمالی و... یه جاهایی درباره نوع عقایدی که هم درباره گروه‌های چپ و راست می‌شنیده و در حد فهم خودش چیزی نوشته، ولی خیلی کمه. اما چی شد که خوندمش؟امروز توی توییتر دیدم مطالبی گذاشتن که اما واتسون این کتاب رو دستش گرفته و گفته داره می‌خونه. و با توجه به اینکه سرچ‌های قدیمی درباره تخت جمشید با واژه انگلیسی پرسپولیس هم خیلی به عکس‌های این کتاب ختم می‌شد و برام سوال شده بود که چیه، دیگه دانلود کردم و خوندمش. در اصل برام جالب شد ببینم که خارجیا دارن از ما چی می‌بینن!و خب لازم نیست بگم که آبرومون رفته با این کتاب دیگه. درسته حقیقت رو گفته، ولی با توجه به سیاه و سفید بودن کتاب به نظرم یه تصویر سیاه‌تر از حد معمول فعلی جامعه رو توی ذهن خارجیا ایجاد می‌کنه. :(خرداد ۱۳۹۵تهران"}, {"userName": "Nojood Alsudairi", "userReviewDate": "Nov 30, 2007", "userURL": "http://www.goodreads.com/user/show/580165-nojood-alsudairi", "userReview": "I got this book in Arabic. Any one who is interrested could borrow it from me (if you are in Jeddah that is!)أنهيت قراءة الكتاب ليس لأني سريعة في القراءة و ليس لأنه كتب بالعربية و لكن لأسباب أخرى؛ أولها أننا كنا في الطائرة ننتظر مكان للوقوف لمدة ساعة تقريبا(بسسب الحجاج رعاهم الله) و ثانيا لأن الكتاب مصور! أكثر ما شدني في الكتاب، عدا عن كونه مصور، هو استطاعة الكاتبة أن تنقل لنا أفكار طفلة بتفاعلها مع مجتمعها و سياسة بلدها و إيمانها بربها بطريقة جميلة. أحسست و أنا أقرأ بأني كنت بالفعل أقرأ طفلة ليس فقط من خلال كلماتها بل أيضا من خلال الرسوم البسيطة جدا و المعبرة بشكل أكبر. هذا شكل آخر من الكتابات الذي يتفاعل فيه النص مع الرسم فلا تستطيع أن تتنازل عن أحدهما لصالح الآخر. قرأت تعليقا هنا تقول فيه الناقدة بأنها أحبت الكتاب لدرجة أنها لن تستطيع إعارته لآخرين، أما أنا فأحببته لدرجة أني أريد أن أعيره للجميع."}, {"userName": "Jessica", "userReviewDate": "Apr 22, 2012", "userURL": "http://www.goodreads.com/user/show/419287-jessica", "userReview": "We complain about the religious fanatics in this country, and definitely we should keep an eye on them, because man oh man, things sure could be worse.I liked this. It was cute but in a substantial way, interesting, and emotionally compelling. Satrapi made a point of representing her childhood self as kind of an asshole in a realistic and endearing little-kid way, which I thought was cool and served the book well. In a lot of stories about political repression the heroes are saintly people, but she and her family were so much like my own family and people I know that I got a much better sense of what it would be like to have religious wingnuts running my country. The descriptions of growing up amidst the political turmoil and repression and the war of 70s/80s Iran were effective because the characters seemed so real and familiar. I've been reading a lot about Iran during this era, but embarrassingly this is the first thing I've read from an Iranian perspective. Hope to read more and definitely would love some suggestions."}, {"userName": "Anna Kander", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/66286765-anna-kander", "userReview": "Twenty pages in and... wow. This beautiful book is bringing back memories and putting them in new context...My first best friend, when I was still learning to read, was from Iran. Her parents fled the 1979 Revolution, literally in the middle of the night. They wanted more for their daughters. My friend's mom was a doctor, and before they fled, the hospital where she'd worked had stopped letting her work, because she was a woman. At the time, I was too young to understand any of that. What I remember is my friend showing me the books at her house, in Persian, and showing me how to read each page, right to left.ETA: The art is worth seeing. I loved the way she alternated between black outlines and white outlines carved from black ink. The book is about corrupt politics, war, and torture, through the eyes of a child with limited understanding and, then, a rebellious teen. It will stick with me."}, {"userName": "Richard Derus", "userReviewDate": "Dec 03, 2011", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Rating: 3.75* of five graphic novel, 5* of five filmThe Book Report: So this is the lightly fictionalized life story of Iranian emigre Satrapi, as she grows up in the waning days of Shah Reza Pahlavi's rule, the revolution, and the subsequent theocracy. She emigrates first to Vienna, for school at the Viennese Lycee Francaise, and then after a time back in Tehran, off to Paris. We meet her delightfully outspoken grandmother, her neither-fish-nor-fowl mother, her drippily emotional father, and a host of family members of varying degrees of inimicality to the various horrible regimes Iran has suffered in the past 100 years.Oh, oh, oh how I hate to write these words, knowing how many people will flee screaming into the distance as I do: This is a coming-of-age story.Wait! Come back! It's not that bad, I promise! Well, the film isn't, anyway. I suggest viewing the film instead of the graphic novel.My Review: I don't much like graphic novels, seeing them as pretentious cousins to the comic book. And I never got the hang of comic books. Something that takes me ~10min to read does not make much headway with me. So when I found that my local liberry had both the graphic novel and the film of this title, I thought I'd do a fair test: Read the graphic novel first, then view the movie; compare and contrast.Movie. Definitely. Movie is as beautiful as the graphic novel, but more deeply involving because it's more nuanced in its storytelling style.But make no mistake, both versions are aesthetically sophisticated and artistically beautifully realized. I focused very little on the words of the graphic novel, because they were so-so literature and because the images were so glorious. The same, well not identical but similar, words accompanying the moving images...! Orders of magnitude of difference. Had I only experienced the graphic novel, I doubt I would have bothered to write any sort of review. The film is, well and truly, a masterwork, and possibly even a masterpiece. I know it left me wrung out and still curiously uplifted. I can't say it enough: Rent this film. Watch it with an open heart. It will reward you."}, {"userName": "Samadrita", "userReviewDate": "Dec 02, 2012", "userURL": "http://www.goodreads.com/user/show/13266158-samadrita", "userReview": "Here's why you should read Persepolis :-i)Satrapi talks about the pleasures and pains of being born as a female in a country under a most repressive Islamist regime, without ever sounding too serious or preachy. ii)Iran's history during the growing years of Marji is summarized for you in a few pages along with the political and socio-cultural background of the times.iii)This book features, by far, the coolest pair of parents that I've ever read about in a novel or book (or that I can think of at the moment).iv)It offers you a very original and true-to-life account of revolution, war and its inevitable consequences.v)Themes such as disillusionment with religion and the sheer absurdity of religious dogma are explored in the book in the most offhand manner.v)A steady undercurrent of humour runs through the length of the book, lessening the gravity of the backdrop and sometimes even depressing situations.Sample these :- \nMarji's mom:- \"Our country has always known war and martyrs. So, like my father said:'When a big wave comes, lower your head and let it pass!'.\"Marji's inner monologue at this:- \"That's very Persian. The philosophy of resignation.\"\n\nMarji's enraged father to her school headmistress :- 'If hair is as stimulating as you say, then you need to shave your mustache!' (when the latter scolds the school girls for wearing their veils improperly enough to show hair)\n(What a cool dad to have! No honestly.)vi)Last but not the least, it packs in all of the above mentioned points into a graphic novel (with very simple artwork) of 160 pages which can be enjoyed by readers of all ages and read in about 3 hours flat or less.Can't wait to know what happens to Marji in Austria in the next volume."}, {"userName": "Tudor Vlad", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/47799008-tudor-vlad", "userReview": "It's hard for me not to compare this with Maus, since they're both memoirs that despite taking place in different historical periods and in different countries, somehow managed to inflict on me the same sadness and the same sense of helplessness. I guess tragedy and history rarely change, only people and how we react to it. Persepolis is a gorgeous book, the illustrations are beautiful in their simplicity and manage to convey such a wide array of emotions. My only complaint is that the book felt too chaotic, which is probably me expecting a fiction format from a non-fiction book. Life is chaotic, so I don't know how valid that complaint is. Either way, I just couldn't let myself give it 5 star despite liking it a lot."}, {"userName": "Francisca Viegas", "userReviewDate": "Dec 12, 2014", "userURL": "http://www.goodreads.com/user/show/2816955-francisca-viegas", "userReview": "“One can forgive but one should never forget.” This is the story of Marjane Satrapi as a child growing up during the Islamic Revolution in Iran.It is so moving and deeply touching to actually see and read what she went through, as well as witnessing the gradual loss of innocence that came with living in war.I recommend this to everyone. It shows a different side of the history of Iran - one that I knew very little about."}], "description": "A New York Times Notable BookA Time Magazine “Best Comix of the Year”A San Francisco Chronicle and Los Angeles Times Best-sellerWise, funny, and heartbreaking, Persepolis is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. In powerful black-and-white comic strip images, Satrapi tells the story of her life in Tehran from ages six to fourteen, years that saw the overthrow of the Shah’s regime, the triumph of the Islamic Revolution, and the devastating effects of war with Iraq. The intelligent and outspoken only child of committed Marxists and the great-granddaughter of one of Iran’s last emperors, Marjane bears witness to a childhood uniquely entwined with the history of her country.Persepolis paints an unforgettable portrait of daily life in Iran and of the bewildering contradictions between home life and public life. Marjane’s child’s-eye view of dethroned emperors, state-sanctioned whippings, and heroes of the revolution allows us to learn as she does the history of this fascinating country and of her own extraordinary family. Intensely personal, profoundly political, and wholly original, Persepolis is at once a story of growing up and a reminder of the human cost of war and political repression. It shows how we carry on, with laughter and tears, in the face of absurdity. And, finally, it introduces us to an irresistible little girl with whom we cannot help but fall in love.", "title": "Persepolis: The Story of a Childhood\n      \n          (Persepolis #1-2)", "url": "http://www.goodreads.com/book/show/9516.Persepolis", "average": 4.24, "cover": "https://images.gr-assets.com/books/1425871473l/9516.jpg", "reviews": 7364, "authors": [{"url": "https://www.goodreads.com/author/show/6238.Marjane_Satrapi", "name": "Marjane Satrapi"}, {"url": "https://www.goodreads.com/author/show/3043169.Mattias_Ripa", "name": "Mattias Ripa"}], "type": ["Sequential Art", "Nonfiction", "Sequential Art", "Autobiography", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/9516.Persepolis", "http://www.goodreads.com/book/show/6371913-persepolis", "http://www.goodreads.com/book/show/869979.Persepolis", "http://www.goodreads.com/book/show/991197.The_Complete_Persepolis", "http://www.goodreads.com/book/show/9522.Persepolis_Volume_1", "http://www.goodreads.com/book/show/9517.Persepolis_2", "http://www.goodreads.com/book/show/9526.Embroideries", "http://www.goodreads.com/book/show/9525.Chicken_with_Plums", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}