{"ratings": 1404, "userreviews": [{"userName": "Wendy Darling", "userReviewDate": "Mar 24, 2016", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "4.5 stars This story is told from the perspective of a smart, dreamy boy who's buzzing with hormones and focused on his sport, but can't quite let go of his feelings for his childhood sweetheart. It treats love--of all kinds--and loss with exquisite delicacy, but doesn't descend into sentimental wallowing thanks to the wry narrative voice and the realistic relationships. It also poignantly shows how the loss of one small person can create a crater of grief in everyone around him, and how that grief can overwhelm life and relationships. Strongly recommended if you loved THE LAST TIME WE SAY GOODBYE. I don't know what the 2016 debut class has been drinking, but they've made a lot of magic happen this year. Review to come."}, {"userName": "Jennifer", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "\"You love someone and they leave, but they never entirely go away. You feel them there, acutely, like an amputated limb.\"\n\n Phantom Limbs is a standalone, YA realistic fiction novel written by Paula Garner. This is her debut novel and it is, in one word, palpable. I could feel the life-changing loss, regret, confusion, loneliness, tentativeness, empathy, love, humor (I could go on) flowing through these characters. I found Ms. Garner's writing to be incredibly realistic and I thought she excelled at showing the reach of grief and the different ways it manifests itself in those it touches. I am both slowly and quickly falling out of love with the young-adult genre so there was a part of me that just didn't connect with this story on a five-star level but that is not to say that Phantom Limbs is not five-star worthy. Check it out!My favorite quote:“When she took a bite of pie, she moaned and her eyes rolled back, just like the TV chef with the cleavage. Why were women so sexy with eating? Jesus! What if I never developed bedroom skills that could compete with food? What if I actually got to have sex with Meg one day and she just lay back, bored, daydreaming about pulled pork sandwiches and chocolate eclairs?”"}, {"userName": "Katie McNelly", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/4456544-katie-mcnelly", "userReview": "It's official: I have a type.If this were a Missed Connections ad, or some dated dating service, my ad would look something like this:Woman seeking book. Young Adult contemporary, male point of view. Male must come of age in the story, find himself as himself and not merely an extension of others, and come to understand that life is life, life is pain, life is terrible, but more often than not, life is beautiful, life is awe-inspiring, life is pure and ours and love.And that's exactly this novel. This novel is pure, and ours, and love.After all, aren't we all a little broken, a little dented, a little worn and worse for the wear? If our stories aren't ours, they are those around us, and those become ours, because just because the pain was not ours proper doesn't mean we didn't suffer.I'm getting ahead of myself.Let's see...let me try to focus this review into an actual review. Phantom Limbs by Paula Garner is beautiful prose, and I'm in awe that this is Garner's first. I finished this in less than 24 hours, lost in the voice and consciousness of the main character, Otis. For some terribly odd reason, I find that stories from a male POV tend to have female main characters that are better fleshed-out, more rounded, more fully dynamic, than stories told from the female POV; it's as if the author has nothing to prove and the characters are allowed to exist more naturally. And that's exactly what they do here.Otis is strong, or learning to be, anything but self-assured, and beautifully human. Hauntingly real, utterly honest, and unflinchingly personal. (Is it okay to be a 29 year-old married female who sees herself in a 16 year-old high school male? Probably not, but thanks for going with it.)So let's see, that gives us: solid characters, beautiful prose, ah, yes. The story. The story is the only thing preventing a full 5-star review. Honestly, it's all about characters for me, but there were some aspects of the story where I was just left wanting more. I'll save any spoiler-y details for private messages or comments later when more have read this, but I'm not faulting the story for what it is; rather, I'm faulting it for what there isn't.The moral? Read this. Especially if your 1995-era book-dating profile would look anything like mine. Thank you, Paula, for your gift to readers."}, {"userName": "emi", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/34410191-emi", "userReview": "Let's be honest here, I didn't listen in elementary school when I was told to never judge a book by its cover. I saw this book on display at the library, noticed the blurb by Jeff Zentner, and I was suddenly a toddler in a toy store yelling, \"Gimme\" at the top of my lungs. I didn't know a thing about it, but I really didn't care. I didn't have low expectations for this book, but I didn't have high ones either. So when I finished the last page and was utterly satisfied, I was a bit shocked. I'll admit, it was pretentious at times, and the plot took almost the entire book to develop into something strong, but I don't even care about that. The pretty writing distracted me from all that. Many things I love in books found their way inside these pages. It was a story of grief and friendship and healing and mental illness. And I devoured it. ."}, {"userName": "Brooke", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/13662036-brooke", "userReview": "An excellent look at the complexities of grief, PHANTOM LIMBS makes a strong YA debut. I've had this on my TBR for over a year & I wish that I had gotten to it sooner. Otis is a wonderful MC (when he wasn't solely focused on pining for Meg for the moment) & I felt Garner did a superb job of exploring how guilt overtook lives in different ways. While I'm only rating this 3*, I would not hesitate to read another book from this author. For someone who reads YA consistently, I'll admit that sometimes characters become interchangeable & I'm glad that Garner made sure to put that extra *poof* in there so it didn't happen with PL.Otis & Meg used to be best friends, before the awful incident that caused Otis' brother Mason's death. Naturally, both families are changed forever after that & Meg moves away. Otis is lost without his other half & is floundering, trying to find a place where he belongs. Enter Dara, who becomes Otis' swim coach & more importantly, his best friend. But that doesn't mean he's forgotten about Meg. After 3 years of not corresponding with her, Otis gets the news that Meg's coming to town. After all this time, can they pick up where they left off? At this point I will say that I hated M&O's relationship. I get WHY she was in there, but I grew tired of Otis putting her on a pedestal, blind to what was in front of him. There were times when the interaction between them was cutesy, like yeah, maybe I could get behind this, but then it would turn forced. It didn't help that I didn't really care for Meg in the beginning, but it was understandable as to why Otis was thinking about her all this time & attempting to hold onto the past while forgetting about the present. Basically, it was too romance-rich for my blood. On a side note, there were a couple phrases that niggled at me: 'psychotic weather' & comparing a swim move to looking like epilepsy- there were easily ways to get around that; no reason to include them. *MINOR SPOILER* I also felt like the ending was a cop-out & didn't want Otis running back into Meg's arms, that they were better off saying the final goodbye. If Garner didn't focus so much on this aspect, more of Dara & Otis/Meg's parents regarding Mason's death, this would have been at least a 4* read, no doubt in my mind. On the other end of the scale, I ADORED Dara so much. Her half friendship/half ass-whooper character arc was so good, I was semi-disappointed that she didn't play a larger role. Dara is dealing with her own grief- accepting living with one arm after a shark attack. The scenes with her phantom limb pains were so heartbreaking & Otis coming to the rescue when she needed it the most...be still my heart. Like if it was just their relationship for the entire book, I would have been more than okay with that. Also, the romance between Dara & Abby was adequately & sweetly done. In the end, I think Garner made an effective point in showcasing the emotional side of PTSD without actually having the incidents occur; the aftermath is really the core of what matters in order to keep going. I hated one female companion, loved the other. Otis made for an okay MC. Overall would definitely recommend for a good contemporary."}, {"userName": "Amanda NEVER MANDY", "userReviewDate": "Nov 19, 2016", "userURL": "http://www.goodreads.com/user/show/36873041-amanda-never-mandy", "userReview": "**I received this book for free through Goodreads First Reads.**Diving right into this review without making a splash: This is a great YA read. The writing is good, the story has a unique angle to it and the characters are engaging. It has drama by the boatloads submerged in a big fat love story. It is everything my teenage daughter would love. A boy pining for a possibly obtainable lost love, odd friends that need comfort/support just as much as they can provide and a mystery element that keeps the pages turning.My take as a cranky old woman: mehI need more from a story. The carrot this one dangled was just enough to entertain me at the beginning before becoming predictable and unwanted towards the end. Not to say that it is the fault of the book, just not what I wanted or needed at this time.CONCLUSION: Put the book in the hands of the person that it is written for and read from my own shelf."}, {"userName": "Laura", "userReviewDate": "Oct 26, 2016", "userURL": "http://www.goodreads.com/user/show/4844873-laura", "userReview": "3.5 StarsPhantom Limbs by Paula Garner is a powerful read. Grief and pain so intense and real it made me cringe and cry.Sixteen year old, Otis, is dealing with life the best way he can. His brother, Mason, died 3 years ago and the loss and hole in his life is still so raw. Waves of pain threaten to pull Otis and his parents under almost every day. Waves of missing his brother so much it feels like a physical pain—a hit to the heart and gut. Memories and pain flood in when you least expect them. But Otis and his family are not the only ones dealing with Mason’s death. Three years ago, Meg and her family lived next door. The families were inseparable best friends. All that changed after Mason died. This book tells the story of how a tragedy and loss can rip through and change so many people. How grief can turn ugly and alter and rip apart lives. Can hope and healing ever really be found? I loved Otis. His voice was sweet, smart, goofy, and real. And Dara! Haha….Dara was a force on the page. Otis turned to swimming after Mason’s death. Well Dara pretty much dragged him into swimming and competing. Dara became his trainer and mentor and push to get up and keep moving after the loss of his brother. But she’s also dealing with a loss of her own. She lost her arm in an accident that put an end to her swimming dreams. Now she swims and trains with a vengeance. Anger and sadness and regret are so alive in this story. Phantom Limbs has a lot going on and I’m not going to be able to explain even half of it. Just know this book has beautiful writing and strong characters and gut wrenching emotions that broke my heart. But unfortunately the way Ms. Garner chose to slowly reveal the circumstances of Mason’s death did not sit well with me. I walked away from this book with those images in my head and heart. Seared in my heart! Those sad, devastating, and disturbing details are not what I want to remember the most from this book. I should have closed the book and walked away with some kind of hope. Plus I really didn’t like Meg. How she cut Otis off for all of those years and then walked back in with a “what about me” attitude to her grief came across as very ugly to me. I understand what the author was trying to say and get across—that everyone in Mason's life was in pain and shock. And that we don’t always handle our pain in the best of ways. Otis and Meg definitely needed closure. I get that. But I became pretty darn protective of Otis and I just didn’t think Meg was the best person to help Otis heal in the long run. A strong read that packs a punch. My heart is still broken."}, {"userName": "Bee (Heart Full of Books)", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/18364457-bee-heart-full-of-books", "userReview": "From the first few chapters I thought I was going to fall in love with this book. There was intrigue, beautiful writing, and a really interesting cast of characters. It's the story of Otis, whose best friend and next door neighbour, Meg, moved away suddenly after an unforeseen incident. Otis is left devastated and in mourning for his little brother, and the girl he used to love. In the three years Meg is gone, Otis takes up swimming, coached by Dara the Scandinavian swimming goddess who lost an arm and had to give up her Olympic dreams. I liked Otis' voice...until he started describing every girl's breasts whenever he met them. The male gaze is disgusting, and those moments made me realise why I often steer clear of hetero male protagonists. Otherwise, Otis fits in with the heroes in the writing of John Green, Robyn Snyder, and Jeff Zentner. Unfortunately, that's not the only reason I didn't click with  Phantom Limbs . I felt like the emotional tone was one note. It was the same level of sadness, trepidation and guilt the whole way through. There weren't enough, I don't know,  light hearted, happy moments  to encourage me to keep reading. The whole thing was a bit depressing, if I'm honest. There's supposed to be this slow build up to reveal the exact details of Mason's death and why Meg moved away but I'd vaguely put things together way before they were confirmed, so I'd lost the hook of the story. As for character development, I was frustrated with both Meg and Otis as they were both consumed by the past. Obviously coming together again stirred up old emotions, but it didn't feel like they were good for one another. Meg brought out Otis' jealous, self-conscious side and it was difficult to read about characters who regressed instead. Phantom Limbs  is pretty romance heavy, even though Meg has a boyfriend already. Those kind of blurred moral lines always make me feel a bit uncomfortable but it added to the general teen angst Otis was feeling, and that was the only change of pace in the story, but the trivial glimpses into his hometown life didn't always match well with the nostalgic tone. It's like Otis couldn't progress with two feelings at once. I also can't help but mention the LGBT+ aspect of the story. I'm not sure what Dara identifies as, even though Otis and Meg (who'd only met her a couple of times throughout the story) were OBSESSED with trying to label her as a lesbian. You know what, guys? It doesn't matter. (Louder now for the ones at the back) IT DOESN'T MATTER. Why the heck these two were talking about Dara's sexuality behind her back in their own free time, I couldn't tell you. And don't get me started on Meg's 'I knew she was a lesbian!' at the end. Like, well done? Do you want a prize? I would kindly like to ask for this trope to die in 2018. Dara as a whole was a very interesting sub-plot. It did what all great sub plots are meant to do, distract you from the main plot at convenient times but still be interlinked enough that it doesn't seem obvious that that's what's happening. Still, at times I wasn't sure if this was supposed to be Otis' or Dara's story. And I have to admit, that at some points, I hoped it was the latter. Is it wrong to say that I probably cared about Dara the most over all? I'm not sure how, but I had a much stronger emotional connection to her. Dara and Otis had both lost a part of themselves, but from reading this books, I've realised I'd much prefer to read about the lesbian amputee sticking it to the man. I didn't particularly like what the ending suggested, but I still can't bring myself to give it less than three stars because the opening showed so much promise. If you liked any of the comp authors I mentioned earlier, then I'd definitely give this one a go."}, {"userName": "Emily", "userReviewDate": "Mar 28, 2016", "userURL": "http://www.goodreads.com/user/show/7263033-emily", "userReview": "I'm overcome with love for this book. It has struck me right in the heart and is still resonating hours after finishing it.Beautiful writing in what, feels to me, like an incredibly authentic male POV with a beautiful m/f friendship at its core. This book broke my heart but it also gave me a lot of hope for the future. I feel changed by the quiet power and grace of this story. I'm a forever fan. I'll be buying a finished copy of this book when it comes out.[Read and reviewed an advanced copy.]"}, {"userName": "Dahlia", "userReviewDate": "Sep 24, 2016", "userURL": "http://www.goodreads.com/user/show/4688700-dahlia", "userReview": "Oh man, this was so good, but I cried some very real tears, multiple times. The emotions in this book are just so...surface. You just cannot stop feeling the characters feeling so much - guilt and nostalgia and longing and envy and pain - and it's so earned, which make it that much more intense. I love how every relationship in this book is one you're dropped into while it's already in progress, neither too new nor too established and polished, and you're constantly picking up more and more backstory while also living its growth and evolution. That's such a rare YA construct and it's done so, so well here. Loved it."}, {"userName": "Jeff Zentner", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/129306-jeff-zentner", "userReview": "This is one of those coming-of-age stories that's the whole reason I read and love YA books. The prose is stunning. The characters are vivid, breathing, and fully formed, and the story will break your heart and reshape it into something stronger. This book left my jaw on the floor. Paula Garner has made me a fan for life."}, {"userName": "Shannon (It Starts At Midnight)", "userReviewDate": "Dec 18, 2014", "userURL": "http://www.goodreads.com/user/show/8652150-shannon-it-starts-at-midnight", "userReview": "You can find the full review and all the fancy and/or randomness that accompanies it at It Starts at Midnight 4.5* I kind of adored this book. See, Otis is a swimmer. So it won me over from the start with Otis and Dara and their swimming shenanigans. To sum it up for you:\"Like an Olympic swimmer, Otis Mueller didn't take days off. Unlike an Olympic swimmer, Otis Mueller would never make it to the Olympics.\"\nGah, where to even begin? This book was so good and I kind of want to mostly flail. So how about I do just that?\n  I am going to start again with the swimming, but I loved it. And it was really, really well done. Like some of the things Otis thought about swimming are things I have absolutely thought about swimming. Like:\"Swimming kept me from drowning.\"(Meant in the not-literal sense, but the emotional one);\"'You smell like chlorine. How is that possible?' I shrugged. 'It's in my pores.\"Dara wanted Otis to be an Olympian because she no longer could be. Otis just wanted to do the best he could do. It was such an amazing dynamic between these two. Which brings me to my next point... \n   The friendships. Goodness, I loved how loyal Otis was to Dara. Sometimes to a fault, even, but he was. He was her safe place, and I loved him so much for it. Dara had to deal with so much pain (physically and mentally) and her having Otis was so important. Yeah, he was sometimes too enabling, but the whole point was that they had to work this dynamic out! It felt so realistic, like an actual friendship where shit gets so messy, but you deal with it. \n   The family was so, so important. Since Otis's little brother died, he and his family have basically been in hell, as you can imagine. And yeah, sometimes Otis would get annoyed because he is a teenager and a human, but he was so incredibly loving to his family and always thought about their needs- even when he kind of didn't want to. And they loved him (and his brother) so fiercely. \n   The feels were powerful. I am crying just writing this review, and I finished this book like, a month ago. It was beautiful, and so incredibly difficult to read. As a mom, I had to stop reading a few times during some of of Otis's scenes with his own mom. It was absolutely gut wrenching, but in a beautifully done way. And it was really honest, the way the families dealt with their grief, and how everyone processes these things in their own ways, and that it is okay. \n   I did ship the romance even if I didn't always agree with it. Otis has it bad for Meg. She's been gone since Mason's death, and now she's popped back into his life. He was so hurt by her sudden absence, but he still loves her anyway- maybe too much. Like, that is one thing I had a little trouble with (well fine, that and Otis being way too obsessed with his penis, but I guess that is probably pretty honest too, so I can't really hold that against the book). He is willing to fight for Meg no matter how much she puts him through, and he has already been through a lot. But Meg is a sweet girl too, and has a lot of her own demons to overcome. And it's clear that they have love for each other, despite the years that have passed. \n   Otis's character growth, along with all the characters' growth, is really awesome to watch. It isn't immediate, nor is it complete, but it was really authentic. I won't spoil anything, but each of these characters learned something about themselves, often from the people around them and how they all related to each other. \n   \nBottom Line: \nBeautifully written with characters I cared about deeply, this was such a fabulous debut! I laughed, I cried, I swooned, and I got a hefty dose of swimming, so an absolute win for me.*Copy provided by publisher for review**Quotes taken from uncorrected proof, subject to change"}, {"userName": "Aimee Meester", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/35622829-aimee-meester", "userReview": "I just...I just didn't get to finish. I got about 50 pages from the end before I had to set it down. I'm not a contemporary person, so it's probably not the book for me...but it fell flat in all ways, and I'm not sure what the point was. And look, teenage guys/teenagers in general and all that, but I could do with contemporaries that aren't just a long string of sex jokes and sex sex sex sex sex. Y'feel? Let's just not."}, {"userName": "Kelly (Diva Booknerd)", "userReviewDate": "Nov 04, 2016", "userURL": "http://www.goodreads.com/user/show/11177071-kelly-diva-booknerd", "userReview": "4.5 Stars.Phantom Limbs is a gentle yet wonderfully written exploration of grief and the imprint left behind by those who touch our lives. Poignant and quietly hopeful, Otis is a character that represents a life once bound by sadness, depicted compassionately and delicately. Simply beautiful.Otis is a young man wise beyond his years, sensitive and contemplative and I admired his quiet resilience from the very first page. We're first introduced to Otis the athlete, the black line beneath the water his steadfast companion as a surly Dara hurls thinly veiled motivational abuse in her position as coach slash maybe friend slash emotional support. Dara is an significant support in Otis' life, using not only swimming as an anchor but her formula of brutal honesty was often strangely delightful and quite charming. She's a tyrant, he has a cavalier attitude but under their blasé facade these two love, care and nurture one another so tenderly.Although following Otis, Phantom Limbs is very much Dara's journey, a character I loved fiercely and found her narrative more compelling. Still a young woman, Dara conceals her anguish beneath the surface of a hardened facade, the loss of her mother, her wealthy single father, a Russian businessman who provides Dara with little more than financial support. Although seemingly at ease after the loss of her limb in a devastating accident, Dara experiences phantom limb pains, a condition often experienced by amputees and in Dara's circumstance, subdued by deceiving her cognition into believing her arm is still physically present through the use of a mirror. It was fascinating and a condition I hadn't heard of prior to reading Phantom Limbs. Dara is a private person and internalises her anxiety, both with her condition and sexuality. She's angry, scared and imperfectly flawed to perfection.After three years of silence, Meg is coming back to town and it's abundantly clear that Otis is still in love with his former friend and childhood sweetheart. Meg left town while Otis was still grieving for his brother Mason. Before Meg's arrival, Otis begins to distance himself from Dara unconsciously which left me feeling irate. In conjunction with professional therapy, Dara was a comfort for Otis during his darkest moments and offered him purpose and an outlet to channel his grief. That bastard. It felt as though he only cared for his own needs.I found Meg to be quite charming. She's matured and grown as a young woman since leaving town, returning with a reserved perspective. She isn't the strong, free spirited girl she once was and I felt Otis was pushing the boundaries of their tentative friendship even knowing that Meg was in a relationship.Meg, Otis and Dara are three contrasting and multifaceted individuals that authenticates how complex, delicate and imperfect we are. Our adolescent years are often when we discover our sense of self, self worth and our own ideals and beliefs that debut author Paula Garner portrayed beautifully and faithfully. Loved it immensely.http://www.divabooknerd.com/2016/12/p..."}, {"userName": "Imaane", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/74466443-imaane", "userReview": "A great book about loss, love and moving on."}, {"userName": "Charnell (Reviews from a Bookworm)", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/24060858-charnell-reviews-from-a-bookworm", "userReview": "This is more like a 4.5, but I've given up an half stars. This was emotional and moving, beautifully written too. I loved the characters in this. So much to love about this book. Full review coming very soon."}, {"userName": "TJ Burns", "userReviewDate": "Aug 29, 2016", "userURL": "http://www.goodreads.com/user/show/23826579-tj-burns", "userReview": "Phantom Limbs grabbed me right from the start. I became immediately caught up and involved in Otis's life, soon thereafter Dara's, and a bit later Meg's. TJ's Time Travel Tipshttps://tjtimetraveltips.wordpress.co...This is a story about friendship, hardships, the different ways in which people deal with hardships and loss, love, friendship, and... friendship. I was captivated, asking question after question. Each time I got an answer, so many more questions were presented. The writing is amazing! I enjoyed following Otis's narrative, especially his colorful metaphors. Particularly amusing is the contrast between what Otis is thinking and what he actually says and how he actually acts.Phantom Limbs is really well-written and intriguing. It delves into some very sensitive subjects deeply and gracefully: grief, dealing with grief, love, sex, gender-identity, adolescence, physical disability, post-traumatic stress disorder, family, and friendship.Phantom Limbs was a wonderful read and I can highly recommend it. I received a copy of this book from the publisher via NetGalley in exchange for an honest review.BUDDY READ: Contemporary/Romance > Phantom Limbs by Paula Garner - September 9, 2016 https://www.goodreads.com/topic/show/..."}, {"userName": "Kali Wallace", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/39236664-kali-wallace", "userReview": "Oh, this is a completely lovely book! The characters are so complex and layered, the writing is stunning, and the story is both heartbreaking and hopeful at the same time. It's the story of families and individuals learning to go on after terrible tragedy, but it's never dark or overwhelming. Otis is the most darling main characters ever, and all the people around him are completely fascinating. His friendship with Dara is one of the most complicated and beautiful and frustrating friendships I've read anywhere--not just in YA, not just in contemporary YA, not just in m/f friendships. ANYWHERE. It's that good. I am so jealous of how well the author captures those difficult, fraught, often painful, often rewarding relationships damaged, hurting people have with each other. I will read anything Paula Garner writes in the future. Then I will cry, and read it again, and curse her name to the skies, and cry some more."}, {"userName": "Andrea", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/27117435-andrea", "userReview": "As I read this quiet coming of age story, I kept noting, \"Wow. This is good!\" And it continued to be. A great debut novel.Oh...I forgot to add my favorite, home-hitting quote:\"Why were women so sexy with eating? What if I never developed bedroom skills that could compete with food? What if, I actually got to have sex with Meg one day, and she just lay back, bored, daydreaming about pulled pork sandwiches and chocolate eclairs?\" This MAY have reminded me, of me.... and so I couldn't help but bust out laughing. Sorry boys, it is hard to compete with deliciousness!"}, {"userName": "Jessica Cluess", "userReviewDate": "Feb 27, 2015", "userURL": "http://www.goodreads.com/user/show/35027562-jessica-cluess", "userReview": "A beautiful coming of age story, delicately done. The relationship between Otis and Meg was elegantly handled and very painful. Otis's drill sergeant-like swimming instructor, Dara, absolutely steals the show with her foul mouth and her incredible vulnerability. The character relationships in this book are some of the most nuanced I've read. An absolutely gorgeous read."}, {"userName": "Sonia", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/23989327-sonia", "userReview": "Don't mind me, I'll just be in a corner wondering why everyone loved this book so much. There was a moment around the 90% mark where I thought I might give this one more star, but the ending solved that problem for me.Phantom Limbs had the ingredients to be a great book: second chance love, a character with a disability and who's possibly gay and emotional depth. But the characters ruined it for me. I almost dnf'd this a couple time because I thought I might go blind from rolling my eyes so much. The protagonist of this book is insufferable. He does get better as the story evolves, but I never truly liked him. He's obsessed with his childhood sweetheart, who he fell in love and lust with at 13 (?) and hasn't spoken with for three years. All signs point to this girl being an a-hole but Otis is fucking blind. It was so annoying how hung-up on her he was. It didn't matter that she didn't want to see him or talk to him or that she had a boyfriend but would still give him mixed signals because he just wouldn't move on. Man, have some self-respect, some pride! And the worst part is that he treated everyone else like shit and was all judgy of them. But Meg was perfect no matter what she did. So obviously, I didn't enjoy the romance part of this book. Or Otis' broody inner monologue, which he would sometimes swap for horny teenager thoughts about masturbation, boobs and butts. He could literally be having a serious conversation with a girl and be thinking about her cleavage. That may be realistic, but it made me cringe. And let's not talk about when he tries to be poetic. Nope. Please, stop. Dara was the only character I honestly liked. I found the phantom limb pain thing to be very interesting as I had never heard of it before. I wish we had got her pov, but I'm glad Otis learned to appreciate her in the end. I wish her being gay had been handled differently and that we could have been spared the lesbian sex fetish, but oh well. Despite my negative review, I know this book will appeal to a lot of people. If you like sad books that deal with the death of a family member, the grief that follows and love angst, then this is for you."}, {"userName": "Abigail Lo", "userReviewDate": "May 12, 2016", "userURL": "http://www.goodreads.com/user/show/42134653-abigail-lo", "userReview": "I've gone from rating this 1 star to 5 stars, and everywhere in between.The only problem for me: this book is too personal. I can't say I've dealt with a similar situation as Otis, Meg, or Dara, but I've felt what they've felt. Meg was actually the main reason I wanted to rate this book 1 star. I was so frustrated at her for doing the things she did because she did exactly what I've wanted to do sometimes -- she was irresponsible, reckless, and free. I really, truly hated her for that, and yet, this book deserves as many stars as I can give it.More in depth review to come. Still trying to sort out my emotions."}, {"userName": "Tanja Voosen", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/5464546-tanja-voosen", "userReview": "Das Buch war auf so viele erdenkliche Arten gut. Es hat einige wichtige Themen soooooo gut in Szene gesetzt, aber bei anderen Dingen total versagt. Deshalb gibt es von mir 3 Sterne ... echt schade!"}, {"userName": "Hanae", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/18018922-hanae", "userReview": "Could hardly read because my eyes were rolling so much. The only thing more insufferable than Meg's character is the protagonist's obsession with her."}, {"userName": "- ̗̀  jess  ̖́-", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/7235660---jess--", "userReview": "[One thing I really appreciated is that the book seemed to value friendship over romance, as Otis constantly chooses Dara over Meg. It's not something you usually see in YA. (hide spoiler)]"}, {"userName": "nick ", "userReviewDate": "Aug 09, 2016", "userURL": "http://www.goodreads.com/user/show/2993271-nick", "userReview": "It didn’t take me very long to become obsessed with Paula Garner’s Phantom Limbs. I took one glance at the summary when it was revealed, and I knew that it was going to be a book that I needed to read at any costs. My gut feelings about Phantom Limbs were absolutely right: this was a special and gentle story about first love, grief and friendship.I loved that this book was written in the point of view of Otis. I used to struggle quite a bit with male POVs in the past, but I’ve come to appreciate them in the last couple of years. Otis was so wholeheartedly a boy with his hopes and dreams and hormones. I don’t know what it’s like being inside a guy’s head, but I reckon that Paula Garner was able to capture that pretty authentically. He came across as a strong and charming guy most of the time, but I loved him the most when his vulnerabilities, his grief and his sensitive side were out in the open. There’s just something about vulnerable boys that draws me to their voices in books and Paula Garner definitely crafted one sensitive boy here.As much as I loved Otis, it was his friendship with Dara, his friend and coach, that was the highlight of the story for me. You don’t often get to see platonic relationships between guys and girls in YA books, so it was refreshing to read a book that had one at the focus of the story. It was an interesting dynamic that the two of them shared, with Dara sometimes using Otis to fulfill her incomplete dreams of becoming an Olympic swimmer through Otis, and it was rife with so many complications. Despite how manipulative Dara came across sometimes, I think she played an essential role in helping him become more confident in himself. The scenes with Dara suffering from phantom limb pains and Otis helping her out through the pain were some of the most powerful scenes in the book – they highlighted how supportive they were of each other.Phantom LimbsWhen Meg was introduced, I was honestly not sure what to make of her and her intentions. While it did take some time, she did eventually grow on me. She and Otis shared an unbreakable bond, due to their friendship and the mutual grief over the loss of Otis’ brother, and I loved the glimpses that we got to see of their childhood together. Those scenes were what convinced me that they deserved to have a happily ever after together. They obviously had many many obstacles in their path and it took them a long time to talk out all the unspoken things that needed to be said between them, I enjoyed watching the two of them reconnect and coming to terms with their shared loss.Phantom Limbs also had a strong focus on family. Otis’ parents were very involved in his life and always kept an eye on what he was doing. They too were struggling to come to terms with Mason’s death a few years back. Their sorrow caused an ache in my heart and I couldn’t even begin to imagine the depth of their heartbreak, but the author did a beautiful job at writing their loss in a real way. I also loved all the swimming because they made me nostalgic for the days when I used to swim myself.With strong themes of friendship, family and first love as well as explorations of grief, loss and sexuality, Paula Garner’s Phantom Limbs is a must-read 2016 debut. I haven’t read many debuts this year, but this is undeniably one of my favorites."}, {"userName": "Samantha (WLABB)", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/25774455-samantha-wlabb", "userReview": "This book. Seriously. He lost his brother. He lost his first love. Otis believed he had moved on from both of these, but in reality, he had not. After three years, Meg, the first love, returned. This set Otis on a path of healing and self discovery on which he learned so much about himself and the people in his life. I also hoped Meg has another kind of GPS. One that would navigate her back to me.Otis, Otis, Otis. How do I love thee? Let me count the ways. Otis was such a wonderful MC. He was a swimmer and a poet. He wore his heart on his sleeve. He was sensitive and a steadfast friend. He put others before himself, and acknowledged when he may have been blind to others' needs. He loved his family, and did things he didn't want to in order to make his mom happy. I just loved this boy to shreds. His emotions and pain just flew off the page. I wished I could just reach in and give him a hug. You love someone and they leave, but they never entirely go away. You feel them there, acutely, like an amputated limb. The friendship between Dara and Otis was quite beautiful. It may not have been apparent, but there was a symbiosis there. He was her rock, but she was his too. They each gave a lot to the other, however, while Otis did so obviously, Dara did so move covertly. She picked me up, dusted me off, and kicked my a**. Maybe we all need that from time to time. If we're lucky, there's someone there who cares enough to do it. And speaking of Dara, she was such a fierce, interesting and complicated character. I loved all her layers, and was so happy with the way Garner chose to revel each of her facets. I found myself rooting for Dara, as well as, Otis. She won a place in my heart with her gruff exterior and her tender heart. She might always be my phantom limb. She might always hurt. Meg. I was not always sure about Meg, but when more is revealed, I found a lot of sympathy for her. She was also trying to heal. It was not only Otis' family who suffered when Mason died. It also affected Meg's family, and the fallout may have been, in a way, a little worse. I have to admit, I wanted Meg and Otis to work out, because Otis wanted it to work out. I was all about making Otis happy.But damaged doesn't necessarily mean broken. Me at the end of this book:This was a really beautiful story of loss: loss of a limb, loss of a sibling, loss of son, loss of a best friend, loss of a future. I was touched so many time, and I shed many tears. I sort of lost it during the last 10 pages, but Garner left me a full heart from all the feels."}, {"userName": "Femke (booksfemme)", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/49326561-femke-booksfemme", "userReview": "It is not often that a book makes me cry, gives me that “What now?”-feeling once I’ve finished or makes me question everything about life. But Phantom Limbs did it all, in a good way. It talks about heavy topics like love and loss in a way that really makes you think. It tackles these subject with a certain (dark) humour, inevitable truths and a touch of horny 16-year old boy. Combine this with the writing style of Paula Garner and you get a novel with no shortage of absolutely beautiful quotes.The only reason I didn’t give this book the full five stars is that I somehow couldn’t warm up to Meg. And Otis thinks and talks about Meg like, a lot. Dara was my absolute favourite character, such a strong yet vulnerable character with an intense backstory. Forever rooting for her. Otis was seriously lovable too, even though you’ll sometimes wish you could make him SEE what’s right in front of him. All possible emotions come alive on these pages and the characters make you feel every bit of hurt, anger, grief and regret as if you’re right there with them.Phantom Limbs is definitely a book that I would recommend to anyone on the lookout for a YA Contemporary to sweep them off their feet. Also if you’re not looking… read it anyways. You won’t be disappointed."}, {"userName": "Amy's Book Reviews", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/8149327-amy-s-book-reviews", "userReview": "GRADE: AThree years ago Otis's toddler brother died at the home of his next door neighbor/best friend/first love Meg. Shortly afterward, Meg's family moved cross country and he hasn't heard from her since, with the exception of Facebook stalking. Enter Dara, his self-appointed swim coach, who lost her arm in a shark attack. Her goal: make Otis an Olympian. Now Meg's coming back to town and about to turn Otis's world up, down and every which way. PHANTOM LIMBS tackles the experiences several characters enduring PTSD through the eyes on sixteen-year-old Otis. Every high school kid should have an Otis, a thoughtful friend who doesn't drink, will take the keys of partiers who do and will drop everything if needed. He's such a good guy. He's funny, smart. A poet who thinks about sex a LOT. Though at times in a politically incorrect manner, he's never disrespectful. He knows boundaries. Meg. Wounded, even more than Otis by the loss of his brother. She doesn't say enough or let Otis in. Dara, a hot mess, maddening but easy to understand why. Otis's parents are wonderfully flawed, especially his mother. But what mother wouldn't be, after losing a son in such a tragic manner.Debut writer Paula Garner gave Otis such a unique, ironic voice. His sense of humor, often warped, kept PHANTOM LIMBS from being a downer. At times I laughed and cried in the same paragraph. Garner is a guarantee preorder for me.THEMES: PTSD, grief, sexuality, LGBT, friendship, family, siblings, parents, loss, sports, swimming PHANTOM LIMBS is one of the best books I've read about characters living with PTSD with a story that wasn't about PTSD or trauma."}, {"userName": "Jennifer Rayment", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/3123013-jennifer-rayment", "userReview": "Beautifully written coming of age story about love , loss, grief and forgiveness. Otis is a charming boy dealing with a lot of emotions after the sudden loss of his baby brother three years ago and the sudden reemergence of his ex girlfriend. The story is sensitively written and you can feel that the author has obviously had to deal with the grief of having to live after someone you love has been lost. The dialogue is crisp and realistic, the friendship between him and his best friend is brilliant and honest. Hands down it was a fabulous book and one I would definitely recommend. As a Mom I really struggled with the storyline as it deals with the death of a small child and the one scene had be chocking down sobs. Other than that a solid debut novel Favourite quoteWhen she got this way , my dd would say to me quietly , \"The smart money's on shut up and do it.\"“Here’s the truth about healing. It’s a fucking myth—an idea they try to sell you on to keep you from killing yourself. You love someone and they leave, but they never entirely go away. You feel them there, acutely, like an amputated limb.”"}], "description": "How do you move on from an irreplaceable loss? In a poignant debut, a sixteen-year-old boy must learn to swim against an undercurrent of grief—or be swept away by it.Otis and Meg were inseparable until her family abruptly moved away after the terrible accident that left Otis’s little brother dead and both of their families changed forever. Since then, it’s been three years of radio silence, during which time Otis has become the unlikely protégé of eighteen-year-old Dara—part drill sergeant, part friend—who’s hell-bent on transforming Otis into the Olympic swimmer she can no longer be. But when Otis learns that Meg is coming back to town, he must face some difficult truths about the girl he’s never forgotten and the brother he’s never stopped grieving. As it becomes achingly clear that he and Meg are not the same people they were, Otis must decide what to hold on to and what to leave behind. Quietly affecting, this compulsively readable debut novel captures all the confusion, heartbreak, and fragile hope of three teens struggling to accept profound absences in their lives.", "title": "Phantom Limbs", "url": "http://www.goodreads.com/book/show/28686899-phantom-limbs", "average": 3.97, "cover": "https://images.gr-assets.com/books/1463595147l/28686899.jpg", "reviews": 323, "authors": [{"url": "https://www.goodreads.com/author/show/9879155.Paula_Garner", "name": "Paula Garner"}], "type": ["Young Adult", "Contemporary", "Romance", "Realistic Fiction", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/28686899-phantom-limbs", "http://www.goodreads.com/book/show/23617206-phantom-limbs", "http://www.goodreads.com/book/show/36115105-phantom-limbs", "http://www.goodreads.com/book/show/31950462-phantom-limbs", "http://www.goodreads.com/book/show/29494232-relative-strangers", "http://www.goodreads.com/book/show/31681158-starworld", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}