{"ratings": 12770, "userreviews": [{"userName": "Kim Pallister", "userReviewDate": "Mar 31, 2012", "userURL": "http://www.goodreads.com/user/show/7319106-kim-pallister", "userReview": "This was a horrible book. I gave up on it a third of the way through. I'm not sure why people give the author high marks. Perhaps his earlier works are better and he phone this one in.The book claims to look at scientific advances in a number of fields (computers, biology, etc), and drawing from interviews with hundreds of leading scientists, make predictions about the next 90 years.What it does instead is the worst kind of pop-science futurism. The author picks and chooses from science that supports his favorite hypotheses, and then draws them out to extreme predictions. In doing so he pays almost no attention to factors that could influence other directions, gives no insight into his calculations (if any were done) on how to get to the endpoint. I'm OK with the idea of making concepts accessible to the layperson, but the leap from there to \"trust me, I'm a scientist\" is one that goes too far.In addition, the areas of the book he covered that I have some expertise in (silicon design and manufacturing, augmented reality, virtual reality) were so riddled with error, unimaginative future use cases, and misuse of terminology, that I couldn't trust him on other areas in which I'm not an expert.To add insult to injury, he uses a horrible amount of adverb-laden hyperbole. The first chapter alone had enough \"we will have the power of the gods of mythology!\" mentions that I almost didn't make it to chapter two."}, {"userName": "Michael", "userReviewDate": "Apr 14, 2013", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "Lot of thrilling stuff here in one competent package from a scientist who puts on a futurologist’s hat to give us a tour of how far science will advance and change society over the next 100 years. His topics cut a broad swath with chapters on each of the following: computers, artificial intelligence, medicine, nanotechnology, energy, space travel, wealth, and humanity’s stages of civilization. It’s fun to hear from a knowledgeable writer just how likely it is we will achieve many of the themes of science fiction. Ordinarily, I digest technological progress in little blips of news pieces or brief magazine features that tend to bounce off my mind. I know from my own experience how science accomplishments get hyped and distorted in the media. For these reasons, it was very satisfying to get updates and reasoned projections on a wide variety of fields of work The doubling of computer processing power each year has gone on for decades, conforming to Moore’s Law. Continued shrinking of transistor size driving this progression will soon reach a limit based on quantum limits to how small circuit templates can be etched. Still, before that limit is reached, computing capacity will be astounding and cheap processing power will be emdedded everywhere imaginable. Some of you will have played with the Android mobile phone voice interface Siri. I asked it \"Why is There Air?\", and in seconds it gave me a link to the Bill Cosby routine video from 1964. Pretty handy power already here. The recent release of Google glasses points the way to where portable computing combined with wireless Internet access might take us. Kaku projects that the only screen we will need in the future will a transparent one within contact lenses. Circuits with microlasers are under way that can beam data or video images right on the retina.Computing power readily translates into great success in playing chess, which is based on picking the best move from projecting zillions of possible responses of the opponent. However, true artificial intelligence (AI) progress is stuck in a rut. Attempts to program in autonomy are stymied by barriers in achieving performance based on common sense, and pattern recognition is barely at the level of the mosquito. But “bottom up” approaches for robots learning from errors are beginning to hold promise, and simulations based on brain circuitry are becoming a focus. On the question of when computers with advanced articifical intelliegence will achieve self consciousness (“singularity” in sci fi parlance), Kaku doesn’t know whether to side with those that say 20 years, others who say 100 years, or still others who say never. Unlike the Termnator scenario with Skynet starting a machine-human war, the author thinks we will make sure our robots are kind, addressing the contradictions possible in Asimovs 3 laws and avoiding the temptation to automate Predator drones in warfare. The medicine section of the book was fun for me due to my background in biomedical science and recent work on telemedicine programs. Having a computer interface through contact lenses and wireless voice control should prove pretty effective in medical care and emergency medicine. Kaku book predicts that within 100 years humans will to be able to control computers with their mind. Already we have paraplegics with scalp sensors linked to computer controls that they can write email and play 3D games. Next will be mind-controlled arms and legs for such patients. So maybe we won't have war with machines like Terminator movies make hay with. Biotechnology fused with nanotechnology has a lot of room for speculative scenarios. And if the genetic folks look like they are headed toward bringing back the mammoth, should we try to recover the Neanderthal? Would we put them in a zoo or Harvard? Are we on the way to being able to make a Jurassic Park? Though DNA is too degraded, maybe we can make a generic dinosaur by interpolating between bird and lizard genomes to recreated the ancestral genes. If the snake retains the genes for legs in a suppressed state, maybe some ancient genes are already in there.Nanotechnology’s promise of “making something from nothing” is still far from achieving machines that can carry out molecular assembly from raw materials. Still Kaku does a good job in covering early stages in progress along these lines and the technical issues involved. He has a nicely concentrated discussion over the implications of a future society where jobs and work are largely unneeded. The worker’s mantra of “each according to his ability” will change into “to each according to his desire.” Similar to many sci fi renderings, many believe that:…without the motivating factor of scarcity and money, it could lead to a self-indulgent, degenerate society that sinks to its lowest level. Only a handful of the most artistically motivated will strive to write poetry. The rest of us, the critics’ claim, will become good-for-nothing loafers and slackers. For the future of energy, he is deft and informative about progress on initiatives such as hydrogen powered cars, fusion plants, solar energy plants in orbit, and frictionless transportation using magnetic lifting driven with superconductivity. For the future of space travel, he seems reasonable in his projections for colonies on the moons of Earth and other planets and exploration of asteroids. Serious work is going on the dream of a space elevator, but prospects for massive production of materials strong enough to sustain such a device are unclear. Kaku favors the likelihood of detecting an alien civilization, but he is pretty cautious in predicting the sci fi dream of spaceships with “ramjet” engines scooping up hydrogen as fuel for a fusion engine or with antimatter drives. Instead he seems to favor unmanned interstellar exploration by tiny craft with self-replicating miniature robots, possibly in the form swarming nanobots that can join up in various ways to morph into diverse machines.The book is an easy read for people with only modest scientific literacy. For sci fi fans, it should whet their appetite even more for wonders of the future."}, {"userName": "Robert Kroese", "userReviewDate": "Nov 25, 2011", "userURL": "http://www.goodreads.com/user/show/2624548-robert-kroese", "userReview": "I got this book out of the local library because I heard the author on NPR and the book sounded interesting. I'm doing research for a near-future sci-fi novel and this sounded right up my alley.First of all, the title is a misnomer. This book should be called Technology of the Future, as it's only tangentially about physics. The prose is painfully bad at times, tending toward cliches and mixed metaphors. Consider this gem, for example:\"Like a kid in a candy store, he delights in delving into uncharted territory, making breakthroughs in a wide range of hot button topics.\"Or this one:\"In a word, perhaps no.\"I found the references to Greek mythology and current cinema strained and pointless, and most of the content of the book is dumbed down to an almost ridiculous degree. It's also somewhat vague, repetitive and occasionally self-contradictory. Kaku is very \"gee whiz isn't this neat\" about everything and his attempt to deal with the social and ethical ramifications of the technologies he's gushing about read like essays written for a high school English assignment.Still, there are some really cool ideas hidden amongst the nonsense, so if you get the book from the library like I did and skim through all the blather, it's worth picking up."}, {"userName": "Gendou", "userReviewDate": "May 01, 2011", "userURL": "http://www.goodreads.com/user/show/1339246-gendou", "userReview": "This books is more about the TECHNOLOGY of the future than the physics thereof.Really, if you've kept up with Tech news, you can just skip reading this book...I counted no fewer than 34 references to \"God\" or \"gods\", a bad sign on it's own.There is more time dedicated to ancient mythology than to actual physics!The most annoying is the indicative future used without proper qualifiers.For example, he says something \"will happen\", instead of examining the LIKELIHOOD that it will happen.This is Kaku's worst writing habit, his hyperbolic/extreme language a close second.He loves to use words like \"telepathy\" and \"magic\" when he really means mind-machine interfaces and advanced technology.His over-confident tone is made worse by the preposterousness of some of the claims!Kaku bizarrely champions Kurzweil and like-mined wearers of tinfoil hats.The whole singularity silliness is transparent nonsense to computer scientists.Kaku's proposed \"Caveman principle\" is moronic, he really needs to re-read \"The Selfish Gene\"...This book is full of historical inaccuracies, if not dubious over-simplifications.Kaku blames human aging on 2nd law of thermodynamics, which is entirely incorrect.Aging is caused primarily by the shortening of telomeres, which is controlled by the genes.He goes on to correctly describe this, but his description contradicts this prior, false claim.The book is full of these outrageous claims which seem not to be meant literally at all.Rather, his writing style is to vomit extreme sounding language at the reader, presumably for entertainment.This \"Discovery Channel\" bullshit is horribly offensive, and intellectually dishonest.Kaku colorfully describes frogs and flies as \"lower organisms\", as if to mock readers with a High School education.As if to prove how out of touch he is, Kaku proposes it will soon be common place to have one's genome on CD-ROM.CD-ROM? Who still uses CD-ROMs?! Get with the program, grandpa!!I can't count the number of times I vented my frustration by saying \"cool story, bro\" aloud while reading this book...On a lighter note, the book includes a good commentary on economic bubble, and the changing world of music/newspapers.The final message of the book is that \"the people living today are the most important ever\".This is justified by our being the generation building a \"planetary civilization\".I can't stand this sort of arrogant, self-centered grandiosity."}, {"userName": "Efka", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/22832688-efka", "userReview": "Apie šią knygą galima kalbėti daug ir ilgai, bet pakaks pasakyti tiek: jei išsipildys bent trečdalis to, ką Michio Kaku numano, kaip galimą žmonijos ateitį, mes iš esmės būsim dievais. Bent jau pagal tradicinį, antikinį ar pagoniškąjį dievų supratimą. Taip, yra ir čia keistų prognozių. Yra ir tokių prognozių, kurios jau po keletos metų po knygos išleidimo nepasitvirtino (\"Naftos barelis šiuo metu kainuoja apie 120 dolerių ir nepanašu, kad ateityje dėl ko nors ši kaina turėtų kristi\"), bet yra ir tokių prognozių, kurios aiškios, tikėtinos ir skamba labai logiškai. Ši knyga yra žinojimo kvintesencija. Perskaityti ją beveik privaloma kiekvienam save gerbiančiam fantastui, technokratui ar šiaip apie ateitį smalsaujančiam žmogui. Bet be viso to, dar reiktų nepamiršti, ką sakė I. Asimov'as, kurio teiginį šioje knygoje citavo ir Michiu: \"Liūdniausias dabartinės visuomenės aspektas yra tas, kad mokslas žinias kaupia greičiau, nei visuomenė išmintį.\" Todėl reikia tikėtis, kad mes, žmonija, sukaupsime ir išminties, nes informacija be jos - tik šlamštas."}, {"userName": "Marty Essen", "userReviewDate": "Feb 06, 2013", "userURL": "http://www.goodreads.com/user/show/2758662-marty-essen", "userReview": "This is probably not a book some hard-core science fuddy-duddy is going to enjoy. But if you are just fascinated by learning new things or contemplating the future, this soft-core science book is for you.For me, any book that makes learning fun is a good one. Just think of how many people will pick up Professor Kaku's book that haven't read much more than a science-related newspaper article since high school!My favorite sections of Physics of the Future were the chapters on the Future of Energy (especially his discussion on global warming) and the Future of Space Travel (especially his discussion on nanoships). But so much is covered here that most people will find something that piques their interest.Professor Kaku has a gift for making learning about science wonderful and exciting. And in this book, he'll make you \"think of the possibilities!\"Marty Essen, author of Cool Creatures, Hot Planet: Exploring the Seven Continents"}, {"userName": "Mike Mullin", "userReviewDate": "Jun 02, 2011", "userURL": "http://www.goodreads.com/user/show/2764493-mike-mullin", "userReview": "Excellent when Kaku focuses on technology, physics or string theory. When he veers onto other topics such as history, education, or culture Kaku produces about one WTF? statement per page. Not only are his opinions on these subjects often totally unsupported by evidence, they occasionally contradict other assertions found a few pages away. Even when Kaku sticks with what he knows, his predictions for the future seem almost laughably optimistic and naive. Every problem has a technological solution that, like a glittery rainbow unicorn, will swoop down to make us happier and wealthier. Never mind that all technologies have dark sides--in one blackly humorous passage Kaku extols the virtues of antimatter as rocket fuel while briefly sweeping over its potential as a global suicide device. By the fiftieth time Kaku used the phrase \"In the future,\" I was thinking: In the future, we'll all have access to drugs as good as the ones Kaku's taking right now."}, {"userName": "Daniel Clausen", "userReviewDate": "Dec 06, 2016", "userURL": "http://www.goodreads.com/user/show/957634-daniel-clausen", "userReview": "A fantastic journey into the future of science, technology, and humanity."}, {"userName": "C.W.", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/16702632-c-w", "userReview": "Thoroughly engrossing, entertaining, interesting, and well put together; I enjoyed listening to this a lot, and thought it gave a great and insightful look into things that I don't know anything about. But now I kinda do! Michio Kaku made it all accessible while not dumbing it down at all - he's just got a great writing voice and way of expressing things that's easy to follow. Obviously knows what he's talking about and cares about giving you as much information, in as engaging a way as possible. In general just a lot of fun to read and experience!"}, {"userName": "Sam", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/9021165-sam", "userReview": "I read a couple hundred pages on an airplane, and I regret having made an impulse-purchase of this book in the airport bookstore. Like others, I was disturbed by the poor writing (annoying tone, repetitive and useless allusions to mythology, weird Star Trek obsession...). And as others stressed (and which if I'd had more time before my flight I might have realized by skimming more thoroughly before purchasing), this book has practically no physics in it. At some point I might go back and read some of Kaku's predictions in more detail, but on the whole they strike me as no more illuminating than the guesses of anyone even modestly familiar with some of the early-stage technologies the author is riffing on. In particular, there is very little depth in his analysis of the impact caused by various technological shifts. For (what strikes me as) more incisive futurism, I suggest the work (especially on \"ems\" or whole-brain emulation) of economist Robin Hanson."}, {"userName": "Pamela (slytherpuff)", "userReviewDate": "Oct 30, 2012", "userURL": "http://www.goodreads.com/user/show/2700343-pamela-slytherpuff", "userReview": "See more of my reviews at Bettering Me Up.I was really disappointed in this book. I was expecting more information on physics (darn the title for misleading me!) and was instead presented with a book about the future of technology. Which is cool, since that's my field of expertise and I've seen some of the things that Kaku mentioned in the book.There were some glaring omissions (where is Virgina Tech's CHARLI? And no DARwin? He's the RoboCup champ, for goodness sake!) in the AI section, though it's possible I skimmed over them while my mind was wandering. I'm not going back to check.After I finished the first two chapters, I could read no further.The writing made me cringe. I'm surprised that an editor didn't catch some mistakes: lack of proper grammar (especially colons and semicolons); repeating information from previous paragraphs; cliches and hyperbole; and so on. Kaku repeated the phrase \"it may take decades to accomplish this feat\" over and over. And over and over and over. Well, yes. This is a book about the future, right? (Darn the misleading title again!)"}, {"userName": "Max", "userReviewDate": "Aug 22, 2014", "userURL": "http://www.goodreads.com/user/show/8079403-max", "userReview": "A light fun albeit selective exploration of the future of technology. From internet connected contact lenses and magnetic cars to starships and designer children, Kaku identifies many of the possible advances to occur in the next 100 years. If his optimistic presentation holds it will be a great time to live. His greatest concern seems to be global warming which in his hopeful projections, mankind is able to handle. However he just touches the problem of man’s violent history and leaves out the future of weaponry and other sinister uses of technology. With all the conflict in the world as I read this from the Ukraine to Africa to the Middle East to Ferguson Missouri, it is hard for me to feel as upbeat as the author. Kaku’s wondrous world of 2100 could be, but will it? Perhaps his quote of Gandhi at the end best expresses the challenges we humans face to make it another 100 years:The Roots of Violence:Wealth without work,Pleasure without conscience,Knowledge without character,Commerce without morality,Science without humanityWorship without sacrifice,Politics without principles."}, {"userName": "Colin Bendell", "userReviewDate": "Aug 01, 2011", "userURL": "http://www.goodreads.com/user/show/2494540-colin-bendell", "userReview": "Wow. I'm super excited about the future! Michio Kaku connects work being accomplished the labs with the applications in the future. This isn't about imagining some mythical utopia, but looking at the discoveries and inventions that exist today and how they can be combined and utilized in the future once the economies of scale and mass production are flushed out. For example: We already can remotely control micro robots and we have the ability to analyze cells on a single micro chip. In the future we should be able to inject micro controlled robots into the blood stream that then can perform biopsies and analyze the results instantaneously. The only odd thing about the book is that Kaku seemed to reference 'Pentium' chips numerous times in the first half. It was almost as if the first part of the book was written a decade ago when people still knew what Pentium chips were.On a personal note, I am not filled with dread of a future when moores law has hit a physical ceiling where chips can't get any faster. What will we do?!"}, {"userName": "Fred Forbes", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/3440334-fred-forbes", "userReview": "I had the pleasure of hearing Michio Kaku speak at a convention and figured if his books are as thought provoking as his speeches, I should grab one. He does write well but I think the title of this one is a bit misleading. It ranges far beyond physics to a variety of sciences to lay out a timeline of coming advances but most importantly it goes far beyond science to human relationships, economics and trade and personal lifestyle. Probably the most intriguing development to me it the incorporation of computers into a contact lens that is capable of being controlled telepathically and that can perform all the functions that current machines do and more. Pick up a copy in a bookstore or library, read the last section which describes a \"day in life\" of a person on New Year's day in 2100. If that doesn't pique your interest in knowing how he got there, probably not your type of book, but it was certainly mine!"}, {"userName": "ade_reads", "userReviewDate": "Jun 17, 2016", "userURL": "http://www.goodreads.com/user/show/4528129-ade-reads", "userReview": "\"But science, not superstition, is based on reproducible, testable, and falsifiable data.\" (page : 84 - 85)Finally, I finished this book last night and i'm absolutely hooked!Focusing on medical care, scientist have created a way to insert a chip and it's complete with a TV camera and radio into a pill takes TV images of your intestines and radios them to a receiver. One advantage of a patients intestines and detect cancers, without the inconvenience of sticking a 6 foot long tube up the large intestine.In addition, DNA chips are alsio being created which detect mutated genes when youblow on them. That'ss just a sample of the technology being created.I love the Michio Kaku's writing style, he is not only scientific but he describes the future in a way you can actually picture it your mind.An interesting book that predicts the future within the next decades to the next century by a physicist. So, I highly suggest this book if you like physics and technology."}, {"userName": "Bryan Alexander", "userReviewDate": "Jun 04, 2016", "userURL": "http://www.goodreads.com/user/show/679134-bryan-alexander", "userReview": "Physics of the Future is a light, breezy account of where many scientists and technologists saw their fields advancing as of 2011. It's a nice historical document in that way, and also a very easy to read sketch of the future from an expert perspective. It's also a very positive, optimistic book.Michio Kaku breaks things down by scientific and technological disciplines, exploring each one in turn: artificial intelligence, energy, space travel, health care, computing (again), nanotechnology, and industry (dubbed \"wealth\"). He invokes a mythological figure for each chapter, not to show off but to embody his thesis: \"By 2011, out destiny is to become like the gods we once worshipped and feared.\" (10) Personally I think things will be as likely to turn out in terms of Lovecraftian horror.I give Kaku credit for doing the interviews underpinning this book. He connects with some fine folks, notably the criminally underappreciated Mark Weiser (19ff), sf writer Greg Benford (142)But I have many issues with Physics of the Future, starting with its tunnel vision. Yes, it's a book about scientific development, yet Kaku can't help himself from speculating about politics, business, and culture. These reflections are glancing blows, far too brief to be useful, and often simply naive or bizarre. There's a discussion of the entertainment industry without taking copyright seriously. He calls for a scramble for controlling the world, but doesn't see this as, say, destructive (unless he's fine with that: see 297). Kaku discourses on energy in the laboratory, which is fine (although too bullish on fusion for me), but then offers suggestions for companies that fly in the face of everything we know about the energy industries and their politics. His coda, a science fiction imagining of some days in the life in 2100, manages to envision a person's immediate experience while flailing into a cartoonish socio-cultural void.I can take issue with speculations in each chapter. There's not enough on peer to peer computing, for example. The wealth chapter (again, really about industrial production) is very friendly towards increasing total economic output and the options available to individuals, but isn't too interested in distribution, much less class or international politics, seeing things really as a matter of education. He's too pessimistic on space travel, missing the private sector and new national projects. Yes, it's easy to pick on another futurist, but when we make these forecasts they reveal much about our predispositions and research.By the book's end I was grumpy, and annoyed at the frequent lashings of Hollywood sf movies. Despite myself I did like the triumphant image of humans making a Kardashev Type I civilization. And Kaku's optimism, while I can poke holes in it, is something I personally need, being too easily disposed to a Slavic/academic melancholy. Maybe our dystopia-addled era can use a dose of Kaku."}, {"userName": "Michael", "userReviewDate": "May 18, 2011", "userURL": "http://www.goodreads.com/user/show/350659-michael", "userReview": "When I was little I had a book about what would happen in the future, and it was one of my favorite things. Heavy on illustrations. I remember that the pictures were of people in floating cars, buildings under water, that sort of thing. Fanciful and mostly just made up, but tons of fun to think about. I am wishing right now I knew where it was. I guess there's no way that book or anyone could have imagined what actually has happened! Much more impressive in many ways. Hell, the internet came out well after I started college. This is from a much respected physicist. Probably as well-known for hosting documentaries and such as any work he's done. A spokesman for Physics. He's on the Science Channel and Discovery Channel all the time. Even the History Channel. Michio Kaku. A celebrity scientist, very smart guy. Japanese descent, well-spoken, and able to convey the excitement of scientific discovery as well as anyone I've seen. He works at City College in NYC, where I was trying to be a doctor. Ha! Of course whatever particle physics classes he was teaching were waaay over my head. But I met him in the hall a couple of times and said \"Hey, love your shows!\" This book is great. He takes the large scale view of many differing technologies. Nanotech, biotech, genetics, computers, energy, robotics, space exploration, and more. And he speculates where these things are going, and often how they will converge. The book is both wildly speculative and well-grounded in current science. Tough to do. It has to be taken with a grain of salt, but Dr Kaku makes a solid case each and every time for where he thinks things are going. I am getting this one for dad."}, {"userName": "Jennifer", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/4867502-jennifer", "userReview": "This was an interesting book for me. I'm a scientist myself, but my field, geology, tends to look into the past rather than the future. It made me more aware of the upcoming breakthroughs in physics, medicine and computers. I liked the fact the author is a quantum physicist himself and fully knowledgeable about these ideas and actually got to physically test and see the technology himself. I had no idea how far away we are from creating a true artificial intelligence and nanotechnology, but how close we are in major breakthroughs in medicine such as organ replacements or building a colony on moon. The latter is hindered by cost only, but the technology is there. The science is broken down very simple, so anyone can read this. The one irk I had was he has a very optimistic view of humanity and all these breakthroughs will be for the good of the people. History says that some inventions will have a dark side and there are people and societies that will exploit that. Examples include gunpowder, used originally for fireworks, now more used as a weapon and nuclear energy."}, {"userName": "George Saoulidis", "userReviewDate": "Mar 26, 2015", "userURL": "http://www.goodreads.com/user/show/35931700-george-saoulidis", "userReview": "Great foundation for hard sci-fi inspiration. Mr Kaku is a well educated nerd and we love him for it."}, {"userName": "TarasProkopyuk", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/7038743-tarasprokopyuk", "userReview": "Превосходная, качественная и захватывающая книга!Автор проделал прекрасную работу собрав множество научных открытий в эту книгу. Она словно поток фактов о с острия научного мира от первых его лиц. Да, многое нам уже известно из новостных сводок и может не так уж и удивит, но когда данные о передовых научных открытиях собраны в одно единое место и очень хорошо систематизированы, то читая книгу словно попадаешь в будущее.После прочтения книги вы вряд ли станете равнодушным к науке или к изобретательству. Книга отличная!"}, {"userName": "Correen", "userReviewDate": "Jun 02, 2014", "userURL": "http://www.goodreads.com/user/show/8811289-correen", "userReview": "Kaku makes the complex understandable. That is, one does not understand the complexities but rather has a sense of what is happening. This book creates a sense of wonder. His look into the 22nd century seemed too pat but still challenging to the mind. Given how difficult it has been to find cures for cancer, parkinson's, or even the common cold, it is hard to consider how disease could be eradicated. On the other hand, the use of dust sized computers, seems quite possible.I would recommend this book for inquiring minds of most ilks."}, {"userName": "Elif Köker", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/32874066-elif-k-ker", "userReview": "Kitabı özetlemem gerekirse, halihazırda izleyebileceğiniz tüm bilim kurgu filmlerinde gördüğümüz teknolojinin ufak detaylarla anlatılmış haliydi. Fizik alanında detaylı hiçbir bilgimin olmamasına rağmen kitabın içerisindeki geleceğin teknolojik gelişmelerinin neredeyse hepsini zaten tahmin edebiliyordum.Kötü bir kitap olduğunu düşünmüyorum. Zaten kitabın başında da günümüzde ve geçmişte yapılan çalışmalar baz alınarak ortaya konan bir çalışma olduğunu söylüyor yazar. Yine de eğer teknik terimleri merak etmiyorsanız, Star Wars izlemenizin yeterli olduğunu düşünüyorum. (Ki ben izlemedim. Yine de kitapta uzun uzun bahsedildiği için izlemiş kadar oldum.)Buna rağmen yazarın sürekli dile getirdiği 'Tanrı olmak' muhabbeti bana çok aşırı geldi. Her şeyin mükemmel bir uyum içerisinde var olduğu bir evrende yalnızca uyduruk çiplerin birkaç eşyayı hareket ettirmesiyle Tanrı olacağını zannetmek kadar vizyonsuz bir muhabbet olamaz.Yine de sosyolojik olarak ve süreç olarak bilimin gelişiminin bir bilim adamı tarafından ele alınması, elbette ki, piyasadaki bilim kurgu kitaplarından çok daha güvenilir bir kaynak."}, {"userName": "Queenie", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/33746852-queenie", "userReview": "2 things I'm certain of:1. Dr. Kaku is a sci-fi movie fanatic;2. Dr. Kaku loves Greek and Norse mythologies.Reading this 2011-book in 2018 is liken to going through a condensed, dumbed-down compilation of my Twitter feed speculations throughout the years / today's middle school intro science & technology textbook.It covers various topics in technological histories and advances such as computers, AI, biotechnology, nanotechnology, energy - briefly on fusion power and magnetism even-, climate change, space exploration. Some more amusing than others, all rather simply dabbled in.Interesting to note that we now have self-driving cars, genome-editing is possible with CRISPR Cas 9; androids exist (ahem, Sophia), despite not having a consciousness / common sense, yet. Let's see what Nasa's TESS will find on its space ex mission."}, {"userName": "Ugnė", "userReviewDate": "Mar 16, 2017", "userURL": "http://www.goodreads.com/user/show/30320088-ugn", "userReview": "pagaliau išmurkšliojau. kad pavadinimas turėtų būti ne „ateities fizika”, o „ateities technologijos”, tai visiems aišku. nepaisant šio klaidingo pavadinimo, veikalas įdomus ir aprėpiantis nemažai sričių. sužinojau naujų naudingų dalykų ir pajaučiau, kad į ateities pasaulį bei jo užuomazgas šiais laikais žvelgiu kitu kampu. dėkoju ponui Kakui ir Lietuvos mokslų akademijai."}, {"userName": "Javier Santaolalla", "userReviewDate": "Dec 25, 2017", "userURL": "http://www.goodreads.com/user/show/71695262-javier-santaolalla", "userReview": "La física del futuro de Michio Kaku es un libro donde el autor explora cómo podría ser el mundo en 100 años vista, esto es, a finales del siglo XXI. Trata temas de gran interés como la medicina, la economía o la energía, en un libro por lo tanto muy variado.Es un libro accesible a todos los públicos, recomendable en especial para aquellos que les gusta imaginarse el futuro, y en el que Michio Kaku se moja a predecir el futuro siguiendo evidencias científicas razonables y con el asesoramiento de expertos en cada campo. Por lo tanto un libro muy bien documentado y en todo momento vinculado a la ciencia.Si esperas aprender sobre la especialidad de Michio, física de cuerdas, multiversos, dimensiones extra... este no es tu libro, ¡ojo! Es todo física aplicada y su impacto en la sociedad.Y con un precioso mensaje para las próximas generaciones: la ciencia es el motor de las sociedades, es lo que crea el cambio y mueve las civilizaciones hacia el futuro; por eso que podemos entender el futuro observando la evolución de la ciencia.El futuro... ¡es nuestro!"}, {"userName": "Chris", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/153098-chris", "userReview": "This book had potential but ultimately didn't do it for me. Kaku looks at current trends and developments in science, technology, genetics, medicine, etc. and attempts to picture how human life will be changed by 2100. Positives:Kaku gives a pleasant tour of the many fascinating discoveries and upcoming developments in science and technology. Also, props to him for attempting a thoughtful, well-reasoned guess at what the future will look like.Negatives:Kaku plays it way too safe. In his effort not to get anything wrong he really doesn't say anything that interesting about the distant future. His predictions feel pretty obvious in the near term, and extremely vague in the long term. Also, in a sense this book is a bit pointless. If you're interested in the topic you're probably already aware of most of the developments he describes. I'm not a scientist or a worker in medicine and technology, but just by keeping up on the most popular news stories in these areas I was already aware of almost everything he discussed. That's probably going to be true for most people interested in a book like this.Finally, I was a bit annoyed with his over-enthusiasm for technology and science. I'm a big fan of these things too, but he continuously downplays the potential negative aspects of technology and optimistically promotes their potential positives. It's as though he really believes the advancements of the next 100 years are going to turn us in the noble characters of Star Trek, and will only be used to improve us as a species. He also makes ridiculous conclusions based on sweeping historical generalities about human history, vastly oversimplifying (and offhandedly minimizing) religious beliefs, and essentially all cultures that existed before our glorious present. There's a strong feeling of 21st century elitism, looking down at all those who lived in the cultural dark ages before us."}, {"userName": "Alex Telander", "userReviewDate": "May 10, 2011", "userURL": "http://www.goodreads.com/user/show/595788-alex-telander", "userReview": "Michio Kaku, a professor of physics at the CUNY Graduate Center, sure knows how to make science both gripping and interesting. After the great bestseller, Physics of the Impossible, which tackled all those great science fiction inventions we’ve heard so much about in books, going in detail about when these said inventions would plausibly be invented; he brings things closer to home in Physics of the Future, focusing on inventions developments over the next century.In his new book, Kaku goes into detail where the next hundred years will take us on a number of different subjects, and what possible great things humanity will come up with next. The chapters run the gamut from the future of the computer, AI, nanotechnology and medicine, to where the future of wealthy, energy, and humanity will take us. Each chapter is divided into three parts: the near future, covering the present until 2030; midcentury from 2030-2070; and the far future from 2070-2100. In each of these parts, Kaku covers important discoveries and inventions that will be developed, working off of the technology and knowledge of the current period.Kaku fans and science readers will love Physics of the Future because, while Physics of the Impossible was pretty disheartening to learn that a lot of the cool inventions like transporters and time travel would not be invented until many thousands of years in the future, Physics of the Future covers a lot of fascinating technology that will be developed in many of our lifetimes.Originally written on September 21, 2011 ©Alex C. Telander.For more reviews and exclusive interviews, go to the BookBanter site."}, {"userName": "Harry.C_E2", "userReviewDate": "Sep 10, 2017", "userURL": "http://www.goodreads.com/user/show/71311630-harry-c-e2", "userReview": "I absolutely loved reading Physics of the Future, by Michio Kaku. I have read Mr. Kaku's previous book: Physics of the Impossible. I bought this book and Physics of the Impossible back in the US during summer break and I was already very into science and the history of it. I became extremely fascinated by Mr. Kaku's theories and how he predicts the future of Mankind and Earth. My favorite parts of the book would be his predictions on future space travel, medicine, and nanotechnology. He wrote a lot about how we would reach Mars, our designs for spacecraft and also future cancer cures using nanotechnology. One of the most intriguing chapters was his explanation of the future of spacecraft designs, including the Ramjet Fusion theory, which uses a giant funnel that scoops hydrogen from space, since hydrogen is unlimited and would fuel the spacecraft. Another favorite would be the Orion Nuclear spacecraft, which uses mini-nuclear bombs dropped from a funnel, which would propel the craft at extreme speeds, but what was most fascinating was that this design worked and was tested in the 50s and early 60s but was discontinued in 1962 (due to the 1962 treaty banning above-ground detonation of nuclear devices, signed by the US and the Soviet Union). I was amazed by the numerous theories and the infinite possibilities of space travel, which triggered my love of astronomy and physics. This book was like taking a trip into the future and would be a must-read for any science-loving reader. I'd give it a 5 out of 5!"}, {"userName": "Dave", "userReviewDate": "Sep 25, 2011", "userURL": "http://www.goodreads.com/user/show/1240986-dave", "userReview": "It's not bad, it's just not great either.I quickly got tired of the tone, which seems melodramatic. He talks incessantly about reclaiming the power the ancient gods were said to have, like the Greeks'.It also takes a while to get going and to understand the structure, which takes an area of technology and then explores it near, mid, and long term future.After all of that, I felt like I had heard of most of the technologies he talks about before. The most interesting parts are where he projects farthest out even past the year 2100, or when he talks about the large-scale societal effects of the technologies, rather than the technologies themselves. For example, what would it mean for capitalism to have a 'replicator' that can produce whatever the user needs? What would it mean for population when people are able to live substantially longer? What would it mean for competitiveness when parents can design their children to gene?He tends to be optimistic about all of these things, where a fiction author might take any one of these questions and explore what would happen if we made selfish choices. The book I read after was Oryx and Crake, which did just that."}, {"userName": "Ivana", "userReviewDate": "Apr 16, 2016", "userURL": "http://www.goodreads.com/user/show/38893161-ivana", "userReview": "Profesor teorijske fizike koji je uspeo da razumljivim, tačnije naučno popularnim rečnikom omogući nama običnim smrtinicima, jedno fenomenalno I zanimljivo putovanje u budućnost. Budućnost u kojoj ćemo moći da čitamo jedni drugima misli, u kojoj ćemo se voziti letećim automobilima, kada će preventiva svih bolesti biti moguća zahvaljujući magnetnoj rezonanci veličine današnjeg mobilnog telefona. Budućnost kada ćemo imati svoje avatare i vreme kada će postojati svemirski liftovi u turističkoj ponudi :D Ne znam da li sve to više plaši ili fascinira, ali sigurno je da većinu toga neću doživeti iako će za jedno pola veka, životni vek ljudi biti znatno produžen :D"}], "description": "Imagine, if you can, the world in the year 2100.In Physics of the Future, Michio Kaku—the New York Times bestselling author of Physics of the Impossible—gives us a stunning, provocative, and exhilarating vision of the coming century based on interviews with over three hundred of the world's top scientists who are already inventing the future in their labs. The result is the most authoritative and scientifically accurate description of the revolutionary developments taking place in medicine, computers, artificial intelligence, nanotechnology, energy production, and astronautics.In all likelihood, by 2100 we will control computers via tiny brain sensors and, like magicians, move objects around with the power of our minds. Artificial intelligence will be dispersed throughout the environment, and Internet-enabled contact lenses will allow us to access the world's information base or conjure up any image we desire in the blink of an eye.Meanwhile, cars will drive themselves using GPS, and if room-temperature superconductors are discovered, vehicles will effortlessly fly on a cushion of air, coasting on powerful magnetic fields and ushering in the age of magnetism.Using molecular medicine, scientists will be able to grow almost every organ of the body and cure genetic diseases. Millions of tiny DNA sensors and nanoparticles patrolling our blood cells will silently scan our bodies for the first sign of illness, while rapid advances in genetic research will enable us to slow down or maybe even reverse the aging process, allowing human life spans to increase dramatically.In space, radically new ships—needle-sized vessels using laser propulsion—could replace the expensive chemical rockets of today and perhaps visit nearby stars. Advances in nanotechnology may lead to the fabled space elevator, which would propel humans hundreds of miles above the earth's atmosphere at the push of a button.But these astonishing revelations are only the tip of the iceberg. Kaku also discusses emotional robots, antimatter rockets, X-ray vision, and the ability to create new life-forms, and he considers the development of the world economy. He addresses the key questions: Who are the winner and losers of the future? Who will have jobs, and which nations will prosper?All the while, Kaku illuminates the rigorous scientific principles, examining the rate at which certain technologies are likely to mature, how far they can advance, and what their ultimate limitations and hazards are. Synthesizing a vast amount of information to construct an exciting look at the years leading up to 2100, Physics of the Future is a thrilling, wondrous ride through the next 100 years of breathtaking scientific revolution. (From the Hardcover Edition)(Duration: 15:39:15)", "title": "Physics of the Future: How Science Will Shape Human Destiny and Our Daily Lives by the Year 2100", "url": "https://www.goodreads.com/book/show/8492907-physics-of-the-future", "average": 3.98, "cover": "https://images.gr-assets.com/books/1320504811l/8492907.jpg", "reviews": 1007, "authors": [{"url": "https://www.goodreads.com/author/show/18800.Michio_Kaku", "name": "Michio Kaku"}], "type": ["Science", "Nonfiction", "Science", "Science"], "outlinks": ["http://www.goodreads.com/book/show/8492907-physics-of-the-future", "http://www.goodreads.com/book/show/23771268-ateities-fizika", "http://www.goodreads.com/book/show/12291631-physics-of-the-future", "http://www.goodreads.com/book/show/9933821-physics-of-the-future", "http://www.goodreads.com/book/show/22931441-gelece-in-fizi-i", "http://www.goodreads.com/book/show/13453352-la-f-sica-del-futuro", "http://www.goodreads.com/book/show/16123508-fizika-budu-nosti", "http://www.goodreads.com/book/show/1168341.Physics_of_the_Impossible", "http://www.goodreads.com/book/show/33426.Hyperspace", "http://www.goodreads.com/book/show/33418.Parallel_Worlds", "http://www.goodreads.com/book/show/17978489-the-future-of-the-mind", "http://www.goodreads.com/book/show/328262.Beyond_Einstein"]}