{"ratings": 218, "userreviews": [{"userName": "Sumit Singla", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/18177815-sumit-singla", "userReview": "I love the Planet of the Apes - I was first introduced to the storyline through a fairly average TV series that used to air in the late 90s, and then the recent movies as well. I've always found the storyline vaguely apocalyptic in terms of what the human race will bring upon itself through incessant meddling with other creatures.The story here is intense - what happens when the wise ape called the Lawgiver is assassinated (ostensibly by a human assassin). Will the utopian balance of power between apes and humans be restored? Or will chaos reign?Daryl Gregory tells an engaging story, and the artwork is punchy and engaging, without being amazing. If you're even remotely interested in the Apes universe, please don't miss this one!"}, {"userName": "Jeff Lanter", "userReviewDate": "Nov 07, 2011", "userURL": "http://www.goodreads.com/user/show/2188384-jeff-lanter", "userReview": "Planet of the Apes is a sentimental favorite of mine. It explores prejudice and human folly both of which are topics I am passionate about. When I heard Boom Studios is making a Planet of the Apes comic, I was excited. As soon as I heard it was good, I bought it. This small, economically priced trade paperback sets up a large story set before the first movie. I have only seen the two most recent ones and I was able to jump right in and follow along. The story is essentially political and it is interesting. Daryl Gregory is a very competent writer and the tone of the book is well-done. I was instilled with confidence that this story is one I want to read. There is clearly going to be conflict between apes and humans and I'm interested to see what all comes out of it. The art is certainly unique and while it isn't my absolute favorite style, the jagged lines are appropriate for the tone of the book. The coloring is strong and overall, the art works well for the type of story. What is exciting to me about this comic is that there is enormous potential to explore all kinds of backstory in the Apes universe or tell alternative stories. As far as I can tell, outside of the movies the Apes universe is mostly untapped. This is a sharp contrast to other Sci-Fi properties that have been around and explored already. I am really looking forward to reading more of this series and I think and hope they will do justice to some great movies."}, {"userName": "Robert", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/1491331-robert", "userReview": "A well-done brand extension -taking place in a familiar universe but without trying to shoehorn in established characters from film franchises."}, {"userName": "James  Love", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/25480373-james-love", "userReview": "A prequel to the 1968 movie great introduction to the series mythos. The assassination of the Lawgiver and the first appearance of the mutants from Beneath the Planet of the Apes."}, {"userName": "James", "userReviewDate": "Oct 15, 2011", "userURL": "http://www.goodreads.com/user/show/1193760-james", "userReview": "Full review on HorrorTalk: http://www.horrortalk.com/comic-revie..."}, {"userName": "Terry Collins", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/16134650-terry-collins", "userReview": "The kick-off of a solid series of POTA stories with ornate and lovely detailed artwork and a story that sets the stage for what eventually brought us from the world the Lawgiver imagined where man and apes lived together (although often not in harmony) to the world of apes and mute / savage humans as seen in the original film. This book works well as grim and straight-up \"alternate world\" science fiction with no elements of the satire or humor oft seen in the first five Apes movies, which isn't a complaint really, just an observation. The tone is much closer to the trilogy of recent POTA movies."}, {"userName": "Jim", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/36711648-jim", "userReview": "What can I say? Planets and Daryl. I am there!"}, {"userName": "Reviewer Terra", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/6895379-reviewer-terra", "userReview": "DecentWhile not quite in line with the world of the original films - apes with airships? Flintlocks rather than semi auto rifles? Ape cities across the entire continent? But it wasn't bad and the characters are interesting as is the church of bomb worship. Worth reading."}, {"userName": "Celine", "userReviewDate": "Dec 12, 2014", "userURL": "http://www.goodreads.com/user/show/3387843-celine", "userReview": "Summary: When an ape is assassinated by a human, the unstable truce between the two factions shatters. What I liked:- Even though I have never seen any movie or read any comic in the Planet of the Apes franchise, I had no trouble getting into this book. Everything is exposed clearly and without resorting to massive chunks of text to explain back story- The art style is grittier and darker than I'm usually attracted to, but it works great with the subject matter- There are so many themes underlying the conflicts in this book. It's interesting how a war between apes and humans forces you to think about humanity- I'm starting to think this is just a Boom! Studios staple, but, female characters that are integral to the plot! There is nothing I hate more than the obligatory eye-candy damsel in distress female, in a story that is 99% male. There are good males, good females, bad males, and bad females. That's what I like to see- Also, a pregnant female main character who's still kicking ass. AwesomeWhat I didn't like:- The story is so short! I wish this was told in six-issue arcs rather than a four-issue one. It's over so quickly- Some evil characters just look too much like evil characters. They just ooze evilness- I think some of the technology is rather implausibleVerdict: This Planet of the Apes comic is a great place to start if you're unfamiliar to the franchise. It has the added benefit of being way less sexist than most comics, though the downside is that it's rather short."}, {"userName": "Michael Brooks", "userReviewDate": "Jun 14, 2013", "userURL": "http://www.goodreads.com/user/show/8711887-michael-brooks", "userReview": "I know absolutely nothing, zero, nada about modern comics. This title/series really appealed to me in the store as I stood there like an idiot-poser, searching for something to sink my money into that WASN'T superhero related (though I LOVE superhero) but Holy Cornelius, there is a shit-ton of non-super-hero books to choose from these days and I could literally stand in the comic book store for weeks and still not have a clue...Planet of the Apes looked pretty bad-ass though so I plunked down a few bucks for Vol. 1 and 2 and now I guess I'll be back there later this week for 3 and 4, plus the other one I saw. Like I need another f'n hobby.This particular issue though was right on and pretty much what I wanted; Good writing, Great dialog, Well thought out and interesting plot/world and FANTASTIC art.This is an origin story. The apes and humans are 'enjoying' an uneasy truce and co-existing in their Industrial Revolution-esq society. Meanwhile a certain 'bomb worshipping' faction is plotting an actual human revolution. An assassination sparks an intended result and the set up to the end of ape/human relations is on.This is a fun read. Super fast and smart. There's a moment where an ape is asking about an advanced machine-gun type assault weapon. \"On his sixteenth birthday, a (human) boy would be given an automobile and an assault rifle...\" comes the reply from the ape scientist. How apt.And now it's on to Vol. 2. This is fun."}, {"userName": "Fábio Fernandes", "userReviewDate": "Jul 10, 2014", "userURL": "http://www.goodreads.com/user/show/1926163-f-bio-fernandes", "userReview": "I'm a big fan of the original series (I loved the whole package, even the TV live action and the animated series). Hated the Tim Burton iteration. Found the recent one interesting but failed to grasp my attention (will try to watch the sequel, though - the trailer made it seem worth watching). Anyhow, this comic book series is very refreshing. Daryl Gregory seems to be a huge fan too, and he knows his way around the saga, beginning the narrative sometime around the events of the last film, The Battle for the Planet of the Apes. And it really showed what was going on the former North America by the time of the Lawgiver (the movie only began and finished with him telling to both human and ape children the final story of Caesar), and giving us what could have been a sixth movie of the franchise. This first TP begins showing us around Ape City and Skin City, twin cities already divided by malcontent and prejudice and barely held in place by an ape leader and a human mayor, both orphans raised by the Lawgiver himself. In spite of both her attempts to unite apes and humans, tragedy strikes (no spoilers). This will lead to a series of conflicts and will plunge both cities on the brink of war. The art is also something I liked a lot. Brazilian artist Carlos Magno has a jagged, rugged quality to his drawings that appeals to me. It lends credibility to the narrative. What can I say? I'm going to devour the rest of the series!"}, {"userName": "Mike", "userReviewDate": "Apr 01, 2014", "userURL": "http://www.goodreads.com/user/show/864541-mike", "userReview": "This story is set about 1300 years before the original Planet of the Apes movie, in the industrial city-state of Mak. Apes are the ruling class, while humans live in a slum and work in factories and foundries. Most humans still have the power of speech, but more \"silents\" are born every year, foreshadowing the feral state seen in the movies. Other references to the movies are woven into the plot, but the story stands on its own. In the opening scene, the Lawgiver is assassinated by a human. Immediately, tensions begin to boil over in the city. Now it's up to the Lawgiver's two female proteges (one chimpanzee, one human) to try to preserve his dream of peace between the two cultures.The art is excellent. It stays true to the design elements of the movies in the apes' appearance and costuming, but it transcends the budget and makeup limitations of the movies. The Apes look alive and natural, and the city looks like a full, real city, rather than a small collection of structures. We don't see any of the other exotic settings of the PoTA world like the ruined cities or the Forbidden Zone, but I hope we will in later installments of the series.Nicely done overall, with a lot of care and a respect for the original movie series."}, {"userName": "Dann", "userReviewDate": "Nov 02, 2014", "userURL": "http://www.goodreads.com/user/show/7780298-dann", "userReview": "Planet of the Apes: The Long War is an exciting look at an unexplored part of Planet of the Apes mythology. Set over a thousand years before Col. Taylor's adventure, the story follows the rise of a fascist Ape state in the wake of the Lawgiver's assassination at the hands of a human rebel. Writer Daryl Gregory does a good job at creating new and interest characters, and at setting up a mixed society that was hinted at at the end of Battle of the Planet of the Apes; which was the only theatrical appearance of the Lawgiver's era. Additionally, Carlos Magno's artwork is incredibly detailed and sets an atmospheric tone with its dark shading. There are also some nice homages to past and future elements of the series. One of Boom!'s most imaginative takes on the Planet of the Apes universe, The Long War is dramatic and action packed."}, {"userName": "Oscar Salas", "userReviewDate": "Nov 10, 2011", "userURL": "http://www.goodreads.com/user/show/5515757-oscar-salas", "userReview": "A pesar del trazo ruidoso y con cierta tendencia al feísmo de Carlos Magno, este volumen de nuevas historias del Planeta de los Simios triunfa en entregar información fresca y atractiva a la notable mitología de la saga. Partiendo por la muerte del Lawgiver, la anécdota se sitúa en una era en que humanos y simios aún conviven, pero ya comienzan a manifestarse elementos como los humanos mudos, la negación de la tecnología humana y el culto a la Bomba. Aunque los personajes principales no estén construidos de muy buena manera, el conjunto es lo suficientemente atractivo como para pedir un poco más. Por ahora, una saga que vale la pena seguir. Muy bien por Boom! Studios de jugársela con esta franquicia."}, {"userName": "Mike Jozic", "userReviewDate": "Jan 16, 2012", "userURL": "http://www.goodreads.com/user/show/4530526-mike-jozic", "userReview": "There have been a few licensed POTA comics over the years and, before this, the only one that really caught my attention and held me there was the all-too-brief \"Human War\" published by Dark Horse Comics. What Gregory is bringing to the table in this BOOM! iteration is nothing short of spectacular. I really thought that I would end up passing on the series after this first volume but I was totally swept up by the world these guys have cobbled together, and the political intrigue and human revolt just waiting to happen bring just the right amount of drama and tension to the proceedings. Loving the characters, loving the story, eagerly looking forward to the next volume."}, {"userName": "Chompa", "userReviewDate": "Nov 04, 2012", "userURL": "http://www.goodreads.com/user/show/729626-chompa", "userReview": "I just read the first dozen issues of Planet of the Apes by Boom comics. This is a prequel to the original movie from 1968 which explains a little bit about Ape culture and why the world is the way Taylor found it. There are some other elements in it that really were a bit far out, but still interesting. Some issues were better than others, but overall, I highly recommend this for fans of the original movies and/or TV series. Personal note: The Planet of the Apes television show was one of my all time favorite shows.Overall for the comics 4.5"}, {"userName": "Steven Shinder", "userReviewDate": "Jan 07, 2015", "userURL": "http://www.goodreads.com/user/show/18871381-steven-shinder", "userReview": "This story takes place October 31 - November 3, 2680, ten years after the coda at the end of Battle for the Planet of the Apes. Those who are against the circular timeline theory may not like the blurb on the back saying, \"Taking place before the original PLANET OF THE APES movies.\" Indeed, the assassination of the Lawgiver ignites a war that seems as though it may break the peace between apes and humans permanently, looping back to the original film. However, I do not know this for sure since I have not read the volumes that succeed this one."}, {"userName": "Sean", "userReviewDate": "Aug 13, 2014", "userURL": "http://www.goodreads.com/user/show/6606746-sean", "userReview": "I've always been a fan of this franchise and the look into pre-Heston Apes world is very interesting. The ideas of the caste system in this world is intriguing. The characters are well developed but at times at little too one-note. The art is decent but not dynamic. I think this world, even though the ending is predetermined, has vast potential. Overall, a good but not great introduction into the Apes world."}, {"userName": "Amalie ", "userReviewDate": "Sep 22, 2014", "userURL": "http://www.goodreads.com/user/show/4164661-amalie", "userReview": "I'm not a fan of Planet of the Apes movies although I've seen almost all of them. In this comic series, the story takes place long before the first movie's story takes place. The humans aren’t slaves yet, but the apes are definitely in charge. This also introduces the humans who can’t talk – The Silents. The cause of this is a mystery.This was nicer than the movies. The plot is exciting and complex and we get to learn about the characters as well as the causes behind the war."}, {"userName": "Doyle", "userReviewDate": "Jun 22, 2012", "userURL": "http://www.goodreads.com/user/show/5407218-doyle", "userReview": "I love the world that this story takes place in. A great deal of thought has been put into building this post-apocalyptic environment down to background details, and Carlos Magno's art pulls it off in spades. With a style reminiscent of Mike Kaluta, Magno is easily one of the best comics artists of today. The story in this volume is just a bit slow, but has enough twists to keep me reading."}, {"userName": "Arlomisty", "userReviewDate": "Jan 23, 2014", "userURL": "http://www.goodreads.com/user/show/3921533-arlomisty", "userReview": "Not too bad... I picked up Volume 1, 3, and 4 at the library... though I don't have the second volume I'll try and piece together the story on number three... interesting story so far. I've been hearing a lot of good things about the graphic novel line of the Planet of the Apes, so I decided to check it out. I always loved the old movie and the newest one is pretty good too."}, {"userName": "Eric", "userReviewDate": "Oct 15, 2016", "userURL": "http://www.goodreads.com/user/show/2251846-eric", "userReview": "What a beautiful book. The art of Carlos Magno is superbly done bring both apes and humans to life. The story is told with few words because of the story the art makes on its own. Daryl Gregory knows when to give a story voice and when to be passive. Daryl writes exquisitely complex characters of great interest and favor to readers. Can't wait to continue this awe inspiring storyline."}, {"userName": "Bryan", "userReviewDate": "Jul 19, 2013", "userURL": "http://www.goodreads.com/user/show/645442-bryan", "userReview": "Fun beginning to a new chapter in the Apes Universe. Nice origin sort of story that takes place sometime before the first Charlton Heston movie and after the most recent prequel. Lots of political intrigue, in fighting, action scenes, and commentary on our current society. Can't wait to read the next volume!"}, {"userName": "Jenn", "userReviewDate": "May 24, 2012", "userURL": "http://www.goodreads.com/user/show/2262748-jenn", "userReview": "I can't stand Planet of the Apes, but I love Daryl Gregory's novels and wanted to give this a try. So glad I did! The writing is excellent and unlike most comics, there's no misogyny. Strong female characters abound! I'll definitely continue with this series and check out Gregory's Dracula comics, too."}, {"userName": "arjuna", "userReviewDate": "Nov 02, 2012", "userURL": "http://www.goodreads.com/user/show/4748241-arjuna", "userReview": "Only one word for this: romp. Beautifully drawn and flavoured, really captures the essence, charm and appeal of the source text, while adding a piquant and highly intriguing layer to canon (or one of them at least :) More please!"}, {"userName": "Michael Yankovich", "userReviewDate": "Apr 18, 2015", "userURL": "http://www.goodreads.com/user/show/36856722-michael-yankovich", "userReview": "Love me some Planet of the Apes. The backstory always intrigued me, so reading a story set over a thousand years before the first movie really caught my attention. Good art, good writing, all around good book."}, {"userName": "Henrik Emilsson", "userReviewDate": "Sep 15, 2015", "userURL": "http://www.goodreads.com/user/show/13330954-henrik-emilsson", "userReview": "Apor och människor lever åtskilda och någotsånär jämlika i staden MAK (det är trots allt aporna som styr). Plötsligt mördas lagmannen och personer på båda sidorna ser sin chans att bryta dödläget. En stark trea."}, {"userName": "Aidan", "userReviewDate": "Oct 22, 2016", "userURL": "http://www.goodreads.com/user/show/6233919-aidan", "userReview": "I loved this. Really engaging story with beautifully drawn artwork and strong characters."}, {"userName": "Brandi Montreuil", "userReviewDate": "Sep 30, 2012", "userURL": "http://www.goodreads.com/user/show/6007977-brandi-montreuil", "userReview": "I've always loved the movies, and love this series!"}, {"userName": "Jorge A.", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/4801355-jorge-a", "userReview": "I wonder how this series of the Planet of the Apes will turn out to be......so far so good. It started really well and with a theme that has a lot of potential endings. :-)"}], "description": "The classic action and drama of Apes is back in this brand new graphic novel series.Get your hands on these damn dirty Apes! Beginning an all new series that takes place before the original 1968 Planet of the Apes movie in the continuity of the first five films. Ape society has reached a new golden age. But there are ripples of dissent in both the ape and human ranks. Tensions will rise and soon all will be caught in chaos! And amidst all this uncertainty, what is the fate of...The Lawgiver? Written by award-winning novelist Daryl Gregory.", "title": "Planet of the Apes, Vol. 1: The Long War\n      \n          (Planet of the Apes  A1)", "url": "http://www.goodreads.com/book/show/11689912-planet-of-the-apes-vol-1", "average": 3.87, "cover": "https://images.gr-assets.com/books/1348559233l/11689912.jpg", "reviews": 36, "authors": [{"url": "https://www.goodreads.com/author/show/1343790.Daryl_Gregory", "name": "Daryl Gregory"}, {"url": "https://www.goodreads.com/author/show/305134.Carlos_Magno", "name": "Carlos Magno"}, {"url": "https://www.goodreads.com/author/show/4627513.Juan_Manuel_Tumbur_s", "name": "Juan Manuel Tumburús"}, {"url": "https://www.goodreads.com/author/show/3920517.Nolan_Woodard", "name": "Nolan Woodard"}], "type": ["Sequential Art", "Sequential Art", "Science Fiction", "Graphic Novels Comics", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/11689912-planet-of-the-apes-vol-1", "http://www.goodreads.com/book/show/25170543-planet-of-the-apes", "http://www.goodreads.com/book/show/32827398-spoonbenders", "http://www.goodreads.com/book/show/9466865-raising-stony-mayhall", "http://www.goodreads.com/book/show/17910129-afterparty", "http://www.goodreads.com/book/show/3191189-pandemonium", "http://www.goodreads.com/book/show/20344877-we-are-all-completely-fine"]}