{"ratings": 1650, "userreviews": [{"userName": "Orsodimondo", "userReviewDate": "Nov 21, 2015", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "LUSSUREGGIANTE DI VEGETAZIONE E TRABOCCANTE DI MORTEÈ sempre da segnalare l’arguzia delle traduzioni adottate nei titoli: da ‘Bracconieri’, secondo me titolo efficace evocativo e non abusato, oltre che titolo del racconto più lungo e generalmente considerato più importante di questa raccolta, si è passati ad ‘Alabama Blues’, titolo fuorviante, evasivo, e identico ad altri mille.Davvero non so perché così spesso così tanti commentatori e critici tirano in ballo Raymond Carver per descrivere i racconti di questa raccolta: secondo me, è un esempio che porta fuori strada. A parte la diversità di scrittura, sorvolando sul rispettivo talento, gli ‘eroi’ di Carver sono ordinary people, gente comune, persone della vita di tutti i giorni, alle quali il lettore può facilmente sovrapporsi. I protagonisti di Franklin sarebbero persone comuni in un girone dell’inferno: allibratori, bracconieri, contrabbandieri, ladri, assassini, mangiano opossum e scoiattoli, scuoiano cervi, si ubriacano un giorno sì e l’altro pure, infilano il braccio nella bocca dei pesce gatto, maneggiano armi sin da bambini, si lavano col fango quando sono puliti, conoscono meglio il calibro di pistole e fucili che la sintassi…Il talento di Franklin è di rendere questi individui ordinari come se abitassero nell’appartamento accanto. Vicini di casa che non si vorrebbe mai avere, ordinari come lo sono i personaggi dei film di Quentin Tarantino.James Franco sembra avere una passione ossessiva per Tom Franklin: ha annunciato che vuole produrre tre film tratti da sue opere, “Poachers-Alabama Blues” per l’appunto, “Smonk” e Hell at the Breech”, entrambe non tradotte in Italia. Qui un’immagine da “Goat” del 2016, un film da lui interpretato che racconta con discreta brutalità il mondo delle fraternity.Brutalità, violenza, conflitto, un mondo selvaggio e crudele di cacciatori, pescatori, giocatori, perdenti, bevitori, bracconieri, un mondo che la maggior parte di noi non ha mai visto. E probabilmente, mai vedrà.Franklin ha un’attrazione per i soggetti maudit e deviati che lo approssima al gotico molto più che a Carver o alla grande letteratura del Sud degli Stati Uniti.Siamo in pieno country, screziato di cajun, whiskey di segale, cibi agrodolci e piccanti, solitudine, malinconia, sconfitta, fuoristrada su quattroruote e su due gambe, attenzione cinematografica per il dettaglio. Franklin sa raccontare, con ritmo e costruzione.Il mio sud è l’Alabama del sud lussureggiante di vegetazione e traboccante di morte…Una bella famiglia di bracconieri del sud degli Stati Uniti."}, {"userName": "Melki", "userReviewDate": "Dec 03, 2012", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "I've read so many short story collections this year about men behaving badly - Airships, Kentucky Straight: Stories, Close Range, and Knockemstiff - to name a few, that they're all starting to blur together in my brain like a big fleshy ball of rednecks drinking, farting and shooting at one another.Add another one to the list, by yet another terrific author.Peek into the world of men who work at chemical factories, gas stations and wastewater treatment plants. As you might expect, their lives are far from cheerful. Alcohol and firearms offer escape, and bad things end up happening to plenty of animals and people. Probably the only negative thing I can say about these stories is that some of them are...forgettable.Not so the title story about a nasty trio of backwoods brothers being stalked by a mythical game warden. His job was to protect the wild things the law had deemed worthy. Deer and turkeys. Alligators. But how did the Gates boys fall into the category of trash animal--wildcats or possums or armadillos, snapping turtles, snakes? Things you could kill any time, run over in your truck and not even look at in your mirror to see dying behind you? Christ. Why couldn't Frank David see that he, more than a match for the boys, was exactly the same as them?Okay. So it's NOT the \"feel-good\" book of the decade; this one is still definitely worth a read."}, {"userName": "Cathrine ☯️ ", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/22600410-cathrine", "userReview": "4★“A glimpse into the world proves that horror is nothing more than reality.” Alfred HitchcockTom Franklin once wrote that he is driven to write by the need to “tell of my Alabama, to reveal it, lush and green and full of death.”When I added this to my TBR a ways back I thought it was about a game warden and poaching. Ever since reading Crooked Letter, Crooked Letter I have wanted more. This is Franklin's debut of short stories. I don’t think I can describe this selection better than the book blurb for the atmosphere it imparts. The title lettering on my cover copy reminds me of a movie poster for a horror film. The theme of poaching runs throughout but applies a broader interpretation to the author’s home state of lower Alabama in the 1980/90s era as it “yields its forests, bogs, and rivers to lumber mills, power plants, and chemical factories.” It’s dark and scary, populated with cruel, violent men living off the land, alcohol, beef jerky, beer, M&Ms, and cigarettes. Alabama’s state motto translates as We Defend Our Rights and many of these characters have extreme personal viewpoints of what those are and how to protect them without boundaries or limits, no doubt jacked up on their dietary choices. I found it necessary to skip one chapter that dealt with particular animal cruelty but cannot explain why I made it through the others. I was thinking I could have done without this one until I read the last story from which the book gets the title. I’m going to read it again before I return this book to the library.I’ve been complaining about popular thrillers I’ve read lately. Mainly because they don’t deliver for me. Mr. Franklin could teach a writing class on Thrillers 101. This was the real deal and will no doubt haunt me for a while. Overall I was thinking maybe three stars until that last one. Unforgettable. Superb."}, {"userName": "Lauren", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/7852584-lauren", "userReview": "\"Goddamn, son,\" Frank David whispers. \"I hate to civilize you.\"\"Poachers\" is a novella in the collection Poachers; naming a short story collection after its star novella is a perfectly fine convention except for how it currently inconveniences me, because I like Poachers but love \"Poachers.\"\"Poachers\" centers on general store owner Kirxy, whose wife died some years ago and whose most valued human connection since has been with the three Gates boys, the area's half-feral orphans who telephone catfish, hunt out of season, and rarely speak. They aren't likable--among other things, they request as part of their payment that a man bring his fifteen year-old daughter out on the porch so they can stare at her--but there is a grubby, wild vulnerability to them. They're brutal, but they'll never belong. They're something the town permits to exist--something the area's game wardens ignore--because their lives have been so strange that this seems like the only way they can live. But that's the kind of silent permission that can only exist when everyone knows the rules, so when a new game warden arrives and tries to fulfill his job by arresting the boys for poaching and the Gates boys respond by killing him, well, it seems like the pact has been broken.But one of the things that makes \"Poachers\" so brilliant is the strangeness of what follows, where the concept of civilization loosens until it seems to lose its meaning. Kirxy's determination to see the boys face no consequences for the murder runs up not so much against the local law but against a personal vendetta as savage and as little tethered to the rules of society as the boys themselves. And what results is violent and grotesque and darkly moving.The other stories are fine. \"Grit,\" which opens the book, is a bleak comedy, sort of \"Bartleby the Scrivener\" reversed, about a manager of a grit plant who finds his job slowly taken over by one of his less law-abiding employees, has a terrific sense of place even if the level of reality at which the story is working is never entirely clear. \"The Ballad of Duane Juarez,\" which sees a man in a going-nowhere life of seething envy eventually shooting a car trunk's worth of kittens, feels like a Drive By Truckers song in prose: a story that gets into the anger and hopelessness behind an appalling act and then tells it straight. (I had to slot that one into the review because I feel \"brutal kitten slaughter\" might be a dealbreaker for some. I liked the story but found that difficult to get through.) \"Tiny History\" has the great vibe of being a Raymond Carver story transplanted into Franklin-land, a two-couple get-together full of regret and viciousness and the desire to swap partners. Those are the ones I found especially engaging, but all the stories have Franklin's style, which is exceptional--poetic and bloody, and never shying away--and an evocation of setting and Southern atmosphere that's simultaneously gorgeous and entrenched in mundane details. It's just that a few too many of them feel like exercises in mood that are still in search of plots.Nevertheless: \"Poachers.\" And it's worth saying that Franklin's introduction is superb, a description of his childhood where the rites of passage involved hunting and having his face smeared with deer's blood, and how he comes back to that as an adult, with love for that history and setting, appreciation for the power of its strangeness and wildness, and disdain for outsiders who turn away from the truth of that allure and would fence everything in and make it safe and exclusive. It shouldn't be skipped--the strength of its narrative and the sharpness of its details make it an indelible story as well as a persuasive essay."}, {"userName": "Larry Bassett", "userReviewDate": "Jun 13, 2014", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "I am not a hunter. I am not an outdoor person. I am not the rough and ready type at all. I do not play contact sports – or, for that matter, much any sport. Not even poker or darts. I walk the dog. I read. I take care of all of my ADLs as necessary. I do live in the south in the Bible Belt and try to acknowledge that by paying some attention to southern literature. I joined the GR group On the Southern Literary Trail some time ago and have discovered quite a few new authors as a result. I have just recently come to understand that there is a genre sometimes called Grit Lit. I guess grit can refer to the food made from corn or to the abrasive made from fine sand. So I am surprised when our author Tom Franklin writes: What am I doing here at the Blowout, during hunting season, without a gun? It’s a familiar sensation, this snag of guilt, because when I was growing up, a boy who didn’t hunt was branded as a pussy. For some reason, I never wanted to kill things, but I wasn’t bold enough to say so. Instead, I did the expected: went to church on Sundays and on Wednesday nights, said “Yes, ma’am” and “No sir” to my elders. And I hunted.As I am reading the story, I find that I want to learn about abrasives so I go to http://www.uama.org/Abrasives101/101T.... I am reading about deer hunting, reading about the manufacture of grit, reading about how to operate a front end loader. This book reminds me of some of the things I did as a kid in the Detroit suburb of Royal Oak when I was growing up in the 1950s that were neither safe nor savory. So there is some identification going on in my mind. He’ll be waiting on my steps early one morning as I’m getting home from work. He’ll crack jokes about punching a time clock. He’ll tell me he sold the Triumph in Tempe, Arizona, and moved in with a Navajo woman for too many months, then stole her Trans Am and drove to California to live with his friend Laura, an actress. That he got a bit part in a Robert De Niro gangster film and somebody recognized him and the FBI found him and he did time. That when he was released after two years, he rode the bus east across the country. He watched the states pass him by, buttes and deserts and oil wells and famous rivers and markers of historic events. Outside El Paso they passed a huddle of Mexicans standing in their yard watching their house burn down. In another bus he crossed Louisiana during the dark early morning hours with a plastic flask in his pocket, watching his cigarette tip glow in the window, reading the names of places and trying to remember if he knew anybody from there. Do I really want to know or get to know anyone like that? Maybe not.  We’ll notice things: three hawks in the same dead tree. A flatbed truck hauling a steeple. A child’s wheelchair in front of a trailer. We’ll drink beer and stop to piss along the road between the towns, Creola, Axix, Bucks, Sunflower, Mount Vernon, Calvert, McIntosh, Wagerville, Leroy, Jackson, Grove Hill, Fulton. Would they want to share a Duck-Rabbit Brown Ale? Probably not. Maybe the book cover says it succinctly in the most positive light: This terrain isn't pretty, isn't for the weak of heart, but in these desperate, lost people, Franklin somehow finds the moments of grace that make them what they so abundantly are: human. I’d say there is some truth there. But nastiness that overwhelms the humanity, I think, too often.Dinosaurs: This has got to be the best story in the book. Steadman trades the cover up of a leaky gas storage tank at Kilpatrick’s Sinclair station for a 350 pound stuffed rhinoceros for his Dad’s seventy-eighth birthday. This story reeks with the smell of oil and half-smoked cigarettes and filial love.Sometimes good writing can overcome nasty stories. Tom Franklin can do that to me in Poachers where he got started in the grit trade in 1999. The boy’s got some miles on him now and has broke in some stories. I’m glad I met him with  Crooked Letter, Crooked Letter  first. I’d say he made it through some rough territory to get to that book. I saw him first at his best. In these short stories he still had a ways to go to find his best. Poachers is a strong three stars. It kept me reading through the title story but glad to call it a day and move on to the other books we are reading this month. I also just ordered a copy of The Tilted World, Franklin’s most recent book that he co-wrote with his wife. I am hoping she smoothed out some of the unnecessary (for me) roughness."}, {"userName": "Sandra", "userReviewDate": "Aug 09, 2015", "userURL": "http://www.goodreads.com/user/show/25936805-sandra", "userReview": "JESUS IS NOT COMING.\n\nNope.Better to rely on guns and alcohol these people must've thought. It is all about survival. Yet, Franklin shows a humane side in them, opposed to the darkness they seemed to be surrounded with.Compared to Frank Bill's \nCrimes in Southern Indiana: Stories\n, this is grit lit with a softer touch, not as violent, but just as bleak and desperate.Franklin manages to insert some touches of dry humor, especially in the Introduction when he tells us why he needed to hunt,\nBecause at sixteen, I’d never killed a deer, which meant I was technically still a pussy.\nthat he'd rather tell stories,\n...until I was fifteen years old, I played with dolls. Not girls’ dolls, but “action figures.” ....But while he [his brother] would wrench off G.I. Joe’s head and hands to examine how the doll was put together, I would imagine that my G.I. Joe was Tarzan of the Apes. One of my sister’s Barbie dolls, stripped to a skimpy jungle bikini, became Jane. A foot-tall Chewbacca was Kerchak, an ape.\nand his father's support of that\n“No,” he said. “I’m real proud of you, son. I’m glad you’ve got…imagination.”\nSo telling stories, he does. Well. Very well. Captivating the reader through each single story, he ends with the longer-than-the-rest title story where three poaching brothers go on a collision course with anybody daring to stop them. I though this one should've been longer, or turned into a novel on its own.Another author to add to my favorites list!"}, {"userName": "Laura", "userReviewDate": "Dec 07, 2013", "userURL": "http://www.goodreads.com/user/show/7555122-laura", "userReview": "To be fair I'm not a big fan of short stories. I prefer a good novel. These are very well written but as a female I didn't really connect with the happenings in the stories such as hunting, loading cats in a trunk, driving a front loader etc. I will say if you are sensitive to animals being hunted or killed you might want to pass on this one. I liked the eeriness of Poachers the best. I think I will try one of Franklin's novels bc that might suit me best."}, {"userName": "Shaun", "userReviewDate": "Feb 19, 2014", "userURL": "http://www.goodreads.com/user/show/9779623-shaun", "userReview": "Has a rocky start but eventually hits its stride and finishes strong.After the first few stories, I was worried. Not that I hated them, just that they fell well below my expectations. Yet once Franklin finds his voice and his grove good things happen.Would recommend this to fans of southern Gothic fiction/ country noir/ grit lit."}, {"userName": "Josh", "userReviewDate": "Nov 27, 2013", "userURL": "http://www.goodreads.com/user/show/10773168-josh", "userReview": "Having read Crooked Letter, Crooked Letter, I was somewhat excited to get into Tom Franklin's debut collection of stories about the swampy corner of Alabama that he nested in as a young boy. I had put it on the \"I'll get to it some day\" shelf. It was selected as a group read this month within the group On the Southern Literary Trail, so I decided no time like the present. What a good decision.Franklin get's right to it. To my taste, there's not a bad one in there.......but they're all bad from the perspective that he can dive beyond surface level and get to the marrow of the undersides of people, places, and things. The parts normally not on display for purpose of public consumption. I have to think a bit of Franklin's perplexed mind is also on display- the parts that can blend factory work with spare time spent reading novels, badge carrying poachers with their young boys who question the desire to hunt or kill at all, chicken fighting with beloved patriarchal lawmen and salt of the earth levelheadedness. There's no filtering the truth as he sees it.My favorites without question were \"Dinosaurs\" and the longer than the rest \"Poachers\". I found it quite fitting that in the acknowledgments Franklin thanked Rick Bass, as \"Dinosaurs\" could have just as easily been penned by Bass. I had no idea of the connection between the two of them. While their writing has taken a different trajectory since the time this was published, I certainly can see the connective tissue on the front side of Franklin's published works.One last note, the author photo on the back cover of my copy cracks me up! Having met Franklin last year at the Southern Festival of Books, the bio pic clashes in a hilarious way with the author of 2013. That day he was dressed in a wild, loud, paisley pattern, starched crisp button up oxford and wore en vogue spectacles straight from the cover of GQ (not in a \"impress you\" way, more a statement of individuality). That mind picture, and the snapshot on the back of this one don't even know each other..........or perhaps they do.........like I said, he can blend together opposites in a way that you get the opportunity to meet both halves."}, {"userName": "Diane Barnes", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "I have to say, for a first book, these short stories were superbly written. Of the 10 stories in the book, \"Poachers\" was my favorite. Actually more of a novella at 60 pages, I would have been happy to see this one expanded into a novel. All of the stories were rich in characterizations of the people, and descriptions of the woods and swamps of Alabama. I have been reading Franklin backwards, starting with \"Crooked Letter, Crooked Letter\" and \"A Tilted World\" and haven't been disappointed in any of them. The only one I haven't read yet is \"Smonk\", but that's on the list."}, {"userName": "Jonfaith", "userReviewDate": "Jun 13, 2010", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "Someone told me the other day that William Gay had passed away. That momentary deflation I associate with the death of familiar artists left me pondering legacy and contemporaries. It would prove approapirate to assemble my own introspection. I always felt that Gay was improvising; he was an autodidact channeling a lifetime of fractured stories. Tom Franklin took the pitch as if he owned it. The stories here establish his talent as one for the ages."}, {"userName": "Timothy", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/13015682-timothy", "userReview": "2.5An okay collection of stories about sad southern white men."}, {"userName": "Bibliophile", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/3111409-bibliophile", "userReview": "The snake venom had bleached the boy's pupils white, and the skin around his eyesockets had required grafts. The surgeons had had to use skin from his buttocks, and because his buttocks were hairy, the skin around his eyes began to grow hair too. In the years to come, the loggers who clear-cut the land along the river would occasionally stop in the store, less from a need to buy something than from a curiosity to see the hermit with the milky, hairy eyes.That's Tom Franklin's idea of a happy ending. The testosterone practically spurts off the pages in this country noir short story collection. I'm sure I could go on about it being a fascinating study of masculinity and all that, but all you need to know is there's lots of violence, hatred and general backwoodsy wickedness. The only thing missing was Burt Reynolds in a wetsuit, with a crossbow. I for one certainly don't feel like going poaching any time soon."}, {"userName": "Jeanette", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "Rarely do I give short stories a 4. Just not my favorite length and here were quite a few very short ones. They seem, to me, also about a 9 out of 10 on the macho scale and would especially appeal to male readers. Grit was such a story that I'll never look at the quarry shifter machines quite the same way again.Tom Franklin started out good as any pro and has just improved from there. Marvelous exposure to Alabama pine woods rural and Southern youth experience too.Chewy too, but not way over the top gross. Grit. Lit. in the short version."}, {"userName": "Erika", "userReviewDate": "Jun 01, 2013", "userURL": "http://www.goodreads.com/user/show/1037839-erika", "userReview": "The raw power of Franklin's writing makes me swoon. There are stunning scenes and imagery that made me read a sentence or paragraph over and over again. The only reason this isn't a 5 star is because I just read Crooked Letter, Crooked Letter and it dazzled me a teeny tiny bit more."}, {"userName": "smetchie", "userReviewDate": "Apr 08, 2013", "userURL": "http://www.goodreads.com/user/show/187563-smetchie", "userReview": "Anything else written by Tom Franklin? Lay it on me. I can't get enough. This book was a present from my dear friend who knows me and loves me. Thanks, dear friend!"}, {"userName": "Michael", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/14844044-michael", "userReview": "Tom Franklin's first book (short stories). Not as darkly intricate as Hell at the Breach, nor as fluid as Crooked Letter, Crooked Letter - but still enjoyable. The first story, \"Grit,\" and the last story, \"Poachers,\" are by far the best. Franklin's trademark pathos for a people and place (the dark pockets of Alabama), no matter how odious either may be, really shines in these two stories. And while other stories do have merit, they lack the power of these other two, and sometimes end with a whimper. But hell, I still love the way Franklin writes, and will read anything he puts out. Smonk may be next."}, {"userName": "Iľja Rákoš", "userReviewDate": "Mar 14, 2016", "userURL": "http://www.goodreads.com/user/show/37210873-i-ja-r-ko", "userReview": "As the 20th century draws to its close, in the deep South the working poor and the country poor battle sadistic fate, debilitating heat, and soul-scarring routine. Some are resigned to simply endure, all in the service of maintaining the only existence they’re capable of imagining. While for others, the dream – no matter how improbable – is to just pack up the car and get going, get out, and get anywhere on nothing but collective wit and fumes, perhaps get as far away as Alaska and the rumored wealth awaiting them there.But in this place with its entrenched poverty among a folk this degraded, when things can go bad, when dreams can go bust, they usually do. Spectacularly so. These stories from Tom Franklin are reliably violent, and suitably ill-fated, peopled with characters who, if they weren’t self-destructive it might be difficult to identify any other character trait they do possess. And yet this collection of faithless womenfolk, frugal hill-dwellers, skin and bones black poor, and colorfully named hunting dogs is somehow unsympathetic, the victims of being, perhaps, too carefully drawn.Make no mistake, Tom Franklin can conjure up the bedraggled South – or at least how I imagine it must be – but too often the scenes that result have the feel of something created for the stage rather than the page. A hound dog by the fieldstone fireplace. The sound of raccoons scrounging in the garbage cans outside. Coyotes down at the pond hunting bullfrogs. The bullfrogs croaking in the mist. The toothless granny singing gospel hymns, her rocking chair thumping against the wide-plank pine floorboards. The divorcee granddaughter making grits in the kitchen while Junior shoots cats in the barn. And papa sitting alone, putting his nightly 12-pack to bed, mumbling regrets over friends long dead. And while none of that (almost none of that) specifically appears in these stories, these character types fall flat not from overburdened characterization, but from a sort of enforced authorial isolation - as if they were the product of a writer producing character studies to be used in some future story. Like a child's peel-and-paste sticker book, they could be stuck into any and every fictional locale, yet seem to beg organic inclusion into the setting written specifically for them. These characters tend to exist, to act as if there were no one around to interact with, to converse solely within their own heads. It could be they're laconic or simply lonely, but these Southerners don’t talk all that much, and when they do they sound like they’re delivering lines – their stories just so much well-crafted exposition, setting us up for action that never comes.It’s not that these tales of industrial murder, not-so-civil disobedience, a birthday rhinoceros, and the hint of hot-wife swapping are uninteresting, but they are somehow static – resigned to the inertia of the lives they chronicle. So clean, so meticulously drawn, down to the suitably bad choices they will all eventually make.Two exceptions from the frustrations of this literary inertia are well worth mentioning: the delightfully menacing “Ballad of Duane Juarez” and the title story, more a novella, “Poachers”. Perhaps because they are less concerned with their characters’ internality, affording us plenty of action to weigh against its possible motivations, but more, I think, because these deeply tragic stories expertly keep the tension at a low simmer, their reveal coming late, coming sharp.Imagine what American fiction in general would look like without the brilliance of Southern fiction – without Welty, Faulkner, O’Connor, Gay, McCarthy, and this writer, Tom Franklin. Pretty depleted. Now imagine the choice between NO Southern fiction, and Southern fiction that’s just good enough. \"Poachers\", despite its unevenness, despite its hesitance to reveal the horrors and take the risks we expect from the best writers of the American South, is more than “good enough”; it’s a worthy addition to your Southern list. It’s a set of stories akin to moonshine: even when it’s not great, it’ll still put hair on your chest. But when it’s good, it’s - damn, boy! sit down and get your breath – so fine."}, {"userName": "Mike", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/11686671-mike", "userReview": "Poachers by Tom Franklin is gloomy, bleak, melancholy… A kind of Southern Gothic noir, dark, at times brooding, offering no excuses and asking no forgiveness. The people in Franklin’s tales are living lives of quiet (and sometimes not so quiet) desperation, they know that the best times are likely behind them because, as it says on a sign nailed to a tree in one of these stories, Jesus is not coming. Not for them.This collection is made up of ten stories of varying length, and one essay that serves as an introduction to the world that author Tom Franklin will be opening up to the reader. It is the nature of short stories that they can sometimes be insubstantial - the space doesn’t allow for great character development so often a short will strive to set a tone and that’s it - like momentary snapshots of a greater tale that goes untold. That is the case here, some of these short stories are poignant and will stick with a reader for days afterwards, others are just not substantial enough to stay with you after reading. I am not saying they are not good stories, there isn’t what I would consider a bad one in the bunch, but some are better than others. -- introduction * hunting yearsThe author returns to what used to be the family property, long since sold off, so that he can touch base with the land of his youth, the place that informed and inspired the man he would become and the stories - these stories - that he would write to both honor and vindicate his homeland. He ruminates on his own experiences, on his connection - and need to reconnect - to the place that spawned these stories, on the passing of what once was into what it has now become.-- gritThe inept boss of a grit mill on the verge of shutting down can never quite seem to get ahead, then he gets caught up in a shifty deal that virtually insures he never will.-- shubutaA man at a time in his life when nothing seems to be going his way. His favorite uncle lies in a hospital bed, probably dying, his new girlfriend has left him, and he has been having serious thoughts of suicide… or maybe they aren’t that serious. -- triathlonRelates the story of a man who is living the remnants of an American Dream that never really got started. Touching base, from time to time, with an older, more worldly friend - a runner - who pops in and out of his life at irregular intervals.-- blue horsesTwo friends on an early morning mission of mercy of sorts. Going through the motions while never acknowledging what it is they are about. -- the ballad of duane juarezThe older ne’er do well brother who lives in the shadow of his younger well-to-do brother who married for money. -- a tiny historyWe meet several of the characters from triathlon in earlier, semi-happier times. -- dinosaursDoes the title refer to the fossil fuels that provide a living to the main character? To his aging, memory impaired father? To the crotchety gas station owner who would just as soon see him drive off the face of the earth? To he, himself, working in a job he is overqualified for and feeling the chill of middle-age breathing down his neck?-- instinctA man named Henry, in his late 30s, lives with his parents and makes enigmatic plans for someday...and then, it seems, someday may have come.-- alaskaTwo plant workers dream of chucking it all and hitting the road to Alaska, like two little boys dreaming of the fancy cars they’ll have when they grow up. -- poachersBy far the star of this collection. The three Gates brothers are second generation poachers who are more part of the woods they hunt than civilization. Orphans since the oldest was 14-years old they have a friend and surrogate father of sorts in Kirxy, an old man who runs a store/outpost. More animal in many ways than men, through circumstances of their own making they find themselves at odds with a legendary game warden who is out for a reckoning.This book contains strong language, adult situations and violence. I would recommend it to any fan of the genre known by a variety of labels such as Country Noir, Hick Lit, or Grit Lit. Anyone looking for a quick, easy,happy, pick-me-up type of read will be greatly disappointed."}, {"userName": "Snotchocheez", "userReviewDate": "Jan 04, 2011", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "Tom Franklin's first book: \"Poachers\" (a collection of short stories tied together with the theme of poaching in its various forms) became required reading after I was blown away by his grisly account of the Mitchem Beat War in post-Civil War southern Alabama in his novel \"Hell at the Breech\". It certainly doesn't disappoint. To the contrary, it presages an amazing storytelling talent. Mr. Franklin possesses a keen talent for conveying mood and and emotion through raw realism, a talent few writers have, and certainly strive to attain. That Franklin achieves it with his first published book is eye-opening, if not jaw-dropping.It's probably no secret that Alabama (and many of the southern US states) is where the the country's remaining manufacturing sector has primarily relocated to, due to its low wage base. Franklin's stories (while not time-specific) are primarily based in present day Alabama, with the rural Alabamian working class as his character base, and the underlying despair attendant to this sector of the country is poignant, no matter what part of the country you live.Franklin's gritty realism is not for everyone. Those with a weak stomach probably should avoid this (or \"Hell at the Breech\" for that matter). For the most part, Franklin's uber-realism rarely feels gratuitous or over-the-top; it feels like a necessary ingredient in concocting the perfectly-told tale. (However, one story, the name of which eludes me, something like \"The Ballad of Duane something or other\" really made me nauseous, and kept me from from giving this otherwise excellent collection a five star rating). I highly look forward to reading his most recent novel \"Crooked Letter, Crooked Letter\"."}, {"userName": "Ben Loory", "userReviewDate": "Nov 12, 2009", "userURL": "http://www.goodreads.com/user/show/171197-ben-loory", "userReview": "well-written, dark and surprising stories about a group of people i've never encountered in literature before (although they are at times somewhat reminiscent of (and much realer than) the cannibals in cormac mccarthy's The Road). bunch of uneducated guys in the woods shooting and skinning and eating things and often killing people by accident or on purpose. lots of bones and dogs and mud and liquor; very few women and nothing approaching a love story. this is some dark stuff, though never cartoonish or gothic. the prose itself is what i would call propulsive, hurtling along and through the story, pushing the unimportant stuff aside and always headed straight to the end of the story which is also of course the heart of the matter. and yet at the same time every sentence is finely crafted and beautiful. my favorite parts were the story \"the ballad of duane juarez\" and the last bit, a novella called \"poachers.\" thanks, brian."}, {"userName": "Mel", "userReviewDate": "Mar 05, 2013", "userURL": "http://www.goodreads.com/user/show/2030264-mel", "userReview": "This contained several short stories by the author Tom Franklin. I enjoyed almost all of them. The ones I especially liked were Grit, Shubuta, Dinosaurs, and the story the book got its name after Poachers. All of them were dark, violent and alcohol fueled. Some of them were hard to read but the way they were written just kept me riveted. I especially liked Poachers. It was the longest story and the best. Not all of the stories are winners; some of them I did not care for but this book still rated high and made my best reads list. I think it was because of the over all feeling of this book. It was dark and sweaty and pissed off and drunk and very violent and going for your jugular yet it was beautifully written all at the same time. It made my skin crawl in parts and made me wish I was there taking it all in even if it would scare the hell out of me in other parts. Hell, I felt like I was there in parts of this book the descriptions are so vivid and well written. I could not look away. Great book of short stories with a dark edge to them."}, {"userName": "Trixie Fontaine", "userReviewDate": "May 23, 2010", "userURL": "http://www.goodreads.com/user/show/1073521-trixie-fontaine", "userReview": "I know I'm generous to a fault with four and five star ratings, but these stories are sheer perfection and worth TEN stars as far as I'm concerned. Bundled together in this book make it one of my favorite fictions read in the past few years and move all of Tom Franklin's books near the top of my must-read list (but not all at once, because I'll have to stretch them out and savor them).I sometimes struggle with shorts -- getting into each one then moving on to the next one -- but these were easy to immerse myself in and flowed into each other perfectly. Beautifully crafted, thoroughly entertaining, humanizing and fantastic. Not as unbearably dark as some of the little quotey reviews made me worry it might be. I loved this as a before-bed book."}, {"userName": "Andrew", "userReviewDate": "Jul 21, 2013", "userURL": "http://www.goodreads.com/user/show/363179-andrew", "userReview": "I loved the voice in these pieces and the backdrop of Southern Alabama. The novelette that the book takes its name from sticks in my mind, but lacked the edge that the other stories held. Franklin has a gift for presenting male characters on the edge and the choices they make from the position. The first story in the book that takes place in the sandblasting plant had characters who were loud on the page and whose choices gave hope without subtracting from who they were when we met them."}, {"userName": "Manray9", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/7288965-manray9", "userReview": "Stereotypical Southern redneck characters with a hefty dose of misogyny. The praise is overblown."}, {"userName": "wally", "userReviewDate": "Oct 30, 2011", "userURL": "http://www.goodreads.com/user/show/4268560-wally", "userReview": "yeah so i'm looking at scar lover by harry crews, a story i've read and i see off to the side that people also liked this, those who have read scar lover from crews. so here i am.on the kindle.stories.\"introduction hunting years\" all lower case...so sue me. make me do time. heh! 1st person this, alabama, late december, eye-narrator standing on a trestle...he'd heard a panther scream whilst standing on the trestle w/his bro.....yeah...only i was on the montreal meadows or getting there and i heard a couple bobcats going at it....spring of the year....this looks like a good choice...i believe i'll enjoy these stories....onward and upward...so little time....this introduction is real...\"not a story\" i guess as he is writing about going to graduate school in fayetteville...when he was 30...franklin's south is lower alabama....i dunno what to make of it yet....he is apologizing for being a hunter, saying that to hide the fact that he did not want to kill anything he showed the most enthusiasm as a youth. at any rate, i don't believe his story to be like that jackass who wrote \"deer hunting with jesus.\"well...no he would not be like that man, as franklin here is tellilng about going to church, praying as a family each night, holding hands. (you have to realize that harry crews is a bit rough around the edges...check out a photo if my words don't mean a thing)Heh...he writes about buying a knife...his old man's whispered advice and ma staring off...heh he! this is just an intro but funny.there's two deer hunting stories here...his 1st deer and another...the things we do. and then he is meeting another hunter who has seen him on the trestle....and this other wearing orange when the locals scorn orange tells him to get....this is private property....and this asshole raises his rifle at him...aims it at him....and they get in a pissing match....says that coming back to look for details for a story he is writing feels like poaching....but he's never lost the need to tell....poach for stories.... 1st story: \"grit\" lower case again.... at the 9% mark on the kindle.so 9-23% is this story \"grit\" about a plant north of mobile, alabama and glen the manager there but not for long as he owes roy money...roy more or less has glen okay a second-shift, a night-shift making sandblasting grit off the books...the two owners up in detroit won't know and so forth.some shock-value one-liners from all concerned, glen, roy, \"snakebite\" a truck driver who hauls the illicit grit and a girl w/a funky name...jaw-lie-lah or something close...who else? bout them....mostly. roy gets killed and dumped in the plant machinery....poof...no more....which raises all manner of morality questions, no? anyway...a different kind of poacher...all concerned here.story moves fast...maybe the one complaint is the detroit owners are somewhat of a caricature...we have two hookers meeting them at the airport on their way down to inspect the plant and we're told more or less what happens there, rather than being shown what happens.....but all in all...a good story.2nd story: \"shubuta\" again, lower case....sue me runningshubuta is a town popuation something like 614 in mississippi. this is 1st person eye-narrator...who knows willie how a black watermelon farmer...other people...uncle dock and his younger sister (who died) nannie-rae...coon dogs....and where willie tells him 'son, you pitiful! don't ever eat no meat a woman give you. they carry it in they panties and administrate on it before they cook it, and you eat it you theirs for life...' heh! i love the local color no pun intended. 3rd story: triathlon....bout bruce and i...another eye-narrator and this one is somewhat unique in that it has....unless i am mistaken....future tense...as in....someone will be doing this that the other....kinda neato i think as i just read skippy dies by paul murray that had a variation of narrative in that, present tense and 2nd-peron. i don't believe, not that i recall anyway, that i've ever read anything with future tense....unless it be about ole gunga din...\"he'll be squatin on the coals givin drinks to poor damn souls, i'll catch a swig in hell from gunga din!' this story is nice the way the familiarity of the characters is evident in their language, the spare use of dialogue--they know what they're talking about and the story isn't weighed down w/a bunch of extraneous baggage. too...there's some stuff you ponder...4th story: blue horsesearl rose early and made coffee....there's an evelyn's car...there's a mace would be sleeping in the cab, drunk...there's a jimmyboy who won't be going w/them...a pistol...mike who lives way out in the woods...they always have dogs...always...the truck heater don't work...perhaps the core...5th story: the ballad of duane juarezned uses dynamite to fish with....me too, or i used to, dupont spinners...they work well. another 1st person eye-narrator piece, ned the rich brother....duane, the narrator...divorce, life...ned looking out for duane, allowing him to rent a house he owns, has him look after the place, kill the stray cats while ned is gone w/nina his wife6th story, a tiny history....paul and prissy again...i think they figured in an earlier story...and there's another couple...the one isn't getting any, seeks advice....they play cards, drink, so on.7th story...dinosaurs...this one is about steadman is some sort of inspector for the big bad gubbment although that doesn't seem to bother him. he inspects, looks for violations and so forth and in the end he takes a stuffed mounted rhinoceros in lieu of putting a man out of business. progress.8th story....instinct...henry is driving home from the treatment plant when he sees this old tub for sale...gets it set up and so on...meets some gal out thumbing or something....a crack addict...he tries to reform her or something, throws her makeshift pipe out the window and later goes back for it....9th story...alaska...this is a \"we'd\" story....we'd do this...we'd do that...north to alaska...short happy piece about heading to alaska...and what \"we'd\" do to get there...10th story...poachers...this story won an award or so...good piece...country...three boys, their old man living off the land, teaching them how to live off the land though that phrase \"living off the land\" is never used...cause well for some it is a way of life, but not the game wardens of the world...more gubbment officials who of course do what the law pays and tells to do...kill the boys, blind the last one....progress.stories like this make me want to spit. great story though...ten-stars..."}, {"userName": "Lucynell ", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/10837926-lucynell", "userReview": "Nine short stories and a novella in this award-winning head-turning collection of Southern darkness. It's appropriately menacing and violent with many memorable scenes and characters. This is the thing with much of the better Southern stories -the harder the characters are, the rougher, the more their fundamental humanity struggles to keep afloat, or shine in tiny flashes, the more we care. It's like you can't look away and very often here you will wish you could look away. The highlights though, for me, are Shubuta, offbeat and fragmented, and Alaska, tender and drunken. Great stuff."}, {"userName": "Michelle Lancaster", "userReviewDate": "Mar 29, 2013", "userURL": "http://www.goodreads.com/user/show/18869661-michelle-lancaster", "userReview": "StoriesBy Tom FranklinHarper Collins, 192 pgs0-688-17771-9Rating: Read This Book!Poachers is a collection of 11 short stories. I have gone back to my roots with this one. I \"discovered\" American regional short fiction 20 years ago and my favorite region is the south. It's all so very Gothic. Spanish moss and kudzu, Appalachia and Gulf coast, alligator and Thoroughbred, Pentecostal and voodoo priestess, plantation and slave quarter. One gets the idea that the primeval is alive and lurking in Mississippi. The juxtapositions of the South are mind-boggling and Tom Franklin captures them superbly. Mr. Franklin is a talent on the same plane with the late Larry Brown, and both are heirs to Faulkner.These are my favorite stories:The Ballad of Duane Juarez is about the dissolution of an older brother who has to rely on (or mooch off of) his younger brother's life. These are some of the things Duane accepts and/or takes from his brother Ned: food, drink, rent, Playboy, girls, jobs, electricity. According to Duane he married for love and Ned married for money. Duane's wife divorced him and so the love went away and their was still no money. Ned is still married and still has money so he tries to \"help\" his big brother Duane. I get the idea Ned sort of likes this arrangement. He doesn't seem to be intentionally belittling, but his off-hand remarks could be seen as casually cruel, as he tosses crumbs to Duane in the form of day-labor assignments. Some of the things that Ned has Duane do for him include: mowing grass, raking leaves, washing his car, cleaning houses, killing cats. Yep, killing cats. Ned's wife Nina feeds a bunch of stray cats and they won't go away. Ned hates the cats and pays Duane to capture them, take them off and shoot them. We find out how Duane feels about the people in his life when he takes the cats off to be summarily executed and starts naming them. This story is not a story with a plot, but is a character study. We get to peer around inside Duane's head, and he needs a good therapist.Poachers is the story of the 3 Gates brothers living in the backwoods of Alabama, who make their living as poachers. There's apparently nothing they won't kill and sell. This includes: fish, deer, dogs, rabbits, possums, turtle, fox. The brothers sell and barter (sometimes for moonshine, white lightnin, bad idea) the fruits of their hunt to regular customers in a netherworld that you have to see to believe, some of these places are so isolated they are accessible only by river; no electricity, no phone, no plumbing. The boys have been on their own since their father shot himself when the youngest brother was 12. He was despairing his wife's death in childbirth and the stillborn baby. So he buried them in the backyard. There is no law here.The boys live in a ragged cabin deep in the woods; have never gone to school; can't read or write; don't bathe; eat with their hands; have no social skills; never go to town. What they understand is the instinctual. This is Deliverance, second generation. This is the sort of thing that makes the hair on my neck stand at attention. You know what creeps me out? These people have to introduce new blood every so often and so what woman do they kidnap for their nefarious purposes? Eew.OK, anyway, the Gateses seem to be successfully skirting the edge of the cliff until the day they murder a game warden who caught them with a telephone rig in the bottom of their boat and tried to arrest them. Then they fell off the cliff. A few days later the body of the game warden is found. The sheriff calls the state wildlife commission to report the death and talks to a legendary warden by the name of Frank David, who is ascribed supernatural powers, happens to have been the dead warden's teacher and mentor. When the Gates brothers start showing up dead one by one, the sheriff knows Warden David's handiwork but cannot build a case, prove anything or even find him. An old shopkeeper named Kirxy had known their father and has spent years trying to help the brothers. He tried to house them, feed them, send them to school, to no avail. He had to finally return them to their cabin because his wife was as freaked out as I am, see? So when Kent, the oldest brother, and Neil, the middle brother, are murdered Kirxy tries to protect Dan, the youngest. We are given a few hints in the story that it may yet be possible to save Dan. Maybe.So please read this book. It will not appeal to everyone but I'd like to encourage you to venture out of your comfort zone. I love the short story form but I didn't know that until I ventured."}, {"userName": "Craigtator", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/7366771-craigtator", "userReview": "A good example of Hillbilly Gothic. Strong stories of rural life in Alabama. Certainly doesn't have the energy and nihilism of Pollock, but still a good picture of a culture of which I can barely conceive."}, {"userName": "Ned", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/21232850-ned", "userReview": "I enjoyed Franklin's first book of stories, but may have had too high expectations due to the accolades on the cover from Roth, Ford and Hannah. I sensed some stories were Franklin trying to find his voice, and succeeding by the time I reached the Poachers novella. He holds back and builds drama by slowly revealing character facts and motivations. Suspecting also that my heightened expectations hindered my reading, feeling like an obese rich man at the table not appreciating his wealth and seeking perfection. Not a place I normally want to be, but having read much of the \"masters\" in country noir it was hard to avoid. Particularly I enjoyed his forward about losing his family \"place\" and dealing with touristy hunters who have no appreciation of history and nature. But Franklin is a true workingman's writer, self-taught to some extent like Larry Brown, and giving voice to what he knows. More character development is something I'll expect from his other novels, and I will read them. Picked up \"Crooked Letter, Crooked Letter\" when in Boston, having read \"Poachers\" on vacation in Cape Cod, a world apart from the characters in the deep south he writes so beautifully about. I found Franklin's interweaving of characters between stories akin to Carver, who tells his tales by actions and what people do, not what they think (hence the character development challenge). There's much to like here, especially if you are new to the genre and care to get into the world of the poor, the proud, and the southern mindset without the tired cliques. P.S. the story about the environmental inspector who redeems himself by infracting the law to give respite to two failing old men (father figures, one literal) was a tidy little piece that shows his breadth in storytelling, not just formulaic country (sic) noir. [i must stop using that oversimplification]"}], "description": "It's as if Raymond Carver were still alive and living in the Deep South. Or, imagine a world created by Jim Harrison and Cormac McCarthy and plunk it down in the woods of southern Alabama, where emotions run as raw as moonshine.Tom Franklin's eloquent deceptively simple prose evokes a world of hunting and fishing, shotgun shacks and trailer parks, poachers, and lawmen, factory workers, poor white trash, and bucket-o-'blood boozers. His stories are laced with naked violence, hot food, and the ever bitter sweat and tears of human relationships.", "title": "Poachers: Stories", "url": "http://www.goodreads.com/book/show/1770402.Poachers", "average": 3.98, "cover": "https://images.gr-assets.com/books/1387655785l/1770402.jpg", "reviews": 152, "authors": [{"url": "https://www.goodreads.com/author/show/125736.Tom_Franklin", "name": "Tom Franklin"}], "type": ["Short Stories", "Fiction", "American", "Gothic", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/1770402.Poachers", "http://www.goodreads.com/book/show/27871548-alabama-blues", "http://www.goodreads.com/book/show/367625.Poachers", "http://www.goodreads.com/book/show/10334397-poachers", "http://www.goodreads.com/book/show/6906079-poachers", "http://www.goodreads.com/book/show/8222287-poachers", "http://www.goodreads.com/book/show/7948230-crooked-letter-crooked-letter", "http://www.goodreads.com/book/show/17349083-the-tilted-world", "http://www.goodreads.com/book/show/214340.Hell_at_the_Breech", "http://www.goodreads.com/book/show/385530.Smonk", "http://www.goodreads.com/book/show/27131485-mississippi-noir"]}