{"ratings": 100, "userreviews": [{"userName": "Eric", "userReviewDate": "Nov 14, 2010", "userURL": "http://www.goodreads.com/user/show/26852-eric", "userReview": "Barbarian that I am, my knowledge of the central Latin poetry, excepting Ovid’s exilic Epistulae, and what bits of the Metamorphoses an English major meets in footnotes to the Fairie Queene, has never amounted to more than names on a timeline. Poets in a Landscape is the introduction I needed. It’s graceful, engaging, conversational; dense with learning, but fluent and fleet. Scottish classicist Gilbert Highet was one of the great teacher-critics on the Columbia faculty, alongside Lionel Trilling, Jacques Barzun, and Mark Van Doren. Brilliant scholars and critics, travelers “to the most exalted, and often the most problematical, stations of art and ideas and manners” (Cynthia Ozick, once a student of Trilling’s), they were also energetic and unforgettable classroom presences. Highet’s written style has a personal, pedagogic presence. Someone—I forget who, perhaps a Roman poet whose quips have passed into commonplaces—defined good writing as “cultured talk.” Poets in a Landscape meets that standard. Highet works on a few levels simultaneously. First, biographical criticism—with each poet Highet, said Cyril Connolly, another devotee of sensuously contemplative Latinity, “succeeds in finding the man in the style.” Next, Highet invokes the consequent canon. He shows Goethe and Byron, Browning and Baudelaire, Eliot and Pound as they summon, echo and emulate the poets of the early empire. And as its title suggests, the book is also travelogue. In 1956 Highet and his wife, the spy thriller writer Helen MacInnes, made a tour of the conjectural birth-villages, spurious tombs and excavated villas of the poets under discussion. (The couple's fine snapshots illustrate the book.) I like Highet’s archeological capriccio: churches built upon pagan temples; villas annexed to monasteries; crypts and ossuaries planted in the once-genial baths. Our learned cicerone surveys the layered landscape, comments on the additions and alterations of so many centuries: As we pick our way along the cobbled streets, it becomes more and more evident that this is a medieval town. It is not the Roman town at all. Juvenal’s home was a flourishing township with twenty thousand inhabitants, lying on a plain near the river Melfe. This is a cowering village of two thousand people at most, crusted along rocky slopes, comfortless and sad. Juvenal’s Aquinium was destroyed in the Dark Ages by German invaders—the tough Lombards who pushed down the Italian peninsula from the Alps, dominated some of the country for a time, and gave their name to the northern province of Lombardy. The survivors of the catastrophe built a new Aquinum some miles to the east, near a castle where they could take refuge in any later invasion; and this is now Aquino. Again and again in Italy, we see how the peaceful prosperity of the Roman empire was followed by the dangers and disasters of the Dark and Middle Ages. In a peaceful valley, among fertile fields, lie the ruins of a Roman town, often traceable only by the faint lines of its market-place or a few pillars built into a farmhouse. High above it, on the peak of a hill, wedged into the topmost crags and slipping nervously down the gentler slopes, like a cat that has run up a tree and clings there spitting at the savage dogs, is its medieval successor. The snarling face of the cat is usually a castle, on the loftiest peak of all. Rome fought many wars, but during the five centuries when she had no foreign enemies to threaten her heartland, the towns and cities of Rome grew and prospered in the rich Italian plains, unfortified and happy and secure.Like many Americans, I think of Italian hill towns as adorable specimens of a romantic impracticality. It’s therefore chastening to learn they are medieval legacies of precipitous and paranoid resettlement, of scrambling for the hills ahead of an invader. Highet also mentions that during the Early Middle Ages, with Roman engineering lost, Italian peasants believed the ruins to be the magical handiwork of visitant devils. Outside of the literate covens of monks, the memories of the Roman poets, too, underwent fanciful mutations, persisted in strange tales. In the folklore of the lands around Naples, Vergil figured as a benevolent sorcerer, able to relight cold hearths with flame summoned from his mistress’s vagina; and Ovid, in the legends of his native Abruzzi, became an avaricious wizard who lived underground, guarding his barrels of silver and gold. So, Highet has definitely piqued my curiosity. Juvenal, the street-level satirist venerated by Flaubert, cannot but head the list. Catullus and Propertius, laureates of erotic suffering, their short lives and shorter careers marked by subjection to cruel mistresses, sound interesting as well. Tibullus is memorable for this contrast: a stoical soldier whose poetry wallows in masochism Highet finds excessive even when measured against the obsessions of Catullus and Propertius. Horace’s Odes, like Pushkin’s verses, sound untranslatable, their perfection a matter of nuanced rhythmic effects and subtly inspired diction; translated, both poets are platitudinous. I would be uninterested in Vergil, but for the fact that his song of the dutiful abstentions and public destiny of Aeneas, and of the rustic Romans who embraced him, seems to offer a perfect foil to Ovid, ever-charming in his role as the “most sensual and sophisticated of the Roman poets.” Vergil’s focus on the imperially-approved legendary prehistory is countered (and, on same pages of the Metamorphoses, burlesqued) by Ovid’s absorption in the urbane, luxurious manners of contemporary Rome—its indoor adventures, droll feats, boudoirs and billet-doux—its promiscuous, even voracious, upper-class women, so recently the veiled matrons of a rustic republic (Highet finds in many of the poets registers of that change). Ovid was a suave rhetorician, full of lush wit and mercurial effrontery. He’s the quintessential ladies’ man, l’homme à femmes, displaying a subtle kind of virility, and quite at home in the more intricate, feminine reaches of psychology. I want to read the Amores, comic monologues in which sophistical avowals of fidelity alternate with adulterous asides; and the Heroides, verse letters voiced by Greek heroines pining for departed lovers, entreating future ones, and brooding upon mythological trysts. The day I finished Poets in a Landscape I chanced upon a selection from the Zibaldone di pensieri—the “hodge-podge” or waste-books—of the nineteenth century Italian poet Giacomo Leopardi. An entry of September, 1820, nicely captures Ovid’s aloof and sportive charm:Homer, Virgil, and Dante...pour forth incredibly vivid imagery and description yet never seem to notice that’s what they’re doing; they make a show of having a much higher purpose, which in fact is the only one that truly matters to them, the one they are actually always pursuing, namely the narrating of actions, their unfolding and final outcome. Ovid does the opposite: he doesn’t dissemble, doesn’t hide anything, he demonstrates and more or less confesses what is in fact the case—he has no higher or more serious aim, really no aim at all other than to describe, to arouse and frame images, little pictures, to figure things forth, to represent, unstintingly."}, {"userName": "Jonfaith", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "Just about a lifetime ago I was sitting in a plaza in Rome just across from the Pantheon. I was reading Gunter Grass and the sky was perfect. My luggage made it almost two days after my arrival. I was content. A large bald man with a fain aura of menace sat on the marble steps next to me. He made a comment in a brogue-ish way that it was a lovely day. I concurred with a bit of flourish, saying something ridiculous like its beauty was timeless. I don't think he offered his name but said he was from Ireland. I find it easier to tell people I am from Louisville, Kentucky. Ah, the Kentucky Derby. He pulled out a fifth of vodka. It was 10 a.m. Such lovely horses --he then took a lengthy swallow, though not as long as those last three words he shared with me, they contained centuries of verse. This is a beautiful book, containing biographical sketches of the greatest pagan poets of Rome. The title indicates the prominence of landscape to this analysis and that is a triumph as well. The ancient soil appears to vibrate, to offer a human humility to the verse which has survived and the trappings of a physical Rome which haven't."}, {"userName": "Justin Evans", "userReviewDate": "May 13, 2014", "userURL": "http://www.goodreads.com/user/show/2184529-justin-evans", "userReview": "A very pleasant read, with much unintended comedy. First the good: Highet writes well, and gives you just enough information so that you want to read more of, or just read, the poets he discusses here: Catullus, Virgil, Propertius, Horace, Tibullus, Ovid, and Juvenal. He also makes me want to go back to Rome. His biographies of the poets are charming, in the patrician, pre-criticism manner; his discussions of the poetry are intriguing, particularly when he focuses closely (as in the Horace chapter); and even the landscape writing, which generally bores me silly, had just enough people in it for me to care. He even has the occasional, pithy, perfect phrase, as when he suggests that reading Tibullus is like \"watching Thomas Gray trying to write Baudelaire's 'Flowers of Evil.'\" As that phrase suggests, Highet's learning is *broad*, and he puts it to good use. The unintended comedy just comes from reading a book written as popularization of Latin poetry in the 'fifties. There is much demonization of Caesar and praise of the noble, upright, virtuous republicans who preceded him. There is very little reference to the disasters and crises that led to Caesar getting his imperial diadem, nor to the fact that the Republic looked nothing like, e.g., the America from which Highest was writing. There were slaves, there were very few citizens etc etc... For want of a better term, I think of this as his liberal conservatism, which also creeps into the sections on the poets: Ovid is a dirty-minded little bugger, nobody should use nasty words in their poems and so on. How, exactly, Highest managed to write a book on Juvenal is beyond me. The typical biases of a classicist are on display, too: you'd be forgiven for thinking that between the death of Juvenal and the birth of Shakespeare nothing important happened, moreover, that nothing *good* happened. That was the Dark Ages, you see. Thank goodness the Renaissance was born from the head of [insert your hero here], with no input from the centuries preceding it. And then, what had initially looked like bad scholarship (which it is) eventually came to seem like something else: cold war rhetoric. I doubt Highet intended it, or that he was even conscious of it, but reading this book today, it's fairly obvious: the Roman Republic is the good American Republic; the Roman Empire is the USSR. If you can extricate the good from the school-marmish silliness, the tiresome acceptance of Renaissance pieties, and the self-righteous Republicanism, this is very enjoyable. But I do worry that people will read this book, and believe what he's saying, rather than reading it for enjoyment, with a skeptical eye."}, {"userName": "Scott", "userReviewDate": "May 04, 2008", "userURL": "http://www.goodreads.com/user/show/1134884-scott", "userReview": "In the summer of 1956, Highet and his wife toured Italy, visiting the relics of several classical Latin poets. This book reports what he found. Highet was a serious scholar, but in Poets in a Landscape he wears his learning lightly and sprinkles his account with plenty of interesting tidbits: Catullus popularized the word basium, the ancestor of the French, Italian & Spanish words for 'kiss'; Vergil was born in a ditch; Propertius hailed from Assisi, like St. Francis; Vergil is buried next to the Italian poet Leopardi, in Naples (maybe); Tibullus came from just north of Rome -- he liked to stay home and surround himself with bad women; Juvenal was exiled to Aswan, Egypt, but he eventually made it back to Rome. Finally, the word grotesque comes from the word grotto, a 'picturesque man-made cave'; but the notion that a grotto should be decorated with fantastic sculptures of humans and animals comes from the discovery of Nero's Golden Palace, in Rome. The emperor had a great palace built for himself and had it lavishly decorated with bizarre statuary and mosaics, fitting his debauched and bizarre taste. When he was assassinated, his palace fell into disrepair, was forgotten, and then was buried under centuries of vegetation and garbage. During the Renaissance, workmen dug through the now 1,500 years of growth and decay (several meters of dirt & detritus) to discover what seemed to them to be a buried palace filled with ghastly images. Because it was underground, they figured their find was some sort of grotto. Since that time, anything looking bizarre or overdone has been described as grotesque, 'fitting the underground palace of a crazed Roman emperor'."}, {"userName": "Julia", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/6425323-julia", "userReview": "this book is adorable and i should give it to chenier, maybe. it is adorable because it is, basically, of historical interest more than anything else, a relic of the 50s (although this adorability-via-historical-interest dimension actually is also responsible for its most non-adorable part, i.e. gilbert highet's inability to write about women without being a raging misogynist, to the point that i think it negatively affected the way he assessed some of the poets). the travel writing is adorable. highet's weirdness about ovid is another non-adorable part, highet doesn't really like ovid/completely underrates him and it's upsetting. also upsetting is the complete lack of latin in this book, which, i get it, it's written for a broad audience of laymen with no latin knowledge, that's the point, but it made me sad because if there's latin afoot i want to see it and translate it myself (i should really not abandon latin every summer). still, that does not excuse calling ovid's metamorphoses \"the transformations.\" eugh. gross. blasphemous. also, although i've noticed this before, reading so many different latin poets at once really emphasized to me how, like, social roman poetry is. it's directed to other people, so often, as if excerpted from conversation (note also horace's letters-in-verse), and is so at odds with how people conceive of poetry now: so tied up with one's own mind, so solitary. it would be cool to study poetry that's been influenced by the roman mode, or to trace how the roman conception of poetry died out."}, {"userName": "Abigail", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/9949575-abigail", "userReview": "This book was a life-changer for me. I read it one summer when I was in high school and it transformed me from someone taking Latin because I had to do so to someone who cared about Latin poetry and wanted to be able to read it in the original. I ended up a classics major in university and I have been reading Latin ever since. I have not reread it in a long time because I'm afraid that at a different stage in my life it won't seem the same as in did all those years ago. The charm of this book is the way the author uses landscape (in this case the Italy of the mid-1950s) to evoke the writings and characteristics of Latin poets who lived centuries before. He makes Ovid, Catullus, and others come alive through the places that they loved."}, {"userName": "Chris Schaeffer", "userReviewDate": "Jan 05, 2011", "userURL": "http://www.goodreads.com/user/show/2448084-chris-schaeffer", "userReview": "A beautiful, rambling, tweedy discourse on the great Roman poets. The kind of gently expository scholarship that could never be written nowadays. Don't get me wrong, I love French Theory and its attendant ambiguities and interstices, but don't you sometimes miss having books like this, where a guy who knows everything about something slowly and winningly teaches you why he loves it so much?This was a graduation gift from my girlfriend, and whenever I look through it I miss that atmosphere of intellectual excitement. Ahhh. Basically a perfect book. I can't imagine it being improved without losing something of its eccentric halo."}, {"userName": "Spenceface Klavan", "userReviewDate": "Jun 07, 2014", "userURL": "http://www.goodreads.com/user/show/9606411-spenceface-klavan", "userReview": "I get the sense that the favorite pastime of critics who analyze the Roman lyric poets is to dig up juicy, damning details about their personal lives. A lot of writing on these guys reads like a character assassination -- Catullus paraded his affair with a married woman; Ovid lead an emperor's daughter down a shadowy garden path whose details are too filthy to have survived the record of history. This is almost too easy. For one thing, poets are people: broken, vulnerable, frail bundles of misshapen desire. Of course their lives are messy. For another thing, the whole challenge of their agonizing work is to open their veins onto the page with brutal honesty. Their job is to be vulnerable, so when they manage through an immense effort to show the truth of their weakness to us it feels indecent to spend too much time gossiping over their tortured love stories with some kind of literary schadenfreude.What is so remarkable about this book is that Gilbert Highet avoids that pitfall entirely, and yet still manages to make his analysis of each poet engaging, vivid, and yes, even scandalous. With unflagging detail but generous empathy, he works the surviving evidence into plausible and compellingly human life stories for seven of the greatest Roman lyric poets. He tells us all about Tibullus' feverish addiction to Rome and to sex, but he does so with the sensitivity of a concerned friend. Highet's prose sometimes veers into the purple; he has that tendency to self-satisfaction that defines the voice of an old UK schoolmaster. But he offers so much in this book that it's well worth a few overdone phrases. He places his careful scholarship in the innovative context of a meditation on the meaning of place, and his loving descriptions of the Italian countryside can bring to life hidden flavor even when the poems themselves get pretty darn dry. On top of it all, he's a staggeringly good translator. The book requires no Latin. It's not to be missed."}, {"userName": "Justin Howe", "userReviewDate": "Aug 19, 2013", "userURL": "http://www.goodreads.com/user/show/173167-justin-howe", "userReview": "A series of biographies of Roman poets mixed with an Italian travel guide circa 1957. Highet’s a classicist of the urbane and highly educated type, but he has a passionate love of his subject, an inviting style, and the ability to share his enthusiasm with his readers. Plus, he gives the occasional “fuck yeah, books!” battle cry that I love: “These are not books, lumps of lifeless paper, but minds alive on the shelves. From each of them goes out its own voice, as inaudible as the streams of sound conveyed by electric waves beyond the range of our hearing; and just as the touch of button on our stereo will fill the room with music, so by opening one of these volumes, one can call into range a voice far distant in time and space, and hear it speaking, mind to mind, heart to heart.”"}, {"userName": "Dan", "userReviewDate": "Jul 17, 2010", "userURL": "http://www.goodreads.com/user/show/1495783-dan", "userReview": "A wonderful book to read when traveling, especially in Italy but really appropriate for anyone interested in history and poetry. Eight short chapters about eight Roman poets, the author describes their home towns, their lives in Rome and in the country, the atmosphere in Rome during the height of the empire, and also presents highlights from their poetry. It was very cool to hear men who lived two thousand years ago talk about cheating girlfriends, love, complain of traffic and noise in the city, and other surprisingly contemporary subjects. I also enjoyed the author's style of writing, it was clear and helped the reader understand the poetry."}, {"userName": "Lauren Albert", "userReviewDate": "Sep 25, 2012", "userURL": "http://www.goodreads.com/user/show/2828794-lauren-albert", "userReview": "The title describes the book pretty accurately. Highet places the individual classical poets into their landscape. Now, I'm not very good at visualizing things I haven't seen so the long descriptive passages didn't do much for me. But I learned a lot about the classical poets he discusses--of whom I knew, sadly, little. Here are the poets he discusses: Catullus, Vergil, Propertius, Horace, Tibullus, Ovid, and Juvenal."}, {"userName": "Alanseinfeld", "userReviewDate": "Apr 15, 2016", "userURL": "http://www.goodreads.com/user/show/7416996-alanseinfeld", "userReview": "Great book, superbly written and very enjoyable. Highet's passion for his subject is infectious and makes for an illuminating introduction to these great Roman poets and the world they lived in. Catullus, Horace, Ovid etc were just names, but, Highet has shed a new light upon them and has made me want to discover more of their works. It's part history and poetry lesson, mixed with what he did on his holidays! excellent. Highly recommend."}, {"userName": "Shirley Plummer", "userReviewDate": "Jul 06, 2009", "userURL": "http://www.goodreads.com/user/show/2398196-shirley-plummer", "userReview": "This is my book so I am neither rushing to return it to the library nor, since I am only marginally interested in Latin poets, do I feel compelled to make a steady attack on it.Dipping into it here and there I am not attracted by the decadence. However, Gilbert Highet writes so well that it is a pleasure to read; his prose landscapes are a near approach to poetry themselves."}, {"userName": "Gilbert Wesley Purdy", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/44747084-gilbert-wesley-purdy", "userReview": "I can't imagine a better introduction to the lives and works of Catullus, Virgil, Tibullus, Horace, Ovid and Juvenal. Includes solid English translations interspersed throughout the text and many b&w photos."}, {"userName": "Androcles", "userReviewDate": "Aug 27, 2011", "userURL": "http://www.goodreads.com/user/show/5858533-androcles", "userReview": "This is a small gem of a book. One to keep by the bediside table and dip into now and again for apleasant injection of erudition on the Roman poets and their background, literary context and influence on latter-day literature and poetry."}, {"userName": "Douglas Dalrymple", "userReviewDate": "Jul 15, 2015", "userURL": "http://www.goodreads.com/user/show/1013182-douglas-dalrymple", "userReview": "Highet’s book is a charming and very readable introduction to the Latin poets of (roughly) the Augustan era – notably, Catullus, Virgil, Tibullus, Horace, Ovid and Juvenal. When my kids are a bit older (high school age would be about right) I plan to make them read this one."}, {"userName": "carelessdestiny", "userReviewDate": "Mar 08, 2012", "userURL": "http://www.goodreads.com/user/show/7092842-carelessdestiny", "userReview": "I thought it was nicely written in prose that seems classical and clear. I haven't read much of the Latin poets, but this made me want to explore them."}, {"userName": "Frederick Gault", "userReviewDate": "Apr 12, 2016", "userURL": "http://www.goodreads.com/user/show/11803119-frederick-gault", "userReview": "Discussion of the poets of Augustan Rome, a nice overview."}, {"userName": "Luther Obrock", "userReviewDate": "Jun 18, 2013", "userURL": "http://www.goodreads.com/user/show/78869-luther-obrock", "userReview": "I want to reread Horace now"}, {"userName": "Amanda Patchin", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/2565560-amanda-patchin", "userReview": "Where it is good (appreciative criticism of the Latin greats, informed observation of the Italian countryside and the city of Rome) it is very good. Where it is bad (a classicist's rejection of the glories of the middle ages, primness about naughty words) it is not very bad. Worthwhile reading for teachers of the Latin poets (there are dozens of us!) to stimulate the appreciative gene."}], "description": "Gilbert Highet was a legendary teacher at Columbia University, admired both for his scholarship and his charisma as a lecturer. Poets in a Landscape is his delightful exploration of Latin literature and the Italian landscape. As Highet writes in his introduction, “I have endeavored to recall some of the greatest Roman poets by describing the places were they lived, recreating their characters and evoking the essence of their work.” The poets are Catullus, Vergil, Propertius, Horace, Tibullus, Ovid, and Juvenal. Highet brings them life, setting them in their historical context and locating them in the physical world, while also offering crisp modern translations of the poets’ finest work. The result is an entirely sui generis amalgam of travel writing, biography, criticism, and pure poetry—altogether an unexcelled introduction to the world of the classics.", "title": "Poets in a Landscape", "url": "https://www.goodreads.com/book/show/1504664.Poets_in_a_Landscape", "average": 4.2, "cover": "https://images.gr-assets.com/books/1184383395l/1504664.jpg", "reviews": 20, "authors": [{"url": "https://www.goodreads.com/author/show/103394.Gilbert_Highet", "name": "Gilbert Highet"}], "type": ["Poetry", "History", "Criticism", "Nonfiction", "Writing"], "outlinks": ["http://www.goodreads.com/book/show/1504664.Poets_in_a_Landscape", "http://www.goodreads.com/book/show/6748612-poets-in-a-landscape", "http://www.goodreads.com/book/show/3681201-poets-in-a-landscape", "http://www.goodreads.com/book/show/21366379-poets-in-a-landscape", "http://www.goodreads.com/book/show/6596694-poets-in-a-landscape", "http://www.goodreads.com/book/show/177568.The_Art_of_Teaching", "http://www.goodreads.com/book/show/1731808.The_Classical_Tradition", "http://www.goodreads.com/book/show/615884.Man_s_Unconquerable_Mind", "http://www.goodreads.com/book/show/19081632", "http://www.goodreads.com/book/show/2250466.Anatomy_of_Satire"]}