{"ratings": 6365, "userreviews": [{"userName": "James Thane", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/3483907-james-thane", "userReview": "In the first major case of his literary career, Gorky Park, Moscow detective Arkady Renko antagonized too many powerful people. As a consequence, he lost his job and his Communist party membership and was shuffled off into oblivion. He then disappeared from view for eight years before returning in Polar Star. Renko's fallen about as far as a man possibly can. From being at the top of his profession as a criminal investigator, he's now working on the slime line on a Russian factory fishing ship in the Bering Sea. It's a joint Russian-American venture in which American trawlers catch the fish and dump them on the deck of the Polar Star. The crew on the factory ship then process the fish and freeze them so that they can ultimately get to the marketplace. It's a dirty, disgusting job and freezing cold to boot. Working on the slime line is a job for men who have fallen about as far as they possibly can.Renko has been working the line in obscurity for quite some time, but then one day, one of the American trawlers lowers a net full of fish onto the deck of the Polar Star and caught up in the net is the body of a sexy young woman named Zina who had worked on the factory ship. The woman had last been seen standing by the rail of the ship during a dance which had been attended by the ship's crew along with some crew members from one of the American trawlers.The ship's captain knows that Renko was once a top criminal investigator and so pulls him off the slime line and asks him to investigate the death. All of the Powers That Be are hoping that Renko will come up with a simple explanation that will not embarrass anyone other than the dead woman. The best verdict would be that she fell accidentally into the sea or, in the alternative, that she committed suicide and was then caught up in the trawler's net.It's clear to Renko, though, that the woman was murdered and he is determined to get to the truth of the matter. Again, that's going to antagonize a lot of people, some for political reasons and others for reasons far more sinister, and before long, Renko's life will be in danger. The Polar Star is a large ship, but it's not that big and there are not that many places to hide. If he's going to complete his mission, Renko is going to have to be very careful and very, very lucky.I really enjoyed this book a lot. Renko is a very intriguing and sympathetic protagonist, and there are a lot of other interesting and well-drawn characters as well. The mystery is compelling and there's a lot of tension throughout the story. Smith excels at describing the setting, which is at once bleak and beautiful. One also learns a great deal about the commercial fishing industry in this book; happily I'm having pork chops for dinner tonight."}, {"userName": "Jeff ", "userReviewDate": "Jun 07, 2013", "userURL": "http://www.goodreads.com/user/show/12618229-jeff", "userReview": "Martin Cruz Smith’s Arkady Renko books are a series of mysteries set at various points in late 2oth century Russian history, starting with the last death throes of Communism. This is the second book in the series. I’ve read Stalin’s Ghost (#6) and watched the film version of Gorky Park (#1). Here, Renko, a former criminal investigator, has fled Moscow after the events of Gorky Park and is on the run from the KGB. After a series of awful jobs, he ends up gutting fish on a trawler in the Bering Sea. A fellow crew member is murdered and because of Renko’s unique skill set, he’s asked to help with the investigation.What sets these books apart for me, beyond the glimpses into current Russian society, is Smith’s exemplary character building of Renko. Renko has a quick mind and a dark, mordant wit. He clearly sees the cracks in the Soviet/Russian system and he’s not afraid, to his continual regret, to speak his mind and buck authority. William Hurt did a credible job in Gorky Park, but I picture a young Alan Rickman with the line readings in the book. Take a line like “Good luck”. This is how it’s written by Smith. He doesn’t embellish it with, “he said sardonically” or “he said cryptically” or “he said with withering sarcasm”. Renko’s character has been so firmly established that the reader can add his own inflections as he reads the books.This book offers up plenty of interesting characters (Russian and American), plot twists and political intrigue. The crimes in these books always start off with seemingly “grand” motivations but usually end up being about something petty and tawdry. This is not a bad thing.If you’re looking for a nice blend of police procedural, mystery and an “exotic” locale, I’d recommend this and the other Renko books."}, {"userName": "Emma", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "3.5 stars. I remember reading Gorky Park many years ago. In fact I reread it several times. I enjoyed the politics of The Soviet Union and the corruption of the state. This is the next book in the series, which I believe was not written until many years after the original.This is set on a factory ship in the seas off Alaska. This provides tension and claustrophobia to the story..it is very atmospheric. I really enjoyed the comparison between the Soviet ship and the American one. There were spies and baddies and smuggling and quotas. Arcady Renko is aboard as he has been exiled for his part in the Gorky Park investigation. This was pretty exciting in places and Renko is a great character. Looking forward to the next one where hopefully Renko will be back on dry land and possibly reinstated as an Investigator? Time will tell. Well worth a read!"}, {"userName": "Eric_W", "userReviewDate": "Feb 07, 2012", "userURL": "http://www.goodreads.com/user/show/1711431-eric-w", "userReview": "I’m not sure why I delayed getting to this title since I enjoyed Gorky Park so much, to which this book is a sequel of sorts. Of sorts, because it follows directly on the heels of Gorky, but the author in a few brief paragraphs lays out precisely why Arkady, formerly head investigator for the prosecutor’s office in Moscow is now working as a slimer on a factory ship in the Bering Sea.It’s good. Those who don’t like what they view as excessive detail in Moby Dick probably won’t like this book either, but as you know, I wallow in all manner of detail and the descriptive scenes of working on the factory ship were quite interesting, particularly when they discover a slime eel (hagfish) in the body of a Russian woman who was dragged up by one of the accompanying American trawlers (it’s a joint Russian/American business.) Totally gross. Because of his previous investigative experience, the captain pulls Arkady from the factory line and has him investigate, wanting to have everything kosher for the American observers on board. Arkardy is forced to walk a very fine line between those in power who see no reason for an investigation, nor do they want one, and his innate sense of justice that refuses to accept the official verdict of suicide when all the evidence points in a different direction. Everyone lies and everyone has nefarious reasons for doing so. It’s a world populated by paranoiacs and schemers.Lots of reflections on Russian society; comments like “In irony we lead the world,” which in context is not only amusing but perspicacious. And, my goodness, Smith has a dim view of people in general if his books are any testament."}, {"userName": "Ken Consaul", "userReviewDate": "Nov 13, 2011", "userURL": "http://www.goodreads.com/user/show/6482344-ken-consaul", "userReview": "I'm picking Polar Star as my favorite in the Arkady Renko series. The first is Gorky Park and I recommend starting with it. Each is a self-contained mystery but the background of the protagonist adds considerably to the story.In Plar Star, Arkady Renko is working on a fish-processing ship in the Bering Sea. This is his reward for solving a politically sensitive murder investigation in the previous Gorky Park. Renko was a Moscow police investigator during the Soviet regime. His dealings with bureaucracy of the government causes him to constantly tease the third rail of government officialdom.Subsequent books, starting with Red Square pick up Renko's story after the fall of the Communist government. There are seven in the series and each one is a great read. I'd pick Wolves Eat Dogs as the next best but all are terrific."}, {"userName": "Johnny", "userReviewDate": "Jan 24, 2010", "userURL": "http://www.goodreads.com/user/show/903066-johnny", "userReview": "More than a decade ago, I attempted to read a mystery called Gorky Park by Martin Cruz Smith. I couldn’t stomach it. Though it had received rave reviews, it seemed to plod and creak toward very little. I tossed it in a box and, after several cross-country moves, I have no clue where it is. But before I gave up on Gorky Park, a selection from the Mystery Book Club arrived in my mailbox. I didn’t get home in time to return it and ended up with Polar Star, the sequel to Gorky Park, in hardbound. I was too cheap to get rid of it, so I’ve been schlepping it around seemingly forever. On two other occasions, I started to read it, but it just didn’t resonate with me.Of course, that was before I visited Belarus. Somehow, experiencing the world behind the former Iron Curtain gave me a perspective that completely changed my ideas about the book. Now, I realize that the normally sparse and plodding style and the awkward phrasing was a deliberate trope to emulate Russian grammar and the Russian pace of speaking. Once I found myself reading the book as though I were in Belarus (although the events in the story itself take place on a Russian “factory ship” in the Bering Strait), I was able to enjoy the book. Fortunately, the entire book is not sparse in its language. There are two vivid images that I am unlikely to forget. The first was a reference to painted lead soldiers (toy soldiers in the book, but they reminded me of some of my experience with painted miniatures in my actual life) that had been thrown together in a box until their paint schemes were uneven and patchy, with little flecks of metal showing through. Investigator Arkady, the protagonist, suggested that the men who were veterans on the factory ship looked a lot like those neglected soldiers with all their missing paint. The second image was a simile of a difficult task being like trying to distill amber from sap. Quite memorable in my opinion!Ostensibly, the plot is about a female crewmember of the “factory ship” found dead in the large fish nets transferred from trawler to the mother ship. That event is indeed the Ur-strand of a complex web of deceit and counter-intrigue. Realistically, it makes good sense because not everything that seems to be related is related. Some are minor plots to beat the system. Some are major plots that could have inspired the murder. Nothing is really certain until the end. It is a very tight mystery.Yes, I’ll give Gorky Park another chance if I ever find it and yes, I’m glad I finally read this one. Guess it just goes to show you, irrational bias or lack of taste can make you miss something good. Maybe this review will cause someone else to reconsider a book they’ve previously blocked out."}, {"userName": "aPriL does feral sometimes ", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/3409532-april-does-feral-sometimes", "userReview": "'Polar Star', #2 in the Inspector Arkady Renko series, is a terrific story! I think it way more superior to the first book in the series, Gorky Park. It can be a standalone read, but Renko's backstory, which is referred to occasionally in this novel, is described in its entirety in the first novel. Missing from this narrative is exactly why Renko, an educated man who was an excellent Moscow police detective, is now on the run and hiding from the close attention of various Soviet political authorities and no longer a police inspector. Arkady's skills are being wasted in his current job cutting up fish on the 'slime line' of the fish processor ship, Polar Star. From Wikipedia:\"Some factory ships can also function as mother ships. The basic idea of a mother ship is that it can carry small fishing boats that return to the mother ship with their catch. But the idea extends to include factory trawlers supporting a fleet of smaller catching vessels that are not carried on board. They serve as the main ship in a fleet operating in waters a great distance from their home ports.\"https://en.m.wikipedia.org/wiki/Facto...The Polar Star carries 300 people as crew, 50 of them women. Most of them are processing the fish:https://en.m.wikipedia.org/wiki/Fish_...Renko is in survival mode, quietly earning a living in jobs which hopefully are under the radar of people he pissed off in Moscow. He is considered politically unreliable by important Communist Party members, a death sentence in the Soviet Union. Renko insisted on solving cases which involve prostitution, smuggling, murder and political corruption - all of which are considered impossible under a Communist government. It is two years after the events in 'Gorky Park', and after many hard labor jobs in Siberia which have served to muscle up the Inspector's body, he is now cutting fish up on a boat on its way to Dutch Harbor, occasionally stopping to swing aboard the fish caught by smaller American fishing boats to prepare the fish for later sale and distribution in America.https://en.m.wikipedia.org/wiki/Unala...(Gentle reader, my mother, an Aleut, went to school near Dutch Harbor, as she was born on Kodiak Island.)Fate steps in to change Renko's preferred state of intentional anonymity - Polar Star crewmember Zina Patiashvili's body unexpectedly falls out of an American fishing boat's net being emptied into the Russian ship's hold for processing. How did the Russian crew member's body get in another ship's fishing net? Was she murdered? If so, by who and why? Renko is reluctant to take the job of investigating the death because he knows solving it will not be welcomed by anyone, but Captain Victor Marchuk gives him no choice; Marchuk has no choice - American monitors are on board the Polar Star per international agreements. No one else on board has the required skill set to find out what happened. As Renko expected, he soon is experiencing near-death 'accidents'. Gulp. It is a good thing he is in such good shape, but even so, he is not safe from fish knives, which everyone has, and bullets, not to mention the freezing cold of the Arctic waters just outside of the suddenly too-small ship of which he is literally trapped. Solving the murder is worse than being elbow-deep in fish slime!"}, {"userName": "Mike", "userReviewDate": "Oct 04, 2013", "userURL": "http://www.goodreads.com/user/show/1620394-mike", "userReview": "Wow, a huge improvement on Gorky Park, which I really liked. It all takes place on a fish processing boat in the Bering Sea, several years after Renko loses his job and Party membership for the events in Gorky Park. Renko is now reduced to cleaning fish in subzero temperatures, until a murder occurs on board, and he is very reluctantly pulled into the investigation. Unlike Gorky Park, where the reader knows the identity of the murderer practically from the start, this is a stone-cold whodunit. Even better, Smith really creates a sense of place and mood with his depiction of this lonely fishing boat, stuck in the frozen middle of nowhere. One of the most effective mysteries I've read."}, {"userName": "Antonia", "userReviewDate": "Apr 10, 2010", "userURL": "http://www.goodreads.com/user/show/3131253-antonia", "userReview": "to start off: i thought it was marvellous. one hardly comes across crime novels of such good quality. i bought it because i remembered i had read Gorky Park some years ago and i really liked it.the book follows arkady renko, who, after some investigation not quite satisfactory to the state, works on a soviet factory ship that works together with american boats on a joint venture. one day a corpse comes up in the net of one of the factory ship's girls. as the only person on board experienced with investigations the captain asks arkady off the slime line to find out as much as he can. from there a plot develops that i would not have thought possible on the confines of basically three ships in the middle of the ocean with a limited cast of characters.the good thing about it - it did keep me guessing until the very end, which does not happen often. it is written very well and its plot is intricate with lots of little bit of information about fishing, russia, espionage, technology... and without being preachy or obvious about it. great insight into a different way of life in a different time, and a sympathetic one for that.five straightforward stars."}, {"userName": "Bettie☯", "userReviewDate": "Jan 09, 2010", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Bettie's Books"}, {"userName": "Grady McCallie", "userReviewDate": "Mar 12, 2013", "userURL": "http://www.goodreads.com/user/show/8034370-grady-mccallie", "userReview": "In Gorky Park, Martin Cruz Smith conjured a claustrophobic atmosphere in Soviet-era Moscow; that task is simpler here, where the action takes place on a handful of ships and a single, small Aleutian island. Yet the overall feel is considerably more upbeat, perhaps because former detective Arkady Renko enters this story at rock bottom, cutting fish on the slime line of a fish processing ship. A young woman worker from the boat goes missing but, before anyone really notices, reappears from the depths of the ocean, hauled up in a fishing net. Renko is drafted to solve the mystery, then undrafted, but he's hooked; a combination of integrity, curiosity, and pressure from above won't let him drop it. The author makes Renko smart, tough, and canny. There's plenty of psychological complexity, but it belongs to other characters, so a reader can follow along as Renko sorts it out, without having to wade through pages of the detective probing his own soul. The novels in this series are pretty astringent, and would be hard to read straight through, but are a real pleasure with a break in between."}, {"userName": "Alan Marchant", "userReviewDate": "May 21, 2011", "userURL": "http://www.goodreads.com/user/show/2485937-alan-marchant", "userReview": "Polar Star is set in the microcosm of a Soviet fish-factory ship working the fog-shrouded waters of the Arctic Sea. The story begins as a member of the crew is dredged up in one of the fishing nets. Arkady Renko, a former detective exiled to the gulag as a reward for previous successes, is called up (unwillingly for all concerned) from the \"slime line\" to find a harmless explanation for the accident.The book is satisfying as a classic murder mystery. It's even more interesting as an exploration of the claustrophobic atmosphere of a factory ship and the unsettled era of Perestroika. I particularly enjoyed a scene where Renko teaches an American observer how to \"fish\" for vegetables in the Russian soup.Although this book is typically listed as #2 in the Arkady Renko series, it stands as a complete novel. Martin Cruz Smith says that he never intended to write a sequel to Gorky Park. And Polar Star is also a totally self-contained novel."}, {"userName": "Jim", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/439937-jim", "userReview": "So long ago I read GORKY PARK, and I really enjoyed it, and then recently I read a much-later volume, which at first I thought was a stand-alone, and I knew I would have to go back and make some attempt at reading all of the series. Smith is a good writer, his story keeps you riveted, and it doesn't hurt that the action takes place amongst Russians (reflecting an era active during my life, which also makes it interesting). Surely there will be repetition and template-like action, but somehow I think the next book will be enjoyable nonetheless, and that is more than I can say for some series. Renko seems genuine: not brilliant, but smart and persistent; a bit of a wiseacre, but without a streak of meaness; lucky, to be sure, but I'd rather have that than some superman who beats or shoots all comers. I'm glad I came back to this series, and look forward to the next volumes."}, {"userName": "Margaret Sankey", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5861086-margaret-sankey", "userReview": "Shunted off to a Soviet psychiatric hospital after Gorky Park (embarrassed the state, but son of a famous military father), former Inspector Arkady Renko manages to get sent to work on a Russian fishing/processing ship in the Bering sea, finding some peace on the \"slime line\" gutting and scaling. As usual, a body drops out of the nets--a young Georgian woman on bad terms with the Soviet authorities and Americans in Alaska. Arkady is called upon to redeem himself by wading into another diplomatically and emotionally charged situation, with the possibility of a return to civilization and a reunion with Irina."}, {"userName": "HBalikov", "userReviewDate": "Aug 15, 2012", "userURL": "http://www.goodreads.com/user/show/929238-hbalikov", "userReview": "One of my favorite Renko stories. His first exile and on a Russian fish factory ship where Smith gives you a palpable sense of what that must mean for the body and the spirit. The mystery and investigation is also top notch with typical Renko twists and insights. One of those rare mysteries that I have enjoyed reading over again."}, {"userName": "Asghar Abbas", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/37421322-asghar-abbas", "userReview": "It was a fine sequel, don't get me wrong. But I am thinking this sort of thing must have made for nice entertainment during the cold war. I like how McS had inverted the theme of heroes and villains.That I like."}, {"userName": "Peter Tillman", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/8101737-peter-tillman", "userReview": "This is an amazing book. The sequel to \"Gorky Park,\" it's set in the last days of the USSR and the Cold War. Arkady Renko is a worthy protagonist, and indeed just about all of the characters are well-drawn. One of my favorites was Karp Korobetz, a tattooed gangster who Arkady had sent to prison many years before. He becomes Renko's nemesis in the story, and very nearly succeeds in murdering him, in some chilling action sequences. And they almost become friends by the end of the book, in a scene that would be unfair to reveal. 4.5+ stars. Why I missed it back then, who knows?I didn't know much about the author, and had only read his \"Gorky Park\" long ago. He was a prolific but not very successful pulp-fiction writer in the 1960s and 70s. Here's a good 2005 profile:https://www.theguardian.com/books/200...Recommended reading. Sample:MCS: \"I was making less money each year so I bought a movie magazine to figure out what the hell people wanted. There seemed to be lots of killer animals, sharks, bees. I'd seen a newspaper report about vampire bats so I wrote up a story with vampire bats and some Hopi shamanism and my agent sold it within a day.\" It became a very bad movie, but paid the bills for awhile while he struggled to sell \"Gorky Park\".I'd wondered how he got the Russian settings so right. The answer: hanging out with Russian defectors and emigrants. The Siberian and Aleutian settings are also well-drawn, and accurate for the time. You don't hear much about Siberia now, but it was a good place for exiled Russians to rebuild their lives at the tail-end of the USSR, in the resources boom years."}, {"userName": "Lobstergirl", "userReviewDate": "Sep 02, 2014", "userURL": "http://www.goodreads.com/user/show/1910836-lobstergirl", "userReview": "A superb, engrossing, brutal thriller. This is the third Arkady Renko I've read (I read Red Square first, since I owned it, then Gorky Park) and the best of the three so far. Gorky Park dwelt too much on the unlikable Irina. Since I liked Arkady so much, I couldn't understand what he saw in this Siberian hussy. Maybe you have to be male. Irina fortunately doesn't present herself in Polar Star; there are only a few mentions of her. There is a Georgian hussy here, but she's not heinous. In fact, she's very dead. Arkady, after his objectionable behavior in Gorky Park, is in exile. He spent awhile working in a reindeer abattoir, then transferred to the Soviet factory ship Polar Star, which is trawling the Bering Sea. Behind it several much smaller American ships catch the fish with nets, then transfer them to the factory ship. Arkady has the most disgusting, low level job aboard, gutting and cleaning on the fish line. When Zina's cold dead body is brought up in a net with the day's catch, the captain asks Arkady to investigate. Soon, a suicide note is \"found,\" and the official investigation is concluded. Arkady, naturally, keeps his unofficial investigation open. And people keep trying to kill him. He's a Russian MacGyver, extricating himself from a nearly endless parade of deaths in the book's three sections - Water, Earth (a brief stopover in the Aleutian Islands), and Ice (the ships head north and the sea freezes over).Smith is a terrific writer; in this book, he's in a league with John le Carré. Somehow, despite being Soviet, despite being a target of his enemies in the superstructure, Arkady maintains the most hilarious, dry sense of humor.He came over to Arkady. \"The ladies want to know if you have a two-headed prick.\"\"What is normal here?\" Arkady asked.\"Ugggh.\" A machinist recoiled from his first bit of a cracker. \"What kind of meat is in this pâté?\"\"Peanuts,\" Izrail told him. \"It's peanut butter.\"\"Oh.\" The machinist took another nibble. \"Not bad.\""}, {"userName": "Rossrn Nunamaker", "userReviewDate": "Apr 05, 2008", "userURL": "http://www.goodreads.com/user/show/1044243-rossrn-nunamaker", "userReview": "Polar Star was written in 1989 and featured detective Arkady Renko who first appeared in Smith's Gorky Park (published in 1981). The book is set during the time of the Soviet Union, but near the end when there was some cooperation, though utter distrust, between the US and Soviets. While Gorky Park was primarily set in the city of Moscow, Polar Star is the name of a massive factory ship (fish processing) in the Bearing Strait.The floating city is full of people with pasts who have fled the government or prison and found themselves on a ship that would take anyone willing to endure it for months at a time. Adding intrigue was an arrangement with US fishing vessels that provided the catch to be processed on the ship. These vessels each had a unique crew and both soviet and US spies were aboard both ships.The story begins when a Georgian worker from the factory ship is found in the net of one of the catches. The worker, a woman, is well known on all boats and the captain wants to learn how her death occurred. He calls on Arkady Renko who has found asylum on the ship after fleeing Moscow following the episode in Gorky Park that resulted in his boss being killed and his lover defecting to the US.Renko uses his skills as a detective to learn how this woman died following a party held with workers and fisherman. The story ends when Renko solves the mystery and learns as he investigates that there is much more than fishing taking place in the Strait.I really enjoyed the book and especially the character. Renko was a Russian through and through and the essence of the character could have been a character in any Russian novel."}, {"userName": "Marieke", "userReviewDate": "Aug 18, 2008", "userURL": "http://www.goodreads.com/user/show/1055378-marieke", "userReview": "Every bit as good as I remembered. Highly recommended! I worship MCS for his grittily vivid scenes, lovable shady characters, and wonderfully surreal landscapes. (Not to mention his Russian soul!) If you haven't read Gorky Park, read that one first! As usual, Arkady Renko is reluctant to begin a murder investigation--this time into the death of a popular young woman on board the Soviet fish-processing factory ship, the Polar Star.As he discovers one shady operation after another--smuggling, spying, sleeping around--Renko is drawn into the intrigue as much as we are, until he can't rest without finding the answers he wants. And there is nothing we want more than for him to continue probing the mystery; though we might care a bit more for Renko's personal safety than he seems to himself.This Renko has nothing to lose--a life of running across Siberia from the KGB, stuck gutting fish at the bottom of a factory trawler, dead to the world. He has retained his habit of wandering into dangerous places unprepared, and narrowly escaping death.Also as usual, the people who want Renko dead turn out to the most interesting characters in the story. A powerful criminal on the ship may want to kill the investigator, but he also wants to know what happened to Zina, the murdered girl. Curiosity stays his hand more than once.Investigator, officers, criminals and spies wander circles around each other on this small, ice-bound world in the middle of the Bering Sea. Through all this, Arkady Renko is surprised to find that he has something to live for after all."}, {"userName": "John Matsui", "userReviewDate": "Feb 16, 2015", "userURL": "http://www.goodreads.com/user/show/30014454-john-matsui", "userReview": "I read Gorky Park in 1981 or 1982 and loved it. I don't know why it took me so long to get to the second book in the series featuring Arkady Renko, former Moscow police investigator.That said, Polar Star presented me with a conundrum. I like the Renko character and love the Russian storyline. I can understand why Renko's life has fallen apart and how he landed in horrid circumstances doing one of the worst jobs imaginable. But on the murder front - which is kind of important in a murder mystery – the story just lacked credibility in some key areas.I didn't buy the rationale that transformed Renko from a guy who wanted to escape everything and at first didn't want to investigate a young woman's murder to someone totally dedicated to resolving the mystery at his personal peril.Secondly, while Renko's vulnerability and every man's physicality – he's no James Bond or Jason Bourne – makes for an appealing character, the author leaves it to plain dumb luck that he survives a couple of key moments. It would have been better to leave some of these events out and find interesting situations where his life wasn't in peril as often. Other characters whose brains supersede fighting ability manage to avoid these near lethal encounters or use a neural-driven escape.The awful Robert Downey Jr. portrayal of Sherlock Holmes as a martial arts expert aside, Holmes almost always used brain power to extricate himself from the worst situations."}, {"userName": "Perry Whitford", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/5485442-perry-whitford", "userReview": "A well earned second outing for Cruz Smith's dogged and durable Russian homicide investigator after the international success of Gorky Park.No longer an investigator and with his Party membership revoked, Arkady Renko is effectively a criminal on the run, hiding out in the Bering Sea gutting fish on the 'slime line' of the huge factory ship, Polar Star. The fishing operation is a joint venture with the Americans, but Glasnost doesn't mean the end of the Cold War as Renko finds his services required in an unofficial basis to entangle a plot involving smuggling, espionage, and a murder dressed up as a suicide.I rate the Renko books as highly as any detective series I have coma across, having read six of the eight books so far (in fact this was a reread). The Russian sleuth is no superman, but he hangs onto a case like a barnacle onto the side of a ship.Once again he has done a thorougher job of his research, yet doesn't yet all he has learnt bog the narrative down too much. He makes good use of the cramped locations on the boot too - the bridge, fishholds, the freezers, the trawl deck etcI can't wait to catch up with Renko in his seventh and eighth adventures too, which i will do before long, as well as reredaing a couple more of his earlier investigations."}, {"userName": "Ioana", "userReviewDate": "Oct 16, 2015", "userURL": "http://www.goodreads.com/user/show/1721356-ioana", "userReview": "Martin Cruz Smith may be American, but he writes like a Russian. I've never before read a non-Eastern European able to portray the Russian/Eastern-block communist mood with such insight and accuracy. When I first encountered Gorky Park, I couldn't believe Cruz Smith wasn't raised in Stalin's USSR--his humor, sensibilities, language, characters are simply native/perfect. Polar Star maintains the Russian authenticity.That, of course, is the highest praise. And to top it off, I am madly in love with Arkady, the unflappable, amused, skeptical state investigator turned Siberian worker, one of the most existentially aware characters in all of literature, and absolutely, perfectly Soviet (disclaimer: I'm Romanian and I couldn't tell before reading Smith's bio that this wasn't translated from the Russian. I also have a thing for Russians/communist deadpan/stories about pre-1989 Eastern Europe/the North Pole/snow/winter).Minus one star for gratuitous violence and sex towards the end (other than that, these books are so intellectual. The Arnold scenes are unnecessary and spoil the otherwise heady mood)."}, {"userName": "David Gooch", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/9521336-david-gooch", "userReview": "A very interesting read. This is the second Renko book and in this one he finds himself stuck on an Arctic fish factory ship and when a body turns up in the nets who is one of the crew, it is Renko who is called on to investigate.There are a lot of developing threads and twists in the book along with the fact that on the boat is one of the guys he had caught previously and is looking for revenge. So he has to dodge the potential threat of him and keep hunting for the killer. Then he has the might of Russia pressing down in what the state would want and he has to be careful what he does and who he might upset.I must admit that I love Renko as a detective and Cruz-Smith puts him across beautifully that you can see the man stood there in front of you. Not the world's biggest or strongest guy but like Christie's Poirot he uses \"those little grey cells\" to good effect in solving things.In this one the atmosphere built on the boat is terrific and just when you think it may solved it moves on again, keeping the reader turning the page to find out.It is well worth the read you wont be disappointed."}, {"userName": "Kristin", "userReviewDate": "Jan 10, 2010", "userURL": "http://www.goodreads.com/user/show/892406-kristin", "userReview": "This is the second book in the Arkady Renko series and I have to say I found it a bit slow. As mentioned above, the whole book takes place on a Soviet Factory ship in the Bearing Sea, where American ships bring their fish to be processed rather than returning to a factory on American soil. However, there are only so many people on said ship and Renko pursues this murder with an almost bulldoggish determination that at 384 pages becomes almost tedious. Smith does have one advantage that I admire over other mystery writers is I am truely left guessing until the end \"who done it\". It's also been several years since I read Gorky Park and I have to admit I was a bit foggy on some of the details that linked the two books together. So I was left to piece together past bits with current bits and that distracts me from the main story. I wasn't so turned off that I won't look into the next book. Overall I am enjoying the series and I'll probably try and pick up a used copy next time I'm at my favorite used bookstore"}, {"userName": "Marcia Chocinsky", "userReviewDate": "Mar 14, 2015", "userURL": "http://www.goodreads.com/user/show/9883478-marcia-chocinsky", "userReview": "Martin Cruz Smith has to be one of the best Crime-Mystery writers out there. His characters are uniquely defined and the plotting is complex and his prose is extremely well written ... All this, in addition to being set against the backdrop of Cold War era Soviet-US relations, makes his novels stand out when compared to others in this genre. I truly enjoyed Gorky Park when it first came out and I am surprised that it has already been 30+years since then. I fell behind in my reading during my work years and have not read enough of MCS's novels, a situation I hope to rectify over the next few years by including his books in my rotation. MCS's non-Renko novels like Rose, which I read recently, are to my mind even better than this series, if at all possible. The Arkady Renko series is a more commercial (for want of a better word) effort, but the series stands head and shoulders above other crime-mystery books. Mr. Cruz Smith, I will be back to visit with you soon."}, {"userName": "Annie", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/1616058-annie", "userReview": "After Arkady Renko’s last case (Gorky Park) ended in a Phyrric victory, he was interned in a Soviet hospital and diagnosed with “sluggish schizophrenia.” (The theory behind this diagnosis was that anyone who acted against the state was clearly insane.) Martin Cruz Smith’s novel Polar Star begins a few years after Renko’s ignoble dismissal from the Moscow militia. When we finally catch up to him, Renko is working on the “slime line” on a factory ship. He’s run as far east as he can to get away from the KGB and the men who want to put him back in the hospital or a prison. Renko keeps his head down and cuts up fish. His plan might have worked if a female crewmember hadn’t been murdered and the ship’s captain hadn’t found out about Renko’s experience as an investigator...Read the rest of my review at A Bookish Type."}, {"userName": "Terry Cornell", "userReviewDate": "Oct 16, 2015", "userURL": "http://www.goodreads.com/user/show/11712998-terry-cornell", "userReview": "One of my new favorites! A follow up to 'Gorky Park'. Arkady Renko former Moscow investigator finds himself working the 'slime line' on a Soviet factory ship in the Bering Sea. Murder mystery wrapped in a spy thriller, or spy thriller wrapped in a murder mystery? I can't tell. So many twists and turns. A bonus of the Kindle edition I read was a portion of an interview with the author. He did not intend to write of further adventures of Arkady Renko after finishing 'Gorky Park', but found inspiration later. Martin Cruz Smith actually spent some time on a Soviet factory ship in Dutch Harbor Alaska, and at the Captain's invitation intended to spend some time observing fishing operations. However, Moscow government officials soon put a stop to that. I also love the back story of Renko's journey between the ending of Gorky Park, and winding up on the Polar Star."}, {"userName": "Ted Cross", "userReviewDate": "Jan 11, 2011", "userURL": "http://www.goodreads.com/user/show/3650853-ted-cross", "userReview": "I re-read this as part of my ongoing plan to read all of the Arkady Renko novels (though out of order). I first read this one back in 1995 while visiting Bangkok for the first time. I found it as a discount book at a shop. I liked it then, and I think I liked it even more now. It's essentially a murder mystery set on a large Soviet fishing ship in the Bering Sea. The feel of being on a Soviet vessel is intriguing, and the twists and turns are surprising enough. The only drawback at all, in my opinion, is how the author never lets Renko say anything that could help himself. It's as if he wishes to be a martyr, always allowing people to think the worst of him when a few simple words could let them know they are wrong. Still, the series is great and anyone interested in stories set in Russia should love it. I only wish they had done a whole series of good movies based on this series."}, {"userName": "Quillracer", "userReviewDate": "Mar 05, 2013", "userURL": "http://www.goodreads.com/user/show/10979943-quillracer", "userReview": "I like this series.Smith always delivers a complex tale full of twists and turns, false leads and blind alleys. He also hammers away at the rigidity, failures, and corruption of Soviet society.Here, Renko, reduced to working the basest job on a factory fishing ship after falling from grace in Gorky Park, is asked to look into the death of a cook on the ship.I had a little trouble following Renko’s investigation, sometimes didn’t get how something one person said led him to ask another person a slightly different question that led him to a clue.Of all the books in this series, I like this one the least."}], "description": "He made too many enemies. He lost his party membership. Once Moscow’s top criminal investigator, Arkady Renko now toils in obscurity on a Russian factory ship working with American trawlers in the middle of the Bering Sea. But when an adventurous female crew member is picked up dead with the day’s catch, Renko is ordered by his captain to investigate an accident that has all the marks of murder. Up against the celebrated Soviet bureaucracy once more, Renko must again become the obsessed, dedicated cop he was in Gorky Park and solve a chilling mystery fraught with international complications.“Stunning.”–The New York Times Book Review“Impossible to put down . . . a book of heart-stopping suspense and intricate plotting, but also a meticulously researched, ambitious literary work of great distinction.”–The Detroit News“Martin Cruz Smith writes the most inventive thrillers of anyone in the first rank of thriller writers.”–The Washington Post Book World“Gripping . . . absorbing.”–The Philadelphia Inquirer", "title": "Polar Star\n      \n          (Arkady Renko #2)", "url": "http://www.goodreads.com/book/show/1264236.Polar_Star", "average": 4.0, "cover": "https://images.gr-assets.com/books/1388889432l/1264236.jpg", "reviews": 303, "authors": [{"url": "https://www.goodreads.com/author/show/8258.Martin_Cruz_Smith", "name": "Martin Cruz Smith"}], "type": ["Fiction", "Mystery", "Thriller", "Cultural", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/1264236.Polar_Star", "http://www.goodreads.com/book/show/778285.Polar_Star", "http://www.goodreads.com/book/show/8551346-polar-star", "http://www.goodreads.com/book/show/779015.Polar_Star", "http://www.goodreads.com/book/show/3568382-polar-star", "http://www.goodreads.com/book/show/778293.Polar_Star", "http://www.goodreads.com/book/show/762806.Gorky_Park", "http://www.goodreads.com/book/show/647683.Red_Square", "http://www.goodreads.com/book/show/151350.Wolves_Eat_Dogs", "http://www.goodreads.com/book/show/151353.Havana_Bay", "http://www.goodreads.com/book/show/6362651-three-stations"]}