{"ratings": 7806, "userreviews": [{"userName": "Gary", "userReviewDate": "Jun 12, 2016", "userURL": "http://www.goodreads.com/user/show/51196399-gary", "userReview": "This epic is a phenomenal account of a remarkable nation and a remarkable people.It documents the resilience of the Polish people, in the face of experiencing their nation being crushed by invaders and more powerful neighbors, so many times.It begins in 1981, at the time that Poland lay under the heel of Communist tyranny, as a puppet of that Evil Empire, the Soviet Union, introducing us to the brave Polish farmers leader, Janko Buk, who out of love of his people, prepares to take on the might of the cruel Marxist-Leninist monolith.We are then taken back to AD 1204, to discover how Poland bravely stood against the ravages of the savage Mongol and Tartar hordes sweeping through Europe from the East.Michener then documents the repeated rape of Poland through history, by the Germans from the West and the Swedes from the North, as well as the brave role played by the Polish in beating back the Islamic Ottoman invasion of Europe from the south. (Is Europe once more faced by an Islamic invasion in the 21st century?).Through the various partitions of that country, whereby Austria, Prussia/Germany and Russia, divided that nation amongst themselves, like a cake.Finally in the 20th Century, Poland again re-emerged free in 1918, but only for a short while, and was to experience being at the receiving end of the two cruellest and most vicious movements in history, Communism and Nazism (may both be erased forever!)Through this sage we get to know many amazing men and women, representing a most resilient nation."}, {"userName": "Stephen Gallup", "userReviewDate": "Mar 25, 2010", "userURL": "http://www.goodreads.com/user/show/1266077-stephen-gallup", "userReview": "Poland was one of several Michener historical novels I read in the late 70s and early 80s, when it seemed everybody else was doing the same. I rarely hear him mentioned these days and wonder why.I hadn't intended to read it again now, but a copy fell into my lap, and after opening it idly I was hooked.Large chunks of the story had stayed with me over the years. I remembered Michener's accounts of the invasions by Tatars and Swedes, and the unspeakable things those people did (wonder why modern-day Poles don't seem to have a chip on their shoulders the way other nations do about past atrocities). I remembered the three layers of Polish society that Michener portrays as a constant throughout the eight centuries that are covered -- the pragmatic but usually self-centered upper nobility, the more romantic but perhaps more selfish gentry, and the serfs, who are taken completely for granted by their masters while steadfastly serving as the country's greatest resource.Reading Poland's long tale of woe, I thought of Arnold Toynbee's ironic quote, \"History is something unpleasant that happens to other people. We are comfortably outside all of that I am sure.\" My first reading was during \"Morning in America,\" when one might have been excused for feeling safely insulated from such terrible events. This time, beginning with the opening scene in which modern-day Poles confront the reality that communism has failed them, through the point near the end when a true believer betrays his compatriot over an ideological disagreement, I found reason to wonder how closely events over the next generation or so, much closer to home, may replicate what is portrayed here.The good news is that after every calamity, Michener's Poles rebuild. So, taking the long view, it's probably reasonable to hope that our descendents can do the same, after the lessons of history have been learned yet again."}, {"userName": "John Eliade", "userReviewDate": "Jul 01, 2015", "userURL": "http://www.goodreads.com/user/show/27226563-john-eliade", "userReview": "I like James Michener a lot. That said, it's obvious that he's not for everybody and in fact, I would argue that most people are not reading James Michener correctly. And before you say, \"You shouldn't need to be told how to read something in order to be able to read it,\" I would say this: people should have some understanding of say, the Bible, or the Qur'an, or of Nietzche, or Plato, or Buddhist Sutras before you start engaging with them. Or if you're trying to argue that that's intense philosophy, not fictional novels, well you have a selection to choose from, because we do the same with Shakespeare's plays, with Dickens' novels, etc. So I'd argue that a primer is necessary for those who are not familiar with the novels of James Michener. Michener has been called \"the King of beach reading,\" which I find mysterious because his books are massive and (if you are reading a hard-cover, first edition copy like I was) can cause wrist cramps which doesn't seem ideal while lying on coastal paradise, being enveloped into the annals of a country that was raped by historical forces and the madness of humanity over and over again. James Michener, quite simply, tries to capture the essence of an era into a novelized format. For example, his novel \"Space\" begins with the close of the second World War and the escape of Peenemunde scientists from the Third Reich to the United States, and ends with the development of the Space Shuttle. And between those important events, it covers the political intrigue, the military-industrial terror of the '60s and '70s, the excitement and thrill of landing on the moon, the pop culture and misinformation of the American people, and then the tragedy of space accidents like Apollo 1. And all through these epic events, the mystical location, and the representative characters, there's the theme woven through the novel: what is humanity's next step? Knowing what you know now, you can probably construct the basics of Michener's Poland: it's about a fictional village (Bukowo) on the Vistula between Krakow and Warsaw. It features three families representing the nobility (Lubonski), the rising middle class (Bukowski), and the peasantry (Buk). And it is woven through with an important theme immortalized in this phrase: \"A Pole is a man born with a sword in one hand and a brick in the other. When the fighting is over, he rebuilds.\" When Michener wrote Poland, it was one of the most prosperous nations in the Warsaw Pact, and was facing the least of the Soviet repressions, the memory of the Nazi terror in Poland was still fresh in everyone's mind, and with Karol Wojtyla just elected to the Papacy in Rome, he began his historical research. The first four chapters represent essentially the entirety of Polish history: \"From the East,\" \"West,\" \"North,\" \"South,\" discussing the events and effects of the invasions of Poland (or just Eastern Europe in general) by the Tatars in the 1240s, the Teutonic Knights in 1410, the Swedish Protestants in the 1650s, and the Turkish attempt to capture Vienna, famously defeated by the Polish King Jan Sobieski in 1683. In addition to the fictional families of Bukowo that are witnessing the attacks on their nation, Michener also introduces the Von Eschl family who begin as the hereditary rulers of the Teutonic Knights, dedicated to the Germanization of Poland. All of the historical set up in the book builds up to two main events: the Partition, and \"The Terror,\" describing World War II in Poland. Michener represents Poland as a nation ahead of its time. At the end of the eighteenth century she was busy viciously attempting to adopt sorts of reforms that would allow a gentle rise of a middle class, a pacified peasantry, but ultimately to the emasculation of the nobility: \"There was no justification for this terrible rape of a free land. Such nations as Switzerland had long been encouraged to exist as buffers between larger powers, and there was no reason why Poland should have been denied this privilege, except that she had committed two fatal errors: she had evolved no way to defend herself with a stable government, regular taxation and a dependable army; and in her weakness she had endeavored to initiate freedoms which threatened the autocracies which surrounded her. Had her neighbors been England, France and America instead of Russia, Prussia and Austria, she would surely have been permitted to exist, for the innovations she was proposing were merely extensions of what that first trio had already accepted. To be both weak and daring is for a nation an impossibility.\" Instead, she opted to protect what was called \"The Golden Freedom,\" the ability for Polish nobles to veto any action of the (elected) monarch, and instead lost all freedoms for well over a century. Her short lived republic between the World Wars ended tragically, once again caught in her nightmare of being torn apart by the Germans to her west and the Russians to her east. I have not been to Poland yet, but in 1910, my great grandfather arrived in America from (what was) the Russian \"Kingdom of Poland.\" The quote above about swords and bricks really resonates with me, and I can see how that cultural standpoint works so well in my family history. Or even this one from the Tatar invasion, which explains certain facial features those of us with Polish heritage might find ourselves staring at Asian friends in the mirror and wondering: \"Of course, in February of 1242 they did produce bastards, but young ones were so earnestly needed to rebuild the settlement that no disgrace adhered to them. Such events, repeated over the centuries, accounted for the fact that many Poles along the Vistula would have darkened skins and eyes slightly aslant, as if they represented echoes out of Asia.\" I look forward to going to Poland in the near future and seeing how well Michener's novel holds up to the feeling of being in Poland in the 21st Century, because he presents a fantastic image of its history, with all the bravery, the challenge, and the foreshadowing of triumph that Poland would soon achieve (He mentions Lech Walesa a few pages in, and remember, this was first published in 1983, prior to his acceptance of the Nobel Peace Prize, and his future election in the Polish Solidarity Revolution). It's an excellent introduction to Michener fiction, just remember that when you see characters espousing expository dialogue, that they aren't fictional characters like you might see in other novelists' work: they're personified segments of entire portions of a society. In a certain and important way, we all are. Even those of us who are echoes out of Poland."}, {"userName": "Doreen Petersen", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/24442706-doreen-petersen", "userReview": "Fantastic book! Being of Polish heritage I found this book to be especially good. I would recommend this one."}, {"userName": "Bodosika Bodosika", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/5553160-bodosika-bodosika", "userReview": "This book is more less the history of Poland and the Polish people and their neighbor and it was well written by the author hence no dull moment... The author is a Genius hence I gave it to 4 Star."}, {"userName": "Thomas Devine", "userReviewDate": "Sep 27, 2012", "userURL": "http://www.goodreads.com/user/show/3274522-thomas-devine", "userReview": "As a bestseller, the 1984 Corgi edition of this novel retailed at NZ$9.95. I found this gem in a second-hand book sale for NZ$3. It would have been worth full price if it had been sold as a current bestseller. The copy I now hold belonged at some stage to one L. de Groot. It’s a book I’ll add to my hoard because even though I may never read it again, I treasure it.I read a few of Michener’s sagas many years ago and he is the master of blending fact and fiction in fascinating stories. In a miniscule way, by comparison, I’m providing a little snapshot of the history of NZ’s Campbell Island in my next novel “Island of Regrets”.That aside, I had to recommend “Poland” to readers, who have not yet discovered it, as a great read that will keep you enthralled from start to finish.With such a history, it is amazing that any Poles survived let alone, as the book blurb says, with an “unconquered heart”. The novel “reveals this spirit in all its drama and tragedy”. The novel is rightly described in the blurb as “spectacular” and few novels better justify that tag.In the first external examination I ever took as a young person I failed in the subject “history” but, after reading Michener, the essence of Poland’s history is imprinted in my brain."}, {"userName": "Hadrian", "userReviewDate": "Jan 25, 2011", "userURL": "http://www.goodreads.com/user/show/4100763-hadrian", "userReview": "First Michener I've read. Interesting setting and history, wide in scope. Covers a lot of ground."}, {"userName": "Martin", "userReviewDate": "Jan 02, 2013", "userURL": "http://www.goodreads.com/user/show/110449-martin", "userReview": "\"Poland\" is written with all the elegance of a bloated instruction manual. If you enjoy the absence of subtext, disastrously bad sentences, and descriptions that make a list of technical specifications read like poetry, you will love Michener's writing. This ain't Zadie Smith, folks. In fact, it's probably one of the worst-written books I've ever slogged through.Yet. I didn't hate this book. Because while reading page after page was like walking through a post-apocalyptic city in a movie, where beloved buildings lie crumbled and scattered like a sugar cookie on the sidewalk, the HISTORY contained in this book was fascinating. I realize we're talking about a novel here, so I can't take everything that happens in this book and just believe it as fact, but I will anyway. The only way I can process and enjoy what I've just read is to believe that it's 100% accurate as history, and allow me to parrot back plot points as if I have taken a Polish history course. I have already started doing this.Really, though, this book covers a vast swath of time and does a pretty incredible job of connecting concepts across the centuries. I do feel like I learned a lot, and I actually enjoyed the vast scope. It was just the specifics (like the choice of words, the order in which they were sequenced, and the clanging simplicity of their meaning) where everything got bogged down. (The lengthy sections set in 1890's Vienna where Michener describes in plodding detail a number of pieces of music -- especially Chopin -- truly made me want to beat myself about the face and neck with this 600+ page brick. It was like reading IBM's Jeopardy-playing supercomputer trying to describe a beautiful sunset. Reading those pages ever again might very well be enough to drive me mad.)The more important point is: I can now discuss in rudimentary detail seven or eight important periods of Polish history with my in-laws. And for that, I will overlook the catastrophic prose and be forever grateful."}, {"userName": "Mary", "userReviewDate": "Aug 23, 2011", "userURL": "http://www.goodreads.com/user/show/6110449-mary", "userReview": "James A. Michener's historical fiction, \"Poland\", is remarkable. It dives into the heart of the country - its people, culture, art, music, landscape, traditions, rituals - in such a way as to enkindle in the reader a love for the country. Michener paints a thorough picture of the events that have shaped Poland, and clearly establishes the boundaries between history and fiction before the novel begins. A thousand years of history are cleverly presented through tracing families through their generations, which adds to the reader's understanding of the depth of Poland's history.The novel sparks the imagination, and ignites an insatiable desire to discover Poland's heroic greatness - the heroism that its beloved pianist, Frederic Chopin, achieved in his nationalistic music.This historical fiction is also significant for the bits of wisdom about the unfolding of history and about the shaping of character. The events in the novel are detailed, and often technical, and yet continue to hold interest and build momentum. A great book!"}, {"userName": "B Wojcik", "userReviewDate": "Jun 07, 2009", "userURL": "http://www.goodreads.com/user/show/2208101-b-wojcik", "userReview": "After reading this book (one of the few books I bother owning & storing on my shelf), I read the rest of Michener's historical novels. It's great the way he weaves history of whatever region he's writing about into the lives of people in that region through the ages. And it doesn't go too deeply into the mumbo jumbo lovey stuff like (a la \"Days of Our Lives\") but just the basic way of life from each generation, and how it affects future generations.This style also got me hoocked on Edward Rutherfurd (\"Russka\" and \"Sarum\", for example), after which I ran out of \"interesting\" historical novels to read & had to find another genre."}, {"userName": "Johnny", "userReviewDate": "Jan 13, 2011", "userURL": "http://www.goodreads.com/user/show/903066-johnny", "userReview": "Michener’s Poland: A Novel is primarily about three families in nine different ages. It was written during the height of the Solidarity movement in Poland and uses a fictional, but quite representative, conflict between Polish union organizers and Communist sympathizers as the bookends between which the rest of the historical fiction is racked. Even the struggle between the two families involved in the bookend conflict serves as framing for the conflicts within the book. It is not only epic in that it covers the history of a beautiful land from the 13th century to the 20th, but it is epic in that the historical lessons and comparisons in the early part of the book function as streams running into a great river of missed potential at the conclusion. Michener presents Poland as vulnerable, the Polish people as courageous and noble, and the political consequences of the combination as representing one missed opportunity after another. Yet, somehow, the land itself experiences resurrection as surely as that singular Resurrection in which their resilient Catholic faith continues to thrive (at least, when I visited Poland a few years ago, the Catholic churches were packed and I found the mass moving even though I only understood a few words in Polish and part of the Latin).Still, one needs a disclaimer about my inherent and very subjective bias with regard to epics. I like to have a character with which I can identify and empathize. It isn’t easy for me to transfer this virtual loyalty from one family member to another. Families, even my own, evolve so that children don’t have the same attitudes and values of the parents even as the parents try to inculcate such values. Michener’s families are no different. Sons are not as noble or strong as their fathers. Wives transfer their allegiance from one family or homeland to another. The transfer of leadership, power, and wealth is not always smooth or certain. Michener captures this realistically, depicting life as it is but failing to satisfy my desire that the protagonist triumph over each obstacle. So, in reading my remarks, bear in mind that I prefer uplifting results (I think I can tell you that the results of each era are a mixed bag without providing a spoiler) to equilibrium or tragedy. So, there were times I was thrilled with this epic and times when I was disappointed (or maybe even devastated). You’ll have to decide for yourself whether that is just me or if the book is missing some human ingredient binding these disparate stories together (other than obvious genetics within the families).The first four eras demonstrate how Poland was constantly under threat from four geographical areas, even titled after the four cardinal directions. So, after the bookend of the more modern struggle is placed, the first era covered is the 13th century and first threat is from the east. I wanted to resonate with the tales of the Tatar invasion and the Battle of Legnica (which I had simulated more than once in GMT’s The Devil’s Horsemen game), but the battle scenes were almost an anticlimax to the section. Henry the Pious was treated as a cardboard character, almost as cardboard as his counter in my war game. But I kept reading because I could see the author was setting up something else.The second era covered the threat from the west and the age-old premise for conquest. It starts in the 14th century and segues into the 15th to describe Poland’s enemies from the west (the once aligned, Teutonic Knights) who claimed the Polish people were unable to protect themselves. Under the guise of taking over territory for Poland’s own good, the Teutonic Knights began to muscle their way in and it took heroic efforts to reverse the trend. The good news is that the account of the Battle of Grunwald (Tannenberg) was extremely interesting but it seemed to this reader that the families through which the book was woven together had taken an extreme back seat to these historic events—although the battle scenes do demonstrate that Michener wasn’t afraid to kill off named characters as some authors hesitate to do.The third era covered the threat from the north. The 17th century section dealt with the Polish tradition of selecting a king from another nation in order to avoid having a dynasty and the resulting threat from a coalition of Sweden and Transylvania. Though some important points were covered and the descriptions of 17th century rural life were vivid, I felt like I was sleepwalking through most of this section.Naturally, the fourth era covered the threat from the south. Perhaps, the threat from Kara Mustafa and the Turks was the frightening and devastating since the Tatar invasion of the 13th century. The late 17th century proved to be a marvelous backdrop for the heroic defense and relief of Vienna and Michener masterfully uses this stage to set the foundation for other events.Most specifically, the book now segues into the partitioning of Poland between Austrian, Prussian and Russian control. The differences in culture and polity are explored and here, some of the family members become much more than cardboard. Motivations and aspirations (only vaguely assumed prior to this point in the book) are explored in juxtaposition with other ideas and aspirations. It is at this point and later, during the Nazi era that the book assumes its greatest humanity. We almost hear the incredible music of both Austria and Poland in the Viennese music scene and the conflicting styles of Mozart versus Chopin (if you will) reflect the conflict between ideas of governance and civilization. I also found myself caught up in the search for “proper” wives during this section of the book.By far the most humanly compelling, however, were the accounts of resistance and survival during the period of Nazi occupation. Having read autobiographical accounts of such experiences (most notably that of Corrie ten Boom, Viktor Frankl, and the semi-autobiographical Night by Elie Wiesel), these sections rang very true. I particularly resonated with one prisoner’s mental resilience and Michener let us visit the mental gymnastics necessary to stay alive in such a situation during that struggle. I also enjoyed the accounts of the partisans or Stork Commandoes (very vivid symbol considering my visits to Belarus—portions of which were once Poland – and seeing those ungainly birds fly). For me, though, the entire book could have been dedicated to the partisans and I wouldn’t have minded.Finally, the book considers the disintegration of the doctrinaire Communist system. The book leaves one with the idea that there is unfinished work to be done in Poland, but it, of course, stops short of Poland’s eventual triumph and the entry of the country into the European Union. If I didn’t know the real history behind the fiction, I would be most frustrated with the conclusion of the novel. Yet, I found that I could smile smugly and think to myself that the majestic country won.For me, one of the most memorable lines in the book was when the U.S. expatriate and daughter of the railroad and real estate magnate looked out the window of her palace and “…she saw for the first time that in a human life there were many ruins which remained, giving the landscape meaning, and that like the great river, life flowed on, coming out of the mountains, seeking the ocean of which it was a part. And everything one did entailed the creation of ruins and involved one in the implacable movement of the ongoing river.” (p. 379) I also loved this pithy line: “Never try to correct a national situation by a foolish personal act.” (p. 422)Would I have chosen this book if I hadn’t visited Poland and Belarus? I probably wouldn’t have. I’m not a fan of Michener’s work because the strokes are generally too broad to give me a cathartic vision of human possibility. In this case, though, the journey was well worth it. Not only did it put my own experiences in perspective, but it helped me relive an amazing experience as I observed this virtual experience."}, {"userName": "Chuck", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/3355947-chuck", "userReview": "WOW ! ! ! I haven't read a Michener novel in years but he still delivers the goods for me. Virtually all I know about the histories of Hawaai, South Africa, Afghanistan, and now, Poland I learned reading Michener. I even learned things I didn't know about the history of my home state of Texas from reading his novel, \"Texas.\" \"Poland\" covers the history of Poland from the the 13th century to the 1980s. I had no idea of the adversity faced by Poland down through the years. It's borders changed several times, usually as a result of military conflicts and the power grabbing of Germany, Russia, Austria and others. In fact, by the end of the 18th century there was no Poland. The book is not perfect, in my opinion, as I marked it down from five stars. It was slow in places and, at 600 plus pages, over long. But, if you are an experienced skimmer I heartily recommend it."}, {"userName": "Andrew Breslin", "userReviewDate": "Sep 07, 2014", "userURL": "http://www.goodreads.com/user/show/2716255-andrew-breslin", "userReview": "I was in Poland about 20 years ago, hanging out with two Polish friends, one of whom spoke three languages fluently, the other, five. We were having a fascinating conversation comparing humor across languages and cultures. I asked what subjects were targets of traditional Slavic levity, and they told me the most popular type of jokes usually poked fun at policemen and draconian government officials. This was just a few years after the collapse of the Soviet Union and its decades of oppression in the region, so this seemed entirely reasonable.\"What type of jokes do you make in the US?\" they asked \"Who do you make fun of?\"\"Um . . . blondes,\" I said. \"We make jokes about blondes.\"I didn't tell my two brilliant polyglot companions that we Americans-who are rarely familiar with more than one language and, frankly, have never read the instruction manual on the one we do have and have long since invalidated the warranty through gross misuse and negligence-have a bizarre affection for jokes about how Polish people are stupid.Being totally unfairly characterized as dimwits by far dimmer Americans is the least of Poles' worries though. The centuries of invasion, conquest and mistreatment endured by Poland is truly monumental, and Michener illustrates this sad and bloody legacy wonderfully. I kept turning the pages, late into the night, as hordes of more bellicose peoples overran them from the south, north, east and west. Turks, vikings, Teutonic knights, Nazis, Russians. The waves of invaders kept coming, generation after generation. As tragically fascinating as this history is, I might not have stuck with it were it not presented in the context of a consistent, richly evoked story. Writing a historical novel that spans generations is a tough trick. One can only develop any single character over the course of small section of the book, and by the next chapter he's been worm food for a century. But Michener manages to develop the nation of Poland itself as a single character. A spunky, lovable indefatigable rebel who refuses to be defeated, and who, incidentally, would have absolutely no problem whatsoever screwing in a light bulb all by herself."}, {"userName": "Teri-K", "userReviewDate": "Apr 21, 2016", "userURL": "http://www.goodreads.com/user/show/2524448-teri-k", "userReview": "This was my first \"real Michener\" - one of the long, serious books that covers centuries in an area's history. At first I thought I would love it, then around the half way point it bogged so much I wondered if I could finish. It picked up in the second half, but I still struggled in some sections. One problem I had is that Poland's history is frankly depressing. Apparently they were continually attacked by outsiders while suffering from poor leadership within. Frankly if Michener had invented Poland's politics I would have thought it ridiculous. What kind of country insists on electing only foreigners for kings? Who thinks giving any one man in Parliament a total veto is a good idea? Still, these features pale compared to the constant destruction of the country by it's neighbors. As for the writing, the people and place names required that I really pay attention. Yet, as soon as I figured out who was who the author would jump back to someone's grandfather and tell me all about them, leaving the earlier story hanging for many pages. That coupled with the fact that the dialogue was more speeches than conversation made this book very heavy going. Still, there's a lot of fascinating history and some good story telling in this book, if the reader can persist. 2.5 stars"}, {"userName": "Brandon", "userReviewDate": "May 22, 2014", "userURL": "http://www.goodreads.com/user/show/27223354-brandon", "userReview": "Ok, I'll go against the grain and say that this book was awful. Best-selling book of 1983? Yikes.It spans 800 years of history, which is ambitious to say the least, and I feel like Michener just couldn't pull it off.It felt like he wanted to tell the history of Poland without actually referencing, you know, sources, so he made it fiction and created a fictional area on the Vistula so he really didn't have to be accurate at all.Even that would have been fine if it were overpowered by fantastic, compelling characters, but the character development was nearly nonexistent. I think I maybe cared about three of them. In fact, I cared so little about the characters that I was actually glad when a few were executed just so I wouldn't have to read their storylines anymore.The only saving grace of this book - and the reason it got a second star - is that it did in fact give a good overview of Polish history. How accurate? I don't know - but I feel like I have a better understanding of the place now.But I'd rather have read an actual history book, which is sad since historical fiction is one of my favorite genres and I liked other books that attempt the same - notably Paris by Edward Rutherford which, despite its flaws, was a far more enjoyable read than this one."}, {"userName": "Katrina", "userReviewDate": "Oct 03, 2012", "userURL": "http://www.goodreads.com/user/show/1969587-katrina", "userReview": "I give up - I can't do it. This book is dreadful. I love historical fiction, and all I wanted was some good fictional characters to hook me into a very general overview of Polish history. I have Polish heritage and I visited the country 3 years ago, so I have a strong interest in the subject matter. This book failed to deliver in so many ways.These characters are barely even 2-dimensional; they speak nothing but stilted expositionese; they are not memorable or distinguishable from one another by anything even vaguely resembling personality; since I put it down a couple of weeks ago I struggle to name even one.The style, such as it is, is confusing. Sometimes it behaves like a history book, sometimes it lectures you about politics or political philosophy, sometimes the 'characters' lecture each other, and at others it weirdly drops into theatre dialogue. It is clunky and so very hard to read. The only thing I appreciated was the page or so of notes at the beginning that indicated which characters or events were fictional."}, {"userName": "Rob Rogers", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/58133181-rob-rogers", "userReview": "Every Michener novel is a full-course meal, and Poland is an especially nourishing one. Through a series of chapter-long vignettes, each of which takes place at a different point in history yet involves the same series of families, Michener captures both the nation's long history and the unique pressures from which it has suffered -- both from enemies without and conflicts within its social classes. His use research is phenomenal, describing a Tatar charge and a Chopin mazurka with equal skill and grace, and the simple repetition of his structure does not prevent him from investing his characters with humanity. The novel made me happy to be a reader, and proud to be Polish."}, {"userName": "Amy", "userReviewDate": "Mar 07, 2008", "userURL": "http://www.goodreads.com/user/show/360971-amy", "userReview": "I read this book when I was in college at the suggestion of a friend of mine who was serving as a missionary in Poland at the time. I had read some James Michener previously and would consider myself a fan. \"Poland\" completely blew me away because it once again made me realize how little history I know. Michener is known for being a good researcher and I am often taken in by the way he brings history to life. Poland has a rich and tragic history that is rarely considered important in world events, but so many important things in world history have touched on it. Anyone who wants to know the roots of many of the conflicts swirling in Eastern Europe would find \"Poland\" fascinating.A secondary but important note that I wanted to make about James Michener's books about history is the way that his story line differs from history textbooks, for example. I was born and raised in California and I am a religious person, myself, but when I was in high school, I felt like I was strongly discouraged to talk about my religious feelings. There was mention of religion in history in our classes, but my understanding is that public schools are less and less likely to even discuss religion in their history classes. We, as a society and as educated people are truly lying to ourselves if we think we can understand history without religion. Nations, politics, and people have orbited around the religion of their day for thousands of years. I appreciate Michener keeping that as a component of his histories. We aren't going to get the complete picture if we try to pretend religion didn't affect anything."}, {"userName": "Peter", "userReviewDate": "May 14, 2016", "userURL": "http://www.goodreads.com/user/show/8105776-peter", "userReview": "I thought this was a great read. One of the best experiences with a book I've ever had. I learned so much about Poland and about European history and politics. It contributed significantly to my education. But one thing bothers me: Who wrote it? Poland is nothing like Michener's other books. It was published in 1981, the same year as his novel Space hit the shelf and sold a ton. America barely took notice of Poland. On first reading both books, I thought that there was no way that the same person could have written both books in the same year. Space is terrible writing (the worst writing attributable to Michener). Now I'm not convinced that he wrote either book and its caused me to re-evaluate the authority of his whole bookshelf. Of course there would be a huge incentive for ghost writing to take place. Michener's name was a huge selling point in a booming publishing industry in the early 1980s. Its certainly suspicious that the two biggest selling names in the early 80s were Michener and King, and they both produced an astonishing number of titles in an impossibly short time, making a killing for the publisher (and themselves). Steven King has remarked that he doesn't remember writing some of the books he is supposed to have written, and we're all supposed to assume its because of the blow--what if its because he didn't write them? Maybe that's why they suck after all.So, who really wrote Michener's Poland? Is this person still alive? I feel that there is a great author who has gone unrecognized because he or she was a ghost writer."}, {"userName": "Rita", "userReviewDate": "Jun 15, 2008", "userURL": "http://www.goodreads.com/user/show/76512-rita", "userReview": "Since visiting Poland, I have wanted a way to absorb more Polish history, this book is a good way to do it.[James was reading it in Copenhagen and recommended it too.]Michener is not among the greatest of writers, one does not 'savor every sentence'.But he's a good storyteller and that keeps me reading.He stresses that the Poles have always resisted having a strong leader. It was a long long time before regional 'warlords' were willing to relinquish some of their powers to the central government. In western Europe this transfer happened a lot sooner. Michener does a good job of pointing out that what is good for one class [nobles] may be very bad for another class [tradesmen or farmers or craftsmen].I sense that Michener romanticizes in particular the violent episodes. He seems to see military men as heroes, which I find objectionable. On the other hand, when Jill and I were in Poland we got the distinct impression that a lot of Poles still today romanticize the violent episodes of their past, and have plenty of military heroes.Poland has indefensible borders [except the mountains along the southern border with Czech.]. So Russians and Germans or Prussians kept taking huge chunks of what today is called Poland. Borders kept changing."}, {"userName": "Wayne", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/1466146-wayne", "userReview": "This was often heavy going but perseverance always wins the day with Michenerbecause he is always so dedicated to his readers and to the topic he wants to share.Borderless Poland has always been prey to its surrounding neighbours or even some enemywho may just be in the vicinity or has travelled from afar looking for greener pastures eg Genghis Khan.No broad river, no mountain range protects it or makes entrance difficult.Then you have the Poles themselves, especially the Rich and Powerful,whose politics are seldom to be admired and who do not wish to share power.Here we are privy to about 8 centuries of to and froing, to treachery and to stupidity,which always repeats the tale of invasion and devastation and recovery in a continual cruel cycle.The latest has been the Russian/Nazi invasions of WWII, and then the Communist takeoverwhich finally and deservedly fell.Poland is now enjoying another gasp of Freedom and Fresh Air...but in the light of its history we can only wish them well and enjoy it while you've got it, because it never seems to last long.Putin's recent invasion of the Ukraine, his blantant lies and sheer disregard for human life and decent behaviour means ANYTHING is possible."}, {"userName": "Samira", "userReviewDate": "Aug 28, 2012", "userURL": "http://www.goodreads.com/user/show/11171429-samira", "userReview": "Really interesting book about Polish history spanning centuries. Makes you in turn marvel at the stupidity of the Polish magnates, shake your head at strange occurrences and wonder why you never heard about such important events in European history before. Educating and informative read.It also has a rather good introduction explaining exactly what is historically accurate and what part is fiction. Very good and obviously well-researched book.However, one should have a fairly good knowledge about European history in general beforehand. The larger context is not explained, it is assumed that the reader knows about the happenings in other countries at the respective time.Also western-style capitalist democracy is markedly favoured when compared to any of the other possibilities explored throughout Polish history. This often comes across as preaching a doctrine more than stating a logical and well-founded opinion. It makes the book seem heavily biased and containing a US-American point of view rather than the objective historical account it otherwise tries to be."}, {"userName": "Becky", "userReviewDate": "Nov 14, 2012", "userURL": "http://www.goodreads.com/user/show/4435051-becky", "userReview": "Towards the end of the book, Bukowski asks the bishop how he gained the courage to survive Auschwitz. The bishop realizes that what the younger man has wanted to ask was 'How did we gain the courage?\" The bishop says: \"Character is the sum of all we do before the age of twenty. You did certain things in those formative years which made you brave and durable.\" The bishop goes on to tell what he did in his formative years that determined his character and made him able to withstand the abuse of Auschwitz. While at this time, there are no concentration camps staring us in the face here is America, the facts of character building are the same. I do not think I have ever read a more persuasive argument for mothers to stay home with their children than this one. Children will gain character in their formative years, which I think goes on until 20 years of age. Who do you want to be the one to guide your child?"}, {"userName": "Jane", "userReviewDate": "Aug 04, 2012", "userURL": "http://www.goodreads.com/user/show/4877469-jane", "userReview": "This was my first Michener read, and I thought it was excellent. I am only sorry I did not have a chance to finish it before my recent trip to Poland, although am glad to have read it regardless. It seemed a cross between War & Peace (historical fiction covering the lives of many E. European families through generations, with intense battle scenes, romance, etc.) and a David McCullough history (similar straight-forward and very readable writing style). I have read another review here on Goodreads suggesting the history is debatable, and I do not know enough to agree, although I did find that Michener's figures on deaths at Majdanek are different from those generally accepted today. Nonetheless, details like that aside, I was confident the overall history was good, it gave me a huge appreciation for Poland and its people, and I found the story very gripping."}, {"userName": "Lauren", "userReviewDate": "May 30, 2008", "userURL": "http://www.goodreads.com/user/show/786673-lauren", "userReview": "I really enjoyed this book. It's a mixture of history and sheer fiction. It's rather easy to tell which belongs to which category. You follow three main families from the three historical strata of Polish life through hundreds of years. The individual people are not, in themselves, important to the book. They're tools to show what some of the experiences of people may have been during certain eras. It's definitely not a history book, so read it keeping that in mind. That being said, you get some interesting broad historical strokes from the 9th century until the Solidarity movement. It's really interesting to read about Michener's conception of communism's effect upon Poland while it was still under its grasp."}, {"userName": "Elena", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5309983-elena", "userReview": "This was, for me, a really good way to learn the history of a country that I never could quite understand. An actual history book would have been entirely too dull, and anyway I have learned that history is often subjective. Speaking of which, this author definitely does not depict the Poles of the WW2 area as the raving anti-Semities that I have learned about. I decided though, that this is only logical, because the book is meant to highlight the patriotism and resilience of the Polish people. Overall it was very good, and I learned a lot."}, {"userName": "Katie", "userReviewDate": "Jun 23, 2013", "userURL": "http://www.goodreads.com/user/show/15891784-katie", "userReview": "This book is amazingly powerful. It was recommended to me by a family friend when I returned home from vacation in Poland a few years ago (I'm Polish in heritage & most of my family still lives there). I just got around to reading it and wow. I don't want to give anything away, but I haven't had that many emotions through a book in a long time. I found the end to be especially powerful. And of course it made me proud to be Polish (:"}, {"userName": "Joanna", "userReviewDate": "Feb 18, 2011", "userURL": "http://www.goodreads.com/user/show/4911592-joanna", "userReview": "I just can`t finish this very ....very boring book....I can`t understand why any one would like this book ????? There is just no story to it ...feels like I`m in 5 th grade history class about Poland ...wait..wait....my class was definitively more interesting 1000 times than this big blab of BLAH...BLAH...BLAH....Read something better than this !"}, {"userName": "Duane", "userReviewDate": "Nov 08, 2013", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "Next to Hawaii, my favorite James Michener novel. The history of a country and a people that is riveting, often brutal, set as a backdrop to one of Michener's compelling fictional stories. You can't come away from a Michener novel and say, \"I didn't learn anything\". If you love history, especially European history, this one's for you."}, {"userName": "Wanda", "userReviewDate": "Oct 09, 2010", "userURL": "http://www.goodreads.com/user/show/3229870-wanda", "userReview": "Too many words. The chapters were really, really long. Actually I think that he meant for them to be parts (e.g. part I, part II etc.) rather than chapters. The paragraphs were interminably long as well. I got lost in the tedious details. Definitely did not draw me in the way that Hawaii did. This was a real disappointment."}], "description": "Like the heroic land that is its subject, James Michener's Poland teems with vivid events and unforgettble characters. In the sweeping span of eight tumultuous centuries, three Polish families live out their destinies and the drama of a nation—in the grand tradition of a great James Michener saga.", "title": "Poland", "url": "https://www.goodreads.com/book/show/769896.Poland", "average": 3.98, "cover": "https://images.gr-assets.com/books/1390946842l/769896.jpg", "reviews": 423, "authors": [{"url": "https://www.goodreads.com/author/show/7995.James_A_Michener", "name": "James A. Michener"}], "type": ["Historical", "Fiction", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/769896.Poland", "http://www.goodreads.com/book/show/1107604.Poland", "http://www.goodreads.com/book/show/1829078.Poland", "http://www.goodreads.com/book/show/22292805-poland", "http://www.goodreads.com/book/show/13559192-poland", "http://www.goodreads.com/book/show/12658.Hawaii", "http://www.goodreads.com/book/show/12657.The_Source", "http://www.goodreads.com/book/show/133430.Centennial", "http://www.goodreads.com/book/show/12661.Chesapeake", "http://www.goodreads.com/book/show/12663.The_Covenant", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}