{"ratings": 77, "userreviews": [{"userName": "Kate Olson", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/13650342-kate-olson", "userReview": "Thanks to the publisher for this review copy! This is a sweet and magical story that is perfect for grades K-2 - it's intended for a young audience and would be a great read aloud for kiddos just starting to be ready for them, as well as a great beginning chapter book. The illustrations are adorable and I love the illustrations and lists sprinkled throughout the book. This looks to be a promising start to a new series.Highly recommended for the early chapter book readers of the world, and for grade 1 and 2 classrooms and libraries!"}, {"userName": "Carrie Gelson", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/7296879-carrie-gelson", "userReview": "This is a real winner for students ready for the longer transitional chapter titles like Ivy and Bean. Full of magic, humour with a focus on the power (quite literally in this case!) of writing. Lovely, true to life family dynamics. Excited to include this series in my classroom collection."}, {"userName": "Ms. Yingling", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/2636606-ms-yingling", "userReview": "E ARC from Edelweiss PlusSince my students have been reading a lot of Judy Moody, I am always looking for beginning readers that appeal to middle school students. I don't think this one would work for my students. A little too goofy (Ms. Hairball is a teacher) and young. Definitely investigate for elementary school."}, {"userName": "Lori", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/52033869-lori", "userReview": "By: Aurelia and Tasman (ages 6 and 8) It only took us one day to finish reading Polly Diamond. It was a Friday in November and we were home from school for a PD Day. Mom read us chapter after chapter. We all agreed that it was a cool book and we would like to read it again soon. At first, the book sounded very familiar – like Owl Diaries or Ivy and Bean, but once the magic book arrived, the story went in an amazing direction of its own – a fun-filled, dancing armadillo, sibling-rivalry, boring babysitter, club sandwich, chess-board floor and perfect house direction that kept us asking mom to read another chapter. We really liked Polly herself. We liked ‘hearing’ her thoughts. We liked how she described her teacher, Ms. Hairball. We also liked how she didn’t panic went things went wrong. She was devious, intelligent, creative and more, but she also realized the importance of fixing her mistakes. Our mom is forever making us put things right and now we know why. We laughed out loud at the list of “Names NOT to Call Your New Baby Brother” and at “Anna is a banana.” We groaned at everything about Shaylene, and we secretly wanted the magic book to come and help us with some renovations at our house. We learned that writing can be fun and infuriating. We learned about how to choose our words carefully. And now we are attacking our mom’s occasional word salad with a vengeance. We can’t wait to read about more adventures of Polly and the magic book. Thank you for this wonderful story."}, {"userName": "Aubrey Marie", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/52824695-aubrey-marie", "userReview": "This ARC was given to me by Netgalley in exchange for an honest review. This was a super cute and fun book. Polly gets a new book that makes what she writes come true and she has an adventure with the book . I think this book will quickly become a favorite among teachers and kids. I will definitely be buying it for my classroom when it comes out! I absolutely loved it!"}, {"userName": "Wendi Lee", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/30649545-wendi-lee", "userReview": "This is an adorable book about Polly and a magical book that grants her her wildest dreams!Polly and her little sister, Anna, are going to have to share a room because their baby brother is about to be born. Polly thinks her house is too small and crowded, so when she finds the magic book, she wishes for bigger, better, and more fantastical things. But she soon realizes that her family (and house) might be perfect just the way they are. It's a sweet chapter book filled with cute illustrations. I also loved Polly's imagination! I will definitely get a physical copy for my daughter, I think it's a book she'll enjoy when she's older. Thank you to Chronicle Books and Netgalley for an ARC."}, {"userName": "Lisa", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/148710-lisa", "userReview": "A delightful book! Wouldn't everyone want a magic book? One that......(no spoilers)Polly loves words and writing and imagining things.When she receives a magic book, what an adventure ensues!A very cute and fun read.Polly loves words. And she loves writing stories. So when a magic book appears on her doorstep that can make everything she writes happen in real life, Polly is certain all of her dreams are about to come true. But she soon learns that what you write and what you mean are not always the same thing! Funny and touching, this new chapter book series will entertain readers and inspire budding writers"}, {"userName": "Alyssa Drake", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/34471825-alyssa-drake", "userReview": "A cute, whimsical story about a girl who is dealing with the arrival of a new baby through the use of her imagination and a magic book, very imaginative. Perfect for younger children. I loved the subtle humor in Ms. Kuipers voice too, it made the story more enjoyable for me as well."}, {"userName": "Krystal B §Modest reader§", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/72492099-krystal-b-modest-reader", "userReview": "This book follows a little girl named Polly who goes on an adventure with a mysterious book she receives that can not only write back answers to her but can basically make a whole bunch of magical things happenI rated this a 4 out of 5 stars overall for the following reasons:What I liked: I liked how the book starts off super positively. Characters had fun names like Polly Diamond and Mrs. Hairball. I love that the book teaches you about similes, hyperboles, alliterations, & other grammar and language lessons while simultaneously making it fun. I like that the book includes names of other popular middle-grade literature for reference to the kinds of things the main character Polly likes to read. I do like that Polly has a vivid imagination and that it teaches children that it's ok to use your imagination.What I didn't like about it:In places, it went from one idea to the next out of nowhere and with no segue. I didn't like that everything in the book worked out so perfectly good. There was too much magical realism that I feel a middle-grade child wouldn't necessarily understand. Would I recommend or allow my middle-grade child to read this?:Yes, absolutely without a doubt I would allow him and even recommend him to read this book because over-all I thought it was very well written, enjoyable and extremely fun to read!********** I normally do not give out 5 stars for middle-grade books as a general rule, however, there are instances where I actually will give a 5 star to a middle-grade book but they would have to completely over the top wow me. That being said this was an arc I received by net galley in exchange for my honest review. ************"}, {"userName": "~Krystal", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/6766801-krystal", "userReview": "This book follows a little girl named Polly who goes on an adventure with a mysterious book she receives that can not only write back answers to her but can basically make a whole bunch of magical things happenI rated this a 4 out of 5 stars overall for the following reasons:What I liked: I liked how the book starts off super positively. Characters had fun names like Polly Diamond and Mrs. Hairball. I love that the book teaches you about similes, hyperboles, alliterations, & other grammar and language lessons while simultaneously making it fun. I like that the book includes names of other popular middle-grade literature for reference to the kinds of things the main character Polly likes to read. I do like that Polly has a vivid imagination and that it teaches children that it's ok to use your imagination.What I didn't like about it:In places, it went from one idea to the next out of nowhere and with no segue. I didn't like that everything in the book worked out so perfectly good. There was too much magical realism that I feel a middle-grade child wouldn't necessarily understand. Would I recommend or allow my middle-grade child to read this?:Yes, absolutely without a doubt I would allow him and even recommend him to read this book because over-all I thought it was very well written, enjoyable and extremely fun to read!********** I normally do not give out 5 stars for middle-grade books as a general rule, however, there are instances where I actually will give a 5 star to a middle-grade book but they would have to completely over the top wow me. That being said this was an arc I received by net galley in exchange for my honest review. ************"}, {"userName": "Barbara", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/1222379-barbara", "userReview": "When aspiring writer Polly Diamond finds a book that makes everything she writes actually happen, she's thrilled at first. But the book takes everything she says and then writes literally, which causes some problems, including her sister becoming a banana. The book misunderstands her use of certain words too, which causes frustration but also amusement; for instance, when she is hungry and wants a club sandwich, the book delivers two pieces of bread wrapped around a club, and then a card with clubs on it for its next attempt. The word play and confusion make the book funny and a good title to use to demonstrate to budding writers about the precision of words and what writers write. Of course, this is all over the top as things get increasingly crazy until Polly's teacher, Ms. Hairball (!) arrives with the news that the sisters have a new baby brother. There are plenty of illustrations to add to the fun. I would share this with second or third graders since it offers some reading challenges but isn't so hard to read that they'd become frustrated. They'll like the glitter on the cover that seems to indicate there's something special inside too."}, {"userName": "Kadie Hayward Mullins", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/76010861-kadie-hayward-mullins", "userReview": "@kidlitexchange #partner This charming story is perfect to read aloud or starter chapter book. Perhaps best for the 8 and under crowd, I do think slightly older children and whimsical adults would find this magical adventure equally enjoyable. Polly Diamond’s imagination comes to life when she receives a mysterious package in which a magic book is enclosed. Dealing with the arrival of a new sibling and the energy of little sister, Anna, Polly is enamored with her new book that can take her ideas and turn them into reality – from turning Anna into a literal banana and her ‘aquarium blue’ paint into an actual aquarium. I particularly enjoy the love of language and writing interspersed throughout the story that gives a very subtle lesson to readers about grammar. As Polly might say, it is “fantabulous!” My 4 year old daughter says “it was a funny and silly story. I liked it a lot and it made me laugh!” Thank you to the @kidlitexchange network for the review copy of this book. All opinions are my own."}, {"userName": "That One Librarian", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/32824895-that-one-librarian", "userReview": "Polly Diamond is a wordsmith. She. Loves. Words. When she discovers a book that can not only write back to her but alter reality, she begins to change her room, her house, even her little sister! Only some very clever writing can return her life to \"normal\" again. Polly Diamond and the Magic Book is the first in a planned series of transitional chapter books. Polly is biracial, though her ethnicity is never discussed in the text. As Polly is particularly fond of words, she discusses similes, prefixes, and many other parts of speech. While it is clear that Polly is meant to teach about language in general, the book is still funny and engaging enough to be read without the grammar agenda. Sweet illustrations on every page in combination with the writing will remind readers of Ivy + Bean. Educators should note that a Common-Core Aligned Teacher Guide is available from the publisher. Recommended!"}, {"userName": "Kathleen", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/44240720-kathleen", "userReview": "As Polly might say: fantastic, terrific, phenomenal! I can't wait to read this one with my granddaughter. When Polly writes in her magic book, whatever she writes comes true. It's so much fun because like the Amelia Bedelia books, her magic book takes her ideas dictionary definition literally. I love the part where she writes that her walls are aquarium blue and then her sister can pull a fish right out of the wall when she comes in.The illustrations really warm the pages and make a great story even greater as it comes to life even better than a graphic novel filling the pages as they flow through the words. You nailed it, ladies, it's perfect.The book is didactic in parts, explaining alliteration, for example, but in a chatty, playful way.I highly recommend this one. I hope I get to read more about Polly in the future. (I received an advanced reader's copy in a goodreads giveaway.)"}, {"userName": "michelle", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/73983-michelle", "userReview": "* Thank you to NetGalley for a digital ARC of this book. All opinions are my own.For my full review, please check out my blog.A very fun transitional chapter book aimed at kids K-2 who are really starting to get comfortable reading on their own. It not only is a fun book encouraging children in the early years of their reading adventures, but it encourages children to write and be creative. Win-Win in my book. My 7 year old read it and absolutely adored it. Kids will really enjoy the way words really have a variety of meanings and realize how important it is to say what you actually mean. The fun black & white pictures help keep them entertained and bring the story to life. A definite winner for kids ready to read slightly longer books."}, {"userName": "Shelley Thompson", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/48141289-shelley-thompson", "userReview": "Polly Diamond and the Magic Book has fun story line and cute illustrations. A magic book appears at Polly's door. She discovers that everything she writes will come true. She likes to make lists like her favorite books and names for her new baby brother. While her mom is at the hospital, Polly turns her little sister into a banana, her house \"perfectly palatial\", and more crazy antics. Then, she'll hungry and the book can't make food the right way so she decides she wants everything back to \"normal\" just in time to find out she has a baby brother. This book is a good idea, but all over the place. Author jumps from one thought to the next without true segues while adding in more tidbits to up the excitement. Could be a little confusing for a new reader."}, {"userName": "Meredith", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/66715033-meredith", "userReview": "Polly Diamond loves the English language and is loquacious in her written conversations with her magical spell book. The things she does not love include: her tiny house, sharing a room with her little sister, and names for her new baby brother that are not Basil. When a magical notebook arrives that writes back to her, imagine the benevolent version of Tom Riddle's diary from Harry Potter, and brings her imaginative stories to life high-jinks ensue. I would recommend this book for readers transitioning from easy readers to chapter books. Fans of Fancy Nancy will appreciate the vocabulary words Polly uses. Parents and teachers will like the grammar lessons.I received an ARC of this book from Net Galley in exchange for an honest review. Thanks Net Galley!"}, {"userName": "Sharon May", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/8316750-sharon-may", "userReview": "Thanks to NetGalley, Chronicle Books, and Alice Kuipers for the opportunity to read and review this adorable chapter book!Polly Diamond is a young girl whose mom is expecting a new baby, requiring Polly to share a room with her sister, Anna. Polly gets a magical book that makes everything that she writes come true - which means that Polly has to be very specific about what she asks for. A club sandwich could be a literal sandwich with a club in it, for example! This is such a cute book with a wonderful message too about language and the magic of words. Illustrations are adorable and young children would love all the magical things that Polly makes happen."}, {"userName": "Darcysmom", "userReviewDate": "Dec 11, 2017", "userURL": "http://www.goodreads.com/user/show/5434885-darcysmom", "userReview": "I received an ARC of this book from Netgalley for free in exchange for an honest review.I had high hopes for Polly Diamond and it didn't quite live up to them. I loved that Polly was a precocious little girl who loved words and books and making lists. I loved that she found a magic book that allowed her imagination to come to life. Despite all that I loved about the book, it didn't do enough for me - where it should have sparked the reader's imagination and encouraged flights of fancy, it left me flat. I think it has potential to be very enjoyable for a younger reader - I can't imagine it appealing much beyond second grade."}, {"userName": "❇Critterbee ", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/42804965-critterbee", "userReview": "Cute, humorous , and magical - a great beginning to a series which looks able to go just about anywhere a child's imagination would want to go. Polly is very likable, and her family members are funny, patient and loving.Polly Diamond loves words, and loves to write. One day, Polly receives a book and quickly learns that it is quite a special book - it is a MAGICAL book! And then the adventures begin!The illustrations are cute. The situations will give your child's imagination a workout. I that Polly used the words, and explained the ideas clearly, alliteration and metaphor.Very nice, I look forward to introducing this to chapter book readers.*eARC Netgalley*"}, {"userName": "Lori", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/68171860-lori", "userReview": "Polly Diamond and the Magic Book by Alice Kuipers was a fun imaginative read. I love that this books includes her thoughts about Mom's huge tummy and Mrs. Hairball. It's neat to learn a new recipe and see how Polly paints her room to look like an aquarium. I believe children will be drawn to learning about Polly adventures.The story was an easy read with adorable illustrations, making it fun to learn about writing and words through Polly's new magical journal.Reviewed for Net Galley"}, {"userName": "Amber Webb", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/66026760-amber-webb", "userReview": "Polly Diamond by Alice Kuipers was a quick, funny, engaging read. I can see how young children will be drawn to Polly and her wild journal calamities. Kuipers does a wonderful job including vocabulary development, imagination and factual information in her young readers novel. The story was easy to read, but had new and challenging words spread throughout. I think that readers of all kinds will enjoy diving into Polly's world with her magical new journal. This book made me wish for my own magic book!"}, {"userName": "Lisa", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/5688087-lisa", "userReview": "Whatever Polly writes in her new turquoise leather notebook comes true. She becomes invisible, turns her little sister into a banana, and makes her house into one that is much bigger. Polly learns that what she writes is not always exactly what she wants. As a teacher, I loved Polly's character because of her imagination and love of words and writing. This is a transitional chapter book for readers who like magic, imagination, and a little bit of silliness."}, {"userName": "Tracy", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/2994907-tracy", "userReview": "Thanks to the publisher for the review copy. All opinions are my own. This book fills a huge bookshelf hole! A diverse, illustrated early chapter book! People are always asking me for recommendations, and now I can recommend POLLY DIAMOND.Polly is a brilliant mixture of fun, creativity, imagination and just a little bit of mischief. Recommended for new readers aged K-2, and it's great as a read loud, too!"}, {"userName": "Ampersand Inc.", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/16575304-ampersand-inc", "userReview": "One day Polly Diamond receives a mysterious package in the mail – a turquoise journal – turquoise is Polly’s favourite colour. Polly loves words so she begins to write stories in her new book and then magically those stories become real. This is such a fun and entertaining Chapter book. With B&W illustrations."}, {"userName": "Athina Semertzaki", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/60929479-athina-semertzaki", "userReview": "* A received an ARC for this book from Netgalley*This book is very very good! It would be perfect for any child. The story of Polly Diamond and her magic book is cute and funny. The way her adventures are described is incredible and you also enter in a magic world as Polly does. It is a good start for a series of Polly's adventures. The illustrations are also very good.I can't wait for the finished copy."}, {"userName": "jaslyn", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/79688581-jaslyn", "userReview": "A present from my sister's teacher on the annual Popcorn and Poetry day :) This was a very sweet and quirky story (an aquarium on your walls! Piano key stairs! Sibling shenanigans! And of course - books) that I think any kid will love."}, {"userName": "A.C. Paige", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/1536210-a-c-paige", "userReview": "***I received an ARC from Chronicle Books***Everything Polly writes in her magic book comes true. She wishes for all kinds of wacky things, but doesn’t always quite get what she asked for. She has to be detailed enough when writing. This book is about family and appreciating things as they are."}, {"userName": "Becky", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/9959458-becky", "userReview": "Cute book! Polly Diamond loves words and stories but her creative writing creates a bit of havoc in her home. A wonderful first chapter book for readers filled with detailed illustrations sprinkled throughout the story.Releases May 2018 Chronicle Books"}, {"userName": "Steph", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/2612079-steph", "userReview": "Magic, siblings, and lots of super sweet parts to the story. Would be cute for 1st-3rd grade readers!"}], "description": "Polly loves words. And she loves writing stories. So when a magic book appears on her doorstep that can make everything she writes happen in real life, Polly is certain all of her dreams are about to come true. But she soon learns that what you write and what you mean are not always the same thing! Funny and touching, this new chapter book series will entertain readers and inspire budding writers.", "title": "Polly Diamond and the Magic Book", "url": "http://www.goodreads.com/book/show/36204764-polly-diamond-and-the-magic-book", "average": 3.94, "cover": "https://images.gr-assets.com/books/1508341099l/36204764.jpg", "reviews": 44, "authors": [{"url": "https://www.goodreads.com/author/show/149625.Alice_Kuipers", "name": "Alice Kuipers"}, {"url": "https://www.goodreads.com/author/show/15277737.Diana_Toledano", "name": "Diana Toledano"}], "type": ["Fantasy", "Childrens", "Childrens", "Language", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/36204764-polly-diamond-and-the-magic-book", "http://www.goodreads.com/book/show/256003.Life_on_the_Refrigerator_Door", "http://www.goodreads.com/book/show/13037601-40-things-i-want-to-tell-you", "http://www.goodreads.com/book/show/7091735-lost-for-words", "http://www.goodreads.com/book/show/25674388-violet-and-victor-write-the-most-fabulous-fairy-tale", "http://www.goodreads.com/book/show/24282941-violet-and-victor-write-the-best-ever-bookworm-book"]}