{"ratings": 51, "userreviews": [{"userName": "Alex (not a dude) Baugh", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/4449236-alex-not-a-dude-baugh", "userReview": "It's almost Chinese New Year, and PoPo has come all the way from China to celebrate with her Chinese American granddaughter. And as her granddaughter learns, there is a lot to do to get ready for the New Year celebrations. There's cleaning, washing, and cooking, red and gold decorations be made and hung up, including a sign the says Fu - but remember hang it upside down to mean luck has arrived.When the New Year finally arrives, PoPo, her granddaughter and little grandson first make an offering to their ancestors, then get dressed in their new red clothes. And then there are yummy almond cookies to eat (I loved these as a kid and still do) and off to the big dragon parade, where they throw tiny firecracker snaps to chase away the evil spirits. All this is followed by a red and gold lucky envelope with crisp new money in it.PoPo's Lucky Chinese New Year is a sweet intergenerational story. Having grandmother come from China makes the learning experience for her granddaughter all the more fun and important. Cultural beliefs and rituals are often handed down from one generation to another, but this brings the meanings so much closer to the (unnamed) Chinese American granddaughter, as sometimes ritual is observed, but the reasons for them can get lost.The story isn't particularly text heavy, and I think readers may find the explanation for each ritual, which is done in yellow against a strip of red at the bottom or top of the page, very interesting, without being overwhelming, nor do they interfere with the story. The pencil and watercolor illustrations are homey, warm and inviting. They really capture the little girl's different moods as the family get ready for New Year; after all, sometimes it is just hard work, but other times it is so much fun; sometimes baby brothers are pests, and other times, they are cuddly. As much as I enjoyed reading about why things are done for the New Year, I was a little thrown off by the fact that the girl and her baby brother weren't named. Also, I am so used to hearing Mandarin that the Cantonese threw me off at first. For example, I think of lucky money as hongbao not lai see. But in fact, most Chinese people in the United States are Cantonese, so it made sense in the end.PoPo's Lucky Chinese New Year is an excellent way to teach all young readers, regardless of whether they are Chinese or not, about this most significant celebration in the lunar calendar, while stressing the importance of family, and especially grandparents, for connecting kids to their past and their culture.At the end of the book, you will find instructions for making a Chinese pellet Drum to make some noise and help chase away the evil spirits.This book is recommended for readers age 4+This book was purchased for my personal libraryThis review was originally posted at Randomly Reading"}, {"userName": "Shiloah", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/973558-shiloah", "userReview": "In time for Chinese New Year, this is a fun book! The kids are making plans to do many of the suggestions."}, {"userName": "Margaux", "userReviewDate": "Mar 16, 2017", "userURL": "http://www.goodreads.com/user/show/15663450-margaux", "userReview": "Honestly the best Chinese New Year book we have in the library. I'd definitely recommend this title. A little girl explains the traditions that surround Chinese New Year within her family."}, {"userName": "Alyssa Gudenburr", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/58206712-alyssa-gudenburr", "userReview": "A beautiful book about the traditions of the Chinese New Year."}, {"userName": "Angie", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/5317525-angie", "userReview": "Finally a decent Chinese New Year book besides Lion Dancer!"}, {"userName": "Amy Lafleur", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/8780954-amy-lafleur", "userReview": "A little girl tells the story of how she and her family celebrate Chinese New Year. Chinese New Year is a major holiday, described by the little girl as \"like Thanksgiving, Christmas, and New Year's Day all bundled together.\"Grandma PoPo comes to visit from China and teaches the little girl about traditions. Readers learn alongside her young granddaughter how to celebrate and make sure that the family has good luck through customs, rituals, and cooking - captured in many illustrations. Facts appear on red ribbons in the format of \"do...\" or \"do not\" in order to gain good luck for the new year. The book also contains instructions for making a Chinese pellet drum. Entertaining and informative book. I learned a lot about how to celebrate Chinese New Year."}, {"userName": "Elizabeth", "userReviewDate": "Dec 23, 2016", "userURL": "http://www.goodreads.com/user/show/489381-elizabeth", "userReview": "This feels a bit text-heavy, so I'm not sure what age it's targeted at, but it does a nice job of weaving together preparation for and celebration of Chinese New Year (red text along the top or bottom of the page explains the superstition the protagonist's grandmother [PoPo] is referring to on a given page) with the protagonist little girl's relationship with her brother -- you sweep the bad luck out the back door, and she tries sweeping out her baby brother as well; but the number 4 is bad luck, and her baby brother has 4 teeth, so she draws an extra tooth which she tapes to his diaper even though her grandmother says evil spirits will make an exception for baby teeth."}, {"userName": "Rebecca Gomez", "userReviewDate": "Dec 10, 2016", "userURL": "http://www.goodreads.com/user/show/22527440-rebecca-gomez", "userReview": "A very informative introduction to the Chinese New Year."}, {"userName": "Melanie", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/2454471-melanie", "userReview": "This book tells the story of a girl who not only learns about the traditions of Chinese New Year, but also learns to accept her baby brother. Very sweet."}, {"userName": "molliekay", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/5042557-molliekay", "userReview": "Here's a little girl who needs to stop being so much of a brat to her baby brother. Jeeze!"}, {"userName": "Kelly", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/1947828-kelly", "userReview": "What a wonderful way to teach and learn about the traditions of the Chinese New Year."}, {"userName": "Sheri", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/1412187-sheri", "userReview": "Great resource story for Chinese New Year in January or February of each year. Missing the calendar of years and the animals that match up but fun story and reason for each custom."}, {"userName": "Christine Turner", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/1171422-christine-turner", "userReview": "When her Chinese grandmother comes to visit, a young Chinese-American girl learns of and participates in the customs and beliefs celebrating an authentic Chinese New Year.The family works towards actions that they believe will preserve \"luck.\"Subject: Chinese New Year -- Juvenile literature.Chinese American children -- Juvenile literature.Grandparent and child -- Juvenile literature.Grandmothers -- Juvenile literature."}], "description": "When her Chinese grandmother comes to visit, a young Chinese-American girl learns of and participates in the customs and beliefs celebrating an authentic Chinese New Year.", "title": "PoPo's Lucky Chinese New Year", "url": "http://www.goodreads.com/book/show/33856855-popo-s-lucky-chinese-new-year", "average": 3.86, "cover": "https://images.gr-assets.com/books/1484412157l/33856855.jpg", "reviews": 13, "authors": [{"url": "https://www.goodreads.com/author/show/14185744.Virginia_Loh_Hagan", "name": "Virginia Loh-Hagan"}, {"url": "https://www.goodreads.com/author/show/4456317.Renn_Benoit", "name": "Renné Benoit"}], "type": ["Childrens", "Holiday", "Childrens", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/33856855-popo-s-lucky-chinese-new-year", "http://www.goodreads.com/book/show/29064301-popo-s-lucky-chinese-new-year", "http://www.goodreads.com/book/show/29005904-popo-s-lucky-chinese-new-year", "http://www.goodreads.com/book/show/27983435-babysitters-club", "http://www.goodreads.com/book/show/35586273-adorable-animal-friendships", "http://www.goodreads.com/book/show/30776234-poseidon", "http://www.goodreads.com/book/show/25987764-mortician", "http://www.goodreads.com/book/show/39683599-athena"]}