{"ratings": 527, "userreviews": [{"userName": "Lori", "userReviewDate": "Feb 20, 2010", "userURL": "http://www.goodreads.com/user/show/369169-lori", "userReview": "Thanks to HarperPerennial for sending me this review copy of \"Postcards From a Dead Girl\" by Kirk Farber.I was not really sure what to think when I first saw the cover of this novel - with it's lone man standing in an apartment window watching postcards rain down from the sky. But after reading the first few paragraphs, I knew I had a great little book in my hands.I'm a sucker for a fucked up lead guy. And oh boy is Sid fucked up. Here's his deal: He currently works as a telemarketer for a travel agency. He's a hypochondriac who is so obsessed with mud baths that he trys to recreate one in his own backyard. His dead mother talks to him through a 1967 bottle of wine. And he is receiving one year old postcards of exotic locations from his deceased girlfriend in the mail. He is unravelling fast, and while his sister attempts to hold him together at the seams, even she can't save Sid from completely falling apart.Witty. Humorous. Strange. Tragic. Farber's book is all of these things and more, and sometimes all at the same time. It's one of those storys where you wish you crawl inside the text, inside where the characters are living, and shake some sense into them. Help them to get the closure they need in order to quit making such a mess of thier lives and begin the long journey of moving on. Speaking of closure... The postcards were the one thing I never got any closure on. Read the book to find out what I mean. And maybe we can discuss your take on them. After all, the entire story circles around those darn little peices of paper!"}, {"userName": "Katie Parker", "userReviewDate": "Apr 03, 2011", "userURL": "http://www.goodreads.com/user/show/1731180-katie-parker", "userReview": "I’ll admit, I decided to read this solely because Marc Johns did the book cover. Anything he collaborates on has to be awesome, right? Well, in this case, that turned out to be true.The book is about a guy named Sid, who works as a telemarketer for Wanderlust, a travel agency where his overly enthusiastic boss drives him crazy. He lives alone in his childhood home with his dog Zero and constantly calls his sister Natalie, a doctor, to tell her that he thinks he has a brain tumor. In fact, he’s sure of it. All the while, he’s receiving postcards from foreign cities, sent by his former girlfriend Zoe, who has been missing for more than a year, and is probably dead. What’s more, the postmarks on the cards are all dated around the time when she went missing. Sid decides to find out what could cause such a mail anomaly, as well as what happened to Zoe.I loved this book. No, it wasn’t the best I’ve ever read, but it was very engaging, poignant, and seriously funny:“…so much has been laid on the sunset—heavy-handed metaphors, sentimental music. Everyone’s always walking into them, and that is some very intense light. Maybe that’s where the term ‘love is blind’ comes from, because so many people are walking into sunsets, burning out their corneas.”Yeah, that part made me laugh out loud, as did several others. I picked up this book whenever I could, and occassionally when I shouldn’t have. While it’s not exactly a light read, it tends to seem like one, and I had a hard time ever putting it down. I was very surprised to learn that this was the author’s debut novel, and I’m definitely looking forward to reading more from him soon (with more Marc Johns-designed covers, please!)."}, {"userName": "Megan", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/5112363-megan", "userReview": "Sometimes I found Sid to be really funny. Most of the time I found that I didn't actually know all that much about him. What was his room like? Why didn't he have any friends? The last one I was especially caught up on. There were literally zero mentions of friends ever. I found this troubling and it made him a much less likeable character, and considering how irresponsible he was over most things, I was mostly irritated with him. Also, the timeline in this book just wasn't clear enough for me. I didn't know how old exactly he was when his mother died. What job did he do before Wanderlust? How did he and Zoe meet? How long were they together? And HOW did Zoe send him postcards from all of these places if she never even got to go—she died before that? That mystery needed to be explained, or at least Sid needed to rationalize it to himself in some way for me to come away liking the book. Once he was fixated on Melanie, it was less about Zoe and the postcard mystery. Sid never really had a direction with anything. A friendship with Gerald was introduced then never touched on again. I also never understood why Sid made it sound like he wasn't sure if Zoe was dead or not. It was pretty clear that she was, once things were explained. It seemed like a poor writing technique to keep the reader's interest."}, {"userName": "Jessi", "userReviewDate": "Jul 22, 2010", "userURL": "http://www.goodreads.com/user/show/3971432-jessi", "userReview": "Summary: A telemarketer at a travel agency, Sid is becoming unhinged and superneurotic. His hypochondria is driving his doctor sister mad. And it's all because his ex-girlfriend, Zoe, who's sending him postcards from her European adventure, one that they were supposed to take together. Sid needs to get over Zoe and find love again--even though Zoe, apparently, has no inclination to be gotten over.--From publisher's description.First Line: The postcard is everything, but looks like nothing.I felt like I should like it - and I was interested to find out where the postcards were coming from. But not interested enough to keep reading. I quit halfway through, mostly because I was not interested in opening it again, even at my normal reading times (like bedtime). Sid, the main character never did grow on me, although I did really like his dog. I have the feeling that many people will really enjoy this book, and so will keep it in mind for recommendations. Maybe I'll try again in another mood as well."}, {"userName": "John", "userReviewDate": "Apr 22, 2014", "userURL": "http://www.goodreads.com/user/show/290848-john", "userReview": "I realized just now I'd be forcing myself to go on anymore with the book. I really wanted to like it, being so quirky and all, but the story just wasn't going anywhere by halfway through! I didn't care what happened to the girl with the postcards, and Syd was just too dysfunctionally pathetic. Loved the dog though!"}, {"userName": "Ron Heimbecher", "userReviewDate": "Feb 18, 2010", "userURL": "http://www.goodreads.com/user/show/1754829-ron-heimbecher", "userReview": "In a very unusual way, it's fortunate that I've been ill for a few days. My to-read stack is at least a couple of dozen, and has been for months. I left my house for a few hours on Wednesday to see Kirk's launch signing at the venerable Tattered Cover in Lodo. (When I worked with the Denver International Film Festival, directors, writers, and actors from around the world wanted to visit the Tattered Cover in Cherry Creek.)I brought the freshly signed copy home and started upstairs to put it on the \"reading pile.\"Two steps up, I remembered a couple of sentences from Kirk's reading. Halfway up, a couple more.OK, maybe I'll read a couple of pages before I put it on the pile. In four-or-so sittings, I was done.My office shelves contain over a thousand novels. I've certainly read at least a thousand more from the library over the years.Postcards from a Dead Girl is special. When you read it, you'll recognize this just a few pages in. It's easy to understand how Sandra (Kirk's agent) and Harper took to it so quickly.I think there are parts of Sid Higgins in all of us, along with Natalie, Gerald, Candayce, and, of course, Zoe. These people extend themselves from the page, or leap from a bottle, to twiddle their fingers on your heart.Wow! First novel. Carnac the Magnificent predicts a long and successful career."}, {"userName": "Sasha Martinez", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/3134966-sasha-martinez", "userReview": "It’s the story of Sid Higgins–quirky and awkward and funny and sad and witty and slightly off-kilter Sid Higgins–who starts getting, well, postcards from Zoe, his dead (?) girlfriend. [There's a question mark there, because as the story moves forward, there are several arguments (most in Sid's head) about the dubiousness of Zoe's death. Sometimes, she's just lost. Sometimes, she'd just walked away.] Add to the mix a loving yet bossy sister, a slew of post office workers, Sid’s mother haunting a bottle of 1967 Bordeux, and the incredibly patient dog Zero (who, at times, seems to be the only one who bears with our pal Sid’s eccentricities). Oh, and Sid is a telemarketer for a travel agency (and I don’t get a lot of telemarketers, so that’s not a mark against him heh), and his boss is just nuts. All that together makes this debut novel a wonderful book, it really really really is.Sid’s story spans over seventy very short chapters, and I think these bite-sized servings are perfect for Sid’s voice. They aren’t pretentious-short (because, trust me, the world abounds with those), and they aren’t too abrupt. Instead, they’re episodic, or like scenes from a movie. (Think Woody Allen at his most contemporary hip, with some echoes of 500 Days of Summer.) There’s an indie-film-ish quality to the book—dark humor, some absurdity—some parts shot with a hazy backlight, some with grainy film. Look at the scenes: Sid in a conversation with his dog Zero; Sid talks to his dead mother (who is in that aforementioned bottle of Bordeaux); Sid rides his car through a car wash; Sid dips himself in a mudholebath he made in his backyard; Sid looks at the interior of a CAT scan and feels cozy (and later, telling Zero that it wasn’t “that kind of cat”). All the while, thinking about his Zoe (and her scent, Blue Zoe Bliss), those postcards.This was about Sid, and how he’s trying (and fumbling) to restore his life after many tragedies. There’s such a deep sensitivity to Sid’s observations, as well as quirkiness—his sister’s phone number is in the shape of half a house when dialed, road dividers go dashdashdash in your peripheral vision when you drive by (this might seem obvious to ye—but Sid makes it sounds so lyrical, so heartbreaking). And I was giggling. Sid Higgins made me giggle. Right before he socked me between the eyes with a well-uttered observation.It was all so quirky and so spot-on, and I loved how it all came together to build up not only the story, but Sid as a person, as a character, a voice. And that’s what I loved most about this book–Sid’s voice. I keep going on and on about it, and it’s really what ties this book together, makes the novel such a treat. Sid’s is an inner dialogue that draws you in and compels you to read. He makes you laugh, he makes you go What now?, he makes you smile that odd smile one gets when torn between grinning very broadly and crying just a bit.These are odd times that Sid chronicles, and I’m glad I’m with him for the ride–because, really, we need voices in our head to tell us that as absurd as things tend to seem, as heartbreaking as they actually are, there’s always something out there that will make us breathless, make us realize that the world doesn’t have to be a terrible place. Take Sid’s cue: you can self-deprecatingly snigger about it, and then descend into that mudholebath.I wish Sid Higgins well. I also vote Zero for Best Fictional Dog Evahr, and Gerald the Post Office Guy for Best Underground Lair Owner.Postcards from a Dead Girl is an incredibly beautiful book, and many thanks to the Universe for flinging it in my direction, and, of course, to Kirk Farber for writing it. I am at the edge of my seat, waiting for your second book."}, {"userName": "Katy", "userReviewDate": "Mar 09, 2010", "userURL": "http://www.goodreads.com/user/show/601049-katy", "userReview": "Reading this book made me sad. Sid was sad, and it was painful to know how troubled he was, that he had some fairly serious mental and emotional problems, and that while he was aware of his problems, he was reluctant to seek help that he very badly needed. But reading this book also made me sad for myself. If Sid, who is somewhat emotionally and socially crippled, has the propensity to attract women and have relationships with them, why is it that I have so much difficulty dating? Interestingly, once I came to the end of the book and the situation with Zoe was revealed, I understood Sid's situation more and realized that Sid and I had a lot more in common than I thought. But again, this made me sad. For if Sid and I have experienced similar losses, why is it that Sid, who has not processed the grief and loss, is able to engage in relationships, and I, who have attempted to be real and actually deal with the tragic situation, is unable to? And yes, I realize that saying Sid engages in relationships is using both the terms \"engage\" and \"relationship\" loosely, but it was still painful for me to read. I'm glad I'm more emotionally equipped and healthy (I hope) than Sid, but I envy and long for dating-type relationships. Perhaps this is a sign that I should stop comparing my life to that of fictional characters...It didn't help that within the first two pages of the book Sid (and Farber) slams the phrase \"Wish you were here,\" which is, like, the phrase that exemplifies how I feel about my loss. It was funny, in a dark sort of way, to read that and know how much that phrase means to me, and sums up my feelings, and how ridiculous and trite Sid thought the phrase was. I suppose that should have been some kind of indicator..."}, {"userName": "Jessica", "userReviewDate": "Apr 22, 2010", "userURL": "http://www.goodreads.com/user/show/1693763-jessica", "userReview": "At least it was quick read. Sid was slowly going crazy, and he started to drag me down that slippery slope with him.The story was quirky, and at times amusing, but mostly it was unnerving. The reader is the sole person who has visibility to the depth of Sid's neurosis, and it seems as though there's no end in sight. He thinks Natalie wants to have him committed. I think it probably would have been a very good idea, early on.The presence of his mom was an unexpected surprise, and one that I rather liked. Zero was sweet and really the only one that Sid could communicate with, despite the fact that the conversations were entirely one-sided. I was slightly disappointed in the journey that Sid takes in the middle of the book, as you're forced to deal with his confusion, hypochondria, and inability to make sense of anything for a good 7 chapters (short chapters, but still.)This wasn't exactly what I had expected when I first picked it up, but it wasn't terrible. There were enough varied characters to balance out the character of Sid, which definitely helped. Had it been just Sid and Zero, I would have been pining for Zero in a way that probably wouldn't have been healthy."}, {"userName": "Debbie", "userReviewDate": "Nov 11, 2010", "userURL": "http://www.goodreads.com/user/show/1753855-debbie", "userReview": "I facilitate a bookclub at a public library. This wonderful book caused quite a stir with the group. The story is simple enough, once you finish the book that is. Sid, a damaged vacation telemarketer, is receiving postcards from Zoe. Zoe, his one time love, now absent in an unexplained way. Sid can't reach her but she reaches him with regular postcards from all around the world. Postcards all postmarked one year earlier. Who is sending the postcards, why won't Zoe answer her phone, who is the little girl in the yard across the street, why is Sid regularly overwhelmed by the scent of lilac and why does his dead mother speak to him from a bottle of wine? The author maintains the suspense from start to finish slowly revealing bits and pieces of the sad puzzle of Sid life. Sid is a character that is easy to sympathize or emphasize with. He's someone you care about and would really like to help. The author can really turn a phrase so the writing as well as the story is interesting. For example he describes Sid's workplace environment as a \"cubicle farm\" and describes Zoe's freckles as a freckle constellation. This book has humor, pathos, mystery and warmth. Read it with your bookclub because you are going to want to talk about it!"}, {"userName": "Cheryl", "userReviewDate": "Jan 29, 2010", "userURL": "http://www.goodreads.com/user/show/1179650-cheryl", "userReview": "Sid works as a telemarketer at a travel agency. His life gets turned upside down when he starts receiving postcards from his girlfriend, Zoe. Sid receives about a dozen. The postcards range from Amsterdam to Paris. Zoe doesn’t say much on the postcards other than the standard “Have a good time, wish you were here”. So now you would wonder, how can postcards cause so much uproar? It is because Zoe is dead! What does Zoe want from Sid? Sid decides to follow the trail of postcards from all over Europe that Zoe visited. This book had some witty moments. This book kind of reminded me of the movie, P.S., I Love You with the concept and funny times but Postcards from a Dead Girl was a little more on the black side of the humor versus the white side. Sid was definitely the star of this book. The kooky and craziness that followed Sid made for entertaining times. Though, I do have to admit that there was a few times where my mind would start to wander. Kirk Farber has a good talent as a story teller and writer. It showed in this book. I plan to check out his other books."}, {"userName": "Linda", "userReviewDate": "Sep 27, 2010", "userURL": "http://www.goodreads.com/user/show/945556-linda", "userReview": "This is an entertaining read by a first-time author who is actually a colleague of mine at PPLD. Kirk is pretty understated in real life, although quite engaging, and that is exactly how I would characterize this book about a guy named Sid. Sid relaxes by taking himself and his car through the carwash again and again, sometimes with his dog, and by sprawling in the mud in his homemade spa in the backyard. I suffered with Sid and all of his humiliations; talking himself out of and into peace of mind; trying to understand his girlfriends and his mother and despising his job. I cringe when I think of the questions that I asked Kirk when we at the libary learned that he would be a published author. He answers most of these queries in the back of the book in \"A Conversation With Kirk Farber\". Along with the conversation is a book list of the books that Kirk finds inspiring. Kirk's comments about these books are illuminating and witty . I laughed out loud while reading and this is always a sign of a good book. I think Farber can do this!"}, {"userName": "Jenn", "userReviewDate": "Mar 18, 2010", "userURL": "http://www.goodreads.com/user/show/2423729-jenn", "userReview": "Kirk Farber has written a crazy little mystery surrounding, as the title states, postcards from a dead girl. But questions abound throughout the novel. Is she really dead? Are the postcards really from her? Is Sid, the main character, just bat-ass crazy? Floating along on a sea of detached thoughts, Sid barely makes it through his days. Farber's use of short chapters and detached imagery establishes Sid's own thought processes. Sid tries to not think too much about any one thing and his thoughts are clipped and broken, like the lines on the pavement he keeps returning to. And though Sid is not particularly lovable, I found myself rooting for him anyway, hoping that someone could save him, hoping that he would save himself.This novel was both entertaining and intriguing. A quick read and fun for the amount of speculation and guessing games it provides, I think this one is a fine book club choice."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Aug 09, 2011", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I picked this up when iBooks put some titles on sale for 99cents, and I'm glad I did! This was a quick read, but I was never quite sure I knew if the main character, Sid, was crazy or if the world around him was. (That question gets answered around the time he starts playing in the mud, really). His girlfriend is dead, and so are his parents, and he is working a telemarketing job, which would make anyone insane. The older sister reminds me so much of the older sister character on Wilifred, down to the profession. I'm also not sure the postcard mystery gets solved (did I miss it?)I hope to see more from this author. From his author info, it sounds like he works at a library for his day job. \"The postcard is everything, but looks like nothing. An inconsequential sheet of pressed pulp decorated with a few drops of ink, it barely exists in the physical realm. But this one has got hold of something inside of me that feels like forever.\""}, {"userName": "Laura", "userReviewDate": "Mar 01, 2010", "userURL": "http://www.goodreads.com/user/show/2924098-laura", "userReview": "This quirky story of difficulty in dealing with the end of a relationship reminded me of several young adult books. I suppose it's just the age of the protagonist that makes it an adult book. Disconsolate Sid Higgins is an endearing dysfunctional character we want to root for, and the mystery of the postcards will make for cult discussion groups. Good fun.Similar YA books:Someday This Pain Will be Useful to You - character’s troubled soulMarcelo in the Real World – protagonist’s inability to deal with the worldPerks of Being a Wallflower – is much darker, but also has dysfunctional (grieving?) protagonistAdult novels:The Flawless Skin of Ugly People – written communication with a distant loved oneMaynard & Jennica – quirky tone, information parsed out to reveal story"}, {"userName": "Kaleb", "userReviewDate": "Oct 08, 2011", "userURL": "http://www.goodreads.com/user/show/6491687-kaleb", "userReview": "so we have this guy Sid who has seemingly lost 'it' - who else buys ten credits at the local automatic car wash (at $4.50 a round) and uses as many as they can before another patron comes along.. hello? and his missing ex sounds like a mess in her own right: \"I'm cute.. you would miss me if I were dead\", she said - at least once. and then there are the postcards that keep arriving, from all over the globe (Hoboken, Nice, Lyon..) - all postmarked from a year past - from the ex: Zoe. someone is fucking with someone - and Sid (a travel agent telemarketer) is going globetrotting. oh: Sid is dying.love is a bastard."}, {"userName": "Marna", "userReviewDate": "Aug 20, 2014", "userURL": "http://www.goodreads.com/user/show/25490451-marna", "userReview": "I couldn't help it. I identified so much with the crazy girl in the book (the one with the blue? Pink? hair) that I had little sympathy for the protagonist.It's difficult to grow much as a person when met with nothing but carelessness. Dream zen girl at the end has obviously just been taken out of the box.And this alarms me because the protagonist is not in the best shape to care for another human being and will probably end up making her just as crazy as his dead ex-girlfriend.So much stress is put on women to heal, nurture or love themselves.Men seem to just lazily reap the benefit of all that effort, coasting on that supposed 'need' of ours to tend to the wounded."}, {"userName": "Georgiann Hennelly", "userReviewDate": "Jan 29, 2010", "userURL": "http://www.goodreads.com/user/show/1946881-georgiann-hennelly", "userReview": "Sid is a telemarketer at a travel agency. His girlfriend recently died in a car accident and Sid survived. He can,t move forward with his life. And now he is recieving post cards from his dead girlfriend from her European vacation , the one they where supposed to take together.Its like he is stuck in limbo waiting for her to come back . On top of that Sid is a hypochondric and he is driving his doctor sister crazy with all his systems .She just wants him to let Zoe rest in peace and move forward with his life.It is at times funny and more than a little macabre."}, {"userName": "Shannon", "userReviewDate": "Mar 04, 2011", "userURL": "http://www.goodreads.com/user/show/746811-shannon", "userReview": "How often do you get to read quirky stories about people inured in their own inner stories...written by people you know?Kirk's story is just fun, and though the narrative is very punchy that sometimes makes the whole thing feel like the set up for a joke (didja hear the one about the guy who couldn't get enough of car washes?), it is tinged with a realistic sadness that is driving the protagonist character (Sid) to distraction, and morbid distraction at that.And besides, Kirk's a great guy. Go read his book!"}, {"userName": "Therese", "userReviewDate": "Jan 26, 2014", "userURL": "http://www.goodreads.com/user/show/2118677-therese", "userReview": "I liked how Farber found the humor in Sid's unraveling; it was spot on. Depressed people who keep their sense of humor think like this, at least I did. It was good, it really was. Intriguing, rhythmic...I really thought we were being set up for some twists or reveals or some sort of glorious denouement. That's my only problem. The ending didn't honor the rest of the story. We climbed and climbed and then...we didn't jump off, we didn't float away, we didn't soar. We just stumbled and laid down at the top. All done."}, {"userName": "T.", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/3195100-t", "userReview": "Postcards from a Dead Girl showed a lot of promise based on the conceit of the novel. Unfortunately, it can't live up to those expectations. There isn't quite an interesting enough of a plot to work as a good genre novel, and Sid, the main character, just isn't interesting enough to feel like good literary fiction. What you get is something that feels like a little bit of both that doesn't quite go far enough. Honestly, it's an average book that didn't really captivate me, but didn't annoy me enough to stop reading either."}, {"userName": "Tatiana Campos", "userReviewDate": "May 17, 2011", "userURL": "http://www.goodreads.com/user/show/5455209-tatiana-campos", "userReview": "I don’t really know what to say about this book because I was left scratching my head towards the end…But basically, Sid (the main character) is crazy. He’s a bit whiny, and self-centered, and at times I found him very unlikable.The humor in this book is tiny bit dark I suppose, but at the same time…not. It’s really hard to explain this story, it’s very odd, and original.I don’t know if I’ll be re-reading this or not…If I do it’ll be to see if the second go around will make more sense of the ending or not…"}, {"userName": "Dawn Berkbigler", "userReviewDate": "Oct 10, 2011", "userURL": "http://www.goodreads.com/user/show/5950874-dawn-berkbigler", "userReview": "Loved this book. Happenstance led me to this book when I went to a library I had not been in, ever. With this first visit brought a delightful book which I finished in less than 24 hours. It must have entered my life at the right moment because I connected with Sid and felt that his experience was mine, as well. Good timing. I won't give the synopsis but will say the conflicting realities and perceptions are often over-lapped and one can't tell the difference between the two. People are wacky and their thoughts even wackier. Love it."}, {"userName": "Jennifer Doerr", "userReviewDate": "Jul 08, 2010", "userURL": "http://www.goodreads.com/user/show/1557768-jennifer-doerr", "userReview": "A tender and thought-provoking coming-of-age story about a young man, Syd, who keeps receiving European/Caribbean postcards from his ex-girlfriend, who may or may not be dead. Syd's life unfolds on the page with dark humor and a desperate playfullness that endear the reader to him. I was pleased that the writer did not submerge him into the realm of pathetic. A+ for that! His relationship with the local postman and his sister are true-to-life and funny. This was an enjoyable book to read."}, {"userName": "Audra (Unabridged Chick)", "userReviewDate": "Jan 30, 2010", "userURL": "http://www.goodreads.com/user/show/3083001-audra-unabridged-chick", "userReview": "This addictive odd book grabbed me from the first line. The chapters are brief but our narrator, Sid, is warm, interesting, neurotic, funny and ultimately, very likable. I cared about his crazy. This book could have easily gone into cloyingly quirky but instead kept it's slightly melancholy edge. There's real sadness, heartache, and pain in Sid's adventure and I was an eager companion the entire way.FTC Disclosure: I received this book via GoodReads First Reads giveaway."}, {"userName": "Shanna", "userReviewDate": "Jan 25, 2010", "userURL": "http://www.goodreads.com/user/show/2260067-shanna", "userReview": "This is a very easy, fast read. I really liked the writing in this novel, but there was not much of a plot. So I wouldn't recommend this for people who can't stand a stagnant novel that mostly focuses on the protagonist's mental state. I am the type of person who doesn't mind a novel without much of a plot, but I did find myself wanting more. However, the author's writing, especially his tone, make up for this. *I will add quotes*"}, {"userName": "Steve", "userReviewDate": "Jun 22, 2013", "userURL": "http://www.goodreads.com/user/show/20361112-steve", "userReview": "This is a mystery, of sorts, but not a typical mystery. One that is dealt with by a person who keeps receiving postcards, despite the almost complete certainty that the person who is the source of the obsession is indeed dead. Makes one think, why would a person do this? More importantly, what could possibly be the benefit? A good read, with the emotion at a low yet steady beam that keeps it alive."}, {"userName": "Scott Lee", "userReviewDate": "Sep 15, 2010", "userURL": "http://www.goodreads.com/user/show/4284112-scott-lee", "userReview": "I don't often read \"literary fiction.\" And I admit I encountered this novel as an assignment. I read it as fast as I could after stopping though. Farber writes in a unique, postcardesque modular style, snapping vignettes from the life of the narrator. The voice is so strong, and the black humor so effective that I enjoyed this novel despite a narrator whose actions weren't always sympathetic but never failed to be entertaining."}, {"userName": "Marie", "userReviewDate": "Aug 16, 2010", "userURL": "http://www.goodreads.com/user/show/1402251-marie", "userReview": "The book flowed in the direction that I thought it would--didn't have any surprises. Very short chpaters which made it easy to read but too easy to lay stop quickly and lay the book down for awhile. I did think it was truthful in interpreting a person who went thorugh a traumatic experience. It was interesting how the character would perceive things, hear things, and react to things that may not necessarily be actually happening in reality. I thought there was truth in that."}, {"userName": "Jessica", "userReviewDate": "Apr 03, 2010", "userURL": "http://www.goodreads.com/user/show/974392-jessica", "userReview": "This story was quirky and cute. The main character brings a whole new meaning to the term \"neurotic\" (he tries to build a mud spa in his back yard, for example). The story is well written and enjoyable, even a little dark. Not every mystery is explained, which is a bit frustrating, but I think also part of the point. The characters are realistic and interesting, including the dog, Zero. I really look forward to reading other works by Farber."}], "description": "“Kirk Farber has a style very similar to Chuck Palahniuk, with offbeat observations, a view of our world through a slightly distorted lens, and a tone that’s … hilarious and tragic at the same time.” — Garth Stein, author of The Art of Racing in the RainA touching, almost cinematic, debut novel featuring the eccentric, slightly disturbed, and unique character Sid, who finds himself—among various other darkly comic scenarios—obsessed by the mysterious European postcards that arrive in the mail from his ex-girlfriend.", "title": "Postcards from a Dead Girl", "url": "http://www.goodreads.com/book/show/6631383-postcards-from-a-dead-girl", "average": 3.17, "cover": "https://images.gr-assets.com/books/1348201357l/6631383.jpg", "reviews": 96, "authors": [{"url": "https://www.goodreads.com/author/show/2991498.Kirk_Farber", "name": "Kirk Farber"}], "type": ["Fiction", "Contemporary", "Relationships"], "outlinks": ["http://www.goodreads.com/book/show/6631383-postcards-from-a-dead-girl", "http://www.goodreads.com/book/show/7840761-postcards-from-a-dead-girl", "http://www.goodreads.com/book/show/21976025-world-book-night-2014-ebook"]}