{"ratings": 168, "userreviews": [{"userName": "Rob", "userReviewDate": "Apr 05, 2008", "userURL": "http://www.goodreads.com/user/show/156533-rob", "userReview": "A fun little classic little science book. It's about the size of things. And our units of measurement. For adults it hopefully impresses that right sense of scale. (When you start at 10^26 meters, you can get an idea of how infinitely small you are.) I want to share this with my child some day."}, {"userName": "Rebecca", "userReviewDate": "Apr 12, 2010", "userURL": "http://www.goodreads.com/user/show/41583-rebecca", "userReview": "Just as cool as I remember. This book may change the way you look at the world!"}, {"userName": "David", "userReviewDate": "Sep 15, 2013", "userURL": "http://www.goodreads.com/user/show/5576926-david", "userReview": "Can't tell you how many times I saw this film during my grade school years in the 70s. Fun nostalgia."}, {"userName": "James", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/6336797-james", "userReview": "This book has been on my shelf for some time and finally worked through it. \"Powers of Ten\" is a companion to the 1977 short film of the same name that illustrates the nature of the universe at a different scales of measure by multiplying or dividing the view by ten. The scale spans the limits of the known universe (for 1977) down to the limits of subatomic measures, while centering around the human level of 1 meter. It, like the film, is a rather beautiful and succinct way of showing the power of changes of mathematical magnitude and how different the experience can be at different scales of being. The only detractor is that in the last 40 years some of the information needs updating, however as it was written for a lay audience, the newer details may go unnoticed."}, {"userName": "Curtis Penner", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/17539257-curtis-penner", "userReview": "meh"}, {"userName": "L", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/9310803-l", "userReview": "Really awesome book!"}, {"userName": "Ross", "userReviewDate": "Jan 01, 2017", "userURL": "http://www.goodreads.com/user/show/2209582-ross", "userReview": "This is a coffee table style work with illustrations on every page depicting the range in size of objects in our world from the very large to the very small.Published in 1982 the physics is somewhat dated but is interesting. There is a brief discussion of each illustration to give the reader a feeling for the physics involved."}, {"userName": "Brian", "userReviewDate": "Jul 11, 2007", "userURL": "http://www.goodreads.com/user/show/167727-brian", "userReview": "There is a lot more to this book, but the crux of it is a progressive series of images taken from the original movie. You start way off in space, and the each subsequent image shows an area of 10% the size. By the end, you are zooming deep into the nucleus of an atom. It blew my mind when I was a little kid, and it still does today. I doubt any book could ever hope to capture, in such a simple way, the extent to which modern science has totally transformed our understanding of everyday existence."}, {"userName": "Jason", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/2526106-jason", "userReview": "Based on the short film of the same name, Powers of Ten takes the reader on a voyage into the biggest and smallest frames of reference we can currently imagine. Packed with notes and artwork, this book makes a perfect supplement to a classic, mind-blowing short scientific film."}, {"userName": "Brent Barnard", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/1300819-brent-barnard", "userReview": "This book was inspired by world-famous designers. The concept? Increasing one's view by powers of ten takes one to the subatomic and universal levels rapidly. Zooming out and in. Neat! But I couldn't make my way through a whole book on the strength of that concept, and returned it to the library early on."}, {"userName": "Joan", "userReviewDate": "Feb 14, 2008", "userURL": "http://www.goodreads.com/user/show/877908-joan", "userReview": "This book starts out with imagery of the universe and slowly backs down by powers of ten to the smallest image available. This is an incredible book if you have any interest in science and the universe as we see it."}, {"userName": "Anna", "userReviewDate": "Aug 07, 2008", "userURL": "http://www.goodreads.com/user/show/1353521-anna", "userReview": "I wrote a 'book report' for math class on this in high school and in the opening sentence unwittingly used the word \"astronomical\" to which my dry-humored teacher wrote largely something to the effect of that being a pun, or just rewrote the word largely across the top, exclamation point."}, {"userName": "Johanna", "userReviewDate": "May 04, 2008", "userURL": "http://www.goodreads.com/user/show/1138137-johanna", "userReview": "AWESOME book! Shows how significant - and insignificant - we all are"}, {"userName": "Ben", "userReviewDate": "May 23, 2011", "userURL": "http://www.goodreads.com/user/show/2187514-ben", "userReview": "A wonderfully imaginative book, and important to me personally."}, {"userName": "Larry Hill", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/51862908-larry-hill", "userReview": "This book does a good job of describing the very small in the universe, to the very large. It is a bit out of date, but still a very good read."}, {"userName": "Liang Gang Yu", "userReviewDate": "Oct 30, 2013", "userURL": "http://www.goodreads.com/user/show/18575112-liang-gang-yu", "userReview": "Classic book about relative size of things. It zooms in/out from Cosmos to quark. Recommend. Enjoyed it that I bought its Flip book as gifts for kids."}, {"userName": "Bern J", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/2981651-bern-j", "userReview": "About the Relative Size of Things in the Universe.Facinating."}, {"userName": "Martha", "userReviewDate": "Sep 22, 2009", "userURL": "http://www.goodreads.com/user/show/2763879-martha", "userReview": "All the way in and all the way out in pix--turns out they look the same. Brilliant idea, endlessly fascinating."}, {"userName": "Stefano Lodi", "userReviewDate": "Jun 02, 2016", "userURL": "http://www.goodreads.com/user/show/51705887-stefano-lodi", "userReview": "Letto tanti anni fa, mai dimenticato, comprato, riletto, sempre affascinante. Per me un classico della scienza."}], "description": "Over 100,000 copies of this spectacular journey have already been sold. In forty-two consecutive scenes, each at a different 'power of ten' level of magnification, readers are taken from the dimension of one billion light years to the realm of the atom. The text and other illustrations depict what we can perceive at each progressively smaller level of magnitude. \"A brilliant pictorial and textual embodiment of a wonderful idea.\" Stephen Jay Gould Videos of Powers of Ten are available from: RITELtd. Cross Tree, Walton Street, Walton in Gordano, Clevedon, Avon BS21 7AW Tel: 01275-340279 Fax: 01275-340327", "title": "Powers of Ten\n      \n          (Scientific American Library Series #1)", "url": "https://www.goodreads.com/book/show/777986.Powers_of_Ten", "average": 4.3, "cover": "https://images.gr-assets.com/books/1387744815l/777986.jpg", "reviews": 19, "authors": [{"url": "https://www.goodreads.com/author/show/409151.Philip_Morrison", "name": "Philip Morrison"}, {"url": "https://www.goodreads.com/author/show/409150.Phylis_Morrison", "name": "Phylis Morrison"}], "type": ["Science", "Nonfiction", "Art", "Science"], "outlinks": ["http://www.goodreads.com/book/show/777986.Powers_of_Ten", "http://www.goodreads.com/book/show/777985.Powers_of_Ten", "http://www.goodreads.com/book/show/1081296.Powers_of_Ten", "http://www.goodreads.com/book/show/11023077-potenze-di-dieci", "http://www.goodreads.com/book/show/1250833.The_Ring_of_Truth", "http://www.goodreads.com/book/show/1081298.Nothing_Is_Too_Wonderful_to_Be_True", "http://www.goodreads.com/book/show/21144250-the-search-for-extraterrestrial-intelligence", "http://www.goodreads.com/book/show/854631.Reason_Enough_To_Hope", "http://www.goodreads.com/book/show/39193652-search-for-the-universal-ancestors"]}