{"ratings": 313, "userreviews": [{"userName": "☕ Kimberly ", "userReviewDate": "Oct 09, 2012", "userURL": "http://www.goodreads.com/user/show/5082615-kimberly", "userReview": "awesome...#FraterfestPretty When She Destroys was an exciting, powerful conclusion to the Pretty When She Dies series by Rhiannon Frater. I love Frater’s dark and gritty take on paranormal romance and the fleshed out, vibrant and fresh characters she creates. I devoured this and was sad to say good-bye to this trilogy. Three word review: action-packed, awesome and addicting!The plot picks up right where Pretty When She Kills ends and brings us back together with Amaliya, Cain and their gang of friends and family. The Summoner is back with plans to close the veil between the living and the dead placing the Earth in eternal night. Amaliya and the others must stop him and the tale that unfolds is breathtaking and with action and snark.Frater has created some of the most unique and fleshed out characters in a paranormal series to date. All of her characters have strong voices and opinions making them memorable. I friggin adore Amaliya our kick-ass vampire-necromancer, heroine. Cain is swoon-worthy, and I loved how despite wanting to protect Amaliya he respected that she was a total kick-ass and had unwavering confidence in her. Cain’s cabal is made up of such an eclectic and awesome array of supernatural abilities, and kick-ass hunters, that I am green with envy. They are so secure in their relationship,and the chemistry was hot. Cain and his daughter Cassandra had some moments, and I loved it. Aimee added to the tale, and I just adore her and Cass together. Biannca makes an unexpected appearance and ooh what a thread that is! Samantha continued to amazing me, and we see development in her relationship with Jeff. And may I just say dudes, Jeff is a kick-ass. There is a little tension, thanks to one particular dog..LOL The snark between him and Amaliya made things interesting. The Summoner is his usually creepy, self, and I loved to hate him.Pretty When She Destroys was an intense, action packed ride that wrapped up the ARC and left me in awe of Frater and her mad skills. From the characters to the fascinating thread regarding the veil, I was spellbound. The action-scenes and character’s abilities came to life as the pages turn. Frater’s ability to set me down in the middle of the scenes and bring it to life around me was incredible. I love how she allows each character to shine, or stumble, even the secondary characters. Cain’s cabal is such a “breakfast club” group, and I would love to go on more adventures with them. While I am sad to see this brilliant series come to an end, I am also excited to see what Frater brings us next.Fans of the Pretty When She Dies series will be delighted with its conclusion in Pretty When She Destroys. A must read series for fans of dark vampires, necromancers, witches and other unique creatures wrapped in a suspenseful, action-packed plot."}, {"userName": "Stephanie Ward", "userReviewDate": "Jul 31, 2013", "userURL": "http://www.goodreads.com/user/show/4831794-stephanie-ward", "userReview": "'Pretty When She Destroys' is the final book in the Pretty When She Dies trilogy. The book continues to follow vampire necromancer Amaliya Vezorak as she struggles to save the world - literally. After being turned into a vampire by an ancient named only The Summoner, she then found out that she was a necromancer as well. Now Amaliya and her friends must figure out a way to finish the war that was started and save the world - all while trying not to get themselves killed in the process.This book lived up to all the expectations and hopes that I held for it - and then surpassed them all. I continue to be blown away by the phenomenal writing of Rhiannon Frater. She is an incredibly talented writer and it shows in every single page of her novels. Amaliya continues her journey to find a way to stop the war that's raging around her and save the world. She's an awesome main character for this trilogy. She's strong, smart, brave, and all around badass. I mean, she's a vampire necromancer! How much cooler can a girl get? The plot continued from where the second book left off and didn't miss a beat. The novel continued to be totally unique and original to the genre, without having any of the usual cliches or stereotypes that vampire or paranormal fiction has. The narrative has a great mix of several genres including action, horror, adventure, suspense, and tons of paranormal elements. All of these easily combined to create a book in a trilogy that surpasses genre labels and is simply in a class of its own. The characters were all very well written with distinct personalities, complete with individual strengths and weaknesses. It was surprisingly easy to identify with the characters - especially Amaliya - and I was definitely rooting for her from the beginning. The writing was impeccable with a really fast pace and vivid details and descriptions that had me feeling like I was right in the heart of the book with the characters. I honestly can't recommend this author, her novels, or this trilogy enough. If you haven't read this trilogy - DO IT NOW. You will not be disappointed. Although I am sad that the trilogy is over, I will definitely be eagerly awaiting the author's next book and reading up on all her previous works.Disclosure: I received a copy of the book in exchange for an honest review."}, {"userName": "Stéphanie", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/1858445-st-phanie", "userReview": "To be honest, I did not expect the conclusion of this trilogy to go where it went. In a way, that’s why Rhiannon Frater is so brilliant. She has the ability to write great stories and surprise you at every turn. I was definitely expecting a final battle between the main character Amaliya and her arch nemesis, The Summoner and that was delivered, but everything about it was unexpected, and definitely entertaining.Personally, I think when it comes to writing, Rhiannon Frater’s strong point is creating great character. Amaliya and Cian, from the very beginning, had good strong chemistry, and I loved seeing it evolve throughout the trilogy. Theirs was definitely not your typical romance, but it’s the type of love that could and did stand against the true test of time: the end of the world. Their relationship, however, isn’t without its faults but the connectedness between the character is what anyone would dream to have in any relationship. Their ability to feel each other’s emotions and read some of each other’s thoughts also helped them bond and really forge and strong duo. Personally, being able to read my boyfriend’s thoughts and feelings would creep the hell out of me, but for Amaliya and Cian, it simply allowed their bond to be that much stronger. Cian and Amaliya were by far my favorite characters but the rest of the cast were also very notable.Cian’s cabal is definitely the most eclectic Scooby gang since Buffy the Vampire Slayer. You wouldn’t expect this odd bunch to be able to save the world but that’s what makes it that much more fun. Cassandra, Cian’s dhampir daughter and her girlfriend Aimee, the white witch, make an unlikely couple but really works in this urban fantasy. What’s more, the homosexual relationship wasn’t placed there to prove a point, but because it was probably second nature for the author to write about this type of relationship. The rest of the Scooby gang included a ghost whisperer, a pseudo bookworm leader, a shapeshifter and a brother-sister techno geek team. (Please note that I call them the Scooby gang but they never do call themselves that.) When you look at it this way, it really has many similarities to Buffy the Vampire Slayer, including saving the world from total evil domination. However, the biggest difference is that the main character is actually a vampire herself, but one with a conscience, obviously.Overall, the novel was a great one but the pace of the story was a bit slow at times, and a little too fast in others. The flow could have been a little better but despite this small inconvenience, it was a great urban fantasy novel. The antagonist was as crazy as you might expect, and if it weren’t for the Summoner, I don’t think Amaliya would be the vampire she is without him. With an antagonist like the Summoner, that author was definitely not afraid to kill innocents bystanders. Truthfully, I expected more members of the Scooby gang to be killed off and while it would have been sad, I think more deaths on the good guys’ side would have been more realistic. Speaking of realistic, while I’m a big fan of happily-ever-after endings, I think the end of this book was a little too happily-ever-after. Don’t get me wrong, I don’t hate the ending, I just thought it would have been a little different.PRETTY WHEN SHE DESTROYS is a great conclusion to this epic trilogy and I highly recommend the whole trilogy to vampire and Buffy fans alike. Rhiannon’s dry humor and sarcasm shines throughout the book with Amaliya’s character. I’ve come to expect great things from Rhiannon and whether you read her self-published books or her big publisher books, you’ll never be disappointed. Her individual writing style is obvious in everything she writes and with this trilogy over, I’m anxious to see what she comes up with next.¨¨¨¨¨¨¨¨¨¨¨¨¨¨¨¨°º©©º°¨¨¨¨¨¨¨°º©©º°¨¨¨¨¨¨Find this and other reviews on Tynga's ReviewsAn electronic advance reader's copy was provided by the author for an honest review"}, {"userName": "Chapter by Chapter", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/6473590-chapter-by-chapter", "userReview": "Pretty When She Destroys (Pretty When She Dies #3) Action! Action! Action!  Pretty When She Destroysby Rhiannon Frater is jam packed with so much supernatural action that it will blow your mind!It was so awesome to be thrust back into the world of Amaliya, Cian, Samantha, and the other members of this amazing group.  With the return of The Summoner, who has now taken residence in one of his own creations, Biannca, the Scoobie gang is on high alert.The Summoner has his sight set on claiming Amaliya for his own, and when the reality of what his evil plan is, Amaliya will stop at nothing to save the very person who tried to save her before her human life was taken…Biannca.With The Summoner in persuit of the rings in order to bring on eternal darkness and be ruler of the entire world, what better way to keep the good guys out of the way, then by setting trap after trap of possible death their way.  With loved ones who could possibly die once the veil is ripped, and The Summoner having a severe god complex, all eyes are on Amaliya.  Could she truly be THE ONE that will defeat The Summoner forever?  Or will she succumb to his thrall over her, and rule by his side once darkness comes.With the re-introduction of our favorite characters, as well as an intro of some new faces, Pretty When She Destroys begins pretty much right where it left off in book 2.  Amaliya and Samantha are still trying to tap into the full potential of their powers, and find out that by combining their two forces, they are quite a scary act to follow.The is much profession of love in this installment to the Pretty When she Dies series.  I guess the coming apocalypse really does bring couples together!  Samantha and Jeff realize just how much they mean to each other, and Cian and Amaliya find that they are truly bound to each other not just in a bond, but in the love that they have for each other.So with all the talk of love, I of course prepared myself for some sort of heartbreaking moment!  And with the epic final battle that ensues in the end, I couldn’t help but get swept up in the action and fear for the safety of all the characters!  Author, Rhiannon Frater, does an amazing job in allowing the reader a look at the fight from the angle of all fighters involved.  I easily pictured the battle in head, along with the sounds and smells.  It’s no wonder that Rhiannon Frater is one of my most favorite authors out there!  Her writing is like magic and easily compelling.In Pretty When She Destroys, I couldn’t help but fall more and more in heart for Cian.  Apart from the fact that he is a vampire (which I, for one, really do not mind at all), he is the epitome of a perfect boyfriend.  His trust and devotion for Amaliya is so formidable and totally plays on the heartstrings.  Not only with his love for Amaliya, but for his daughter, Cassandra also!  I loved seeing the fatherly side of him come out more and more as the book went on.I also loved that there was a lot of spells and witchcraft in this installment.  It did not focus mostly on the vampire and necromancer abilities, but we witness Samantha totally kick ass with her powers, and we witness Cassandra’s girlfriend, Aimee, do some kickass witchy things!Add all of the above with some really sexy moments, and you have a really addictive read that is impossible to put down!  Fans of Rhiannon Frater’s previous titles, as well as those who want to read an amazing twist to a regular vampire tale will obsess over this series…just as much as I did!"}, {"userName": "Jennifer  Ricketts (Donnie Darko Girl)", "userReviewDate": "Jul 13, 2013", "userURL": "http://www.goodreads.com/user/show/6097206-jennifer-ricketts-donnie-darko-girl", "userReview": "*I received a copy of this book in exchange for an honest review for my stop at my blog Donnie Darko Girl for the blog tour. It's all come down to this - the final showdown between Amaliya and those who stand with her and The Summoner. The Summoner's plans in light of what he's been wanting for the last hundred years are revealed, and it's even more diabolical than anyone could have imagined. This was such an intense ride! I couldn't believe it. With each book, the plot has unfolded more and more deeply, and I loved where I found myself while reading this installment. Just when I thought The Summoner was as evil as a being could get, Rhiannon Frater showed me he still had a few more tricks up his sleeve. Believe me when I say though that he's one of the most vile villains I've read about. Just thinking about him and his plans gives me the chills. I'm in love with Amaliya, completely and totally. She's incredibly resourceful, intelligent, and just all out bad ass. The transformation she's undergone from the first book to the second book to this one is stunning. I 'think she's adjusted so well to becoming a vampire because she never wanted to live an ordinary life. She didn't have that in her. She's seemed to have gone from a human girl with no confidence in herself who was sorely mistreated with the exception of her grandmother, cousin Sergio, and childhood friend, Pete to a powerful \"necrovamp\" who's brave and willing to fight to save the world. The fate of billions of lives are in the hands of her and her allies. If they fail, the consequences will be dire. I wouldn't want that responsibility weighing on me! It's funny how some of the characters that I didn't like in the first book have now grown on me, such as Samantha. She loves Buffy - who could hate a girl who not only loves Buffy but wishes she WAS Buffy? Haven't all of us at some time or another wished we were Buffy? I know I have. ;) There were also a couple of characters whom I felt more neutral about but still didn't trust. Rachon was definitely one of those characters. I really loved the pop culture references to Buffy, Twilight, and Anne Rice's Lestat. The Twilight jokes made me laugh out loud. And I got some weird looks when that happened. Rhiannon Frater did an amazing job drawing me into Amaliya's world, and I'm better for knowing her and the motley crew she hangs around. This book was action packed and such a roller coaster ride where I had no idea what was going to happen next and who was going to live or die. I never would've guessed the ending, but I'm happy with it. Rhiannon Frater did justice to her characters and with her readers who have invested themselves in Amaliya's world, an incredibly difficult balance to achieve."}, {"userName": "Laura *Little Read Riding Hood*", "userReviewDate": "Dec 12, 2012", "userURL": "http://www.goodreads.com/user/show/7229032-laura-little-read-riding-hood", "userReview": "This was a change for me, as I had listened to, and LOVED the first two, on audio book. So switching to ebook was a little hard for me, I am a bit OCD about sticking with one format for a series. But I got through, and am happy to say I enjoyed this final installment in the Pretty When She Dies Trilogy.Amalyia and Cian are perfect together. They balance one another well, don't judge the other, and really, are the perfect vampire couple. There is none of that whining \"I don't know how I can live with the things I have done\" BS that is so prevalent in vampire stories recently. I love it that they are not only OK with what they are, but that they are HAPPY with what they are. AND they have a realistic view of what forever means?! It is refreshing.I did have a hard time, switching from audio to reading, keeping track of some of the side characters. The narrator had done such a good job giving everyone different voices that I associated more with that than their names. But it didn't take me long to get all caught up and figure things out. There are so many wonderful side characters that I am not going to take the time to list them all out, except to say I am a bit disappointed that the obvious ... I don't know how to say that without spoiling the story. Let's just say there were some painfully obvious theories and I was hoping for a different outcome.The Summoner - the big bad - is a scary as hell bad guy. And I love it. He is unapologetically evil. And he surprised me around every turn. As well as gave me the heebie-jeebies ALL THE TIME. *shivers* All I can say is that I am so glad I didn't have to go up against him because folks - the world would have come to an end early in the story. I have no shame in saying I would have tucked tail and RUN.Frater does not shy away from death and destruction, and I was a little surprised there wasn't more in this story. Not that it was lacking by any means, but I kept expecting more. When we got to the big showdown I was on the edge of my seat, terrified for everyone, hoping my favorites would survive and not sure if anyone was safe, or even if they would beat the bad guys. And let me tell you, nothing. :-) You will have to read it to find out.All in all, this is a great trilogy, that takes vampires back to the unashamed killers they always have been and should be. But they are also human, in a sense, that they are still relate-able to the reader, and even though they are not perfect, you find yourself rooting for them all the same."}, {"userName": "Pam", "userReviewDate": "Nov 06, 2012", "userURL": "http://www.goodreads.com/user/show/5089871-pam", "userReview": "The battle between The Summoner and Amaliya is almost here. If The Summoner wins the world will be torn apart. Amaliya and her loved ones and friends must win this battle. Each side has powerful players but Amaliya and her crew seem to be on the losing side. Will they be enough to stop him and save the world?Amaliya is one of my favorite vampires of all time. She is a badass and will not back down. I love how tough and powerful she is. Cian is as amazing as ever and the perfect match for Amalyia. Sam is another character who continues to surprise me as I like her the more I read about her. She really is becoming a much more enjoyable person to read about. If you have read the rest of the series you will be happy to know the other characters all play a part in this book. I was surprised at a few who showed up and that is all I will say about that.This is such an amazing book. I hated to read it in some ways as I knew it was the end of the series. The author has such a way with words that you feel you are right there in the scenes with the characters. I loved all the action this book has and seeing different kinds of paranormal working together. You see the characters really come into their powers in this book and some of them have amazing powers. You still get softer moments where the good guys as I will call them really show how much they care for each other. It may be a hug or it may be something more in a few cases but you can really see more bonds appear between them. I have to say Amaliya and Sam are my two favorites together. They have me grinning several times in the book as I can just see them in my mind giving each other a hard time. I am trying my best to not give any spoilers so I guess I should wrap this up. I love this series and this book is my favorite of all of them. The author does a wonderful job as always writing a story you can love. If you love plenty of action, paranormal creatures and not a lot of sappy scenes give this series a try. Rhiannon Frater is an amazing author that knows how to write bloody fantastic book. The ending scene was just wonderful!I love the covers to this whole series they are a perfect match to these books"}, {"userName": "Ali ", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/5847230-ali", "userReview": "Everything comes together perfectly in Pretty When She Destroys, the third installment in Rhiannon Frater's Pretty When She Dies series.Amaliya has really found herself, she is understanding her role in the power struggle between evil and well, more evil. She's understanding her gifts and embracing them. She is also coming to terms with her relationship with Cian, as well as his cabal.She will need the combination of all these things to conquer The Summoner. He's amassing power and followers and the end is nearing, quickly. Amaliya knows the fate of the world falls on her shoulders and she'll do anything to save it.What I loved most in Pretty When She Destroys was where my thoughts on Samantha traveled. I honestly could not stand her in the first two books but that's all changed. She is a total little poofy pink badass now and I never expected to like her, but I do. Other characters who were introduced in book two, are much more developed now as well. Most notably, Cassandra. The relationship that forms between her and Cian was so sweet, it was cool to see the fatherly side of Cian. He's always been protective of those in his life but it is different with Cass.There were also some new powers introduced and developed. The addition of magical elements and ghosts was most entertaining.Aside from the character growth, which is stellar, was the action. The battles were supremely epic and when the shit wasn't hitting the fan, the pages were filled with tender, endearing moments from many of the characters.Pretty When She Destroys is the perfect combination of action, drama, love and hot, steamy sexiness.*Copy provided by author for honest review*"}, {"userName": "Kathy Geiser", "userReviewDate": "Jun 17, 2013", "userURL": "http://www.goodreads.com/user/show/9612765-kathy-geiser", "userReview": "PRETTY WHEN SHE DESTROYS by Rhiannon FraterThis is a wonderful novel. It is currently the latest in the \"Pretty As She Dies\" series. Amaliya and Cian are an amazing vampire couple, who are surrounding by their group of supernatural and human friends that must attempt to save the world as we know it. The ancient vamp known as The Summoner created them both. He plans to destroy mankind and rule over the world of supernatural beings with an unwilling Amalyia at his side. The scariest part is that he is also a necromancer. He pasted this ability on to Amalyia and Bianca, another of his fledglings. The Summoner already controls Bianca. All that stands between him and his control of the world is Amaliya, Cian and their cabal. I was really disappointed when Rhiannon announced that she had released the final novel in her \"As the World Dies\" series but after reading \"Pretty As She Dies\" books I am all right with this, because I realize Rhiannon can repeatedly create world that I can get lost in and become part of the book. She is truly talented and never fails to pull me in and develop characters I can't help but love. I have said this in a previous review but her characters feel more like people I know, than someone that was invented for a book. Rhiannon has a way of giving more and making you care about them. She has made it into my list of favorite authors that rate immediate read list of their new books. I can't wait for her next book, series or whatever she decides to write. Keep them coming Rhiannon and I promise to keep reading them."}, {"userName": "Rxdawg", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/21400104-rxdawg", "userReview": "Well I enjoyed this book, but compared to the previous ones and some Fraters prior works I was a little disappointed. For me it's easy. She really reinforced the love the characters had for each other a little too much. And this writer isn't typically like that either. Wonder if she got some bad advice? Its almost like this book was targeted at a different kind of audience then the first one. Anyways, I just didnt need to hear so much about character X was the love of character Y's life repeatedly. In a way, it kind of demeaned it. Also in prior books the story and discovered powers seemed to flow better, but this time things just seemed to happen just because. I loved the first book in this series, really liked the second, but the third left me feeling a little underwhelmed. I'm actually sad to write this. I'm really hoping we can get back to the style the first book was written in."}, {"userName": "S.C. Parris", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/10085064-s-c-parris", "userReview": "What a fucking ride.I'm so satisfied with the end of Amaliya and group's story, and I love the little opening at the end in case there is ever a continuation. (hint hint wink wink)I loved Amaliya and Cian's continued love and LOVED that there was no 'confusion' plot that dragged them away from each other amidst preparing for the big battle like there often is in urban fantasy (not that I MIND those plots, I quite love them), but not one to focus on too much on the romance of the characters, Rhiannon balances the action, suspense, and bad guy undercurrents with everything else nicely.Although it seemed the big bad had a bit too much on their side, (I remember wondering just how the protags would come out on top in the face of all the bad guys had against them) the heroes came out victorious in the end, and in my currently dark state of mind, this is just the ending I was looking for."}, {"userName": "Jenne ", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/5705914-jenne", "userReview": "So I've waited a long time for this book. And once again Amilya kicked all sorts of butt. She really took her powers to a whole new level in this final showdown with The Summoner. I'm such a sucker for a ragtag eclectic group in books. The Austin cabal that Amilya and Cian have created fits the bill perfectly. And I have a whole new fondness for Samantha. If you like dark UF/PNR you should check out Ms. Frater's books sometime and if you're a Texan they're a must read!"}, {"userName": "Erin Hayes", "userReviewDate": "Nov 19, 2012", "userURL": "http://www.goodreads.com/user/show/6816709-erin-hayes", "userReview": "This is it.The end of the Pretty When She Dies trilogy and it's everything you hoped for and more with Amaliya and Cian and the rest of their cabal trying to save the world from the Summoner.These are characters that I've loved for years now, and it's sad to see the end of this story. I hope we get glimpses into other characters' stories, like totally awesome Cass and Aimee.There's a lot that happens in this story. I teared up at the end.And I wouldn't have it any other way."}, {"userName": "Joshirl", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/7405134-joshirl", "userReview": "Great book, Mrs. Frater. I am an avid fan of this series and you are terrific writer and I really enjoyed this book. Amaliya is an awesome character, if I were a vampire/necromancer, that's how bad ass I would like to be."}, {"userName": "Amy Fournier", "userReviewDate": "Jan 24, 2013", "userURL": "http://www.goodreads.com/user/show/5943163-amy-fournier", "userReview": "Review coming 7/22"}, {"userName": "Heidi", "userReviewDate": "Oct 14, 2013", "userURL": "http://www.goodreads.com/user/show/5463965-heidi", "userReview": "Four stars: An exciting and brilliant finish to a dark and gritty trilogy.Amaliya, Cian and the rest of the gang are still reeling from their terrifying and brutal battle with the Summoner in a Texas graveyard. The Summoner has stolen another body, and he has his sights are set on ending the world as December 2012 draws closer. It is up to Amaliya to destroy him, but it is going to be an epic battle. Especially since part of her craves being closer to the diabolical Summoner because he is her creator after all. The clock is ticking and time is running out. Can Amaliya destroy the Summoner once and for all and save the world?What I Liked:*This book gives you everything you love with a good conclusion. It has the return of all your favorite characters, some taking on new and unexpected roles, along with the introduction of a couple of new interesting characters. There is plenty of danger and action all leading up to an epic finale with the evil Summoner. Oh and don't forget a couple of surprises thrown in for good measure. If you are a fan of this series, or you have yet to try it, plunge right in and get going now that all three books are available!*I love measuring character growth, and the players in this series have certainly grown a few inches. Amaliya is far removed from the scared college girl clawing her way out of a grave only to discover she is a vampire. She is secure in her vampirism, happy in her relationship with Cian and ready to take on her menacing creator. She has learned to wield her powers, and she is determined to see it through, even if it means sacrifice. Amaliya will see him destroyed! Samantha has grown on me. She started out as being a pampered, whiney girlfriend, but now she is a powerful phantgasm, one who can see ghosts and draws power from them. The annoying spoiled girl is gone and now she is a formidable player. I especially like the new dynamic between Amaliya and Samantha. They have a bit of jealous history between them and they didn't exactly get along. These days they are becoming friends but they still cling to their hilarious nicknames for each other such as \"Bitchface.\" I also liked getting to know the true Bianca better and learning her back story. I even enjoyed the return of the ornery butler Roberto. Baptiste is a fun new edition, he can wield the elements. I thought his powers were exciting, and I wished that he had a bigger role. I enjoyed watching all the characters work together to achieve a common goal, even if that meant setting aside their differences. *Surprisingly, there is plenty of romance in this book. Even though it has a dark and gritty tone and a bleak outlook, there is love in the air between Samantha and Jeff, Amaliya and Cian and Cassandra and Aimee. It was nice to see the hopeful sparks of love blooming amidst the chaos and darkness. I was also pleased to see that the sex scenes where toned down immensely. I was never a fan of the blood swapping and the sex in the other two books. In fact, for the most part, the sex scenes are pleasant and they don't go into much detail. So you won't feel like a dirty peeping Tom. *Finally, the ending was everything I hoped for and more. There is an intense and exciting battle with lots of action and mayhem. I was pleased after all the buildup that the finale paid off. And The Not So Much:*The pacing in this one is a bit slow. I am used to a more brisk pace with plenty of action along the way. This time around, the focus is on plotting and planning. There are only one or two confrontations leading up to the big conclusion. This isn't a big issue as I did enjoy watching all the character interactions as the gang prepared for their fight. *Eduardo, the werwolf, was a character that I could have totally done without. There is a storyline that revolves around him, but I didn't feel like it added to the overall plot or that it was fully developed. I also thought he was a bit disturbing and very gross. *Once again, I don't think the Summoner was a scary as I was expecting. His overall role in this one is surprisingly small considering the entire plot revolves around him. There is plenty of discussion about him, but his scenes are few and far between. I was hoping he was going to notch it up and be a true terror. Granted, he is still creepy and nasty, but he wasn't one of those villains that I loved to hate. *Alexis and Benchley felt like extras. Neither one really played a big role and I didn't think they added much. I couldn't really tell you much about either one of them in fact.*I was curious as to what happened with Rachon. Did she abandon Cian and the others because she struck a deal with the Summoner? Her storyline just drops. *This is definitely a book for mature readers. There are adult scenes, adult language and plenty of violence and gore. You need to strap on your big girl panties for this book! Pretty When She Destroys definitely delivers. It is an exciting conclusion to a solid series. If you like your vampire books dark and scary with lots of action, you should give this series a go. The highlight for me is all the terrific characters. I am excited to see what Ms. Frater has in store next! Keep in mind, though, these books are not for the faint of heart. Favorite Quotations:\"People find reasons to support their hate.\"\"It was so much easier when I thought the monsters were only make believe.\"\"Love and hate are close siblings.\"I purchased a copy of this book. All opinions are my own and I was not compensated for this review.Posted@Rainy Day Ramblings."}, {"userName": "Christy LoveOfBooks", "userReviewDate": "Jan 26, 2013", "userURL": "http://www.goodreads.com/user/show/1390723-christy-loveofbooks", "userReview": "Is it weird that I want to make out with that cover? Probably. I don't give a flying frick, it's hot! I've been completely in love with this series since I read the first book, Pretty When She Dies, a couple of years ago. Of course I was bummed about this being the last book, but I also couldn't wait to devour it. I mean, how could I not be excited when it has the title Pretty When She Destroys?It all comes down to this. With the apocalypse looming and darkness threatening to take over the world, Ameliya and the gang have to figure out how to stop it. And with Rhiannon Frater as the author, there's no telling who will or will not make it out alive. And that's part of the fun.I immediately adored Amaliya from the very first moment I 'met' her, and loved her more and more with each book. She has grown into a total badass, and her confidence makes her even more sexy. As much as I love Amaliya, I love her relationship with Cian even more. I'm very much like her in that department, and would love to find a match like she did in Cian. Those two together constantly made me smile. Cian is definitely an alpha male that you don't mess with, but he's the type I like. He respects Ameliya and fights by her side instead of trying to hold her back. Seriously, these two are one of my favorite fictional couples!“It has nothing to do with the size of my cock and everything to do with the fact that I have you in my life.”“Ugh! That’s so romantic! Stop!” Amaliya pretended to fan herself.Not only are Ameliya and Cian great, there's also a plethora of awesome secondary characters. I love their little diverse group of human and supernatural beings. Rhiannon did a wonderful job with including them and making them all important. In fact, Samantha blew me away in this book. She's always been fierce, but her game was stepped up in a huge way. Really, though, every one of them had a vital role and made the group as a whole even better.As sad as it was that this series came to an end, I was completely satisfied with how it did. I can definitely see myself revisiting this series in the future, which is something I rarely do."}, {"userName": "Pili", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/9540219-pili", "userReview": "If there's something that Rhiannon Frater does amazingly is writing vampires as monsters and still manage to make us root for them!In this final installment of Amaliya's story, the stakes are at their highest since The Summoner has returned and wants to unleash Hell on Earth and take over the world. And not only that, he wants to bring Amaliya to his side, so he'll have both vampire necromancers he created at his side.The way the plot is woven with the crescendo in tension through preparations, training and battles makes you want to turn the pages faster but also makes you scared of what might happen in the next page! The final chapters in the book had me reading in the edge of my chair and I was too tempted to peek at the ending to ensure all my beloved characters survived the day or not! The way the characters are developed and how the relationships between them change and evolve is great. Rhiannon is a master on writing people that feel genuine no matter what their paranormal abilities may be. The relationship between Cian and Amaliya, Amaliya and Sam (Cian's ex), Sam and Jeff, Aimee and Cassandra... I just love all their interactions, and how perfect they are for each other. I loved seeing how the relationship between Amaliya and Sam changed, from animosity and possible hate, to friendship and alliance. I adored all the characters in this series, even the bad guys, cause I loved to hate them!With plenty of action and tension and a final showdown that was epic and amazing characters, I'm kicking myself for waiting so long to read this final installment of the Pretty When She... trilogy. Brilliant book and one I'd recommend to anyone that loves paranormal and vampire books! Well deserved 4.5 to 5 stars!"}, {"userName": "Book Bite Reviews", "userReviewDate": "Apr 18, 2013", "userURL": "http://www.goodreads.com/user/show/6904179-book-bite-reviews", "userReview": "The books prologue begins with Bianca and Amaliya's background of how they met in college and how she fails to warn Amaliya of the danger she faced the day The Summoner took both their lives and changed them forever. A quote from PWSK #2\n\"I firmly believe that The Summoner consumed all the ghosts in the surrounding area after his death. He used their ectoplasm to travel to Bianca's body and claim it. Just like Amaliya, Bianca is one of his necro-vamp offspring.” Jeff let his words sink in. “I don't know if Bianca was a mad fledgling, or rebirthed brain dead, but The Summoner implanted himself inside of her. He then waited until Rachon set her plan in motion to begin implementation of his own.”\nSee My Review of Pretty When She KillsPart One: The Return of the SummonerThe Summoner is brought back to Santos place in San Antonio by Etzli and is introduced as their new master. UGH! Except now The Summoner is a woman who has taken possession of Bianca's dead body. Cian, Amaliya and the rest of the Scooby Doo cabal make plans to destroy The Summoner. Amaliya is pissed off that her grandmother Innocente is dead and before they were about to head out to San Antonio they are informed Santos house had burned down. It would do them no good to go there now. When Bianca appears eerily in Amaliya's dreams she tells her she is alive and that Ameliya needs to find her. Can it be the real Bianca or is The Summoner playing the same prank he had done with Innocente?to be cont...@ #fraterfest"}, {"userName": "Mary", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/8243269-mary", "userReview": "Pretty When She Destroys is the final installment in the Pretty When She Dies trilogy and it does not disappoint.Amaliya, Cian, Samantha, Jeff and the rest of the gang are back for their final battle with the Summoner. No spoilers but I will tell you that this didn't go as I expected. It's always a good thing when an author can shock you with twists and turns. Amaliya is a complicated woman. She cares deeply about those close to her and is willing to do whatever (!) it takes to keep them safe. Her relationship with Cian has given her an anchor and their love is palpable. One conversation did make me take a step back and look closer at them. Honestly, I had to remind myself that Amaliya is very different from me and it makes sense that she might have much different boundaries in her relationship with Cian. I'm still somewhat surprised but they are a great couple. Boy, has Samantha grown on me since the first book. I didn't care for her very much when she was Little Miss Perky. Now, she is one tough cookie and I couldn't be happier. It's nice to see her relationship with Jeff as a contrast to Amaliya and Cian. And, of course, I loved that the friendship between Amaliya and Samantha has grown even stronger. They are interconnected and to see them really start to trust and lean on each other was special.I am sad to see the end of the series but what a ride it has been. 5/5 stars."}, {"userName": "Becky Stephens", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/24779079-becky-stephens", "userReview": "Picking up where Pretty When She Kills leaves off, this conclusion to the trilogy was as kick-ass as the others.Frater's characters are all so unique that it's almost hard to believe they are figments of her imagination. And while I didn't like them all, I was most surprised by my feelings regarding Samantha taking a one-eighty. And she's not the only character to grow and gain even more depth. Every member of Cian's ragtag cabal is pretty amazing, but my favorite is Aimee, who is adorable with Cass. I'm sort of jealous of her abilities and power. This book is action packed, and is brimming with all kinds of magic, which I find beautiful.Like the other two books in the series, it needs the help of an editor, who can clean up the typos and word usage.However, fans of the Pretty When She Dies series will love the tale Frater weaves with this book. The entire series is a must-read for fans of dark magic, vampires, and witches.I received this book for free in exchange for an honest review. This does not affect my opinion of the book or the content of my review.This review originally posted to Twisted Book Junkie."}, {"userName": "Brandi", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/8302994-brandi", "userReview": "I'll keep it short and sweet IT WAS A PERFECT ENDING!! It kept me guessing till the end. Love the dynamic of Amaliya and Cian and how they accepted each other and embraced the dark bloody gritty side of being vamps but still had that all encompassing love. What can I say about Samantha and Jeff? Loved them loved that despite being screwed over by Cian early on she was able to find love, embrace her new power and become friends with Bitch Face (aka Amaliya). Jeff is such a sweet guy just trying to do right by his fathers legacy. Little Bitch and bitch faces powers feed off each other and bc of that little bitch and bitch face do a lot of ass kicking. Cass and Aimee were a refreshing love story to see. They were lesbians who kicked ass and didn't take names. Eduardo you're a dick that's all. Roberto have fun washing the dishes. The Benchlys I hope things turn out well for them. Maybe Bianca can show Shark Boy some love!! Baptiste I'm sorry your family acted like dicks but this cabal is far better. So I'm very happy with this ending. Hope the summoner has fun where it's warm!! See no spoilers!!!!!"}, {"userName": "Amanda", "userReviewDate": "May 20, 2014", "userURL": "http://www.goodreads.com/user/show/8027560-amanda", "userReview": "I think there are a lot of things Rhiannon Frater could do to improve her books, but the fact of the matter is that she tells a great story. Her writing style isn't my favorite, but I LOVE reading about the Austin cabal! Not to mention the fact that she really is extraordinarily creative. I've read quite a few vampire novels and there are some cool things in this series that I've never seen before, and that amazes and fascinates and delights me to no end.So the final chapter in the saga was great, just like the others. I kept finding myself trying to make excuses to read, like on the drive home from dinner or while I was waiting for someone to get out of an appointment. I think that's when you really know it's good, when you're hunting for time to read just a little more. So I think for anyone who likes vampire novels, like I've said before, this is definitely something you'd enjoy. The ending felt just a little anticlimactic, but I feel like most endings in action novels do. Overall, A+."}, {"userName": "Mirasol Quisto", "userReviewDate": "May 17, 2014", "userURL": "http://www.goodreads.com/user/show/14052873-mirasol-quisto", "userReview": "Rhiannon never fails to amaze me in terms of how she makes her story unique without going too far from its original tale. I mean I will definitely buy her vampire squad who were afraid of daylight than those vampires who glitter. Sorry Twilightie but I just don't get the glittery thing. And the transition of her stories will blow your mind and will make a sudden ass lift from your chair due to excitement. I can still remember my first RF book, The First Days from the trilogy \"As the World Dies\", it was deliciously done I'd even compare it to how I eat my favorite Burgers :D I really thought that someone will die on this trilogy as it ends but I was totally wrong :D Good to know that everyone got their own \"happily ever after\" ending. The last part (Part Seven : The End of the World) was super duper effin' awesome!"}, {"userName": "Christoffer Lernö", "userReviewDate": "Jul 14, 2012", "userURL": "http://www.goodreads.com/user/show/4910051-christoffer-lern", "userReview": "This book doesn't disappoint. Frater's strength is in her stories and this book is definitely no exception. There are certainly quite a few popular authors with more eloquent prose, but few if any comes close to the richness in story. The popular trilogy format tends to trip up most authors - where the first book might be good enough, the second and third part then desperately recycles story that could have filled barely half another book.Not so with Frater. Instead if anything the story just gets progressively richer for each new book. It's an amazing and rare talent, and if her prose is merely decent, then her talent at weaving tales more than makes up for it.I wholeheartedly recommend this book to anyone who liked the first parts of the series."}, {"userName": "Kym", "userReviewDate": "Jun 23, 2016", "userURL": "http://www.goodreads.com/user/show/19873141-kym", "userReview": "I am completely awed at how much I enjoyed this series! Anyone who loves the supernatural has read a Laurell K. Hamilton book!!! Now i have never read anything that even comes close to the creativity, darkness, and pure lust that is in Hamilton's books. This series has earned a spot right under the Merry Gentry series and that is saying a lot!!!!! Even though Hamilton goes much deeper, Frater gave me chills. My only issue is that the story has ended, even though it is quite apparent that there will be more struggles to come. Ugh why must there be an end????"}, {"userName": "Michelle", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/7957821-michelle", "userReview": "What can I say to accurately describe this series? I think phenomenal is one word that fits it best. Rhiannon Frater is one kick ass author. She has the ability to keep you interested from the very first words to the very last sentence in the series. The characters she writes have the ability to drag you right into the story with them. You will have no problem imagining yourself as part of the story."}, {"userName": "Art Lueder", "userReviewDate": "Jun 05, 2013", "userURL": "http://www.goodreads.com/user/show/16303033-art-lueder", "userReview": "Amaliya and her scooby gang neatly wrap up the trilogy. I love how Rhiannon Frater writes vampires in that they tend to be classic, blood drinking, burn in the daylight, badass characters. The book does tend to emphasize how happy each of the couples are with each other and it gets a little sappy at times but it is nice when even the vampires get a happily ever after and the bad guy gets sent to hell."}, {"userName": "Kelli", "userReviewDate": "Mar 16, 2015", "userURL": "http://www.goodreads.com/user/show/31122437-kelli", "userReview": "Rhiannon Frater is hands down my favorite author. and I have many favorite authors I love and are fabulous. But Rhiannon made me love a trilogy about vampires, simply a genre I'm not very interested in reading about. Everything I've read by her is so enthralling. I'm onto her other vampire trilogy next!"}, {"userName": "Shelley", "userReviewDate": "Mar 09, 2013", "userURL": "http://www.goodreads.com/user/show/3081722-shelley", "userReview": "*Genre* Urban Fantasy*Rating* Solid 4.0*Full Review & Guest Post Found on Gizmos Reviewshttp://gizmosreviews.blogspot.com/201...*Blog Tour Stop on August 9, 2013* Expected publication: August 27th 2013 by Rhiannon Frater"}], "description": "Amaliya Vezorak always believed she was destined to live a failed life in obscurity until she was brutally murdered by an ancient vampire named The Summoner and reborn as a powerful vampire necromancer.The Summoner’s power did not diminish with his death. His long-laid plans are about to bring an endless night to the world, and once the veil between the living and the abyss collapses, reality will be forever altered. The followers of The Summoner are preparing to claim dominion over humanity, which spells doom for Amaliya's new world and everyone she cares about.As Amaliya, Cian, and the others prepare for their final battle, it becomes increasingly clear that their ragtag group of humans and supernaturals will have to face the forces of The Summoner alone. Though the cabal is growing stronger in their abilities, they are depending on Amaliya to lead them to victory.Now the young woman who spent most of her life running away from trouble has to save the world…", "title": "Pretty When She Destroys\n      \n          (Pretty When She Dies #3)", "url": "http://www.goodreads.com/book/show/14117250-pretty-when-she-destroys", "average": 4.09, "cover": "https://images.gr-assets.com/books/1521569520l/14117250.jpg", "reviews": 41, "authors": [{"url": "https://www.goodreads.com/author/show/2310121.Rhiannon_Frater", "name": "Rhiannon Frater"}], "type": ["Paranormal", "Fantasy", "Fantasy", "Horror", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/14117250-pretty-when-she-destroys", "http://www.goodreads.com/book/show/22272713-pretty-when-she-destroys", "http://www.goodreads.com/book/show/18398966-pretty-when-she-destroys", "http://www.goodreads.com/book/show/20165812-pretty-when-she-destroys", "http://www.goodreads.com/book/show/9648068-the-first-days", "http://www.goodreads.com/book/show/6350211-fighting-to-survive", "http://www.goodreads.com/book/show/6718719-siege", "http://www.goodreads.com/book/show/12295280-as-the-world-dies", "http://www.goodreads.com/book/show/13581917-the-last-bastion-of-the-living", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}