{"ratings": 109909, "userreviews": [{"userName": "Karin Slaughter", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/10901279-karin-slaughter", "userReview": "Authors are always asked where they get their ideas, and the truth is that most of the time we don't know. An idea is a weird thing--usually, it's like a grain of sand that your brain worries into a pearl. When did the sand start to turn into something shiny and beautiful? No way to know.WIth PRETTY GIRLS I actually know when I got the idea. Maybe it was somewhere in the back of my brain all along, but I actually woke up from a dream and had the idea firmly in my head (okay, that doesn't tell you where it comes from, but that's as close as I can get. Oh, and can I add that I was taking Tramadol for a slipped disc, so maybe that had something to do with it?)Anyway, I loved the idea so much that I scrapped the book I had planned for this year (2015*) and started working on the storyline for what became PRETTY GIRLS. I was on fire, I tell ya! The characters were so firmly cemented in my mind by the time I sat down to write the first scene that it was almost like I was taking dictation.You'll probably hear a lot about characters and the literary merits (ha ha, I hope!) but make no mistake--at its heart, this book is a thriller. There are lots of twists and turns and all the stuff that folks have come to expect from me. The only thing missing is cops. Not that there aren't cops in the story (because they usually show up when there's a crime) but the narrators are just two ordinary women who are thrown into extraordinary circumstances. The real question is whether or not they can rise to the occasion (or will they make it at all?)I really hope y'all enjoy the book. And don't worry--the next book for 2016 will have Will Trent and Sara Linton. I appreciate your patience because I know y'all love Will and Sara, but long-time readers will know what happens when I get bored and I wanted to take a knee on Will and Sara so that I could take time with the next phase of their stories together. *wahhhh!!!! WHEN DID I GET TO OLD????"}, {"userName": "Deanna ", "userReviewDate": "Sep 24, 2015", "userURL": "http://www.goodreads.com/user/show/15662887-deanna", "userReview": "In 1991 Julia Carroll disappeared. Her body was never found. In the following years the family coped in very different ways. The mother while forever quietly grieving, moved on and made a new life for herself. The father spent years looking for any clue as to what happened. Sisters Claire and Lydia grieved in very different ways and were estranged having not spoken in many years. Now over twenty years later, there has been another disappearance of a teenage girl and a murder of a middle-aged man that seem to be connected. This causes the sisters to reunite. I have found that over the last year I've read quite a few stories about missing girls/children etc. Although this book is about WAY more than a missing girl. There is so much going on in this book right from the start. The twists start early on. This book really shows how a crime affects everyone involved. How differently everyone copes, not just when the crime is first committed but how it can shape the actions and futures of all involved. At the very beginning I found it a little difficult to get all the POVS straight. However, I was quickly drawn into the lives of these women and other characters, trying to figure out how the many separate story lines connected.After I was well into the book I started to realize that the gruesomeness might be too much for me. I was starting to skip over the descriptions (very graphic descriptions) and feeling quite bothered. Other readers may not have an issue with it but I just felt a bit overloaded with details of such horrific acts. I ended up having to skip over quite a few parts.I understand it's a thriller and it was to show just how much of a monster certain characters were but it's rare that I have to skip so much or put down a book because I'm so horrified. In my opinion gruesome violence overkill. At the same time the authors ability to describe other things and situations so well kept me intrigued as to what was going to happen next. At certain parts I was literally holding my breath as things were unfolding. Just like watching a horror movie and yelling \"don't go in there\" to the person on the screen I wanted to yell similar things at Claire and Lydia. Throughout the book my heart hurt for all of the families. I can't even imagine some of the things described happening. There really are some things that can't be unseen. Heartfelt and heartbreaking you could feel the love Sam had for his family as he bared his soul in letters to his missing daughter. The end was quite moving, so I am glad I finished the book. However, I don't know that I would put myself though that again. It was just a bit much for me. I may consider reading some of Karin Slaughter's other books but I will choose wisely."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Mar 10, 2015", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "My reaction to learning a new book was out by one of my favorite authors.A new Karin Slaughter!!!!!!!!My reaction after reading this book.\nI love this author. I fangirl so hard over her Grant County/Will Trent books so much that if I go anywhere that has them I must be restrained from recommending that people read them. Yes, Library ladies I will try and behave.But this one. Not.It didn't even feel like it was written by the same author that I love.It starts off with Claire Scott. She is a typical Buckhead Barbie \nPerfect husband, lots of money, no job. Just looking pretty all day.Then she meets her husband Paul for dinner one night. As they are leaving old boring Paul wants to put some moves on her in a dark alley. Claire is a bit freaked out that Paul is up to this because he usually doesn't get frisky unless it's in the actual bedroom, so she wants some spark and follows him to the alley. A bad guy attacks and Paul is murdered. (This is not a spoiler because it happens very early and won't ruin any of the book)Once she returns home Claire gets to looking on Paul's computer for some files that his business partner wants and she finds way more than she bargained for. Now this is happening in the middle of so much other stuff that your mind is racing at this point of the book. You have Claire's sister Lydia telling some of the story from her viewpoint, a break in at Claire's house, and a sister that had gone missing years ago. Then throw in another recent missing girl from the area.So much going on. Then the tropes started...\n\n\n\nThen throw in about a thousand times on how very beautiful our main character is...she is pretty and smart. *insert gag here*\n\n\nThat got old real quick. Karin Slaughter is usually better than this. So I gave one of my favorite authors a two star review. Does that mean I will not grab up her next one? Of course not. I will fangirl the next time. Hopefully.Book source: Edelweiss in exchange for review."}, {"userName": "Chelsea Humphrey", "userReviewDate": "Sep 23, 2015", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "I just want to start by saying I don't want to list any spoilers here; I think this book was so powerful that I would hate to discourage someone from reading it because I took away from their experience before even beginning the book.Wow! This book was heavy. I just can't think of a better word to sum up how I feel after finishing this. I'm glad I spaced it out instead of devouring it like I wanted to initially. I've seen many people torn on this book and I understand why; it is EXTREMELY graphic and disturbing. Content and descriptions. I know some of the subjects are triggers for many people, especially women. For me, I felt the extreme graphic violence was necessary to put the power behind the punch of the storyline. I have felt lately that nothing really \"shocks\" me in a book anymore, almost like I've read too many graphic stories. This one was different.The plot is connecting the stories of 2 young women who have gone missing decades apart- Julia Carroll and Anna Kilpatrick. Without giving too much away, the journey is told from the viewpoint of Julia's two remaining sisters- Lydia and Claire, while inserting occasional diary entries from their father, Sam Carroll.I loved the layout of how the story was told; the diary entries interwoven between chapters of the current storyline. I had to go back once to reread because it was so clever. I think we can all agree whether we like her brutal style or not that Karin Slaughter is an excellent storyteller and master of her craft. I'm an avid fan but am willing to admit that in her previous standalone, Cop Town while a great story, had a bit of excess descriptive fluff IMO. I was pleased to see this one didn't seem to have that; I felt every word was needed. I found myself literally holding my breath and sitting upright at times.I felt she did a good job relaying the anguish of a family who has lost a child. A loss this deep affects everyone and it literally tore them apart. I did feel it a little hard to connect with Lydia/Claire at times and I really would have liked to have seen a little more development with Rick and Dee. One of my favorite chunks of the book was near the end with Helen and Claire as we are reaching the climax of the action; I felt this was the most well written part of the entire book. Overall, I wavered between giving this one 4-5 stars and ended up rounding up. I felt this book was extremely well written, the story kept my attention constantly-this is the definition of a suspenseful thriller. While the graphic violence was extremely disturbing, I felt it did not distract me from the story (personally) but can understand why it would have for anyone. Overall, if you are a Slaughter fan, I would HIGHLY recommend. If you are new to her as an author, I would recommend starting with Blindsighted in the Grant County series."}, {"userName": "Mandy", "userReviewDate": "May 30, 2015", "userURL": "http://www.goodreads.com/user/show/30940542-mandy", "userReview": "This book was so damn freaking spectacular that I don't even know where to start. This has climbed to the top of my list as my favorite psychological thriller ever. This tops Dark Places and That Night and I never thought that would happen! For any book to triumph over those is a win for me :) although they are still right behind this book.I've never read a book like this. There are so many twists and turns a race car driver would have trouble navigating. I literally cannot stop thinking about all of the people and events in this book. I went into it with just the knowledge that this was about a woman and her sister that hadn't spoken for years and that was about it. Holy moly did this get good!I simply cannot say enough good things about Pretty Girls. The plot is terrifying yet makes you want to read on because you have to know what happens. Literally every chapter gives you a new twist. The characters are so real I could picture them inside of my mind as I read and the scenery... I could see it all.Karin Slaughter knows how to write a terrifying mystery. If I could give this 100 stars I would.It needs to be made into a movie for sure. It would have record breaking ticket sales!Go read this. NOW!"}, {"userName": "Emma Giordano", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/30604861-emma-giordano", "userReview": "4.5 stars. This book truly blew me away. I was not a huge fan of the story in the beginning but once it picked up, I could not put it down.CW: murder, violence, gore, torture, rape, assaultThis novel is straight up disturbing and horrifying. I don’t believe I have ever read a more graphic and chilling novel. As someone who spends a decent amount of time listening to readings of “dark web stories” and other horror stories on YouTube and scrolling through reddit threads like /letsnotmeet and /nosleep, this book fed into my fascination with wickedness in humanity. This book is truly not for the faint of heart. It is sick and twisted and surely will leave a lasting impression on all readers.After reading The Good Daughter as well, I can say with confidence that Karin Slaughter is extremely talented at writing complex family dynamics. I loved learning about Claire and Lydia’s history, uncovering the reason behind their falling out, and watching them piece their relationship together in the direst of situations. The beginning of the novel did not totally grasp me. The plot was a big slow to start as we are introduced to the characters and it took me a bit of time to really become engaged with the story. For me, there was not one particular moment that hooked me so I was surprised to find that at some point during reading, I just could not put the story down. This novel quickly transforms from mundane to thrilling and chilling and I’m so pleased I continue through the end.Pretty Girls was a truly fantastic read. I would definitely recommend it to my fellow lovers of thrillers, but more specifically to those who can stomach heavy, grotesque content."}, {"userName": "Will Byrnes", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "The world stops for you when you’re pretty. That’s why women spend billions on crap for their faces. Their whole life, they’re the center of attention. People want to be around them just because they’re attractive. Their jokes are funnier. Their lives are better.\nWell, there might be some downsides. Pretty Girls is a white-knuckle thriller that will keep you turning the pages long after you should really have gone to sleep. Do not read this while on a train. You will miss your stop. The story is told from three alternating perspectives. Claire Scott, newly free of that nasty ankle-monitor, has a pretty good life. 38, in great shape, no kids, a studly, attentive hubby who makes much more than a decent living, cool digs. What’s not to like? After a celebratory dinner out, Paul wants to do the nasty in an adjacent alley, way out of character, but, whatever. But sorry, no nookie for you guys. An armed, tattooed criminal element sort robs them. Things go too far and Paul winds up on the sidewalk, tinting the pavement with considerable quantities of red, and the game is afoot. What Claire discovers in going through her late mate’s computer files after the funeral will rock her world. Lydia Delgado’s life is somewhat different. Single mother, 41, struggling to get by, alienated from most of her family, runs a dog grooming business. Her past would not look very nice on a resume. She’d hit rock bottom a while back and lived there for a spell, with a pick and shovel. But these days she is respectable. Owns a dog-grooming business. Met her pretty nice bf in a 12-step program. Her teenage daughter is a peach. Lydia is on the wrong side of pudge these days, with an addiction to the sort of culinary drugs that come in crinkly bags at supermarkets. Life’s a bitch and then you diet. Lydia used to be a looker. Not surprising, really. Her sisters were easy on the eyes too, but one vanished when she was 19, never to be seen again, and the other one just saw her husband get killed. Sam is a determined sort, bulldog with a bone. He never believed the official cop line that his Julia had simply run away. So he dedicated his life to finding out what had really happened to his eldest daughter. It cost him his marriage, and maybe even more. We see the progress of Sam’s investigation through his journals, from the time when he was on this quest. Claire and Lydia’s adventure takes place today.The two sisters join forces to continue searching for the truth about Julia’s disappearance, and must face the consequences of Claire learning some very disturbing secrets about her husband.Karin Slaughter - from her FB pagesKarin Slaughter is not new to the best-seller lists, having sold more than 30 million copies of her crime books in 32 languages. She was born in a small Georgia town and now lives in Atlanta, where Pretty Girls is set. Her books include six in the Grant County series and nine in the Will Trent series, set in Atlanta. She was working on another book entirely when the notion for this one occurred to her in a dream, so she checked in with her publisher, put the planned book on the back burner and dove into this one. There are several elements at work here. In a book of this sort, if you are not engaged by the characters, the rest does not much matter. Lydia certainly has had her troubles in the past, but she is pretty supportable now, finding her best self in this worst of times. Claire makes us wonder how she could have buried her head in the sand for so long, ignoring what look like warning signs to us. But in wondering, it is worth keeping in mind that we are all sand-dwellers, from the neck up at least. Maybe it is an innate and useful skill to be able to simply ignore warning signs of peril. If we recognize them then we might have to do something about them, which entails personal risk, of either physical or emotional harm. Most of the time most of us prefer to keep a lid on things. Thus we live to ignore another day. So it feels entirely credible that reasonable people can overlook behavior that might stand out to an external observer. Particularly in Claire’s case, as she has tried to keep her head down in most situations for most of her life. We can see her vulnerability, however cloaked it may have been, and can easily feel for her. In addition we see the characters develop over the course of the tale, Claire moving from passive to assertive and Lydia moving from nobody to a sort of anti-hero. Family dynamics plays a major part in the sisters’ struggle, both to find the truth and to find a way back to sisterhood across a very large distance. Check.The story must be engaging. Will Claire and Lydia find out what really happened to their missing sister? Does Sam? Do we care? If you can’t empathize with this as a driving force, it must be because you are too busy torturing kittens. Check.Pace must be maintained. Slaughter must have a metronome that is set for increasing tempo. Check. The baddie must be truly scary, and up to some really awful stuff. You have no idea. CheckThe hero/heroine(s) must face believable peril. Is it possible that one or more of our core three might come to harm of the terminal sort? You betcha. CheckA thriller is never without a bit of misdirection, a few fish-hooks hoisting red-herrings for us to consider. Yep. Get your scaling tools ready. Check.And there is that old favorite, the twist. Let’s just say that Chubby Checker would be pleased. Check. Wait, what’s that? My advisors inform me that not everyone will appreciate my lame boomer refs, so, fine, whatever. For you kids out there, ok, rewind. Start over. Twists. Let’s just say that after reading this book, I was in need of a good neck brace. Ok? Sheesh.Finally there is the issue of payload. That is the extra information one learns about the world in reading a work of fiction. I suppose there is a bit of that here. I have no idea if the awfulness that is depicted in Pretty Girls (aside from Paul’s questionable taste in décor and labeling) has a real-world basis. Although it does seem that if one can imagine a particularly grotesque form of depravity, there is probably someone, somewhere who is practicing it right now, and with so many folks on the planet, probably more than a few. So if the book is highlighting some actual form of human awfulness, then bad-a-bing. Check Gripes. You knew there would have to be one or two. The title, Pretty Girls suggests that those on the 10 side of life are more at risk than those closer to the 1 end of things. The theme of prettiness is noted with frequency early on, in comments on the attractiveness of some and the unattractiveness of others. Slaughter seems interested in giving some serious thought to how people react to beauty and to how the beautiful react to the world. Certainly there is peril about for those blessed with pleasing countenances, whether it comes from a wicked witch or the ravages of time. She keeps up the mentions for a while, sometimes offering actual insight. But then it seems to fade, as if she had run out of things to say about prettiness, until it is brought back into the spotlight for a final bow or two. Like, oh, the title is Pretty Girls. I guess I should put something in here to give that some closure. It looked totally like an afterthought. I thought this could have been better handled, maybe spread out a bit more, maybe dig a bit more than skin deep. But that is a quibble. No one is going to read this book to get enlightened about beauty. My second gripe will have to be a bit clouded. I don’t want to spoil anything. I found the particular fixation of the baddie on the specific group that is targeted curious. Why did this person focus on these targets? I did not get that there was a particular reason why the baddie was so set on this particular subset of victims. Perhaps the significance of this is in the eye of the beholder? But no matter, really. The bottom line here is that you will be ripping through this book, dying (well, almost) to see how things turn out. Pretty Girls is an outstanding thriller, a very engaging, entertaining, and disturbing read, and that is a beautiful thing. Review posted – 7/31/15Publication date – 9/29/15=============================EXTRA STUFFLinks to the author’s personal and FB pagesHow serial killers choose their victimsThe Advantages of Being Beautiful---8 Scientifically Proven Reasons Life Is Better If You're Beautiful  – by Dina Spector in Business Insider---A Smithsonian article on  How Much is Being Attractive Worth - by Abigail Tucker---10 Pleasures and Pains of Being Beautiful by Dr Jeremy Dean on PsyBlogA lovely audio interview with the author by Steve White of Literary Week. The sound levels are off a bit, his volume being too loud relative to hers, but it’s worth putting up with.====================================SONGSOffering a bit of further discomfort, after reading this book you might find some of these listens a bit disturbing Pretty Woman  – Roy Orbison and friends Oh You Pretty Things  - David BowiePYT (Pretty Young Thing) - Michael JacksonYou’re Beautiful – James BluntYou are so Beautiful– Joe CockerAnd the all time best stalker theme song - Every Breath You Take - The Police"}, {"userName": "Candace", "userReviewDate": "Jan 24, 2016", "userURL": "http://www.goodreads.com/user/show/16384209-candace", "userReview": "Check out more of my reviews at www.bookaddicthaven.comWow! This was one dark and disturbing story. I love dark reads, but this was pretty gruesome for me at times. I was at the edge of my seat from start to finish with this one. I even had nightmares about this book. As I start to write this review, just thinking about it is giving me the chills. It was just that messed up.When Claire Scott is widowed by her wealthy, seemingly perfect husband, she is left to pick up the pieces. With the FBI and the local police showing a suspiciously high interest in her husband's murder, and the subsequent break-in at their home, Claire does not know what to think. When she stumbles upon some computer files of her husband's, she begins to question the very foundation of her marriage and what she really knew about the man she married.From beginning to end, this book was full of twist and turns. Everyone was a suspect at some point and you never knew who you could trust. As Claire partnered up with her estranged sister, Lydia, to try and sort through the clues her husband inadvertently left behind, the truth seems to become less and less clear. Claire's husband, Paul, was not who he said he was. He had secrets...big secrets. The more the sisters unearth, the greater the danger. They can't turn back, but they don't know where to turn for help either.At the center of this book is a string of missing teenaged/college-aged girls, including Claire and Lydia's own sister, Julia. Unsolved disappearances with undeniable commonalities, which all somehow connect back to Paul. Everything is not as it seems though. Claire begins to suspect that there is involvement at the highest levels, protecting those responsible for these horrible crimes.If you like psychological suspense/thrillers, then this is a great story. Be forewarned, this book is very graphic and downright gory. It contains detailed descriptions of barbaric torture, sexual assault and murder. The sick and twisted actions of this serial killer are not left to the imagination. If you cannot handle the graphic descriptions of torture, then this is not a book for you. I'm a big fan of dark stories and it gave me a nightmare or two.Overall, I thought that it was a fantastic story. It was suspenseful and kept me in a hyper-vigilant state until every question had been answered. I had chills while listening to this story. This has got to be one of the most screwed up, disturbing stories that I've \"read\". I listened to the Audible version of this book and it was great. The narration was well-done. I found it to be an excellent audiobook selection that was easy to follow. The mood and emotions were conveyed clearly, which is sometimes hard to come by in an audiobook. I could almost touch the fear and the anxiety in \"Claire's\" voice. Kudos to the narrator(s)."}, {"userName": "Aestas Book Blog", "userReviewDate": "Oct 07, 2015", "userURL": "http://www.goodreads.com/user/show/5604583-aestas-book-blog", "userReview": "::: FULL REVIEW NOW POSTED :::: HOLY HELL. So, I just spent the last 2 days reading this awesome book. It went waaaaaay the freaking hell outside of my \"usual\" reading preferences. The genre is more of a \ncrime thriller\n (no romance) which I almost never read but this particular blurb really grabbed me. So I opened the book. By the end of the prologue, I had CHILLS running through me and tears in my eyes.... So, I had to read it!!! And honestly I loved it!!But you guys, it is NOT for the faint of heart. The story starts out small but the \"mystery\" just gets deeper and deeper and deeper. And every new thing you discover is this whole other level of creepy.Please note that there is graphic violence in this book (not a lot in terms of content, but what there is will make anyone shudder and cringe. However, if you're used to watching TV shows like Criminal Minds or CSI, you'll probably be ok to read this (it's kind of on the same level that they have). But it's still very seriously  G.R.A.P.H.I.C.  and genuinely disturbing at times. Please be warned.This is also a book with absolutely no fluff. You can't skim anything because you'll miss crucial elements or reveals. It's intricate and layered. This author clearly spent a great deal of time plotting out her story before writing it because everything happens for a reason, every piece of the story has a purpose, and by the end, they all fit together. One reason I'm always wary of thrillers is I rarely find them satisfying but this book gave every single answer to every single question. I'm a fast reader and will usually breeze through full-length book in an afternoon but it took me 2 days to read this (3 technically since I read the first 10% one night, and the rest over 2 days) because there was just so MUCH going on in it...*deep breath*First, I'm going to share the blurb with you (because it was the blurb that made me want to read it):\nSisters. Strangers. Survivors.More than twenty years ago, Claire and Lydia’s teenaged sister Julia vanished without a trace. The two women have not spoken since, and now their lives could not be more different. Claire is the glamorous trophy wife of an Atlanta millionaire. Lydia, a single mother, dates an ex-con and struggles to make ends meet. But neither has recovered from the horror and heartbreak of their shared loss—a devastating wound that's cruelly ripped open when Claire's husband is killed.The disappearance of a teenage girl and the murder of a middle-aged man, almost a quarter-century apart: what could connect them? Forming a wary truce, the surviving sisters look to the past to find the truth, unearthing the secrets that destroyed their family all those years ago . . . and uncovering the possibility of redemption, and revenge, where they least expect it.Powerful, poignant, and utterly gripping, packed with indelible characters and unforgettable twists, Pretty Girls is a masterful novel from one of the finest writers working today.\nAnd next, I'm going to actually show you guys all my status updates now (NO SPOILERS) so you can sort of see what I went through while reading it... (haha, sorry, I can get a bit sweary sometimes) 2% -- What an amazing prologue!!! I have chills, shivers, tears. Totally hooked! \n   3% -- So INTO this story!!!! \n   5% -- Ok I'm seriously freaking out. Can I handle this?? I'm a romance reader, dammit. I need my swoon (even my dark reads have swoon!!!) and this is freaking me the fuck out!!!!! *keeps reading* \n   6% -- FUCK. dammit. holy crap. Am I strong enough to read this?! Let's find out *eyes book warily* \n   7% -- SMART SMART SMART BRILLIANT FUCKING WRITING!!! \n   8% -- okayyyyyy, did NOT see that reaction coming. That must be one helluva history they’ve got there for THAT to be her reaction. O.O \n   10% -- chills and shivers again. How amazing is this writing?? I hate that I have to go to bed now because I want to keep reading!!\n 11% — back to reading today. I've seriously been more surprised, shocked, impressed, intrigued, in the first 10% of this book than I have been by most complete books! \n   16% — Woah. Wait, she did WHAT now?? \n   16% — Holy freaking fuckkkkkkk *GAAAASP* Well that just about calls EVERYTHING into question. \n   19% — I love the attention to detail. Like how the sister of a girl who’d been abducted would then take natural precautions in her life — like teach her child how to change a tire so she’d never be stuck on the side of the road, or always scan the parking lot before unlocking the car doors. Smart! \n   24% — my brain is overloaded with theories right now. SO MANY possibilities! \n   26% — red pill/blue pill <-- love that reference \n   29%— such an interesting line.“He isolated her.”“Sounds like a classic abuser.”“As far as I know, he never hit her or even raised his voice at her. He just kept her.”\n 32% — Ahhhhh, love this!!! “He had been so very, very cunning, hiding all of his transgressions in plain sight. The only question now was how many more transgressions was she going to find?”\n 34% — holyyyyyyy shit. no WAY!! \n   36% — yeah, I’m with Lydia on this sentiment: “What the fuck, Claire?” She stared at Claire with open shock. \"What the fucking fuck?”\n 37% — hehe that was badass. “I’ve never told anyone this... but it felt so fucking good to be bad.”\n 39% — ****spoiler removed**** I really wish I could share that line with you. SO GOOD! \n   44% — this just gets more and more complex …. like woah!\n 47% — Ok, I actually have a secondary theory which explains 95% of everything. But that other 5% is still weirding me the fuck out!!!  (note: I was wrong about this theory, guess that darn 5% mattered) \n   53% — “I can’t just walk away from this. I have to know. There isn’t anything left in my life except finding out the truth.” <--- my sentiments exactly! *keeps reading* \n   55% — holy. freaking. HELL. ****** GASP *******Okay. WARNING: this book is graphically violent. It's very similar in to Criminal Minds or CSI in terms of the level if you want a comparison point. \n   57% — NO. WAYYYYYYYYY. How????\n 67% — definitely not for the faint of heart. Fair warning, I literally just cringed away from the page.... and also OMG!!!!!!!!! O_O \n   68% — this story goes to show that you really don’t need a paranormal story to show true evil. Sometimes, humans can make the very worst monsters of all. \n   69% — Okay I’ve been reading this for the last 3 hours straight and I have to go to bed. This is definitely a book you have to FOCUS on. There’s no skimming or light reading or you’ll miss important facts. Its 421 pages and there is NO FLUFF. \n   70% — back to it (next day). This book is like one holy shit moment after another. And each pause between them only serves to build to the next jaw dropping reveal. \n   73% — “You haven’t talked to each other in twenty years and now you’re suddenly worried about her daughter?\" -- “Lydia is my sister. Even when I hated her, I still loved her.”\n 75% — ok seriously. This is pretty gruesome. If you’re sensitive to graphic violence, this book is not for you. Please be warned. \n   79% — holy exposition batman. I feel like I've just have this flood of information streaming into my head for the last few percents. It almost feels like this book will never end. I don't mean that in a bad way but there's just so much going on. \n   85% — Omg. I love her mom!!!!!!! That was pretty badass! \n   88% — Graphic, gruesome, disturbing, gory violence. Like seriously. stomach-turning. \n   97% — Just WOAH. That was an INTENSE last few percents. I feel like I've been holding my breath and just flipping pages like mad. And that scene though..... Karma is a bitch! \n   100% — Wow that last line. Wow! How strangely beautiful for such a chilling story as this. Definitely a beautiful way to end things. Loved the book! \n  Ok so without giving anything away, I'll just tell you guys that there is a very satisfying ending. Note again that this is not a romance (at all) but everything is wrapped up in the ending and actually the last line was absolutely perfect. Seriously, just really STRONG writing!Nothing about this book is 'expected'. Even the nature of the crime itself is one that I honestly hadn't ever seen before (at least not this extreme) on any crime-fighting TV show. *shudders* The story keeps you on your toes, catching you off guard with it's surprises over and over again. There's never a dull moment.The story is told in third person from three main perspectives. Claire and Lydia's (the two estranged sisters of the abducted girl from the 90's) perspectives that begin separately but entwine later on, and their father's -- though his was through forms of journal entries written addressed to his missing daughter. I found it fascinating the way it showed how much perspective mattered. One person could see someone as a monster, and to another person, they could be a savior. It was chilling.Karin Slaughter truly has some of the strongest writing I've read. Like seriously. It doesn't matter if you end up loving or hating the story, it doesn't change the fact that the writing itself is top notch. The reason I rare read other genres is that they're rarely able to hold my attention -- I crave the emotional connection in romances -- so it's a real testament to how good this writing was that I was that into this story.So, at this point I'm still a little in shock from this story, but I absolutely don't regret reading it and even though it was totally completely utterly different than my usual beloved romance reads, I loved this too (even though I'm honestly a little creeped out still, lol). It was a really fantastic \"change of pace\" read for me. Y'know? Sometimes you just need one of those. I like stepping outside my comfort zones every now and again to try something different. I find it kind of refreshes me for when I step back into my romance reads. Haha, buuuuuuuut I'm gonna need something light, sexy, and fun next!!!Really though. If you're into thrillers, definitely try this book. If you're not into thrillers but still curious, I'd recommend this as a great one to try because it's genuinely good. As I'm writing this, it was released last week and it actually hit #4 on the New York Times Best Sellers list this week. And yes, I know it's really expensive, which is why I never posted any updates while I was reading. I wanted to be sure I'd finished it and could actually stand by suggesting it before I began posting about it. But yes, it's definitely a great book and one I'd easily recommend for someone looking for a really solid read within this genre!Rating: ahhh I have no idea how to put these thoughts to a rating. I'm disturbed by the some of the content of the story but I loved the book and loved the writing. Can you guys just accept \"really freaking great thriller\" to be my rating, please? STANDALONE. CRIME THRILLER. (this is absolutely not a romance) _______________________________________ For more of my reviews, book news and updates:✦ Main blog: Aestas Book Blog✦ Facebook Blog Page✦ Twitter ✦ Subscribe by email"}, {"userName": "Megan Johnson", "userReviewDate": "Jan 22, 2016", "userURL": "http://www.goodreads.com/user/show/31853583-megan-johnson", "userReview": "What would you do if suddenly everything you thought you knew was ripped away from you and you were left to figure out how to make it all on your own? What if that wasn't all and you were also faced with uncovering the dark and wicked pasts of those you thought you loved?Karin Slaughter's Pretty Girls asks all of the questions and then answers them in the creepiest way I can imagine. It's been a while since I laid in bed at night hoping that what I had just read doesn't give me nightmares, but this one had me doing just that. Add that on top of the fact that I absolutely couldn't put this book down, and we've got a real winner on our hands.Pretty Girls is the story of two sisters, one whom has just found herself widowed and the other a single mother of a teenaged daughter. They've long been estranged but have recently found themselves in communication again. Little do they know that uncovering their past will uncover way more than they ever could have expected - including some new clues regarding the 20 years ago disappearance of their oldest sister.This book is full of twists and unexpected moments right from the beginning. In fact, after reading the first chapter I was able to notice that my heart was racing. After debating whether or not I could pass that off as my cardio workout for the day, I kept going and was sucked into the craziness that continued to transpire page after page. I do feel like I've read a lot of books recently that jump around in terms of POV (point of view), but after I got used to the flow of this one it was like putting together a puzzle in terms of connecting all of the pieces. And just as you might a puzzle, after I completed it I found that everything finally made complete sense...which is so gratifying.Fair warning, this book is very much a thriller and contains graphic moments of sexual content and violence. However, that's part of what makes it so enthralling within it's genre. I might be too much for some to handle but if you're up for it, I can't even begin to recommend this book enough.WEBSITE | TWITTER | FACEBOOK | INSTAGRAM"}, {"userName": "Katie", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/8106992-katie", "userReview": "Nothing like finishing one of the goriest books I've ever read on what some say is the holiest days of the year. Happy Easter!!!!"}, {"userName": "Kaceey - Traveling Sister", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/13442817-kaceey---traveling-sister", "userReview": "So incredibly good!The shattering of a family as told from the perspective of the remaining members. Julia goes missing one night at age 19, following an evening out with her college friends to a local bar. Julia's 2 sisters Claire and Lydia, grow up in the shadow of her disappearance and take different paths in their lives. 24 years later her family remains in shambles. A recent, tragic event brings Julia and Lydia back together. Can they finally discover what happened to their sister? Shocking, disturbing, riveting. Can one feel all three at once? Get ready…this book takes you through all three emotions and more. Not for the faint of heart. If you like your thrillers a little dark and edgy then you will absolutely love this one!I was gripped by the story immediately, though I had no clue what direction I was being taken. Felt like a slow ride up a roller-coaster, where you know the story is building and once you reach the top it's all going to break free and explode at breakneck speed. And that's exactly what happens. What a great ride!"}, {"userName": "Carol", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "\"When you first disappeared, your mother warned me that finding out exactly what happened to you would be worse than never knowing.\" Oh. How. True.PRETTY GIRLS is a story about the unexplained disappearance of one missing sister (of three) named Julia, and the devastating after-affects of her loss. It is also a story about a sick and sadistic psychopath who works his evil in despicable ways that are graphically described within these pages which should serve as a warning to those opposed to reading such violence.The story pulled me in right from the start, but was a bit confusing with regard to character connection for a bit until \"something\" happens in the alley that drew me back in, sorted out the players and kept my interest till the gratifying end.Haven't read a Karin Slaughter novel in a very long time, but this stalker murder-mystery is a hell of a thriller with one hell of a shocker.....or two."}, {"userName": "Luffy", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/7407364-luffy", "userReview": "You know you're getting long in the tooth when the book you're reading has a distant past set in 1990. That was the year I joined high school. The past has many treasured memories that I hold dear. But in many ways life was harder than now in societal terms.Which leads us to this book. Pretty Girls is a story written by the talented Karin Slaughter, and the recurring feelings she conveys to us are full of pathos. But she also does a professional job of thinking of convoluted and complex ways to make her story seem plausible. Check. And enjoyable. Check.There are revisits to the past. And there are multiple POVs in the book. I realize how difficult it is for a normal human being to keep writing books like this. But among a very small percent of wannabe writers, only a small pool of talent is able to maintain the kind of pacing that this book has."}, {"userName": "Emily (Books with Emily Fox)", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/58160628-emily-books-with-emily-fox", "userReview": "This book is full of violence and rape so it's not for everyone!Unpopular opinion but I didn't like this book. I did listen to it as an audiobook which might not have been the best idea."}, {"userName": "Maxine (Booklover Catlady)", "userReviewDate": "Jun 15, 2015", "userURL": "http://www.goodreads.com/user/show/22943325-maxine-booklover-catlady", "userReview": "I've been late to the table as a Karin Slaughter fan, hard to believe as a crime fiction lover. I adored her book Cop Town and was excited to read this new stand alone thriller.With a missing girl in the news, Claire Scott can’t help but be reminded of her sister, who disappeared twenty years ago in a mystery that was never solved.But when Claire begins to learn the truth about her sister, nothing will ever be the same.I found this book to have an interesting plot if somewhat up and down in pace. Karin is without question an outstanding writer and all of her books have depth and detail that keeps you well aware of what's going on.I enjoyed more aspects of the plot than others but I'm not sharing any with you, so there. The characters are all very well done, enough damaged characters to keep me happy.The concept of finding out your husband is not who you thought he was has been tackled a lot in many genres of books but Karin tackles it from a very chilling and disturbing angle. I've been through this experience personally (not the version in the book thank God!)It's a book full of psychological twists, enough to keep to wondering, guessing and wanting more. I think this stand-alone book of Karin's may attract a new legion of fans discovering both her new books and the many successful books that have gone before.4 paw prints from Booklover Catlady for this one. Highly recommended reading!For more of my reviews find me at:https://www.facebook.com/BookloverCat...Follow me on Twitter! I talk back!https://www.twitter.com/promotethatbook I received a review copy if this book thanks to the publisher via NetGalley in exchange for an honest review."}, {"userName": "Linda", "userReviewDate": "Mar 03, 2015", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "I've not read anything before by Karin Slaughter. Believe me, this was probably not the one to start with. The subject matter is heavy, heavy, dark, dark.Ms. Slaughter can give you precise, intricate details of a crime like no other. She makes you feel like you are watching your foot placement as you tread through the crime scene with bated breath. Your brain is filled with such terrible imaginings.This story focuses on a missing sister from the past and a missing girl of the present. Karin Slaughter writes with such emotion that peels away the deep and the hidden secrets that a family has carried for years and years. It deals with the agony of a father through his journals and we, as readers, are privy to such unspeakable loss that ripples across the pages.This is not just the telling of a horrendous crime. It is the fracturing within a family that chistles away at all that we hold precious and untouchable. This book leaves you totally unsettled within. Be prepared for that......"}, {"userName": "Elyse", "userReviewDate": "Jul 20, 2015", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Before the story begins, there is an inscription by Carl Jung...\"A Particularly Beautiful Woman Is A Source Of Terror\"\"Missing teenage girl. White. Middle class. Very Pretty. No one ever seemed quite as outraged when an ugly woman went missing\".\"Tragic, she was so beautiful\". \"You were nineteen years old. Legally, you did not belong to us anymore\". \"This is what we knew: You were in a bar. You didn't drink any more than usual. You told your friends that you weren't feeling well and that you were going to walk home and that was the last time anyone ever reported seeing you\".Men can be \"voracious gluttons who devour every part of a woman, then clean their teeth with the bones\".Attractive Pretty Women... 'Beware'! 3.7 rating Thank you, William Morrow Publishing, Netgalley, and Karin Slaughter"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Aug 24, 2015", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/I straight up chucked this book to the side waaaaaaay back in August for daring to mention the two words in the English language I hate the most . . . PUMPKIN SPICE. Seriously people, enough is enough . . . \nI mean really, a combo of nutmeg and cinnamon is what will destroy this world. Have you ever watched a cinnamon challenge? A tablespoon of the stuff is enough to murder you. Anyway, now that the season which shall not again be named has passed, I’ve moved on to better things - specifically, peppermint mocha . . . \nand I started this book over.I believe my friend Mauoijenn summed it up best in her review. At the end of the day this was just another whodunit. Up to the 50% mark things were fairly awesome. There were multiple storylines/points of view, a girl missing in the present/a girl missing in the past, a dead husband, a little . . . . \nI was flipping pages as fast as my fat little fingers would move and thinking FINALLY a thriller that’s really keeping me on the edge of my seat. But then I realized there were still 200 more pages to go and the story could (should) probably be wrapped up in 50 or 75. And then????? Everything went right in the toilet. Here’s the problem with “mysteries” like this (told via giffery): To begin with . . . \nSad but true. Who in their right mind discovers some superbadawful and decides they’re going to Jessica Fletcher the f*&^ out of it?????\nThat’s right, Jessica. Nobody.But, let’s play devil’s advocate and say they do. Can they not be so f-ing stupid in the process?????\nReally. No one wants to read a “thriller” that plays out like a B-Horror movie . . . \nEspecially when everything culminates in this moment . . . \nand instead of doing what should be done in that situation . . . \nYou morph from someone who is supposed to really know how to handle a crisis because of [REASONS] into nothing but a dumb bimbo . . . . \n(You’re welcome, Lono)Bottom line is this was alright for a rainy day, but it had sooooooo much more potential than was actually delivered. ARC provided by NetGalley in exchange for an honest review. Thank you, NetGalley!"}, {"userName": "Brenda", "userReviewDate": "Jan 15, 2015", "userURL": "http://www.goodreads.com/user/show/5240149-brenda", "userReview": "Construction: I read Chapter i and thought it was a prologue. I read Chapter 1 and Chapter 2 and then there was Chapter ii. I had to stop to look at the construction of this book. I went back to re-read Chapter i then read Chapter ii, and I was just blown away. Chapter ii is a brilliant piece of writing!Characters: The major characters are two parents with three teenage daughters. Julia, who we met in the Blonde Hair, Blue Eyes novella, goes missing at the age of 19. Father Sam who never gives up hope, mother Helen who shuts down, Lydia who derails, and Claire who becomes invisible. We also meet Claire’s eventual husband, Paul. We get to know this family very well. Plot: Julia is never found. Is she a runaway or was she abducted? Will the family ever know? This is pure torture for them, and they are in a living Hell. The plot is intricately woven. There is information that Slaughter gives, but is it trustworthy? It might be from a newspaper, or hearsay, or rumor. But later, she gives you incontrovertible proof and it brings an “a-ha” moment. There are characters that appear genuine, but are they really? I was as confused as Claire as to who she could trust.I give you four letters. I-V-L-E. There are evil people in this world. The things they do are vile. They live among us. There is only a thin veil between us and them. Slaughter pulls the veil aside, and her villains and their acts are extremely sickening.In my opinion, this is the best book Karin Slaughter has ever written. I think it is award-winning quality."}, {"userName": "Sandy *The world could end while I was reading and I would never notice*", "userReviewDate": "May 28, 2015", "userURL": "http://www.goodreads.com/user/show/30817744-sandy-the-world-could-end-while-i-was-reading-and-i-would-never-notice", "userReview": "EXCERPT:'...a new mantra came into her head - barbed wire. Pry bar. A length of chain. A large hook. A sharp hunting knife. A moment of clarity broke through the clouds in her mind. They were close to the end.'ABOUT THIS BOOK: #1 internationally bestselling author Karin Slaughter returns with a sophisticated and chilling psychological thriller of dangerous secrets, cold vengeance, and unexpected absolution, in which two estranged sisters must come together to find truth about two harrowing tragedies, twenty years apart, that devastate their lives.Sisters. Strangers. Survivors.More than twenty years ago, Claire and Lydia's teenaged sister Julia vanished without a trace. The two women have not spoken since, and now their lives could not be more different. Claire is the glamorous trophy wife of an Atlanta millionaire. Lydia, a single mother, dates an ex-con and struggles to make ends meet. But neither has recovered from the horror and heartbreak of their shared loss—a devastating wound that's cruelly ripped open when Claire's husband is killed.The disappearance of a teenage girl and the murder of a middle-aged man, almost a quarter-century apart: what could connect them? Forming a wary truce, the surviving sisters look to the past to find the truth, unearthing the secrets that destroyed their family all those years ago . . . and uncovering the possibility of redemption, and revenge, where they least expect it.Powerful, poignant, and utterly gripping, packed with indelible characters and unforgettable twists, Pretty Girls is a masterful thriller from one of the finest suspense writers working today.MY THOUGHTS: This is a gut-wrenching, heart stopping book. I gasped. I stuffed my fist in my mouth. I held my breath. I, at times, could not believe what I was reading. I would not have missed reading this book for the world. By the time I got to the end, I felt like I had been shot out of a cannon.I even learned a new word (and there is nothing I like better!).What connects the disappearance of a teenage girl and the murder of a middle-aged man, almost a quarter-century apart?More than twenty years ago, the disappearance of Claire and Lydia's 19 year old sister Julia tears their family apart. Sam and Helen divorce, Helen becoming semi-alcoholic, Sam obsessed with chasing down his daughter's abductor. Lydia turns to drugs, is estranged from her family, and Claire marries Paul, the perfect man.When Paul is murdered in front of her eyes, Claire's world is shattered, and Lydia, who has turned her life around, feels her world teetering when Claire reaches out to her.But nothing is as it seems and the family will once again face having their wounds ripped open as Claire's world is turned upside down.This is just the sort of earth shattering read we have come to expect and love from Karin SlaughterThank you to NetGalley, Random House UK, Cornerstone for the gift of this book in exchange for an honest review. All opinions expressed in this review are entirely my own personal opinions. Please refer to my Goodreads.com profile page or the 'about' page on sandysbookaday.wordpress.com for an explanation of my rating system. This review and others are also published on my blog sandysbookaday.wordpress.com https://sandysbookaday.wordpress.com/..."}, {"userName": "Vane J.", "userReviewDate": "Jul 31, 2015", "userURL": "http://www.goodreads.com/user/show/19590155-vane-j", "userReview": "3.5 out of 5 starsIt’s been a little more than 20 years since Lydia and Claire’s sister Julia disappeared without a trace. Now, after some rather disastrous events, Claire’s husband gets killed and some things start to lead back to Julia. Secrets accumulate and Claire is no longer sure the man she married is indeed who she thought he was. What is the truth and what does it have to do with Julia?It is no secret I love reading thrillers, but lately I’ve been disappointed. They turn out as cliched and full of tropes, so even when I was really excited to start this book, I was also afraid. And the book did deliver… before we hit the 60% mark.The characters were all three-dimensional (up until the 60% mark). We have Lydia, whose life hasn’t been entirely pleasant or happy, but she’s complex and actually likable. We also have Claire, who takes center stage during most of the action.To be honest, I didn’t like Claire a lot. She was just too perfect for me. Everything turned out well for her everywhere she was and everyone liked her and whatnot. Bleh. However, I thought her relationship with Paul (her husband) was realistic and flawed. Sure, we just knew them together for a few pages, but as the novel progresses, we see there were more layers and that their oh-so-wonderful marriage was not what everyone thought it was.The mystery was very engaging and it kept me turning pages without end. I wanted to guess things, but there were so many secrets, and only more secrets were awaiting me. Everything was going well in the book… again, up until the 60% mark.So well, what happened in there that made my enjoyment give a complete turn? No spoilers: There was a big reveal, but that reveal only made things a little cliched and predictable. I could see the turns it was taking miles before they did.The multiple layers of the characters disappeared too. They got shallow and exasperating, especially Claire and another person whom I cannot mention. Besides, the traits of a particular character were so exaggerated it made him unrealistic… and I couldn’t care any less.Overall, it was a good book. If you don’t give much thought to what happens after 60% of the book, you will find a fast paced, engulfing thriller. This was my first book by Karin Slaughter, and I don’t intend it to be my last. I’ve heard good things about her and I cannot wait to be thrilled by more of her works.Now, have you read any good thrillers lately? Do you have any recommendations for me? (No Gone Girl, please) Have you read anything by Karin Slaughter before? Which other of her books would you recommend to me? What! Don’t judge me! I said I like reading thrillers! … though horror is my favourite genre, but time will come for that.Blog | Twitter | Tumblr | Bloglovin"}, {"userName": "Zoeytron", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "My first Karin Slaughter novel. There will be more. I kept thinking of that line from the movie Demolition Man, \"Murder, death, kill.\". Here, it was almost overkill, but it did not stop me from flipping through the pages at a prodigious rate. The graphic depictions of torture and rape could have been dialed back significantly and this would have still been one helluva page-turner. With thousands of reviews sitting out there, it is doubtful that I can add anything that hasn't already been said, so will leave it at that. And now, off to read a book that doesn't have the word \"Girl\" in the title. Enough is enough, and too much is just foolish. Gah!"}, {"userName": "Alex is The Romance Fox", "userReviewDate": "Nov 15, 2015", "userURL": "http://www.goodreads.com/user/show/6663962-alex-is-the-romance-fox", "userReview": "I am a big fan of Karen Slaughter and her Grant County and Will Trent Series are one of my favorite crime/thriller series.Pretty Girls is one of her standalone books and it was quite a disturbing and sad story.The chilling prologue pulled me immediately into this story. What happens when someone in your family disappears and is never found again? That’s what happens to the Carroll family, when their eldest daughter vanishes without a clue, without a reason.The family is shattered and results in a total breakdown between them that will never be repaired.Nothing prepared me for the outcome of that terrible tragedy that forever changed not only the parents but the two daughters left behind. I kept waiting for something good to happen to these destroyed characters and seeing more and more misfortune come their way was so not damn right.The secrets the family have are so devastating when revealed. And then, there are those letters that the father writes to his lost daughter…….geez, talk about heartbreaking….\n“Your mother and I had always been secretly pleased that you were so headstrong and passionate about your causes. Once you were gone, we understood that these were the qualities that painted young men as smart and ambitious and young women as trouble.” \nThis is not a sweet and romantic suspense story….it’s scary, it’s frightening, it’s sad……what more can I add?Just that it’s a really good book and I can definitely recommend it.One of the quotes that grabbed me”\n\n“Optimism is a sliver of glass in your heart.”"}, {"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "Jul 28, 2015", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "This is the first Karin Slaughter book I have read. Before I read the book did read the short novella Blonde Hair, Blue Eyes that precedes the story in this book and I was quite looking forward to reading the book since the story about a missing girl and the two sisters left behind seemed very interesting.And, the book was good for around 60% and then it just lost steam and my interest in the book and I felt not the usual feeling I get when the book is starting to get close to the ending, the feeling of not wanting to put the book down and read until you can hardly see because your eyes are so tired. I didn't have that feeling with this book. The last part of the story was just not that good, it tries too hard to shock the reader, but all I felt when stuff was revealed was a sense of tiredness over the lacking of ingenuity. Personally I could have lived with the book ending around 60% instead of dragging on and on. I mean was anyone even surprised who the big bad guy was or the people that were involved in the whole thing? I wasn't...2.5 stars since I did like most of the story, but it would have been even better with around 100-150 fewer pages, less over the top twists (especially the big one when they found the house that just felt too much).Thanks to William Morrow and Edelweiss for providing me with a free copy of this book in exchange for an honest review!"}, {"userName": "Rebbie", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/6582211-rebbie", "userReview": "This book might need a trigger warning for those with genuine PTSD because of its brutal violence. Normally I'd steer clear of suggesting that someone might have a hard time with a book, but this one is particularly gruesome and gory. A lot of people like that sort of thing, but I personally felt overwhelmed beginning around the 30% mark, and it didn't really let up until the end. I didn't have a problem with the violence until that point, but then it just got to be too much, especially because the nature of the brutality toward the rape and murder victims is extremely unsettling.I was hoping more for psychological torment, rather than relying on sheer shock value to carry the story. Of course, that's just my opinion, which is only worth what you paid for it. ;)I particularly loved the chapters where Julia's dad wrote her letters. Man, that ripped my heart out. It physically hurt to read the loving, fatherly tone, with his undying love for his missing daughter. The world could've ended, and he wouldn't have sacrificed his love for his daughter. Only death could bring sweet relief from the pain of missing your child. His chapters completely redeemed the book imo, and made it worthwhile to finish the book until the end. It shows that Karin Slaughter has some good writing chops, so I'll definitely check out her other work and give it a go."}, {"userName": "Emily May", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I didn't dislike this, but I think these days it's pretty hard for me to be shocked by thrillers. My enjoyment of them hinges more on the character development and the way the story is written, which I thought was fairly average when compared to my favourites from the genre - Tana French and Gillian Flynn.The grittiness, shock tactics and reveals, which many people have praised, left me feeling relatively cold."}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Dec 11, 2016", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "Wow! I have never read anything by Karin Slaughter before and I was a little bit apprehensive to start with this particular book because of some of the things I was hearing about the subject matter of this one. I thought it was absolutely one of the best dark, psychological thrillers that I have read! It was an absolutely intense read with shocking twists that had me totally engrossed in every single page I was reading! I could not put this down, it was so good! I am looking forward to reading more of her books in the future!PRETTY GIRLS is a story told in three different points of view; Claire, Lydia and their fathers journal/letter to Julia the sister who went missing over 20 years ago. Claire and Lydia are estranged but brought back together after a tragedy happens in Claire's life. I absolutely loved the interaction between these two characters as they unravel the truth and secrets from their past. This is by far one of the sickest psychopaths I've ever read about and the author does go into some graphic detail that might be disturbing for some. It didn't really bother me though as I tend to not put myself totally into those parts while reading. I am not a skimmer, I have to read every single word but I am able to detach myself while reading disturbing scenes. The author did an excellent job with the plot and character development which had me totally invested in what I was reading as the suspense and tension developed.It was an intense, quick and disturbing fast-paced thriller with a very satisfying ending. Would recommend!!http://www.twogirlslostinacouleereadi..."}, {"userName": "Chelsea (chelseadolling reads)", "userReviewDate": "Oct 19, 2016", "userURL": "http://www.goodreads.com/user/show/16219087-chelsea-chelseadolling-reads", "userReview": "SPOOKATHON read #2 - read a thriller: COMPLETE!Wow. What a fucking book. This was one of the most disturbing/fucked up books I've read in a LONG time. And I think it was worse for me because I literally knew NOTHING going in. Such a great reading experience. 10/10 would recommend if you're into thrillers and can handle graphic content."}, {"userName": "bran (brandonthebookaddict)", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/13699205-bran-brandonthebookaddict", "userReview": "Good god."}], "description": "#1 internationally bestselling author Karin Slaughter returns with a sophisticated and chilling psychological thriller of dangerous secrets, cold vengeance, and unexpected absolution, in which two estranged sisters must come together to find truth about two harrowing tragedies, twenty years apart, that devastate their lives.Sisters. Strangers. Survivors.More than twenty years ago, Claire and Lydia's teenaged sister Julia vanished without a trace. The two women have not spoken since, and now their lives could not be more different. Claire is the glamorous trophy wife of an Atlanta millionaire. Lydia, a single mother, dates an ex-con and struggles to make ends meet. But neither has recovered from the horror and heartbreak of their shared loss—a devastating wound that's cruelly ripped open when Claire's husband is killed.The disappearance of a teenage girl and the murder of a middle-aged man, almost a quarter-century apart: what could connect them? Forming a wary truce, the surviving sisters look to the past to find the truth, unearthing the secrets that destroyed their family all those years ago . . . and uncovering the possibility of redemption, and revenge, where they least expect it.Powerful, poignant, and utterly gripping, packed with indelible characters and unforgettable twists, Pretty Girls is a masterful thriller from one of the finest suspense writers working today.", "title": "Pretty Girls", "url": "http://www.goodreads.com/book/show/25574782-pretty-girls", "average": 3.97, "cover": "https://images.gr-assets.com/books/1432205734l/25574782.jpg", "reviews": 10759, "authors": [{"url": "https://www.goodreads.com/author/show/12504.Karin_Slaughter", "name": "Karin Slaughter"}], "type": ["Mystery", "Thriller", "Fiction", "Thriller", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/25574782-pretty-girls", "http://www.goodreads.com/book/show/24371990-pretty-girls", "http://www.goodreads.com/book/show/25465056-pretty-girls", "http://www.goodreads.com/book/show/26544752-pretty-girls", "http://www.goodreads.com/book/show/25109445-pretty-girls", "http://www.goodreads.com/book/show/24959571-pretty-girls", "http://www.goodreads.com/book/show/23482795-pretty-girls", "http://www.goodreads.com/book/show/26030521-pretty-girls", "http://www.goodreads.com/book/show/21718.Blindsighted", "http://www.goodreads.com/book/show/21717.Triptych", "http://www.goodreads.com/book/show/2199587.Fractured", "http://www.goodreads.com/book/show/33230889-the-good-daughter", "http://www.goodreads.com/book/show/7093222-broken", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/35005051-the-forgotten-girls", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}