{"ratings": 556, "userreviews": [{"userName": "Sarah (Presto agitato)", "userReviewDate": "Sep 07, 2015", "userURL": "http://www.goodreads.com/user/show/1257768-sarah-presto-agitato", "userReview": "[a secret marriage and pregnancy (hide spoiler)]"}, {"userName": "Karla", "userReviewDate": "Aug 06, 2015", "userURL": "http://www.goodreads.com/user/show/2846441-karla", "userReview": "DNF @ 35%.Boring. Repetitious writing. Dull heroine. Twee shit with pets. A romance as scintillating as a bowl of cold oatmeal.*grabs parachute and bails*(Had a real \"Young Adult\" feel to the tone and writing, though I guess it's for the adult market. It was blah, no matter how it was labeled.)"}, {"userName": "Andrea Guy", "userReviewDate": "Sep 19, 2014", "userURL": "http://www.goodreads.com/user/show/1887553-andrea-guy", "userReview": "I love the Tudor period. It is hard to believe that anyone could write another book dealing with this royal dynasty that would still leave me feeling like I haven't read a half a million books on the subject, (ok, maybe not so many, but it feels that way sometimes) but E. Knight does.So yes, the Tudor period is very overdone, in both historical fiction and romantic fiction, but, there's always something more, or someone more to learn about. In this case, Katherine Grey, who was the sister to Lady Jane Grey, the nine days queen.I've read books that feature the Grey sisters but they focused mostly on Jane and Mary. This was the first one that I've read that put Katherine in the spotlight.This is a tragic romance but one that really pulls you in. This is a woman of royal blood, whose life is really in the hands of the Queens, both Mary and Elizabeth, who see her as a threat. I felt terribly sorry for her. She seemed to want love rather than power, and she definitely didn't have the love of many people in her life. Her mother wasn't exactly the nicest woman, and the Queens that she served wouldn't trust or like or much, with good reason really, not that Katherine did anything to usurp the throne, but other members of her family did. That put her in constant suspicion. E. Knight makes Katherine a very real person to her readers as well as Ned. There are things that happen in her life that will make you cry along with her. The loss of her pup, was one moment that really got to me. I always hate reading about the death of animals or when someone's pet wasn't allowed to make a journey with them to a new life.I love the writing style and the obvious research that went into bringing this story to life. This book was a joy to read, even as the story breaks your heart."}, {"userName": "Jennymort *The Dark Lord, House of Slytheread, Sailor Jupiter, Siren*", "userReviewDate": "Jul 15, 2015", "userURL": "http://www.goodreads.com/user/show/35147071-jennymort-the-dark-lord-house-of-slytheread-sailor-jupiter-siren", "userReview": "I'm still not entirely sure about this book. I know I've only read about 50 pages, but it's just not vibing with me. And that in itself is bothering me. I've never had this issue with a book... Ever. But there is a first time for everything I guess. Hopeful I'll finish it this year... I'm actually kind of depressed about this..."}, {"userName": "Erin Al-Mehairi", "userReviewDate": "Sep 29, 2014", "userURL": "http://www.goodreads.com/user/show/4763588-erin-al-mehairi", "userReview": "I'm so glad that I decided to try out Eliza Knight's Tudor Series, written under E. Knight to differentiate from her romance novels she's been so successful at writing (though I've not read those yet). Speaking strictly on her Tudor Series novels, of which I've read both now, E. Knight is a superb writer with detailed prose, excellent dialogue, and emotional characters. Fully researched, these historical novels on the Tudor Era bring a fresh take to the shelves of what is fast becoming, if it hasn't already, a major sub-genre of historical fiction.Speaking of book two, Prisoner of the Queen gives us the story of Katherine Grey, sister to the well-known Jane Grey (cousin to Elizabeth I and Mary I) who unfortunately ended up being caught in the scandal of monarch lineage and power hungry noble families like the Dudleys (which ultimately saw to her fate of being beheaded after 9 days as Queen). Jane had two sisters, and of the two, Katherine was next in line for the throne once her sister was killed, after Henry VIII's two daughters.As Elizabeth I becomes extremely paranoid (and with due reason), the relationship between Katherine and Elizabeth is strained. In Prisoner of the Queen, Knight also writes of the passionate romance between Edward Seymour and Katherine, which they conducted under the radar of the now Queen Elizabeth. Becoming pregnant, however, led to Katherine and Edward being discovered and they were locked in the Tower by Queen Elizabeth. Katherine's lived her life in the Tower until her death.It's a sad story, but Knight does such a superb job of telling it that you feel compelled to root for Katherine even if you know how it turns out historically. She does an overwhelming amount of research and it shows within the pages of her novel. She writes with an expert hand, bringing heart-wrenching emotion to the page.Many people adore Elizabeth I, and I admit I like many parts of her legacy and personality, but it's important for us as readers and historians, to remember the other side of Elizabeth I as well. Knight shows the true side of the Queen with an authentic accuracy, even if we wish it weren't so. Impulsive and paranoid, Elizabeth I is many times the image of Henry VIII, and within this book, Knight was correct to portray the proper course of history.Knight writes a novel that lights with passion, emotion, and description that breathes new life into old stories of England's monarchy. She writes with elegance and vivid descriptions that make you feel as if you've entered into the period yourself. Her imagery is easy to convert visually and her details stunning.If you are getting tired of Tudor historical novels, don't stop yet until you read Knight's series. It will make you see a whole new side of all the characters and players you thought you'd had enough of! You'll be swept away snuggled by the fire with some tea and biscuits before you know it has captivated you, leaving you turning your head only when your partner says, \"Have you been up all night?\"It's not always easy to write in first person, but with Knight's Tudor series, she succeeds in making you feel that emotional connection with the protagonist that is so important when reading from that point of view. If you think you've liked Brandy Purdy or Phillippa Gregory in the past, they can move way over for Knight's eloquent storytelling. In the same vein of Elizabeth Freemantle and Hillary Mantel, Knight's writing is top-notch and highly recommended as a new face of Tudor fiction.I was given a copy in exchange for an honest review."}, {"userName": "Patty", "userReviewDate": "Sep 30, 2014", "userURL": "http://www.goodreads.com/user/show/3550357-patty", "userReview": "One would think with all of the Tudor books out there that one would have read it all but no - Ms. Knight has found a heroine about whom I knew very little. Lady Katherine Grey was a sister to Lady Jane Grey - the young woman who was queen for 9 days between Edward VI and Mary I. Katherine had royal blood so her life was really lived at the Queen's behest. She couldn't marry without her permission, she really couldn't be free at all. So much for the \"fun\" of being royal.Once I started reading about this young woman I was totally lost in her life. I felt so badly for her - unable to love who she chose. Much has been written about Elizabeth I's inability to let the women around her find happiness because she herself could not. That left these women with the option of never marrying or taking their chances and defying the Queen. Katherine went the defiance route and she paid for it with imprisonment in the Tower. She was still able to see her husband and she did have two sons while living there but the Queen made sure she would never see her husband again.It's a very sad story about a woman who just wanted to live a normal life when she was not living in normal times. The book is very well written with a style that makes the time and characters come alive on the page. I found myself thinking of this poor girl for days after I finished the book. I could tell that Ms. Knight really cared for her subject and wanted to due her story justice. The research is evident in the delightful details sprinkled throughout the tale. I've got Ms. Knight's first book on my tablet and I am going to make time in my reading schedule for it as I so enjoyed this one and I know I'll be looking forward to more from her.4.5"}, {"userName": "Kimberly", "userReviewDate": "Sep 22, 2014", "userURL": "http://www.goodreads.com/user/show/4964846-kimberly", "userReview": "“Prisoner of the Queen” by E. Knight was a fantastic read. One of those books you curl up with, and find you can’t put it down until you finish. I liked how the novel was written in first person. It really gives the reader a great idea of what Katherine really might have been going through—you can picture her having these exact thoughts during this time. I felt like I really was able to get to know Katherine. She’s definitely a relatable character, and as a reader you just want to protect her and for things to turn out for the best. Katherine Grey is definitely brought back to life in this novel. I like that the focus was mainly on her life outside of prison.E. Knight’s writing transports me to another time and place—I can picture everything and I become completely lost within the pages of this novel. The author has a great gift for storytelling that makes it hard to put any of her books down. This novel is another hit in a long list of great novels by E. Knight. She definitely has a way of pulling the reader into a novel, and letting them get lost in the smooth writing and great research.I would recommend this novel to any lover of historical fiction. The research is great, and the writing style is fantastic. It definitely is a great read.I give “Prisoner of the Queen” a FIVE out of FIVE stars."}, {"userName": "WTF Are You Reading?", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/3603515-wtf-are-you-reading", "userReview": "Prisoner Of The Queen, marks authoress Eliza Knight's latest tarriance among the royal and not so royal blooms of the fabled Tudor Rose.Chronicling the life and times of Lady Katherine Grey, \"princess of the blood\" and sister to the tragic \"nine days Queen,\" Jane Grey; this is a story of life, love, and treachery, that has to be read to be believed.As cousin to both Mary and Elizabeth Tudor, Katherine's story offers a much more intimate look at life among the royals. As such, the rivalries, jealousies, spites, and slights, create more of the cat and mouse game of sovereign versus subject, and relative versus relative, that readers of Historical Fiction crave.Eliza Knight once again tells the story of the little known royal relation with a personal panache and flair for the dramatic that serves to elevate one given a mediocre place in the annals of history, to astronomical heights in the fictional arena.Vibrant characters, mind-bending plot twists, and a fluid yet breakneck pace, are all trademarks of authoress Knight, that fans of her books have come to know as her signature hallmarks of excellence.Lady Katherine presents as a strong, intelligent, and astute heroine from page one of her tale. A woman bound and determined to live and love as she chooses, even as forces both within and without the realm of court and crown fight to control her every move."}, {"userName": "Stephanie Tracy", "userReviewDate": "Sep 16, 2014", "userURL": "http://www.goodreads.com/user/show/6801337-stephanie-tracy", "userReview": "This was a great retelling of the tragic life of Lady Katherine Grey, sister to the ill-fated Lady Jane Grey. Hers is a story of true love and heartbreaking separation. Mistrusted by her cousin Queen Elizabeth, her adult years are hard and riddled with imprisonment and pain. But through it all she retains the love of her one and only, Ned Seymour. Secretly wedded and bedded, Katherine gives birth to two boys and remains utterly in love with the husband who is kept away from her. Unfortunately, her legitimate royal pedigree always haunts her and keeps her from living the quiet, peaceful life she craves. Eliza Knight does a beautiful job with this story and her writing is flawless. I blew through this novel in just a few days and loved every bit of it. I won't lie - it's not a happy story, but if you're interested in one of English history's forgotten royal women, I encourage you to pick this one up. It's a beautiful tale of realistic love, betrayal, fear, and court intrigue, and I don't think you'll be disappointed!"}, {"userName": "Kimberly", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/4708602-kimberly", "userReview": "Oh my goodness! Anyone that knows me knows this is exactly my kind of book. I have been an Anglophile for over 10 years and whenever I can find a book, fiction or nonfiction, on this area of the world I sink right into it.Unfortunately this also means that I take my time in reading it as I want to absorb all the details. Prisoner of the Queen took me in from the first page. Eliza Knight has accurately told the story of Katherine Grey, the sister to Jane Grey who is known as the Nine-Days Queen. She did this without sounding like a lecture. Instead she was able to offer a new perspective on some of the queens and on life at court. Katherine is thought to be a threat to the Crown but instead she just wants to be with Edward Seymour. I highly recommend this book to anyone that enjoys the Tudor time period. I was given this book by NetGalley and Lake Union Publishing in exchange for my honest review."}, {"userName": "Stephanie", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/21498502-stephanie", "userReview": "\"Prisoner of the Queen had me gripped from the prologue. Eliza Knight has artfully told the story of ill-fated Katherine Grey, sister to the Nine-Days Queen, Jane Grey. As a lover of all things Tudor, I thoroughly enjoyed this book. There is a fresh perspective on court life and several Queens through the eyes of Katherine Grey. Katherine, who had been inundated with Court Life since she was a child, is cousin to Queen Mary and Elizabeth. Katherine Grey is seen as a threat to the Crown, but all she wants in her life is to carry on a humble existence with the man she loves, Edward Seymour. The star-crossed lover's story is presented with historical accuracy, including some of the actual letters written by Jane and Katherine Grey as well as heartbreaking emotions. For any Tudor lovers, this is a new and exciting story from the Tudor court complete with intrigue, plotting and executions. This book was received as an ARC from the author in exchange for an honest review."}, {"userName": "Colleen Turner", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/3339335-colleen-turner", "userReview": "There are few things I like better than a well told Tudor historical! There are so many angles to take and interpretations to present that show the many players and many sides in this political viper’s nest. While Jane Grey, the 9 days queen, is a key player in many novels surrounding the Tudor court her younger sisters, Katherine and Mary Grey, are usually relegated to the sidelines. Ms. Knight’s Prisoner of the Queen places Katherine front and center, letting her tell her heavy story of great love and much loss. I have to say that I could not help but love Katharine! Sweet, generous and often innocently naïve, Katherine wants nothing more than to devote herself to helping others less fortunate and to find a marriage match based in true love and safety, something she has rarely seen among those of her class. But being a princess of the blood means many others – including her own cruel and unloving parents – will use her as a pawn in the dangerous game of power that always looms heavy around the throne. Seeing her sister beheaded by their own cousin, Queen Mary, for doing nothing more than being the unwitting recipient of the crown placed on her head by men who wished to rule through her, Katherine learns quickly she wants nothing of it. But everyone is suspicious of her and she can’t be sure who she can trust as she carefully slides around those jealous of her beauty and kindness, no one more than her other cousin, Queen Elizabeth. But don’t let her kindness deceive you! Katherine’s spine is all steel under her elaborate finery and she will let no one – not even the Queen – keep her from having the true love she finds in Edward Seymour, Earl of Hertford. She will live for her heart, regardless of the consequences. How can you not root for a woman like that?!Elizabeth is portrayed as a nasty, vengeful young woman and, eventually, Queen. While she seeks the love of her subjects she is refused the passion and love of a man of her own, making her bitter and jealous of anyone else having it. She plays quite the loathsome villain with all her arrogant, vicious and hypocritical ways. I kept thinking a glimmer of heart would shimmer through all that cold and calculation but she proved to be too damaged and scarred to see beyond her selfishness and fear. The gilding on this glamorous court and its people is thoroughly stripped off and what is left is the defensiveness and cunning of a group of people always living on the line between greatness and destruction.Even with this wonderful character development my favorite aspect of the novel would still be the elaborate descriptive style. The reader is so effectively saturated in period details and descriptions that they can almost hear the wind rustling the elaborately embroidered dresses and feel the abject fear flowing through Katherine’s royal blood. I felt completely transported into her world and wanted her to find the peace and happiness she so longed for – even as I knew her story couldn’t possibly end that way – as if she was a real friend of mine.Prisoner of the Queen is top shelf historical fiction. Anyone as addicted to Tudor history as I am will love escaping into this heartbreaking yet touching look at a woman taking her own life into her hands and making her own choices despite what tragedies may come."}, {"userName": "Leeanna", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/2877693-leeanna", "userReview": "This review originally appeared on my blog, Leeanna.me.==Most people know the tale of Lady Jane Grey, the Nine Days Queen. I’ve read several books about her, fiction and nonfiction, but PRISONER OF THE QUEEN is the first book I’ve read that tells the story of her sister, Katherine. That’s what attracted me to the book in the first place, and I think E. Knight does a fantastic effort reimagining Katherine’s story.Katherine’s story is not a happy one: for daring to marry the man she loved behind Queen Elizabeth’s back, she spent the rest of her life imprisoned. But even before her marriage to Edward Seymour, Katherine wasn’t in control of her life. Both Queen Mary and Queen Elizabeth felt threatened by her presence, for she also had a claim to the throne, although she wanted nothing to do with it. Katherine is an easy character to root for. She doesn’t want to be a pawn, used for the gains of men. She just wants to be happy, to enjoy life, to have a husband and children. But that isn’t in her stars, because of her royal blood and the political complications of the time. I liked how the author mentioned how pamphlets written by rebellious men impacted Katherine’s life -- they were only thinking about their own gain, and never considered that Elizabeth would punish Katherine even more harshly. I didn’t quite agree with the author’s characterization of Elizabeth at first -- jealous and fearful of losing power -- but as the book went on, I believed it. For once, it was good to see Elizabeth from the view of someone wronged by the queen. PRISONER OF THE QUEEN is a great book for fans of Tudor historical fiction. I really enjoyed Katherine’s story, and the ending made me tear up a bit. That doesn’t usually happen! I’m not always a fan of romance, but I got behind Katherine and Ned’s relationship, and wanted them to have a happy ending even though I knew they didn’t. The author included letters the two actually wrote to each other, and quotes from a poem written about their star crossed relationship kick off each chapter. PRISONER OF THE QUEEN is a different look into Tudor court life, from the eyes of one who doesn’t really want to be there. ==Disclaimer: I received a copy of this book from the author in exchange for an honest review. I also participated in the blog tour for this book.See more of my reviews:"}, {"userName": "Michelle (True Book Addict)", "userReviewDate": "Oct 03, 2014", "userURL": "http://www.goodreads.com/user/show/1823219-michelle-true-book-addict", "userReview": "I think what I enjoy most about the Tales from the Tudor Court series is the author's ability in taking the fringe players and showing us how essential they were to what was going on in the Tudor world. She accomplished this in My Lady Viper, with Anne Seymour, and she does it brilliantly once again with this book surrounding Katherine Grey's life. Katherine was the younger sister to Lady Jane Grey, Queen Jane for those illustrious nine days. She was the middle daughter of Frances Grey, nee Brandon, who was the niece of Henry VIII and daughter to Mary Tudor and Charles Brandon. In this book, Katherine seemed to be a more grounded type of person, who really only wanted the simple things in life. Not the intrigue of court. Although naive at times, she is very kind to the less fortunate, which I thought commendable. But she also has an inner strength that really comes to her aid later on when she finds herself in a precarious situation. It was difficult for me to read Queen Elizabeth I as being such a mean, spiteful...and paranoid...woman, as I have a spot in my heart for her. However, the author here makes us believe that she could have really been like that. Not by simply writing her character that way, but by portraying the reasons why might have behaved in this way. It doesn't really portray her in a favorable light, but we can accept that, given the times and what she had endured, she could have very well had reasons for her behavior. I say, \"Well Done!\" In all, Prisoner of the Queen is an excellent historical novel. It is well-researched and the characters are well-written, interesting and engaging, as is the entire story. If you have not picked this series up as yet, I highly recommend that you do."}, {"userName": "Kathleen Kelly", "userReviewDate": "Aug 28, 2014", "userURL": "http://www.goodreads.com/user/show/2714432-kathleen-kelly", "userReview": "Lady Katherine Grey was the younger sister of Lady Jane Grey, often known as the nine day queen. Through their grandmother Mary Tudor, they were in line to the English throne. Lady Jane Grey and her husband, Lord Guildford Dudley, are executed with the charge of treason. This leaves Katherine next after Henry VIII's children Edward,Mary and Elizabeth. Elizabeth felt that Katherine was a threat to her succession to the throne so there was a bit of animosity between the two that carried forward through the rest of their lives. Edward Seymour, 1st Earl of Hertford lost his titles because of his father, the Duke of Somerset. He was educated with Edward VI and was also knighted when Edward took the throne. After his father was executed, Edward lost his titles and most of his wealth. Lady Katherine and Edward quickly became enamored of each other and ultimately married without permission of Queen Elizabeth. They were able to keep this secret until Katherine was pregnant with their first child. Queen Elizabeth had both Katherine and Edward locked in the tower for not getting permission to wed. She was in captivity until her death after having two children. To me this was such a bittersweet story, a queen so in fear of losing the throne that she would imprison those who wished to marry and have family's because she did not believe in nor want to be married. Such a life to be locked up because of whom you love. This is not a new story by any means, based on factual events, but E.Knight's writing made me think I was reading a whole new part of history. As in My Lady Viper, the first in the series, the research was impeccable and the writing a joy to read. You just have to read these two books if you are as fanatical regarding anything Tudor as I am!"}, {"userName": "Meg - A Bookish Affair", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/1132408-meg---a-bookish-affair", "userReview": "In \"Prisoner of the Queen,\" E. Knight is back with another tale from the Tudor Court. Think you've read everything about the Tudors? Ms. Knight shows that there is much more to love. I know that I have thought that maybe I was over reading about the Tudors before but when I read books like this one, my mind is changed very quickly. Filled with court intrigue and passion, this book will have you wanting to read more about her heroine, Katherine Grey, sister of Queen Jane Grey!Queen Jane, also remembered as the nine day queen, is probably one of Henry VIII's queens that I know the least about and in that vein, I did not know much about Katherine Grey either before reading this book. She has an equally interesting story to her sister. Both sisters lived during an extremely volatile time during England's history where some of the luster had started coming off of the throne. It made for really good reading! Katherine is seen as a major threat to the throne and therefore her life is made miserable by the powers that be. While she has no designs on taking the throne for herself, there are other people in her family that are keen on ruling themselves, which makes Katherine suspect. I really felt for her! She wants to live her own life but is never really allowed to do that. You'll definitely feel her frustration throughout the book. Knight captures it perfectly!The writing and the research that went into this book make it an especially good treat for historical fiction readers. Knight is both able to give us really vivid characters while not skimping on rich historical detail. Count me as one of those anxious for the next release in this series!"}, {"userName": "Diana", "userReviewDate": "Jul 28, 2014", "userURL": "http://www.goodreads.com/user/show/2729290-diana", "userReview": "*Received from Historical Fiction Virtual Book Tours for an honest reviewposted at: http://booknerdloleotodo.blogspot.com First, I have to say that the gorgeous cover grabbed my attention from the beginning but the fantastic writing, engaging story line and search for love kept me hooked. The Tutors are just so delicious! They were very interesting and never had a dull moment. I heard E. Knight's \"Behind the Plaid\" and I was hooked by her story telling. So when \"Prisoner of the Queen\" became available I couldn't wait to see how she would tell the story of Lady Katherine Grey. I honestly knew nothing about her. I knew of her sister, famously dubbed the \"9 day queen\" but had no idea who her sister was. I loved that the author told the story from first person point of view because it made me feel like I was getting personal and intimate details from Lady Katherine. I really liked Knight's portrayal of Lady Katherine. She showed her evolution from a frighten young girl, married to a man she did not know all for the sake of duty. Watching Lady Katherine fight for her love for Edward Seymour was beautiful. I'm a sucker for romance and love so this book hit all the right spots. I loved this beautiful story. I loved the writing and I was unable to put it down. I kept wondering what would happen next, how it would all work out , would it work out? Lastly, I personally really love Elizabeth and think that Knight portrayed her much more harshly than I would imagine her to be but Elizabeth's harshness really played well into the story and it also made sense. I could not recommend or like this book enough!"}, {"userName": "Jaclyn", "userReviewDate": "Jul 19, 2015", "userURL": "http://www.goodreads.com/user/show/7024772-jaclyn", "userReview": "I received a copy of this book from the publisher through Netgalley in exchange for my honest review.This was such a great read and I finished it in two days. If you LOVE Philippa Gregory like I do then this will be the book for you! Ms. Knight is a great storyteller and draws you back to the past!This follows Lady Katherine Grey, the middle sister of the Nine-Days Queen Jane Grey. Katherine sees her family rise to power only to fall down. She is left to pick up the pieces and to make peace with the new Queen Mary and then the Queen Elizabeth. Katherine has no ambition to take control of the crown and rule especially after seeing her older sister executed for trying to do that same thing. She just wants to fall in love, marry, and raise her kids in peace but because of her blood she can't just marry anyone or without the Queens permission. But Katherine is tired of being a pawn and takes matter into her own hands which have dire consequences.Ms. Knight is superb at making you love Katherine and hate Queen Elizabeth. I have always rooted for Elizabeth in previous books but this sheds light onto her other side. Queen Elizabeth is the villain in this story but her reasons make so much sense that it can be frustrating. I felt like I was pulled back into the past and I had watery eyes at the end not knowing how Katherine's story actually played out. I've been trying to read more about the people who surrounded the two Queens during their reign and this book was perfect. It gave me more insight into the families and showing another side to Queen Elizabeth."}, {"userName": "DeniseF ", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/2407742-denisef", "userReview": "Prisoner of the Queen is a refreshing look at the life of Katherine Grey. For the first time, she is portrayed as a strong, intelligent woman instead of as a foolish and naive girl. I thoroughly enjoyed Ms. Knight's unique portrayal of this fascinating historical figure.Likes: In addition to Knight's portrayal of Katherine, I also thoroughly enjoyed the cast of characters. There were plenty of familiar faces but there were some less familiar characters who played big roles in the story. Both the Duchess of Somerset and the Dowager Duchess of Suffolk were wonderful characters and I liked getting to know them and see their perspectives. I especially liked the Duchess of Somerset; she was so cold and distant but at the same time she really did care about her children and doing what was right for her family. I definitely want to read more about her in the future. Dislikes: This was truly Katherine's story so I understand why some of her family didn't play huge roles in the story but I did kind of miss seeing Mary Grey as a character. That was probably the only thing I found lacking with the story. I know the story of Katherine Grey and her demise but despite knowing how it would end, Ms. Knight's depiction of the events of Katherine's life kept me interested from beginning to end. The combination of her portrayal of Katherine with a well-written narrative made Prisoner of the Queen a very compelling read. 3 1/2 stars."}, {"userName": "Caroline Wilson", "userReviewDate": "Nov 13, 2014", "userURL": "http://www.goodreads.com/user/show/179454-caroline-wilson", "userReview": "\"Prisoner of the Queen\" takes on the true story of Lady Katherine Grey. Often overlooked due to her older sister Jane, \"the Queen of Nine Days\", Katherine saw first hand what unbridled ambition could result in. Raised as a \"Princess of the Blood\" (her grand uncle was Henry VIII), Katherine knew she would be a pawn in the political machinations of her era. Instead, she chose to take her own destiny in hand and marry for love, which unfortunately had disastrous consequences.E. Knight has a great way of detailing the Tudor period. It is clear that she has put in a remarkable amount of research while writing this book. The customs and language of the period were spot on. I really enjoyed reading something from Katherine's perspective though I wish her characterization had been a bit more filled out. Since the novel was written in first person, the reader sees Katherine's version of things only. She was obviously a sweet girl, somewhat naive, but able to play the game in order to get what she wanted. Ned's adoration of her was a bit unfounded at first as their relationship begins as a physical attraction and slowly blossoms into something deeper.Overall, this new take on Katherine is a much needed entry in the historical fiction world. Tudor enthusiasts will certainly rejoice!"}, {"userName": "Margaret", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/3938457-margaret", "userReview": "I vividly remember the first time I read about Lady Jane Grey and being stunned, thinking this has got to be fiction. Surely this didn't actually take place, how could parents deliberately treat their daughters like this. Resigned into acceptance remembering that this was Tudor England.Eliza Knight has written a captivating story that brings to life a stormy period in history. Lady Katherine Grey, not just sister to the nine day queen but also an heir to the throne of England herself. The author was able to capture the feel of Tudor England, she portrayed this young woman with her hopes and dreams of a future, of love, marriage and motherhood, all things denied her sister. Though Katherine finds love she is at the mercy of both Queen Mary and Queen Elizabeth (who also views her as a threat to her crown).An emotional story, full of jealous rivalry, scandal and heartache. These are women with the blood of Henry VIII running through their veins, how could it be anything but."}, {"userName": "Julie", "userReviewDate": "Jul 22, 2014", "userURL": "http://www.goodreads.com/user/show/3771119-julie", "userReview": "The circumstance of Katherine Grey’s existence is heartbreaking. Witnessing the demise of her sister, 9-day queen Jane, and the downfall of her family, Katherine struggles to find her place in court. Unfortunately her royal blood makes her both a value and a rival. Unable to marry her true love because of her lineage, Katherine is a tragic figure at the mercy of a vengeful monarch. Knight deftly conveys the joy and anguish of a doomed love story resulting from the misfortune of being born a Tudor. Katherine is portrayed with passion and the intrigues of the Tudor court are skillfully depicted.I received a complimentary copy of this book via Historical Fiction Virtual Book Tours."}, {"userName": "Jeannie E. Hennig", "userReviewDate": "Dec 15, 2017", "userURL": "http://www.goodreads.com/user/show/27779778-jeannie-e-hennig", "userReview": "Heartbreaking storyThe story of Lady Katherine Grey was one of the saddest I have ever read. I will never view Elizabeth the 1st in the same way again. I knew there were things she thought she had to do to preserve her reign. Don't think this was good move on her part. All she did was immortalize Ned and Kat, making herself look petty and cruel. All in all, this was a very good book. I would recommend it highly."}, {"userName": "Jool", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/8154225-jool", "userReview": "Yet another good book in this two book series Tales from the Tudor Court. This one, however, was not as good as the first book. The main character spends little time in Court and more time at one of the various other estates. This is still a good book, but also missing King Henry VIII since Queen Elizabeth is now on the throne. The book will make you realize the cruelty and unfairness that ruled back then, and make you glad you did not live in those times."}, {"userName": "Barbara Bingham", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/50407950-barbara-bingham", "userReview": "Wonderful writing!Ms. Knight's \"Tales from the Tudor Court 1 and 2 \" are reader's dream. Wonderful writing indeed! I am looking forward to your next book. Thank you for writing them!"}, {"userName": "Melissa Fecak", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/69528155-melissa-fecak", "userReview": "Good readThe story of Katherine Grey is very tragic. Well written of the struggles she faced to wed the man she loved."}, {"userName": "RoloPoloBookBlog", "userReviewDate": "Dec 20, 2015", "userURL": "http://www.goodreads.com/user/show/5246521-rolopolobookblog", "userReview": "Prisoner of the Queen by E. KnightBook #2: Tales from the Tudor CourtSource: NetgalleyMy Rating: 4½/5 starsMy Review: As Prisoner of the Queen opens, England is in turmoil as Henry VIII’s only surviving yet sickly son is on the throne and his daughters, Mary and Elizabeth struggle with their place in the world and their claim to the throne of England. As the young King’s days come to a close, the Grey family makes their play and places their eldest daughter, Jane on the throne. Known as the nine-day Queen, Jane Grey is wholly incapable of holding her position and along with her father and several others, loses her head for treason. Sitting in the wings and knowing she is pawn in a much larger game is Jane’s sister Katherine Grey.Born of noble blood, Katherine has always known she is nothing more than a pawn in other’s games. Katherine is kind, caring, generous, and totally uninterested in suffering the fate of her sister, Jane. In fact, from the very beginning she is clear to any and all who will listen, she has no interest in being a queen no matter her bloodline nor does she have any desire to stand in the way of Mary and Elizabeth and their respective claims to the throne. Katherine wants what a normal and quiet life that includes a man who loves her, a home far from court, her beloved pets, and a ridiculous number of children. At a very early age, Katherine meets the man she is to love for the rest of her life, Ned, a beautiful and titled young man who knows instantly that Katherine is meant to be his. The bulk of Prisoner of the Queen is devoted to Katherine and Ned and the tragic love they share. Like Katherine, Ned is from a politically ambitious family and a union between his house and hers would certainly be seen as a threat to the throne. While most would simply get married and call it a day, Ned and Katherine have to receive approval from the crown which is granted shortly before Queen Mary dies. As we all know, Queen Elizabeth was a cat of a different color and was in no way inclined to continue the policies of her now-deceased half-sister. As Elizabeth begins her reign, it is imperative to her safety and security that she identify her enemies and keep them in check. High on her list of potential threats is Katherine Grey. The moment Elizabeth takes the throne, she makes it clear to Katherine that she will not ever approve her marriage to Ned and her every action will be watched. Katherine isn’t just watched, her letters are read, her words are marked, and her every step is shadowed by someone looking to bring a claim of treason against her. Elizabeth warns Katherine constantly that she is a threat that will be neutralized should she (Katherine) put even a toe out of line. In order to ensure they cannot be together, Elizabeth often engages Ned’s services which keeps him far, far from court. But, love is a powerful emotion to overcome and Katherine and Ned are committed to one another. Knowing they could lose their heads for treason, they wed in secret with the hope that one day, the Queen will approve of their union. The Bottom Line: Once again, Knight has taken a well-known story and reported on it from a totally different character’s perspective. I LOVED IT!! From the very beginning, Katherine is an individual you want to root for all the while knowing she will never truly have what her heart desires. Despite her actions nearly always supporting her words, Katherine is dealt blow after blow by a suspicious and vindictive queen. This is one of the first books I have read (and I’ve read A LOT of Tudor-related titles) that depicts Queen Elizabeth I as something other than a reasonably decent human who only wants what is best for her subjects and her country. Knight portrays Elizabeth as paranoid, suspicious, untrusting, and cruel. I LOVED IT!! There are some truly beautiful moments in this read for Katherine and Ned but overall, their road is long, hard, and paved with a great deal of misery. Though there is still an incredible amount of detail in this read (BLECH!!) it does end better than the first book and I found myself quite satisfied with the end result."}, {"userName": "Lisa Fallon", "userReviewDate": "Jun 30, 2015", "userURL": "http://www.goodreads.com/user/show/19477387-lisa-fallon", "userReview": "I am a massive fan of the Tudors but we don't really get much on the two grey sisters, Mary and Katherine.I have read a few fiction history books on lady Jane grey and but haven't found a good story on Katherine until now.I've always know that Katherine went against the queens wishes and married Ned Seymour in private and then became pregnant, I knew that they were both imprisoned in the two and had two sons but I must admit that's mainly all I've learnt about Katherine so this book was a big eye opener and I really enjoyed it.yes I know it's fiction but it's based on real events, the author writes at the end of the book that she stuck mostly to events which took place but of course some/most was imagination.  this book shows us the beginning of Katherine's journey from where she was betrothed and getting married to henry Herbert at the same time as her sister Jane married Dudley and ends with Katherine on her death bed dying as Lady Katherine Seymour, princess of the blood, prisoner of the queen. this book is lady Katherine's journey and what a journey it is.I absolutely love Katherine and I have a new found respect for her, she truly must have suffered the last years of her life without her eldest boy and seeing Ned, plus she was moved from jailer to jailer, it seems Elizabeth I really didn't care for her cousin much.I left one star off because in the middle I did feel like the story dropped a bit and got slow but it didn't last for long, I have to give this author credit because I ended up a blubbering mess at the end, even though I knew how her story ended, I was heartbroken, that at the young age of only 28 with two young children and a husband she truly loved and adored but because of circumstances she lost the will to live, she felt that their lives would be better if she wasn't around.  \"She thought to punish me by not naming me heir, by removing me from the succession, by excluding my children from their rightful places in the realm. But what she did not understand was what I truly wanted. I simply wanted peace. I was happy for her to rule this realm. I would have been happy to take my children to my husband’s home and live there the rest of my days, never setting my foot in court again.\"I agree with the author at the when she she wrote \"There are many who in history and in fiction have portrayed Katherine as frivolous, “featherbrained,”promiscuous, selfish, and covetous of the throne. I feel this is false. She watched her sister be thrust into power and die from it. Why would she want that for herself? She willingly chose to marry the man she loved behind Elizabeth’s back, knowing there would be consequences. While some of her behavior may have been brash and reckless, she was an intelligent woman. She was, in fact, well educated.\""}, {"userName": "Anne", "userReviewDate": "Oct 05, 2015", "userURL": "http://www.goodreads.com/user/show/7051280-anne", "userReview": "[ I don't think I've ever before seen a novel written by an MC who then proceeds to write her own death. Can you even do that? It goes right up to the point where she closes her eyes and dies. What? Really? So when did she write it? After she was dead? Huh-uh. Not buying it. Sorry.Also, the post script written from Queen Elizabeth's point of view was confusing and pointless. I also think that the author's portrayal of Elizabeth was neither accurate nor interesting; she's simply a spoiled brat. It's been done and it's boring.  (hide spoiler)]"}, {"userName": "Zili", "userReviewDate": "Aug 08, 2015", "userURL": "http://www.goodreads.com/user/show/18851333-zili", "userReview": "I enjoy reading a range of historical fiction novels varying from Medieval or Regency to Scottish Highlands (yes Outlander I mean you) and the affairs of the Tudors. With so many examples out there it is often difficult to find an untold story. I often find myself feeling as though I've already several versions of the same story. With Prisoner of the Queen I felt as though it was new story because E. Knight has focused on a lesser know character from English history.Lady Katherine Grey is the younger sister of Lady Jane Grey, who was part of a failed rebellion against Mary Tudor (after the death of Edward VI). The plot saw her placed as Queen for nine days. As a relative of Henry VIII and subsequently Mary and Elizabeth Tudor and the doomed Jane, Katherine has her every movement monitored. Her life isn't her own and she serves as a pawn in a battle she never wants to be in.I don't think I've ever cried reading a historical novel before but Katherine's story is heartbreakingly sad and I felt completely devastated by her struggles. The love story element is sweet and charming but is made all the more poignant by the simple fact that it was real (albeit it retold in a fictionalised account). All Katherine wants is to live a happy, normal life with the man she loves, but time and time again their plans are interrupted by outside forces. I expected to be annoyed with Queen Mary but I actually found myself getting extremely agitated by Queen Elizabeth's actions. I cried for Katherine and Ned's plight.For those readers who are convinced historical novels are all fluff and no substance then they should give Prisoner of the Queen a chance to show them the greater depths of the genre. Yes, E. Knight fully admits she has taken certain liberties with the facts and altered events by creating a voice for these historical figures. However, she has also researched real historical events and offers a different approach when looking at the lives of the Tudors and Greys. I only wish I didn't already know how the story ended. If you don't know much about Lady Katherine Grey (spelt as Catherine in some sources) and Edward Seymour (make sure you get the correct Edward) then I suggest you read the book first before researching them, as you'll discover huge spoilers about their lives.4 Stars in my Sky!I received a copy from the publisher (via NetGalley) in exchange for an honest review!More at Zili in the Sky"}], "description": "I have served three queens in my life.One was my sister. One was my savior. And one my bitterest enemy.Knowing she was seen as a threat to the Queen she served, Lady Katherine Grey, legitimate heir to the throne, longs only for the comfort of a loving marriage and a quiet life far from the intrigue of the Tudor court. After seeing her sister become the pawn of their parents and others seeking royal power and then lose their lives for it, she is determined to avoid the vicious struggles over power and religion that dominate Queen Elizabeth’s court. Until she finds love—then Kat is willing to risk it all, even life in prison.", "title": "Prisoner of the Queen\n      \n          (Tales From the Tudor Court #2)", "url": "https://www.goodreads.com/book/show/22796868-prisoner-of-the-queen", "average": 3.98, "cover": "", "reviews": 82, "authors": [{"url": "https://www.goodreads.com/author/show/7265420.E_Knight", "name": "E. Knight"}], "type": ["Historical", "English History", "Historical", "Romance", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/22796868-prisoner-of-the-queen", "http://www.goodreads.com/book/show/25367530-prisoner-of-the-queen", "http://www.goodreads.com/book/show/25217755-prisoner-of-the-queen", "http://www.goodreads.com/book/show/22723652-prisoner-of-the-queen", "http://www.goodreads.com/book/show/24965071-my-lady-viper", "http://www.goodreads.com/book/show/23241868-a-day-of-fire", "http://www.goodreads.com/book/show/25916945-a-year-of-ravens", "http://www.goodreads.com/book/show/34347619-songs-of-blood-and-gold"]}