{"ratings": 111, "userreviews": [{"userName": "Andrew Whitaker", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/15835525-andrew-whitaker", "userReview": "Too religious"}, {"userName": "Justin Tapp", "userReviewDate": "Jan 12, 2014", "userURL": "http://www.goodreads.com/user/show/27614432-justin-tapp", "userReview": "Racing to Win: Establish Your Gameplan for Success by Joe Gibbs with Ken Abraham (2002). I well remember Joe Gibbs' Redskins dynasty in the NFL and am well-acquainted with Gibbs' NASCAR team, which he runs with his sons. I didn't know Gibbs' background and upbringing, so I was eager to check out his autobiography. Rather than just being an autobiography, however, Gibbs gives various \"cornerstones\" for success throughout the book, making it read more like a management/leadership text. (How many \"cornerstones\" can you have? I would think that after the fourth cornerstone you should call them something else, but that's just me.)The Tim Tebow controversy this season strikes me rather odd given how outspoken guys like Gibbs were about their faith while in the NFL (Reggie White is another). I guess if you've won multiple Super Bowl titles nobody questions or is offended by what you say? Gibbs is unashamedly evangelical, even closing the book with a Gospel presentation and invitation.Gibbs' life had follies. His poor financial decisions left him bankrupt at the peak of his NFL career in the late 1980s. He blames his diabetes on his poor lifestyle choices. His competitive drive on the racquetball circuit (who knew?) cost him money and time with his family. But Gibbs preaches from his experiences.Given that Gibbs has won multiple Super Bowls and NASCAR points championships, it's no surprise that people want whatever his \"secret\" is, but you won't find much unusual here. One could probably make an argument that Gibbs got his success through good networking and after he'd achieved some success he found others willing to help him out of bankruptcy and into a NASCAR start-up that likely would not have been possible otherwise.If there's one key trait, I think it would be that Gibbs built his NFL teams around character, doing in-depth research on players to figure out which ones had an internal motivation and not just great physical talent. This seems to be what he looks for in NASCAR drivers as well. He hired someone to develop some type of empirical evaluation to measure their potential at whatever position they were applying for in his organization.Surround yourself with guys who are highly motivated and that will separate you in a league where parity is the norm. How Gibbs runs his racing team was most interesting to me. His current team features hard-chargers Denny Hamlin and Kyle Busch, and Busch's character seems to fall far short of Gibbs' standards (Busch was fined and suspended for intentionally wrecking someone late this season, ending his hopes of a title and angering his sponsors). This book was written just after JGR won its first overall points championship with Bobby Labonte in 2001. Gibbs talks of weekly (voluntary) chapel services for all of his employees, of how Dale Jarrett was led to Christ as one of his employees, and how at least one of his major sponsors wants to \"reach people for Jesus\" via NASCAR. It's hard for me to equate that with the childish, volatile behavior of Gibbs' current group.But there was almost nothing in the book about his coaching methods, communication style, or even his continual improvement in anything.In all, I give this book 2 stars out of 5. If you don't care to learn about Joe Gibbs, then this book isn't for you."}, {"userName": "Michael Cunningham", "userReviewDate": "Sep 05, 2013", "userURL": "http://www.goodreads.com/user/show/23149209-michael-cunningham", "userReview": "The book “Racing to win” is one of the most powerful books I have ever read. It is very informational from the financial gain to the emotional stress that comes with it. Joe Gibbs writes an exciting book on how he was rich poor and started from the bottom. Joe like other athletes tried to be the best he could be in everything he wanted to play for the NFL, but his dream was to coach in the NFL. The book shows that Joe Gibbs is a very religious and humble man. I encourage everyone to read this book unless that person is super religious because Joe Gibbs quotes God on almost every page. There are many bible verses at the end of the book that describe me and I can relate to. This book is very enlightening and really easy to read because it is written in everyday language. Joe makes the book relate to us on an emotional way bringing us into his life. What I took from this book was that if I can put one hundred percent into anything I do I can achieve my goals. This book is for people who are looking for guidance in life. It will teach people who read it how to manage money and not become bankrupt. This book is motivation it is interesting. After reading this my thoughts on life change greatly. If I could encourage anyone to read this book it would be anyone who plays a sport or going through rough times."}, {"userName": "Gabriel Renzi", "userReviewDate": "Oct 26, 2014", "userURL": "http://www.goodreads.com/user/show/27547914-gabriel-renzi", "userReview": "Overall: a great book! A very inspiring book by Joe Gibbs who is a former head coach of the Washington Redskins and a member of the NFL Hall Of Fame. He writes about a lifetime of career choices and personal decisions in all areas of life.Great words throughout the book:\"I'm a great believer in luck, and I find the harder I work, the more I have of it.\" -Thomas Jefferson\"Integrity is key and will make a way.\"\"He was teaching me, preparing me, so I'd be ready to deal with adversity in the future.\"\"...you'll never be a great head coach until you've learned how to be a good assistant.\"6 Key Areas To Be Successful:1. Career2. Finances3. Building A Team4. Personal Relationships5. Making Moral Choices6. Health & Physical FitnessJust a few of the many great words throughout this inspiring book. Great way to pick up on some leadership tips and qualities."}, {"userName": "Tarin Arneson", "userReviewDate": "Apr 09, 2015", "userURL": "http://www.goodreads.com/user/show/37901047-tarin-arneson", "userReview": "I really enjoyed this book! It is by far my favorite. This is a biography that has everything in it. Joe talks about struggles, good times, bad times, the highs, the lows, and how the Lord helped him through all of it. I would suggest this to anybody who needs motivation or is struggling."}, {"userName": "Brenda Wharton", "userReviewDate": "Apr 05, 2012", "userURL": "http://www.goodreads.com/user/show/7801524-brenda-wharton", "userReview": "Former NFL head coach and NASCAR owner tells his story of his rise to fame and mistakes made along the way. He learned how important it is to have a good Biblical foundation and to take time out for your family. Good, encouraging book"}, {"userName": "Dwayne Smith", "userReviewDate": "Jul 30, 2011", "userURL": "http://www.goodreads.com/user/show/5919273-dwayne-smith", "userReview": "Coach Gibbs shows his transparency through this book. Great book by a great man."}, {"userName": "Gina Herald", "userReviewDate": "Apr 19, 2011", "userURL": "http://www.goodreads.com/user/show/5286116-gina-herald", "userReview": "Everybody loves a winner. Gibbs is a man of his convictions."}, {"userName": "Michael Ali", "userReviewDate": "Feb 20, 2013", "userURL": "http://www.goodreads.com/user/show/16642848-michael-ali", "userReview": "This shows how an extremely successful former NFL coach goes ahead and becomes successful in a completely different area with the same strategy. Great book recommend it to anyone."}, {"userName": "Spencerdan", "userReviewDate": "Aug 07, 2009", "userURL": "http://www.goodreads.com/user/show/2603222-spencerdan", "userReview": "Parallels of racing and life work.It tough but can be rewarding if you stick with it and have a plan and vision."}], "description": "Joe Gibbs is the only coach in history who has won prestigious championships in two world-class sports: NFL's Super Bowl and NASCAR's Winston Cup. A proven winner in motivating himself and others to succeed, the former Washington Redskins coach and current NASCAR team owner reveals the keys to success in Racing to Win. Through fascinating inside stories about stock car racing and football, Gibbs candidly admits his own mistakes and shares the life lessons he's learned. Football and racing fans, as well as anyone interested in balancing work and family responsibilities, will find Racing to Win both a page-turner and a valuable resource filled with practical truths.Victory Is Within Your ReachStrap yourself in for the ride of your life--and start racing to win. Now the only man ever to lead teams to championships in two major sports shares with you his powerful high-octane formula for success.Calling his plays by the bestselling Book of all time, Joe Gibbs tells you what made him a believer--in God, in his team members, and in himself. His incredible story of triumph and defeat in the high-stakes world of professional sports and in life will make you a believer, too.", "title": "Racing to Win", "url": "http://www.goodreads.com/book/show/1169052.Racing_to_Win", "average": 3.72, "cover": "https://images.gr-assets.com/books/1320506467l/1169052.jpg", "reviews": 10, "authors": [{"url": "https://www.goodreads.com/author/show/293709.Joe_Gibbs", "name": "Joe Gibbs"}, {"url": "https://www.goodreads.com/author/show/27644.Ken_Abraham", "name": "Ken Abraham"}], "type": ["Sports and Games", "Leadership", "Business", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/1169052.Racing_to_Win", "http://www.goodreads.com/book/show/7240842-racing-to-win", "http://www.goodreads.com/book/show/1433710.Racing_to_Win", "http://www.goodreads.com/book/show/6304739-game-plan-for-life", "http://www.goodreads.com/book/show/3107735-joe-gibbs", "http://www.goodreads.com/book/show/13190992-game-plan-for-life-chalk-talks", "http://www.goodreads.com/book/show/9317535-game-plan-for-life-volume-1--bible-study-book", "http://www.goodreads.com/book/show/13700855-niv-game-plan-for-life-bible-hardcover"]}