{"ratings": 3469, "userreviews": [{"userName": "Cynthia Corral", "userReviewDate": "Apr 29, 2016", "userURL": "http://www.goodreads.com/user/show/3793206-cynthia-corral", "userReview": "This book is the best kind of historical fiction in that it tells a real story with real people, but from a fictional character’s point of view. I am not sure what I initially expected of this book; I think just a story set in the time of radio’s beginnings. But it is so much more!It is part of the story of the beginning years of the BBC. I soon started googling the guest speakers they mentioned (as I’m an ignorant American born in the 60s). I found these very real people to be very interesting, but then I googled Hilda Matheson, a pretty prominent character in the book, and discovered she was a real person too. Then I googled the other characters and realized this was actually a fairly true story told from a (fictional) assistant’s point of view. This upped my fascination level even higher than it was when I requested the book.I had never read a book that revolved around radio’s beginnings, and it really brought to light not only how much the world changed with that one invention, but how similar the change was then to these new internet days now. There was so much talk of the world becoming a smaller place, and how everyone with access to a radio could now get so much knowledge they had no access to before, and how it would help people who felt alone in the world. These are all things they say about the internet now. As far as we’ve come in the last 100 years, the radio also gave us a huge jump in technology and knowledge and connection with the world.With this knowledge however comes the question of who will control the dissemination of that knowledge. BBC’s beginnings came at the same time as Women’s Suffrage in the UK, and those grumbling times are remarkably similar to today’s political atmosphere. Women’s Rights also meant loss of the men’s control and they certainly were not happy about it. World War I had just ended, governments were reorganizing, and businesses across borders were forming new alliances. The stock market crash in the US had just as great an effect across the Atlantic. There were at least two opposing views on each of these topics, and control of the BBC meant control of the information the world received.In the middle of all this is young Maisie, our fictional heroine who lands a low-level job at the BBC hoping to find a husband, but instead finds a career and a new life plan. A life plan she could barely comprehend as it wasn’t remotely a possibility just a few years before. Along with Maisie comes a fictional storyline starring the BBC, Nestle and Siemens, and the Nazis. As Sarah-Jane Stratford mentions in the very informative Author’s Note, the actual storyline is fictional, but many of the events surrounding it are not, and many similar events were taking place.Stratford wrote this book because of her fascination with Hilda Matheson from the BBC, and this fascination is transferred to the reader. She was an amazing, high-level career woman in times when there was no such thing, and she was a lesbian to boot. She is a fantastic role model to young women even in our own times.And so is our young Maisie, who follows her dreams of being a reporter with various levels of success. But in Maisie’s case as it is always, it doesn’t matter how many times you fall down, it matters how many times you get back up. She takes her role as reporter very seriously, and even takes on some spy traits as she works to save free speech in the UK and women’s rights as well.This is an outstanding book that gets better and better as it goes along. I love that I learned so much, I love that I’ve developed a great interest in the amazing Hilda Matheson, and I really enjoyed the fictional plot. It may have gone a little slowly in the beginning, as the fictional plot doesn’t get going until the second half, but spending the first half on Maisie’s moving up the ranks and learning about all the real-life changes that happened in those few short years was worth it all.Many thanks to the Penguin First to Read program for an advance copy in exchange for an honest review."}, {"userName": "Dorie", "userReviewDate": "Jun 09, 2016", "userURL": "http://www.goodreads.com/user/show/16912659-dorie", "userReview": "Wow this was first rate historical fiction!! I knew nothing about the beginnings of the BBC or how the British Nazi party and it’s sympathizers at one point tried to infiltrate and sway public opinion through radio. The main character is Maisie Musgrave who begins her career as a lowly secretary to the real life Hilda Matheson. We watch Maisie mature and grow into her own woman who finds her voice and suggests many story lines for what was called the Talks Department. Hilda is a very strong female and though she works for John Reith and pretends to go along with his wishes, she manages to get very influential people to do broadcasts which will educate and interest a broad audience.There is so much going on in Britain at that time between WW1 and WW2. The women finally get the vote and yet there are still many restrictions on what jobs a woman can get. They are actually expected to leave their jobs when they marry. Maisie had thoughts of marriage when she first came to work for the BBC and does find romance but she puts her budding career first and eventually becomes a producer.Lady Astor was an influential backer of women’s rights and when they got the news that the vote had passed she stated so well “Don’t you realize what this means? All women over twenty-one can cast a vote next year, single or married, rich or poor. It’s the law now, and it won’t ever be changed again. It’s rather a bit of something” and it certainly was!This book had everything that great historical fiction should have. Wonderful writing, interesting subject matter, incorporation of real events and real people into the fictional part of the story and wonderful and well described characters.I don’t want to give away any more of the plot of the book but I would highly recommend this book to everyone. This is easily the best historical novel I have read in the past 6 months.Thank you to Berkley publishing group and NetGalley for the opportunity to read an ARC of this exceptional novel in exchange for an honest review."}, {"userName": "DeB MaRtEnS", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/9827967-deb-martens", "userReview": "3.5 stars. Radio Girls started out as a \"lite\", easy-reading version of historical fiction, with a young woman seeking a new life and perfect romance, while wrestling with impertinent cads, stuffy head secretaries and self-Important bosses in the exciting venue of radio in its infancy at the BBC. Surprisingly, as the novel progressed, the back story strengthened and gave this book a heft not hinted at initially. That said, Sarah-Jane Stratford has done her novel and readers a significant disservice by not informing them, right from the beginning, of the credentials of the Who's Who in this fictional history of the start-up of the British Broadcasting Company. A list of \"A Cast of Characters\", and a mini-sized bio would have elevated its story, and its snapshot in time, as one which its audience would want to remember. Lady Astor, Virginia Wolf, The Bloomsbury Group, Hilda Matheson, Vita Sackwell-West, MI5, H. G. Wells, James Joyce- a little would have added a lot more credence to the credit of this story. Based on historical events in London, fictional heroine Maisie Musgrave joins the radio business in 1926 at the BBC, a fad \"not expected to last \", as a secretary. The written details of the era, the attitudes, the conversation and economics are well depicted as are the frenzied bustle of the fledgling BBC. Post WWI, the country is suffering from a generation of men forever gone, and women who will never marry. Women's struggle for financial survival and political independence is well drawn within the working structure of the BBC against the push for universal suffrage and the unbendingly misogyny of Britain's conservative wealthy mainstream. The concerns of the times - an uprise in Fascism, corporate manipulation, the power of trade unions - are interwoven in a complex plot. Although the characters are not infused with great depth, they stride through the tumult of BBC's conspiracy and internal manipulations while they pull the readers, fascinated, with them. Author Stratford, in her concluding Note, briefs her audience finally on the true life identities of her cast. That summary impressed me; I wished that a bit more would have been forthcoming initially. A respectable 3.5 stars. Good historical content, something worth learning."}, {"userName": "R K", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/25898891-r-k", "userReview": "The only reason I gave this 2 stars is because it had potential.It had a very hooking plot and included a cast of people who really lived and worked for BBC.I was so excited for a historical fiction of BBC. Instead I got M16 the 1920-30 version. It sounded cool but was not at all. But it had the potential to be cool.The writing was weird. It was very simple and the \"creative\" parts felt forced. As if there was some checklist that called for some cheesy metaphor or simile every few sentences. It was cringy and not too spectacular.The MC, Maisie is so dull and a bit of a hypocrite. It didn't fit in at all with her past. She is supposed to have a cruel past where she was ignored by her mother. Plus she somehow slipped in as a nurse in WW1 at the age of 14 trying to pass as 18 (how is that even possible?). Regardless, her experience in the war should have hardened her and made her used to direct orders, fast work, and create a calm mind. Instead we got a girl whose so nervous about looking shabby and is clueless in fast pace environments. Makes mistakes. Get nervous and stumbles in front of others. How is any of this resembling a girl with such a past? It would have been ok if she didn't have such a past but because she did I was expecting a hardworking person who learns quickly. Also, until halfway her main goal is to score a husband, quit her job and become a housewife. Again, it's ok for her to have such a desire in life but not when she also goes around saying that she will be the conqueror. Not when she demands more work. She's so afraid of gossip and hold grudges for a long time. Again, how can someone who worked as a nurse in WW1 worry about/obsess over something so insignificant? She tends to look down on all the pretty coworkers by telling herself that they never worked as a nurse. They weren't abandoned by their mother. They are too busy watching their weight allowing her to eat all the butter and cream. What!? Aren't you doing the same thing? Some might think that she might have internalized misogyny. I don't really know but she would roll her eyes and think, \"men\" with those who were around her age yet on the other hand she would act demure and respectful to a man who openly mocks her gender. She even agrees with some of his \"points\".Now I guess some might say I'm being too harsh and that she does go through character development. To that I agree. She does have her moment but it's so quick! It happens in minutes. That's not character growth, that's plot progression.The reason why I'm being a bit harsh on her is simply b/c her character was not properly written. I'm all for shy timid female characters. I also agree that women don't need to always parade the \"pro feminism\" banner. Yet for a character that is supposed to be surrounded by women who worked in tough bloody life threatening environment shouldn't she change? Shouldn't she have PTSD or trouble sleeping? Some kind of issue from her upbringing? I don't think a shy timid person would last in a battlefield situation, no? She just turned out to be a girl who only cared about making sure her voice was unheard and worried over her appearance while dreaming about marrying some rich man and eating in rich locations. The other thing is, we only see from her POV. It gets tiring because there is literally no plot until almost 3/4 of the way in. Instead we see the day to day work Maisie does along with the day to day sexism. To be quite honest any of the other characters were far more interesting then her. I didn't even know that some of them were real! The author briefly mentions it but at the end. And the most important character is not Maisie but Hilda. Now Hilda is a women whose story I want to read about.Oh boy that got ranty. SorryIt had so much potential but missed the mark.I forced myself to read halfway then started skim reading"}, {"userName": "Irene", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/1887310-irene", "userReview": "I enjoyed the setting of this story, the early years of the BBC, the 1920s when women won the right to vote, were elected to political office in Brittan and began to push their way into professional roles, an era when every new door that opened for women revealed a new ceiling which was not yet glass. I appreciated the author’s end notes which informed me that nearly all the characters were both historical and faithful to the historical record. The fault I found with this book was in the writing. The author needed an editor willing to remind her that she could trust her reader. Back story details were repeated over and over to no purpose; most of these were not relevant to the story line. Over-the-top metaphors and dramatic adverbs were used with such regularity that it gave the book a melodramatic tone that bordered on the silly. I suspect that most readers will not find the writing distracting; I am supersensitive to purple prose and a heavy hand with the details. I wish I could award this 2.5 stars."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Oct 23, 2016", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I loved the time period and historical detail of this novel, in fact I would probably read more about the BBC. Unfortunately in this novel, the writing bogs down the story, especially the mundane description and chatter. I found the author's notes to be a more direct and readable style, and I admire the quality of her research, so I suspect this is her first novel. I also noticed overuse and incorrect use of words like \"copacetic\" and \"atavistic.\" I'd like to read the actual journal of Hilda, who is a real person.Thanks to the publisher for providing a review copy."}, {"userName": "Blaine DeSantis", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/2994598-blaine-desantis", "userReview": "I remember reading about this book in early July while in Romania and kept looking and looking for it and finally got it a few weeks ago. Maybe it was the anticipated wait, or maybe it was the authors first book, but the initial hype was not justified in my mind. What went wrong?Well, the book for me was a very slow read - not that a book has to be a fast read to be good, but it just plodded along for me. Also I am not sure of exactly what or whom the author really wants us to follow and root for. It is obvious from her end notes that the book is a tribute to the character Hilda - who was a true radio broadcasting pioneer - but it really is Maisie whom we follow with Hilda always just being in the background and answering questions cryptically.What is good about this book is the obviously tremendous research the author did on her subject of Hilda and the early days of the BBC, along with the British Fascist party and all of the political turmoil that was going on in Britain in the late 1920's, which culminated with Parliament voting for Universal Suffrage and the women deciding the course of the next election.We follow all of this through the naive eyes of Maisie who appears almost penniless and somehow gets a job at BBC and eventually rises through the ranks and becomes quite the valued employee when she moves from being an assistant secretary to the Director General of the BBC to the actual Radio end of the BBC and begins to work with Hilda on the radio Talk shows. Throughout we meet a lot of characters, most all women being portrayed well and most men being either cads or bores. But we do see a lot of the British value system being upset as times move on with the Roaring 20's and then the beginning of the Depression. We also meet some real-life characters through the book which is a lot of fun: Lady Astor, Vita Sackville-West, Virginia Wolf, and many other prominent men and women.But, in effect the book is truly a tribute to the hard-working women of the BBC.This is a little less than I had hoped for with the book, but I do want to point out how little the BBC has changed in a manner. When the BBC started the book points out all the talk radio shows they produced and the division of the BBC. Most shows were from 15-30 minutes long and some got so popular they had to add an extra 5 minutes at the end of the show to go over issues not touched upon in the broadcast. Now lets forward to the age of the internet and one of my favorite Podcasts is the BBC podcast \"In our Time\" which comes out weekly in about 35-40 minute main episode and then at the end we are invited to stay an extra 5 minutes for matters not covered in the podcast - pretty darn similar if you ask me. It is a wonderful podcast with episodes dealing with Science, History, Arts, Philosophy, Politics, etc. or in other words all those sorts of topics the BBC Radio began with back in the 20's to attract and educate their readers. Pretty neat perspective this gave me about both the radio and the podcast.Finally, a shout out to the Shelby (NC) Community College Library for providing me with this book through the Inter-Library loan system! More and more I am finding out just how great our local library and college libraries can be for avid readers!"}, {"userName": "Elizabeth of Silver's Reviews", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/1882027-elizabeth-of-silver-s-reviews", "userReview": "Before the Internet and cell phones.Before women were seen as being more than secretar​ies​.RADIO GIRLS takes us back to the ​era of the ​wireless ​radio ​and the BBC.​ Loved the history.​​ Loved learning about the development of radio, the shows, and hearing that some listeners were afraid of the wireless.​The time period is authentically portrayed​, and Hilda Matheson, a real historical figure, is ​one of the main characters. Hilda Matheson was The Director of Talks at the BBC and always had very interesting people on her show.Maisie was ​another main character and also ​a terrific character. I enjoyed ​h​er spunk and how she ​carried out her harried​, but enjoyable​ job every day​. ​RADIO GIRLS was a pleasant, educational read.​ The cover is quite charming and drew me in immediately.Anyone who enjoys the era between WWI and WWII and sharing the lives of women and their fashionable clothing and lifestyles will thoroughly enjoy RADIO GIRLS. All the glitz and glamour of the era shines through as you learn the history of the BBC. 4/5This book was given to me free of charge and without compensation by the publisher in return for an honest review."}, {"userName": "Dorie", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/16912659-dorie", "userReview": "Review Wow this was first rate historical fiction!! I knew nothing about the beginnings of the BBC or how the British Nazi party and it’s sympathizers at one point tried to infiltrate and sway public opinion through radio. The main character is Maisie Musgrave who begins her career as a lowly secretary to the real life Hilda Matheson. We watch Maisie mature and grow into her own woman who finds her voice and suggests many story lines for what was called the Talks Department. Hilda is a very strong female and though she works for John Reith and pretends to go along with his wishes, she manages to get very influential people to do broadcasts which will educate and interest a broad audience.There is so much going on in Britain at that time between WW1 and WW2. The women finally get the vote and yet there are still many restrictions on what jobs a woman can get. They are actually expected to leave their jobs when they marry. Maisie had thoughts of marriage when she first came to work for the BBC and does find romance but she puts her budding career first and eventually becomes a producer.Lady Astor was an influential backer of women’s rights and when they got the news that the vote had passed she stated so well “Don’t you realize what this means? All women over twenty-one can cast a vote next year, single or married, rich or poor. It’s the law now, and it won’t ever be changed again. It’s rather a bit of something” and it certainly was!This book had everything that great historical fiction should have. Wonderful writing, interesting subject matter, incorporation of real events and real people into the fictional part of the story and wonderful and well described characters.I don’t want to give away any more of the plot of the book but I would highly recommend this book to everyone. This is easily the best historical novel I have read in the past 6 months.Thank you to Berkley publishing group and NetGalley for the opportunity to read an ARC of this exceptional novel in exchange for an honest review."}, {"userName": "Chris  Carroll", "userReviewDate": "Jun 02, 2016", "userURL": "http://www.goodreads.com/user/show/16768971-chris-carroll", "userReview": "This book offers an interesting look at England and Europe in the time before World War II as Hitler and his Nazi party are starting to make themselves known in Germany. With the BBC just beginning and captivating all of England, the author gives us a tour of what it would be like working in this highly impressionable industry and place.With political issues surrounding everything the BBC is doing, pressures are coming from all over to control and force a particular political agenda. But all is not what it seems in the BBC and our radio girls have discovered A conspiracy that can change not only the listening world but the political arena in England.The author is done fabulous job in showing us life in England right when the women get open voting but yet women are expected to leave their jobs if they get married. What jobs there are for women are few and if you actually have a mind and brain as a woman, pressures were still there to hold a woman to a service capacity only.This book goes one step further and shows us strong women that are involved in the BBC and the work that they did and the impressionable topics they brought to their listeners and readers.This book is very interesting read on women’s history and empowerment. While the beginning was a bit slow, the book really took off from the middle on and especially the ending. The authors knowledge of the time and her incorporation of real people in history combined with fictional characters made for an inspiring and in-depth read. Perfect for any woman or man that’s interested in the changing world of the late 1920’s."}, {"userName": "Amanda Espinoza", "userReviewDate": "Apr 22, 2016", "userURL": "http://www.goodreads.com/user/show/4014256-amanda-espinoza", "userReview": "Disclosure: I received a copy of this book in exchange for my honest opinion. I’m a Candor at heart. I can’t help, but tell the truth. This book was the perfect antidote to my recent Science Fiction binge. I was looking for a good Historical Fiction novel when I saw this beautiful cover and interesting story. RADIO GIRLS certainly rekindled my joy for Historical Fiction. Late 1920s London after WWI is a fascinating window into the history of the BBC. We know what’s going to hit London in 1940, but the characters can’t see the future. The story of Maisie and the other characters feels like Mad Men meets Mr. Selfridge. I would even say RADIO GIRLS could have been set in the seventh or eighth season of Downton Abbey if Edith went into radio. I enjoyed the book very much and finished it within a week. Maisie is a strong character and I appreciated her generous appetite. Everyone else adds their own spice into the mix. I enjoyed the fast and snappy dialogue. I don’t want to give too much away, but it was intriguing to see some of the struggles of women in 1920s London. There were a few parts when it felt like the story wasn’t moving, but when things got going I couldn’t put it down. (Just like a typical Masterpiece series.) Be sure to read all the way through the very end. Some of the best bits are in the back. Definitely giving this one two thumbs up and recommending it!"}, {"userName": "J.L. Guzior", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/66319933-j-l-guzior", "userReview": "DNFI had been dreaming about getting my hands on Radio Girls for months now and I was thrilled when I saw it available at my library. I've had to recheck it out twice now because I kept on picking it up and putting it down. I was quite disappointed that it didn't keep my interest in the slightest. I kept falling asleep while reading it which is never a good sign for me. It was a total snoozer. I never connected with a single character and the main character is a complete pushover. I found myself screaming at her in my head. I didn't finish this book because I felt I had no reason to. The story was weak, the characters blah and I just didn't see that it was ever going to get to a point. Who knows? Maybe it gets to a point eventually, but I just didn't feel like investing any further reading time. I'm so disappointed that I just didn't like this book."}, {"userName": "Ian", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/37718584-ian", "userReview": "This moved slowly and took me a while to finish, but the characters are all worth getting to know, women and men. They're all trying to make sense of themselves in a rapidly changing London. The men, even the young men (although, you can almost see the author giving birth to a more modern man with her treatment of Cyril in the end), are trying like hell to cling to conservatism, while the women are doing everything in their power to break through it.Maisie is a young Canadian woman, who is basically an adult orphan in London looking for purpose in her life. She is seeking a husband to rescue her, but finds the BBC and Hilda Matheson instead. Matheson, unlike Maisie, existed in real life. She led a terrifically colorful life (Google her!) as a pioneer of British public radio in the 1920s. The fascist plot that the two uncover was well told, but I found myself more engaged with the less sexy, but still fascinating behind the scenes glimpse into the atmosphere at the fledgling BBC. It's sort of a battle of the sexes, Mad Men-esque experience, but this is the 20s so it's all g-rated through our eyes. The old man who runs the station, John Reith (he's real too) treats the women like daughters in need of protection (sometimes from themselves). The young men don't take them seriously. Women like Hilda and Maisie have to play along to some extent, but manage to find success nonetheless. In the background, major history is unspooling, from women's suffrage to the Nazi beginnings, and Hilda and Maisie find themselves more or less in charge of delivering the BBC's take on these events to 4 million British listeners. As a side note, I've been reading Romantic Outlaws, a nonfiction about Mary Wollstonecraft and her daughter Mary Shelley's lives in the 18th and 19th centuries, and it's been interesting (though, I guess not altogether surprising) to think about the similar ways they treat the female experience. In both books, the women are strictly there to keep the home and tend to their husbands. They are supposed to be seen, not heard. All that sort of crap. The two Marys push through all of this and become successful in spite of it. But it struck me, how both of these books tell similar stories at their core, and so much of both plots take place in the very same city of London. When one thinks of women's rights (and here I should add that these books concern white women, as I can't think of a single woman of color who makes an appearance in either of these books), it's tempting to think of it as a line graph, with the movement making steady progress across centuries, but in so many ways -- far too many -- the two female experiences match up."}, {"userName": "Lauren", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/3548900-lauren", "userReview": "Why do authors not trust in their stories?!Radio Girls, a historical novel set in 1920s London and heavily influenced by actual events and actual people, has a pretty fantastic premise. Maisie Musgrove lands a job as an assistant at the recently formed BBC, where she finds herself stuck between two bosses: one a traditionalist, the other a modernist. The two battle over the role of radio in society as Maisie navigates the exciting, enthralling world that is this new technology.On its own, that would have made for an excellent story. In fact, the strongest parts of the novel are when Ms. Stratford focuses on that conflict. Instead Ms. Stratford throws in a bizarre spy subplot involving Fascists that turns the whole novel into a bit of a joke. I honestly thought parts of the spy subplot had to be real, simply because those sections were so ridiculous they seemed like they had to be true. But no. All fictional. (As a side note, my distaste for the spy subplot is not helped by having recently finished a book on an actual female spy: Howard Blum’s enthralling The Last Goodnight.)I think what most frustrated me is that the pages dedicated to the pointless subplot took away from the more interesting sections. There were subplots and characters that felt shoehorned in and half developed and would have benefited from more pages to developing their arcs and depths.The detail of Radio Girls is lovely. There are some really fantastic sections that wonderfully capture the time and place in history. Ms. Stratford did her research, and, having read her author’s note at the end, all I can say is: I only wish she had trusted in her original premise to carry the day. As is: not recommended."}, {"userName": "Pamela", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "I'm sending this one back to the library - unfinished; eighty-five pages in, it just didn't hold my attention. Something about the writing style and/or pace wasn't work for me. Or maybe it's the other way around: I didn't work well as a reader. Whatever the case, no I'll feelings. :-)"}, {"userName": "Leah", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/17629329-leah", "userReview": "Inform, educate and entertain...Maisie Musgrave is thrilled when she gets a job as a typist at the newly formed BBC. She's not particularly pretty, and her relative poverty means she's rather dowdily dressed. Both of which are a little unfortunate, since her main ambition is to find a man and get married. But once she becomes exposed to some of the new thinking at the Beeb, and especially some of the feisty and successful women making their names there, Maisie begins to develop ambitions of her own – perhaps to produce a radio show one day, or even write for the Radio Times. Those ambitions will still leave her enough time for a bit of dabbling in romance, though...Stratford has clearly thoroughly researched this fascinating period of the BBC's early history, while it was still struggling to work out quite what its role was to be. Many thought that radio was a passing fad and, at that time, the BBC wasn't a news organisation as it is now. However, there were people within the organisation with very firm views on how it should develop and Stratford incorporates them into her story. Lord Reith is now always thought of as the father of the BBC, who gave it its mission statement – to “inform, educate and entertain”, specifically in that order. But in the book he's shown as the upholder of the establishment and the status quo – a man who felt that women should know their place and stay in it. So his relationship with Hilda Matheson, also a real person, was never going to be easy – feisty, feminist, lesbian, friend to the Bloomsbury set and lover of more than one of them at different times. Hilda becomes Maisie's mentor and influence, though Maisie has a strong enough personality not to come under Hilda's sway entirely.All good stuff, and I found Hilda in particular an intriguing character. I hadn't heard of her before, but it seems she too was highly influential on how the BBC developed, particularly in terms of setting out to inform the newly enfranchised female population of Britain, many of whom were clamouring to know more about the political world so that they could participate fully. However, she also seems to have promoted her own leftish political agenda, this being before the BBC made impartiality its fundamental principle (in theory, at least). I'd like to read a biography of Hilda sometime, if I can find one.And that rather brings me to the problem with the book. For the first half, there's really very little plot. We simply follow Maisie as she settles in to her new job and begins to get to know the people she's working with and for. It's well written, Maisie is quite fun and there's some humour in it...but no real story. But be careful what you wish for, because in the second half, when the story finally arrives, it's kinda silly and not very well done at all. It revolves around the growing Nazi threat, with Hilda and Maisie becoming kind of unbelievable amateur spies. And it's very stretched out with large sections where nothing happens to move the plot along. It feels like Stratford had done all the research, decided what characters she was going to focus on, but then hadn't really been able to think quite what to do with them. A large part of me wished she had gone for a non-fiction approach, either concentrating on Hilda Matheson or widening it out to cover the early years of the BBC. And I do apologise, sisterhood, but I am bored, bored, BORED, with every second story being about how fabulous/intelligent/feisty/strong all women are and how weak/sexist/corrupt/nasty all men are. Feminism was surely never about proving women were vastly superior to men... was it? So why has it become so?? Pretty much the only good men in this book are the gay ones – which I think might be taking the “diversity” agenda just a little too far. But then I seem to have forgotten to pay my dues to the Political Correctness Club recently...So yes, I got a little tired of the “feminist” aspects of this one, although to be fair it's no worse in that respect than a lot of the contemporary fiction written by women. *ducks to avoid the rotten tomatoes*Overall, then, I felt it was a little let down by a weak plot and too much blatant political correctness seeping through. But it is well researched and well written, creating what feels like a reasonably authentic picture of the early days of the BBC, and certainly interesting enough to keep me turning the pages. I liked the characterisation of both the fictional and real people for the most part, and enjoyed the way Stratford kept the tone light with some well judged humour along the way. I will look out for more from this author in the future, and hope that experience will allow her to find a better balance between historical research and plot next time. And despite my reservations, I recommend this one as an enjoyable and informative read. NB This book was provided for review by the publisher, Allison and Busby.www.fictionfanblog.wordpress.com"}, {"userName": "Alisha", "userReviewDate": "May 20, 2017", "userURL": "http://www.goodreads.com/user/show/1790086-alisha", "userReview": "This book might be more interesting to me than to the average reader because I am hugely interested in BBC Radio. I love the talks, the plays, the interviews, the lovely voices. I listen to it frequently through the app, and it can surround me with an atmosphere I find at once stimulating and soothing.This book takes a fictional character, Maisie Musgrave, and plants her in the middle of a bunch of real people, circa 1926. BBC Radio is in its early days. Some view the new medium with suspicion. Others want to use it for their own ends, to shape the views of the nation. But one woman, Hilda Matheson (real person) sees its potential to get the public thinking, to present multiple sides to sensitive issues, to familiarize people with other places and ways, to ask questions and allow individuals to draw their own conclusions.The historical content in this book is fantastic. It's a real world, there are never any false notes hit; the details feel perfect. The characters live and breathe right off the page. Most of the plot centers on things that are accurate history. In the tug of war between various directors at BBC, Maisie gets a front row seat as a secretary. The job is a lifesaver for her; she comes to it in desperate need but with no knowledge whatsoever about radio. Her education is on-the-job, and before many months pass she is a total convert to this wave of the future. Fascinating scenes show just how groundbreaking the broadcasts were, and how innovative it was to establish totally new precedents for radio. The differences between the spoken word and the written word are well handled.When a little bit of fictional intrigue is introduced, it feels like it belongs. There's some Fascist/Nazi propaganda circulating, and a conspiracy to restructure the BBC so that it can soft-pedal these notions to an unsuspecting public. Maisie does a little detective work, but this is not a dime-a-dozen mystery novel. Her education at the BBC and her evolving thoughts on career and marriage feel like the real plot threads.Because this book deals with some real historical figures, it does not gloss over their real moral choices and known proclivities. It's the 1920's and...well, stuff was going on. These things don't figure too heavily in the plot, but they're there."}, {"userName": "Dawnie", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/36293066-dawnie", "userReview": "A wonderfully different view of Englands history told from the great perspective. This book was a very nice read. I loved that it kept \"true\" to the historical events and feeling of clearly showcasing that women during the 1920s where not seen as fully necessary people in the work force, but at the same time they where clearly needed because otherwise very little seemed to get done. I loved that this book showcased the difficulties that women during that time had not only finding a job that actually paid them, but also just working without having problems with their male co-workers. The writing of this book was nicely done. Easy to read, but without simplifying the story or plot. It had nice turns and developments and really gave the me the feel of a historical story. I felt transported back to a time before cell phones and computers, a time before everyone was always connately looking at any type of screen or always knowing what was going on minutes after something happens on the other side of the planet!The characters were wonderful as well!We have the wonderful mixture of different people represented in this book. The easy going girls, that just go with the flow, do what is expected of them and have a great time while doing that. And the ones that don't really fit into the mole that society has for women at a specific time. We have the typical cliche horrendous males that assume endlessly about women and how \"easy\" they are simply because the know about specific topics of conversation and simply assume because some knows about broadway and theatre, they must be someone that can be easily bought with a nice night out!This book was great!I highly recommend it!Its the perfect read for people that starting out with historical fiction, need a solid plot and great characters and action, but want a historical feel to the story. And at the same time it is wonderful for seasoned historical fiction readers because it offers a view into a time in our history that i personally never really read that much about yet. I am not sure if that is because there are not that many books (that are not crime!) from this time, or if i simply haven't found them yet. Either way, it is a very nicely done historical fiction that is worth read no matter what genre you prefer otherwise!"}, {"userName": "Laura Stampler", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/4987359-laura-stampler", "userReview": "I can only describe reading RADIO GIRLS as a purely joyful experience. Sarah-Jane Stratford beautifully weaves fact with fiction in this unapologetically feminist — and I mean that as the highest of compliments — foray into the early days of the BBC, and the women who made it such a smashing success. Our heroine is the fictional Maisie Musgrave in the real and exciting era of Post WWI London. At first Masie is meek and yearns to fit into societal norms. But she truly opens up and embraces her snarky voice and sense of self when she finds the love she has always been looking for. No, not in a husband (although there is definitely romance). In her work. What begins as a job transforms into a career with the help of the real-life BBC producer Hilda Matheson. (Note: I would like to be Hilda when I grow up.) RADIO GIRLS transported me to a time of intellectual exploration (Bloomsbury buffs will be pleased with some of the cameos), women's suffrage, as well as Europe's ominous turn to fascism -- and I didn't want it to end."}, {"userName": "Chelsea", "userReviewDate": "Jun 12, 2016", "userURL": "http://www.goodreads.com/user/show/43520804-chelsea", "userReview": "This book was too boring to hate. It was underdeveloped and overdeveloped all at the same time. Nothing about it was appealing. It had SUCH potential, which makes it sadder it was such a let down. You failed me, goodreads community. This book was a waste of my time. Want to read great historical fiction? Read Beatriz Williams."}, {"userName": "Lydia", "userReviewDate": "Mar 27, 2016", "userURL": "http://www.goodreads.com/user/show/26649689-lydia", "userReview": "This was a really fun book to read!!! Have a dinner party to prepare for, but had to finish the book before I could start working ... I couldn't put it down. (Coming out in June ... in paperback ... which makes it all the easier to sell!!!)"}, {"userName": "Sandra", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/30575518-sandra", "userReview": "I rounded this up to three, since it did have its moments and I don't doubt some people will enjoy it more then I did. So objectively speaking it should probably be three stars. Anyone who has seen my read list will likely know by now that I love fiction set in the 1920s/30s. Add journalism, early radio and mystery and I am likely sold. So this is out of character for me.The thing is that Maisie, the main character, seemed bland and a bit of insecurity is normal, but this was just too much at times. I wanted to get invested and love this, but sadly it didn't happen."}, {"userName": "Sarah", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/10766848-sarah", "userReview": "I won a free copy of this book through Goodreads Giveaways.First off: I LOVED this book! The characters were engaging, the story was engaging, and the writing was top notch!This is a story set between WWI and WWII detailing the beginnings of the BBC and radio. It has strong female characters, and some great insight into the times. Stratford kept me guessing throughout the entire story as to the path that Maisie's life would take (would she marry X or not marry at all, would she stay a shy secretary, would she go on to bigger and better things?). I didn't previously know anything about Hilda Matheson, and it was great to get an introduction to such an amazing woman. I had to start doing my own research after finishing, I was so interested!Overall, this was a fantastic book, full of history and intrigue. I devoured this as quickly as I was able and will be recommending this to all my friends and family!"}, {"userName": "George", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/1021218-george", "userReview": "INTERESTING AND ENJOYABLE“If we have the sense to give [broadcasting] freedom and intelligent direction, if we save it from exploitation by vested interests of money or power, its influence may even redress the balance in favour of the individual.”  (pp. v-vi)—HILDA MATHESON, Broadcasting (1933)Sarah-Jane Stratford’s novel, Radio Girls, offers some interesting and enlightening glimpses at the social history of 1920s Great Britain; and a very nice look at the early days of radio broadcasting, at the BBC. Recommendation: If you can overlook some of the more smarmy, silly romance stuff, and the more often baffling than intriguing attempts at intrigue, then you’ll have an informative book-club read with this one.“He probably meant it, you know, that bit about making Britain great again.” Hilda said as they strolled the Embankment. “Fantasists usually do.” (p. 348).Penguin Publishing Group. Kindle Edition. 376 pages."}, {"userName": "Sarah", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/7664274-sarah", "userReview": "One of my favourites of the year! It had everything that turns me on : the fascinating history of a media conglomerate (the BBC) at the advent of radio, the life story of a queer, feminist icon (Hilda Matheson), the social insecurity of Britain as she hung precariously between two World Wars, suffragettes and the men who were scared of them, the fear of communism and the rise of underground fascism, a plot 1/2 based on fact but made thrilling by the well written fictitious other 1/2 that included a race through cobbled streets as Nazi threats closed in... Radio Girls had it all.Stratford has cleverly given us a flawed fictional protagonist in Maisie. By writing the novel through her eyes, we are given a wonderful view of the real hero - the real-life Matheson. Yes, the novel does move a bit slowly at times, but I never felt bored. I suppose that can be chalked up to my background in media, and gender studies - this book was written for people like me. And I loved it."}, {"userName": "Susan", "userReviewDate": "Jun 12, 2016", "userURL": "http://www.goodreads.com/user/show/2390008-susan", "userReview": "I received an advanced copy of this book from Penguin First-to-Read in exchange for my honest review.Radio Girls is based upon the real-life character of Hilda Mathieson who was an MI5 agent during the WWI. She later became head of the \"Talks\" department for the BBC. I really liked her characters as well as that of Maisie, her assistant, in the book. The author did a wonderful job in creating the atmosphere of what it was like to work in early radio, as well as what it was like in London immediately after WWI. I enjoyed reading about women getting the vote in England. The length of the book caused me to give it a lower rating. Although the first chapter, set in London, 1930, promised a fast-paced story, much of the book became repetitive and some of the suspense got lost in the details about booking people for the radio programs. I think that I would have given a higher rating if the book had been 50-60 pages shorter."}, {"userName": "Jean", "userReviewDate": "Jun 23, 2016", "userURL": "http://www.goodreads.com/user/show/5971699-jean", "userReview": "I appreciate what the author wanted to do. Shedding some light on a lesser known part of history. I liked that Hilda was a real person (and some of the other BBC staff). Her original character, Maise annoyed the crap out of me. Her inconsistent personality and inner rage dialogs. Not a fan of her narrative. It was so hard to focus on this work and make myself finish. I just wasn't interested at all. The climax of the plot was a mere ripple than a tantalizing splash like the prologue promised."}, {"userName": "Barbara", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/6117137-barbara", "userReview": "I waited so long to read this, but I knew I'd love it. Such great characters, especially the empowering females. I was captivated by the history of the start of the BBC. If you enjoy historical fiction this will be a great pick for you. As I read, I found myself transported to London, because the author's writing was quite descriptive. I can't wait for more books by Ms. Stratford."}, {"userName": "Stephanie Anze", "userReviewDate": "Sep 13, 2016", "userURL": "http://www.goodreads.com/user/show/27117957-stephanie-anze", "userReview": "Maisie, a young woman, moves from New York to London. Lacking experience, she applies for a job as a typist at the BBC radio and gets hired. In addition to being a secretary to the head of the BBC, she also works for Hilda Matheson, the head of the Talks department. While she has a faulty start, Maisie begins to flourish under the guidance of Ms. Matheson. Soon, the two of them are chasing down a lead, one that could have a significant impact on the history of radio as well as their own lives.This novel tackles a myriad of topics: the beginnings of the BBC radio, women's suffrage and war. In addition, it has a beautiful cover (that's what initially drew me in). The story follows Maisie, just moved to London, in the 1920's. She becomes a secretary/typist at the BBC radio, the only position deemed fit for women at the time. The one exception being Hilda Matheson, the head of the Talks department. Ms. Matheson runs her department with firm hand and bows no man. As it turns out, Hilda Mtaheson is based on a real women. She was ahead of the times in more ways than one. Her resume is incredible. Most of the characters in the novel are based on real people while Maisie is fictional. The dialogue and details felt authentic to the era, the author did her research. Now, I do have a complaint. The beginning chapter was a \"tease\", advertising a fast-paced story. The pace was an issue for me, its a slow-building story. That aside, the writing is well executed and I learned a lot from it (if you find yourself with a few minutes, Google the companies that collaborated with the Nazis). A strong work of historical fiction."}, {"userName": "Adriana", "userReviewDate": "May 10, 2016", "userURL": "http://www.goodreads.com/user/show/10225950-adriana", "userReview": "Radio Girls is historical fiction done right. An original and engaging lead character takes the reader on an adventure thru a time and place that shaped history without reading like a history book.The wonderful writing turned the story about a young girl finding herself in 1920s London and working at the nascent BBC into a can’t-put-down page turner. Maisie is incredibly relatable and likeable; the reader gets to see her grow up and become a strong, independent woman who stands up for what she believes in. Along the way, we meet the woman who was one of the pioneers of the BBC and learn a bit about how the media giant was born and primed to become what it is today."}], "description": "The Great War is over, and change is in the air, in this novel that brings to life the exciting days of early British radio and one woman who finds her voice while working alongside the brilliant women and men of the BBC. London, 1926. American-raised Maisie Musgrave is thrilled to land a job as a secretary at the upstart British Broadcasting Corporation, whose use of radiostill new, strange, and electrifyingis captivating the nation. But the hectic pace, smart young staff, and intimidating bosses only add to Maisies insecurity. Soon she is seduced by the workgaining confidence as she arranges broadcasts by the most famous writers, scientists, and politicians in Britain. She is also caught up in a growing conflict between her two bosses, John Reith, the formidable director-general of the BBC, and Hilda Matheson, the extraordinary director of the hugely popular Talks programming, who each have very different visions of what radio should be. Under Hildas tutelage, Maisie discovers her talent, passion, and ambition. But when she unearths a shocking conspiracy, she and Hilda join forces to make their voices heard both on and off the air and then face the dangerous consequences of telling the truth for a living.", "title": "Radio Girls", "url": "http://www.goodreads.com/book/show/29838766-radio-girls", "average": 3.74, "cover": "https://images.gr-assets.com/books/1472009681l/29838766.jpg", "reviews": 652, "authors": [{"url": "https://www.goodreads.com/author/show/2921599.Sarah_Jane_Stratford", "name": "Sarah-Jane Stratford"}], "type": ["Historical", "Fiction", "Historical", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/29838766-radio-girls", "http://www.goodreads.com/book/show/26891545-radio-girls", "http://www.goodreads.com/book/show/29440102-radio-girls", "http://www.goodreads.com/book/show/30329003-radio-girls", "http://www.goodreads.com/book/show/28637407-radio-girls", "http://www.goodreads.com/book/show/6449448-the-midnight-guardian", "http://www.goodreads.com/book/show/10081964-the-moonlight-brigade"]}