{"ratings": 3299, "userreviews": [{"userName": "Lawyer", "userReviewDate": "Oct 14, 2011", "userURL": "http://www.goodreads.com/user/show/3025547-lawyer", "userReview": "RANEY, Clyde Edgerton's first novel on why it's not a sin to marry a Whiskeypalian even when you are a Free-Will Baptist First of all, the illustration of Raney by Clyde Edgerton is not that of the first edition, first printing. Seeing as how I'm a goodreads librarian I should fix that.\nFirst Edition, Algonquin Books, Chapel Hill, North Carolina, 1985Yep. Fixed. That's now the correct image for the First Edition, First Printing of RaneyI know. I have one. It's signed. The REAL first printing is green with a guitar on it. The title, Raney is printed in a block background of hot pink.I'm gloating. I'm gloating because it was a very, very short first printing. I'm gloating because Clyde Edgerton signed it for me and then serenaded me and my wife, picking his banjo, while singing \"Safety Patrol.\"\nTo hear more of Clyde Edgerton's Music visit http://www.clydeedgerton.comWatch this: Clyde Edgerton is singing \"Way Down in Columbus, Georgia,\" while playing the banjo. http://www.youtube.com/watch?v=25NVIX...It's not Safety Patrol, but it gives you a good idea of how this man comes across at a book signing.It's a good thing I finally met Clyde Edgerton. I had literally stalked him for several years. My brother-in-law, Bill, as in Bill from Dallas, as opposed to Cousin Bill from Shreveport, got tired of Connecticut winters and moved to Wilmington, North Carolina. Clyde Edgerton lives in Wilmington, teaches at the University of North Carolina at Wilmington, and likes to write while having breakfast at The Salt Mine, one of two restaurants of the same name.\nAmong other things, Edgerton teaches creative writing at UNCWI confess. I stalked him. In a polite way. I ate breakfast at the Salt Mine five mornings in a row. I didn't have my cholesterol checked for six months thereafter because I would have had to fess up to my lady doctor, who is beautiful, that I had spiked my LDL and lowered my HDL, while stalking an author who has written five New York Times Notable Books of the Year, was a Guggenheim Fellow, was admitted to membership of the Southern Writers Association, and washes his own pickup truck in the front yard of his house--HIMSELF.\nI never caught him there. But I highly recommend the homemade corned beef hash, eggs over easy, with wheat toast. Oh, and on the lunch special, I recommend the chicken fried steak. That's on Saturdays. He washes his truck on Saturdays.I told you. I stalked him. When I confessed to Clyde that I had stalked him, he kind of grinned. When I described his house, his pickup truck and his dog, he was a little rattled. Not to worry. My favorite independent bookseller told him I was harmless--for the most part. And you will notice that no photograph of Clyde washing his truck appears below. Even a literary stalker must have some degree of ethics. *ahem*Edgerton was born in Durham, North Carolina in 1944. He was raised just outside Durham in a little place called Bethesda. He came from a long, long line of cotton and tobacco farmers. Fortunately, his parents were the first of their family to leave the farm. Otherwise, well--Clydge Edgerton would not have become an author I would have ended up stalking.He doesn't look like it, but Edgerton was a fighter pilot for five years from 1966 to 1971. You can read about Edgerton's love of flight and his combat flights over Vietnam in Solo: My Adventures in the Air.\nEdgerton flew combat reconnaissance over the Ho Chi Minh trail for over a year. Sticking with a downed pilot until his comrade was pulled out earned him the Distinguished flying cross.\nFlip through any biographical article about the man and you'll find out most folks figured he would end up being a baseball player or a rock musician. His parents and his twenty three aunts and uncles never took him to have a literary bent. But it was listening to all those storytellers in his family that turned him into the writer with an extraordinary ear for dialog and an eye for the natural humor of human foibles.Characters flow out of Clyde Edgerton as easily as water falls off the sides of mountains in Western North Carolina. By the time you've become familiar with Edgerton's books, you realize this is a man who knows and loves people, warts and all.Now, Raney was not the first Edgerton I read. The first was Walking Across Egypt which came out in January, 1987. I was so enthusiastic over that one I was ecstatic to find a paperback of Raney.I have read Raney three times. The last time was when I read it aloud to my wife. I figured she would enjoy it, especially since Clyde had sung \"Safety Patrol\" to her. And she did enjoy it. Immensely. She giggled, hooted, belly laughed, cried, guffawed and snorted a few times. Me, I'm impervious to such things and just kept right on reading, in character, of course. I am a professional. Do not try this at home. The Carol Burnett gang would not have cracked me up. When you are in character, you are in character.Generally, you'll find a book blurb that says read it, read it aloud, read it to someone else (I did) and give it away (I won't.) Buy your own copy. Stalk Edgerton yourself. It's good for you. The breakfast at The Salt Mine is not good for you. But it is good. Stalking authors is fun. It builds character. Maybe he'll sing to you, too.Anyway, Raney Bell is a very proper young Lister, NC, lady, who sings like a nightingale--bluegrass ballads--that'll have you tearing your heart out and stomping it flat, or fluttering around like a blue bird because it's one of the happy toe tapping ones. She is a Free Will Baptist. God's in his Heaven and all's right with the world, and her mother, daddy, and all her aunt's and uncles, too.Then up pops this new librarian down at the library in downtown Lister. His name is Charles. And he is not from Lister. He is all the way from ATLANTA, Georgia. You know what those people are like in Atlanta. They have funny ideas. They are LIBERAL. And Charles is not Free Will Baptist. He is EPISCOPALIAN! You KNOW what THEY are like.But Charles loves bluegrass music as much as Raney. He can sing and play the guitar, too. You would NEVER know he was from Atlanta if he would only sing songs. But he has to come to dinner and you can't sing all the time. And when you can't sing you have to talk politely. But Charles goes telling Uncle Nate about there being no difference between black people and white people. You could have heard a pin drop.Now, all this happens back in 1975. And it does happen in NC. And sometimes, people like Uncle Nate who was never the same after the WWII, uses the N WORD.What you all (I have translated that for Y'ALL) have to understand is that people like Uncle Nate and Raney and all her kin don't have a mean bone in their body. Their politically incorrect thinking comes from ignorance, not malice.You ALL will see this when it turns out that Charles' best man is B-L-A-C-K! It turns out he's no stranger than Charles' own mother who is a VEGETARIAN!!! Now, feeding her at the reception is gonna be hard.So in this short little book you all will be sad to see it over, we see Raney get married to an Episcopalian from Atlanta, GA. An' we get to see how two people as different as day and night live and love together for a year and grow alike as two peas in a pod and go together just like peas and carrots--just like Forrest and Jenny, except Raney was never flighty like that Jenny.After Edgerton did his Air Force duty, he went back to the University of North Carolina where he got his Masters in English. He taught at his own former high school where he was one of the favorite teachers there. He obtained his PhD in English at the University of North Carolina at Chapel Hill. Edgerton took a teaching position at Campbell University in Buies Creek, North Carolina, a Baptist School.\nCampbell University, the Baptist School without a sense of humor After watching Eudora Welty read one of her short stories Edgerton decided to become a writer as well as a teacher. After the publication of Raney Mr. Edgerton and Campbell University parted ways. Some Baptists just have NO sense of humor.So, if you are not a Baptist, or you are a Baptist with a sense of humor or any other thing you want to be because that's all right with Clyde and me, read this book. Read it aloud. Read it to someone you love. Give a copy to a friend. Make it your copy. You're not getting mine. For Anne and Bill Boston, from Dallas, not Shreveport, who had the good sense to move to Wilmington, NC, who know where Clyde Edgerton lives, and who just sent me a signed copy of Edgerton's latest, The Night Train: A Novel from Two Sisters Bookery. http://www.twosistersbookery.com/Two Sisters Bookery, 318 Nutt Street, Wilmington, NCWhy is this review being circulated again? Well, I'm trying to set up a meeting with Professor Edgerton at UNCW to get a submission to \"On the Southern Literary Trail,\" and get that copy of \"Solo\" signed."}, {"userName": "Sue", "userReviewDate": "Mar 02, 2013", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "At times wickedly funny, at times decidedly not, Raney is the story of the marriage of the titled young woman, a North Carolina Free Will Baptist, to Charles, a (former) Atlanta Methodist cum Episcopalian. Why do I include all these modifiers you may ask. Well, therein lies the story, and the humor, the mores of the 1970s, the story of young love and marriage.We spend roughly two years with Raney and Charles and their extended families and various Preachers, local folk, debating the roles of wives and husbands, how much water should be used to cook string beans, sex, whose mama is right, what sex is right, liquor/wine in the home or anywhere, sex. This is young marriage. this is two people who love each other but are also different in some basic ways. What we share in the novel is their struggle to learn each other and see if they can find their middle road.I was sorry to see this book end."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I zipped through this in an evening, the story of newlyweds in the pre-civil rights, post-WW2 south. The story is told from the perspective of Raney, the wife, who comes from a down-home, family-oriented, Free Will Baptist background in North Carolina. She marries Charles, who is more educated, whose parents are Episcopal, who is a reader and a thinker. He is also a librarian, and while he isn't described as one, I'd like to call him a music librarian. After all, they meet when he is collecting songs, and they perform regularly together.I love the focus on music, the religious debates, the thinking vs. believing discussions, and the assumptions vs. reality of a brand new marriage (that last one is probably something anyone who has been married can identify with). The frequent use of the n- word serves to illuminate the reality of smallmindedness in the south during that time, but wow sometimes it was rough to read it so frequently. Fair warning."}, {"userName": "Bethany", "userReviewDate": "Aug 17, 2011", "userURL": "http://www.goodreads.com/user/show/4314582-bethany", "userReview": "The first words out of my mouth after finishing this were, \"This book is stoopid.\"I didn't hate it, but gosh... I can't think of one commendable thing about it. Not the writing, story or characters. It just rubbed me the wrong way. Why, oh why did the two main characters marry each other? Did they ever have a conversation together before deciding to get hitched? I doubt it, because then they would've realized they are completely incompatible. Raney was alright, but I DETESTED CHARLES. Ooh, it just warmed my heart how he wore down Raney's morals. I just loved how he convinced her that his porn-habit was not harmful, but helpful. Fantasies are a good outlet for his mind! (N.B. - these last few sentences should be read in an icy, sarcastic tone.) I just can't, can't, can't buy into that. Call me puritanical, I don't care.I was originally going to give this 2 stars, because a lower rating seems a little unfair... but, good riddance! I no longer care."}, {"userName": "Michele Casper", "userReviewDate": "Aug 14, 2011", "userURL": "http://www.goodreads.com/user/show/1961874-michele-casper", "userReview": "I wasn’t even going to review this book, but I need to put my feelings about it into words, for whoever may be listening. I was disappointed, even angry, at this book. I returned it to the library as quickly as I could. I read this book because I found Clyde Edgerton’s Walking Across Egypt, which was cited in a talk at a BYU Women’s Conference, to be inspiring. That book is about a quirky, religious southern woman who, in her way, was a great soul and truly lived her religion.Raney is also about a quirky, religious southern woman (much younger than the previous heroine). She is also a great soul who lives her religion in a pure and innocent way. The conflict comes in the form of marriage to her husband, Charles. Charles is good to Raney, but believes that many of her views (and that of her family) are unsophisticated, prudish, and prejudiced.It’s obvious to the readers that this family’s views are prejudiced and unexamined, particularly concerning blacks. But there are some other convictions that Raney has that Charles, in his very reasonable, knowing way, casts doubt upon (equating them with the prejudice against blacks). Raney is against the consumption of alcohol. Her feelings are both religious and personal. Her uncle Nate uses alcohol as self-medication for emotional issues. It eventually leaves him dead. Raney is also against pornography, which she condemns as “filth”. Charles, who indulges, explains that God gave him the desire, and it hurts no one, so there is nothing wrong with it. He eventually breaks down Raney’s barriers, a sip of wine at a time; and convinces her that what she saw as “filth” is an enhancement to their intimacy.So now I am probably going to sound unsophisticated, prudish, and prejudiced. Religious convictions aside, both alcohol and pornography can destroy lives and families. They can take away a person’s choice and self-confidence. They can set up unrealistic expectations and destroy the trust of those close to the users. Raney’s coming to accept these things as being reasonable, and the idea the reader is left with that Raney's beliefs are just unexamined religious prejudices to be set right is what made me angry. I’ve seen too much."}, {"userName": "Jennifer", "userReviewDate": "Jan 13, 2009", "userURL": "http://www.goodreads.com/user/show/913856-jennifer", "userReview": "So, SO un-politically correct. And therefore, SO funny!"}, {"userName": "Mahoghani 23", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/22091363-mahoghani-23", "userReview": "This book gave me misconceptions. First, I thought this book was written back in the day but I see it was published in 1985 but the story started in 1975. Some of the language, using the \"N-word\" to be specific, didn't endear me to this author. I'm not sure if he was displaying the family and their beliefs towards Blacks or if he was expressing how he felt himself. The story is very entertaining and based on Raney, her beliefs (religious), her marriage and lifestyle. Religion is just as sensitive a subject in family households as well as in public spectrum. Raney marries Charles Shepherd but has no idea of his beliefs, thoughts and feelings. Their first game Skye comes up their first marital night in the bedroom and from there it spirals into constant contention between the two. Comical, witty and somewhat inspiring in learning things about people bullying or trying to bully others into their way of thinking."}, {"userName": "Reese", "userReviewDate": "Oct 31, 2009", "userURL": "http://www.goodreads.com/user/show/2624836-reese", "userReview": "\"Halleluyah. Praise the Lord. Etc. Etc. Etc.\" I finished reading RANEY, the first Clyde Edgerton novel; and I'm pretty sure that, for me, it's the last Edgerton novel. Not long after LUNCH AT THE PICADILLY was released, one of my closest friends read it. She loved it; she bought me a copy; I HAD to read it. It has some charming bits, and a strong friendship got me through the novel; the novel didn't get me through the novel.Several years earlier, another friend -- a less influential one -- raved about WALKING ACROSS EGYPT. So I bought it, and about fifty pages into the book, I shelved it. A jet plane couldn't have taken me the short distance from start to end. It has a place in a bookcase, instead of in my garage, only because Clyde signed it.For twenty-five years I ignored another friend's favorable comments about RANEY. Seventy-five would have been better. That last remark only means that there are too many good or great works that I haven't read for me to feel pleased that I spent my time reading so-so material. If Flannery O'Connor weren't one of my favorite authors and if I hadn't lived in the South for fifty-eight years, others could say, \"Maybe you're just not Southern enough to appreciate Edgerton's novels.\" But that explanation can easily be dismissed. The blurb on the front cover of my edition of RANEY comes from Roy Blount, Jr.: \"A funny, deft, heartening book. If I were single, I would marry it.\" Well, Roy, I think that I could understood your marraige to a book (any book) about as well as I can understand the marriage of Charles Shepherd and Raney Bell. Yeah, they do really enjoy singing together. So sing together, chickadees -- as did Edgerton and his EX-WIFE, Susan Ketchin, to whom the book is dedicated. The announcements from the HANSON COUNTY PILOT that open and close the book suggest that the author intended to give his readers a realistic work, not a comic book, fairy tale, or two years of a soap opera. But while the characters seem to be real folks and the incidents seem actual, at the core of the novel is a marriage that should have \"Made in Mars\" stamped on it.My careful reading of RANEY has left me with two questions. Since Charles and Raney live \"in a free country\" (as Edgerton's characters repeatedly remind us) that has plenty of young, single adults, why did they marry each other? And why did I not laugh even once when I read this \"funny,\" \"hilarious\" book that \"causes uncontrollable fits of laughter\"? If I HAD to present an answer to my own questions, I could only say, \"It's a two-star book.\""}, {"userName": "Kirk Smith", "userReviewDate": "Apr 11, 2015", "userURL": "http://www.goodreads.com/user/show/15749169-kirk-smith", "userReview": "The first year of a marriage is one of the most difficult experiences I know of. Another difficult experience is learning when to seek a marriage counselor to save a relationship. That decision usually comes a bit late. This deceivingly humorous little book addresses such huge issues. I am bowled over by how much wisdom is concealed here as I laugh my way through each chapter."}, {"userName": "ALLEN", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/58158333-allen", "userReview": "The 1970s come alive in this good-humored satire, set in a small Carolina town, about the first year of married life between a local Freewill Baptist (Raney) and a liberal Episcopalian (Charles) from Atlanta. Although Raney and Charles love each other very much and share a love of folk music, their cultures, mores and politics are bound to clash. The novel is narrated entirely by Raney in a not-always-reliable voice, a large part of its charm. When Charles founds a group called Thrifty Energy Alternatives (\"TEA\") to keep the big power companies at bay, you know you're in the Seventies, and when he wants to host an old Army buddy who happens to be \"a minority,\" all passive-aggressive hell breaks loose on the part of Raney's family. One perspicacious and sympathetic observer remarks that when a couple marry, it's really the wedding of two families. Raney is a fun and occasionally profound comic novel from skilled humorist Clyde Edgerton, in which New and Old South clash just as vigorously as the slightly bewildered newlyweds. I highly recommend it."}, {"userName": "Rick", "userReviewDate": "Oct 10, 2011", "userURL": "http://www.goodreads.com/user/show/2004159-rick", "userReview": "I really wanted to like this book and some of it was right on the money. But, for the most part I didn't. While it strived to be a story of two different cultures colliding and somehow reaching accommodation in the end, it didn't feel real. The cultures (and the characters) were too different, it is hard to imagine Raney and Charles ever having gotten married to begin with. Also, both Raney and Charles seemed to be more caricature than character. If that's what Mr Edgerton was intending, he achieved it but did so at the cost of what could have been a much more interesting and informative story. Also, the very liberal use of the N word seemed to take away from the story and was not necessary for the portrayal of the characters. My last gripe is that when it came time to wrap things up, the ending seemed far too facile. The story of how couples from very different backgrounds work through their differences and find common ground based on love, compromise, and an understanding of the place from which the other came can be humorous, poignant, and fascinating. Too bad Mr. Edgerton went for a stereotyped and superficial story when there was so much good material he could have mined."}, {"userName": "Jamie", "userReviewDate": "Jun 26, 2014", "userURL": "http://www.goodreads.com/user/show/51089-jamie", "userReview": "I love a great story about marriage, and this is a great story about marriage. Very funny. Very Eudora Welty. I’m glad I’ve finally read Clyde Edgerton."}, {"userName": "Jan Priddy", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/4074574-jan-priddy", "userReview": "This is a touching novel, one that my mother handed to me back when she was regularly handing me funny and quirky novels. I love it. I once gave it to a student for an independent reading assignment. In a letter she wrote to me in response, she been by saying she didn't like the book because she did not understand how the two main characters could possibly have a relationship. By the time her letter was half written, she had changed her mind, concluding that she believed they did have a relationship, and it wasn't up t her to say they shouldn't. She thought it was wonderful that they loved one another and were making it work."}, {"userName": "Jan Boyd", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/5286706-jan-boyd", "userReview": "Having never read anything by Clyde Edgerton, I picked up the reissued “Raney” at the 2017 Southern Festival of Books. I’ve never heard a clearer fictional southern voice than that of Raney."}, {"userName": "Ann Marie Senter", "userReviewDate": "May 04, 2013", "userURL": "http://www.goodreads.com/user/show/4071450-ann-marie-senter", "userReview": "I spent the first 3/4 of this book wondering why on earth these two would ever have decided to get married. Why did this intelligent, liberal, educated man choose to marry into this family of racist, small-minded, Bible-beaters? Why did a sweet, naive girl like Raney choose to marry a worldly, arrogant snob like Charles? Had they ever spoken to each other, ever had a single conversation about values and beliefs, before walking down the aisle? The story is told from Raney's point of view, so we only get her side of the story, but she and her family were so unsympathetic for the first part of the book that I just couldn't understand what Charles ever saw in her. I didn't really care what happened to their marriage, because the marriage just seemed like it never should have happened in the first place. Literally the only thing they had in common was a love for music. Toward the end of the book, however, I could see that both characters were growing and changing and learning how to communicate with one another. This definitely added an element of realism, as they learned how to get along and love one another in spite of their (many) differences.There were a few moments that I thought were amusing, that made me smile a little, but the promise of side-splitting laughter that was made on the cover was never even close to being fulfilled. Mostly I was just perplexed, trying to imagine how in the world these two ever thought that marrying each other would be a good idea. Overall, it was just okay. A quick, easy read with some colorful characters and just enough entertainment value to salvage it from being a complete waste of time."}, {"userName": "Justin Haynes", "userReviewDate": "Mar 05, 2013", "userURL": "http://www.goodreads.com/user/show/6621773-justin-haynes", "userReview": "Raney is such a wonderful little read. There isn't a whole lot to say about the first year of her marriage to Charles Sheppard except that from page to page you'll be mad at one, then the other, then both at the same time. It's obvious the two love each other but coming from different backgrounds leads to a mess of problems that they can solve only on their own.With Raney Edgerton established himself as a new and unique voice in the south over thirty years ago and today he is considered one of the titans of southern literature. His themes of marriage, point of view, religion, and prejudice play out over a quick 240 pages. I loved Raney and Charles and both of their families throughout and I'm sure you all will too.It's not Faulkner, Melville, or McCarthy, but not all literature has to be so heavy. Raney tells a good story and gets it's message across without the overly dense nature of some \"important\" books. It's a great read and I'd certainly recommend it to anybody in search of a quick, enjoyable read. Even the Free Will Baptist."}, {"userName": "Miss Starling", "userReviewDate": "Aug 20, 2011", "userURL": "http://www.goodreads.com/user/show/4183468-miss-starling", "userReview": "I was disappointed with this book. After reading Walking Across Egypt, I was excited to delve into another Edgerton book, but alas, this was not fullfilling enough. The main character is annoying with her naivety throughout the story. She listens to everyone's opinions, and TAKES everyone's opinions. She doesn't really think for herself and she's just all around dumb at times, especailly when confronting her husband about the things he does that I don't care for. And Charles, her husband, is another story. He's so pretentious and controlling, manipulating her because she doesn't know alot, or care to defend her own opinions (when she has them.) He's disgusting.  Maybe its because I didn't understand it, but this book was a huge let down. I WAS happy to know that this was his first novel and that he didn't suffer some bad inspiration for this book. Anyway, if you want to read it, fine. But, everyone's entitled to their own opinion."}, {"userName": "Laura", "userReviewDate": "Jan 11, 2009", "userURL": "http://www.goodreads.com/user/show/346637-laura", "userReview": "This was a hilarious book, with lots of \"laugh out loud\" moments. Though the characters were definitely more one dimensional caricature, with exaggerated weaknesses and biases, they did serve to illuminate some of the disparities in Southern beliefs and traditions in the aftermath of the Civil Rights movement. If I had one quibble with the book, it was the author's broad generalizations of the differences between small town fundamentalists (read ignorant and bigoted) and big city liberals (read educated & enlightened). This is certainly not a true representation of either side, but it was certainly an effective - and hilarious - way to show how ridiculous the extremes can be, especially when thrust together within a family. Without spoiling the book for those who haven't read it yet, I will say that the last chapter is without a doubt the funniest. It is absolutely worth the read, and worth checking out more of Edgerton's books."}, {"userName": "Judi", "userReviewDate": "Oct 08, 2012", "userURL": "http://www.goodreads.com/user/show/3324860-judi", "userReview": "I was looking for Edgerton's book WALKING ACROSS EGYPT when I came across RANEY and decided to give it a try. I read it one Sunday afternoon, and chuckled over it all the next day. I think I quoted half the book to my sister Lori. (And then she read it and quoted it back to me!)It's the story of a \"modern\" Southern woman who is a member of the Free Will Baptist church and her marriage to a liberal well-educated, Episcopalian man named Charles. After their marriage they reside in Listre, North Carolina not too far from her parents. (Many of Edgerton's books take place in Listre.) Between the comic scenes, Edgerton makes the point that marriages are marriages of two families and not just two people and he succeeds marvelously in showing the compromises. I have a really hard time believing that this book was written by a man, Raney's voice just seems too true."}, {"userName": "Marilyn Hartl", "userReviewDate": "Sep 13, 2009", "userURL": "http://www.goodreads.com/user/show/2490488-marilyn-hartl", "userReview": "Edgerton is a hoot! He has the southern voice down pat, and I love his stuff. This book brings back memories of my childhood in east Texas, and my mother's friends who played bridge together every few weeks at someone's home. Their conversations used to sound like the conversations that Raney's family had around the dinner table, and my mom used to tell my dad about them when he came home after work. I never really realized how apart my parents felt until after I was older and their friendships changed to include the people they met traveling. But I remember hearing about Mrs. Holsomback's liver problems over the bridge table...."}, {"userName": "Laura", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/63366200-laura", "userReview": "Read for 2017 Pop Sugar challenge a book that always makes you laugh. I have not read this in a number of years but it still made me laugh. The language of Raney and her family reminds me of home. The book is sadder than I remembered as well, but overall very well written."}, {"userName": "M'diya", "userReviewDate": "Feb 18, 2012", "userURL": "http://www.goodreads.com/user/show/7805797-m-diya", "userReview": "Raney is a small-town Baptist. Charles is a liberal from Atlanta. And RANEY is the story of their marriage. Charming, wise, funny, and truthful, it is a novel for everyone to love.Definitely, a lovely book. It’s so much real like your own life. Responsibilities, relationships, family & everything related to these; fun, happiness, problems. Readers who enjoy light reads must give it a try. Different characters with different personalities & opinions, you may tend to disagree with them but still, you feel for them.“A real jewel.” ~ RICHMOND TIMES-DISPATCH, and I agree!"}, {"userName": "MJ", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/1166748-mj", "userReview": "I read this because I heard the author reading it on the WUGA program Wordland with David Oates a couple of weeks ago. According to Wikipedia Raney was Edgerton's first book. What pleased me so much was Edgerton's craggy voice voicing a 20 year old woman's southern voice. (I'd love to have a copy of the reading!)Anyway, the misunderstandings of a couple's first 2 years of marriage. So respectful, so funny, so true."}, {"userName": "Wayne", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/15558119-wayne", "userReview": "I read this for a Southern Fiction book club. I love Edgerton's characters. Raney's provincialism is endearing, though maddeningly frustrating at times. She and Charles, newlyweds and opposites in so many ways, attempt to find common ground or compromise in all subjects that matter - religion, race, sex, family, just to name a few. The scene on the feed bags gave me a little hope for a marriage that might succeed, despite the odds."}, {"userName": "Tina", "userReviewDate": "Jul 10, 2013", "userURL": "http://www.goodreads.com/user/show/7431886-tina", "userReview": "I kept reading this book thinking that I would eventually like Raney or Charles, but unfortunately, that never happened. How they ever fell in love is beyond me. While literature from different historical viewpoints can still be enjoyed today (Huck Finn), this one just wasn't good enough to make wading through the mud of prejudice worth it."}, {"userName": "Helen Cargile", "userReviewDate": "Aug 10, 2013", "userURL": "http://www.goodreads.com/user/show/22983196-helen-cargile", "userReview": "This is such a fun book to read. It is full of humor and memorable characters. Clyde Edgerton takes a look at what happens when two people with different backgrounds and religions get married and come to terms with each other in a small southern town. A real classic, full of more truth than you might realize. Read this book, you will love it!"}, {"userName": "Linda Hart", "userReviewDate": "Jun 27, 2009", "userURL": "http://www.goodreads.com/user/show/2455252-linda-hart", "userReview": "If you loved Walking Across Egypt, Edgerton's first novel, you'll love this also. It you haven't read either, pick up Walking...& read it, his best, first."}, {"userName": "Deb", "userReviewDate": "Nov 02, 2007", "userURL": "http://www.goodreads.com/user/show/563267-deb", "userReview": "2.5 stars."}, {"userName": "Sarah", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/27243619-sarah", "userReview": "I didn’t love this one quite as much as I was hoping—it was more of a character study than a plot-driven story—BUT I still love Clyde Edgerton as much as I remember loving him in high school and college. He has this knack for bringing Southern culture to life on the page. He creates these characters and situations that seem almost ludicrous, but you find yourself laughing because you’ve experienced these situations in your own life and/or you know people who are just like his characters. So much of this story felt like my life! I need to get around to reading the rest of his books! (And side note: One of my college professors had Clyde Edgerton come speak to our literature class one time, and he was so down-to-earth...and hearing about his process was fascinating!)"}, {"userName": "Donna", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/1395140-donna", "userReview": "Picked this up for free and read it on a whim. Surprised me in its insights into the Southern Evangelical mindset. A born and bred Southern girl marries the librarian at the local college who was brought up in a more liberal home in Atlanta. The cultures clash and nearly wreck the marriage as she and her family are inbred into the Free Will Baptist Church and only believe in what the Bible and their preacher tells them about everything. The young husband has different opinions about church, Christianity, black people (his wife's family insists on calling them \"n******\"). The young married couple struggles with their clashing belief systems."}], "description": "RANEY is the hilarious story of the first two years, two months, and two days of a modern Southern marriage.", "title": "Raney", "url": "http://www.goodreads.com/book/show/2337794.Raney", "average": 3.95, "cover": "https://images.gr-assets.com/books/1368242643l/2337794.jpg", "reviews": 234, "authors": [{"url": "https://www.goodreads.com/author/show/42288.Clyde_Edgerton", "name": "Clyde Edgerton"}], "type": ["Fiction", "Humor", "American"], "outlinks": ["http://www.goodreads.com/book/show/2337794.Raney", "http://www.goodreads.com/book/show/16565332-raney", "http://www.goodreads.com/book/show/262392.Raney", "http://www.goodreads.com/book/show/542260.Raney", "http://www.goodreads.com/book/show/19225062-raney", "http://www.goodreads.com/book/show/74616.Walking_Across_Egypt", "http://www.goodreads.com/book/show/2451044.The_Bible_Salesman", "http://www.goodreads.com/book/show/262391.The_Floatplane_Notebooks", "http://www.goodreads.com/book/show/262390.Lunch_at_the_Piccadilly", "http://www.goodreads.com/book/show/542259.Killer_Diller"]}