{"ratings": 224, "userreviews": [{"userName": "Julie", "userReviewDate": "Mar 02, 2012", "userURL": "http://www.goodreads.com/user/show/3771119-julie", "userReview": "In this generational memoir, Benfey explores how art has shaped his family. He takes several seemingly unconnected threads and weaves them together into a narrative that demonstrates the impact of aesthetics on his life and those of his kin. The book reads like anecdotes stitched together, telling the history of Benfey’s Quaker roots, his Jewish father’s exile from Nazi Germany, his aunt and uncle’s Bauhaus career and subsequent work at Black Mountain College, and the search for elusive white clay of the Piedmont. This book connected with me in two very personal ways, the first being that my mother and sister have migrated to Greensboro, North Carolina in the heart of the Piedmont. Thus I could appreciate the landscape and atmosphere of that region of the South as Benfey portrays it. I have been to the potter’s village of Seagrove and own some pieces made by the local artisans. The second reason I had such an appreciation for the book was because I studied ceramics for four years. I know the feel of clay, the turn of the wheel, and the satisfaction of creation in this medium.What I loved especially was the Part III, which outlined the history of ceramics in the western world, specifically the legendary Cherokee clay found in a remote area in North Carolina. I was most intrigued by famed English potter Wedgwood’s pursuit of this fine porcelain as he sent an agent to navigate uncharted wilderness and negotiate with hostile natives. This clay takes on mythic proportions as various fortune hunters search the untamed woods for it, which leads me to another vein Benfey takes in his familial history: mythology. He establishes a correlation between art and legend, evoking the Greek Minotaur and Grimm’s Hansel and Gretel. There are so many facets that influence him, and Benfey attempts to address each one in this volume.It is clear that Benfey’s family inhabits a different circle of talent than many of us are familiar with. I was unaware of many of the names mentioned, but then my background is comparatively mediocre. Regardless, Benfey writes with authority and pride and is successful in his attempt to portray why art is important in his life and how it has shaped his family through the generations. I received a complimentary copy of this book via TLC Book Tours."}, {"userName": "Kay", "userReviewDate": "Mar 31, 2012", "userURL": "http://www.goodreads.com/user/show/1797182-kay", "userReview": "When TLC Book Tours offered me the opportunity to review this book, I felt both excited and a little unsure. After all, even though I do study art history, American art, pottery and related topics are far from my expertise. I did worry I would have a hard time to get into it, but I shouldn’t have; Benfey’s writing pulled me in from the start.Red Brick, Black Mountain, White Clay is a book that defies genre classification. It’s a memoir, a story of family, a book about art, history, nations… It is all of this and a little more, all of it coming together in one single narrative. Benley retraces his own origin through his parents and grand-parents’ story while narrating the historic and cultural background of each, and this is what I mostly enjoyed about his book : the intimate point-of-view. It makes history sound a lot more personal and a lot less clinical, all while sticking to the facts.The book is divided in three parts, and I found them almost all equally interesting. I did enjoy reading about Wedgwood and the Cherokee in the last part, since I am curious about both but haven’t read a lot about either in the past. But, if I am honest, I do wish I could have read even more about the author’s uncle and aunt, Josef and Anni Albers. Maybe because I had heard a little of them before, of maybe because they felt closer to my field of study, I was the most intrigued by their part of the story, and I could have read a complete book about them. However, with a book so full of stories, it was clear the author had included just enough of them.On a final note, I really liked Benfey’s writing. At times it was a bit unclear which point he was trying to make; he would mention an event, which related to someone specific, which then ended up being a story about someone else, sometimes coming back to the original idea, and sometimes not. It wasn’t a negative point for me; on the contrary, it is precisely what made this non-fiction book more personal and different from a traditional, dry history book.I am so glad I got the chance to read this book; I’ll be honest and say that it isn’t something I would have picked by myself, but it was certainly a great experience. Benfey made me travel through time and space, gave me a lot to think about on history, family and artists, all of this wrapped in pleasant writing."}, {"userName": "Carol Bundy", "userReviewDate": "Jun 09, 2012", "userURL": "http://www.goodreads.com/user/show/1436944-carol-bundy", "userReview": "Beautifully written, this memoir surprised me. It starts in the usual way -- discussing his parents and the families they came from. But soon departs in what at first seems oddly selective ways. The connections between his three sections are in someways not quite arbitrary but still hard to fathom. Until that is, I begin to realize that I am trapped in the logic of an historian. Benfey, on the other hand, is tracing the connections not of an historical past but of an aesthetic -- or at least, the creative imagination from which he was born, as were his mother's other creations. In this respect, I feel oddly liberated after finishing this book. A perfect example: Benfey is, in some tangential and not very clearly defined way descended from William Bartram, the naturalist. He makes little of this genetic connection but much of Bartram himself and the connection between Bartram's account of his travels in the American South in particular the influence this book had on the poets Wordsworth and especially Coleridge whose Kublai Khan he sees as overwhelmingly derivative. He pull sit off very well, and I find myself beginning to think much more freely and loosely about how a memoir might be put together. That one's ancestors are only a part of the puzzle. In many respects this memoir does the more important and harder work of capturing the world of ideas and aesthetics that nurtured Benfey."}, {"userName": "Jessica", "userReviewDate": "Jun 13, 2013", "userURL": "http://www.goodreads.com/user/show/749238-jessica", "userReview": "In this book, Benfey not only locates his place in American history (and he's lucky that it's such a fascinating place), but locates it beautifully and does a wonderful job of crafting the story in its own kind of meander--bringing together threads that recur again and again: Quakers, pottery, etc. Having read this, I want to read all the books he referenced, go live in the North Carolina hills, learn to weave and throw pottery, learn the Latin names of the local flora and fauna, go to Quaker meetings, and build my own house out of locally-fired bricks. So totally recommended."}, {"userName": "Mackenzie Brooks", "userReviewDate": "Jun 05, 2013", "userURL": "http://www.goodreads.com/user/show/3359135-mackenzie-brooks", "userReview": "Meandering and fragmented in a good way. If you like Quakers, North Carolinian pottery, family history, or material culture, you will probably like this book."}, {"userName": "Ann Sloan", "userReviewDate": "Mar 24, 2013", "userURL": "http://www.goodreads.com/user/show/4340130-ann-sloan", "userReview": "This is not a book I would have selected to read, but then I have named this blog “All Books Considered.” And I was kind of assigned this book for the Artful Reading book club at Fort Worth’s Kimbell Museum. (Actually, I didn’t realize it was a book club; I thought the authors or some other experts were going to come and lecture – there are two more books in this series.) Anyway, that’s what reading is for – to open your mind to new experiences, not just entertain or inform. The director of this long-standing book club asked us what we would say to persuade someone else to read this book. I’m still thinking about that.Christopher Benfey is literary critic and Emily Dickinson scholar. He is the Mellon Professor of English at Mount Holyoke College. Benfey holds a Ph.D. from Harvard University. Benfey is a specialist in 19th and 20th century American literature. He is also an established essayist and critic who has been published in The New York Times Sunday Book Review, The New Republic, The New York Review of Books, and The Times Literary Supplement.He also seems to be related or acquainted with everyone who mattered in the second half of the 20th century. More about that later… He seems to have been everywhere and what he doesn’t know, doesn’t matter.The title comes from the three parts of the book, although the book’s organization is very free flowing. One of Annie Albers’, his aunt, painting is titled “Red Meander,” and that is exactly what this book does – meander throughout the world, the arts, history, people, and Benfey’s thoughts. The subtitle for the book is Reflections on Art, Family, & Survival.As I said, there are three parts to the book. The first part concentrates on the origin of his mother’s family. Rachel Elizabeth Thomas descended from colonial explorers and Quaker craftsmen. Her family settled in the Piedmont area of North Carolina, famous for its red clay, and was a brick layer. Seagrove is in the area, which I learned, is notable for its many folk potteries reaching back more than two hundred years, and is sometimes referred to as the \"pottery capital of North Carolina\", or pottery capital of the world. Jugtown, one of the premier potteries, is listed on the National Register of Historic Places. I had never heard of this place; I seemed to be one of the few in the book club who hadn’t. Benfey explores the geology, history, economy, art, and family background concentrated on this area of the country. However, he also traces his father’s family’s history in this first part. His father, Otto Theodor Benfey, had left Germany before the war. His aunt and uncle, Josef and Anni Albers, left Germany when the Nazis closed the Bauhaus school in 1933. The Bauhaus had a major impact on art and architecture trends in Western Europe, the United States, Canada, and Israel in the decades following its demise, as many of the artists involved fled, or were exiled, by the Nazi regime. The Benfeys have a distinguished, prominent family history, including Christopher’s father, a chemist, who conceived the spiral design of the period table of the elements, and Theodor Benfey, a German philologist who taught Sanskrit and made a major scholarly contribution to the study of fairy tales at the same time the Brothers Grimm were collected their tales.If any of this seems linear, I am misleading you. This information is scattered throughout the book. Thank heavens for the index!In the second part of the book, Denfey relates the Alberses’ careers in this country. After Josef and Anni Albers reached the United States, the architect Philip Johnson, then a curator at the Museum of Modern Art, arranged for Albers to be offered a job as head of a new art school, Black Mountain College in North Carolina. In November 1933, he joined the faculty of the college where he ran the painting program until 1949. Black Mountain College was a new kind of college in the United States in which the study of art was seen to be central to a liberal arts education. Many of the school's students and faculty were influential in the arts or other fields, or went on to become influential. This connection is responsible for Christopher Benfey’s acquaintance with so many well-known later 20th century artists and writers. Although notable even during its short life, the school closed in 1957 after only 24 years. In 1950, Albers left Black Mountain to head the Department of Design at Yale University. Ruth Bader Ginsburg is a lover of Albers’ work. Her office walls boast works on loan from the Smithsonian, including two original Rothkos, a painting by Max Weber, and one by Josef Albers. (Another Albers painting, which usually hangs in her chambers, is currently part of a traveling exhibit. Ginsburg vows that she won’t retire until it returns.)After digressions to Mexico, Japan, Italy, Germany, Chile, Cuba, Greece, China, France, and nearly every state in America (and I’m sure I’ve missed a few), we come to part three in which we travel to England to trace the development of Wedgwood china. Josiah Wedgwood became fixated on the white Cherokee clay in North Carolina. Several attempts were made to possess this unique material; in the end, John and William Bartram, father and son, Quakers, manage to take back five tons of the white Cherokee clay to Wedgwood, resulting in the superb china that resulted in Wedgwood being named Potter to Her Majesty.So we come back to pottery, North Carolina, clay, and Quakers. Everything in this book is connected. I can only imagine a graphic depiction of names, places, and materials. Back to the director’s question: What could I say to persuade someone to read this book? Many in the club were most interested in pottery. If you collect or create pottery, you must read this book. Otherwise, if you are interested in American history, from colonial times to the 20th century, this will provide you with much you may not be aware of (as I was). However, you must not expect a linear narrative; you must be ready for that meandering, I mentioned. I became very frustrated during less than interesting sections, was confused trying to make the connection between all the elements, and wished that Benfey would just get on with it. Nevertheless, I’m glad I made it through the entire book. One lesson may be that everything is connected in this world, in one way or the other. Another lesson may be that one should not close one’s mind to a book – one never knows what one may learn."}, {"userName": "Kay", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/5097993-kay", "userReview": "I liked this book but I am not sure it is because I am familiar with so much of the various topics he touches upon. He does a pretty decent job of keeping the narrative together as he goes down many \"rabbit holes\" or divergent paths of connections to his family. But again, I wondered if that is because I am already familiar with most of those diverging and converging threads to his story. I will be interested in hearing what people who are not knowledgeable about North Carolina's pottery traditions or Black Mountain what they think of the book."}, {"userName": "Jennifer Fox", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/20971248-jennifer-fox", "userReview": "A far ranging book about an awful lot of things and people between which the author discovers, acknowledges, or forces a connection. All of them are pretty interesting."}, {"userName": "LemonLinda", "userReviewDate": "Dec 09, 2013", "userURL": "http://www.goodreads.com/user/show/1541888-lemonlinda", "userReview": "I read this for my local club. It is not a book I would have chosen on my own, but I did feel that I learned a lot and enjoyed the read. However, there were moments of frustration as often I felt as though the author tried to take on too much until I learned that was simply his writing style. He would be clearly heading in one direction when something caused him to veer into a completely new path and he expected the reader to make that leap with him. And make the leap I did and could, but it was not always easy. There was a \"meandering\" pattern in art that was referred to often and I felt that was often what the author did - meander in and out from family history (the red brick), to various art forms, especially pottery (the white clay) to academics and study (the Black Mountain). In places it was a full on history lesson and in others it was a course in art appreciation and always at the form of it it was a memoir. I definitely picked up lots of interesting knowledge and feel more informed about the world of pottery and parts of my home state."}, {"userName": "Richard Godfrey", "userReviewDate": "Jul 09, 2013", "userURL": "http://www.goodreads.com/user/show/10874237-richard-godfrey", "userReview": "I downloaded this to my Nook while sitting in Global Village Organic Coffe on Hillsborough Street talking to a retired NS State professor (Jim) who mentioned buying it and loaning it out before he read it. The description he gave was tantalizing. And the book held up to it. I started reading Saturday late afternoon, and finished Sunday evening.Benfey does a masterful job of tying the three geographic regions into his family history, AND relating the same areas to international history as well.Being from Black Mountain and being slightly familier with Black Mountain College (from verbal/local accounts mostly) I was very impressed with his coverage of the development of the college and it's demise in the mid-50s. Historically it seems to be very accurate, though I have not yet had time to check most of the references.I had trouble putting this one down."}, {"userName": "Dorothy ", "userReviewDate": "Jun 09, 2012", "userURL": "http://www.goodreads.com/user/show/3108365-dorothy", "userReview": "I feel somewhat ambivalent about this book. I think it is well written and at times very interesting, but I also felt that at times the book didn't really hang together that well. What I found interesting was the stories of various immigrants from Europe and the artistic and craft expertise they brought with them, and the way in which this blended with traditions already in existence in native cultures. Christopher Benfey makes many connections, some of which seem appropriate but others seem a bit too much of a stretch for this reader."}, {"userName": "Mary", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/64583-mary", "userReview": "\"He was a dowser of sorts, as I saw him, a feng shui artist, divining his place in the world and seeking an auspicious alignment of earth and stars. The zigzag path he traced over the sand was determined by unforeseen forces underground, the chance pattern of previous visitors and voyagers. From these soundings in the sand, I could imagine him piecing together a fragmented narrative of sorts....\"Tracing pottery, art and brick making to make his narrative, Benfey makes an American memoir of craft tradition."}, {"userName": "Nina", "userReviewDate": "May 24, 2012", "userURL": "http://www.goodreads.com/user/show/422305-nina", "userReview": "A beautiful mess of a book, ranging from descriptions of crazy Englishmen seeking out white clay used for porcelain in Cherokee territory, life at Black Mountain, a place I've heard of all my life, and wonderful tales about the author's Aunt Annie and Uncle Josef (Albers). This book took me a long time to get through. The writing is pretty dense and descriptive but seemed to not flow as it should have. On the other hand, he is writing about several different subject at the same time (the Jugtown potters, naturalists, art, Josiah Wedgewood, etc.). A worthwhile if sometimes unwieldy read."}, {"userName": "Elizabeth", "userReviewDate": "Mar 09, 2013", "userURL": "http://www.goodreads.com/user/show/5891500-elizabeth", "userReview": "This book may not have been written for me, but its combination of insights into a bunch of seemingly unrelated subjects -- pottery (both English and American), the Quakers, the Holocaust, visual art and Black Mountain College -- managed to touch on a lot of my peculiar interests. I found much of Mark Benvey's reflections fascinating (although he lost me on others, and the rather quick summing up was a disappointment). For those who love pottery and the visual arts, though, this is a book to be treasured."}, {"userName": "Jaime (Twisting the Lens)", "userReviewDate": "Feb 16, 2012", "userURL": "http://www.goodreads.com/user/show/4837963-jaime-twisting-the-lens", "userReview": "This review is posted as part of the book tour hosted by TLC Book Tours.Discovering what makes us the person we are is a lifelong journey for most. For Christopher Benfey it was a trip across the country, an ocean, and time. Red Brick, Black Mountain, White Clay takes us on a trek in search of what it means to be a part of something, no matter how insignificant it may seem. It is the dirt that connected him to his family’s past, and in that dirt, Benfey found home._____________________________________The full review can be found at http://twistingthelens.wordpress.com"}, {"userName": "Catherine Byers", "userReviewDate": "Apr 28, 2012", "userURL": "http://www.goodreads.com/user/show/6783082-catherine-byers", "userReview": "For anyone who has thrown a pot or a shuttle or loved the materials with which they explore their craft, this book follows stories that feel familiar. I found myself wanting to figure out Anni Albers' weave structure or sink my hands in some white North Carolina clay. The author's family heritage is impressive and includes folk of wide ranging talents. My only gripe was with the very last section on Whistler, which seemed an afterthought. Still, an engaging read."}, {"userName": "Laurie Frost", "userReviewDate": "Oct 08, 2012", "userURL": "http://www.goodreads.com/user/show/13477692-laurie-frost", "userReview": "Almost a 5: I thought that the final third of the book, White Clay, wasn't nearly as strong as the first two parts, which were fantastic. You learn about writer Christopher Benfey's family, but in an oblique and subtle way by way of pacifist Quakers in WWII, exiled artists -- especially the Albers -- throwing pots, the community of Black Mountain College,Grimm's fairy tales, and so on even to Coleridge's Xanadu. Lovely writing. I revise: this is a 5."}, {"userName": "Maggie", "userReviewDate": "May 24, 2012", "userURL": "http://www.goodreads.com/user/show/3012600-maggie", "userReview": "I enjoyed this book. Benfey has a very interesting family history and he hits on a lot of fascinating themes and important figures in the arts throughout the last century. I couldn't help but feel as though the narrative was missing a main thread pulling me along though. If it had been much longer I'm not sure I would have finished. Some great little stories, though, and an inventive method of seeking family history."}, {"userName": "Anne", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/2454580-anne", "userReview": "A beautiful and unforgettable family memoir. There is so much about this book that spoke to me. Benfey's juxtaposition of art, family history and geography is a work of art in itself. I especially enjoyed reading about the many potters whose lives and work were so much a part of my own art education. The format of the book - a \"meandering quest\", as Benfey calls it - works perfectly in this biography."}, {"userName": "Ticia", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/1741541-ticia", "userReview": "Very well written. Benfey has an amazing ability to make connections that bring deeper meaning to artistic spirit and the general experience of life. I especially enjoyed the section of the book that discuss the connection between the Bauhaus School and Black Mountain College. I highly recommend this book to anyone interested in art, the act of creation and the connection of art to all that surrounds us both in form and formlessness."}, {"userName": "Marla", "userReviewDate": "Mar 17, 2012", "userURL": "http://www.goodreads.com/user/show/559586-marla", "userReview": "One of the most interesting books I have read in ages. Beautiful family memoir spanning generations and an amazing trove of art history spanning the US, Europe and Asia over multiple generations. If you have any interest in the arts, art history between mid-1800's to post-WWII in the US focusing on pottery and ceramics but intertwined with music, literature, philosophy, this book written with love and respect by Christopher Benfey about his own roots and finding them is a must read."}, {"userName": "Patricia", "userReviewDate": "May 16, 2013", "userURL": "http://www.goodreads.com/user/show/4084873-patricia", "userReview": "I persevered until I got to the half-way point of the book, and then I just had to quit. The author meanders around, talking mostly about his family history, and it just seems self-indulgent to me. I mean, I would get tired of listening to a dear old relative tell these stories, so why would I want to hear them from a total stranger? The NY Times had it as one of their 100 Notable Books of 2012.... I guess I must be missing something."}, {"userName": "Mary", "userReviewDate": "Jul 18, 2012", "userURL": "http://www.goodreads.com/user/show/1450478-mary", "userReview": "A series of lectures strung together using the author's family history as the touchstone into the history of Carolina pottery, the Albers at Black Mountain College (Anni Albers was the author's great aunt), the search for the elusive white clay. Lovely mediations on what it is to create art and the thin line between creating art and craft."}, {"userName": "Barbara", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/1367293-barbara", "userReview": "I had such hopes for this book. I am interested in so many of the things he covered; pottery, hola cause exiles, Bauhaus artists, the Cherokees, the Carolinas....But it hopped around so much. Some lovely writing but I had to force myself to finish...all interesting to him because it revolves around generations of his family, but this is not a book I will prass on."}, {"userName": "Tasha", "userReviewDate": "Feb 09, 2013", "userURL": "http://www.goodreads.com/user/show/2224795-tasha", "userReview": "Meandering, unstructured and littered with too many names of people... Heine? Ok, I forgot who that is. Richards? Who is that? Anna? Is she Whistler's mother? Ugh.But still delightful if you can get past the few insufferable chunks. Part II - Black Mountain was my favorite for its unique perspective on the Holocaust that few people can say they've heard before."}, {"userName": "Kim G", "userReviewDate": "May 07, 2012", "userURL": "http://www.goodreads.com/user/show/4618781-kim-g", "userReview": "I really liked this, but I can see how others would find it exasperating. If the phrase \"a rambling meditation on...\" gives you hives, run. But if you have an appreciation for interesting migration stories, the history of American art and craftsmanship, or quirky family memoirs, this book is lovely on a lot of levels."}, {"userName": "Jane", "userReviewDate": "Jun 09, 2014", "userURL": "http://www.goodreads.com/user/show/2266982-jane", "userReview": "A dream of a book, wide ranging, discursive, yet pulled together in a brilliant web of scholarly connections. From 18th century pottery to the Albers at Black Rock College, from the Brilliant Bartrams to Whistler's portrait of his mother, Benfey ranges across American art and history in a deeply personal meditation that leaves me in total admiration. Loved it."}, {"userName": "Gina", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/2995768-gina", "userReview": "I wish I could give it a 3-1/2. Fascinating stories, particularly about Black Mountain College, but I found it a bit disjointed to read. It touched on many things I knew nothing about, like the valuable veins of white clay. I wanted to like it more than I did."}, {"userName": "Mary", "userReviewDate": "Sep 19, 2013", "userURL": "http://www.goodreads.com/user/show/4215580-mary", "userReview": "For someone who is now living in Western North Carolina, this book is filled with information about artists and people who made history in NC. Not well written but tells a good story. I learned a lot."}, {"userName": "Sarah", "userReviewDate": "Jan 13, 2014", "userURL": "http://www.goodreads.com/user/show/16542435-sarah", "userReview": "I wanted to like this one, but I found that it was too disconnected, tried too hard to be \"literary,\" and spent too much time name-dropping. There are some interesting stories and connections behind all the aspects I disliked, but they weren't enough to keep me reading."}], "description": "BRAND NEW", "title": "Red Brick, Black Mountain, White Clay: Reflections on Art, Family, and Survival", "url": "https://www.goodreads.com/book/show/11797470-red-brick-black-mountain-white-clay", "average": 3.79, "cover": "https://images.gr-assets.com/books/1347935539l/11797470.jpg", "reviews": 41, "authors": [{"url": "https://www.goodreads.com/author/show/1048331.Christopher_E_G_Benfey", "name": "Christopher E.G. Benfey"}], "type": ["Art", "Nonfiction", "History", "Autobiography", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/11797470-red-brick-black-mountain-white-clay", "http://www.goodreads.com/book/show/15808491-red-brick-black-mountain-white-clay", "http://www.goodreads.com/book/show/19077728-red-brick-black-mountain-white-clay", "http://www.goodreads.com/book/show/2506012.A_Summer_of_Hummingbirds", "http://www.goodreads.com/book/show/760969.The_Great_Wave", "http://www.goodreads.com/book/show/170339.Degas_in_New_Orleans", "http://www.goodreads.com/book/show/678728.Emily_Dickinson_and_the_Problem_of_Others", "http://www.goodreads.com/book/show/345661.Double_Life_Of_Stephen_Crane_The"]}