{"ratings": 33, "userreviews": [{"userName": "Kaisersoze", "userReviewDate": "Jul 22, 2014", "userURL": "http://www.goodreads.com/user/show/22517400-kaisersoze", "userReview": "A trilogy of short stories set in a version of the wild west where the dead suddenly start coming back to life for no discernible reason sounded pretty good to me on paper, but the end result was very mixed. Dixon and Campbell provide a story at the beginning of the uprising, and then two follow-ups set over the course of the next 15 years that further the world in which people now have to live. The main problem is that the first story, The Lost Party is significantly better than the two that follow it and it's also the shortest of the three. It is a genuinely engaging tale of a man determined to learn the fate of a large party of people who have disappeared in the middle of nowhere. The second and third stories, Feud and The Last Rider are more typical westerns, with the zombies taking a backseat to proceedings. Given I was looking for and expecting zombie-caused mayhem, this was a disappointment. Especially when the zombies seemed to have inexplicable aversions to anyone who was a POV character in the stories. It also did not help that both of these latter tales were in need of a better copy editor; there were far too many typos and grammatical errors to be considered a properly professional publication.So, a great opening tale, and two somewhat disappointing (though far from terrible) stories does a very average rating make.2.5 Miraculous Survivals Amid a Horde of the Undead for Red Dust: The Fall."}, {"userName": "Justin", "userReviewDate": "Nov 13, 2013", "userURL": "http://www.goodreads.com/user/show/4929621-justin", "userReview": "A very well told series of western horror stories. After having written my own western horror I came across this book and was immediately drawn to it with every intention to read it. I have to say I'm not sure what I was expecting but I was beyond satisfied, entertained and enjoyed this book immensely. There's nothing quite like zombies/undead beings running rampant in the west. There were three stories so I will rate and give my thoughts on each. Also each story reminded me of something which I will mention as well.The Lost Party- 4 starsA party of settlers go missing in the mountains in 1846. One man makes it his mission to find these people and upon discovery comes to a diary that accounts for part of what happened. When I first started reading this two events came to my mind. The first was the lost colony of Roanoke and the settlers of Virginia who went missing never to be heard from again. The second thing this story reminded me of was the Dyatlov Pass Incident where in 1959 nine hikers died of mysterious circumstances. I found this story the most chilling of the three as you don't really know what the man who find the diary is dealing with and as he keeps reading the details only get more and more bizarre. It was a great blend of delivering the eerie and bizarre into an 1800's western civilization. Anytime a group of people go missing under strange circumstances chances are it's gonna play for a great story and this one was certainly that.Feud- 4 Starsin 1853, seven years after the lost party dissapeared, the undead have emerged taking over most of the states and eastern front. A lone rider comes into a small town and finds the town holds hidden dangers and secrets. This story reminded me of the classic Hatfield-McCoy feud. While it didn't have half as many people involved, the simple fact it took place in the west and the two men hated one another it quickly reminded me of it. Griffin is a shifty guy at first and I wasn't sure whether to like him or not or what. I enjoyed how we find how the type of man Griffin is when he gets pulled into all the chaos. This story also shows more on how people deal with the undead and how at times it's everyone for themselves. Very gripping and bloody story.The Last Rider- 4 StarsAmongst the undead still very much all over America a young volunteer courier makes it his mission to deliver a package to the Union army. This story reminded me of 3:10 to Yuma in the sense that the main character is determined by any costs to get the package delivered to it's location. This was the longest of the three and quite detailed. How Issac manages to survive baffled me as he went through countless hoards of undead zombies, came across groups and off characters but still manages to carry on. I love how Issac was determined and came off as a relatable character as he was no soldier but just a man out to do a job and it really felt as though he was an everyday sort of man. Also gotta love the guts, gore and bloodshed as this story has it in volumes up to the highest level. After a while I felt as though I was with Issac on his journey fighting whatever came our way. Very detailed and well told story.Overall, I really liked this book. It's got an excellent blend of Westerns, Horror, Mystery, Gore and History. With all of those in one book you really can't go wrong. at least I don't think so. The main characters are quiet, calm and collective and while they keep to themselves and do their own thing you really grow to like them and feel for them given the current situations they are faced with. I am definitely going to read the other two books in this series and I already have one of them. I recommend this book for anyone who enjoys a series of connected stories in a book, a good ole bloody Western horror and likes to feel like they're a part of the action. 4 solid gun-smoking bloody stars!"}, {"userName": "Rick", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/7318052-rick", "userReview": "Disclaimer: I received a complimentary copy of this eBook from the authors. I have read a couple of old west zombie books lately and I liked this one more than the other. The book was broken up into three distinct yet inter-related stories. Without giving anything away I liked the way that some characters were carried over between stories. The first story (The Lost Party) had a neat storytelling mechanism of switching between a character making his way up a mountain and passages from a journal written by a member of a group who had already ascended the same mountain. The journal passage which describes the writer's anguish at having to make a very tough decision was well written, I could really feel for the man as I read his account. The story wrapped up neatly and could stand alone as its own short work.The second story (Feud) started off a bit cliche with the stranger riding into town, a couple of tough locals giving him a hard time and so forth. From there it took off nicely into a much more interesting story. I liked the Jacob Gardner character, he was probably the most interesting character in this story. I had to question Griffin's decision at the end of the story and wonder why it took him so long to take action.The third story (The Last Rider) was the longest of the three as I recall but it covered a lot of territory (both geographically and plot-wise). Isaac was an interesting character although I questioned some of his decisions as they seemed out of character for him. What he does when he finally is able to complete his delivery was a surprise and just didn't seem like something he would do in my opinion.Ethan King was an interesting character as well, I assume by the title of the next book that he will be a major player and I am looking forward to reading more about him. I liked the last passage of the story, it ties it back to the first story yet sets us up for the next book as well.The biggest downfall of this book for me was in part due to my exacting standards for published works. I have a hard time with grammar and spelling mistakes in published works since I feel it's the author's duty to get adequate proofreading beforehand. I am by no means a creative writer myself but some technical problems bother me more than others. In this book the one glaring yet recurring problem was that I felt there were far too many commas used in inappropriate placces. The extra punctuation really broke the flow for my and I felt myself becoming distracted. That problem was noticeable from the beginning but later in the book I ran into several places where the pause of a comma would have helped the flow. It was odd to see two sides of the same coin in one book. Hopefully once the series is done and goes in for a reprint as one longer piece of work these issues can be addressed. These are much easier to fix than problems with the plot or characterization as they don't require an editor with lots of experience, just someone who knows what to look for in sentence structure.Overall it was a fun read and if you are less bothered by grammar errors than I am you will really enjoy this book. Once the grammar issues get resolved in a future edition I could bump my rating up one star. I know that may sound harsh to some but without half-stars I am stuck since this isn't quite a 4-star book as-is in my opinion."}, {"userName": "Shana Festa", "userReviewDate": "Nov 15, 2013", "userURL": "http://www.goodreads.com/user/show/9185553-shana-festa", "userReview": "I'm not usually a fan of anything western, but The Lost Party wasn't indicative of a gunslinger cowboy. More so, it focused on the setting. The desolate landscape was the real star of this piece of work.Party members are lost to the elements as they traverse the winter landscape. Stalked by an unknown evil, the long journey leaves them starving and forced to commit the unthinkable (think Ethan Hawke in Alive). The story doesn't just ram zombies down the readers throat, but builds up tension and suspense as their presence in the shadows is hinted at.Despite being apprehensive of the era, I enjoyed reading The lost Party. It was a nice change of pace from traditional zombie fiction. The writing style has an elegant, classic feel and quality editing made it an easy read. The Lost Party is a chilling read unlike anything I've read in a usually predictable genre.Feud fueled my fire with it's literary excellence. I really need to emphasize the fact that Campbell and Dixon make a great duo. Their writing is like a good song. It has a harmonic balance with crescendos and moments of innuendo. I found this story riddled with successful one-liners that made stop and say 'ooh, that's a great line.'\"Seems to me, God doesn't want you to have this land and has unleashed hell to take it back.\"Fast forward seven years, well into the undead plague, where pockets of civilization fight for their survival and to keep what's theirs. Enter Griffin, a man faced to come to a difficult decision and take sides in an ongoing battle for power between two men who both think their path is a righteous one. Feud has much more zombie scenes, and while it does provide us with some great blood and guts fiction, it does a great job humanizes the monsters.I enjoyed how they chose to introduce the name of the collection, Red Dust. \"He had left nothing behind in his wake, except for dust, red dust.\"The last of the three story's, The Last Rider, takes place eight years after the second story. Isaac, a horse messenger embarks on an important government mission to deliver a satchel to the military. Along the way, Isaac comes across some new characters, and even some we've previously met.I like how the of story's progression escalated up to the final battle. All three very different, yet connect to the previous in some way. These short stories were complete tales of their own, but all three managed to cohesively tell a full undead tale.It's rare that a work of fiction will make me turn to a dictionary, but the use of 'Blunderbuss' stumped me. Don't know what it is? It's a short-barreled large-bored gun with a flared muzzle, used at short range.Visit bookie-monster.com to read my full review!"}, {"userName": "Tammy K.", "userReviewDate": "Oct 16, 2013", "userURL": "http://www.goodreads.com/user/show/4626742-tammy-k", "userReview": "First things first, I got a copy of this book from the author in exchange for a fair and honest review. However, I do not personally know this author AND I was free to offer any rating/review that I felt was appropriate.The Lost PartyThis is the first episode of a still being written series titled Red Dust, which is a mix genre blend of America's old west and a Zombies Apocalypse.I found this story to be a compelling read.I felt that the characters moral challenges gave them emotional depth.There is a fair amount of foreshadowing (the eyes in the trees) that keeps the suspense building and my mind busy making the leaps into the \"what will happen next\" mode.This story ends in a cliff-hanger, leaving me guessing and a bit freaked out.FeudThis episode takes up seven years after the first.At this stage of the series, the zombies are a known fact of life which the pioneers of the wild west have adapted too. As the episodes title suggest, the main character finds himself in the middle of a town feud. I enjoyed the gunslinger feel to this story.I felt that the revenge served in this segment was done in a true \"wild west\" manor.The Last RiderThe Last Rider is in my opinion the best-to-date of the series. It picks up 8 years after the second episode.The zombies are well established throughout the Wild West by this time.The Last Rider follows a Pony Express rider, Isaac, as he journeys across the infested land of the wild west to deliver a package with \"State Secrets\" from Army HQ to a Major in charge of the Southern part of the Grant Line (a line of defense against the zombie hordes).Isaac is in a constant state of life and death challenges as he battles both zombies and desperate men alike.One last comment, in this episode we begin to see the connection of the characters of the older installments to those of the new installment.I give this book four stars (deducting only for minor typing/grammar issues).If you are looking for an entertaining, original Zombie and Western blend, I encourage you to give this book (series) a try."}, {"userName": "Serena", "userReviewDate": "Sep 05, 2014", "userURL": "http://www.goodreads.com/user/show/5675631-serena", "userReview": "The Lost Party: It called to my mind the cannibalism of the Donner Party and the old lore of the wendigo -with a zombie twist. Very short but introduces the mysterious George Masterson who is tracking lost pioneers. He finds a diary that tells of their journey and reads it between tracking and finding clues. I always find such a style of writing a bit disjointed, perfering to read all of the journal at once or all of the tracking that Masterson does. Feud: A stranger rides into Little Rock and seede ms to have a gift for stirring up blood as he walks into the feud between ranchers who were friends before the plague came that made the dead rise and walk. It's a feud that Griffin finishes - and walks away from alive as he leaves the town he isn't welcome within after.The Last Rider : Issac is the last of the dying breed of Pony Express riders, and while it might now seem like a romantic notion - horse and rider delivering packages come snow, wind, rain -in this case it's through Plaguers/ Risers. Issac meets up with some strange characters, and some familiar ones to -the mercenary Griffin and a doctor with split personalities -but in the end Issac's determination is rewarded.I received a free copy of Red Dust: The Fall because I am a member of Pro-Active Destruction and group authors Ben Dixon and Sam Campbell entered and won the Group Author’s writing Challenge - so members like me got a free copy here if we asked and agreed to participate in the  Special Group Read discussion."}, {"userName": "Greg at 2 Book Lovers Reviews", "userReviewDate": "Apr 18, 2014", "userURL": "http://www.goodreads.com/user/show/26135818-greg-at-2-book-lovers-reviews", "userReview": "Red Dust: The Fall is a collection of short stories that revolve around the zombie apocalypse in the American Wild West. The stories are interconnected and there is some overlap from one story to the next.I am really enjoying the resurgence of the western genre. This is not your typical John Wayne western, where the bad guy wears a black hat and the good guy wears a white one. It is a simple kill or be killed, the bad guys are not always the zombies. It is eerily chilling how with a common enemy people could be so cruel to one another, failing to unite. Unfortunately, this is probably what would happen.Sometimes authors take the zombie apocalypse and they go on the lighter side of it…have some fun, which I will admit, I do enjoy. Dixon and Campbell went in the opposite direction, they went to a deep dark place in the human soul, and then they contrasted it with selfless heroism.I am usually not a fan of short stories. I find that I need more time to develop a connection to the characters, however, I found that it was easy to get drawn into these stories. In Red Dust, they get straight to the point and focus on the character so that I cared about them right from the start.If you are looking for a dark story of humanity, then I would recommend Red Dust. The story pulls you in and satisfies you when it is over. It left me curious…”where do we go from here?”http://www.2bookloversreviews.com/blo..."}, {"userName": "Amanda", "userReviewDate": "Nov 20, 2013", "userURL": "http://www.goodreads.com/user/show/4856511-amanda", "userReview": "I completely lost myself in this book. The three stories are all set in the 1800s and involve zombies. What can be better than that? I admit that I was slightly confused by the ending of the first story. I think I understand what the authors were getting at, but kinda wish they had added either a little more explanation, or had it work out differently. Other than that, the three short stories were a treat to read. I really love the idea of zombie western stories and these were all very well written. The stories are very descriptive and the authors are very good with detail. I almost felt like I had watched a movie when I was finished reading the book because it was so clear in my mind. Once you start reading any one of these you will be hooked. I look forward to reading more by these writers.I recommend this book to anyone that enjoys a good zombie read. Also to anyone that likes short stories that grab your attention and leave you feeling pleased with yourself for having read them. Disclaimer: I received a copy of the ebook from the authors for reviewing purposes. Regardless, all opinions are my own. I was not required to leave a positive review."}, {"userName": "Heather", "userReviewDate": "Apr 27, 2014", "userURL": "http://www.goodreads.com/user/show/321403-heather", "userReview": "\"Red Dust: The Fall\" is an awesome collection of short stories that is totally what is proclaims in its blurb: western short stories with zombies, guns, the Wild West, and more zombies! All three stories tie into each other, ending with a massive cliffhanger in Isaac’s story, but could stand all on their own. The authors were kind enough to provide a print copy of their novel for review, and it was a perfect read to tuck into my purse for reading in zombie loving spurts. The stories are too the point and not filled with a ton of bogging down details, but still builds enough of the creepy world the survivors live and fight in. It's a no frills, straight up zombie vs. the west collection of zombie stories any zombie fan should tuck away in their collection."}, {"userName": "Rick", "userReviewDate": "Apr 17, 2014", "userURL": "http://www.goodreads.com/user/show/7883839-rick", "userReview": "This book was provided by the author (Ben Dixon) for review.Very well done mix of cowboy/western and zombie stories. Well written and held my attention. Definitely want to read more."}, {"userName": "Krisaundra", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/3956934-krisaundra", "userReview": "* I received a copy of this book from the author in exchange for a fair and honest review. I do not know this author and was in no way compensated for my reading of this book, other than being asked for an honest review. *I found the novel \"Red Dust: The Fall\" a book that while easy to read, not one that was easy to follow. A lot of presumptions are required in order fo a person to draw any real conclusions to each of the three short stories included within this anthology. In the first story for example, \"The Lost Party\", can be taken totally at face value, which will leave many unanswered questions, however if a person has a knowledge of American history then one can presume that the author is offering up another possible answer as to what happened to a caravan of people who disappeared in the mountains during a very long winter. I found the main character in this particular story, Masterson, to be well fleshed out and this was potentially my favourite of the three stories in the book. I would have very much liked to have learned more about him as well as how the undead fit in, such as where did they come from. All in all in my opinion this first tale was also the best tale of the three stories, but I so would have enjoyed it even more by learning more about both Masterson as well as how the undead fit in, or how they got there in the first place...The second story is \"Feud\" in which a rider finds himself not only in an isolated small town, but also in a position where two pwerful men both try to get him to choose a side and help them to end a feud that it would appear is as old as the town itself. The moral challenges, and how they were handled by the primary character Griffin were well done without a lot of predictability. Once again there are the undead who are completely unexplained and even stranger to me is the fact that everyone just accepts them as a predator of the Old West landscape, not that diferent from something like a coyote... it just did not make a lot of sense to me.The third and final story is \"The Last Rider\", the story of a highly dedicated Pony Express rider brought back into service since the rise of the undead has interrupted the telegraph services, as well as stopped its growth. The young rider, Isaac, takes his job to deliver a message extremely seriously. He rides thru a battle of the Civil War, which also includes riding thru battles with the undead, unwilling to allow anything to stop him from delivering his parcel. I felt I got a half decent feel for who Isaac is, and why he does what he does, but I also feel like he could have been fleshed out a lot more. I also really liked how the book did not end with any silly cliff hangers which appear to have become far too prevalent in more and more books today.Overall, while I did find the book an easy read that was written quite well I had a lot of problems with the fact that in every story it felt as if I was always being dropped into the middle of a story, given some really intriquing parts to each tale, then was yanked back out of it with no real closure. I believe the writer writes well, and that each story has a great deal of potential. I would just like to see that potential focused on one story at a time that fully develops the characters, storylines, and takes it all the way to a full conclusion, rather than parts of a story. I may not have loved this book, but I will be keeping my eye out for this author as I firmly believe that he has a lot to offer once he finds his groove in how he tells a tale. Here are all links to my review of the book \"Red Dust\" by Ben Dixon.Here on Goodreads, which is the link to the above review...https://www.goodreads.com/book/show/1...My review on Amazon can be found here:http://www.amazon.com/Red-Dust-The-Fa...Thank you for the opportunity to read a book that is one I may not have picked up on my own but I will certainly be keeping my eye out for this writer in the future as I think he has real potential!Sincerely,Krisaundra \tOct 31, 2013 12:21AM"}, {"userName": "Elke", "userReviewDate": "Apr 07, 2014", "userURL": "http://www.goodreads.com/user/show/1105232-elke", "userReview": "Red Dust: The Fall collects three stories, each set apart about seven years. While loosely connected, each story can also be understood on its own. However, reading all three parts together is much more satisfying, as the reader recognizes reappearing characters and follows the development of the spreading zombie plague.The first part, The Lost Party, introduces us to a different wild west era, where the undead have risen and are hunting for living prey. One man, Masterson, set out to trace a lost trek of settlers. Through the pages of one of the settler's diary, he learns about the horrible dangers lurking in the darkness and the terrible fate that has overcome the people he came looking for. Each diary entry grows more gruesome and desperate, telling of the dwindling numbers within the trek and fading hope. Masterson continues his search, but at the end he has to witness the horrific truth with his own eyes. While the reader is spared gruesome details, at the end he can vividly imagine what will happen to Masterson with his own fantasy, which makes it much more creepy than reading a preformed description.Now that the stage is set, the second part Feud delivers a mix of western and zombie story. It contains all the classic ingredients: a mysterious lone stranger coming to a small town reigned by a self-acclaimed mayor; a storybook saloon with the obligatory beautiful girl named trouble; and a blood feud between two men. Though this is also a zombie story, those creatures are not the main focus and we don't have to experience yet another outbreak scenario. Seven years later, zombies are already a well-known threat people have become used to and fighting them is a constant part of everyday routine. However, as the urge for revenge grows, one man succumbs to madness and turns loose an army of the undead upon his rival, oblivious to the danger this brings to all people.The last story, The Last Rider, focuses on the adventure of a young courier named Isaac on his way to deliver a package. During his journey, he more often than not encounters the true monsters of the living kind. Racial hatred and war are still in full swing, regardless of the undead threat endangering all mankind. Instead of uniting all people to fight together for humanity, zombies mean only another danger for life in the wild west, maybe even encouraging men to turn against one another. All the while, we witness how Isaac stays true to his principles and holds on to humanity, regardless of the danger he puts himself in repeatedly for others.While there are still some sentences in need of proof-reading, they can be easily dismissed in favor of a distinctive and gripping writing that keeps you glued to the pages.With its original western theme, Red Dust: The Fall is an outstanding work of fiction, serving fresh flesh to the recently gone stale menu of zombie books, which will sate not only the taste of genre fans.A fourth installment titled King  is already published, expanding the story of a character introduced in the third part. However, I do hope the authors will also write a prequel focusing on the Indians shortly mentioned in part one, as they seem to know more about the plague and maybe its origins.Highly recommended!(I received a copy of this book from the author in exchange for an honest review)"}, {"userName": "Kevis Hendrickson", "userReviewDate": "Oct 18, 2013", "userURL": "http://www.goodreads.com/user/show/1096765-kevis-hendrickson", "userReview": "Red Dust: The Fall is a short story collection of the first trilogy of books in the series. Included in this collection is The Lost Party, Feud, and The Last Rider.I’ve individually reviewed the first two short stories, The Lost Party and Feud, but happily accepted the chance to review The Last Stand as part of the collection. So my focus here will be on The Last Stand, which I consider to be, possibly, the best of the lot. I’m a history buff and enjoy a good Western. I equally despise Zombie stories. Always have, always will. Until I discovered this series, I never thought I’d even glance at any Zombie books beyond the few I’ve checked out in the past. What separates this series from any other Zombie story--and incidentally, one of the few reasons that I keep coming back--is the quality of the storytelling, as well as its wonderful milieu. I love the focus on the historical elements as well as the wonderful prose style the authors use to deliver the story. It’s very rich, and vividly describes its 19th Century setting.The Last Stand thrusts us right in the middle of America’s bloody Civil War. However, in the pages of this book, the Union and Confederate soldiers have more to worry about than just falling prey to the each other’s guns and cannons. There’s a deadly plague that has caused the dead to rise and their unholy hordes ravage the land, indiscriminately killing everything in their path.Enter Isaac, a mail courier, charged with the task of delivering a package right in the heart of Zombie country. Isaac, knows it’s a fool’s errand, and accepts that his chances of successfully carrying the package are dim. However, he is determined to see the job through even if it means his death. And so, he heroically rides alone on his trusty mare, Clarice, through enemy lines toward an uncertain fate.The series, as a whole is quite intriguing, with plenty of drama and action, although it is only during the final page of the The Last Stand that the reader gets a sense that this collection of stories are connected by more than just the setting. The Last Stand ends with a dramatic conclusion that leaves me enthusiastically wondering what will happen next.I wouldn’t be honest if I didn’t mention this. But there are some noticeable editing issues that I wish hadn’t gotten through. The authors write terrific prose that is quite haunting and beautiful at times. However, the errors (typos, missing words, punctuation, etc.) spoils what would otherwise be solid writing. I hope the authors will revisit this series and give them a good scrubbing or and hire a good editor to help give this series the spit shine it deserves. Even so, the errors aren’t so egregious to stop forgiving readers from enjoying this series. The story here is ultimately what counts. And a damn fine story it is.3.9 Stars for an intriguing series with an interesting twist on a familiar genre. Disclaimer: I was given a copy of this book for an honest review."}, {"userName": "Michele", "userReviewDate": "Dec 09, 2013", "userURL": "http://www.goodreads.com/user/show/3007601-michele", "userReview": "I've chosen my words carefully to avoid revealing any spoilers. I've rated the piece at 4 stars, but sit solidly at a current determination of 3.5 stars, really. The stars earned are for the unique blending of American Pioneer, Old West, and Civil War tales with the modern-day style, zombie apocalypse story. It's a rather unique telling reminiscent of Cowboys vs. Aliens and deserves some praise for its inception. Although repetitive at times, the author(s) are quite adept at scene setting. The alternate time-line is compelling and the introduction to myriad problems of the period are conveyed well, even in the bite-sized proportion provided in these teasers. The main characters and the persons that they encounter are also provocative. The stories do indicate a decidedly masculine perspective, although, without having read the full-length novel, I cannot say with great certainty that this continues throughout the longer tale. This novella is a pre-emptive marketing strike for the full-length novel that follows. It's purpose, as such, is fulfilled. It is told in three incomplete, short-story teasers. Stereotypical Clint Eastwood and John Wayne style characters pepper the tale. The structure, chosen for this appetizer, does not allow for any fully fleshed-out characters, but they are interesting enough to whet the reader's appetite for the main course to come. Where the author(s) fall short is editing. Numerous grammatical errors and larger structural errors distract somewhat from the plot advancement. I highly recommend that the authors employ a professional editor, with some background in American vernacular and/or American historical writing, before moving forward. If that bit of advice is taken, this could be an entertaining read in the historical fiction - horror crossover genre. In a nutshell, let it be known that I am neither a huge fan of American westerns, nor of zombie apocalypse tales. Although, I'm more likely to pick up the latter. And yet, despite the editing concerns, this story is intriguing enough that I will certainly read the full-length feature. Recommended to fans of either genre and certainly to fans of this sort of crossover blending. Disclaimer: I received a free copy of this ebook in exchange for a fair and honest review. As of this writing, I do not know the author(s) either personally or professionally."}, {"userName": "Deborah", "userReviewDate": "Oct 20, 2013", "userURL": "http://www.goodreads.com/user/show/21685026-deborah", "userReview": "2.5 starsThis book, which seems to be the start of a series, shows promise. It is a compilation of three stories, setting up an alternative history of such events as the Donner Party and the Civil War, in which zombies play a key role. Unfortunately, the atrocious editing (or lack thereof) prevented me from enjoying the storyline. If the authors don't care enough about their own work to even run their manuscript through grammar check, it's hard to understand why the reader should care, either.Of the three stories, I thought the first, \"The Lost Party,\" was the best. Its ambiguity drew me in; when combined with its connection to the third entry, \"The Last Rider,\" George Masterson's story peaked my interest. Masterson is also the most fully-developed of the characters in the book, although even he is still relatively two-dimensional.The second story, \"Feud,\" is the weakest. It is an utterly predictable mash-up of a Clint Eastwood spaghetti western and \"The Walking Dead.\" Dixon and Campbell also introduce too many plot threads which are subsequently dropped, interrupting the coherence of the main story which, given Griffin's appearance in \"The Last Rider,\" should have been the consequences of his arrival in Little Rock.This same tendency to throw out too many subplots to see which one sticks is the major flaw of \"The Last Rider.\" At one point, this story seems to set up an interesting alternative explanation for the rise of the KKK, but the episode then fizzles; I would like to see this idea developed in a subsequent story. The employer's medical condition in the same episode is too much; while he could be an intriguing character in his own right, tossing him into the mix without any back story just muddles the main action.Overall, I would not recommend Red Dust: The Fall in its current form, but the Red Dust series is worth watching to see where Dixon and Campbell take Masterson, Griffin, and Isaac next.I received a free copy of Red Dust: The Fall from the authors in exchange for an honest review."}, {"userName": "Mkittysamom", "userReviewDate": "Apr 21, 2014", "userURL": "http://www.goodreads.com/user/show/9901011-mkittysamom", "userReview": "RedDust is a collage of Zombie Old West Stories. I really enjoyed them and the 3rd story was my favorite.1. The Lost Party America 1846This story is about a caravan of people trying to cross over to new land in the winter. George Masterson is out looking for the missing party. Masterson finds a satchel with a diary in it and pieces together what happened. The settlers twice get told to turn around but they don't listen. Masterson finds them, and then gets attacked by a bear.2. Feud ( 7 yrs later) 1853A Stranger rides into Little Rock... he is the first new patron in their saloon in 5 months. The town of Little Rock is having a crisis... Bishop and Gardner are in a family feud to the death and each try to get Griff (the stranger) to assassinate the other one. They both have different views about zombies as well. The conflict ends with a shoot out and red dust.3. The Last Rider ( 8 yrs later) 1861Isaac is the last rider of the Pony Express, and he will go through hell and high water to deliver his package to Major Stokes. In his journey he comes across some of the Characters we've already met in the first two stories. Also we find out that the Civil War is going on along with incoming zombie hordes!! I was holding my breath that Isaac would make it, and he had a lot of strange lucky help along the way!! It left me on a awesome cliffhanger I couldn't wait to read The King!Each story is unique but when I started thinking about them.. I noticed that they were all entwined together with certain characters, and almost seemed to be pieces of a bigger story. I think I had to most fun trying to read between the lines, and piece all of the stories together.*Make sure you read the next story : King #4I was given a copy by the author who is really cool by the way (I got to talk to him about these books) in exchange for my honest review!"}, {"userName": "Rebecca", "userReviewDate": "Oct 20, 2013", "userURL": "http://www.goodreads.com/user/show/11421566-rebecca", "userReview": "I received a copy of this book for free in exchange for my honest review, so here it is!\"Red Dust: The Fall\" contains three short stories set in the 19th century wild west America. There is a plague a-foot and we start the journey with Masterson, a mountain man searching for a missing party of settlers lost during the long winter months. Masterson is able to locate an abandoned journal in the snowy mountains, a diary of events written by a member of the group he is trying to find.Next, we follow a mysterious loner named Griffin, as he rides into a dusty town where there are two factions at war, and one of them is herding zombies for his own personal revenge.In the third story, we saddle up with a Pony Express rider on a mission he will stop at nothing to complete. This story was the best in my opinion, but it also was the choppiest. Each encounter was short and to the point and I feel would have been better served as a full-length novel, or a novella at the least, allowing each scenario far more time for fleshing out. The concept was awesome and deserves a showcase. I'd love to see the authors expand on this idea and tell Isaac's story fully.Collectively, there were quite a few errors that would benefit from another edit but the ideas, concepts, and overall story-telling were very well written and exciting, but I just had this feeling as if I was missing something. Each tale felt too rushed and like I was excluded from important details, as if each short was a highly condensed peek at a larger novel, which I would love to see done in the future!That being said, you had me at zombie western."}, {"userName": "Donna Backshall", "userReviewDate": "Nov 22, 2013", "userURL": "http://www.goodreads.com/user/show/19450056-donna-backshall", "userReview": "First of all, thank you so much for the opportunity to download this book in exchange for a fair and honest review.Overall I found the stories unique and interesting, and I appreciated the way each story worked to form a cohesive whole. Dixon and Campbell do a respectable job constructing action-packed stories, but I must admit I started and stopped three times, putting it away for a few weeks time, before finally settling in to finish the book.Why? The editing (or lack thereof) continually frustrated me to the point that I could not enjoy the excitement or drama they were trying to create. Although I was braced for the normal self-published or first novel awkwardness and occasional typo, what I found was far beyond typical. Within the first several pages, I found clumsy wording, misplaced punctuation, run-on sentences turned paragraphs, and a slew of other grammatical errors. This foretold a bumpy ride, and oh, it was! Most frustrating is that the majority of these errors would be caught by a single run through a rudimentary grammar or spell checker, yet for some reason the writers did not deem this a necessary component to producing a quality novel. If an edited version ever comes out, I would be happy to revisit the stories, and this review."}, {"userName": "Netanella", "userReviewDate": "Oct 27, 2013", "userURL": "http://www.goodreads.com/user/show/1157679-netanella", "userReview": "I received a free copy of this zombie Western collection from the authors in exchange for an honest review. \"Red Dust: The Fall\" is a series of three, interrelated stories of zombies in the old West, each separated by about 7 or 8 years. I read the first two stories independently, and reviewed them independently as well on this site.The last story, \"The Last Rider\", recounts the travels of Pony Express courier Isaac, whose mission to deliver a message across dead country is fraught with peril, adventure, and of course, zombies! Isaac encounters a vast spectrum of personalities and historical moments in his quest to deliver his package. He witnesses Custer's Last Stand - this time against zombies. He gets caught up in a KKK lynching, and helps to rescue a group of runaway slaves. Isaac, in short, becomes almost a regular Forest Gump. Except, of course, our Isaac is smart as a whip. Dixon and Campbell do a great job telling this story, but do beware the lack of editorial clean up. Otherwise, job well done, and I look forward to more weird westerns from these authors."}, {"userName": "Marcie pollack", "userReviewDate": "Oct 16, 2013", "userURL": "http://www.goodreads.com/user/show/4911553-marcie-pollack", "userReview": "I was lucky enough to receive Red Dust \"The Fall\" from the author in exchange for a review.. Red Dust \"The Fall\" is 3 shorts in the Red Dust series. I am glad I got he chance to read these short stories. The beginning starts of with George Masterson apparent Mountain Man searching for a group of lost settlers in the mid 1800's and flows right into the first story and the onset of the plague of risers.. With out giving out too much info.. In the Feud \"Griffin\" (or possibly George) stops in a town struggling with risers and lawlessness.. And in The Last Rider we meet Isaac who is a rider/courier who runs into Griffin while running a package for the military. I really enjoyed these stories, they are fast paced and well written. There is not a lot of gore which works well here because the writing is so good. I am not am not usually a fan of shorts but these were great and a whole new component to the Zombie pop-culture.. Historical Zombies.. I have recommended this to several of my friends, and I can't wait to read more!"}, {"userName": "Amie's Book Reviews", "userReviewDate": "Dec 15, 2013", "userURL": "http://www.goodreads.com/user/show/11232185-amie-s-book-reviews", "userReview": "I received a free eBook version of RED DUST: THE FALL from the author in exchange for a fair and honest review. The book is a series of short stories in the Western/Civil War/Zombie genre. I have to give the author kudos for originality. I would not have thought to add the Walking Dead (or Risers, as they are called in this book) to the American Civil War.My main reason for only giving this book 3 out of 5 stars is it's need for proper editing. There are quite a few instances of the wrong word being used. For example, \"bellowing smoke\" instead of \"billowing smoke.\" There are other places where extra words are included unnecessarily in sentences. With a proper editor this book would be much more readable.All in all, it is worth reading."}, {"userName": "Rose Wynters", "userReviewDate": "Nov 14, 2013", "userURL": "http://www.goodreads.com/user/show/18724175-rose-wynters", "userReview": "Red Dust was an awesome read and definitely one of a kind. Set back in the past, this was one of the most creative zombies book I've seen... And certainly an attention grabber. Imagine being in the 1800's and dealing with zombies. Each story was really unique and authentic, breathing a new, exciting life into a well-covered genre. They are very different as well, dealing with different characters and time settings. I will definitely be watching for the next release in this series!"}, {"userName": "Kris", "userReviewDate": "Nov 21, 2013", "userURL": "http://www.goodreads.com/user/show/19159687-kris", "userReview": "I would recommend this book to young adults and older, the book is an interesting read made in the time of the civil war, with a twist of having undead beings also. I personally am not a big zombie fan, but this book has a very good storyline and well written characters that make you want to keep reading. I will also mention that I read this book for the author, upon receiving it for free from him to read it and be honest. The only bad thing I would have to say is that the story ended to soon."}, {"userName": "Randy Harmelink", "userReviewDate": "Nov 12, 2013", "userURL": "http://www.goodreads.com/user/show/2029520-randy-harmelink", "userReview": "This omnibus has three short stories that are an entertaining mix of the Western and Zombies genres.Lost Party -- 3.5 stars. More suspense and thriller than horror, so I felt is missed the mark there.Feud -- 4 stars. A combination of feuding ranchers, revenge, a stranger riding into town, and a few zombie attacks here and there. What's not to enjoy?The Last Rider -- 3 stars. I just never really felt a connection to the main character."}, {"userName": "Tori", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/15373586-tori", "userReview": "I enjoyed the collection of short stories. The only downfall was that it left me wanting more. The first story called the lost party was my favorite. I enjoyed reading the passages from the diary. I wish that there would have been more zombies mentioned earlier in the stories or more often. I would definitely recommend these stories to my friends that do not enjoy reading novels."}], "description": "Red Dust is a series of zombie westerns.Red Dust: The Fall is the first trilogy of short stories in the Red Dust series. These stories are The Lost Party, Feud and The Last Rider.The Lost PartyWhen a party of settlers go missing on the Wasatch Mountains of 1846 America, a lone mountain man tasks himself with finding the lost pioneers. Upon the discovery of the remnants of a diary, George Masterson finds himself pulled into the dark story that befell the ill-fated travellers.FeudAmerica 1853, seven years since the disappearance of the lost party, the undead have emerged from the wilderness crossing the Great Plains to assault the civilised world. Communication has broken down and settlements now stand alone as the Rising Plague spreads across the eastern border. In the town of Little Rock inhabitants of the New World thrive to create normality in the midst of chaos. With the arrival of a mysterious rider named Griffin, the true dangers of the town become clear. The illusion of civilisation quickly dissolves as Griffin’s appearance sparks the violent conclusion of a deep-rooted vendetta.The Last RiderThe Rising Plague continues to spread mercilessly across America, leaving the remnants of the US government to lead a desperate defence in defiance of the undead. Yet in the face of their doom, the beginnings of a civil tension arises, as the Southern states secede, leaving a dire split across the US and its people hopelessly divided.Isaac, a young courier, volunteers himself to deliver a mysterious package for the Union military. His task will lead him deep into the heart of the unknown, through the decaying civilisation of a country that he can no longer call his home, as his eyes are opened to the horrors of the New World.", "title": "Red Dust: The Fall\n      \n          (Red Dust #1-3)", "url": "http://www.goodreads.com/book/show/18658594-red-dust", "average": 3.55, "cover": "https://images.gr-assets.com/books/1381428118l/18658594.jpg", "reviews": 25, "authors": [{"url": "https://www.goodreads.com/author/show/7048364.Ben_Dixon", "name": "Ben Dixon"}, {"url": "https://www.goodreads.com/author/show/7341632.Sam_Campbell", "name": "Sam    Campbell"}], "type": ["Horror", "Horror", "Westerns", "Mystery", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/18658594-red-dust", "http://www.goodreads.com/book/show/21013019-red-dust", "http://www.goodreads.com/book/show/17800713-the-lost-party", "http://www.goodreads.com/book/show/26052514-red-dust", "http://www.goodreads.com/book/show/20799525-king", "http://www.goodreads.com/book/show/18186875-feud", "http://www.goodreads.com/book/show/23533664-conquest"]}