{"ratings": 1881, "userreviews": [{"userName": "graveyardgremlin (formerly faeriemyst)", "userReviewDate": "May 16, 2010", "userURL": "http://www.goodreads.com/user/show/290082-graveyardgremlin-formerly-faeriemyst", "userReview": "For about the first forty pages, RED HOT FURY has a rocky start, but after it gets over that hump it's a worthwhile read. The Furies are an interesting breed that brings a welcome change from all the vampires, weres, witches, et al. to the urban fantasy genre, and the author adds her own spin to the species. Marissa, or rather Riss, is a tough, sarcastic, sure-of-herself character that won't appeal to everyone, but if you like them more on the gritty side then she might be the heroine for you. The world is interesting and there are good ideas, which includes Greek, Egyptian, and European mythology, but unfortunately the execution could have been better. Sometimes I was confused by explanations of the world, organizations, magic, etc., all of which, at times, were vague and periodically the dialogue fell flat. Adding to that, there was an unnecessary number of action scenes and a few too many characters to keep completely straight. However, there were some nice twists and turns, and although I saw the big reveal coming a mile away, I enjoyed the book and will look for the second in the series. Hopefully, all the kinks will be ironed out for that one. It's not quite a 4-star book, but a little better than a 3, so I'll settle for 3.5 stars.Provided to me free for review through Amazon Vine."}, {"userName": "Liv", "userReviewDate": "Nov 30, 2011", "userURL": "http://www.goodreads.com/user/show/4190183-liv", "userReview": "This book could have had potential. The premise and the idea of the Fury is actually pretty novel and unique. Furies are driven by their Rage which gives them special uber-powers. They are governed by the Sisterhood comprised of Furies of different types, overlooking the peace accord between the mundanes and arcanes.I liked the overall plot of solving a supernatural conspiracy and murder mystery. Riss, or Marissa, was the Chief Investigator of the Magical Crime Unit. In this book, she was driven to solve the disappearance of her best friend and the death of a sidhe who took the appearance of the said best friend. The book read much like a mystery, with paranormal and fantastical elements thrown into the mix. It would have been a fun read, because the whole setup wasn’t bad at all. It fell flat on its figurative ass, in my opinion, was the fact that the female protagonist of the story, Riss, was just plain ANNOYING!!! Her characterization was inconsistent – one minute she’d be all badass and hard-ass, then the next minute she’d go all stupid and emotional. Okay, so the author chalked it all up to the fact that she was a Fury and that it was natural for Furies to have their moments. However, throughout the entire book, I found that I couldn’t really get into liking her as a main. Her often snarky and supposedly humorous remarks drove me crazy (not in a nice way), and I honestly did not find any fun or humour at all. She also had an ego that was the size of a mountain. I usually didn’t mind heroines who were capable with a bit of arrogance, but she could be too hot-headed sometimes (again, because she was a Fury!!)There was a bit of romance in the book – yeah, I had to admit, some romance always spiced up a book and made it all the more interesting. BUT, her so-called romance with her old-flame, Scott, was not very convincing. I didn’t find Scott at all attractive and I just took their relationship at face value – because that was what I was told by the author. (*shrug*)There were also some hiccups experienced with the plot weaving as well. I did not see the purpose nor the reason why Sean, Scott’s little brother, was positioned to have some sort of infatuation for Riss and even attempted to kiss her!! Eewww... Sean had a very short and minor appearance in the book and then he went missing. That felt awkward and unnecessary. Okay, so may be the author was setting up a sub-plot and leaving bread crumbs for subsequent novels in the series, but I thought it could have been executed a little more smoothly and convincingly. In addition, Riss’ reunion with her mother and genetically-produced younger brother felt very contrived. It was just not easy to buy into the whole “we escaped the bad guys” blah blah blah... It was probably a quick an easy way for the author to get on with her storytelling without giving too much detail on the whole escape. That just felt somewhat hasty and sloppy...Oh, not to mention, if you are reading my review, are you noticing all those italicized words?!? Oh yes, I’m just doing what the author oh-so-loved doing – she had a tendency to italicize words in every other sentence on every other page, in attempts to emphasize certain words. This just drove me BONKERS!!!! It was an absolute eyesore and was often unnecessary. Seriously, was it really necessary to emphasize the I or you when Riss was speaking to others. Oh my gawd!!!! I kid you not... I even went back to the book, and I could find at least one, if not more, italicized word on almost every page that I turned!!!!Having said all this though, quite honestly, this wasn’t a bad book. Really, it was actually okay for book #1, in what I can foresee as a long running series. The heroine, Riss, may even be funny and awesome to some readers. However, I, having been spoiled by many good books and series, think I have been “ruined”, so I simply thought that this novel paled in comparison. I decided to give 2.5 stars to this book, because while I thought it was more than just okay, I didn’t “like” it – not really. The plot and storyline was interesting enough to keep me going, but in the end I still felt a bit of “meh”. Hopefully the next instalment would be executed better."}, {"userName": "Kelly", "userReviewDate": "Apr 23, 2010", "userURL": "http://www.goodreads.com/user/show/2276205-kelly", "userReview": "Look out, paranormal baddies; Marissa Holloway is on the job. Riss is a Fury, and her mission is to fight supernatural crime. Kasey MacKenzie bases her Furies on the ones from Greek mythology, but with a twist. In myth, there were three Furies: Alecto, Tisiphone, and Megaera. Here, these names represent not individual Furies, but classes of Furies. Riss is a Tisiphone. This means she wears red and deals mainly with homicides.(Unfortunately, MacKenzie doesn’t do as much with this concept as one might hope. We don’t learn much about the Alecto and Megaera Furies beyond the colors they wear. This may be elaborated upon in later books.)As Red Hot Fury begins, Riss is called to a murder scene. The body is that of a Fury, specifically Riss’s best friend Vanessa. Yet something is fishy about the crime. Vanessa’s body doesn’t seem quite right magically speaking, and besides, Riss thought Vanessa died several years ago at the hands of a jealous ex. As Riss investigates the case, she uncovers a sinister conspiracy, and learns that almost every conclusion she jumped to in the past was wrong.The plot of Red Hot Fury is fast and, well, furious. MacKenzie keeps the excitement at a high level throughout most of the book, and combines the action with a compelling romance between two characters who royally screwed up their relationship years ago but now have a second chance to work things out.At times, though, the plot moves too quickly. Several times, MacKenzie skims over scenes, rather than using them to their fullest potential. At one point, Scott drops an emotional bombshell on Marissa. Do they kiss? Does she stomp off? Do they just stare awkwardly at each other for a few minutes? We don’t know, because the chapter ends there, and as the next chapter begins, the characters are doing something completely different. Later, a tenuous group of allies prepare to make a blood oath to each other. What is the ritual like? How is the oath worded; are there loopholes? Who is enthusiastic? Who is reluctant? Who acts shifty? Again, we don’t know; in the next paragraph it’s a done deal.There are other problematic elements, including a few instances of infodump-by-dialogue, and the weps. Riss refers to weapons as “weps.” This would be fine once or twice, but the term is used so often that it becomes distracting. You know how if you stare at a word too long, it loses its meaning and you just end up thinking about what a funny-looking word it is? I don’t think it would have been nearly as bothersome if she’d just used weapons or guns or knives. The reader’s brain would process the familiar words and move along. It’s like using overly vivid dialogue tags instead of “said.” “Said” is unobtrusive, but if everyone is exclaiming or snarling or hissing their words, it throws the reader out of the story. So it is with the weps.However, the idea of a Fury-based urban fantasy is original enough, and the story entertaining enough despite its flaws, that I plan to continue with the Shades of Fury series. It has a lot of potential; it just needs some ironing out."}, {"userName": "Alexia561", "userReviewDate": "Aug 07, 2010", "userURL": "http://www.goodreads.com/user/show/2342818-alexia561", "userReview": "Really enjoyed this one! I don't think I've read a book featuring furies before, and never really knew their mythology. Love it when I come across new myths and legends! Liked the background provided about harpies and warhounds as well. Very cool!Really liked Riss, the Fury who is trying to track down why Arcanes have been disappearing, and why someone wants her to think that her missing best friend is dead. She's one of those kickass heroines that I love, and I really liked her. Maybe it was her struggle to do the right thing, and keep a lid on her rage? I can totally relate to that. (be afraid! be very afraid!) *L*Anyway, once Riss is suspended from her job as Chief Magical Investigator and realizes that assassins are trying to kill her, she turns to the only person she can trust to keep her safe; her ex-love, Scott. Helps that his family are warhound mercenaries, another species I wasn't familiar with. Let's pause for a moment and bask in the sheer animal magnetism of Scott the warhound....*sigh*...um, sorry, where was I?So we have a Fury trying to solve a mystery with no back-up, while on the run from the authorities and assassins both. The possibility of sparks flying with an ex. The discovery that Arcanes have been disappearing over the last few years. All connected to a horrible, evil plot that could lead to war between the races. Whoa!Really enjoyed this book! Good action, interesting characters, a great heroine, sexy-yet-not-annoying men, and an actual plot! Kasey is a very talented writer, and I really enjoyed the universe she came up with. This is listed as a Shades of Fury novel, so hoping that it will be a series! Would love to see more of Riss and Scott, want to see what happens with Cori, curious about how Olivia will turn out, want more of the harpies, and would like to meet more of the Murphy clan. And did I mention my new fascination with warhounds?"}, {"userName": "Rachel- Goodbye Borders", "userReviewDate": "Jun 14, 2010", "userURL": "http://www.goodreads.com/user/show/3040686-rachel--goodbye-borders", "userReview": "A non-vampire/werewolf book! It was nice to have something different. A Fury (and her Rage). While this was entertaining and interesting (mythology and the different Furies classes- Megaera, Tisiphone, and Alecto), it was off for me. Riss was, at times, awesome, and at others, meh. (I liked her, I didn't, I liked her, I wanted to slap her, and etc). Nice family twist. The traitor is easily guessed. And what was the deal with Sean? That came out of nowhere.Not bad, not awesome."}, {"userName": "Karissa", "userReviewDate": "Dec 29, 2010", "userURL": "http://www.goodreads.com/user/show/4057501-karissa", "userReview": "I got this book through the Amazon vine program as an Advanced Reading Copy. It is the first book in the Shades of Fury series, I was unable to find how many books are planned for this series. The book was okay; there were some great things about it and a number of flaws in it too.Riss is a Fury, sworn to protect mortals from non-mortals, she works for the Sisterhood and as the head of Magical Investigations in the local police department. When the body of a sister Fury washes up, Riss is Mandated to find out what is going on. Suddenly she is relieved from her position on the police force and people are out to kill her. Now she has to uncover a plot that will influence mortals and non-mortals alike; that plot may have to less to do with magic and more to do with genetic engineering and betrayal.I'll start with what I really liked about this book. It is very fast-paced with lots of action and the action scenes are fairly well done. It is a good brainless read; if you don't think too hard and just enjoy the ride you will probably enjoy the book. I loved the idea of Furies and other mythological creatures alive and well in our society. It was nice to read about a Mythology based alternate world as opposed to the tons of fairy books and vampire/werewolf books out there. Riss is also a pretty likable character and her ex-boyfriend Scott was great to read about too.There was a lot I didn't like about this book though. The writing, especially in the beginning, is disjointed and juvenile to the point of painfulness. The sentences were clipped and short and just sounded unnatural. This improved as the book continued. The world itself, how things worked, and how the races were related was confusing and unexplained. As I said, if you don't think about the surrounding world too much and don't pay too much attention to inconsistencies...then things are okay...but when you start thinking and trying to make sense of the whole world and how everything interacts on a broader sense...well it just doesn't make sense.The author glosses over a lot of things that she doesn't want to explain in detail, which is okay but makes things harder to understand and at times come across as laziness on the author's part. Also the interaction between Riss and Scott is a bit odd at times. Sometimes they have great chemistry and then it just disappears. I know they were supposed to be an on-again, off-again type of thing but if was almost like reading about two different Riss/Scott sets because the characterization was just so inconsistent.There are a couple other minor quibbles. All the characters' names are shortened from their originals (Riss was Marissa, Ness for Vanessa, etc) which was just weird and unnecessary. Lots of other terms are abbreviated too; like weapons are Weps...at one point there was a sentence with at least three acronyms in it, it sounded awkward and not at all like the way someone would really describe something.The story was pretty well wrapped up, leaving just a couple threads dangling for the next book. Will I read the next book? I am not sure, this book just could have \"first book in a series syndrome\" and with more experience the writing and world-building might improve.I read a ton of urban fantasies and so I was eager to like this one. Unfortunately the unfocused, fractured writing and the unrealized world just turned me off some. It is a really a pity because I love the idea of a mythology based urban fantasy and I really loved some of the things the author did with the characters' powers. This book gets just barely an okay from me. There are much better series out there to read. Try October Daye series by Seanan McGuire, the Jane Yellowrock series by Faith Hunter, or Jaz Parks series by Jennifer Rardin...all of these series are better than this one."}, {"userName": "Aleksandra", "userReviewDate": "Mar 22, 2013", "userURL": "http://www.goodreads.com/user/show/6777483-aleksandra", "userReview": "Dosta mi je više ovih heroina koje moraju da spasavaju ceo svet, nikad ne spavaju, piju kafu na litre i ne funkcionišu bez nje- tata ili mama su neke opasne face a one su ni tamo ni ovamo(roditelji nisu u celoj priči zato što su umrli nekim nesrećnim slučajem)...Da ne pominjem da uvek izvuku deblji kraj jer nemaju pokriće za aroganciju i glupavo ponašanje pa su uvek u zavojima i ranama koje nemaju vremena da leče, jer su do sad vodile miran život, a onda im je odjednom nešto upalo u stan i odnelo vrata ili prozore...Naravno, ne smemo da zaboravimo mušku polovinu koja je obično povučena ali neverovatno seksi i pametna...na kraju obično umire i ostavlja nam jadnu heroinu trudnu, ali nemojte očajavati, uvek ima dovoljno dobrovoljaca da joj prave društvo...DOSTA VIŠE BREEEEEEEEEEE!!!!!!!! -_-"}, {"userName": "Aki", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/5343057-aki", "userReview": "I don’t understand— I really don’t.Is it a new writing fad to have characters and their actions make no sense?That’s how this book felt.NONE of the characters made sense. NONE of their actions made sense.And I was so looking forward to this book.DNF’ed @ less than 50%."}, {"userName": "Ithlilian", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/4793655-ithlilian", "userReview": "Forgive me if this review contains some ranting. Red Hot Fury started off on a bad note for me. The main character instantly comes off as an irritated cop. There is entirely too much slang and attitude in the first few pages. Complain, complain, give someone attitude, yell at someone, attitude, attitude, complain. Needless to say, the main character Riss got under my skin from the start. I got past it and started to be interested in the mystery. A thought to be extinct group of paranormals turns out to be alive and part of a breeding program. Riss meets up with her ex, fights with him a lot, and works on solving the mystery. The culprit is pretty predictable, and the storytelling here is as flawed as the main character. The mystery solving is slow, and most of the novel is comprised of characters going from place to place getting into groaning matches with each other. The main character and her ex bicker constantly, no one seems to get along with each other, and honestly it was physically irritating to read. I wanted to grind my teeth and throw something numerous times.The world building is a bit sketchy as well. We get a history lesson from our main character about some of the paranormal beings (arcanes) but nothing is explained completely. I don't necessarily like being told every little detail about every single race, but throwing them around haphazardly and hoping the reader figures it out isn't good enough either. There was never, hello reader, I am a fury and I have the following abilities. Instead it was \"oh by the way look at this blue stuff I can make\" halfway into the novel. I'm also not sure if furies by nature are mean, rude, obnoxious, and generally unpleasant, or if that was just the main character. She gets mad over EVERYTHING. That may be part of the nature of a fury, and if so I really don't see how that is supposed to be appealing.There is one thing that made me almost stop reading this book more than any other, and it is the dreaded \"but wait, that would mean...no it can't be.\" Let me explain. When Riss is trying to figure out what type of being Mac is she sees that his eyes are green, almost comes to a conclusion, and then says no it couldn't be. Obviously, the author is trying to draw our attention to this fact. If Riss would have said he had green eyes, I would have read right past it and not though about it. Instead she draws our attention to it, says it must be impossible, and I instantly figure it out. I don't like figuring things out only to have them revealed to me later like they are some big secret. It happened again toward the end when the traitor is being discovered, but I won't get into that one. Hey, was that Colonel Mustard leaving the conservatory? What's that in his hand? A candlestick...but that would mean...no it can't be.In summary, Red Hot Fury has irritating characters, a barely passable mystery and plot, bad world building, and constant bickering. Just because this book has a main character that is not your typical vampire or werewolf does not mean it is unique or interesting. Also, frequent cursing, an atrocious attitude, and a short temper, does not make a character tough and is not appealing in the slightest."}, {"userName": "Kt", "userReviewDate": "Oct 04, 2011", "userURL": "http://www.goodreads.com/user/show/3681846-kt", "userReview": "Review originally posted on my blog: A Book Obsession..Marissa's duty as a Fury is to solve supernatural crimes and hold the fragile peace between humans and the Arcane. As the chief magical investigator for the Boston police department, she takes all the strange calls. Her latest case hits too close to home when her dead Fury sister washes up on the shore. But things aren't as they seem and she quickly finds herself suspended for sticking her nose too far into things that someone would rather keep covered up. As the heat picks up, the only person she can trust is her ex, Scott a shape-shifting Warhound. But they didn't exactly part on the best terms, and getting his help may just take a miracle. Groveling doesn't come easy for this Fury.I absolutely love Riss's character. She is so incredibly passionate about everything, and I'm not talking in a sexual sense. (Although there are some steamy scenes.) All of her emotions are so intense it is like she is at full throttle 100% of the time, be it in anger, love, or a single minded need for revenge. Some may see this as a flaw, but I really loved it, even when she fanned her own ego as I didn't get the conceited vibe from it. This passion makes her rather reckless and apt to leaping before she looks, but nothing can be said against her loyalty to her sister Fury. I will say that as the book progresses she seemed to make an effort to slow herself down just a little in order to make better decisions. I loved the romance aspect of the book even though it played a much smaller part. There was so much sexual tension between Riss and Scott that they practically sizzled. But don't expect an easy road as there is so much hurt between them as things ended very badly in the past. There is so much anger between them, especially as Riss lets her Fury sparks fly. However, even as they both resent the situation that forced them together again, the connection between them is apparent from the very start. Honestly, I'm a sucker for past loves reuniting, even if it is under less than favorable circumstances, so this only added to my enjoyment of Red Hot Fury.Not only is there an awesome narrator and a good romantic subplot, Red Hot Fury features a really incredible mythology. There are Furies, Harpies, Shifters, and a plethora more of supernatural creatures that live in the modern world. There is a very fragile peace between them and humans. The tension is absolutely palpable as the Furies are the only thing keeping a full scale war from breaking out. So, if you like an action pack adventure featuring a kick butt heroine on a mission with a little slice of romance on the side, then Red Hot Fury is just the book for you."}, {"userName": "J'aime", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/2200613-j-aime", "userReview": "I chose this book because I love urban fantasy, and even paranormal romance when done well. Unfortunately, I think this book was just trying too hard. I felt like the entire beginning of the book was screaming \"see, look how original my world is!\" by throwing descriptions at the reader. When, it fact, most of the elements were taken from other popular urban fantasy series. Jim Butcher, Kim Harrison, and Marc Del Franco have already done most of what's here including: 1) the uber-powerful Council of Wizards, err, Elders, that won't intervene 2) an accord/treaty between supernaturals and non 3) a hero/ine working with the mortal police on supernatural matters 4) even the gangster who's bad but necessary to the case (Marcone, Trent, Carrington). Plus, I think I may be bored with the kick-butt heroine who is, once again, being set-up as part of a massive conspiracy and has to go to her scorching hot ex that she is still in love with for help. This is where I feel Red Hot Fury veered into paranormal romance rather than being the urban fantasy it is billed as. In the middle of crisis, she's thinking how sexy his voice is? Leaving her sixteen year-old niece to run for the car while she rushes to save him in a fight? It just didn't work, for urban fantasy or para romance. Lastly, the character development is weak. Everyone comes off as a cardboard cut-out, even Marissa. So, why did I give it three stars?The book got an extra star for the creation of Furies (based somewhat on valkyries and the like), with their living tattoos. It's tough to invent, or reinvent, a supernatural race that hasn't been done to death before. I liked how Furies come into being, their powers, wings, etc. All would make for exciting material, if executed better. Not every urban fantasy series has to have earth-shattering conspiracies that could doom the human race. Why not someone secure in their role, with an established relationship, solving crimes? Why does a heroine always have to be a b!tch? This wasn't a bad book, especially for someone who is looking for paranormal romance, or just getting their feet wet in urban fantasy. However, for avid readers of the genre, this just wasn't up to par. I don't think I'll be back for more."}, {"userName": "Shelley", "userReviewDate": "Sep 15, 2010", "userURL": "http://www.goodreads.com/user/show/3081722-shelley", "userReview": "Riss is a Fury, which means if you are a bad guy, you wouldn’t like her when she’s angry.Riss has people after her, loved ones betraying her, and an ex who might be more.Storyline: As a Fury, Marissa Holloway belongs to an Arcane race that has avenged wrongdoing since time immemorial. As Boston’s Chief Magical Investigator for the past five years, she’s doing what she was born to: solving supernatural crimes.It’s far from business as usual when the body of one of Riss’s sister Furies washes up in Boston harbor. Riss discovers that the corpse’s identity has been magically altered, but as soon as she reports her findings, she’s immediately—and inexplicably—suspended from her job. Then a human assassin makes an attempt on her life, and Riss starts to realize that someone may be trying to stir up strife between mortals and Arcanes.When a Fury gets mad, she gets even, and Riss is determined to untangle this case. Without the support of the mortal PD, Riss turns to the one man she can trust to watch her back—shapeshifting Warhound Scott Murphy. But since Scott is also Riss’s ex, she’ll have to keep a tight leash on more than just the supernatural rage that feeds her power as they try to solve a murder—and stop a war.Riss lives in a very complex world populated by numerous members of the arcane that includes Furies, Harpies, Warhounds, Fae, Phoenixes, Giants, Sidhe, Cats, Oracles, Druids, Witches and Goblins. Not to mention normal and not so normal humans – all of which have their own magical powers and/or skills that they brought to help or hinder Riss’ investigation.If you're looking for vampires, or werewolves, and Fae, don't read this book. You'll be sadly disappointed. If you're looking for a new UF novel with a hint of romantic interests with the main character, there is a hint but that's all. This is the first novel, and of course, experiences some hiccups as such. The writer uses references from the Greek, Roman, Celtic and Eqyptian mythology in order to tell this story. I liked the book, but, hope the next release is better. Green-Eyed Envy releases June 28, 2011"}, {"userName": "Kim", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/7912153-kim", "userReview": "I'm not sure why this book got such a low rating by reviewers. I can think of several that had an over 4 star rating that sucked.The storyline is very original. I can't ever remember reading a paranormal book that had a Fury as a main character, along with a Warhound. That within itself made it interesting. I did know who the bad guy was going to be, that was pretty obvious throughout most of the book. But I was surprised about Mac. I actually ended up liking that surprise. The dynamics of both families were fun to read about.I liked the characters individually. Marissa is a tough as nails Fury. She works for the norms as Boston's Chief Magical Investigator making sure the arcane stay in line. Scott is her Ex boyfriend that comes from a family of Mercs. He also just happens to be a Warhound. I enjoyed the dynamic between both characters, but I hated how stupid both could be when it came to each other and their relationship. It's always hard for me to believe that people on general can be that stupid when dealing with people we love, so when I read this kind of crap in a book, well it just doesn't jive.Out of everything tho, that is my only two gripes. Even the supporting characters I really liked. Mac was a great character that ending up having a very interesting story. (Trying not to spoil) Trinity was also a fun edition. Even Riss' brother and niece added something to the story.At any rate, I liked this book and will definitely be reading the next in the series. 4 stars"}, {"userName": "(Tori-Smexybooks) smexys_sidekick", "userReviewDate": "Jun 07, 2010", "userURL": "http://www.goodreads.com/user/show/3094317-tori-smexybooks-smexys-sidekick", "userReview": "Favorite Quote: \"You want one of your own don't you?\" \"One? Riss, I'm a hound.\" \"Oh gods...you want a litter?\"Marissa Holloway is a Fury and has worked as the chief magical investigator for the Boston PD for over five years. She had no idea that the murder scene she had been called to will end up changing her entire world in one brief second. Once she determines that a corpse's identity has magically altered she is suspended from her job, a mortal assassin tries to kill her, and she becomes the key player in the beginning of a war between the mortals and the arcane.A magical race that avenges wrong doing in the magical world, Riss is called to a crime scene that shows one of her sisters murdered. But further analysis shows it is not a fellow Fury but a nody just made to look like her. When Riss goes back to the office she is inexplicably suspended and an assassin tries to kill her. After convening with the Fury elders, she finds herself on her own with no back up and no clues. So she does what any self respecting woman would do...she contacts her ex.Scott Murphy is a man of many things. Warhound, bodyguard, merc, and until recently, Riss's boyfriend. But that's all in the past and now Riss needs protection. When Scott and Riss begin to investigate they find a shocking conspiracy.. Someone is kidnapping arcane beings and experimenting on them. And no one is who you think they are. Read more of my review at Smexy Books"}, {"userName": "Kelcey", "userReviewDate": "Sep 13, 2015", "userURL": "http://www.goodreads.com/user/show/16060470-kelcey", "userReview": "3.5 StarsWith urban fantasy, it can be easy to fall prey to stereotypes. In this book, I feel that the author was trying to fight stereotypes on every front. First of all, this is the first book I have read with the main character as a Fury. Secondly, this book heavily mixed science fiction into the urban fantasy genre. The blend was interesting to say the least but I also can’t say that it really worked for me either. The science heavy parts relating to extinction and cloning were a little confusing and either way, mostly boring. I really did like Riss, she was sassy, brutally honest, and witty but very aware of her own imperfections.I’d spoken aloud without thinking again. That had a grin spreading across my lips…Furies are not characters that even show up that often in fantasy, urban or otherwise so it was great to see an unusual main character (other than the standard vampire, mage or shape-shifter). The detail and set-up for the whole race and situation was pretty good, loved Nike and Nemesis, even if the war history part of the plot was a bit hazy. There were some great Greek history references to bolster the whole plot and concept of the Fury as well (character names and the Oracle race come to mind immediately). The history between Scott and Riss was a little weak and I didn’t feel that connected to their story as a couple. Overall I enjoyed the story and characters. I wouldn’t turn down the sequel but at the same time, I don’t think I will be actively seeking it out at this moment."}, {"userName": "Stacy", "userReviewDate": "Oct 04, 2010", "userURL": "http://www.goodreads.com/user/show/3864002-stacy", "userReview": "Review posted at http://urbanfantasyinvestigations.blo...This is the first book in a brand new series by a brand new Author and WOW was it great. Marissa (Riss) is a fun, sexy, independent Fury who works with the Boston PD as there Chief Magical Investigator and someone is trying to kill her at every turn she takes. Riss is called to a murder scene to find that the victim is her missing Best friend who has been gone for years and then discovers that it isn't her body at all just a double made to look exactly like her. This leads to her investigating the whole thing which sends a group of bad guys after her that want her dead before she figures out their secret. Scott Murphy Riss's Ex is a shapeshifting Warhound (kinda like a private Eye/bodyguard) who is smoking hot and goes along for the ride. I thoroughly enjoyed Red Hot Fury, I thought the whole concept of the book was fantastic. There is tons of action and mystery to keep you interested. There isn't a ton of romance in here but there is some high sexual tension at some points. All in all a great start for Kasey Mackenzie."}, {"userName": "chucklesthescot", "userReviewDate": "Feb 09, 2011", "userURL": "http://www.goodreads.com/user/show/3426724-chucklesthescot", "userReview": "It was the vivid colours of the book covers that first caught my attention and having a story with an MC that was a Fury seemed different from the other books that I had read in the genre. I was certainly intrigued. Riss was interesting and when she was in kickass mode, I liked her. I thought that it was going to be a good book as I liked the beginning but as soon as we got to all the angst with her ex and his brother, it turned into every UF book I haven't enjoyed with a whiny MC and a lacklustre romance element that failed to work on any level. It was such a pity because I felt that there was real potential with Riss but instead of a creative novel, it seemed the writer chose to go into paranormal romance cliche mode and all originality went out the window. Bummer!"}, {"userName": "Diane ~Firefly~", "userReviewDate": "Jun 29, 2010", "userURL": "http://www.goodreads.com/user/show/3264885-diane-firefly", "userReview": "It was a 3.5 star read but got the extra half star for having some unusual paranormals (furies, harpies, giants, warhounds, etc), which was a nice change. Good story. I liked the heroine and hero as well as the assorted supporting characters. Very interesting world that I'm looking forward to revisiting soon. I did figure out who the bad guy was way before Rissa, but I figure she was just too busy staying alive to have the time to think about it."}, {"userName": "Cris", "userReviewDate": "Sep 04, 2010", "userURL": "http://www.goodreads.com/user/show/1449734-cris", "userReview": "It took me a while to get into the story, although I'm not sure exactly why. The world is unique and imaginative. The characters are well-drawn. Some of the plot-twists took me by surprise, some of them I saw coming well ahead of time. Overall, a good debut novel.I'll probably read the next book in the series."}, {"userName": "Samantha (Book Lover's Cozy Cafe)", "userReviewDate": "Jun 29, 2010", "userURL": "http://www.goodreads.com/user/show/2525839-samantha-book-lover-s-cozy-cafe", "userReview": "never have I read a book about a fury in all my days of reading, so I t a little hesitant about it first. but reading through the first few chapters It really grasped a good hold on my attention, and I took every possible chance I could get to read this. And at the end I was a little upset that the book was over."}, {"userName": "Rosalind M", "userReviewDate": "Jul 01, 2010", "userURL": "http://www.goodreads.com/user/show/1325061-rosalind-m", "userReview": "Apparently, I'm really not too fond of the core personality of Furies. The concept was intriguing, and I enjoyed learning about the other arcane races, but Marissa's behavior and reactions grated after the first three chapters. I'm not keen on Donald Duck's behavior either, so don't take my word as platinum."}, {"userName": "Daffodil", "userReviewDate": "Mar 16, 2017", "userURL": "http://www.goodreads.com/user/show/3596317-daffodil", "userReview": "[The betrayal could have carried more shock value, but it was too easy to identify the mastermind behind everything.  (hide spoiler)]"}, {"userName": "L.A.L.", "userReviewDate": "Aug 16, 2013", "userURL": "http://www.goodreads.com/user/show/757532-l-a-l", "userReview": "I wanted to like this book, as it had a great premise, particularly because there's not a lot out about furies, especially as a main character. But this book just fell flat. So much so, I really had to push myself to finish it just to find out who was the ultimate baddie. Sadly, I say save yourself the trouble. First, the writing was disjointed, and in many places, sounded very juvenile. First person narration can be tricky, especially with providing background and world information. This book clearly demonstrates the pitfalls of first person narration. Too much glossing over, too many assumptions, and the reader is left a bit confused as to why this world is as it is. Then many names and words were shortened (weps for weapons) for no apparent purpose. It didn't add to any one character's personality, as they all seemed to do it one time or another, and sounded rather dumb and awkward in places. The writing was disjointed enough that I ended up skimming most of the last half of the book. The characters, particularly the main character Riss (short for Marissa, which you don't learn until later), all felt very one dimensional to me. Riss was too wishy-washy: a take no prisoners bad ass investigator one moment, then a whiney juvenile the next. While the author tried to explain this away to the fact she was a Fury, most of the time felt as if Riss was really two characters - either 100% bad-ass or 100% wimpy, and neither one had any depth. Plus, Riss didn't seem like she'd make a good investigator at all (so no idea how she had become Chief Magical Investigator), because most of the time she was too caught up in her own drama. Overall, Riss was just annoying. I couldn't like her, and her dialogue was awful. Then Riss's so-called romance with her ex Scott just had no oomph. The character of Scott was rather meh, and I really didn't understand why he would want to be with her. There was no heat in the \"steamy\" scenes between them. The apparent sexual \"tension\" was flat, flat, flat. And after setting the story up that Riss was in the wrong as to why she bailed (in high drama), there's a big scene where *he* apologizes to her. It made no sense. As for the other characters, many were almost pointless. The author sets up potential issues/conflicts, such as the one between Riss and Scott's little bro Sean, but then Sean simply disappears. This happened to several other characters. Major issues with Ellie were alluded to more than once, but never developed. Ellie continued to be there, but was pushed into the far background. So conflict was alluded with several characters, but then that character disappeared. If they returned, there was no mention of aforementioned conflict. I don't know if this was because the author ran out of time, the conflict scenes were edited out after the fact, or there is an intent to discuss it in future books. But it came across as if these alluded conflicts were simply dropped, which made no sense and seriously detracted from the overall story.As for the plot and the storyline. The descriptions focused too much on inconsequential areas and not enough on the places that were important. The background story (the war between arcanes and humans) was weak, almost as if it really wasn't thought out, The background seemed more created as the story went along to justify the current plot, which made it inconsistent and fall apart in some places. The description of the world and why it was the way it was (arcanes vs. mundanes) was rather glossed over, as if the reader should simply know the various races, their powers, and the dynamics between them all. Many places it was difficult to understand. Overall, I felt the background and description of this world was unfocused, disjointed, and slapped together just to support the plot - all of which contributed to it falling flat. While the plot was intriguing, there were too many holes, too little explanations on key points. Combined with a fractured background story, a weak world description, the book just failed."}, {"userName": "Jazz", "userReviewDate": "Apr 22, 2012", "userURL": "http://www.goodreads.com/user/show/6416619-jazz", "userReview": "[ He would have been 16-17 when he met Ellie, and probably married her when he was 17. And where did he get the maturity of a 30 year old, some magic place?  (hide spoiler)]"}, {"userName": "Angela", "userReviewDate": "Sep 19, 2010", "userURL": "http://www.goodreads.com/user/show/4255477-angela", "userReview": "Marissa Holloway, Chief Magical Investigator for the Boston Police Department has spent the years since fully coming into her Fury birthright maintaining the peace between the arcane and the mundane of the world. Usually by solving supernatural crimes, more specifically murders. When she's called to the site of a murdered sister-Fury, only to discover the body isn't who she's supposed to be, things get crazy in a hurry. Suspended from her job, Riss finds herself on the run from enemies she didn't know she had. Unable to trust almost anyone, Riss turns to her ex, Warhound Scott Murphy, to help her solve the mysteries that just keep piling up on one another. But with the protection Scott can offer comes a resurgence of feelings between them. Riss'll have to keep a tight hold on not only passion, but her Rage in order to solve the case, and stop an impending war. I went into Red Hot Fury excited and interested in the world that Kasey Mackenzie created. Her main protagonist is a Fury, a rarely written about character from mythology. Ms. Mackenzie continued to do this, drawing from not only Greek and Roman myths, but others - including Irish and Egypitian. When the Bastai showed up (Cats from Egypt's goddess Bast) I was ecstatic. Red Hot Fury maintains a furiously (ha) fast pace. The storyline moves along quickly, leaving you gasping for breath from one thing before plunging you headlong into the next. There are numerous action sequences which are very well-written and vivid. Unfortunately the concept and fast pace weren't enough to make this novel great. While the plot hurtled along, at times it felt like it was doing so to cover up some very incomplete world building. There were gaping holes in how the arcane, magical beings, interacted with each other, the mundanes (humans) and their powers. For example, while I have a good idea that furies can shape-change into a variety of forms, I have little understanding of each of them. I think there are three main forms, but I'd be hard pressed to describe any of them except full-Fury. I truly liked Riss. She's an interesting character to read through which is especially important in a first-person POV novel. She's sassy, caring and smart-assed, with just a touch of naiveté thrown in there to round her out. However, she never felt completely real to me. I didn't understand some of her thoughts or emotional processes. Sometimes I felt like her inner thoughts didn't match her outer actions, with no reasoning given for that discrepancy. All of the other characters in the novel suffered because of the first-person POV. It was hard to get to know any of them well or understand their motivations. More than once I wanted to just jump into Scott's head and find out exactly what he was thinking. Ms. Mackenzie has a great idea that I would love to see expanded and built upon in future Shades of Fury novels. However, in the end, despite this intriguing concept, Red Hot Fury didn't live up to what I was hoping for. Still if you're looking for a fast-paced, action-packed novel with a fresh, new subject, then Red Hot Fury is definitely for you!!"}, {"userName": "Jessica (a GREAT read)", "userReviewDate": "Aug 15, 2010", "userURL": "http://www.goodreads.com/user/show/3549629-jessica-a-great-read", "userReview": "Finally finished Kasey Mackenzie's Red Hot Fury and it was awesome!! Was curious about this book when I saw the cover and found out that she was a local author! And plus the storyline sounded interesting. I love Greek mythology and found out that the Furies here are Roman based, as Greek and Roman mythology tend to be somewhat similar, but with differences. So I was all over this book from the moment I read all about this!It wasn't a letdown either! It starts off right away with Riss finding the body of her sister Fury, but as the BOC says magic is involved, leading the body to only look like another Fury when really something else is going down. Way down.The pacing of this book was just marvelous! I mean there is a definite mystery to solve here, but Riss is thrown off the case moments after it begins! Then there's the assassination attempt and Riss is forced to seek outside help. Of course the only person she can trust is her old lover and Warhound Scott Murphy. Hence more troubles begin.Riss and Scott's actions can be a little predictable, but it's not a bad thing really. It doesn't detract from the writing. Tensions definitely run high between the two as they are forced to work together. And it doesn't help that Scott's younger brother, only by a few years--can't remember the exact difference, has a crush on Riss. And he's not too bad looking either! Not to mention that other members of the family aren't too pleased with her. Fun times all around!There are a lot of twisted secrets involved too! It was great watching them all develop and reveal themselves in the end. I sort of took a guess to a part of the outcome, like the who-done-it, but never really made it my official guess. So take that as you will! I like trying to guess the who-done-it bit, it can be fun and really challenging because some times I sooo don't see it coming! This time I was mildly prepared, but not entirely.That being said, there is a lot of action to the book as well. Riss gets herself into a lot of trouble. But luckily she has great friends to help her out. Her partner on the force also joins in with her supernatural crew. In this book, the world knows about supernaturals, Riss's job position is proof of that as well, being the Chief Magical Investigator. It's refreshing some times to be in a setting where everyone knows about supernaturals, that way there is no need to have to convince others of their existence, they just know. But the opposite can be good too.I loved this book. As I said I love Greek mythology and Roman as well, so I loved the little bits of mythology that Mackenzie used in the novel. There was a reference to the Orpheus myth as well. There were also Harpies as well as Furies. It was just awesome!There was a little bit of romance in the story as well. Not a whole lot, but there's enough romantic tension between Riss and Scott to build up. Won't go further then that on that part of the book!Overall I give the book 5/5 stars! It was a really amazing read! A GREAT one too! Kasey Mackenzie is definitely making my author list and I am now addicted to her series. Looking forward to more from her soon!"}, {"userName": "Torzilla", "userReviewDate": "May 20, 2010", "userURL": "http://www.goodreads.com/user/show/3322973-torzilla", "userReview": "Here's another book I tried incredibly hard to finish. If you don't believe me, you can ask Book Dragon, who was my texting victim throughout this endeavor.RED HOT FURY started off well enough. The heroine, Riss, was a bit quirky, but in a good way. I was interested and wanted to learn more about this unique character (who is a Fury, by the way).But then something started to happen... as it always does.As the story progressed, I began to realize that, despite the kick ass cover, RHF was not going to be a dark and gritty story. Yes, there were plenty of fights, and yes, emotions were definitely frayed, but I never felt like this book touched me in a dramatic way. If anything, it seemed more emphasis was placed on the lighthearted situations and everything else was brushed off sooner rather than later.It's not necessarily a bad thing, but if I'm expecting a dark and gritty urban fantasy, I sure as hell don't want to read a book where all the characters are getting wishy washy and angsting over the little things (as opposed to the bigger threat). What's even more unfortunate is the fact that, despite how lighthearted RHF seemed to be, there was no humor or anything to truly keep me engaged for long. Now don't get me wrong: there was drama--and plenty of it--but it was melodramatic in my eyes. What made this book so unrealistic, and what ultimately made me give up, was the fact that the characters accepted certain events way too easily. No spoilers from me, but if something that should be a huge plot twist doesn't even make the reader blink, then what's the point? If the heroine doesn't angst or rebel, and if all she does is shrug and accept both the people and situation with open arms, why should I care?There were just way too many instances of Riss and other characters either being shocked for a page and then accepting the things that happened, or they simply did not react at all. I don't need a book to be filled with angst, but if the one thing the heroine seems to obsess over is a dysfunctional relationship, then I'm not going to be interested for very long.Another thing that seemed contrived was said relationship with Riss and her ex. I felt no chemistry between the two, and genuinely wondered how they ever put up with each other. How were they still attracted to each other after so many years?After reading 3/4 of RED HOT FURY, I had to DNF it. One can tell that this is a debut novel, and while I generally try to be open-minded about plots and characters and the like, I could not shrug off how easily the characters accepted certain things.That is not to say that RED HOT FURY was a horrible book; I was able to read a little bit more than 3/4 of the book, so it's obvious that Kasey can write. While this series may not be for me, I am looking forward to seeing future series."}, {"userName": "Marsha", "userReviewDate": "Jun 09, 2012", "userURL": "http://www.goodreads.com/user/show/1991207-marsha", "userReview": "(3.5 Stars) \"Red Hot Fury\" is a difficult review for me to write because there were so many things I liked about the book and quite a few things I did not like. First, let me say the story line is unique in that it deals with one of my favorite genres mythology. Our main character, Marissa Holloway is a Fury and Chief Magical Investigator whose job is to avenge crimes against the supernatural. She works within the police department in a position that was set up after a war between the arcanes and the mortals.When a body mysteriously washes up on a beach and looks almost identical to Riss' missing best friend and fellow fury, Vanessa she vows then and there that she will not stop until she discovers what happened to her friend. For years believed that Vanessa was kidnapped and possibly murdered by her stalker ex-boyfriend, Dre. But, now that scenario no longer seems likely. When Marissa begins investigating, she is suddenly relieved from duty and immediately under attack causing her to go to the one person she knows she can trust, her ex-boyfriend, Scott Murphy.Scott and Marissa have baggage that they have to work through; however, when it is revealed that Scott's sister is also missing as well as people from various supernatural species it is clear that they must work together. What they find may very well be the beginning of a new war between mortals and arcanes.The concept for this story is very creative; however, I had problems with the execution. The action grabs the reader from the very beginning; but, the characterizations were weak and I found myself questioning whether or not I even liked our herione at all. Ms. MacKenzie rushed her descriptions of the characters to the point that initially I was not emotionally invested in them. Fortunately, the book began to get better after the first 80 pages or so and I had a better understanding of Marissa. The other thing that truly bothered me was how the author gave nicknames to almost every character: Riss/Rissa, Dre, Ness/Nessa, Trin, Mac......and so on. I found myself saying enough is enough already. I guess my biggest problem with the story is that the author attempted to cram too much into the first book at risk of minimizing great world building and characterizations. The story was great, the characters were okay, the world building was okay and the sex was okay (Now, that is just sad...shouldn't the sex be hot?!).On a positive note, the action scenes were good, the plot was some surprising twists and turns, the whole fury concept was great and the resolutions to some of the mysteries was great. When I first purchased this book I also purchased the second and third books as well. Now that I have a better understanding of the overall concept, I am hoping the other books in the series will not suffer from the same things I objected to in this first book. Only time will tell."}, {"userName": "Mishel Forte", "userReviewDate": "Mar 10, 2010", "userURL": "http://www.goodreads.com/user/show/2758235-mishel-forte", "userReview": "My rating: 4/5 starsMarissa \"Riss\" Holloway is part of The Sisterhood of Furies, an ancient Arcane race, who are born to protect immortals and mortals from those who would use magic to harm them. Riss has been the Chief Magical Investigator for the Boston Police Department for the last five years. But little does she know that the newest murder scene she is called to will pretty much flip her life upside down. The victim is a sister fury (and very close friend) which is already bad enough, however Riss notices that the body has been magically altered. As soon as she reports her discoveries though Riss is immediately suspended with no real explanation. Soon after her suspension an assassination attempt goes down which only angers Riss more. Not only is she jobless but now a human has attempted to kill her, what the hell is going on in the world? Riss is determined to solve this case and figure out what's going on. However she has very limited resources, and she'll have to rely on the one (and only pretty much) man she can trust with her life... who just happens to be her ex-lover. Scott is still sexy as ever and still hurts from the break up he had with Riss. Being a shapeshifting Warhound with a fiercely loyal family that still holds a grudge against Riss certainly doesn't help her case. But things are so much bigger than the two of them and their problems. Can Scott and Riss put aside their past and their still-strong-as-ever attraction towards each other to prevent an all out battle between mortals and Arcanes? The best thing about the novel for me were the plot twists. There might have been a little too much packed into the first book but I have to admit that by the end of the book I was hooked. I enjoyed the suspense that the author provided. I also really loved the characters. There are typical good guys and bad guys in the novel but I so enjoy when more light is shed on the villians and they sort of ride the good/evil line. I couldn't really relate to Riss in the beginning. She's a very kick-ass heroine but not really a favorite of mine. I'm hoping she'll grow on me more as the series progresses because I want to like her more. I gotta say Red Hot Fury brings a nice, fresh, and unique twist to the urban fantasy world. The author has entertwined a lot of different (and not frequently mentioned) immortals into her story and its a great change in the vamp/werewolf/zombie scene. This first-in-series is a strong debut that definitely promises exciting and great things in the books to come. Red Hot Fury has a lot of action, a lot of characters, and is fast-paced. I found myself a little lost at times, especially at the beginning. But I definitely enjoyed the ride and I can't wait for the second book in the series."}, {"userName": "Amy", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/34226727-amy", "userReview": "I enjoyed the strong female lead. Very likable story."}], "description": "View our feature on Kasey Mackenzie’s Red Hot Fury.Introducing a sizzling new urban fantasy series featuring Marissa Holloway, an immortal Fury who doesn't just get mad...she gets even.   As a Fury, Marissa Holloway belongs to an Arcane race that has avenged wrongdoing since time immemorial. As Boston's chief magical investigator for the past five years, she's doing what she was born to do: solve supernatural crimes.  But Riss's investigation into a dead sister Fury leads to her being inexplicably suspended from her job. And to uncover the truth behind this cover-up, she'll have to turn to her shape-shifting Warhound ex for help.", "title": "Red Hot Fury\n      \n          (Shades of Fury #1)", "url": "https://www.goodreads.com/book/show/7094592.Red_Hot_Fury__Shades_of_Fury___1_", "average": 3.57, "cover": "https://images.gr-assets.com/books/1390082715l/7094592.jpg", "reviews": 148, "authors": [{"url": "https://www.goodreads.com/author/show/3153783.Kasey_MacKenzie", "name": "Kasey MacKenzie"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Romance", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/7094592-red-hot-fury", "http://www.goodreads.com/book/show/8515764-green-eyed-envy", "http://www.goodreads.com/book/show/12552364-blackhearted-betrayal", "http://www.goodreads.com/book/show/23515058-reborn-in-fire", "http://www.goodreads.com/book/show/23905411-where-angels-fear", "http://www.goodreads.com/book/show/23630364-white-knuckled-fear"]}