{"ratings": 23606, "userreviews": [{"userName": "Frances", "userReviewDate": "Oct 02, 2016", "userURL": "http://www.goodreads.com/user/show/37439004-frances", "userReview": "Born into a left-wing family in America, Bill Browder attended a boarding school where he became quite rebellious and very unsettled. Not happy with his home life he made the decision to become a capitalist knowing that it would surely upset his parents. However, once he settled down with his studies he was soon accepted into Standford University and on his way to becoming everything he ever wanted to be. By becoming the largest foreign investor in Russia running his own investment firm, he went well beyond his aspirations. Flying back and forth between London and Moscow for several years all seemed to be going to plan. However, something changed quite dramatically that would forever transform his life. Completely blindsided by top Russian officials he had no idea the tremendous fight he would face to secure his company, keep the wealth it had created, and protect his associates. Author, Bill Browder pulls no punches in this true story of his rise as a prominent investor in a country that essentially does what it wants with no repercussions whatsoever. Red Notice is powerful, and undeniably a riveting story. Mr. Browder possesses a high sense of integrity with a great deal of compassion, and is very brave to try and make his story heard around the world. Highly recommended!"}, {"userName": "Esil", "userReviewDate": "Jun 18, 2015", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "3 1/2 stars. I listened to the audio of Red Notice. It was fascinating and I have no regrets about listening to it, but there were a few things that grated on me enough to knock off a 1/2 star from what would otherwise have been a solid 4 stars. In Red Notice, Bill Browder recounts his involvement in the world of high finance in Russia, events which ultimately led to the arrest, torture and death of one of his lawyers, and which transformed Browder from manager of a multi billion dollar investment fund to a human rights activist. Browder recounts this life journey in a lot of detail, describing his own background and the worlds in which he found himself. As a young graduate of the Stanford business school in the late 1980s, he decided that he would enter into the newly available Russian investment market. His strategy was to buy shares of under valued newly privatized companies, and to make them available to foreign investors. He made a tremendous amount of money for himself and for others, and he also made many enemies in Russia because he made so much money and also had a tendency to sniff out and call attention to serious cases of corruption. Ultimately, this success and bullishness led to his expulsion from Russia and to the torture and death of his lawyer who refused to provide false evidence against Browder and his fund. The Russia Browder depicts is corrupt and brutal, and part of his point is that things are not very different from the days of communism. I found all of this fascinating and chilling. I also have a friend who does business in Russia, who tells me that the world Browder describes is dead on. What irked me about the book was Browder's unabashed self-aggrandizement and lack of self reflection. There is no recognition that there was nothing noble about going to Russia in the early 1990s to capitalize on its newly open market, and that Browder's own troubles essentially come from his attempt to earn piles of money on the back of the Russians' lack of experience in a free market. The corrupt oligarchs and politicos in Russia have no higher moral ground to claim, but all involved -- including Browder -- were motivated by some pretty over the top greed. Again, it's an interesting book and it reveals a very chilling side of contemporary Russia, but I struggled to feel sympathy for Browder -- although I certainly felt a tremendous amount of sympathy for his lawyer and all who were physically threatened or exiled as a result of the events depicted in the book. A note on the audio: The narrator's voice is engaged and easy to listen to, but it does come across as arrogant which may explain some of my reservation about the book. The very last chapter is narrated by Browder himself, and I found his own voice much more sympathetic."}, {"userName": "Dem", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "Now this is an  explosive, revealing and  shocking read that had my complete attention from page one. Bill Browder's account reads like a thriller but its non fiction and is compelling reading for anyone interested in reading about High Finance, Murder and one man's fight for justice in modern Russia. image: \n November 2009 an emancipated young lawyer, Sergei Magnitsky, is led to a freezing isolation cell in a Moscow prison, handcuffed to a bedrail and beaten to death by eight police officers. His crime? To testify against the Russian Interior Ministry officials who stole $230 million of taxes paid by his employer, financier Bill Browder.\nThis book shocked me in many ways and it was such an eye opener, its well written, fast paced and informative. The account of Sergei Magnitsky's life and death is heartbreaking and Bill Browder's fight for justice for a man who wanted to right the wrongs and make his country a better place to live is honourable and commendable. I didn't particularly like the Bill Browder in the first half of this book as he got caught up in the greed and power of becoming the largest foreign investor in Russia but by the end of the book I had softened a little. I think he did an excellent job writing and exposing the criminal activities and the corruption of modern Russia. image: A 5 star rating from me as I just couldnt stop thinking about this book on completion and I have since spent quite a bit of time watching documentaries relating to facts and situations mentioned in this book."}, {"userName": "H Wesselius", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/5889085-h-wesselius", "userReview": "An interesting and entertaining read. Only marred by the self righteous tone of an author. Browder can't see beyond his own perspective. After cleaning out Russia by purchasing underpriced stock and turning it around for a quick profit. Once he achieved his millions he suddenly found a conscience. My sympathy lies with the Russian activists and people who've been wronged by both the oligarchs and the western businessman."}, {"userName": "Geza Tatrallyay", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/15921992-geza-tatrallyay", "userReview": "An excellent true account of the author's ups and downs as an investor in Putin's Russia. Along the way, he encounters brazen acts of embezzlement, theft and even murder by this lawless kleptocracy, losing his friend and lawyer Sergei Magnitsky to the agents of the 'rogue' state. A well-written gripping account; I could not put it down!"}, {"userName": "Hadrian", "userReviewDate": "Nov 19, 2017", "userURL": "http://www.goodreads.com/user/show/4100763-hadrian", "userReview": "The main lesson of this volume is the documentation of how far Russia has slid into kleptocracy, where the rule of law had become only a tool used to extort, to destroy, and to consolidate the gains of a select few. To recap - Russia around 1995-1996 was at a low ebb. President Yeltsin's popularity was at about 4%, and cabinet ministers and close family members were about to be charged with corruption. The economy was in dismal shape, and Russia would default on its debt by 1998. The Communist Party was expected to win the upcoming elections, and yet Gennedy Zhuganov had made assurances to foreign investors that he would not re-nationalize privatized property. Few believed him. Enter Bill Browder, grandson of the founder of the Communist Party-USA. He saw opportunity in the Russian market, from the tumult of privatization. Not the 'loans-for-shares' model, which was a disaster, but the relatively transparent process of 'voucher' privatization. Vouchers were issued to Russian citizens, and they were supposed to be exchanged for shares in privatized Russian companies. But these were given away or traded for goods much smaller in value. Browder was able to snatch these up at about $20/voucher. Now take some back of the envelope math - 150,000,000 vouchers produced, $20/voucher, and these were supposed to account for almost a third of the Russian economy. $3 billion. This meant that the early privatizers valued the entire Russian economy to be only $10 billion!He had made a bundle off of privatization in Poland, which was already on the up-and-up, but Russia was a more difficult point of entry. After obtaining $25 million in seed money from Republic New York and made his gamble. Then Yeltsin won in 1996, and the markets breathed a sigh of relief. While financially successful, Browder faced multiple challenges, including dealings with corrupt oligarchs, and then losing much of his fund's value in the 1998 default. Yet at the time, he still felt Russia was on an upward trajectory. Then came the election of Vladimir Putin in 1999, the muzzling of political opponents, and suspicious bombing attempts in Ryazan. Browder at first, was not concerned with this - he had made a massive fortune off of Gazprom. But then everyone was frightened by the arrest of Mikhail Khodorkovsky, one of the most powerful oligarchs. Browder is more right to speculate this was a major moment in the shifting of the balance of power between oligarchs and Putin - far from being a Communist ideologue, Putin demanded instead a large cut of their business as protection money. Browder, to his credit, saw the writing on the wall, and began moving his personnel out of the country. After refusing to pay a bribe to a KGB colonel, his offices were raided and their original titles and other documents were confiscated - and then took advantage of a law where the possessor of such documents has control over the company. He filed complaints and presented his evidence, only to found the official from the State Investigating Committee assigned to his case was the man he refused to bribe. By 2008, Browder had evacuated all but one of his staff - a lawyer, Sergei Magnitsky. He was arrested in November 2008, and found beaten to death in his cell in 2009. The rest of the book is dedicated to the 'Magnitsky effect', of bills passing targeted sanctions against high officials responsible for Magnitsky's death. The book ends with the passage of the Magnitsky Act in the United States in 2012, though similar laws have now been passed (as of this writing) in Estonia, the United Kingdom, Canada, and Lithuania. The virulent reaction to this law from the Russian government only confirms the nature of their regime.If nothing else, the story of Magnitsky shows the dangers of doing business with an openly thieving regime - and should raise suspicions in those countries who depend on a single Russian energy supply, or take in an excess of dirty money. The most egregious example may yet be Donald himself."}, {"userName": "Ctgt", "userReviewDate": "Jul 22, 2015", "userURL": "http://www.goodreads.com/user/show/3787451-ctgt", "userReview": "I was vaguely aware of this story as it related to Putin and his ban of U.S. adoptions of Russian orphans back in 2012 but never really knew the details.The title does a very good job of breaking down the arc of the book with the first section concentrating on Browder, his schooling and how he ended up in Russia. The most fascinating part was discovering that Browder's grandfather was the leader of the American Communist Party and ran for president on the communist ticket in 1936 and 1940. Both of his parents were academics and his older brother entered the PhD program in physics at the age of nineteen, Bill on the other hand, had little interest in academics and chose his boarding school based on his interest in skiing. He continued to rebel while in boarding school and his parents ended up sending him to doctors, counselors and psychiatrists.Then, toward the end of high school, it hit me. I would put on a suit and tie and become a capitalist. Nothing would piss my family off more than that.He still had an interest in Russia stemming back to his grandfather and through a series of jobs ends up in the wild west of the Russian conversion from communism to capitalism. For a time he and his Hermitage Group were the largest foreign investors in Russia. Then the story starts to turn as Browder and his employees discover and expose massive instances of fraud and corruption not only with the oligarchs but also in the Russian government. After a few early successes the tides turn and now he and his company start to be targeted by the police and various criminal elements. Browder himself is kicked out of the country and harassment of his employees still in Russia continues. In fact it increases to the point that several of his people have to sneak out of the country for fear of arrest. This whole section culminates with the death in prison of one of his lawyers, Sergei Magnitsky.Feeling crushed and responsible, Browder turns his efforts to seeking justice for the death of Magnitsky. The rest of the book follows these efforts.This was a very quick read for me, it was paced like a fiction thriller and at times almost brought me to tears as I thought about Mr. Magnitsky, what he went through in prison as the authorities tried to force him to recant charges he had filed against them and the courage to refuse to change his stance or supply false statements about his co-workers. It is heartbreaking to think about the hopes everyone had for Russia and to realize that after these past several decades, very little seems to have changed for the average Russian citizen."}, {"userName": "PDXReader", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/2140505-pdxreader", "userReview": "This book was a complete surprise to me. I thought that perhaps it would be dry, or more likely over my head because I know so little about the world of finance. Fortunately, my fears proved unfounded; the book was very approachable and entertaining. There are two parts to the author's story, both of which are equally involving but in different ways. The first 150 pp or so outline how Browder developed his business in Russia and he details his stunning wins and losses in a disarmingly honest and humble way. I found myself quite amused by his adventures and his straight-forward manner of story-telling kept me engaged. The second part of the book is much darker as he finds himself on the wrong side of some very powerful men - with truly heartbreaking results. The tragedy he feels partly responsible for turns Browder into a human rights activist as he seeks justice for victims of Russian human rights violators. His quest for retribution is equally engrossing."}, {"userName": "L.A. Starks", "userReviewDate": "Apr 23, 2015", "userURL": "http://www.goodreads.com/user/show/5159766-l-a-starks", "userReview": "This stunningly good book is authored by a world-class trader who, when he loses a friend to imprisonment, torture, and death from Putin's regime, goes all-out--slowly, deliberately--to avenge his friend. The trader is Bill Browder, the friend is Sergei Magnitsky, and the story is a true one. This makes the book more compelling than even the best fictional thriller. Putin's lack of conscience is no act, yet Browder describes a president and a now-secretary of state who naively want to pursue a reset with this coldest of killers.The only thing, and it is the most minor of points, is that Browder calculates Gazprom's natural gas value on a basis equivalent to oil, which it is not.Red Notice is a story of brave men and women acting honorably in a shifting, lawless country. It provides phenomenal insight into current-day Russia."}, {"userName": "Trish", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/1826682-trish", "userReview": "Bill Browder has a fascinating tale to tell, of his family background as the grandson of a noted Communist, of his math-whiz father and mother, of his physicist brother. He was the black sheep of the family…until he became a billionaire in his thirties by investing in undervalued Russian oil stocks. His first foray into Russia, to advise the Murmansk Trawler Fleet on privatization, must go down in the annals as a classic of West meets East. The whole story of Browder’s rise to wealth, with its moments of terrifying vertigo as markets collapsed with the Asian economic crisis in 1997, is propulsive and gripping. But more was to come, and no one could imagine the way the saga unfolded.A red notice is issued by Interpol for the provisional arrest and extradition of an individual for whom an arrest warrant has been issued in the requesting country. Russia requested a red notice from Interpol with regard to Bill Browder, charging him in absentia with tax evasion among other crimes, including the murder of Sergei Magnitsky, a Browder lawyer who perished in a Russian jail after medical interventions were withheld. This book tells the story of how Magnitsky’s oppressors became international pariahs, had their U.S.-based assets frozen and visas revoked or refused, a result of The Sergei Magnitsky Rule of Law Accountability Act passed in the United States in December 2012.Browder’s Hermitage Capital Management hedge fund still operates, though after his expulsion from Russia Browder was obliged to expand his investment purview, opening Hermitage Global which focused on emerging markets. Hermitage Capital Management almost from its inception was an activist fund which exposed criminal wrongdoing by majority shareholders in undervaluing or “stealing” company assets in order to allow profits to flow to corrupt bureaucrats and their businessmen partners. Browder would purchase a minority share in a [often large oil] company, and then expose how the shares were undervalued, prompting many investors to jump into the market for the shares, enriching Browder. One year Browder paid $230 million in income taxes to the Russian state on $1.3 billion in profits. It is just this sum which was later the subject of Russia’s state investigation.Putin and his circle including Medvedev are implicated in Browder’s story, though Browder shows how Putin was initially outraged at the theft of assets from state coffers, back at the beginning of Browder’s hedge fund successes. Actually, the whole setup—the issuing of vouchers to every Russian for “ownership” of state assets—is a fascinating history that requires further investigation. This compelling story of Browder and Magnitsky does what good nonfiction is meant to do: it makes you hungry for more depth, more history, more info on Putin, Pussy Riot, and Russia itself.Browder’s writing is best in the beginning, when he tells of his early interest in East European stocks and how he came to look at the investment banking scene. It is pure Michael Lewis-style disbelief at the life of a Wall Street banker. We revel, then, when he sets off on his own, scaring up seed money and taking chances. Browder also shares his personal life, his expensive (and often working) vacations, including resort names, which allowing us a little vicarious vacationing ourselves. If Browder’s gee whiz writing style began to grate a little by the end, and become a little less believable coming from a much older and wiser billionaire, I put it down to his awareness of his role in creating the disaster that resulted in the need for the Magnitsky Act. There may be something inherently corrupting about making vast amounts of money, albeit perfectly legally, by exploiting the discrepancies in unfair or exploitative valuations as a result of societal and political dislocations. There appears to be no shortage of real oppression in Russia today, and laws have not been robust enough to protect people from exploitation. It looks like a place where we can see naked human nature on display. I thank Browder for the introduction."}, {"userName": "Caroline", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/6257531-caroline", "userReview": "I don't have time to review this book properly. In a nutshell, I was fascinated by the first half of it - all about the author learning to become a hedge fund manager, and his experiences in Russia and the highs and the lows of that experience. These included him getting immensely tangled in the often corrupt jungle that is the Russian business world, taking on some of the oligarchs, and some of the major companies on the Russian scene, like Gazprom. At first Putin welcomed his interventions, but after a while he didn't...and then things got very nasty.I skim read the latter half of the book, which was more focused on the trumped up legal wrangles concerning his Russian company, and the prosecution, torture and death of his lawyer. Bill Browder has spent several years of his life trying to bring his lawyer's dreadful treatment to the attention of the world, particularly to the attention of the governing bodies in America and Europe.I would give the first half of the book 5 stars, and the second half 2 stars....and that very much reflects my interests, not any falling off in the quality of the book.The main reason I am posting anything here is to have a note of this talk that he gave at Oxford University. It is well worth a listen. (It's not as long as it looks - the bulk of it is Q & A....)https://www.youtube.com/watch?v=x2Blf..."}, {"userName": "HBalikov", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/929238-hbalikov", "userReview": "It’s 2017 and we all are looking forward to seeing how “the art of the deal” as practiced by our new president works out. How often will it be involving his friend in Russia? What better time to read Bill Browder’s page turner about his years deal-making in Russia and how he barely escaped being tucked away in some Siberian gulag. Browder recounts how he came to the financial world and how he became an expert in privatization of state-run companies in Eastern Europe and Russia. He has an excellent sense of how to tell an anecdote, holding the reader spellbound until the punch line. Here is a fable that he offers to illustrate the Russian mindset that he says he had to confront in his years running an investment fund in Russia and based on privatization of Russia’s industries. “A poor villager happens upon a magic talking fish that is ready to grant him a single wish. Overjoyed, the villager weighs the options: ‘Maybe a castle? Or even better – a thousand bars of gold? Why not a ship to sail the world?” As the villager is about to make his decision, the fish interrupts him to say that there is one important caveat: whatever the villager gets, his neighbor will receive two of the same. Without skipping a beat, the villager says, ‘In that case, please poke one of my eyes out.’”Browder says, “Russians will gladly --- gleefully, even --- sacrifice their own success to screw their neighbor.” Browder was based there from the Yeltsin revolution through the early days of Putin’s regime. He gets rich but then tries, according to his narrative, to change the underlying game and address the corruption that is endemic to the oligarchic era. In doing so, he becomes an enemy of the Putin regime and his life and the lives of those around him are in constant jeopardy. It is hard not to have Deep Throat’s admonition (“Follow the money.”) ringing in your ears as this story plays out. I can’t tell you much more without spoiling the impact of Browder’s story. Among the questions that you will have to determine are:\tIs Browder telling\t The truth?\t The whole truth?\t Nothing but the truth?\tHow much of this is based on pure ambition?\tHow much reflects his rebellion against his parents’ fervent communist beliefs?\tHow much does having his own family change his style and his judgments?The book places Browder near the center of Russian history during this period. Is this his ego, or was he so different from almost every other foreigner that he could command such attention from Putin’s government? Browder makes it sound as if the things that happened were first directed at him and then, to cover the vendetta, broadened to apply to other Americans and foreigners. But he puts his finger on something that resonates with what we are seeing in Russia with trade and Putin’s foreign policy right now. “….Russian business culture is closer to that of a prison yard than anything else. In prison, all you have is your reputation. Your position is hard-earned and it is not relinquished easily. When someone is crossing the yard coming for you, you cannot stand idly by. You have to kill him before he kills you. If you don’t, and if you manage to survive the attack, you’ll be deemed weak and before you know it, you will have lost your respect and become someone’s bitch. This is the calculus that every oligarch and every Russian politician goes through every day.”Whether you read this as autobiography or creative fiction, you will find yourself drawn to the cliff-hangers and you might find plenty that will illuminate some of the questions being raised now about how the Russians mix business and politics.To get a more complete picture of how this fits into our national situation and world interests, I recommend reading either Taibbi’s The Divide, or Dark Money by Jane Mayer."}, {"userName": "Andrew Robins", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/4281301-andrew-robins", "userReview": "Bill Browder, relatively early in his career, moves to Russia, to run a hedge fund investing mostly in recently \"privatised\" (in quote marks for a reason, as there isn't much similarity with our western understanding of that process) state industries.I'll be totally honest and say that, initially, I found myself worrying that this book was actually going to be an extended criticism of wrongdoing by those who profited from the truly unforgiveable privatisation process in Russia, by someone who was actually in Russia to make similar profits from exactly the same process.This didn't turn out to be the case, though. Browder starts uncovering evidence of enormous legal and financial abuses as grand scale theft goes on at formerly state companies. Unsuprisingly, he starts to make some very unpleasant enemies, and, after having managed to siphon his fund's money out of Russia unnoticed, he then moves his key Russian staff, also at risk, out of the country, to London.Sadly, the one person he couldn't persuade to leave is one of his lawyers, Sergei Magnitsky - a man in his late 30s, who Browder points out pretty astutely, is not as old as his colleagues, and therefore doesn't have the same memory of how cruel the state can be in Russia - who believes he has done nothing wrong, and therefore has no need to flee.Depressingly, he pays the price, and finds himself imprisoned for no good reason, kept in increasingly horrific conditions, and denied medical treatment for some horrible conditions he has picked up whilst in prison. Refusing to bow to demands to perjure himself, eventually he is beaten to death by police - ironically whilst at a hospital, finally being given treatment he had been denied for a year.Browder decides to make sure his death is not in vain and ensures that his case is not forgotten, eventually getting a law enacted to stop those convicted of abuses in Russia from travelling to the US.In the whole story what stood out was the brazenness with which state apparatchiks lined their own pockets, and the blatant, barefaced lying they engaged in to cover their tracks. It must be a Russian thing - the same way Putin will just deny the clearly visible in the Ukraine, state officials would deny the clear theft and human rights abuses they took part in. \"It's not true\" being the answer to everything.In all this, you have to feel for the Russian people. A horrible history under czarist rule, 70 years of communism and human rights abuse, and now, the descent into a corrupt, sham democracy, ruled by a select few, the same people who stole their economy away from them. They are the real victims.A terrific read, and very well written."}, {"userName": "Cheryl", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/2079470-cheryl", "userReview": "Red Notice is one of the best nonfiction books I’ve read in a long time. I could not put it down. It is fast paced, riveting, suspenseful, and a powerful indictment of the authoritarian regime that is in power today in Russia. And it is also an autobiography.Bill Browder writes about his early years as the grandson of the leader of the American Communist Party. His mother, father, and brother were all driven to excel in their professions and in school. Bill, on the other hand, was a “goof off”. It wasn’t until he began to apply himself in college that he, too, became very successful. After graduating with an MBA from Stanford, he began working for several different investment companies. He then founded his own investment company which was astoundingly successful. Returns on his investments were unparalleled. Some of the wealthiest people in the world invested with him. Browder’s investments were primarily focused on businesses in Russia, and he quickly became the largest foreign investor in that country. Everything was going unbelievably well until a young Russian tax lawyer named Sergei Magnitsky, who worked for Browder’s company, uncovered a multimillion dollar theft that was being perpetrated by a group of Russian oligarchs. The ramifications of this discovery would change Bill Browder’s life forever. Acts of theft, corruption, bribery, and murder which are ordered and orchestrated from the top levels of the Russian government, and which continue to be perpetrated to this day, are slowly exposed in this unforgettable and remarkable true story. It’s a dire warning about the true workings of the Russian government, and Westerners should not be fooled by the false propaganda emanating from this authoritarian regime.Bill Browder’s crusade to stop the human rights abuses that are still being carried out in Russia is courageous and admirable. A friend recommended this bestselling book to me, and after seeing Mr. Browder on PBS, I was drawn to his story. This book deserves all the accolades it has received. If you are interested in current events don’t pass this book up!"}, {"userName": "Pamela", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "OUTRAGEOUSLY COMPELLING!!!!If Bill Browder's expose isn't on your to read list, it should be. Whether or not you're business savvy - or globally astute, a non-fiction enthusiast, culturally aware, or a political aficionado - is rather a moot point; if you believe in impartial justice, integrity, and human rights - for all - this book is a must read. \"When the Russian government turns on you, it doesn't do so mildly - it does so with extreme prejudice.\" Written with unsparing honesty and vivacious clarity, this is one heck-of-a mind-blowing book. Reads like a taught, suspense-building thriller, except it's most unfortunately true. I'm still trying to wrap my mind around how such devious, thieving, murdering, sociopath 'leaders' reign terror on such a grand scale???? Not just vendettas against select individuals or groups from other nations or cultures, but against their own hardworking, family-oriented people! \"It bears mentioning that in Russia there is no respect for the individual and his or her rights. People can be sacrificed for the needs of the state, used as shields, trading chips, or even simple fodder. If necessary, anyone can disappear. A famous expression of Stalin's [still] drives right to the point: 'If there is no man, there is no problem.'\"My heart goes out to Sergei Magnitsky's family, as well as all the countless victims who have been brutally and permanently silenced; their innocent blood shed because they dared to stand for honor, integrity, justice, and their faith. May the world take NOTICE, so that your deaths not have been in vain......Five ***** Highly Recommended, Vitally Important ***** Stars"}, {"userName": "Cher", "userReviewDate": "Jul 04, 2015", "userURL": "http://www.goodreads.com/user/show/4776032-cher", "userReview": "3 stars - It was good.A fascinating story that starts off as a tale of financial corruption and ends with a cry for human rights. You are left questioning the illusion that Russia is becoming a progressive and democratic nation. Browder's story also shines an unflattering light on a few US politicians (here's looking at you, Kerry) and overall fueled my dislike for big government. There were editing issues (missing or extra words) and you can tell the author didn't major in literature, but it made for an intriguing and informative read.-------------------------------------------Favorite Quote: For the average Muscovite, a single act of Good Samaritan-ship could lead to a seven-year prison sentence. And every Russian knew this. This was the story of Russia.First Sentence: I'm a numbers guy, so I'll start with some important ones: 260; 1; and 4,500,000,000."}, {"userName": "Tanja Berg", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/5935491-tanja-berg", "userReview": "The content is important, since not all might be aware of what a lawless country Russia truly is. However, the author failed to engage me and I spent most of the book wishing it was over. The core message: don't do business in Russia and don't oppose the state or it will end badly for you. Putin's enemies end up dead in \"accidents\"."}, {"userName": "Mimi", "userReviewDate": "Feb 04, 2015", "userURL": "http://www.goodreads.com/user/show/2490110-mimi", "userReview": "Moved to https://covers2covers.wordpress.com/"}, {"userName": "Melania &#x1f352;", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/23622394-melania-x1f352", "userReview": "3,9/5It was a wild ride reading this. For the first 40% I wanted to DNF it at every half an hour; and that’s only because I didn’t like Bill too much and I didn’t care for the writing style .What kept me going were the always interesting insides into the trading world. But then the sh!t hit the fan and amazing things started to happen to this book.I cried for minutes while reading The Red Notice( I hardly cry while reading, it’s more likely to cry watching a movie) and I gained a deep respect for Bill. He’s definitely his grandparents’ grandchild. I would recommend it to anyone who wants to understand the world around them a little better ,and those who are a fan of political thrillers. This is 10 times better than any fiction."}, {"userName": "Jeanette", "userReviewDate": "Jul 26, 2016", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "Hard book to read! Bill Browder is the ultimate intrepid person. There are more details in his mind within an hour- then most people seem to use within a month. No, more than 2 months. And you hear them all here. For years, and years of travel, inquiry, investing, association for knowledge.He tells his true life experiences from the personal to the business, in immense detail. How he starts working as an investor. How he is \"fired\". How he is rehired. How he quits and starts his own business. What the lay of the land is within his study and seeking of details to different markets, and his evolving interest in the newly emerging Russia.The associations, the facts you can check within other sources! Phenomenal. But you must understand that this is NO easy read. This took me twice as long per page as the average book. Numbers man in a changing brutal world. Within a Russian culture that is described to the most ingenuous and truthful fall-outs from history. Citizens come last. All initiative to a work ethic or admiration have been destroyed. But it's more than just the history of Bill and his Fund. It's the history of SO many other names you will recognize. But then you may not want to understand what that implicates and stick your head in the sand.Outstanding for the first half. The second half of the book was probably much more a 4. Trying to rectify the horror of his lawyer's situation in Russian legal system! Like 100,000's of others, quite after Stalin too- you just have to take out the man to solve the problem. At least 3 quotes from Bill per chapter are pure gold- too many for me to list. I tried. Because I know many Lithuanian and Russian, now American or becoming American citizens, I have heard this tale from the \"other end\" of the economic spectrum so many times- that this is not such a surprise to me as it seems to be for some other reviewers. Communism and Socialism as it is practiced. And after it transforms. Coupled with the dehumanization of the real \"authority\" in large government. A true story that we rarely, rarely hear. One of the most outstanding to long memory- I will never forget it; Bill getting stuck in stopped by the hour traffic, seeking the waif in a group of waifs selling misc. tech black market merchandise of all kinds. And his buying a \"database\" floppy disc for $5, that he \"knew\" was going to be blank and just a con. And then discovering upon it some of the very assets listing and locations for 2 \"stolen\" company outfits he needed to determine the true capacity holdings. Stranger quirks like that occur here more than a few times. And the interlude of being detained and visa rejected- those days being \"held\"- those are 6 star. Bill has balls. His nerves must be made of steel."}, {"userName": "Tina", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/12827795-tina", "userReview": "I wish \"Red Notice\" were a more straightforward nonfiction account rather than the the first-person memoir of Bill Browder that it is. I found the story in the last half of the book compelling and heartbreaking, and I wanted to go deeper into the lives and backgrounds of the other characters beyond Browder - Magnitsky's family, Vadim, Vladimir, Senator Cardin, the Russian officials, other Russian activists, etc. - but was instead confined to this more narrow view. Along those lines, I also wish the last half of the book was expanded to be the whole book. The first half spends a lot of time describing Browder's early life and a lot of the events aren't incredibly necessary to get to the meat of the novel (i.e. Browder's first marriage). I just wasn't that interested in hearing all about Browder's rise to fame in the world of investment fund management. My biggest issue in the novel was Browder's voice. He can come off a bit holier-than-thou, which is frustrating given his position among the wealthy and elite. At times I had to roll my eyes at him because, while he is a far cry from the corruption of these government officials, he spent a fair amount of time indulging in the get-rich-quick atmosphere of post-Soviet Russia himself. If he had gone farther to acknowledge some of his own privilege, that would've helped, but he can seem pretty oblivious at times. The voice does get better in the last few chapters of the book. I'm glad that I read this book and learned more about the unhinged corruption among Russia's oligarchs and government officials, but \"Red Notice\" is a long slog to get to the meat of this subject. A book of this topic should be focused directly on the true main characters of this issue - the activists and citizens who have been unjustly imprisoned and killed like Sergei Magnitsky."}, {"userName": "Brad Feld", "userReviewDate": "Nov 26, 2016", "userURL": "http://www.goodreads.com/user/show/7288218-brad-feld", "userReview": "In the past 24 hours I’ve read a must read. Bill Browder’s Red Notice: A True Story of High Finance, Murder, and One Man’s Fight for Justice is one of the best books I’ve read this year. It reads like a John le Carré novel, except it is non-fiction. It starts out as the autobiography of Bill Browder and his creation of a massively successful hedge fund (Hermitage Capital Management) that was one of the first non-Russian investors in Russia in the mid to late 1990s. It then shifted into an incredibly complex story of intrigue, corruption, lawlessness, injustice, and murder all at the hands of the Russian political system.I know that was a mouthful, but if you want a little taste, just read the Wikipedia page for Sergei Magnitsky which is central to the second half of the book, where Browder shifts from successful financier to international human rights activist. If you want a taste, watch the following interview with Browder.https://www.youtube.com/watch?v=_7kwI...Amy and I just finished watching The Night Manager on Amazon, which was based on John le Carré novel by the same name. I’m an optimistic person and I tend to bury my cynicism in what I read and the movies I watch. My optimism holds that the good guys eventually come out on top. I’m going to keep holding onto that notion while doing the little bit I can to help impact that outcome, especially when it means supporting people like Bill Browder. While I don’t know him, if he ever called and asked for anything, I’d be immediately responsive.If you are looking for a powerful read over the holidays, I’d put Bill Browder’s Red Notice at the top of the list."}, {"userName": "Megan Treseder", "userReviewDate": "May 04, 2015", "userURL": "http://www.goodreads.com/user/show/19059501-megan-treseder", "userReview": "Rarely has a book gripped me like this. I didn't want to do anything else but read it. It is utterly mesmerizing. I loved it, even though I'm not great at understanding financial concepts (the stock market is a totally foreign place to me), but Browder does a good job of explaining things in layman's terms. This reads like the very best thriller stories, but the catch is, it's real. It makes me want to read everything I can get my hands on about Putin and the corruption in his government and Russian oligarchs. While I was reading this, a term from the Mormon lexicon kept coming to mind: \"Gadianton robbers,\" which is what these evil men are. It makes me so grateful to live in America. And it makes me grateful for very, very brave men like Sergei Magnitsky and Bill Browder."}, {"userName": "Doug Cornelius", "userReviewDate": "May 26, 2015", "userURL": "http://www.goodreads.com/user/show/3029658-doug-cornelius", "userReview": "Russian corruption from a financial and personal viewThere is a great story in here. Clearly, Mr. Browder has encountered the financial highs and corruption lows of Russia as the country emerged from communism to the capitalist dream of privatization and dropped into the abyss of a totalitarian oligarchy. As gifted as Mr. Browser is as a humanitarian and financier, it's nearly impossible to write an enjoyable autobiography. It's too personal and too biased. I kept imagining how Michael Lewis or Bethany McLean would have turned the story into a great book."}, {"userName": "Skip", "userReviewDate": "Feb 09, 2016", "userURL": "http://www.goodreads.com/user/show/1389748-skip", "userReview": "True story of the first investor in grossly undervalued Russian companies, who makes enormous returns for himself and his partners, but antagonized Russian oligarchs without much thought about the risks to himself, his family, his employees and agents. Then, the unthinkable happens, and Bill Browder has a new mission: justice and retribution. Non-fiction that seems too incredible to be true."}, {"userName": "Sue K H", "userReviewDate": "Dec 13, 2016", "userURL": "http://www.goodreads.com/user/show/4047077-sue-k-h", "userReview": "This is a great story about Bill Browder's life and how he came to form his company Hermitage Capital Management, whose business was to invest primarily in Russia, for for some of the most wealthy people in the world. His story eventually turns into an international thriller but with real people's lives at stake. I had mixed emotions as I was reading this. It was an important story but it bothered me that all the trouble started because of Bill Browder's greed. His whole business was set up to take advantage of Russian naiveté in the free market. It's impossible to feel sorry for Russia however, when the Oligarchs and government were doing everything in their power to make sure that only a select few Russians were going to benefit from their \"free\" market. Browder began \"fighting corruption\" for just himself and his investors, not one bit for the benefit of the Russian people. In fact he admits that some of what he got away with in challenging them was only because he was a well connected foreigner. Unfortunately, Russia prepared to take out their vengeance on his innocent Russian attorneys. Browder was ultimately in danger also and will remain in danger for the rest of his life. By the end of this riveting book, I was able to forgive Browder for his meddling, because ultimately other Russians not associated with him were being tortured and murdered too and in the end, Browder fought for justice and not money. Without his tireless fight none of the extreme corruption and human rights abuses in Russia would have come to light or had any real consequences. He also takes care of Sergei Magnitsky's family in London. I hope the rest of the attorneys who had helped him are okay. For those who don't want to read the whole book, here is the first youtube video he used to draw attention to the problem. At this point, no one had been murdered yet. https://www.youtube.com/watch?v=ok6lj... There are more youtube videos on his channel. I recommend reading the book for the full picture."}, {"userName": "Naddy", "userReviewDate": "Dec 07, 2015", "userURL": "http://www.goodreads.com/user/show/35112891-naddy", "userReview": "After reading i feel little more proud being Indian, i used to think India is quite corrupt but now i feel No country as corrupt as Russia. Red Notice is a memoir, engrossing tale, ugly truth of Putin regime, fight against justice, corruption, system, politics,Quite insightful about Russia. Red notice started with brief introduction about Bill Browder, starting from College, alma mater, falling in love, marriage, divorce, again love though not much time has been invested into personal life. The the second half of the book is quite interesting which exposes the total corruption that exists in Russia, going right up to Vladimir Putin himself.How Bill Browder was blacklisted by the Russian government, denied entry in to the country where his business was. His fight to not only get his investors out of Russia but also the people that worked for him, raids by the FSB, illegal transfer of companies through corruption and bribery at the highest levels in the Russian Government and leading to the brutal torturous tale and murder of Sergei Magnitsky, a Russian lawyer that worked for Hermitage Capital and who loved his country but refused to lie. After Sergei death, journey for Magnisty law in parliament. How badly he was affected by the death of his friend. One things which i really like in the book which is actually inspiring one - There was a time when Browder business wasn't growing in Russia as his entry was banned and at that time he introspected and find out he is good at what things and apparently it was reviewing/evaluating the companies and then invested his time into evaluating the new upcoming markets like South Korea, Thailand. \"There is no feelings as satisfying as getting some measure of justice in a highly unjust world. \"The best part is it is quite fast paced and one heck of read. Captivating and sad at times. I won't be surprised if in future i see movie adaption of this book. If you are into thriller genre, go for it blindly and u won't regret. So overall 4/5."}, {"userName": "Barbara", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/11701608-barbara", "userReview": "“Red Notice” is author Bill Browder’s engrossing memoir about his amazing career as an investor in Russia. Recall the iron curtain came down in the early 1990’s making Eastern Europe an unexplored financial mecca for investors. Browder decided to gamble his financial life by figuring out Russian businesses and investing in them.His career started working with financial pariahs such as Robert Maxwell and Salomon Brothers at the beginning of his career. The reader is provided insights as to the financial cesspool in the ‘80’s and 90’s. Through career frustration, Browder decides to make a go of it on his own.Learning about Russia business practices (of which there are few) and the political strong-hold on businesses was the favorite part of the novel. If you think Putin is a criminal, you won’t be displeased. If you are on the fence or question Putin’s policies, this illuminating novel will make you thank your lucky stars you live in the country you do.While investing in Russian companies, Browder exposed corruptions which left him and his staff in a political hot seat. He escaped to London along with much of his staff. One of his idealistic lawyers stays in Russia with the impassioned feeling that he will be vindicated by the Russian legal system. This doesn’t happen. Browder becomes a political activist as a result.Browder gets involved in American politics providing insider information to the inner workings of Washington. Yuck, yet fascinating.This is a book club read, and I am grateful to have read it. It’s a quick read and particularly relevant in 2017. I highly recommend it. The only distracting part is Browder’s annoying sense of self-importance. The story of events are amazing and crazy; his personalization in portions, I found distracting. Not distracting enough to detract from the story. It’s a must read."}, {"userName": "Biblio Files (takingadayoff)", "userReviewDate": "Dec 13, 2014", "userURL": "http://www.goodreads.com/user/show/3007401-biblio-files-takingadayoff", "userReview": "A red notice is an alert issued by Interpol that notifies countries that the person named is wanted by a member country. Most countries honor the red notices, so it is almost like a warrant to extradite. Bill Browder, a manager of a hedge fund that was based in Russia, found himself first banned from Russia, then the subject of a red notice. Only a few years before the red notice was issued, Browder was on top of the world, his hedge fund that specialized in Russian energy companies increasing its investors returns thousands of times over. How his fortunes changed from one extreme to the other is the subject of the book.Red Notice has high finance, Russian intrigue, political sausage-making, exotic locations. Browder is an excellent story teller and he has several stories to tell -- how he got into the hedge fund business, what it was like to be on the frontier of Russian capitalism after the fall of the Soviet Union, Russian corruption that extended to the very top, and Browder's fight against that corruption. It all seems unlikely, that someone who seemed to have been motivated mainly by greed eventually came to be a human rights advocate, but it's apparently true. An exciting story well told."}, {"userName": "Justas Petronis", "userReviewDate": "Feb 18, 2015", "userURL": "http://www.goodreads.com/user/show/16673329-justas-petronis", "userReview": "This passage should sum it up pretty neatly: \"This is Russia today. A stuffy room presided over by a corrupt judge, policed by unthinking guards, with lawyers who are there just to give the appearance of a real trial, and with no defendant in the cage. A place where lies reign supreme. A place where two and two is still five, white is still black, and up is still down. A place where convictions are certain, and guilt a given. Where a foreigner can be convicted in absentia of crimes he did not commit.\""}], "description": "A real-life political thriller about an American financier in the Wild East of Russia, the murder of his principled young tax attorney, and his dangerous mission to expose the Kremlin's corruption.Bill Browder's journey started on the South Side of Chicago and moved through Stanford Business School to the dog-eat-dog world of hedge fund investing in the 1990s. It continued in Moscow, where Browder made his fortune heading the largest investment fund in Russia after the Soviet Union's collapse. But when he exposed the corrupt oligarchs who were robbing the companies in which he was investing, Vladimir Putin turned on him and, in 2005, had him expelled from Russia. In 2007, a group of law enforcement officers raided Browder's offices in Moscow and stole $230 million of taxes that his fund's companies had paid to the Russian government. Browder's attorney Sergei Magnitsky investigated the incident and uncovered a sprawling criminal enterprise. A month after Sergei testified against the officials involved, he was arrested and thrown into pre-trial detention, where he was tortured for a year. On November 16, 2009, he was led to an isolation chamber, handcuffed to a bedrail, and beaten to death by eight guards in full riot gear. Browder glimpsed the heart of darkness, and it transformed his life: he embarked on an unrelenting quest for justice in Sergei's name, exposing the towering cover-up that leads right up to Putin. A financial caper, a crime thriller, and a political crusade, Red Notice is the story of one man taking on overpowering odds to change the world.", "title": "Red Notice: A True Story of High Finance, Murder, and One Man's Fight for Justice", "url": "http://www.goodreads.com/book/show/22609522-red-notice", "average": 4.31, "cover": "https://images.gr-assets.com/books/1422848658l/22609522.jpg", "reviews": 2254, "authors": [{"url": "https://www.goodreads.com/author/show/8344235.Bill_Browder", "name": "Bill Browder"}], "type": ["Nonfiction", "Politics", "Cultural", "History", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/22609522-red-notice", "http://www.goodreads.com/book/show/26620795-red-notice", "http://www.goodreads.com/book/show/23346988-red-notice", "http://www.goodreads.com/book/show/24811910-red-notice", "http://www.goodreads.com/book/show/25214257-red-notice", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}