{"ratings": 24586, "userreviews": [{"userName": "Heather Fineisen", "userReviewDate": "Dec 13, 2012", "userURL": "http://www.goodreads.com/user/show/6482072-heather-fineisen", "userReview": "While I was reading this, I kept going back to my Goodreads account and looking at the reviews, perplexed, but coaxed to keep reading. I finally came to the conclusion that this is one of those books that appealed to most, but not to me. Dominika is a training to be a Red Sparrow, a Russian female seductress agent, and she also has the gift of synthesia, or seeing colors in an aura around people that reflects their spirit, a mood ring sort of thing. Promising. Where the author lost me is the sexual content which I found ridiculous. I am not a prude, I even enjoy a titillating sex scene of many variations. Dominika masturbates with her grandmother's amber hairbrush, and then there is a recipe for Beet Soup. Dominika has a lesbian sex encounter at Sparrow School and here's a recipe for a Cuban Sandwich from the airport. Dominika has a fake orgasm worth of When Harry Met Sally and we can make crepes. (I may have some of the recipes out of sequel, but you get the idea.) Each chapter is followed by a recipe. And the women have sex like blow-up dolls. I even went back to the reviews thinking, oh, I bet women readers did not go for this, but they did. I could find no glaring trends to support my own conclusions. Just my own lonely opinion that this is ridiculous from my own female point of view. So, I say skip it and read a Ludlum or Le Carre. There you will find sex and substance.A copy of this was provided by the publisher."}, {"userName": "Bibi", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/33411728-bibi", "userReview": "*Random thoughts*  So happy that I persevered to the end, considering that nothing actually happened. Not a damn thing that wasn't predictable or contrived. CIA, FBI, Russian FSB, espionage, red sparrows-Russian secret agents who learn the fine art of seduction and sex, ubiquitous food recipes(why?), double agents, a lot of spy-speak, and countless acronyms. Additionally, our protagonist- Dominika- is a synesthete (the ability to see auras depicted as colours) which to me is a very interesting concept except, sadly, Matthews never fully utilised this plot device in any meaningful manner.That said, I reckon the movie will condense the repetitive narrative while ramping up the action sequences. My advice? Wait for the movie and skip the book"}, {"userName": "Kemper", "userReviewDate": "Jun 25, 2014", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "[ I initially enjoyed the female American senator character who sells secrets to the Russians. She’s a complete narcissist who is so self-involved and annoyed at any potential inconveniences that she refuses to take the most basic security precautions. This seemed like the kind of motivation you might find in a traitor in the age of Facebook. However, after a while with her relentlessly bashing the US intelligence agencies at every opportunity it left me wondering if Matthews suffered at the hands of some politicians during his career and was getting a bit of fictional revenge by portraying such a character as a villain completely devoid of conscience. What started as interesting became an over the top cartoon. (hide spoiler)]"}, {"userName": "Paromjit", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "This is the first in the Red Sparrow trilogy of which a film with Jennifer Lawrence is set to be released in 2018. Jason Matthews brings all his experience of being a spy with the CIA to bear in this well plotted espionage thriller. His descriptions of the workings of the American and Russian intelligence agencies bear all the hallmarks of the politics, paranoia, intrigue, quandries and motivations that shape the organisations. Set in the contemporary world of Putin's Russia, Matthews portrays the world of spies that suggest the Cold War may well be over, but it is business as usual, and in practice so little has changed, although Putin's PR spin is significantly slicker. Dominika Ergova is a synesthete who has had her career as a ballerina trashed, and thanks to the machinations (and exploitation) by her uncle ends up as a struggling state intelligence officer pushed into becoming a trained sparrow, a spy who seduces.Nathanial 'Nate' Nash is a CIA operative and handler of a major Russian asset, MARBLE, when everything goes wrong. He manages to save the asset, but not himself as he ends up in Helsinki bemoaning the stalling of his career ambitions. The Russians are determined to find the mole, and use Dominika for that purpose. Dominika is seething mass of rage and resentment over the limited visions and brutality of the men who have power over her. She is more than capable of independent thinking, and is no biddable and easily controlled woman. Nate and Dominika end up having a sexual affair which seems to have little future. This is a story of sex, betrayal, deception, double dealing, and a myriad of twists as the American and Russian spy agencies, erstwhile enemies, go up against each other in their efforts to find the moles in their own sides. Each chapter ends with a recipe. The biggest weakness of the novel is Matthews portrayal of the American and Russian sides as too black and white, with the Americans as the good guys and the Russians as evil. Otherwise, it is a great espionage read that is tense, gripping and compelling. I am really looking forward to seeing the movie! Many thanks to Simon and Schuster for an ARC."}, {"userName": "Matt", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "With all the hype this series has received, I thought it best to try the first novel in the trilogy, to see if it meets my expectations. Jason Matthews has not disappointed, with his knowledge of the topic and ability to transmit ideas onto the page. Nathaniel ‘Nate’ Nash has been working as a CIA operative to handle an important mole within the Russian Government. No one seems to know who it could be or how much information the Americans have garnered, but Russian President Putin is enraged and wants this person found. Feeling some of the heat, the CIA takes the opportunity to move Nash out of the region and resettles him in Helsinki. Meanwhile, the reader learns all about Dominika Egorova, whose past as a ballerina ended with a freak accident. Pulled into the Russian Intelligence sphere by an uncle who works as a senior official within the SVR (the KGB’s modern-day cousin), Egorova is targeted for a high-stakes game to retrieve the needed information from Nash. Sent to a ‘Sparrow School’, Egorova is turned into a seductress, where sexpionage is the name of the game. Her skills will be useful if she can lure the mole information from Nash while focussing her attention on his weaknesses. After crafting a chance encounter within the Finnish borders, Egorova begins laying her honey trap, but Nash is not taking the bait, at least not in the way she suspects he should. Instead, Nash sees a potential to turn Egorova to the Americans and have her feed additional information to the CIA. Tensions build and Egorova makes a decision she feels will benefit her in the long-run, but sours the relationship with her SVR handlers. Forced back to Russia, Egorova is presumed ‘handled’ in some dank prison, while Nash returns stateside with some valuable information; there is a Russian mole within the American intelligence community that could compromise everything. The race is on to find this mole before too much can be handed over to the Russians, while also continuing to protect their own information pipeline. Egorova has reported some of her news to SVR officials and seeks another chance to finish the work she’s started. With two moles and significant blowback to come, the American and Russian Intelligence communities are fighting to gain the upper hand in this post-Cold War world. Two agents, doing what they do best, may end up shaping the final outcome of this explosive game of espionage. Who is playing for whom... that’s anyone’s guess. Matthews shows how his past as a CIA official can help shape this gripping thriller that opens every conceivable door for the reader to push onwards. A trilogy that is sure to impress many, especially those who love a traditional novel of spy games. Highly recommended to those with the patience and interest in deep-rooted spy novels, a la John Le Carré!With this book now a major motion picture and the final novel recently released, I have heard much about it, as it appears all over Goodreads. I thought it high time to take a look to see if it might be for me. While the beginning was a little dense, I had to remind myself that I am not one who normally reads well-crafted spy novels, which seek to forego the superficial banter and develop over time, enriching the reading experience. As I pushed onwards, I found myself drawn to both Nate Nash and Dominika Egorova, two players from different spheres whose dedication to the cause cannot be discounted. Matthews does well to create elaborate and intriguing backstories for these two—particularly Dominika’s synesthesia—as well as meshing them together in a dance that can only have significant consequences. I found myself very interested in the ‘training’ undertaken by Egorova, sure that this sort of ‘Sparrow School’ is more common than it might seem. While many readers may be familiar with the idea of a honeypot mission, Matthews pushes this out of the sweaty sheets and pillow talk, turning the entire undertaking into a slow and methodical game of chess, with two countries staring one another down, unsure how much they know of the other’s game plan. Additionally, the creation and development of the two moles keeps the reader hooked, as they watch both individuals undertake their respective positions and extract the needed information to pass along. Who will be caught and at what price? The story is fabulous and develops slowly, but never loses the momentum through a strong narrative and believable dialogue. Matthews has done well to personalise the story with insider bits that promote a story that rests on a foundation of fact (or does it?). The reader need not feel they are being spoon fed yet another America vs. Russia novel of high-stakes and back alley stabbing, but rather a methodical understanding of the world of espionage with results dependent on the risks undertaken. With the uncanny use of recipes embedded at the end of each chapter—usually related to the food mentioned in the earlier narrative—Matthews shows that he has a lighter side and can lure the reader in through their stomachs as well as minds. I cannot wait to sink my teeth into the next novel, hoping that the development is as exciting as what Matthews developed here. I can see why there was so much hype... Matthews knows his stuff and has the literary awards to show for it.Kudos, Mr. Matthews, for a stellar debut novel. This series could really have some serious potential to win over many who have not yet developed a love for high-caliber spy novels.Love/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"userName": "Orsodimondo", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "MR. FLANAGAN Sono d’accordo con il critico del NYT Charles Cumming: inserire Putin tra i personaggi di questo romanzo è un errore, in qualche modo ne mina la credibilità – come lo sono le ricette gastronomiche a chiusura di ogni capitolo, meno l’ultimo, sia perché smontano la suspense sia perché la ricetta più leggera è pari a diecimila calorie. È vero però, proprio come scrive Charles Cumming, che questi sono errori marginali.L’errore vero è tutto il resto, a cominciare dal considerare questo romanzo un buon libro, un notevole debutto narrativo, dal premiarlo, dal recensirlo con entusiasmo.A me ha fatto rimpiangere Le Carrè, e Ambler. Ma anche perfino Forsyth, o Follett. Il che la dice lunga sulle capacità di Jason Matthews.Ne faranno un film e sono certo che sarà migliore del romanzo, anche se non c’è più Fincher a dirigerlo e chi ha preso il suo posto a Fincher non è paragonabile: ma il cast è buono. Rimpiango l’abbandono di Rooney Mara, attrice che prediligo, però Jennifer Lawrence non è seconda a nessuna.Leggendo questo malloppazzo, mi sono chiesto se John Wayne l’avrebbe amato. Penso di sì: gli umori non gli sarebbero alieni, il passero sarà anche rosso (il titolo originale è Red Sparrow), ma i berretti sono sempre verdi, che più verdi non si potrebbe. USA über alles.Il tutto è permeato da una discreta dose di maschilismo, che non guasta mai. Eppure anche James Bond interpretato da Daniel Craig è diventato più attento su questo aspetto, meno biecamente sessista.Maschilista anche se la protagonista femminile, Dominika, è in pratica un supereroe, o meglio, una super eroina, in quanto il suo potere di vedere auree di colore intorno alle persone, e da qui interpretare l’essenza dei comportamenti altrui, anticipare le mosse di chi le sta intorno, sa tanto di dono magico. A me sembra kryptonite, invece Matthews lo chiama sinestesia. Una conditio sine qua che a me è parsa davvero risibile, in assenza della quale la storia non sta in piedi. E comunque, alla donna tocca sempre giustificare la sua capacità, la sua bravura, in qualche modo ‘alieno’.La spia americana prende in giro quella russa ricordandole l’Afghanistan, e la spia russa invece di rispondere ‘Perché, voi invece, che avete fatto in Afghanistan, dov’è che vi ha spedito Bush?’, gli rinfaccia il Vietnam! Eppure il romanzo è ambientato pochi anni fa, le guerre di Bush sono recenti. I personaggi sono in numero impressionante, come è facile prevedere dato il tipo di storia e data la mole del volume: a ciascuno è dedicato il racconto di chi sono e da dove vengono, le loro vicende personali – pagine e pagine pressoché inutili perché nulla aggiungono alla psicologia degli stessi, alla loro personalità, che rimane confinata a una piatta bidimensionalità tendente alla monodimensione (la larghezza).Le banalità, i cliché sono tanti, a cominciare da questa sintesi di Roma:Roma era tetti ocra e marmo luccicante sotto il sole eterno. La situazione peggiora quando arrivano gli spaghetti con la bottarga di muggine, che viene considerata più buona del caviale russo (ma hanno davvero mai sentito l’una e l’altro?), e Matthews dice che la pasta arriva traboccante olio e intingolo. Chissà poi perché a Roma si firmano petizioni per salvare le botteghe storiche, chissà perché a noi ci sembra di essere invasi da pizzerie al taglio, paninoteche e negozi d’abbigliamento, e invece lo scrittore americano a Monti vede solo panettieri e falegnami.Matthews sparge a piene mani, nel senso di tastiera, gemme di umorismo involontario come questa che segue:- La telefonata servirà anche a fare un po’ di disinformazione, capisci cosa intendo?-\tSì, dezinformaciya.-\tEsattamente.https://www.youtube.com/watch?v=6Ciq8...Altro momento linguistico scelto a caso:- Hren, cazzate! E uno si chiede se le lezioni d’inglese di Giacomo (di Aldo, Giovanni e ) nelle vesti di Mr Flanagan siano poi così diverse. Aggiungo perle, secondo me di grottesco involontario:Li guardava torvi. L’orlo del vestito tremava insieme al suo corpo. “Ricomponiti. Non perdiamoci in chiacchiere”.L’editore divide i gruppi di vocali con gli accapo e la lingua italiana si agita (nella tomba?).Ogni tanto, finalmente, Matthews si ricorda di aver lavorato nella CIA per 33 anni (sua moglie per 34) e regala i momenti migliori.E il meglio è in certi dettagli, cui purtroppo Matthews dedica troppo poco tempo: i pedinamenti, le perlustrazioni, gli appostamenti… Oppure nel trattamento inflitto a Diva nel sotterraneo della prigione – e non perché io sia un sadico maniaco, ma perché sono i momenti in cui Matthews dice qualcosa di non scontato, in cui viene fuori la sua esperienza e conoscenza diretta della materia - per esempio, nel caso specifico, gli armadi di legno nei quali la rinchiudono durante gli spostamenti lungo i corridoi, da una parte all’altra della prigione, se sta per passare un altro prigioniero, il tutto avvisando dell’incrocio pericoloso con dei cicalini – i prigionieri non devono mai vedersi, un modo per fiaccare ulteriormente il morale del detenuto.Ciò nonostante, io, che se non si fosse ancora capito, sono un romantico senza speranza, sono arrivato in fondo alle 500 e passa pagine di banalità simili con voracità per sapere come sarebbe andata a finire tra l’uomo e la donna (niente nomi, evitiamo spoiler), se l’amore, o il sesso, o la ragion di stato, quale avrebbe vinto. Adesso lo so. E passo oltre.Ecco, a marzo esce il film in sala: Jennifer Lawrence appare perfetta nella parte. La regia è di Francis Lawrence, nel cast Joel Edgerton, Matthias “Prezzemolo” Schoenaerts e Jeremy Irons."}, {"userName": "Trudi", "userReviewDate": "Jul 09, 2014", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "Think the Cold War is over? Think again. I'd always had somewhere in me (I mean, really, who doesn't?) an interest in Soviet history and everything Red Army, KGB, Iron Curtain, and Gulag. It's one of the greatest stories ever told after all -- the rise and fall of a mighty and murderous political and geographic monolith that aggressively absorbed many nations and languages and religions into its insatiable machinery in a quest for ultimate global supremacy. A nerve-wracking Cold War entrenchment would prove a constant counter-balancing act with the United States to see which would emerge the most super of two superpowers -- while the rest of us could do nothing but watch with bated breath to see whether one or both would destroy the world in a conflagration of nuclear annihilation. Good times.While it seems like those old Cold War threats and anxieties are in the past, lost to the annals of history and diminished by Soviet collapse, I would venture that there remain a fair number of Russian politicians who think otherwise. Dig a little deeper into Putin's presidency and you will find a shocking (or perhaps not that shocking at all) amount of old-school Soviet corruption and megalomania. And that's what gives Red Sparrow its sense of urgency and authenticity. The author doesn't really have to exaggerate or sensationalize his modern spy game between CIA operatives and Russian SVR agents. It's happening. In point of fact, it never stopped. Names might have changed, there might be a veneer of civility and legality over the top of it all to shine it up for a new century, but in a lot of important ways it's the same shit different day.Author Jason Matthews isn't writing out of his ass either. He's been in the spy game for over three decades and served in multiple overseas locations performing clandestine acts and participating in recruitment operations. Reading about spy games as they are unfolding in this century is definitely thrilling, though at times because it requires so much description it's easy to become mired in the details. Many times while reading the action, I longed to be watching it instead. Spy games are extremely visual by their very nature -- so I did feel that some of the book's potency and terror was lost in the amount of dense prose required to put the reader in that place. I couldn't help think about FX's brilliant spy drama The Americans and how it handles drops and communiques, late-night rides, expedient kills and ruthlessly efficient body disposal (all the more impressive since it's done using 80s technology and employing an array of epic wigs). After three superb seasons I'm truly addicted, especially to the rich emotional depth that simmers beneath its layers of intrigue and counterintelligence techniques. So yeah, watching this stuff tends to be way more awesome than reading about it. The author overcomes this handicap by introducing a great cast of characters to act as our portal into the twisty, exciting narrative, giving us people to care and worry about. The stakes are high in these cat and mouse games that aren't games at all of course. One wrong move and you're dead, your body likely never to be found. I will definitely read the second book in this series, if only to tide me over until The Americans return in January. Two quick nit-picky thoughts:1) What the hell is up with all the recipes appearing at the end of every single chapter? That became a bit annoying only because I really didn't see the purpose, and some of them made me hungry, which would make me stop reading in order to run for the refrigerator.2) Dominika is a kick-ass female lead, I really like her a lot, but I wish she didn't have those extra sensory capabilities because it felt like cheating. Couldn't she just be kick-ass, full stop, with a really well-tuned social and emotional intelligence to read people, rather than something that's almost paranormal/supernatural?"}, {"userName": "Esteban", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/6136876-esteban", "userReview": "I very nearly despaired of finishing this book a couple of times.In one review they compared this book to John Le Carre, I don't think so! That was the MAIN reason I picked it up and gave it a go.So slow, so boring, so full of words that said almost nothing. Sometimes you get a book very rich in words which tells a rich story, this was not the case, it gave me the impression of the author's infatuation with his capacity to link words in sentences, then in paragraphs, pages, chapters and so on.And the russian! Words in russian in every page, all the time, for everything, so exhausting. The heroine is introduced as being fluent in various languages, one of them english, yet she always had to resort to russian to say a specific word or phrase, so not so fluent I guess. So the author speaks russian then, and wanted to give us some ambiance, not for me you didn't.The story is common, there is absolutely nothing to make it stand out from any other glamourous spy story, far fetched, slow, repetitive, boring, wordy.....next!"}, {"userName": "Bob Milne", "userReviewDate": "Jan 18, 2013", "userURL": "http://www.goodreads.com/user/show/2224905-bob-milne", "userReview": "Like the coldest, most diligent of intelligence officers, I have been patiently sitting on the secrets of this book for nearly 6 months now. I was quick to accept when Simon & Schuster Canada proposed the mission - to review, and to be a part of the tour - and gave it a read almost as soon as the ARC arrived on my doorstep. It reminded me of the cold-war espionage thrillers I read growing up, and I drafted my review right away, while the source material was still fresh in my brain, safe from any sort of foreign government tampering.It's a good thing too, since the mission ended up being delayed by a month, taking us into the end of May for the review, and the first week of June for my interrogation - I mean, friendly Q&A, of course - with the author. Check back next Tuesday for that!With all that having been said, I can safely say that Red Sparrow is worth the wait. If you find yourself missing the cloak-and-dagger world of the Cold War - somewhere between the time when spy thrillers stopped being all about the gadgets and started being all about gritty, action-packed reboots - then this is a book you will certainly appreciate. This is a contemporary thriller, set in Putin's Russia, and it contains some clever nods to the classic spycraft elements, but it reads like it could have come direct from Gorbachev's Soviet Union It's an intelligent, slow-moving tale (at least in the early chapters), but no less compelling for it. Jason Matthews quickly establishes the players, the stage, and the stakes, drawing us in and holding us close throughout.Nathaniel (Nate) is a great character, a charismatic lead who manages to retain the sense of being familiar and down-to-earth, while also demonstrating a propensity for quick action and bold heroics. He's both likable and admirable, which is a difficult mix to pull off, especially in this kind of a story. At the same time, Dominika comes across as an authentic, if seductively dangerous, woman, placed in an awkward situation. A graduate of the Sparrow School of sexual espionage, she could easily have fallen into the disposable Bond-girl mold, but she not only holds her own, she proves herself worthy of sharing the lead.What I really appreciated about the story was the amount of deceit, double-dealing, and treacherous twists that permeate the text. You're never quite sure who you can trust or what their ultimate motives are, and that's as it should be. As soon as your readers find themselves becoming familiar with the characters, and feeling secure in their presence, then you've failed the genre. Matthews deftly avoids that pitfall, making us want to be believe Nate, and compelling us to want to trust in Dominika, but he never makes any promises. They're never cheap twists, and you never feel as if you've been blindsided, but it's worth remembering that red herrings are part and parcel of the genre.While this is not an action-packed novel, screaming for a big-budget, blockbuster treatment, it contains more than its fair share of sex, violence, and dramatic tension. The stakes are high, and the story never allows us to lose sight of that. Political diplomacy aside, we're talking about warring forces here, enemy combatants who may operate in the shadows, but who fill those shadows with torture, murder, and sexual exploitation. It's a frightening, ugly world in which to operate, full of necessary evils and uncomfortable decisions. Matthew maintains that tension right to the very last page, keeping the reader intrigued, almost to the point of paranoia.To say much more than that would be to get into spoiler territory, and I'm far too aware of my own morality to risk crossing the wrong people. However, I will add this - the assassination in the final pages makes for a fitting end, but it also provides ample motive and opportunity for a Red Sparrow sequel. To be honest, I'd like to see Matthew simply leave it at that, since the end works so beautifully, but I wouldn't be too disappointed were he to pick up the threads for a sequel.As a final note, while I suspect the recipes that follow each chapters are carefully crafted secret messages to Nate's bosses, I'm also reasonably sure they're not meant to poison the enemy, and are likely as tasty as they are intriguing. :)Originally reviewed at Beauty in Ruins"}, {"userName": "Jennifer", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "\"Her name was Dominika Egorova. She was a ballerina, an officer in the SVR, a Sparrow trained to bend others’ minds. She loved and was loved in return.\"\n\n I rarely read spy thrillers, but when I heard Jennifer Lawrence was cast for the film adaptation of Red Sparrow, I put it on my TBR list asap. At first, I almost didn't finish this book. Like I said, I don't typically read this genre and I didn't find myself easily engaged in the writing style. It felt very dry third-person. However, the manipulation, level of action, surprising amount of drama, food (there are recipes!!), culture, unexpected romance, and a strong heroine with a very convenient neurological gift quickly earned my interest and I was easily sold. Jennifer Lawrence will be kickass in the role of Dominika and I'm excited to see how this plays out on the screen.My favorite quote:“The long and short of it, Nate,” said Gable later in his office, “is shut the fuck up. We have lots to do. Get to work, for Christ's sake. Stop mooning around. It's like a Jane Austen novel.”The Red Sparrow Trilogy includes the following installments as of February 2018:#1-Red Sparrow#2-Palace of Treason#3-The Kremlin's Candidate"}, {"userName": "Darren", "userReviewDate": "Jul 13, 2013", "userURL": "http://www.goodreads.com/user/show/2711876-darren", "userReview": "Awful Writing and No Command of Fiction CraftI abandoned this book after 90 pages. I don't care if the plot eventually improved; the writing is terrible. For one, there is a lot of needless description. He describes plateware and names the fancy cologne a character is wearing. Who cares? Don't waste my time with the research you did on trivial nonsense. He even describes an airport terminal as containing shops and restaurants. Really? Why waste words on describing an airport? We all know what they look like. I don't need to be told they have shops.Second, he's using omniscient POV, which is not a good choice for a first-time author. It's a POV that requires restraint or else the reader will get whiplash from jumping around in different characters' heads. And that's exactly what the reader gets--sometimes he jumps back and forth between two characters' POVs on the same page.There is also a lot of needless description of cuisine--probably so he can include a recipe at the end of each chapter. No one cares. Stop forcing every chapter to have a food scene.Perhaps I've been spoiled by reading good writers and avoiding genre fiction, but if this is what passes for acceptable craft in genre fiction, then count me out of genre books.The author needed a professional writer to collaborate with--someone who could take his plot ideas and tell the story in a compelling, economical way. I wish I could get my $11.04 back."}, {"userName": "Darwin8u", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "The next generation of spy-turned-spy novelist is here. Joining Graham Greene*, Somerset Maugham*, Ian Fleming, John le Carré*, James Church, (and maybe -- if my suspicions are correct -- Robert Littell and Olen Steinhauer too), Jason Matthews shows most interesting spy fiction is actually written by former spies/intelligence officers. While not close to being a great espionage novel (using recipes to separate the chapters seems a little overcooked and trite), the Red Sparrow shows a lot of potential for a debut novel. When the novel gets away from acrobatic sex and ethnic food and instead sticks with spy craft, agent development, mole detection, etc., it actually holds up well.It isn't exactly spy literature, but it is a fun and diversionary summer read that mixes a low brow Bond (sexy vixens and almost absurdly wicked villains) with more high brow Smiley (complexity of motivations and opacity of belief). This mixture could have almost sunk the novel, but Matthews nearly pulls it off.* NOT close to their level of writing. No. No. No."}, {"userName": "kartik narayanan", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/4070035-kartik-narayanan", "userReview": "Read the review of the Red Sparrow Trilogy at my blogRed Sparrow is an okayish spy thriller. The best thing is its sheer authenticity and 'grounded-ness' of the day to day clandestine operations similar to the way the Pike Logan books feel authentic in their action due to Brad Thor's background. While I am no spy (or am I?) or spec ops warrior (maybe?) and cannot obviously vouch for the authenticity, Jason Matthews and Brad Thor communicate this feeling of realism that other authors in the genre, who have not been in the field, cannot communicate.Anyway, barring this and the usual ‘who can you trust’ and ‘who is working for whom’ plots, this book does not have anything else going for it. I found the demonisation of the Russians and Putin to be quite puerile and a bit hypocritical. The villains follow the usual tropes - skilled manipulator, sadistic killer etc. Additionally, the character of Natasha Romanoff Dominika is quite strong and tends to stick in your mind, more-so than other characters. Don't believe all the denials though- Red Sparrow is best described as a mature version of the Black Widow."}, {"userName": "Megan Johnson", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/31853583-megan-johnson", "userReview": "This is a tough one - on the one hand I actually really did enjoy the story, but on the other hand it was kind of a tough one to get through. When it comes to illicit affairs, strategizing on who can screw the other harder, and that flavor of crazy drama - I am THERE for it. But to be totally candid with you, I feel like that drama was there in this book but it was taken away from by endless \"intelligence\" talk. I know this is a story of espionage and how the agencies go about their business, and on the surface it probably does that very well. But for the average reader that cared more about the drama than the inner workings of government intelligence, it just didn't resonate with me. Should you buy it?  I'm gonna have to go with probably not on this one unless you're looking to read it before seeing the movie or you're really, really into how government spying works.WEBSITE | TWITTER | FACEBOOK | INSTAGRAM"}, {"userName": "Bettie☯", "userReviewDate": "Sep 07, 2015", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "How to do The Mendacious: Dec 2015... and Trump is great, Blatter should get the Nobel, so what if we lied about being in Ukraine and such a shame that black box was broken but the economy is doing well...Description: In today’s Russia, dominated by Prime Minister Vladimir Putin, state intelligence officer Dominika Egorova struggles to survive in the cast-iron bureaucracy of post-Soviet intelligence. Drafted against her will to become a “Sparrow,” a trained seductress in the service, Dominika is assigned to operate against Nathaniel Nash, a first-tour CIA officer who handles the CIA’s most sensitive penetration of Russian intelligence. The two young intelligence officers, trained in their respective spy schools, collide in a charged atmosphere of tradecraft, deception, and inevitably, a forbidden spiral of carnal attraction that threatens their careers and the security of America’s valuable mole in Moscow. Seeking revenge against her soulless masters, Dominika begins a fatal double life, recruited by the CIA to ferret out a high-level traitor in Washington; hunt down a Russian illegal buried deep in the U.S. military and, against all odds, to return to Moscow as the new-generation penetration of Putin’s intelligence service. Dominika and Nathaniel’s impossible love affair and twisted spy game come to a deadly conclusion in the shocking climax of this electrifying, up-to-the minute spy thriller. Opening: Twelve hours into his SDR Nathaniel Nash was numb from the waist down. His feet and legs were wooden on the cobblestones of the Moscow side street. It had long since gotten dark as Nate ran the surveillance detection route designed to tickle the belly hairs of surveillance, to stretch them, to get them excited enough to show themselves. There was nothing, not a hint of units swirling, leapfrogging, banging around corners on the streets behind him, no reaction to his moves. Was he black? Or was he being had by a massive team? In the nature of The Game, not seeing coverage felt worse than confirming you were covered in ticks.Brutally deprived of her calling as ballerina with the Bolshoi, Dominika's uncle Vanya steps in with a job offer that will ensure her mother can keep her apartment after the sudden death of her husband.A bunch of folk didn't appreciate the recipes, where I did, very much for the first third or so, and as I tap away here my Beet Soup is bubbling away in the pot in the kitchen and smells delicious. My pet peeve #1 was the aura thing, it really grated, and turned the mainly credible story into gimmick. #2 - too long, and if all the recipes and food descriptions were removed it would amount to circa 200 pages.This is not literature but it is good story-telling by one who knows his spy trade and I can't accuse Matthews of making me loathe Putin and his cronies, I was already there. When will Mr and Mrs Average Russia get a break - through the centuries it has been consistently terrible for them.To keep things straight:MOSCOWMARBLE: in his sixties, major general in the SVR, which was the successor to the KGB’s First Chief Directorate, the Russian Foreign Intelligence Service, the Kremlin’s overseas spies. MARBLE had been in harness for fourteen years.TrunkSVR First Deputy Director: Ivan (Vanya) Dimitrevich EgorovAlexei Zyuganov (Lyosha)Dominika Egorova: twenty-five years old, with dark chestnut hair. Niece of Vanya Egorov. The Sparrow of the title.Dimitri Ustinov: Gangster oligarchSergey Matorin: SVR staff officer with the rank of major V Putin: toxic narcissistCIA Chief of Station: Gordon GordoffNPPD - spy pollen (who knew!)HELSINKI(where The Game begins)Tom Forsyth, Chief of Station Marty Gable- deputyTarik - turkish hash house ownerJaana and Marcus Räikkönen (ARCHIE and VERONICA)Maxim Volontov, SVR rezident in the Russian EmbassyMarta YelenovaOLD LADY’S BEET SOUP: Melt butter in a large pot; add a chopped onion and sauté until translucent; stir in three grated beets and one chopped tomato. Pour in beef stock, vinegar, sugar, salt, and pepper. Broth should be tart and sweet. Bring to a boil, then simmer for an hour. Serve hot with a dollop of sour cream and chopped dill.MOSCOW AIRPORT CUBAN SANDWICH:Slice a twelve-inch loaf of Cuban bread partway through lengthwise and fold flat. Drizzle olive oil on outside and slather yellow mustard inside. Layer glazed ham, roast pork, Swiss cheese, and thinly sliced pickles. Close and press for ten minutes in a plancha or between two hot foil-wrapped bricks (heat bricks for an hour in a 500-degree oven). Cut in thirds on the diagonal.BLINIS SERVED AT VASSILY EGOROV’S WAKE:Season one cup flour with baking powder and kosher salt. Add milk, egg, and clarified butter, and blend into a smooth batter. Cook a tablespoon of the batter at a time over medium low heat until blini are golden on both sides. Serve topped with red caviar, salmon, crème fraîche, sour cream, and fresh dill.USTINOV’S RUSTIC PÂTÉ:Caramelize chicken livers, pancetta, and garlic, then deglaze pan with brandy. Hand-chop mixture with parsley, capers, shallots, lemon zest, lemon juice, and olive oil into a coarse texture. Add additional olive oil. Serve on toast with lemon.SVR CAFETERIA CHICKEN KIEVMix and chill compound butter with garlic, tarragon, lemon juice, and parsley. Pound chicken breasts into wafer-thin cutlets. Roll tightly around thumb-sized pieces of compound butter, tie with twine. Dust with seasoned flour, dip in egg wash, coat with bread crumbs, fry until golden brown.SVR GOLUBTSIBlanche cabbage leaves, cook rice. Sauté chopped onions, carrots, and peeled and seeded tomatoes until soft, incorporate with the rice and ground beef. Fold cabbage leaves around two spoons of mixture to form large square envelopes. Fry in butter until brown, then simmer for one hour in stock, tomato sauce, and bay leaves. Serve with reduced sauce and sour cream.TARIK’S ADANA KEBABPurée red bell and hot peppers with salt and olive oil. Add purée to ground lamb, chopped onion, garlic and parsley, finely cubed butter, coriander, cumin, paprika, olive oil, salt, and pepper. Knead and shape into flat kebabs; grill until almost charred. Serve with grilled pide bread and thinly sliced purple onions sprinkled with lemon and sumac.SPARROW SCHOOL TOKMACH SOUPBoil coarsely chopped potato, thinly sliced onions, and carrots in beef broth until soft. Add thin noodles and cook until done. Put boiled beef in bottom of bowl and pour broth and vegetables over.JEAN JACQUES BEEF STEW DIJONNAISESeason and dust with flour small cubes of beef and brown aggressively. Remove meat. Sauté chopped bacon, diced onion, tomatoes, carrots, potatoes, and thyme until soft. Return meat to pan, cover with beef broth, and simmer until meat is tender. Blend in Dijon mustard, splash of heavy cream; reheat and serve.SPANISH EMBASSY TORTILLA ESPAÑOLACook seasoned, medium-sliced potatoes and chopped onions in abundant olive oil until soft, then remove and drain. Add beaten eggs to potatoes and onions and return to oiled pan on medium heat until edges and bottom start to brown. Place plate over skillet, invert, then slide tortilla back into pan and cook until golden brown.KADDO BOWRANI—AFGHAN PUMPKINDeeply brown large chunks of peeled sugar pumpkin, cover liberally with sugar, and bake covered in medium oven until tender and caramelized. Serve over thick meat sauce of sautéed ground beef, diced onions, garlic, tomato sauce, and water. Garnish with sauce of drained yogurt, dill, and puréed garlc.GREEK STRAPATSADA EGGSIn heated olive oil reduce peeled, chopped tomatoes, onions, sugar, salt, and pepper to a thick sauce. Add beaten eggs to the tomatoes and stir vigorously until eggs set into a small, fine curd. Serve with grilled country bread drizzled with olive oilCAVIAR TORTEBlend sautéed shallots, crème fraîche, and grated Neufchâtel cheese and pour mixture into a springform pan. Sprinkle with chopped boiled eggs. Spread a thin layer of small-gauge caviar (Ossetra or Sevruga) on top of torte and chill. Unmold and spread on blinis or toast points.NATE’S VEAL PICATTAPound small medallions of veal paper-thin. Season and quickly sauté in butter and oil until golden. Remove and cover. Deglaze pan with dry white wine and lemon juice, boil to reduce. Lower heat, add thin lemon slices, capers, and cold butter. Gently simmer to a thick reduction (do not bring back to a boil). Return medallions to sauce to warm.MARTA’S LAST MEAL—PYTT I PANNAIn foaming butter, separately and aggressively brown cubed beef, potatoes, and diced onions until crisp. Incorporate ingredients in the skillet with additional butter, season and reheat. Form a well in the mixture, and break a raw egg into it. Stir the egg into the hash before serving.ROGAN JOSHIn a mortar, roughly grind chopped onions, ginger, chili, cardamom, clove, coriander, paprika, cumin, and salt into a smooth paste. Add bay and cinnamon. Add heated clarified butter. Cook until fragrant. Add cubed pieces of lamb, stir in yogurt, warm water, and pepper. Bake in medium oven for two hours. Sprinkle with coriander."}, {"userName": "katwiththehat", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/54835325-katwiththehat", "userReview": "Wow, this is SO detailed and amazing. If you love books about spycraft and CIA work, you will appreciate the complexity and detail of Jason Matthews’ RED SPARROW, which is told from the pov of Dominica, a Russian girl who is trained as a “sparrow” or Russian intelligence officer who will spy and run honey pot operations, seducing her targets and gathering information, and Nate, a CIA officer who had been in Moscow managing informants until one day he is nearly caught and his cover is blown. She is sent to extract information from him. He is told to develop her as an agent. But are real feelings starting to form? This is just a really cool book, especially if you ever loved the TV show “The Americans” and questions of real or not real. Long, complex, and with an interesting array of emotions that keep you invested in seeing what comes next. And I just loved Dominica and Nate! So many twists and turns as this winds its way towards the end. Definitely reading the next book in the series! Please excuse typos/name misspellings. Entered on screen reader."}, {"userName": "Meredith", "userReviewDate": "Jun 06, 2015", "userURL": "http://www.goodreads.com/user/show/30978160-meredith", "userReview": "Captivating spy novel with some romance mixed in. I highly recommend. I can't wait to read the Palace of Treason."}, {"userName": "Monnie", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/6277675-monnie", "userReview": "After seeing trailers for the just-released motion picture starring Jennifer Lawrence and Joel Edgerton and learning that it's based on a book of the same name, my husband decided to give the book - the first in a trilogy - a try. Then he told me it was very, very good.Whether or not we watch movie remains to be seen (pun intended), but I knew I wanted to read the book first. I also knew it's close to 600 pages - not easy to fit into a stack of advance-copy books I've agreed to read and review. But make time I did, and I'm ever so glad. It's one of the best spy thrillers I've read in a very long time.At first blush, the story seemed reminiscent of the TV show \"The Americans\" starring Keri Russell and Matthew Rhys; spies and counterspies, each trying to recruit others while remaining \"black\" (i.e., undetected and unidentified). Main characters Nathaniel Nash is a young CIA officer, assigned as the handler of a top-level Russian undercover U.S. spy; Dominika Egorova is a wounded (both physically and mentally) former Russian ballerina who stays on her toes under the watchful eye of her powerful uncle. But when her uncle sends her to \"Sparrow School\" - euphemism for a place females learn the art of seduction for the purpose of recruiting spies for the Russian government, her love of her home country under the dastardly Vladimir Putin and his loyal minions turns sour. Needless to say, Nate and Dominika are brought together to serve cross purposes; he to recruit her, she to recruit him. And needless to say, it doesn't quite work out that way. It does, though, make for an intricately woven, hard-to-put-down story interlaced with tricks of the spy trade, twists and surprises - none of which, alas, I can describe without spoiling the book for other readers. I can, however, is highly recommend this book - and I do. Outstanding!"}, {"userName": "LeAnne", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/7862560-leanne", "userReview": "I'm going to give this a four for pure entertainment.Spy novels, thrillers, or books for teens/young adults are reads where my ratings should not be compared with my reactions to more serious literary works...it is like comparing apples with oranges, filet mignon with chocolate.I confess that the primary reason I read this was because of the new movie release and that it was available as a free audio from the library. That said, I'm also an old fan of the original Tom Clancy books like Red Storm Rising, The Hunt for Red October, and The Cardinal and the Kremlin. I also loved Nelson Demille's stories - The Charm School is a particular favorite. And by coincidence, the hub and I have been watching the series Berlin Station. Are these novels erudite and deep invitations for soul searching? No, but they're fun. Add to that this author’s interesting details about clandestine work that seem extremely believable, and I had trouble putting this thing down.This is an espionage story that takes tricky U turns around Moscow, Helsinki, and DC with a few quick stops in other European cities. We have a male and female protag, each on opposites sides of the 'new' Cold War, who of course become enamored of one another. What is a hoot is that we also have Vladimir V. Putin! Yes, we even get to see him without his shirt doing a TRX workout. For those of you who are not gym rats, TRX straps with handles on them are anchored to overhead bars or hooks so that one can do mid-air push ups with body weight as the resistance - it ain't easy, but VVP makes it look that way. He holds a mid-air conversation w a couple guys, and it seems like a stunt he’d pull.Putin isn't the only one taking his clothes off here. Unfortunately, I started my audio of this while driving 75mph en route to the beach with my 15 year old son along. He likes CIA intrigue and stories that involve Russians. The first 20 minutes or so were great for us to listen to together - until a female character described sexual congress with a big hairy slob of an oligarch in detail.Thanks to driving skills that CIA operatives would envy, I did not swerve off the road in horror but maintained composure as I cranked the volume down to zero. There is a later brothel kind of scene, the introduction of a long handled hairbrush, and more. Very steamy but not in the bodice ripping style.What else gets steamed up? Clams and shrimp do -with garlic, minced green scallions, cumin, melted butter, and pasta. Food shows up on a regular basis. In a pretty odd little trick, every single chapter ends with a recipe - yes, a recipe - for one of the meals eaten in that section. Very random but kind of cute too.There are multiple roles for strong females in the story, and that makes The Red Sparrow a nice departure from the old school espionage novels. There are some sly one liners that actually had me snort a little bit, and the laughter - along with the recipes - made me respect that the author doesn't take himself too seriously. The humor was well placed. I noted that this is part of a trilogy, and while the second and third sections might be an enjoyable ride, I will instead track down the movie adaptation with Jennifer Lawrence. Without my 15 year old watching!! #thathairbrush"}, {"userName": "Bob", "userReviewDate": "Apr 03, 2013", "userURL": "http://www.goodreads.com/user/show/2820496-bob", "userReview": "4 1/2 Stars -- Definitely Worth Reading But You'll Need To Be Patient With ItI received an ARC of this book from Net Galley and the publisher in return for an honest review, which follows.I am an avid reader of thrillers and am particularly of espionage thrillers. So, I figured that Red Sparrow would be \"right up my alley.\" However,the book's slow pace during the first hundred pages orso kept me undecided as to whether I was liking it or not. This is because it took me awhile to get used to the fact that Red Sparrow wasn't going to be a book filled with lots of physical action -- e.g., fist fights, gun fights, killings, dramatic car chases, etc.-- that I've come to expect from books of this type.Soon after, however, I realized that Red Sparrow is an espionage thriller that is several notches above the typical book in this genre. It is filled with many fully dimensional, credible characters, and location descriptions that makes you feel that you are there experiencing all of the deceptions, schemes, and double crosses involving the various CIA and Russian intelligence agents and politicians --some of whom are moles for both sides. Further, it becomes quickly obvious that first-time author and former CIA operative, Jason Matthews, really knows his subject matter, as Red Sparrow is filled with an abundance of information about the inner workings within both the U.S. and Russian intelligence organizations that is not only interesting, it serves to create an atmosphere that keeps the reader shaking their head in wonder.As if this isn't enough to entice you to read Red Sparrow, perhaps the following facts will convince you to do so: (1) two of its main characters, CIA agent Nathaniel Nash and Russian agent Dominika Egorova, will stay in your mind long after finishing the book, and will have you looking forward to the author writing at least one more book featuring them to find out what the future holds for them; and (2) its plot is filled with enough twists and turns to keep you guessing about what happens next, and an ending by which you will most likely be very surprised.Highly recommended to those thriller readers willing to be patient enough to ultimately finish a book that will make them consider Red Sparrow to be among the better thrillers they are likely to read this year."}, {"userName": "Patricia Williams", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/9569165-patricia-williams", "userReview": "This book was a very hard read for me. I liked the story and I liked the two main characters but there was so much information in the book, it took me forever to get through it. The basic story was very good and I do want to see the movie and would read the second installment of the story, hoping that the author would not have to put so much information in the other books since you have the background. There were even recipes at the end of every chapter! That could be good or bad! They were very interesting also."}, {"userName": "Cullen", "userReviewDate": "Jul 21, 2013", "userURL": "http://www.goodreads.com/user/show/3529662-cullen", "userReview": "I really wanted to like this book, since I feel like I've exhausted all the great espionage and this was getting a lot of buzz because the author is former CIA. I made it just past the halfway point before I had to give up. The initial 100 page of setup was a struggle because virtually every paragraph about the heroine mentions how sexy she is. Then she goes to sex school to really sex up her sexiness. She also has a nearly magical power to read peoples emotions and intentions, which the author tries to make plausible by saying it is a form of Synesthesia. Not only is it painful to have the color of every characters halo described as though it actually meant something, but it is totally unnecessary for the plot. Why can't she just be a really sharp person with great instincts?Once the Russian heroine is a trained sexy spy and is in the same city as her American counterpart I expected things to settle in and get more interesting, which they did for a few chapters. But then some CIA operations go down and the tradecraft and procedures used are so painfully implausible that I just had to quit. Also, each chapter ends with a recipe for some food that was mentioned in that chapter. I don't know why."}, {"userName": "Marty Fried", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/8530205-marty-fried", "userReview": "I enjoyed this a lot. It's a real spy vs spy story with Russians against Americans in fairly modern-day times, with Putin as the Russian president. It's mainly about recruiting moles for each side, with a twist of two spies trying to recruit each other. To make it more interesting, one is a beautiful Russian spy who is very capable. She started out as a dancer, but a competitor knocked her out of that, by breaking her leg. Her uncle was a high-ranking spy, and when she wanted to become a spy, he trained her to be a sort of honey-trap, which they call a Sparrow; since she's Russian, she's a Red Sparrow. But she was able to move beyond this role into a full-fledged spy, with special capabilities that made her a super-star.The author is a retired CIA officer, so I guess he knows a bit about the field, which makes this more interesting, since I assume it's all feasible if not happening. I'm looking forward to reading more in this series."}, {"userName": "Veeral", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/6969151-veeral", "userReview": "Jason Matthews, the author of this book, is a former CIA officer, and unfortunately, he can't keep his bias in check. At all. The CIA are good guys in this book. ALL of them (okay, maybe bar one or two minor characters). Well, Latin America would beg to differ, Mr. Matthews (and many other parts of the world). It's CIA, not NASA. Get off from your high horse.The Russians on the other hand, are EVIL, except those who have turned against their countries and are spying for the USA. The protagonist, Nathaniel Nash of the CIA falls hard for Dominika Egorova, a Russian spy taught in the spycraft of seducing foreign agents. And YAWNNNNN... Sorry... Matthews seems to know the intricate workings of spycraft, I'll give him that, but other than that, there's nothing else in this book which has not been done hundreds of time before this book and with much better results. The plot meanders along, never gets exciting, not limited to but also due to the fact that Matthews tries to cram everything he knows about the CIA in the book.This could have been a much better book."}, {"userName": "Dana Al-Basha دانة الباشا", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/5911504-dana-al-basha", "userReview": "I just watched the trailer starring Jennifer Lawrence as Dominika Egorova and I got to say it's terrifying but sort of exciting. Usually I'm not into such stories, I don't like spy stories but I adore Jennifer! I would love to read this book and watch the movie."}, {"userName": "Libby Chester", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/3815302-libby-chester", "userReview": "I haven’t read a great number of spy novels, but I was very captivated by this one. The movie comes out in March and I wanted to read the book first. ‘Red Sparrow’ by Jason Matthews begins in Moscow with CIA agent, Nathaniel Nash running a covert operation with his Russian double agent known as MARBLE. With a near escape from surveillance teams, we are introduced to the great game between Russia and the US, the post Cold War game of intelligence, trickery, and who can steal the most secrets and gain the most power. Dominika Egorov is our other main protagonist. Forced to leave ballerina school due to a calculated accident, she is out of a job and follows through on her Uncle Vanya’s request for help “by meeting a man and getting to know him.” The request from her Uncle comes on the heels of her father’s death and Uncle Vanya reassures Dominika that he will help her mother stay in her apartment, if Dominika just agrees to help him. Just so happens that Uncle Vanya is the Deputy Director of the Russian Secret Service. Dominika knows her Uncle and knows that they expect her to sleep with this man, Ustinov, the third richest man in Russia or some such. He’s filthy rich anyways. Dominika is in a slump having lost what was to be the career of her life, and at this point, she just doesn’t care, even though she knows her Uncle is not to be trusted. The little romance is aided and abetted by Russian intelligence planners. Matthews sets up quite a scene for Dominika’s entrance into the spy world. On the night of their romantic tryst, Ustinov takes her to his apartment, a penthouse in the “Golden Mile section of the Arbat.” In the middle of the room, a circular bed sets up on a platform. A wall is lined with mirrors. A star filled sky takes the place of the ceiling when Ustinov uses a remote. As they begin making love, Ustinov pushes another button and the room is suffused with red lights that pulsate as the bed begins revolving. Dominika’s thought, “God preserve us from gangsters.”Haha. Matthews inserts these little tidbits of humor in just the right places. Suffice it to say that the reader does not laugh long as assassins soon almost decapitate Ustinov with a wire garrote and Dominika is covered with blood. Now, Dominika knows a dangerous secret. Ustinov’s assassination was ordered by none other than Putin. Vanya thinks he will either have to get rid of her or bring her into the service. Eventually, Dominika will be enrolled in Sparrow School, where women and men are taught the art of seduction as a way to win secrets from the ‘other side.’ One of my favorite parts of this novel is that Matthews lets the reader have insider knowledge. When Nash and Dominika are going to meet, the reader knows that Nash is her target. But oh what fun it is that Nash is completely oblivious at first as to Dominika's true identity. He's a CIA officer, but he doesn't realize he's her target. Matthews details a credible journey for both Nash and Dominika. As a retired officer from the CIA, he shows his insider knowledge throughout the novel. Yes, it’s true that the Americans are depicted as good guys and the Russians, other than Dominika and MARBLE are mostly depicted as bad guys. Some would argue that’s okay, others that it’s not entirely credible. I think it’s not entirely credible but for me it was okay, because he shows the duplicitous nature of both sides, the nature of the business. It becomes one of Dominika’s main questions, what is the real difference in the two sides. They both use people to their advantage. The end of the novel answers this question, at least it did for me. There are graphic scenes of torture that were difficult to read. This was a Russian activity in this novel and one wishes that it could only be so. It was difficult for me to sink into the book for about the first thirty or so pages. Partly, I think because of getting used to a lot of Russian names and the lexicon of the spy world. After that, I was interested. This was a book I could down, but one that I looked forward to picking back up."}, {"userName": "Amorak Huey", "userReviewDate": "Jul 08, 2013", "userURL": "http://www.goodreads.com/user/show/7152482-amorak-huey", "userReview": "A decent spy story hampered by an excruciatingly slow start. Takes 100+ pages for the two main characters -- Nate of the CIA, Dominika of some Russian agency -- to end up in the same city, and even longer before they end up in the same bed. It's a tedious courtship.The third act is pretty exciting, with the high stakes and cool tradecraft stuff you want in a spy novel, but there's far too much backstory before we get there. And Matthews seems unsure of whose story he's trying to tell, offering too many points of view without any central narrative arc tied to a particular character. Dominika is the most compelling figure, but she has too little control over any of her own actions to be a true protagonist: she is buffeted by the whims and decisions of the men around her, on both sides. Nate is wishy-washy and dull, and even Matthews seems to weary of him, as Nate fades into the background at the end of the book, and another CIA agent takes over as the main figures on the American side. There are characters on the Russian side, too, mostly rendered as Soviet Era stereotypes: ambitious, paranoid bureaucrats.Also, I would be remiss not to complain about the recipes. Yes, recipes. At the end of every chapter, Matthews offers a recipe for some food that appeared in the previous chapter. It's a HORRIBLE decision, and I can't believe the publisher went with it. The recipes entirely wrecks the suspension of disbelief. Just as you're trying to feel immersed in the narrative, here's another stupid recipe to remind you that this is just a book. And then you start noticing the food in every chapter, how forced it sometimes feels because every chapter has to have someone eating something in order for the recipe to appear at the end, so you're jerked out of the story every time someone takes a bite. Like I said, awful decision. Probably one of those things that sounded nifty in a marketing meeting, but in practice is a disaster for the reading experience."}, {"userName": "Kim Kaso", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/39507342-kim-kaso", "userReview": "Read this book in no-time flat, as my dad would say. Very exciting, and timely. Went on the hunt for Palace of Treason, it will be a reward book for finishing some “must reads” this month, and I have The Kremlin’s Candidate just arrived this past week. I imagine Putin, who is a character in all three books, will not be a fan. Think Jason Matthews better watch his six from here on out. This is an excellent spy thriller series, very au courant, excellently drawn characters, action-packed and suspenseful. Am hoping movie lives up to the quality of the book. This is a case where maybe communism is gone, but the totalitarian state is thriving. At one point, Putin is described as a “toxic narcissist”—excellent description—and apparently he thought we needed one of our very own. Oh, and bonus to the excellent plotting & characters—a short recipe at the end of each chapter. Very highly recommended. Dominika & Company are joining the ranks of La Femme Nikita & Smiley’s People in my spy Hall of Fame."}, {"userName": "Skip", "userReviewDate": "Jul 07, 2013", "userURL": "http://www.goodreads.com/user/show/1389748-skip", "userReview": "4.5 stars. An excellent spy thriller. To quote the NY Times: \"there hasn’t been a first-rate American spy novelist who claims to have worked as an intelligence officer ... until now ... he has turned his considerable knowledge of espionage into a startling debut.\" A newly trainer Russian spy, Dominika Egorova, is supposed to recruit Nathaniel Nash, a young CIA officer, handling the Agency’s most important Russian mole. However, she is an independent thinker and refuses to do as she is told. Well written and suspenseful; however, I felt that Dominika's and her close friend's disclosure of a critical secret were not believable nor in keeping with either's personality nor was the retribution, which omitted an intermediary.I forgot two other things I liked about Red Sparrow: Dominka is a color synesthete, which allows her to see what people are really thinking, and the recipes at the end of each chapter, a number of which sounded pretty tasty."}, {"userName": "Valerie Frankel", "userReviewDate": "Aug 15, 2013", "userURL": "http://www.goodreads.com/user/show/11040270-valerie-frankel", "userReview": "No, this author is not the next Le Carre, Graham Greene, or Len Deighton. Yes, he does have considerable knowledge of CIA operational strategies and techniques. But that isn't enough to craft a good story - you also need some believable characters that you can get involved with. I found too much of this book to be trite and stereotypical, from the dark, menacing, unattractive Russians to the fatherly, dignified, handsome Americans. And too many Russian phrases dropped through the narrative, as if that would make it more authentic. Russian Sparrow Dominique is endowed with some special power that allows her to intuit people by the colors of their \"halo\". Oh puhleez! And what is with the so called \"recipes\" at the end of each chapter? I found this book to be tedious and unfulfilling, but forced myself to stay with it until the end. Alas, it is clearly set up for a sequel."}], "description": "An impossible to put down, highly commercial espionage thriller written by a CIA insider.In today’s Russia, dominated by Prime Minister Vladimir Putin, state intelligence officer Dominika Egorova struggles to survive in the cast-iron bureaucracy of post-Soviet intelligence. Drafted against her will to become a “Sparrow,” a trained seductress in the service, Dominika is assigned to operate against Nathaniel Nash, a first-tour CIA officer who handles the CIA’s most sensitive penetration of Russian intelligence. The two young intelligence officers, trained in their respective spy schools, collide in a charged atmosphere of tradecraft, deception, and inevitably, a forbidden spiral of carnal attraction that threatens their careers and the security of America’s valuable mole in Moscow. Seeking revenge against her soulless masters, Dominika begins a fatal double life, recruited by the CIA to ferret out a high-level traitor in Washington; hunt down a Russian illegal buried deep in the U.S. military and, against all odds, to return to Moscow as the new-generation penetration of Putin’s intelligence service. Dominika and Nathaniel’s impossible love affair and twisted spy game come to a deadly conclusion in the shocking climax of this electrifying, up-to-the minute spy thriller.", "title": "Red Sparrow\n      \n          (Red Sparrow Trilogy #1)", "url": "http://www.goodreads.com/book/show/17450194-red-sparrow", "average": 4.01, "cover": "https://images.gr-assets.com/books/1362019836l/17450194.jpg", "reviews": 2595, "authors": [{"url": "https://www.goodreads.com/author/show/6903512.Jason_Matthews", "name": "Jason  Matthews"}], "type": ["Fiction", "Thriller", "Mystery", "Spy Thriller", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/17450194-red-sparrow", "http://www.goodreads.com/book/show/15803037-red-sparrow", "http://www.goodreads.com/book/show/22568804-nome-in-codice", "http://www.goodreads.com/book/show/34466497-red-sparrow", "http://www.goodreads.com/book/show/16032770-red-sparrow", "http://www.goodreads.com/book/show/36242921-red-sparrow", "http://www.goodreads.com/book/show/22609257-palace-of-treason", "http://www.goodreads.com/book/show/30753713-the-kremlin-s-candidate", "http://www.goodreads.com/book/show/25110940-strangers-on-a-bridge"]}