{"ratings": 21353, "userreviews": [{"userName": "Aubrey", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "“If you were born in a country or at a time not only when nobody comes to kill your wife and your children, but also nobody comes to ask you to kill the wives and children of others, then render thanks to God and go in peace. But always keep this thought in mind: you might be luckier than I, but you’re not a better person.”-Jonathan Littell, The Kindly Ones\nThis is war. This is not honor. This is not glory. This is not right. This is not just. This is not a game played with lives and loves and delineations of mind and body, a board set with pieces played on the country level for some concept of 'stability' that takes very little to destabilize. This is war.This is an experiment on a grand scale, a love-fest for the more academically inclined, 'interesting material' in the battered bodies and broken souls spit up out of a gigantic machine that has no rhyme or reason. This is the result of masculinity bred on stories of adventure and physical expertise, on shutting up and slimming down the emotions into unfeeling heroics and righteous fury, on boyhood dreams of being 'brave', let loose in comradeship in the face of corpses spit up in your face and death walking the grounds and laughing at your pitiful attempts to cope and spurring you on to love, but not too much. This is the immovable object meeting the oh so movable minds to the point of triumphing over matter, legs that refuse to move, tongues that refuse to speak, screams and cries and shrieks bleeding out of consciences that cannot reason out why and refuse to consider anything but the 'rational explanation'.Tell me, what is rationality? What is sanity? What is the standard of normality you will grade these atrocities on with so much undeniable proof shambling towards you on sewn up sleeves, crawling towards you with so many stories to tell, if they can bear to speak them. If you can bear to listen. If you are capable of sticking to the lines and the rules set down by those before you, no matter how much they stretch and bleed and trap you in nightmares that have no single 'trauma' to explain them. As if humanity can only be broken by a singularity of a specific magnitude of horror, calibrated by those who know nothing of it. Rationality is taking in these fractured relics, these twisted meshes of screams and bones, these tortured playthings of those who have been permitted to control countries, and fixing them. Focusing on the physical, and belittling the mental. Acknowledging the atrocious hypocrisy of the system, and sending those who have suffered the worst of it right back into its jaws. Seeing the similarities between gradations of neuroses on the battlefield and hysterics during peacetime, and doing nothing. Playing god because god help us there is no other recourse left to take that will end in maintenance of our own 'rationality'. Let us have those who make the decisions be the ones who must watch those who die. Let us have those who send them out be the ones who must put them back together. Let us have those who love war be the ones to come to grips with the futility of rational thought. Let us have those who believe that violence in the name of one's country and conceptions of masculinity is just be the ones who must cope when all the rules are shredded by the reality and life is a trap between barbed wire and the endless sea. Let us have those who want it, have it. Have all of it. Every last and horrific part.In today's world, the leading cause of death in active duty U.S. military personnel is suicide. We haven't learned much since in the past century, despite those who have seen the terror before them and the terror behind and have as a last ditch effort left us writing, the truth of the matter. When will we look at these accounts and start to think:\nNothing can justify this, he'd thought. Nothing nothing nothing.\n Who knows.\nWhen I’m asleep, dreaming and drowsed and warm,They come, the homeless ones, the noiseless dead.While the dim charging breakers of the stormRumble and drone and bellow overhead,Out of the gloom they gather about my bead.They whisper to my heart; their thoughts are mine.‘Why are you here with all your watches ended?‘From Ypres to Frise we sought you in the line.’In bitter safety I awake, unfriended;And while the dawn begins with slashing rainI think of the Battalion in the mud.‘When are you going back to them again?‘Are they not still your brothers through our blood?’-Siegfried Sassoon, 'Sick Leave'"}, {"userName": "Stephanie", "userReviewDate": "Sep 21, 2009", "userURL": "http://www.goodreads.com/user/show/2708925-stephanie", "userReview": "I am not giving this book one star because I find the subject matter troubling or because I'm not used to required reading.I am giving this book one star because it is overrated, self-serving junk. Pat Barker has plucked from history characters that were perfectly capable of speaking for themselves (we know this because most of them were writers) and forced into them her own flat, inexperienced voice. It seems as though, for many people, the book's politics make up for its nonexistent plot, endless pages of armchair psychology, and woefully thin characters.For me, it doesn't Regeneration fails on every level. It fails to connect the reader with the horrors of war. It fails to present convincing portraits of the historic figures it borrows. It fails to provide insight into the psychology of returning soldiers. It fails to present any sort of meaningful, cogent philosophical statement aside from \"War Sucks\".As a matter of fact, the only thing it has succeeded at is convincing me that the judges for the Booker Prize select its winners by lottery, without actually having read more than a few paragraphs of each title.The book begins promisingly enough, with a letter written by Siegfried Sassoon denouncing the war, the introduction of Dr. Rivers, and Siegfried's arrival at the hospital. The beginning has you believe, for a few brief pages, that the book will be a deep, carefully executed statement about protest during war time and the underhanded ways in which such protest was silenced. However, the novel quickly dissolves into a turgid pseudo-psychological mess.Pat Barker is not a psychologist. She has no experience working with veterans and knows absolutely nothing about post-war psychology beyond what she's culled from other books on the subject. Consequently, her characters are sketches; their afflictions are heavily repeated generalizations. The reader is presented with a roll call of \"things that are bad that could happen to soldiers\" without being given the opportunity to connect or sympathize with any of the patients. This approach has an almost desensitizing effect, which, I believe, is the exact opposite of what Barker attempted to accomplish with this novel.Regeneration is entirely strung together on these flat psychological portraits and fleeting hints of poetically described gore. The writing is incredibly obvious throughout. If the reader thinks for a moment that a character's actions or thoughts might be a bit confusing or complex, he or she need not worry. Barker spells everything out in great detail. Multiple times. This over explanatory writing style can't even be called a lack of subtlety; it so closely resembles being repeatedly knocked over the head by a bag full of trite, Freudian pop psychology. In fact, just in case the overall theme of the book would have been a mystery to the reader if it'd just contained the original, historical characters, Barker has invented a character whose sheer purpose is to trumpet her voice throughout the novel. Billy Prior's only purpose is to serve as a foil to the two, supposed main characters of the novel. Until he becomes the absolute focus of the entire book. Sassoon's protest is, for all intents and purposes, completely forgotten for more than half the book when the focus shifts to Prior's making witty statements about the war and observations about psychology, which the other main character, Dr. Rivers, is always incredibly impressed by. Often for pages.I find it ironic that Siegfried Sassoon the, again, supposed protagonist despises civilians because of their ignorance and because of the callous way that they allow the war to continue. Pat Barker is ultimately as ignorant as any civilian in this book and proves this with her bludgeon-like attempts at characterization.The love interest for Billy Prior, Sarah, seems more like Barker's slim justification for writing the novel than an actual character. A bad attempt at connecting the civilian experience with the overseas one. There is a particularly annoying sequence where this character is lost in a hospital, runs into amputees, and finds the whole mess senseless, thereby coming to the same philosophical conclusion about the war as Prior, etc. As though getting lost in a hospital is equivalent to getting lost in the trenches. As though Barker's researching Sassoon's war experience is equivalent to Sassoon's having lived through it.This book is, ultimately, a sorry excuse for literature. People would be much better served reading the actual poetry of Siegfried Sassoon than reading Barker's shoddy attempt at explaining his psyche."}, {"userName": "Lisa", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "My experience with this World War I trilogy is bumpy, to say the least.Starting by reading The Ghost Road without knowing it was the last in the series, I was not impressed. I have difficulties with historical fiction which mixes fictional characters with historical persons in a speculative interpretation of history. But considering the unfairness of judging a series after reading only the conclusion, I now embarked on the first one. Thus I find myself doing what Carol Ann Duffy did with the most famous Wilfred Owen poem: spinning history backwards.The Last Post, by Carol Ann Duffy:\"In all my dreams, before my helpless sight,He plunges at me, guttering, choking droning.If poetry could tell it backwards, true, beginthat moment shrapnel scythed you to the stinking mud...but you get up amazed, watch bled bad bloodrun upwards from the slime into its wounds;see lines and lines of British boys rewindback to their trenches, kiss the photographs from home -mothers, sweethearts, sisters, younger brothersnot entering the story nowto die and die and dieDulce - No - Decorum - No - Pro patria moriYou walk away.You walk away; drop your gun (fixed bayonet)like all your mates do too -Harry, Tommy, Wilfred, Bert -and light a cigarette.There's coffee in the square,warm French breadand all those thousands deadare shaking dried mud from their hairand queuing up for home. Freshly alive,a lad plays Tipperary to the crowd, releasedfrom History; the glistening, healthy horses fit for heroes, kings.You lean against a wall,your several million lives still possibleand crammed with love, work, children talent, English beer, good food.You see the poet tuck away his pocket-book and smile.If poetry could truly write it backwards,then it would.\"The problem is that it is not possible, really. History can't be unwritten, or rewritten. And my issue with the third, Booker winning part of the series is accentuated and deepened by reading the first volume: I don't like this kind of historical fiction, and my dislike grows deeper with every novel I try. I prefer reading the authors who experienced the time themselves, thus giving authentic testimony, OR historians who keep to objective documentation, analysing the primary and secondary sources in their complexity and completeness, rather than through the lens of a biased fictional character, mingling with historical persons. A mix of those two approaches is not for me.So that leaves the question open: should I skip the middle? Having started with the end, then reluctantly moved backwards to the start, is it worthwhile to work my way through the action of the second in order to close the circle?Or should I leave it wide open and read more Sassoon firsthand instead? The Poems Of Wilfred Owen, in the forwards direction, that is, I know almost by heart.\"Bent double, like old beggars under sacks, Knock-kneed, coughing like hags, we cursed through sludge, Till on the haunting flares we turned our backs, And towards our distant rest began to trudge. Men marched asleep. Many had lost their boots, But limped on, blood-shod. All went lame; all blind; Drunk with fatigue; deaf even to the hoots Of gas-shells dropping softly behind. Gas! GAS! Quick, boys!—An ecstasy of fumbling Fitting the clumsy helmets just in time, But someone still was yelling out and stumbling And flound’ring like a man in fire or lime.—Dim through the misty panes and thick green light, As under a green sea, I saw him drowning. In all my dreams before my helpless sight, He plunges at me, guttering, choking, drowning. If in some smothering dreams, you too could pace Behind the wagon that we flung him in, And watch the white eyes writhing in his face, His hanging face, like a devil’s sick of sin; If you could hear, at every jolt, the blood Come gargling from the froth-corrupted lungs, Obscene as cancer, bitter as the cud Of vile, incurable sores on innocent tongues,— My friend, you would not tell with such high zest To children ardent for some desperate glory, The old Lie: Dulce et decorum est Pro patria mori.\""}, {"userName": "Michael", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "It has been more than four years since I read this novel. Thus, I am now just contributing impressions and integrating some background on the historical characters brought to life in the book. For a fresh and rich thematic response to the book, I would I recommend highly the reviews by Steve Sckenda and James Henderson. I appreciated the in-depth character study of William Rivers, the psychologist treating shell shock victims at Craiglockhart War Hospital. His empathy for those broken men and the efforts he took to help them “regenerate” was remarkable. The book included some on how his experience with field ethnology among the Melanesians made him sensitive to mythic and cultural themes in his patients’ disorders. The key drama in the book concerned the moral dilemmas he faced due to success in his treatments leading to his patients being shipped back to the front. Such was the case of two of his famous cases he treated, that of poet soldiers Siegfried Sassoon and Wilfred Owen. In the case of the former, he was not in treatment for shell shock but under medical review after a protest statement he published in the newspaper while home on leave in 1917: Finished with the War: A Soldier’s DeclarationI am making this statement as an act of willful defiance of military authority, because I believe the war is being deliberately prolonged by those who have the power to end it.I am a soldier, convinced that I am acting on behalf of soldiers. I believe that this war upon which I entered as a war of defense and liberation, has now become a war of aggression and conquest. I believe that the purposes for which I and my fellow soldiers entered upon this was should have been so clearly stated as to have made it impossible to change them, and that, had this been done, the objects which actuated us would now be attainable by negotiation. …His friend Robert Graves had pulled strings of influence so he would get a medical review rather than a court martial. Barker does well in bringing to life a portrait of Rivers friendship with Sassoon, as well as the friendship Sassoon forged with Owen. To some extent we get a believable vision of critical encouragement that Sassoon provided to Owen over his writing. A reader’s dream of insight on their poetic vision is, as to be expected, unfulfilled. The context of Sassoon’s case was brought out in Hochschild’s book To End All Wars: Loyalty and Rebellion. Anti-war activists Bertrand Russell helped him draft his statement and Sylvia Pankhurst published it in her newsletter. Sassoon’s expectation was that a public court marshal would give him a platform for his message, while Russell and Pankhurst hoped that would trigger a movement of soldiers to follow the Bolshevik’s lead of laying down their weapons. Instead, the War Office a public statement proclaimed, “Sassoon has been reported by the medical board as not being responsible for his action, as he was suffering from a nervous breakdown.” Eventually, Sassoon chose to return to fighting at the front, noting in his diary that “I am only here to look after some men.” Hochschild summarizes: “It was a haunting reminder of the fierce power of group loyalty over that of political conviction—and all the more so because it came from someone who had not in the slightest changed, nor ever in his life would change, his belief that his country’s supposed war aims were fraudulent.”.The fate of Owen is too tragic for words. Hochschild summarizes:At only 25, Wilfred Owen had never published a book but had his notebooks the finest body of poetry about the experience of war written in the twentieth century. At noon on November 11, an hour into the celebration [of the peace accord], Owen’s mother received the black-bordered War Office telegram telling her that, a week earlier, her son had been killed in action.The background story of W.H.R. Rivers is outlined in a great article in Wikipedia. . He was quite innovative in his approaches for treating what is now called PTSD. Barker captures how he used the “talking cure”to encourage his patients to relive and react to their experiences. Yet, he was no Freudian. Instead of seeing shell shock as relating to psychic neuroses and repressed sexual urges, he saw their trouble as simply related to the fear and trauma of their war experiences. .A quote from a professional source on his accomplishments has it that: Rivers, by pursuing a course of humane treatment, had established two principles that would be embraced by American military psychiatrists in the next war. He had demonstrated, first, that men of unquestioned bravery could succumb to overwhelming fear and, second, that the most effective motivation to overcome that fear was something stronger than patriotism, abstract principles, or hatred of the enemy. It was the love of soldiers for one another. The article suggests that even though both Rivers and Sassoon were gay, the propriety at the time makes it plausible that the subject would come up little in their sessions, which in fact is how Barker portrayed the issue in the book. The likelihood that Sassoon might have loved Rivers is also covered in the Wikipedia article. Barker only goes so far as to impute the basic transference effect of Rivers being seen as a father figure. He must have been a great therapist. A friend and colleague summarized the strengths in his character:Rivers was intolerant and sympathetic. He was once compared to Moses laying down the law. The comparison was an apt one, and one side of the truth. The other side of him was his sympathy. It was a sort of power of getting into another man's life and treating it as if it were his own. And yet all the time he made you feel that your life was your own to guide, and above everything that you could if you cared make something important out of it.It turns out that the fictional Billy Prior is more of a main character in each of the three books more than Sassoon. He is a complex, violent, and manipulative character who also had a playful and humane side. Here in “Regeneration” we get a rendering of Rivers working with him, revealing a lot about issues of class in the war:‘I suppose most of them turn you into Daddy, don’t they? Well, I’m a bit too old to be sitting on Daddy’s knee.’‘Kicking him on the shins every time you meet him isn’t generally considered more mature.’‘I see. A negative transference. Is that what you think we’ve got?’‘I hope not.’ Rivers couldn’t altogether conceal his surprise. ‘Where did you learn that term?’‘I can read.’…‘You have to win, don’t you?’Prior stared intently at him. ‘You know, you do a wonderful imitation of a stuffed shirt. And you’re not like that at all, really, are you?’…‘How did you fit in?’Prior’s face shut tight. ‘You mean, did I encounter any snobbery?’‘Yes.’‘Not more than I have here.’Their eyes locked. Rivers said, ‘But you did encounter it?’‘Yes. It’s made perfectly clear when you arrive that some people are more welcome than others. It helps if you have been to the right school. It helps if you hunt, it helps if your shirts are the right colour. Which is a deep shade of khaki, by the way.’…’Do you know, for the first time I realized that somewhere in the back of their …tiny tiny  minds they really do believe the whole thing’s going to end in one big glorious cavalry charge. “Stormed at with shot and shell,/Boldly they rode and well,/Into the jaws of death, Into the mouth of hell …” And all. That. Rubbish.’Rivers noticed that Prior’s face lit up as he quoted the poem. ‘Is it rubbish?’‘Yes. Oh, all right, I was in love with it once. Shall I tell you something about that charge? Just as it was about to start an officer saw three men smoking. He thought that was a bit too casual so he confiscated their sabres and sent them into the charge unarmed. Two of them were killed. The one who survived was flogged the next day. …’ Thus, you can see the book’s content does not draw the reader directly into the drama and horrors of the war. It is a more subtle, indirect take on the impact of war. It explores well the struggle of individuals messed up over the experiences to recover and the unpleasant reality of the medical professionals tasked with facilitating their transition back into harm’s way. Our twisted conceptions of courage and masculinity are elucidated with sensitivity. W.H.R. RiversLt. Siegfried SassoonCraiglockhart War Hospital, in Derby, U.K."}, {"userName": "Richard Derus", "userReviewDate": "Jul 08, 2014", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Rating: 5* of fiveThe Publisher Says: Regeneration, one in Pat Barker's series of novels confronting the psychological effects of World War I, focuses on treatment methods during the war and the story of a decorated English officer sent to a military hospital after publicly declaring he will no longer fight. Yet the novel is much more. Written in sparse prose that is shockingly clear -- the descriptions of electronic treatments are particularly harrowing -- it combines real-life characters and events with fictional ones in a work that examines the insanity of war like no other. Barker also weaves in issues of class and politics in this compactly powerful book. Other books in the series include The Eye in the Door and the Booker Award-winner The Ghost Road.My Review: The Doubleday UK meme, a book a day for July 2014, is the goad I'm using to get through my snit-based unwritten reviews. Today's prompt is to discuss the Great War novel you loved best.This was *hard* because there have been several, two in the past year!, Great War-themed novels that I really love. I spent a sleepless night thinking about this. I re-read portions of both my recent reads that suit the prompt, and as much as I was enwrapt in [The Daughters of Mars], feeling the swirl and ebb of tidal feeling, I was utterly immersed in [Regeneration], I felt I was *there* and I was simply, unaccountably, invisible to the characters and so not remarked upon.I know that Ms. Barker was born in 1943...imagine! 1943! Were there *people* then?...and so could not have witnessed the events that so utterly traumatized Wilfred Owen and Siegfried Sassoon and so many thousands of other men, but you couldn't prove it by this:Sometimes, in the trenches, you get the sense of something, ancient. One trench we held, it had skulls in the side, embedded, like mushrooms. It was actually easier to believe they were men from Marlborough's army, than to think they'd been alive a year ago. It was as if all the other wars had distilled themselves into this war, and that made it something you almost can't challenge. It's like a very deep voice, saying: 'Run along, little man, be glad you've survived'.If that doesn't sound exactly like something a survivor would think, I don't know what does. And yet she's 25 years younger than Armistice Day! Channeling? Spirit possession? Filing clerk for the Akashic Records Office?That last sounds about right...anyway, there we are mise en scene with the survivors, the ones confronting a world that feels empowered to judge them for their responses to stimuli unknown to mere civilians:The way I see it, when you put the uniform on, in effect you sign a contract. And you don't back out of a contract merely because you've changed your mind. You can still speak up for your principles, you can still argue against the ones you're being made to fight for, but in the end you do the job.Doesn't that sound like someone who hasn't had to do the job issuing a pronunciamento? An armchair warrior speaking from the privileged place of one who is defended, not one who defends. It was ever thus.What a horror, then, to be trapped between a world that you fought to save, and that world's utter inability and complete unwillingness to learn what you lived:This reinforced Rivers’s view that it was prolonged strain, immobility and helplessness that did the damage, and not the sudden shocks or bizarre horrors that the patients themselves were inclined to point to as the explanation for their condition. That would help to account for the greater prevalence of anxiety neuroses and hysterical disorders in women in peacetime, since their relatively more confined lives gave them fewer opportunities of reacting to stress in active and constructive ways. Any explanation of war neurosis must account for the fact that this apparently intensely masculine life of war and danger and hardship produced in men the same disorders that women suffered from in peace.That kind of knowledge would devastate Society! Undermine the Divinely Ordained Rules! Heresy!! It must be the case that these damaged men were weak, weak I say, unmanly and unworthy! It cannot be that what they lived through damaged them by its nature, or else codified gender (and skin-color) inequality is Wrong. And we all know that it is Right!Ugh. But blessedly, the Great War began a process of (wrenching, painful) psychic change that the Ruling Elite has been resisting, beating back, discrediting at every opportunity, and with increasing success, for 95 years:It was... the Great White God de-throned, I suppose. Because we did, we quite unselfconsciously assumed we were the measure of all things. That was how we approached them. And suddenly I saw that we weren't the measure of all things, but that there was no measure.Look at the returned Iraq War and Afghan War veterans...disillusioned, mutilated in body and in soul even when bodies are whole, record numbers of veteran suicides stand to our national, human discredit, exactly as they did then, and all because:You know you're walking around with a mask on, and you desperately want to take it off and you can't because everybody else thinks it's your face.If that sentence does not make you weep actual physical tears of helpless sadness and empathetic misery, you are wanting in basic human kindness.In the end, the reason I selected this book as my favorite Great War novel ahead of all others, is this simple distillation of the pointlessness of war in the face of its costs:And as soon as you accepted that the man’s breakdown was a consequence of his war experience rather than his own innate weakness, then inevitably the war became the issue. And the therapy was a test, not only of the genuineness of the individual’s symptoms, but also of the validity of the demands the war was making on him. Rivers had survived partly by suppressing his awareness of this. But then along came Sassoon and made the justifiability of the war a matter for constant, open debate, and that suppression was no longer possible.\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License."}, {"userName": "Ted", "userReviewDate": "Jan 03, 2012", "userURL": "http://www.goodreads.com/user/show/7213075-ted", "userReview": "I have found all of Pat Barker's books that I have read fascinating, and I especially like the Regeneration trilogy. (Regeneration, The Eye In The Door, The Ghost Road) These novels, about the psychological toll that World War I exacted on some of its (at least temporary) survivors, are wrenching. I've always been fascinated by World War I, especially from the English perspective. What a way to start the twentieth century; and of course, rather than a war to end wars, it was merely an introduction to the horrors that we encountered as the century wore on.For a heart-rending description of the Europe which the first world war put an end to, check out Stefan Zweig's The World of Yesterday, which I would rate as one of the most affecting books I have ever read.. . . . . . . . . . . . . . . . . . . .Previous review: Prodigal Summer KingsolverRandom review: Cuz: The Life and Times of Michael ANext review: Resurrection TolstoyPrevious library review: WeaveworldNext library review: The Eye in the Door"}, {"userName": "·Karen·", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/1652898-karen", "userReview": "Everyone SangEveryone suddenly burst out singing;And I was filled with such delightAs prisoned birds must find in freedom,Winging wildly across the whiteOrchards and dark-green fields; on--on--and out of sight.Everyone's voice was suddenly lifted;And beauty came like the setting sun:My heart was shaken with tears; and horrorDrifted away ... O, but EveryoneWas a bird; and the song was wordless; the singing will never be done.Siegfried SassoonFreedom, winging wildly. Young Siegfried must have felt that freedom. From a privileged, wealthy background he was able to go down from Cambridge without a degree and without worry about how to make a living: a small private income afforded him the liberty of the English country gentleman, the luxury of spending his days doing exactly what he wanted, which was mostly hunting, playing cricket and writing poetry.The Great War transformed him. What was inside him, what lunacy turned him into 'Mad Jack', suicidal in his bravery, an inspiration to the men he was in charge of, the men who felt confidence coming off him in waves like the smell of sweat? How much confidence was needed, how much dizzy freedom did he find: to stand up in 1917 and declare, in an act of 'wilful defiance of military authority' I have seen and endured the sufferings of the troops, and I can no longer be a party to prolong these sufferings for ends which I believe to be evil and unjust. I am not protesting against the conduct of the war, but against the political errors and insincerities for which the fighting men are being sacrificed. He must have assumed that his voice would not remain a solo, that everyone's voice would be suddenly lifted. But the singing will never be done.The chorus offered him a stark choice: Court-Martial or Craiglockhart. Pat Barker chooses not to place Sassoon at the centre of her novel, nor indeed anyone with direct experience of war, but the intelligent, analytical, compassionate observer, in the figure of Dr W.H.R. Rivers, psychologist and anthropologist at the military psychiatric hospital in Edinburgh. Someone we would like to feel we resemble, someone we would like to feel we can trust. Slowly, Rivers begins to question what he is doing, the quandary of regenerating these damaged young men merely in order to send them back to feed the unleashed dogs of war. A shift is traced through the pages of this novel: much has been made of the over-strong contrast between the sober, gentle empathy of Rivers and the inhumanity of Yealland, but the shift I saw is not from cruelty to kindness in the treatment of mental patients, that would be too straight a line and probably anachronistic. The shifts I see are fuzzier, less straightforward, but seep through the pages in subtly swirling colours. Uncomfortable questions are asked: how much emotion is a real man allowed to feel? Are men allowed to admit to feelings of grief, loss, love for their comrades? Does this feminise them? What is manly love? How much power is a woman allowed, over her body, over her choices, over her desires? In the crucible of war, individuals are transformed. Gender roles, ideas, societies are transformed. There is horror, of course, the horror. And perhaps a little singing. Just a little, in the end."}, {"userName": "Paul", "userReviewDate": "Jul 11, 2014", "userURL": "http://www.goodreads.com/user/show/4643325-paul", "userReview": "The first volume in Pat Barker’s First World War trilogy; and what an excellent start and a brilliant weaving of fact and fiction. I already knew about Craiglockhart and the hospital for those with “shellshock” and breakdown with the pioneering psychologist Rivers. Siegfried Sassoon’s stay there is well documented in Max Egremont’s excellent biography. He is a central part of this novel and his interactions with Rivers and Wilfred Owen (whom he encouraged to write poetry). Robert Graves also pops up; he tried to shield Sassoon from the results of his declaration. Sassoon was highly decorated (he had a Military cross), but he was disillusioned with the war and sent a declaration to The Times;“I am making this statement as an act of wilful defiance of military authority because I believe that the war is being deliberately prolonged by those who have the power to end it. I am a soldier, convinced that I am acting on behalf of soldiers. I believe that the war upon which I entered as a war of defence and liberation has now become a war of aggression and conquest. I believe that the purposes for which I and my fellow soldiers entered upon this war should have been so clearly stated as to have made it impossible to change them and that had this been done the objects which actuated us would now be attainable by negotiation.I have seen and endured the sufferings of the troops and I can no longer be a party to prolong these sufferings for ends which I believe to be evil and unjust. I am not protesting against the conduct of the war, but against the political errors and insincerities for which the fighting men are being sacrificed.On behalf of those who are suffering now, I make this protest against the deception which is being practised upon them; also I believe it may help to destroy the callous complacency with which the majority of those at home regard the continuance of agonies which they do not share and which they have not enough imagination to realize.”It is worth quoting in full and Barker starts the book with it. Sassoon’s friend Graves realized that Sassoon was heading for a court martial and applied to the medical board (Sassoon had been wounded) to persuade them that Sassoon was suffering from shellshock. Barker tells Sassoon’s story; his homosexuality is hinted at and his talks with Rivers are well imagined. Owen and Graves are minor characters but add a great deal to the novel. As do the fictional characters who are brilliantly drawn, especially Prior.Barker makes some interesting points about what we now call PTSD. Women had long been pigeonholed as being prone to “hysteria” in its many forms and the men who suffered from the same type of ailment were handled very differently and quietly. The First World War with its horrors and sheer brutality produced men suffering from PTSD and it was the sheer numbers that meant the issue could not be ignored. Barker contrasts the humane and modern approach favoured by Rivers with other more brutal approaches. Barker presents many of the ideas in flux at the time and what is most prescient is the very modernity and relevance to the present conflicts we have been contending with in our generation.There is a myth that the Great War changed everything and people woke up to the nature of war; we know it isn’t so unfortunately. Barker manages to make it quite difficult to disentangle the strands of fact and fiction she sets up; but she does a very good job of conveying the horrors of war in a subtle way; this is not boring history or historical fiction; it is a mirror for humanity to look into and see the obscenity of war."}, {"userName": "Shovelmonkey1", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/3926982-shovelmonkey1", "userReview": "World War I and World War II were very different kinds of war. If you peak around the edges of history, from an outside perspective, it may not seem so. And admittedly World War I and World War II were notably linked by the repeat performance given by a number of major players who exhibited short fuses and shorter memories over a period of less than twenty years. War is war you may think; people are engaged in mind blowingly brutal acts of killing and survival, reduced to pinprick statistics of life and death within a swarming mass of uniforms. There are many different ways to die and the human mind is unfortunately capable of spilling forth a veritable cornucopia of cruelty and viciousness regarding ways in which to dispatch its fellow man. The 20th century provided a number of chilling showcases for such inventiveness. I think it would be too depressing to enumerate them all here and the goodreads character limit might even kick in before I’d finished to list. Pat Barker’s Regeneration Trilogy approaches World War I from the other side and instead of leading us across the bloodied fields of Ypres, Flanders, Mons, Loos and the Somme, we start at the Craiglockhart War Hospital outside Edinburgh where men are being treated for shell-shock, trench fever and a thousand connotations of the nervous twitching horror generated by being forced to lie in a shallow trench, largely propped, buttressed and constructed from the frozen or decomposing bodies of your own squadron, friends and family, while you wait to see whether the next shell will ensure your place as part of the trench architecture. Focusing on the chance meeting of war poets, Wilfred Owen and soldier turned pacifist Siegfried Sassoon on the ward at Craiglockhart hospital, the story also weaves in the ideas of mental and physical healing. As well as examining the roles of man as soldier it fits the conscientious objectors, the fathers, the sons, the homosexuals, the deserters, the pacifists and those too old to fight into the complex machinery of the impersonal war machine. This is a time when mans role in British Society has been reduced to the simple status of soldier or civilian, where you must be able to provide a damned good reason for still being the latter. A surprisingly compelling read with powerful themes and a good start to the award winning trilogy."}, {"userName": "Dawn (& Ron)", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/2447325-dawn-ron", "userReview": "Upon finishing the book, my mind was absolutely quiet, almost numb, as if there were too many thoughts to assimilate and I needed to let it all soak in. Like the patients with their experiences, this book can't be rushed, you can't quickly brush past one passage to go the next. Each person's thoughts and memories need to marinate, allowing their individual flavors to meld together, in order to enjoy its overall affect. It is profound and thought provoking, and deserves to be mentioned along side the best of anti-war literature, All Quiet on the Western Front and The Red Badge of Courage. Pat Barker's Regeneration, first of her WWI trilogy, goes even deeper into the heart, mind and souls, of not only the men who fought, but of the people affected by the Great War.\"They'd been trained to identify emotional repression, as the essence of manliness. Men who broke down, or cried, or admitted to feeling fear, were sissies, weaklings, failures. Not men.\"The book centers on poet Siegfried Sassoon's stay at Craiglockhart War Hospital, which in part was orchestrated by his friend and fellow poet Robert Graves, to prevent Sassoon from being court marshaled after his declaration against the continued fighting of The Great War. \"I am making this statement as an act of willful defiance of military authority, because I believe the war is being deliberately prolonged by those who have the power to end it.\" While there for treatment Sassoon befriends and influences another poet, Wilfred Owen. Their friendship may have started out with Wilson's admiration of Sassoon, Barker lets us see it blossom into mutual respect. Wilfred OwenAll this while under the care of respected anthropologist and ground breaking psychiatrist William H. Rivers. He is a man fighting against the established methods, bringing humane treatment into a world where most did not even believe in shell shock. You can feel how seeing these courageous men break affected him and how he was tormented with the job of having to 'cure' them in order to return to the front. Dr. Rivers outside Craiglockhart War HospitalBarker lets the fact that life brought these men together at this point in history shine through in a simple straight forward manner, using her fictional characters to support and explore other aspects of the war and homefront. Through Sarah, a munitions factory worker, we see the female point of view and the changes the war afforded them. Barker's informative author's note, which I recommend not reading until after you've finished the book, brought a deeper level of understanding and an unwanted revelation. I was disappointed to find out that one doctor actually existed and I really rather wish he's remained fictional. His harsh treatments of the servicemen under his care and later detailing this in a book, gave me a new version of Dr. Frankenstein, only this one was sadly all too real. The power of the narrative lies with the patients, the doctors and the War. Who really changed or helped who? The lines blurred, some were helped, some not, some temporarily, some die and some helped in surprising unexpected ways. \"They (women) seemed to have changed so much during the war, to have expanded in all kinds of ways, whereas men over the same period had shrunk into a smaller and smaller space.\"The narrative jumps around between the many characters, in unconnected scenes, and no character list is provided. I made a character list, detailing patients and their mental issues and any connections. Some passages dealing with dissecting symbols in dreams or the psychology behind certain elements can be a bit dry. Religion, homosexuality and sex are woven through, as well as the importance of father and son relationships, the familial ones and those formed through other circumstances. There are no battle scenes, everything takes place at or around Craiglockhart War Hospital, the war is seen through the patient's memories trying to unlock the brutality and carnage to the body and mind. For readers who don't like to keep track of different characters, or like everything cleaned up at the end, this may not be the read for you right now. This is not a light and breezy read and not to be taken lightly, Barker expects a lot from her reader and doesn't disappoint, a solid 4-1/2.1917 painting of SassoonSassoon's Military Cross awarded for gallantry in 1916"}, {"userName": "Joey Woolfardis", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/4639825-joey-woolfardis", "userReview": "I find it a bit difficult to rate this book. In terms of subject matter-mental illness brought on by the First World War-it is one of the most important in history. In terms of the way it was written, it's not the best book by any means. In terms of character, it's quite interesting but lacking. In terms of exploration, it ventures no farther than the shrubbery.The writing was mediocre, in all honesty. The flow of paragraphs was often rather disjointed, though one could attribute that to the whole theme of the novel. I did enjoy the writing and found it readable, though it did not necessarily draw me in nor did it convey to me the acute and substantial severity of the subject matter. It did explore some themes that, even now, people would find difficult to speak about, but often it felt slightly brushed aside in favour of dropping the name of another literary figure.I feel the characters were-although for the most part based on real-life people-rather flat and dull. Even those of them who were critically traumatised by their time on the front-line, there always seemed something background about them. It was interesting to have real-life people as characters, though I am always wary about such things. Biographies are all very well, but fictionalised accounts of their lives or even small parts of their lives should be tentatively approached. I cannot comment on how accurate any portrayals of the WWI poets were, but that matters little since I don't feel like I learnt all that much about them, in any case.The one character whom I found had developed substantially during the novel was Rivers, the psychiatrist treating the mentally war-wounded. His was a character of depth and layers and that was intriguing, but never fully explored. We got inside his mind and sat there rather comfortably, with closed doors all around. More of those doors should have been allowed to open.I suppose, the prose reflected the mental state of the characters in some respects. I feel like more could have been done in parts, or at least tied-off. I believe this is a good novel since the subject matter is no easy one to tackle, but it lacks various things that could have made it so much more. The meagre plot between patient Billy and a factory-working girl Sarah was a shambles and only seemed to be there for the fact that it was the only thing that resembled a true plot-line, but did help in giving an outside-the-hospital view of the patients, which I think was one of the key elements of the book and was taken straight from various sentiments from WWI poets.It gives a glimpse beyond the poetry, which is probably just as important as the poetry itself, but I would say that biographies would tell a much better story, despite them being true life accounts.Blog | Reviews | Instagram | Twitter"}, {"userName": "Jan-Maat", "userReviewDate": "Jun 23, 2011", "userURL": "http://www.goodreads.com/user/show/5617661-jan-maat", "userReview": "Interesting historical novel set in hospital for officers recovering from shellshock during the first world war. I found the portrayals of the historical characters more convincing than the fictional character of Billy Prior, which led me to give up reading the trilogy midway through the second book.The book opened a brief but interesting controversy over the techniques used by Dr Yealland to cure the inability to speak caused by shellshock which some soldiers suffered from during WWI. In Barker's account electric shocks of increasing severity were applied to the back of the throat until the soldiers were able to speak again. In fact he didn't deal with that many patients - less than five hundred over the course of the war. Not all of them were mute, some had temporary deafness or loss of muscle power, nor were all of those affected from front line combat roles, at least one of those treated was serving as a waiter in an officer's mess comfortably behind the lines.Yealland gets a bad press in the novel and this illustrates several basic difficulties of the historical novel in that it deals with its subject ahistorically and it falls into the possibly unavoidable trap of reflecting the state of the historical debate. Yealland was from the colonies, young and relatively inexperienced. More importantly the organisational and social context he was working in stressed the importance of returning men to full time service not a humanistic concern for their personal wellbeing. The entire point of the First World War was that millions of men were fighting for the honour of their countries and the honour of their splendidly titled and decorated Kings and Emperors, their personal well being was secondary to that purpose. My phrasing is off there, its debatable why they fought as individuals, but the King-Emperor, in his gracious telegrams to the departing troops, was certainly kind enough to express the view that they were fighting for his honour and for his empire.Clearly giving people suffering trauma as a result of exposure to the conditions on the western front electric shocks seems barbaric to us now but that seems to ignore the shock to the system of medical care flailing about looking for some kind of effective treatment for what was to them in those days when Freud was a new and radical voice (and a dangerously foreign one at that) an inexplicable condition and to overlook the intrinsic barbarity of the war itself. Horror at the treatment comes across as more horrific than the war itself (although as it happened at least one patient discharged them-self in order to avoid further treatment). Further it misses the point that Faradic treatments and some of the approaches used by Yealland are still in medical use including ideas that the patient's memory of limb use and suggestibility could be used therapeutically. However Yealland's approach naturally looks wrong in an era when patient centred approaches dominate. One wonders how bizarre and terrible our own treatments will look in a hundred years time. Curiously given Barker's humanistic take in her treatment of Yealland she repeats an elitist attitude in looking down on the Canadian colonialist who no less than the other characters she portrays was struggling to do what they believed was the right thing in the face of an overwhelming situation."}, {"userName": "Agnieszka", "userReviewDate": "Jun 23, 2009", "userURL": "http://www.goodreads.com/user/show/2446508-agnieszka", "userReview": "This book is not about heroes. English poetry is not yet fit to speak of them.Nor is it about deeds, or lands, nor anything about glory, honour, might, majesty, dominion, or power, except War... All a poet can do today is warn. That is why the true Poets must be truthful .In 1917 poet Sigfrid Sassoon terrified by the scale of war massacre made a statement called A Soldier's Declaration in which announced that could no longer be a soldier and wouldn’t come back on the front. Because of that he landed in Craiglockhart War Hospital in Scotland for observation. This is a starting point for Pat Barker’s novel Regeneration. Except Sassoon we meet there other historical figures like doctor Rivers and other poets Robert Graves and Wilfred Owen. Poets in trenches. Indeed .You could say that idealism is a natural feature of youth. Obviously. Look at them. Graduates from elite schools and non-educated boys as well. They set off on the war as for a trip, as for a great Adventure, joined the army as a volunteers convinced that dulce et decorum is pro Patria mori, overflowed with enthusiasm, with their hearts filled pictures of brotherhood, sacrifice, honour If I should die, think only this of me That there's some corner of a foreign fieldthat is for ever EnglandMeanwhile had experienced inequality, snobbery, idiotic rules and punishment for its breaking and finally ended in Flanders trenches and dugouts, in waist-deep water, being gassed, waiting for death. So, where is the honour, where’s the glory in that?  What passing-bells for these who die as cattle?  — Only the monstrous anger of the guns.  Only the stuttering rifles' rapid rattle Can patter out their hasty orisons . These who survived, physically and mentally crippled, with eating disorders, with speech defects, haunted by nightmares and hallucinations landed in hospitals for regeneration. That title has an ironic overtone as well, because doctors helped their patients to regenerate, to recover their fragile mental equilibrium in purpose to send them back on the front. In one of the scenes doctor Rivers is watching fresco depicturing Abraham sacrificing his son Isaac to God. There is something symbolical in that. Yes, what a nation, what a government could send own sons for death ? Does such society deserve of our fidelity and trust ?Many people have been killed in that war. And many poets too. We could risk a statement that XX century English literature has began with death of poetry. And experiences of the Great War has symbolically ended the Golden Age. As if, after Flanders fields, after Ypres and Somme, writing sweet poems have been something indecent, as if a literature itself has lost its innocence. But the past is just the same, and War's a bloody game. . . . Have you forgotten yet ? . . . Look down, and swear by the slain of the War that you'll never forget  In Flanders fields the poppies blow Between the crosses, row on row ..."}, {"userName": "Ted", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/7213075-ted", "userReview": "Finished with the WarA Soldier's DeclarationI am making this statement as an act of willful defiance of military authority, because I believe the war is being deliberately prolonged by those who have the power to end it.I am a soldier, convinced that I am acting on behalf of soldiers. I believe that this war, upon which I entered as a war of defense and liberation, has now become a war of aggression and conquest…This is a completely revised review of the book.the first edition (1991) cover, Penguin Books Ltd.So begins Pat Barker's Regeneration trilogy, the series of novels harking back to the second decade of the twentieth century … a series which won acclaim in the last decade of that century as one of the outstanding achievements of serious fiction as the century staggered towards its uneven conclusion. The last book in the trilogy, The Ghost Road, won the Booker prize in 1995The statement quoted above winds down toward the bottom of the first page, where it is signed and dated: \"S. Sassoon, July 1917\".The narrative continues,Bryce waited for Rivers to finish reading before he spoke again. 'The \"S\" stands for \"Siegfried\". Apparently, that was better left out.''And I'm sure he was right.' Rivers folded the paper and ran his fingertips along the edge. 'So they're sending him here?'Bryce smiled. 'Oh, I think it's rather more specific than that. They're sending him toyou.'The two main characters are introduced. Siegfried Sassoon (1886 – 1967), the British poet,Sassoon, May 1915by G.C. Beresford via Wikiand W.H.R. Rivers (1864-1922), British neurologist and psychologist who pioneered the treatment of shell shock during the years of the first World War. During the war Rivers worked at the Craiglockhart War Hospital.Riversfrom WikiBarker's fictionalized versions of these two has been accomplished superbly. The a fictionalized portrait of the poet Wilfrid Owen joins these two in the story. Other characters are built up from psychological reports concerning other patients at Craiglockhart, and still others are entirely fictional.The Wikipedia article on the novel (https://en.wikipedia.org/wiki/Regener...) goes into a lot of detail, including (but not limited to) sections on Background and inspiration, Genre, Characters, Major themes, and Intertextuality. Of course the Plot summary section must be skipped unless you don't care about spoilers.Here's an interesting part of the introductory section, slightly edited.The novel is thematically complex, exploring the effect of the War on identity, masculinity, and social structure. The novel draws extensively on period psychological practices, emphasising River's research as well as Freudian psychology. In the novel Barker enters a particular tradition of representing the experience of World War I in literature: many critics compare the novel to other World War I novels, especially those written by women writers interested in the domestic repercussions of the war, including Rebecca West's The Return of the Soldier (1918) and Virginia Woolf's Mrs. Dalloway (1925). Barker both drew on those texts of the period that initially inspired her and makes references to a number of other literary and cultural works and events. These give an impression of historical realism, even though Barker tends to refute the claim that the novel is \"historical fiction\".It read the book almost twenty years ago, and my memory of the narrative itself is pretty dim. However the experience of reading it is, I'm sure, well-represented by the rating I've given. If any of the above piques your interest, my advice is definitely Go for it!The War Hospital today, part of Edinburgh Napier University. . . . . . . . . . . . . . . . . . . .Previous review: The Lost Sherpa of HappinessNext review: The Ghost RoadOlder review: Death at La FenicePrevious library review: WeaveworldNext library review: The Eye in the Door"}, {"userName": "Larry Bassett", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "I have returned to this book four years later and listened to it in the Audible version. Four years ago I had sought out the other two books in the trilogy expecting to read them but in the interim have Become almost exclusively an audible reader. And now I have those same other two books in the audible versions and believe I have more determination to follow up with them immediately. My experience in rereading this book did not cause me to change my star rating.In the intervening four years I have had some significant events in my pseudo-pacifist life. The primary event has been the inheritance and disbursement of $1 million in inherited income. In two years I will have conscientiously and openly resisted paying approximately 1/4 million dollars in federal income tax while redirecting nearly $200,000 to meet human needs. I have participated in the creation of a documentary titled The Pacifist which will hopefully be completed In early 2018. There is a Facebook group titled The Pacifist with some information about that experience.***********I was attracted to this book because the information about it says it has something to do with pacifism, a state of being that fascinates me and that seems like a good goal in life. I have been a pacifist in my mind for a long time although there is not much of a list of any actual actions I have taken that would brand me as a pacifist. I have joined and supported some pacifist organizations, been a conscientious objector to military taxes and done some pacifist reading. I guess I am a fellow traveler but have not been brave enough to get in water over my head. 2013 is the ninetieth anniversary of the War Resisters League www.warresisters.org, one of the oldest pacifist organizations in the U.S.This book is pathos and humor along with the horror and early 20th century psychology. It is Catch-22 and  One Flew Over the Cuckoo’s Nest  mixed in with Johnny Got His Gun and All Quiet On the Western Front. And I’ll bet you will see a few moments of  Mash  as well. It is certainly not as well known as any of these classics. But it is a book about war written by a woman.It is not a long, dense book – 250 pages – although I did bog down on occasion. It is fairly accessible to a wide audience while still having some intellectual challenge. Although Regeneration is fiction, several of the characters are based on real men, two poets – Siegfried Sassoon and Wilfred Owen – and a doctor – William Rivers. The setting is a hospital in Scotland that is being used to treat British officers who have mental disabilities as a result of The Great War in France. We see men who limbs are paralyzed, whose tongues are muted, whose bodies are contorted, whose dreams terrorize, whose lives have been distorted by the horror of war but who have no physiological damage that can be determined by the best doctors. Many are the classic “shell-shock” that most of us have heard about. That and the poison gas is what has hung on from the First World War for many of us. And the staggering death toll of men who lived in trenches but occasionally were ordered to stand up and walk into machine gun fire.The author suggests that the mental disabilities represent the rebellion of the body against the carnage of battle, the destruction of war. It is the body screaming, “I can’t take it anymore!” The men are hospitalized and their evil spirits are exorcised so that they are fit to return to the front line to kill again and to be killed. The disabilities are the rebellion of the mind to the insanity of life in the No Man’s Land of Somme and Ypres (Flanders). The cure is the likely sentence of death. So the irony in this and any other war is that medicine was a tool that sent men back to war and death. In Regeneration we watch doctors and soldiers struggle with that reality.  “…A few shells, a few corpses, and you’ve lost heart.”“How many corpses?”“The point is . . . ““The point is 102,000 last month alone. You’re right, I am obsessed, I never forget it for a second, and neither should you, Robert, if you had any real courage you wouldn’t acquiesce the way you do.”Graves flushed with anger. “I’m sorry you think that. I should hate to think I’m a coward. I believe in keeping my word. You agreed to serve, Siegfried. Nobody’s asking you to change your opinions, or even to keep quiet about them, but you agreed to serve, and if you want the respect of the kind of people you’re trying to influence – the Bobbies and the Tommies – you’ve got to be seen to keep your word. They won’t understand if you turn around in the middle of the war and say, “I’m sorry, I’ve changed my mind.” To them, that’s just bad form. They’ll say you’re not behaving like a gentleman – and that’s the worst thing they can say about anybody.” And more to the point:  There are many important themes in the book including class distinctions and the importance of poetry, but the most important one is a moral issue: for what are these men being regenerated? The answer is clear: to go back to France and fight again.Source: http://silverseason.wordpress.com/201...Ultimately, the book is about the struggle between war and peace. And arguments are made by the author, interestingly a woman, with certainty:  Obvious choices for the east window: the two bloody bargains on which a civilization claims to be based. The bargain, Rivers thought, looking at Abraham and Isaac. The one on which all patriarchal societies are founded. If you, who are young and strong, will obey me, who am old and weak, even to the extent of being prepared to sacrifice your life, then in the course of time you will peacefully inherit, and be able to exact the same obedience from your sons. Only we’re breaking the bargain, Rivers thought. All over northern France, at this very moment, in trenches and dugouts and flooded shell-holes, the inheritors were dying, not one by one, while old men, and women of all ages, gathered together and sang hymns. . . . A society that devours its own young deserves no automatic and unquestioning allegiance. Perhaps the rebellion of the old might count for rather more than the rebellion of the young. Certainly poor Siegfried’s rebellion hadn’t counted for much, though he reminded himself that he couldn’t know that. It had been a completely honest action and such actions are seeds carried on the wind. Nobody can tell where, or in what circumstances, they will bear fruit. How on earth was Siegfried going to manage in France? His opposition to the war had not changed. If anything it had hardened. And to go back to fight, believing as he did, would be to encounter internal divisions far deeper than anything he’d experienced before. Siegfried’s ‘solution’ was to tell himself that he was going back only to look after some men, but that formula would not survive the realities of France. However devoted to his men’s welfare a platoon commander might be, in the end her is there to kill, and to train other people to kill. Poetry and pacifism are a strange preparation for that role. Though Siegfried has performed it before, and with conspicuous success. But then his hatred of the war had not been as fully fledged, as articulate, as it was now. It was a dilemma with one very obvious way out. Rivers knew, though he had never voiced his knowledge, that Sassoon was going back with the intention of being killed. Partly, no doubt, this was a youthful self-dramatization. I’ll show them. They’ll be sorry. But underneath that, Rivers felt there was a genuine and very deep desire for death. And if death were to be denied? Then he might well break down. A real breakdown this time. Regeneration is the first book in a trilogy and some reviewers have opined that this first book benefits from the further developments in the following books. I thought this was a fine stand alone book but I do have the two follow-on books and expect to read them in due course.I thought that the content of this book was variable. I lost my way a couple of times but to some extent that was my lack of attention. So I had experiences where I could easily put the book down in spite of being in the middle of an episode but there were other instances where I found the book was a page turner. As I have already mentioned, several of the major characters in this novel were based somewhat on real people. One main character, Prior, was evidently wholly fiction and I did not find his role to be obvious. There is an Author’s Note at the end of the book that starts “Fact and fiction are so interwoven in this book that it may help the reader to know what is historical and what is not.” It goes on to indicate some of the distinctions. I wondered why this was at the end rather than at the beginning.There were some five star as well as some three star portions of Regeneration so I take the easy route and award four stars. I felt enough commitment to the book to want to read the second and third books in the trilogy, but I am not engrossed enough to move immediately into book two."}, {"userName": "Brad", "userReviewDate": "Mar 27, 2008", "userURL": "http://www.goodreads.com/user/show/1022982-brad", "userReview": "This review was written in the late nineties (for my eyes only), and it was buried in amongst my things until recently when I uncovered the journal in which it was written. I have transcribed it verbatim from all those years ago (although square brackets may indicate some additional information for the sake of readability or some sort of commentary from now). This is one of my lost reviews.Rarely is a book's theme so fittingly captured in a title than it is with Pat Barker's Regeneration. As Dr. William Rivers heals war victims like Burns, Anderson and Billy Prior, its meaning is obvious, but it is also duplicitous -- connecting also to the manipulation of Seigfriend Sassoon and Rivers' own regeneration of spirit. Barker fills Regeneration with some haunting, unforgettable images: Burns falling face first into the German [soldier]'s exploded stomach; Anderson's collapse at the sight of a nicked cheek (this from having once been a [WWI] surgeon); Prior's eyeball and the question, \"what do I do with this gobstopper?\"; and the most terrible of all, Dr. Yealland's torutre of Callan -- a cure by negative -- Nazi-like -- reinforcement.By setting WWI on the home front, the gravity of its horror is more fully driven into my mind than any film I've ever seen has done. It's a time I'm quite happy to have missed -- at least with this life of mine."}, {"userName": "Cathy (cathepsut)", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/978552-cathy-cathepsut", "userReview": "The Regeneration Trilogy: I read these books in the late '90s, after Ghost Road was first published. I was in love with the British war poets of WWI at the time and this fit right in. I don't remember many details, but these books were great reads. Very athmospheric, accessible and captivating main characters, I suffered with them every step of the way.P.S.: The movie is also very good."}, {"userName": "Sarah", "userReviewDate": "Aug 23, 2012", "userURL": "http://www.goodreads.com/user/show/11818290-sarah", "userReview": "I found this a fascinating book!! I am really interested in anything about medicine and so found the description of early psychological treatments of WWI veterans very interesting. Also, that the whole trilogy is based on fact, on the real life meeting of the poet Sigfried Sassoon and his doctor during his rehabilitation W.H.R. Rivers. I'm looking forward to reading the rest of the series."}, {"userName": "K.D. Absolutely", "userReviewDate": "Dec 11, 2009", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "Edinburg, Scotland, 1917. Siegfried Sassoon, a 31-y/o poet and a decorated soldier started a protest against the ongoing WWI in France. This protest led him to be labeled as \"shell shocked\" and be confined at Craiglockhart Hospital under the care of an army psychiatrist, Dr. Rivers. Among the patients in the hospital were those who were truly suffering from the war trauma: another poet, Wilfred Owen who was able to polish his talent in writing under Sassoon; Billy Prior, an on-off mute who had an affair with a woman during his confinement; and Robert Graves, another patient who became his friend. Graves believed that war was unjust and immoral. This belief was in contradiction to what Sassoon believed at the start of his service as an army.This is the first book of Pat Barker's highly praised trilogy about World War I, Regeneration Trilogy. At first it felt like an small subset of Sebastian Faulks' 1993 novel Birdsong that remains as one of my favorite WWI novels. However, this Regeneration was first published in 1991 so Mr. Faulks might have gotten his idea from this novel. I took me only 2 days to finish up to the last word of page 250 and I thought that I would just give this a 2 stars. However, the Author's Note on the very last page says that at least 4 characters of the novel were real or non-fiction. It Googled them right away. Lo and behold they even had pictures including some colored pictures of the Craiglockhart Hospital! Then the story seemed to come alive in my mind and I could picture the images: Sassoon peeping outside by his hospital room window, Prior and his girlfriend making love, the closet homosexual Sassoon giving pointers to Owen on how to improve his poem, etc. Try reading this novel with Mozart or Beethoven in the background and it will transform you to that era.The novel is multi-layered. First, it is definitely anti-war. Second, it is about bond between men. Homosexuality was still a taboo during that time (even the novel's approach is tacit). Sassoon, even in real life, was described as latent homosexual. Initially, he thought that he only cared for his subordinates but later he developed deeper relationship with another patient, Owen. Third, it is about the humane approach to treating \"shell shocked\" patients. Dr. Rivers was using \"nerve regeneration\" (an approach familiar to the husband of Ms. Barker) while the new doctor was using what seemed to be inhumane approach: electroshock therapy. Lastly, it is about the question on the conscience of Dr. Rivers, who himself is anti-war: is treating patients right when you know that by doing such, he will be going back to the war and be killed?Well done, Ms. Barker! Your Regeneration has definitely joined Birdsong as my favorite WWI novels!"}, {"userName": "Laura", "userReviewDate": "Aug 21, 2008", "userURL": "http://www.goodreads.com/user/show/1040930-laura", "userReview": "For me, this first book in Pat Barker’s trilogy presents a perfect storm of interests — World War I, English poets, and madness. Incorporating actual people and events into the narrative, the novel takes place at Craiglockhart, a hospital outside Edinburgh requisitioned in 1916 as a facility for officers suffering from shell-shock. Supervising the show is Dr. William Rivers, a real-life neurologist, anthropologist, and psychiatrist who pioneered early work in nerve regeneration. One of the central stories concerns the poet Siegfried Sassoon, whose conviction that the war was being unnecessarily prolonged prompted him to publish an inflammatory “Declaration Against the War”. In a shrewd move, the review board realized that court-marshalling such a prominent officer would scandalize and demoralize the public. Instead, they ruled that Sassoon had suffered “a breakdown” and sent him up to Craiglockhart to recuperate. Sassoon’s “treatment” (which consists mainly of playing golf and debating with Dr. Rivers, as he obviously isn’t mentally ill) raises all sorts of interesting questions about the nature of duty and love in wartime. Just as intriguing, though, are the stories of the other patients and Rivers’ attempts to treat their various symptoms of shell-shock, as well as Rivers’ own struggles with the moral facets of his work. This is not a book for the faint of heart; Barker’s sparse prose is the perfect vehicle for searing images of horror and destruction. Plus, as unsavory as war is on its own, it can always be made more unsavory by the personal lives of the soldiers. Nevertheless, Regeneration is intensely gripping and presents a haunting exploration of issues raised by prolonged trench warfare."}, {"userName": "Erwin", "userReviewDate": "Jan 12, 2014", "userURL": "http://www.goodreads.com/user/show/21812440-erwin", "userReview": "Loved this one! A wonderfully subtle novel about the psychological impact of the Great War. The first novel of three. I am looking forward to the next."}, {"userName": "Clif Hostetler", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/793473-clif-hostetler", "userReview": "A case could be made that the misery and suffering endured by those serving in combatant roles by European soldiers of WWI were the most extreme of any war in history. (I explicitly limit this generalization to soldiers from European countries because they were in the trenches for four full years whereas American soldiers were engaged in active combat for less than a year.) This novel is therefore particularly poignant because it provides a psychological study of the consequences of war by telling the story of a British anthropologist serving in the role of a psychiatrist in a mental hospital during WWI who has the duty of rehabilitating mental casualties so that they will be able to return to military service. This setting provides a setting for numerous conversations between doctor and patients during which horrendous memories are being extracted in an effort to facilitate recovery from various types of mental breaks. Most of the book follows the methods of a Mr. Rivers who uses talk therapy methods we would feel comfortable with today. However, late in the book the book's story visits the practice of Dr. Yealland who's methods would be considered brutal and barbaric to today's standards. I was surprised to learn from the Author's Notes at the end of the book that all the main characters in the book, both doctors and patients, were based on actual historical characters. Even one of the scenes in the book where a patient makes modifications to the poems of another patient is based on handwritten marks by that character in an actual early draft of poems later published. After learning how closely it follows actual historical records I changed my classification of the book to historical fiction. Any human society that is mobilized for war by definition is sick; organizing for mass murder can't be good. Therefore this book utilizes a unique handle for exploring the consequences of war on the human mind. It is perhaps a more effective way of explaining the stresses of war than writing about action at the front. This book is first in a trilogy that continues with The Eye in the Door and culminates in The Ghost Road (winner of the 1995 Booker Prize).Some quotations that caught my attention:'I don't know what I am. But I do know I wouldn't want a f-faith that couldn't face the facts.' (p83) '. . . if I were going to call myself a Christian, I'd have to call myself a pacifist as well. I don't think it's possible to c-call youself a C-Christian and . . . and j-just leave out the awkward bits.' (p83)British society was very class conscious so it is ironic that all classes were forced to share the same trenches.\"One of the paradoxes of the war -- one of the many -- was that this most brutal of conflicts should set up a relationship between officers and men that was . . . domestic. Caring. As Layard would undoubtedly have said, maternal. And that was the only trick the war had played. Mobilization. The Great Adventure. They'd been mobilized into holes in the ground so constricted they could hardly move. And the Great Adventure -- the real life equivalent of all the adventure stories they'd devoured as boys -- consisted of crouching in a dugout, waiting to be killed. (p107)I found the following observation interesting because it relates war time mental breakdowns among men with those experiences by women during peace time:\"Pilots, though they did indeed break down, did so less frequently and usually less severely than the men who manned observation balloons. They, floating helplessly above the battlefields, unable either to avoid attack or to defend themselves effectively against it, showed the highest incidence of breakdown of any service. Even including infantry officers. This reinforced Rivers’s view that it was prolonged strain, immobility and helplessness that did the damage, and not the sudden shocks or bizarre horrors that the patients themselves were inclined to point to as the explanation for their condition. That would help to account for the greater prevalence of anxiety neuroses and hysterical disorders in women in peacetime, since their relatively more confined lives gave them fewer opportunities of reacting to stress in active and constructive ways. Any explanation of war neurosis must account for the fact that this apparently intensely masculine life of war and danger and hardship produced in men the same disorders that women suffered from in peace.\"(p222)Some of the psychiatric treatment methods used a hundred years ago are more painful to read about than the battle experiences. It's pretty well summarized by the following quote where a doctor is summarizing his philosophy of treatment:\". . . The last thing these patients need is a sympathetic audience.\"(p228) Thus treatment methods include electrical shock and cigarette burns applied to the tongue."}, {"userName": "Bettie☯", "userReviewDate": "Nov 20, 2011", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "[Bettie's Books (hide spoiler)]"}, {"userName": "Philip", "userReviewDate": "Sep 09, 2008", "userURL": "http://www.goodreads.com/user/show/1391890-philip", "userReview": "In Regeneration, Pat Barker fictionalises an encounter between H. R. Rivers and Siegfrid Sasson in a military psychological hospital. In Craiglockhart, near Edinburgh, there are numerous war wounded, whose experiences in the Flanders trenches of the First World War have left them psychologically, as well as sometimes physically scarred. The symptoms are many and varied. In Sassoon´s case it is possible that the motivation might even be political, rather than psychological.Rivers attempts to analyse his patients and his own responses to them. He is of the modern school, unlikely to resort to the blunt-edged methods of some of his contemporaries. Description of some of these established treatments read very much like torture. They were, after all, in the cases described, trying to make someone talk. How appropriate.But Rivers is unimpressed and he pursues his own line. Along the way, he also develops new, ground-breaking treatments of his own invention.Sassoon befriends a young man called Owen, whom he encourages to write. Another friend called Graves visits whenever he can. Together, Sassoon and Owen work on some of Owen´s writing. The results, they both agree, are improvements.The power of Regeneration is the relation between its overall idea and its setting. It presents the creative process as a reflection on experience and sets this in an institution where formal reflection on experience is a treatment. Eventually, it is not just the individual patient who benefits from the cathartic process of reflection, but also the analyst and, ultimately, all of us when the relief takes the form of great poetry."}, {"userName": "Leslie", "userReviewDate": "Jan 18, 2015", "userURL": "http://www.goodreads.com/user/show/11351200-leslie", "userReview": "Perhaps even 4½ stars. This historical-fiction novel centers around the poet Siegfried Sassoon and his psychiatrist Dr. Rivers during his stay at the mental hospital Craiglockhart during 1917. The central theme is conflict between duty and survival which Rivers recognizes as the basis for most of the cases of \"war neurosis\", shell shock or as we now call it PTSD. Where do we draw the line between a soldier's duty and a completely reasonable desire to survive? The heart-wrenching part was the fact that many of the men (especially officers) didn't want (at least in the conscious part of their brain) to be posted in a \"safe\" position because they felt it was shameful to desert their men. The stress of being responsible for others without having any power to control conditions must have been enormous..."}, {"userName": "Dov Zeller", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/440651-dov-zeller", "userReview": "It's been a long time since I've read the Regeneration trilogy, recommended and lent to me by a friend I was living with at the time. I thought they were great -- poetic, powerful, intriguing in their exploration of shell-shock and poets and protest (WWI) and the life of protagonist Billy Prior (fictional character working with historical psychologist William Rivers, who treated both Seigfried Sassoon and Wilfred Owen for ptsd during the war). Perhaps I'll read these books again at some point. Interesting as always to look at goodreads reviews. Mixed, with an occasional out-and-out hateful review, but mostly positive and some very informative. Several recommendations and mentions of other books dealing with similar subject matter (in other gr reviews) including:The Great War and Modern Memory by Paul FussellTo End All Wars by Adam Hochschild"}, {"userName": "Lobstergirl", "userReviewDate": "Apr 11, 2009", "userURL": "http://www.goodreads.com/user/show/1910836-lobstergirl", "userReview": "Like so much other contemporary literary fiction, this was just meh. It was words on a page. It wasn't compelling, I didn't like it more than I disliked it or vice versa. In many ways it was like another meh book, Homer & Langley: historical fiction, based on a true story, with imagined conversations and fabricated details. The real story is always more interesting to me. I don't see the point of books like these. I don't understand why so many people read them, and literary award juries dote on them. I'd rather read Siegfried Sassoon and Wilfred Owen's poetry, and their biographies."}, {"userName": "Ｋｅｅｌｙ", "userReviewDate": "Jan 29, 2014", "userURL": "http://www.goodreads.com/user/show/28165536", "userReview": "The novel was a combination of fictional and true accounts which are loosely based on “the history of psychology and the real-life experiences of British army officers being treated for shell shock during World War I at Craiglockhart War Hospital in Edinburgh (The War Poets at Craiglockhart)”. It consisted of four parts centered mostly on three characters (Rivers, Sassoon and Prior) but also delved on mental struggles of other discharged soldiers suffering from their experiences while in the battlefied; and how individuals cope and move on from these burdens.The protagonist Siegfried Sassoon declares that the war the British are fighting for is no longer a justifiable course of action, and he laments that they no longer have a true cause that empowers them through their service as soldiers. This he used as inspiration and form of catharis in the various poetry he writes. He was dispatched to a mental ward in the care of the psychoanalyst W.H.R Rivers who was a recognized doctor in his field. In the hopes of ‘curing’ him from his ‘pacifist’ ways, the readers are taken into a very intimate scrutiny of the psyche of different characters other than Sassoon. There is also Sergeant Burns who struggles to eat food after a bomb explosion threw him head-first into a gas-filled belly of a corpse that caused him to swallow some of the rotting flesh; Anderson, a former surgeon who now goes into a catatonic state in the presence of blood; Willard, who insisted that his spine is damaged although there is no physical evidence to show it, but it has rendered him unable to believe he can walk; and finally, Billy Prior, with selective mutism and asthma, whose arrogance and refusal of treatment from Rivers explores the power struggle between patient and doctor. Other supporting characters include Wilson Owen, a fellow poet who has hero-worship for Sassoon, and Sarah Lumb, Prior’s girlfriend who works at a factory that handles bomb detonators. With so many enigmatic characters, this work of fiction was able to deliver an intensive and humane look on the turmoils of war in a more psychological aspect and how they translate to the physical manifestations.\"The process of transformation consists almost entirely of decay\" ~W.H.R. RiversTHE CHARACTERSMy personal favorite character is Rivers because the doctor has steel nerves especially during the last portions of the book where he observes a fellow colleague, Dr. Yealland, perform electric shocks on a patient with mutism. His detached demeanor does not reflect the intense nature of his intellectual mind which allows him to see things clearly and more sensibly; recognizing that the men under his care need treatment which will open them up emotionally, rather than come up with an ultimate cure. This makes him serve noble intentions even if he himself is haunted by the hopelessness of some of his patients’ inner worlds.Sassoon’s poetry are rich with allegory, and their passages in the book—as well as the process in which he revises and improves them—are entertaining to read. Sassoon’s stand against war does not directly make him a pacifist, and that paradox is what kept me reading because I wanted to know exactly why Sassoon was able to fight in a war he never believed in at all. Meanwhile, Prior’s personality is the most intriguing of the three. He is more able to act on his feelings no matter how ugly they are as oppose to Rivers who is still professionally responsive and Sassoon who retreats to his poetry. Still, he carries the most bondage of them as well, unable to adjust to an ordinary life outside of his experiences in the war.I enjoyed reading and comparing the states of minds among Rivers, Sassoon and Prior, as well as the relationships and emotional bonds formed within. Both Sassoon and Prior see Rivers as a father figure but with a maternal presence. But Sassoon and Prior’s responses to this are essentially different. While Sassoon accepts Rivers because he was filling in a hole left by his own father whom he never knew, Prior subtly retaliates every time Rivers tries to understand him because Prior’s own relationship with his real father—who only visited him one time in the ward—was already fractured to begin with. As chemical as Prior and Rivers are because of the tension between them, Sassoon’s ways of relating to Rivers and vice-versa are more explorative because both men respect each other even if their ideals are barely similar.THE THEMESThe most invigorating aspect of this book is that it deconstructs gender roles in times of war where masculine fortitude is challenged by the traumatic experiences men undergo when in battle for their lives, while the women back at home has now taken on more assertive and independent roles. Prior makes this observation with Sarah Lumb whom he meets one night as he was drinking at a bar and forms a relationship with her, secretly drawn to her strength and invulnerability that contrasted his own frailty (“women have expanded in all kinds of ways, whereas men over the same period had shrunk into a smaller and smaller space”).In the middle of the second part of the book, Rivers contemplates the notion that the war was advertised by the government in which men can prove themselves with traditionally heroic male feats, yet the reality portrays that these very same men, once in the battefields, are “crouching in a dugout, waiting to be killed,” and that “the war that had promised so much in a way of manly activity had actually delivered ‘feminine’ passitivity and on a scale that their mothers and sisters had scarcely known. No wonder they broke down.” Sassoon addresses that the war has questioned the standard roles of men in the society, especially among men of military service, and he realized that such fixed roles of power, strength and infallibility attached to men are the reasons why they were easily damaged in the first place (“You’re walking with a mask on and you want to take it off but you can’t because they all think it’s your face”).I also read online that there are two sequels that followed this story, and they explored themes of homosexuality in time of war as well. I definitely saw that possibility in my course of reading this novel. The male characters are extremely well-written and their relationships are intricately woven in the story so well that it will not surprise me if that theme may serve as an enrichment to an already layered storytelling which breathes the psychologically sublime.SUMMARYRegeneration is the first volume of the trilogy, followed by The Eye in the Door and The Ghost Road (which I’m still trying to get at least PDF copies of). It was a story of the vitality of change in a collapsing world where the traditional values and roles of men are being deconstructed through the ailments of war and the emerging sexual politics in that period of history. I was happy to read something other than the usual violence and gore found in most works of fiction like this, and that was what made this book so unique and intimate to read. Still, I recognize that this biographical sort of genre on wars is an acquired taste so I’m taking that into consideration in rating this book. I believe that it can beautifully translate in a cinematic adaptation, however, but that would entail a film that relies on the strength of its character dynamics enhanced by symbolic visuals. To anyone interested in expanding their usual taste in literature, this book is highly recommended!RECOMMENDED: 8.5/10"}, {"userName": "Girish", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/5924440-girish", "userReview": "“A society that devours its own young deserves no automatic or unquestioning allegiance.” Pat Barker's Regeneration is one of the hard hitting take on war through the eyes of a psychiatrist. Based on a true story, the book is very well written on people dealing with the horrors of war and the different treatment philosophies.The Craiglockhart hospital is entrusted with the task of getting the battle wearied back to the field at the earliest. In Rivers we have an empathetic psychiatrist, who believes in conversations with his \"shell shocked\" (And other) patients and deciding if they are fit for service. He also does a Freudian analysis of dreams and torn by his own views on war. The book explores the borders of rationality and insanity - a theme explored in great depths in books like Catch 22 and Slaughterhouse Five.Siegfried Sassoon, a celebrated war leader scandalizes the non fighting old-men with his anti war declaration. In the interest of the morale of troops, he is declared shellshocked and his conversations with Rivers are laced with pacifist view. The other patients like Burns, Wilson and Anderson have genuine war scars that alters them forever. They regenerate in the care of Rivers and we grow to respect him and hold him in esteem.His own moral dilemma on the treatment process at the other hospital and his own views on sending his patients back to the line make him human. I loved the book in places though found it was a slow in places. A good book, probably, a lot behind time.You know you're walking around with a mask on, and you desperately want to take it off and you can't because everybody else thinks it's your face.Not for all."}, {"userName": "James", "userReviewDate": "Jan 15, 2009", "userURL": "http://www.goodreads.com/user/show/426277-james", "userReview": "Regeneration was a Booker Prize nominee described by the New York Times Book Review as one of the four best novels of the year in its year of publication. It is the first of three novels in the Regeneration Trilogy of novels on the First World War, the other two being The Eye in the Door and The Ghost Road, which won the Booker Prize in 1995. The novel is loosely based on the history of psychology and the real-life experiences of British army officers like Siegfried Sassoon being treated for shell shock during World War I at Craiglockhart War Hospital in Edinburgh. Barker attributed the immediate inspiration for Regeneration to her husband, a neurologist familiar with the writings of Dr. W.H.R. Rivers and his experiments with nerve regeneration.Some of the themes in the novel include madness, homosexuality, loss of masculinity and the idea of regeneration itself. Madness is exhibited through symptoms such as mutism, fear of blood, and Sassoon's angry anti-war declaration. “I believe that this war, upon which I entered as a war of defence and liberation, has now become a war of aggression and conquest.” Because such behavior is deemed unacceptable Sassoon is given the label \"shell-shocked\" to discredit his views. Rivers eventually questions whether it is \"mad\" for these soldiers to have broken down in war or to blindly follow the orders which they are given. Rivers also questions whether it is right to treat this \"madness\" only to send soldiers back to the war which made them mad in the first place. “This reinforced Rivers’s view that it was prolonged strain, immobility and helplessness that did the damage, and not the sudden shocks or bizarre horrors that the patients themselves were inclined to point to as the explanation for their condition. That would help to account for the greater prevalence of anxiety neuroses and hysterical disorders in women in peacetime, since their relatively more confined lives gave them fewer opportunities of reacting to stress in active and constructive ways. Any explanation of war neurosis must account for the fact that this apparently intensely masculine life of war and danger and hardship produced in men the same disorders that women suffered from in peace.”  Love between men is another theme explored as in war the bond between men is a desired quality, and Sassoon is condemned for the love that he shows towards his fellow men. The idea of a loss of masculinity runs throughout the novel. Anderson has dreams where he wears female corsets; Rivers contemplates the feminine qualities needed for his caring profession. Sassoon describes a male soldier who loses his genitals in a war accident and also contemplates the idea of an \"intermediate sex\"; the boundaries between the two traditional genders are becoming increasingly blurred as soldiers begin to lose the qualities which are, for them, essential in their identity as 'men'. Rivers also remarks on the fact that soldiers serving in the trenches – confined, powerless, forced to do nothing for long stretches despite intense stress – suffer similar symptoms as do women during peace-time. “Sometimes, in the trenches, you get the sense of something, ancient. One trench we held, it had skulls in the side, embedded, like mushrooms. It was actually easier to believe they were men from Marlborough's army, than to think they'd been alive a year ago. It was as if all the other wars had distilled themselves into this war, and that made it something you almost can't challenge. It's like a very deep voice, saying; 'Run along, little man, be glad you've survived” Many patients also refer to Rivers as a father figure; one of River's former patients, Layard, refers to Rivers as a \"male mother\". It is through this compassion that the soldiers are able to \"regenerate\" – the motif of the novel from which the title is taken. Rivers explores the fact that his role in helping the soldiers to express their painful experiences means that he requires the skills and traits typical of a woman. He dislikes the idea that nurturing is a uniquely female trait. Rivers also throughout the novel is constantly trying to be a 'fatherly figure' to his patients. This is emphasized by the job that he does. The combined effect of the thematic material and the lucid style of Barker make this a superior historical novel."}], "description": "In 1917 Siegfried Sasson, noted poet and decorated war hero, publicly refused to continue serving as a British officer in World War I. His reason: The war was a senseless slaughter. He was officially classified \"mentally unsound\" and sent to Craiglockhart War Hospital. There a brilliant psychiatrist, Dr. William Rivers, set about restoring Sassoon's \"sanity\" and sending him back to the trenches. This novel tells what happened as only a novel can. It is a war saga in which not a shot is fired. It is a story of a battle for a man's mind in which only the reader can decide who is the victor, who the vanquished, and who the victim. It is one of the most amazing feats of fiction of our time. Regeneration is the first novel in Pat Barker's acclaimed World War I trilogy, which continues with The Eye in the Door and culminates in the 1995 Booker Prize-winning The Ghost Road.", "title": "Regeneration\n      \n          (Regeneration #1)", "url": "http://www.goodreads.com/book/show/769808.Regeneration", "average": 4.03, "cover": "https://images.gr-assets.com/books/1309212469l/769808.jpg", "reviews": 1263, "authors": [{"url": "https://www.goodreads.com/author/show/4000.Pat_Barker", "name": "Pat Barker"}], "type": ["Historical", "Fiction", "War", "Historical", "War"], "outlinks": ["http://www.goodreads.com/book/show/769808.Regeneration", "http://www.goodreads.com/book/show/5872.Regeneration", "http://www.goodreads.com/book/show/3942075-regeneration", "http://www.goodreads.com/book/show/820481.Regeneration", "http://www.goodreads.com/book/show/18283714-regeneration", "http://www.goodreads.com/book/show/1624165.Regeneration", "http://www.goodreads.com/book/show/18712258-regeneration", "http://www.goodreads.com/book/show/9605099-regeneration", "http://www.goodreads.com/book/show/18602101-regeneration", "http://www.goodreads.com/book/show/151926.The_Ghost_Road", "http://www.goodreads.com/book/show/151928.The_Eye_in_the_Door", "http://www.goodreads.com/book/show/13330599-toby-s-room", "http://www.goodreads.com/book/show/1342650.Life_Class", "http://www.goodreads.com/book/show/5877.The_Regeneration_Trilogy"]}