{"ratings": 278, "userreviews": [{"userName": "Kaisersoze", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/22517400-kaisersoze", "userReview": "After enjoying the hell out of the first book in this series, Domain of the Dead - so much so that it made my top 10 horror reads of 2013 - I'd long been looking forward to reading this sequel. Weirdly, I sometimes like to delay gratification, so Remains of the Dead kept slipping down to #10-15 on my TBR pile as I waited for what felt like the right time.Well that time was this week, and though Remains of the Dead is again technically very well-written, it is unfortunately not as arresting or as unique as Domain. Instead, McKinnon presents the story of the side characters whom the reader was briefly introduced to at the beginning of Domain. These six people are left on the ground while the others were helicoptered back to base, which was actually a ship far enough out to sea to not be at any threat to the zombies (hence the unique spin mentioned above). The six left behind therefore have to survive long enough for the chopper to refuel and return for them, and that means finding a secure place to defend. In other words, it's fairly typical zombie apocalyptic stuff, even if McKinnon's writing is far better than what is usually found within this genre.For me, part of what makes this feel like a longer read is almost half the book is dedicated to one character's efforts to survive. You see, Ali never joins up with the other five characters left behind, so it becomes him versus the horde of zombies chasing him with absolutely no dialogue. By half way through the novel, I was growing restless with his arc, and wanted to go back to the other survivors whose interactions comprised the best parts of this sequel.Fans of the original should also be warned that McKinnon spends the first 30 pages covering the exact same ground written about at the start of Domain, just from the different characters' perspectives. Does this Rashomon type structure work? That's likely a matter of personal taste, but for mine, it felt a bit unnecessary as it did little more than pad out the page count.It might sound like I did not like Remains of the Dead, but I definitely did. So I was frustrated to learn that like its predecessor, this one also ends on a massive cliffhanger, and though published four years ago, there has been no direct sequel yet written. The third book in the series, Demise of the Living is a prequel rather than a sequel. And though I'm interested in how McKinnon opts to depict the fall of the world in the first place, I'm not as keen on that as having some resolution to the two cliffhangers I now have bubbling through my head!3 Very Long Waits on a Rooftop for Remains of the Dead."}, {"userName": "Michele Cacano", "userReviewDate": "Feb 24, 2012", "userURL": "http://www.goodreads.com/user/show/5911722-michele-cacano", "userReview": "This is the companion book to Domain of the Dead, which I highly enjoyed. There is a small group of characters left behind in Domain, and Remains of the Dead picks up with their tale. (which makes not a sequel, but a concurrent story line.)I'm a little bit upset at the ending, although I won't give anything away. Let's just say, it stopped more abruptly than I was expecting! On the plus side: Cleaner edit than Domain of the Dead. Still a few typos escaped through, like oh so many zombies pushing their way through a torn fence. But, reading this was much easier on my inner critic than Domain.On the minus side: Character development was slightly uneven. We get to know a couple of them fairly well, here, but the others remain elusive. I'm not entirely sure who they are so when major decisions and courses of action are taken, I felt slightly forced to take them at their word, so to speak, since I didn't feel confident in my own understanding of the characters, their motives, and the situations they were creating. On the plus side: The characters we do get to know, are very exciting to live through! I won't name names so as not to spoil it for anyone, but there are three, maybe four really strong personalities that I came to know and love in the book. On the minus side: I don't feel as satisfied with the resolution to these characters as I did to the one in Domain of the Dead. On the argumentative side... Maybe that is the way the author wants it. At the end of Domain, I was mostly hopeful. At the end of Remains, I would have to say the overwhelming emotion was abandonment - is that an emotion? I followed the tale of these survivors over the course of several intense days only to be left behind... the story... I think maybe my copy had a last chapter missing... Sigh.Overall, I'm still recommending this book. Especially if you've read Domain of the Dead. There are some really beautiful (and gory) visions and ideas presented here. Also, several turns of phrase jumped out at me with such gusto I had to re-read them just for the joy of the words themselves. I'm really looking forward to Iain McKinnon's future works. P.S. If you think there are spoilers in this review, let me know and I will \"hide\" it. I think I've managed to describe my experience of reading the book without giving anything away!"}, {"userName": "Mark Woods", "userReviewDate": "Dec 21, 2012", "userURL": "http://www.goodreads.com/user/show/4786869-mark-woods", "userReview": "The companion volume to Domain Of The Dead runs alongside the first book but dealing with the survivors that got left behind!Cahz and his team are on a helicopter run into the city gathering specimens for experimentation when they are approached by a group of survivors. Knowing that they cannot all fit on the copter, Cahz and one of his team members elect to stay behind until the copter can return. All they have to do is survive.....Quickly realising that their chances are low in the city, the small group start to head out to find somewhere safe to rendezvous with the copter when it returns. But things have changed since the last time they were \"in-country\" and not for the better and it soon becomes apparent that the odds are stacked highly against them!I loved this and the way it dealt with those left behind. I also loved the dark, moody grittiness of it all as we see first-hand what is left of our former civilisation long after it all has ended!Is it bleak and depressing at times? Almost certainly but it is also a gripping read that is a roller-coaster ride from start to finish and simply sublime for big fans of Romero and the zombie genre in general.My only complaint, without giving anything away the cliff-hanger ending of the last book is never satisfyingly resolved and this book too ends with a bit of a bang! Don't go into this expecting any happy endings people!This is as realistic a zombie book as you are ever going to get and this book comes highly recommended from me!"}, {"userName": "RJ", "userReviewDate": "Sep 29, 2012", "userURL": "http://www.goodreads.com/user/show/4187755-rj", "userReview": "Just as McKinnon's other book \"Domain of the Dead\"; it was ok, that's all. The ending was quite strange and abrupt. It ends as if there is a sequel, but I'm not aware of one. These books certainly don't add anything to the genre."}, {"userName": "Patrick D'Orazio", "userReviewDate": "Nov 17, 2011", "userURL": "http://www.goodreads.com/user/show/4328815-patrick-d-orazio", "userReview": "Review of Iain McKinnon’s “Remains of the Dead”Remains of the Dead is the sequel to Iain McKinnon’s “Domain of the Dead” but in a way, it is its own stand alone story. I guess the term sequel doesn’t accurately describe this tale, since this story runs parallel to the first book. Both books start out the same way, with a group of survivors trapped years after the start of the zombie apocalypse inside a large warehouse that is filled with all the supplies they would need to survive. Unfortunately, they have burned through most of those supplies and only have a few months left before they will end up starving to death. A helicopter, stationed out at sea on one of the few surviving military ships, has come to the area where the warehouse is to collect an undead “sample” for the scientist on the ship to study. The people from the warehouse, upon hearing the helicopter, decide to make a run to the helicopter in an effort at escaping the hell they have lived through for several years and the reality that their time is running out.The first book focuses on the survivors who climb aboard the helicopter as they return to the ship. Their story is one that examines the science behind the outbreak of the plague and the attempts to find a cure or inoculation against it. It also deals with a fresh outbreak of infection onboard the ship. This novel details the plight of those left behind: the people who couldn’t fit on the small helicopter and must figure out a way to survive until the helicopter can return to rescue them. As the readers who have checked out the first book know, the estimated eight hour turnaround time they were hoping for is not quite what happens and the survivors will be forced to somehow make due for much longer than that. The book is broken up into two storylines. The main story is of Cahz, the leader of the soldiers on the ground, Cannon, another soldier, Ryan, one of the survivors from the warehouse, Elspeth, an elderly survivor, and Ryan’s infant daughter, who happens to be Elspeth’s granddaughter. As we discovered in the first book, Elspeth has been bitten and the baby has been scratched, so it appears as if both will be dead from infection soon enough, which is why they chose to stay behind. The other storyline is that of Ali, another warehouse survivor who gets separated from the others in the throngs of undead trying to tear them to pieces on the race to the chopper, and is presumed dead. He manages to find his own route to escape and fights tooth and nail to survive and somehow figure out a way to reconnect with the others as the helicopter abandons them all with the hordes of undead nipping at their heels.This was the story I wanted to read in tandem with the first story presented in book one of this presumed trilogy. I had been hoping to see the story rotate back and forth between the survivors on the ship and the survivors on the ground, but the author chose to split the stories up. I have to say that McKinnon turns the intensity up a notch in this, the second book in his series. The constant race against the undead, the desperate measures taken to survive at every turn, and the solid character development make this tale both a fun and invigorating read in the zombie genre. I am looking forward to the third installment in this series, where I will presume the two sets of characters will be reunited and their saga will go forward as one story. While I suppose I still wish that the two stories would have rotated back and forth through the first and second books instead of being told separately, I have no complaints about the characters and the intense action the author delivers with his two books."}, {"userName": "David McDonald", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/8076543-david-mcdonald", "userReview": "Remains of the Dead is the follow up tale to 2009's Domain of the Dead from Scottish author Iain McKinnon and comes with a foreword from award-winning horror writer Joe McKinney. With an introduction like that, hopes were pretty high for this title...Remains of the Dead isn't so much of a sequel as a companion piece to its predecessor. ROTD follows some of the already established characters from DOTD, principally the squad of weary combat veterans led by Cahz and some of the survivors who didn't make it on to the helicopter and their efforts to make it out of a city teeming with the walking dead.At first blush, ROTD appears to be straight-up action driven survival horror and yes, there's plenty of action, explosions, gunfire and hordes of decaying zombies for the protagonists to deal with. However, McKinnon has created a zombie tale that although fairly testosterone fuelled, is ultimately character driven. Without exception, the main players are all incredibly believable and the motivation behind their actions is entirely plausible. Additionally, McKinnon isn't afraid to bump off his characters in order to enhance the story, something he does in considerable style and at times, leaving the reader with a genuine sense of loss.I'm unsure whether McKinnon has done so knowingly or not but at times, ROTD had an air of familiarity about it and at stages was evocative of a number of different films, such as Aliens and indeed, some of the dialogue seems to be a knowing nod to various films.Critically, about the first fifth of the book feels like repetition from its predecessor, revisiting the events of the initial helicopter extraction seen in DOTD but from a slightly different viewpoint. At times, this irked me somewhat but when viewed objectively, I'd suggest that the author has to reintroduce the world he has created previously and also cater for those who have perhaps not read DOTD. Additionally, I feel that the book ought to have been edited a little more beforehand. There are some glaring typos and perhaps even passages that could have been culled in order to give this title a sharper delivery.Overall, Remains of the Dead balances being a quick, action-driven zombie tale with a superior character driven plot with dramatis personae that the everyman can relate to."}, {"userName": "Heather Faville", "userReviewDate": "Nov 17, 2011", "userURL": "http://www.goodreads.com/user/show/2697506-heather-faville", "userReview": "So, to start off the review, Remains of the Dead is a sequel. I did not realize this until after I had completed the book. I am definitely interested in going back and reading it’s predecessor Domain of the Dead, but I had no problem with any of the story lines in Remains of the Dead, so it could definitely be read as a standalone novel.The tale is divided into 2 storylines. From one perspective you have Ali’s story. Ali was one of the warehouse survivors who gets separated from the group and must fight his way to safety. I liked Ali, he is definitely the type of person I would want in my camp should the shit hit the fan. He is resourceful and resilient, doing everything in his power to survive and get to a place where he can, hopefully, meet up with his group. The second storyline revolves around 2 soldiers, Cahz and Cannon and 3 warehouse survivors, an elderly woman, Elspeth, Ryan and an infant who is the granddaughter of Elspeth and the daughter of Ryan.This group has the same type of issues that Ali has only in a group situation. It’s kind of interesting to see the two dynamics of survival. Is it easier to try to survive in a group or alone? Both have positive and negative aspects from my viewpoint. The author has an excellent grasp of the various emotions that would run through people during a zombie apocalypse. Especially when it comes to having to deal with one of their own. There was a particular scene during which I became rather emotional and that makes me happy. I love to feel emotion while reading a book! The zombies were the slow shambling type that, while not too threatening if taken on one on one, can be shit your pants scary in a large group. The violence and gore were there and in great detail, but not over the top extreme. There was no excessive bloody description of mutilation of the undead or the living. I definitely recommend Remains of the Dead as a must read for any fan of the zombie genre. I look forward to getting my hands on Domain of the Dead and seeing how the worlds fit together. For now, I need to go find myself some spam to throw at a zombie."}, {"userName": "Lola", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/24180513-lola", "userReview": "No-one is safe in Iain McKinnon's world and everyone is expendable! This just heightens the suspense as you know the 'hero' isn't just automatically gonna 'make it' to the end, that is if there is a hero at all. Great follow on from Domain of the Dead.The only negative I would say (and this is why it got 4 not 5 stars!) is that it was quite repetitive of book 1 at the beginning. Whether it was just to bring readers who hadn't read book 1 up to speed I'm not sure but it was literally large chunks of book 1 just regurgitated and maybe including a few extra details. Because this book is telling the story of the other group left behind it actually runs concurrent to book 1 time-wise so the beginning of the book takes you back again to how the two groups separate so the actual story of book 2 starts at about 15% into the book (I read the e-book). Just felt it was unnecessary, used to pad out the book a bit and just plain boring to have to re-read exactly the same sequence of events and I actually ended up skipping forward to find where the story of our current group actually kicks off!But that one criticism aside a great read, lots of twists and turns and a few unexpected departures!"}, {"userName": "Dave Lightfoot", "userReviewDate": "Nov 29, 2011", "userURL": "http://www.goodreads.com/user/show/5097367-dave-lightfoot", "userReview": "I have been eagerly awaiting the release of Remains of the Dead ever since I finished Iain McKinnons first novel (Domain of the Dead). As soon as the book arrived on my doorstep, I started reading and I loved every single page of it. I was not dissappointed at all.This book is exciting, terrifying, emotional and down right amazing from start to end. Iain McKinnon has wrote a tremendous sequel (Of a sort - as the story actually runs parallel to the 1st Book)and has delivered everything I hoped for in this book. With Domain, he picks the reader up, taps them on the shoulder and tells them \"This may hurt\". Then, with Remains, he kicks us right in the balls, with a 'I told you so' look on his face.Remains is a lot more brutal than the first. The action is more intense and the horror is far more terrifying. It truely is Zombie Action at its best. I simply cannot find a flaw in this book. It really is BRILLIANT.I can honestly say that every fan of the genre needs to read this novel."}, {"userName": "Kristi", "userReviewDate": "Jan 24, 2014", "userURL": "http://www.goodreads.com/user/show/1412254-kristi", "userReview": "Really great follow up to Domain of the Dead, taking us back to the military and survivors left in the anonymous city that started in Domain. The pace of this book is much faster than Domain, and yet I felt like I was closer to the characters and their struggle. There really aren't noble heroes here. Just ordinary humans attempting to survive until their military pick up arrives. For zombie afficianados, plenty of handy tips and ideas on surviving in this book. But the characters aren't one dimensional zombie shooters by any means. They are conflicted, selfish, brave, afraid, deeply flawed, yet ultimately linked by their very humanity. Another nicely done unresolved ending as well. My one quibble was there are quite a few misspelled words and grammatical errors in my copy. Your vs you're many, many times. But I read it in one night, so clearly enjoyable despite that."}, {"userName": "Joe", "userReviewDate": "Sep 01, 2012", "userURL": "http://www.goodreads.com/user/show/12400797-joe", "userReview": "Iain McKinnon has written a great Z story. When a group of survivors hear a helicopter land adjacent to the wharehouse where they have been holed up for years, they decide to bolt through the horde of undead to reach it. The first book, Domain of the Dead, dealt with the ones who made it onto the helicopter. The second book, Remains of the Dead, tells the story of those that were left behind. I hated having to put these books down at night. The Romero style zombies are creepy, the writing is fast paced, and I loved the dialog! I gave Domain of the Dead four stars, but Remains of the Dead got all five. I'll be more than a little irritiated if Mr. McKinnon doesn't come out with a third book in this series. I want to know what happended to these people..."}, {"userName": "Riayl", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/5680336-riayl", "userReview": "I liked this quite a bit but it loses out on a star for me because of the abrupt, open ending and the fact that my favorite character was killed off - unless there is a sequel with a daytime soap-opera type twist...I get that it is horror, that it is a zombie book, but I really need someone to connect to and root for and they kind of need to survive for me to really be satisfied, killing them off at the end just sort of ruins the rest for me. *sigh*"}, {"userName": "Tena Clifford", "userReviewDate": "Jan 06, 2013", "userURL": "http://www.goodreads.com/user/show/5497891-tena-clifford", "userReview": "Just when you think it couldn't get any better from book one here comes book 2 I liked this one even more.. I was holding my breath the whole way thru this book.. At one point I was wanting to throw my iPad across the room because I couldn't take what was happening but I didn't I just got up and started pacing the room! It's a must read.."}, {"userName": "Sarah", "userReviewDate": "Dec 25, 2013", "userURL": "http://www.goodreads.com/user/show/7932728-sarah", "userReview": "Roller coaster from start to finish..I feel like I've been on the edge of my seat throughout! I actually thought this was better than Domain of the Dead, and I REALLY liked that. Tense, action-packed with a large smattering of futility and desperation. On to number 3 to find out what happened to those in the boat and those inland.."}, {"userName": "Matthew Horan", "userReviewDate": "Jan 06, 2013", "userURL": "http://www.goodreads.com/user/show/13028382-matthew-horan", "userReview": "I really liked this. A lot of times you will read zombie fiction and it's very poorly written, but Iain McKinnon is a true writer. Inventive prose and really great vocabulary throughout. It's a quick read and very enjoyable."}, {"userName": "Angela Verdenius", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/11378467-angela-verdenius", "userReview": "Really enjoyed this story, and there were some definite surprises along the way. One character I wanted eaten made it to the end LOL, and didn't seem quite the idiot he was at the beginning! I'm hoping there is a sequel, as it certainly hints at it."}, {"userName": "Mark", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/9509779-mark", "userReview": "This novel was well written. Seems to be a very dark novel, without much hope. Very creepy. Lots of action. I hope to read more by Iain McKinnon."}, {"userName": "Justin", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/5632782-justin", "userReview": "In Remains of the Dead, author Iain McKinnon sets up a fairly straightforward scenario. A military group from one of the only non-infested strongholds in the zombie-ravaged world comes across a group of survivors while on a routine mission. Their transport isn't big enough for everyone, so a handful of soldiers and civilians agree to stay in hostile territory until a rescue flight can be launched. The main group holes up in an office building while a lone civilian tries to find shelter in an overrun apartment building. Things soon go from bad to worse for everyone, and what should be a simple \"wait it out\" action quickly becomes one disaster after another.Zombie 411 - The zombies in this book stick pretty close to the Romero style. Some are faster than others, but there are no wall-crawling sprinters, intelligent super-zombies or other special powers.The Good - When the action scenes are taking place, you fall right into them and can almost smell the gunpowder and taste the adrenaline. McKinnon describes these sequences like a cinematographer, and fortunately they make up a good chunk of the story. He also gives us some very three-dimensional characters. Some will annoy and frustrate you, but in a way that makes them seem like real human beings and not just props in the story.The Bad - McKinnon tends to overdo the hyperbole when describing the zombies, and with each successive scene he seems to try and outdo himself with the overly vivid descriptions. Once or twice wouldn't have been an issue, but it happened often enough to jar me out of what was otherwise a nicely flowing sequence.While not without some flaws, Remains of the Dead is a very entertaining, fast-moving zombie story with memorable characters and a very real sense of danger around every corner. I imagine it is much more effective if you've already read McKinnon's previous book Domain of the Dead, but it works well enough as a stand-alone novel."}, {"userName": "*", "userReviewDate": "Feb 04, 2012", "userURL": "http://www.goodreads.com/user/show/7622454", "userReview": "Every once in a while I see a movie (Tideland) or a particular news story (aftermath of Katrina; the earthquake/tsunami in Japan) and it still haunts me years later. Never has a book haunted me except for a short time after I’ve finished it. I have read thousands of books, some of them horror or zombie related, but thinking back, I can’t say that I have felt haunted months after reading them. Creeped out and disturbed, yes, but haunted? No. Until now.\tRemains of the Dead. I read this book a few months ago and one chapter in particular still haunts me. Just seeing Iain McKinnon’s name makes me also see the number 19, a bathroom door, and a dining room table. I won’t do any spoiler alerts, but I felt like the characters in this book (and its companion book Domain of the Dead) were very real and relatable. I also really, really liked that these books started a few years into the zombie apocalypse, not near the beginning. I thought that was a nice change of pace from the other books I’ve read. \tWhile part of me would seriously like to have words with Mr. McKinnon about his chapter 19 in Remains; I’d also like to thank him as I think I hug my children a little more often because of it. I’d also like to ask him to hurry up with the next one as I am very concerned about some of the characters and want to know that they are okay."}, {"userName": "Darren Dilnott", "userReviewDate": "Sep 03, 2014", "userURL": "http://www.goodreads.com/user/show/24963189-darren-dilnott", "userReview": "After reading Iain Mckinnon's 3 ZA books in the last 2 weeks, i have to say that there are few who write as well as him. Remains of the Dead runs in parallel to Domain Of the Dead with a crossover of characters. Iain shows such an impressive attention to detail, with aspects of a ZA that others have left out. The writing is fluid, and always entertaining, with enough gore to satisfy. What Iain excels in is the human perspective with believable reactions from each of the characters. Don't ever expect a predictable conclusion to any of these books, and this adds to the excitement and unpredictability of his amazing books. I truly believe that Iain McKinnon rides high as one of the best ZA writers in the world.My one and only criticism is his obvious laziness, as iv'e now run out of his incredible work :) LOL"}, {"userName": "Jackie", "userReviewDate": "Sep 10, 2014", "userURL": "http://www.goodreads.com/user/show/5962759-jackie", "userReview": "This is the sequel to Domain of the Dead. What I love about this story is that it tells the other half of the story and it takes the same space of time. When I first read Domain, I didn`t know about Remains and I was so mad because I wanted to know what happened to the others. This story made me happy. It also made me sad in several ways. Iain McKinnon is a great writer."}, {"userName": "Mark", "userReviewDate": "Feb 27, 2014", "userURL": "http://www.goodreads.com/user/show/15177045-mark", "userReview": "Building on the excellent setting from the first book, Domain of the Dead, author Iain McKinnon now tells the story of those the helicopter left behind. Trapped in a city crawling with WalKing Dead (WDs, or Whiskey Deltas, in Milspeak), the characters try to survive in an increasingly hostile situation until the helicopter brings them salvation ."}, {"userName": "Gareth Wood", "userReviewDate": "Apr 29, 2012", "userURL": "http://www.goodreads.com/user/show/9090087-gareth-wood", "userReview": "I once said that Iain McKinnon is a Writer. His prose make my own humble verbiage seem like the random mashing of paws by an insane monkey upon a defective keyboard.I loved this book. It was wonderful."}, {"userName": "Bowie V.", "userReviewDate": "Mar 26, 2012", "userURL": "http://www.goodreads.com/user/show/680123-bowie-v", "userReview": "An amazing and eloquent zombie horror story."}, {"userName": "Regina", "userReviewDate": "Sep 15, 2013", "userURL": "http://www.goodreads.com/user/show/1977054-regina", "userReview": "The story was pretty good but the ending leaves you hanging. I can only hope there will be another book in the series."}, {"userName": "Tony", "userReviewDate": "Nov 17, 2011", "userURL": "http://www.goodreads.com/user/show/5235869-tony", "userReview": "Picks up right were the first one leaves off. Great book."}, {"userName": "Tom B.", "userReviewDate": "Feb 12, 2012", "userURL": "http://www.goodreads.com/user/show/7292109-tom-b", "userReview": "I'd give it a four if I didn't have to wait for the sequel.TB"}], "description": "The world is dead, devoured by a plague of reanimated corpses. Cahz and his squad of veteran soldiers are tasked with flying into abandoned cities and retrieving zombies for scientific study. Deep in infected territory, hundreds of miles from their support vessel, the ever present dangers weigh heavily on Cahz’s mind as he shepherds his team to make quick, clean extractions. Then the unbelievable happens. After years of encountering nothing but the undead, the team discovers a handful of disheveled survivors in a fortified warehouse with dwindling supplies. Surrounded by hordes of ravenous corpses, Cahz is faced with the terrible responsibility of determining the five passengers who will escape in the helicopter. While those left stranded must continue to fight off the infected and starvation long enough to be rescued. “Believable characters trapped in a nightmare scenario—REMAINS OF THE DEAD is a breathless, high-octane zombie thriller. [McKinnon has] written another great book here…” —David Moody, author of HATER and DOG BLOOD “Absolutely superb.” —Joe McKinney, author of DEAD CITY and QUARANTINED “Sure to please fans of The Walking Dead.” —Walter Greatshell, author of the XOMBIES series", "title": "Remains of the Dead\n      \n          (Domain of the Dead #2)", "url": "https://www.goodreads.com/book/show/12919168-remains-of-the-dead", "average": 3.77, "cover": "https://images.gr-assets.com/books/1328320734l/12919168.jpg", "reviews": 27, "authors": [{"url": "https://www.goodreads.com/author/show/2994590.Iain_McKinnon", "name": "Iain McKinnon"}, {"url": "https://www.goodreads.com/author/show/52047.Joe_McKinney", "name": "Joe McKinney"}], "type": ["Horror", "Horror", "Science Fiction", "Apocalyptic", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/12919168-remains-of-the-dead", "http://www.goodreads.com/book/show/13087918-remains-of-the-dead", "http://www.goodreads.com/book/show/6640238-domain-of-the-dead", "http://www.goodreads.com/book/show/18690092-demise-of-the-living", "http://www.goodreads.com/book/show/18054161-from-the-torment-of-dreams", "http://www.goodreads.com/book/show/24378105-denying-thanatos", "http://www.goodreads.com/book/show/11298141-holiday-of-the-dead"]}