{"ratings": 4120, "userreviews": [{"userName": "Wendy Sparkes", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/8009950-wendy-sparkes", "userReview": "#3 Cape RefugeA series I recommend reading in order, as a lot of the background of this story happens in #1 and #2.I'm really enjoying this series! I loved being back in Cape Refuge and meeting back up with familiar characters, and getting to know some new ones.I felt the subject of infertility was handled very sensitively, portraying well the feelings of those who go through this.The subject of physics and what the Bible has to say about them, and how they can affect us was also dealt with well. It was well played out through the characters. I was a bit nervous to start with when the subject came up in the story wondering where the author was going with the story line, but I soon relaxed as the story unfolded. Cape Refuge Series#1 \n #2 \n #3 \n #4"}, {"userName": "Loralee", "userReviewDate": "Jul 29, 2009", "userURL": "http://www.goodreads.com/user/show/1817661-loralee", "userReview": "Terri Blackstock writes another murder mystery with a Christian perspective. She feels that her books are her ministry. Sometimes when I read this type of book, I find the author very preachy, but she strikes a nice balance between an interesting story and sharing her beliefs.This story is the third book in the Cape Refuge series. This fictitious island off Georgia's coast has seen a surge of murders recently. Police Chief Cade is now on the hot seat as the mayor's race heats up. Two of the candidates (Ben and Sam)don't think he is doing a good job and would love to get rid of him. It's only long time friend, Jonathan, who is also a mayoral candidate who continues to believe in him.When Ben's wife disappears and is found murdered, the pressure is on to find the killer before he strikes again. Rumors are flying that Ben was having an affair. Perhaps he or his mistress were behind Lisa's murder? Rounding out the cast is Blair, who recently bought the island newspaper, her sister Morgan who desperately wants a baby, a psychic, a tabloid reporter, and the residents of Hanover House who are trying to put their lives back together again."}, {"userName": "Randy Tramp", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/21953550-randy-tramp", "userReview": "Ben Johnson's wife is missing. A psychic's vision leads police to her body. A national media circus plays out.What a story. It's great on many levels as a lot happens within the pages of River's Edge. I read Book one and two a few years ago and remembered why I liked this series so much. The characters are memorable and likable.The plot kept me turning the pages, wanting to find out, \"who did it.\" Great book.One part of the book spoke to me. I had to be strong with someone I love and who had been on drugs. I wondered if I'd been too hard on him until I read a passage.\"But it's no one else's fault. It's just mine. I'm the one who's failed myself. I'm the one who's failed my children.\"(The person I'd been speaking to has blamed everyone except himself.)Great book."}, {"userName": "Michelle", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/11663753-michelle", "userReview": "I have read all the books in this series thus far and I'm such a fan of Terri Blackstock. I do think that her more recent books are my favorite and a bit more suspenseful but this is still a great series. That being said this book is centered around infertility in every way. It was interesting to read about and get into the emotions of the characters. The murder is to a woman named Lisa who has been trying for years to have a child. Add some politics, shady business owners, and media and you have yourself a puzzle. I really like Cade, the man who looks into each murder in each book. He is a great character and it's nice to see how his life progresses throughout the series. I do recommend reading these books in order as the characters and parts of the storyline do flow in each of them. I really liked this book and the way the author tries to mess with the reader's mind. There is also a huge message on living a Christian life in a bit of a side story. Highly recommend this series!!\"I received this book from BookLook Bloggers for free in exchange for an honest review.\""}, {"userName": "Ed", "userReviewDate": "Jul 28, 2016", "userURL": "http://www.goodreads.com/user/show/27219761-ed", "userReview": "This is book 3 of the Cape Refuge series. As usual I was kept in suspense throughout the whole story not even realizing who the killer was until the last chapter. Blackstock gives a testimony at the end of the book on her style of writing. No matter how much she mentions her writing, she always gives praise to the Bible and mentions how her books could not even approach the glory of the Bible. She praises the Word of God. Every story I read from her, I can see the providence and sovereignty of God. I recommend her writings to every Christian who has the opportunity of reading her works."}, {"userName": "Loraine", "userReviewDate": "Mar 16, 2013", "userURL": "http://www.goodreads.com/user/show/1922494-loraine", "userReview": "Once again, Terri Blackstock has created an intricate mystery with several sub-plots weaving their way through the main mystery. She included several sub-plots involving themes you don't often see in Christian fiction: infertility, psychics (palm-reading), and halfway houses. This is the third book in the Cape Refuge series and I have enjoyed them all."}, {"userName": "Sarita", "userReviewDate": "Nov 24, 2014", "userURL": "http://www.goodreads.com/user/show/37168935-sarita", "userReview": "Wow. this was one fast paced read with lots of twists and turns. The ending/revealing of the murderer was totally unexpected.I enjoyed following the lives of Morgan, Jonathan, Blair and Cade and to see how their characters developed through struggles and set backs.Another great read from Terri Blackstock."}, {"userName": "Alaina", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/8005626-alaina", "userReview": "The best book in the series. I loved it."}, {"userName": "Erika Hayes", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/24408629-erika-hayes", "userReview": "Another great story. I had never read a Terri Blackstock book until March of this year. I have truly fallen in love with the characters and am pretty much devouring anything I can get my paws on. This was the third in the Cape Refuge series. My only regret is I don't think there are more! I truly have enjoyed reading the ongoing story. I can recommend if you are looking at this book be sure to have read the previous two it will be a bit confusing if you start here. Some book in series can stand alone but this is not one of them, and it is good that it does not. The story is woven very well in each book and so reading them out of order may cause a little harder time and less enjoyment."}, {"userName": "Laura", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/22375533-laura", "userReview": "Another one of Terri Blackstock’s great reads.  With the mayoral race in as the background Ben Jackson is the top dog but this all changed when his wife goes missing. Did he have a motive for killing his wife? I love how Blair Owens the newspaper owner kept digging. I kept guessing but yes I was wrong again, and this is what I enjoy in a mystery especially one that keeps me guessing from page to page. I will now have to go back and read some of the other books in this series."}, {"userName": "Ruby Denton", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/34245955-ruby-denton", "userReview": "A worthwhile readTerri leads the reader down a n avenue of hope and faith through the lives of her everyday characters, all the while holding reader's interest through an intriguing plot with just enough twists and turns to keep the pages turning. Her stories leave the reader with an uplifted heart and a deeper faith in God and life."}, {"userName": "unikia ", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/39971114-unikia", "userReview": "Edge of your seat Christian suspense novelOnce I started the book it was hard to put it down. The twist of the plot kept me intrigued. Seeing God’s hand in the lives of the characters brought it to an even higher level. Can’t wait to start the next book in the series."}, {"userName": "Kristen Merritt", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/75124649-kristen-merritt", "userReview": "I’m really enjoying this series. It’s not predictable or pedantic. I love the mystery from a Christian perspective. I do feel this one was a little more preachy than the other books I’ve read, but not as bad as others."}, {"userName": "Jerry Blackerby", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/8398359-jerry-blackerby", "userReview": "I love everything I have read by Terri Blackstock, especially the Cape Refuge Series. This is book 3 of that series and I am about to begin book 4."}, {"userName": "Zina McCrory", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/52493329-zina-mccrory", "userReview": "I am looking forward to the next book"}, {"userName": "Amy Elrod", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/23635207-amy-elrod", "userReview": "This is the 3rd book in a 4 book series. It's SO SO good. Not ready for them to end! Christian and Suspense mixed."}, {"userName": "Teri", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/1372904-teri", "userReview": "loved the plot, didn't like the preaching. i thought the christian message would get across much better by the actions of the characters rather than the author's extensive preaching"}, {"userName": "Chris", "userReviewDate": "Jul 22, 2012", "userURL": "http://www.goodreads.com/user/show/10983379-chris", "userReview": "Official Book DescriptionThe man Lisa Jackson loved most may have betrayed her.Another used deception to manipulate her.But did one of them kill her?Ben Jackson is sure to defeat Jonathan Cleary in Cape Refuge’s mayoral race, until his wife turns up missing the day before a major debate. Suspecting foul play, Police Chief Cade launches an island-wide search. But it takes a psychic’s “vision” to point police to the riverside-and Lisa’s body.The evidence implicating Ben in his wife’s murder is convincing. But as a local scandal escalates into a national media circus, Cade’s instincts tell him to dig deeper. And he’s not the only one. Blair Owens of the Cape Refuge Journal is using her investigative skills to uncover a rat’s nest of dirty secrets-and more than one person with a motive for murder. But Blair’s methods are jeopardizing her relationship with Cade, and an unsolicited prediction from the psychic only adds to her troubles. Is the man’s so-called gift truly from God, as he claims?Did Lisa’s murder have anything to do with the mayoral race, her husband’s alleged affair, or her decade-long struggle with infertility? Whoever the killer is, he’s about to take his evasion of justice to the next, lethal level. And someone else is going to die.***********We open this book with one of Jonathon's opponents in the race for mayor with a missing wife. Everyone believes its just a joke in the beginning trying to get Ben more votes. But then quickly realize that's not the case at all.Okay lets back up... Jonathon is running for Mayor of Cape Refuge. He and Morgan have been trying to have a baby for a while now. Blair, after quitting her library job, is now the owner of the only newspaper in town. Sadie is helping Blair all she can at the paper, and trying to get out of school daily. Caleb is getting big, and brings a smile to Morgan's face every day. Blair and Cade are becoming better friends and possibly sliding into a relationship.Now back to the present....Lisa is missing. What happened to her? Lisa and Ben have had fertility problems for years and have been seeing a doctor who was supposedly doing all he could to help them. Then there was her job. Lisa was a relator. Always showing houses to strangers wanting to move on the island and surrounding areas. Could it have been one of them? There are plenty of suspects but who looks the best?While all this is going on two of the residents at Hanover House have fallen in love and want Morgan and Jonathon's approval to be married. Gus and Karen have been spending a lot of time together and want to give her baby, Emory, a real family. While Morgan and Jonathon believe that Karen hasn't grown enough to leave the program they soon realize that they would be fine on their own.Back to Morgan and Jonathon.. They started seeing the fertility specialist Lisa had recommended and had already been through some testing. They were getting ready to start some kind of treatment but wanted things to settle down a little first. Then another blow hit them. Sadie and Caleb's mother was getting out of prison and decided to stay at Hanover House. Shelia is quite a character. At first feeling resentful to Morgan and Jonathon then finally coming around to see that Hanover House was the best place for her family.And the murder... Okay, yes, you know she was murdered. But who did it? The local psychic claimed to have seen her car in a river. Was he right? So what if he was, when he turned up dead we all knew he wasn't the murderer... Then you have the small town T.V. anchor. He acted like he wasn't interested in any of the murders then starts using them as his ticket to fame. Could it have been him?You'll just have to read the book to find out :) But you better pay attention to Blair. That is one lady that doesn't rest until she gets answers! Even if she is dating the Police Chief she might just surprise you and get more answers than he does!"}, {"userName": "Kelly", "userReviewDate": "Feb 16, 2015", "userURL": "http://www.goodreads.com/user/show/18160618-kelly", "userReview": "This is Book #3 in the Cape Refuge Series. If you remember, I already reviewed Book #4 of this series here. I know, I seem to be reading this series in reverse, but it still makes sense and is still very suspenseful and enjoyable. I received a copy of River’s Edge free from the publisher through the BookLook Bloggers book review bloggers program. I am not required to write a positive review. The opinions I have expressed are my own.Official Book DescriptionThe man Lisa Jackson loved most may have betrayed her.Another used deception to manipulate her.But did one of them kill her?Ben Jackson is sure to defeat Jonathan Cleary in Cape Refuge’s mayoral race, until his wife turns up missing the day before a major debate. Suspecting foul play, Police Chief Cade launches an island-wide search. But it takes a psychic’s “vision” to point police to the riverside-and Lisa’s body.The evidence implicating Ben in his wife’s murder is convincing. But as a local scandal escalates into a national media circus, Cade’s instincts tell him to dig deeper. And he’s not the only one. Blair Owens of the Cape Refuge Journal is using her investigative skills to uncover a rat’s nest of dirty secrets-and more than one person with a motive for murder. But Blair’s methods are jeopardizing her relationship with Cade, and an unsolicited prediction from the psychic only adds to her troubles. Is the man’s so-called gift truly from God, as he claims?Did Lisa’s murder have anything to do with the mayoral race, her husband’s alleged affair, or her decade-long struggle with infertility? Whoever the killer is, he’s about to take his evasion of justice to the next, lethal level. And someone else is going to die._________________________________________________________________________________________________This story is well-written and deals with some difficult issues like infertility. It is realistic and the characters are people who will draw you into the story and make you care about them from page one. The suspense of who killed Lisa Jackson will keep you on the edge of your seat until the very end, and there are enough suspects to keep you guessing. I love to read suspenseful novels and try to solve the crime and figure out who the guilty party is before it is revealed, but Terri Blackstock in the Cape Refuge series (the two that I have read so far) always surprises me, and to me, that says the author did a great job with the story because it was intricately woven in a way that I thought I knew who dunnit, but I didn’t.This series also includes a recurring group of townsfolk who keep you coming back to each book of the series. Their storylines include suspense and romance as well as real-life issues. Blair Owens’s walk of faith is a joy to watch as it grows and she faces some of the spiritual struggles we all deal with.I would recommend this novel to anyone who loves a well-written story about realistic characters dealing with realistic issues. I also recommend this novel to anyone who loves a fast-paced suspense novel, as well as a mystery that keeps you guessing until the very end."}, {"userName": "Lauren", "userReviewDate": "May 29, 2016", "userURL": "http://www.goodreads.com/user/show/44386577-lauren", "userReview": "I'm still hooked on this series, and if your reading them you know why...We open this book with one of Jonathon's opponents in the race for mayor with a missing wife. Everyone believes its just a joke in the beginning trying to get Ben more votes. But then quickly realize that's not the case at all.Okay lets back up... Jonathon is running for Mayor of Cape Refuge. He and Morgan have been trying to have a baby for a while now. Blair, after quitting her library job, is now the owner of the only newspaper in town. Sadie is helping Blair all she can at the paper, and trying to get out of school daily. Caleb is getting big, and brings a smile to Morgan's face every day. Blair and Cade are becoming better friends and possibly sliding into a relationship.Now back to the present....Lisa is missing. What happened to her? Lisa and Ben have had fertility problems for years and have been seeing a doctor who was supposedly doing all he could to help them. Then there was her job. Lisa was a relator. Always showing houses to strangers wanting to move on the island and surrounding areas. Could it have been one of them? There are plenty of suspects but who looks the best?While all this is going on two of the residents at Hanover House have fallen in love and want Morgan and Jonathon's approval to be married. Gus and Karen have been spending a lot of time together and want to give her baby, Emory, a real family. While Morgan and Jonathon believe that Karen hasn't grown enough to leave the program they soon realize that they would be fine on their own.Back to Morgan and Jonathon.. They started seeing the fertility specialist Lisa had recommended and had already been through some testing. They were getting ready to start some kind of treatment but wanted things to settle down a little first. Then another blow hit them. Sadie and Caleb's mother was getting out of prison and decided to stay at Hanover House. Shelia is quite a character. At first feeling resentful to Morgan and Jonathon then finally coming around to see that Hanover House was the best place for her family.And the murder... Okay, yes, you know she was murdered. But who did it? The local psychic claimed to have seen her car in a river. Was he right? So what if he was, when he turned up dead we all knew he wasn't the murderer... Then you have the small town T.V. anchor. He acted like he wasn't interested in any of the murders then starts using them as his ticket to fame. Could it have been him?You'll just have to read the book to find out :) But you better pay attention to Blair. That is one lady that doesn't rest until she gets answers! Even if she is dating the Police Chief she might just surprise you and get more answers than he does!"}, {"userName": "Victor Gentile", "userReviewDate": "Feb 23, 2015", "userURL": "http://www.goodreads.com/user/show/2528881-victor-gentile", "userReview": "Terri Blackstock in her new book, “River’s Edge” Book Three in the Cape Refuge series published by Zondervan gives us another adventure with Blair Owens and Police Chief Cade.From the back cover: Was Lisa Jackson s disappearance related to politics, her husband s affair, or her long-term infertility?Ben Jackson is going head to head with Jonathan Cleary in Cape Refuge s mayoral race and he s even expected to win when his wife Lisa turns up missing the day before the major debate. Suddenly the town is in turmoil as proof of an alleged affair surfaces, indicating that Ben Jackson might have had motive to kill his wife.Meanwhile, newspaper owner Blair Owens has other suspicions and so does Police Chief Cade. Together they dig deeply into the mysterious disappearance that soon spirals into a web of confusion, dark secrets, and unsettling fraud.Then the town s psychic reveals the location of Lisa s body at the bottom of the river. Even though Blair doesn’t believe his paranormal gift is real, she can t imagine how he knew where the body was.The small-town scandal quickly turns into a national media event. Is the murderer one of the obvious suspects . . . or someone they have no reason to doubt?I have to confess “River’s Edge” is my first introduction to Cape Refuge and its people. And what an introduction it is. Ms. Blackstock makes us hit the ground running and just does not let up with the suspense. Politics, infertility, missing wife and a psychic all this and more rolled up into one storyline. I think it takes a highly skilled author to pull of something like this and let me tell you I think Ms. Blackstock is one highly skilled author. Blair Owens and Police Chief Cade are well-defined characters that know what they are doing and whom we root for to figure out just what is going on. Once the action gets going Ms. Blackstock revs up the thriller quotient considerably which will have you reading and flipping pages as fast as you can. Don’t start this book late at night because it will be very difficult to put it down or stop thinking about it. I recommend this book highly and am greatly looking forward to the next book in the series.Disclosure of Material Connection: I received this book free from Zondervan. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Liz Terek", "userReviewDate": "Jan 27, 2015", "userURL": "http://www.goodreads.com/user/show/6022140-liz-terek", "userReview": "Book #3 in the Cape Refuge Series, ‘River’s Edge’ brings us the drama surrounding the town of Cape Refuge. Morgan & Jonathan are struggling with infertility issues. Jonathan is also embroiled in a mud-slinging mayoral race with two prominent community members. All the while, they’re running Hanover House, a transitional housing facility. Their two foster children have been thriving, but now their mother may receive an early release from prison. \tBaby Seth & his teen sister Sadie have been a respite for Morgan as she strives to achieve her dream of motherhood. Meanwhile, police chief Cade is trying to keep his job while dealing with romantic feelings for Morgan’s sister Blair. But it all takes a backseat when one of Jonathan’s opponents announces his wife is missing. Lisa has been a good friend to Morgan & now the whole town launches a massive search for her. \tMost of the townspeople know that Lisa isn’t the type to just run off. That would mean that one of their own has done the unthinkable. Although the town is no stranger to scandal, they can’t imagine anyone would hurt Lisa. As the investigation continues, the Chief of Police will have to wade through a shady psychic, unethical doctors, & a boatload of gossip. What is really going on in Cape Refuge?\tEven though this is number 3 in the series, it can stand alone. When I took it for review, I hadn’t known that it was a series. Our author includes enough past details for us to keep up. Initially, the book was a bit slow-going, but certainly picked up speed. Cape Refuge has a great deal of small town charm & readers will have no problem finding it a believable setting.\tMost of the characters are also very relatable & believable. Morgan felt a bit self-righteous & there were a few times that I wasn’t quite sure I liked her. Cade, the Police Chief, was by far my pick for favorite. He’s what every town would want in their chief. He’s a strong, Christian man who stays true to his beliefs throughout the novel. \tReaders will find a squeaky-clean, well-written story that isn’t difficult to stay involved in. I look forward to reading more from this series & hopefully, they’ll all be of this caliber. It’s a 5 star rating from me.I received a copy in exchange for an honest review. All opinions are mine."}, {"userName": "Barbara", "userReviewDate": "Aug 29, 2011", "userURL": "http://www.goodreads.com/user/show/3450884-barbara", "userReview": "\"This is the third in Blackstock's Cape Refuge series. She writes a decent mystery and the ending is brilliant, but her characterizations occasionally fall flat. Morgan really annoyed me in this book, because she behaves as a super-Christian with no faults at all. She's totally emotion-driven and apparently doesn't understand the basics of logic or reasoning. Not all Christians are like that. Meanwhile, her sister Blair (a better overall character) has taken over the newspaper and is writing about the murder of a prominent local politician's wife, but this causes her to clash occasionally with Matthew Cade, the police chief and the man she's deeply in love with. There's a subplot about IVF and infertility that involves Morgan and her husband, which bored me since I had two kids the good old-fashioned way (and I have married friends who are childfree). I have never understood women and men who put having a baby as the be-all, end-all of their lives. I certainly don't know any Christians who think that way. Some Christians deliberately decide to forsake having children in order to share in missionary work, but Morgan's job on this earth is, apparently, to be a mother. At several points in the book, I wanted to reach into the pages and slap her. Sheila Caruso is another fairly well developed character. She's a reformed (?) drug addict who's released from prison early and is attempting to start a new life at Hanover House with her children, Sadie and Caleb. She behaves in a fairly predictable manner, but she's at least realistic. The book is far more plot-driven than message-driven, but there is good counsel on why Christians avoid psychics and mediums and what it means to engage in spiritual warfare with the weaponry Paul described in Ephesians. All in all, a satisfying read.\""}, {"userName": "Julia Wilson", "userReviewDate": "Jun 01, 2014", "userURL": "http://www.goodreads.com/user/show/29770295-julia-wilson", "userReview": "River's Edge by Terri Blackstock is book number 3 in the Cape Refuge series. During the race to become mayor, candidate Ben Jackson's wife, Lisa goes missing. The evidence of foul play points to Ben, but police chief Cade continues his search for clues for the truth. Meanwhile newspaper editor Blair is also on the hunt for a story and follows up Lisa's last known movements.The friendship of Cade and new christian Blair continues, but has it's conflicts over the investigation of Lisa, as Blair prints headlines that Cade, as police chief finds inappropriate.Blair's sister Morgan and her husband Jonathan continue to run Hanover House, to help recovering addicts and newly released prisoners to get back on their feet and start a new life. They are still fostering teenager Sadie and her baby brother Caleb, but when Shelia, their mother is released from prison and comes to Hanover House, tensions arise as Morgan finds it hard to hand over the mothering of Caleb to Shelia. However, as a Christian, she realises that her role must decrease in Caleb's life as Shelia's increases.The reader becomes engrossed in the story as the finger of crime points first to one character, and then another, and another. The reader gathers the clues as the novel progresses, but it is only right at the end of the novel, that the pieces fit together, and the whole picture as to what happened is revealed.The importance of God in peoples' lives runs throughout the novel, as the characters reveal their need for Him. His presence does not mean that the Christians have an easy life, but that when trouble hits, their lives are firmly anchored in God.As with previous novels by Terri Blackstock, I became totally engrossed in the story and could not put it down. I will definitely be reading book number 4 in the series!"}, {"userName": "Hallie Szott", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/6447247-hallie-szott", "userReview": "This review is also posted on Book by Book.River’s Edge is the third book in Terri Blackstock’s Cape Refuge series. Starting this novel, I was a tad bit nervous, since I haven’t yet read the previous two books in the series (Cape Refuge and Southern Storm) and therefore was unfamiliar with the recurring characters. But as I read, I felt Blackstock gave me enough information to understand her characters and their recent history (without giving any spoiling details) and I quickly connected with the characters, gripped by their intriguing circumstances. The murder mystery sucked me in and held my attention until the very end. I guessed and guessed, but still, the ending surprised me - in a good, satisfying way, of course. Though there were moments when the abundance of perspectives bothered me and the dialogue seemed overly preachy, River’s Edge is an overall fantastic story with plenty of mystery and suspense. I can’t wait to pick up the next book in the series, Breaker’s Reef, and I would recommend this one to any fans of the genre.Thanks to BookLook Bloggers, I received a copy of River’s Edge and the opportunity to honestly review it. I was not required to write a positive review, and all the opinions I have expressed are my own. (I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”)"}, {"userName": "Aerykah", "userReviewDate": "Dec 29, 2011", "userURL": "http://www.goodreads.com/user/show/5920961-aerykah", "userReview": "This book was a little tough for me to get into at first; but, once I got into it, it was a really great book! Being the 3rd book in the Cape Refuge series, there's already been a foundation laid for the story and there are quite a few references to things that happened in the first 2 books. It's definitely not a stand-alone book. If you haven't read the first 2, then don't read this one yet, because you'll miss a lot.I really enjoyed reading about Blair's growth from rejecting God to accepting Him and learning more about Him. I also liked Cade's willingness to hold off on a relationship with Blair while trusting God to bring her to Him rather than rushing into a relationship and hoping that he could change her himself.The struggles Morgan and Sheila went through were pretty awful. No matter which situation you were in, it would be really hard to do what was right and what needed to be done. I loved the way the relationship between the two of them turned out. :)As for the killer... I usually either figure it out or have a pretty good idea who the guilty party is; but this time, I was pretty surprised and had no clue until the characters in the book figured it out.Really enjoyable read! And now I'm off to get my hands on book 4 in the Cape Refuge Series: Breaker's Reef. :)"}, {"userName": "Nancy", "userReviewDate": "Apr 10, 2015", "userURL": "http://www.goodreads.com/user/show/7092147-nancy", "userReview": "A Mayoral Race Upset by MurderIn the third book in the Cape Refuge Series, Morgan and Jonathan are still running Hanover House, a transitional facility for drug offenders. To complicate their lives, Jonathan is running for mayor and they are trying to have a baby, but with little success. Morgan is drawn to Lisa, wife of another mayoral candidate because they both have fertility problems. When Lisa disappears, the investigation centers on her husband. The evidence is there, but Chief of Police Cade, has trouble believing that her devoted husband would kill her. The characters are believable. Morgan and Jonathan are the kind of sympathetic people that make running a transition house work. Their problems are something many people can relate to: the rigors of a campaign, and the heartbreak of being unable to conceive a child. It may surprise readers new to Cape Refuge that the book is not only a murder mystery, but also a portrayal of Christian values. Blackstock isn't too heavy handed with her Christian message, but the ideals of family and helping others are well illustrated by the way Morgan and Jonathan run Hanover House.I recommend this book if you like a mystery with a twist at the end that is relatively free of violence. I reviewed this book for BookLook Bloggers."}, {"userName": "Simran Pahwa", "userReviewDate": "Mar 19, 2015", "userURL": "http://www.goodreads.com/user/show/22042857-simran-pahwa", "userReview": "This novel is the third novel in the Cape Refuge series. Now, although I haven’t read the first two novels in this series (Cape Refuge & Southern Storm), it wasn’t as confusing as I thought it would be! There were some areas of the book where I was kind of confused as to what was going on, but I guess that would be my fault for not realizing that I had ordered the third book rather than the first! Anyway, moving onto the review. This novel revolves around a series of murders that begin to unravel after the disappearance of Lisa Jackson, wife of one of the major competitors in the mayoral race. River’s Edge has the perfect combination of romance, suspense, and fraud, which makes this novel a very easy read, at only 360 pages! I was given this novel by BookLook Bloggers to review. I enjoyed it and I didn't put it down until it was finished! Great novel! It was very religious based, which i think kind of took away from the novel a bit. But still, I look forward to reading Breaker’s Reef, the last novel in this series! I would definitely recommend this novel to anyone who's into Suspense/Christian Fiction."}, {"userName": "Andrea", "userReviewDate": "Dec 08, 2010", "userURL": "http://www.goodreads.com/user/show/333533-andrea", "userReview": "My library went to the effort of getting the rest of the books in this series for me, so I feel obligated to finish them, but I have to say that the series isn't living up to my expectations. First, for a town whose typical crime is parking violations, there sure have been a lot of murders. I think I'd be packing up and moving. And, what is the deal with Blair and Cade? It seemed like they were together at the end of the first book. Then, the whole second book was about them getting together (well, it was about a lot of other things, but their \"relationship\" dragged on throughout). Then, same thing in the third book. They're probably still not really together in the last book of the series either.There were several \"spiritual\" parts that dragged on, and seemed to detract from the rest of the story. It's hard to explain, but sometimes an author can integrate that sort of thing very well and keep with the flow of the story. Wasn't working smoothly in this one.Those things aside, the story is pretty interesting. I had some suspicions about the bad guy, but was glad that I wasn't right on (who likes a really obvious story?)."}, {"userName": "Mary", "userReviewDate": "Aug 04, 2014", "userURL": "http://www.goodreads.com/user/show/9326804-mary", "userReview": "In a world gone crazy with tragedy—the Boston bombing, the West, Texas explosion, a friend forced to invite Hospice into her home—turning to a good novel can be an escape of a necessary kind. My reading style allows background noise. So Thursday, I set the TV to breaking news and settled down with a novel that’s been waiting for just such a week. River’s Edge by Terri Blackstock, the 3rd in her Cape Refuge series, was perfect. I plunged into life in Blackstock’s island town of Cape Refuge: Morgan agonizing over her miscarriage; Blair searching for stories for her thrice weekly newspaper issues; Jonathan running for mayor to save friend Cade’s job as police chief. And amid all that, a murder . . . Blair probes into the mystery and turns up clues. But her new love interest, the police chief, feels that her headlines make him look incompetent and threaten his slender hold on his job.Taking a break from reading to check on Boston news, I saw reporters facing Blair’s dilemma. They wanted to fully inform the public (me) but had a responsibility to the police authorities. Airing too much information might jeopardize their search for the bomber(s)."}], "description": "The man Lisa Jackson loved most may have betrayed her. Another used deception to manipulate her. But did one of them kill her? Ben Jackson is sure to defeat Jonathan Cleary in Cape Refuge’s mayoral race, until his wife turns up missing the day before a major debate. Suspecting foul play, Police Chief Cade launches an island-wide search. But it takes a psychic’s “vision” to point police to the riverside—and Lisa’s body. The evidence implicating Ben in his wife’s murder is convincing. But as a local scandal escalates into a national media circus, Cade’s instincts tell him to dig deeper. And he’s not the only one. Blair Owens of the Cape Refuge Journal is using her investigative skills to uncover a rat’s nest of dirty secrets—and more than one person with a motive for murder. But Blair’s methods are jeopardizing her relationship with Cade, and an unsolicited prediction from the psychic only adds to her troubles. Is the man’s so-called gift truly from God, as he claims? Did Lisa’s murder have anything to do with the mayoral race, her husband’s alleged affair, or her decade-long struggle with infertility? Whoever the killer is, he’s about to take his evasion of justice to the next, lethal level. And someone else is going to die.", "title": "River's Edge\n      \n          (Cape Refuge #3)", "url": "https://www.goodreads.com/book/show/305439.River_s_Edge", "average": 4.3, "cover": "https://images.gr-assets.com/books/1441752648l/305439.jpg", "reviews": 118, "authors": [{"url": "https://www.goodreads.com/author/show/19811.Terri_Blackstock", "name": "Terri Blackstock"}], "type": ["Christian Fiction", "Mystery", "Christian", "Fiction", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/305439.River_s_Edge", "http://www.goodreads.com/book/show/7662795-river-s-edge", "http://www.goodreads.com/book/show/8141492-river-s-edge", "http://www.goodreads.com/book/show/34723386-river-s-edge", "http://www.goodreads.com/book/show/21978045-river-s-edge", "http://www.goodreads.com/book/show/183092.Night_Light", "http://www.goodreads.com/book/show/593152.Last_Light", "http://www.goodreads.com/book/show/305438.Cape_Refuge", "http://www.goodreads.com/book/show/26263487-if-i-run", "http://www.goodreads.com/book/show/593155.Southern_Storm", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}