{"ratings": 87, "userreviews": [{"userName": "Karl", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/18672-karl", "userReview": "[sigh] This most be the most anticipated and ultimately the most aggravating book I’ve read in a long time. I loved going to these movies. And I worked at a theatre in downtown Seattle during the early seventies when many of these films played their first-run roadshow/hard ticket releases. This is not my memory of the era.One would think that an exclamation point after the word ‘roadshow’ in the title might indicate enthusiasm. But in this case it must instead indicate irony, because the author seems not to like any of these films except perhaps Fiddler on the Roof and Cabaret. In a depressing litany concerning some 20 films released between 1965 and 1972 he just goes on and on about all the perceived short-comings of each and everyone of them. He liberally quotes both Rex Reed--who nobody ever took seriously then or now as a film critic--and Pauline Kael who, while a fabled writer, never was a champion for main stream Hollywood cinema. He also delights in long lists of how many kegs of nails and board feet of lumber and lengths and types of fabric were used in all these films. And for some reason he chooses to ignore the more than two dozen non-musical films that were released as roadshow engagements in this relatively brief seven-year period. They certainly had a bearing on the disappearance of the roadshow exhibition model as well.Many have commented on his glaring Sondheim error re. Funny Girl. While early on it does call into questions his musical theatre chops, I’ll give him a begrudging pass as Sondheim & Jule Styne did collaborate on the score for another showbiz biography, Gypsy, a few years earlier. The chronology of the book is a mess. I understand that he wanted to indicate a continuum of the events described. However there are many times that without a skipped line between paragraphs he starts talking about another film. Wait wasn’t I just reading about Finian's Rainbow? How’d we get to Oliver!? And not devoting a chapter to each film makes it difficult to impossible to review what was said about any specific film. He also seems to believe that we were all waiting for the big Hollywood film to go away so we could have more films like Who’s Afraid of Virginia Woolf? and The Graduate and Easy Rider (his favorite go-to hip references). Can’t I enjoy the most recent Disney or Pixar release and still enjoy the latest Richard Linklater offering too? Since when was movie going ever an either or proposition?And yet for all of this he ends with the observation: “We’ve been herded into Cineplex boxes and subjected to ads for breath mints and the United States Marine Corps ever since. Movies turned digital, got smaller, not bigger, and are now made on computers compatible with laptops and cell phones. We who love real movies lit from behind through celluloid would rather be sitting in the Rivoli as the house lights dim and the overture begins on something big and beautiful in 70-millimeter.” Yes, Mr. Kennedy, yes."}, {"userName": "John", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/2678481-john", "userReview": "This had all the earmarks of something that I would love. A film history book about the over-produced musicals of the late 60s and early 70s. Right? Unfortunately, this book was a big disappointment. It's full of quotes, facts and history but lacks heart. It seems to be written by someone who A. Doesn't like these movies. B. May not even like musicals. Over than one or two, he has nothing nice to say about these movies. True some are awful but awful in an enjoyable way. Most of his trashing is regurgitating critic's opinions. A sad, depressing read that could have been so much more. The history itself is fascinating and I would like to say heavily researched, however, I came across multiple errors in the text. Since then I've heard from other folks who found even more mistakes. To his credit, he has undertaken a very expansive project but the mistakes I found were so easily checked it made me wonder what else is wrong. Easily checked mistakes like a mistitled song from Half a Sixpence ('Money to Burn' NOT 'Playing On Banjo'?!)or stating that Jule Styne and STEPHEN SONDHEIM were the composer/lyricist team for Funny Girl. It should have been Styne and Bob Merrill. And then strange omissions. He mentions that Richard Rodgers questioned whether Julie Andrews would be photogenic enough to play Maria on film yet makes no mention of the fact that years earlier Julie had been handpicked by Rodgers and Hammerstein to star in their TV musical Cinderella. True TV and Film are different mediums but it's an odd exclusion. Even odder is during one of the frequent fact spouting he mentions that Max Jacobson, the famous speed pushing 'Dr. Feelgood' was one of the visitors on the set of 'Paint Your Wagon' yet doesn't mention that the film's Writer/Lyricist/Producer Alan Jay Lerner was a 'patient' of the Dr's and had a serious speed addiction at the time which likely negatively influenced his decisions on that production. Sad. I love these films. It's too bad the author doesn't."}, {"userName": "Amanda", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/62202-amanda", "userReview": "While it's great that this period of the musical genre's history is starting to get more attention, and while Kennedy has clearly done a great deal of necessary archival and primary document research, his argument is simplistic and old hat. Though his analysis of the genre's development is a bit more nuanced than some, his book offers nothing new to the history of the film musical. Pick up almost any history of the musical and you will find this same basic argument, written in the same basic tone: that the musical genre died in the 1960s because the films were simply bad. The chronological structure makes for a disjointed read, as accounts of individual films are fragmented and spread throughout multiple chapters, and this also makes it impractical to use this book as a reference for information about a specific musical. There are some mistakes in terms of names, song titles, or dialogue quotations that I found quite annoying (and that in this age of DVD and the internet are easily double-checked and corrected), and Kennedy sometimes contradicts himself on smaller points within his larger argument. If you are interested solely in the production histories of these musicals, the book has a great deal to offer, and it can provide some useful details. As a historical argument about the development of the musical genre within the larger context of the history of Hollywood filmmaking, it leaves much to be desired and can prove quite a frustrating read."}, {"userName": "Michael Ritchie", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/4649853-michael-ritchie", "userReview": "At last, a work of pop culture non-fiction that is educational and a joy to read. The topic is the big, bloated movie musicals of the late 60s-early 70s that followed in the wake of the success of The Sound of Music, and the author covers them all, mostly big flops like Camelot and Star!, with an occasional hit like Fiddler on the Roof, writing well about the making of the films and the (usually negative) reception by press and public. He ties his subject to the death of the \"roadshow\" engagement, in which a movie would play in a limited number of cities and theaters with reserved seat tickets, and he has whetted my appetite for another book that would cover the non-musical roadshows. I recommend this to movie fans without reservation (pun intended)."}, {"userName": "Joel", "userReviewDate": "Jun 01, 2014", "userURL": "http://www.goodreads.com/user/show/2653618-joel", "userReview": "I expected more, or rather, something different. What is a roadshow film, why were they popular, and why did they then cease to be popular? The author doesn't really tell us. Rather, we get a lot of behind-the-scenes stories about the making of a number of movie musicals, and then some critiques of the films themselves. There's a lot of Monday morning quarterbacking here. Why did one film succeed while another doesn't? It's hard to know -- the author doesn't take much time to explain the \"why.\" Many of these stories are entertaining, but to what end? Michael Medved's Golden Turkey Awards (written in 1980) tells the stories of many of these films in a much more interesting manner."}, {"userName": "Doug Johnson", "userReviewDate": "Jun 01, 2014", "userURL": "http://www.goodreads.com/user/show/27023558-doug-johnson", "userReview": "The decline of the big, studio movie musical is such an interesting subject to a classic film fan. It's unfortunate that this information-filled, easy-to-read history of the end of an era is nonetheless dispassionate and indifferent. I agree with the reviewer who mentions that the author doesn't even seem to like these movies (which isn't the case, I'm sure). There are moments where the work is biting and fun, bordering on bitchy, and this tone more even distributed through the history would definitely elevate the material."}, {"userName": "John", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/3776579-john", "userReview": "Great companion piece to Mark Harris' \"Pictures at a Revolution\" about the Best Picture Nominees of 1968. Like an addict jonesing for that initial High, Hollywood kept trying to duplicate \"The Sound of Music\"."}, {"userName": "Nathaniel", "userReviewDate": "Oct 08, 2014", "userURL": "http://www.goodreads.com/user/show/177713-nathaniel", "userReview": "A must for anyone who has ever wondered why the Musicals vanished from the cinematic landscape for two decades (thank god they're back)"}, {"userName": "Donald Butchko", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/16823245-donald-butchko", "userReview": "An entertaining and compulsive read that was nevertheless frustrating after a while. For someone who starts off talking about his love for movie musicals and cast recordings, the author has really nothing but disdain for most of them. Many of these films are notoriously flawed, but he Kennedy has no affinity for their source material (when based on Broadway titles). Movies handled in later chapter got glossed over, as if he was getting bored with the project. But it was still interesting to hear about this turbulent time in Hollywood history, and he did a good job of putting these decisions in context with the changes in studio management and ownership."}, {"userName": "Richard", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/6522401-richard", "userReview": "Academic, but addictive, I really enjoyed reading this book. Not only does the author have a keen appreciation for musicals, allowing him to analyze what went right and went went wrong in many of these films, he has the wherewithal to put the business aspect of these films in sharp focus. He's got the statistics, but also sound theories (often based on quotes or interviews with the major players) about why money was spent, careers made and broken, and movies made--good or no. An interesting and entertaining read, particularly if you know the pictures he's talking about."}, {"userName": "Russell Sanders", "userReviewDate": "Dec 15, 2015", "userURL": "http://www.goodreads.com/user/show/1813997-russell-sanders", "userReview": "Reading Roadshow: The Fall of Film Musicals in the 1960s by Matthew Kennedy is like finding out that your adored favorite aunt and uncle actually had a marriage filled with bickering, money problems, and unplanned, unwanted children. It’s that kind of book, only about movie musicals. In Hollywood parlance, a roadshow was a movie that was long, very expensive, and presented in large theaters with reserved seating at inflated prices before it made its way to your neighborhood movie house. This 1960s practice was a ploy to lure people away from their televisions and once again see movie going as a special experience. Along came The Sound of Music and its astounding success. Filmmakers clamored to make bigger and richer clones of this blockbuster. Thus came films of My Fair Lady, Camelot, Hello Dolly!, Oliver!, Funny Girl, Man of La Mancha, and original musicals like Dr. Dolittle, Star!, and Goodbye Mr. Chips, among others. All these films had one thing in common: they were overblown and bloated. They had their charms, but for the most part, they were so expensive that studios did not recoup their investments (or barely made a profit) and film critics ripped them apart. Producers fought with directors; directors fought with actors. In an attempt to have that one hit that would save the studio with its huge financial returns, producers greenlighted expenditures like water flowing from a never-closed spigot. The movies featured, in many cases, actors who were not singers, demanded enormous salaries, and had even more enormous egos. The films won awards, but then again, film awards are often given by groups who have a horse in the race: after all the Motion Picture Academy of Arts and Sciences, those folks who give out Oscars, is made up of movie industry employees. It behooves them to bestow accolades on films that will reap the most profits by having won an Oscar. But aye, here’s my rub—I adored almost all of these musical movies. I eagerly awaited their arrival no matter what I read from critics, and the movies did not disappoint me. My Fair Lady was elegant and tuneful; Camelot was richly appointed, visually stunning; Star! Featured Julie Andrews for three glorious hours, singing her heart out without being surrounded by children; Funny Girl brought us the sublime Barbra Streisand for the first time on screen; Goodbye Mr. Chips had Peter O’Toole in his finest performance. My list could go on and on. So it is disheartening to me to read about the faults of these films, to read how overbearing many of the stars were—Streisand fought with the director, O’Toole couldn’t sing a note on key, complained about everything in Man of La Mancha, Rex Harrison was overbearing and had an insane wife, Andrews was not the sweet girl we’d come to know—to read the off-screen machinations of the studio heads as they threatened, spent lavishly or withheld money, hired and fired, and to read that critics of the time often based their critiques more on these off-screen doings than the merits of the films. I admit the book is fascinating as Hollywood history, but what bothers me is that I got the impression that Kennedy, a film historian, really doesn’t like musicals at all. He reports his well-documented, well-researched history, and I applaud his work. Then, he critiques the films—or at least, it seemed to me that he was speaking as himself, the viewer—and I heard very little regard for the performances, the production values, the writing, or anything else. Yes, I see the faults in these films, but the pleasures outweigh those. I am aware that the singing in Man of La Mancha is abysmal, that Goodbye Mr. Chips is designed to pull at our heartstrings, and that Oliver! is torn between being a light and lively musical and bleak comment on the underbelly of London during the Dickens era. But I get joy from all of them and most of the others. Yes, Song of Norway is a dog of a movie, and yes, Hello Dolly! is so over the top it is laughable and Streisand is totally miscast, but a recent viewing of the film left me humming the tunes and smiling. So read Roadshow for the history, read Roadshow if you hate musicals, read Roadshow if you want your bubble burst. But if you are upset by all you find out about your favorite movie from the 1960s, know that I am here to commiserate with."}, {"userName": "Biblio Files (takingadayoff)", "userReviewDate": "Dec 16, 2013", "userURL": "http://www.goodreads.com/user/show/3007401-biblio-files-takingadayoff", "userReview": "A roadshow was a movie released by a major studio, in just a few theaters at first and with great fanfare, then weeks or months later, released slowly to other theaters throughout the country. Tickets were issued at higher than normal prices and with assigned seating. The idea seemed to be to make the movie experience more like a Broadway theater experience. I did not know about this phenomenon until I visited Graumann's Theater in Hollywood and saw a display of fancy tickets and programs from movies in the 1920s and 1930s. I didn't realize the practice continued into the early 1970s until I read this book.It all seems rather quaint now that the blockbuster movies are released on as many screens as possible all at once and if a new release doesn't impress on the first day, it disappears quickly. In the 60s even the worst flop would take months to fail.Matthew Kennedy begins with the most successful roadshow, The Sound of Music. This was the peak of the roadshow phenomenon and for movie musicals as well. For the next ten years, movie musicals got more expensive and overproduced and never achieved the success of Sound of Music. Movie studios went broke trying.Kennedy gets into the nuts and bolts of putting together a 60s musical and even into the finances. And then there's the gossip. The story of the making of Doctor Dolittle is my favorite of this bunch, with Rex Harrison insulting everyone and his wife (who wasn't in the movie) creating a scene wherever she went. Of course the movies that were flops are the most fun to read about. Paint Your Wagon was doomed from the start, and Finian's Rainbow could have been halfway good, but boneheaded moves like filming Fred Astaire's dance scenes so that his feet weren't visible on screen kept it from having a chance.Roadshow! is a fun look at a slice of movie history."}, {"userName": "Carly Thompson", "userReviewDate": "Mar 31, 2014", "userURL": "http://www.goodreads.com/user/show/245301-carly-thompson", "userReview": "Interesting and informative book about the big musicals of the late 1960s that nearly killed the genre. After the success of Mary Poppins, My Fair Lady, and The Sound of Music all the Hollywood studios wanted to make big lengthy musicals and present them as roadshows (exclusive engagements at one theatre in a city with high ticket prices). Unfortunately the quality of the movies made ranged from average to horrible. Kennedy presents a great overview of the movies and personalities involved. There were a few factual errors that I caught - Sondheim did not write Funny Girl - and most of the information came from archives and previously published interviews and news stories. I haven't seen many of these movies and wasn't able to appreciate their quality for myself. This is a good book about a particular area of Hollywood, when the old studios were dying and before the New Hollywood film making generation of the 1970s had truly taken over. Recommended for musical fans or fans of old Hollywood."}, {"userName": "Benjamin", "userReviewDate": "Mar 16, 2015", "userURL": "http://www.goodreads.com/user/show/5866525-benjamin", "userReview": "The fall of the American musical in the late 1960s is traced in this insightful book. Following the huge success of 'The Sound of Music', every studio tried to jump on the bandwagon by producing roadshow musicals (to play at exclusive prices in select cities). However, almost all of them failed, some due to production problems and miscasting, but almost all of them due to a misjudging of audience interest at the time, when the US went through a period of cultural revolution in only a few years. Some musicals were still successful (Funny Girl, Oliver!), but most of them bombed (Camelot) and some of them bombed terribly (Doctor Dolittle, Star!).Kennedy examines what happened to the ailing studio system, how new tastes and opinions changed popular culture incredibly quickly in the period 1965-72, and how Hollywood couldn't keep up, with some studios almost facing ruin, and an American artform dying out in a blast of expensive, overproduced glitter."}, {"userName": "GlenK", "userReviewDate": "Mar 12, 2014", "userURL": "http://www.goodreads.com/user/show/6870168-glenk", "userReview": "In the 1960's, Hollywood was almost done in by the success of three musicals released within months of each other. \"Mary Poppins\", \"My Fair Lady\" (both 1964), and especially \"The Sound of Music\" (1965) were so successful they convinced studios that stars (however inappropriately cast), big budgets (even though \"Poppins\" and \"Music\" were hardly expensive) and music were all that was needed to mint money. As made clear by this entertaining book, the reserved seat roadshow musical instead suffered a lingering death and, in fact, many of the huge budget monsters that were to have brought in the cash, tanked spectacularly. All in all, this is a well-written and witty effort but I would have liked more coverage of the 20th Century-Fox trio \"Doctor Dolittle\", \"Star!\", and \"Hello, Dolly!\", textbook examples of enormous expenditure yielding minimal result."}, {"userName": "V. Briceland", "userReviewDate": "Oct 25, 2016", "userURL": "http://www.goodreads.com/user/show/4461267-v-briceland", "userReview": "Kennedy's Roadshow! provides a gossipy, easy-to-read overview of twenty-one major movie musicals presented between 1965-1972 in the extravagant roadshow production style, with a special look at the major flops that killed the genre completely. What the book lacks, however, is any sense of how this genre of excess fits into cinema history. A broader context of how the roadshow came to be a major money sink (and less frequently, a major money-maker for its studios) might have left the reader with something more significant than a list of figures and a tattletale report of Rex Harrison's eccentricities."}, {"userName": "Margaret Sankey", "userReviewDate": "Oct 04, 2013", "userURL": "http://www.goodreads.com/user/show/5861086-margaret-sankey", "userReview": "In 1964, movie studios produced three blockbuster musicals--The Sound of Music, Mary Poppins and My Fair Lady, lavished with full promotional roll out, reserved seat screening and fanfare. This success caused studios to lock themselves into productions of a wave of other musicals, most of which bloated into out of touch monstrosities increasingly tone deaf to changing tastes and bankrupting two major studios. Kennedy ends this book with the two 1970 musicals--Fiddler on the Roof and Cabaret, that caught changing times and were successful, as well as the VHS revolution that made the older, less successful ones accessible again for smaller niche audiences."}, {"userName": "Alex Diaz", "userReviewDate": "Sep 22, 2014", "userURL": "http://www.goodreads.com/user/show/26486220-alex-diaz", "userReview": "While less than a chair-gripping read, it was a delightful exploration of a time of extravagance, and a fascinating view at the insecurities and unoriginality that almost inevitably goes into movie production and development. It paints a picture of a Hollywood devoted to results, without the slightest inclination towards understanding why the original musical cash-cow (The Sound of Music) was a success to begin with. Frankly, any book that can make The Sound of Music the bad guy is an accomplishment as far as I'm concerned (and that is coming from a genuine fan)."}, {"userName": "Simone", "userReviewDate": "Dec 30, 2014", "userURL": "http://www.goodreads.com/user/show/1484853-simone", "userReview": "I thought this was a really interesting examination of the popularity of 60s musicals and the roadshow phenomenon. Especially to read after Pictures at a Revolution: Five Movies and the Birth of the New Hollywood which talks a lot about the problems of Doctor Dolittle and touches on some of the other movies Kennedy discusses."}, {"userName": "Berrylibrary", "userReviewDate": "Oct 10, 2015", "userURL": "http://www.goodreads.com/user/show/2550791-berrylibrary", "userReview": "While there were some interesting stories and nice research, the overall organization of this book was lacking and disjointed. I still don't have a good sense of what a roadshow actually was or what it was like. Also, there was no clear argument about what's killed movie musicals. The author is so familiar with the subject that he seems to forget that his audiences needs more explanation. Fun information though if the reader is fine with not fully understanding the topic."}, {"userName": "Laura", "userReviewDate": "May 14, 2014", "userURL": "http://www.goodreads.com/user/show/30448879-laura", "userReview": "I thought this would be good but I hate the way it was organized. I wish he would have done each musical as a seperate chapter, instead he did it as a progression going back and forth more like a time line. There were some juicy tidbits but I wanted more (embarrassed about that). Very current though, even les mis got a mention."}, {"userName": "Paul", "userReviewDate": "Aug 10, 2014", "userURL": "http://www.goodreads.com/user/show/4065594-paul", "userReview": "Fascinating book about an era where Hollywood was dealing with major changes, and found a \"solution\" that hurt a genre and almost killed the industry. It's part film critique, part case study, and part industry history, and there are some things in here that today's film executives might want to consider, even if they have no intention of greenlighting a movie musical."}, {"userName": "Jenn Davis", "userReviewDate": "Oct 20, 2016", "userURL": "http://www.goodreads.com/user/show/3162614-jenn-davis", "userReview": "An in-depth look at film musicals of the 1960s and early 1970s. The rise and fall of the big-budget movie musical. Interesting read. I didn't realize how many musicals came out in the 1960s, some that became classics but others that just brought the decline of the genre."}, {"userName": "Anne Mansella", "userReviewDate": "Nov 08, 2014", "userURL": "http://www.goodreads.com/user/show/27286113-anne-mansella", "userReview": "This book was great at first but then started getting dry fast - lots of facts but no real passion when it came to the writing. I did learn some interesting things, however!"}], "description": "Full-page newspaper ads announced the date. Reserved seats went on sale at premium prices. Audience members dressed up and arrived early to peruse the program during the overture that preceded the curtain's rise. And when the show began, it was--a rather disappointing film musical.In Roadshow!, film historian Matthew Kennedy tells the fascinating story of the downfall of the big-screen musical in the late 1960s. It is a tale of revolutionary cultural change, business transformation, and artistic missteps, all of which led to the obsolescence of the roadshow, a marketing extravaganza designed to make a movie opening in a regional city seem like a Broadway premier. Ironically, the Hollywood musical suffered from unexpected success. Facing doom after its bygone heyday, it suddenly broke box-office records with three rapid-fire successes in 1964 and 1965: Mary Poppins,  My Fair Lady, and The Sound of Music. Studios rushed to catch the wave, but everything went wrong. Kennedy takes readers inside the making of such movies as Hello, Dolly! and Man of La Mancha, showing how corporate management imposed financial pressures that led to poor artistic decisions-for example, the casting of established stars regardless of vocal or dancing talent (such as Clint Eastwood in Paint Your Wagon). And Kennedy explores the impact of profound social, political, and cultural change. The traditional-sounding Camelot and Doctor Dolittle were released in the same year as Sergeant Pepper's Lonely Hearts Club Band, representing a vast gulf in taste. The artifice of musicals seemed outdated to baby boomers who grew up with the Cuban missile crisis, the Kennedy and Martin Luther King Jr. assassinations, race riots, and the Vietnam War.From Julie Andrews to Barbra Streisand, from Fred Astaire to Rock Hudson, Roadshow! offers a brilliant, gripping history of film musicals and their changing place in our culture.", "title": "Roadshow!: The Fall of Film Musicals in the 1960s", "url": "http://www.goodreads.com/book/show/17847520-roadshow", "average": 3.76, "cover": "https://images.gr-assets.com/books/1372046132l/17847520.jpg", "reviews": 24, "authors": [{"url": "https://www.goodreads.com/author/show/61396.Matthew_Kennedy", "name": "Matthew Kennedy"}], "type": ["Nonfiction", "Culture", "Music", "Media Tie In"], "outlinks": ["http://www.goodreads.com/book/show/17847520-roadshow", "http://www.goodreads.com/book/show/1906476.Joan_Blondell", "http://www.goodreads.com/book/show/24237659-gamers-and-gods", "http://www.goodreads.com/book/show/24855757-pathspace", "http://www.goodreads.com/book/show/18897099-iced-coffee-recipes---secret-mouth-watering-recipes-for-beginners", "http://www.goodreads.com/book/show/106079.Edmund_Goulding_s_Dark_Victory"]}