{"ratings": 46, "userreviews": [{"userName": "Linda Barrett", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/52642248-linda-barrett", "userReview": "Road is a very interesting 4 star read by (new to me author) Kathy Dinisi.I've come away with two things after reading this book 1) I've found myself a new author to read and 2) I'm NEVER going hiking in the mountains EVER.This story gripped me from the start and I couldn't put my kindle down until I had read it all.I grew up watching horror films and this book had an essence of Wrong Turn to it which I absolutely loved.It was a real page turner and I thoroughly enjoyed reading this book.5 friends go hiking in the mountains and life changes for them all.What should be a fun couple of days camping and hiking turns into their worst nightmares.It's just what I needed to read to wet my appetite for the blood curdling horror fest I have planned for Halloween.Go one click this book asap but don't read it if you are out camping as you don't know who's lurking in the shadows."}, {"userName": "Monica Reents", "userReviewDate": "Dec 24, 2017", "userURL": "http://www.goodreads.com/user/show/13910930-monica-reents", "userReview": "Great story! It keeps you turning the pages and needing to know what's coming. I love the creepy feel and moments of tension. I gave this book four stars for these reasons, otherwise, I would have given it three stars due to the editing this book needs. If you enjoy creepy horror stories, I would still recommend this book and author."}, {"userName": "Naomi Downing ", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/35861572-naomi-downing", "userReview": "Do you like hiking? If you do you might think twice about going hiking again after reading this. Good, quick and scary read that really makes you wonder what is following you through the woods as you walk."}, {"userName": "Yawatta Hosby", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/8447063-yawatta-hosby", "userReview": "This would've been five stars but the book needed an editor. The run on sentences and bad formatting of some chapters with my kindle version were distracting. The premise was awesome and truly terrifying. I'm scared of the woods. I could see the book as a horror movie."}, {"userName": "Alicia Freeman", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/42774819-alicia-freeman", "userReview": "A great thriller ride! Lisa and her friends decide to go on a hike in the mountains to just get away. What they find is not what they expected. Kathy Dinisi is one of my favorite thriller/horror authors. Get ready for a helluva ride!"}, {"userName": "Lucille Bransfield", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/14843932-lucille-bransfield", "userReview": "3.5 stars. I finished this book practically in two sittings. Very fast paced, quick read. Kept me hooked until the end. I've never read this author before, but will look into other books now."}, {"userName": "Whitney Cannavina", "userReviewDate": "Jun 02, 2016", "userURL": "http://www.goodreads.com/user/show/24805498-whitney-cannavina", "userReview": "I received an ARC for an honest review5 friends on a trip in the mountains turns out to be more than they bargained for. A hike to a bridge, a night of revelations, and a sinister feeling turns out to be something from a horror film. As these 5 friends try and make it back to safety, monsters of the mountains chase and kill them one by one. Who will live? Who will die?I absolutely loved this horror story. It's something of a Stephen King novel. Horror, death, and mystery. The group of friends capture your attention while the details of each horrendous act keep you riveted to the pages. I wasn't sure who would live or die and by the end is was speechless. If you love horror, guts and gore this is the book for you5 stars"}, {"userName": "Bonnie", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/33437557-bonnie", "userReview": "I did a beta read for this book and I went in very much looking forward to it because I had read other books by Kathy Dinisi and loved them. This book is the epitome of the thriller genre I absolutely couldn't put it down!! I have a routine with thriller/suspense novels I wait until nightfall and read it in the dark I look for the fear factor and I want to be creeped out. This book definitely gives me the creeps and its fast paced and adventurous and definitely creepy!!! I love it and I will be recommending it to all my friends!!"}, {"userName": "Jo Kappel", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/25795844-jo-kappel", "userReview": "I sat down to read a little bit, just a few pages. Nope not going to happen. I read the whole thing.Kathy is an amazing up and coming author. Her books reel you in, her chase tears are real and could lie next door.I am not a hiker, but I do love the outdoors, I love nature.At the beginning I wanted to go climb the hill at the end of the street, at the end I wanted to put a lock on the gate and hunker down.Read it you won't be sorry!"}, {"userName": "Melissa Spillman", "userReviewDate": "Jun 20, 2016", "userURL": "http://www.goodreads.com/user/show/35631182-melissa-spillman", "userReview": "I very much enjoyed this book. I was given an advance copy to beta read for the author Kathy Dinisi. It was fast paced, it was exciting, creepy and kept me turning the pages. The characters were engaging and fun. The \"bad guys\" were creepy and disgusting, the story was gory in the right places and it was a complete thrill ride. Another fast paced hit by Kathy!! Loved it :)"}, {"userName": "Treena Ross - Rockstar Book Muse", "userReviewDate": "Sep 29, 2016", "userURL": "http://www.goodreads.com/user/show/45826015-treena-ross---rockstar-book-muse", "userReview": "4.5 STARSThe ultimate in creep factor. This is my first book from Kathy Dinisi and I was so glad I got the opportunity to read this.I am a huge fan of thrillers and this one is no exception, fast paced and adventurous I could not put it down!! The thrill factor is there from the beginning to the end and anyone who likes a good thriller this one is for you!!!"}, {"userName": "Hugh Williams", "userReviewDate": "Jul 06, 2016", "userURL": "http://www.goodreads.com/user/show/14689941-hugh-williams", "userReview": "This is a different book than one I have come to expect from this author. Her writing style continues to grow. As for the story, she has excellent character development and a very good story line. When i read her books, I get the feeling that I am there witnessing the story and interacting with the characters. Very well done and well worth the read."}, {"userName": "Laura  Hernandez", "userReviewDate": "Oct 28, 2016", "userURL": "http://www.goodreads.com/user/show/16419149-laura-hernandez", "userReview": "This author has the talent to write all sorts of genres and this latest read is no exception. This well written story line kept me glued to the edge of my seat from beginning to end as I felt that I was the one fighting to survive this horrendous ordeal and the characters come to life right in front of you. Don't pass up reading this book!!"}, {"userName": "Cora Murray", "userReviewDate": "Jun 17, 2016", "userURL": "http://www.goodreads.com/user/show/21074700-cora-murray", "userReview": "Road is a great thriller, it sucks you in and you have to find out what's going to happen to these five friends. If you like the creep factor you will definitely enjoy, Road. The bridge, the mountain side, the quiet is all disturbed by murder, mayhem and weird people. Yep grab it if you like to be creeped out."}, {"userName": "Alicia Huxtable", "userReviewDate": "Oct 30, 2016", "userURL": "http://www.goodreads.com/user/show/27797091-alicia-huxtable", "userReview": "Definitely a jumpy storyRight from the start Road had my pulse racing. I just knew it was going to get ugly.....just didn't know how ugly. By the end not only was my pulse racing but so was my heart. Not for squeemish readers"}, {"userName": "Thai Holman", "userReviewDate": "Jun 21, 2016", "userURL": "http://www.goodreads.com/user/show/31654985-thai-holman", "userReview": "Wow what started out as a fun road trip, became a nightmare. Great book, it's scary suspenseful, edge of your seat joy road. This would be a great movie. I enjoyed this more that Kathy's other books. Never a dull moment that's for sure. Amazing horror book."}, {"userName": "Tricia Bailey", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/43562795-tricia-bailey", "userReview": "Great book from Kathy Dinisi again. This book is a good thriller, the characters was well described with the \"good guys & bad guys\". This story flowed really nicely Couldn't put this book down I just had to finish it!Seriously I'm in love with this book. Kathy did it again"}, {"userName": "Elizabeth Collins", "userReviewDate": "Jun 04, 2016", "userURL": "http://www.goodreads.com/user/show/15002405-elizabeth-collins", "userReview": "Oh my gosh I am amazed at how awesome this book is. Kathy knows how to pull a reader into her books. There was so many great parts they all flowed together great. Highly recommend any of Kathy's books."}, {"userName": "Mona williams", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/56242731-mona-williams", "userReview": "omg this book was awesome! it was hard to figure out at first what was going on! talk about living a nightmare highly recommend this book to everyone!"}, {"userName": "Paula Genereau", "userReviewDate": "Jun 16, 2016", "userURL": "http://www.goodreads.com/user/show/38001173-paula-genereau", "userReview": "Kathy has done it again. I loved this book. It kept me in suspense. What one never thinks would happen on a trip with friends. Well it turns so dangerous. Loved loved this book"}], "description": "On a beautiful summer day, five friends embarked on what was supposed to be an adventurous ten-mile hike to a hidden bridge built in the middle of a mountain that not very many people knew of. What was supposed to be a beautiful, enjoyable and relaxing weekend, becomes more than they bargained for as they will experience horrors that until now have only been dreamt of. Trapped in the middle of nowhere can these five friends make it back to safety or will the monsters of the mountains chase and pick them off one by one. Who will live? Who will die?", "title": "Road", "url": "http://www.goodreads.com/book/show/30341047-road", "average": 4.15, "cover": "https://images.gr-assets.com/books/1464923934l/30341047.jpg", "reviews": 22, "authors": [{"url": "https://www.goodreads.com/author/show/13614168.Kathy_Dinisi", "name": "Kathy Dinisi"}], "type": ["Horror", "Female Authors", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/30341047-road", "http://www.goodreads.com/book/show/32492308-road", "http://www.goodreads.com/book/show/25115374-a-vacation-from-hell", "http://www.goodreads.com/book/show/25856882-a-world-apart", "http://www.goodreads.com/book/show/26890380-arrived", "http://www.goodreads.com/book/show/35121331-his-hers-ours", "http://www.goodreads.com/book/show/29193940-till-death-do-us-part"]}