{"ratings": 16, "userreviews": [{"userName": "Barbara", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/1222379-barbara", "userReview": "Being accustomed to more subdued colors for dinosaurs, I found this picture book with its array of colors for those prehistoric creatures to be quite visually appealing. Although the book doesn't provide a lot of information about dinosaurs, it does exactly what its title promised--offering a sort of visual walking tour of them, starting with the kentrosaurus, and ending with the gigantosaurus. Readers meet dinosaurs representing a wide variation in sizes and shapes as well as seeing the different weapons they used. The final page concludes the book by reminding readers that while they can no longer see the dinosaurs in real life, many museums display their bones. I liked the end papers, which feature the heads of 18 different dinosaurs with their scientific names and how to pronounce them on the front end paper and a more common name for the dinosaur on the back set of end papers. The book provides a quick visual introduction to a topic that continues to fascinate most youngsters."}, {"userName": "Read  Ribbet", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/2259568-read-ribbet", "userReview": "For the dinosaur fan, this easy to read picture book introduces different types of dinosaurs by presetting characteristics that compare and contrast the beasts. End pages include the names of all the dinosaurs with a pronunciation guide. Bold graphic illustrations (less realistic) are used to capture the dino. There are lots of dino fans so add to your collections if you are working or living with one."}, {"userName": "Vicki", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/1052997-vicki", "userReview": "Calling all dinosaur lovers. A well done dinosaur book, with simple text, hard to pronounce dinosaur names-thank goodness to the pronunciation guide in the front endpapers.The illustrations are colorful and the back endpapers have more of the common names which are much easier to pronounce.While the book is very good, there is really nothing new here."}, {"userName": "Erin", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/3667445-erin", "userReview": "Bright, colorful, pronunciation guide, not a lot of text. Fine for storytime, classes. Not much of a story but more factual."}, {"userName": "Kelly", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/1947828-kelly", "userReview": "Very quick and simple picture book of dinosaurs."}, {"userName": "Kelly", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/4644703-kelly", "userReview": "Terrific, nice and simple, and I love the endpapers! What's cool about them is that on the front endpapers it shows different dinosaurs with their names and pronunciations. On the back endpapers it shows the same dinosaurs but with what their dinosaur name translates to, such as triceratops - three-horned face."}, {"userName": "Crystal", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/938799-crystal", "userReview": "Final copy via publisher"}], "description": "Discover the different types of dinosaurs that once roamed the Earth in this nonfiction picture book with simple text and illustrations.\nA long, long time ago, dinosaurs roamed the earth.Some were big, and some were little. Some were fast, and some were slow. Some lived alone, and some lived together. They are gone now, but you can still see their bones at museums all around the world.Simple text and bold illustrations take young explorers on a tour through the time of the dinosaurs.", "title": "Roar: A Dinosaur Tour", "url": "http://www.goodreads.com/book/show/35870182-roar", "average": 3.5, "cover": "https://images.gr-assets.com/books/1501496121l/35870182.jpg", "reviews": 7, "authors": [{"url": "https://www.goodreads.com/author/show/4677430.Michael_Paul", "name": "Michael Paul"}], "type": ["Childrens", "Animals", "Environment", "Animals", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/35870182-roar", "http://www.goodreads.com/book/show/35870183-roar", "http://www.goodreads.com/book/show/36657030-scouts-of-hell", "http://www.goodreads.com/book/show/35945830-kriegsgefahr-im-pazifik", "http://www.goodreads.com/book/show/35440151-the-visitor"]}