{"ratings": 17095, "userreviews": [{"userName": "Samantha", "userReviewDate": "Jul 03, 2015", "userURL": "http://www.goodreads.com/user/show/10067920-samantha", "userReview": "After all the fun I had with Stray, I was expecting to love Rogue just as much. Sadly, I found it disappointing.First off, although this one is smaller than the first book, I found it to drag. I thought the plot was very predictable, and we were missing all of the character interactions that I loved from the first book.Also, Faythe's character wasn't what it was in the first book. I found her rashness to be more annoying than enjoyable. There were also times where a plot point was very obvious, and it took her some time to figure out. This is not the perceptive character I loved in the first book.Lastly, I found the relationship in this book to be problematic. What was an equal power dynamic in the first book switched to a relationship that read as very emotionally abusive. I expect these alpha male type characters in a book like this, and I can enjoy them. But the love interest crossed the lines in a lot of ways in this book and Faythe did not have the power that she had in the first book, which rubbed me the wrong way.Overall, I found this book to be a completely different experience than the first book. I do plan to continue on with the series, but I am going to take a break before continuing, as this book left me with a bad taste in my mouth. This review was originally posted on Thoughts on Tomes"}, {"userName": "Emily May", "userReviewDate": "May 03, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I'm not going to write a lengthy review of this because I already said pretty much everything I wanted to in my review of Stray. I will just pause to remind everyone that Jace is sexy awesomeness and Marc is a whiny control freak."}, {"userName": "Jacqueline", "userReviewDate": "Jun 12, 2016", "userURL": "http://www.goodreads.com/user/show/9659631-jacqueline", "userReview": "4/5 starsCompared to the first I think it started off a lot slower but towards the end it really picked up! I'm loving this series so excited to continue on."}, {"userName": "Sarah", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/3344685-sarah", "userReview": "1st Read - February 20102nd Read - July 2015Original ReviewI loved Stray, the first book in this series, and I was far from disappointed with Rogue. I would really recommend reading this series in order & although there won't be spoilers for Rogue in this review I can't help but give away some things that happen in Stray. If you've not started this series yet then I suggest you don't read any further. The story continues several months after the end of Stray and as she promised her father Faythe is now working as an enforcer alongside Marc, who she is also now dating again. She is still unsure of her long term plans but is enjoying being an enforcer and is determined to prove herself to her father & the rest of the Pride. It isn't long before strange things start to happen though. The Pride starts to get anonymous phone calls directing them to the bodies of dead strays in their territory. They also discover a pattern of missing human strippers that seems to be linked to the bodies and Faythe is getting threatening phone calls from her ex-boyfriend Andrew. Is it all a coincidence or is everything somehow linked together? I really enjoyed reading this book, Rachel Vincent has a way of sucking you into the story and making it impossible to leave. Faythe is strong and independent but she can also be selfish and immature. At times I wanted to shake her but the very fact that she has her weaknesses makes her seem more human. None of us are perfect and it can be easier to relate to someone who has such obvious faults. There is also a lot of room for Faythe to grow up throughout the series & I'm looking forward to watching this happen. I love the relationships between the Pride members and it is easy to feel like you know the characters personally. Marc is fantastic & I really have to wonder at Faythe's sanity when she pushes him away, sometimes it is really hard to see why he puts up with some of the things she does. I also really like Faythe's brothers. We didn't really get to see much of Faythe's mother in the previous book but she comes into her own more in this book and you get to see more of her influence on Faythe's character. As with the previous book there are lots of things going on and although I was able to make some guesses about how things were going to tie together there were a lot of things that came as a complete surprise. The book ended on a major cliff hanger & I was just relieved that I already own Pride and was able to start reading it immediately! If you haven't already discovered this series then I can't recommend it strongly enough._______________________2nd ReadI'm having so much fun rereading this series and no matter how many faults Faythe has (and she has quite a few of them!) I still love her character along with the rest of the Pride."}, {"userName": "Theresa ", "userReviewDate": "Feb 20, 2008", "userURL": "http://www.goodreads.com/user/show/925476-theresa", "userReview": "The first book, Stray, was better and I only gave it three stars so this book is getting two. This book summarized in a word: boring.The first third of the book was pretty good. It kept my attention and I was interested to see where the author was going. However, around the second third of the book, the book hit a lull. The only action was a couple of dead bodies with broken necks. Woohoo. Exciting. Oh, and the main character, Faythe's, angst over everything under the sun.**SPOILERS**The author focuses far too much time on Faythe's relationship with her on-again, off-again boyfriend, Marc. Marc wants Faythe to give him some kind of reassurance that she's not with him only because he's a warm body to curl up next to. She won't give him that reassurance because she's a free spirit or something. She is incredibly selfish.And she's stupid. There is a bit in the story about stupid women in movies (The Howling) that run outside, almost naked, without a weapon. Dumb Faythe is supposed to be guarding her mom and two other people, and she goes down in to the basement by herself. And the light is \"burnt out\". Moron doesn't even think, oh, I wonder if someone might be down there? Faythe is just as stupid as the women in the movies that she mocks.Then there is the part where she doesn't want to harm this guy because she's \"already hurt him enough\". This is what she's actually thinking as he's beating the living crap out of her. Seriously. I don't think it is a good sign that I found this book less interesting than the first."}, {"userName": "Pam Nelson", "userReviewDate": "Apr 20, 2017", "userURL": "http://www.goodreads.com/user/show/15402332-pam-nelson", "userReview": "4.5 Rogue Stars Wow, if I thought book 1 was action packed this one takes that by a mile. I loved it. I loved the dynamic between all these characters. Mark is a favorite of mine as is Jase. I am rooting for Mark though. Even if his nose got out of joint just a little bit in this book. Also in this book we found out that Fayth is a Canadian were-cat.. Hell ya Go Canada :op I have to say Fayth kinda grew up in this book. She is and has taken responsibility for her actions. She didn’t really whine much ;) this book. And I like that even if it means death she stood up for herself and the truth. Great freaking book, on to the next! *You don't have to like my review but its 100% my opinion, and I am allowed to have it.*"}, {"userName": "I ♥ Bookie Nookie (bookienookiereviews.blogspot.com)", "userReviewDate": "Nov 21, 2009", "userURL": "http://www.goodreads.com/user/show/1488662-i-bookie-nookie-bookienookiereviews-blogspot-com", "userReview": "[So, as I said, I loved the way Faythe is maturing & seems to be embracing her life and future in the Pride. Her independent & rebellious attitude is starting to wear thin on my nerves. She wants to have her cake & eat it too...the best of both worlds..among other over used cliches (that is redundant huh?). Then again, what fun would the book be if the main character was perfect & did everything you hoped they would do--would probably make for a pretty boring book, right?In book 1 she wanted Marc's & Jace's attention--never-minding what havoc followed. She then realized that she had to choose, & she did...correction, Marc chose for her by pretty much tearing Jace apart. She realized that Jace would probably end up dead if she didn't start playing it straight in her love life. Now, in book 2 she is playing a similar game, but this time it is strictly with Marc's emotions. He wants her commitment & a promise of a future together & she can't give it to him. She wants all the heat & passion that comes with the love they share, but she is scared to commit to anything long term. Essentially, he wants her to wear a promise ring--not an engagement ring, a silver, promise ring & she can't even give him that--what is wrong with her? I think she is afraid she will become a \"kept\" woman like she perceives her June-Cleverish, pearl-wearing, brownie baking mother to be. In the final pages of this book, she & her mother share a terrifying, but special moment--it seems that this experience may be just the thing that they needed in order to bond like a mother & daughter should. I think Faythe might be beginning to realize that she & her mother are really not that different after all--her mother just hides behind a very good disguise. I think Faythe could stand to take a few pointers from her mother.The main blunder in the story for me came at the end. I think it is very unlikely that Luiz would be able to infiltrate Faythe's Pride's compound completely undetected. So, this is what I am supposed to believe: Marc & the gang were easily able to sniff out the jungle cat's scent in the woods due to their super sensitive feline olfactory senses. Faythe & the gang, also have super sniffers & were able to track Andrew by the scent he left after only touching a crosswalk signal. But, they couldn't catch Luiz's foreign scent in their own house? Riiiiiiight? Of-course, this made for a very entertaining ending to a great book, but highly unlikely. (hide spoiler)]"}, {"userName": "AH", "userReviewDate": "Apr 18, 2010", "userURL": "http://www.goodreads.com/user/show/3255548-ah", "userReview": "3.5 stars, just because of the last part of the bookI wasn’t sure how to rate this book. I took a peek at my status updates and they were about the main character Faythe’s level of too-stupid-to-live moments. Now, don’t get me wrong. I don’t hate Faythe – she just drove me a little bonkers. I actually did like this character. She is snarky, she is strong, she is also a little vulnerable. I also enjoyed her thought processes, even though some of her decisions made me want to scream. Faythe’s self-preservation skills, however, need a lot of work. For those who have not read Stray, Faythe Sanders is a were-cat. The were-cats live in Prides and are led by an Alpha. Faythe’s pride lives on a large ranch in Texas. Faythe’s father is the Alpha and he is grooming Faythe to take his place. Faythe is not an ordinary tabby, she has special skills which will not be mentioned to avoid spoilers. These skills get her out of a pickle in the first book. In Rogue, those special skills get her into more trouble than she bargained for. In this book, Faythe and her boyfriend/fiancé/pack enforcer are hunting down rogue cats. A few of them have turned up dead and the Pride is investigating. All clues lead to a mysterious South American cat, a female. I did love the camaraderie between the Pride. I liked how the boys – Faythe’s brothers and other assorted enforcers – all lived together, hung out together, and worked together. One of my favorite characters in the series is Faythe’s father. He really has great instincts and not because he is a were-cat. Faythe’s father is a good judge of character. He is an excellent role model for his family and Pride.The pacing of this book could have been better. It did have a very exciting ending which does make me want to read the next book. There were a lot of slow parts too. There is a cliffhanger ending, so consider yourself warned!I will continue reading this series because I really want to know what happened."}, {"userName": "Erin ☕ *Proud Book Hoarder*", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/3048260-erin-proud-book-hoarder", "userReview": "Okay, so Faith has decided to stay on in the pack for a few years trial and seems to have given up on ever returning to college basically. Maybe it’s back in her mind somewhat but she seems to have shrugged off most inhibitions and objections that she held in the first book. It seems her father is training her to be an enforcer and eventual pack leader, which is unheard of for a tabby (female). I’m still not crazy about her personality, but the story for this one rocks more than the first. She receives a call from someone she was close to in her college days and found out that she accidentally ruined his life. Most of the book is spent with this guilt as he has joined with enemies from the previous book to continue reigning terror everywhere.The charm in this series is the ties between Faith and Marc, the lead enforcer who is her on and off again hunk, her father, mother, and brothers. They all bring together a unit that is enjoyable with its conflicting personalities. The inner workings of the pack and how it all ties in with other packs and those struggling politics add punch. Because of the relationship digs into her and Marc, there is more romance in this one than the first. I liked her mom and dad from the original novel but they are even better here. I LOVED Manx’s personality and hope a lot more is done with that cat.There’s plenty of action and it never lets up long as a lot is going on with each scene, both emotionally and physically. Nail biting scenes and tension hold strong, while the ending has a brutal part that was hard for me to stomach. I’m pleased to see it was also hard for Faith to stomach; that redeems her somewhat in my mind. I do think she has some growing up to do still, is too harsh for a protagonist, but the story itself is interesting, making the series worth continuing.There is a small so-so cliffhanger that annoys a little."}, {"userName": "Jane", "userReviewDate": "Apr 14, 2008", "userURL": "http://www.goodreads.com/user/show/611402-jane", "userReview": "Book one of this series dragged a bit for me, but the premise was interesting enough to have me pick up book 2. Rogue has tighter writing/plotting and I really enjoyed the book. If the protagonist, Faythe, is sometimes a bit too self-centered, I forgave it because it feels like the author is going to take her through an arc that will have her mature.Other reviewers have not liked Faythe's response to Marc's (love interest) needs, and though I agree that she isn't giving him everything he says he needs, I find it realistic. She is only 23 and she isn't sure if he's the absolute one. If she isn't sure, should she tell him he is because he needs to hear it?Good storyline and nice cliffhanger for book three."}, {"userName": "Buqet", "userReviewDate": "Jun 29, 2011", "userURL": "http://www.goodreads.com/user/show/5306402-buqet", "userReview": "Gel pisi pisi ... Konusundan bahsetmek gerekirse , Faythe'in başı yine belada ama bu belaları bilmeden de olsa kendi başına açıyor. Bizim Gururun şehrinde birileri serseri öldürüp , striptizci 'masum' kızları kaçırıyordur. Olaylar göz ardı edilemeyecek hale gelince Gururun Alfası ve Faythe'in babası Greg duruma el koyuyor. Bu katil ve kız kaçıran adamı bulmak için harekette geçiyorlar. Yalnız aradıkları kişi , aslında düşündükleri kişi değil. Hatta adam aslında adam bile değil. Ben bu kitabı çok sevdim. , kesinlikle ilk kitaptan daha iyiydi. Aksiyon hiç durmadı.Faythe'in özel hayatı bile bir aksiyonluydu. Marc'a acımadım değil ama Faythe'e de hak veriyorum. Amerikalıların bir deyimi vardır , barefoot and pregnant diye. Marc Faythe'i seviyor olabilir ama onu çıplak ayak ve hamile olarak görmek istiyor.Faythe içten içe bunun farkında , bu kitapta ayrılmaların sebebi bence buydu. Tabii Faythe'in karasızlığı da etkilemedi değil. Ama kim küçüklüğünden beri sadece evlendirip çocuk sahibi olsun, kocasının ayaklarını yıkasın diye bastırılan bir yaşam tarzı ister ki. Faythe seninleydim tatlım ,bastır!! Ama lütfen kuyruk sallama herkese , mağara adamı gibi davransa bile Marc'ı severim yani :)"}, {"userName": "Melissa **Just Really Loves Musicals**", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/30679152-melissa-just-really-loves-musicals", "userReview": "*3.5 stars*Not quite as fun or quick as the first book, despite being 200 pages shorter. But still a good sequel, developing the characters and story arc well. I will definitely be continuing with the series in the upcoming months."}, {"userName": "MISS VAIN", "userReviewDate": "Mar 23, 2011", "userURL": "http://www.goodreads.com/user/show/4335141-miss-vain", "userReview": "Can I get a Marc for myself if Faythe doesn't want him??!! ;-)"}, {"userName": "Sophia", "userReviewDate": "May 06, 2012", "userURL": "http://www.goodreads.com/user/show/3812969-sophia", "userReview": "To be blunt from the start, I'm gonna tell you something. I have no clue whatsoever why I kept reading this and why I'm probably gonna start the 3rd one later on today. Rogue was mediocre. I was honestly hoping and -while I shouldn't have- expecting it to be better than the first, and though it was by maybe 1 degree, I was once again let down. Maybe it was my belief's fault, meaning that usually in Urban Fantasy books of this kind, if book one doesn't do it for me, the second one definitely will. \"It will only get better\", \"the sequel is almost always better than the first one\" and so on and so forth telling myself these kind of excuses.Rogue starts off where we left up in Stray, only three months later, I believe, where Faythe is with Marc, working as a rookie enforcer as promised to her dad, the Alpha and the cruel things that happened a few months ago not exactly forgotten, but maybe stored away somewhere. As expected Andrew is brought into the picture, but only after bodies of tomcats are dropping, strippers are missing and another kidnapping years ago of girls same age as Faythe, Abby and Sara is coming to the surface. Done differently than in the first book, it seems like this time the various plots are linked and not just thrown one after the other. We have a nice coherence of events, without the previous \"throwing scenes in just for the sake of it\". That was actually something that made me think about giving this a 3 star rating, but decided otherwise, because of the following;Maybe I'm being unfair and totally objective, but a sequence of events is not enough, when the character aspect of the book is lacking. This part is what really disappointed and generally added to my bad stance towards this. There was once again no character development of any sort. Faythe remained the same girl that is yelling for independence and respect, yet shows no sign of trying to achieve it or earn it. She's iron-steel set on being inconsistent with her thoughts, feelings and actions. And though people can be inconsistent, and indecisive because it's a very humane feature, she still took it to a whole other level, especially when she was rooting for the exact opposite. She'd be mad at others when they didn't believe or trust her, but how could they, when you've given no trustworthy qualities? Marc is still just a face. Maybe a bit more than just a face, but we know almost nothing about him, apart from what he unconsciously shared with Faythe about his and his mother's attack (how he became a stray) and the fact that he's madly in love with Faythe. Noting that \"madly\" here is not used in the same way as the \"irrevocably, unconditionally and madly\" in love with someone, but in the sense that his \"love\" is reaching unhealthy levels. Now, even though I'm sure that I could fall in love with him as a character and he along with my opinion of him might change, I still stand by what I said last time; their relationship is toxic, unhealthy and not organic.Jace, Ethan, Michael, Owen, Vic, Parker are still just another name in Rogue. Some, like Jace and Vic or Ethan may have gotten a bit more spotlight, but they're still characters I can't feel connected to, since I don't see them anywhere else, but in scenes when they're absolutely critical to the story. I'd love a bit more background on the family and the relationships. The scenes when they're all eating together or watching the Howling are actually some that I particularly enjoyed and cherished, because they gave character to a rather faceless book.One thing that I, also, need to mention or else it will eat me up is the fact that Jace, as I expected, is portrayed in such a way that appeals to the crowd, gets an emotional reaction, but at the end will be used as the loving second character that \"sacrifices\" himself or straight up dies, just so there's an emotional breakdown. This almost happened in this, when he got shot and I had a \"hand over mouth moment\". Other than that the villains of the story were once again bland. Mentioning here that, that by no means lessens the seriousness and cruelty of their actions. Andrew was an impeccably bad villain, even though that could have to do with the way it was handled, because his character and his character's background did have some depth. Luiz, on the other side was nothing more than just a bad guy in order to have some drama. Perfect segway here, I hated, absolutely hated how the problem with Andrew and Luiz was dealt with. So far both in this and the previous book Faythe killed the \"bad guy\" and that was it. \"Felt nothing\", \"Marc found us like that\". That is not a way an author should handle murder, even murder by self defense in a series of books that hundreds, thousands or millions of people will read. I would elaborate more on this, but I believe it needs its own post. As far as Manx, the pregnant tabby is concerned I think she was nicely introduced to the storyline and it didn't feel like she was just chucked in so the sequel could have something to work on. Lastly, my feelings remain the same when it comes to the way these books reach the climax. I feel like it gets really worked up, but then 1. nothing really happens, 2. the weight of the situation is not suitable for the climax of the whole story line, 3. it's over in less than a minute. To wrap this up, I have to say that my hopes for a better, stronger and more solid second book in a series were thrown outta the window. We had a taste of a better Shifters novel, but I'm sure there's more than can and will be done. Rogue wasn't addicting in the same, traditional way, but had its own addictive traits that couldn't be ignored, at least by me. \"On to the next one\" said masochistic Sophia. You're asking for it. P'S Get better, please. ***Annoyingly forgot to add that apart from finding the plot, especially with the missing strippers, predictable, I was starting to like both Faythe, when she didn't want to lie about what she did to Andrew to save herself, and Marc when he said he had killed other people for infecting humans like Faythe did and couldn't let it go or easily treat her as an exception, but the way Faythe ended up putting herself above it, because it was unintentional and Marc for the hideous way he handled it with that sex scene that was almost inhuman and disgusting, we went back to square one."}, {"userName": "Fangs for the Fantasy", "userReviewDate": "May 25, 2016", "userURL": "http://www.goodreads.com/user/show/5912634-fangs-for-the-fantasy", "userReview": "There’s another serial killer targeting women. And this one isn’t focused on tabbies – but is completely focused on Faythe. She is paying a hard price for her limited freedom.This book is pretty bad – but what makes it far worse is the epic awful misogyny of the first book that is carried on, brushed over and justified. It’s that last part which especially annoys me.They constantly downplay how Faythe is treated (also can I say now that every time I have to type the abysmally spelled name “Fayth” I lose some more brain cells. This keeps up and I might even enjoy the last book. If that happens dear readers, please hunt me down and kill me for my own good). There’s no acknowledgement that the whole reason Faythe is there is because her father is blackmailing and threatening her. There is no acknowledgement that Marc once nearly beat a fellow werecat and friend to death because he presumed to be interested in Faythe. Not even by the werecat he nearly murdered (but what nods there are to it seem to blame Faythe for not being obedient property) There’s no acknowledgement of the fact that Faythe’s renewed relationship with Marc is down to him finding her when she was drunk and vulnerable. There’s no acknowledgement that her love interest There’s no acknowledgement that the whole foundation of this relationship is because Faythe’s parents have basically groomed her into this since she was a small child. They make little jokey side references to the weeks when her father literally locked her in a cage, forcing her to use a coffee can as a toilet because she dared to try and live her own life.All of this is lightly, even jokingly referenced. The sheer horrendous abuse her family is inflicting on her is never ever acknowledged by anyone. Not even Faythe.But worse is, as I said, the justification. There’s no women on the leadership council because they totally don’t want to be part of the leadership. Woman don’t want power all women, every last one of them, want to stay home and be full time mothers and wives. And yes, some women do want that – some men want that – but this is used to excuse a complete lack of female leadership. This book tries to make lots of little references to how secretly awesome Faythe’s mother is – but none of that is ever shown, it’s clear she’s turned her back on all of that and her motherhood has actually damaged the pride. Even the moment where she steps up and is presented as awesome feels very lacking. She turns into a cat to take down someone who is still in human form… and fails. If Faythe hadn’t stepped in she’d be dead: in previous books we’ve pretty much seen a werecat in cat form easily taking down one in human form. Her moment of awesome is played up as awesome – but when looked at without the spin we see a really low expectation for her capabilities. We’re even told that she hardly ever shapeshifts – everything about her being a werecat is downplayedThis is just a prelude to the worst – the antagonist in this book is directly caused by Faythe daring to have sex with a guy other than the man her parents have chosen and deemed appropriate. Even while she outright tries to call her brothers out on how they sleep with a gazillion human women each but they all judge her – but her sex life is the one that has literal serial killer consequences. She is the one who is presented as WRONG for having sex.This is what is the utter worst about this book – both of these books – and the treatment of misogyny. We’re presented with a deeply, disgustingly and inexcusably misogynist society. Faythe speaks out against it. AND THEN SHE IS PROVEN WRONG. This isn’t just the depiction of a misogynist society that is then challenged. It is a depiction of a misogynist society that is challenged and then the challenger is put in her place and the OBJECTIVE REALITY of that world backs up that society and puts Faythe back in her place.To that up we also have the classic shaming and attacking of other women who are sex workers, from Faythe. Of course we do. Never mind that she is constantly sex shame, that doesn’t stop her seeing her doing the same to others.We also need to talk about the worst romance in the world ever – Marc and Faythe. Marc has decided that he is tried of Faythe “not making up her mind” and demands he accept an engagement ring from him or it’s over between them. It’ll totally be between them he won’t tell anyone elseExcept the other guys all shame Faythe for not accepting it. They shame her for saying “I’m 23 years old. I don’t want to marry yet, I’m not ready.” HOW DARE SHE! Oh and, “not making up her mind”? She did make up her mind. She left. She was then dragged back and forced to remain with the Pride or be literally confined to a cage! MIND WAS MADE. This isn’t demanding she make up her mind, this is demanding she OBEY like good little propertyRead More"}, {"userName": "Jennifer", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/4581159-jennifer", "userReview": "Good! Although Faythe and Marc are frustrating. Poor Marc. On to the next!"}, {"userName": "Esra", "userReviewDate": "Apr 05, 2011", "userURL": "http://www.goodreads.com/user/show/3552721-esra", "userReview": "Güzel bir kitaptı. yalnız okuyanların şunu iyi bir anlamasını isterim. Bu karakterler normal insanlar değiller! :D bunu neden mi söyledim. şu sebepten. okuduğum yorumlarda faythe (adıda bir acaip zaten) 'in marc ile olan ilişkisinde haklı çıkarılan taraf hep dişi kedimiz oluyor. Marc ve babası onu evliliğe zorluyor diye taşa tutulan hep onlar oluyor. Bu krakterler şekil değiştiren cinsinden. türlerinde dişilerde çok nadir bulunuyor ve hayatta kalma iç güdüsünün temeli olan üreme ile türü devam ettirme şanslarıda çok az .zira 6 doğumda belki 1 dişi dünyaya geliyor. bu sebeple babasının kızını evlenmeye çoluk çocuğa karışmaya ikna etmeye çalışmasını aptalca bulmadığım gibi , marc'ın da onu kıskanıp en azından ona bir söz vermesini istemesini ve diğer erkek kedileri rakip görüp böyle takıntılı davranmasınıda kınamıyorum. Tamam faythe evlenmeye hazır olmayabilir ,çocukta istemiyor olabilir, sürüsünü terketmek isteyebilir ama enn azından marc'a onunla ileride bir hayat düşünebildiğini söyleyebilmesi gerekir aralarında bile olsa o yüzüğü kabul etmesi gerekirdi. kız resmen marc'ı yatak arkadaşı olarak kullanmaktan ötesine geçemedi. son pişmanlıkta fayda etmez kedişim =)) bu gibi durumlara fazlasıyla sinir olduğumdan bir yıldız kesiyorum ve 4 yıldız veriyorum :D marc'ı istemeyen onu bana verebilir kabulümdür rrrrrr :D"}, {"userName": "Suz", "userReviewDate": "Dec 20, 2011", "userURL": "http://www.goodreads.com/user/show/2281137-suz", "userReview": "Cliff hanger type set up for next book. Series should be renamed Dysfunction Junction. Faythe is still too stupid to live and it's used as a plot pacing device. Any movement in EVERY relationship in the series is based on emotional dysfunction and drama. The only tension that was in this drab book was the emotional over reacting in the romance. Faythe once again made everything worse, and put everyone in more danger, because she prefers to avoid seeing or speaking about reality until she is forced to.I think I may have read one book that was worse this year, but this is a close second.I do not feel compelled to continue this series while there are more interesting things to be involved with. This is like reading bad young adult angsty bullshit that is made \"adult\" with the addition of a bit of sex (in this case a veritable territory-marking fuck - he could have just urinated on her and accomplished the same thing) and some descriptive violence.This is truly one of the worst series I've ever tried to read. Maybe I will come back to it, some day - when I'm really bored."}, {"userName": "Selin", "userReviewDate": "Sep 14, 2011", "userURL": "http://www.goodreads.com/user/show/4618268-selin", "userReview": "Okuduğum en iyi kitaplardan biriydi seride bariz bir gelişme var her şey seviyeli,espiriler beni gerçekten güldürtyor ve kitabı kaliteli yapan şey öyle büyük sözler kusursuz edebi bilgiler değil,yazarın son derece rahat ve gerçekçi yazmış olmasıydı,zorlama,kasma yoktu akıcılığı basitlikten değildi,profesyonelliği hissettim keşke böyle kitaplar daha çok olsa...Baskıya ve çeviriye gelirsek;baskı iyiydi,elimi dolduran bir kitaptı sayfalar kalın ve kaliteliydi,kapak iyiydi ,orjinal olması da ayrı güzeldi ama ilk kitaptaki kadar uğraşlmamş kabartma vs ile yinede iyiydi.Ve çeviri detaylı ve düzgündü,yabancı kelimeler isimler ve markalar için yazarn ironisini anlayacağımız açıklamalar vardı ki bu çok hoştu...Herkese öneririm :))"}, {"userName": "Onur Birler", "userReviewDate": "Jun 15, 2014", "userURL": "http://www.goodreads.com/user/show/14822924-onur-birler", "userReview": "Çok sevdim ben bu seriyi ya :D İlaç gibi geldi resmen :D"}, {"userName": "Natasha", "userReviewDate": "Nov 26, 2009", "userURL": "http://www.goodreads.com/user/show/2496802-natasha", "userReview": "Rogue is the second installment in the Urban Fantasy Shifters series by Rachel Vincent. Once I read the first one in this series I immediately went out and bought the rest. I read the first three in 2 and a half days and loved each one more and more. I found the characters fun and exciting and always refreshing. And being a werewolf fan I was open to new suggestions and found werecats exciting and refreshing. I find in some series you can get a bit bored by some of the constant characters but in this series I found it never lacking in character development and personality. As much and I liked book one(Stray), I loved book 2(Rogue). I find each book out does the next, and I am hoping it stays that way! In ROUGE, which is a follow up to STRAY(book 1) Faythe has finally settled into her new job as an enforcer for her pack. And since things don't always come easy for Faythe she has murdered toms turning up in her territory.. Faythe is new at her new position and feels she has to prove herself to her fellow pack. Only, she feels like her training hasn't prepared her for what she is now facing and knows she has to step up her game. As if a murderer on her conscience isn't enough, Faythe gets a confusing call from her college buddy which may put the blame on her and makes her rethink her actions. Faythe isn't going to let herself be pushed around and she may be in deep trouble but she always goes in kicking and screaming.  ROGUE is fast paced, engaging, and full of the action that her debut novel started off with. There is more romance in this book than the first, but I think it was necessary because it shows how Faythe feels about Marc, and being with the family/pride. If your a fan of Urban Fantasy, Paranormal Romance, Shape shifters and action this is the series for you! I highly recommend it. Synopsis:Okay, so cats don't always land on their feetI know that better than most. Since rejoining the Pride, I've made big decisions and even bigger mistakes: the kind paid for with innocent lives. As the first and only female enforcer, I have plenty to prove to my father, the Pride, and myself. And with murdered toms turning up in our territory, I'm working harder than ever, though I always find the energy for a little after-hours recreation with Marc, my partner both on and off duty.But not all my mistakes are behind me. We're beginning to suspect that the dead are connected to a rash of missing human women, and that they can all be laid at my feet--two or four, take your pick. And one horrible indiscretion may yet cost me more than I can bear...."}, {"userName": "LMM", "userReviewDate": "Sep 25, 2009", "userURL": "http://www.goodreads.com/user/show/1533889-lmm", "userReview": "Meh. This book pretty much bored me. I'd give it 2.5 stars. However, considering there aren't as many series about women Were's, Vincent is running an awfully similar parallel storyline (in some areas) as Kelley Armstong's, were series Bitten, Stolen etc. which is pretty lame. Makes sense I didn't like it all that much. I had a hard time warming to Elena & the same thing is happening with Faythe. So if Elena was Vincent's model, which it sure seems like she was - than no wonder I feel lukewarm toward Faythe.I think the worst part for me is that Vincent waste's words. Many author's do that & I just hate excessive prose that could easily be edited or done more succinctly.For example: She goes into great detail in the pre-set up for a big action scene & it's really unnecessary. I don't have to hear about EVERY single window or door Faythe locks in order to drive the point home, which is, she ended up locking the baddie in with all of them as a result. The amount of time Vincent takes to set up ...well by the time the action starts, you know what's going to happen. She's practically handed it to you on a platter. So much for building mystery & anticipation.Not to mention that Faythe is stupid. She really is. Why the hell did she wait so long, esp. after everything she has done & supposedly learned, to let her father & boyfriend know about the phone calls she was getting? They were phone calls for cripes sake! She was too scared about Marc's reaction over some phone calls? Yea, yeah he's got a temper, but he also loves her an insane amount. He's not a stalker. He'll deal. As he has proven time & time again. I also don't understand why she doesn't defend herself better verbally. She ran off, leaving Marc at the alter when she was 17. Umm...she was 17, enough said. But I think it might be worth repeating when people constantly come down on her for it. The whole thing is just ridiculous. I'm just not buying what's being sold.Overall - this series is mediocre at best (so far). Vincent needs less descriptive filler & to provide some worthwhile meat on the bone. It's just lackluster for me & the 1st book was better, so what's that saying?"}, {"userName": "Suzanne (Under the Covers Book blog)", "userReviewDate": "Jan 21, 2015", "userURL": "http://www.goodreads.com/user/show/3575839-suzanne-under-the-covers-book-blog", "userReview": "3.5 StarsFaythe has been receiving mysterious phone calls from someone in her past, but it's something she can't deal with and certainly something she can't tell her boyfriend Marc. Especially as a bunch of missing strippers, strippers who look a lot like Faythe, seem to be missing and a sudden increase in murdered strays seems to be appearing, the only thing that seems to link them seems to be Faythe. Since I started this series I have been told that it gets better as it goes on. It seems that I wasn't being completely mislead. Like the first book in this series Stray, Rogue takes a while to pick up the pace. But once again when the book gets moving I found it difficult to put down. I love when Vincent get the story moving, she makes it action packed and interesting, it just seems to take her a while to pick up momentum. As for Faythe and Marc. Please don't read this book with a brick wall nearby, it makes you want to repeatedly bang you head against it. Although Faythe has managed a bit of maturity in comparison to the previous book, sometimes her actions boggled my mind especially in regards to one of the newer member of my harem, Marc.The storyline and world building continued to develop in Rogue. Vincent has left me wanting to know more about not just what will happen with Faythe and Marc, but also what the world will throw at them next. I can't wait to read he next book in the series of it continues the trend of improving with each book I am in for a treat!"}, {"userName": "Deedee", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/5885086-deedee", "userReview": "I'm officially obsessed!!!! Like the action and drama in this and it totally makes up for the first. And Faythe is so hardheaded and badass at the sametime(but wouldn't you be,too?)This story picks up three months after the first. And is packed with hard hitting parts. Things like the drama between Faythe and her boyfriend Marc. Her position in the pride. The murders of stray tomcats. Dealing with a jungle cat and a newly formed stray. And her still trying decide what she wants. I don't how she does it, I was stressing with her at times.but the one thing I don't like about her is the fact that she withholds a lot of information that could really help the pride. There are times when I'm like seriously :/ instead of telling your dad/ alpha or his highest ranking enforced/your boyfriend something important you just gonna keep it to yourself seriously. But it makes for a good story even though it frustrate the heck out of me.Can't wait to read the third, I might not get any sleep this weekend but I'll be one happy camper. :DHaha…… Happy Reading!! :)"}, {"userName": "Ali", "userReviewDate": "Dec 19, 2015", "userURL": "http://www.goodreads.com/user/show/13786422-ali", "userReview": "Flying through this series like crazy! Sometimes Faythe's behavior gets on my nerves, but I still enjoy all the characters and the mystery plot."}, {"userName": "Jamie", "userReviewDate": "Nov 01, 2011", "userURL": "http://www.goodreads.com/user/show/4199122-jamie", "userReview": "[have angry sex. The only time they do it in the entire book. (hide spoiler)]"}, {"userName": "Shelley", "userReviewDate": "Aug 02, 2010", "userURL": "http://www.goodreads.com/user/show/3081722-shelley", "userReview": "Faythe represents a rare and important minority in her species; a tabby, or female cat shifter. There are certain expectations of her within the Pride; she's expected to marry in order to reproduce children and be subjugated to the male dominated environment for which she exists. Her spouse will also represent the next Alpha, taking the place of her father.Following events in Stray, she becomes the first ever female enforcer; an exclusive band of fighters that serve the Alpha and protect their Pride. Her father is grooming her to inherit his place as Alpha, a concept that won't be easily acheived or accepted by the larger cat community. In the mean time Faythe is juggling her romantic relationship with Marc, a fellow enforcer, who is forever pressing her for a commitment as well as keen interest from Jace.The plot heats up when Faythe recieves cryptic phone calls from her college boyfriend, Andrew, an ordinary human, who is now threatening her. He's also been turned into a shifter by Faythe after a minor sexual encounter before she left college. She's also investigating the murder of several cats on pride territory, and a possible link between these and enemies introduced in Stray. On top of that, women start going missing and tom cats end up mysteriously dead. Faythe discovers that it is far more sinister than realized. She then begins to understand that it may all be her fault since Andrew is part of the pack that is doing the killing.I like Ethan, one of Faythe's brothers, even though clearly he is a party animal and has had numerous relationships with women. I also like Michael and Owen, her other brothers. Michael is the family lawyer and also has a human wife. I also found Faythe's mother to be intriguing and someone you can look up to. I still don't like Marc. I don't like the way he treats Faythe, especially after learning she might have scratched and turned Andrew. Faythe still has some growing up to do, and she is truly annoying at times. Good thing this is only the second book in the series. I liked the first book, but this one is definitely alot better."}, {"userName": "Tez", "userReviewDate": "Jul 12, 2008", "userURL": "http://www.goodreads.com/user/show/1090898-tez", "userReview": "Two killers are on the loose in Rachel Vincent's second Shifters novel, Rogue.The Southcentral Pride has been tipped off about murdered toms, and this tests Faythe Sanders in her newly promoted role as an enforcer. Add that to investigating the recent spate of murdered strippers, and she has a lot on her plate. Then there are the spooky calls from her human ex...It all doesn't bode well for Faythe's relationship with Marc Ramos, a needy, clingy, violent individual who won't let Faythe defend herself. That may seem romantic to some, but seems way too controlling and whingey to me. Give a lass some freaking space, man! And a promise ring doesn't count as freaking space...Excuse the relationship, and this book is quite a cracker. Rachel Vincent has well and truly mastered the art of the end-of-chapter cliffhanger...and likewise for the end of the novel. To discuss plot points would be major spoilers, so I'll just say \"wow\" and leave it at that. But I rather enjoyed the extra light shed on Karen Sanders, Faythe's mother and someone she doesn't seem to respect. There's also a new character I'm hoping (and expecting) will be featured more in the next installment. Suddenly I don't feel so bad about taking so long to actually get around to reading this, because now it's only a month until Pride's February 1st release date - huzzah!Faythe continues to make mistakes and grow up, but one question remains: will those broken doors ever be fixed?"}, {"userName": "Danny", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/3254909-danny", "userReview": "[ when Marc asked Faythe to wear his promise ring and she again refused! I was cheering for him when he said \"Thanking you for giving me my balls back\" (hide spoiler)]"}, {"userName": "Kate Lansky", "userReviewDate": "May 27, 2010", "userURL": "http://www.goodreads.com/user/show/2186989-kate-lansky", "userReview": "I can't begin to tell you how glad I am that Faythe has, at least to some extent, grown up a bit. She isn't perfect by any stretch, but she is far more tolerable. She is still dumb as a brick and pretty damned self-centered, though. I'll just keep hoping she continues to evolve as the series goes on. But really - why this girl refuses to reveal pertinent information about threats to her own safety is just beyond me. I want to shake that \"I can take care of myself\" attitude from her and replace it with even just the tiniest amount of smarts. I really really REALLY wanted to shout at her a lot(hey, Faythe - those smarts could also be used to realize that there are a LOT more weapons around you during your little fights than you ever see... and, uh - FAR better ones than what you choose to throw in that last fight scene). Still, I like her a lot more this time around - and once again, the story was able to hold my interest from start to finish. So once again, I'll go on to read the next in the series and see if this tabby evolves into something more."}], "description": "Okay, so cats don't always land on their feet. I know that better than most. Since rejoining the Pride, I've made big decisions and even bigger mistakes: the kind paid for with innocent lives. As the first and only female enforcer, I have plenty to prove to my father, the Pride, and myself. And with murdered toms turning up in our territory, I'm working harder than ever, though I always find the energy for a little after-hours recreation with Marc, my partner both on- and off-duty.But not all of my mistakes are behind me. We're beginning to suspect that the dead are connected to a rash of missing human women and that they can all be laid at my feet--two or four, take your pick. And one horrible indiscretion may yet cost me more than I can bear...", "title": "Rogue\n      \n          (Shifters #2)", "url": "https://www.goodreads.com/book/show/13380797-rogue", "average": 4.1, "cover": "https://images.gr-assets.com/books/1394267481l/13380797.jpg", "reviews": 740, "authors": [{"url": "https://www.goodreads.com/author/show/415967.Rachel_Vincent", "name": "Rachel Vincent"}], "type": ["Fantasy", "Fantasy", "Paranormal", "Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/13380797-rogue", "http://www.goodreads.com/book/show/2314315.Rogue", "http://www.goodreads.com/book/show/6536185-rogue", "http://www.goodreads.com/book/show/7056850-rogue", "http://www.goodreads.com/book/show/7938256-rogue", "http://www.goodreads.com/book/show/8141067-rogue", "http://www.goodreads.com/book/show/6315602-my-soul-to-take", "http://www.goodreads.com/book/show/793399.Stray", "http://www.goodreads.com/book/show/6763961-my-soul-to-save", "http://www.goodreads.com/book/show/7476122-my-soul-to-keep", "http://www.goodreads.com/book/show/4583888-pride"]}