{"ratings": 1780152, "userreviews": [{"userName": "Madeline", "userReviewDate": "May 18, 2008", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "Romeo and Juliet, abridged.ROMEO: I’m Romeo, and I used to be emo and annoying but now I’m so totally in luuuuurve and it’s AWESOME. MERCUTIO: Okay, three things: One, there’s only room in this play for one awesome character and it’s me, bitch. Two, you’re still emo and annoying. Three, didn’t you say that exact same stuff yesterday about Rosaline?ROMEO: Who?*meanwhile, Juliet prances around her room and draws hearts on things and scribbles “Mrs. Juliet Montague” in her diary over and over. Because she is THIRTEEN. How old is Romeo supposed to be? Let’s not talk about that, k?*CAPULET: Good news, Juliet! I found you a husband!PARIS: Hello, I’m a complete tool. JULIET: Daddy, I don’t want to marry that apparently decent and unflawed guy! I’m in love with Romeo Montague – we met yesterday and it was HOT. CAPULET: I WILL BE DAMNED IF I SEE MY ONLY DAUGHTER MARRIED TO THE ONLY SON OF THE MAN WHO IS MY MORTAL ENEMY FOR REASONS TOO UNIMPORTANT TO SPECIFY IN THIS PLAY!JULIET: *stamps foot, runs off to her room to watch High School Musical again and sulk*TYBALT: Hey Romeo, your mother was a hamster and your father smelt of elderberries!MONTAGUE POSSE: Oh, snap.MERCUTIO: YOU TAKE THAT BACK! TYBALT: MAKE ME! ROMEO: No! You can’t fight him, Mercutio because I already married his cousin! TYBALT: I KEEL YOU! *Romeo attempts to stop the fight and fails miserably*MERCUTIO: FUCK YOU ALL! *dies*ROMEO: Okay, forget what I said about not fighting. I KEEL YOU!TYBALT: *dies*PRINCE: I’ve had enough of your shit, Emo McStabbypants. You’re banished. ROMEO: Waaaaaahhhhhh! I’m banished and Juliet is going to marry another guy and it’s not fair WHY DOES GOD HATE ME?FRIAR LAURENCE: Jesus Christ, not this again. Okay, if you promise to grow a pair, I’ll help you and your wife out. Here’s the plan: she takes a potion that’ll make her go into a coma, and then she’ll get put in the family tomb and then you’ll sneak back into town, break into the tomb, wait until she wakes up, and then the two of you escape and live happily ever after! It’s perfect!AUDIENCE: …the hell?*Shockingly, the plan fails. Romeo goes back to the tomb (pausing to kill Paris just for good measure), but he thinks Juliet’s dead and drinks poison and dies, and then like two seconds later she wakes up and sees that Romeo isn’t mostly dead like she was, he’s dead, so she stabs herself.*MONTAGUE: Wow, we are awful parents. CAPULET: I have an idea – let’s make solid gold statues of our dead children to commemorate their love and serve as a constant reminder of the fact that our only children killed themselves because we were such uncaring parents. *they actually do this.*SHAKESPEARE: Beat that, Stephenie Meyer. THE END.Read for: 9th grade EnglishBONUS: courtesy of The Second City Network. Every Shakespeare heroine needs a sassy gay friend"}, {"userName": "Haleema", "userReviewDate": "Sep 26, 2010", "userURL": "http://www.goodreads.com/user/show/4336293-haleema", "userReview": ""}, {"userName": "Nate", "userReviewDate": "Aug 27, 2008", "userURL": "http://www.goodreads.com/user/show/1461353-nate", "userReview": "I'm not sure what annoys me more - the play that elevated a story about two teenagers meeting at a ball and instantly \"falling in love\" then deciding to get married after knowing each other for one night into the most well-known love story of all time, or the middle schools that feed this to kids of the same age group as the main characters to support their angst-filled heads with the idea that yes, they really are in love with that guy/girl they met five minutes ago, and no one can stop them, especially not their meddling parents!Keep in mind that Juliet was THIRTEEN YEARS OLD. (Her father states she \"hath not yet seen the change of fourteen years\" in 1.2.9). Even in Shakespeare's England, most women were at least 21 before they married and had children. It's not clear how old Romeo is, but either he's also a stupid little kid who needs to be slapped, or he's a child molester, and neither one is a good thing.When I was in middle school or high school, around the time we read this book, I remember a classmate saying in class that when her and her boyfriends' eyes met across the quad, they just knew they were meant to be together forever. How convenient that her soulmate happened to be an immensely popular and good-looking football player, and his soulmate happened to be a gorgeous cheerleader! That's not love at first sight, that's lust at first sight. If they were really lucky, maybe as time went on they would also happen to \"click\" very well, that lust would develop into love (it didn't), and they would end up together forever (they didn't). But if they saw each other at a school dance, decided they were \"like, totally in love,\" and then the next day decided to run off and get married, we shouldn't encourage that as a romantic love story, we should slap the hell out of them both to wake them up to reality.For what it's worth, my cynicism doesn't come from any bitterness towards life or love. I met my wife when we were 17, and we've now been together almost 10 years, married for a little over 2. Fortunately for me, she turned out to be awesome. If we had decided the day after meeting each other that we were hopelessly in love and needed to get married immediately, we would have been idiots, and I hope someone who I trusted and respected would have slapped me, hard. If we were 13 at the time, that would be even worse. Enlightened adults injecting this into our youth as a classic love story for the generations, providing further support for their angst-filled false ideas of love and marriage, is probably worst of all."}, {"userName": "Anne", "userReviewDate": "Nov 15, 2008", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "THIS! This is what happens when you jump into a Rebound Relationship.So, when the story opens, Romeo is desperately in love with Rosaline. But since she won't give up the booty has sworn to remain chaste, he's all depressed and heartbroken. \nAnnoying emo style!\nHis friends, tired of his constant whining, give him a Beyoncé mixtape. He takes her words to heart, and her lyrics begin to mend his broken soul. His boys drag his sad ass to a party, and across a crowded room, Romeo spies his next victim...er, his really-really for real this time True Love.Meet 13 year old Juliet. Who is 13.And how old is Romeo? Well, he's old enough to kill Juliet's cousin in a sword fight, so...yeah. Probably not 13. But since he's such a punk little pussy - what with the whining, sobbing, and spouting off crap poetry - I'm going to assume he's not much older than she is and say 15 or 16. If I'm wrong, don't correct me. It'll help me sleep tonight.Tragically, Juliet is a Hatfield, and Romeo is a McCoy. Their families have been feuding over a McCoy pig that was killed during a Hatfield moonshine run decades ago. Totally true. I swear.Needless to say, tensions are still running high. So. Shhhhh. They gotta keep their love on the down low.And it is love, dammit! I mean, they've stared at each other a whole bunch, and had, like, two conversations. This time around, Romeo isn't going to make the same mistake as before, and let the new girl of his dreams slip through his fingers...Fuck, yeah! Time to get married!Because marriage will solve all your problems. No, really.Pinkie promise!And we all know what happened next, right?!Well...Ish.You know, I can't help but wonder what that first encounter would've been like if they'd met when they were older, you know?Romeo: Hey baby, Heaven must be missing an angel. Mind if I crawl up to your balcony tonight?Juliet: The fuck?! *taser crackles...Romeo screams*Anyhoo, this isn't a romance, it's a cautionary tale. And a pretty funny one at that! I originally gave it 3 stars, but I had to bump it up for making me giggle so much. Between Romeo & Juliet both crying, moping, and twirling around like a tweenage girls and the rest of the cast flailing around to accommodate these idiots, this was waaaaaay better than I remembered it.I listened to this on Playaway, so I got to have the audio version with a full cast of characters, sound effects, and music. Loved it! Totally recommend going this way if you're planning on trying out Shakespeare."}, {"userName": "Bill  Kerwin", "userReviewDate": "May 12, 2007", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "Two things struck me during this re-reading: 1) From the first scene of the play, the sexual puns are drenched in metaphorical violence (drawing your weapon, laying knife aboard, forcing women to the wall, etc.), creating a stark contrast with the purity of Romeo and Juliet's love and language, and 2) Mercutio, the Nurse and Old Capulet are something totally new both in Shakespeare and also in English drama, that is, characters who are not only realistic but whose language completely reflects their thought processes to the point where they take on a life of their own. Shakespeare would create many other such characters, but these three are the first."}, {"userName": "Catriona", "userReviewDate": "May 18, 2011", "userURL": "http://www.goodreads.com/user/show/4360415-catriona", "userReview": "The people who dislike this play are the ones who view common sense over being rational, and prefer to view the world in a structured way. One of the main arguments that come across is the 'meeting, falling in love, and dying all in a weekend when Juliet is but 13'. We all must die in the end, so wouldn't you want to in the name of love than of an awful disease? Perhaps the two lovers weren't truly in love, but their last living moments were spent believing so, so what does it matter? How can one truly know if one is in love? Is it a feeling? In that case, what is a feeling? If you believe you are in love, then you may as well be, contrary to what others might say.The argument with the 'weak' plot; Shakespeare didn't invent Romeo and Juliet. It was infact a poem which is constantly being adapted over time. Shakespeare did add in some aspects but the meeting in the ballroom, Tybalts death, the sleeping draught and such were already in the poem.I personally love this play, purely because it's an escape from this modern world. I'm not saying I like the treatment of women, nor the fighting, but it's like a different world that i'm never going to experience, and reading it through Shakespeare's gorgeous writing makes Verona seem all the more romantic."}, {"userName": "Bookdragon Sean ", "userReviewDate": "Jul 07, 2016", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "Why didn’t they just run away together? It would have saved a lot of heart ache."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jun 07, 2008", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Romeo and Juliet = The Tragedy of Romeo and Juliet, William ShakespeareRomeo and Juliet is a tragedy written by William Shakespeare early in his career about two young star-crossed lovers whose deaths ultimately reconcile their feuding families. It was among Shakespeare's most popular plays during his lifetime and along with Hamlet, is one of his most frequently performed plays. Today, the title characters are regarded as archetypal young lovers.Romeo and Juliet belongs to a tradition of tragic romances stretching back to antiquity. The plot is based on an Italian tale translated into verse as The Tragical History of Romeus and Juliet by Arthur Brooke in 1562 and retold in prose in Palace of Pleasure by William Painter in 1567. Shakespeare borrowed heavily from both but expanded the plot by developing a number of supporting characters, particularly Mercutio and Paris. Believed to have been written between 1591 and 1595, the play was first published in a quarto version in 1597. The text of the first quarto version was of poor quality, however, and later editions corrected the text to conform more closely with Shakespeare's original.تاریخ نخستین خوانش: سال 1996 میلادیعنوان: رومئو و ژولیت؛ ویلیام شکسپیر؛ مترجم: علی اصغر حکمت؛ مقایسه با لیلی و مجنون نظامی در 248 ص؛عنوان: رومئو و ژولیت؛ ویلیام شکسپیر؛ مترجم: هدایت کاظمی؛ تهران، هنر، 1356؛ در 225 ص: موضوع: نمایشنامه های نویسندگان انگلیسی قرن 16 ممترجم: علاء الدین پازارگادی؛ تهران، علمی و فرهنگی، 1375؛ در 223 ص؛ چاپ دهم 1385؛ شابک: 9789644451676؛ چاپ چهاردهم 1392؛ مترجم: فواد نظیری؛ تهران، نشر روایت، 1375؛ در 191 ص؛ چاپ دیگر: تهران، ثالث، 1377، شابک: 9646404332؛ چاپ بعدی 1380، چاپ هفتم 1394؛ در 191 ص؛ شابک: 9789646404335؛ چاپ هشتم 1395؛مترجم: هوشنگ آزادی ور؛ نشر مرداد، 1379؛ در نه و 147 ص؛ چاپ دیگر: تهران، رشدیه؛ 1395؛ در 184 ص؛ شابک: 9786009168576؛مترجم: مریم رسولی؛ تهران، اردیبهشت، 1390؛ در 223 ص؛ شابک: 9789641710882؛ مترجم: مریم نظری؛ مصطفی اکبری؛ قم، نوید ظهور، 1393؛ در 144 ص؛مترجم: شیما طیبی جزایری؛ تهران، گیسا، 1393؛ در 82 ص؛ برای نوجوانانترجمه های دیگری نیز با همین عنوان چاپ شده که بازنگاری نویسندگان از اثر ویلیام شکسپیر است که به فارسی ترجمه شده اندرومئو و ژولیت روایت داستان دو دلداده ی عاشق و از نخستین آثار استاد سخن ویلیام شکسپیر است؛ ایشان کششی به آثار عاشقانه دوران باستان داشتند. درونمایه براساس داستانی ایتالیائی ست، که به صورت شعر و با عنوان: «تاریخ باستانی رومئو و ژولیت» اثر «آرتور برووک» در سال 1562 میلادی و به صورت نثر در سال 1591 میلادی توسط ویلیام پینتر نوشته شده اند. شکسپیر در نگارش اثر خویش از هر دو اثر سود برده، و شخصیتهای مرکوشیو و پاریس را نیز دیگر کرده، اثر ایشان نخستین بار در سال 1597 میلادی به چاپ رسیده است. چکیده: قهرمانان نمایشنامه دختر و پسری از دو خانواده ی بزرگ و رقیب در شهر ورونا هستند، که با یکدیگر دشمنی و اختلاف دیرینه دارند. رومئو که از خاندان مونتگیو است، به امید ملاقات با رزالین، دختری که رومئو دلباخته اش شده، به ضیافت لرد کپیولت می‌رود؛ آنجاست که رومئو، دختر لرد کپیولت ژولیت را ملاقات و رزالین را فراموش می‌کند و ... ...؛ ا. شربیانی"}, {"userName": "Brina", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "Happy 2018, everyone! I thought I would get the year off on the right track by reading my first book for classics bingo in the group catching up on classics...and lots more. One of the squares on this year's board is to read a book published before the 18th century, and, because Romeo and Juliet is one of this month's group reads, I decided to mark off this square early. Way back in ninth grade, I read Romeo and Juliet. I happened to have a teacher who assigned us outside of the box assignments such as writing letters between the primary characters or keeping Juliet's diary. Thus, this Shakespearean tragedy remains more memorable to me than some of the other dramas I have read over the years. Yet, the play still warranted a reread through adult eyes so here I am, beginning 2018 by reading Shakespeare.I will be the first to admit that I although I enjoy reading through modern drama, usually Pulitzer winners, Shakespeare is tough for me. The language I am able to slog through; however, most plots are dull and leave me with much to be the desired. The only dramas I enjoy enough to want to reread is The Merchant of Venice and MacBeth for their strong, female protagonists. Which, brings me back to Romeo and Juliet. Most people know the basis of the story, one that has been retold so many times that it is part of western vernacular. My favorite version of Romeo and Juliet is the musical Westside Story. The song that begins \"when you're a Jet, you're a Jet all the way\" sets the tone for the entire musical: the Jets and Sharks just flat out don't like each other but they are loyal to members of their own gang until their last dying day. This plot comes right out of Romeo and Juliet which features the Montagues and Capulets of Verona who have been feuding for time eternal. Like its more modern counterpart, the Montagues and Capulets just flat out don't like one another no matter the circumstances. It has always been thus and no member of the leadership of either family has done anything to lessen the feud.All these feelings of ill will change on one special night when young Romeo Montague is smitten with Juliet Capulet at a masked ball. The two instantly fall in love and do everything in their power to hide their romance from their feuding family members, parents included. I can understand why this is the play often assigned to fourteen year olds because what young teenager has not been smitten and thinks that he/she is in love. Combine this with the aspect of star crossed lovers who are going against the prevailing trends of society, and there are many directions that a teacher can go in while discussing this with students. Boys will like enjoy the dueling between members of the Montagues and Capulets and perhaps also the innuendo imagery that Romeo uses to describe Juliet whereas, perhaps, girls will swoon over the descriptions of Romeo and how he does everything in his power to marry and be with Juliet for all eternity. Reading through adult eyes and admittedly 21st century eyes, I enjoyed the plot myself as well as descriptions of Juliet. The star-crossed lover unique aspect of this play allowed me to read it quicker than I would with other Shakespearean drama that I find tedious to get through at best.Despite the imagery and the storyline, Shakespeare's language was still a bore for me to read. The planning and plotting and long soliloquies made for heavy reading. The story of star-crossed lovers Romeo and Juliet and the consequences of their relationship could be completed in one to two acts. Yet, then the story would not be a Shakespearean five act timeless classic. Perhaps because I am reading this drama during the 21st century where people need information before it happens makes plays with more speaking than action too slow at times for modern readers. Even with modern literature, unless it is quality literary fiction, I find it sluggish to get through slow moving novels with little plot movement, and prefer those novels with shorter chapters. After rereading a number of Shakespearean plays over the past few years I have come to realize that unless there is a lot of plot development-- feuding, fighting, falling in love, illicit marriage, more fighting-- that it is a challenge for me to get through the text. Lucky for me that Romeo and Juliet contains the elements of a quality story so it is only the text that challenges me, not the story itself.Shakespeare's story of star-crossed lovers remains timeless classic that has been redone many times over. Romeo and Juliet have made appearances in some form on Broadway plays to Hollywood movies including a modern version starring Leonardo DiCaprio as Romeo. Without stretching one's imagination all that much, Romeo and Juliet even resurface in the Star Wars story during the prequel trilogy. Their imagery is everywhere in modern society and by telling of two feuding groups as a backdrop, Shakespeare created a tale that could relate to people across many places and times, from school groups to rival governments. Now that I got through my first book of the year I am excited to get a jump start on bingo and my other challenges, both in groups and personal ones. Whether I read another Shakespeare remains to be seen because at the end of the day, if there are no feuds, fights, star-crossed lovers, and other elements of a modern story, Shakespeare's long soliloquies are not really my taste.3.75 stars"}, {"userName": "Manny", "userReviewDate": "Feb 19, 2009", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": "Every emo fourteen year old's dream. In bullet-point form:• fall in love with hot boy/girl (delete as appropriate) that parents can't stand; • tender words and some sex - gotta find out what that's like; • major tragic incident that really wasn't your fault, you were provoked; • everyone's mad at you; • die beautiful death in loved one's arms; • parents finally understand how much they cared about you and are sorry they didn't treat you better when you were alive.So how did Shakespeare manage to turn this heap of crap, which even Zac Efron would think twice about, into one of the most moving stories of all time? If you still need proof that he was a genius, look no further."}, {"userName": "Maddie ", "userReviewDate": "May 12, 2016", "userURL": "http://www.goodreads.com/user/show/55751376-maddie", "userReview": "Re-reading!Currently free at Amazon link below:https://www.amazon.com/Romeo-Juliet-A...I had to read this novel in school – now let me tell you I hated this book with passion in school – BECAUSE I HAD TO! I was quite a rebellion in my time, well nothing changed I am still a rebellion ;-)\nMany school kids back in my day didn't appreciate this tragedy because Shakespeare used a lot of bizarre arguments to our ears. I'm delighted to understand it know, but I think main reason is I wanted to understand this novel I felt like I got a sense for his artwork Shakespeare created. \nThis picture was for me at school, eye rolling and complaining a lot – well said Sir Tom!I Bow my head in Shame! :-( This is me now as a Shakespeare Lover :D\nOnce I left school I watched some Shakespeare movies – and I decided I must read this gem again – I have read it 4x since I left school! Schubert - Ave Mariahttps://www.youtube.com/watch?v=2boso...Juliet:“You kiss by the book.” ― William Shakespeare, Romeo and JulietBackground on Shakespeare: (again wiki)William Shakespeare 26 April 1564 (baptised) – 23 April 1616) was an English poet, playwright, and actor, widely regarded as the greatest writer in the English language and the world's pre-eminent dramatist. He is often called England's national poet, and the \"Bard of Avon\". His extant works, including collaborations, consist of approximately 38 plays, 154 sonnets, two long narrative poems, and a few other verses, some of uncertain authorship. His plays have been translated into every major living language and are performed more often than those of any other playwright. \nhttps://www.youtube.com/watch?v=b6Q_I...\nPrologue OR Chapter 1Guiltless young love condemned due to inevitable environments: \"From forth the fatal loins of these two foes, a pair of star-crossed lovers take their life; whose misadventure’s piteous overthrows, doth with their death bury their parents' strife.\" This is part of the opening prologue from William Shakespeare's \"Romeo and Juliet.\" From this opening you can get a strong portrait of the events that take place in this playTwo adolescents from conflicting clans fall in love, marry in secret, and take their own lives rather than live without each other. Despite the teenage melodrama, \"Romeo and Juliet\" remains one of Shakespeare's most durable and widespread plays, even if it wasn't his best -- lots of demise, teen lovers and captivating dialogue.Type of Characters and my choices according to pictures :\n\nRelationship development In the city of Verona, the Montagues and Capulets are protected in a lethal grudge. Then a Montague youth named Romeo, besotted with a Capulet girl named Rosaline, sneaks into a party to see her.... but instead meets another Capulet lass named Juliet, and the two instantly fall in love. Since their families hate each other, their love must be articulated in top-secret.Chapter Development Expecting to unite the two families, the kind-hearted priest Friar Lawrence assists the two in marrying in secret. But then Juliet's cousin Tybalt challenges Romeo to a duel, leading to the demise of two men -- and Romeo's outcast from Verona. Even worse, the Capulets have decided to marry Juliet to Count Paris -- leading to a frantic plan that goes extremely askew.\nRomeo:If I profane with my unworthiest handThis holy shrine, the gentle fine is this:My lips, two blushing pilgrims, ready standTo smooth that rough touch with a tender kiss.Juliet:Good pilgrim, you do wrong your hand too much,Which mannerly devotion shows in this;For saints have hands that pilgrims' hands do touch,And palm to palm is holy palmers' kiss.Romeo:Have not saints lips, and holy palmers too?Juliet:Ay, pilgrim, lips that they must use in prayer.Romeo:O, then, dear saint, let lips do what hands do;They pray, grant thou, lest faith turn to despair.Juliet:Saints do not move, though grant for prayers' sake.Romeo:Then move not, while my prayer's effect I take.Thus from my lips, by yours, my sin is purged.My feelings while reading this: →  Will I read it again?→Above all, fear not; and dare to dive into this torrent of love!Juliet:Then have my lips the sin that they have took.Romeo:Sin from thy lips? O trespass sweetly urged!Give me my sin again. “Parting is such sweet sorrow that I shall say goodnight till it be morrow.” ― William Shakespeare, Romeo and Juliet\nTo the Author  “Don't waste your love on somebody, who doesn't value it.” ― William Shakespeare, Romeo and Juliet\n“These violent delights have violent endsAnd in their triump die, like fire and powderWhich, as they kiss, consume” ― William Shakespeare, Romeo and Juliet “My bounty is as boundless as the sea,My love as deep; the more I give to thee,The more I have, for both are infinite.” ― William Shakespeare, Romeo and Juliet"}, {"userName": "Ariel", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/6536286-ariel", "userReview": "It is always so satisfying to read a book you've heard so much about throughout your life. You should have seen how excited I got when Juliet started saying \"Romeo, o Romeo\"!"}, {"userName": "Carol", "userReviewDate": "Jan 27, 2013", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "Excellent! I can't believe I've waited so long to read this classic play! Having only surmised the story of ROMEO AND JULIET and not even seen the movie (yet) I now know Romeo was a Montague and Juliet a Capulet, two houses at odds. I know about the disastrous duels, the secret marriage, the surprise suitor and the botched plan; and then there's the fatal ending..... I even had that wrong, and OMGOSH they were so young!I enjoyed actually reading Juliet's melodramatic expressions of love.....\"O Romeo Romeo, wherefore art thou Romeo?\" and \"Good-night, good-night! parting is such sweet sorrow....That I shall say good-night till it be morrow.\" But, IMHO, none were better than this one......\n\"Give me my Romeo. And, when I shall die\n\nTake him and cut him out in little stars,\n\nAnd he will make the face of heaven so fine\n\nThat all the world will be in love with night\n\nAnd pay no worship to the garish sun.\"\nBring on more Shakespeare! Unforgettable read!\nUpdate: March, 2016\nOh Boy! Franco Zeffirelli's 1968 movie version of Romeo and Juliet is excellent! Just like reading the screenplay. Loved it!Thank you GR friends Sara, Lisa and Jonetta for the recommendation!"}, {"userName": "Henry Avila", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/5431458-henry-avila", "userReview": "\"Never was a story of more woe than this of Juliet and her Romeo \"...........The ultimate love story, 400 years old, you may ask why? William Shakespeare's narrative , the poetry, a tragic saga drenched in beauty, the words are magical , a reader will be entranced by its imagery , no one could be better...really a long exquisite poem disguised as a play set in the 14th century of the Renaissance, in Verona, Italy during the turbulent age of petty kingdoms , fierce wars and passionate times. The short but interesting lives, young marriages and early exists, the atmosphere thick with unseen calamities...Romeo , a Montague, loves Juliet, a Capulet...that is a big problem, the two teenagers don't care or understand the long lasting bloody feud, between their families. Hate is not them, passion is...the opposite...a great love consumes the immature couple , after just a few hours of knowing each other they impulsively decide on a secret marriage. Romeo had gone with his friends to a perilous, masquerade party given annually by Juliet's father, at his house, the sumptuous feast is strickly off -limits to their archenemies the Montagues, of course this makes for a rather tantalizing challenge, brave or moronic , the youths want some excitement...The Montague stranger immediately falls in love with this supposedly loathsome girl , of the rival evil clan, the daughter of the leader , the couple are smitten... not knowing their true identities, yet nothing matters to Romeo and Juliet, even after the revelations ... except feelings, too much so it will cause heartache. Then reality sets in ...Mercutio a good friend of Romeo's, is slain in a tawdry street brawl, by Tybalt Juliet's cousin...the lover of hers seeks revenge and kills the Capulet. Now what...Juliet must decide, stay loyal to the family or continue to be a wife, their secret marriage performed by Friar Lawrence, he naively believed the joining of the two would end the foolish conflict...Nevertheless blood flows again, even the Prince in the city cannot stop the animosity, his threatened harsh penalties, including death, does nothing to calm the situation. Romeo is banished forever from town, the distraught daughter of a Capulet is told to marry Count Paris a relative of the ruler Prince Escalus ...How can a 14- year-old girl, not quite a woman, cope. Her adoring servant, who raised her, yet an uneducated nurse, tells Juliet to marry Paris and forget her first wedding...Will she... Friar Lawrence has a dangerous plan... the only hope for the pair, it could result in a happy solution ....A story that will be read again and again...love is always in fashion , especially the kind that engulfs every walking minute in a young life...they know nothing else."}, {"userName": "James", "userReviewDate": "Jan 07, 2012", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "Review\n\nAs I looked over my previously read books and searched for one that was missing a review, Romeo and Juliet stood out to me. But then I thought about it... who doesn't know about this play? Who hasn't read it in school sometime in the past? Who hasn't watched a movie version or seen some sort of take on the classic tortured romance story? And why on earth would anyone care to read another review, let alone my review, on it? Exactly. So... don't look for much here as I'm sure most everyone has read it already. And I'm not that funny to even make reading my opinions worth it. That said... a few shared thoughts about what I've learned from this play:1. Parents exist to torture their children. It's a simple fact. If your child wants X, it is your responsibility to keep X away from him/her.2. Love will always end in disaster. Don't attempt it without proper back-up.3. Even though someone looks dead, they probably aren't. Kill them again just to be sure.4. Your bros or girls don't always have your back.5. Magic powders are the cure for everything. Always trust what you don't understand. And just inhale it like the world is about to end.In all sincerity, I do like the play a lot. I've enjoyed countless interpretations. I think parts of it are brilliant and parts of it are pure illogical nonsense. Every TV show and movie has their own re-appropriation to tell. Not everything can be perfect when it comes to love. But this play certainly teaches a lot of lessons and provides a lot of bumps. And this reader still goes along for the ride...\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by. Note: All written content is my original creation and copyrighted to me, but the graphics and images were linked from other sites and belong to them. Many thanks to their original creators.[polldaddy poll=9729544]\t[polldaddy poll=9719251]"}, {"userName": "Nayra.Hassan", "userReviewDate": "Apr 23, 2016", "userURL": "http://www.goodreads.com/user/show/44531801-nayra-hassan", "userReview": "يعني انت عامل فيها : روميو؟ سؤال استنكاري مرح..لا يعني عبر العالم كله سوى انك عاشق بجنوننادرة هي الشخصيات الادبية التي تقفز خارج السطور..لتتحول إلى أساطير واقعية..نلفظ باسمها بدلا من جمل تملأ مجلدات  و سر خلود شخصية روميو.انه احد الرجال القلائل في الأدب ..و في الواقع\".ممن ضحوا بحياتهم من أجل الحب.\"الحب هو مفتاح شخصية ذلك الشاب الذكي...حاد اللسان..المفتقر إلى الوسطيةزاده حبه لجولييت نزقا..و ليس نضجا و على النقيض نجد جولييت..فرغم سنواتها ال 14تتبلور شخصيتها بعد وقوعها في الحب..و تتحول لفتاة ذات إرادة و قوة...وفي خلال 5ايام هي كل عمر قصة الحب التي صدعتنا لقروون..تحولت لامرأة وفية قادرة.. ✒و من الغريب حقا ..ان مدارس العالم اتفقت علي ان تقررها على الطلبة في سن 14-15..لا اعلم ..من باب الإنذار و لا التشجيع؟ على المستوى الشخصي أري ان شكسبير كان موفقا حقا في اختيار هذا السن الصغير..هكذا صار من حقه..التمادي الىاقصى مدى في تطورات هذا الحب ..و أثبت لنا للمرة المائة ..ان ذكائه و خياله كان سابقا لعصره✏وصالحا لكل العصور...ويكفيه فخرا أن روميو هو اللقب الذي يحظى به كل عاشق ..بعد مرور 4قرون كاملة"}, {"userName": "Kelly", "userReviewDate": "Jun 01, 2007", "userURL": "http://www.goodreads.com/user/show/94602-kelly", "userReview": "\"Hey! I'm eatin' here!\"So you're at a nice outdoor cafe one day, eating your lunch, and all of a sudden some fool kids come running through the square with their swords out (apparently they've got some strong Second Amendment advocates in Verona) and insist on skewering each other right there in front of you in the square! And seriously all you want to do is just eat your (damn fine, not that anyone asked you) pasta and get back to work before your lord finds some excuse to fire you. But nooooo, instead you've gotta deal with a whole lot of screaming, panicky, dangerous crowds rubbernecking around (and betting on) these rich kids fighting over who knows (or cares) what and there's no way you're gonna get back in time.Yeah.. that's about the read I got from Shakespeare on this play. This is an excellent deconstruction of the elements that make up major Greek tragedies, breaking it down into parts and fitting them into modern day (or it was then) society. Shakespeare was a great adapter of older tales retold to suit his own purposes, and here, it shows.So there's this Greek story, right? It's set up on this grand scale, with major, crashing chords that are played over and over throughout the tale. There's the Greek chorus, of course, at the beginning and then somewhere in the middle to remind us what it is we're watching. There's a good deal of sky imagery to go along with this invoking of the old gods- moons, suns, clouds, night, stars, dreams, even the otherworldly fae(\"Juliet is the sun,\" \"the lark the herald of the dawn\" \"take him and cut him into little stars\", the Queen Mab speech, tons of other examples). By the same token, the gods of the Underworld are equally called to witness- lots of death, grave, earth imagery as well (examples: too many to count). These extreme terms are then often juxtaposed next to each other (\"wedding bed/grave\" is probably the most frequently used, for obvious reasons) throughout the course of the tale. Through this, Shakespeare shows you just how seriously his main characters take everything that's going on. Especially Romeo and Juliet, of course, but also all the other family members of the Capulets and Montagues (with the exception of Mercutio). Everything is on a Grand Scale. Everything is the Most Important Thing Ever! Nothing could be more Lofty!....Until Shakespeare quite strongly states his opposition to that idea.He thrusts this Grand Tragedy into the midst of a bustling, thriving city, where the participants must brush elbows with and be interrupted by the every day facts of life. He uses each stupid mistake to show us all the ways the end we know is coming could have been and should have been averted, were it not for the stupidest thing that could possibly happen happening in every single scenario. I ended up thinking this after seeing all those scenes of servants at the Capulet house preparing for parties, servants running about the city with messages, escorting Nurse on her errands, inserting a plague that prevented the letter from getting to Romeo. While the two teenage idiots are upstairs enacting this farce, life is happening all around them, and they are just way way too self-centered to see it. Juliet is a bit more aware than Romeo, though. She understands the conflict between the two families, what it will likely mean for them, what she needs to do to get what she wants, and how to accomplish it. And yet... even she is so centered on the fulfillment of what she wants she can barely pause to think of others. There's a great little moment when Nurse comes back from seeing Romeo in the square and Juliet is really impatient to hear what he had to say. Nurse is all 'I'm old! I'm out of breath, give me a second!' Juliet doesn't seem to really care if she dies on the spot, so long as she gets the information she wants, and then Nurse says, accidentally, the words that I think explain this whole play:Your love says, like an honest gentleman, and acourteous, and a kind, and a handsome, and, Iwarrant, a virtuous,--Where is your mother?EXACTLY. She's THIRTEEN, you guys. That's exactly what he SHOULD have said when he met her, and didn't. You know why? 'Cause Romeo's a virgin who really really would prefer not to be. He tells the Friar that he likes Juliet instead of Rosalind now because she loves him back and will presumably have sex with him whereas Rosalind would not. Friar's great response: \"O, she (Rosalind) knew well/Thy love did read by rote and could not spell.\"Just another case of why True Love Waits is a poor plan! If only Romeo had himself a girlfriend, this whole thing could have been avoided.This play displays the soul of adolescence. Both positive and negative. Negative seems to be more promiently on display at first. The characters are self-centered, impatient, convinced that if what they want doesn't come true the way they want it to, the whole world will end. There's also another big adolescent theme: masks. Teenagers spend a lot of time trying to figure out what face they want to wear to the world, what they want to present themselves as, so it makes sense that there's tons of masks, hiding (lots of hiding) and subterfuge going on here.What's interesting to me though is that it also shows the other side of adolescence, the part that's thinking about growing up, but can't quite leave behind his childish things. One major example of this to me the influence of several characters on Romeo- Mercutio and the Friar, even Benvolio. It seems to me that they're starting to get through to the guy in the short time he's there. Especially Mercutio. He gets him to go to the party, gets him to laugh and joke again, and manages to give him some fine counsel into the bargain. I witnessed a lot of echoes of Mercutio coming out in Romeo... they just don't seem to quite take hold. For instance there's Mercutio's magnificent Queen Mab speech, which he follows up with: \"True, I talk of dreams,Which are the children of an idle brain,Begot of nothing but vain fantasy,Which is as thin of substance as the airAnd more inconstant than the wind\"Ie, don't take all these heart burnings so seriously, kid! Romeo does appear to consider this later, though he does dismiss it. Similarly, the Friar's long speech about manhood (ie, his great smackdown of how why Romeo is terrible) seems to get to him, even Benvolio's urgings that he'll find someone else to love at the banquet seem to have worked (if not quite in the way he intended). He just couldn't quite get there. Juliet herself... well, I think we see a lot of the mature woman that she could have become- but she doesn't have a woman's experience or resources yet and she ends up giving up rather than having the opportunity to grow. Which, funnily enough, her father predicts in the first act when Paris asks for her hand in marriage with: \"Younger than she are happy mothers made,\" and the dad answers with, \"And too soon marr'd are those so early made.\" Of course, he then proceeds to do the opposite of his own advice, but I don't think that undermines the message.Elizabeth mentioned in her review that she thought there were a lot of comedic elements in this play. I agree- what with the servant characters, the stupid mixups, and that raillery that takes place between the minor members of the family, and that one Romeo/Mercutio scene before the Nurse interrupts them. My closest guess is that was Shakespeare saying, \"Look! I could be writing this! But instead, you people want to see this stupid stupid tale enacted stupidly, so I can't! I can write this soapy crap if you want me to, but this isn't who I am.\" Or, as Mercutio says: \"Why, is not this better now than groaning for love?now art thou sociable, now art thou Romeo; now artthou what thou art, by art as well as by nature:for this driveling love is like a great natural,that runs lolling up and down to hide his bauble in a hole.\"And yet... for all of that annoyance, that satire, that social criticism, that biting realism... for all of that, Shakespeare still gives this tale a beautiful sympathy, putting gorgeous words into the mouths of his leads. He makes Romeo and Juliet people, people you can envision and who you know, people you don't want to see die, in spite of all their errors right there in front of you. He respects the beauty in the craziness, explores it in wonder. He was, after all, a storyteller, and if this was a story to affect people, it deserved to be told and told as well as he knew it to be in him to do, with a understanding that extends from his characters to the audience that wanted to see it.It is worth reading. Even if you think you've heard it all before. After all, even if you don't like it it is \"not so long as (it) is a tedious tale.\""}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Feb 11, 2013", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "True confessions time: I've read Romeo and Juliet at least once, maybe more (probably it was in one of my college English courses) and mostly thought, great poetry, but GAH! silly kids! idiotic people! I've seen it on stage once or twice -- one production cast Romeo's family entirely with black actors and Juliet's family with white ones, to bring the feuding a little closer to home, I guess. It was interesting, but still, didn't really move me. Though I'm sure I teared up during the final scene, but hey, I'm easy to manipulate emotionally that way. Books and movies make me cry All. The. Time. It's not a major achievement.And then I saw the movie Shakespeare in Love (on cable TV, years after it was in the theaters). The movie has Joseph Fiennes and Gwyneth Paltrow doing numerous scenes from R&J together, not to mention a little Dame Judi Dench on the side, which always helps, and I totally ate it up. It hit me right in the heart. Gwyneth Paltrow! IKR?So all of that is to say that yes, Shakespeare is a genius, but sometimes it just takes the right set of actors in one of his shows to make you love it emotionally as well as intellectually. Which reminds me of my favorite actors ever in a Shakespeare production, Oberon and Puck in A Midsummer Night's Dream ... but that's a different story."}, {"userName": "Emily May", "userReviewDate": "Dec 05, 2010", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "In terms of language and style, Romeo and Juliet might possibly be the best of all Shakespeare's work. It's crammed full of some of the most beautiful poetry I've ever had the pleasure of reading. But the story of lust-filled teens sacrificing themselves because of an extreme burst of instalove? Never really been my cup of tea."}, {"userName": "Angela", "userReviewDate": "Jul 21, 2014", "userURL": "http://www.goodreads.com/user/show/30035966-angela", "userReview": "Okay so I just watched the \"new\" Romeo and Juliet movie (the one with Douglas Booth and Hailee Steinfeld) and thought \"you know what I could really use a re-read of this\". Ha such a good idea; one of my best. First off all I could think about the whole time I was reading it was Douglas Booth staring at me like this while he told me I smelled like roses and was the sun... \n\n\n(accidentally saved this picture as Romeow and I'm laughing so much harder than I should be about it)So the whole time I'm reading this I'm dying!!!! I don't know if yall have seen the movie or not, but Douglas Booth does a butt ton of running in it and good lord!!!! It is hilarious. He like swings his arms a lot and his wrist are flapping around. So anytime there was an action scene in it I couldn't take it seriously. (If a gif or a video of Douglas Booth running isn't a thing that's been made someone please for the love of the internet make it!)Since I know everyone and there mom (literately) has read this book I'm just gonna give you a quick run down of everything that happens... *alarm sounds* Spoiler alert!!! Yes that was meant sarcastically... Romeo meets Juliet and is instantly like BAM \"I need to wife that girl up\", and Juliet is all like \"I need to be wifed up\" so these two star-crossed love birds embark on a super secret love affair. After getting married shit starts hitting the fan and drama is thrown all over the place. This resulting in 6 deaths, a marriage only lasting a vast 3 days, and a botched suicide plan that actually turns into suicide! *gasp* Plot twist!! Am I right?!?!Oh and I gotta mention this little sidenote: in the movie Juilet's mom is rocking this sick rat-tail look so anytime she comes into play in the book I can only imagine her with her rat-tail up do. All these things blended together made me really enjoy re-reading this. Yes Romeo and Juliet story now-a-days might be laughed at and not seen for what it really is. And yeah, Juliet is WAY too young to be taking this stud into her room. Even if he is a chiseled jawed brit with great hands. And I'm pretty sure this book (maybe) invented insta-love, but hell I don't even care.\n\n\nI had a ton of fun re-reading this twist tale of death and desire. It's why I figured I write a little something something about it. It seriously gives us so much hope... I mean when Romeo sees Juliet wake up and then is so happy and forgets that he just drank poison; we for a split second too believe in love at first site... Then when he realizes what he's done Shakespeare crushes our spirits and takes it all away! Then to top it all off Juliet is like \"ehhhh I'm gonna die now too\". Like little girl you DAF, but stabbing yourself is the boss way to go out. At least you didn't go the sissy way like yo man did. Hmmmm it's all pretty brilliant if you ask me. Watching this movie was so bad that it made reading the book even better. Romeo and Juliet gives us everything we both hate and love in books. Inst-forbidden-love, quotable moments, something that makes us questions our morals, death, soap-opera like drama that all starts out at a sweet dance party. Ahhhh ta be young and in luv.READ THIS REVIEW AND OTHERS OVER ON OUR BLOG:SBSR SBSR SBSR SBSR SBSR SBSR SBSR SBSR SBSR"}, {"userName": "Ian \"Marvin\" Graystik", "userReviewDate": "Sep 07, 2012", "userURL": "http://www.goodreads.com/user/show/5022264-ian-marvin-graystik", "userReview": "ROMEO AND JULIET: THE MUSICAL (A BRUCE SPRINGSTEEN PRODUCTIONS EXTRAVAGANZA)WHAT THE CRITICS ARE SAYING:\"Bruce Springsteen mixes Shakespeare’s best known romance with electric guitars, pianos, keyboards and saxophones.\" (Rolling Stoned)\"Sex, drugs, rock ‘n’ roll, cars, bikes, gangs, bangs, brawls, literature, blood, sugar, death, magik, kitchen sinks, meatloaf, clowns. It’s got everythnig.\" (Grauniad)\"E-Street Bard.\" (Village Voyce)\"Star-crossed Lovers Killed by Loose Windscreen.\" (Notional Enquirer)\"The Boss Updates Big Willie\" (The Unyun)\"Bruce Shakesteen or William Springspeare: You Decide!\" (Variete)\"I Haven't Seen It. Have You Seen My Backlog of GR Notifications?\" (Paul Bryant)\"Like.\" (Bird Brian)\"Well everybody better move over, that's all/He's running on the bad side/And he's got his back to the wall/Tenth avenue freeze-out, tenth avenue freeze-out\" (Richard)\"This show sets the bar very high, almost out of reach of regular top-shelf drinking patrons.\" (Bruce Shakespeare, The Australian Shakespearience Dinner and Floorshow)CHORUS:Two households, both alike in dignity,In fair Verona, where we lay our scene,From ancient grudge break to new mutiny,Where civil blood makes civil hands unclean.BRUCE:The midnight gang's assembled And picked a rendezvous for the night Man there's an opera on the turnpike There's a ballet being fought in the alley PRINCE:Three civil brawls, bred of an airy word,By thee, old Capulet, and Montague,Have thrice disturb'd the quiet of our streets,And made Verona's ancient citizensCast by their grave beseeming ornaments,To wield old partisans, in hands as old,Canker'd with peace, to part your canker'd hate.BRUCE:Outside the street's on fire In a real death waltz Between what's flesh and what's fantasy And the poets down here Don't write nothing at all They just stand back and let it all be PRINCE:If ever you disturb our streets again,Your lives shall pay the forfeit of the peace.Once more, on pain of death, all men depart.BRUCE:In the quick of the night They reach for their moment And try to make an honest stand But they wind up wounded Not even dead Tonight in JunglelandCHORUS:From forth the fatal loins of these two foes,A pair of star-cross'd lovers take their life;Whose misadventured piteous overthrows,Doth with their death bury their parents' strife.Enter Romeo, still love-sick for Rosaline.ROMEO:Rosaline, jump a little higher Senorita, come sit by my fire I just want to be your lover, ain't no liar Rosaline, you're my stone desire MERCUTIO:True, I talk of dreams,Which are the children of an idle brain,Begot of nothing but vain fantasy,Which is as thin of substance as the airAnd more inconstant than the wind.BRUCE:In the day we sweat it out on the streets of a runaway Italian dream At night we ride through the mansions of glory in suicide machines Romeo, still pining for Rosaline, discovers Juliet and becomes newly infatuated.ROMEO:Juliet, let me in, I wanna be your friend, I want to guard your dreams and visions Bruce realises he has competition for Juliet’s love and wants to elope without her parents’ permission.BRUCE:Together we could break this trap We'll run till we drop, baby we'll never go back Romeo pleads even harder, now he has learned about his rival, Bruce.ROMEO:I gotta know how it feels I want to know if love is wild Babe, I want to know if love is real Oh, Juliet, can you show meJuliet learns that Romeo comes from a rival family.JULIET:My only love sprung from my only hate! Too early seen unknown, and known too late!Juliet falls for Romeo regardless.JULIET:What ’s in a name? That which we call a rose By any other name would smell as sweet.Juliet decides she must confront Bruce and tell him they are not meant to be.JULIET:Bruce, the angels have lost their desire for usI spoke to them just last night and they said they won'tset themselves on fire for us anymoreBruce persists, trying to hold onto the memory of their love.JULIET:I'm really sorry, BruceI've gotta set you looseI know you've got a beat up old BuickAnd dreams of something better for meBut, frankly, I just can't see itMy vision for me can't be achievedIn the back seat of a second hand FiatWhile your friends hang around drinking CoronaBRUCE:You say you don't like it But girl I know you're a liar'Cause when we kiss Ooooh, FireJuliet grows weak and almost falls.BRUCE:What is wrong, my love?JULIET:I have the worst headache.BRUCE:Here take some of these now, and again when you feel the pain coming on.Bruce gives her a small glass bottle of non-prescription drugs. Blue tablets.JULIET:How many should I take?BRUCE:No more than two every four hours.Juliet takes three tablets immediately.JULIET:It hurts me to say but you gotta know itThere’s no point in remaining coyI can’t marry you, Bruce.I could never be happy with a boyFrom Long Branch, New JerseyNo amateur actor or drama queenNo busboy, bellhop or dead ringerFor De Niro or a film student from PomonaNot for me, your guitar-slinging outlaw singer I crave more than an Asbury Duke or an E Street Loner.Romeo looks dashing in his open-necked shirt and film director scarf. Juliet has never seen anything like him.The love between Romeo and Juliet grows in leaps and bounds.JULIET:My bounty is as boundless as the sea, My love as deep; the more I give to thee, The more I have, for both are infinite.ROMEO:Beneath the city two hearts beat Soul engines running through a night so tender In a bedroom locked In whispers of soft refusal And then surrender. JULIET:I long for a real hot-blooded manAn alpha male of the highest orderA man of another world from hereSomeone from across the borderI don't just mean New JerseyOr Philadelphia, PA You see, I love a Prince from far Verona With a flash suit and money to burn, A mansion and a real fast carA smart haircut and a leather-coated bonerHe’s waiting for me nowI've got him in my viewHe's the rising sonOf the House of MontagueROMEO:Baby this town rips the bones from your back It's a death trap, it's a suicide rap We gotta get out while we're young Cause tramps like us, baby we were born to run CHORUS:Wisely and slow; they stumble that run fast.Juliet feels no relief for her headache. She opens the bottle and takes another two tablets. It’s only an hour since her last dose. JULIET:I want to be a starOf the stage and screenI don't want a bit partOr a role that’s obsceneI've had enough of men who work All week for minimum wagesI want to be rememberedThrough time eternal...and for ages and agesMy love’s a director who makes serious filmsNot just action flics designed to wowEven his money men are all agreed“Romeo, Romeo, we’re for art now”The moment he cast his eyes on meHe sat me down and cast me on his couchHe said he’d get my photo in the magazinesAnd we’d drive around all night in limousines Romeo and Juliet resolve to escape in Romeo’s car.JULIET:Just so I could live in this promised landI turned my back on Bruce’s traveling bandNo more Buicks or Fiats for this CapuletDear husband, I pledge to be your wife, JulietSo I can feature in a film cameoIn the front seat of your Alfa, Romeo.Tybalt chases them on a motor bike. He crosses suddenly into Romeo's path and clips the front edge of the car. He loses control of his bike and falls to the thundering road. Romeo can't avoid running over the top of Tybalt and killing him. Still, Romeo rolls his car three times while taking evasive action, and both Romeo and Juliet are knocked unconscious when their heads hit the side door panels.ROMEO:I dreamt my lady came and found me dead (in that order).Juliet wakes first, only to look over to the driver’s seat, where she sees Romeo. She can’t tell if he is alive or dead. She realises that her headache has now become extreme. If she can treat her pain, she can try to help Romeo. She touches her forehead where it hit the inside of the car door and pulls her hand away, covered in blood that still seems to be flowing profusely. Tears form in her eyes and her eyesight becomes blurry. She reaches into her purse and takes another four tablets, in the hope that it will kill her pain. She lapses into unconsciousness.Shortly afterwards, Romeo awakes and finds Juliet still beside him. There is blood everywhere and a white froth has descended from her lips and dried on her chin.ROMEO:O my love! my wife!Death, that hath suck'd the honey of thy breath,Hath had no power yet upon thy beauty:Thou art not conquer'd; beauty's ensign yetIs crimson in thy lips and in thy cheeks,And death's pale flag is not advanced there. Romeo wipes the froth from her lips and gives her one last kiss. He lifts the left leg of his trousers and pulls out his knife.ROMEO:O, hereWill I set up my everlasting rest,And shake the yoke of inauspicious starsFrom this world-wearied flesh. Eyes, look your last!Arms, take your last embrace! and, lips, O youThe doors of breath, seal with a righteous kissA dateless bargain to engrossing death!Come, bitter conduct, come, unsavoury guide!Thou desperate pilot, now at once run onThe dashing rocks thy sea-sick weary bark!Here's to my love!Romeo drags the knife across his throat. He drops the knife and holds his hand to the artery in his neck. He continues to feel the slow, regular pumping of his heart, until it pumps no more.Now, Juliet wakes again. Still groggy, she looks over to Romeo. Convinced by the abundance of blood that he has died, she shakes the rest of the tablets in the bottle into her hand and swallows them eagerly.JULIET:O true apothecary!Thy drugs are quick. Thus with a kiss I die.She kisses Romeo and dies.PRINCE:Never was a story of more woeThan this of Bruce, Juliet and her Romeo.Bruce lives alone and works his day job, almost like an automaton. His only salvation is the time he spends in his beat up old Buick. Every night, he drives the streets of Verona, haunted by the love he felt for Juliet and the guilt that it was the pills he gave her that took her life. Sometimes, through the tears in his eyes, he imagines that he sees her walking down the street, only to lose sight of her as she slips quietly down an alleyway.BRUCE:You're still in love with all the wonder she brings And every muscle in your body sings as the highway ignites You work nine to five and somehow you survive till the night Hell all day they're busting you up on the outside But tonight you're gonna break on through to the inside And it'll be right, it'll be right, and it'll be tonight And you know she will be waiting there And you'll find her somehow you swear Somewhere tonight you run sad and free Until all you can see is the night.APOLOGIES:Please don't sue me, Boss.How can I possibly argue that your lyrics deserve to be on the same page as Shakespeare, unless I shamelessly misappropriate them in the pursuit of parody, pastiche, spoof, send-up or lampoon?This isn't damning with faint praise. This is no piss-take. This is a full-on homage, a big hurrah, a laud almighty. I say, more kudos to the Boss!As the literary theorist Linda Hutcheon puts it (as quoted by my WikiLawyer), \"parody...is imitation, not always at the expense of the parodied text.\" I already have multiple copies of your albums on both CD and vinyl, even the boring ones. I don't need any more, until you release 50th anniversary editions with bonus disks I don't already have. [I really hope I'm still around in 2045, so I can be the first to buy \"The Ghost of Tom Joad Uncut\".]If that doesn't convince you it's not worth suing me, Brucewad, I won't have any money left to support this great music industry of ours that is being killed by illegal downloads.Please get your lawyers to spare my humble upload.And if they do come looking for me, they'd better be pretty damned fit, coz tramps like us, baby we were born to run."}, {"userName": "Sarah", "userReviewDate": "Jun 14, 2007", "userURL": "http://www.goodreads.com/user/show/118558-sarah", "userReview": "The first time I read Romeo and Juliet (my freshman year of high school), I hated it. I had always heard it built up as a great love story, a great romance- and I didn't see it at all. To me, it seemed a pretty pointless story about a couple of idiotic teenagers in lust. The ridiculous essays I was forced to compose about it certainly didn't help.My senior year of high school, however, my drama teacher selected it as our spring play. I was stage manager, and I was horrified when he told me. I pleaded for anything but R & J. But as I worked through the lines with my actors, and saw the scenes slowly put together, I came to realize the power and the beauty of the play.Yes, they are somewhat idiotic teenagers in lust: but the sweeping passion of adolescence, with all its power and impatience, is something worth looking at in itself.I don't know why English classes always seem to assign R & J to teenagers- I think it's a play that is actually much better appreciated by those who are past their own early adolescence. Because now, I love it."}, {"userName": "Foad", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/25683251-foad", "userReview": "توى هملت، وقتى بازيگراى تئاتر مى رسن به كاخ السينور، هملت به يكى از بازيگرها به شوخى مى گه: بانوى من، از آخرين بار كه شما را ديدم ريش در آورده ايد!توى پاورقى مترجم تذكر ميده كه دوره شكسپير، زن ها بازيگرى نمى كردن و امر قبيحى بوده بازيگرى زن ها. در نتيجه نقش زن ها رو پسرهاى نوجوان بازى مى كردن. و حرف هملت هم كنايه طنزآميزى به اين نكته است.توى فيلم \"روزنكرنتز و گیلدنسترن مرده اند\" (اقتباسى طنز از هملت) اين نكته به درستى رعايت شده و بازيگرهاى نمايش همه مرد هستن، ولى بعضى هاشون موهاشون رو بلند مى كنن و صورت شون رو سفيد مى كنن و نقش زن بازى مى كنن.خواستم بگم توى نمايش رومئو و ژوليت يك صحنه هست كه دو عاشق بين هم ديگه چند بار بوسه رد و بدل مى كنن. با تصور اجراى اين صحنه در اون دوره آدم چندشش ميشه!!"}, {"userName": "Alok Mishra", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/13737116-alok-mishra", "userReview": "This great book (drama of course) I read in a single night. Naturally, an English graduate seldom can remain away from Shakespeare and his realm. However, even as an individual, before I began my studies seriously, Shakespeare and some of his creations were on the list 'to be read'. Romeo and Juliet is a play, to be clear at the beginning. Yes, as critics (modern ones) claim, this is perhaps the most 'unlikely' play which does not synchronise with the reality as others by the same dramatist. Nevertheless, let's give the 'play' its due - it surely does create that sensation which Shakespeare wanted to. The ephemeral romance between the 'first sight lovers' and the enemies sworn to suck the blood out of their lives... everything went on perfectly to (at least) create the star of today's Hollywood - Leo! The book has its merits as well as the demerits. Shakespeare is the vacuum. You can keep your experiments going on... I would like to rather appreciate him for his creation this time. I enjoyed reading the play and truly did!"}, {"userName": "Paula W", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/13286533-paula-w", "userReview": "What I thought about this book in middle school: I don't get it. What?What I thought about this book in high school:This is stupid. What? What I thought about this book in college:Okay, so two kids meet once, \"fall in love\", and then commit suicide over each other in just four days? IDIOTS. What I thought about this book after finishing it today, aged 44:Wow. Shakespeare is a GD genius. What I didn't realize until today, after reading it a few times and watching several movie adaptations, is that this story isn't about young, stupid love at all. First of all, these characters are people I know. Romeo is my friend Mike, Juliet is my friend Jess, the nurse is my mom telling her embarrassing stories all the time, and Mercutio is my friend Chris. Chris \"that's what she said\" Chris. Yes, love is in there. But what I saw when reading it again this time is that everyone has their own ideas of what love is. Romeo and Juliet are in passionate, crazy, how-you-feel-about-someone-the-first-few-weeks-of-a-relationship love. The nurse has a more practical idea of love. Juliet's mom thinks love is based on what you can get from someone. Juliet's father thinks love is being obedient. Mercutio thinks love is only a means to a sexual end. Paris thinks love is something you can earn or demand from someone.But much more than love, this story is about life. It is about the people in our lives, how we deal with them, how they each have their own agenda without knowing or even caring about anyone else's agenda, how life fucks around with us and knocks us down, and how your destiny will hunt you and get what it wants from you no matter how you try to avoid it. I particularly liked Shakespeare's use of day and night/light and dark. Romeo describes Juliet as the sun, and Juliet describes Romeo as stars. They see each other as sources of light. But they must sneak around to see each other, and can therefore only meet up at night when it is dark. In order for them to see each other's light, there must be some darkness. Damn it, Shakespeare. *swoon*There are many other great themes and symbols in here, more than I could possibly go into in a review. The bottom line is that Romeo and Juliet is now my second favorite Shakespeare play, just behind Hamlet. The balcony scene alone is worth the time it takes to read the entire book. Arise, fair sun, and kill the envious moon who is already sick and pale with grief that thou, her maid, at far more fair than she.Damn it, Shakespeare. *double swoon*"}, {"userName": "Darwin8u", "userReviewDate": "Mar 11, 2011", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "“Go wisely and slowly. Those who rush stumble and fall.” ― William Shakespeare, Romeo and JulietIt is hard to critique Romeo & Juliet since it is like family. It was the first Shakespeare many of us were introduced to. It seems like family. But reading Shakespeare this year in rough order, I see as Romeo & Juliet follow Richard II, Shakespeare grown large, lyrical, bold, steady, and sharp. He has mastered not just drama, but tamed English. He has broken poetry to his will. He re-oriented the stars of what language can do. Like the Bible, certain texts seem to change as one ages. Romeo & Juliet read as a youth, the focus is on the drama, the narrative, the plot. Today, I've been consumed by the language, the symmetry, the fatalism of this play. When I was young, I found it romantic. Now that I'm a father myself to a teenage girl, I find it holds truth about fathers too. I was lucky that my 3x12 reading of Shakespeare (3 plays per month of his first folio) landed me in April reading Romeo and Juliet. My daughter, a freshman, is obsessed with the play. She borrowed mine, but needing mine, I bought her another copy. There might be three sad Romeos, three grieving Juliets hiding in our house. It is a delight as a father who reads, to find my 14-year-old daughter on her bed reading Juliet's part for an English class. Perhaps, all is not lost in these Twitter-filled times."}, {"userName": "Evelyn (devours and digests words)", "userReviewDate": "Jan 12, 2016", "userURL": "http://www.goodreads.com/user/show/38658747-evelyn-devours-and-digests-words", "userReview": "There is nothing romantic about Romeo & Juliet. If anything, this felt like an intentional mockery to me. So if anyone thinks this is categorized as Romance, I will stare at them like they've lost their heads. There have been debates about whether or not Romeo & Juliet is a satire. I'm 101% sure that this is a satirical play in which Shakespeare, the genius bastard, mocked and made fun of hot-headed, foolish teenagers. The man laughed in the face of insta-love (lust), and I laughed along with him. If he was here, I'd offer him a high five because hey, some of his mockery is true. Many teens (I'm not saying all) tend to confuse lust and admiration for love. We also shoot our mouths like bullets at the adults who are supposed to 'know better'. I may or may not be one of those teens.I've read Hamlet, Macbeth, and Julius Caesar where characters there are smart in their actions. So... why would he create a fool like Romeo? I've read The Tempest where the relationship between Miranda and Ferdinand took a slow, budding pace so why the sudden proclaimations of love and wedding vows here? It does not adds up. Unless of course, you see this in a satirical point of view.Besides, Shakespeare always struck me as someone who explores in the deep meaning of love. Love is not a subject he took lightly. This I assumed also by judging from what many people say about his sonnets.I didn't feel the air of tragic when Shakespeare killed off the characters here; poison down Romeo's throat, sword in Juliet's gut. It felt like Shakespeare himself was laughing his ass off.Lookit these stupid teenagers. Lookit how blindly they throw themselves into relationships! Ha...ha...ha!So bugger with the insta-lust. It's laughable, unrealistic even, but I've had the time of my life reading this play. If Shakespeare indeed meant this to be a satire, he did a great job."}, {"userName": "Lyn", "userReviewDate": "Jul 31, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "“O Romeo, Romeo, wherefore art thou Romeo? Deny thy father refuse thy name, thou art thyself thou not a Montegue, what is Montegue? tis nor hand nor foot nor any other part belonging to a man What is in a name? That which we call a rose by any other name would smell as sweet, So Romeo would were he not Romeo called retain such dear perfection to which he owes without that title, Romeo, Doth thy name! And for that name which is no part of thee, take all thyself.”Shakespeare’s template for star-crossed lovers has become THE template in literature ever since. Believed to have been written in the early 1590s, this has remained a fan favorite for romantic drama.“For never was a story of more woe than this of Juliet and her Romeo.”Also a bloody tale of vendetta and vengeance, this part of the play would also be influential on writers and audiences ever since. The idea of a lasting feud between families, though, is likely timeless. “Good night, good night! parting is such sweet sorrow, That I shall say good night till it be morrow.”Interestingly, this could be seen as something else besides a romance - Shakespeare could have made this into a dark comedy, a devilishly cautionary tale about the hollowness of generational vendetta.I'd like to see this in a film directed by Quentin Tarantino."}, {"userName": "فهد الفهد", "userReviewDate": "Jun 25, 2011", "userURL": "http://www.goodreads.com/user/show/5008212", "userReview": "روميو وجولييت أصبت بحالة جفاف كتابي الأسبوع الماضي، صرت اتجنب الجلوس للكتابة، أؤجلها كل يوم إلى اليوم الذي يليه، أفسر هذه الحالة عندما تأتي بأنها قلق داخلي سببته مواقف صغيرة متفرقة، تجمعت معاً فصارت سداً أمام المزاج المؤاتي الذي يجعلك تكتب. وها أنا الآن يوم بعد الفالانتاين – حيث يفترض أن العشاق حول العالم تبادلوا الهدايا والوعود -، أجلس لأكتب عن الحب، لأكتب عن روميو وجولييت، قصة الحب الأشهر، صحيح أنه لكل ثقافة قصة عشق تغنيها، ولكن روميو وجولييت اكتسبت القوة الدافعة للحضارة الغربية، فصارت قصة العشق الأشهر. نادراً ما ترضيني قصة حب، اعتدت على اعتبار كل قصص الحب التي اقرؤها ناقصة أو سخيفة، ربما لكم العواطف التي تهرق فيها بطريقة اكتئابية !! ربما لأن قصص الحب تكتب كعاصفة وتنتهي كسيل جارف، وربما لأن رأسي يسقط عند أقدامي عندما اقرأ حباً، ولم أجد من يعيده إلى مكانه. قصة الحب الأجمل لم تكتب بعد، سنقرأ مئات قصص الحب المتشابهة، سنذوق ملوحة الدموع، وسنقاسي برد الليالي المسهدة، سنفتن بمشاهد الوصال التي يبدع الكتاب في سبكها على مشهد القمر، أو تحت وابل المطر، أو حتى في مقبرة موحشة، فحرارة الحب تطرد الحزن والخوف، تلغي المشهد الخارجي لتفجر عالماً داخلياً لا يسهل رصده. ترد إلى ذهني الآن وأنا اكتب على غير هدى، قصة حب شعبية، من القصص التي كان العرب يتداولونها رواية وشعراً، والتي كان مسرحها الأعظم خيامهم الباهتة اللون، في تلك القصة يلتقي حبيب بحبيبته بعدما شارفا على الموت، حتى تدخل صديق العاشق ودبر لهما لقاءً، وليشغل وجوه القبيلة عن الرجل الذي تسلل لملاقاة فتاتهم، وفد الصديق على القوم وجعل يشاغلهم بالقصص والحكايات، وفي الطرف الآخر البعيد من الخيمة، كانا العاشقان يتحدثان همساً، يضعان في لحظة كل اللحظات الماضية والتي ستأتي، وكانت العاشقة من فرط الحب والخوف، تتحدث بيديها ملوحة مع كلمة لتمنحها في الظلام صدقاً أكبر، فتصدر خلاخيلها صوت لا ينفذ إلى سمع العاشقين المذهول، ولكن نسائم الصيف تحمله إلى الرجال المتجمعين حول النار والحكايات، فبدأ والد الفتاة يتقلقل ويفكر بالذهاب إلى الداخل لإسكات هذه الخلاخل التي اقتحمت مجلس الرجال، عندها انتبه الصديق للكارثة القادمة، فافتتح حكاية جديدة بأن سألهم هل تعرفون فلان، وسمى لهم صديقه العاشق، قالوا نعم، وامتدحوه بما يعرفونه، فقال الصديق كانت لي مع فلان حكاية طريفة، تسابقنا أنا وإياه مرة على فرسين، فكاد أن يسبقني، ولكني تحايلت عليه فجعلت أصرخ \"يدها يا فلان، يدها يافلان\"، فظن أن يد فرسه قد علقت بشيء، فتوقف وكسبت أنا السباق، ضحك القوم، أما صوت الخلاخيل فتوقف، فيد العاشق امتدت وأمسكت يد معشوقته، بعدما وصله الإنذار الصارخ، بأنه قد لا يخسر السباق هذه المرة وإنما رأسه. وهكذا يبدو أن قصة الحب لا تكون عظيمة، إلا عندما يحيط بها ألف رجل متحفز، بسيوف وبنادق تكفي لاحتلال مدينة، ولكنها لا تكفي لترد عاشقاً، قصة الحب كما يعرف كل من يريد كتابتها، لا يمكن أن تأتي مباشرة، حب النظرة الأولى يبدو أنه سينقرض، ليأتي مكانه كره النظرة الأولى الذي ينقلب عشقاً فيما بعد كما حدث لبينيت ودارسي في (كبرياء وتحامل)، بل حتى من يلجئون لحب النظرة الأولى صاروا يعقدونه بإضفاء ماضٍ من النساء للعاشق، يتخلص منه عندما تغزو قلبه فتاة مختلفة. في هذه المسرحية استخدم شكسبير هذه الحيلة، فروميو يفتتح المسرحية بتأوهات عشق، لا لجولييت، فهو لا يعرفها بعد، وإنما لقريبة لها تدعى (روزالين)، إن من لا يعرف القصة ويقرأ كلمات روميو العشقية، يشعر بأنه لا يمكن أن يتزحزح عن هذا الحب، ويحلل الدكتور عناني في مقدمته لهذا العمل – وقراءة هذه المسرحية بترجمة غير ترجمة عناني هي ببساطة خطأ لا يغتفر – كلمات وأسلوب روميو في المسرحية قبل لقائه بجولييت، وكلماته وأسلوبه بعدها ليخلص إلى أن الحب الحقيقي الذي شعر به تجاه جولييت غيره تماماً، لقد نسخه وأعاده رجلاً جديداً. تدور أحداث القصة في مدينة فيرونا، حيث عائلتي مونتاجيو وكابيوليت المتصارعتين، روميو ابن لمونتاجيو، وجولييت بنت لكابيوليت، يتسلل روميو مع صديقيه ذات ليلة إلى حفلة تقام في منزله غرمائه، عله يرى حبيبته (روزالين) – وحتى لا نشعر بالأسف عليها، يجب أن نعرف أنها لا تهتم بروميو، ربما لأنها لا تشعر بصدق مشاعره نحوها -، ولكنه يرى بدلاً منها جولييت، وهنا تحدث لحظة الحب بينهما، يغادر روميو الحفل ولكنه يعود في ذات الليلة إلى منزل كابيوليت ليقف تحت شرفة جولييت في المشهد الشهير الذي استنسخ مراراً، يتواعد الاثنان على الحب والزواج، وبالفعل يتزوجان سراً في اليوم التالي، يزوجهما القس لورنس عل هذا الزواج يصلح ما بين العائلتين. تيبالت – ابن عم جولييت - الغاضب دائماً يبحث عن روميو ليقاتله، بعدما رآه متسللاً إلى حفل الكابيوليت في الليلة الفائتة، ولكن روميو المنتشي بالحب يرفض مقاتلة تيبالت لأنه صار صهره ولو لم يكن يعلم، عندها يتدخل صديق روميو ويقاتل تيبالت، يحاول روميو وقف القتال ولكنه بالخطأ يمنح تيبالت فرصة يطعن بها صديق روميو طعنة قاتلة، عندها ينتقم روميو بقتل تيبالت. ينفى روميو من فيرونا، فيغادرها بعدما يودع جولييت التي تواجه إلى جانب فراق الحبيب، ضغطاً قاسياً من والدها لتزويجها للدوق باريس أحد أقاربهم، تحاول جولييت مقاومة هذا الزواج بشتى الطرق، ولكن والدها ينفجر غضباً، فتذهب للقس ليساعدها، فيعطيها مخدراً لتتناوله ليلة الزفاف بحيث يجعلها تبدو كالميتة لعدة ساعات، ويعدها بأنه سيرسل رسولاً إلى روميو ليستدعيها بحيث أنها عندما تستيقظ ستجد روميو عندها. تتناول جولييت المخدر ليلة الزواج، وتجري الأمور كما خطط لها، لولا أن الرسول لم يصل إلى روميو، وإنما وصله خبر وفاة حبيبته، يجن روميو عندها فيشتري سماً ويعود إلى فيرونا، وفي المقبرة حيث ذهب ليتجرع السم على تابوت حبيبته وليموت معها تحدث المأساة، فباريس العريس المكسور القلب يظن أن روميو متعدٍ على القبور جاء ليدنس قبر عروسه، فيتقاتلان ليموت باريس، يتناول بعدها روميو السم ويموت، لتصحو جولييت من موتتها الوهمية، فتجد من حولها الخراب والجثث، عندها تطعن نفسها بخنجر وتموت، هكذا يسدل الستار على كل هذا الموت، لم يعش الحب في هذه القصة طويلاً، ولكنه جاء عاصفاً، له رائحة الموت، ومشهد الدماء، ليست كل قصص الحب بهذه الدموية، ولكن يبدو أن قصص الحب التي لا يموت أبطالها، يموت ذكرها.image: لوحة فريدريك لايتون (1855)"}, {"userName": "Jean", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/19300421-jean", "userReview": "Who does not know the story of Romeo and Juliet? And these immortal lines,\"O Romeo, Romeo, wherefore art thou Romeo?\"\"But, soft! what light through yonder window breaks?It is the east, and Juliet is the sun.\"\"Good night, good night. Parting is such sweet sorrow,That I shall say good night till it be morrow.\"The very word \"Romeo\" has become synonymous with \"male lover\" in English, and the idea of the doomed romantic lovers, whose deaths ultimately reconcile their feuding families, is famous world-wide. It has been adapted numerous times for stage, film, musical, opera and radio; the latest film went on general release just a few months ago in 2013.However, Shakespeare did not invent the story of Romeo and Juliet. He reworked a long poem by Arthur Brooks, called \"The Tragical History of Romeus and Juliet\", written in 1562. The tradition of tragic romances had been well established in literature - in particular Italian literature - for almost a hundred years, but what may be surprising is that many of the plot elements of Romeo and Juliet were all in Brooks' poem. The first meeting of the lovers at the ball, their secret marriage, Romeo's fight with Tybalt, the sleeping potion, and even the timing of their eventual suicides, are all episodes which we usually attribute to Shakespeare. This is characteristic of the author, who often wrote plays based on earlier works. Shakespeare's text is believed to have been written between 1591 and 1595, and as such was one of his earliest performed plays, although not published until later. It was an immediate success; so popular that Shakespeare continued to rework and hone the notes from the play's performances. It was then first published in 1597, with later editions improving on it still further. It was among Shakespeare's most popular plays during his lifetime, and has remained so, now being the most performed of all his plays alongside \"Hamlet.\" Although the initial idea for Romeo and Juliet came from the earlier text, it is Shakespeare's wonderful play which is credited with having had such a profound influence on subsequent literature.It starts with a short prologue, in sonnet form, which tells the audience what is to follow. Nobody can be in any doubt that the story is a tragedy about young love, and that it will take their deaths to bring an end to family feuds. We are then straight into the action, which is a masterly piece of writing, full of bawdy references to ensure his audiences' attention, while providing all the background information needed to understand the world of the play. We are immediately told about the long-standing hatred between the two feuding families, the Capulets and the Montagues, and then immediately find ourselves engaged by an exciting brawl. Shakespeare cleverly establishes some of the major themes of the play, right at its start. He also portrays all of the layers of Veronese society starting with the servants, right through to Prince Escalus. Many of the secondary characters important to the play are also introduced here; for instance, Romeo's friend, Benvolio, thoughtful, pragmatic and fearful of the law, and Juliet's cousin Tybalt, a hothead, professing a hatred for peace as strong as his hatred for Montagues. A modern audience becomes aware that in the Verona of this play, masculine honour is not restricted to indifference to pain or insult. Tybalt makes it plain that a man must defend his honour at all times, whether the insult is verbal or physical. Mercutio is established as another friend; one who who can poke friendly fun at Romeo quite mercilessly. Benvolio is not nearly so quick-witted. Mercutio is confident, constantly joking, making puns and laughing. He is a passionate man, but his passions are different from Romeo's love and Tybalt's hate. Their passions are founded respectively upon two ideals of society - love and honour - but Mercutio believes in neither. He comes across as the character with the clearest vision. Just as Mercutio can see through words to other meanings, he can also see through the ideals held by those around him. He understands that often they are not sincerely held, but merely adopted for convenience. The characters in this play are multi-layered and complex, and Shakespeare is adept in revealing their subtleties by means of the action. Even as Mercutio dies, he utters his wild witticisms, cursing both the Montagues and the Capulets, \"A plague o' both your houses! They have made worms' meat of me!\"\"Ask for me tomorrow, and You shall find me a grave man.\"The character of Romeo develops significantly from the first impression we have of him as a stock callow youth. At first he is melancholy, distracted and lovelorn, as we expect. But surprisingly he is not lovesick over Juliet, but is in love with Rosaline. This love seems to stem almost entirely from the reading of bad love poetry! We understand from this that Romeo's love for Rosaline is an immature love, more a statement that he is ready to be in love than actual love. Perhaps Rosaline, who never appears in the play, exists only to demonstrate Romeo's passionate nature, his love of being in love. We meet Juliet in scene 3, and learn that in the Verona of this play, her status as a young woman leaves her with no power or choice in any social situation. Juliet at 13 years old is completely subject to parental influence, and is being encouraged to marry her parent's choice of Paris. Lady Capulet observes wryly that that she had already given birth to Juliet herself when she was Juliet's current age, before she was 14.In this way the forces that determine the fate of Romeo and Juliet are laid in place well before they even meet. Parental influence in the tragedy becomes a tool of fate. Juliet's arranged marriage with Paris, and the longstanding feud between Capulets and Montagues, will eventually contribute to the deaths of Romeo and Juliet. The reader enjoys the tension, and knowledge that terrible events are about to happen. Events and observations continually reinforce the presence and power of fate. Juliet's speeches have many different facets, and are capable of many interpretations. She often professes one thing, whilst we know she has an ulterior motive, and another intention. This is particularly evident when she is speaking to her parents, knowing that she intends to make her own decisions, she perversely wants to speak her mind, but deliberately couches her words in double meanings so that the truth will remain hidden. Juliet is a strong character in the play, particularly fascinating to a modern reader as she seems almost contemporary. She repeatedly goes against what is expected of women of her time and place, and takes action. The best example of this is when she drinks the sleeping potion. She comes up with many reasons why it might cause her harm, and recognises that drinking the potion might lead her to madness or even death. Yet she chooses to drink it anyway. This demonstrates a willingness to take her life into her own hands - and also hints at future events. There is never just one side to, or interpretation of, any event in this play. It is a portent. Juliet drinks the potion just as Romeo will later drink the apothecary's poison. Another instance of ominous foreshadowing is when the Nurse teases Juliet by saying that she is too tired to tell her what happened when she first met Romeo. This delay in telling Juliet the news is mirrored in a future scene, when the Nurse's anguish prevents her from relating news to Juliet and thereby causing terrible confusion. Another example of delicious dramatic irony is when Romeo is proclaiming his love to be the most powerful force in the world. Friar Laurence advises caution, saying, \"These violent delights have violent endsAnd in their triump die, like fire and powderWhich, as they kiss, consume\". The reader knows that the play is a tragedy, and that Romeo and Juliet will die. Shakespeare ingeniously manipulates the plot, so that we feel the impending doom, and are swept up in the inevitability of it all. Even the characters themselves are sometimes aware that they are pawns. Romeo cries, \"O, I am fortune's fool!\"when he realises he has killed Tybalt. He knows that by killing his new wife's cousin, he will be banished from Verona, and feels the inevitability of the situation. This emphasises the sense of fate - or fortune - that hangs over the play. Juliet also indicates in her speeches the power of fate and predestination. In her final scene with Romeo, the last moment they spend alive together, she says that he appears pale, as if he were dead. She looks out of her window and cries, \"O God, I have an ill-divining soul! Methinks I see thee, now thou art so low, As one dead in the bottom of a tomb.\"This vision blatantly foreshadows the end of the play. The next time she sees Romeo, he will be dead. Friar Laurence is a pivotal character in the play. When we first see him he is collecting herbs and flowers for medicinal purposes, demonstrating a deep knowledge of the properties of the plants he collects, and alerting the reader to what may be to come. He meditates on the duality of good and evil that exists in all things; another clearly portentous speech. Referring to the plants, Friar Laurence says that, although everything in nature has a useful purpose, it can also lead to misfortune if used improperly, \"For naught so vile that on the earth doth live But to the earth some special good doth give, Nor aught so good but strain'd from that fair use Revolts from true birth, stumbling on abuse: Virtue itself turns vice, being misapplied; And vice sometime's by action dignified\". Friar Laurence ruminates on how good may be perverted to evil and evil may be purified by good. By making plans to marry Romeo and Juliet, he hopes that the good of their love will reverse the evil of the hatred between the feuding families. Shakespeare portrays him as a benign, wise philosopher. But his schemes also serve as tools of fate; secretly marrying the two lovers, sending Romeo to Mantua, and staging Juliet's apparent death. The tragic failure of his plans are outside his responsibility, and due to chance.The structure of the play is carefully controlled; it would be interesting at this distance to read the earlier versions. Different poetic forms are used by different characters, and sometimes the form changes as the character develops. There are many instances of the sonnet, as the reader would expect, because it is a perfect, idealised poetic form often used to write about love. The play starts with a Prologue in sonnet form, a masterly precis of the story. As it describes Romeo and Juliet’s eventual death, it also helps to create the sense of fate that permeates the entire play.Romeo himself, develops his expertise in the sonnet over the course of the play. When Romeo and Juliet meet they speak just fourteen lines before their first kiss. These fourteen lines make up a shared sonnet, which creates a link between their love and their tragic destiny, as told in the introductory prologue. There are numerous instances of such tightly written formal structure, which is remarkable in such an early play. Even the dramatic action of the play has a tight schedule, spanning just 4 days. Perhaps this is why many of the most important scenes, such as the balcony scene, take place either very late at night or very early in the morning. Shakespeare makes great use of effects such as switching between comedy and tragedy to heighten the tension, and bringing minor characters into the foreground to increase depth and interest. His additional use of sub-plots to enrich the story, is often cited as an early sign of his dramatic skill.This play has everything; love, beauty, and romance, but also sudden, fatal violence early on. Viciousness and danger are continually present, yet just at the point when they threaten to overcome the reader, the action will be tempered by wit, comedy and humour. We are in a masculine world in which notions of honour, pride, and status are prone to erupt in a fury of conflict, but there is a strong female who defies her confined expectations. Rashness, vengeance, passion, grief; they are all here. The motif of fate continues to the very end of the play. Romeo proclaims, \"Then I defy you, stars\" and\"I will lie with thee tonight\" in a last desperate attempt to control his own destiny by spending eternity with Juliet.Yet in this ultimate example of tragic irony, this defiant act seals both his fate, and their double suicide. Shakespeare tells his audience that nothing can withstand the power of fate. The neat twists of the ending are supremely ironic, devastating and heart-wrenching. Here is Romeo, in despair,\"O true apothecary!Thy drugs are quick. Thus with a kiss I die.\"And on waking, Juliet,\"I will kiss thy lips;Haply some poison yet doth hang on them,To make die with a restorative...O happy dagger!This is thy sheath...There rust and let me die!\"It is said that the best way to appreciate Shakespeare is to go to a live performance of a play. Of course in one sense this is true of any play; the live action is how the play was intended to be experienced. But there is a lot to be said for reading Shakespeare on the page. The structure and poetry of the language is so much more evident. The puns and in-jokes are so much clearer. The reader can give pause to properly interpret the manifold meanings of both the exciting events and the rousing speeches. And above all we can marvel at the mastery of a writer who can still speak to us with relevance, move us with poetry and story, and entertain his audience well over 400 years later.\"For never was a story of more woe Than this of Juliet and her Romeo.\""}], "description": "In Romeo and Juliet, Shakespeare creates a world of violence and generational conflict in which two young people fall in love and die because of that love. The story is rather extraordinary in that the normal problems faced by young lovers are here so very large. It is not simply that the families of Romeo and Juliet disapprove of the lover's affection for each other; rather, the Montagues and the Capulets are on opposite sides in a blood feud and are trying to kill each other on the streets of Verona. Every time a member of one of the two families dies in the fight, his relatives demand the blood of his killer. Because of the feud, if Romeo is discovered with Juliet by her family, he will be killed. Once Romeo is banished, the only way that Juliet can avoid being married to someone else is to take a potion that apparently kills her, so that she is burried with the bodies of her slain relatives. In this violent, death-filled world, the movement of the story from love at first sight to the union of the lovers in death seems almost inevitable.What is so striking about this play is that despite its extraordinary setting (one perhaps reflecting Elizabethan attitudes about hot-blooded Italians), it has become the quintessential story of young love. Because most young lovers feel that they have to overcome giant obstacles in order to be together, because they feel that they would rather die than be kept apart, and especially because the language Shakespeare gives his young lovers is so exquisite, allowing them to say to each other just what we would all say to a lover if we only knew how, it is easy to respond to this play as if it were about all young lovers rather than about a particular couple in a very unusual world. (When the play was rewritten in the eighteen century as The History and Fall of Caius Marius, the violent setting became that of a particularly discordant period in classical Rome; when Leonard Berstein rewrote the play as West Side Story, he chose the violent world of New York street gangs.)", "title": "Romeo and Juliet", "url": "http://www.goodreads.com/book/show/18135.Romeo_and_Juliet", "average": 3.74, "cover": "https://images.gr-assets.com/books/1327872146l/18135.jpg", "reviews": 16062, "authors": [{"url": "https://www.goodreads.com/author/show/947.William_Shakespeare", "name": "William Shakespeare"}, {"url": "https://www.goodreads.com/author/show/569383.Barbara_A_Mowat", "name": "Barbara A. Mowat"}, {"url": "https://www.goodreads.com/author/show/8140.Paul_Werstine", "name": "Paul Werstine"}], "type": ["Classics", "Plays", "Fiction", "Romance", "Academic"], "outlinks": ["http://www.goodreads.com/book/show/18135.Romeo_and_Juliet", "http://www.goodreads.com/book/show/2294928.Romeo_and_Juliet", "http://www.goodreads.com/book/show/597857._", "http://www.goodreads.com/book/show/25853025-romeo-and-juliet", "http://www.goodreads.com/book/show/20710446-romeo-and-juliet", "http://www.goodreads.com/book/show/625963.Romeo_and_Juliet", "http://www.goodreads.com/book/show/6679340-romeo-and-juliet", "http://www.goodreads.com/book/show/5972719", "http://www.goodreads.com/book/show/1828853.Romeo_and_Juliet", "http://www.goodreads.com/book/show/1420.Hamlet", "http://www.goodreads.com/book/show/8852.Macbeth", "http://www.goodreads.com/book/show/1622.A_Midsummer_Night_s_Dream", "http://www.goodreads.com/book/show/12996.Othello", "http://www.goodreads.com/book/show/12957.Much_Ado_About_Nothing", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}