{"ratings": 600369, "userreviews": [{"userName": "TheGirlBytheSeaofCortez", "userReviewDate": "Nov 08, 2010", "userURL": "http://www.goodreads.com/user/show/2634423-thegirlbytheseaofcortez", "userReview": "Ever since its Booker nomination (it made the shortlist), Room by Irish writer Emma Donoghue has set the literary world on fire. Most people who review the book seem to love it. They talk about how riveting and suspenseful the book is and how they felt compelled to finish it in a single reading. I guess I’ll have to be one of the few dissenting voices. I really, really, really disliked Room and yes, I do have specific reasons why.I can’t imagine anyone not knowing the basic plot of Room, but for those who don’t, the book was inspired by the true story of Elisabeth Fritzl, an Austrian woman who had been imprisoned in her father’s basement for twenty-four years, during which time he repeatedly assaulted and raped her. She eventually bore him seven children and had one miscarriage. Three of her children, one daughter and two sons had been imprisoned with their mother for the whole of their lives (until rescue).Room takes its basic plot from the Fritzl case as well as the cases of Jaycee Lee Dugard in California and of Natascha Kampusch and Sabine Dardenne.Room is narrated by a young boy, Jack, who has just “celebrated” his fifth birthday. Jack has never known a human being other than his mother, who he calls “Ma.” “Ma,” we come to learn, was abducted one night at age nineteen on her way to the school library. For the past seven years she’s been held captive in a garden shed fitted with soundproofed cork, lead-lined walls, and a coded metal security door and raped repeatedly by her captor, a man she calls “Old Nick.” Two years into her abduction, “Ma” gave birth to a son, the five-year-old Jack mentioned above.We soon learn that “Ma” has tried to make life as normal and as sane as possible for Jack as one can in a room that measures 11x11. She holds “Phys Ed” classes for Jack in the morning and tries to ensure that he gets some exercise. She insists that they keep to strict mealtimes. They do have a TV, and though “Ma” limits Jack’s TV watching just like any good parent would do, it is from TV that Jack learns about the outside world, that he learns the stories that “Ma” entertains him with are true ones. However, despite the fact that Jack has access to television, he really isn’t aware that anything exists outside of “Room.” Even “Old Nick” isn’t “real” to Jack because Jack’s always safe in “Wardrobe” when “Old Nick” comes through “Door.” All Jack really knows about “Old Nick” is that he “brings groceries and Sundaytreat and disappears the trash, but he's not human like us. He only happens in the night, like bats.... I think Ma doesn't like to talk about him in case he gets realer.”I have to admit, I’ve never been fond of books narrated by children, but Room, for me, was especially odious. “Ma” has created characters out of all the objects in “Room” and Jack refers to them as though they are real, living, breathing persons. There’s “Wardrobe” and “Rug” and “Plant” and “Meltedy Spoon.” One page of this is bad enough, but an entire book? It took a lot of determination for me to finish the thing. Here’s Jack describing a typical day in “Room”:We have thousands of things to do every morning, like give Plant a cup of water in Sink for no spilling, then put her back on her saucer on Dresser.... I count one hundred cereal and waterfall the milk that’s nearly the same white as the bowls, no splashing, we thank Baby Jesus.Waterfall the milk??????Regarding his TV watching, Jack says:I'd love to watch TV all the time, but it rots our brains. Before I came down from Heaven Ma left it on all day long and got turned into a zombie that's like a ghost but walks thump thump. So now she always switches off after one show, then the cells multiply again in the day and we can watch another show after dinner and grow more brains in our sleep.And here’s Jack talking about some “quiet time” with “Ma”:I get on Ma’s lap in Rocker with our legs all jumbled up. She’s the wizard transformed into a giant squid and I’m prince JackerJack and I escape in the end. We do tickles and Bouncy Bouncy and jaggedy shadows on Bed Wall.Well, a paragraph of that here and there might have worked, but a whole half of a book? Not on your life. And this is a kid who can sing along to Eminem and Woody Guthrie music videos. He knows the latest dances. He listens to people speak on TV. His own mother, the only person with whom he converses, speaks normally. He uses words like “rappelling” and “hippopotami” with ease. Heck, he even knows more about the fall of the Berlin Wall than many Germans. So what’s with the almost unintelligible baby talk? I know he’s only five, but other than his horrendous speech, he seems to be a very precocious five. And please. How many rundowns of “Dora the Explorer” or “Spongebob Squarepants” can one reader take without wanting to throw the book across the room?(From here on this review will contain minor plot spoilers. Please don’t continue reading if plot spoilers will ruin the book for you.)The story of Room is split into two parts, the first part occurring in “Room” and the second part occurring “Outside” after “Ma” and Jack escape. The escape is, to put it mildly, totally ludicrous. For a kid who doesn’t even believe the outside world exists, to do what Jack did is beyond belief. It’s like Donoghue didn’t know what she wanted her book to be – the claustrophobic story of captivity inside a small room and how it limits the emotional and intellectual growth of a five-year-old or how a five-year-old who’s been imprisoned in an 11x11 room all his life can mature and be a hero. None of us, including Donoghue, can have it both ways.Once we realize that Jack and “Ma” (we never do learn her name) are being held captive, one would think that Room would take on a sinister, suspenseful atmosphere and leave us wondering what “Old Nick” is going to do next. Instead, it’s painfully boring and slow going and almost totally lacking in suspense. Because Donoghue confines her point of view, at least in the first half of the book, to Jack, the insight we get is painfully mundane, and well, boring. When we finally reach the unbelievable “escape” from “Room,” it all feels forced and shallow and contrived.Some people have made the remark that Donoghue captures perfectly the voice of a young child. I don’t think she does. I don’t even think she captures perfectly the voice of a young child who’s been imprisoned and cut off from the world for all of his five years of life. However, for the sake of argument, let’s just say that Donoghue does capture a five-year-old’s speech pattern perfectly. How many books written by five-year-olds do you find engrossing and enlightening? My bet is none. Five-year-olds can be cute in small doses and of course we love them and want the best for them, but let’s be truthful, they really aren’t very insightful or interesting for long periods of time, and neither is Jack.And then, after the totally implausible “escape” from “Room,” Donoghue fails to explore, with deep insight, the ramifications of reentering a world from which one’s been absent for seven years, or in Jack’s case, a world he’s never known. I felt Donoghue glossed over this difficult transition. I felt the second half of the book lacked depth just as the first half did, though in a different way. What does “Ma” feel now that she’s free? Is she going to reunite with her own parents? (Her mother refused to accept “Ma’s” seeming death, while her father needed to do so and even held a funeral for her.) Is she going to introduce them to their grandson and him to them? Being held in captivity for years, then introduced/reintroduced to the outside world is going to be traumatic for anyone, but for some mysterious reason, Donoghue doesn’t want to explore the rich store of human emotions she could have mined. There was a curious disconnect between the intense trauma “Ma” and Jack would have had to suffer and the blitheness with which Donoghue relates their story.And what of the unnatural bond, truly reminiscent of that in “Psycho,” formed between Jack and “Ma” while in “Room?” Yes, I realize that two people imprisoned together for years are going to form a deep bond, but once those people are freed, especially if they are a twenty-six year old mother and her five-year-old son, then some separation and setting of boundaries is going to be necessary in order to promote mental and emotional health. But Donoghue never explores this facet of “Ma’s” and Jack’s captivity, though clearly, she realized it exists. At one point, Jack says of himself, “Maybe I’m a human, but I’m a me-and-Ma as well.” That outlook might have served him well in “Room” but it’s a dangerous one to cultivate in “Outside.”Donoghue took a real risk with Room and I applaud her for her courage. I think this is going to be a very polarizing book – people will probably either love it or hate it. They will feel it worked wonderfully or they will feel it didn’t work at all. Obviously, for me, it didn’t work at all. I thought the premise was wonderful, but I felt Donoghue failed to deliver. I honestly can’t understand how this book even made the Booker longlist, let alone the shortlist. I expect more depth and insight from a Booker nominated work. Do I think Donoghue was a lazy storyteller with Room? I don’t know if I’d go that far, but I do think she capitalized on gimmicks and topicality, and I was very disappointed. In the end, the whole thing felt like a cheap trick to me, and after reading it, I felt like I had to go take a long, hot shower.1/5Recommended: No."}, {"userName": "j", "userReviewDate": "Sep 10, 2010", "userURL": "http://www.goodreads.com/user/show/2863914-j", "userReview": "I was all ready to hate this book. Doesn't it sound obnoxious? An adult novel about harrowing things, but narrated by a 5-year-old? Mere gimmickry, right, a showy writing experiment, likely to win praise from the easily impressed.But I don't think I am that easily impressed, and damn, this book is kind of a stunner. Because yes, if not handled exactly right, a book narrated by a child probably would be obnoxious. I haven't read Extremely Loud & Incredibly Close yet, and I might or might not like it, but I already know that it is written in the voice of a precocious 9-year-old, and precocious kids usually are pretty annoying. But Jack, the narrator of Room, is not really precocious, and Emma Donoghue has managed to capture a realistic child's voice without turning out a book that's overly simplistic or too calculated. And I really don't know how she did it. As you begin reading this story of a boy who has spent his entire life locked in one small room, the son of the unfortunate Ma (who is never named, because she's Ma), who was kidnapped and has been kept in the room for the last seven years, it does seem too cute: all the objects in Room are proper nouns with genders, like Floor and Bed and Duvet and Wardrobe, which kind of makes sense because to Jack, they are the only onlys of those things in the world, because the whole world is Room (he has a TV, which he thinks shows make-believe things that live on planets inside the TV). But I kept reading, and there's really remarkable depth to the story even though such a limited narrative scope. What really grabbed me is the way the book perfectly captures the malleability of a kid's mind, the way they take what they know and use it as a filter to interpret the stuff they encounter that they don't understand. I once read something by Stephen King that posited that all children are more or less clinically insane until about age seven, when those parts of their brain firm up and they stop coming up with ideas like, \"oh it got dark because a giant monster ate the sun.\" And of course, Emma Donoghue knows that we are not 5-year-olds, and she somehow manages to weave in all these staggeringly sad truths about the world, and growing up, and our relationships with our parents, and how fleeting time and relationships can be, all into the voice of this little boy who doesn't even realize what he's saying, but it doesn't feel crammed in, or like a cheat (the Magical Negro 5-Year-Old).I didn't say anything about the plot because I think it really helps to not know much beyond the premise going in (and it's one of those books I would really like to have read knowing absolutely nothing at all, but such is life). And yes, it's more of a heart book than a head book, but I don't think it is bad that sometimes books try to engage us in different ways. And certainly there's room, with this premise, for a different kind of book, almost a social satire, but that's not what we have here, and it's still quite an experience."}, {"userName": "Jesse (JesseTheReader)", "userReviewDate": "Aug 10, 2015", "userURL": "http://www.goodreads.com/user/show/8114361-jesse-jessethereader", "userReview": "Such a gripping and emotional read! I'm glad I finally took the chance to pick this up and read it."}, {"userName": "mark monday", "userReviewDate": "Sep 01, 2011", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "Jesus Christ on a popsicle stick, i can't believe i have to read this! argh. my colleague Michael (hopefully not a GR member) loaned this to me; clearly he knows that i am a \"reader\". but just as clearly he does not get that i like my books to have at least an edge of un-reality to them. you know, fantasy. horror. science fiction. historical fiction. and if not that, then just something, anything that moves them away from mainstream depictions of the modern real world. now Room looks like a snapshot of life right from the news. or right from my place of work! good grief, i deal with depressing enough stuff already goddamnit! reading the back cover description was like reading the label of a bottle of poison - i do not want to drink this. but fine, i respect you Michael and so i will read this one. just don't get mad if it takes me two months to get through this fucking thing. __________it took me over two weeks to finish the first half. i finished the second half during an afternoon and part of an evening. an amazing novel and a very emotional experience. i think i'll save writing a review for a little bit and let it sink in for a while.__________it's hard for me to define exactly why the first half of the novel was so hard to get through. at first i convinced myself that the child's perspective was just too \"hearbreakingly poignant\", and i am not the kind of person who is enthusiastic about reading works of heartbreaking poignance. but that is patently false; i love those kinds of books although i would never admit it openly. well, i'd say it in a GR review, but i would never say that out loud, if that makes sense. perhaps i'm a hypocrite that way. so then i convinced myself that there was just something wrong with the narrator's voice, something off, he just seemed - at different points - to be either too precocious or too simple for a child his age. i compared him a lot to my nephews, and it didn't gel - his thought process did not parallel their thought process. but then i thought about this kid's situation, the extreme sort of home-schooling he received, the protective wall that his amazing mom built for him, the way he interpreted the world...and it made sense, a whole lot of sense. his voice turned out to be a very real one for me, at least based upon my understanding of his young life.and so i realized that the reason i was avoiding coming back to Room's first half was more basic, more simple. it made me want to cry, all the time. perhaps i'm too soft, maybe i just have too thin a skin. it's not like i have any illusions about kids - they are not saints to me, nor are they just tiny adults. i'm comfortable around children and i prefer them to many adults i've met, but i don't idealize them either. however i do have a big natural urge to protect them. i'm not sure where that comes from; i don't think it's based on genetics or upbringing. and so it was just really hard to return again and again to a novel that had as its central situation the kind of thing that i try actively to never contemplate. as in, i'll turn the channel or put down the paper if i come across a story like this one. to be honest, each time i read a few lines of the first half, my eyes would well up a little, that shortness of breath thing happened - and often in public, on the bus, at a coffeeshop, reading at a lunch spot. the private world of this novel became a public experience to me. i avoided this book at first because i do not like to appear weak - to the world around me, or to myself.i told the guy who loaned me the book about my issues and was given some advice: just stick with it, it will open up and it will be beautiful. and so i did. and the book did. it was good advice.the first half of the book was beautiful as well. wonderfully written. but thank God, the second half really did open up. it was like taking a breath of wonderful, clean air, somewhere in nature, away from the city. the humor remained but it was transformed into something wry, something that was still poignant but with a sheen of sardonic humor that i appreciated (and, truth be told, perhaps had a level of distance to it that i rather lazily connected to as well). the anger i felt in the first half towards Old Nick was inchoate - the kind of blind rage that i feel towards anyone who'd harm a child. the anger i felt in the second half was of a kind that is more comfortable, more familiar - towards the media, towards pop psychology, towards various institutions and the like. the second half had lessons to be learned - lessons about perception and isolation and materialism and the family bond and the bond between mother & son, protector & protected. the simple fact of \"lessons to be learned\" made the second half so much easier to read, it made the narrative positively propulsive in my desire to learn what was going to happen next. the horribly (and needfully) static nature of the book's first half was replaced by an emotional dynamism that really grabbed me. again, this is not a critique of the first half, which i think was perfectly written. instead, it is a critique of my own ability to deal with challenging, terrifying situations involving kids - since i couldn't do anything to stop or even hurt Old Nick, i wanted only to look away. and so the second half turned out to be more of a familiar road, with familiar pleasures. the first half of the book was horribly unique and my mind balked. the second half eased me back into a world i could deal with, respond to, and not shut down. at the end of the second half, the end of the novel itself, i read those last few sentences over and again, closed the book, and cried. such a relief. it's funny to think of all the tears i had saved up."}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "This book was awful. Emotionless. Annoying.Look, I get it, it's quite difficult to write from the perspective of a 5-year old as a grown up. I can hardly remember what it was like being five, and I can't even begin to write from the POV of one. I do, however, know an enjoyable story when I see it, and I know when I'm annoyed. And I know that this book annoyed me greatly.The hallmark of any brilliant novel is the ability to make the reader empathize for the characters in the book. I want to be able to understand and experience the joy, suffering, frustration, anger, whatever it is that the main characters and the main narrators feel. I got none of that here, due in part to the emotional immaturity and lack of comprehension on the very young main characters' part, and in part due to my frustration and annoyance at the five year old narrator.The little boy's is haphazard, almost a stream of consciousness narration.\nI choose Meltedy Spoon with the white all blobby on his handle when he leaned on the pan of boiling pasta by accident. Ma doesn’t like Meltedy Spoon but he’s my favorite because he’s not the same.\nAnd I have to tell you, it is annoying as fuck. In that sense, maybe the book is fairly true to the depiction of kids, because to be honest, a lot of kids are pretty damn annoying to me.Maybe this kid is annoying because he doesn't know anything outside Room. Maybe he's immature because of his seclusion. Maybe this. Maybe that. I don't want to have to make excuses for the book's shortcomings.This book takes place in a room. Have you ever been locked up for an entire day in a room (without a computer or an iPhone for company?) It is as boring as it sounds, and this book is as boring as it sounds. But it's not boring because the mom has the kid and they love each other! That makes it awesome, right? Not for me. I have a little sister. She's 10 years younger than I am. Consequently, I had to put up with a hell of a lot of little kids growing up. They were intelligent, bright, precocious. I still couldn't stand their company. This book was hell.The story of Ma is pretty awful, because she's been kidnapped and raped and locked up. We got no sense of that. There is no emotion, there is no horror, there is no knowing what happened to her because the story is told from the perspective of a stupid little child. The choice of the narrator completely ruins what should have been a heart-wrenching tale."}, {"userName": "Stephen", "userReviewDate": "May 29, 2011", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "Healthy ambition is a laudable trait and I admire people willing to reach beyond their grasp in the attempt to achieve something special. \nI respect the author’s choice to write a dark-themed story narrated entirely from the perspective of a five year old boy. While the unreliable narrator is nothing new in literature, its deployment here felt fresh and so I give points for that. Unfortunately, that is about all I can give points for because the novel itself was a huge miss for me. Huge!! Obviously, the story is intended to be an emotional ordeal with its depiction of a young woman and her 5 year old son being held captive in a garden shack (the eponymous “Room”) by a sociopath named “Old Nick.” At the beginning of the story, the woman, who was 19 when she was abducted, has been in the Room for almost 10 years. Her son, Jack, just turned 5...you can do the math regarding Jack’s paternity. Neither of them has been outside the Room in all that time. This is dark stuff. This is uncomfortable stuff. This is a story about a horrible person doing horrible things. It should have punched me in the core and twisted me up in knots. Yet it never affected me. Now, if I was a cold, empathy-impaired individual, I might chalk up my lack of reaction to a simple case of “not my kind of story” and leave it at that. However, if you’ve read any of my reviews, you should have clued into the fact that I’m a deeply  some would say overly  emotional reader. Books move me, that’s why I read them. They make me laugh, cry, rage, exult…they make me feel. Yet, despite the highly charged subject matter of the story, no more than an occasional trickle of emotion ever filtered through to me from the page. Something was serious amiss in the delivery. Given my blasé reaction to the story, I began to suspect that the use of a child narrator was nothing more than a huge gimmick designed to help distinguish a story that otherwise had very little to recommend it. I know that's not the consensus opinion, but it's honestly how I felt. To be fair, it’s more likely that the use of Jack as the narrator, while an interesting plot device, simply presented too many serious challenges that the novel, unfortunately, was unable to successfully overcome. To the good, the author does a nice job of showing us the world of Room through the lens of Jack’s childhood perception. We learn how Jack has named and anthropomorphized every object in the room and thinks of them as his friends, and how he refers to each channel on the TV as a different planet. Initially, this is kind of cute, but it got old and decrepit in short order. The real problem for me was that Jack was too detached from the horror of his situation and it care-blocked the impact of the story on the reader…at least this reader. Children Jack’s age, while certainly able to show empathy, are generally so egocentric that any feelings of compassion for another’s pain are weak and undeveloped, being more about parroting behavior they’ve learned from caregivers than a true placing of themselves “in the shoes” of the other person. Unfortunately, this worked against my connection with the narrative. Jack’s happy-go-lucky outlook was too strong a filter between what I could tell was happening in the story and what I knew I was supposed to be feeling about it. Jack’s personal, subjective experience of his captivity is completely lacking in any sense of sadness or dread. This is because his mother does a wonderful job of sheltering him from the reality of their situation. However, Jack also doesn’t experience feelings of discomfort about the abuse that his mother is subjected to and this subtracts a great deal from the power of these scenes. Without his own internal sense of bewilderment, confinement or pain, much of the intended poignancy was lost on me. I knew I was supposed to feel something, but I didn't. That’s just me. If I had found the emotional tether that could have pulled me into the Room with Jack and his mother, my feelings for the book would have been much different. The writing is fine and the author’s ability to convincingly give voice to Jack was worthy of note. I just never found the necessary connection and that is a shame. I envy those of you that loved this as I was really looking forward to reading it. 2.0 stars."}, {"userName": "Wendy Darling", "userReviewDate": "Jan 25, 2011", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "[\"In the world I notice persons are nearly always stressed and have no time,\" for example, shows up towards the end. I also refuse to believe that any 5-year-old could go to a Natural History Museum and not be enthralled by the dinosaurs. (hide spoiler)]"}, {"userName": "Huda Yahya", "userReviewDate": "May 31, 2012", "userURL": "http://www.goodreads.com/user/show/7878381-huda-yahya", "userReview": "غرفة : عندما ترى العالم بعيون طفلفي كلِّ مكانٍ في العالم ستجد عيون طفلٍ متسعةتتلألأ فيها الرغبة في المعرفةوتشم فيه رائحة الخيال الجميل والمختلف في هذه الرواية ،هي أنّها يتم سردها عبر جاك الطفل الصغيروالسؤال هو كيف يمكن لبالغٍ أن يتحمل رواية كاملةبرؤية ،وبلغة طفل لم يرى ضوء الشمس لسنواته الخمس؟هنا تكمن براعة إيمااستطاعت أن تبقينا مشدودين مع هذا الطفل الظريف بلا مللبل ستندهش لرؤية العالم من خلال عيونه المندهشةفهي ليست عينا طفل عاديبل طفلٍ لم يعرف سوى شكل الغرفة التي عاش بهاولم يتصور عالماً غيرهايقول أنيس منصور كل شيئ عند الاطفال له وزن ، له قيمة ، له فائدة كُل شيئ مثلهم طفل مليان حياة وحماساً كلُّ شيئ يتحدث إليهموهكذا لم أشعر بقطرة ملل واحدةوأحببت جو الرواية كثيراًالوجه الآخر في القصة لفتاة شابة يتم اختطافها واغتصابها لسنوات في غرفة صغيرة وهي والدة جاك أو كما تدللـه Prince Jackerjack <3 في الليالي التي يقرر فيها نيك المغتصب\\والده المبيت في الغرفةينام جاك في خزانة الملابستحاول الفتاة ابتداع طرقٍ للتسرية عن إبنها المسكينفتخترع ألعاباً قدر ما تستطيع لتدخل البهجة إلى قلبهكالركض في دوائر، والقراءة ،والتلوين ،وممارسة الرياضةEverybody's damaged by somethingفي هذا المربع الصغير من الحزن ينمو جاك ،بذهن غافلٍ تماماً عن وجود عالمٍ خارجيفهناك الغرفة ، وعالم التلفاز حتى تقرر أمه الهرب فتبدأ في إخباره عن العالم الكبير الذي لم يعرفه قطلتبدأ مغامرة جاك المدهشة والشُجاعة ،لتحرير أمه المسكينة الرواية تتطرق أيضاً لما يطرأ على المخطوفين من تعلّق بخاطفيهمفتحاول الأم الانتحار بعد نجاتها ،،وتشعر ببعض الحنين إلى خاطفهاويحاول جاك مراراً العودة إلى الغرفة الصغيرة التي ألفهاخوفاً من العالم الخارجي الكبير جداً بالنسبة إليهThe world is always changing brightness and hotness and soundness, I never know how it's going to be the next minuteوشيئاً فشيئاً يعتاد الإثنان على العالم المجنون والواسع من جديدفي الحقيقة أمتعني جاك كثيراً بحواراته مع أمه ذكية وبريئة ومضحكةلم أتخيل أن تعجبني الرواية بهذه الطريقةولكن الطفل يعطيك دروساً لذيذة في الحياةويجعلك ترى الأشياء من حولك بنظرة مختلفةلم أشعر بالملل مع لغته الطفلة الظريفة بل كنت مبتسمة معظم الوقت حتّى مع لحظات الحزن والقلق والتشوق لمعرفة مصيره وأمه"}, {"userName": "Kemper", "userReviewDate": "Jan 06, 2011", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "“Hey, there Nick.”“Uh, hello.”“Nice day for working in the yard, isn’t it?”“Uh, yeah. Real nice.”“Say, that is a helluva shed you’re building there.”“It's nothing special.”“Oh, don’t be modest, Nick. It’s a real corker. It’s even got a skylight for some natural light. What are you going to be doing in there? A little artwork?”“Just, you know, projects…. and stuff.”“You got a central AC unit for it? Plus, I see you put some furniture and a fridge in there. If you were married, I’d think you were building a man cave to get away from the old-ball-and-chain, but since you’re single, I guess you’re just planning on spending a lot of time in that shed.”“Uh, yeah. Gonna be out here all the time. Doing…stuff.”“And just look at that steel door with the alarm pad. You’re aren’t going to have to worry about any kids breaking into that.”“Uh, yeah. I was worried about kids stealing my….stuff.”“Yep. No way, they’re getting in there. Didn’t I see you sheeting it in some kind of metal under the siding? Hell, Nick, you could probably lock someone in there like a prison cell. Ha ha!”“Uh, right. That’s a …funny idea.”“Well, see ya later, Nick. Swing by for a beer sometime.”7 Years Later“Well, officer, he was kind of quiet. Always kept to himself. Still can’t believe what he did in that shed. Who could have known that’s what he was doing out there?”************************************************* This seriously disturbing story is narrated by Jack and starts on his fifth birthday. Jack and his Ma share Room. He thinks of every object in Room like Rug or Plant or Meltdy Spoon as a friend to be treasured, and he and Ma spend every day doing their chores and playing games like Scream where they yell as loudly as they can. Jack loves his Ma and Room, but he’s scared of Old Nick who comes some nights and stays with Ma in Bed while Jack sleeps in Wardrobe. Jack’s Ma blows his mind by telling him that she used to live Outside, and that Old Nick stole her and brought her to Room seven years ago. She has a plan for them to get out of Room, but Jack can’t believe that the things he’s seen on the fuzzy TV screen for years are real. How can there be anything but him and Ma and Room?The premise for this book sounds like something that a Stephen King or Dean Koontz would have come up with, and it certainly works as a kind of horror novel as Jack’s innocent depiction of life inside Room shows Ma to be the victim of a horrible crime that she is trying to shield her son from. What makes this so chilling and heartbreaking is Jack’s view of the Room as the entire world, and he has so adapted to it that the very idea of real people existing outside of it is something akin to blasphemy to him.The writing here is exceptional, and Emma Donoghue makes what could be an over-the-top plot into a character based and all too plausible story. It’s creepy and chilling and terrible and intriguing and kind of sweet. Mostly, it's all kinds of messed up. Perhaps the most horrible thing about Room is that Old Nick doesn’t believe in providing books because there’s plenty of TV to watch, and poor Ma is stuck rereading a few paperbacks like Twilight and The DaVinci Code over and over. It’s a fate worse than death…."}, {"userName": "Tulpesh Patel", "userReviewDate": "Sep 29, 2010", "userURL": "http://www.goodreads.com/user/show/639407-tulpesh-patel", "userReview": "Based on, or ‘inspired by’ shocking cases like that of Josef Fritzl, Room is the story of a boy, Jack, born and raised with his captive mother in a 12 foot square room. Narrated by the boy himself, it’s a child’s eye view of a small world housing a great deal of imagination, pain and love. Packed with the emotional punch and occasional humour that comes with having a child narrator, comparisons will inevitably be drawn to John Boyne’s The Boy with the Striped Pyjamas. In my opinion, Room surpasses that book because the protagonist feels more real; Donoghue accomplishes the job of not only getting inside the head of a child, as Boyne very cleverly, but more cloyingly did, but she also has a protagonist who’s only experience of the world is a television with four fuzzy channels and his mother’s stories, which adds a whole new, tougher and more horrific, dimension.In describing the lives of these two captives in this tiny room, Donoghue exercise as much, if not more, imagination than creators of entire universes, like Tolkien. The tiny attention to detail paid to their room and Jack’s description of it, makes it an all too real and terrible place. It’s not really a plot-driven book, although I found my heart racing on several occasions, desperate to find out what happens to this dear, naive little boy. It is definitely a book that is difficult to write about with revealing spoiling for those who are yet to enjoy it. At its core I guess it’s about the indomitable human spirit, but there is a palpable sadness and desperation that makes gripping but painful reading. There is more violence contained in a muttered line about cork floorboards than a dozen Bret Easton Ellis novels put together, a true testament to Donoghue’s skill at creating empathy for Jack and his mother. Room definitely deserves its place on the Booker Prize short-list but it is far from perfect. The focus on the two central characters leaves others in the novel feeling like broadly painted caricatures. There are also some clever post-modern allusions to the cult of celebrity, which provide neat satire, but these are tangled with occasional moments, largely towards the end of the novel, where Jack’s voice feels a just a little too much like the author’s commentary on modern life, rather than simply Jack’s view of the world. I very much agree with the Audrey Niffenegger quote on the sleeve: “When it’s over you look up: the world looks the same but you are somehow different and that feeling lingers for days”. Several times since finishing the book I’ve wondered about the scale of my own world and what lies beyond it – having never seen them, are the Pyramids only TV?"}, {"userName": "Lola  Reviewer", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "You know how sometimes you struggle reading thick classic novels?Well next time you read Moby Dick, consider yourself lucky it isn’t Room, because this is the #1 most gruelling story I’ve ever (willingly or unwillingly) read.I know the narrator is five years old, so I shouldn’t hold it against him that he’s constantly distracted and rarely focuses on the important stuff (like the kidnapping part), but the truth is, there’s a reason why five-year-olds don’t publish books.Clearly this is a success, and the average rating is actually very high, considering how bad the writing is. I think the story is poignant and indeed deserved to be told, but not from the 1st person POV of a child.I managed to read more than half of it, and when I did reach the halfway point I became so happy I was closer to the end, but then I realized that I should never feel this way reading a book for pleasure.This book brought me no pleasure whatsoever. You want to be entertained and be kept on your toes? Read Gone Girl or The Girl on the Train, or anything else, really. Hell, read a classic! At this point, I don’t care what it is I read next as long as it’s not this book’s twin. Am I disappointed in myself that I wasn’t able to finish it? No because I think it’s very much okay to want to put a book down when said book is giving you a headache.I know what I like, and I know what I need, and this is not it. Goodbye, Jack. Maybe we’ll find each other again when you’re twenty instead of five. Also, I hope you’d have stopped talking about your ‘‘silly penis’’ that always stands up in the morning by then. Or is that too hard? Couldn’t resist. Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Jason", "userReviewDate": "Jun 18, 2011", "userURL": "http://www.goodreads.com/user/show/4426615-jason", "userReview": "Have you ever see that 1997 film Life Is Beautiful? No? Well, it’s about this Italian Jew who is sent to a concentration camp with his wife and son during World War II, and in order to shield his son from the horrors of war, he tells him that they are really just playing a super fun game and that everyone in the camp is a contestant. Not surprisingly, his son believes the whole thing (kids are pretty dumb, right?) and he is able to maintain this ruse right up until the Allied invasion. So, Room is kind of like that except without the Allied invasion. Here you’ve got this 5 year-old kid whose mother feeds him a pack of lies to prevent him from knowing the truth about their actual state of existence—which is that they are trapped in someone’s backyard shed and probably will never see the light of day again. My inclination is to mention what happens next, but then I think I would be doing the book a disservice. What I can say, however, is that the entire novel is narrated by the 5 year-old schmuck, and while this may sound like it could be annoying, it really isn’t. I enjoyed the unique perspective, especially since my engagement with the adult dynamics of the story was still somehow maintained. That’s a pretty impressive feat for an author.But at least 5 year-olds can be good for something: the “red couch in the TV planet with the puffy-hair lady that’s the boss asking questions and hundreds of other persons clapping” is by far the best description of The Oprah Winfrey Show I’ve ever heard."}, {"userName": "Deanna ", "userReviewDate": "Jul 27, 2015", "userURL": "http://www.goodreads.com/user/show/15662887-deanna", "userReview": "I read this book a couple of years ago and it remains a favorite. Hearing that it's being made into a movie is intriguing. I'm always excited/anxious when this happens as I worry that it will replace some of things I loved most about the book...if that makes sense. This book had such a hold on me that I finished it in two sittings. After I was done it was all I could think about for days and still think about quite often. Dora the Explorer was on TV as I was flipping channels the other day and I immediately thought of this novel again. Told from the point of view of five-year-old Jack (child-speak and all) was unexpected but ended up being wonderful. It took a little time (maybe 10 pages) to get used to following Jack's train of thought but after that it was easy. He stole my heart! I was drawn into their private world right from the beginning. Even though Ma is not a main voice in the novel a vivid picture is given from Jack's descriptions. I could feel the love she had for Jack while she struggled to keep it together for herself and her son. I was so impressed by her resourcefulness and how she even helps Jack somewhat thrive in a place she desperately wants to escape. An amazing and heart-wrenching story of love and survival. Although there is much dark subject matter I felt it was handled gently. My emotions were wrung out and it truly made me thankful for my freedom and the freedom of my child. It kept me tightly gripped and on the edge of my seat until the very end. Definitely an extremely riveting and powerful read that I highly recommend. Favorite quotes:“I don't like a clever toilet looking at our butts.” \"Before I didn't even know to be mad that we can't open Door, my head was too small to have Outside in it. When I was a little kid I thought like a little kid, but now I'm five I know everything.\""}, {"userName": "Cecily", "userReviewDate": "Sep 12, 2012", "userURL": "http://www.goodreads.com/user/show/1199525-cecily", "userReview": "THE GOOD, THE BAD, AND THE UGLY?This seems to be a real Marmite book (love it or loathe it, with no fence-sitting), so I'm going to mix my metaphors: I bit the bullet, to see which way the wind was blowing and was surprised to find myself sitting on the empty fence. I was very undecided about stars, but there are many much better books I've given 3*, so this gets 2*, even though there was, on reflection, more to it than I first thought. The quality of the writing is not sufficient for 3*.Overall, I think it’s poorly written (exacerbated by the way Donoghue tries to use unusual language for specific effect), but it is something of a page-turner, it’s quite a quick read (unless you overempathise, get depressed, and need a break) and it does contain some interesting ideas, especially in the second half about aspects of coping with “freedom” (though I am unsure how many are taken directly from news reports and interviews with former captives, and how many are her own).OVERVIEWThe situation is well-known: a twenty six year old woman, “Ma”, is living with her five year old son, Jack, in a tiny locked room. She has been there since she was abducted aged nineteen, and the story is narrated by Jack. They have daily visits from their captor, who brings meagre supplies, though they do have a TV and half a dozen books. Jack thinks reality is everything in their room, and that everything “in TV” is pretend.The first half of the book is set in Room (yes, with a capital letter and no article (“a” or “the”), like most of the few objects in their lives), and the second half is on the outside. It is clearly influenced by the recent news stories of Natasha Kampusch and Jaycee Lee Duggard etc, and that potentially prurient aspect did hold me back from reading this book for a long time. But I subsequently learned that Donoghue has said she was more influenced by the Fritzl case, which seems odd, because that was fundamentally different, as the abductor, imprisoner, and impregnator was the father of the young woman (more than one, initially).LANGUAGE AND WRITINGRight from the start, I found the narration annoying - not because it's by a 5-year old, but because he's such an unconvincing 5-year old. For example, he has a very good vocabulary for his age (fair enough), and yet there are a few really basic words that he seems not to know (instead of \"a man\" or \"the woman\" he refers to \"a he\" and \"the she\" - except on one occasion when he unaccountably gets it right), and he often gets irregular past tenses and word order wrong, in the way that children younger than five often do (“I winned”, “we knowed”, “I brung”, “why you don’t like” and to a driver, “may you go us please to…”). Furthermore, he repeatedly makes these errors despite his mother's diligence in correcting his grammar and the fact he watches TV. It’s almost as if you can see Donoghue weighing up the need for Jack to be intelligent and insightful enough to tell the story in an engaging way (which, to a large extent, he does) with the need to tick certain boxes to make it clear he is just a small child. Similarly, we’re expected to believe that Jack points out “a dog crossing a road with a human on a rope” and thinks someone lighting up is trying to set himself on fire, even though he’s had TV and a mother who has tried to teach him about the (fictitious) world.The fact Jack is still breastfed is not surprising: it’s comforting for both of them. What is surprising though is that the word itself seems to be taboo (instead, he talks about “having some”, without ever saying what), and yet he’s happy to use the words “penis” and “vagina”, and is open about bathing with his mother. That may sound like nit-picking, but it’s an example of the sort of thing that frustrated me. I just didn’t feel Donoghue had really thought it through thoroughly. If you’re going to play with language to make your point, you need to be able to do so convincingly.PLOTThe book is in five sections, though really it falls more naturally into two: inside and outside. The relationship between mother and son is touching and the book opens by establishing the routines and rituals of their restricted life, including the almost liturgical way they say “good night” to all their (few) possessions: “Good night, Room… good night, Rug” etc. The creativity required to raise a child in a confined space with such limited resources are impressive, too (they blow their eggs, so the whole shells can be threaded to make a snake, and do PE using their limited furniture as gym props).Initially, and in some ways, their life doesn’t seem as bad as you might expect, and even the first appearance of their captor (“Old Nick”) is relatively benign. That reflects the way Ma is raising Jack in the most positive way she can. Of course, we know something of the real horrors of the story, and they are discussed, though never in graphic detail, in part because Jack’s comprehension is limited, and in part because of Ma's success in shielding him from the nature of the situation.I thought the escape was badly done, but much better is the when, leading up to it, Ma has to explain to Jack that what he’s seen “in TV” is real. They go through a confusing process of “unlying” as she tries to prepare him for what might follow an escape. Once outside, it’s superficially about the practicalities of adjusting to the real world, but really it’s questioning the nature and price of freedom. I found this part had more interesting ideas, but contained more implausibility of plot (though I’m no expert in such matters) and very flat new characters. In particular, the method and speed with which the police locate Room was absurd, and also some of the logistics, practicalities and oversights of those charged with their care and settlement on the outside were dodgy, such as the first planned trip for these traumatised celebrities being to a museum with an uncle whom Jack had only met once!WHAT IS FREEDOM?The reader roots for Ma and Jack to escape, and they do (no spoiler – the book blurb tells you). Hooray! But of course they soon discover a new form of captivity: medical/psychiatric, hiding from fame, and so on. And this is where it gets interesting and starts to feel more plausible. Jack’s only knowledge of outside is from occasional TV programmes, and Ma’s is from seven years ago, when she was a carefree student, rather than a traumatised mother. Jack has to discover the world, and Ma has to (re)discover a new version of herself; she tells Jack, “I know you need me to be your ma but I’m having to remember how to be me as well”, to which he replies, “But I thought the her and the Ma were the same”. Similarly, having more, can leave one feeling impoverished: Jack is puzzled when Ma cautions him to be careful of something her brother gave to her, “I didn’t know it was hers-not-mine. In Room everything was ours.”Some of the things they struggle to cope with are not ones that would initially have occurred to me (germs, sunburn, stairs), and one effect is to make it almost as if Jack has acquired Asperger’s syndrome: he can’t filter the multiple stimuli of a busy world; doesn’t understand social conventions, etiquette, and privacy; is confused by relationships and pronouns (“The ‘you’ means Ma, not me, I’m getting good at telling”); takes common idioms literally (such as “I’m afraid so” and “get his act together”, but surely some cropped up from Ma and TV?); doesn’t like being touched or having to wear shoes; is borderline agoraphobic; increases his counting-his-teeth stress-relieving tactic; is uncoordinated from poor spatial perception; and feels insecure without routine. Jack asks, “But what’s the rule?”, to which he is told “There is no rule.” That’s a liberating idea to Ma, but scary to Jack. He misses Room and his few possessions because it’s all he’d ever known; Ma, understandably, wants to leave it all behind both literally and in even from conversation and memory. When he has nightmares, the doctor says “Now you’re safe, it’s [the brain] gathering up all those scary thoughts you don’t need any more, and throwing them out”, but Jack disagrees, “actually he’s got it backwards. In Room I was safe and Outside is the scary.”Another aspect is how Ma’s family react. The girl they knew – and thought dead – has been replaced by someone similar, but different, and they have Jack to contend with. Ma loves him unconditionally, despite his parentage, but if you were her mother or father, how would you feel about this constant reminder of what happened?To sum up, this wasn’t as prurient as I feared, and it was very thought-provoking, but it could have been SO much better.THE FILMThe only occasions I've preferred a film to the original book are where I didn't enjoy the book. I'm told the film of this is excellent, especially the boy who plays Jack. A couple of friends, who knew my reasons for disliking this, have almost persuaded me to see it. I don't think I'll pay money to watch it in the cinema, but once it's on TV, I might. With the right cast, and subtle direction and dialog, I may change my views of what should be a powerful story."}, {"userName": "Will Byrnes", "userReviewDate": "Nov 24, 2010", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "What makes up the world to five-year-old Jack, our window into life in Room? His mother for sure, a loving, very engaged 24/7 presence. Old Nick is an occasional visitor, although only glimpsed through the almost-closed doors of a wardrobe. A skylight allows Jack and Ma to see the sun, and sometimes the moon. A television offers a view on Outside, the world beyond Room. Jack and his 26-year-old mother get through their days with a strict schedule, a rich imaginative life and absolute love for each other. They need all those things. Jack has never seen the outside of their eleven-foot-square room. His mother has been held prisoner by a madman for seven years. One might think that it would be a strain to read an entire adult novel in the voice of such a young child. I felt trepidatious for a while, myself. But once I got used to the norms of Jack’s speech, the rest just flowed. A child and mother held prisoner for so long is nothing less than a horror story. It was uncomfortable to read, and reminded me of the feelings summoned by some of Stephen King’s scarier efforts. But Room is not just a tale of terror, of captivity and isolation. It delves into larger issues, particularly in the latter chapters. What is real? What is just an image seen on a TV screen? Are we better off, in some ways, to live in a world that has everything defined, ordered, secure, than having to cope with actual reality? Where does one draw that line? Room was inspired, at least in part, by actual, disturbing, events. In Austria, a young woman, Elizabeth Fritzl, was imprisoned for 24 years by her serial-rapist father, bearing him seven children. One of those died as a result of the evil father refusing to seek medical treatment for him. There are echoes of that event here. But while a real-life horror story may have been a basis for the book, Room is not a downer. It offers both the dark excitement of a scary story and a thoughtful look at what defines us as people. In contrast to the monstrous, Donaghue gives us an inspirational, loving parent in the same vein as Roberto Benigni’s Guido Orefice from It’s a Beautiful Life. Ma makes a real life for Jack. Donaghue offers a caustic look at contemporary media as well, presenting the media as severely truth-challenged and lacking in insight and ethics. A TV interviewer is insulting in her stupidity. I was convinced by the voice Donaghue gave Jack, the true strength of her writing here. But I found that towards the back end of the story, Jack started sounding much too grown-up, and was clearly serving as the author’s avatar. But for the vast majority of her book, Donaghue carries it off, amazingly. The story is compelling, the writing creative and effective. If you don’t make room for Room on your reading list, you won’t know Jack, and that would be a shame.In light of recent (2013) events in Ohio, this book should see a revival in interest.==============================EXTRA STUFF7/3/13 - I happened across Oprah selecting Room as one of eleven books to devour on a long flight."}, {"userName": "Whitney Atkinson", "userReviewDate": "Jul 22, 2016", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "This book was as interesting and twisted as I hoped it would be! The writing style was slightly jarring and I got one sentence into the audiobook before going NOPE (annoying child voice... argh), but I did end up enjoying it once I got further into it!This book's main selling point is that it's not just your average trauma story of being locked in isolation-- it's told through the eyes of a child, and that room is all he's known for his entire life. I went into this expecting almost a thriller, a \"will they get out of that situation???\" type of storyline, but I was wrong. This follows more of a \"can they get out, and when they do, can they live normally in the outside world after being locked up for so long?\" And I liked that version more than I thought I would. Although half way through this book it wrapped itself up and felt very weird to continue onward, I did enjoy seeing the character progress throughout the end of the book, and although I wish we could have seen from someone other than Jack's perspective (he got exhausting and frustrating after a while), I think this would be a REALLY good book to discuss amongst friends and I'm sure the movie is very jarring.There were certain points that gave me chills so bad that I had to put the book down, just because the severity of what these characters went through was so chilling, and all of it is undermined by the fact that the entire thing is told from the perspective of someone that's too young to understand. I just think this book brings up great controversies, was a tragic story of a mother and son who had to go through hell, and it was just as gripping and unforgettable as I hoped it would be. My only complaint is the pacing throughout the middle of it, and Jack's voice growing irritating after a while."}, {"userName": "Mohammed Arabey", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "A Book Room to Remember.. Definitely will change how you see the world after leaving it.قصة، بل حجرة ما أن تخرج منها ستتغير نظرتك للعالمAs Jack saying Good-bye, Room., I felt really sad leaving..I became a \"Roomer\".. As Jack & his Ma.\n“When I was a little kid I thought like a little kid, but now I'm five I know everything.”\nOur Amazing Narrator, Jack, when he turned five he learns a shocking truth about his whole 5-years life..“Jack, Yer a wizard captive.”Yes, he has been born in Room where his Ma been captive for seven years by the maniac \"Old Nick\" - which is BTW a nickname for the Devil in Christianity in the 17th century-.He's never been outside... all his life with his Ma in Room, and frequent visits of Old Nick who brung brought them their basic needs.. and Sunday Treats..Room is all his real world.. it doesn't even has windows, just a skylight.. that's all what he can see of outside.For him Outside is not real, is outer-space, fantasy .. is just TV.\n“When I was four I thought everything in TV was just TV, then I was five and Ma unlied about lots of it being pictures of real and Outside being totally real. Now I’m in Outside but it turns out lots of it isn’t real at all.”\n\nThe First Half\n of the novel is how this miserable life is going on... but no matter how miserable, when you see it with the eyes of 5 years old Roomer like sweet great smart Jack..it's so fun, it's so good...yet my heart ached a lot..You'll feel how amazing job the Ma did to make Jack smart, well educated, healthy, have a fine Art touch, Eating well...Reading well too..His Ma is simply the best Ma in the World.....\n“You know who you belong to, Jack?”“Yeah.”“Yourself.”He’s wrong, actually, I belong to Ma.”\nYou'll see how this week of his 5th Birthday goes on.. in amazing Wide-Eye Jack's narrating.. till he's whole life changes..This First part may feel irritating for some.. but really the amazing narrating of Jack made me love it so much.. it's may be slow but I felt fun slow reading it.Wait, I hear you feel it's weird case anyway..hard to believe..You'll be shocked when you hear there's cases like this really happens.. haven't you read Elisabeth Fritzl's case before?\n“All this reverential—I’m not a saint.” Ma’s voice is getting loud again. “I wish people would stop treating us like we’re the only ones who ever lived through something terrible. I’ve been finding stuff on the Internet you wouldn’t believe.” \nAnyway, \nThe Second Half\n is faster and full of changes...\n“The world is always changing brightness and hotness and soundness, I never know how it’s going to be the next minute.” \nI won't spoil it to you... but despite how crazy everything happens in the middle of the novel, it's hard to think of alternate way out.. it was the thrilling part that made me literally on the edge of Chair reading it..And it's brilliant seeing the novel in two halves, this second half Jack's narrating is shocked seeing how wide,wild World can be...\n\"Want to go to Bed.\"\"They'll find us somewhere to sleep in a little while.\" \"No. Bed.\"\"You mean in Room?\" Ma's pulled back, she's staring in my eyes.\"Yeah. I've seen the world and I'm tired now.” \nHe's may be 5 years old, A Roomer, but he's totally right about the world..How we never have time for any thing...\n“In the world I notice persons are nearly always stressed and have no time. Even Grandma often says that, but she and Steppa don't have jobs, so I don't know how persons with jobs do the jobs and all the living as well.In Room me and Ma had time for everything. I guess the time gets spread very thin like butter all over the world, the roads and houses and playgrounds and stores, so there's only a little smear of time on each place, then everyone has to hurry on to the next bit....” \nHow we really care less than we think..\n“Also everywhere I'm looking at kids, adults mostly don't seem to like them, not even the parents do. They call the kids gorgeous and so cute, they make the kids do the thing all over again so they can take a photo, but they don't want to actually play with them, they'd rather drink coffee talking to other adults. Sometimes there's a small kid crying and the Ma of it doesn't even hear.”\nHow we pretend..all the time on many things.\n“When I was four I thought everything in TV was just TV, then I was five and Ma unlied about lots of it being totally real. Now I'm in Outside but it turns out lots of it isn't real at all.” \nHow Cruel our world can be....\n“But the thing is, slavery’s not a new invention. And solitary confinement—did you know, in America we’ve got more than twenty-five thousand prisoners in isolation cells?” \nHow Sad we're judging people without a clue of their own lives.. It's really sad.. and how Crazy and obsessed people are sometimes..\n“Ah, you asked why, Jack? Because there's a lot of crazies out there.”I thought the crazies were in here in the Clinic getting helped.\nThe Bottom LineIt will really make you think deeper into our \"Huge Room\" we're locked into..To think twice before judging anyone..To just go hug your mom so passionately and just keep saying Thank you.... to Hug your kid and really care for everything they say or want.The strange kidnapping here was not real, but it's not totally strange from our crazy world...There's even more misery in this world not just in captive...but just more than what Jack and his Ma been into..even crueler and crueler..\n“Stories are a different kind of true.” \nI really didn't want to finish this book, this super sweet or supweet -as Jack and his Ma likes to make words sandwiches- narrating of the smart Scave \"will forever be more brave than scared\" Jack, who brung brought us this amazing story.. with his deep 5 years -and three weeks and half's wisdom...and his funny idioms.\n“'... where there's one there's ten.'That's crazy math.“I bang my head on a faucet. “Careful.”Why do persons only say that after the hurt?\nThis story really can make you feel something wrong...something missing on our way we live..\n“Everybody's damaged by something.” \nBut that's simply how good novels are..\n“Really, a novel does not exist, does not happen, until readers pour their own lives into it.” \nSo finally, So Good-bye, Jack..Good-bye, Jack's Ma..Good-bye, Grandma, Steppa.Good-bye, Dr.Clay, Noreen, Officer Oh :).Good-bye, Paul,Deanna, Bryanna.Good-bye, Dylan The Dagger, Alice, Books.Good-bye, Bed, Rug, Duvet, Rocker, Table, Sink, Bath, Cabinet & Wardrobe.Good-bye, Walls..Good-bye, Room.....Good-bye, Book.Mohammed ArabeyFrom 10 May 2017To 18 May 2017"}, {"userName": "Amalia Gavea", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/56789747-amalia-gavea", "userReview": "[describe the events that followed their escape. She shows that their life couldn't become normal just like that, she paints a rather difficult, unsettling account of their struggle to come to terms with a life that, thankfully, most of us consider a given. (hide spoiler)]"}, {"userName": "La Petite Américaine", "userReviewDate": "Jan 18, 2011", "userURL": "http://www.goodreads.com/user/show/59329-la-petite-am-ricaine", "userReview": "Room has been called \"remarkable,\" and \"sensational.\" It was not only shortlisted for the Booker Prize, but it was also chosen as a Favorite Book of 2010 by our fair goodreads community, proving once again that heads are up asses in of literary critics and readers everywhere. How this book is anything but blither is beyond me. The reality is that the plot for this book was ripped from the headlines, based on the stories of Jaycee Dugard, Natascha Kampusch, and the Fritzl family. Emma Donoghue was given a $2 million advance to write Room. With cash in hand and only a plot outline, clearly no one gave a shit if the final work were good or not. What a better way to save face than to tout a piece of crap book you actually paid someone to write as a \"gem.\" UGH. In the end, all we have is yet another author exploiting and getting rich off of the real life tragedies of others. I suppose I wouldn't mind so much -- hey, I may even cheer it on -- if it were done well. In this case, it was done horribly. You see, if you truly do want to hear the blabbering of a 5 year-old for 300 pages, then you immediately need to change careers and become a kindergarten teacher. Look. It takes talent to write in the voice of a child, which is precisely why so few authors are successful at it. When a good author writes from a child's perspective, the book becomes a classic. Think about it. J.D. Salinger, Harper Lee, Roald Dahl, and James Joyce. As for the rest of them? The child narrator is nothing more than a laughable gimmick. Emma Donoghue falls flat on her face -- and drags us down with her -- for an entire novel with that very gimmick. I don't have patience for \"silly penis is always standing up in the morning. I push him down,\" nor \"penis floats,\" and especially not \"my poo is hard to push out.\" I don't care for rambling recounts of Dylan the Digger and Dora the Explorer, either. Further, I found it odd that a child who is remarkably well-versed in the narrative would have such huge inconsistencies in his spoken English, many times sounding like a 3 year-old while at other times having perfect grammar. Huh? Finally, I got rather annoyed by Capitalizing Nouns and Other Objects in the Room, I found it Distracting and Annoying, and to me it screams Piss Poor Writer. Don't forget to throw in some of Donoghue's own politics for fun: our 5 year-old is still breastfeeding and he loves to tell us which boob produces the creamiest milk. Don't be disgusted. After all, it's natural! And let's not forget the most blatant and frankly, lame, self-insertion by an author into her own novel: Noreen is a kind and clever nurse who hails from merry ol' Ireland, just like our author. BARF. Forgive me for not passionately hating this book more. Quite simply, it bored the hell out of me. I spent half the time wishing someone would throw the narrator back in the room so he'd shut the hell up. I spent the other half wanting to slap Donoghue's publishers. Suffice to say....SUCKED."}, {"userName": "Michelle", "userReviewDate": "Nov 03, 2011", "userURL": "http://www.goodreads.com/user/show/512643-michelle", "userReview": "This book didn't have a chance with me.1. It was written from the perspective of a five-year-old boy.2. For the first two thirds of the book the kid was annoying.3. The mom breastfeeds the kid a lot. I counted twelve times before I stopped counting. The kid creeped me out by talking about which boob tasted better.Why read it? It was this month's selection for a book club I am part of. It wasn't my pick.Why two stars rather than one? Well, I'll be damned if I didn't start to feel sorry for the poor kid and like him despite myself. A writer who can do that to me deserves an extra star."}, {"userName": "Mith", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/3620424-mith", "userReview": "ARGH! NO! NO! NO! IF I HAVE TO READ ONE MORE ASININE CHAPTER, WRITTEN FROM A FIVE-YEAR OLD'S POV, ON THE MUNDANE THINGS THEY DO IN THE ROOM ALL DAY, WITHOUT HAVING THE PLOT PROGRESS EVEN REMOTELY, I'LL... I'LL..."}, {"userName": "Annalisa", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/542037-annalisa", "userReview": "[I loved that the book wasn't just about captivity but about the psychological impact upon release too. The news that these stories are based on focus on the horrors of the crime and not on the adjustment afterwards. In many ways Jack was an infant encountering the world for the first time. Donoghue takes us there. My favorite of these new moments was Jack's haircut. (hide spoiler)]"}, {"userName": "Steph", "userReviewDate": "Sep 15, 2010", "userURL": "http://www.goodreads.com/user/show/3192797-steph", "userReview": "A novel narrated by a five year old? I'm not a kid person at all so do not think you need to be a mother to appreciate this story. There is something about Jack's way of looking at Room and at Outside that is refreshing instead of irritating. It's nice to not be dragged down by all the complexities of an adult narrator for a change and I know I would have given this story less stars if it were told through his mother's eyes. This is a story that Jack needed to tell and I am very happy that he did."}, {"userName": "Luffy", "userReviewDate": "Dec 05, 2016", "userURL": "http://www.goodreads.com/user/show/7407364-luffy", "userReview": "I willed myself to read this particular book in double quick time. I won't say what happens in the end, but the ending was dependent on the second half of the book, where we got to know one of the two main characters in the book.There is Jack, and then his mother. Curiously enough, Jack is the narrator, and his POV is unique. He lends strength to his mother, he makes her shine with her patience, her fortitude, and her bravery. I have yet to watch the movie version, but it's no coincidence that the actress playing the role of Ma, Brie Larson, got the oscar for best actress this year.Jack is sometimes gullible sometimes not. Sometimes he expresses curiosity. The latter sentiment is the driving force behind a child's growth. Us adults lose something when we have understood our version of the Room. We are not impressed by a child's sense of wonder. This book, I believe, addresses this case, among many others. Room is a must read."}, {"userName": "Maureen", "userReviewDate": "Feb 22, 2016", "userURL": "http://www.goodreads.com/user/show/10762033-maureen", "userReview": "Wow is all I can say about this book.It's told from a (very smart) 5 year old's perspective but it is so powerful and moving and great.Now I need to watch the movie, where I know I'll definitely cry."}, {"userName": "Aneela ♒the_mystique_reader♒", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/29923106-aneela-the-mystique-reader", "userReview": "RTC"}, {"userName": "karen", "userReviewDate": "Jan 21, 2011", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "here's a confession:if i voted for your review of this book before today, i had not fucking read it. oops, sorry! (upon quickfast, sherlockian investigation, i now know that only means two of you - and i read the first half of both of them before, i swear, and have now read them in their entireties) but i didn't want anything spoilt for me. i didn't want to know if the book was triumphant or devastating or funny or tragic or philosophical or melodramatic. i wanted the tone to be surprising, i wanted to avoid preconceived notions.and hurrah - i got what i wanted.now i am considering your feelings. do i think you (collective, anonymous) would benefit from a similar experience? do i dare presume? i do, but...but i will discuss it in what i hope will be an oblique way. if you don't know the plot of this book by now, after all the hype and acclaim, you have yourself probably been living in an 11x11 room held captive by a bad man. despite its being told entirely in the voice of an extremely sheltered five-year-old boy, it is more a meditation on motherhood and necessity and where the separation occurs between mother and child; what is the act that cleaves mother from child and allows each to lead their own individual lives? and where is the line between protection and deprivation? and what can be done with unwanted eggshells?this book is excellent.but i don't want to get too caught up in possible rooners. i myself want you to be like nell,  all pure and speaking your own bizarre stroke-language, not knowing anything about the greater world, where this book exists. in this scenario, i am the baaaad man.and i am okay with that."}, {"userName": "Suzanne", "userReviewDate": "Aug 01, 2015", "userURL": "http://www.goodreads.com/user/show/11889829-suzanne", "userReview": "This was a remarkable book. Obviously this concept has sprung from a real life situation, but to be based on its own merit, I think this is a piece of work to be applauded. The characteristics from this poor little boy, and the way in which his mum dealt with her limited situation was captured with, how do I say, accuracy.. it was very skilfully implemented. I was impressed with this work and can see it had the merit to have been a short list selection for the Man Booker Prize. How would I know what this would be like? I loved the physical and mental exercise that mum and son did together to keep Jack's body and spirit alive. As for the movie, I think I'd like to see it, in fact I am looking forward to it. I found the relationship between this mother and son to be lovely and real; one to be learned from. Recommended reading, which to be fair perhaps I should mention this was a book that many people did not like, and I noticed from here on GR that many gave up and did not finish. I really did like this. Glad I slotted it in to my ever growing supply of books. I love this conundrum!"}, {"userName": "Matthew", "userReviewDate": "Mar 05, 2014", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "This is a book about hopelessness, the dawning of hope, ultimate terror, and rebuilding. What happens in these pages is terrifyingly possible as can be seen in news stories that crop up from time to time about a twisted person who has someone locked in their basement/backyard for years. When I think about that, I get chills with the realization that somewhere in the world right now - even close to home - there might be someone going through exactly what is happening in this book.Read if you like heart-wrenching, super-suspenseful, could-happen in-real-life stories. This one will leave you exhausted!"}, {"userName": "F", "userReviewDate": "Apr 24, 2012", "userURL": "http://www.goodreads.com/user/show/8161922-f", "userReview": "I loved this book.Heard so much about it before I finally picked it up.Really unique perspective."}], "description": "To five-year-old Jack, Room is the entire world. It is where he was born and grew up; it's where he lives with his Ma as they learn and read and eat and sleep and play. At night, his Ma shuts him safely in the wardrobe, where he is meant to be asleep when Old Nick visits.Room is home to Jack, but to Ma, it is the prison where Old Nick has held her captive for seven years. Through determination, ingenuity, and fierce motherly love, Ma has created a life for Jack. But she knows it's not enough...not for her or for him. She devises a bold escape plan, one that relies on her young son's bravery and a lot of luck. What she does not realize is just how unprepared she is for the plan to actually work.Told entirely in the language of the energetic, pragmatic five-year-old Jack, ROOM is a celebration of resilience and the limitless bond between parent and child, a brilliantly executed novel about what it means to journey from one world to another.", "title": "Room", "url": "http://www.goodreads.com/book/show/7989156-room", "average": 4.04, "cover": "https://images.gr-assets.com/books/1344265049l/7989156.jpg", "reviews": 43863, "authors": [{"url": "https://www.goodreads.com/author/show/23613.Emma_Donoghue", "name": "Emma Donoghue"}, {"url": "https://www.goodreads.com/author/show/3466686.Michal_Friedman", "name": "Michal Friedman"}, {"url": "https://www.goodreads.com/author/show/131742.Ellen_Archer", "name": "Ellen Archer"}, {"url": "https://www.goodreads.com/author/show/315737.Suzanne_Toren", "name": "Suzanne Toren"}, {"url": "https://www.goodreads.com/author/show/2889695.Robert_Petkoff", "name": "Robert Petkoff"}], "type": ["Fiction", "Contemporary", "Adult", "Adult Fiction"], "outlinks": ["http://www.goodreads.com/book/show/7989156-room", "http://www.goodreads.com/book/show/7937843-room", "http://www.goodreads.com/book/show/7989157-room", "http://www.goodreads.com/book/show/9691607-room", "http://www.goodreads.com/book/show/25820251-room", "http://www.goodreads.com/book/show/8717323-room", "http://www.goodreads.com/book/show/28449257-the-wonder", "http://www.goodreads.com/book/show/18295858-frog-music", "http://www.goodreads.com/book/show/44543.Slammerkin", "http://www.goodreads.com/book/show/44537.Kissing_the_Witch", "http://www.goodreads.com/book/show/13366241-astray"]}