{"ratings": 25486, "userreviews": [{"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "2/7/18 - ON SALE for $1.99: \nhttp://amzn.to/2fFn8pCReviewed by: Rabid ReadsThere are two things I want to tell you in advance:1. \nOctober Daye\n is one of my Top 5 Favorite UF Series.2. The first time I tried to read ROSEMARY AND RUE, I DNF-ed it.YEP. I did.I didn't pick it up again for a couple of years, and when I did, it was b/c DESPERATE for new UF.So I was more patient . . . Which was good, b/c I made it past the '90s flashback of a prologue, and the depths-of-despair aftermath that had initially put me off. You: Yeah, but how long did that take? How far do I have to get into the book before I get to the \"good part\"?Me: I'm SO glad you asked! I didn't even have to finish the first chapter before things got interesting. *waves at Tybalt* Once he showed up, it was easy to push through the next couple of chapters, then Toby was back in thick of things. *orbit gum smile*October Daye is a changeling, or part fae/part human. She lives mostly with the humans, or has for awhile now. She has a human fiancé, and together they have a daughter. It's that \"mostly\" that destroys her world. When a powerful fae's wife and daughter are kidnapped, he recruits Toby for her PI skills to find them. She's worked similar jobs for fae before, but as a changeling, her abilities are flimsy compared to those of a full-blooded fae, so when she finds what she's looking for, she taps out. She calls in reinforcements to handle any takedowns or wrangling of pureblooded fae villains.But this time . . . she doesn't. Sylvester Torquill is her friend, as is his wife, and their daughter is near the same age as her own, so when she tracks down the culprit, instead of leaving to report in, she stays . . . And gets transfigured into a koi, and spends the next FOURTEEN YEARS of her life swimming in one of the ponds in Golden Gate Park's Tea Gardens.Eventually, she regains her humanity, but she's lost everything she cared about--her fiancé is with another woman, her daughter is nearly grown, and both believe she abandoned them--the world is unrecognizable (her last cell phone was the size of a 12oz soda can), and, well . . . She's MAD. And defeated. And plagued with guilt and remorse. But the anger is there, even if she's buried it under six feet of avoidance, and an angry Toby makes for an infinitely more interesting Toby than a woe-is-me Toby. Like when she's driving home from a meeting with the duke only to find a fae assassin in her backseat:\n“What the—?” demanded a voice from the back...“It’s called reckless driving, asshole!”“...You’re going to kill us both!” “That’s the idea!” It was actually fun, in a fatalistic sort of way. I smiled grimly as we wove in and out of traffic, watching the near misses become less miss and more near. There’s nothing like a good high-speed car chase to get the evening started off right.\nSounds fun to me . . . *winks*Which brings me to how fantastic McGuire's writing is across the board--not only is this series about fae, but her style embodies the very faeness that makes them my FAEvorite:\nI’ve never been good at shadow-weaving or fire-work, but give me a thick veil of water vapor and I can manage the basics. This time my aim was clarity: water’s excellent for scrying, and fog is just water that’s forgotten its beginnings.\nThen there are the various types of fae:\nA black horse stood by the curb in the deepest part of the shadow, the smell of debris masking its characteristic blood-and-seaweed scent. Its eyes were red, and the look it gave me was inviting, promising wild adventures and fantastic delights if I’d just get onto its back.\n*backs away from kelpie*And let's not forget the wonderfully clever world-building:\n...the electronic age has broadened the horizons of magical fraud to an astonishing degree. Faerie gold can be used for more than just party tricks; it works pretty well on the stock market, for example, where money’s an illusion anyway.\nDo you see why I'm hooked?ROSEMARY AND RUE is the first installment of Seanan McGuire's OCTOBER DAYE series, and it is the full package. Our heroine has taken some hard knocks, but she doesn't let it keep her down. She keeps pushing, and fighting, and pursuing, b/c what she's been tasked to do matters, and anything else is quitter talk. The world is fae, the characters are fae, the tone is fae . . . I love it. Highly recommended.3/9/16: Impromptu buddy read with \nJo\n and maybe (HOPEFULLY) \nRobin\n in \nBB&B\n! B/c Urban Fantasy, we NEEDS it. Plus, you know, this is one of my Top 5 UF series . . . FYI ;)My other reviews for this series:\nA Local Habitation (October Daye, #2)\n\nAn Artificial Night (October Daye, #3)\n\nLate Eclipses (October Daye, #4)\n\nOne Salt Sea (October Daye, #5)\n\nAshes of Honor (October Daye, #6)\n\nChimes at Midnight (October Daye, #7)\n\nThe Winter Long (October Daye, #8)\n\nA Red-Rose Chain (October Daye, #9)\n\nOnce Broken Faith (October Daye, #10)"}, {"userName": "Anne", "userReviewDate": "Oct 23, 2009", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "[That's only KINDA true. I swear! (hide spoiler)]"}, {"userName": "✘✘ Sarah ✘✘ (former Nefarious Breeder of Murderous Crustaceans)", "userReviewDate": "Oct 08, 2014", "userURL": "http://www.goodreads.com/user/show/7298986-sarah-former-nefarious-breeder-of-murderous-crustaceans", "userReview": "[ (hide spoiler)]"}, {"userName": "Katie(babs)", "userReviewDate": "Sep 29, 2009", "userURL": "http://www.goodreads.com/user/show/179852-katie-babs", "userReview": "The year is 1995 and October “Toby” Daye is on a stake out. Toby is engaged to Cliff, a human. She and Cliff also have a little girl named Gilly. They think she is a private detective who works cases dealing with deadbeat dads. But, Toby keeps a very big secret from them. She is a half-human, half-fae working on a very special case that deals with her liege, Duke Sylvester. Sylvester’s twin brother Simon vanished without at trace along with Duke’s wife, Duchess Luna and their daughter Rayseline. Because Toby loves and respects the Duke, she will try and find his wife and daughter.Toby is able to find Simon in the San Francisco Japanese Tea Gardens. There Toby comes across Simon and another creature that is half Tuatha de Dannan and half Peri. Toby is wary of this Peri because they are a race that likes to cause pain. Toby watches as these two embrace as lovers would and before Toby can confront them or go for help, Simon locates her. Because Simon is too powerful for Toby, he transforms her into a koi, which is a type of fish, where she will remain in the Japanese Tea Garden pond for fourteen years.Fourteen years later the curse has been broken and Toby has turned her back on the fae. Cliff and her daughter refuse to have anything to do with Toby because she was missing for so long. Toby walks around in a daze, working nights at a grocery store, remaining invisible and trying to be as human as possible. But the fae and those creatures that inhabit this world are all around her. Toby will have no choice but to enter back into the world that so ruthlessly destroyed her.The reason is because one of Toby's friends, Evening, the Countess of one of San Francisco’s smaller fiefdoms needs Toby’s help. She left a few messages on Toby’s answering machine, which Toby ignored. But when one of the messages is a binding spell, Toby has no choice but to do what Evening orders. Evening knows she will be murdered and leaves it up to Toby to find out who has killed her.Toby must confront her past and those who have cherished her as well as ruined her life. She must walk among the most evil and treacherous of all faeries even if it means placing her own life in danger once again.Seanan McGuire’s Rosemary and Rue has one of the best prologues I have read in recent memory. I have never read one where the main protagonist is transformed into a fish and left to suffer that way Toby does. After the first twelve pages, I was expecting a rip roaring fantasy story that would keep me hooked till the very end. I made it all the way to page two-hundred and put the book down because there isn’t much to recommend here.The main problem I had with Rosemary and Rue was page after page of info dumping and needless internal dialogue. At one point I thought, there has to be more to this. Something exciting has to happen. It doesn’t. There is really no action to speak of within these pages. My main problem is that there is too much telling and not enough showing. We see Toby basically sleep walking thorough each scene where we meet so many people from her past for no other reason that I can think of. We are introduced to her old lover Devin, who is some sort Oliver Twist Fagin type, but he at least bathes and is much sexier. He surrounds himself by teens he may or may not have sexual hankie panky with known as the Lost Children a.k.a Devin’s kids. Why do we meet Devin? Just to add some emotional angst for Toby because before she was with her human lover Cliff, she was with Devin.We meet Sylvester who Toby seems to still respect but can’t stand at the same time. Could she possibly still have residual feelings because Sylvester was the one to have her investigate his missing wife and child that took fourteen years away of her life? His wife and daughter were returned safe and sound and Toby never once confronts these people as to where they were or wanting revenge against Simon who gave her gills. And by the way Simon is MIA the whole time. You would think after she escaped the pond she would go searching for Simon and get her revenge. You would also think those friends of Toby would want revenge for her or would aid in her fight against Simon. That never happens.We never meet Cliff or Gilly because for reasons I can’t think of, they feel betrayed by Toby. When I read this, I was very confused. Your fiancé has been missing for fourteen years and when you're told she has been found, you feel she is a deadbeat who ran out on you and you daughter? What? Wouldn't he run into her arms and cry tears of happiness that his love has come back to him safe and sound? And what's up with Toby who seems to love Cliff and Gilly so much, but only calls Cliff on the phone but never goes to see him? Of course this scenario is never shown. It is glossed over because Toby tells the reader. We are told not shown. And don’t get me started on why Toby and Cliff never married before she disappeared. That in itself doesn’t make sense. Why? It is another case of Toby telling the reader but not giving much explanation on why.Many things that Toby does is told and told some more. Pages upon pages of long winded paragraphs with faery terminology and a What’s Who of important faery creatures are mentioned from Toby. But hey, every so often Toby investigates dangerous places and mutters a few spells and meets even more fantasy like creatures. Toby waxes on and on about them, who they are, what they can do and that is all. I felt like I was reading an encyclopedia instead of a fictional story.Toby is very much the underdog here and her life has been a horrible one. I guess I was supposed to be sympathetic to her plight, but I just found her to be too pitiful with no spine. Toby is hurt, angry and feeling betrayed. Why wouldn’t she channel this anger and kick some ass and take some names? Toby came across as too much of a sad sack, a woes is me I need some major therapy; leave me with my cats in the dark of my apartment I can barely afford because I work at Safeway.Everything about Rosemary and Rue fell so flat. I wanted to shake some sense into Toby. Instead I felt no connection and left her to her grief where I rolled my eyes and moved onto something with more substance that will stick to the basics of writing where one will show not tell."}, {"userName": "Alp", "userReviewDate": "May 07, 2016", "userURL": "http://www.goodreads.com/user/show/26653561-alp", "userReview": "[the one she fully trusted (hide spoiler)]"}, {"userName": "Robin (Bridge Four)", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/14105531-robin-bridge-four", "userReview": "Sale Alert 9/30/17: The first book in this series wasn't my favorite but it did grow on me later about book 3 or 4. You can get this for $1.99 on AmazonRead with Buddies Books & Baubles impromptu like because Jessica and Joanita are pushers.See below ↘This is a solid first installment to a series. It is also not what I thought it was going to be. I say this as my book BFF creatively found a way for me to jump into the read of this series with her. I trust her on this because we have pretty similar book tastes but here is the part I wasn’t expecting. Toby is a bit dark, the entire book is a bit dark and I somehow thought eventually it would get a little lighter….but it really doesn’t.Urban Fantasy….well I’m pretty much a fan of it and I’ve read a few different series now in this genre that are clearly UF and not PRN. But I’m just going to say that in my limited experience most UF clearly has a very quippy, snarky side like Buffy the Vampire Slayer. I think of UF and I totally think of some of the more popular series like Kate Daniels, Mercy Thompson, Dresden, and The Iron Druid. While all of them have some serious moments there is a lot of quick wit and quirky humor along the way to cut through some of that. October Daye is a bit rougher and there isn’t a ton of humor to cover up how dark it can get.I see the ratings and can see why some of my friends are torn or gave up before finishing this book. There is quite a bit going on and I think that there are some things that I’d only pick up the second time through when I could drop back and enjoy the language and characters a little more instead of picking up all the story.╰⊰✿ The Good Stuff ✿⊱╮ஐ – The writing is really well done. There are just some great moments where I really just enjoyed the writing. Statements like:\n “We hated each other so well and loved each other so badly...”And  “He changes when there's a threat to be overcome: it's like he pulls on a second skin, one he almost forgets the rest of the time, and becomes a hero again. A tired, old hero, one who wields a pen instead of a sword and rides waves of paperwork rather than a white charger, but still a hero.”\n ஐ – Toby, she is the underdog that I want to root for. She is smart and a changling so she doesn’t really fit into the human or the Fae world completely. She has one foot in and another foot out never really belonging anywhere. And after the tragedy in the beginning of her story I really wanted her to find some happiness.ஐ – I like the worldbuilding and characters. I’m not uber familiar with Fae lore so a lot of this was brand new to me and I’m sure as the story continues I’ll pick up more and more. Still we have a really good start and one of my favorite things in this was the Rose Goblins. It is part Cat and Part Rose Bush and completely awesome.\n“Rose goblins are built like porcupines - if you rub them the right way, you don't have to worry about the spines. They're sort of like people in that regard, too.”\nஐ – The build up. If you are hoping for some quick and fast answers…then well this is probably not the book for you. There is definitely a plot for this book but the overall questions I have about Toby were barely glimpsed. Hopefully we get there but I’m not expecting any easy answers.╰⊰✿ The Stuff that was a Minor Issue for Me ✿⊱╮Remember when I said that I’m not super familiar with Fae lore??? It was like a few sentences ago so I really hope so. Well there are a lot of things tapped on and mentioned that I don’t know much about. The different courts, the different Fae types and some of the general stories in the Lore to be specific. Now that is fine I’m sure I will learn all about them but I will say it is like the author expected you to have a working knowledge of the Fae going into this book and I felt like I didn’t do my homework.The story is still very enjoyable for the most part but I did get a little bit stuck on a few minor details because of that. The other part is the Fae mentality. It is really a shift, they are really pretty cruel for the most part and I struggled with some of the motivations. I was finally catching on by the end of the book so I have high hopes but some of their responses threw me for a loop.╰⊰✿ I’m Excited for the entire series because ✿⊱╮\n“My name is October Christine Daye; I live in a city by the sea where the fog paints the early morning, parking is more precious than gold, and Kelpies wait for the unwary on street corners. Neither of the worlds I live in is quite mine, but no one can take them away from me. I did what had to be done, and I think I may finally be starting to understand what's important. It's all about finding the way home, wherever that is. I plan on finding out.I have time.”"}, {"userName": "Denisa", "userReviewDate": "Nov 18, 2016", "userURL": "http://www.goodreads.com/user/show/14215152-denisa", "userReview": "3.5/ 4ishI really missed a good UF!I admit, it took me a bit to get into the story. But well, once I got there, I couldn't get out!I absolutely loved it! Loved the world it created and the characters, even the \"case\" was a damn interesting one (and that's not very easy to find).This series has a lot of potential, can't wait to get to the next one!"}, {"userName": "The Flooze", "userReviewDate": "Sep 14, 2009", "userURL": "http://www.goodreads.com/user/show/355739-the-flooze", "userReview": "ETA: I've continued reading this series and want to point out I gave books four and five considerably higher ratings. Four stars each. _______________________________I can't make up my mind what to rate this. The unforgiving and frustrated side of me wants to saddle it with a two. The part of me that loves depictions of the fae, their powers and lands leans towards a three for effort.My problem with Rosemary and Rue is this: Nothing really happens. Sure, there’s a lot of running around. Bullets fly through the air, illusions and curses complicate things, and there’s a mystery to solve. However, the majority of the story concentrates on Toby getting repeatedly wounded, swallowing down the taste of blood and roses as she ineffectually seeks a murderer. There were a lot of stitches, poultices and headaches. There weren’t many clues to untangle. The answers were found through a taste-test that could have happened 100 pages earlier, saving Toby some scars and me some boredom.McGuire’s foundation for the story intrigued me. A PI changeling spends 14 years in a koi pond, forgetting she was ever bipedal and losing everything in the process. Her husband and daughter think she willingly abandoned them, human society declared her dead and gone, and her own guilt over a failed mission prevents her from reconnecting with her fae contacts. She’s afloat in a world that has moved on without her. She’s barely making ends meet and desperately feigning indifference.That’s where the interest ends. Toby stumbles through this investigation. Apart from an early trip to the victim’s offices, I never felt there was a trail to follow. The plot consisted of go here, get shot at, go there, get shot at, go home, get shot at…and no, I’m not exaggerating for effect. What began as a noir-ish escapade devolved into half-assed ideas and miles of blood-soaked bandages.The curse she’s under didn’t help matters. It seemed more a hindrance than a motivation. I didn’t feel its urgency as keenly as I was supposed to. It would threaten Toby at the oddest of times, seeming to prefer holding her back rather than allowing her to fulfill her task. I don’t like illogical plot points, and this was a major one.As for the protagonist, I don’t dislike Toby. I don’t feel much of anything for her. She’s very middle-of-the-road. She’s not clever, nor is she kick-ass or powerful. She’s sarcastic, but falls just shy of amusing. I felt no connection to her. The other characters land in the same category. None of them are standouts, with the possible exceptions of Tybalt and a few teenagers--they at least had some oomph to them as well as definable personalities.McGuire throws in a lot of nods to the past and to future story arcs, which is expected in the first novel of any series. Some could be compelling if handled correctly. Most notable is the original mystery Toby investigated--the one that resulted in her swimming around a pond for 14 years. I understand if McGuire wanted to acclimate us before exploring what came before; Toby’s return took a lot out of her and her adjustment hasn’t gone smoothly. However, Rosemary and Rue drained away most of my interest in the past. I’m not eager to follow Toby through another muddle of unhappy coincidences. I like heroines who use their wits to solve things. I need a build-up of tension and adrenaline to keep me riveted. I enjoy strong characters who leap off the page and hold me by the hand…or by the throat. October Daye’s method of blindly hurtling through shadows until she conveniently trips over answers lacks all of that. Perhaps I’m being harsher than necessary. Lately, I’ve read one disappointing book after another and it’s taking a toll. I’d expected to find a new favorite in October. Instead, I discovered a whole lot of meh that I’m not eager to return to anytime soon."}, {"userName": "Jilly", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "This was a tough book for me because I kept falling asleep every time I tried to read it. I swear, it was like a giant Xanax.30 minutes of the endless descriptions and the politics of every single fae creature will do that too.Plus, on top of the endless descriptions and explanations, October/Toby was weak as hell. She was injured the entire book. By the end of it, she is dragging her half-dead, bleeding corpse around to fight monsters way bigger than her, but she still refuses to shoot first. Seriously, there was one scene when she just needed to shoot the freaking gun that was in her hand to stop everything, but she hesitates and ends up getting someone else killed and herself even more injured- if that were possible. She just stands there, talking to the bad guy who says he is going to kill her. Bitch, shoot him!!It was frustrating!Look, I live in Texas. We shoot first and ask questions later. This woman got on my last nerve.On the good side - the world was interesting. There were a hella lotta fae running around. Plus, there were even two cats I liked - the thornbush cat, and the king of the cats dude. He was interesting and hot, but there wasn't enough of him to keep me awake.All in all - good book if you have insomnia."}, {"userName": "R.", "userReviewDate": "Jan 18, 2010", "userURL": "http://www.goodreads.com/user/show/1283231-r", "userReview": "This started off strong, but it lost a whooooole bunch of steam as it went. The story never really felt like it was driving forward, just sort of meandering onward. Toby is likeable enough, but she's sort of ineffectual. She spends a large portion of the book constantly being battered about and recovering from various near-fatal injuries and in the grand scheme of the plot and what she's attempting to do, very rarely does she ever actually accomplish anything herself. Which is not to say that she has to be an invulnerable superwoman, and having help is fine. But Toby (and thus the narrative since it's first person) constantly harps on how relatively weak she is as compared to all of the extremely powerful beings around her and that's consistently held up by the text, which leaves one wondering why exactly everyone wants her to do everything in the first place. Vague reasons involving fairy law and politics, also loyalties, etc. are bandied about and obviously if the very powerful people took care of their own shit and/or got other very powerful people to do so you wouldn't have much of a story, but as with all such things it becomes a little frustrating after a while.I also found the book very easily telegraphed, which doesn't have to be a bad thing, but since it revolved around a mystery that sort of took away any suspense. Plus, my being able to figure out the characters' entire motivation and plot arc generally upon first introduction meant that Toby often being inexplicably oblivious about things became grating. There are insignificant things that mostly just make me do things like go \"...He obviously doesn't hate you?!\" at various intervals throughout the entire book. Then there are much more important things like why exactly she seems to be aware that one dude is a total fucking creeper and predator/user&abuser and is wary of it, yet also simultaneously seems to be completely flabbergasted by the idea of him being a terrible person.At any rate.2.5/5"}, {"userName": "Choko", "userReviewDate": "Jun 15, 2014", "userURL": "http://www.goodreads.com/user/show/27962805-choko", "userReview": "*** 4 ***An impromptu buddy read with the UF loving BB&B Fae maniacs!!!This was fun. I have had this series for a while, but never really thought about it. Another reason everyone should belong to a book club - you get to read things you would have never read was it not for your buddies! This is very much an Urban Fantasy and it is full of multitude of Fae creatures. Actually, rarely have I encountered the depth of Fae lore as I found here. Several times I stopped to research the mythology of different classification of Fae. I love getting this involved with a book:-)The main character, October \"Toby\" D. is a halfling, a mix between human father and a Fae mother. Her story is heartbreaking, but it also slowly shapes her and influences all her actions and decisions. She is not very strong, or very gifted with Magical talents, she is not a martial arts expert, nor is she distractingly beautiful, she doesn't have a family to support and guide her through tough times... It seems like fate has handed her the short end of the stick... And yet, she keeps on facing creatures bigger, stronger, and way scarier than her... We get to see how she navigates the Darwinian world of surviving in a magic filled San Francisco.The secondary characters are very well flashed out and stand on their own feet, weaving an intricate story of treacherous betrayals and political power struggles, murders, mysteries and paranormal mayhem!!! Toby gets a bit down on herself, but in her case that is quite understandable. I loved the creativity of the author which was nicely delivered by appropriately detailed prose. I also loved and was a tiny bit creepers by the blood magic, but I found it fascinating!!!As a whole, I enjoyed this book and am planning on reading all the rest in the series!!! I recommend it to all Urban Fantasy fans and wish all of you Happy Reading!!!"}, {"userName": "Erin ☕ *Proud Book Hoarder*", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/3048260-erin-proud-book-hoarder", "userReview": "\"It can't all be dreams because a broken dream will kill you as surely as a nightmare will, and with a lot less mercy. At least the nightmares don't smile while they take you down.\"This unusual Urban Fantasy series focuses on a changeling (half human, half fae) stuck between the politics of different fae branches while fitting in with the human world. Kind of. Toby used to be a private investigator for her leige, but she was almost killed and punished a severe way. When she recovered from this (I'm careful with spoilers about this shocker), she was left with a lot less ties to the human world, to say the least.This book's pretty grim - a lot of bad things happen and good people die. There's depressing events and turns in the protagonist's life, as well as some glimpses of goodness and family warmth coming forth from unexpected sources. It's not written in the typical Urban Fantasy or fantasy tone, but more similar to a noirish/hard case mystery crime style.Despite the writing style being workable and the worldbuilding unique, Toby makes a great main character: she's smart but not unreasonably so; she's kind but not mushy and unrealistic; she's tough but average-tough, not that unrealistic stuff that's growing old in UF trends. The other characters...it's confusing on what to think of them. They're multi-dimensional.Why an average rating? Despite the promise of a mystery and the alluring world, little really happens. She investigates, but nothing grabs my attention. Honestly I kept getting a little bored. I should have felt more emotional oomph with the bad stuff after she recovered at the beginning, I should have been more invested in the story, but for some reason I just wasn't. The structure was sound and the foundation firm, but inside it was a little plain and under-furnished.Really the mystery wasn't strong because the character would try a different person to talk to, literally going through a mental list of who to go to next, till the answer was revealed by a last person she tried talking to. It became annoying how Toby almost died between questioning scenes, that grew old fast, and instead of helping the pace it started hurting it. Usually a character attacked and near death keeps things exciting and thrillingly tense, but it became so expected and routine that I started skimming it for the next recovery.Finally, while the world building is complex, the author opened the book where everything's already established in the character's mind and relationships, leaving the reader attempted to catch up. I couldn't get these weird relationships she had with these unusual characters, I really couldn't understand the connections and motivations there. I will try the next book in the series - it's a long running series and has a fan base, so I'm assuming there must be something there, hopefully easier to attach to when I'm finally able to understand and appreciate the relationship connections."}, {"userName": "Michelle Dockrey", "userReviewDate": "Apr 24, 2009", "userURL": "http://www.goodreads.com/user/show/2253395-michelle-dockrey", "userReview": "Full disclosure: this review may be doubly biased; not only is the author one of my best friends, but I'm in the proofing pool. I'm in an unusual position. I've had the privilege of watching this book and this series grow over drafts and years, from an unruly child into a beaming graduate. If authors are essentially releasing their children out into the world to make it on their own, I feel like I'm part of the proud family that's watched them grow up, or at least perhaps one of its well-loved teachers. (If that isn't pushing the metaphor too far.) Anyway, that might make me biased, but it also gives me a perspective that reviewers reading it for the first time might not get. From the very first draft I ever read (two years ago? three? it predates my current email client so I can't look it up), Rosemary and Rue hooked me. Hard. Every time a new flip came, I reread faithfully from the beginning-- you have to, to do a good proofing job, because things change throughout-- and every time, it hooked me just as hard. I spent hours not particularly noticing if anyone spoke to me, I neglected my poor roommate shamelessly, because I was absolutely absorbed. In fact, this has happened with every book in the series so far. Seanan recently asked the proofing pool to suggest excerpts from An Artificial Night (book 3) to go in the back of A Local Habitation (book 2). Going back through my file, I really did mean to just skim the book for sections to suggest. I wound up reading for about an hour, completely oblivious, pulling myself out of it to get some work done, and then diving back in for another hour or two. I got completely and willingly lost in a book I'd already read from beginning to end dozens of times. That should tell you something right there. Rosemary and Rue is the first book in a long series, but each book is a complete story. Seanan skillfully combines satisfying endings in each book with the hints and pieces of an overarching story arc that left me craving the next book like an addict, but didn't leave me dangling with cliffhangers. Again, my proofer perspective makes my review a little different; Seanan doesn't deliberately spoiler us, but she'll tell me what the clues point to, if I ask. And again, this just highlights her mastery: you see, if it isn't braggin too much to say this, I know what's coming. I don't know everything that's coming, of course, but I know a lot; I know some things that won't be revealed until, oh, book six or so. And you know what? I'm still dying to read each book as she writes it. They're that well-crafted, that full of things that draw me into Toby's world and make me want to stay; I don't just want to know what happens next, I want to know how; I want to know what it's going to look and feel and taste like. With these books, it's not just the gripping plot; getting there really is half the fun. So just what does draw me in? One thing that hooks me most in a book is world-building, and the Toby Daye series has that in spades. And hearts and diamonds and cups and staves and pentacles. The Bay Area that Seanan knows and loves combines with the world of Faerie from her extensive folklorist background, and sports her own twists and touches. Both worlds are vivid and real, sometimes enchanting and magical and sometimes frightening and violent, and I find myself craving every scrap of detail about Fae rules and culture, and of how the Fae interact with the mortal world, easily as much as I crave to know how Toby's going to get out of her next scrape. Ah, Toby. October Daye, half-human private investigator, sarcastic and impulsive and only sometimes aware of her own flaws, trying to do what's right even when she hates it, sucked back by that very sense of right and wrong into the world she tried to leave behind. I'd hire her in a heartbeat if I needed a problem solved, I'd enjoy hanging out with her for coffee, and I'd despair if I ever had to try to teach her something new. Or deliver her a piece of bad news. All of Seanan's characters are like this-- complex, layered, imperfect, true to themselves as best they can be but still as unpredictable and fallible as any real person you might know. (Here's a bonus hint: even narrators don't know everything.) Even a great mystery will never hook me if the author doesn't make me care about the characters. In Rosemary and Rue, even the characters you wouldn't particularly want to get to know are still people you kind of want to know more about. Did someone say mystery? You'll find Rosemary and Rue shelved in SF/Fantasy, not mystery, but I'd recommend it just as highly to mystery fans. I think the first phrase I ever used to describe the book was \"Veronica Mars meets Charles de Lint\". I'm a fan of urban fantasy, of stories in which the magical and fantastic still exist, not in some alternate reality but right here in our cities, cleverly hidden from all but the most discerning or the most unlucky. I'm also a fan of murder mysteries, and I read an embarrassing number of them. So I feel I can say this with fannish authority: these two great tastes never tasted so great together! What makes it work is that Seanan doesn't sacrifice the one genre for the other. The mysteries in each book-- as well as the overarching mysteries across the series-- aren't simple and telegraphed; there's no clear good guys and villains, there's no obvious butler-did-it, nor is there an obvious least-likely-person-did-it. At the same time, Seanan doesn't use the classic and infuriating trick of withholding vital information about the plot until the last five pages of the book just to make it impossible to guess, a la \"what you all didn't know is, Bob was a prison guard twenty years ago, and Bill was an inmate where he worked!\" The clues are all there, if you look. Mystery plotting is a tricky balance, and I think Seanan strikes it well. On the other hand, the urban fantasy isn't just a stage setting. Walk through any bookstore's mystery section and you'll find loads of gimmick series: musician mysteries, cat mysteries, cookie mysteries (recipes included!), racehorse mysteries (okay I like Dick Francis a lot, but still), theatre mysteries, etc. Many of them are well done, but most of them are still only using their \"thing\" as a gimmick. The October Daye series isn't an \"x mystery\" series; it's an urban fantasy series in which there are compelling mysteries. It's a tale of a woman caught between two worlds and trying to live in both, a portrait of those worlds and an introduction to the people who live there. It's unavoidable that I'll get a little gushy when talking about my dearest friends, but I promise, friendship is only enhancing the gush a little. I genuinely and highly recommend Rosemary and Rue to fans of urban fantasy, or murder mysteries, or P.I. novels, or worldbuilding, or complex characters, or folklore, or fairy tales, or Shakespeare, or British folk ballads, or just plain exciting and engrossing stories that are likely to keep you up half the night reading just one more page."}, {"userName": "Monty Cupcake ☠ Queen of Bloodshed ☠", "userReviewDate": "Feb 27, 2015", "userURL": "http://www.goodreads.com/user/show/22911953-monty-cupcake-queen-of-bloodshed", "userReview": "Buddy Read with the MacHalosMaybe Ilona Andrews' Kate Daniels has ruined me for all other UF series, but this was not an awesome book. This was like the Jerry Lewis version of KD. Let's go over the things that annoyed me:1. Tobey has almost no fighting skills and no weapons, yet she romps around getting into trouble. You think she'd take a self defense at the gym or something, because she desperately needs it. I don't care if they're magical beings, stronger than you magic wise, you could still learn a few moves for the ones you could actually hit if you knew how. 2. Speaking of that lack of defensive skills (and offensive), she's always getting hurt, seriously hurt and almost dying. It's really annoying that she spent most of the book that way. 3. That pond time must've resulted in some stunned synapses, because Tobey is not the brightest crayon in the box. It's one of the books where you're constantly thinking \"how did she not know this?\" It's like everyone knows the rules of Monopoly and she's still trying to decide what game piece she'll be. 4. Info dumping, but unhelpful info. The book is loaded with descriptions of this new world and all the things in it, etc. etc. blah blah blah, but it's not full of the info you'd like to know. The really simple things that'd help understand half of what's going on in the book and this is info I know is only going to be pertinent to this book, yet it's missing. 5. A lot of extra. I ended up skimming in a lot of places. The book went like this....Tobey doesn't want to do anything...but now she's accidentally caught up in some trouble... blah blah blah...super injured and at the mercy of whoever is around... blah blah blah...saved...blah blah blah...blindly staggering into trouble again...blah blah blah. The blah's are the parts I skimmed and kept wondering when it was going to conclude.6. Repetition. Ugh, this book had so much repetition. In case you forget from where you read it three pages ago, she's Amandine's daughter. That was repeated over and over, along with other things I'm trying to block out.7. The end was very Red Baron twirling his mustache. Overall, this book didn't do it for me, especially Tobey. She's not a bad character, she's just kind of this ignorant lump of clay walking around (that seems so much younger than her age, like YA young), and people are clamoring for her attention and skills, skills she seems very inept at using. I'd like this book better if she was good at some of these things, but she's not. She does have a special skill only she seems to do, but I'm not sure, as the book is so vague. The best part of this book to me was the secondary characters, I found them much more intriguing. All the secondary characters have their act together and seem coherent? awake? Tybalt seems like a lovely pirate, Connor, I'm not feeling that wannabe connection, Lily is neat, Julie is psycho, Manual shows promise, Devin, I want to ask if Tobey has brain damage where he's involved, Duke & Duchess seem nice, etc. The secondary characters made this book for me. The last thing that bothered me about this book - it's written in the first person POV, which I find bothersome in this book. I'll most likely be reading book 2, as I wish to know more about the cat man and the rest of the secondary characters. I so want Ryseline to crack....and I want to be best friends with the Luidaeg."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Aug 10, 2009", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "Rosemary and Rue is well-written urban fantasy. This novel is full of the melancholy. Not what I would call fatalistic or depressing, but instead in touch with the sad, the weary, the timeless angst of the faerie folklore and myths. San Francisco is a beautiful setting for this story, this grand old city of hills, water, and mists. It's not difficult to believe that Faeries would situate their courts in this place. There is something magical to this setting that does half of the world-building in itself. Ms. McGuire very credibly does the rest with her descriptions of the various faerie and changeling denizens. I am no stranger to faerie fiction, but she brought something new to her treatment, describing creatures both achingly beautiful, and horrific, sometimes at the same time. Not to mention their convoluted and ancient rituals sealed in blood and by their words spoken in oaths. When I read books this rich in authentic details, I have trouble doubting that Faerie is real afterall.It's not fair to compare, but I did feel like October Daye could hang in the Dresden club, with that feel of the ne'er do well, who gets wounded more than her share, much like the wizard from the series by Jim Butcher. Also the fact that her lot in life has lead to losses that she can't slow down to count, or she wouldn't keep moving. This adds to the melancholy vibe of this novel. Nothing excessive, but inherent to this story, like the mists climbing the twisted streets of San Francisco just before dawn. This is not light-hearted, happy-go-lucky urban fantasy. This is the serious kind where you know that October won't come out of this adventure unblemished. But she will be a little wiser, and probably sadder. With faerie, it's expected. That sadness mixed with wonder pulls me back every time. The reason I'll pick up the authentic version of faerie any day over a Disney-style version. (If you need an example, read The Little Mermaid by Hans Christian Anderson and give the Disney version a pass). There's a place for Disney, but it doesn't satisfy like the real thing, tears and all.Rosemary and Rue was a good start to a series. I can see myself become quite captivated with it, due to its rich faerie texture and hint of sadness and sacrifice. I'd recommend it."}, {"userName": "Robyn", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/25037254-robyn", "userReview": "Even though I'm not usually a fan of Irish myth urban fantasy this one won me over, mainly on account of October. Fun!"}, {"userName": "Mogsy (MMOGC)", "userReviewDate": "Oct 08, 2014", "userURL": "http://www.goodreads.com/user/show/4379514-mogsy-mmogc", "userReview": "3.5 of 5 stars at The BiblioSanctum http://bibliosanctum.com/2015/06/25/b...October Daye is one of those urban fantasy series I’ve been meaning to read for a long time. And unless you count her novels written under the name Mira Grant, I’ve never read anything by Seanan Mcguire before either, so this was a good opportunity to knock out two birds with one stone.The series’ eponymous protagonist is a half-human and half-fae changeling with an incredible and downright uncanny history. The book’s prologue takes us back fourteen years ago as October “Toby” Daye investigates a missing persons case for her liege lord Duke Torquil, but her stakeout ends in disaster when she is ambushed by the fae suspect and magically transformed into a fish. And in that form she stayed, for fourteen damn years.The book officially begins not too long after Toby returns to herself, but she’s only a shadow of who she once was. The world has passed her by while she was trapped in that koi pond. Her human family who long thought her dead are now having trouble coming to terms with her reappearance, and Toby herself is unable to face old friends, especially Duke Torquil, whom she believed she failed. Turning her back on both the human and the fae worlds, Toby retreats into herself and attempts a solitary life of night shifts and takeout, but those plans are shot when a pureblood fae countess is murdered and Toby is charged to find her killer. Now not only is Toby forced back into fae society, she also has no choice but to step back into her old role as a private investigator.Many people I know who have read both Seanan Mcguire’s books and also her Mira Grant books have told me that the writing styles under each name could not be any more different. Those folks are right. The author also uses her names to write very different genres, which is probably the reason for their disparate styles – and from what I’ve read, I think I enjoy her urban fantasy more than her horror. The two Grant books I’ve read, namely Feed and Parasite both suffered from very hackneyed plotlines and stunted character development, but Toby Daye was a breath of fresh air with her very unique and natural voice, along with the author’s vision of fae politics and their interactions with the human world. McGuire’s writing flowed a lot better for me in this novel.That’s not to say the book was perfect, though. The story in Rosemany and Rue itself didn’t blow me away – it’s a paradigmatic UF murder investigation which involves a lot of talk and little to no mystery in the traditional sense. After that awesome prologue, the intro drags on while we follow Toby through a tour of fae country as she makes stop after stop to tell others that the great Countess Evening Winterrose is dead and/or to ask for help. As the main protagonist, Toby is also prone to seriously bad decision-making, and maybe I just missed something, but I’m very skeptical of the author’s warped, cynical reality where a young woman can bleed all over a public bus from a gunshot wound and everyone around her can just pretend it’s not happening.Still, it’s the background elements and potential for good side stories that really caught my attention here. The stage is set and all the players are in place, now all we have to do is sit back and let things take their course. I have a feeling the complex social hierarchies in the fae world itself should add a lot of flavor to this series and make it stand out, and I’m also interested to see if Toby will ever connect with her human fiancé Cliff and their daughter Gillian again.I’m not typically that picky about my urban fantasy; all I’m looking for in any first book to a series is that it’s entertaining and that it serves as a good escape, and Rosemary and Rue passed the test. What I do know is that I think I’m done with Mira Grant books for now, but I’m definitely open to continuing with Seanan McGuire’s October Daye. As with most UF, I expect the books will get better once the series finds its stride."}, {"userName": "Richard Derus", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Rating: a grudging 2* of fivePearl Ruled at 33%Nope. Not one eyeblink more. I cannot do this. Too much is too much and the rose goblin escapade in chapter 8 lasted about a week too long.This idea is fine, though the choice of San Francisco as the intersection point between humans and Faerie borders on OTT, and I guess this could still make a good TV show if they get the budget for the f/x, but oh HELL no on the bloviations of the book."}, {"userName": "Jo", "userReviewDate": "Mar 08, 2016", "userURL": "http://www.goodreads.com/user/show/14323468-jo", "userReview": "09/03/2016 Buddy read with Jessica, Robin, Choko, and Maria over at BB&B b/c we are craving UF, also Jessica loves this series and seeing that she is never wrong.... :-) \n “By my word and at my command, you will investigate a murder, and you will force justice back into this kingdom. You will do this thing.” There was a long pause. I was starting to think the message had ended when she continued, softly, “Find out who did it, Toby, please. Make sure they don’t win. If you were ever my friend, Toby, please. . . ” \n This books starts off with a bang, and captivates you so completely that it was difficult to remember to breathe. I just wanted to devour this book, with its magical world of Fae, and changelings, and Cait Sidhes and rose goblins and Selkie’s and so many more fantastical creatures. The thing with UF is, if it’s done right, it will blow your mind and take you on a journey you won’t want to end. October ‘Toby’ Daye is a changeling, half human, half fae. She’s engaged to a human, Cliff, who doesn’t know that she’s not fully human, and they have a daughter whom they both love very much. She’s a P.I. and a knight errant, and currently on the trail of a possible kidnapper, trying to find the missing wife and daughter of her liege lord, the Duke Sylvester Torquill. But then things go horribly wrong, and her whole life is upended by evil Fae, and for fourteen years she is lost to the world. Everyone made to believe she was dead.  After returning to herself, she is shunned by those whom she loves most, and she turns her back on the Fae world. Trying to get through every day by denying who she is. But the Fae world refuses to let her go, and the murder of pureblood Fae, Countess Evening Winterrose, demands Toby’s return to her world.  \nWe hated each other so well and loved each other so badly . . . and I had no idea what I was going to do without her.\n See how beautiful this author writes…..I just love it. Evening placed a dying curse on Toby, forcing her to find her killer/s, or she would forfeit her own life. And so Toby begins her journey back into the world she tried to ignore, connecting with old acquaintances, not sure who is evil and who is good.  Toby is a fantastic heroine. I love how pragmatic she views and approaches everything. She has been dealt a really rough hand in life, and because she is a half-blood she is not very powerful, she’s not perfect and she makes many mistakes. BUT but she owns her mistakes, and she is determined to keep her promises even when they are wrong. She has a lot of heart and I liked that she wasn't all powerful and perfect in everything she does, and I cannot wait to see how she grows more as a person as the series continues. I must admit the first 30% she was quite negative in her view of things, which is understandable after what happened, but after that point she was just awesome.  \nRose goblins are built like porcupines—if you rub them the right way, you don’t have to worry about the spines. They’re sort of like people in that regard, too. \n This world is absolutely fantastic, and I just love the way the author writes. The rose goblin is one of my favorite new characters, and I WANT ONE. The plot of the story was strong and very interesting, and amazingly done. I loved learning more of this world as the story progressed, and going along with Toby on her journey of finding clues and solving them. Also many questions were raised and not answered, like the reaction of the Queen when she was told of Evening’s death; what happened to Luna and Rayseline while they were held captive, and why Rayseline changed so much. I cannot wait to find out the answers to these questions.  \n “What’s my prize? And why, my dear October, are you gowned so fetchingly? You don’t need to make yourself beautiful for me, you know; you’ll never win my heart. Although you’re welcome to keep trying, if you insist. Next time? Try wearing a corset.” \n Luckily for me some sexiness was added to the story by Tybalt, the king of the Cait Sidhe. And what a deliciously sexy kitty he is ;-) I’m not sure yet whether he’s a friend or foe of Toby, but my romantic heart is hoping friend and possible love interest. What can I say, romance hope springs eternal ;-)  Once again Jessica has proven why she’s a Goddess book-pimp. This book was so very good. I loved it and I cannot wait to continue with this series.  A must read for all who loves UF with an amazing and captivating world and characters. HIGHLY RECOMMENDED."}, {"userName": "Mimi", "userReviewDate": "Sep 02, 2015", "userURL": "http://www.goodreads.com/user/show/2490110-mimi", "userReview": "Never thought I'd say this, but I sort of hate this book and it's all because of the main character, October (Toby) Daye. She is just so damn infuriating. But the thing is, not liking the MC has never stopped me from reading a book, continuing a series, or even enjoying the writing. But I just can't do it with this book.Credit where credit is due, this is not nearly as bad as some of the urban fantasies I've read, because there is a lot of potential in the world building and all the mythology woven into the writing is very interesting. However, the book itself is not as well put together as it could have been. It started out okay though, but then half-way through it started to unravel, with each chapter making less sense than the previous. By the end, not much about it made sense to me anymore, least of all the main character herself--the reason for the series, the reason we supposed to care about these books.There are too many things wrong here--pacing's too slow, tone too depressing, main character too apathetic and infuriating. Personally I don't find the fae that interesting; they're pretty obnoxious tbh. However, in spite of that, Seanan McGuire's got a good thing going here, such as the interesting modern-day San Francisco setting, an alternate world filled with otherworldly creatures, and a long-term story arc that's fitting for a long series. I especially like the setting(s), magic, courtly politics, depths and complexity of the world building. I'd like to be optimistic and say maybe this was a fluke. Maybe the next book is better. Maybe I'll pick up it some time in the distant future when I no longer recall why I hated this book, but let's be honest, that's probably not gonna happen because Toby is still the main character and that makes it too difficult for me to careAlso, the first half of this book was too much of an uphill slog and the second half was too weirdly repetitive, especially the action sequences. It felt like the same couple of scenes kept happening over and over again. Toby kept getting almost killed too many times that by the the Nth time, I was like, OK maybe you're better off dead...? She's a professional private detective, yet she is no good at detecting, but I'm gonna cut her some slack here since she did spend a good number of years as a goldfish.Another thing I couldn't get into was the mystery. Didn't care about the victim; didn't care about Toby's connection to her either.Last but not least, this book feels like it's the middle book of an ongoing series, not the first book. It feels like we're being dumped in the middle of on-going cold war between two huge factions with very little background info to work with, and we just have to figure things out as we go along. Too many things crucial to plot and character development are summed up quickly, rather than shown. The relationships between the characters are already well established, and so there's a ton of history that we're not privy to and we just have to accept that. Like I said, infuriating.I can't imagine how the next book is any different, and based on some of my friends' reviews, it's not. And that's why I'm quitting this series.Don't know why I can't seem to get into Seanan McGuire's writing. Feed was meh. Her short stories were also meh. I see so many people on my feed enjoying this series, reading all the way up to book #10, and I just wanna know... how? How do they do it? How did they get through books 2 to 9?A group I'm in on Goodreads is reading Every Heart a Doorway this month, and I'm tempted to join in because I have the book (thanks, TOR!), but I'm dragging my feet because... Seanan McGuire.Cross-posted at https://covers2covers.wordpress.com/2..."}, {"userName": "Felicia", "userReviewDate": "Dec 02, 2009", "userURL": "http://www.goodreads.com/user/show/666892-felicia", "userReview": "This book had some great parts, and then something that bothered me, which I will say below.This book had a GREAT setting and environment, I was engrossed in the mystery and, (although a bit exposition-y in sections) I was along for the ride the whole way and immersed in the mythology. It has no racy romance, so those who like Butcher, Green and Paul Wilson would be interested in this book/series. I definitely would pick up #2 in the series to see where it goes. Reminds me a bit of the Tim Pratt books, where I enjoyed #1 but LOVE LOVED #2 on.SPOILER:The only thing that bugged me about this book was that the main character has been trapped in a fish pond for like, 12 years from the top of the book, and the whole time I'm waiting for her to go and find her family, husband and daughter, or at least have that be a big story point later in the book, exploring what happened to those she loved while she was condemned to a life as a fish. It's set up in the prologue but doesn't happen in the book. As an aside it is mentioned that it didn't go well, her trying to contact her family, but I would have thought it would have been a DRIVING FORCE after she got loose. Maybe it's just me. I'm usually not so detailed, but if anyone else has read this chime in and call me crazy or whatever. It feels like someone WROTE stuff for this story point, but then cut it out for space or for a future installment? I dunno. After I let my need for that plot idea go I really enjoyed the book, but for some reason I got hung up on it for the first 1/3 of the book.Like I said, recommended to Butcher, Green, Paul Wilson and other fans of urban fantasy not littered with the oiled chests of hot, supernatural men :D"}, {"userName": "☆★Tinja★✮ A Court of Pizza and Laziness", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/11904521-tinja-a-court-of-pizza-and-laziness", "userReview": "Mmmhhmm debating between 4 stars and 3 stars. I liked it but I didn't really connect with Toby, and I was cursing her a few times for acting so dumbly. But, I've heard good things about this series and that it's going to get better. Often the first book in an UF series is the weakest so I'm not worried at all. I'm super excited about this series. I love everything Fae <3 I'm really interested in Tybalt. (was it Tybalt?? Wtf was his name again??) Anyway, fae guy with cat eyes ???? Hoooooootttthothothot. Also, he hates/dislikes Toby ?? Interesting.. Very interesting.. ;)Me ships it. :---D"}, {"userName": "Mike (the Paladin)", "userReviewDate": "Dec 20, 2011", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "[ Why oh why would the Rose have forced her to solve her murder by placing her under a curse that would periodically hit her and make her more vulnerable to those who want her dead? The curse actually hinders her from doing what she's supposed to be forced into doing by the curse! Or why, after she's explained that there's no shame in being under a compulsion does she simply refuse to tell the people who can and want to help her about the compulsion, but then does tell others? And of course this one I've asked about other books. Why does she not see what I bet the majority of the readers will see coming at her like the proverbial runaway train? Oh well. Suspension of disbelief.  (hide spoiler)]"}, {"userName": "Alexa", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/17295220-alexa", "userReview": "Another one of the misses during my book slump. This one was a DNF @ 34%.This book had one of the best prologues I've read in a while.October \"Toby\" Daye, is following a suspect for a case in her PI firm, and she gets caught and turned into a freaking fish for fourteen years. I kid you not. Fourteen Years A life lost. A new start. That is probably the best entrance ever. And then it just goes downhill. I never cared about Toby, I never cared about her friends, the murder or the investigation. I kept reading trying to summon an ounce of interest and I just couldn't. And then when things get hairy, Toby has to choose between asking for help to her liege lord, or going back to her crazy abusive ex...Care to guess who she picks? Yep. I think this quote sums it all: \n\"Devin was in charge, yes, and he was also someone you didn't want pissed off at you. His temper was legendary, and he rarely gave second chances. He was also the first man I'd ever loved, and now that I was Home, I was starting to realize how much I'd missed him\"\nI'm not sorry to say that I'm not up to read about abusive relationships. Fuck this! *flips a table*"}, {"userName": "Emma", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "This was a really good read. I enjoyed the magical world and the blend with urban fantasy. I'm looking forward to continuing with this series."}, {"userName": "Sanaa", "userReviewDate": "Jul 21, 2015", "userURL": "http://www.goodreads.com/user/show/5944522-sanaa", "userReview": "[4 Stars] Review to come soon, but I will say that I really enjoyed this one! Much of this book was spent world building and Toby pretty much introducing us to all the major fae players, but I didn't mind. I enjoyed seeing the worldbuilding, and it is cool that Toby is a changeling. I did have a couplenof problems with this, but overall they weren't big enough for me to give this anything less than 4 stars!"}, {"userName": "Wanda", "userReviewDate": "Jan 08, 2016", "userURL": "http://www.goodreads.com/user/show/9246169-wanda", "userReview": "”There’s rosemary and rue. These keep seeming and savor all the winter long. Grace and remembrance be to you.” –William Shakespeare, Winter’s Tale, Act 4, Scene 4.Add to that quotation Ophelia in Shakespeare’s Hamlet who tells us that rosemary, that’s for remembrance. And the name of the plant rue has become synonymous with regret and repentance. There’s a lot of remembering and regretting in this book.October (Toby) Day is spending a lot of time remembering her family, her old job, the circumstances which separated her from both of those, her childhood, you name it. If she was to choose a Facebook status, she would have to select “it’s complicated.” You see, she’s a changeling—half human, half fae—not truly accepted by either community. And she spent 14 years as a fish (a koi in an ornamental pond), cursed when she ran afoul of a couple of powerful fae when she was following them in her former role as a private investigator. Nobody knew where she was (until the spell finally wore off) and her mortal husband & daughter now want nothing to do with her. Since those relationships have been ruined, October isn’t really in the mood to re-contact the fae either.But sometimes you don’t get a choice in these matters. Despite her lowly Safeway job, as she tries to catch up with 14 years of societal progress, one of her powerful full-blooded faerie frenemies binds her once again—this woman (who knows that she will be killed) tasks October to avenge her murder using her investigative skills.There is copious use of one trope that really bugs me—that of the person who is absolutely sure that no one wants to hear from them or spend time with them because of something they have done. This is October completely, despite the fact that she was “done to” rather than “doing.” And truly, when in life do you actually find this? Maybe among middle school children, but certainly not among adults! Toby’s rejection of all overtures from any of her former friends is incomprehensible to me, no matter how prejudiced they might be, no matter how much she may envy their status or their families. It’s even more frustrating when it becomes obvious as the story progresses that many of them are delighted to have her back in their lives and are most forgiving considering what a cold shoulder she has given them. As a side note, I also can’t imagine that her husband and daughter would actually reject her—most families welcome long-lost family members with open arms. But that will surely be an issue for another book.In spite of this, I found Rosemary and Rue to be a fun read, keeping me guessing about who did what and why. I hope now that October has re-connected with friends and family, that I will feel less annoyed with her behaviour in book 2 and be able to completely enjoy the story. And I feel that a mythology refresher would be helpful before the second installment—who knew that the fairy folk came in so many versions?"}, {"userName": "Sarah", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/3344685-sarah", "userReview": "As a huge fan of Seanan McGuire's Incryptid series I had very high expectations for October Daye and I'm happy to say that Rosemary and Rue kicks things off to a very promising start. October (known as Toby) is a changeling - born to one human parent and one fae and never quite fitting into either world. Full fae look down on changelings because they're not as powerful as them but humans often sense something a little off about them and it can be hard having to constantly hide the power they do have. Toby had opted to live a more human life than most, she had a human fiancé and a young daughter but her job as a private investigator often involved working fae cases. It was when she was trying to locate her liege lord's missing wife and daughter that things went really wrong for her though. She was only meant to track the suspect and report back so that someone more powerful could be involved in the take down but unfortunately she walked right into a trap and suddenly found herself transformed into a koi fish.It took 14 years for the curse to wear off - 14 years of living as a fish totally unable to interact with anyone or even remember that she was human! - and in that time her fiancé and daughter decided that she was just a deadbeat parent who had chosen to walk out on them. They didn't know anything about Toby's fae heritage or magic so they moved on with their lives and have no interest in letting Toby back in now. Toby is understandably bitter about everything that happened and she is determined to stay far away from the fae from now onwards, or she was until she received a message on her voice mail from an old friend. Countess Evening Winterrose knows she is about to die and she asks Toby to investigate and bring her killer to justice. Now Toby will have no option but to confront her past as she carries out her friend's dying wish.Toby has lost everything that ever meant anything to her, the people she loves most want nothing to do with her and the only people who still want to know are from the life that caused all her pain. It's no wonder that when we meet her she's pretty down on life, she's depressed and she's pretty much given up so she's just doing the minimum to make ends meet and just survive. Evening's curse gives her something to focus on and that has the effect of slowly dragging her out of her pit of despair and making her interact with the world again. The further we get into the book the more interesting her character becomes as she finds the will to fight back against the people who wronged her. She's out of touch though and it is hard to know who is an ally and who might be plotting against her. The focus of this story is definitely on finding Evening's killer but I think we're going to learn more about Toby's past and what happened to her as the series continued and I'm really looking forward to her getting vengeance for everything that was done to her.I find the fae fascinating and Seanan McGuire has created a detailed world populated with interesting characters and all kinds of fae lore, as this is the first book we're still only scratching the surface but we've already seen all kinds of interesting creatures (I love the rose goblin!) and characters I really want to spend more time with (I'm looking at you here Tybalt!). This series is very different to the Incryptid one, it's much darker for a start and there was less humour, but the writing is just as brilliant and I have a feeling I'm going to end up loving these characters as much or even more than the Price-Healey clan. There are lots of questions I still want answers to and I'm really hoping that Toby will get the chance to make amends with her daughter at some point but for now I'm just happy that I've got another 9 books sitting here waiting for me to dive straight into. I can feel a binge read coming on!Source: Received from DAW Books in exchange for an honest review."}, {"userName": "Aristea", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/57608403-aristea", "userReview": "A delightful 3.75 stars!I just needed this book to inspire me again; it is a urban fantasy that focuses on Fae. A strong female sarcastic lead and there you have it! I felt compelled to read it so quickly!"}, {"userName": "Shannon", "userReviewDate": "Apr 27, 2009", "userURL": "http://www.goodreads.com/user/show/2016128-shannon", "userReview": "In retrospect I think I was blinded at the time to this book's promising start. I give it 3.25 stars.October Daye used to be a private investigator until she was turned into a fish and left in the Koi Pond in the Japanese Tea Gardens of Golden Gate Park. The spell lasted 14 years and October lost her entire life. She's trying to start over and then she receives a message on her answering machine from a friend. The friend knows that she's about to be killed so she curses Toby into finding out who her killer is, and Toby has no choice but to start unraveling the mystery.First, one of two nitpicks; I wanted more description of the Fae races included. Even if McGuire didn't want to describe them in so much detail, a short description in the front of the book would have helped. Although, it might help out if you've read A Kiss of Shadows and the Merry Gentry series. A lot of the same Fae show up as well as a lot of the same concepts and themes of the Fae world.She does include a pronunciation guide, which was helpful except for the mistake I found; kitsune is not pronounced kit-soon, it's a Japanese word and it's pronounced key-tsoo-nay. Also, I'm not sure why adding in how a word was pluralized was important, I'm sure we could figure it out as we went along whether she was talking about one or two fairies.My second nitpick was some of the choices that Toby made. At times, she seemed to make bad choices that left me shaking my head and wondering what she was doing. Lily, an undine, even remarks on how Toby is just reacting and not acting, yet she doesn't do anything to rectify this until the last 10 pages or so. And about half-way in I could tell who the villain was and you'd think that Toby would have figured it out sooner. But really, it's a small nitpick and it ultimately didn't make me like Toby any less.I am really excited to see if Toby gets a love interest in the next book. I really hope so because she was put through the ringer in this one. She needs some happiness. Honestly I'm normally the first one to complain and get bored when there's no romance at all, but this book was so action-packed I didn't even really notice. All in all, an ok first book in new series, but not one without its faults.Please check out my reviews for the next two books in this series: A Local Habitation and An Artificial Night."}], "description": "11 hrs 20 minsThe world of Faerie never disappeared: it merely went into hiding, continuing to exist parallel to our own. Secrecy is the key to Faerie's survival—but no secret can be kept forever, and when the fae and mortal worlds collide, changelings are born. Half-human, half-fae, outsiders from birth, these second-class children of Faerie spend their lives fighting for the respect of their immortal relations. Or, in the case of October \"Toby\" Daye, rejecting it completely. After getting burned by both sides of her heritage, Toby has denied the fae world, retreating into a \"normal\" life. Unfortunately for her, Faerie has other ideas.The murder of Countess Evening Winterrose, one of the secret regents of the San Francisco Bay Area, pulls Toby back into the fae world. Unable to resist Evening's dying curse, which binds her to investigate, Toby is forced to resume her old position as knight errant to the Duke of Shadowed Hills and begin renewing old alliances that may prove her only hope of solving the mystery...before the curse catches up with her.", "title": "Rosemary and Rue\n      \n          (October Daye #1)", "url": "http://www.goodreads.com/book/show/13631765-rosemary-and-rue", "average": 3.75, "cover": "https://images.gr-assets.com/books/1336002666l/13631765.jpg", "reviews": 2303, "authors": [{"url": "https://www.goodreads.com/author/show/2860219.Seanan_McGuire", "name": "Seanan McGuire"}, {"url": "https://www.goodreads.com/author/show/2868678.Mary_Robinette_Kowal", "name": "Mary Robinette Kowal"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Fairies", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/13631765-rosemary-and-rue", "http://www.goodreads.com/book/show/8163827-rosemary-and-rue", "http://www.goodreads.com/book/show/6294549-rosemary-and-rue", "http://www.goodreads.com/book/show/25526296-every-heart-a-doorway", "http://www.goodreads.com/book/show/10783217-one-salt-sea", "http://www.goodreads.com/book/show/8496901-late-eclipses", "http://www.goodreads.com/book/show/6782468-an-artificial-night", "http://www.goodreads.com/book/show/10184345-ashes-of-honor"]}