{"ratings": 1577, "userreviews": [{"userName": "Maria✦❋Steamy Reads Blog❋✦", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/44673856-maria-steamy-reads-blog", "userReview": "DNF 20%This one isn't for me. I don't like the pace, I don't like the heroine and I really don't like the hero. He can't decide if he's a romantic or a raging ass****. One second he says something resembling a compliment but then tops it off with a crude sexual remark. Pick a side dude. I'm just not feeling it.It takes the heroine forever to figure out she's in a royal palace and she still hasn't figured it out by the time I dropped this book. But she did manage to get a quick nookie, so there's that. Sorry, I tried. But I'm outta here."}, {"userName": "Nicola", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/13164153-nicola", "userReview": "3.5 Stars. Royally Bad is a prime example of the old adage perseverance is the key to success, and after a bit of a wobbly start when I wasn’t so sure about the couple, I actually ended up enjoying this in all its OTT glory. \nI’d been thinking of her as my Cinderella. I was already a prince—in a sense—so why couldn’t it work? We’d dance, I’d put the shoes on her perfect feet, and we’d kiss and laugh, and all would be fucking sparkles and hearts.”\nIt wasn’t the perfect read, but Sammy and Kain grew on me as their story unfolded and by the end I loved them and Kain’s crazy extended family. And Nora Flite left enough unsaid to tempt me into reading the next book in the series.\nBefore you came into my life, things were much easier.”"}, {"userName": "Sher❤ The Fabulous BookLover", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/5493776-sher-the-fabulous-booklover", "userReview": "DNF @ 25%I got a signed copy in my romance reveal box so I figured I'd give this one a try, but I'm just not feeling it. The pace was way too fast. The chemistry between the H/h was nonexistent and I'm not sure how I feel about the storyline. It wasn't realistic, it was kinda silly actually and the heroine is blindly naive. I wanted to like this one but oh well moving on...."}, {"userName": "Scrill", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/418203-scrill", "userReview": "\"I'd been thinking of her as my Cinderella. I was already a prince - in a sense - so why couldn't it work? We'd dance, I'd put the shoes on her prefect feet, and we'd kiss and laugh, and all would be fucking sparkles and hearts.\"\nI really had a hard time picking between a 2 and 3 stars on this. I mean, I have a hard time judging truly because this isn't really the genre I prefer to read. Still, despite my low expectations it was surprisingly entertaining - despite the parts that made me laugh out loud and think...come on...really.So the book is about this girl, Sammy, who becomes super involved in this family's, the Badd's, personal affairs. From making a wedding a dress, to being a brides maid, to being arrested with them. The day they Badds entered her family was the day her life changed from it's boring and quiet ways.The plot itself was...well entertaining enough. What I mean by that was that it was enough for me to finish the book. There were a few parts that left me wondering...why? Like, the Mr. Badd didn't really know the relationship between Kain & Sammy, but still felt inclined to protect the girl because something concerning her might affect the family.....okay. It wasn't really expected considering his position. The ending was a little predictable, well part of it was, but that's okay.The characters were so-so. Sammy was a cute little feisty girl, but was a little too trusting. Kain was sort of a d-bag. His third sentence in the book was, \"Don't use the worlds 'little' and 'dick' in the same sentence with me.\" I mean serious eye roll, this guy is so into his penis and thinks he is all that. In fact, a lot of the things Kain says is pretty eye rolly-y. He's got that macho protector character down. At least there weren't a ton of hits-his-chest-cave-man moments.All in all, it was a quick and easy read. Funny at some moments with a large dash of cheesy romantic scenes. My biggest problem is I can't get behind a guy who is so fully of himself and having a character change so quickly. Call me a pessimist."}, {"userName": "Nora Flite", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/22535685-nora-flite", "userReview": "The Bad Boy Royals are coming... April 1st 2017, meet Kain Badd."}, {"userName": "bookmarkbelles", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/8020279-bookmarkbelles", "userReview": "I couldnt feel the connection between the two main characters 😫😭 I almost \"DNF\" it at 20% but switched to audiobook afterward and that seemed to help a bit. The story was just okay with some very predictable moments for me. It had potential but I was bored AF through most of it."}, {"userName": "Lana ❇✾Dirty Girl Romance❇✾", "userReviewDate": "Mar 25, 2017", "userURL": "http://www.goodreads.com/user/show/5498948-lana-dirty-girl-romance", "userReview": "DNF at 35%Sadly, sometimes you just know when a book isn't for you. I tried to power through it, but sadly with feeling no chemistry between the MCs and feeling no connection to either the hero or the heroine, I just couldn't. I'm not sure what it was exactly that made me feel so disconnected. Maybe it was the writing style? Perhaps it was the quickness that Kain and Sammy got together? Kai's sister drove me out of my ever loving mind with the way she talks. And truth be said, the heroine wasn't my cuppa either; she was just too immature and all over the place. Le sigh. So no rating from me on this one.I do enjoy this author's writing and will absolutely read her future books. This one was unfortunately a miss, but can't love them all.ARC courtesy of publisher in exchange for an honest reviewFind me on:"}, {"userName": "Aya", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/62779003-aya", "userReview": "DNF 26%Oookay this one is not for me. I've been tried this more than once,twice but thrice and its not working for me. cant feel the heroine and the hero chemistry.did not excite me the story so I decide that I drop this.. (hate this doing it)welp! I tried it but cant work it. time to go and moving onalt=\"description\"/>"}, {"userName": "~Mandi~", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/16397272-mandi", "userReview": "Royally BadBad Boy Royals # 1Nora Flite 4 ⭐️⭐️⭐️⭐️Great book! Really enjoyed reading this one. A little different then I was expecting, but in a good way. Kain Badd looks great on paper: rich, handsome, and he’s even a prince. But after spending a few minutes together, Sammy sees the real him—arrogant, possessive, and too hot for his own good. If she hadn’t agreed to help plan his sister’s wedding, she could have avoided him. Instead, she’s waking up in his bed after an unforgettable night she definitely wants to forget. But he won’t let her.When Sammy thinks her life can’t get any crazier, the wedding is raided by the police, and she spends her first-ever night in jail. The irresistible Kain isn’t just bad in name—his family is connected to a dangerous underworld. Now she’s mixed up in a power struggle between his family’s empire and their rivals. She has no choice but to put herself back in this filthy prince’s extremely capable hands.Sammy must trust Kain to keep her safe. She’s just not sure she can trust herself to resist temptation.Can't wait for Book 2. Thanks NetGalley for the arc in exchange for my honest review."}, {"userName": "Zili", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/18851333-zili", "userReview": "3.5 Stars in my Sky!The premise of Royally Bad is fun and entertaining. I liked the idea of the gangster prince and the wedding dress maker. I laughed more than expected, although I have to admit, not all of my laughter was necessarily in places where it was supposed to be. Certain elements were particularly far fetched - BUT this was also what I really enjoyed about Sammy and Kain's romance. The drama and escapism.Sammy is awkward and funny. I honestly wasn't sure what she was going to do or say next. She finds herself going from dress maker extraordinaire/unwilling wedding guest, to basically being deeply involved with the Band family and all aspects of Kain's life.I expected to love Kain but he didn't manage to totally win me over. I wasn't sure about how he treats Sammy at times or allows others to treat her whilst claiming to want the best for her. Don't get me wrong, he does bring on the swoon and I did like him, but just didn't love him.The story involves twists galore and although I did find some events hugely unlikely, I enjoyed the story and really wanted Sammy and Kain to find their unique HEA together...I received a copy from the publisher via NetGalley in exchange for an honest review!"}, {"userName": "Emily", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/4365117-emily", "userReview": "Sammy is trying to make a go of her business as a fashion designer for wedding gowns. When she meets Francesca Badd who buys a dress and her brother Kain pays a huge amount of money to make sure gown is done in time. One good deed leads Sammy inserted into the Badd family and straight in the line of Kain who has made his interest clear, he wants Sammy. Sammy knows he is a bad boy with a silver tongue and Sammy is having a hard time resisting. However, things get shooken up and Sammy wonders when she can get her life back and not under the careful watch of the Badd's.This was fun and thought it was filled with intriguing characters. I liked Kain and Sammy but had a couple of times where I scratched my head on things like her business. I would check out more in this series to see what happens with the rest of the characters."}, {"userName": "Yvonne Wood", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/44122602-yvonne-wood", "userReview": "Something missing with this book. It was just ok. Back to this review now I have made my apple cake and had a think. Kain and Sammy just did not connect for me. Irritated with this wishy washy gang who were not into really bad stuff like drugs and prostitutes so were really doing community service by not being as bad as the other gang. Nooooo. If you are a gang called Badd own it and if at the end you are better people then I can get it but at least run with being baaaaaaaad."}, {"userName": "Tessa", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/7071525-tessa", "userReview": "This was cute. I got it despite the almost scary title, (Bad Boy) and the mafia royalty mix because the premise just sounded fun. It was. I thought Sammy was strong and a little rebellious and Kain falling for her was super sweet. I did enjoy the Badd family and Fran was adorable, though like a mouse you give a cookie too. My issues with it were that they were royals. Really, in the storyline, it wasn't important. At all. Other than telling me they were, I didn't see it. Supposedly the next book should have it considering something said towards the end. My other issue was the ending was too nice. It could have been so much more, but it felt like an \"everything is now good, no bad stuff anymore\" ending. Something even happened that had me rolling my eyes, though it was foretold if you read between the lines. So, seriously cute but some bit of cheesiness that wasn't necessary. 3 stars"}, {"userName": "Maddy's Reading", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/26060010-maddy-s-reading", "userReview": "A gangster bad boy prince and a strong, hardworking wedding dress maker. The plot was very intriguing, a combination of fairy tail and mafia romance. The Badd family is similar to a mafia and Kain Badd is the young prince. He meets Sammy in relation to his sisters wedding and soon fate is pushing Sammy & Kain together everywhere. Their chemistry is amazing , connection strong and soon they are inseparable. Family and circumstances push them apart, can their love hold strong?It was a nice read though I felt there were too many angles to the plot. I wouldn't mind reading about the other Badd siblings though. Should be interesting. *~*~*ARC generously provided by the author in exchange of an honest review *~*~*"}, {"userName": "Tania's Book Blog", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/45726117-tania-s-book-blog", "userReview": "I voluntarily received an advance reader copy.This was not what I expected. Sammy and Kain meet when she made the wedding dress for his sister wedding. Things heated up quickly between both of them. Sammy tried avoiding Kain and Kain couldn't seem to stay away.Then his sister wedding was raided by the cops and Sammy needed Kain protection. This story took some unexpected twists that can't be revealed without spoiling.If you like mafia love stories with a touch of a heroine that is ballsy and a hero that is all alpha?! Grab this one."}, {"userName": "Wendy", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/31347698-wendy", "userReview": "Not sure what I think. I liked the romance ok and want to find out what happened between LuLu and her brother Costello, so I am going to continue the series. Was a three star read for me hope the next in the series a bit better."}, {"userName": "Jeanny", "userReviewDate": "Apr 05, 2017", "userURL": "http://www.goodreads.com/user/show/16737045-jeanny", "userReview": "2.5 stars"}, {"userName": "Maria11", "userReviewDate": "Sep 14, 2017", "userURL": "http://www.goodreads.com/user/show/44384250-maria11", "userReview": "OkOk listen. I listened to audible version in the car to work. I never got the urge to read the end like I do with most every audible book I listen to. It didn't capture me and I wasn't too keen with the characters. The voices make or break the story. The ones on this one had me laughing out loud at times. Not sure if I would like reading it instead of listening. Not bad not great."}, {"userName": "Chanpreet", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/5334800-chanpreet", "userReview": "4.5 stars!I am intrigued! The first book in this series is off to a good start. It's an interesting mix of organized crime, bad boy-good girl, and a mystery. The chemistry between Kain and Sammy is great and hot. I was a little confused at how it went from being hot to changing from sexy times to sweet times. It was almost like it happened on a dime. But I guess that makes sense since the shift in story changed from Kain and Sammy to everything that was going on around them in the Badd family. As much as I enjoyed reading about Sammy and Kain, I am extremely interested in finding out what is going or has happened in the Kain family to cause such problems."}, {"userName": "Barbara Melton", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/58549200-barbara-melton", "userReview": "Omg! This was such a great book! I loved Kain & his bad boy self! I'm glad Kain & Sammy got together"}, {"userName": "Jeninne", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/17933811-jeninne", "userReview": "Full disclosure, this book was free for Prime members on Amazon, and I fully went into it knowing I was probably going to think it was utter trashIt is trash. But it's utterly marvelous trash.I mean, I took my kindle with me to take a quick, relaxing bath, and ended up staying in for over an hour, laughing myself silly with this book. Because this thing is hilarious. It's amazing. It's the kind of trash that is more of a comedy than anything else, and I'm dying over here. I'm dying from how stupendously shit this book is.Here, here, don't take my word for it. Let me share with you some of my favorite passages. I bookmarked them because I just couldn't help myself. Obvious warning for foul language, explicit sexual content, and overall bad writing.On page 25 we have this exchange,  \"I'll jerk this cock off to thoughts of you, sweatheart. I especially like it because this is their second (third?) meeting, and this is definitely something you say to someone you're sexually interested in. Nothing feels better than knowing a guy is going to go off and jerk it to you. Page 32,  I want to see those tits of yours in all their glory. FYI guys, you know what really turns girls on? Talking about their tits. Nothing sets the mood like tits. Tits, tits, tits.Then we move along to page 146, to enjoy, ...I'm going to fill you up. I'm coming, I'm coming and coming, and I'm not going to ever stop.\" Now look, I get it, the author wants to impress upon you how virile and manly Kane is. He can just come forever. Impressive. Just what every girl wants. To have gallons of come in her. But upon reading this, one can't help but worry in a medical sense. I mean, he's never going to stop coming? Where's all that semen coming from? His balls? Are they the size of Mars? And how's he ever going to get anything done if he literally never stops coming?And finally, on page 152 (you're all reading along, right?) we've got the sensational, Fighting down my animal urge to rail her with my cock, I revved my motorcycle. I believe that one speaks for itself. Rawr.Look, this is a dime store kind of trash book. It's supposed to be just good fun. It's supposed to be for horny women who want to rub one out with some sexy characters. And that's fine. But the problem develops when you have anyone who's looking for a semblance of plot. I read this whole book. I still don't get why the bad guys were after the girl. I don't get why Kane suddenly went from douchebag with a hard on to knight in shinning armor with a heart on, in the span of twenty pages. I don't get why most things were happening. And I certainly don't understand how the end plot twist just came out of thing air, with no build up and no rational, and then became the focal point of the point.And hey, I may have read better sex scenes in fanfiction on AO3, but I'm okay with reading trash sex. I did grow up reading VC Andrews. But everything in this book seemed like it was written just to lead up to the sex, and that's cheap, dirty, and not enjoyable.But I'm not even mad with this book. It was free, I had a hell of a laugh with it, and in the end, I got to write this amusing review. So no hate. Just one star."}, {"userName": "✨Skye✨", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/30014834-skye", "userReview": "[ Sammie was a redeeming feature, I did like her and her awkwardness, even if she was a little (a lot) naive. I wasn't into Kain (I actually had to double check what his name was), he was just a caricature of the male love interest and I did have hope from the first description but then he just didn't really deliver. I did like the final scene where he proposed, the family dynamic is a good feature and he's an okay character independently, it's just the romance that didn't really appeal to me. I also liked Sammie's mother and their relationship, it was touching and one of the better relationships in this book. Fran was just ridiculous and over the top, the brothers were okay, I may read the sequels just to see where they go.  (hide spoiler)]"}, {"userName": "Gretchen  (About That Story)", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/3733940-gretchen-about-that-story", "userReview": "I really enjoyed the overall story. I liked the bit of mystery happening, the drama, and even this rather outrageous world that I'd entered. It had me hooked, wanting answers.Kain and Sammy were interesting characters although a bit over the top. I'll be honest, that first 20% was rough for me. Everything was instant and there was a lot happening and some of the wording made me feel like I maybe missed something. I was curious enough that I kept right on reading though. I'm glad I did because the story really picked up. I really liked Kain. He was an alpha tough guy but also super sweet. I liked Sammy in the beginning, I thought she was a pretty tough chick that didn’t put up with a lot of crap. Somewhere that seemed to change for me and I found her rather complacent, so by the end I was just neutral about her. They had an interesting connection, it’s like I got their connection, accepted their chemistry, but didn't always feel it. The other characters in the story where fine, I've got lots of questions about a few of them as I know their story will continue. I'm totally curious where it will go and plan on reading the next book in the series, Royally Ruined. I did have a few issues… I felt sometimes like things were glossed over or something was missing. The over the top-ness could be pretty extreme. The positive is there was a really good level of entertainment value underneath it all and that's what had me turning the page, reading on, wanting answers. The ending was kind of crazy, but it was par for the course and fit. I think somewhere along the lines I accepted this rather outrageous world and that's what made it fun.Totally enjoyable. Yes I had issues but that overall storyline is what sold me. :-)Complimentary copy received for honest review."}, {"userName": "Bette Hansen", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/11333561-bette-hansen", "userReview": "Fun readThis was a fun entertaining read. A bit silly at times, very sexy at others, entertaining always. I recommend this one."}, {"userName": "LeeAnne", "userReviewDate": "Apr 28, 2017", "userURL": "http://www.goodreads.com/user/show/23233270-leeanne", "userReview": "This was an awkwardly funny read – in some places it was great, in others not so much… and it was definitely far-fetched in more than once place which is why I’m only giving 3 stars. The premise was there but there were parts that were just to far out there to be believable.Kain Badd’s family is mafia-like and consider themselves royalty. Sammy is a wedding dress maker just trying to survive and keep her mother healthy. When Kain’s sister whirls into Sammy’s wedding dress shop, demands a wedding dress (for an exuberant amount of money) and makes a insta-friend out of Sammy – Sammy’s life changes forever. She’s now been dragged into the Badd family drama and to “keep her safe” Mr. Badd (Kain’s father) himself elects to literally lock Sammy away in his house for her own safety. Kain and Sammy’s attraction is immediate and though Sammy sometimes hates Kain’s attitude she’s quickly falling for him… then things turn really weird when Kain’s other siblings start showing up.This story was a little confusing with all the names being thrown around. The writing style was okay and the storyline wasn’t terrible it just lacked realism. The Badd family literally locks Sammy up in a room for months and won’t let her out for anything “for her own safety” and the entire book there are hints about Kain’s older sister being a bigger part of the story but we’re really left hanging without a clue as to what is actually going on there. I didn’t like that the book left off with so many unanswered questions. On the bright side – I not only really liked both Sammy and Kain’s characters I’m intrigued enough about Kain’s sisters story that I’ll definitely be keeping my eyes peeled for the next book in the series. Hopefully it’ll answer the burning questions!I received a free copy of this book to read and review for Wicked Reads."}, {"userName": "April Symes", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/4034227-april-symes", "userReview": "Royally Bad by Nora Flite is a new book in her The Bad Boy Royals Series. I wasn’t sure if I would like it but I adored it!!Sammy is a wedding planner and talented wedding dress designer. Then we have Kain Badd and his crazy family. Not only royalty, rich and famous, no they are connected to the underworld too.Completely desperate to make a big sale Sammy gets involved with the Badd family in order to keep her business going. Little does Sammy know that Kain Badd will be the/her royal pain in the butt but also her knight in shining armor. Kain thought that he was only helping out his lil sister but when he gets a load of Sammy, its like instalove and instalust all at once for Kain. There are many twists and turns in this romantic yet at times funny look at how love happens between “ royalty and the pauper “ . This book was full of drama, suspense, action , romance ,awesome sex scenes and a great HEA. You are drawn in from page 1 and cant stop reading until the very end. I hated for the story to end so I am glad there is a book 2 in this series on the horizon. I would definitely recommend this book to anyone who enjoys this type of story. My rating: 4.5 stars **** \"I voluntarily reviewed an Advance Reader Copy of this book in exchange for an honest review***"}, {"userName": "Estella", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/22070101-estella", "userReview": "Kain Badd looks great on paper: rich, handsome, and he’s even a prince. But after spending a few minutes together, Sammy sees the real him—arrogant, possessive, and too hot for his own good. If she hadn’t agreed to help plan his sister’s wedding, she could have avoided him. Instead, she’s waking up in his bed after an unforgettable night she definitely wants to forget. But he won’t let her.When Sammy thinks her life can’t get any crazier, the wedding is raided by the police, and she spends her first-ever night in jail. The irresistible Kain isn’t just bad in name—his family is connected to a dangerous underworld. Now she’s mixed up in a power struggle between his family’s empire and their rivals. She has no choice but to put herself back in this filthy prince’s extremely capable hands.Sammy must trust Kain to keep her safe. She’s just not sure she can trust herself to resist temptation.I found this book on kindle unlimited and decided to give it a try. I am so glad I did. This story has a lot of twists and turns and I loved every minute of it. If you like some action and drama with your romance then look no further. I'm looking forward to the next book in this series."}, {"userName": "Nina {ᴡᴏʀᴅs ᴀɴᴅ ᴡᴀᴛᴇʀ}", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/5386619-nina-s", "userReview": "Average rating for an average read. Not bad but not terrible either! Bought it because it was either cheap to free and read it because it's small lol. I think the idea is interesting! And I suppose because this isn't a genre I usually read/review there's not much to say except: 1) I don't like the main female. She was not perfect but also was portrayed as too willing. But her ending was better than her beginning. 2) The main guy was hot but his portrayal was sooooo typical. But he was nice to the main character and he developed a bit. 3) Plot....was mainly romance focussed so any hard plot developments are done in the background, only coming up to the forefront when the romance needed it. 4) Kain's older brother looks to be an interesting story. 5) Would have liked to see more development of character for everyone. oh and 6) The father is totally crazy!!!! Overall, a quick effortless read. No brains or even solidifying of emotions needed!"}, {"userName": "♡ Jeri's Book Attic ♡  I am ", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/20537528-jeri-s-book-attic-i-am", "userReview": "Not sure what to think about this book. The story is interesting in total and well written but I had a slight problem with the writing style. Somehow it felt like it was wandering from a romantic comedy to a slightly dark romance and back.And in my mind those two genres do not mix. It felt like the author wanted to much and could not decide in which direction the story should go.The whole setup was kind of confusing and intense and then again meant to be funny – it might be only me so you should give the story a try…═══ PLEASE SUBSCRIBE / LIKE / FOLLOW US ════Blog : http://www.jerisbookattic.comFB Page : https://www.facebook.com/JerisBookAtticTwitter : https://twitter.com/JeriTRyanGoodreads : https://www.goodreads.com/user/show/2...Bloglovin : https://www.bloglovin.com/@jerisbooka..."}, {"userName": "Konny", "userReviewDate": "Mar 25, 2017", "userURL": "http://www.goodreads.com/user/show/30952995-konny", "userReview": "Royally Bad by Nora Flite is the first book in The Bad Boy Royals Series.Meet Sammy, a wedding planer and talented wedding dress designer. And Kain Badd and his crazy family. They are not only royalty, rich and famous, no they are connected to the underworld too.Kain meets Sammy and is instantly smitten with her. But he where not a Badd if where not arrogant, rich and handsome.This book put me through the wringer. Sometimes I couldn´t tell up from down. There´s drama, hate, enemies and stubborn , stubborn men.A story about broken families with very unexpected twists and turns and a lovestory, a beautiful lovestory.I liked this book and rate it 4 Stars. Thank you Nora Flite!"}], "description": "Getting close to an arrogant bad boy like him is dangerous. Too bad it’s her only choice.\nKain Badd looks great on paper: rich, handsome, and he’s even a prince. But after spending a few minutes together, Sammy sees the real him—arrogant, possessive, and too hot for his own good. If she hadn’t agreed to help plan his sister’s wedding, she could have avoided him. Instead, she’s waking up in his bed after an unforgettable night she definitely wants to forget. But he won’t let her.When Sammy thinks her life can’t get any crazier, the wedding is raided by the police, and she spends her first-ever night in jail. The irresistible Kain isn’t just bad in name—his family is connected to a dangerous underworld. Now she’s mixed up in a power struggle between his family’s empire and their rivals. She has no choice but to put herself back in this filthy prince’s extremely capable hands.Sammy must trust Kain to keep her safe. She’s just not sure she can trust herself to resist temptation.", "title": "Royally Bad\n      \n          (Bad Boy Royals #1)", "url": "http://www.goodreads.com/book/show/33016164-royally-bad?rto=x_gr_w_carousel_bp", "average": 3.69, "cover": "https://images.gr-assets.com/books/1487330231l/33016164.jpg", "reviews": 197, "authors": [{"url": "https://www.goodreads.com/author/show/7103149.Nora_Flite", "name": "Nora Flite"}], "type": ["Romance", "Did Not Finish", "Contemporary", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/22391554-only-pretend", "http://www.goodreads.com/book/show/29614299-billion-dollar-bad-boy", "http://www.goodreads.com/book/show/24081037-last-of-the-bad-boys", "http://www.goodreads.com/book/show/20698779-hard-body-rock", "http://www.goodreads.com/book/show/27423061-the-bad-boy-arrangement"]}