{"ratings": 3074, "userreviews": [{"userName": "Mimi", "userReviewDate": "Dec 16, 2011", "userURL": "http://www.goodreads.com/user/show/2690037-mimi", "userReview": "Having read Joy Luck Club, The Kitchen God’s Wife, The Bonesetter’s Daughter and A Hundred Secret Senses, I can honestly say that I am a die-hard Amy Tan fan! So I was so excited when I saw that she had written Rules for Virgins, a short novella spoken in the voice of an aging courtesan who is providing advice and “on-the-job” training to a virgin courtesan in China on the proverbial “eve” of her deflowering.Like Ms. Tan’s other stories, the main theme revolves around traditional female roles in Chinese culture, but this time it addresses the role that the courtesan played in this society. Through this first-person advice session, the reader both learns the intricate technicalities of successful courtesanship, while also empathizing with the likes of young Violet, who is destined to have her heart broken and suffer a lonely, loveless life. I am happy that Ms. Tan is working on a new full-length novel, The Valley of Amazement, to be released in Fall 2012. Welcome Back, Amy!"}, {"userName": "Riley", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/305343-riley", "userReview": "Not really a STORY, which bothered me. I'm a big Amy Tan fan, but this didn't have any of the traits that I usually admire in her work. The writing was fine, but empty. There was no emotion, no character development, no... movement. It was essentially a bunch of research presented as a monologue. Interesting/informative? Sure. But I expect more from Amy Tan than just that.HOWEVER. If you look at this story simply as setup for Valley of Amazement -- the characters, the setting, the frame of mind -- then it at least accomplishes something, because I am interested in seeing an actual STORY blossom from this seed."}, {"userName": "Jennifer ", "userReviewDate": "Dec 28, 2011", "userURL": "http://www.goodreads.com/user/show/5685328-jennifer", "userReview": "In 1912 Shanghai, being a courtesan is more than a career, it's a chance at independence. A smart girl can leverage a few years of seduction into a lifetime of security. Fortunately for new girl Violet, she's got famous former courtesan Magic Gourd to guide her. It's not just about pleasing rich men, it's about making alliances and planning for the long term. Violet has the youth and beauty, and Magic Gourd has the experience and a strategic mind any general would envy. This is a beautiful piece of work. Perhaps not what you've come to expect from Amy Tan, but that's in no way a bad thing. This is what a military campaign would look like if you dressed it up in silk and set it loose on society. Think of those genteel southern ladies with a core of steel - they'll crush you underfoot while you apologize for making them get up - and you'll understand the tone here.  Magic Gourd lays out a manual for success through seduction - she's got plans, strategic retreats, and second strikes organized and ready to go. Fans of Memoirs Of A Geisha and A Geisha's Life will recognize the businesslike approach, but be warned, Magic Gourd is not one to worry about Violet's delicate sensibilities. They're selling sex, and the only thing that matters is putting it in a package that will net them the highest price.  Ultimately this is a tale of women's liberation. You use what you have, give men what they want, and charge them for the privilege. Youth and beauty don't last, but if you play your cards right you'll have enough to live the rest of your life on your own terms, and that is something you can't put a price on."}, {"userName": "Rebecca Huston", "userReviewDate": "Dec 07, 2011", "userURL": "http://www.goodreads.com/user/show/4091267-rebecca-huston", "userReview": "A lovely, bawdy, novella that is set as a series of lessons given to a young courtesan by her older companion of the perils and advantages of working as a courtesan to Shanghai's elite in the early 20th century. Some might be disturbed by the content, but most should enjoy this one. Tan's first fiction in more than six years; it's very good to see that she hasn't lost her touch."}, {"userName": "A. Gulden", "userReviewDate": "Jul 04, 2013", "userURL": "http://www.goodreads.com/user/show/2193179-a-gulden", "userReview": "I will accompany you on the zither until your warbled notes don’t sound like two cats screeching over the same dead mouse.Mosquito pressYou are too young to know yet what nostalgia truly means. It takes time to become sentimental. But for the sake of your success, you must quickly learn. When you touch a man’s nostalgia, he is yours.They make men think all flowers are pickpockets of the heart. You won’t find any courtesans like that in this house, so don’t you become one.Here, we don’t go back and forth on the price. It is three dollars for a party, and it does not include riding on the stem. No argument.Some of my clients reached the heights through eyes alone. You think that’s victory? Ha. Once the stem shrinks to normal, the man is no longer urgent. He’s content to go home.We all thought he should have had his stem cut off and fed to the dogs, and the madam of the house thought so, too. She hired gangsters to track him down, and let’s just say that they fed that dog much more than his stem.There is a type who thinks he can order up any kind of sex, like dishes on a menu.Whatever any man requests, you should never degrade him for his desires, nor should you accept being degraded. If he’s drunk and pisses on you, ring the chimes and I will come and remove him from your room. Don’t accept extra money to let him do these things. You know what happens to a woman who lets herself be degraded? She winds up with a pimp and lies on the floor of a chophouse, where rickshaw pullers and laborers fuck her, one after another, a hundred a day. She never has a chance to close her legs or her mouth until she’s pounded into raw meat and dies. I’ve always wondered why those women don’t kill themselves. Maybe they think it’s their fate and if they endure it they will have a better life in the next. I would rather kill myself and return as a fly.Just remember there is a difference between giving a man a glimpse and letting him examine the goods in detail.Tomorrow, Vermillion’s maid will come with her threads and remove all the hair from your pudendum, armpits, and upper lip. A virgin must be pure white. And right now you are as hairy as a man. Curly hair on the pudendum is unattractive, like seaweed, not at all silky.You might be with a man who seems quite virile at the party but is ashamed later that his warrior was more of a foot soldier."}, {"userName": "Angel", "userReviewDate": "Jun 14, 2013", "userURL": "http://www.goodreads.com/user/show/9325831-angel", "userReview": "This is an eye-opening novella about the literal rules for virgins in 1912 Shanghai. I didn't know what to expect when I first bought this ebook well over a year ago, however, I was pleasantly surprised.I would definitely not recommend this novella for all ages, but maybe rated R audiences. It has moments of an extremely detailed sexual nature, and although I am an adult myself, I was a bit taken aback by how brazen and descriptive this was.As novellas go, this was a relatively quick read that I finished between 2 sittings. It is told from the first person point of view from a well-traveled concubine to her predecessor, a younger girl who has not yet been introduced into the society yet. I would liken this to \"Memoirs of a Geisha\" in that way, however, it is far more detailed and at times a little too dirty!I would re-read this novella again because it is short and precise, however I was not over the moon about it in some ways. I wish it had been longer and more than simply a dictation of the dos-and-donts of the world. If this were to be drawn out into a full novel, I would be extremely excited and impressed."}, {"userName": "Kristen", "userReviewDate": "Dec 26, 2011", "userURL": "http://www.goodreads.com/user/show/3939564-kristen", "userReview": "Goodness, these are an awful lot of rules. I pity the poor girl who has to memorize them (and all of those songs!). The whole thing does seem rather daunting. That being said, this seems a little unusual given what I'm used to from Amy Tan. It's a bit more explicit than what I've come to expect from her. But the best thing I can say about this is that it whet my appetite. I'm relieved to find out that it's an excerpt from a forthcoming novel because I'd quite like to learn about the wider narrative that it comes from. I particularly enjoyed the very last line. Magic Gourd is often amusing in her plain-spokenness, although I'm more intrigued about her story, especially after the few cryptic hints she includes about her past as a courtesan. It's interesting to think that there were tabloids back then or something akin to them. I wonder if that's true.I once saw a movie about courtesans in Shanghai. It wasn't a very interesting movie but I'd certainly like to see where Amy Tan plans to take this story. I hope that in the actual novel, we get to learn more about both Magic Gourd and Violet, especially about Violet's relationship with her mother. 3.5."}, {"userName": "George", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/1021218-george", "userReview": "MUCH BETTER THAN ‘SAVING FISH FROM DROWNING’.“…you must know all the arts of enticement and master the balance of anticipation and reticence.”—page 5Reading a bit like a big bag of fortune cookies, the message of Amy Tan’s latest, Byliner Publication (Great writers. Great stories. Readable in a single sitting.), ‘Rules for Virgins,’ seems to be that performance art will always be improved by good management, good training, and attention to detail. There is, however, a subtle, lyrical and gentle, tongue-in-cheek quality to this short story that is all original Amy Tan—and that is refreshing.Recommendation: I don’t know if $3.00 is a reasonable price for a less than thirty-six page short story, but I’ll still recommend ‘Rules for Virgins’ as an entertaining, very quick, read. And, where ‘Saving Fish from Drowning’ had me swearing off Miss Tan’s writing forever, ‘Rules for Virgins’ has me looking forward in happy anticipation to reading her forthcoming novel, ‘The Valley of Amazement’.“You must be attentive to filling the half-empty cup.”—page 6A Barnes and Noble NOOKbook, 36 pages"}, {"userName": "Marieke", "userReviewDate": "Dec 14, 2011", "userURL": "http://www.goodreads.com/user/show/1386971-marieke", "userReview": "When i first started reading this i was doubtful i'd like it. but i changed my mind fast. it was fun, interesting, and...odd? i'm not sure how to describe it. i learned a new word i should be ashamed to type here so i'll just say it kind of sounds like pendulum but doesn't mean anything like pendulum. if you want to know what i'm talking about, you'll just have to read this. haha.also, i think i saw somewhere that this story is either part of or the foundation or something of a novel. i hope that is true and that i didn't dream it/make it up. i can definitely see how it could work that way and i am actually looking forward to finding out what happens with Violet (i hope she doesn't get burned with the potions of other jealous courtesans! or hang from a chandelier and break her arm! or god forbid turn into a common streetwalker!). This was very different from either The Kitchen God's Wife or The Joy Luck Club, which at first felt strange, but like i said above, i really liked it."}, {"userName": "Blake Charlton", "userReviewDate": "Oct 13, 2012", "userURL": "http://www.goodreads.com/user/show/2698100-blake-charlton", "userReview": "a monolog delivered from an older shanghai courtesan to a younger one. no so much a narrative as the outline of one, rich with research of the culture and history of the early 1900s. again, there is no plot, but one senses the great, seductive novel that shines behind this monologue (and perhaps may one day see light?) however, in it's present incarnation, 'rules,' boiled down to its essence, is well-written, soft-core, historical porn. meaning, that yes, if your still reading this review, you would most likely enjoy it."}, {"userName": "Julie", "userReviewDate": "Nov 09, 2012", "userURL": "http://www.goodreads.com/user/show/1066511-julie", "userReview": "Yuuuuuck. Did Amy Tan just wake up one morning and decide she wanted to write this? Did she get bored? It's basically instructions to a new courtesan. Like reading Memoirs of a Geisha, but set in China and possibly more explicit. Meh. I probably would have given up on it but I think I paid 2 or 3 bucks for this story.***edited to add***Ok, this makes more sense now that I know it's an excerpt from a forthcoming novel. It still seems like an odd bit to just yank out as a short story (pretty explicit) but I'm glad to know that Violet and Magic Gourd have some actual PLOT coming."}, {"userName": "Onka", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/4908061-onka", "userReview": "I have to admit that this one was quite surprising! I know the title says “Rules for Virgins” but I definitely didn’t expect it to be this list of rules. However, it doesn’t mean I didn’t enjoy it! I love Amy Tan’s writing and I love to learn more about foreign cultures and traditions (especially Eastern) and this was, well, educational! And also quite graphic so I would not recommend it to younger readers."}, {"userName": "Janyne", "userReviewDate": "Mar 11, 2012", "userURL": "http://www.goodreads.com/user/show/2953856-janyne", "userReview": "Rules for Virgins is a vignette written from the point of view of an assistant giving advice to the 17-year-old Violet about her newly acquired role of courtesan in Shanghai circa 1912. I gave it four stars because it is tightly written. Once again, Amy Tan shows us that she is a great wordsmith."}, {"userName": "Jeffrey Matthews", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/15647144-jeffrey-matthews", "userReview": "It was very interesting. It had many aspects of Dictionary of Mutual Understanding (had to have help remembering the exact title). I liked this book."}, {"userName": "Julie Ehlers", "userReviewDate": "May 26, 2015", "userURL": "http://www.goodreads.com/user/show/2120450-julie-ehlers", "userReview": "This was interesting in more than one way. I need to read Valley of Amazement, stat."}, {"userName": "Fabrianna", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/2117841-fabrianna", "userReview": "Quick & unedited review (hope it makes sense!) ... I love historical fiction & this novella explores a niche I’ve not yet read about in this kind of detail. Tan handles the explicit sexual content with some humor and it’s the briefness is the format feels fitting - almost like the virgin sneaking a peek but not looking for too long. It’s fascinating to reflect on this lifestyle having been a social status quo compared to the society’s current view of sex & morality. In the current world of slut shaming, it’s also interesting to think about the rising movement to empower and remove the stigma of sex workers today in contrast to a time when many some women used sex work to obtain financial independence (in a society & time where women had even fewer rights and perceived value). Without getting to heavy, she reminds the reader of the hazards of the work and the social constructs that made this work the only viable option for some (young) women and girls. The personal history that motivated Tan to research and write this story is also interesting. I appreciate her imagination in making the general historical events come alive with these two particular main characters. Both light & weighty at once; I’m between 3-4 stars on this one."}, {"userName": "Brooke", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/23558257-brooke", "userReview": "This wasn't a story. It was just a monologue. Yes, it's informative about it's topic, but there's no character development, no climax, no description. It's just one woman talking the entire time. I guess it's possible I didn't get anything out of it because it just wasn't particularly interesting to me. I gave it two stars because the author did elicit a little sympathy from me, though I'm not even sure that was her purpose. I felt sad to be reading about a girl who was only 14 and she's being told she'll live the rest of her life never finding real love. But since I also found it boring, I was just in a hurry to finish it, which was no problem considering it's only 43 pages long.This is the first thing I've read by Amy Tan. I hope her other works aren't as bland as this one."}, {"userName": "Nick Rogers", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/28039131-nick-rogers", "userReview": "I really enjoyed the flowing narrative, gentle in description yet full blooded in content and meaning. The advice given to Violet could work in other walks of life. You don't know at what point the advice will end or which direction it's going, which adds to its mystery. I'm not familiar to the Far-eastern courtesan genre. I can see why the culture and customs are so interesting to readers in the West, as well as other different cultures.I would have given it 5 stars, but it gets a little repetitive. It's only 100 pages or so, which is perfect. Any longer and the narrative might have become irritating. On the whole, I really enjoyed it and look forward to reading more of Amy Tan"}, {"userName": "Cris Anne Imperial", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/6510596-cris-anne-imperial", "userReview": "Short and sweet, full of lovely and tragic truths and tips. Rules for Virgins is something that you can easily read and something that is narrated in a not-so-heavy tone but is in fact, very tragic. This is pain romanticized and printed. A woman's defloration told in powerful and flowery words that seemingly hides the true pain in the act. The only reason why I didn't give five stars is that there didn't seem to be a story. I was expecting that there will be a plot, along with the tips entwined in the pages. Overall, I still liked it and it didn't take too much effort to read and finish."}, {"userName": "Jeannie Mills", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/2340895-jeannie-mills", "userReview": "It was grossly graphic and a waste of time. I have enjoyed most of Amy Tan’s books, so I expected to like this one. It’s a good thing that I had the audio and that I had no other audio for my car (and that I was alone in my car!)Thankfully, it was a novella and only two discs. What a disappointment!"}, {"userName": "Jacqui Hencsie", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/2519620-jacqui-hencsie", "userReview": "Novella by the author of the Joy Luck club, would be interested in reading the novel this is supposed to lead to"}, {"userName": "Ranjini", "userReviewDate": "May 12, 2017", "userURL": "http://www.goodreads.com/user/show/48440791-ranjini", "userReview": "It's the first book by Amy Tan that I have attempted.Loved the writing - but the subject just didn't work for me.I should have researched a bit more before taking the plunge with this one."}, {"userName": "Patzia", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/3129641-patzia", "userReview": "Audible. It is part of a longer book"}, {"userName": "Sarah", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/2470452-sarah", "userReview": "As always, Amy Tan's pieces are incredibly well written. Her voice is strong and imbued in every word."}, {"userName": "Eletta0925 Fouche", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/2413259-eletta0925-fouche", "userReview": "This short story was interesting. It seems to be a prelude to Valley of Amazement. Nice short read. Can be read in two hours."}, {"userName": "Mercedes", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/51888563-mercedes", "userReview": "This is an excerpt from Valley of Amazement and gives a glimpse into the mysterious world of Shanghai courtesans at the turn of the 19th/20th century. It takes place in the High Class House of Vermillion. Violet has literally been 'Shanghaid' into the profession and is receiving instruction on how to conduct herself by her now attendant a former top 10 Shanghai beauty (no.6) she was previously Magic Cloud, now she is over 30 she is Magic Gourd and now an attendant. Instructing Violet in the manners and deportment expected of her, or they will both be on the streets. A ruthless profession in ruthless times, just after the overthrow and end of the Manchu Dynasty."}, {"userName": "Heidi Mann", "userReviewDate": "Aug 10, 2012", "userURL": "http://www.goodreads.com/user/show/8572628-heidi-mann", "userReview": "This is a short work (a \"Kindle Single\"). I had not read anything by Amy Tan previously, but this sounded so intriguing that I figured I'd shell out the $1.99. Written in the voice of an \"attendant\" talking to a \"virgin courtesan\" in 1912 Shanghai, teaching her the many aspects of what to expect as she prepares to begin her \"career,\" the wording runs the spectrum from euphemistic (\"defloration\") to raw (a few times, she uses the word \"fuck\" as casually as one might say, in open conversation, \"sleep with\" to refer to having sex). What I gained from this book was a grasp of the reality (I trust Tan writes out of authentic knowledge and research) that working as a courtesan in that time and place was (at least at its best) an entirely different thing from being a prostitute. There was an entire culture framing the lives of these girls and young women -- as well as of the men (often married) who become their \"suitors\" and \"patrons\" and of the suitors'/patrons' wives. That is to say, it was apparently well known to and accepted by the wives that their husbands spent time with courtesans. The attendant even refers to men taking their sons (she doesn't mention age, but I gather young to mid-teens) to visit a courtesan to be trained in what to do to be intimate with women. Certainly, to our contemporary U.S. sensibilities (though I realize, even in saying that, that the U.S. is not composed of just one culture when it comes to what is considered sexually acceptable), the descriptions in this book are mind-boggling, to say the least. But the power in the book is how it can lead you to stand outside your ingrained understandings of propriety and accept, if nothing else, the idea that, in a different culture, the interactions portrayed in Rules for Virgins are not \"wrong\" or \"abusive\" or \"perverted\"; they just are."}, {"userName": "Erin (PT)", "userReviewDate": "Dec 11, 2011", "userURL": "http://www.goodreads.com/user/show/2285338-erin-pt", "userReview": "I'm reading an anthology of short stories at the same time that I read this and, in one sense, Tan's short story illustrates exactly what I'm not enjoying about the other book; that is, it's a lucid and linear story that creates its setting and characters in a straightforward way that invites me in immediately and allows me to immerse in the story from the outset. One of the things I like most about Tan's work is that she writes about worlds that I'm not functionally familiar with, but writes about them in ways that are eminently relatable. I wasn't completely clear about the time frame of Rules for Virgins and, for obvious reasons, not all of it is entirely relevant to a modern woman, but there's an unselfconscious straightforwardness to the advice offered by our narrator that makes me wish I'd had (and other women could have) this kind of pragmatic advice as a sweet, young thing on the cusp of sexual womanhood. That being said, the lack of larger context (or perceptible context, because people more familiar with the culture and setting might have gotten contextual clues that went over my head as an American of a different race/culture) or deeper characterization than is possible in such a short story, my suspension of disbelief was marred by my uncertainty whether I was supposed to take the narrator as reliable or not (my default setting is not) and so I kept waiting for some twist or reveal that never came. Which, as I said, can be my fault as a reader, for assuming all narrators are unreliable. But it definitely affected my reading experience. As well, the story's ending felt abrupt and lacking in oomph, which made it feel like a pleasant and interesting reading experience, but not one that's going to stick with me for any length of time. A nice time-waster, basically."}, {"userName": "Vicky", "userReviewDate": "May 21, 2012", "userURL": "http://www.goodreads.com/user/show/5249353-vicky", "userReview": "I'm not sure how I fell about this book, actually I think it's more the approach of the subject, of how by presenting the seduction and the sexual act as work, as a way to earn a living, as a choregraphy learnt perfectly it dehumanises the story for me. Don't get me wrong, I can certainly understand that for some people, or characters, sex is work, that's not what is bothering me. It's a long monologue, an experienced older woman educating a virgin in the ways of her budding \"career\". What bothers me is that it seems \"flat\", no high, it feels like everything is on the same tone, that there's information which must be transferred from one person to the next and it's simply being done. What I'm thinking is that there must be something that this woman liked in her life, there must have been moments that she enjoyed and I'm not necessarily talking about sex, it could have been the singing, the clothes, the competition, the money, whatever! Or maybe something that she hated. I think you get my point, what I'm getting at. The thought that the more experienced woman might be trying to relive her \"good younger years\" through her pupil did cross my mind while I was reading, so there must be some implied emotional reaction on her part somewhere for the thought to come to me but, it's not enough... It is wonderfully written, mrs Tan is a great writer, but it feels too static to keep my interest, good thing it was a short read. I need feeling somewhere, I need to feel what characters are feeling. The term that comes to mind is \"cold\" to described it. Too bad because I thought the setting was interesting, it sparked my curiosity."}, {"userName": "Judie", "userReviewDate": "Jan 02, 2013", "userURL": "http://www.goodreads.com/user/show/1450352-judie", "userReview": "Rules for Virgins is a short work from author Amy Tan which is basically a manual of sorts for a virgin courtesan, Violet, preparing for the night of her \"defloration\". It was set in Shanghai yet it reminded me a lot of Memoirs of a Geisha. So many rules, etiquette, and strategies to follow, not only for the night, but for her viability in the days to come. They're part of a house that sells sex and they view it as a legitimate business with systematic processes and procedures in order for you to thrive.I liked this because it's something we don't have in modern times (well, I hope!). Amy Tan has her way of telling a reader how seduction and the sexual experience go, both in a straight-forward and business-like manner and as an erotic experience.I read somewhere that this is short because it is part of a longer novel from Ms. Tan. I will be on the lookout for that expanded work. For now, I will share one of the favorite quotes I electronically dogeared from the book:\"Just remember, the first week is the most profitable. After that, you are no longer a virgin. Interest in you falls, the gifts are less. This happens to young beauties. Once they've sold their inexperience, no one wants the rest of their inexperience. That's what I'm teaching you: to use your brain as cleverly as you use your hips and mouth.\""}], "description": "In her startlingly sensual new story, “Rules for Virgins”—this 43-page jewel of a tale is the first fiction she has published in six years—beloved bestselling author Amy Tan (“The Joy Luck Club,” “The Bonesetter’s Daughter”) takes us deep into the illicit world of 1912 Shanghai, where beautiful courtesans mercilessly compete for the patronage of wealthy gentlemen. For the women, the contest is deadly serious, a perilous game of economic survival that, if played well, can set them up for life as mistresses of the rich and prominent. There is no room for error, however: erotic power is hard to achieve and harder to maintain, especially in the loftiest social circles. Enter veteran seducer, Magic Gourd, formerly one of Shanghai’s “Top Ten Beauties” and now the advisor and attendant of Violet, an aspiring but inexperienced courtesan. Violet may have the youth and the allure, but Magic Gourd has the cunning and the knowledge without which the younger woman is sure to fail. These ancient tricks of the trade aren't written down, though; to pass them on to her student, Magic Gourd must reach back into her own professional past, bringing her lessons alive with stories and anecdotes from a career spent charming and manipulating men who should have known better but rarely did.The world of sexual intrigue that Tan reveals in \"Rules for Virgins\" actually existed once, and she spares no detail in recreating it. But this story is more than intriguing (and sometimes shocking) historical literary fiction. Besides inviting us inside a life that few writers but Tan could conjure up, the intimate confessions of Magic Gourd add up to a kind of military manual for the War of the Sexes’ female combatants. The wisdom conveyed is ancient, specific, and timeless, exposing the workings of vanity and folly, calculation and desire that define the mysterious human heart.", "title": "Rules for Virgins", "url": "http://www.goodreads.com/book/show/13144428-rules-for-virgins", "average": 3.4, "cover": "https://images.gr-assets.com/books/1328112246l/13144428.jpg", "reviews": 232, "authors": [{"url": "https://www.goodreads.com/author/show/5246.Amy_Tan", "name": "Amy Tan"}], "type": ["Fiction", "Historical", "Short Stories", "Cultural", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/13144428-rules-for-virgins", "http://www.goodreads.com/book/show/13172161-rules-for-virgins", "http://www.goodreads.com/book/show/14598127-rules-for-virgins", "http://www.goodreads.com/book/show/7763.The_Joy_Luck_Club", "http://www.goodreads.com/book/show/12555.The_Bonesetter_s_Daughter", "http://www.goodreads.com/book/show/12557.The_Kitchen_God_s_Wife", "http://www.goodreads.com/book/show/690866.The_Hundred_Secret_Senses", "http://www.goodreads.com/book/show/17383934-the-valley-of-amazement", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}