{"ratings": 14965, "userreviews": [{"userName": "Ryan Boissonneault", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/24035606-ryan-boissonneault", "userReview": "I see many five-star reviews here, so here is the contrarian position. I’m giving this one star for a couple of reasons. 1. The content does not justify the length of the book. When you strip away the pseudo-profundity and verbosity, you’re left with rather simple ideas you could find in any self-help book or discover on your own. Rule # 1, for instance, essentially states that females prefer males with confidence and that success breeds confidence and further success. This is rather obvious without having to understand the evolutionary history of lobsters. 2. The introduction of the book presents the author as an objective investigator of the truth, disillusioned by dogmatic ideology and prepared to demonstrate its dangers. He then proceeds to incessantly quote from the bible, perhaps the most dogmatic text ever written. I didn’t purchase the book to be preached at, and found it unexpected and highly obnoxious. I understand that the author is interested in story and “archetypes,” but the bible is quoted out of proportion. There are many ancient stories to choose from, each with endless interpretive possibilities, but the bible is, for some reason, the primary text. Now I’m sure this is fine with many people, but I was unpleasantly surprised that I had purchased a book on biblical criticism or theology. The stories the author has selected to focus on, his preferred interpretations, and the stories he ignores, says more about his psychology than anything else. It appears that he NEEDS religion to be true to prevent his own nihilistic tendencies, a viewpoint he foists on his readers. More than once he states in no unequivocal terms that Jesus is the “archetypal perfect man.” Perhaps, but without getting into it here, there are many reasons to think perhaps not. For those more philosophically inclined, or for those that appreciate the progress of humanism and science, Socrates, for example, would probably be a better fit for the archetypal perfect man. And if I want insight into morality and human nature from an ancient source, I’d turn to Plato and Aristotle before the Good Book. Again, this is all too subjective, which is the problem in general with using “ancient wisdom” to support a particular viewpoint. The author presents his interpretive schemes as objective truths about human nature and the only display of humility is found in the introduction.--------------------------------------For those seeking an alternative to Jordan Peterson’s dark vision of the world, questionable approach to truth and knowledge, and retreat to religion, they will find the answer in Bertrand Russell, whose essays on religion seem to, at times, be speaking directly to Peterson himself. Here’s the final paragraph from Russell’s essay Why I Am Not a Christian:\"WHAT WE MUST DOWe want to stand upon our own feet and look fair and square at the world—its good facts, its bad facts, its beauties, and its ugliness; see the world as it is, and be not afraid of it. Conquer the world by intelligence, and not merely by being slavishly subdued by the terror that comes from it. The whole conception of God is a conception derived from the ancient Oriental despotisms. It is a conception quite unworthy of free men. When you hear people in church debasing themselves and saying that they are miserable sinners, and all the rest of it, it seems contemptible and not worthy of self-respecting human beings. We ought to stand up and look the world frankly in the face. We ought to make the best we can of the world, and if it is not so good as we wish, after all it will still be better than what these others have made of it in all these ages. A good world needs knowledge, kindliness, and courage; it does not need a regretful hankering after the past, or a fettering of the free intelligence by the words uttered long ago by ignorant men. It needs a fearless outlook and a free intelligence. It needs hope for the future, not looking back all the time towards a past that is dead, which we trust will be far surpassed by the future that our intelligence can create.Russell wishes to replace fear, religion, and dogma with free-thinking, intelligence, courage, knowledge, and kindness. To believe something because it is seen to be useful, rather than true, is intellectually dishonest to the highest degree. And, as Russell points out elsewhere, he can’t recall a single verse in the Bible that praises intelligence. Here’s Russell in another essay, titled Can Religion Cure Our Troubles:Mankind is in mortal peril, and fear now, as in the past, is inclining men to seek refuge in God. Throughout the West there is a very general revival of religion. Nazis and Communists dismissed Christianity and did things which we deplore. It is easy to conclude that the repudiation of Christianity by Hitler and the Soviet Government is at least in part the cause of our troubles and that if the world returned to Christianity, our international problems would be solved. I believe this to be a complete delusion born of terror. And I think it is a dangerous delusion because it misleads men whose thinking might otherwise be fruitful and thus stands in the way of a valid solution.The question involved is not concerned only with the present state of the world. It is a much more general question, and one which has been debated for many centuries. It is the question whether societies can practise a sufficient modicum of morality if they are not helped by dogmatic religion. I do not myself think that the dependence of morals upon religion is nearly as close as religious people believe it to be. I even think that some very important virtues are more likely to be found among those who reject religious dogmas than among those who accept them. I think this applies especially to the virtue of truthfulness or intellectual integrity. I mean by intellectual integrity the habit of deciding vexed questions in accordance with the evidence, or of leaving them undecided where the evidence is inconclusive. This virtue, though it is underestimated by almost all adherents of any system of dogma, is to my mind of the very greatest social importance and far more likely to benefit the world than Christianity or any other system of organised beliefs.We can see that the Peterson fallacy is at least as old as 1954. The fact that Communism and Nazism committed evils is not justification to return to religious dogma; in fact, that would just be replacing one dogmatic ideology for another.The solution is not a retreat to the Age of Faith, which was no more pleasant than living under communism; the solution is a renewal of the Enlightenment values of reason, science, humanism, and progress espoused by Russell himself."}, {"userName": "☆♥☆Kotyonok♥☆♥ ", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/6713906-kotyonok", "userReview": "EDIT: to those thinking about buying this and are dissuaded by the 1 stars, I'd tread carefully amongst them, almost all of them just mischaracterize Peterson's views and take his ideas out of context in an attempt to slander his name in some way or call him a raging XXX-ist. I think I've seen a handful of 1-star reviews that haven't done this (and no they are not the 1-star reviews below mine). I'll explain more in my review but honestly, I'd just encourage you to just read this for yourself and form your own opinion. Relying on someone else's opinion, even my opinion, and using them as the basis for YOUR opinion is stupid and quite frankly lazy, just like the 1-stars that misquote/misuse/misunderstand/mischaracterize Peterson's words. ***********************************************Dr. Jordan Peterson is one of the most brilliant people of our day and age.Watch his latest interview with the idiotic feminist** Cathy Newman: https://www.youtube.com/watch?v=aMcjx... Or if you don't want to watch it, the interview in a nutshell:In layman's terms:He has the patience of a saint XD And he's a CLASSICAL LIBERAL, a REAL liberal.He's a clinical psychologist, cultural critic, and an SJWs worst nightmare--because he uses history, he uses science, he uses FACTS and does not quell the truth for the sake of feelings and the idiocy that \"some words hurt\", boo-fucking-hoo, cry me a \"hate-speech\" (aka any opinions that SJWs disagree with, where anyone to right of Bernie Sanders is a Nazi) river. I WISH SO MUCH I had a professor like him!RTC*************************************************note: I do NOT think Cathy Newman is representative of feminists. I just think she's one of the lunatics giving feminism a bad name, as most in the media and most celebrities do. Hence, she's an idiotic feminist."}, {"userName": "Charles  Stampul", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/75992672-charles-stampul", "userReview": "Jordan Peterson may be the only clinical psychologist who believes that psychology is subordinate to philosophy and the one thing that psychology and philosophy both genuflect before is story. Story, or myth, predates religion and is, in fact, as old as language itself. In his earlier book, Maps of Meaning: The Architecture of Belief, Peterson connects the stories we share with our earliest ancestors with modern knowledge of behavior and the mind. It’s a textbook for his popular University of Toronto courses.The one-time dish washer and mill worker spent nearly 20 years at the University before garnering international attention. In September 2016, Peterson released a couple of videos opposing an amendment to the Canadian Human Rights Act which he contended could send someone to jail for refusing to use a made-up gender identity pronoun. Peterson went on to testify before the Canadian Senate, and has emerged as a foremost critic of postmodernism on North American campuses.Postmodernism is the “new skin of communism,” In Peterson’s view. The ideology has been so thoroughly discredited from an economic standpoint that those who still advocate for it, for either political or emotional reasons, have resorted to attacking the very process in which something can be discredited—reason and debate. At the same time they have worked to change the face of oppression away from those living in poverty toward individuals who don’t look or act like those who hold most of the positions of power and authority in Western society. Peterson’s classroom is now the entire globe. Millions are watching his lectures and other videos on YouTube. For this new and greater audience, a more accessible, more affordable compendium than Maps of Meaning was called for. 12 Rules for Life: An Antidote to Chaos is more affordable for sure, but only slightly more accessible. Part self-help book, part memoir, part Maps for the masses, it’s organized sprawlingly. (Read full review at https://simplicityandpurity.wordpress...)"}, {"userName": "Sebastian Hill", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/12399672-sebastian-hill", "userReview": "DON'T WASTE YOUR TIME! If you've never read a book in your life, you'd think JP is super smart. That baroque style of writing, those sentences that never end, the constant references to science and philosophy - \"how does the man do it!?\" you ask yourself. It's simple. The book's actually rubbish but you have nothing to compare it with.This book's riddled with logical errors. Facts are ignored and substituted with analogies that simply don't work and don't make sense. Major philosophers are completely misrepresented and molded to fit his ideas. Entire sub-chapters are filled with complicated and ultimately pointless mythological and philosophical references... And everything is peppered with common sense statements and citation marks to give it the illusion that it's factual, accurate and logical. It's not. Don't get me started on how bad the writing is. It's like he has a paid thesaurus subscription and wants to get his money's worth. Nobody cares about your rich vocabulary if you lose the point on the way.You could spend hours upon hours digging for problems with this book. Some actually have done that. There was a guy on YouTube who made a one hour video dissecting the problems with the citations alone. Yeah, it's that easy to poke holes in his ramblings. He blames \"postmodernism\" but he misrepresents it. He quotes Heidegger but has no clue what he's been talking about. It's boring and uninspired. But JP fans will love it. He's got his diehard fans who will continue to follow him no matter what, regardless of how bad his ideas are, especially since there's no other conservative smartass to get behind instead.So don't bother! He doesn't say anything new and what he does say is said poorly. Not too different from his videos. For the sake of your time and brain, just read something else. Anything from Chomsky, to Pinker, to Friedman or Zizek. Or just read the stoics and the existentialists instead. I mean if you just want someone to tell you to stand up straight and make your bed, read Meditations by Emperor Marcus Aurelius. Or Seneca. Or Sartre. Or Dr Seuss - even he has deeper life advice.*** Responses to replies I'll probably get: \"Haha, suck it, you triggered SJW\" - I'm not mad that JP is writing books, I'm mad that such a bad book is getting attention and is wasting people's time. And that's a stupid response from you.\"JP is the man, you just can't appreciate his genius\" - He's not, he is the very definition of a pseudo-intellectual. There are so many other public intellectuals that are smarter, better spoken and more more respected than JP.\"You don't know squat, he taught at Harvard!\" - He was an associate for a few years, a long time ago. So? Look at him now, when nobody in his university wants to be associated with him. What does that tell you? How can you call that a respected academic?\"This isn't real criticism\" - It's really not, I don't care enough about this to write a 1500 word essay on him. I'm reading some better books right now. But even my rambling makes more sense than his lobster analogy."}, {"userName": "Mehrsa", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/1045774-mehrsa", "userReview": "So there is a lot of wisdom in here about how to live your life: don't blame other people, listen and understand other people's perspectives, be honest even though it's uncomfortable, and don't demonize humanity. And then all the wisdom goes down the toilet in one particular chapter when he makes a farce of his whole argument. Men are being victimized by liberal academics. Not only does he start blaming everybody and anybody, but he completely mischaracterizes the progressive argument or makes a caricature of it (he had a friend who was liberal and blamed patriarchy for everything and then he killed himself--see? Point proven). He also goes on to demonize anyone pushing for change or gender equality etc. And his proof? Literally, disney movies and the communist revolution gone wrong. But why leave out the revolutions gone right? American? Civil Rights? And why, instead of looking to the little mermaid to draw out wisdom about the true nature of motherhood and women, chalk it up to a crazy sexist script--which it is. Remember how Ariel uses her body language to get the man? I read this book because I was open to hearing from Peterson. I like well-reasoned ideas no matter what their source. And I was ready to hear him and I did most of the way through the book. It was very good--especially his chapters on marriage, parenting, and self-analysis. very good. But then he goes too big and grows quite shrill in his argument. He loses reason to make a point. But I guess controversy creates a best-seller and he knows what he's doing. The other logical inconsistencies here were that he keeps using the animal kingdom (i.e. crabs and lobsters) to make a point about human nature--specifically on gender and sexuality, but then in his other more lucid arguments, he argues that we need to fight our nature (self-sacrifice and obedience). So why does it make sense for us to tolerate bullies (he says this) and male superiority because duh the animals do it, but not sloth and dominance because we're Godly dammit. I would recommend that the critical reader who wants to read this book also read the history of misogyny as well as the fall of adam and eve to get some perspective on why these ideas got to where they are. Peterson keeps talking about women being chaos and men being order. He never mentions pandora's box, but he does bring up Eve quite a bit. Those two narratives are relatively recent phenomena instead of fixed laws of the universe. He keeps making these essentialist claims that men aren't as emotional as women (which he undercuts by giving example after example of men losing their shit over nothing) and how women are all about nurture, but humans are much more complicated than this. Read the book for the good, but keep one eye good and open to spot the bullshit."}, {"userName": "Sara", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/1555901-sara", "userReview": "A soothing and seductive balm for the butthurt. I am fascinated by the cult surrounding this man who, as a previous reviewer noted, relies far too much on simplistic interpretations of Biblical stories and the Disney versions of fairy tales to the expense of all else. (I guess Lilith and Athena might complicate that Easy Bake reimposition of a male-centered narrative.) Here's what I don't get: None of this is new. Joseph Campbell? Heard of him? Remember M. Scott Peck? That Christian head shrinker who said, \"Life is difficult. Get used to it and it will get better\"? Peterson's popularity only reveals that an entire generation has been so robbed of the humanities that they're starving for anyone who will provide a few harsh words and some meaning in their lives. The guy can tell a story. Too bad it's a frighteningly regressive one for women. And no: Women's Studies departments are not propagating a myth that the world was once a glorious matriarchy. That was funny though."}, {"userName": "Marianne", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/46397370-marianne", "userReview": "A book by Jordan Peterson, I won’t be able to do it justice. 12 Rules for Life is a wonderful book. It is typical Peterson with large amounts of insightful information and wit. The book includes information that I knew, did not know, and information I knew but did not know I knew (like a Peterson lecture). There are three main points that I took away from this book:1. The world is a horrible place filled with suffering. If you personally don’t suffer, someone you know will. 2. If you want the world to be better,start with yourself. The more individual people start bettering themselves the potential for the world to be just that little bit better increases. 3. We should live on the line between order and chaos. We need both for a functioning society. We need to grow and adapt whilst not getting rid of traditions and traditional structures, they might be very important. This is a book I would recommend to everyone whether you’re familiar with Peterson or not. Clean your room and sort yourself out."}, {"userName": "Martin V", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/34848892-martin-v", "userReview": "I wish this book had been around to read when I was 18."}, {"userName": "Douglas Wilson", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/1258773-douglas-wilson", "userReview": "As I wrote on Twitter, this book contains pockets of silliness connected by long stretches of common grace on fire. Really worthwhile."}, {"userName": "Byrne", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/43993760-byrne", "userReview": "I ignored Jordan Peterson for a while, since his name usually came up in culture war contexts where the rule is that every generation gets approximately five talking points to endlessly yell at each other. But then he published a book, and a bunch of my academic friends started screeching a few octaves higher than usual, and a few of my well-adjusted friends started reading the book, so I decided to check it out. I recognize that being inclined to agree with a critic of postmodernism entirely because of his critics' behavior is itself pretty postmodern and thus suspect. But be fair to postmodernists: they're good at finding clues, even if they're bad at solving mysteries.If I were half a decade younger, or much less lucky in my choice of reading material, this could have been the book that changed my life. (Writings that played this role for me instead: Sexual Personae, Moby-Dick, Starting Strength, that viral \"get your shit together\" email by Scott Galloway.) The book's target audience is young men suffering from post-school ennui, and the message is: it's not your fault, but it's 100% your responsibility to fix it.Given his reputation--people insist on tagging Peterson with the \"alt-right\" label--I was half expecting \"1,488 Rules for Life: An Antidote to (((Chaos))).\" But, no, Peterson is not writing neo-fascist propaganda. He's writing fatherly advice, at least if your dad read a lot of Jung and Nietzsche, and dropped a little acid. If you think this is one of those advice books where you can skim the contents and get the gist, you are completely, wildly wrong. Take chapter one, on posture. We begin, naturally, by talking about lobster combat. Then wrens. Then back to lobsters; on to a wild fugue through a few hundred million years of evolution; a brief segue about how at different levels of abstraction nature alternates between permanence and chaos, and how part of music's appeal is the recognition of this; and then Peterson concludes by recommending good posture.The whole rest of the book is like this. There's an initial riff, followed by a long philosophical jam session (expect references to Freud, Marx, yin and yang, evolution, the Old Testament, Jung, Peterson's kids, and the New Testament), and it closes with a stern admonition. You might thing that's a silly approach that risks trivializing whatever philosophical lessons it includes, but the one-two combo of moral lesson plus minor daily habit has a great historical precedent. Just look at the Bible. The first book is about the origin of all existence, the nature of evil, the consequence of sin, etc. The second book is about becoming a distinctive people, having a covenant with the divine, and so on. The third book is about when to wash your hands (all the time) and which foods you should avoid eating lest you get sick. If every episode of hand-washing and ham-refusal reminds you of Original Sin, you will spend a lot more time thinking about morality than you otherwise would.So I can't really review the advice itself, although it's good. I can recommend reading the book, not so much for any one point, but for the journey--there was very little I wish I'd thought of first, but a lot I wish I'd phrased that way before. If you read his book and follow his advice, will it improve your life? Almost certainly. Not just because his suggestions are things we should already be told (or have already been told, but ignored). But for simple tribal reasons. It's like eating paleo: the actual behavior helps at the margin, but what really keeps you on the path towards self-improvement is the feeling that it's 99% of the world against you and your brave band of friends. And you could do worse than to choose the friends who rally around Peterson."}, {"userName": "Tristan", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/3781470-tristan", "userReview": "PULLING THEM BUCKO’S UP BY THEIR BOOTSTRAPS, B. PETERSON STYLE“A list of the people who ought to be killed...Starting with these people who read self help books…why do so many people need help?! Life is not that complicated. You get up, you go to work, eat three meals, you take one good shit and you go back to bed. What’s the fucking mystery?!\"-\tAmerican comedian George Carlin, from ‘Complaints and Grievances’Well, he’s probably down there now, that curious George, reproachfully screaming up at me for finally – after a decades-long valiant struggle, mind you – having given in. Surely no salvation awaits me, a creature now thoroughly debased by having read one of the loathsome things. Yet perhaps my death can be postponed, considering the context in which I made this transgression.Clinical psychologist Jordan B. Peterson has become quite the cynosure of the intellectual dark web these last couple of years. After making a splash with his open refusal to comply with compelled speech codes (concerning pronouns for transgenders), he quickly found himself appointed as an intellectual leader, the anointed one who would be leading the vanguard against what is commonly referred to as the “authoritarian left”, the influence of which is observable within Canadian academia and politics. To Peterson, this restriction of speech (and this is what it does boil down to, no matter how you slice it, or whatever side of the issue you fall on) was the most egregious example yet of “postmodernist, Neo-Marxist ideology” run amok. Having intensively studied the modus operandi of authoritarian regimes such as the Third Reich, Maoist China, the Soviet Union, all echoing a common obsession with what language is to be permissible, he knew where even such a seemingly innocuous, perhaps even well-intended course of action might eventually lead to. Speaking out and making a stand now - not later, and thereby running the risk of losing his teaching position and facing ostracization, seemed the only course of action open to him. Whatever one’s opinion on him, it would be rather uncharitable not at least to call him brave. Surprisingly, he came out relatively unscathed and ever since managed to build a loyal fanbase through his own wildly popular YouTube channel, providing recordings of his many lectures (covering a wide range of subjects, such as Biblical exegesis, cultural analysis, and Jungian archetypology) and interviews with guests. Tens of millions of downloads of his talks have been recorded, a rare feat for any academic to achieve. In that sense, Peterson is a trailblazer, making education available for those eager to learn, but outside the perhaps intellectually restrictive walls of modern academe. Of course, he probably makes a lot more money this way, so I am reluctant to attribute a solely selfless motivation to him. For his strong stance and general going against the grain (he defines himself as a classical liberal), he is regularly invited as a guest on multiple podcasts on that same platform, some of them leaning more to the libertarian/conservative side of the political spectrum. In part this has given him the reputation of being a thought leader of the so-called “Alt-Right”, a preposterous slander not worth paying any serious attention to, but one that doesn’t come as a surprise in an increasingly polarized world. Despite minor quibbles at times (a not insignificant degree of admiration doesn’t imply an uncritical acceptance of each and every word uttered by that object of admiration ) I found his manner of conveying concepts and debating skills – along with his seemingly genuine concern about the lack of orientation for young people (especially young men) in Western countries – to have considerable merit. Almost 2 months ago a - by now widely viewed - interview with BBC’s Cathy Newman hit the airwaves, and introduced Peterson to a whole new audience. It proved to be quite the sight, showing the interviewer to be wholly out of her depth, unable to engage in an intellectually honest – which would have been more productive - fashion with Peterson, stuck as she was in a rigid belief structure, attacking an imaginary, fantastical monster of her own making. A dismal performance on her part, though proving to be great fodder for delicious memes (“dank memes” I believe is the fashionable term), but it made Peterson a true phenomenon. Which brings us to his book – only his second effort– and runaway bestseller, in no small part through that rather odd interview. So, to get to the actual reviewing part, how does it stack up against what we’ve seen of the man thus far? Well, it’s here I have to make a stand of my own, and in all likelihood deviate from the opinion of most Peterson devotees/acolytes/cultists(?). Purely as a work of non-fiction, published by a highly reputable publisher (Allen Lane no less),it is a real disappointment. If not at all ill-conceived in terms of its overall “message”, it is sloppily put together, and I presume hastily put out, with little regard for quality control. Apparently, Peterson worked 5 years on it, but one wonders how many hours in that time span were actually devoted to the enterprise. While Peterson’s animated style of delivery works remarkably well in his lectures, it doesn’t make for a particularly strong book, not even one ostensibly belonging to the self-help category. It was apparent to me quite early in my reading that the sometimes overly sprawling and – this is ironic, considering the book’s title – chaotic Peterson (who is not exactly a prose stylist) above all needs restraint and clear focus when performing writing duties, and no editor worthy of the name seemed to have been present during the process to assist him in making that happen. As a result, whatever practical wisdom the book contains (and it most definitely does, drawing from a great variety of sources and fields of study, although perhaps a bit too heavily reliant on the Bible) is diluted by its unmerited length. Additionally, the text is absolutely mired in repetitions of concepts already conveyed (sometimes literally), plagued by typo’s and a wrongly numbered endnotes section. I found myself just getting progressively more irritated as I went along. Oh, and Peterson actually uses smiley’s (!) on three separate occasions. How is it to be expected of any reader to take any academic employing those seriously, especially one that is already met by such opprobrium from his peers as Peterson? Is it a Canadian thing, with that folk being associated with an almost angelic kindness? I truly want to know.Not everyone will find these faults a huge issue, but it does make it harder for me to unreservedly recommend dishing out the cash for an expensive hardcover. A for certain yet to be published paperback ( then corrected by an editor, hopefully), or a library copy seem better options, if one really desires to read it. As far as newcomers are concerned, this isn’t such a bad entry point, but for those already intimately familiar with his work, there isn’t much new here to discover. Personally, I would stick to the hours and hours of lecture and interview material, which is – for now, at least - available for free on YouTube. Drink from that well at your leisure or alternatively, if in dire need of some stern life advice, go back to what came before and read that wonderful chap, Marcus Aurelius.Do keep on slaying those dragons and cleaning your room, though."}, {"userName": "Chester", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/54232141-chester", "userReview": "Dr. Jordan Peterson has outdone himself.Spanning across religion, mythology, politics, literature, and evolutionary psychology...Intertwined with personal anecdotes, clinical correlates, and a good mix of dark humor...With passion, with rage, with love, Peterson has masterfully crafted a cross-disciplinary exploration into the essence of the human condition:What it means to tread on the precipice of order and chaos, of destruction and creation. What it means to transcend our primitive animalistic inclinations and the responsibilities we possess as beings of higher consciousness. What it means to live congruent to your own individual accord, and how to integrate it into a society built to tear you down.What it means to live a life worth living."}, {"userName": "Leo Robertson", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/7619789-leo-robertson", "userReview": "I’ve highlighted more paragraphs in this book than any that I’ve read in the last… very long time!As should be expected, this is the literary equivalent of a kick up the ass. Like true originals, if you’ve heard him speak before, you’ll find it impossible not to read his book in his voice—just as I have done previously with Marina Abramovic’s memoir and others I can’t currently think of. The point is, if something reads exactly like that person talks, it took an immense effort to write and is—whether or not you agree with it—a good sign that that person has written exactly what they set out to write.Peterson draws on evolutionary biology, politics, literary and biblical stories, even delving into fascinating elements of memoir about where he grew up, which is revealing of his tough countenance. Friends die, children get sick. That’s life.“You have the power to change the world” is an apparently optimistic and commonplace message, implied or otherwise. But it needs broken down. Peterson does this very well in the book. “Sure, you can change the world. What are you reasonably capable of achieving today? Okay… You can get to smashing the patriarchy, but how about you, uh, see if you can re-open a dialogue with your estranged brother. That sound doable?”We sense this inside. What this book does is what the best books do: it articulates lessons to you that you already knew in some distant, subconscious way. If I was younger, they’d probably be things life had yet to teach me.I make it sound simple, but I too have been hiding in my own life. I’ve been weak in the face of criticism I need to grow successfully. It only seems polite to help other people out with your problems but hide your own. It isn’t. It breeds resentment, and society needs actively engaged citizens. Johann Hari’s latest book quotes the following: The percentage of U.S. workers in 2015 who Gallup considered engaged in their jobs averaged 32%. The majority (50.8%) of employees were \"not engaged,\" while another 17.2% were \"actively disengaged.\" He, I surmised from the rest of the text, thought this was a problem with companies: what can they do to entice people to engage more in their work? What Peterson offers is almost opposite: you’re not engaged in your work? How about you try engaging then? You can’t do what you think is expected? Well, what can you do?I will say that his messages do tend to have a hard edge to them, probably because of his voice. He advises not doing work that you hate, and has explained Jungian theory using the Quidditch example of “catching the snitch”—it requires immense concentration, indicative that you’re exactly where you need to be in time and space, and when you win, everybody wins. What that tells me is that to be successful you should find work you enjoy and focus on that. That sounds more fun than simply “not doing work that you hate.” The process of becoming better can be enjoyed. It probably is enjoyable. In fact, one of the main activities for bettering myself recently has been reading this book, and it was fascinating! And the ways I’ve chosen to improve myself this year, including staying off social media for the most part, have made life better. I’m not really sacrificing but alleviating. The instant pleasure compulsions are the brain’s equivalent of a spending spree or a drinking binge: they lead you to ultimately unsatisfying and shallow territory. But the deeper, healthier curiosities take you to emotional and spiritual investment opportunities. They’re better modes of enjoying life, I would phrase it. Rather than, as Peterson would, “Life is suffering, so pick the poison that will harm you the least.”As he advises, today I said “Yes” to everything in work and already it took me surprising places. I made a presentation for the whole department on a safety issue I’d barely heard about this morning, based on an offhand suggestion from my team leader. I could have hidden and done the bare minimum. But something has been wrong for a while—I’ve designed a decent life that I can set about improving; I just haven’t been as engaged in it as I could. Because I’ve feared the implications of failure, and I don’t like asserting myself in general. But lack of engagement feels worse. It’s not a win to find a job you can “hide in.” What seems comforting really isn’t. Certainly “coasting” is not the worst place to be in. But you undermine your capabilities by not maximising the use of them, and that doesn’t feel that great.I’ve also enjoyed not drinking this past month, and will continue to do so. Someone new and better is emerging at a rapid rate—which scares me when I consider the implications of that regarding past activity, but I’m excited about the future in a way I haven’t been in a long time. Henry Rollins says he was never attracted to drink because he could see that “That’s how they try and control you.” Someone benefits from the status quo for sure, and alcohol helps suppress people into lives that are beneath them. But that cycle of subpar life + suppression = statis(1), stasis (1) + suppression = stasis(2) is ultimately unsustainable. You either get out of it or ride it as deep as it goes. Mentally there are no limits to it—it’s your body that’ll give in first. As Peterson says, hell is a bottomless pit, and life has taught him that there’s no situation so bad that you can’t make it worse.Logan Paul says “Zero people shouldn’t have a hero” (hahahaha…)Well I think it’s useful to have role models. I have plenty, but will mention just a few. When I watch Peterson speaking, I imagine what I might be like at his age if I just learned and worked my ass off. Where will I be? What will I know? It’s hard work, but it’s exciting.But also, like a stern father, his messages are good for a time. We can’t live with our faces rubbed in sobering truth day after day—and that’s why I will combine his messages with other favourites, such as affirmation and meditation advocate, Louise Hay. Peterson may well be referring directly to her practices when he says he thinks people who believe you can be happy are delusional because they’re refusing to accept the true nature of life. I can only see the benefit in repeating to yourself, in the mirror, “I am in the process of making positive changes in all aspects of my life.” Her practices, like Peterson’s, have brought people back from the brink.If Peterson is a stern father, Louise Hay is a nurturing mother. Yet a mother’s protection is just an illusion, one that ultimately falls away. Again, Johann Hari in his latest book documents the apparent miracle effects of placebos, only to note that they disappear again, don’t ultimately solve anything. But if someone in a wheelchair stood up from it one day, is that worse than no placebo at all?UPDATE: heard something on a podcast about faith healing. Yes, it is damaging! The adrenaline causes people to walk when they're not supposed to! Exhilarating in the short term but damaging overall. Then we're back to \"expediency sucks\"!(I even have a crazy aunt/uncle in the mix: RuPaul, who says, “Let’s just step out of this reality entirely. It’s all made up. It doesn’t define you. You’re just playing a role. Don’t take any of this too seriously.”)In this George Saunders story, he takes a stab at Tony Robbins’ classes. He seems to find them overly simplistic and of limited use. Well, I loved the documentary on Tony Robbins, titled I Am Not Your Guru. I also remember thinking that if these people had caring friends and a decent community, they wouldn’t need him at all. He’s just like a caring friend that you pay for. If people want to pay for that, cool, and I think they get their money’s worth. I don’t know what more could you want. These people advocate personal responsibility in their own way. They don’t necessarily, as Peterson does, consult the diaries of the Columbine shooters to prove their point—but I doubt that many would!I remember when I taught English in Spain that what I really enjoyed was finding three or four different ways to express the same concept until everyone, with their different learning styles, was on board. That’s the most wonderful thing to hear: “Why did no one explain it like that to me before?” Of course, as an adult, everything is maximum confusion and almost no one takes the time to explain anything to you, ahaha. That’s how it will always be, though, I think. The point is to listen to many folk.Life is suffering, is Peterson’s E=MC^2 tier elegant truth. I just didn’t understand what it meant for most of the book. But, last night, as I was finishing up this book, and I saw the sentence, my subconscious pieced it together in a way that I understood: Life is suffering in that if you’re not suffering, you’re not alive."}, {"userName": "Sabrina", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/17626708-sabrina", "userReview": "I cracked it open only to discover a study of the bible and christian religious stories while expecting a book on psychology, deceiving. Didn't finish it."}, {"userName": "Brendan Monroe", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/22409011-brendan-monroe", "userReview": "Where have all the genuine intellectuals gone? Christopher Hitchens' death in 2011 left a huge gap that nobody has yet managed to fill, though many have tried. If anything, the absence of a voice like his these past years has shown just what a unique and profound thinker the man was. He was a colossus and, sadly for us, all too difficult to replace.The era of Trump, Fake News, and both left and right hysteria demands a Hitchens-esque figure who can rise above it all and tell us what's what, but sadly, that figure appears to be absent from the scene. I had hoped that Jordan Peterson would prove to be just such a figure, but I am sad to report that that's not the case. Peterson is an imposter - just the latest in a long line of controversial figures who, when the curtain of controversy is pulled back, prove to be nothing more than provocateurs with nothing original to say.Like many, I watched Peterson's now-infamous interview with Channel 4's Cathy Newman and was immediately captivated. The way he handled her absurd, aggressive line of questioning was admirable and, just maybe, heralded the arrival of a profound thinker to the world stage. She made him look good, I know now. But, like no doubt millions of others were inspired to do, I went and picked up a copy of Peterson's newly released book, \"12 Rules for Life: An Antidote to Chaos\", eager to delve deeper into the man's mind.I couldn't even finish it. About halfway through the seventh rule I said to hell with it, I've wasted enough time on Peterson's banalities as it is. I don't use the word \"banal\" lightly either - the truth is there isn't anything here that you don't already know. The first rule, \"stand up straight with your shoulders back\" is a long-winded call to approach life with confidence and to speak your mind. Well, no shit. Just the titles of Peterson's rules are no-brainers. Take Rules 2 and 3 - \"Treat yourself like someone you are responsible for helping\" and \"make friends with people who want the best for you\". If you haven't already realized the benefits of doing these things, then you haven't been thinking. This leads me to the conclusion that Peterson's intended audience isn't academics or thinkers, but young people who have been fed a steady diet of pop-culture nonsense and politically correct bullshit. Peterson has talked about how his list of 12 rules was - terrifyingly - originally a list of 40. He'd published his list on Quora and quickly received a significant number of upvotes. None of that seems hard to believe. Peterson's \"rules\" would work well on a site like Quora that exists as a place for users to go for quickly absorbable bits of information. Peterson's rules proved popular because the point of each rule is evident from the name of the rule itself - except for \"Do not bother children when they are skateboarding\" because, well, why would you? Peterson's rules do not make the transition from a list on Quora that you can read in five minutes to a 450-page book well. How could one even fill 450 pages with such obvious advice anyway? By going full Sunday school.Peterson's constant referencing and interpreting of Bible stories is both exhausting and frustrating. I was raised in a very religious household, so growing up I wasn't allowed to read \"secular\" books, only whatever they sold at our local Christian bookstore. There's a whole industry of Christian self-help books that filters that Old Testament story this way and this parable that way - all to serve whatever purpose the author desires. \"12 Rules for Life\" reads all too often like one of those Christian self-help books. Peterson is obsessed with the Bible and is apparently convinced that each and every story within offers layers and layers of wisdom so lacking from every other text that he never bothers referencing any other text. He talks a bit about Socrates at a couple of points, but for Peterson the Old Testament god (i.e. those who authored him) is clearly the unrivaled source of knowledge. I wonder what the Hitch would say about that.And that gets to exactly what Peterson is so remarkably wrong about. In numerous places his argument seems to dead end on \"god was right because he is god\" and \"how dare they argue against god?\" In other words, he who has the power is right merely by dint of the fact that he has the power. This is what SHOULD be controversial about Peterson, not his objecting to government-mandated speech, but the fact that, not so deep down, he believes that absolute authority is right simply because it is absolute. It appears that those debating him don't know this, that those in his fan club don't know this. Peterson isn't some radical revolutionary sticking it to the man - he's the man working on BEHALF of the man. He's a lobbyist for the same powerful interests that have left his core group of readers and YouTube viewers - mostly young men - feeling lost and confused in a world that is becoming increasingly unrecognizable to them. I started this book already liking Peterson. Unlike many of the reviewers who will rate this book 1 star because they went into it hating Peterson already, I went into this with a completely open mind - a mind that Peterson easily could have won if he wasn't repeating everything we already knew and acting as a glorified Bible school teacher.Why read pseudo-intellectuals when you can read a real one? Ditch Peterson. Pick up Hitchens."}, {"userName": "BlackOxford", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/17744555-blackoxford", "userReview": "Too Sweet to be WholesomeJordan Peterson is a global phenomenon. He is good in print; even better in interviews. As a psychoanalyst, he has decades of experience and professional credibility (I find his Jungian approach far more interesting than Freudian or various cognitive methods). As a Canadian he is presumed a certain integrity often denied to other English-speaking experts. As a man, he is engaging and fast on his feet with no defensiveness even under intense pressure. In 12 Rules for Life he makes a cogent case for the necessity as well as benefit of moral authority. Although he is not a religious adherent, Peterson believes in the objectivity of moral law; he has no time for those relativists who consider moral law as something arbitrarily constructed within human society. Many find his arguments compelling. I find them disingenuous and dangerous.The disingenuousness of 12 Rules begins in the introduction by Peterson’s long-time friend and associate, Dr. Norman Doidge, MD. Doidge points to the persistence of the Ten Commandments from the Hebrew Scriptures as an example of the ancient, effectively eternal and fixed, wisdom of biblical moral precepts. Unsurprisingly Doidge fails to make mention of the other 412 divinely ordained precepts of the law given in the same scriptures. Things like the stoning of heretics, the inferiority of women, and the necessity for meticulous maintenance of spiritual purity apparently do not carry significant moral weight despite their authoritative divine source. And he makes no mention of the fact that the founder of the Christian Religion, Paul of Tarsus, designated the entire Hebrew law, including the Ten Commandments, as the very source of evil. Doidge is not merely tendentious, he is an ideologue who has little understanding of the biblical references he makes... or he is a liar.Popularity is not a terribly reliable guarantor of either poetry or philosophy. By his own account Peterson’s Rules started life on an interactive internet site. Participants liked his rules as nakedly stated, without even being given reasons, without explanation of their operation. The rules apparently touched some inarticulate need which site participants hadn’t previously recognised. And they gave rave reviews. The book is the result of subsequent justifications of the intuitions he floated on the internet. Whatever erudition, classical references, and stylistic skill Peterson used to develop his arguments for these rules, they are hardly the the product of analytical thought. Like Doidge’s introduction, the book is tendentious, meant to promote a potentially popular cause not thinking. The fact that Peterson is honest about the genesis of the book doesn’t change its character. But I think it does help to explain why the book appeals to many religious leaders and right-wing politicians. Peterson appears to provide both groups with philosophical selling and political talking points that promote a conservative social agenda.Jungian method is inherently dialectical. Conscious/unconscious, ego/shadow, anima/animus are all necessary components of the human psyche. Only by accepting the existence of these competing components and reconciling their insistent demands can a person become integrated, that is whole, a complete Self. Jungians implicitly presume that none of us is naturally whole. We need each other, sometimes use each other, to compensate for our dialectical deficiencies. Ultimately however psychic health comes about by taking responsibility for one’s own integration - by recognising how we perceive the reality of the world we inhabit, and how we react to our perceptions. These are matters of choice not fate. This is a simple but very subtle theory. In short, the theory has two principles: 1) the Unconscious is indistinguishable from reality; and 2) the Self is indistinguishable from God. Both reality and God exist in our heads as it were. They are ideas over which we can exercise control. One can sense Plato, not to mention Billy Graham, turning in their graves at the thought that ideas are subject to human will. Evangelicals don’t seem to mind this Jungian theological faux pas, probably because Peterson quotes the Old Testament story of the Creation and Fall (a classic Jungian trope). To them it seems but a small step from the symbolism of the God in one’s head and one’s dreams to the objective Ruler of the world. Didn’t the great Protestant theologian of the 19th century, Friedrich Schleiermacher make the same point, that God was a feeling emanating from the human mind? Similarly, social conservatives like the idea of personal responsibility as part of their ideological portfolios. Doesn’t this bring together both the economic neo-liberalism of Frederick Hayek and the militant individualism of Ayn Rand? The fact that personal integration of the Self implies a rejection of ideology of any stripe as an impediment to psychic health doesn’t seem to register at all. So of course Peterson will be exploited by Evangelicals and Conservatives to further their agendas, regardless of the caveats insisted upon by him. Those who are familiar with the Erhard Seminar Training (EST) programme of the 1970’s and 80’s and its various successor movements for radical personal improvement, will recognise this theme of total personal responsibility. EST was an intriguing and highly popular syncretism of Jungian psychology and the existential philosophy of Martin Heidegger. Peterson’s version doesn’t use the pyramid selling techniques that made EST so popular, particularly among the highly educated, but the combination of the internet, cable television, and the intellectual vacuum of evangelical and political conservatism has the equivalent functional role. EST was a training ground for the political left in the 1970’s. 12 Rules promises to be the focal point for the political right for some time to come. None of this is to say that Peterson isn’t interesting or worthwhile. On the contrary, he has an intelligent, witty and interesting contribution to make in intellectual debate despite the banal insipidness of his Rules. Nevertheless, just as EST helped create a generation of liberal weirdos in business, politics, and academia, I fear that an equivalent generation of conservative weirdos in in the making. There is a distinct Whig theme that runs through the entire book: the world is as it is for good reasons and it’s not your responsibility to fix it. Comforting no doubt to those who feel disenfranchised, disrespected, and more than a bit deplorable. But really, does anyone believe that some positive thinking is going to make them into a bold psychic adventurer? My advice: don’t drink the Kool-Aid too quickly."}, {"userName": "Matt", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "When asked if I would take a leap of faith (pun evident later in review) and read Jordan B. Peterson’s book, I was slightly hesitant. Surely, I could take something away from this and learn how to incorporate it all into my daily life. If not, I would be able to drum up some interesting discussions with people about the content. Peterson argues effectively that life has become chaotic for most people, as he has witnessed in his profession as a clinical psychologist. His analysis of this chaos can, and should, be rectified by better understanding twelve rules that can assist the wayward person to find their way and live a more productive and less erratic life. While I choose not to delve into all twelve, some interesting insights did emerge as I made my way through this piece, including that humans are not alone in their struggles, nor are their reactions unique. Early in the tome, Peterson makes strong parallels between human inter-personal relationships and those of lobsters. Making some fundamental ties to the two, Peterson seeks to convince the reader that there are strong correlations that cannot be dismissed, simply because the two groups seem so vastly different. From there, the narrative takes an interesting tangent, exploring the lack of self-care that people have, whereby they are more concerned with the health of pets than with themselves, at times. His argument seems to be that it is essential to look inward and fix that which is reflected in the mirror before trying to ‘save the world’. The burden of the world’s issues is chaotic and can be too much to handle, but making that one change—the self change—can bring stability. Core tenets such as listening to what others have to say and trying not to compare one’s self to everyone else seem to fill much of the narrative, as Peterson seeks to push the idea of the inner view to betterment, rather than one of comparison. No one is entirely perfect, so it is a waste to try modelling a life based on the outward appearance of others, be it their physical display or attributes. Rather, taking the time to stop and reflect will lead the reader to acquire the needed tools to betterment. These twelve rules do seem well-grounded and based on a number of years of experience that Peterson has garnered, through study and interactions with patients, and so the reader need not think this is a twelve-rule modern stone tablet set of commands. Those who enjoy learning and analysis of behaviour may enjoy this one. I found some tidbits highly thought-provoking, but I am not yet sure if I will return to take more detailed notes for personal betterment.I will be the first to admit that I am not one for self-help books or those that seek to point out flaws with a recipe for success. I suppose that is the primary reason I chose this book for the Equinox Book Challenge, to push myself out of a comfort zone and face some of the raw aspects of my being. While I was interested in most of what Peterson had to say, I found some of it troubling, especially if the message was meant to go out to the general public. While I will admit that the West is strongly a Judeo-Christian society, particularly the general rules and moral pathways laid out, it is an ever-evolving society that cannot be boxed in. While done effectively, Peterson used numerous biblical passages and stories to assert his points, both the flaws that have been around for centuries and the solutions that have been followed when listening to God. At no point did I feel that Peterson sought the reader to ‘find Christ and be saved’, but such ongoing reference to these stories boxes the reader into knowing them before being able to make the correlations. Peterson does explain the stories and then explores how God was trying to communicate something to the mortal individuals, but there can be a sense of inculcation, even if not intended. To reach out to the largest cross-section, removing the faith-based narrative may help. Secondly, I would venture to say that this piece straddles the fence between academic and useful for thought-provoking argument, rather than helpful to the masses who might need it. While the core tenets are laid out in the rules and a brief description of them, the discussion is quite detailed and thorough, perhaps too much to truly get the meat out of the piece. Peterson knows his stuff and has much to say on the topics, but perhaps too much to effectively leave the reader with something to take away. Biblical reference, personal experience, historical context. They all occur within each discussion of the different rules, but it is traversing the entire narrative to find the thread of discussion that can leave the reader wondering what they just read and where this all began. I admit that I enjoyed the meandering discussion and numerous insightful viewpoints, but if the premise of the book is to find twelve keys to successfully slaying the chaos dragon, it may be best not to meander along the countryside and forget the task at hand. Soldiers in the battle need clear rules of engagement. That being said, perhaps people enjoy the discussion and as I admit to not being keen on this genre, I am speaking for myself alone. Whether I enjoyed the content, the method of delivery, or even the message, Peterson does craft an effective book and keeps the reader engaged throughout. Canadian content is always nice to see and he personalises the journey, rather than speaking from an ivory tower down to the lowly masses. I can applaud him for that and am pleased to see that type narrative flowed so well and seemed to present a clear understanding of the topic at hand. Kudos, Mr. Peterson, for your helpful insights into the world of removing chaos. I’ll keep the book for future reference and be sure to speak to others about it.This book fulfils Topic #5: First and Last? in the Equinox #3 Reading Challenge.Love/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"userName": "Onuralp", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/26879659-onuralp", "userReview": "Awfully verbose, incoherent, and hurried text without any content original enough (on top of his online lectures) to grant writing this lengthy book. The rule about telling the truth stands out as a notable exception."}, {"userName": "Gary Moreau", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/41901229-gary-moreau", "userReview": "This is a magnificent book. And part of that magnificence comes from the fact that it is “complete” in the same sense that All I Really Need to Know I Learned in Kindergarten (Fulghum, 1989) was complete. The rules are simple: from “stand up straight with your shoulders back,” to “do not bother children when they are skateboarding.” They are, however, all-encompassing. When you finish reading it (and it is a long book) you are sure to ask, “What else is there to say?”At the risk of grave oversimplification the book is based on the non-linear worldview most often associated with the Taoist concept of yin and yang. In this case, however, yin and yang become order and chaos, and the spiritual foundation is not Eastern philosophy but the stories of the Judeo-Christian Bible, offered liberally but in a non-dogmatic context. The key to this worldview is not what you call the two opposing forces as much as it is the realization that knowledge, consciousness (Dr. Peterson’s preferred description), harmony, virtue, and enlightenment are all found along the border between the two. And that this is a border that is in constant evolution.At another level, Dr. Petersen is a Pyrrhonist, although he never uses that term or makes any allusion to the famous philosopher who traveled with the armies of Alexander the Great into India. A Pyrrhonist rejects all dogma because while dogma states a belief (or law or regulation), it concurrently states a non-belief. Which is why laws inevitably have loopholes, rules always have exceptions, and language is often an inadequate convention with which to convey ideas.At the heart of Taoism, Pyrrhonism, and, indeed, this book, is the recognition that everything in life and the universe is a dichotomy. There is a pro to every con. There are two sides to every coin, perspective, story, etc. Which is why every dogmatic argument, as Petersen argues throughout, contains internal contradictions. They are the inevitable byproduct of every dichotomy.The dogma that he rejects most forcefully is ideology, particularly of the socio-political variety. He rejects all ideology, but particularly relativism (including feminism and environmentalism—the ideology not the objective), and the blind ideology of both the liberal/progressive left and the Tea Party/libertarian right. And what he dislikes most about both ideologies is the finality of their supporters. More than anything else, it appears, Petersen believes in mindful growth and continued evolution as both a fact of life and the desired response to its challenges.And therein lies, I think, the one weakness of the “12 Rules for Life” worldview. It is not wrong per se, but it presumes that all other ideology is essentially both failed and fixed. Such ideology is, in other words, inherently flawed, negating the value of any further discussion or experimentation. We are all shaped by our experiences and Petersen’s worldview seems to have been shaped by the atrocities of 20th Century fascism and Stalinist Russia, and more specifically the Holocaust and the Cold War, which he, like myself, came of age during. Both are clearly appropriate targets of disgust and revulsion as manifested, but how broadly do we paint with that brush? He paints pretty broadly, suggesting, for example, that Stalin did not pervert communism; it is inherently perverted. That my be true of communism although I am reminded of the fact that Marx never truly articulated what happened after his presumed proletarian revolution, so I’m not sure we can use Stalin to exile Marx once and for all. And I do think that socialism and relativism, particularly feminism and the oppression of the white patriarchy (which he doesn’t deny but contains), to differing degrees, still offer plenty of room for productive development.In the end, the dichotomous worldview that is at the heart of Petersen’s twelve rules, I believe, is the right one, so long as we don’t exclude all other worldviews and their ideology. He is right that fulfillment is found on the forever-evolving border between the two sides of the dichotomy. The rule of rules, therefore, is “to have one foot firmly planted in order and security, and the other is chaos, possibility, growth, and adventure.” (Which, he notes, is where good music resides.) I think of it as the border between inductive and deductive reason but the fundamental concept is the same. This is a very good book that is very well written. It’s chock full of stories and references, from the stories of his Canadian prairie upbringing, which I can certainly relate to, to his very appropriate references to the great minds of history, from Socrates to Nietzsche and Dostoyevsky. He is a very gifted and passionate storyteller and I hope he continues the conversation.A must read for all, but particularly those on the cusp of adulthood."}, {"userName": "Murtaza ", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/13716226-murtaza", "userReview": "I was really prepared to pick up this book with an open mind in order to understand what so many people have found compelling about it. After finishing, I have to say that for the most part I am more mystified than when I began. \"12 Rules for Life\" is technically what its advertised as, a self-help book with twelve axioms for the reader to follow in order to improve their quality of life. As far as they go, the axioms, which the chapters are named after, are harmless and actually serve as good reminders. But each of the chapters is only the entry-point to much longer philosophical dirges that express Peterson's very muddled and unsystematic worldview, along with anecdotes from his personal life. The anecdotes are generally the more comprehensible and compelling parts of what he has produced. Suffice to say this is a very badly written book, about 200 pages too long and rambling into near incoherence at times. I picked this up with the expectation of a light read but after being force-fed so many bafflingly indigestible passages I was starting to wonder whether my brain was being short-circuited. As for the core of Peterson's basic argument, I'm not actually sure what it is. As far as I can tell it doesn't coalesce around anything in particular, aside from Peterson's visceral personal opposition to an amorphous thing that he calls \"postmodern neo-Marxism.\" Its still not clear to me what he defines this spectre to be, though it sounds appropriately terrifying. Having said that, through the guise of his deceptively simple self-help tips, I would say that he does seem to be trying to create a new type of metaphysics for people who have been cut adrift by modernity. Although he doesn't say it outright, he is clearly trying to give life meaning again for those whom today it feels meaningless. In itself this is a good goal and one that we should take seriously. The problem is that Peterson is woefully and obviously not up to such a Herculean task, fit for a prophet. For those lacking meaning (a very profound and painful thing to lack) Peterson throws together everything from evolutionary biology, Bible exegesis and native mythology to Jungian psychoanalysis and stories from his own life to try and reconstruct a new metaphysical sense of being. The end result feels very haphazard and vague. Its certainly far inferior to anything you would get from deeply engaging with any number of well-developed ethical and spiritual traditions. He also frequently throws out bizarre mystical assertions like \"chaos is considered feminine\" and expects the reader to just follow along. I suspect you'd only be able to do so if you already in some vague way shared this esoteric belief.It really feels as though this book was written for the type of person who'd have otherwise been attracted to the shallow liberal-nihilist New Atheist style of thought. Peterson is probably a better alternative, but he's far from ideal and I'm not sure why you'd even need to read him when far more solid alternatives are available. If you're going to cite the Bible so much, why not just explore Christian spirituality? Why not read the Stoics directly, instead of this random and somewhat questionable guy telling you that life is suffering and you need to tough it out? Perhaps Peterson deserves credit for at least bringing up the elephant in the room, which is that many people feel miserable. But you'd be much better off going directly to the sources of ancient thought and being, rather than having him as your shaky interlocutor.In Peterson's defense I will admit that I found the section he wrote about lobster evolution surprisingly moving and compelling, even if it might not actually be true. Reading the book I didn't get the impression that Jordan Peterson is a monster. But I'm also a bit troubled by the idea that he constitutes one of our ages Great Thinkers. My own take, just based on reading 12 Rules for Life, is that he is a moderately interesting person, a terrible writer and a bit of a dilettante. I also think that he, in his own way, is someone who genuinely cares about peoples wellbeing. Unfortunately given his proclivity for making bellicose and puzzling public statements, I'm afraid that he is gradually becoming Kanye West-style unhinged by the notoriety that he has very suddenly received. This may well take him to a worse place in the foreseeable future, or open the door for even stranger individuals to take his place. It seems that Peterson has been taken up as a standard-bearer by people who are, for the most part, unjustly aggrieved. He's really running with it, but in the end I'm not sure how far he can go on so little fuel."}, {"userName": "Dan Graser", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/7258380-dan-graser", "userReview": "Far from the banal, \"self-help,\" or, \"life-coaching,\" images this book's title may suggest, psychologist Dr. Jordan Peterson has crafted here a series of seemingly blunt and practical suggestions that look, at least superifically, as if they are ideas you and society at large already appreciate. However, the importance of this tome lies in the depth behind each of these simple suggestions and the weight of philosophical, psycho-analytical, experiential, and rhetorical/literary evidence Peterson brings to bear.In such a collection, certain Rules will appeal more to various people, despite their near universal applicability, and for me it was the final four. Of course several folks are going to describe this work as controversial merely for Peterson's recent online phenomenon and foray into the political sphere surrounding free-speech issues in Canada but I genuinely found none of this particular volume even remotely controversial. Of course in such a wide-ranging work which incorporates Jung, Freud, Nietzsche, Solzhenitsyn, the Bible, and numerous popular culture references, there are likely to be moments of disagreement. I for one don't agree at all with how Peterson frames what it means to be an, \"atheist,\" for example, and he genuinely thinks those who are and profess to be aren't atheists at all merely just theists who don't know their own theological underpinnings. However, as his rule 9 makes clear, it is important to listen to and appreciate the words of those with whom you may inherently disagree. Peterson's language and delivery is also a pleasure to read, mixing great gravitas and emotional clarity in describing his daughter's unfortunate medical struggles (in the final Rule) with humorous notions on child-rearing such as, \"There's no way I'm rewarding a recalcitrant child for unacceptable behavior..and I'm certainly not showing anyone any Elmo video. I always hated that creepy, whiny puppet.\"The success of this volume is that it succeeds in not being what a lot of superficial volumes with similar titles end up being. Where many have produced irrelevant concatenations or peripatetic philosophical/psychological meanderings, Peterson has provided a profound and directly applicable series of, \"Rules,\" that will likely improve the lives of many."}, {"userName": "Steve James", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/37938288-steve-james", "userReview": "12 Rules (whittled down from an original 60 something) is about how to improve how you live. Each rule is explained in detail, and Peterson goes into the meaning of each subject philosophically, psychologically, and using varied examples from life. Although far more accessible, 12 Rules follows on from Peterson’s other book, Architecture of Belief, and examines the mythology, biblical similes and ancient stories, as well as evolutionary systems which, after all, have guided us behaviourally and morally for thousands of years longer than logos has, or can. Peterson guides us through a refreshing and beautifully thought-out philosophy of living."}, {"userName": "Mohammad", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/20388505-mohammad", "userReview": "Unlike what the title suggests, this book is not a self-help book, even though it does help the self a lot; rather it's the deep views of a serious thinker about life's most important questions. At a time where the truth of many opinions are based on the loud voices that preach them and the forces that bully the oppositions, Peterson's original thinking is a breath of fresh air. Even if you don't agree with him in everything, you will definitely learn many things from him and more importantly you will have respect for his character and how he stands for his principles."}, {"userName": "AnnaG", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/62187194-annag", "userReview": "I bought this thinking it was a self-help book - it sort of is, but really it's a tour around some of the most important impulses of the human mind. The fundamental insight from this book is that our norms and culture exist for a reason and that attempts to interfere with those are likely to have profound detrimental impacts on society as a whole and individuals who won't know how to relate to other people properly. Sadly, it's all very true."}, {"userName": "Richard Nell", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/61438305-richard-nell", "userReview": "First, because of the endless politicization of this man, a couple things to know about me, if you're trying to determine what 'team' I'm on: Stop it. I'm not on a team. I hate teams. I despise identity politics of any kind. Facts are facts and truth is truth regardless of where it comes from, and anything that turns an individual into a 'group' is basically a bad thing in my book (and Peterson's, incidentally). I also think free speech is about the most important thing in a free society. I don't even think of it as a right, I think of it as a responsibility. I believe you have the responsibility to speak the truth, as you see it - even in the face of offence, or disagreement. That is how to maintain the health of a society.Jordan Peterson seems to say the same, and so I consider him an important thinker and ally despite not sharing all his views. That is the beauty of a free society, free especially in speech and thought, where we need not agree on everything at all times, where we are free to offend, and free to disagree, and free from purity and tyranny in equal measure, all without violence. So, with that in mind, my actual (short) review of the book:The rules are good. The writing itself is hit or miss, fluctuating between sharp insight and supported claims to repetitive rambling. It's almost like two 'mini' books weaved into one. The first 'minibook' is absolutely excellent. It's the genuine, practical advice of a clinical psychologist, a well-read academic, and a naturally wise, kind, good man. It is written conversationally, if sometimes somewhat bluntly, which could rub some people the wrong way, but should be taken as passion rather than condescension or arrogance. I recommend this 'book' without reservation. The second 'minibook' is a cerebral man's keen interest in mythology, particularly religious mythology, spliced with philosophy, psychology, and history. I personally found this rather interesting, but not particularly persuasive, or more importantly, not necessary. The solution is to skip quite a lot of this if you're not interested, and take what you find useful from the good parts of the book.If you want to see why people are interested in this man, and a brief summary of why courage, honesty and knowledge can be so powerful, you need go no further than watch a now-infamous interview between Dr. Peterson and a British journalist named Cathy Newman. Ultimately if you enjoy the video, I recommend the book. Link below.Interview"}, {"userName": "Dan Case", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/15803908-dan-case", "userReview": "Disgustingly boring. Could not, for the life of me, listen more than 25% of the book. I’ve enjoyed talks from Peterson but definitely not this book. I love others books on similar topics but really this book could’ve been condensed. There were too many unnecessary paragraphs and reiterations."}, {"userName": "Gints Dreimanis", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/26769987-gints-dreimanis", "userReview": "Keeping it real 100. This is the best self-help book I have read (which doesn't speak much - self-help books are generally terrible). If you need a self-help book, this might not even be a book for you. It is a bit too harsh and \"fanatical\" for everyday reader. But it is also true.If you are a modern chap or chappette, it will be hard to buy the more fantastical portions of the book like Jungian archetypes, Bible stories etc. It might also be hard to buy that something about left thought might be wrong. Frankly, Jordan doesn't give a shit about that. If you are wondering what it is about, here are the things I remember the clearest: Don't be pathetic. Tell the truth. If you don't tell the truth, reality will slap you in your face. Don't help others, help others help themselves. Suffering is not that bad. We are all flawed in different ways, it's a miracle we even function and you should be grateful for that and just work on making it better one day at a time."}, {"userName": "Neo", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/15350126-neo", "userReview": "Best every written self help book. Many thanks to Dr. Jordan for this wonderful and amazing book. This is THE ONLY ONE book (self help) you ever have to read in ,your entire life to live a balanced, peaceful and happy life. Best book since 2000. Love to recommend to everyone, must read this book at least once in their life span."}, {"userName": "Eric Morse", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/4781516-eric-morse", "userReview": "Don’t let the hokey self-help style of the title and format dissuade you. This is the best book in twenty years. It is self-help in the sense that Peterson’s readers need help as we all do, and Peterson offers in twelve rules how to improve their lives. But it is much more than that. Peterson uses his vast knowledge as a clinical psychologist and professor to provide depth where other self-help books only offer gimmicks; Peterson’s approach is big-picture philosophical where others’ approaches are shallow how-tos. The result is basically a manual on how to be human, and nothing is more relevant in today’s world.The book is a distillation if Peterson’s wide-ranging and often unwieldy lectures. It’s a relentless tour de force from one of the age’s best minds. The only thing that might be lacking in this work (and Peterson’s overall philosophy) is his acceptance and reliance on medical drugs (featured in the second and last Rules). But the remainder of the content is so powerful, so well-needed, and so life-giving as to completely overshadow the lone drawback. We face a crisis. As a culture, we are teetering on the edge of chaos. Many of the culture makers want us to plunge into the abyss. Peterson shows us how disasterous this would be. And in doing so gives us the tools to return to order and make the most out of being human. This book is a masterpiece."}, {"userName": "Matthew", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/9131101-matthew", "userReview": "“12 rules” makes it sound simple, but nothing about this book is simple.This book, at its core, attempts - as humbly as possible- to explain the meaning of life. Spoiler alert: it has nothing to do with following your bliss. In a word, the meaning of life is found in....responsibility. The book is jarring even for those of us who assumed we’ve been taking our responsibilities fairly seriously. Peterson is deep. In this book he reveals a profound subtext of the human experience. He quotes the Bible and the Tao, but the subtext is larger than religion. And, more importantly, more immediately useful in living a life of meaning. This book, once Read, is worth coming back to again."}], "description": "What does everyone in the modern world need to know? Renowned psychologist Jordan B. Peterson's answer to this most difficult of questions uniquely combines the hard-won truths of ancient tradition with the stunning revelations of cutting-edge scientific research.Humorous, surprising, and informative, Dr. Peterson tells us why skateboarding boys and girls must be left alone, what terrible fate awaits those who criticize too easily, and why you should always pet a cat when you meet one on the street.What does the nervous system of the lowly lobster have to tell us about standing up straight (with our shoulders back) and about success in life? Why did ancient Egyptians worship the capacity to pay careful attention as the highest of gods? What dreadful paths do people tread when they become resentful, arrogant, and vengeful? Dr. Peterson journeys broadly, discussing discipline, freedom, adventure, and responsibility, distilling the world's wisdom into 12 practical and profound rules for life. 12 Rules for Life shatters the modern commonplaces of science, faith, and human nature while transforming and ennobling the mind and spirit of its listeners.©2018 Jordan B. Peterson (P)2018 Random House Canada", "title": "12 Rules for Life: An Antidote to Chaos", "url": "https://www.goodreads.com/book/show/30257963-12-rules-for-life", "average": 4.09, "cover": "https://images.gr-assets.com/books/1512705866l/30257963.jpg", "reviews": 1685, "authors": [{"url": "https://www.goodreads.com/author/show/282885.Jordan_B_Peterson", "name": "Jordan B. Peterson"}, {"url": "https://www.goodreads.com/author/show/311849.Norman_Doidge", "name": "Norman Doidge"}, {"url": "https://www.goodreads.com/author/show/12754.Ethan_Van_Sciver", "name": "Ethan Van Sciver"}], "type": ["Nonfiction", "Psychology", "Philosophy", "Self Help", "Self Help"], "outlinks": ["http://www.goodreads.com/book/show/30257963-12-rules-for-life", "http://www.goodreads.com/book/show/33792742-12-rules-for-life", "http://www.goodreads.com/book/show/2218102.Maps_of_Meaning", "http://www.goodreads.com/book/show/38356289-tragedy-vs-evil", "http://www.goodreads.com/book/show/38320113-personality-and-its-transformations", "http://www.goodreads.com/book/show/35445963-religion-sovereignty-natural-rights-and-the-constituent-elements-of-e", "http://www.goodreads.com/book/show/38356278-reality-and-the-sacred", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}