{"ratings": 470, "userreviews": [{"userName": "Mandi Schreiner", "userReviewDate": "Aug 10, 2013", "userURL": "http://www.goodreads.com/user/show/2704703-mandi-schreiner", "userReview": "Maybe I’m a sucker for a cover with horses on it, but when I received this book for review, even though I had heard it’s more on the women’s fic side, I still wanted to read it. And yes there are wild horses, and a sexy handyman and a heroine who is looking to reunite with her mother. There was a really nice combination of drama, small town life, romance and humor.When Ella and Merry were young girls, their father divorced their alcoholic mother and decided to raise them on his own. Now as adults, Merry feels it’s time to reunite with their mother who has moved to Sanctuary Island and has sobered up and now lives a very good life. Ella doesn’t really want to have a relationship with their mother, but she will do anything for her little sister, so off they go.Sanctuary Island is a place where wild horses roam free and the locals are very protective of their space. When they arrive at their mother’s house, they also meet handyman Grady Wilkes. Grady used to live in Dallas and work on an elite urban rescue squad until a terrible accident. He retreated to Sanctuary Island and healed, but has never left. His scars run deep. While he and Ella initially butt heads, they soon realize there is chemistry between them. But Ella doesn’t want to stay on the island, and Grady has never left it. I read this book in one sitting and it was just a really fun read for me. Ella is uptight and harbors a lot of anger for her mother not being there when they were growing up. She struggles with her sister who is vibrant embraces this new relationship with their mother with open arms. Her and Grady actually fall for each other pretty quick, but their tension and romance played out well for me. Grady has issues from his past he has to work through and his overprotective vibe of the island. A lot of reviews I’ve read say this is more women’s fic. I’m not sure I 100% agree with that. There is a strong romance, but we do get POVs from other people. We are along with Ella’s mother for her journey at reuniting with her daughters, money problems and a romance of her own. Merry’s book is next and she gets setup really well with the town’s vet. I can’t wait for their story.Sanctuary Island is a fun and engaging story and I’m looking forward to book two."}, {"userName": "Dorine", "userReviewDate": "May 27, 2013", "userURL": "http://www.goodreads.com/user/show/6942470-dorine", "userReview": "Also posted with covers at my blog, TBR Mountain Range.There is a lot to love about this compassionate novel concerning a scarred protector of wild horses who falls in love with the city slicker who is determined to commercialize his quiet oasis. Can they both get what they want and heal their injured hearts in the process? Recommended Read!Having grown up surrounded by horses, dreaming of them in the wild ever since reading MISTY OF CHINCOTEAGUE by Marguerite Henry as a child, it's easy to understand my immediate connection to a book partially about wild horses. The vivid imagery of this windswept oasis captivated me quickly. Add in that I was on my way to an island vacation, dreaming of riding horseback on the beach and there was no doubt that SANCTUARY ISLAND was one of the books coming with me. That it turned out to be such a superb beach read is a bonus!I never expect a \"new to me\" author's novel to touch me deeply like one of my favorites, so it is always surprising when it happens, which is exactly why I highly recommend SANCTUARY ISLAND—it is full of surprises and great emotional moments in a brilliant story of perseverance.Off the coast of Winter Harbor, Virginia lies Sanctuary Island, accessible only by ferry so it adds to the trepidation that sisters Ella and Merry feel on their way to meet their mother for the first time in fifteen years. Ella has always taken care of her baby sister, no matter what she dared to do, so when pregnant, husbandless Merry decides to finally accept one of their mother's many requests to spend time with her, Ella has to accept, too.Even though Merry is pregnant and they're an hour by boat from the mainland, Ella feels that two weeks won't be a danger to a baby not due for several weeks. Just how much emotional damage can be done by their estranged mother to her sister during that time remains to be seen. That's why Ella is there to protect Merry, because Ella feels that she's immune to the woman who gave birth to them since Jo Ellen abandoned them in preference of her alcohol obsession. But Merry has other ideas and thinks that two weeks won't be enough. Can Ella convince Merry that their mother is a mom in name only and hasn't changed from the drunken irresponsible woman Ella remembers?Grady Wilson loves Sanctuary Island and considers himself its protector, as well as the protector of his very good friend, Jo Ellen Hollister. Jo had saved Grady from himself, with the help of Sanctuary Island, after the injuries from his last rescue mission left him jobless and full of self doubt. Although he still hides his hands beneath the leather gloves he always wears and the clothing that keeps the rest of his scars hidden, Sanctuary Island has given Grady strength and purpose.Grady is convinced that Jo's daughters are trouble that Jo doesn't need, especially Ella, who seems to have her sights set on Jo's inheritance for all the wrong reasons. That is, until Grady is forced to get close to Ella when she needs his rescue skills. No woman has ever made him feel as alive as Ella Preston did in those few short minutes.Jo Ellen Hollister is about to lose her family's inheritance due to a bad business deal made by her aunt before she died. Jo has options, with the man who wants to marry her, but settling for marriage based on finances isn't what Hollister women do. Besides, adding another person into her relationship with her daughters right now may push them away forever. Can Jo find a way to keep her ancestral home and also reunite permanently with her daughters?SANCTUARY ISLAND proves why the \"Beauty and the Beast\" story arc works so well in a romance novel when it's done with such emotional precision. Grady is broken and steadily healing physically, with scars, but he hasn't let his heart complete the cycle…yet. Ella seems so pulled together after years of therapy, but confidence doesn't always mean that you're emotionally fulfilled. An alcoholic, Jo Ellen Hollister damaged her relationship with her daughters fifteen years ago, and even though she's changed, as well as developed other important personal relationships, it's her daughters' approval she craves the most. Merry loves her sister and her unborn child, but is she willing to risk both to experience the love of her mother? The pain that all these characters have endured is palpable, yet when they take solid steps towards healing, you can't help but cheer them on. It's that tug of combined emotion that pulls you deeply into their lives.A riveting tale of overcoming fear and emotional roadblocks, SANCTUARY ISLAND makes you fall in love with the island and its inhabitants. Author Lily Everett brings tears, laughter and a happy-ever-after smile to your face while you're experiencing her well-written, compassionate novel. I highly recommend SANCTUARY ISLAND as a \"no excuses\" emotional fight for a happy life in a book that hits home with real-to-life characters. Their struggles are emotional but cleansing at the same time, making the time spent within the pages of this novel completely mesmerizing. I can't wait for Merry and Ben's story in book two of the SANCTUARY ISLAND series, SHORELINE DRIVE, due out in January 2014. I think others will feel immediately connected to the quirky Merry, who is as full of light as her name, and the rough-around-the-edges veterinarian, who avoids human contact in preference of animals who don't talk back.Book and review courtesy of Romance Junkies."}, {"userName": "Jo (My House of Books)", "userReviewDate": "Apr 27, 2013", "userURL": "http://www.goodreads.com/user/show/4297905-jo-my-house-of-books", "userReview": "I will admit, I was skeptical. I don't typically go for women's fiction books, mainly because I end up crying. When I found out Lily Everett was also Louisa Edwards, whose romances I have more often than not enjoyed, I was willing to take the chance.And I'm so glad I did. The world of Sanctuary Island that's presented in this book doesn't really lend itself well to the novellas which Ms. Everette previously released. Sanctuary Island is lush and rich in characters and heritage, and while, yes, at its heart is a woman struggling to reconcile her past and her relationship with her mother and sister to her future, Sanctuary Island is also about love, about forgiveness, and about moving on in the face of heartbreak. I inhaled this book. I lived every moment with Ella Preston, and when Taylor burst in to Grady's house to reveal Ella's \"plan\" for the island, I almost screamed at the top of my lungs for Grady to slow down and think things through. I am so looking forward to learning more about Ella and Merry and Jo and how these three woman coexist on the island and with one another."}, {"userName": "Elizabeth", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/4247182-elizabeth", "userReview": "Great beginning to a series."}, {"userName": "Gail", "userReviewDate": "Feb 18, 2015", "userURL": "http://www.goodreads.com/user/show/803515-gail", "userReview": "I liked this one a lot. The heroine is coming to the island only because her pregnant little sister wants to reconcile with their estranged mother. The heroine wants nothing of it, but she won't let sis go alone. And before they reach Mom's house, they encounter a good-looking man who warns them off from hurting Mom. Of course he turns out to be the hero. There's a lot of angst, handled well, though some of it feels a tad unfinished. It's a good story.I did wonder a bit at some of the setting info. I think the egret thing is probably a copyedit blip. The island stuff does Not fit barrier islands. I'm assuming it's set in Virginia because that's the only state mentioned and that's where the wild horses are in reality. VA has no rocky islands off its coast, just barrier islands. (Nor are any of them occupied by humans, but I'll give the author that in suspension of disbelief.) The ocean is not deep enough to cliff jump off a barrier island (not to mention no cliffs). Barrier islands are long flat sand bars with sandy soil, no clay. They are pretty invariably shaped like cigars, and there is no surf on the bay side of an island like this. The Intracoastal Canal runs along the bays and estuaries between the barrier islands and the mainland and barges run there. Barges are flatter than ferries. Storms can get serious in those bays, but they have to be on the level of at least a tropical storm. It's not like traveling to one of the islands off Maine or Massachusetts. It's not even as stormy as traveling in the Puget Sound. The water is shallow and very protected. Ferries across the ICC tend to be open deck because of this. These islands are Very close to the mainland. The author needed to do a little more research. Of course, if you don't live on a barrier island yourself, like I do, you probably won't even notice. It was enough to pull me out of the story momentarily but it certainly did not spoil my enjoyment of the story."}, {"userName": "Christa", "userReviewDate": "Jan 15, 2014", "userURL": "http://www.goodreads.com/user/show/261662-christa", "userReview": "Along with her Billionaire Brothers novellas, this book has already placed Lily Everett as a must read author for me. I enjoyed this book tremendously and found the main characters, Ella and Grady, to be very appealing. I enjoyed watching these two develop a relationship that seemed unlikely in the beginning. I loved Sanctuary Island and its residents."}, {"userName": "Darcy", "userReviewDate": "Sep 19, 2015", "userURL": "http://www.goodreads.com/user/show/2225246-darcy", "userReview": "This one wasn't bad, pretty predictable from the start, from the mommy issues to how one of the couple would feel betrayed and blow up without knowing the full story. What kept me listening was I really liked the idea of an island that seems to heal everyone."}, {"userName": "Sonja", "userReviewDate": "Aug 15, 2013", "userURL": "http://www.goodreads.com/user/show/4713360-sonja", "userReview": "I absolutely loved this book! What a beautiful story!"}, {"userName": "MJ", "userReviewDate": "Dec 25, 2017", "userURL": "http://www.goodreads.com/user/show/4914805-mj", "userReview": "NOT a review. For personal reference only.Family shelf:Story of reconciliation between estranged mother and her daughters. Incredible sisterly love. I'm awed how much Ella loves Merry.Romance:It was definitely a whirlwind romance between Grady and Ella but it didn't feel like it, in my opinion. I like how they slowly revealed and accepted the skeletons in each other's closets. They seem to bring out the best out of one another. They broke down each other's walls and brought something wonderful to each other's lives. I, however, was kinda pissed at Grady for his tirade after finding out about Ella's original proposal but if it's a way for him to be face to face with his personal issues and come to terms with himself, then I'm cool with that because no character is perfect. We are all flawed in varying intensities but none less important than the other.Substance Abuse / Psychological:Mom suffered alcohol addiction. Ella is a planner. A workaholic who doesn't like deviating from her plans, including her plans for other people.Tear-jerker:Shed some tears here and there, namely: the mare giving birth and Ella and Merry fighting. I love Ella and how tough she presents herself but is actually such a loving, loyal, and kind-hearted woman deep inside.Self development:Ella slowly learned how to let go of the past, accept the fact that people change, hope for the better, risk for a shot at happiness, and live in the moment. Grady also was able to face and conquer his own demons."}, {"userName": "Michelle", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/5707336-michelle", "userReview": "Ella has been to enough therapy over the years that seeing her mother after 15 years doesn't affect her that much. Well, so she says. When her pregnant younger sister decides that she wants to reunite with their absentee mother Ella knows she can't say no but her own feelings about the reunion are extremely muddled. Especially when sexy handyman Grady seems to appear whenever she turns around. Grady doesn't want to be attracted to Ella when he knows she's not destined to stay on Sanctuary Island but the more time he spends with her sharing his love of his home, the harder it is to let her go. Can the woman with a life and home in DC find the quiet and contentment she needs to stay on Sanctuary Island? Especially with the temptation of Grady. Really great, sweet start to the series, excited to see what comes next."}, {"userName": "Amanda", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/10033870-amanda", "userReview": "Swoon worthy story!This is the first I have read Lily Everett and I already have two more of hers waiting for me after reading this book! Beautiful descriptions make me feel as if I were in the little island myself and you can't help but fall in love with Grady and Ella with their struggle to overcome themselves. I can't wait to dive right into the next story!"}, {"userName": "Lili", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/59546376-lili", "userReview": "Lovely StoryGreat character's and storyline. Love the horses and the thought of the island. Reminds me of Mackinac Island in Michigan. Read one of these books there!"}, {"userName": "Natalie", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/37394200-natalie", "userReview": "It was very interesting reading!"}, {"userName": "Mary", "userReviewDate": "Nov 02, 2013", "userURL": "http://www.goodreads.com/user/show/2488068-mary", "userReview": "I admit I was a little apprehensive when one of my favorite authors who wrote one of my favorite books ever (Just One Taste, which is still filled with sticky notes), decided to veer off in a different direction in her writing, but I needn't have worried. Sanctuary Island by Lily Everett, aka Louisa Edwards, is full of sticky notes, too.Ella Preston and her exuberant younger sister, Merry, set off for Sanctuary Island, an isolated refuge for wild horses. After a 15-year estrangement, they've agreed to see their mother, Jo Ellen, who lives there. Neither of the women is prepared for falling in love with the place and the people. Ella was old enough to remember when their dad left and took the girls away from their alcoholic mother. She's very cynical about seeing her mother again. Merry, who is pregnant by yet another fly-by-night ex-boyfriend, is more forgiving and curious about seeing her mom after all this time. Then again, she doesn't have the same baggage that Ella has. Ella likes taking care of Merry, but Merry is starting to come into her own. Merry is tired of messing up her life, and imminent motherhood is giving her a backbone. Ella's Type-A, workaholic personality will not allow her to even consider a stay longer than two weeks, until she meets handyman Grady Wilkes. He rescues her after she falls through decaying front porch steps at her mother's home.Lily's talent for metaphors that make me melt is shown throughout the book:\"But all the same, as she stood there in the circle of his arms and stared up into his eyes, she felt a connection unfurling between them like the tender, green vines creeping up the side of the house.\"There is reluctant chemistry on both their parts. While Ella hides her internal scars, Grady hides the physical ones he suffered in his former search-and-rescue job. To complicate things, Grady is friends with and protective of Ella's mother, Jo.Grady thinks that showing Ella the island will make her want to stay. On their first foray, they bond over the rescue of a wild horse trying to birth a foal on the beach. It's a beautiful scene that fills Ella with wonder, but she stubbornly clings to her schedule of leaving the island after Merry's had her fill of visiting Jo. Ella admits to Grady that she's on a forced leave from her job and that she really doesn't have to leave.During the visit, Ella finds out that her mother is having financial problems and may lose her home. Her big-city ideas to help Jo clash with Grady's resentment of any idea of cluttering the island with tourists. Adding to the complications are Jo's boyfriend, Harrison, and his daughter, Taylor, whom Jo has grown close to. Taylor sees Ella and Merry as competition for Jo's attention, and Ella resents that her mother is capable of being a mom to this unrelated teenager. It breaks my heart when Jo acts brave in the face of Ella's cynicism. It's wonderful that Merry is the one to show Ella the path to forgiving Jo and letting go of the negativity.I love the way Lily ties it all together. I'm so looking forward to the next book in the series.This review originated on USA Today's Happy Ever After blog. Includes an interview with the author."}, {"userName": "Janga", "userReviewDate": "Jun 23, 2013", "userURL": "http://www.goodreads.com/user/show/1206531-janga", "userReview": "I enjoyed Louisa Edwards’s Recipe for Love books, and even after reading the billionaire Harrington brothers novellas that served to introduce Sanctuary Island to readers, I wasn’t sure why Louisa Edwards was now writing as Lily Everett. Sure, there was a major change in setting, but she was still writing contemporary romance. Her stories were still a mix of humor, hurt, and heat. I understood better after reading Sanctuary Island, which has the definite feel of a romance/ women’s fiction hybrid. Ella’s journey to self-knowledge and self-acceptance are key to the story, but this fact does not lessen the power of the romance. In fact, there’s a love scene that I’d rank very high on the tenderness, heart-melting scale.Ella and Grady’s story is richly emotional and rewardingly intricate. Despite Ella’s time in therapy, she is still very much the adult child of an alcoholic. Her need to be in control, her heightened sense of responsibility, her difficulty in letting go and just having fun, and, most of all, her difficulty separating the past from the present are all classic symptoms. She felt so real to me that I found it easy to understand and forgive her stubbornness and her carefully maintained distance from her mother. I fell in love with Grady from the start. His loyalty, his courage, and his ongoing struggles with the consequences—physical and emotional--of his injuries gave him depth and credibility. Without taking any respect away from military heroes, I was also pleased that his injuries were sustained in a different manner. As the recent deaths in Colorado surely reminded us, heroes wear a lot of different uniforms, and some even dress as civilians. Although the romance is central to the story, Ella’s relationship with Jo Ellen is equally important. Truly forgiving her mother, not merely giving lip service to the idea, is an essential step in Ella’s ability to become healthy enough to give and receive love. Everett does an excellent job of giving both relationships their due. Jo Ellen too is a great character. Her love for her daughters is evident as are the regrets she lives with and her need to accept herself as worthy of a second chance, not just with her daughters but with a full life.The Billionaire Brothers novellas are fun reads, and I think contemporary romance fans will enjoy them. But Sanctuary Island is something more than a good read. It has substance and heart, and it leaves the reader thinking about connections and disconnections and forgiveness and healing as well as happy endings. I highly recommend it. See full review at Just Janga:http://justjanga.blogspot.com/2013/07..."}, {"userName": "Viviane Crystal", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/2682057-viviane-crystal", "userReview": "Ellie and Merry Preston are on their way from Washington, D.C. to Sanctuary Island at the request of their mother, Jo Ellen, who has not seen them in years because of her former alcoholic status. While she has begged for contact over that very long time, it is only now after years of therapy that Ellie agrees to take Merry to meet their mother. Ellie insists she expects nothing and is only there to make sure Merry doesn’t get hurt, especially as Merry is very pregnant and not known for her wise decisions in the past. Jo Ellen is to have two weeks with her daughters but secretly hopes it will be much, much longer! Whether Ellie can get over her bitterness and anger to handle just the two weeks remains to be seen!Immediately on arrival, the girls meet Jo Ellen’s handyman, Grady Wilkes, and the sparks fly! No, initially it’s biting, barbed comments back and forth operating between the romantic sparks, all of which don’t bode well for the impression both Ellie and Grady are making on each other and certainly creates a heck of a lot of confusion. Grady, nevertheless, winds up helping Ellie who has an accident and twists her ankle as she falls through a crack in the staircase leading up to her mother’s home. It could have been prevented but a young teen who avidly resents their presence isn’t quite careful in her warning for them to be careful on their approach to the house. Now is where the plot begins to get interesting and no, it’s not predictable at all. Merry immediately warns to the mother she always longed for and Ellie will make things worse when she discovers a secret that doesn’t remain a secret for long with her mother. Grady turns out to have a serious wound but his internal wounds from the event causing the physical harm is much worse and threatens his future life with a confined existence on the island. A conflict about money will drive all through some big mistakes but eventually a well-thought-out plan that eventually brings harmony and promise for the future but not until Ellie and Grady thump it out verbally and emotionally and allow the romance to have a very small chance.Lily Everett knows how to keep a reader’s interest by inserting problems and the struggle through them just at the right moment; all in all the plot development is superb and that makes the romance as it evolves even sweeter! Sanctuary Island is a riveting read with something for everyone, as well as many descriptive scenes depicting a place everyone would love to visit or to live permanently. Finely presented, Lily Everett!"}, {"userName": "Jess", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/30928416-jess", "userReview": "I went into this book thinking it would be like every other book you read from the grocery store (it's got one of those covers that screams front register pick) but was in for a pleasant awakening.I am HUGE on human interactions and connections; this book had just that. Ella and her sister, Merry, go visit their estranged mother in Sanctuary Island after much begging in order to mend their mother-daughters relationship. Ella struggles with accepting her mom for who she is and for trying to overcome the thoughts of not wanting to have her mom in her life. In the meantime, she meets Grady - who happens to be a quiet soul. He is very reserved and a lover of his privacy. Their pull is undeniable and they both must compromise in ways in order to fully embrace their relationship. It felt as if I were with Ella through her journey of staying in Sanctuary Island. I couldn't help but hold my breath at times in fear of someone making a 'wrong' choice. I wanted everything to work out just so and by the end - well..you will just have to read it!Even though it's women's fiction it doesn't feel like it at times, which makes for a more unisex read. There are heavy romantic elements but nothing out of good taste. It's uncomplicated, yet sensitive. I feel sorry for those who've passed up this book just because of the subtle cover."}, {"userName": "Under the Covers Book Blog", "userReviewDate": "Dec 08, 2016", "userURL": "http://www.goodreads.com/user/show/35433419-under-the-covers-book-blog", "userReview": "I am really glad this series got a cover makeover this month because I had passed it several times without reading it. Also, this year I realized that Lily Everett is a pen name of Louisa Edwards (whom I've read and enjoyed in the past) so I was excited to see what her Sanctuary Island was all about.This was maybe a bit more subdued than I was expecting, but definitely a book that leaves you happy after reading it because of the human connections. Ella and her sister go visit their estranged mother in Sanctuary Island to try and mend their relationship (at her sister's insistence). The image of her mother Ella has carried for many years is not the reality of the person she has now become and Ella has to struggle with accepting the two very different realities and try to overcome her past reservations of not wanting their mother in her life.While dealing with this internal battle she meets Grady. He's very different than any man she's met before. The strong and silent type. Grady is very reserved and likes his privacy which is why the quiet of Sanctuary Island is the only place he feels comfortable at. But the spark between him and Ella can't be denied and puts them bot a bit out of their element to hopefully meet halfway.There are some elements in this story that read a bit like women's fiction, even though the romance elements stand out. I actually enjoyed this because it had a more laid back feel and really made for a great feeling of connection with the surroundings characters. The town has a nice vibe that I'm dying to explore more of, and we get just enough glimpses from the side characters that make me want to read on.Overall, SANCTUARY ISLAND is a feel good romance. Uncomplicated and tender. I am looking forward to reading more by this author now.Reviewed by Francesca❤ ♡ Don't want to miss any of our posts? Subscribe to our blog by email! ♡ ❤"}, {"userName": "Francesca the Fierce (Under the Covers Book Blog)", "userReviewDate": "Nov 21, 2016", "userURL": "http://www.goodreads.com/user/show/3108364-francesca-the-fierce-under-the-covers-book-blog", "userReview": "3.5 stars\nI am really glad this series got a cover makeover this month because I had passed it several times without reading it. Also, this year I realized that Lily Everett is a pen name of Louisa Edwards (whom I’ve read and enjoyed in the past) so I was excited to see what her Sanctuary Island was all about.This was maybe a bit more subdued than I was expecting, but definitely a book that leaves you happy after reading it because of the human connections. Ella and her sister go visit their estranged mother in Sanctuary Island to try and mend their relationship (at her sister’s insistence). The image of her mother Ella has carried for many years is not the reality of the person she has now become and Ella has to struggle with accepting the two very different realities and try to overcome her past reservations of not wanting their mother in her life.While dealing with this internal battle she meets Grady. He’s very different than any man she’s met before. The strong and silent type. Grady is very reserved and likes his privacy which is why the quiet of Sanctuary Island is the only place he feels comfortable at. But the spark between him and Ella can’t be denied and puts them bot a bit out of their element to hopefully meet halfway.There are some elements in this story that read a bit like women’s fiction, even though the romance elements stand out. I actually enjoyed this because it had a more laid back feel and really made for a great feeling of connection with the surroundings characters. The town has a nice vibe that I’m dying to explore more of, and we get just enough glimpses from the side characters that make me want to read on.Overall, SANCTUARY ISLAND is a feel good romance. Uncomplicated and tender. I am looking forward to reading more by this author now."}, {"userName": "Liza", "userReviewDate": "Jul 09, 2013", "userURL": "http://www.goodreads.com/user/show/2574139-liza", "userReview": "***4.5 out of 5 stars***I was approved for a review copy from NetGalley thanks to the publisher. I'd read the 3 novellas that introduced us to Sanctuary Island and was really excited to read the first full length book in the series.I really enjoyed this story a great deal. I could feel Ella's pain when it came to her mother, yet understood her coming to the island because she loves her younger sister Merry so very much. I love that Grady is the one to finally help Ella open her heart. While Ella's scars are all on the inside, Grady wears his scars on the outside of his body. It was wonderful to see them each heal thanks to the help of the other. I also loved the chemistry between Grady and Ella. These 2 lost souls really did find each other at the right time in their lives on Sanctuary Island.I did wish Ella had been more forgiving of her mother Jo Ellen sooner. Jo is a recovering alcoholic and she is willing to do anything to have her girls back in her life. However, I did love that once she started to forgive her mother, she wanted to do anything she could to help Jo out. I really loved Ella's sister Merry, who is pregnant when she arrives on the island. Merry has always relied on Ella, but this time she is the one who is willing to fight to get what she wants. Merry is much more open to reconciling with their mother, and I loved she had such great instincts. I loved Merry every bit as much as I loved Ella and can’t wait for Merry to get her happily ever after.Ms. Everett writes strong characters with depth. I think Sanctuary Island is a great start to this new series. I’m already counting down until we get Merry’s story in January 2014 with Shoreline Drive."}, {"userName": "The Window Seat", "userReviewDate": "Aug 14, 2013", "userURL": "http://www.goodreads.com/user/show/5880804-the-window-seat", "userReview": "To the right audience, Sanctuary Island will be a perfect blend of romance and woman’s fiction; a story that follows all the emotional highs and lows that can come from forgiveness, self-discovery and love. All of the main and secondary characters are searching for that \"something\" that will push them from the comfortable existence they live into one with more challenges but perhaps more rewards. For the right kind of reader, Sanctuary Island will probably be a keeper… Unfortunately I am too much of a cynic to readily accept many of the themes that author Lily Everett is trying to highlight in this story. The main conflict for character Ella Preston is trying to reconcile all the emotions that surround her relationship with her younger sister Merry and their estranged mother Jo Ellen. Ella has practically raised Merry since they were young children and Jo Ellen abandoned her family to succumb to her alcohol addiction. For too many years Ella has been the steady one while their father buried himself in work and Merry was allowed to live a fairly responsibility-free lifestyle. When Merry becomes pregnant she secretly opens a dialog with their mother and just before her due date asks Ella to accompany her to their mother’s home on Sanctuary Island, Virginia for a reunion. Even knowing how much anger Ella still carries for Jo Ellen, Merry seems to think the time is right for all the women to know one another again on the eve of a new member of the family being born.For the full review, please go to http://www.thewindowseat13.com/2013/0..."}, {"userName": "Mary Gramlich", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/4213407-mary-gramlich", "userReview": "Go ahead and jump in the water, dipping your toe in will never be enoughElla has spent so many years of her life trying to fill the hole her mother created by choosing her addiction over her children. The last place Ella wants to be is back in the home she and her sister left when their father took them to DC to wash the stench of that existence off them. However, her sister Molly insists on reconnecting with their mother and Ella has always been the best of older sisters and taking care of Molly is a duty she will always fulfill. Molly has a history of making poor choices, repeatedly and Ella believes this is one huge error in judgment. Yet on the tiny island of Sanctuary Ella discovers not only peace and quiet but the potential for love with another wounded soul, Grady. Grady has a story as does everyone and recovering in Sanctuary has taught Grady how to let go of the anger, demons from before, and hopes to teach Ella the same. There are so many wonderful discoveries to be made here; Ella does not know if she can absorb the meaning of them all. Who would have thought the intensity of seeing a pack of wild horses or the simplicity of a sunrise would be the balm on her overworked heart. While Ella stands up to the baggage she is carrying around, Molly visualizes a new life of independence in Sanctuary, Grady hopes that the future for him has Ella in it. What a warm and thoughtful story about rebuilding what is broken and finding the good in everyone"}, {"userName": "Julie Barrett", "userReviewDate": "Mar 03, 2014", "userURL": "http://www.goodreads.com/user/show/3023796-julie-barrett", "userReview": "Sanctuary Island by Lily EverettThe two sisters showed up on the island and they were initially made to feel foreign.As the days go by they become familiar with island life. Merry is there to child her unborn child with her birth mother. Ella Preston is there for support.She sells real estate in the DC area and can imagine a B&B where her mothers house is and along with that the stables would bring in a good profit.Grady Wilkes takes care of the wild horse preserve and just loves island life. He helps birth the wild foals and tends to their needs. Hates summer months when the island is overrun by tourists.Love the story of how the horses got to the island off the coast of VA- similar to a book written by Nicholas Sparks about the outer banks of NC. So many different emotions come forward as I was raised on the island and travel was via ferry. Trouble starts when Ella learns of her mother's problems and she's keeping them to herself til her daughters leave.Secrets and misunderstandings might just make Ella leave the island as things come to a head...Love the outcome, didn't see it coming, so worthwhile! Love the nature and close knit community.Can't wait to read the rest as it encompasses the others in this book. I received this book from Writerspace via the author contest."}, {"userName": "Meg - A Bookish Affair", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/1132408-meg---a-bookish-affair", "userReview": "I've been craving some lighter reads for these long, hot days of summer. This is the time of year that I look for comfort reads and I definitely found a good one in \"Sanctuary Island.\" The island in the book sounds like someplace that I would love to go for vacation and its denizens sound like people that I would love to get to know. The island just seems like a very peaceful place where you could cure all of your ills with ease.You all know by now that I love stories about families and I love stories about sisters. This book focuses on both kinds of relationships. I really felt for Ella for how she felt about her relationship with her mother. It has to be really difficult to grow up essentially without one of your parents because of something the parent is doing. So many times, those relationships are not able to be repaired. I liked the story between Ella and her sister as well. I really thought that Everett captured the very special relationship sisters have. You will do just about anything to take care or to help your sister. The relationship between them.I also really liked the love story between Ella and Grady. You're really pulling through them in the story. I liked that this book wasn't just a romance though!"}, {"userName": "Laurel", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/20892845-laurel", "userReview": "Good and sweet romance novel with an interesting cast of characters. Looking forward to the next book in the eries."}, {"userName": "Kris - My Novelesque Life", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/6275022-kris---my-novelesque-life", "userReview": "3 STARS (I received an ARC from NetGalley in exchange for an honest review). Ella Preston's sister, Merry is pregnant and wishes to reunite with their estranged mother. When Ella's boss forces her to take a vacation she agrees to go with her sister go to Sanctuary Island. She vows to not let her mother into her heart and is determined to not have any fun. That is until she meets handsome Grady Wilkes. Grady, however, is like family to her mother and tries to change Ella's mind about her. Will being with Grady include having to forgive her mother? Will she lose her sister and her own heart to Sanctuary Island?A cute novel about love, family and forgiveness. There is nothing outstanding in this novel that sets it apart from other contemporary romance series. The romance between Grady and Ella is awkward and forced at times which makes a reader feel uncomfortable. Since you do not really get to know any of the characters it is hard to root for a character. Yet, the heart in this novel is present and shows promise. I am in for the next book and will see if I continue the series."}, {"userName": "Douglas Meeks", "userReviewDate": "Jan 28, 2014", "userURL": "http://www.goodreads.com/user/show/5970245-douglas-meeks", "userReview": "Well this is my 7th book about Sanctuary Island so I knew a bit of what to expect in very general terms (I should mention this is the first full length novel), but this was a bit more detailed and heart warming than most of the novellas taken individually (the trilogies taken as a whole were equally exceptional) but this was a more in-depth look at the characters and the secondary characters were a bit more fleshed out.Ella and Grady were a perfect match in temperament and broken people. The dance to keep things \"businesslike\" was fun and short lived. Their story was a slow story that had to be built around a trust that neither would give up very easily. What made this really 5 Stars for me was that the other women in this story were presented to the reader with just enough information to make you want to read their stories (which I assume the next books will present)Face it, these are romantic drama, stories that touch your heart and leave you happy you read them. There is nothing wrong with \"feel good\" stories and this is one of the better ones you will read. Enjoy your trip to Sanctuary Island, I did and I will be back for the next installment."}, {"userName": "Allison L", "userReviewDate": "Feb 25, 2015", "userURL": "http://www.goodreads.com/user/show/1924441-allison-l", "userReview": "4.5 Stars At its core Sanctuary Island by Lily Everett is a story of love, redemption, and family. It’s a beautifully written story set in the seclusion of an isolated island. You can’t even access the island from mainland which means you have to take the ferry across a vast amount of water to get into the port. The description of the setting is so enchanting. I could imagine every vivid detail … especially the band of wild horses. They stole my heart. When I younger I was all about horses and I don’t think I ever really grew out of that phrase so it was nice to be able to revisit it again. I loved how the wild horses were such a poignant part of the story and how they related to the development of the relationships between all of these characters.Read Full Review Here"}, {"userName": "Sue ", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/1895704-sue", "userReview": "I had such a great visit back to Sanctuary Island with Lily Everett’s first full length novel in this series!Ella grew up fast. Her mother was an alcoholic and in her early years Ella spent a lot of time dealing with her mothers mood swings, the fear of people finding out, and taking care of her younger sister. When her father finally left Jo Ellen, taking Ella and Merry with him, Ella felt very responsible for Merry. Often her father was working 2 jobs to support them, leaving the girls alone often. Jo Ellen got treatment with the help of her Aunt from Sanctuary Island, but she has never seen her girls since they left with their father. Despite weekly letters and requests to see them, it has never happened.Read More"}, {"userName": "Sloane", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/21252007-sloane", "userReview": "After reading Lily Everett's three novellas leading up to Sanctuary Island, I knew when I finally got my hands on the book and read it, I wouldn't be able to put it down. I loved the hero, Grady, a wounded man who finally finds peace with the right woman. My emotions were all over the place with this book, as Ms. Everett is able produce emotion in me that I otherwise keep locked up! I especially appreciate the relationship between the two sisters, as no one understands what an older sister does for a younger one until you've lived it.I love the healing quality and the beautiful descriptions of Sanctuary Island. What an amazing place--if it actually existed--but I will be content with my first journey and look forward to the next book in the series.Thank you, Ms. Everett, for such a wonderful read!"}], "description": "SANCTUARY ISLANDLily Everett When Ella's sister decides to reunite with their estranged mother, Ella goes along for the ride—it's always been the two Preston girls against the world. But Sanctuary Island, a tiny refuge for wild horses tucked off the Atlantic coast, is more inviting than she ever imagined. And it holds more than one last opportunity to repair their broken family—if Ella can open her carefully guarded heart, there is also the chance for new beginnings.Grady Wilkes is a handyman who can fix anything…except the scars of his own past. When he accepts the task of showing Ella the simple beauties of the island that healed him, he discovers a deep sense of comfort he thought he'd lost. But now he must convince the woman who never intended to stay that on Sanctuary Island, anything is possible—forgiving past mistakes, rediscovering the simple joys of life, and maybe even falling in love.", "title": "Sanctuary Island\n      \n          (Sanctuary Island #1)", "url": "http://www.goodreads.com/book/show/16160774-sanctuary-island", "average": 3.87, "cover": "https://images.gr-assets.com/books/1362225860l/16160774.jpg", "reviews": 83, "authors": [{"url": "https://www.goodreads.com/author/show/4326460.Lily_Everett", "name": "Lily Everett"}], "type": ["Romance", "Romance", "Contemporary", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/16160774-sanctuary-island", "http://www.goodreads.com/book/show/17255775-sanctuary-island", "http://www.goodreads.com/book/show/26114485-sanctuary-island", "http://www.goodreads.com/book/show/18849489-sanctuary-island", "http://www.goodreads.com/book/show/17934434-shoreline-drive", "http://www.goodreads.com/book/show/17338721-the-firefly-cafe", "http://www.goodreads.com/book/show/23848424-home-for-christmas", "http://www.goodreads.com/book/show/18489604-the-fireside-inn", "http://www.goodreads.com/book/show/18404148-heartbreak-cove", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}