{"ratings": 2771, "userreviews": [{"userName": "Kemper", "userReviewDate": "Mar 10, 2011", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "There’s a popular website called Chuck Norris Facts that has funny sayings about how tough Chuck is like “When the Boogeyman goes to sleep every night, he checks his closet for Chuck Norris.” and “There is no chin behind Chuck Norris’ beard. There is only another fist.” Well, if Chuck Norris ever met Nicholai Hel, Chuck would beg for mercy after wetting his pants, and then the Chuck Norris Facts website would become Nicholai Hel Facts.Trevanian introduced Hel in Shibumi in 1979, and Don Winslow gives us a prequel that fills in a major gap of Trevanian’s original. In Shibumi half the book was spent on Hel’s growing up in Japan as a student of the game Go before and during World War II. Then Hel spends several years in prison after the war imprisoned by the American forces. Trevanian told how Hel was finally released after getting an offer to take on a suicide mission for the Americans in return for his freedom, but then we just got an overview of Hel’s career as an international hitman until the story picked up when he was in his 50s.Winslow takes on the task of telling about Hel’s first assignment, and it’s a doozy. While the Korean War is wrapping up, the Americans need someone to pose as a French gun dealer to murder a Soviet diplomat in Beijing so that they can sow discontent between China and Russia. With his mastery of multiple languages and ability to kill with his bare hands, Hel fits the bill nicely. In Shibumi Hel was built up into such a superior being that the original book would have been ridiculous if Trevanian hadn’t winked at the reader now and then to let them know that this shouldn’t be taken too seriously. Hel was one of the world’s foremost assassins, a martial arts expert, a former mystic, a master Go player, a world class cave explorer and the world’s greatest lover. (Seriously.) Plus, he also had a proximity sense that allows him to be aware of people and their moods before he can see them.Winslow tones this down a bit and plays it straighter than the original book. He was also smart enough not to try and match his style to Trevanian’s. Instead, he focuses on delivering the same essence of Hel in a fast paced action story set against political intrigue in Southeast Asia in the ‘50s. It works like gangbusters with a pace so furious that you don’t have time to think about how outlandish the plot is.And Winslow also dealt with my main complaint from Shibumi which was Hel’s smug and condescending attitude towards almost every country except Japan and his hypocritical stance about materialism. (Guys making fortunes for killing people shouldn’t climb on their moral high horse about how the world is full of ‘merchants’.) While Hel still has the aloof demeanor and attitude, Winslow toned it down so he’s not nearly as annoying. This was a fast paced and fun international thriller set against the Cold War with a stone cold bad ass main character, and I’d like to see Winslow revist Hel again to tell us more of his story."}, {"userName": "Manny", "userReviewDate": "May 21, 2011", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": "HOKIA Manny Rayner novel based on ShibumiThe bell rang three times, two short and one long. It was the signal they'd agreed on.\"Entrez!\" said Rayner. \"La porte est ouverte.\"The man entered hesitantly, looking around with evident curiosity at the apartment's simple but costly furnishings. An elderly Chinese servant glided up to him, discreetly took his heavy winter coat, and left again without uttering a word. The man cleared his throat. The rest of this review is in my book What Pooh Might Have Said to Dante and Other Futile Speculations"}, {"userName": "Jim", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "I read this with some trepidation since it is a sequel of Shibumi by Trevanian. It was quite good, a book I read back around 1980 once & still remembered fairly well 25+ years later. It's rare that an author does a satisfying job writing in another's place, but I think Winslow did fine in this case. More to the point, it answered a lot of questions about Hel, the man - how he became so cynical & willing to be an assassin, his connections, & feuds. There is plenty of room for more such novels, too. I wonder if Winslow will ever do another? I'll read it if he does.Winslow also carried over one of the more irritating aspects of Trevian's writing, the glossing over of details in order to make character intersections & action points stand out more. That made some of them too magical for my taste. Still, if you just go with it, the overall story is a good one, full of intrigue, subtle thinking, & clues. Character revelations toward the end weren't surprises, just inevitable & the more cynical, almost horrible for that. It's quite a web he weaved.There is quite a bit of history & politics surrounding Vietnam, too. I found that aspect interesting, especially from the point of view of the book."}, {"userName": "Darwin8u", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "This is pure candy. Not Winslow's best. Professional fanfiction and a bit cliched, but it is what it is. I'll review more tomorrow."}, {"userName": "Jonathan Peto", "userReviewDate": "Jul 25, 2012", "userURL": "http://www.goodreads.com/user/show/4107370-jonathan-peto", "userReview": "Um, I haven't read Shibumi, the book by another author (Trevanian) that this novel is based on. I just may. I'm curious about it, even though I have mixed feelings about Nicholai Hel, the character Don Winslow has revived here.Nicholai Hel makes me feel a little bad about myself. Not because he's a master of a martial art called 'naked kill' and can kill people with tea cups and newspapers and when outnumbered and I can't. He makes me feel bad about myself because I wonder why I can't just let myself enjoy the moment. Of course, readers aren't meant to take Nicholai Hel's extraordinary skills too seriously, I presume, especially the 'proximity sense' that prevents anyone from sneaking up on him. And for the most part I did just go with the flow. In the end, applying that kind of supernatural mumbo jumbo to Eastern philosophies and practices turns me off a little too much. At certain times Nicholai Hel came across as a little cartoonish and I could not relate. Same with some other characters. They had names, roles and motivations but did not fascinate or draw me in. That's how I felt about the setting too. It's the 1950s. The story takes place in Japan, China and Southeast Asia. The writing was vivid enough within a scene - I pictured the surroundings well, but the overall milieu did not come across strongly. I was reading this for plot and there are twists and turns but I feel bad. I like the characters and setting to also shine, at least more than occurred here.I bought Winslow's Savages and will give it a try. I'm sure it's not easy taking on another author's character. Winslow has bigger balls than Nicholai Hel."}, {"userName": "Leon Aldrich", "userReviewDate": "Mar 20, 2012", "userURL": "http://www.goodreads.com/user/show/2334899-leon-aldrich", "userReview": "As a long time fan of Shibumi, I hoped Don Winslow would do an adequate job on this prequel.He surpassed all my expectations; enough where I added all of his novels to my \"must read\" list!"}, {"userName": "Johnrh", "userReviewDate": "May 12, 2011", "userURL": "http://www.goodreads.com/user/show/5338940-johnrh", "userReview": "SATORI by Don Winslow \"A Novel Based on TREVANIAN'S SHIBUMI\" is the full title. This is my commentary on-the-fly, as I read, since I don't do in-depth, analytical, reviews per se.I received an email from my local library that this book, my hold request, was now available for pickup. In the several months since I had placed the request I'd forgotten about it or even where I'd heard about the book. I think I had been browsing lists for best fiction or best science fiction and stumbled across it.I haven't read the cover leafs as I don't like to be too well informed of a plot, but I did read, on the library website I believe, that this is a 'prequel' to the Shibumi series. I gather the original series is by someone named Trevanian, and his estate (I presume he is deceased) has authorized someone named Winslow to write Satori. I'll attempt to verify all this when I finish the book. On that note, it's difficult to discuss the book without revealing some of the plot. If you want to remain totally uninformed perhaps you shouldn't read commentaries and reviews. Stop now.The book starts in early 1950s (1951), post-WWII Japan and soon shifts to China. The story is of the spy/assassin genre. The CIA is involved and Langley is mentioned. (Did Langley exist then? This page at the CIA's own site indicates Langley wasn't considered as a site until 1953 and the HQ wasn't built until the late '50s. A lazy author's faux pas perhaps?)Main character back-stories are told, laying the foundation for who they are. There are numerous Japanese references to traditional gardens and tea services. There is a surprise attack by ninja types (Chinese as it turns out). They are quickly and effectively dispatched. The plot thickens. I'm less than 1/5th into this 500+ page novel. It's time to read more.By the way:\"Satori was the Zen Buddhist concept of a sudden awakening, a realization of life as it really is. It came not as a result of meditation or conscious thought, but could arrive in the wisp of a breeze, the crackle of a flame, the falling of a leaf.\" (From Page 7 of the novel.)(Brief intermission here. Reading... Reading...)(24 hours later, real time not reading time, I've finished the novel.)GOOD READ! Gripping. Action builds and builds to the very end. So much for on-the-fly analysis. I couldn't put it down. A veritable tapestry of woven intrigue, sort of like the board game Go. Hmmmm.I like it so much I'm picking up a copy of Trevanian's SHIBUMI today. It's supposed to be highly acclaimed. There are notes at the end of SATORI about Winslow getting permission to write this prequel to SHIBUMI, which was first published in 1979 under the pen name Trevanian by Rodney William Whitaker (1931-2005). Whitaker wrote The Eiger Sanction and other books. The plot gets even thicker. :)"}, {"userName": "Rick Riordan", "userReviewDate": "Nov 08, 2013", "userURL": "http://www.goodreads.com/user/show/25375513-rick-riordan", "userReview": "This is a prequel to one of the best-loved thrillers of all time, Shibumi by Trevanian. Stepping in so many years later to reincarnate the hero-assassin Nicholai Hel is a massive undertaking. I can only imagine how daunting this must have been to Don Winslow, but he does a fabulous job. The character of Nicholai is true-to-form, and the story is rich in authentic details of the 1950s Cold War. If you like thrillers and international intrigue, you can't go wrong with this one."}, {"userName": "Josh", "userReviewDate": "Dec 07, 2011", "userURL": "http://www.goodreads.com/user/show/1108056-josh", "userReview": "‘Satori was the Zen Buddhist concept of a sudden awakening, a realisation of life as it really is. It came not as a result of meditation or conscious thought, but could arrive in the wisp of a breeze, the crackle of a flame, the falling of a leaf.’‘Nicholai had never known Satori.’ – A captive of the United States, Nicholai is provided his freedom on the proviso he assassinates the Soviet commissioner to Red China, Yuri Voroshenin. The US, having identified Nicholai’s talents - notably the mastery of Naked/Kill techniques, puts in motion a chain of events which causes ripples cross continent. ‘Satori’ is oriental espionage involving arms dealing, assassination, political corruption, and gorilla militants delivered in cinematic beauty perfected for the big screen in vivid detail. Despite the nod towards violence and the shady characters of the underworld, at its heart lies a moving story of love and determination like no other. The claustrophobic conclusion will leave you gasping for breath as you come to terms with a twist I couldn't predict. Winslow pays homage to Trevanian’s ‘Shibumi’ in spectacular fashion in concoting an internal thriller with spy connotations executed by complex plotting, engaging characters lead by a protagonist yet to reach his vengeful potential. 4 stars."}, {"userName": "Rida", "userReviewDate": "Jan 30, 2011", "userURL": "http://www.goodreads.com/user/show/3197646-rida", "userReview": "Considering that Don Winslow wrote a prequel to another writer's book (Shibumi by Trevanian), I find this work to be exceptionally well done. He has not just written another story inspired by the characters from Shibumi, he has absorbed the spirit of Trevanian's work.The development of the young Nicolai Hel and his spiritual growth are well depicted and his persona in Shibumi is better understood and appreciated. In some ways Satori is easier to read as Don Winslow does not get involved in the rambling philosophical thoughts that characterise Trevanian's work. That is not to say that Satori is lacking in depth, but that Winslow's style is far more straight forward.I can well imagine that Trevanian would have been well pleased by this book and that his work inspired another good writer to extend the appeal of his work.Highly recommended."}, {"userName": "David", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/3335664-david", "userReview": "In the 1970s, an author named Rodney William Whitaker wrote best-selling airport paperbacks under the pen name \"Trevanian.\" His most famous novel was Shibumi, a thriller about a Japanese-raised son of Russian aristocrats named Nicholai Hel. The story was just a typical Men's Adventure tale about an over-the-top action hero who was more Japanese than the Japanese, more Basque than the Basque, and more badass than a barrelful of GI Joes. It was full of lurid sex and violence and enough racist, sexist cliches to give modern SJWs seizures.What made it a truly great novel, though, was the fact that \"Trevanian\" was taking the piss out of his audience, which was evident to anyone who could read the subtext of all the characters' speeches. Nicholai Hel was a ridiculous parody of every Mighty Whitey superhero from Tarzan to James Bond, and he said right on the page that Americans were tasteless, cultureless, soulless boors who assuaged their lack of intellect or character by reading crappy novels about Mighty Whitey superheroes. One got the impression that Trevanian was fairly seething with hatred for the very readers who made him a bestseller.Taken at face value, Shibumi was still a fun novel, and Trevanian was a much better writer than Ian Fleming. But I think it was much easier to appreciate as a work of meta-textual satire. Or to put it another way, Trevanian was a literary troll.So along comes a modern writer of violent thrillers, Don Winslow, whose agent got him a deal to write an authorized sequel to Shibumi. Winslow renders faithfully the character introduced to us in Trevanian's novel, and in Nicholai Hel's adventures in Paris, China, and Vietnam, gives us the same lethal, go-obsessed killer who was so entertaining in the previous novel. But Satori depicts a younger Hel, immediately after World War II, not quite as accomplished (no \"Level Five Lovemaking\") or deadly or imperturbable, not yet a master of espionage, and most importantly, not a scornful philosopher issuing pithy denunciations of modern society.Inasmuch as Winslow has tried to present a follow-up to the adventures of Nicholai Hel, he's written a novel that is compatible with Shibumi and fills us in on Hel's earlier life. He admits in his author's notes that he could not, and did not try, to emulate Trevanian's voice. But he's thereby abandoned much of what made Trevanian's novel great, rendering a fairly standard adventure novel that Trevanian and his character mouthpieces would denounce as hack fiction.In Satori, Nicholai Hel has been captured by Americans after the occupation of Japan. Originally hired as a translator, Hel killed his mentor, a Japanese general, to spare him the humiliation of a war crimes trial and execution. The Americans don't react well to this, and Hel gets some special treatment from a sadistic CIA officer. Then for contrived reasons, they decide they need Hel to do a job for him, and make a deal to offer him his freedom and a new life if he'll just go kill the Russian ambassador to Communist China in Peking for them.How this is set up - the whys and wherefores - make sense, more or less, in the novel, but it's all just background to send Hel on a trip to China, dodging Maoist secret police and trying to assassinate a Soviet bureaucrat who turns out to have some history with Hel's mother. So there's lots of espionage and torture and martial arts, and then Hel has to escape China, and winds up in Vietnam doing arms deals as a fake French arms merchant while the French, the Americans, and various factions of the Vietnamese are all out to get him. Along the way he also falls in love with a French prostitute, and while it may technically be a spoiler, I'm sure everyone else who reads this will have exactly the same reaction I did when she was introduced, which was the absolute certainty that she would not survive to the end of the book. I would highly recommend you read Shibumi first. Then, if you like that book, you will probably appreciate Satori, but just don't expect the same kind of book."}, {"userName": "Sam Quixote", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5759543-sam-quixote", "userReview": "1952. Nicholas Hel has been imprisoned for 3 years for murdering his step father but is suddenly released to work for the American government in assassinating a dangerous Soviet agent in Mao's China. But with the French fighting Ho Chi Minh in Vietnam, and both Russia and the US supplying arms to the sides, it seems the US will fall deeper into the Cold War with the possibility of themselves fighting in Vietnam. There's also an assassin called Cobra on the loose and talk of Operation X. Only Nicholas Hel can save the day! I think that about covers the \"plot\". This is a prequel to a popular novel from the 1970s called \"Shibumi\" by the French author Trevanian. With his death in 2005 and sales of \"Shibumi\" topping 2 million worldwide, the publishers were anxious to put out another book in the series like the Fleming estate has been doing for James bond. But Nicholas Hel isn't James Bond. He is, sort of, in that he's a fighting machine, lover of women, fine drinks, and is courted by secret government agencies, but he doesn't have the charm or wit of Bond. He's basically a stoic, humourless shell. The archetypal \"hero\", heroically bland. That said, none of the characters were at all memorable or interesting. The love interest is of course a perfect woman in every way. Minus a personality but then Hel doesn't have one either so they're a perfect fit. The baddies are bad, blah blah snooze. Then there's the \"thriller\" label this book is given. The first thing we see in the book is a lengthy description of a Japanese tea ceremony. Then 40 pages later this scene is rehashed again! In the first 100 pages the only scene that could be called \"thrilling\" was a less than 1 page scene where Hel takes out two would-be assassins. Less than a page! And then back to the dreary story. You see, Hel is being prepared for his assignment so there is a lot of studying of dossiers, exercising, eating, and resting before he goes out to Beijing and all of it is detailed here. And it's not thrilling or interesting just plain boring. Then we get onto the mission and Winslow wants to prove that he's done research on this era. There are pages and pages on Mao's China and the Chinese Revolution, almost like Winslow wanted to say \"Hey, look! I read Jung Chang's \"Mao\"!\". Well so did I buddy and I don't need to get through an information dump in the way of the \"thriller\". I gave up on page 167 and closed the book for good. I normally give a book 50 pages and then decide if I want to go on with it but I thought I'd give this a chance. However, flicking to the back of the book and seeing there was a total of 500 pages, there was no way I was going to read another 333 pages of this drivel. The only character I was interested in was Cobra but he was in the book for less than a page. For 167 pages, almost nothing at all happened. Nothing to make me want to keep going, nothing to keep reading, nothing of interest. I've no idea whether the original \"Shibumi\" was like \"Satori\" and don't care to find out. Whether Trevanian is a great writer or not is uncertain but as this is the first time I've heard of him I'm guessing no. But Don Winslow is a brilliant writer, or can be. Just read his latest book \"Savages\", a 300 real thriller through the drug wars of the Calexico border. Kidnappings, bribes, shootouts, double-crossing, drug deals, murder - compare \"Savages\" to \"Satori\" and you'll notice a vast gap in the quality. \"Savages\" made me want to read more when I finished, \"Satori\" made me want to never read another \"thriller\" again. I guess this is aimed at the Trevanian fanbase because based on what I read here, nobody is going to be won over by this weak effort."}, {"userName": "Barry", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/22664741-barry", "userReview": "Satori is quite a unique book in that Don Winslow took on the tricky task of writing a sequel to Shubumi, a brilliant book written in 1979 by the legendary author known as Trevanian (Dr. Rodney Whitaker) who also wrote The Eiger Sanction, The Loo Sanction, and others. Satori, like Shibumi, focused (why doesn't focused have a double \"s\"? it really should) on Nicholai Hel, who has incredible martial arts skills, speaks seven languages and has developed a rather remarkable sixth sense that alerts him to potential threats of others within proximity - called, appropriately, his proximity sense. As a result of activities undertaken in Shibumi, Hel has been in solitary confinement for the last three years. His incarcerators approach him with a proposition, \"win your freedom by working for us.\" He takes on this mission, which will, as you would expect, almost certainly end his life. During his execution of this seemingly, impossible to survive mission, the usual and some unusual pitfalls and surprises pop up, as does a beautiful French woman who helps to prepare him for his task. All in all, Winslow has done a quite credible job in writing a sequel to Shibumi in a style very much like Trevanian's. He is not the equal of Trevanian, of course, but, nonetheless, Satori is quite a worthwhile read. It is not necessary to have read Shibumi but, quite frankly, if you are interested enough to read Satori and have not read Shibumi, you be foolish not to. If you are not, by now, completely confused about the identities of Trevanian, Whitaker and Winslow and the books, Satori and Shibumi, then I have failed, miserably. On my 1 to 10 scale of pure enjoyment (1 = didn't enjoy it at all and quit reading rather than periodically stopping to vomit; 10 = I enjoyed it so much that I started going to bed early so I could get back to it each evening), I would give Satori an 8."}, {"userName": "Oscar", "userReviewDate": "Feb 08, 2012", "userURL": "http://www.goodreads.com/user/show/1754850-oscar", "userReview": "’Satori’ es una novela de encargo y Don Winslow el elegido para llevarla a cabo. Se trata de una precuela de ‘Shibumi’, que aprovecha un hueco de tres años que Trevanian dejó al escribir esta obra. Estamos en 1951, y tenemos a Nicholai Hel, el protagonista, al que tras tres años de encarcelamiento se le pone en libertad a cambio de realizar una misión para el gobierno americano: eliminar a Yuri Voroshenin, un delegado de la Unión Soviética que se encuentra en Pekín, y con el que curiosamente Hel tiene cuentas pendientes también. Este es el punto de partida de esta novela de espías, en la que entrará en juego más de un bando con sus propios intereses, y donde las traiciones no se harán esperar.Don Winslow se aleja de la manera de narrar de Trevanian y opta por un estilo más acorde con los tiempos actuales. No he leído nada de Winslow, pero según tengo entendido tiene un estilo muy crudo, donde la violencia y el sexo se exponen sin tapujos. Este no es el caso de ’Satori’, si bien es verdad que estas no faltan. Supongo que Winslow ha optado por un punto intermedio. La narración es muy visual, trascurre como si de un guión cinematográfico se tratase (parece ser que habrá adaptación, con Leonardo di Caprio como protagonista). ‘Shibumi’ fue una novela que me gustó mucho en su momento, y de la que guardo un grato recuerdo. Sin embargo, ’Satori’ no me ha dejado ninguna huella. Es una novela que entretiene sin más, que supongo es lo que pretendía."}, {"userName": "David", "userReviewDate": "Mar 16, 2015", "userURL": "http://www.goodreads.com/user/show/4862540-david", "userReview": "Very good and gave me even more appreciation for Trevanian's far from flawless work."}, {"userName": "Paul", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/24437998-paul", "userReview": "Satori by Don Winslow is a prequel to Trevanian's 'Shibumi'. I read Trevanian's original Nicholai Hel adventure before this prequel by Winslow, and taking nothing away from the original, i think i prefer Winslow's effort. It fills in all of the 'gaps' left in Shibumi and indeed there is space for Winslow to write another prequel, of which i would be an avid reader. Winslow's Satori takes the reader seamlessly into the world of Nicholai Hel.  For fans of the original by Trevanian, Graham Greene and to a lesser extent John le Carre and naturally, fans of Don Winslow.Highly recommended by this reader. Unput-down-able! A rare 5 stars from this reader."}, {"userName": "Tom Walsh", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/75825543-tom-walsh", "userReview": "Taut thriller filled with enough twists and turns to keep your interest against the backdrop of a Go Board and Eastern Philosophy. Fun light reading good for distraction in Interesting Times."}, {"userName": "Augusto Bernardi", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/25594766-augusto-bernardi", "userReview": "Overall the book was good because as I've mentioned throughout my review, Winslow has a great appreciation for history and culture. The storyline was not amazing or mind-blowing but nonetheless fun. No shortage of action but I thought that the romantic storyline of the book was sloppy and not developed properly. My main criticism of the book though is that most of the characters are either completely 2 dimensions, cliche or not developed again. This is something very unlike Winslow. Synopsis: The book starts with Nikolai Hel leaving prison after having killed his samurai father with some crazy subtle martial art move instead of facing the hangman. A calm but arrogant young blond man, half Russian and half Japanese is given a authentic ceremonial tea serving by the American Ellis (something)offering him a job in exchange for his freedom. This scene of The tea and ceremony and the whole ritual practice of it was very intricately described and brings out windows best qualities, his understanding of different cultures and THEIR values. Hel accepts the job (assassination) but has to undergo facial reconstruction surgery because of the beating he received when captured. The surgery goes fine and he endured the pain. The American, Ellis meets with the intelligence officer, Diamond (some classic ignorant brutal American army general type guy) and the head of the CIA. This guy, is apparently the coldest mother fucker of all times next to Satan. White hair and blue eyes and also a Go player ( a Japanese game sort of similar to chess but million times more complicated which is where the book gets its title from). After window describes the hatred each other have for one another and their backgrounds, Ellis informs Diamond and Satan guy that Nikolai will be right for the assassination despite his past and will go under the cover as a French arms dealer for the Chinese. Meanwhile Nikolai is in some secluded house with this blond French smokeshow of a woman kind of acting as his carer and to help him really become the specific type of French that is characteristic to his cover. The woman, Solange gets along well with Nikolai and the reader gets a much softer and maybe younger view of the apparent hard killer as he seems to like her and her eye for detail (and stunning looks). They eventually even start having passionate sex which is meet with mixed feelings as Nikolai genuinely feels for her but she is being posted by the Americans so he can act like a French man, even in bed. This aspect of the story is truly fascinating to me as Winslow shows the intense detail for both culture in the same book, same scene, contrasting with each other beautifully. Solange one night explains to him that she is from a rough in France with her mother being a prostitute, trying to keep her from following in her steps but as the Nazis invaded France and hanged one of her best friends, she became a lady of the night in order to exact revenge on the officer, help the resistance and eventually worked for the Americans. Suddenly one night as Nikolai is doing his Karate Kata outside in his gi, Jr is ambushed by 2 ducking ninjas which he violently kills while being unarmed. By the choice of weapons used, Nikolai was able to distinguish that the attackers were Chinese. Somebody wants him dead and knows where he is but how. Ellis then finally shares with him who the target is. Yuri something, a former KGB member working for the Chinese as a Soviet commissioner. Killing him will cause a rift between China and Russia which is needed for the 2 communist nations not to team up against the US. The target is a notorious Soviet scumbag, rat and torturer that Stalin choose to be in that high ranking position. He is apparently located in Beijing. The mission is very dangerous with a low chance of success or escape because the assassin must be unarmed. Yuri has some unknown connection not revealed with Nikolai that happened in the past but he is unsure if anybody else knows about this. Solange is also falling in love with Nikolai and even goes as far as to ask him to have a baby with her when it of he comes back. Since he had recovered from the facial surgery and also learnt the ways week of his cover, he leaves in the morning for Beijing. Winslow leaves the chapter with the image of a red maple leaf blowing alone in the wind. This is another one of Winslow's qualities that I particularly love. Winslow has a great sense of visual/artistic beauty that he adds in his books to keep the readers imagination vibrant and also to the according mod or atmosphere the scene was intended to have.In the freezing communist Beijing, Nikolai meets with some guide/watcher that believes him to be the arms dealer and establishes a dinner for then with officials to sell funds to Vietnam which were Chinese allies. Winslow gets que into detail not just about the history about Beijing at the time in 1952. The oppression of the communist government getting rid of the traditional housing to substitute with these concrete buildings, the importance and power of Beijing around the world at the time especially compared to Europe. How this busy and bidding City was becoming more quiet due to Mao's harsh punishments and bizarre laws. And not to mention the hypocrisy and corruption of the great leader locked up in the forbidden City himself. A chapter with Yuri explains this in a different perspective as he hated his miserable life the and also hates Mao and has plans with the Soviets to replace him already. After hearing about the dinner, he decides to join in but before meeting with the head of the secret police in China, Kong. This guy is a even more \"cartoonish\" in the sense that he's just the classic old creepy sadistic Chinese fellow, all in black that listens to Opera while beating the shit out of some poor woman. Not the most unique character but still cool. At the dinner Nikolai gets a good grasp of Yuri and in this chapter in specific, Winslow highlights the parallels between the complex small victories of political conversation and the intricate tactical game of Go. Yuri does not recognise him but gets suspicious of his green eyes and reminds him of a Russian woman from The (Nikolais mother). Another \"date\" or meeting is planned for the Opera. Next chapter focuses on the Chinese perspective of the conflict with the general Wei? yuei? Something along the lines of that. He is also a major player in this game as he wishes not that Russia gains to much power and eventually surrounds China and is not just also against Mao but is distrustful of Nikolai. During all this, Nikolai has been trying to send back cripted messages to Ellis Haveford who is trying to update him in order to know what the escape plan is. Next chapter introduces a new character. A monk named schwai shin (not sure about spelling) who from what I understand is also a spy for the Americans. He also has a dark past and cheated death before during these mass executions. A broken man ready for death at any time. Another brief chapter with another mysterious character is this Cobra. A knife wielding assassin. Nikolai witnesses a public execution by firing squad while in Beijing and also makes his fake arms sale to the general. In this chapter, winslow outlines the current weapons at the time like the simple rocket launcher and the ruthless napalm. A new character Wu, the Chinese Muslim assassin working for the Americans is introduced.Nikolai remembers his mother's story with Yuri and being his whore and getting robbed by him when she fled Russia. Yuri also got word from his Intel of the death of the general Nikolai killed and the name of his assassin. For he is incredibly Hot on Nikolais trail. Although he had no conclusive proof, Yuri manages to connect the dots that Nikolai is who he thinks he is and is working for the Americans in order to help the general. He shares this with the torturer Kong who plans to help unravel Nikolai in order to get to the general. Nikolai planned to kill him during the Opera in this specific moment but when monk warns him and he questions himself and in his mental go board, he sees that he is walking into a trap. He sees Satori, the revelation. As he gets into the car on the way to the Opera, Chen, his guardian arrests him and takes him to Kong's torture cave.But Kong's guards take Chen also under arrest and strap them down. Kong as expected tortures Chen in order for him to confess with a wire through the testicles. Nikolai spares himself the pain and confesses to everything in order to gain himself time, breath in deeply and gather his energy or chi or some shit. When the time was right and he could no longer stop Kong, he unleashed his power, broke free and managed to pin king against the wall as he pierced Kong with the wire through the eye to his brain. . He escapes and gets to the Opera just in time for the ending where he surprises Yuri and kills him at the right moment with the tiger paw technique to the chest. But during this exchange he gets shot in the leg but manage to escape the proper way but is getting weak. He then meets with Wu who says \"Haveford send his apologies\" and attacks Nikolai with violent blows which Nikolai has a hard time fighting of in a very intense scene. Broken and beaten down, he is at the last moment saved by the general with the monk by his side who says :\"Satori\".Nikolai wakes up after weeks of fever in the mountains of China far away from Beijing. The plan had worked and the Chinese and Russians were blaming each other and the general took command as planned and also as the Americans wanted. Diamond, Singleton and Haveford were all oblivious to where Hel had gone out of he was alive so Diamond took initiative to try to assassinate and take credit since Wu had also died. Nikolai decides not to become an informant to the Chinese but to follow through with his cover, with help from the Chinese and go to Vietnam and make the arms sale. While he was recovering, the monk Shin that has healed him back to normal had also has long philosophical talks with Nikolai as they would we the gardens and prepare for his departure. Nikolai is sad to have left his new found friend. Winslow describes the current political scene and landscape of the Chinese boarder with Laos and Vietnam and how there is a lingering problem of pirates in the area. One night an ambush even breaks out and he is almost killed and has a vision of his father figure in the Japanese Blossom trees. But thankfully he is saved by the Taoist monks. Meanwhile, Diamond contacts Solange again and hires her again to go to Vietnam (to actually get Nikolai to come out) she accepts the mission but rejects his creepy offers to her. At this point in the book, the while Solange romance has been almost forgotten. I think Winslow dropped the ball on this a little. I got the impression that this was going to be a romance within an action novel but the romantic element was almost friend or by the whole Beijing post of the book. We barely even heard of her again. They go down the river, past some rough waterfalls and eventually reach Luang Prabang. Winslow describes the French colonial Laos with its mixture of European style housing and also the Buddhist temples. I do a poor job recollecting but you really got a good feel for the vibe and scene. While in the hotel, Nikolai finds out I think in a newspaper that Solange was present in Saigon and he suspects Haveford's trap. In Luang Prabang though, his contact is killed and he encounters the regional pirates and their small leader. He manages to make a deal with them rather than her murdered and continues the journey with them. In the way he saved the leader from an assassin so gets in his favour. When he arrives in Saigon, he is also interrogated by the Corsican mafia. During all this, all these characters are introduced that have so much potential of being developed but are somehow forgotten in the novel. This feature is slightly disputing and unlike Winslow's other work. For example, Singleton and Kong were 2 fantastic characters that have been partially only mentioned 2 time in the novel. Haveford is also in Saigon tracking down Nikolai and follows him but Nikolai is to smart for that and sees him coming and manages to turn the tide in him and plan a meeting later. The water doesn't seem to be that dirty between the two of them as Haveford send to be innocent of the murder attempt. Nikolai completed the arms deal with the Mafia and the pirates while he was at a old shabby casino and gets paid while in a rigged table. After earning a major amount of money he sees the Playboy Emperor walk in with his new mistress, Solange. He interrupts them to get her attention, subtly insults the Emperor and gets challenges to high stakes Poker where he again, with no surprise is incredibly gifted and lucky and smart and wind again an unimaginable amount of money. I never really like this type of character in books because they are cliche and completely unrealistic. He's young, good looking, assassin and great fighter, polite, smart, great at everything he does... Not in an entire lifetime would somebody be able to do all those things. Just ridiculous. The Emperor send men to kill him but fails. Nikolai meets with Solange again and they have the steamy anticipated reunion. While we're being productive, he gets money from Yuri in his safe and then wants to buy the arms shipment back from pirates, give them a profit back so they are satisfied and seek to the original client, the Vietmin (their supposed enemies) and keep his promise to all sides.Diamond also has a assassination attempt on Haveford and Nikolai senses the presence of the cobra before she strikes. He then connects the dots and realises Solange is the cobra. A Corsican assassin but she decides not to kill him for she still loves him and they try to escape together James Bond style with gunfire and exploding jet boats. As they are escaping through the jungle they meet schwai Shin again but in the Vietmin uniform as he was all along the Vietmin leader under cover. They are ambushed by the American plans and so escape to the underground bunkers where they are bombarded into darkness. Diamond follows then down and ends up mortally shooting Solange (as expected) he escaped and so does Nikolai and he wakes up magically in the hospital (not a big fan of these easy way out storytelling technique). The book ends for of with Nikolai planning his revenge."}, {"userName": "Jeffrey West", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/53512926-jeffrey-west", "userReview": "Amazing book! One of Winslows best for sure!!!"}, {"userName": "Bonnie Brody", "userReviewDate": "Feb 28, 2012", "userURL": "http://www.goodreads.com/user/show/7630898-bonnie-brody", "userReview": "Satori, by Don Winslow, is a prequel to the best-selling thriller, Shibumi, by Trevanian. Trevanian introduced the world to Nicholai Hel, master of `the naked kill' or hoda korusu. Hel speaks six languages, is a master of the game `Go', and has a special proximity sense - the ability to detect when any person or thing is nearby. As Satori opens in 1951, the Korean war is in full swing and the Americans have had Nicholai in solitary confinement for three years for the honor killing of his beloved stepfather, General Kishikawa. General Kishikawa, sentenced to a public execution, loved and raised Nicholai, teaching him `Go'. Rather than let him die that way, Nicholai killed him himself.While in jail, Nicholai was brutally tortured, physically and pharmaceutically by a CIA agent named Diamond. Out of the blue, a CIA agent who is a colleague of Diamond's approaches Nicholai with an offer. The United States will give him $100,000 and a passport if he will kill Yuri Veroshenin, the Soviet Commissioner to Red China. The CIA's reason for wanting Veroshenin killed is to put a wedge between Beijing and China. Nicholai takes the offer but he has other agendas - he wants to get even with Diamond and he hates Veroshenin who once forced his mother into a lurid affair so that she could survive.A plan is put in place for Nicholai to kill Veroshenin with the CIA's assistance. It is more like a suicide mission for Nicholai than anything else. His odds of surviving are about 1%. Before the mission begins, however, Nicholai must get a new face. He has been so savagely beaten while in jail that his face is a mess. He is sent to a plastic surgeon and then to France where he is to learn the language nuances and mannerisms of the identity he is to take, that of Michel Guibert, an arms dealer. In France, he is taught appropriate southern French by a beautiful woman named Solange, an ex-prostitute, who also teaches him about his adopted background and life in Montpellier where he is supposedly from. They fall in love but Nicholai must leave to begin his mission. He promises to return to her.Before the mission begins there is an attempt on Nicholai's life in France by two men from China but Nicholai manages to kill both of them. Nicholai heads off to China and the action revs up. There are arms deals, crosses, double crosses, and no one knows who to believe about what. Nicholai does manage to kill Veroshenin but he is shot in the leg and the CIA's extraction team fails to show up. Instead, Nicholai's life is saved at the very last minute by a mysterious group of monks who take him somewhere secret to heal and where he searches for satori, \"true understanding and harmony with the world\".Nicholai is trying to figure out who is after him and why. It seems like everyone has a reason. The cold war is blasting, Vietnam is a hotbed of strife and the different communist nations are not at peace with one another. Nicholai heads to Hanoi where he sets up his own arms deal and is followed by the CIA.There is a wonderful cast of characters in this book, many kinky, quirky and mean. Winslow knows his geography and history and it comes through clearly, though at times a little too detailed for my preference. Readers know that Nicholai can survive all that this book throws at him because he is alive and well when Shibumi starts.This is a thriller to end thrillers. At times I got lost trying to figure out who was after who and why, but mostly it was fascinating and fun. Nicholai relies on his skill with Go to navigate the subtle feints and misdirections he is faced with and figure out each of his moves. Go is a game said to be much more complicated than chess. Nicholai must be very good at it. Winslow's writing kept me turning pages through the night and he is at the top of his game with this novel."}, {"userName": "Erwin", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/4361083-erwin", "userReview": "Overall, it was a very fun read. Not as good as Trevanian's Shibumi but I enjoyed it. I hope that if Winslow decides to write more Hel books he'll also get Asia in 1952 figured out, and Asia itself also better understood.For anyone who enjoyed the character of Nicholaï Hel himself, you'll be delighted to have Hel back, as you follow him through Japan, China, Laos, Cambodia and Vietnam.Since Shibumi actually begins at the end of Hel's career, in his mid 50's, I could see a series of Hel books that cover his life from 26-50 in more detail.In Shibumi, Hel had some minor romances along the road, but Hel himself wasn't a romantic who would sacrifice himself for a girl. Winslow's Hel becomes more of an average guy/average hero. Trevanian's Shibumi was an inside joke. It was a parody. Trevanian's Hel was \"in pursuit of shibumi he could excel invisibly, without attracting the attention and vengeance of the tyrannical masses\". Winslow's Hel goes the opposite direction.Satori is the sort of story that Shibumi parodied.Every character in this novel has a story and every story is a cliché.The discussion of Zen philosophy is cheesy.The fight scenes are too similar to each other and there must be a half dozen occasions on which Hel is saved from harm by his \"proximity sense\"Winslow's descriptions of \"Asia in 1952\" felt like the western prospective of what 1952 Asian politics combined with what a western traveler would see in Asia in 2012. Winslow's 1952 Asia felt too advanced, too cosmopolitan and too wealthy. Trevenian wrote Shibumi with a dry humor that sometimes was making fun of itself, sometimes was making fun of the masses. This voice over gave Shibumi it's unique feeling, and this was completely missing from Shibumi. As Don Wilson states in the author's note at the end of the book he found the task of writing Satori especially daunting because he had to re-create the historical Asia of that very time. Personally, I think this recreation could have been better done if he were better versed on the subject.Also, as Hel is traveling around in Japan, China and Vietnam, we continually get an odd mix of Asian English that doesn't fit anywhere. Satori itself is a Japanese word for enlightenment or understanding, in the Zen sense. Even though written the same in Chinese and Japanese, it's romanized differently in each language.In spite of the Japanese theme, some Chinese words like the Cantonese \"Gwai Lo\" (Gweilo) are thrown in --- oddly enough, these are used even when Hel is running around in Vietnam.The linguistic slipups. The technological slipups. Winslow doesn't know his DATES and LOCATIONS well enough, and that kept on ruining the effect that a story should cause us to suspend disbelief, so that we can engage fully in the story."}, {"userName": "Mina Soare", "userReviewDate": "Jul 05, 2014", "userURL": "http://www.goodreads.com/user/show/1843780-mina-soare", "userReview": "I came upon this book after reading \nShibumi\n due to IMDb. I like the book as one likes fanfiction; it fills in some gaps. Fanfiction is all it is.Compared to Trevanian's, this book was written with all the literary prowess of the average female YA author. Don Winslow makes a dubious virtue of telling rather than showing, which, together with his slightly obnoxious preference for simplistic superlative expression, yields passages such as:\"...Haverford thought. Compared to Singleton, Machiavelli was a naïve choirboy and the Borgias subjects of a Rockwell painting. Standing beside Singleton, the devil himself would appear as the angel Lucifer before the fall.\"What he is showing is a condescending, short-sighted Nicholai Hel-shaped mannequin, that all characters point out as Nicholai Hel whenever one's desire for self-delusion weakens. Its only saving grace is the final showdown."}, {"userName": "Aaron", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/3113943-aaron", "userReview": "If this was an original tale I would have given it five stars however it is inconceivable to me that an author with Winslow's street cred would have to stoop to this four star recreation. I thought it was not only hilarious but callous and savage to boot. It was like Quentin Tarantino meets Will Ferrell. While it was spectacular to have so many Frenchmen killed by this assassin there was one French character who could not stop making outrageous exclamations like, \"By the Pope's wrinkled scrotum or by the pubic hairs of the Mona Lisa or by the blue veins in the sainted Jane Russell's breasts!\" It was a period piece after all. He was by far my favorite character in this novel. Satori translates as seeing life as it really is and not with the blinders of western wishful thinking or the illusions of this world or in simpler terms it means sudden enlightenment. I doubt to ever come close to satori in this lifetime but I think I may come close tonight as I head out to the K for game two of the World Series with my world champion Kansas City Royals! Vamanos los Royales!"}, {"userName": "Tom Tischler", "userReviewDate": "Nov 11, 2015", "userURL": "http://www.goodreads.com/user/show/5357814-tom-tischler", "userReview": "It's the fall of 1951 and the Korean War is raging on. 26 year old Nicholai Hel has spent the last 3 years in solitary confinement compliments of the Americans. Hel is a master of hoda korosu or naked kill which means that he can kill you with any handy weapon,like a pencil. He also speaks 7 languages. Likewise he has a keen awareness skill. He can sense the presence of danger. This certainlymakes him a formidable assassin. The Americans need him and offer himfreedom if he will go to Beijing and kill the Soviet Union's Comm-isioner to China. This is almost certainly a suicide mission but heaccepts and now he must survive violence, suspicion and betrayal. Thisbook is from 2011 and it's a definite winner. I gave it a 5."}, {"userName": "Dmitri Ragano", "userReviewDate": "Aug 16, 2012", "userURL": "http://www.goodreads.com/user/show/7154605-dmitri-ragano", "userReview": "Don Winslow doesn't exactly nail Trevanian (or Nicolai Hel). This feels like a slick, polished extension of someone else's legendary franchise... like when John Gardner tried to write follow-on novels for James Bond. Still, Winslow is an expert at crafting scenes of exotic tension and the parts of this book that work -- such as the sanction in Mao's China circa 1951 -- work very wonderfully. Unfortunately, the book fails to sustain the rate of innovation and energy throughout the plot line in the way that made it's inspiration Shibumi so memorable."}, {"userName": "Fejas", "userReviewDate": "Mar 02, 2011", "userURL": "http://www.goodreads.com/user/show/2133743-fejas", "userReview": "I won this book as a first-read in Goodreads (thanks!). I was very entertained by the parts where we learn more about the main character, Nicholai Hel, and what has made him the way he is. The intrigue and general plot is also great, in a generally very pleasing read. Some parts of the book seemed too much of a coincidence, and other parts seemed to be resolved too quickly and/or easily in direct contrast with the buildup to it. Despite these little things, this was a pretty enjoyable book and I'm glad I spent some time reading it."}, {"userName": "Intortetor", "userReviewDate": "Jan 26, 2014", "userURL": "http://www.goodreads.com/user/show/28077976-intortetor", "userReview": "ok, c'è qualche \"jamesbondismo\" di troppo, ma non è affatto male: un winslow diverso dal solito, come sempre capace di raccontare storie ad ampio respiro ma stavolta molto lontano dai suoi luoghi classici. si lascia divorare in pochissimo tempo, sarebbe stato perfetto st'estate sotto l'ombrellone...."}, {"userName": "Heather", "userReviewDate": "May 29, 2015", "userURL": "http://www.goodreads.com/user/show/29951363-heather", "userReview": "Only made it through 100 pages because i forced myself to give it a shot. I feel like this is a book you will either love or hate, no in between."}, {"userName": "Marco", "userReviewDate": "Aug 25, 2012", "userURL": "http://www.goodreads.com/user/show/11330201-marco", "userReview": "it is not by Trevanian but by Winslow..."}, {"userName": "Jenne", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/26259-jenne", "userReview": "Kind of silly, but fun. I still can't figure out why he wanted to write this, though. Was he just a huge fan of the original?"}], "description": "Trevanian's Shibumi was a landmark bestseller, one of the classic international bestselling thrillers of the twentieth century. Now, chosen by Trevanian's heirs, the hugely admired writer Don Winslow returns with an irresistible \"prequel\": Satori.It is the fall of 1951 and the Korean War is raging. Twenty-six-year-old Nicholai Hel has spent the last three years in solitary confinement at the hands of the Americans. Hel is a master of hodo korosu or \"naked kill,\" and fluent in over six languages. Genius and mystic, he has honed extraordinary \"proximity sense\" — an extra-awareness of the presence of danger — and has the skills to be the world's most formidable assassin. The Americans need him. They offer Hel freedom in exchange for one small service: go to Beijing and kill the Soviet Union's Commissioner to China. It's almost certainly a suicide mission, but Hel accepts. Now he must survive violence, suspicion and betrayal while trying to achieve the ultimate goal of satori — the possibility of true understanding and harmony with the world.From the Hardcover edition.", "title": "Satori\n      \n          (Nicholai Hel)", "url": "http://www.goodreads.com/book/show/12365280-satori", "average": 3.81, "cover": "https://images.gr-assets.com/books/1333576522l/12365280.jpg", "reviews": 260, "authors": [{"url": "https://www.goodreads.com/author/show/37795.Don_Winslow", "name": "Don Winslow"}], "type": ["Thriller", "Fiction", "Mystery", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/12365280-satori", "http://www.goodreads.com/book/show/8174434-satori", "http://www.goodreads.com/book/show/10178415-satori", "http://www.goodreads.com/book/show/26171987-satori", "http://www.goodreads.com/book/show/14699849-satori", "http://www.goodreads.com/book/show/13528484-satori", "http://www.goodreads.com/book/show/10451213-satori", "http://www.goodreads.com/book/show/13765781-satori", "http://www.goodreads.com/book/show/206236.The_Power_of_the_Dog", "http://www.goodreads.com/book/show/23602561-the-cartel", "http://www.goodreads.com/book/show/8008928-savages", "http://www.goodreads.com/book/show/32075859-the-force", "http://www.goodreads.com/book/show/164760.The_Winter_of_Frankie_Machine"]}