{"ratings": 1559, "userreviews": [{"userName": "Kathleen", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/39134508-kathleen", "userReview": "SATURDAYS AT SWEENEY'S, the fifth and final instalment in the Sweeney Sisters Series by Ashley Farley is a well written story about family and love and how a crisis can pull together or tear apart relationships and families. Ms. Farley's attention to background information and details ensures Saturdays at Sweeney's can be read as a standalone.I like everyone in the extended Sweeney family, and feel like they are my friends and close neighbours. It's upsetting to see Captain Sweeney's Seafood Market go up in flames. This was the family livelihood for decades. What will they do now? What or who started the fire at Captain Sweeney's Seafood Market?Why was Lovie already there when the firemen arrived? Does Lovie have Alzheimer's disease or is she suffering from shock?Jackie and Bill have a secret. Will she share the secret with her sisters? Will Faith tell Mike and Sam about her suspicions?What does the future hold for the Sweeney sisters and their families? I enjoyed reading SATURDAYS AT SWEENEY'S and highly recommend this thought provoking, heartbreaking and suspenseful story. 5 stars.Thanks to Ashley Farley for gifting me an ARC of Saturdays at Sweeney's in exchange for an honest review. * This book is being released today, January 16, 2018."}, {"userName": "Shalini", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/57308589-shalini", "userReview": "This is the fifth book in the installment of Sweeney Sisters. But since I have not read the first four, I have to admit, I read this book as a casual novel without bonding with any of the sisters. Ashley Farley is explanative in her prose, so I could keep up with the happenings of the past. But in this book, being the last, the characters are pretty set in their ways. They move with an air of don't you already know me from the previous books? An already known feeling pervades the pages. Maybe that's one of the reasons, I couldn't feel their emotions. I didn't know them; they were strangers to me. The story goes thus, the seafood store goes up in a fire, the sisters are at a loss, both in their livelihood and the plans of a future for themselves and the children. There are crisis abound, health issues of their mother Lovie, with child problems in elder sister Jackie's life, middle sister, Sam having lost her entire means of living in the shop fire, the younger sister, Faith being stalked by a criminal ex. All this makes the book a series of happenings. I wouldn't say I loved the sisters and that I want to be a part of Sweeney Sisters, I certainly don't. I couldn't feel the bond between them. The real emotions between sisters felt lacklustre in this. Maybe being the final book, I am already supposed to feel their love from the previous books. The sisters have lot of untold hidden secrets, which keep on getting solved as the pages turned. I couldn't find that closeness, which sisters normally share even during the problems. The core of this final book, the vein that threads through its pages is never stop living, never stop dreaming, never get scared in starting a new life, whatever be the age. And this point resonated deep within me, as it stands true in my life too, especially while standing in the cross roads of life. Maybe one day I would go back and read the series in order, to fall in love with the Sweeney Sisters. I received an ARC from NetGalley and publisher Kindle Press and author Ashley Farley and this is my honest and unbiased opinion."}, {"userName": "DJ Sakata", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/18344018-dj-sakata", "userReview": "Favorite Quote:Did you fail sharing time in kindergarten?My Review:I have enjoyed this relevant and engaging series featuring three divergently different Lowcountry sisters and their addled yet feisty mother. Throughout the series, the sisters have faced a great deal of dispiriting hardships and challenges. This fifth and final installment of the series was fraught with tension from the beginning as it started with a fire to the family business that brought on a truckload of trouble and opened a channel for either a complete loss or a new opportunity. Each household, although while also blessed in many ways, was struggling with significant and overwhelming issues as well as the overriding critical element of the swift deterioration their elderly mother’s mental faculties. This concern was hitting close to home for me there is a rapidly ticking clock, and not an if but a when, until I will be facing this same despicable dilemma. Ms. Farley’s insightful narrative captured their inner conflict and turmoil with sensitivity and occasional hits of amusing levity which I fully appreciated as I've always found it preferable to laugh than to cry. I will miss the Sweeney sisters but was more than satisfied with their swan song."}, {"userName": "Sue ", "userReviewDate": "Dec 11, 2017", "userURL": "http://www.goodreads.com/user/show/690922-sue", "userReview": "Reading about the Sweeney family again was so much fun - it was like having coffee with longtime friends and catching up on old times. This is the final book in this series but I sure would love to read about them again sometime in the future.As the book begins, Sweeneys's Seafood Market is on fire and it looks like arson. When the fire department realizes that Lovie Sweeney had been at the scene when they got there and was unable to answer their questions, she becomes the first suspect. With the family's business gone, Sam and Faith need to decide what they will do next in their lives. Plus their children who planned to work at Sweeney's after college need to make decisions about their future. To top it all off, Lovie is diagnosed with Alzeheimers and her memory is rapidly deteriorating. I can't tell you much more without giving away any major plot points but I can tell you that the family has problems from all directions and it affects every one of them. Can they remember that it's family first and pull together for the good of the family???This is a wonderful book about family and love. I have two sisters and I love reading books about sisters who always remember the importance of love and family. I know this is the last book in the series but would love to read more about this family -- maybe a book about the next generation?Thanks to the author for a copy of this book to read and review. All opinions are my own."}, {"userName": "Leslie aka StoreyBook Reviews", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/272944-leslie-aka-storeybook-reviews", "userReview": "This is such a wonderful series. In fact, I want to live in Prospect! It sounds like such a divine town and they come together as a town and a family to help those in need.This book hit home a little bit because of Lovie and her dementia/Alzheimers. I felt so bad for Lovie and her daughters as they dealt with her decline and what was best for her in the long run.Faith had her past rear its ugly head and while she is the one that needed to deal with the situation, delaying telling her sisters put them in grave danger. I enjoyed reading a little bit more about the children and the issues that they faced as they grow older. It brings the family full circle and some of the issues are what we might experience ourselves. Great life lessons!If you haven't read this series you need to run to the store and pick it up. So good!"}, {"userName": "Melissa Borsey", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/30379107-melissa-borsey", "userReview": "Love, Love, Love this series! There are so many changes taking place in the lives of the Sweeney family, some good and some are just downright heartbreaking. The Sweeney sisters have always come together in time of need and this time it will take all their strength and love to see them through for the sake of their mother, Lovie. I highly recommend this wonderfully emotional story. Thank you to Ashley Farley for allowing me to be a part of her review crew."}, {"userName": "Cheryl Ann", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/71943420-cheryl-ann", "userReview": "This is a great series of books. The ups and downs of the Sweeney sisters. Their live's are touching and heart wrenching. All the challenges of real life and Alzheimer's. I Enjoyed reading this book."}, {"userName": "Susan Peterson", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/10178397-susan-peterson", "userReview": "It always feels like coming home when I open up a new book about the Sweeney sisters! As we catch up with the family, there are new daunting problems; a fire at the family’s business, the deterioration of their mother’s health, and a troubling time for one son and his parents. In true Sweeney fashion, they come together with the unwavering support and love for their family. This is a riveting, poignant continuation of the story. If you haven’t read the previous books in the series, the author provides just enough back story to fill you in. But the rest the books are all so heartfelt and compelling, that I urge you to read them all!"}, {"userName": "Donna Hines", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/47259487-donna-hines", "userReview": "A family oriented heartwarming tale of the ties that bind and the love that knows no bounds.The Sweeney Family is just that family. Though marked with tragedy and triumphs they always stay loyal and true to each other even if things become crazy in everyday life with kids, divorces, marriages, caring for elderly parent(s), running a business, daily stressors of work and family, plenty of anxieties, drug addictions, and college stresses and strains.The main character Samantha (Sam) Sweeney is riddled with anxiety upon learning her mom Lovie is being accused of arson for burning down the family seafood business(Sweeney's Seafood Market) they held for 6o years. What reason could an elderly woman with dementia and alzheimers have for doing such a thing? Was insurance money to blame? Sam's son Jamie is at a crossroads whether to stay in Prospect or move on with his life after graduating college to Charleston.Furthermore, Faith is a recovery from abusive marriage to Curtis and now is in search of her true passion.Jackie's two son's Cooper and Sean are also in this glorious family with one being the golden boy the other the latter the scapegoat.When the medical diagnosis of their elderly mom comes to fruition they decide as sisters to stay close and work together for the betterment of the family unit.It's never too late to chase those dreams.Will they rebuild? Will they work to make the business bigger and better than ever before?Can they work as a team and stay united?As things turn for the worse with odd behaviors turning up around them they begin to wonder who is behind the rotted fish, the pighead, the fire? Is it the same person with a vendetta against this family?As they each wrestle with their own dramas this family learns that tough love is sometimes needed. Could they work it all out before it's too late, repair some difficult relationships, and will love be in the cards? Will Faith ever truly be free of abuse and find her true calling in life?\"Life is nothing without family\" \"Love is all you need.\"Love this magical work from Ashley Farley. Thank you to Ashley, NetGalley, and Aldiko for this ARC copy which I hurried to read before the book launch now going on at her Facebook page. So I'm now headed over there but do go and read this wonderful work of art. You'll enjoy it for sure!"}, {"userName": "Lisa Hudson", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/49105261-lisa-hudson", "userReview": "RIVETING!Saturdays at Sweeney’s is an incredibly beautiful, riveting novel! Once you’ve read the first page and entered the world of the Sweeney Sisters, their families and their treasured mother, Lovie, you won’t want to stop until you’ve read the final word. When a cowardly act of arson destroys their beloved seafood business and restaurant, all manner of rumors start to swirl. This is a story of individuals. People who are finding themselves facing the biggest challenges of their lives. This is a also story of a family. A family that is full of complications, struggles, hurts, deeply buried secrets, addictions, bitterness and jealousy. This same family is also filled with laughter, joy, pride, fun, survival, hard work, encouragement and understanding. The Sweeneys are SURVIVORS and as you read this wonderful story, you can feel the depth of love they have for each other and know they will develop a plan to get the job done no matter the odds. I was provided an ARC of this book by the publisher. The opinions expressed here are completely my own and without influence."}, {"userName": "Candy Daoust", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/29914098-candy-daoust", "userReview": "What a heartwarming book. If you have not read any of the other books in this series, the author brings you up-to-date. Truthfully I have never read a book that touched on so many issues that have, or are affecting my life. The tenderness, tough love, questioning, insecurities and support are brought up in such a way that one cannot help but place themselves right in the midst of each situation. I am sure you will also find a little of yourself in the pages of this book. Oh and by the way, keep the tissues handy! This is real life, set in a fictional story, that will open your eyes and hearts to the importance of love, understanding and support of those who surround you! Ashley is an exceptional author who draws you in from the first page! I can’t recommend this book enough! I was given the opportunity to receive an ARC for my honest opinion."}, {"userName": "Jayne Burnett", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/11685790-jayne-burnett", "userReview": "Thanks to Net Galley and Kindle Press for an ARC of this book in exchange for a review. Another great read in the Sweeney Sisters life and the lives of their families. Sam ,Jackie & Faith each have their problems, but the strength they have together and the love of their families always sees them through. I loved reading more of the family tale but in this book we say goodbye to the sisters mother, Lovie. Lovie started the family business more than 50 years ago and has been a big part of this family story. This book touches on a few big topics dementia as Lovie begins to decline and drug abuse for one of Jackie’s twin boys Sean. Great series and would love to read more about this family."}, {"userName": "Ann", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/2562832-ann", "userReview": "I'm sad that this is the last book in the Sweeney Sisters series (#5) but it was a very satisfying conclusion for these wonderful sisters. The sad side of this book is that Lovey's health has declined significantly and the daughters get the news they have feared that Alzheimer's is the diagnose. A fire has devastated not only the family but the town as well. Faith, Sam and Jackie must deal with Lovey, the rebuilding along with the children's problems as well. These three ladies and their families are a testament to fortitude and family love. I hope that Ms. Farley will treat us to more of the Sweeney's with the next generation."}, {"userName": "Jennie  Veazey", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/29684491-jennie-veazey", "userReview": "Loved this book from beginning to the end!It was as wonderful as I thought it would be. The Sweeney Sister series has been a favorite of mine. Each book is full of surprises. In book 5 we learn more about the sisters and their kids. The kids are all growing up and making some difficult choices. We learn first hand just how hard it can be, to be faced with a loved one suffering from Alzheimer’s disease. The love and struggles of a wonderful family that are always there for each other. I will miss this series for sure but hopeful that we here more about the characters in future books! This was an amazing and wonderful book! Thank you Ashley Farley for a fabulous series!"}, {"userName": "Gail", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/2707400-gail", "userReview": "Good ending to this series."}, {"userName": "TarHeelGirl00", "userReviewDate": "Dec 22, 2017", "userURL": "http://www.goodreads.com/user/show/30927258-tarheelgirl00", "userReview": "The Sweeney Sisters are about as close to real-life as it gets! Things continue to change for the sisters and I so enjoy sharing both the happiness and the tears with this wonderful family.This heartwarming installment finds Lovie, the Sweeney matriarch, battling dementia. As the family struggles to deal with this emotional situation, other issues abound, including drug abuse, an arson investigation, and several other life-changing decisions.Over the course of reading this series, I feel like I have traveled to Prospect, becoming friends with the whole Sweeney clan! Now I'm going to greatly miss them as the series comes to a close, but I do look forward to what Ashley Farley has in store for us next.I am grateful to the author for the opportunity to download and read an ARC of this novel in exchange for an honest review."}, {"userName": "Charlie", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/4966195-charlie", "userReview": "I thought this would be a great book to start the off the year. I was shocked to realize it’s the final book in the series and the first one I’ve read! The author brings readers up to speed, though. Reading about the Sweeney sisters and their families in Prospect made me think this is the perfect kind of small town dysfunctional heaven. There were a wide range of events happening and packaged all in this book with the cute cover: a family’s battle living with Alzheimer’s, the family business being destroyed, family secrets, alcoholism and recovery, drug abuse and therapy, younger generations starting their college pathways, a strange mystery of occurrences, and a sleazy tabloid writer. It didn’t shy away from those hard topics – it faced them head-on. Each family member has his or her own spotlight throughout the book to continue the narration and plot.Each of the Sweeney sisters had their own secret to hide and each of those things continued to build up the tension and draw out the suspense, while their children are also struggling to move forward in their lives.The book begins with Sweeney's Seafood Market on fire. The preliminary report points to a lightning strike, but further investigation reveals arson. The fire department is reluctant to point fingers, but it must be noted that Lovie Sweeney was at the scene before the fire department arrived. She couldn't answer their questions and becomes the lone suspect. As Faith planned to step away from the business and leave it to Sam, she and her son Jamie must decide what their next move with the family business will be. Is this a total loss or a new beginning? Jaimie's entire summer plan was to work at Sweeney's. It is looking dismal with Lovie being the center of the fire investigation. The insurance won't pay out in the event of arson. Sam's husband Eli must recuse himself from the investigation, but is right there alongside it every step of the way to ensure it is executed properly. From day one, it is not. It results in further disorientation from Lovie, who doesn't seem to know who Eli is. She is living in the past, and Sam is still with Allen. Concerned for her well-being, the sisters remove their mother from her townhouse and install her in Faith's home. With no job to report to every day, and stuck in limbo with the direction her life should now take, Faith readily volunteers to be caretaker extraordinaire for their mother. Lovie's mental faculties continue to decline, and soon she is becoming combative and hard to care for.Suddenly dead animals begin showing up on the sisters' doorsteps, with their mother's hand-written recipes attached. Whoever set the fire is taunting the Sweeney girls. Faith quickly discovers who the true culprit is, but she never shares that information with her sisters or even her husband. Instead, she does what she wants to and ultimately puts her mother and daughter at risk. The oldest sister, Jackie, is busy running her interior design business and looking to expand. Spending much of the week out of town, she is disconnected with the family. After trying to convince her sisters to place their mother in an amazing care facility, she is kind of on the outs. She is struggling to keep customers happy, sell her current location, and purchase a new showroom. Meanwhile, one of her sons is arrested on drug charges. Additionally, he is kicked out of Jackie's alma matter for straight failing grades his freshman year. He is brought back home and everything about it is kept a secret. Jamie is tasked with babysitting Sean and they both get jobs at a local restaurant. In the time the boys aren't working the restaurant, they are out catching crabs and selling on the site of their burned family business on Saturdays. Soon, Jamie connects with his half-sister and goes to work with her catering company. This is the story of real life that real families face every day. It was eye-opening to family, loyalty, love, motivation, distrust, secrets, fear. It is also a wonderful example of how important it is to be understanding and supportive of your loved ones going through tough trying situations. I connected so well with this family and fell in love with them. I definitely want to go back and read the first four books in the series."}, {"userName": "Kristine (The Writer's Inkwell)", "userReviewDate": "Dec 18, 2017", "userURL": "http://www.goodreads.com/user/show/8123570-kristine-the-writer-s-inkwell", "userReview": "I have found that my love of the Sweeney Sisters novels hinders on my appreciation for the character of Sam. As the middle sister, Sam is the backbone of her family and seemingly is the only one who has grown up over the past several years/books. As the family’s business goes up in flames, Sam finds that she is completely alone in deciding if she should rebuild or move on. Her sisters are not invested in rebuilding the family’s legacy and they spend much of the book too wrapped up in their own personal dramas to care that their sister has ultimately lost everything. After all, the locals suspect and blame Lovie Sweeney of setting the business ablaze, especially since she was found at the scene of the crime and showed signs of complete confusion.One of the reasons it’s difficult for Faith to be available to support or help Sam, is because she is busy trying to figure out what she wants to be when she grows up. Another reason is that their mother, Lovie is clearly deteriorating and Faith takes it upon herself to take care of her. But Faith hasn’t really grown as a character in this series. When she discovers who may be the true culprit, she never thinks to seek out her sisters or confide in her husband. Instead, she makes one bad decision after another that puts her, her daughter, her mother, and the rest of the family in harm’s way.While I had a hard time sympathizing for Faith, I found Jackie to be utterly repulsive. I have never really been a fan of the eldest Sweeney sister and her actions/story line have only further contributed to my lack of disinterest.Now that I’ve gotten past my gripes, let me tell you what I truly love about this book and this series. This series is about a family that is not perfect and they have a lot of ups and downs. They make mistakes, keep secrets, and get into trouble. But at the end of the day, this family saga gives me insight to the love and strength of a family. This is something I am not fortunate enough to have in my real life, so it’s nice to live vicariously through the Sweeneys. I also enjoy the way the family rallies around one another in a time of need (with the exception of my gripes above). At the core of it all, it is the family aspect of this series that makes it a hit with me. I love reading about how the family is growing and changing. It’s even nice to see some of the younger perspectives being introduced and their storylines developed. This book has its ups and downs, but the overall story is what makes this a must read in my book.Reviewer’s note: I received this book from Netgalley in exchange for an honest review."}, {"userName": "Janet", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/7306509-janet", "userReview": "I received a DIGITAL Advance Reader Copy of this book from #NetGalley in exchange for an honest review. Poppy, my sister, who doesn’t like a digital footprint due to her career choice, asked to read and review this book.From the publisher - Members of the Sweeney family, young and old, chart their courses for the future in this final installment of the bestselling Sweeney Sisters Series. When the seafood business Lovie Sweeney established sixty years ago is destroyed by fire, she finds herself at the center of an arson investigation. What really happened that night? Is Lovie responsible for starting the fire or is her family under attack from a sworn enemy? The loss of their family business leaves the Sweeney clan in flux. Samantha faces the challenges of rebuilding the market while her son, Jamie, on track to graduate from college in six months, must decide whether to make his permanent home in Prospect or move to Charleston where a new special someone resides. At age forty-five, Faith, who has never fully recovered from an abusive marriage, is on a quest to find her true passion? Jackie is distraught when her son, Sean, flunks out of college and struggles to find direction in his life without his twin brother to guide him. A medical diagnosis brings the sisters closer together and threatens to change family dynamics forever.The Sweeney women remind us that it’s never too late to begin a new endeavor and to never stop chasing your dreams until you draw your last breath.This is the latest edition of a book series that I adore and it was great to see the family again -- on my kindle, not in person --- much how I feel about a lot of family at this time of year! 😊 The book is well written and totally enjoyable: have you ever read one of those books that make you all cozy inside? One that is as sweet as a marshmallow and fluffy at the same time of being serious and full of family drama? This is the book for you – I am not going to re-gurgitate the plot in my review as it is written right about this part but I loved this book and so will (or should) you!"}, {"userName": "Carla", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/36228194-carla", "userReview": "Wow - another powerful book from in the Sweeney Sisters series!I love the Sweeney sisters, they are as real as you can get. They love deeply, argue deeply, speak their minds but family is the most important thing to them at the end of the day (even if sometimes their actions speak differently!).In this novel, emotions are running high and the pain is very raw. Lovie, who you fall in love with right from the start, is at the center of an arson investigation of her own family business! For months, she has been showing signs of Alzheimer's and this had already had the girls on the fence on how to care for her but when because of this she is being blamed for arson, a decision needs to be made and fast. While the girls in their hearts struggle with the idea that their Mother could have caused the fire (and deep down they know she couldn't have), all fingers point to her.With this background, the girls need to decide not only Love's future but their own and the future of their family business - do they rebuild, do they move on or do they change? While this is all taking place, life is still moving forward - children are moving home, facing crises, addiction and major life changes!Saturday at Sweeney's is a well written, unique to the series novel that you will not want to put down. Ashley draws you into the story from Chapter One and leaves you craving for more. She spins an amazing plot where you don't see the ending coming. This is a story of family, life, moving forward, faith, trust and strength. It is real, raw and full of emotions - a definite must read novel and series."}, {"userName": "Susan (The Book Bag)", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/1516073-susan-the-book-bag", "userReview": "If you have not picked up the Sweeney sisters series, you really must...as soon as possible. You will fall in love with this family, just like I did. The three Sweeney sisters are not perfect, by any means. As a matter of fact, they all have had their share of troubles and hardships but because they have family and good friends, they make it through the tough times.Saturdays at Sweeney's get off to an intense start with a fire at the family business—a business that has been thriving for several generations and is the glue that holds the family together. Now with it gone, what's going to happen to the Sweeneys? And then there's the question of how the fire started? Was it arson? And is a Sweeney guilty of starting it?As the family works on regrouping, the matriarch of the family is failing and the family receives some devastating news. How much more can this family handle?This is an amazing series that captured me from the start, full of memorable characters that I came to think of as friends. I'm sad that this is the last book in the series but I am hoping that some of the characters have a strong enough voice that the author will take us back for a visit."}, {"userName": "Authors & Readers Book Corner", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/4495454-authors-readers-book-corner", "userReview": "Saturday’s at Sweeney’s, the last book in the Sweeney Sisters series by Ashley Farley, is about the matriarch of the family being accused of ruining the family business. The book starts off with Sam Sweeney being called and told their family business is on fire. She is shocked as the rest of the family but hurt when the police believe her mother was responsible for the incident. Sam is basically in charge of running the family business and hopes to rebuild with her son Jamie, who doesn’t want to leave his hometown. Jackie doesn’t really want to deal with the problems surrounding the business nor the issues her son, Sean is having, but is quick to give advice to her sisters. Faith, the youngest, volunteers to take care of their mother until they make a final decision about placement, but she is also keeping a secret from her sisters that may be dangerous.This is my first introduction to Ashley Farley’s writing but will not be my last. She is an author I will continue to follow. This book shows the realistic interaction within a family, which made me connect with the characters. The mystery aspect is just a plus. The twists and reveal were unsuspected but worth the wait. The transitions Lovie goes through in the book made me sympathetic to her family’s issues of placing her in facility.I read this book with determination to find out who committed this crime because to blame it on an elderly woman with dementia was bugging me. In the process, I met some interesting characters with everyday problems. I recommend this book to readers who love mysteries.This book was provided by the author for review purposes only.A&RBC Reviews5 Stars=Non-Page Turner"}, {"userName": "Charlotte Lynn", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/5944642-charlotte-lynn", "userReview": "The Sweeney Family has become friends and family to me. I am invested in their happiness, I want to be at their get togethers, and I want to be part of future. As with the other books in this series there is a lot going on with the different branches of the family. Each character has their own history and their own reason for being how they are. It is amazing how Ashley Farley manages to weave their stories together to make them come together and make a complete book. This book was primarily Lovie’s story. The matriarch of the Sweeney family has been working in the family store, keeping everyone in line, and generally running the family. Now it is her turn to be taken care of. I am thrilled with how the family comes together and each play their part to help her continue to enjoy life. The three daughters all come together in a different way which I found to be very true to life. I love this series and these characters. There is no doubt that I recommend this book. Pick up your copy and enjoy the southern charm of the Sweeney Family."}, {"userName": "Anne Rightler", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/6047166-anne-rightler", "userReview": "Having read several of the books in the Sweeney Sisters series, I was looking forward to reading book #5 and apparently the final one of the series. I was not disappointed with Ashley Farley's Saturdays at Sweeney's. I love reading more about characters from previous books, how things are turning out for them, how relationships have developed or not. It is like catching up with old friends and sometimes there are some new friends too. Farley has created vibrant and realistic characters and brings to life the time-tested bonds of a family and a community as she portrays the healing power of friendship and love. A well-written story, Saturdays at Sweeney's is full of profoundly human emotions and authenticity as the characters deal with the tragedy of a destructive fire and the tragedy of Alzeheimers Disease. I'm sad to see the series end but perhaps we readers can hope for another series that will be just as poignant and compelling as the Sweeney Sisters series. I received a complimentary copy of the book and was not required to write a review. The opinions are my own."}, {"userName": "Jeanne Maliner", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/57243996-jeanne-maliner", "userReview": "Having pre-ordered Saturdays st Sweeney's, I thought I would read it as soon as I received it. I didn't cause I was bummed about it being the last of the series. After reading it, I realized that the author chose the perfect place to end the chapter on the Sweeney sisters. It couldn't have ended any better and all the mysteries were tied up neatly. There were new dilemmas so it wasn't the same old, same old, but lots of familiar faces that I came to love. Each of the sisters faced separate tragedies and one that would affect the entire family right down to little Bitsy. Excellent plot. It grabs you and won't let you go until the last sentence. The characters are real. The locations perfectly described. I would like to live in Prospect. I highly recommend this book and the entire series."}, {"userName": "Laurie", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/11486717-laurie", "userReview": "The Sweeney family is back!  The beloved Seafood Market has burned to the ground! The big question is \"Who did this?\" The need to find out the cause of this disaster is essential to recoup the insurance money and rebuild.  The family matriarch, Lovie, has been found at the scene and has no idea what has happened- or does she? She is battling dementia and is considered unreliable. Then--- the clues start to come forth to put and end to the mystery. This is a beautiful novel with many facets to the plot. You will find that you want to step into the book and help the Sweeney's as they work through each of their problems and to give them all hugs, especially Lovie as she begins to move on to her next journey. Don't miss this book!"}, {"userName": "Angi DeMonti", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/16947164-angi-demonti", "userReview": "I received an advanced copy of this book and am voluntarily writing my honest review.A perfect conclusion to this series. Faced with losing their family business, the Sweeney sisters struggle to figure out their next steps. As each sister struggles with their new directions, the reader is shown the strength of this family. Ms. Farley has managed to create a series that captures the reader and makes them feel like they are part of the family. Her characters are realistic and flawed but perfectly written. Her books, including this one, deal with real life issues in a thoughtful and sensitive manner. While I am sad to see this series end, I love that the author wrote it in a manner that did not leave the reader with any questions."}, {"userName": "Margie Shaw", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/42918716-margie-shaw", "userReview": "I received an Advanced Reader Ebook Copy of Saturday at Sweeney’s from Ashley Farley in exchange for my honest opinion. I have read every book in the series, this one makes 5, and have loved every single one! It’s about the Sweeney family and their lives in a small town called Prospect which is in the Lowcountry. There are 3 sisters who are the main characters, and although I hate to admit it, I seem to favor Sam, the middle daughter. Ashley covers many everyday topics that we all go through in life and I think that’s why the books are so easy to relate to. You can’t help but love this family and it feels like the characters are real and that you actually know them. This particular book covers some very sad and upsetting topics, but just as in life, things aren’t always happy and perfect. Alzheimer’s is the main topic, with a little drug addiction, guns and fire thrown in there. I have recommended all of these books to my reader friends. If you haven’t read about the Sweeney’s yet, you really should. Believe me, you won’t be disappointed!"}, {"userName": "Janet Boyd", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/50500011-janet-boyd", "userReview": "Sweeney Sisters Series Ashley Farley is a gifted writer that builds her characters with imagination and surrounds them with family that is so complex, that it makes them seem like our own. Then, she divides them into a series, that is both defining and continuous at the same time. I have been completely swept up in the family turmoil and loved every moment. I hope they're is another series in my future! Thank you, Ashley, for the hours of entertainment...as a South Carolina girl myself, I'm left feeling homesick, smelling the salt air and longing to feel the sand on my feet."}, {"userName": "Kristi Fleming", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/5629695-kristi-fleming", "userReview": "Saturday at Sweeney's is the final chapter in the series. For me it was the worst written book of the series as well. 1. I really dislike how the author repeats multiple times about something that occurred in past books.2. It seems odd that brand name of items were mentioned instead of the generic term. It seemed to  me that the author did this in order to just add more typed characters to the book.3. There was a lack of connection between characters and their emotions.4. Loved how Alzheimer's was brought to the forefront and a reflection of care giving shown.An okay series overall."}], "description": "Members of the Sweeney family, young and old, chart their courses for the future in this final installment of the bestselling Sweeney Sisters Series. When the seafood business Lovie Sweeney established sixty years ago is destroyed by fire, she finds herself at the center of an arson investigation. What really happened that night? Is Lovie responsible for starting the fire or is her family under attack from a sworn enemy? The loss of their family business leaves the Sweeney clan in flux. Samantha faces the challenges of rebuilding the market while her son, Jamie, on track to graduate from college in six months, must decide whether to make his permanent home in Prospect or move to Charleston where a new special someone resides. At age forty-five, Faith, who has never fully recovered from an abusive marriage, is on a quest to find her true passion? Jackie is distraught when her son, Sean, flunks out of college and struggles to find direction in his life without his twin brother to guide him. A medical diagnosis brings the sisters closer together and threatens to change family dynamics forever. The Sweeney women remind us that it's never too late to begin a new endeavor and to never stop chasing your dreams until you draw your last breath.", "title": "Saturdays at Sweeney's\n      \n          (Sweeney Sisters #5)", "url": "https://www.goodreads.com/book/show/37971662-saturdays-at-sweeney-s", "average": 4.44, "cover": "https://images.gr-assets.com/books/1518834551l/37971662.jpg", "reviews": 107, "authors": [{"url": "https://www.goodreads.com/author/show/6916019.Ashley_Farley", "name": "Ashley Farley"}], "type": ["Fiction"], "outlinks": ["http://www.goodreads.com/book/show/37971662-saturdays-at-sweeney-s", "http://www.goodreads.com/book/show/36697161-saturdays-at-sweeney-s", "http://www.goodreads.com/book/show/37564216-saturdays-at-sweeney-s", "http://www.goodreads.com/book/show/35992068-magnolia-nights", "http://www.goodreads.com/book/show/34390136-sweet-tea-tuesdays", "http://www.goodreads.com/book/show/25202681-her-sister-s-shoes", "http://www.goodreads.com/book/show/31684773-boots-and-bedlam", "http://www.goodreads.com/book/show/33216759-tangle-of-strings"]}