{"ratings": 33730, "userreviews": [{"userName": "Nazanin", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/39893246-nazanin", "userReview": "3 Slow StarsAfter two years grieving for her husband’s death, Morgan decided it’s time to get back to being her old self. She is a thirty-three-year-old assistant district attorney. Her first case after two years is the murder of her occasional baby sitter (Tessa, eighteen-year-old). For this case she uses Lance’s help. Lance was a former police officer but after a bullet on his leg, he joined to a PI firm. Morgan and Lance knew each other since high school. And They have some feelings toward each other from that time. He works on a case too, a missing girl. They think maybe these two case are connected to each other somehow.Okay, this story was really, really, really slow. The author didn’t give anything to occupy my mind. I even didn’t bother to think about the cases. I read first 70% and the things that I knew till then was from the first chapters, nothing more! Therefor I started to skim and skip. It didn’t intrigued me, at all. The slowness of it was killing me. So many details that wasn’t necessary to be said.The story is told in multiple POV, 3rd person. It’s the first installment in \"Morgan Dane\" series but it can be read as a stand-alone. And I definitely do NOT reading the next book! I really didn’t enjoy it. It fell flat for me but I hope you enjoy it more than me!"}, {"userName": "Theresa Alan", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/3268839-theresa-alan", "userReview": "This novel eventually has some decent twists – clues uncovered by prosecutor Morgan and private eye Lance. When Morgan returns home to a small town after the death of her husband, she’s about to take a promising job when a beloved neighborhood girl turns up brutally murdered and the seemingly nice boy Morgan has known for years is accused of her death. Morgan volunteers to defend him because she can’t believe Nick did it. In doing so, she is potentially destroying her career and she is definitely incurring the wrath of her community. Morgan and Lance uncover clues that the police, who are already convinced Nick did it because they found his DNA inside her, do not. There is a slight romantic spark between the two, but not enough to call this romantic suspense. This novel was OK, but not compelling enough that I’ll be reading anymore books in the series."}, {"userName": "Tulay", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/36800166-tulay", "userReview": "Suspenseful story.One girl murdered and one missing. Good supporting family and some with lots of troubles. Also renewed relationship starting. Action, suspense, thrills of lawyer and two private investigators. More like 2.5 stars for me."}, {"userName": "Tracy *To the point Reviews*", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/22680185-tracy-to-the-point-reviews", "userReview": "As I read this book, many things occurred to me.1. I remembered that i am due for a cleaning at the dentist.2. I wanted to try a strawberry shortcake recipe I saw on Create TV.3. I also need an oil change... I think.4. Baking soda. My fridge needs a new box of baking soda!Oops, I'm reading this murder mystery! Or I am supposed to be. And its just not holding my interest. It's just not interesting enough. It's like chicken with no seasoning. Or tequila without lemon. Sex without an orgasm. You catch my drift yet? Something was just missing! I was re reading the same paragraph over and over again because I would just drift. (like in high school) If that's not a sign that a book had a capital B for Boring (For me anyhow) I don't know what is.The writing is average and lacking life and originality. The main characters needs so many more layers. And the hero has ZERO appeal. The mystery in itself is mediocre and the conclusion ties itself too nicely. The romance... a fart in the wind. It could have gone so much deeper.All in all... reading this book made me realize I got shit to do.This just didn't float my boat."}, {"userName": "Melanie", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/23102950-melanie", "userReview": "4.5 Stars!Say You’re Sorry was a fantastic start to the Morgan Dane series, with wonderful characters and a compelling mystery that kept me guessing right until the very end.After losing her husband in Iraq, Morgan Dane has returned to her hometown of Scarlet Falls to raise her three girls with the help of her family. Say You’re Sorry picks up two years after Morgan returned home as she plans to get back to work by starting a job at the DA’s office. However, Morgan’s life is thrown into chaos when her babysitter is murdered and her neighbor’s son is accused of the crime. Believing Nick to be innocent, Morgan agrees to take on the case at the request of her neighbor. With the help of an old friend turned private eye, Morgan begins her investigation and aims to prove her neighbor is innocent and the real killer is still at large.Morgan is an incredibly strong character and really brave despite the difficulties she's facing while defending Nick's case. She also has a great sense of loyalty for those she cares about. I love how much she cares about her family and that even when she's busy with the case, she finds time to be with her daughters. Lance has had a difficult few months recovering from being shot while he was still on the police force. As a private detective, he has more freedom when it comes to his work, but he misses being on the force. Through his work as a P.I. he gets to work with Morgan, whom he has known since high school. I really enjoyed their working relationship, as well as the introduction of something more in their private life. I feel the two fit together very well and I'm excited to see where things go between them in future books.The mystery surrounding Tessa's death was intriguing. There were several suspects over the course of the book which led to constant twists and turns. I suspected several people, but never actually the person who was the killer. Getting chapters inside the killer's head gave great insight into how twisted the killer really was. I also enjoyed how the author wove several other small scandals/mysteries into the story.I read this book without reading the connecting series, Scarlet Falls, but had no issues understanding who everyone was and how they were all connected to each other. The author does a great job at making this its own series while including little Easter eggs for those familiar with the prior series. For being a romantic suspense book, Say You’re Sorry is more on the thriller/mystery end, but there are enough elements of romance that seem to imply that may take more of a center role in future books.Overall, Say You’re Sorry was a fun read with a ton of action and a compelling mystery. I’m excited for more books to come out in this series as I really enjoyed these characters and the setting. I will definitely be checking out the connecting series, Scarlet Falls, soon.**I received an advanced copy from Netgalley and the publisher in exchange for an honest review.**"}, {"userName": "CD {Boulder Blvd}", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/31857175-cd-boulder-blvd", "userReview": "Morgan Dane is a widow with young kids living with her father and a troubled young woman she has pulled into her home. Her husband was killed in Iraq two years ago and she hasn't really been able to pull herself out of her grieve and move on with her life. She has just accepted a job with District Attorney's office and is trying to move forward. But before her job can start, she is pulled into looking for a girl, Tessa, who had babysat her young children. The grandparents can't find her and are getting nervous. Asking her friend Lance Kruger to help look for her, they discover her body in a teen hangout area. The police identify her neighbor Nick as the killer. She knows Nick. He plays chess with her father, her kids adore him and she doesn't want to believe he's guilty. Nick's dad doesn't have a lot of money, is working to mortgage his house for Nick's defense and asks Morgan for help.Putting her new job on the line, she teams up with Lance to prove Nick's innocence and find the real killer. Lance is a great guy. Previously injured with the police department, he is now working as a PI. Morgan and Lance also dated in high school, so there is a lot of friendship and history between them. Lance is not an OTT alpha hero (thank goodness)! He sacrifices for those he cares about. And he cares about Morgan. The romance is a very believable and a slow burn. The plot is really well paced as Morgan and Lance search for the killer of Tessa and try to prove the innocence of Nick. I don't want to give anything away, but it really pulled me in. You get a little bit of the killer's perspective (definitely a very sick individual) which adds to the overall suspense of the book. Say You're Sorry by Melinda Leigh is an excellent start to the new Morgan Dane series and now my favorite book written by her. For me it was a true 5 star read and once I started reading it, I couldn't put it down. The second book in the series comes out in September and it's definitely on my wish list.Thanks to NetGalley and Montlake Romance for an ARC of this book."}, {"userName": "Mo", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/11856352-mo", "userReview": "3.5 starsI have read a few other books by this author and quite enjoyed them. This one wasn't bad. Seemed to drag a bit. Romance is not high on the agenda here and it could have been. But maybe in the next in the series.Ok, it's an old picture, but you get my drift ..."}, {"userName": "Anita", "userReviewDate": "May 27, 2017", "userURL": "http://www.goodreads.com/user/show/10765339-anita", "userReview": "Advanced Reader Copy (ARC) provided by the Author and Publisher via NetGalley in exchange for an fair and honest review.Solid mystery and the great start to a new series. The relationship between Morgan and Lance is sweet and Lance may be my new favorite Hero. I mean what woman can possibly resist a man who loves his mother with all her problems, loves her kids and plays the piano and sings to her? I'll add in blond, buff and hot, but, really isn't that just overkill?Morgan Dane lost her warrior husband to an IED in Iraq two years ago. She is a widow with three little girls to raise, a grandfather to help care for them and a young woman living with them who has serious medical issues. She has a full plate and now feels the need to return to work as an assistant district attorney to help battle the malaise that seems to have settled over her life like a cloud. Her occasional babysitter, Tessa, goes missing and Morgan calls her old high school flame and former Scarlet Lake Police Officer, Lance Kruger, to help her find Tessa. They find her dead at a high school hangout spot at the lake. At first the evidence points to Morgan's neighbor, Nick. How can a young man who reads stories to her little girls and plays chess with her grandfather possibly have done this?Morgan's answer is: He didn't. As Morgan begins to peal away the layers of the case against Nick, she uncovers a rush to judgment with serious political overtones that has put a lot of people in danger. She also discovers that she and Lance have the potential to become something other than friends and work associates."}, {"userName": "MariLou Schuman", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/5896687-marilou-schuman", "userReview": "I had the extreme privilege of reading an Advanced Release copy of this wonderful new series by one of my favorite authors - Melinda Leigh!Morgan Dane is a widowed single mom with three young children, who abandons her new job, before it starts, with the Scarlet Falls District Attorney's office, to defend a young neighbor accused of the brutal murder of his girlfriend.Joining her in her investigation is her friend, ex-cop turned private investigator Lance Kruger.It was great reconnecting with characters from the Scarlet Falls series (I always secretly wonder what's happening with them when their story ends).I loved this book, and cannot wait for the 2nd in the series - Her Last Goodbye."}, {"userName": "Linda Strong", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/13684015-linda-strong", "userReview": "Former Prosecutor Morgan Dane and her three young daughters have returned to her hometown of Scarlet Falls, following the death of her husband while serving our country in Iraq.Now that she's near family and old friends, and with the promise of working with the District Attorney, she feels she's finally ready to put her grief aside and start her life again.All goes well until her teenage babysitter is found murdered. The accused is her neighbor's son, Nick, who is just a few years older than the sitter. Nick was a frequent visitor in Morgan's home, entertaining her daughters, playing chess or checkers with her father. Nick's father begs for help for him and Morgan agrees. Deep down, Morgan just cannot accept that Nick could murder anyone.Her decision turns her neighbors and friends against her and she loses the lucrative job before she even begins putting together a defense for Nick. Needing an investigator, she turns to her friend Lane Kruger, an ex-cop turned private eye. Morgan and Lance are going to have to battle the community, the cops, the DA. As they systematically interview and question the girl's friends and family, they learn that just about every teenager in town knows something they aren't sharing. Meanwhile more evidence is stacking up against Nick.Never a dull moment in this book! I really enjoyed how law enforcement worked with a private eye... just a touch of distrust on both sides, especially as the police looked in one direction only and never considered anyone else a suspect. There's an attraction between Morgan and Lance, she's a bit hesitant, he's determined not to scare her away. There's a little bit of everything here .... a sadistic killer, a young murder victim who argued with her grandparents the very last time they saw her, a young man accused of a brutal crime, who only wants to continue helping his father with a landscaping business, a friend of the victim who seems to be in hiding... but from what?Many thanks to the author / Montlake Romance / Netgalley for the digital copy of this romantic suspense. Opinions expressed here are unbiased and entirely my own."}, {"userName": "Book Lover", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/29645151-book-lover", "userReview": "This is my first book by this author and I loved it! Great start to a series!Morgan Dane is a widowed mother of three girls. Her husband was killed in the line of duty and she is still mourning 2 years later. She moved back to Scarlet Falls to live with her grandfather. She hasn’t worked outside the home since her husband was killed. She finally decides it’s time to re-enter the work force. She is an attorney and has agreed to go to work for the District Attorney’s office. She receives a phone call late at night from the grandparents of a young girl who baby sits occasionally for her stating she is missing. Morgan calls Lance Kruger, an old high school boyfriend, whom she has become good friends with since her return to Scarlet Falls. Lance is currently working as a PI while on medical leave from the police department due to a gunshot wound to his thigh. They discover the girl’s brutally murdered body. When Nick, her 20 year old neighbor, and friend of the family, is accused of killing his girlfriend, Morgan agrees to represent him pro bono. This ends her job with the DA’s office before it even began. She goes to the PI office Lance works for to ask for their help. Morgan and Lance work well together. Morgan is still dealing with her past while trying to move forward. Lance is dealing with the loss of a job that defined him and trying to figure out his future. He’s been interested in Morgan for a while, but knows she’s not ready for a relationship, so has resolved himself to the friend zone. Plus, he’s dealing with a mom who has mental health issues. Lance comes across as a stand up guy with unquestionable integrity, honesty and a big heart. Morgan shares those qualities. I loved that there was no histrionics, immature meltdowns, or ridiculous outbursts between Morgan and Lance. I never saw the killer coming! This rarely happens for me, so I was impressed! This book is a real page turner. There is also a great cast of supporting characters as well. Grandpa is a real sweetheart and very encouraging to Morgan. Morgan’s girls are good kids. Her youngest is a bit of a spitfire! Lincoln Sharp is a retired detective and owner of the PI firm where Lance works. He is a father figure for Lance and another stand up guy.There isn’t much romance to this romantic suspense. However, the ending has me hoping there’s more to come in the following books! I’m very happy to have discovered this author. I will be watching for the next book in this series!I voluntarily reviewed an ARC provided by NetGalley."}, {"userName": "Carrie", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/36817401-carrie", "userReview": "Morgan Dane has returned home to Scarlet Falls with her three young girls after the devastating loss of her husband in the military. She's agreed to take a job as a prosecutor following in her family's footsteps of putting away the bad guys until her neighbors son is arrested for murder. When Tessa was found raped and murdered the whole town wants justice but Morgan just has a gut feeling that there is no way Nick could have committed this crime having known both of them. Morgan decides to help defend Nick and do her own investigating with the help of Lance Kruger, an ex-cop turned private eye, to get her client off and find the real killer. Say You're Sorry if the first book of the Morgan Dane series by Melinda Leigh. The series is apparently a spin off from another series but I never found myself lost from not having read other books my this author and felt the story was built rather well without having read other background from other series but after this one I may just go back and pick up her other books. The story is a romantic suspense read that changes the point of view all throughout including some chapters from the prospective of the killer. Morgan however is the main character in the story, a former attorney who became a stay at home mom that is just returning back to work. Along with her former high school boyfriend turned P.I. they tackle the case to find a killer. The romance isn't overly pushed in the story letting a reader get invested more into the thriller side of the book as the investigation goes on. Overall, I really enjoyed this one from the explosive opening pages until the very end. I did decide to give this 4.5 stars just on one little detail from the end that I won't mention due to spoilers but otherwise a great read. I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.wordpress...."}, {"userName": "Terri ♥ (aka Mrs. Christian Grey)", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/6014919-terri-aka-mrs-christian-grey", "userReview": "4.5This was a tough listen in some parts. But the fact that I cared about the injustices happening to fictional characters says a lot of good things about this author.The story was fluid and kept me on my toes. It's more mystery/suspense than romance. But that's fine with me. I didn't figure out who done it with absolute conviction. He (not a spoiler) was among my list of suspects, but I hadn't settled on him. This is a good thing.I look forward to more in this series. Hell, there is a relationship to grow and more bad things that are happening in this small town. I look forward to it."}, {"userName": "Under the Covers Book Blog", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/35433419-under-the-covers-book-blog", "userReview": "I am still relatively new to the thriller genre, I like to dip my toe in every now and then, however, in this book Melinda Leigh has tempted me to belly flop right in. Say You're Sorry captivated me from page one as you witness the murder first hand, after that, it wasn't a want, it was a need; I needed to keep reading and find out the full story.Morgan Dane is our main character, she's been widowed for two years and has 3 adorable small children, who she parents with the help of her father. Now, she has decided it's time for her to go back to work as a prosecutor. But, just as she's about to start her baby sitter is horrifically murdered and her neighbour is accused of the slaying. Morgan doesn't buy it. So with the help of her private investigator and former high school boyfriend, she decides to take up his defence.This book is so easy to get into, Morgan is such an identifiable figure, a single mother trying to do the best for her children and now juggling a stressful job. A stressful job where she isn't sure she's doing the right thing. And then there's Lance the PI assisting her with the case and a guy with some pressures of his own. The murder case itself, although interesting to follow, as soon as the murderer popped up I figured it out correctly but that didn't stop me from enjoying the ride to get there.It was Morgan and her relationship with people, her blossoming romance with Lance, her devotion to her family, her dedication to helping Nick - the young man accused of murder - that kept me glued to the book. I can't wait to read more in this series and I will definitely be looking up some more Melinda Leigh.*ARC provided by publisherReviewed by Suzanne❤ ♡ Don't want to miss any of our posts? Subscribe to our blog by email! ♡ ❤"}, {"userName": "Nancy Baker", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/29267077-nancy-baker", "userReview": "A young widow with 3 little girls lives with her grandfather. It's been two years since she lost her husband in Iraq and she is thinking it is time she gets back to her \"pre-widow\" career of attorney. With a family rich in law enforcement, Morgan has been raised with a mindset of justice for the guilty and vindication for the innocent. A brutal rape and murder of local high school girl finds a polite young neighbor of Morgan's under suspicion for murder. Finding it hard to believe that the same boy who regularly plays chess with her grandfather and spends time in her home among her daughters is capable of such a heinous crime, she agrees to take on his case. I enjoyed following the story as it played out and thought the characters were well developed. The author gave you many opportunities to place blame on multiple persons only to take back the gleam of hope that you figured out the case. (My only objection was that perhaps there were too many possibilities.) A pretty good mystery, well written and perfectly ended to engage the reader in future cases and investigations for Morgan and Lance. I personally can see this story and future stories of Morgan in a Hallmark movies and mystery series. I received this ARC free of charge for an honest review. Thank you for the opportunity to partake of this first journey in the adventures of Morgan Dane and wish the author continued success in her future publications."}, {"userName": "Dísir", "userReviewDate": "Apr 13, 2017", "userURL": "http://www.goodreads.com/user/show/27502347-d-sir", "userReview": "As a huge fan of Leigh’s Scarlet Falls series, I was so thrilled to learn about this spin-off and even more excited to revisit Lance and Morgan, both of whom were said to have a brief history in Stella and Mac’s story. But Melinda Leigh is an author I can always count on for fantastic reads and ‘Say You’re Sorry’ more than lives up to this billing. But I love Leigh’s heroines and heroes for so many reasons: they use their smarts and wits and intelligence to get ahead (sometimes without even needing to fire a gun), they generally don’t have immature meltdowns that are out of character and aren’t afraid to admit their uncertainty and doubts even when cornered. The all-round maturity certainly helps. ‘Say You’re Sorry’ introduces us to Morgan Dane, a district attorney whose life was blown wide open when her husband died during his deployment, leaving her to sort herself out back home with 3 young children. But the fragility and vulnerability never quite go away no matter how much she convinces herself that the time to move on has arrived, up until a case convinces her to do what’s right rather than what’s convenient. Leigh ratchets up the tension from the start and very much like every episode of a TV crime series, begins the show with the panicked pants of a potential victim who flees an unknown killer, who surprisingly, acts uncontrollably because of his own self-preservation instincts. But what looks like a simple teenage case of murder unearths a whole load of secrets and several twists that I didn’t see coming, which made the ride more exciting. I liked both Morgan and Lance together, and loved their partnership which seems to bode very well for the next few books that Leigh has in mind. Morgan’s strong sense of justice appealed to me deeply, especially when it came to her determination to see a falsely-accused teenager out of jail for a crime he didn’t commit while tanking her career in the process. Lance’s solid character was as well, a perfect complement for Morgan's. His broken dreams have left him a position where he hasn’t been able to be anything other than the police officer he once was, but there’s a sense of untouchable integrity and dignity about him that makes him quite a shining example of what a romantic hero should be. ’Say You’re Sorry’ is however, more focused on the suspense than romance, heavy with the potential of Morgan/Lance which sort of remains unfulfilled by the end of the book, but I’m hoping there’re more to come that will deepen this relationship between the both of them. I’m still vacillating between feeling a little cheated out of hot and heavy times and satisfied because justice is finally served, but as long as Leigh delivers these in the next few books, I’d be happy as a clam. *ARC by netgalley(always grateful, mind)"}, {"userName": "Suzanne (Under the Covers Book blog)", "userReviewDate": "May 20, 2017", "userURL": "http://www.goodreads.com/user/show/3575839-suzanne-under-the-covers-book-blog", "userReview": "I am still relatively new to the thriller genre, I like to dip my toe in every now and then, however, in this book Melinda Leigh has tempted me to belly flop right in. Say You’re Sorry captivated me from page one as you witness the murder first hand, after that, it wasn’t a want, it was a need; I needed to keep reading and find out the full story.Morgan Dane is our main character, she’s been widowed for two years and has 3 adorable small children, who she parents with the help of her father. Now, she has decided it’s time for her to go back to work as a prosecutor. But, just as she’s about to start her baby sitter is horrifically murdered and her neighbour is accused of the slaying. Morgan doesn’t buy it. So with the help of her private investigator and former high school boyfriend, she decides to take up his defence.This book is so easy to get into, Morgan is such an identifiable figure, a single mother trying to do the best for her children and now juggling a stressful job. A stressful job where she isn’t sure she’s doing the right thing. And then there’s Lance the PI assisting her with the case and a guy with some pressures of his own. The murder case itself, although interesting to follow, as soon as the murderer popped up I figured it out correctly but that didn’t stop me from enjoying the ride to get there.It was Morgan and her relationship with people, her blossoming romance with Lance, her devotion to her family, her dedication to helping Nick – the young man accused of murder – that kept me glued to the book. I can’t wait to read more in this series and I will definitely be looking up some more Melinda Leigh."}, {"userName": "Bec - Book Magic: Under a spell with every page", "userReviewDate": "Apr 28, 2017", "userURL": "http://www.goodreads.com/user/show/37085086-bec---book-magic-under-a-spell-with-every-page", "userReview": "After taking a couple of years off work to spend time with her daughters after her husband was killed in Iraq, Morgan Dane is ready to return to work as a prosecutor. Except before she even gets started in her new job, tragedy strikes in the small town of Scarlet Falls. Even worse, the crime is being pinned on someone Morgan believes is innocent and she's determined to do whatever it takes to see the right person bought to justice. Will she succeed or will she face a tough, uphill battle that could turn deadly at any time?What a highly entertaining, fast-paced, gripping read Ms. Leigh has penned in this book, encompassing well-written dialogue that kept me enthralled from start to finish; a plot with lots of twists and turns that kept surprising me and had me determined to discover what would come next; and two main characters that were determined to do what was right in seeking justice for the victim no matter how dangerous things became. The way this story started had me on the edge-of-my seat and drew me into the story immediately with what was happening, as it's palpable that any number of people could be a suspect. What would happen to whoever was in trouble? Would they be saved? As for the dialogue, it was told from several characters points-of-view and was intense due to the main characters back stories and all that they go through to prove Morgan's client is innocent. Going head-to-head with several secondary characters that are either extremely dangerous or very influential in the community should concern Morgan, but no matter what threats or scrutiny she faces, she remains loyal to her job and strong and brave in her determination to seek the truth when everyone is determined to prosecute her client just so their jobs are secure. But what I liked most about Morgan is that she didn't back down, especially when things became more and more dangerous for her, Lance and her client. While Lance, he's been through a lot in past months with having to give up working as a cop. It wasn't easy, but he's overcome it to become a very good private investigator. Moreover, I liked that he was willing to help Morgan, even though he wasn't as certain as the heroine was about her client's innocence. Yet, what I liked most of all about the hero was how protective he was of the heroine and how they wouldn't give up until they discovered the truth. Overall, Ms. Leigh has delivered an incredible read in this book where the suspense and growing relationship between Lance and Morgan made this story a real page turner. The way this story ended was a tad alarming because of the situation Morgan finds herself in, but I liked that Morgan was finally able to move on from her past and the death of her husband. And lastly, I'm looking forward to more of this series because of the main and secondary characters, especially Lance's mom, a bright woman with a serious medical condition that makes Lance continually worry about her; and Sharp, Lance's boss and a man that is determined to make everyone a health nut. The moments where he was trying to convince Morgan what was good for her had me amused. I would highly recommend Say You're Sorry by Melinda Leigh, if you enjoy romantic suspense or books by authors Kendra Elliot, Mary Burton, Rita Herron or Nancy Bush."}, {"userName": "Charlotte Miller", "userReviewDate": "May 09, 2017", "userURL": "http://www.goodreads.com/user/show/11907950-charlotte-miller", "userReview": "A young woman is brutally raped and murdered and her boyfriend stands accused in Melinda Leigh’s Say You’re Sorry. Attorney Morgan Dane steps in to defend the accused, making herself and those closest to her the targets of a community on edge and a killer determined to protect himself at any cost. Multi-layered and swift-moving, with a smart, likable, kick-ass heroine who is no one’s damsel in distress, Say You’re Sorry is the opening volume of Leigh’s new Morgan Dane series. (Advance Reading Copy obtained by request from NetGalley.)"}, {"userName": "Cindy ~ SnS Reviews", "userReviewDate": "Apr 05, 2017", "userURL": "http://www.goodreads.com/user/show/4512039-cindy-sns-reviews", "userReview": "Oh what a tangled web the author weaved in the art of deceiving. The murder of a girl opens a Pandora's box of a litany of secrets, lies and other nefarious happenings in Scarlett Falls. This new series is set in a location fans of Melinda Leigh's will be familiar with. It's a spin off of her Scarlet Falls trilogy series and features the sister of Stella Dane who was the heroine in the last book of that series. Morgan Dane is a widow who was left with 3 young daughters to raise on her own after her husband died in Iraq. She's recently moved back home to Scarlet Falls to live with her grandfather who helps with the girls. After two years of taking a break from her job as an assistant DA to grieve, she has decided to go back to work in the same field but before she starts her plans get derailed when she decides to be the lawyer for a 20 year old family friend who has just been accused of viciously murdering his girlfriend. She enlist the help of a childhood friend, Lance Kruger who is currently working as a Private Investigator for Lincoln Sharp. Great start to the series with a strong female lead who uses her intelligence to solve problems, can psychically take care of herself but yet also isn't afraid to show a vulnerable side. Lance is also a strong leading male character but without being to over the top alpha. He and Morgan work great together along with Sharp and I look forward to seeing them solve more cases together in future books."}, {"userName": "Rachel (TheShadesofOrange)", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/7487619-rachel-theshadesoforange", "userReview": "3.0 StarsThe first two chapters of this novel were utterly gripping. The author immediately caught my attention with that suspenseful and frightening opening sequence. Needless to say, I was quite excited to read the rest of the novel. Unfortunately, by chapter three, the novel transitioned to the kind of average mystery story that I have read many, many times. The story is told through multiple perspectives. By far, the strongest perspective was from the unnamed murderer who was compelling and, at times, even sympathetic for a villain. This perspective was intentionally cryptic in order to keep the identity of the murderer hidden from the reader until the final reveal. The writing started out strong with vivid descriptions in those initial chapters. However, later on, the writing became weaker. Specifically, the writing was repetitive, as the author reused the same phrases too often. The characters were fairly decent and interesting. The female lead defense attorney sometimes acted as a strong, independant woman and other times became emotionally fragile. My main complaint stems from my dislike of romance in mystery novels. There was too much emotional elements in the story for my personal reading tastes. I felt that the romance diluted the suspense and atmosphere of the story.The mystery itself was decent with several potential leads. The main investigation was conducted from the perspective of the defense attorney and private investigator, which provided a break from the traditional police perspective. The ending was not particularly obvious and fairly satisfying. Personally, I prefer reading darker, less emotional mysteries. However, I would recommend this novel to readers who enjoy mysteries with a healthy serving of clean romance.I (accidentally) requested from Netgalley and decided to read this anyways out of respect for the publisher & author."}, {"userName": "Britton Epps", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/19591097-britton-epps", "userReview": "Started off really strong. The ending kind of came out of no where to me. Just kinda wrapped up all of a sudden. Four stars for the first half and three for the last half. 3.5 total"}, {"userName": "Marleen", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/1616365-marleen", "userReview": "As a suspenseful romance, Say You’re Sorry, was a rather captivating read, especially since Melinda Leigh is new author to me. Her characterization of the main leads was compelling. I liked Morgan Dane, widowed mother of three young girls, who were particularly cute, and came across as genuine. I also liked Lance Kruger, former police detective, turned PI, who takes care of his mentally fragile mother.As Morgan is about to sign her new employment agreement with the DA’s office of Scarlett Falls, NY, the murder of teenager Tessa shakes up to town. Morgan knew Tessa, who babysat for girls every Friday. What is worse is that the DA’s office is very quick to arrest Nick, Tessa’s boyfriend and Morgan’s young neighbor. Morgan is absolutely convinced that Nick is innocent, and since she has not yet signed up for the ADA job, she decides on the spot to be his defense lawyer.The story unfolds as Morgan, Nick and his PI boss, Sharp, wade their way through a maze of possible witnesses and suspects; other young people who were at the lake the night Tessa was murdered. They interview them all with alternating success. It becomes clear to them, the closer they get to the truth, the more dangerous it gets. There are some pretty unstable people, and some unsuspected perverts living in this quiet little town in upstate NY.Overall, a very enjoyable read, without going too deep. The budding romance angle between Morgan and Lance was a bit repetitive and naïve at times, but that’s better than the alternative.I can’t wait to read what Melinda Leigh does with the sequel. (***3,5***)."}, {"userName": "Reen", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/5250236-reen", "userReview": "Excellent start to a new series! Former prosecutor Morgan Dane and her three little girls return to her hometown of Scarlett Falls following the death of her husband in Iraq. As each day passes, Morgan takes another step in her new life without him. Her young babysitter is found murdered and her neighbour's son Nick is accused of her murder. Morgan cannot believe that Nick is the killer. He has been in her home many times, playing checkers with her father, playing with her daughters. When Nick's father asks for her help, she agrees to defend him and loses her job offer from the DA's office. Morgan's decision turns neighbours and the community against her and she turns to her friend Lance Kruger, an ex-cop turned investigator, to help her. As they investigate the girl's friends and school mates, it becomes apparent that there are many secrets in this small town. This was a well-crafted story, with a logical process of investigation and good character development. The author portrays Nick's determination to survive prison and remain strong in a way that has the reader rooting for him and drawing compassion from his strength. I really enjoyed this book and the way Morgan and Lance work together. Their mutual attraction is something Morgan is not yet comfortable confronting and Lance is very patient with her. It was a bit of a cliché that the police felt it was an \"open and shut\" case but it did further the story. The killer is revealed but it is not who you think it is."}, {"userName": "Donna", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/41955054-donna", "userReview": "Morgan Dane's husband died from an IED in Iraq two years ago. Since then, Morgan moved back to her home town of Scarlet Falls, NY to live with her retired cop grandfather and take care of her 3 daughters who are all under 6 years old. Her babysitter Tessa is missing, and while looking for her, Morgan and her friend private investigator Lance Kruger discover her body near the lake. Tessa has been sexually assaulted and stabbed to death. Morgan's next door neighbor Nick is charged with the crime. Morgan doesn't believe he could be guilty so she agrees to defend him. Morgan hires Lance's private investigative firm to help her find out the truth behind the killing. She becomes the second most unpopular person in town by believing Nick is innocent and puts her own life in danger as the real killer is still free.Most of the characters were likeable and the book was easy to read. The chapters alternate in points of view including the killer's. I had him on my suspect list along with several others but I wasn't sure until the reveal at the end of the book. I received a Kindle copy of the book in a Goodreads giveaway."}, {"userName": "Gloria Bernal", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/1066448-gloria-bernal", "userReview": "3.75 starsBook one features character Morgan Dane, an attorney who is about to take a dream job with the DA's office. This was quite good, kept my interest. Moved along at a good pace. I expect I will want to read more in this series about a military-widow and mother of 3 young girls who is presently working in the legal arena and lives with her elderly father-in-law and her girls. She was offered a dream job as a prosecuting attorney but turns it down to take on the defense of a young man who is her neighbor and family friend. He is accused of murdering her baby-sitter. Morgan believes he is innocent and defends him pro bono. Her side-kick has a crush on her and agrees to help her gather info and work the case through the security company he works for. The characters are well fleshed out, and the structure well crafted. I was pleasantly surprised by how Ms Leigh has improved since I read one of her novels a ways back. Definitely recommend to fans of legal drama."}, {"userName": "Megan Luker (Page After Page Book Blog)", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/56768566-megan-luker-page-after-page-book-blog", "userReview": "I absolutely loved this book! You can find my Double Review of both Say You're Sorry and Her Last Goodbye, the second book in the series, here!"}, {"userName": "*Avonna", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/5428424-avonna", "userReview": "Check out all of my reviews at: http://www.avonnalovesgenres.comI am so excited that Melinda Leigh is writing a spin-off of her wonderful Scarlet Falls trilogy. SAY YOU”RE SORRY (Morgan Dane #1) takes me back to one of my favorite fictional cities. Morgan Dane returns home to Scarlet Falls with her three young daughters after the death of her military husband in the Middle East. Living with her grandfather and a teenager rescued in a previous Scarlet Falls book, two years has passed and Morgan decides to return to work as an ADA. She wants to start moving forward at least professionally with her life.Lance Kruger was an SFPD officer, but is currently training to be a private investigator while recovering from a gunshot wound. His mentor, Lincoln Sharp started his own P.I. agency after retiring from the SFPD. Lincoln is more than just the ex-detective who worked Lance’s missing father’s case, he has been a father figure and an enormous help with Lance’s mother.When Morgan’s sometimes babysitter, Tessa is found raped and violently murdered, the blame falls on her boyfriend, Nick. Nick is Morgan’s young neighbor who plays chess with her grandfather and reads to her girls. Even though the evidence is strong, Morgan just cannot believe Nick is guilty. Morgan turns down her ADA job and decides to not only defend Nick against false charges, but to find the real killer with the help of Lance and Lincoln.This book takes off and keeps a fast pace throughout. With multiple suspects there are many unexpected twists and turns in the plot. As you turn the pages to find justice for Tessa, many other small town secrets become unearthed. You also follow the story through both Morgan’s and Lance’s points-of-views, with some internal insights from the killer and Nick’s time in lock-up. I loved the multiple views because they pull you into the head and intense emotions of each character in every situation.I was happy to learn from the author that there are at least four more proposed books for this series and Morgan will continue being the main character. This book has the beginnings of a new romance for Morgan with Lance and I am looking forward to its progression. I love a series that not only gives me great thrills and/or mysteries, but I get to follow a couple that I want to succeed in love.I am looking forward to the next book and a return to all of these great characters!Thank you very much to Montlake Romance, Melinda Leigh and Net Galley for allowing me to read this eARC in exchange for an honest review."}, {"userName": "Debra Webb", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/5391196-debra-webb", "userReview": "I enjoyed this book very much! Lots of twists and turns and a terrific heroine!"}, {"userName": "Trish R.", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/23070724-trish-r", "userReview": "Only OK for me.. Possible spoilersI have to admit I did have to skim through all the jail stuff with Nick. I just couldn’t read about his fear and on-coming depression over everything that was being done to him when he was innocent, and he was only 20 years old. And I was thinking if the author kills off Nick while he’s in jail I’ll never read anything by her again. I’ve read/listened 10 or 12 of Melinda Leigh’s books but I was a little concerned when I got to Nick’s arrest. I was totally shocked at who paid to have Nick stabbed while he was in jail, too.It did turn out fine for Nick BUT I can’t say I was crazy about the two pedophiles in this story. The murdered girl was 18 and had been molested by the bad guy since she was 12. And the other girl was 15 or 16 and was being molested by her mother’s boyfriend, until she ran away. It might have had a little too much pedophilia for me.I was surprised at who the killer was, but that’s the way I like my mysteries.As always, there was no sex in this book but the F-bomb was used 17 times.I really like the players: Lance, Morgan, Sharp, Nick, and Bud. Stella and Brody, from other books, were in this but only for a second, which I was bummed about. As to the narrator: Another reviewer said Kate Rudd would have been a better choice for this book and I couldn’t agree more. Cris Dukehart is simply a bad narrator; I don’t care what anyone says. Her men’s voices are some of the worst. She needs a lot more practice."}], "description": "In a new series from Wall Street Journal bestselling author Melinda Leigh, former prosecutor Morgan Dane faces the most personal—and deadly—case of her lifetime.After the devastating loss of her husband in Iraq, Morgan Dane returns to Scarlet Falls, seeking the comfort of her hometown. Now, surrounded by family, she’s finally found peace and a promising career opportunity—until her babysitter is killed and her neighbor asks her to defend his son, Nick, who stands accused of the murder.Tessa was the ultimate girl next door, and the community is outraged by her death. But Morgan has known Nick for years and can’t believe he’s guilty, despite the damning evidence stacked against him. She asks her friend Lance Kruger, an ex-cop turned private eye, for help. Taking on the town, the police, and a zealous DA, Morgan and Lance plunge into the investigation, determined to find the real killer. But as they uncover secrets that rock the community, they become targets for the madman hiding in plain sight.", "title": "Say You're Sorry\n      \n          (Morgan Dane #1)", "url": "http://www.goodreads.com/book/show/33149088-say-you-re-sorry", "average": 4.0, "cover": "https://images.gr-assets.com/books/1483389348l/33149088.jpg", "reviews": 1283, "authors": [{"url": "https://www.goodreads.com/author/show/5141609.Melinda_Leigh", "name": "Melinda Leigh"}], "type": ["Mystery", "Thriller", "Romance", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/33149088-say-you-re-sorry", "http://www.goodreads.com/book/show/33255663-say-you-re-sorry", "http://www.goodreads.com/book/show/22730870-hour-of-need", "http://www.goodreads.com/book/show/35074316-her-last-goodbye", "http://www.goodreads.com/book/show/24354555-minutes-to-kill", "http://www.goodreads.com/book/show/27869656-seconds-to-live", "http://www.goodreads.com/book/show/12788229-she-can-run"]}