{"ratings": 478, "userreviews": [{"userName": "Teresa", "userReviewDate": "Jan 10, 2009", "userURL": "http://www.goodreads.com/user/show/92128-teresa", "userReview": "\"Some of us take lithium and antidepressants, and most everyone believes these pills are fundamentally wrong, a crutch, a sign of moral weakness, the surrender of art and individuality. Bullshit. Such thinking guarantees tragedy for the bipolar. Without medicine, 20 percent of us, one in five, will commit suicide. Six-gun Russian roulette gives better odds... Without them, sooner or later the bipolar brain will go bang. I know plenty of potheads who sermonize against the pharmaceutical companies; I know plenty of born-again yoga instructors, plenty of missionaries who tell me I'm wrong about lithium. They don't have a clue.\"-David Lovelace"}, {"userName": "Becky", "userReviewDate": "Dec 26, 2008", "userURL": "http://www.goodreads.com/user/show/1832988-becky", "userReview": "I am a teacher of students who have been diagnosed as bipolar. I am also a friend and family member who has had first-hand experience with the conflict that occurs when faith collides with an illness that is difficult, if not impossible, to understand/explain/treat/cure. As such, I found this book invaluable. The author poignantly depicts the effects of this illness on his own life as well as the lives of his family and friends. He is brutally honest, as well as thoughtful and thorough. It is a must-read for anyone who wants to honestly understand this illness and it's effects. As a personal aside, I also grew up going to Peniel, and the author's depiction of the camp is every bit what I remember it to be, down to the songs sung at the Olive Yard, in a much more innocent time."}, {"userName": "Paul", "userReviewDate": "Oct 01, 2008", "userURL": "http://www.goodreads.com/user/show/1261510-paul", "userReview": "I was curious to read this book as the author and his siblings were former students of mine. The style is very poetic, yet very raw. He masterfully describes what it is like to live with bipolar disorder - and further to be surrounded by loved ones with the disorder. David's life is not one that any of us would want to live, but I found him to be a compassionate individual with a wonderful heart and an astoundingly clear knowledge of his issues. He fights bravely, if not always wisely, against his demons. I would certainly recommend this book to all, but especially to those with a relative or friend with bipolar disorder. It will open your eyes and touch your heart. Grade: A"}, {"userName": "Jenn", "userReviewDate": "Feb 09, 2009", "userURL": "http://www.goodreads.com/user/show/1920671-jenn", "userReview": "When I was growing up in Hamilton MA, the Lovelace family was always around. My mother worked at the seminary where Richard Lovelace was a professor and Jonathan was a grade ahead of me. When I was a junior in high school, the grapevine reported that Jon Lovelace had to be taken away because of a \"chemical imbalance\". I remember his best friend being hounded on the bus for having a \"nutcase\" for a friend. So, finding this book was amazing since everything hapened in a time where no one talked openly about bipolar disorder, especially in blue-blooded Hamilton. I've run into David twice out in Western MA and he was really nice to talk to and his bookstore, The Montague Bookmill, is really cool."}, {"userName": "David", "userReviewDate": "Sep 03, 2010", "userURL": "http://www.goodreads.com/user/show/3982247-david", "userReview": "May be biased - I was one of David's \"three friends\" mentioned on page 85 - but this is a wonderfully written heartfelt memoir. And it explains a lot about those halcyon days in 1970s Hamilton, MA, in the shade Gordon Conwell Theological Seminary; and what all happened to David (and his oft kooky and storied family) after we'd lost touch - quite an odyssey he's had. Great spot on descriptions of our adopted friend \"William Beck\" (a pseudonym, no doubt a prophylactic insisted upon by the publisher's legal department :)"}, {"userName": "Hayley Chwazik-Gee", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/57438219-hayley-chwazik-gee", "userReview": "This memoir offered a brief look into the mind of an individual with bipolar disorder and a dysfunctional family with varying degrees of mental illness. It highlighted an interesting cast of characters suffering the crippling effects of mental illness, but I had a hard time following some of the fragmented stories and secondary characters."}, {"userName": "Anastacia", "userReviewDate": "Dec 05, 2008", "userURL": "http://www.goodreads.com/user/show/49938-anastacia", "userReview": "For whatever reason I seem to be drawn to memoirs, and lately I've found myself disappointed in so many of them. They're completely unbelievable, poorly written or just bad. Scattershot was definitely *not* one of those books for me. Though the subject matter is sad and it's sometimes tragic, it's never unbelievable, as the author weaves in all those feelings we all have with family - tenderness, guilt, duty, love, and coming to terms with the faults and \"isms\" of our families. I was very pleasantly surprised by this memoir. It's funny and touching at the same time and well written throughout. That written, not everyone will enjoy this book. Those who are not intrigued by psychology or mental illness will not relate to Lovelace and may not finish. Subjects include family, mental illness, bi-polar, depression, the author's struggle with BPD and his \"recovery,\" and watching helplessly as it overcomes his family members. If you enjoy memoirs and are drawn to issues concerning mental illness, this is a great read that's both humorous and poignant."}, {"userName": "shannon madden", "userReviewDate": "May 26, 2011", "userURL": "http://www.goodreads.com/user/show/904321-shannon-madden", "userReview": "The memoir was more focused on the author himself, but of course with family anecdotes tied in. The stories managed to be humorous despite their heaviness and tragedy - a combination that reminded me of the tone of The Glass Castle.I was interested in reading this because of my own family's experiences with bipolar disorder. Although my family (as a whole) and family members' individual experiences were quite different from those described by Lovelace, I'm glad I read this. Lovelace insight blends personal experience with an educated understanding of the disease, and I found that worthwhile."}, {"userName": "Nancy", "userReviewDate": "Nov 10, 2008", "userURL": "http://www.goodreads.com/user/show/1265481-nancy", "userReview": "Absolutely the very best book I have ever read about bipolar illness. Most books are either full of statistics or unrealistic expectations of recovery or disappointment. This is the only book I have read that actually deals with the feelings of the author, who lives in a family that suffers from multiple bipolar illnesses (including his own). How he manages to deal with both his father and mother's symptoms, as well as his own and later on, his younger brother's, is a measure of the author's strength of character, compassion, and sense of humor. I would recommend this book to anyone who has had anything to do with bipolar illness, or is interested in learning what people with this mental illness go through. It is a wonderful book, full of hope."}, {"userName": "Donovan", "userReviewDate": "Jan 04, 2012", "userURL": "http://www.goodreads.com/user/show/125347-donovan", "userReview": "One of the best memoirs I've read in a while, David writes with humor, insight and transparency. He shares his own manic life and for those of us who have had experienced our own \"craziness\" in our families, it feels good to know we are not alone."}, {"userName": "Melanie", "userReviewDate": "Mar 06, 2012", "userURL": "http://www.goodreads.com/user/show/136210-melanie", "userReview": "This memoir was entertaining and enlightening. It covers some dark stuff, so it doesn't make for light reading but I m glad I read it."}, {"userName": "Tobias", "userReviewDate": "Jan 03, 2010", "userURL": "http://www.goodreads.com/user/show/297977-tobias", "userReview": "Lovely book painting a picture of highs and lows - inner realms and outer. I can relate having a bi-polar parent."}, {"userName": "Mandy", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/5446474-mandy", "userReview": "A very solid memoir. David writes about his family and their highs and lows very poignantly. As always, I'm a bit biased because I'll read anything about bipolar disorder. I highly recommend it to anyone connected to mental illness, especially bipolar. I have to say though, after such in-depth descriptions about the lifelong breakdowns of not only himself, but his mother, his father, AND his brother who all have bipolar disorder as well, I can't believe he spoke so flippantly about his decision to have children. I guess he didn't have to consider the fact that women can't take mood stabilizers like lithium while pregnant without risk to the fetus, because after a whole book of terrible stories about their mental illness and the hell it put their family through, he seems to suggest that the availability of medicine makes it a negligible risk. That didn't sit right with me at all. Altogether, I loved his stories and his writing style. It felt very honest and real and I was also really jealous of all the cool things he got to do while running away from life. I'll be looking out for other books of his."}, {"userName": "Sally Lovelock", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/40220317-sally-lovelock", "userReview": "I think I may have read this book before as the story was very familiar. A good insight into the terrors a whole family of people with bipolar experience. Devastating at times but for someone who has no idea or experience of bipolar, this book is a good education. The religious part drags in parts."}, {"userName": "Lisa M.", "userReviewDate": "Oct 03, 2014", "userURL": "http://www.goodreads.com/user/show/3695735-lisa-m", "userReview": "My on/off friend from college took me to a used book store that is legendary in our home state. She told me she had credit and was willing to buy me whatever I wanted - this was part of my haul. The book only came with the title and headline, and a few reviews on the back; there was no summary to give me an idea of what to expect, beyond \"My Bipolar Family.\" I decided to purchase it because several members of my family, including myself, have been diagnosed with bipolar disorder (and several other diagnosis.) I am very happy I purchased this book. The family portrayed is haunted by mental disorders - each person who suffers, suffers severely. Mrs. Lovelace has severe postpartum depressions that last for years, and religious paranoia. Mr. Lovelace is bedridden for years due to depression, and his feverish manias fuel religious hymns. The eldest son switches from bedridden and unable to feed himself to a man so manic he rearranges his friends' whole apartment. The youngest son follows a similar inactive depression, yet his mania is anger fueled and he makes a cape and beats the shit out of a neighbor. Good stuff. I'd like to note that not every case or every family with several cases is so haunted by mental illness - this is a family with a very bad genetic lottery.It was interesting to see how the eldest son, the author, was influenced by his father's illness. His father fell ill before the two sons, and as he experienced his first mania, David began to realize what his illness really could entail. I felt I could really, really identify with David's struggles when it came to accepting his disorder - and the many games we play to stop using treatment/justify going off treatment, and the humiliation that occurs when others see us at our \"mad\" moments.I did not agree with all of David's arguments - his struggle with hospitalizing his manic father, for one - I do not think others should have the right to hospitalize someone unless they are going to harm themselves/others (although I am surprised the neglect of his mother at that time did not constitute as \"harm\" and no legal ramifications came of that) but I understood his struggles. The amount of humiliation he felt, that drove him to close his bookstore, seemed an overreaction to me. One manic incident over years and you're done? Also, it was so dangerous when Roberta told him to get off of his meds ... I took issue with that, too. But, those are issues/disagreements with the author, as opposed to criticisms of the book itself.Overall, the writing style was good. At first the opening scenes seem like they may be the craziest of the whole book, but it becomes clear that David's story of his bipolar disorder is not the only thing interesting here - he's led a very interesting life. He bums around South America and squats in New York. I'd suggest this for anyone with a genuine interest in the experience of someone with bipolar disorder, anyone with bipolar disorder, or anyone who wants to read about a punk rock guy with some life struggles. Overall a very good book."}, {"userName": "Aili", "userReviewDate": "Jun 17, 2008", "userURL": "http://www.goodreads.com/user/show/113969-aili", "userReview": "David Lovelace, his father, mother, and younger brother have all been diagnosed with bipolar disorder. Only his younger sister seems to have dodged the bullet. But bipolar disorder was not well recognized, nor were there very good treatment options, until the mid-1990s. So David and his family spend years struggling and hurting themselves and each other. This memoir is Lovelace's attempt to educate the lay public about his disorder and to caution his fellow sufferers (and their families) from thinking that they can \"beat\" their diagnosis.Based on the cover and blurbs, I was expecting this to be a rollicking! crazy! time! on the model of  Running with Scissors, but instead this is a sober, personal, and chilling window into the life of someone with a serious psychiatric condition.Lovelace comes from a Christian fundamentalist religious background (his father was a Presbyterian minister; his parents met at a Christian revival summer camp) in which individuals were taught to wrestle with their demons and pray for salvation. As an adult, he rejects religion, tries to self-medicate with various illegal drugs, and eventually wholeheartedly embraces modern psychiatry, though his relationships with lithium and antipsychotics can at best be described as love–hate.Generally Lovelace does an excellent job of owning his life decisions, even though he's made some major mistakes and is frequently narcissistic. That's probably the best thing about the book; phrases like \"unflinching portrayal\" come to mind. His illustration of his family's religious tradition was also pretty fairly presented (given that he has since forsworn it) and informative. I would have liked more insight into his siblings' experiences (for example, his sister avoids bipolar disorder but grows up to be a therapist -- no issues there!), but the author is clearly focused on describing his own lived experience.My only other major criticism is that Lovelace periodically slows down the narrative to discuss the history and characteristics of bipolar disorder; I found these digressions pedantic, but then I have a pretty good working knowledge of current psychiatry and so may not be his target audience.Overall: chilling; quick read; good for those interested in mental health, memoirs, and family dynamics, or to throw at relatives who don't understand psychiatric diagnoses[This isn't out 'til August/September, but I grabbed a free uncorrected copy sent to us at work. \"Bible\" was sometimes uncapitalized.]"}, {"userName": "Sue", "userReviewDate": "Jan 06, 2012", "userURL": "http://www.goodreads.com/user/show/4481148-sue", "userReview": "This is the kind of book that saying, \"I really liked it,\" makes me feel as if I'm saying, \"I really liked that train wreck.\" The words in the Goodreads rating system just aren't appropriate to the situation, but that's what I've got to work with, so . . . I really liked this book.The author describes in vivid detail what it was like to grow up in a family in which BOTH parents suffer from mental illness -- a genetic legacy that they unwittingly gift to two of their three children, including the author. He also describes as best he can -- and this is the real strength of the narrative for me -- what it feels like to be an intelligent person who, in spite of his intellect and his talents, cannot stop his own descent into madness. (And I would note here that the word \"madness\" is the word the author uses; he states frankly that the term manic-depressive -- which was the diagnostic term used in the 1970's -- is really, in his opinion, a polite term for an utter chaos of the mind, i.e., madness.) And he should know -- the decisions and behavior that he chronicles in this book, both his own and that of his family, are chaotic at best and dangerous at worst.I read this book because I have known and been close to several persons who have suffered from bipolar disorder (though, thankfully, not to this degree) and I wanted to get a better handle on what they as individuals experience when their illness is not well controlled. This book did provide that, and for that I am grateful.My only criticism of the book is that the author does not provide background information about bipolar disorder in general in his book, and that would be useful to the reader, especially the uninitiated reader. Though perhaps, in this age of quick access to information on the Internet, he felt that anyone interested in knowing more about the medical aspect of the disorder could find it. What this book does provide is a front row seat to the human drama of mental illness."}, {"userName": "Beth Peninger", "userReviewDate": "Sep 20, 2012", "userURL": "http://www.goodreads.com/user/show/4850999-beth-peninger", "userReview": "My rating is most likely because I found the book to be...disturbing...frustrating...slightly unbelievable. Except I am sure it all is completely believable to those who have lived with and witnessed bipolar. As Lovelace begins to explain his family history I thought to myself, \"What are the odds that his parents found each other, married, and both have bipolar? I mean really what are the odds? And do his parents truly both have it or does one have something different that looks like it?\" Those were/are just a few questions I had throughout the reading of David's memoir. His family history is a little frightening - on both sides - and it just makes you wonder what the heck happened in the gene pool for all of this to rise to the surface. I don't say that to sound unsympathetic or cold, it's just a curiosity. Lovelace chronicles how bipolar made itself known in the lives of his immediate family. He takes us on a journey of his particular struggle to deny its existence and then finally his resignation to accept it. I think what frustrated me was he knew he was unhealthy and yet did unhealthy things that only made it worse. Almost like inviting disaster. Is this typical of people who have bipolar? It was okay. I felt bored through the middle section of the book. It was David's accounts of his crazy efforts to outrun his family and bipolar. And I wasn't all that fascinated by his efforts, just bored. Maybe it's just me. Maybe if I was more intimately acquainted with bipolar because of a loved one or myself I would have been more taken by this account."}, {"userName": "B", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/343940-b", "userReview": "Such an honest account of bi-polar disorder. I’ve never heard anyone talk so openly about the creative aspect of folks who are bi-polar and I have experienced it first hand. There’s something seductive about it, it’s a place you almost want to get to in some ways, that manic creative place. It’s also scary as hell, but the creativity is real. People often shy away from these conversations when talking about mental illness, but there is a reason people go off their meds. It’s to get to that spot. Because there’s something beautiful about it. Unfortunately, it’s also dangerous. This guy is also super nice and if you go to his book bar in New Hampshire he will simultaneously sell you a vintage children’s book and serve you a cappuccino while you blush because YOU READ HIS BOOK AND KNOW SO MUCH ABOUT HIS PRIVATE PERSONAL LIFE BUT HE’S SO NICE AND NORMAL AND SERVING YOU GOURMET COFFEE."}, {"userName": "Christina", "userReviewDate": "Nov 11, 2008", "userURL": "http://www.goodreads.com/user/show/140443-christina", "userReview": "We read this in Book Club for \"National Mental Disorder Month\" or something like that, and this book was really great. This memoir focuses not only on the author, but on his other family members and their lives as well. The book also focuses on the family as a whole, and how they are affected by four of the five members having biopolar disorder. It's a very good weaving of the different characters and elements of the family, and you leave with an absolutely clear picture of the family (special thanks to the real-life photo on the cover) and, more importantly, a vivid understanding of what it means to live with biopolar disorder.The author expertly describes his manias and depressions (although, fairly, the manias better), and brings you into his mind, life, and illusions as he's caught in the throes of the disease, pre-medication. Parts are hilarious, parts are heartbreaking, and it's entirely informative and entertaining without ever once becoming sentimental. I feel like I've met the family, feel like I grew up with them, and feel like I once experienced a bipolar mania. It was AWESOMELY well-written, and I literally couldn't put this down. One of the better books I've read in a long time."}, {"userName": "Lesley", "userReviewDate": "Oct 13, 2012", "userURL": "http://www.goodreads.com/user/show/9969530-lesley", "userReview": "An invaluable and nuanced contribution to understanding the manic experience ... One of my favorite passages from the book where he talks about the fine and often dangerous, invisible line between mania, transcendence and art: “There’s a transcendental romance to mania, to this drawing together. And I believed, still believe, that this mania is true, that the scattershot visions of madness are holy. They are also fucking crazy and hopeless and sad. At its core the transcendental manic experience remains one of great loneliness. It transcends, but rarely translates. True visions find their validity in the universal, the spiritual, but these visions are poured into each cooking scull, one at a time. You’ll burn down before you can share them. The face of God blinds and it burns, make no mistake. Approach these breaks in a sentimental fashion and you’ll find yourself seduced by nervous, chattering ghosts, maybe lost their for good. Worse, put your vision in a pulpit, wrap it up in some patchwork doctrinal robe, and you’re absolutely finished, done.” Would really love to read some of David Lovelace's poetry but haven't been able to locate ... A great talent and the book an important and lasting contribution."}, {"userName": "Peachy", "userReviewDate": "Dec 09, 2009", "userURL": "http://www.goodreads.com/user/show/2095554-peachy", "userReview": "It was mildly entertaining at the best of times and a struggle to make it through at the worst of times, when reading Scattershot. This is the true story of a family severely affected by bipolarity, to the tune of four out of five members being afflicted. I did learn a bit more about the illness through the episodic writing, but felt the lack of flow made it a less than enjoyable read when waiting for a real story to emerge. However, life stories don’t always have a proper flow, and certainly not if you’re manic depressive, so I can’t fault it too much in that regard. Considering that statistics show that 1 in 5 sufferers of bipolar disorder will commit suicide, a point that David Lovelace brings up a couple of times throughout his book, it is evident how strong the Lovelace family was (at least by the printing of this memoir) to have not have taken any of their own lives. Unfortunately I was so bored in some parts of the book that I contemplated taking mine..."}, {"userName": "AJ LeBlanc", "userReviewDate": "Oct 22, 2008", "userURL": "http://www.goodreads.com/user/show/1091417-aj-leblanc", "userReview": "This book is fantastic. The guy who wrote it used to own the Montague Book Mill which makes it extra cool.David Lovelace is the oldest of three kids. Both of his parents are bipolar. He's bipolar. His brother is bipolar. The only one who missed out on the fun is his sister, and she goes on to college to study psychology.The story bounces around from his childhood to present time, covers his parents' lives, his time in college, and everything else. He details his own depression and watching it take over his parents and brother. He touches a little bit on the science of the brain and how meds work, but mainly keeps to how the meds work for him personally.I've only got a few chapters left and it's been a great read. I really like how he shows the illness from so many points of view. He especially does a good job at capturing what it's like to be in the highs and the lows."}, {"userName": "Shellie (Layers of Thought)", "userReviewDate": "Feb 06, 2009", "userURL": "http://www.goodreads.com/user/show/1987170-shellie-layers-of-thought", "userReview": "Scattershots is a sad/yet \"realistic perspective\" of a man whom has grown up within a family, including himself, which all but one has a chemical brain imbalance. They are also very religious, which compounds the situation in many ways. All of the afflicted Lovelaces have delusional religious experiences.Lovelace describes his descent into madness/mania in depth. This to me was a bit overdone - however it portrays the intensity of his experience from an almost poetic perspective. It gives the reader a sense of what it is like to manic and the feeling of power that it gives.I enjoyed this book and would recommend it to someone who enjoys memoirs, anyone whom is interested in mental illness, anyone whom has a family member who is experiencing this disease, or someone who is interested in realistic situations which are akin to a train wreck where one cannot look away."}, {"userName": "Laurie", "userReviewDate": "Jul 28, 2014", "userURL": "http://www.goodreads.com/user/show/3447650-laurie", "userReview": "Wow. Unlike any memoir I (or you) have ever read. David Lovelace is gifted, lucky, funny, honest, and bipolar. In fact his whole nuclear 1950s family is - mom, dad, and younger brother - only his sister did not inherit this disease. And it IS, as David points out, a DISEASE - a malfunction in the circuitry and chemicals in the brain. Counselors can be invaluable, but without medication, the prognosis is poor and the chance of commitment is high. There is too much focus on Lithium in this book, I believe - many other drugs are now successfully used to treat this disorder. (But great if it works for the Lovelace family.) David's exploits and experiences as he runs from himself and his tragically sickened family are recounted vividly and memorably. And the family's history is detailed and unfathomable at the same time. You will find this book sad, triumphant and a whole lot more."}, {"userName": "Meredith", "userReviewDate": "Oct 11, 2010", "userURL": "http://www.goodreads.com/user/show/2622508-meredith", "userReview": "David Lovelace portrays his bipolar life journey with an honest, wise eye. He gives an accurate description of life as a person with bipolar disorder, from both the \"patient\" and support system perspectives. I think this book will resonate with anyone who has experienced life with or as a \"manic-depressive.\" It *may* be helpful to read as a person who is new to the bipolar world, although I wonder if the author's prolific halluncinogenic drug use would make a newcomer (to the disease) discount the intensity of his experience. The drugs certainly didn't help him but they also did not cause the disorder. It does make you wonder about that delicate balance...how much of it is genetic? And could he have avoided the disease \"if only\" he had not _______(fill in the blank). It's the old nature vs. nurture argument but he presents it in a fresh way."}, {"userName": "Mary-Ann", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/763689-mary-ann", "userReview": "Many thoughtful and frank comments, such as--\"Some of us take lithium and antidepressants, and most everyone believes these pills are fundamentally wrong, a crutch, a sign of moral weakness, the surrender of art and individuality. Bullshit. Such thinking guarantees tragedy for the bipolar. Without medicine, 20 percent of us, one in five, will commit suicide. Six-gun Russian roulette gives better odds... Without them, sooner or later the bipolar brain will go bang.\" But also, large sections of the book are devoted to the author's escapist travels and mania-fueled misadventures--these were drawn-out and seemed to romanticize the mania phases he experienced."}, {"userName": "Shawna", "userReviewDate": "Oct 28, 2012", "userURL": "http://www.goodreads.com/user/show/1451913-shawna", "userReview": "This book really helped me understand both what it feels like to be bipolar and what it takes to deal with someone who suffers from the disease. Admittedly the story lagged a bit in the middle when the narrator was in the midst of an extended period of aimless wandering, and I began to wonder if he was ever going to return to the opening story of his mother and father's drastic deterioration. In the end, I think his wife must be a saint. To take on all that potential drama, never knowing when your husband will decide he's okay and stop taking his medications...it takes a special person."}, {"userName": "Natalie", "userReviewDate": "Jun 03, 2014", "userURL": "http://www.goodreads.com/user/show/26585430-natalie", "userReview": "3.5 StarsSo I don't know whether it is because this book is not my usual cup of contemporary/fantasy tea and it is an adult memoir on an intense topic, but this book was slow. The content itself on mental illness interests me, but several times throughout the book I was bored. I mean, David Lovelace has gone through alot in his life , but there was so much that I think was unnecessary. I have had this book sitting on ny shelf for a few years now. I am happy to now say that I have finally read it."}, {"userName": "Sally Whitehead", "userReviewDate": "Aug 09, 2011", "userURL": "http://www.goodreads.com/user/show/5874718-sally-whitehead", "userReview": "Lovelace, his parents, and his brother, all live with bipolar disease and this well written and compelling memoir gives an account of their experiences through the literal highs and lows. Darkly comic, yet resoundingly sincere, this book is, at times, exhausting. To his credit Lovelace has managed to avoid pretty much all schmaltz and psycho babble and instead delivers a real account of how he genuinely learned to LIVE with this disease.Some of the descriptions of his manic episodes are enough to leave you reeling."}], "description": "An memoir of mental illness in the tradition of the bestselling An Unquiet Mind Scattershot is David Lovelace?s poignant, humorous, and vivid account of bipolar disorder?s effects on his family, and his gripping exploits as he spent his life running from? and finally learning to embrace?the madness imprinted on his genes. Four out of five people in David Lovelace?s immediate family have experienced bipolar disorder? including David himself. In 1986, his father, his brother, and David himself were all committed in quick succession. Only his sister has escaped the disease. A coming-of-age story punctuated by truly harrowing experiences, this devastating and empathetic portrait of the Lovelace family strips away the shame associated with bipolar disorder?a disease that affects approximately 5.7 million adult Americans?and celebrates the profound creative gifts that come with it.", "title": "Scattershot: My Bipolar Family", "url": "http://www.goodreads.com/book/show/6628875-scattershot", "average": 3.53, "cover": "https://images.gr-assets.com/books/1328333247l/6628875.jpg", "reviews": 83, "authors": [{"url": "https://www.goodreads.com/author/show/1459627.David_Lovelace", "name": "David Lovelace"}], "type": ["Autobiography", "Nonfiction", "Psychology", "Health", "Family"], "outlinks": ["http://www.goodreads.com/book/show/6628875-scattershot", "http://www.goodreads.com/book/show/3464871-scattershot", "http://www.goodreads.com/book/show/6526819-scattershot", "http://www.goodreads.com/book/show/8385397-full-blown", "http://www.goodreads.com/book/show/21356721-full-blown", "http://www.goodreads.com/book/show/9541451-adult-bipolar-disorder", "http://www.goodreads.com/book/show/27110668-wyoming-s-dinosaur-discoveries"]}