{"ratings": 2915, "userreviews": [{"userName": "Charlotte", "userReviewDate": "Apr 06, 2010", "userURL": "http://www.goodreads.com/user/show/650832-charlotte", "userReview": "Set it the beautiful Adirondacks, Second Time Around, is a book that proves it is not too late to follow your dreams. The ten years following their college graduation have not been the easiest or the happiest for any of the girls. They are determined to get it right this time. When one of the girls buys their home during the college years, the girls discover that you can go home again. The money that Arden left them is just what they needed to get their lives back on track. Second Time Around is a well written novel with real and engaging characters. You learn to adore the girls and root for their success. Whether it be for their happy marriage or successful careers, you WANT to see them succeed. I thoroughly enjoyed Second Time Around. The camaraderie and friendship is something that Beth Kendrick writes well and all women can relate to. I look forward to reading more from Beth Kendrick.http://charlotteswebofbooks.blogspot...."}, {"userName": "Jessica", "userReviewDate": "Apr 22, 2012", "userURL": "http://www.goodreads.com/user/show/7475151-jessica", "userReview": "I am usually very easy to please when it comes to books and I never say I dislike one, but this book did not meet my expectations to what I thought it would be. There are several characters in this book and up to the very ending, I had a rather difficult time keeping track of each one. Although the characters all melded well with one another, their stories were weak and not fully formed. In order to completely understand each character there would have need to be more details about their lives.The story has very random points that never actually get into completion. Many things happen to each character, though we never truly see how they end up for them.The ending was rushed and left many questions still unanswered. Despite the cliches and the rather predictable scenarios, there was a good morale to the story. It is rather a shame to see that it's compilation was rather choppy and chaotic."}, {"userName": "Kimberly", "userReviewDate": "Apr 23, 2010", "userURL": "http://www.goodreads.com/user/show/2771351-kimberly", "userReview": "Four former-roommates come into a lot of money when their fifth friend dies of lupus. The money arrives just as their respective lives are falling apart, so they all end up together in a small town in their old dorm, which one of the girls is transforming into a B&B with her share of the money.There are the typical chick-lit cliches (and I don't think I'm spoiling anything by saying this): each girl finds her ideal man, each girl is a terrific success at what she chooses to do, and the theme of \"college friendship is forever\" is almost nauseatingly strong.However, there are a great many chick-lit cliches that are not in this book. These girls:* do not work in journalism or marketing (although one is a writer)* do not live in New York City* are not obsessed with fashion* are not freaking out because they are 30ish and not married* are not worrying about their weight"}, {"userName": "Luci Vieira", "userReviewDate": "Apr 29, 2012", "userURL": "http://www.goodreads.com/user/show/8501266-luci-vieira", "userReview": "This was certainly a well written, enjoyable read with likeable characters. The one problem I sometimes had was trying to keep all the girls (and their men) straight. I found the book starts off too slow and then rushes right through the interesting parts. Readable but a little bit of a disappointment."}, {"userName": "Cheryl", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/22026875-cheryl", "userReview": "A fun, light read."}, {"userName": "Colleen", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/32508646-colleen", "userReview": "This book was absolutely adorable. I wish I had more time when I was reading it. I would read for long time periods and then not for days. So good."}, {"userName": "Jennifer", "userReviewDate": "Mar 31, 2010", "userURL": "http://www.goodreads.com/user/show/2850786-jennifer", "userReview": "Second Time Around is female bonding at its best. Five women, friends since college, get together for a mini-reunion once a year. One dies, leaving a million dollars to be split between the rest. The catch? They need to use the money to follow their dreams.Each woman has a job she doesn't love. Each has a seemingly impossible dream. The money gives those dreams a chance. While changing their careers, the women are forces to deal with personal problems ranging from guilt over accepting their dead friend's money, infertility, poor choices in love and one is haunted by a secret she has kept for over a decade.Second Time Around is full of fun and sorrow, potential and regret, hope and fear. It really makes the reader question what they would change in their lives if given $250,000. Imagine the possibilities. The enduring friendship of the four women left mourning their friend is inspirational, a wonderful example of what friendship between women should be.Beth Kendrick has written a book that does what all books should do. She put ideas in my head. She made me consider my life. She gave me something to think about. The message that life is too short to waste time on things you don't love is an important one and it couldn't have been written more beautifully. Second Time Around is chick-lit that focuses on the whole of a woman, not just her romantic life. I would love to see more books of this nature and highly recommend Second Time Around to any woman willing to reexamine where her life is headed. Funny, entertaining and meaningful - Second Time Around hits the trifecta."}, {"userName": "Anissa", "userReviewDate": "Apr 29, 2012", "userURL": "http://www.goodreads.com/user/show/7538688-anissa", "userReview": "I picked this up because it's been sitting on my bookshelf for too long. It's chick-lit & for what it is, it's fine. I think I have officially outgrown this type of chick-lit. It felt very much like a Lifetime movie & by that I mean, you have your standard main characters & you know that it's going to end pretty tidily. There's nothing wrong with that in & of itself but I am beyond finding that very satisfying at this point. All other things being equal, I'd have rather read a Maeve Binchy novel. I read it but it's no longer my kind of read & frankly, is entirely forgettable."}, {"userName": "Lauren Stahl", "userReviewDate": "Feb 08, 2010", "userURL": "http://www.goodreads.com/user/show/3204582-lauren-stahl", "userReview": "I couldn't wait to read this book and was extremely happy to win it on Goodreads!Once again Kendrick did a great job of drawing the reader into the stories of her characters. The characters were strong women, who I could relate to and probably many others can relate to as well. From the first page of the book to last it was hard to put the book down and I found myself staying up late at night to try to finish. A great success by Kendrick, well done."}, {"userName": "Tenna", "userReviewDate": "Aug 20, 2010", "userURL": "http://www.goodreads.com/user/show/1452854-tenna", "userReview": "I really enjoyed this book and watching the characters develop and grow. I especialy liked all the history between the girls and couldn't wait to find out how the story turned out. I look forward to reading more of Kendrick's books."}, {"userName": "Tracy", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/12946829-tracy", "userReview": "A book about English majors--how could I not like it?! A fun, easy read. Perfect for the beach or pool."}, {"userName": "Kaley", "userReviewDate": "May 01, 2011", "userURL": "http://www.goodreads.com/user/show/4827535-kaley", "userReview": "I was lucky enough to win this (signed!) book from Liz and Lisa over at Chick Lit is Not Dead last September when I commented on their post \"What's on Beth Kendrick's Bucket List?\". I had read Kendrick's book Nearlyweds the summer of 2009 and absolutely loved it so I decided to try to win Second Time Around. And what do you know? I actually won it! Amazing.Now that you know how I came across this novel, let me tell you that I loved, loved, loved it. I had a gala event that I was planning for work this past weekend and reading this book was a fantastic escape. I was incredibly stressed out so the fact that I was able to focus on the characters and the story really shows how great this novel was. It was also a particularly delicious experience to read this book while laying in my hotel room bed the morning after the gala - massive weight off my shoulders, a great book, and an incredibly squashy and comfy bed. Heaven.If you've ever wondered what would happened if you had done something differently (and come on, who hasn't?), you'll really enjoy this book. These four friends get the chance to change their lives and, as cliched as this sounds, find happiness. Each of the four women have a chance for a mini do over in their lives when they inherit $250,000 and each of them handles it in different ways. The four friends are the key to this novel so I want to give a little peek into how they deal with their new situations.Brooke is the sensible one of the bunch who decided to stay in their college town and is working at the alumni office. When the money comes to her she decides to jump right in and do what she's always wanted.Cait is working as an English professor and is hoping for tenure. She's always wanted to write a novel but even with this money, she can't quite seem to take the chance. Suddenly her situation changes at the college she's teaching at and she finally runs out of excuses. Jamie is the wild girl who always does what she wants and everyone else be damned. Guys come and go and she seems to be content with her job as a bartender - until her boss refuses her time off and she quits. In typical Jamie fashion, she falls headlong into her dream job when she's visiting Brooke. Then there's Anna. She's the only married one of the four but things are not all sunshine and lollipops. She and her husband have been trying for a baby for years and it has finally taken a toll on their marriage. He has to go oversees for work so she decides it's a perfect time to visit with the girls at Brooke's place and it's there she rediscovers her passion for baking.This book has everything - laughing, crying, loving, fighting, playing, and thinking - and it's all wonderfully woven together. The characters are all well rounded and incredibly likeable. I like that none of the women are perfect because, really, who is? The great thing about having this many different characters is that there's usually one that you can really identify with. In my case it was Cait. I can't quite put my finger on why but hers was the story that I always enjoyed going back to. Not to say that I didn't like reading about the other women, because I did. I actually wanted to be friends with them. And I think that is a key thing. These women have a friendship that all other females envy. Ten years ago they met in college and have stayed in touch ever since. While they may be living in different parts of the country, they still manage to see each other at least once a year and always pick up where they left off. They're doing better than some of my friends and I and we're all (for the most part) in the same province! Hence, the envy.I also think the setting is key. The four friends are back in their college town, which is a quaint, stereotypical upstate New York college town. For me, this was the kind of place that I always thought of when I thought about going away to university. The cover also helped convey what the setting was going to be like as well. There's nothing like seeing some Muskoka chairs, one with books on it, surrounded by green space. I think there also may be some sort of deeper meaning behind the setting. Perhaps Kendrick had all the women end up in the same town they went to college in for a reason. I think it might be because that's when things started to change and they began to make \"real\" decisions for the first time. I may have gone waaaay too deep for this novel, but it's an interesting thought.I highly recommend this book because it really is everything that chick lit should be. Compelling female characters, great friendship, a little bit of romance, and a journey. Do you really need any more convincing? Find this novel in some way or another and read it. You won't regret it."}, {"userName": "Christina (Confessions of a Book Addict)", "userReviewDate": "Mar 21, 2010", "userURL": "http://www.goodreads.com/user/show/2418140-christina-confessions-of-a-book-addict", "userReview": "I was drawn to the premise immediately. A group of English majors and best friends who graduated ten years ago from a small liberal arts college meet every 4th of July to catch up. They discuss everything and anything, but mostly how they wish they had different jobs and perhaps didn't major in English. Arden, their wealthy friend from the group, is dying of lupus, which saddens this group of girls tremendously. A few months after their 4th of July get together, she passes on and leaves them each $250,000. But there is a stipulation. They must use this money to pay off their debt and pursue their real dreams, whether it be to become an event planner, a pastry chef, a novelist, or a bed and breakfast owner. Beth Kendrick's Second Time Around is like a fresh breath of air. While reading this entertaining novel, I enjoyed fantasizing about dropping everything and pursuing my own dreams if I were given a chance just like these women. This is a must read for anyone who is a fan of chick-lit and has ever pondered the important question of.........what if?What is so great about this novel is the simple fact that there are four women that are extremely relatable. There's Jamie who is a bartender and has traveled around the world serving up drinks. She never really sees things through. Then there's Brooke who is a southern belle and resident nice girl that works for the college they graduated from. Cait is an English professor that always falls for the wrong guy and Anna, a copywriter, who rarely works and is trying to conceive, but finds out she's infertile. Most women could relate to at least one of these characters; they were very realistic. Which leads me to another thing I enjoyed about this novel: friendship. Second Time Around illustrates true friendship and strong female characters that support each other through time times. I feel like this is rare in chick-list; there's always that one mean girl, but these four women got along swimmingly.I also enjoyed Kendrick's incorporation of classic literature. Since I, too, was an English major, I particularly liked the various allusions to Shakespeare or Dickens. I also liked that Kendrick put a quote before each chapter. It was a nice touch. However, you don't have to be an English nerd to appreciate this.My only issue with this novel is that things sometimes worked out too easily for the girls. It was rather unbelievable at times. Some of the girls didn't have to work too hard in order to achieve their dreams.....sometimes it fell into their laps. I also wasn't a fan of Cait's writing. She wanted to become an author and found herself writing a romance novel. Kendrick incorporated a few excerpts from her writing, which in theory sounds entertaining; however, I am not a fan of romance novels. At all. Personally, this drove me nuts, but if you are a fan, they you will appreciate this glimpse into Cait's writing.All in all, I felt this was an interesting summer read that makes you think about the fact that maybe it isn't too late to strive for some of the goals that were set in college. Anyone, not just English majors, will enjoy this novel and the premise. I mean comon'.......Who doesn't dream of dropping everything to chase after your dreams?"}, {"userName": "chippyvale", "userReviewDate": "Dec 25, 2012", "userURL": "http://www.goodreads.com/user/show/5382311-chippyvale", "userReview": "Every year, a group of former English majors meet up to update each other on their lives. The book starts off with the premise that majoring in English equals to saddling oneself with school debts after one has graduated and unabling to find a decent job. This resonates throughout the entire novel; somewhere along the story, a hardware shop assistant by the name of Everett echoed that sentiment too whose major was philosophy. \"Fine arts major?\" \"Worse. Philosophy.\" He spread his arms out to encompass his realm of drywall and crowbars and PVC pipes. \"See where four years of Aristotle and Descartes'll get you?\" He held out his right hand. \"I'm Everett.\" Having had friends who major in English literature, I was all too familiar with that complaint. I was keen to know what the author had in mind to rectify that age-old grouse. Practicality in the book refers to majoring in Law (as seen on the first page of the novel) or Engineering. However, I was a lil bemused by the sudden \"windfall\" whereby each person inherited a whooping 250 grand. I won't say what the reason for the windfall was for fear of ruining the story for those who have yet to read it. It was pretty cliche. The money allowed the friends to have a \"second chance\" in life whereby each of them sought to chase after their dreams. For instance, one of the characters Brooke used her inheritance to purchase Henley House in order to refurbish it as a Bed & Breakfast; Jamie who quit her bartending job, turned into an event-planner. Her seemingly overnight success left me puzzled; if only that would happen in real life! Overall, it was a good and light-hearted read. There weren't any big surprises in the book; definitely a few twists and turns but nothing too major. As mentioned earlier, the novel started off with the premise that majoring in English is impractical, and it ended off with that theme in mind, albeit an optimistic one. It was like trying to assure readers that it matters not what major he or she chooses in college as long as he or she has a passion for it. With passion, comes potential. \"We may not always be practical, but we have infinite potential.\" - Anna.It's perfect for someone who's looking for a good pick-me-up read. ;)"}, {"userName": "Peebee", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/4658421-peebee", "userReview": "Your basic chick lit involving a bunch of college girlfriends. The twist here is that one of them dies and leaves a million dollars to the other four. (I know, right....I made some great friends in college but I don't think any of them are going to leave me $250K, which is what each of them get.) So they get to live their dreams (sort of) by going back to their college town and starting businesses...a B&B (in the off-campus house where they all lived), event planning and bakery all synergistically keeping each other employed, and pissing off some people who would rather not see them come back to town. Not terribly deep writing but not terrible either, and everything works out with their lives in the end (except of course for the one who died in the beginning, although some of her issues get resolved posthumously.) It's one of those \"all you have to be doing is living your dream and all of your other problems will just get worked out\" books, which I can say from having my dream job is clearly fiction."}, {"userName": "Ruth", "userReviewDate": "Aug 14, 2011", "userURL": "http://www.goodreads.com/user/show/922881-ruth", "userReview": "Five English majors who were friends and roommates all through college have remained friends in the 10 years since they have graduated. Each of them has a job but not a career that they would like to stick with. Each of them has a dream job that they think they would love. What would you do if you were suddenly given the advantage of being able to finally pursue whatever your heart desired. What if you were given the chance to start over without needing to worry about funds? Would you find that your dream was in fact what you were meant to be doing or would you remain frozen in fear of moving ahead and giving it a try?Given the chance to pursue their dreams, these friends now have a \"second chance\". This book takes a look at not only second chances, but friendship, romance, and sticking with something that they have started.The book was enjoyable and I would read other books by Beth Kendrick."}, {"userName": "Lisa", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/148710-lisa", "userReview": "Every summer, four college friends hold a mini-reunion. They laugh, reminisce, and commiserate about their soul-sucking jobs. Maybe they should have listened to everyone who warned them to study something “practical.”Then an unexpected windfall arrives—one million dollars, to be exact—with the stipulation that they use it to jump-start their new careers. Almost overnight, a professor, a bartender, a copywriter, and an administrative assistant reinvent themselves as a novelist, an event planner, a pastry chef, and a bed-and-breakfast owner. But the changes in their professional roles create unexpected turbulence in their personal lives, and soon the secrets and scandals from their past start to resurface. For anyone who has ever wondered “What if?,” this engaging novel provides a sweet, funny look at friendship, romance, and second chances."}, {"userName": "Jen", "userReviewDate": "Jan 28, 2010", "userURL": "http://www.goodreads.com/user/show/605223-jen", "userReview": "I received this book for free through First Reads. I loved it. From the moment I picked up the book and started to read, it was difficult to pull myself away from it. The story itself was very intriguing and captivating. I found myself wondering what was going to happen next and had to fight the urge to read ahead when I was in a rush. It was great to read a story about these 5 women who became like family and helped each other through major changes in their lives. Character development was so important and it was done beautifully. I almost wish there was a sequel to the story to see where their lives end up. Highly recommended; it's a great read."}, {"userName": "Lauren R.", "userReviewDate": "Feb 01, 2016", "userURL": "http://www.goodreads.com/user/show/4356867-lauren-r", "userReview": "Probably 4.5 stars? Not an all-time favorite but definitely not less than 4 stars. I'm not sure if this was a case of the right book at the right time, or if I just really loved this one, but either way- so glad I read it. I needed something with no hype and non-YA, and this delivered in spades. I loved the cozy, college campus vibe (even though they were all 10 years out of college, just living somewhat on the campus) and the theme of second chances. Definitely made me think and smile and swoon (a LITTLE bit). The romance was somewhat surface-level but I did enjoy it. Great ending, too!"}, {"userName": "Aly", "userReviewDate": "Sep 16, 2010", "userURL": "http://www.goodreads.com/user/show/1213322-aly", "userReview": "I recently read this book on vacation. I was excited to open this book as the story line drew me in, and it didn't disappoint... great chick lit and is something women of all ages would appreciate as it evaluates these girls friendships through the years, how they kept in touch, and how their lives were changes by one another --- and what happens when you have a chance to do things \"all over again\", so to speak. I would have loved to have gotten a little more from it in the end, hence the 4 stars vs 5 stars."}, {"userName": "Nancy", "userReviewDate": "Feb 24, 2010", "userURL": "http://www.goodreads.com/user/show/2577354-nancy", "userReview": "I was thrilled to receive this book through the Goodreads First Reads program. I wasn't disappointed! From the moment I began reading the book, I was drawn into the story by the characters. Beth Kendrick has a great ear for dialogue which along with the pace of the story kept me reading. It helped matters that I, too, was an English major so I felt like the characters were all people that I would be friends with. I also enjoyed the literary references that were made during the tale. This was the first book I had ever read by Kendrick so I look forward to reading more of her books."}, {"userName": "Kimberly", "userReviewDate": "Jan 21, 2010", "userURL": "http://www.goodreads.com/user/show/2446707-kimberly", "userReview": "As I have read two of Kendrick's books previous to this, and really enjoyed both, I was very excited to win this ARC from Goodreads.This book is another great story by Kendrick. She is able to weave the stories of each woman wonderfully, going back and forth between each character. Each woman's story is interesting and different. I really enjoyed how I was not able to predict how the story ended, which is a problem I seem to be running into more and more. In short I loved the characters, and loved their stories. Great read."}, {"userName": "Mary", "userReviewDate": "Jan 21, 2010", "userURL": "http://www.goodreads.com/user/show/1002344-mary", "userReview": "Won this on GR...can't wait to read it!ETA - This was a fun book that celebrated women's friendships and new beginnings. It made me wish I was still in contact with all my college friends and that we were able to see each other regularly! There was some romance mixed in without too much of it, and it was a nice light read for a snow day! I definitely recommend it to fans of women's fiction!"}, {"userName": "Kourtney", "userReviewDate": "Apr 03, 2010", "userURL": "http://www.goodreads.com/user/show/1479141-kourtney", "userReview": "I really enjoyed this story and how all of the women's storylines were woven together. What made it better for me was that whenever I put the book down to focus on school, it was very easy for me to pick the book back up and dive right back into the storylines as though I never left. The stories began to drag a bit in the middle, but quickly picked back up again enough for me to not want to put it down just to see where all of the women ended up. All in all a great read!"}, {"userName": "Angie", "userReviewDate": "Jan 26, 2010", "userURL": "http://www.goodreads.com/user/show/3093592-angie", "userReview": "I won this book from the GoodReads First Reads. This is the first book I've read by Beth Kendrick. I absolutely loved this book. From the first chapter I was drawn into the lives of these women just like they were my own friends. Also, just when I was predicting what would happen next, Ms Kendrick added a new twist to the story. I will definetly be reading more of Beth Kendrick's novels and recommending this book to all my friends."}, {"userName": "Sharon", "userReviewDate": "Jan 27, 2010", "userURL": "http://www.goodreads.com/user/show/2211065-sharon", "userReview": "Just wanted to note that I won this on Goodreads Firstreads.Ok. Let's see. I thought this was a very cute book. It was filled with happiness, sadness, love, hate, drama, scandal and, of course, sex. I only gave it 4 stars bc I didn't think there was anything superb about it, just chick-lit but it was still cute. The one problem I had was trying to keep all the girls (and their men) straight. I would definitely recommend. Can't wait for another Beth Kendrick book!!"}, {"userName": "Lori", "userReviewDate": "Jul 15, 2016", "userURL": "http://www.goodreads.com/user/show/290732-lori", "userReview": "Ms. Kendrick has become one of my favorite authors! Whether it is the Black Dog Bay series or one of her stand alones I have loved every book I have read. This story is about 4 friends that come into an inheritance, what each decides to do with it effects the others until they all find their dream."}, {"userName": "Cheryl", "userReviewDate": "Oct 06, 2011", "userURL": "http://www.goodreads.com/user/show/6175522-cheryl", "userReview": "I started off this book a little confused. There were 4/5 main characters and I had to keep flipping back to see which one was which. By the end of the novel I knew each one and what they were about but I wish they were a little better established in the beginning. Besides for that, this novel had everything you want in a feel good read."}, {"userName": "Natalie", "userReviewDate": "Feb 10, 2010", "userURL": "http://www.goodreads.com/user/show/3042231-natalie", "userReview": "Received this from the First-reads program . This is my first novel from Kendrick and I loved it ! I was totally hooked from the first chapter till the end ! The characters were well-drawn and believeable . The plot was really interesting and thought out to a satisfying conclusion . If you enjoy women's fiction novels then consider reading this book !"}, {"userName": "Ellen", "userReviewDate": "Apr 08, 2010", "userURL": "http://www.goodreads.com/user/show/3082822-ellen", "userReview": "Really enjoyed this book. Loved the main characters and how they were still great friends after college. Plus what would one do with 1 million dollars-what would you change in your life? Like books that are easy, enjoyable reading, but yet get you thinking!"}], "description": "Every summer, four college friends hold a mini-reunion. They laugh, reminisce, and commiserate about their soul-sucking jobs. Maybe they should have listened to everyone who warned them to study something “practical.”Then an unexpected windfall arrives—one million dollars, to be exact—with the stipulation that they use it to jump-start their new careers. Almost overnight, a professor, a bartender, a copywriter, and an administrative assistant reinvent themselves as a novelist, an event planner, a pastry chef, and a bed-and-breakfast owner. But the changes in their professional roles create unexpected turbulence in their personal lives, and soon the secrets and scandals from their past start to resurface. For anyone who has ever wondered “What if?,” this engaging novel provides a sweet, funny look at friendship, romance, and second chances.", "title": "Second Time Around", "url": "http://www.goodreads.com/book/show/7056660-second-time-around", "average": 3.64, "cover": "https://images.gr-assets.com/books/1320391244l/7056660.jpg", "reviews": 264, "authors": [{"url": "https://www.goodreads.com/author/show/21197.Beth_Kendrick", "name": "Beth Kendrick"}], "type": ["Womens Fiction", "Fiction", "Romance", "Contemporary", "Adult Fiction"], "outlinks": ["http://www.goodreads.com/book/show/7056660-second-time-around", "http://www.goodreads.com/book/show/7923180-second-time-around", "http://www.goodreads.com/book/show/18667977-cure-for-the-common-breakup", "http://www.goodreads.com/book/show/317159.Nearlyweds", "http://www.goodreads.com/book/show/1132997.Exes_and_Ohs", "http://www.goodreads.com/book/show/12196871-the-lucky-dog-matchmaking-service", "http://www.goodreads.com/book/show/441318.Fashionably_Late"]}