{"ratings": 1151, "userreviews": [{"userName": "Loren", "userReviewDate": "Jan 28, 2013", "userURL": "http://www.goodreads.com/user/show/3828265-loren", "userReview": "you haven't ever read one or any of these Authors, this is a FABULOUS way to introduce yourself to them! Now then, if you are familiar with them, you know how awesome their books are, right?!!!! Well, these BFF's have done an AMAZING job writing 4 novella's and making the stories flow from one to the other just perfectly! I just love it when someone has pretty much given up on love, and then suddenly, they find themselves falling, and falling hard, don't you!?!? Well in Smitten Vermont, love & mystery are in the air and the Thomas sisters are hard at work hoping to solve the mystery and to prove, it is never too late for love. But as each sister will find out, love can come when you least expect it and in ways you never could have imagined!Smitten is a cozy town filled with such precious people! I would love to just pick up and move there and you might just be ready to do the same after you read Secretly Smitten! Secretly Smitten is a DEFINITE 5 ♥ ♥ ♥ ♥ ♥'s for me!Thank you so much to LitFuse for allowing me this complimentary copy in exchange for my honest review!"}, {"userName": "Lisa Johnson", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/7092311-lisa-johnson", "userReview": "Title: Secretly Smitten, Love changes EverythingAuthor: Colleen Coble, Kristin Billerbeck, Diann Hunt & Denise HunterPages: 400Year: 2013Publisher: Thomas Nelson\tSecretly Smitten is truly brilliantly written by four separate authors and set in Smitten, Vermont. The main characters all come from the same family. Now, before you think this will be boring or that the ending easily guessed, there are surprises within each story. One great benefit of this novel is that the endings aren’t really endings at all, but beginnings. Each woman in the family is not necessarily looking for love, but a few are. A couple of the women have been hurt in the past and therefore are afraid to risk loving again. A few have remained single all their lives and are quite content to stay so. Not all the females in this family are the same age or come from the same generation, but they are very close to each other.The matriarch of the family is Anna’s mother, Rose, who was married at one time and is now widowed. A trinket found in an attic at a relative’s house becomes a mystery as to how they got there and why Rose was so affected when the name on the trinket was said aloud. Anna is the mother of grown children; her husband left her years back and never returned. Now a man has come to town to care for his dying mother, and with one trip to her store begins an adventure for the both of them.Zoe, Clare and Tess are sisters; their personalities and gifts are very different. However, their attitude and openness to love another and to be loved is unparalleled. Each works hard at what they love and share each Sunday dinner after church in a potluck meal. Due to these three girls investigating and prodding the mystery behind the name of the trinket, fear, doubt and a secret out in the open that has been hidden for decades result.Smitten is working hard to lure the railroad to make a stop in their town as a tourist attraction. When all hope seems lost because the railroad company chooses a different town, the resilient community continues to bask in its close knit community. At the two-hundredth anniversary celebration, mysteries are solved as well as hearts and lives are changed.The titles for the four stories are: Love Between the Line; Make Me a Match; Knit One, Love Two and ending with Love Blooms. If you’re not a romance novel reader, don’t be so quick to ignore this book. While romances sometimes can be written in a way that turns readers away, this one will only snag the heart of the reader and not let go till the last page. It was very enjoyable and exciting to see each of the stories come about and the way the authors placed them. The theme of love above all isn’t so much the love of a mate in these stories, but God’s love. Read it, get lost in the adventures and pull it off the shelf for a heart-lifter anytime you need one.My rating is 5+ stars.Note: I received a complimentary copy for an honest review of this book. The opinions shared in this review are solely my responsibility. Other reviews can be read at http://seekingwithallyurheart.blogspo... . Also follow me on Twitter @lcjohnson1988, FaceBook at https://www.facebook.com/lisa.johnson..."}, {"userName": "Candice", "userReviewDate": "Nov 06, 2012", "userURL": "http://www.goodreads.com/user/show/13459122-candice", "userReview": "I won an advanced copy of this book and absolutely loved it! I think it was ever better than the original \"Smitten!\""}, {"userName": "Renn Shearin", "userReviewDate": "Dec 17, 2012", "userURL": "http://www.goodreads.com/user/show/3828546-renn-shearin", "userReview": "Secretly Smitten is a sweet collection of four novellas each written by a different author and connected by a thread of mystery and romance. The stories are short and completely romance focused, so if romance is not your cup of tea, this book is not for you. Secretly Smitten follows in the footsteps of the previously released Smitten, but it is not critical to read the other novel first. It does give background on many of the other characters, but this novel is understandable on its own. The first novella is called Love Between the Lines and is by Colleen Coble. It stars the smart, kind, yet insecure Tess Thomas as she struggles to find true love, herself, and solve a puzzling mystery. I found Colleen Coble's novella to be the most interesting of Secretly Smitten. She did a great job setting the stage for the rest of the stories, and she introduced and developed her main characters in a way that made them enjoyable and relatable for the reader. I did not like the light in which she painted the mother, Anna, because it did not really match up with the character I saw in the other three novellas. While I am not sure that I related the best to the two main characters of this novella as compared to the other characters, I did have the strongest connection to the characters because of the way they were developed. The second novella is called Make Me a Match by Kristen Billerbeck. This story focuses on Zoe Thomas, the youngest daughter who is filled with bright ideas, dreams of romance, and uncontained energy. This was my least favorite story of the four because the romance seemed unrealistic and occurred far too quickly and there was very little plot development even for a novella. I had little connection to the male character simply because I did not know anything about him. I liked Zoe, but I knew little about her either. I also did not feel that the main connecting plot line was well carried out through this novella. The third novella is Knit One, Love Two by Diann Hunt. The character that this story focuses on is Anna Thomas, the mother of Tess, Zoe, and Clare. This novella was interesting because it focused on an older woman finding new love. It was also disconcerting at points because Anna did not act or have thoughts that one would typically expect from a mother and older woman. While this could simply be a misconception on my part, it did make it harder for me to read and certainly harder for me to connect to her character. I found this story very interesting and well written, but I had little connection with the characters. The fourth novella is Love Blooms by Denise Hunter. Starring in this final novella was Clare Thomas, the middle Thomas sister. After learning some things about Clare during the other stories, it was interesting to see how Clare viewed herself and watching her realize her flaws and change as the story progressed. I think Clare may have had the most growth of the characters, and I found myself able to connect to many of her attributes, such as an inability to accept change or trust others. I also enjoyed the male character in this novella, and his positive influence on Clare and other characters. This novella wrapped up the overall thread of Secretly Smitten in a way that was satisfying and interesting. I was left feeling pleased as the story ended. Overall, I found Secretly Smitten to be a quick yet enjoyable collection of novellas. There were aspects that I enjoyed about each and there were stories and parts that I liked more than others. I found the overall storyline to be intriguing, and I enjoyed seeing familiar characters and settings from the first collection. I also liked how the four authors worked together and how their characters each viewed the other characters differently. If you are looking for a heartwarming yet easy read to curl up with in front of the fire this holiday, this is the book for you. I received this novel for free from Booksneeze.com in exchange for an honest review."}, {"userName": "Maureen Timerman", "userReviewDate": "Jan 15, 2013", "userURL": "http://www.goodreads.com/user/show/3840941-maureen-timerman", "userReview": "What a joy this book was. I loved it!!We visit this wonderful romantic town in Vermont, and hear about some of our old friends, but this is 5 new romances. Yes five!!There are four novellas by these great authors, they start with one family and take it to the conclusion. A very fast read!These are the Thomas's sister's stories, their Mom and their Grandmother, Rose. It begins with finding some old dog tags in the attic. Here Colleen Coble takes us with Tess, and Ryan, and adorable Sophia. Ryan lives in the home of the family, where the former boyfriend lived. Could their be some answers in the boxes that remain in his attic?The second Thomas sister's story is told by Kristine Billerbeck, and that is Zoe. She is opening a new business in Smitten...Make Me A Match!! When the new City Manager William runs into her ladder left on the sidewalk. Thus begins a new push of wills, and maybe some romance!The next story belongs to Diann Hunt and her story of Anna Thomas, Knit One, Love Two. She is the girls Mom, divorced for ten years, and her yarn shop. With her we meet Michael, a man who is an anonymous benefactor. This is such a sweet heart warming story!The last author is Denise Hunter and this is Clare Thomas's story. We begin with her being dumped by her boyfriend Josh, he called her boring. Clare is not upset about the breakup...she is glad, but she doesn't like to be called boring!! She decides to change her life a bit, and out of character she hires Ethan without a background check. So begins her romance?? Clare is a gifted landscape designer, but bad at love, can she change? Ethan is a God Loving drifter, can he stay put?Be ready for some delightful family dinners, and loving people who are there for each other. Three generations of Woman!!Once you start you won't be able to put this one down, I read it in one day! This is the second book in this series, I do recommend you read the first, but it is not necessary.I received this book through the Litfuse Publicity Book Tours, and was not required to give a positive review."}, {"userName": "Brenda", "userReviewDate": "Jan 19, 2013", "userURL": "http://www.goodreads.com/user/show/754448-brenda", "userReview": "\"Secretly Smitten\" is four short stories that take place in Smitten,Vermont,a place where neighbors are like family. When a set of dog tags with the name of David Hutchins is found in Tess Thomas's grandmother's attic little did they know that the mystery surrounding the tags lead not only Tess, but her sisters and mothers to finding love as well as answers. \"Secretly Smitten\" is written by four different authors and provides readers with four different tales of romance. Short and sweet, each story flows well, and gives a few twists that held my attention. I enjoyed watching each sister get their own happily ever after, but my favorite story actually belonged to Anna their mother, who owned the Sit 'n Knit yarn shop.I enjoyed the setting of the store, the descriptions of the yarn and clanking knitting needles. I thought the characters of Anna and Michael were very well done, and I always enjoy reading about second chances at love. Overall, I enjoyed my trip back to Smitten, and think if you enjoy reading short stories where characters overflow from one story to the other, along with a sweet romance, sprinkled with a christian theme,your going to enjoy \"Secretly Smitten.\" The bit of mystery woven in was an added bonus for me. While this is the second book that takes place in Smitten it can be read as a stand alone work. Although if you enjoy romance with a small town feel I certainly recommend you read \"Smitten\" as well."}, {"userName": "Jasmine Marie {#thebookishmama}", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/1839684-jasmine-marie-thebookishmama", "userReview": "I enjoyed reading Smitten last year and was excited to be able to read this 2nd book. At first I was a little nervous that it would be an unnecessary sequel, but then when I found out that there are four new characters, I was sold.One of my favorite things about reading Smitten last year was that it introduced me to some new authors that I haven't read before. It was nice to see all their different writing styles combined again into one compilation.In some ways this book is actually better than the first one because three of the characters are sisters who are are on the mission to solve the mystery of their grandmother's first love and their stories a little more intertwined together than the friends in the first one. Regardless, I was so happy to revisit Smitten and still secretly wish that this was a real town that I could visit in real life. It was fun to revisit this quaint town again.The stories are very light and cute including dog tags, knitting (and a sheep!), the same snappy, witty dialogue from the first book and another all-around feel good story.If you like Christian fiction, you will love this quick, light love story. You'll be smitten with Secretly Smitten. :)For more reviews from the bookish mama, please click here."}, {"userName": "Cara Putman", "userReviewDate": "Jan 20, 2013", "userURL": "http://www.goodreads.com/user/show/674427-cara-putman", "userReview": "Secretly Smitten is a collection of four novellas that return to the authors' created town in Vermont. The town is still trying to find ways to stay alive. And four young women are on their way to discovering romance. These novellas tie together with those in Smitten, the other collection by these authors and friends. Have no fear, you can read this collection on its own. I love how real the characters are and the way I want to join them at Mountain Perks for a good conversation and update on their romantic adventures. I also enjoy the cameo appearances by characters in the earlier collection and the way the characters carry over from story to story. Because there are four novellas in this book, each can be read in a long sitting and it's the perfect book to take along on a spring break trip. Easy to put down when you need to do something else, but also engaging enough, you'll want to return often to this delightful town. Do keep in mind that this book contains four shorter works. While longer than a short story, they are not full length novels. Yet each story gives a full romance. I received a copy of this book from the publisher, but the opinion is mine alone."}, {"userName": "Kav", "userReviewDate": "Sep 10, 2016", "userURL": "http://www.goodreads.com/user/show/6025638-kav", "userReview": "I'm smitten with Smitten, Vermont! Sorry, couldn't resist. Loved the small town vibe so ripe for romance. And those Thomas women are a hoot! Raring to match each other but turning alarmingly stubborn when Mr. Right comes their way. Each novella stars a sister (or mum) and while the reader gets to bask in their happily-ever-afters there is also a really neat mystery thread that winds its way through all the stories from start to finish. I couldn't wait to find out how that ended! And I wasn't disappointed. Tons of romance, quite a few laughs and some tender insightful moments as each woman tackles the obstacle that threatens that coveted happily-ever-after."}, {"userName": "Aerykah", "userReviewDate": "Nov 18, 2016", "userURL": "http://www.goodreads.com/user/show/5920961-aerykah", "userReview": "I must say I quite enjoyed listening to this audiobook... They're fun stories and I really liked the narrator too! :)"}, {"userName": "Mandolin", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/3324944-mandolin", "userReview": "There's a mystery hidden between the floorboards of Grandma Rose's attic and though their mother, grandmother and aunts would prefer that they leave it unsolved, the three Thomas sisters are intrigued by the romantic story their grandmother tells and can't resist probing further into its depths. As women from the self-proclaimed love capital of Smitten, Vermont, they dream of finding her long-lost love...and may just end up finding love for themselves in the process. \"Love Between the Lines\"Coble, ColleenTess, the oldest girl of the clan, has no illusions about her looks. With her generous curves and unexceptional features, she can't compete with the more glamorous members of the town. She daydreams about Ryan,a handsome widowed patron at her bookstore, but knows that he'd never take a second look at her. When Tess discovers a connection between her family's mystery and Ryan's home, however, she persuades him to let him go on a scavenger hunt in his attic. She's surprised when he heartily agrees and offers his assistance and finds that maybe he has a few secrets of his own!\"Make Me a Match\"Billerbeck, KristinZoe has always been a disappointment to her family and friends. She's tired of their constant comments about \"living up to her potential\" and sets out to prove them wrong when she opens up her matchmaking service on Main Street. Even before her doors open, however, she encounters a roadblock in the form of the handsome new city manager, William Singer. William represents all that Zoe fears about change and trust and uncertainty and he threatens all that she loves about Smitten. As things heat up between them, will Zoe be able to stand up to him, prove herself to the town and make a few love matches in the process or will her dreams go up in smoke? \"Knit One, Love Two\"Hunt, DiannAnna Thomas gave up on love when her husband deserted her after raising their three daughters to start an entirely new family together with his younger girlfriend in Arizona. Though she's remained free of bitterness due to the support and love of her mother, aunts and daughters, Anna still feels disillusioned about romance and is certain that any man offering it will be the same: a changeable being who will leave her heart-broken in the end. It's no surprise, then, that she immediately puts up walls when she finds herself attracted to one of the few male visitors to her store. Like her ex-husband, Michael Connors is a retired military man who she's certain will break her heart if she lets him. Confident and a bit debonair, Michael stirs deep longings in her heart that she fights to suppress. But as the tangled secrets surrounding her mother and aunts continue to unravel, the tugs on her heartstrings become gradually stronger and Anna feels her resolve slowly melting away. This holiday season, she just might find something more than just the gifts under the tree to make her year end bright.\"Love Blooms\"Hunter, DeniseThe hidden truth behind the attic discovery is tearing her family apart and Clare, who thrives on predictability and stability, is at a loss to make things right. Wrestling with her own feelings of inadequacy after a breakup that caused her to re-evaluate her whole \"boring\" life, Clare is learning that change may be something inevitable if she ever wants to find love in her life. When fate drops a mysterious, handsome drifter into her life, Clare takes it as a sign to flex her spontaneous muscles and hires him to work part-time at the nursery she manages. She begins to question the wisdom her decision when he challenges her comfort zone and goads her into expanding her horizons. As spring blooms in Smitten, Clare realizes that something else may be blooming, too: a deep connection with a man who's sure to leave her behind when he rides off into the sunset. Will Clare end up regretting her decision forever, just like her grandmother and aunts before her?Effortlessly transitioning from one story to the next, this book was a delightful, heart-lifting read. Though none of the stories are very deep, the characters are well-developed and each connected plot contains enough drama to hold the reader's interest. The town's ongoing battle to survive, the family mystery and the individual love stories all contribute to an engaging read that uplifts the reader with its messages of faith, hope, trust and forgiveness. I did not read the previous novel (Smitten) and though some of the history of the town and supporting cast are referred to in this book, I did not feel as if I had missed out on anything significant. I will, however, certainly put the first book on my \"to-read\" list, since I'm sure it's just as sweet a read as this one! I was provided a copy of this book by Thomas Nelson Publishing in return for a non-biased review."}, {"userName": "Shari", "userReviewDate": "Jan 26, 2013", "userURL": "http://www.goodreads.com/user/show/5089841-shari", "userReview": "What a strange and cool idea for a book. This book was written by 4 authors. It is like a series of 4 books, and each book is written by a different author. Each book is a short book, and can be read quite quickly and easily. Apparently there is a previous set of the same type of stories about the same town. I have to admit I am interested in reading them now. I love how the authors styles mesh well, and there isn`t a real disconnect between the stories.Love Between the Lines by Colleen CobleWe start off the series with Love Between the Lines. In this book we first meet the Thomas sister`s who the series will revolve around. We get to indulge in Tess`s story with one of my favourite authors Colleen Coble. From the 2nd paragraph I was hooked into this story. I had picked up the book as I laid down for a quick afternoon nap. I was going to read up to a chapter, and then go to sleep. Well after the first book was complete, the boys were up and that was that, but boy did I enjoy it. I connected with Tess and her fun loving ways. She is spirited and honest, and as sweet as can be.Make me a Match by Kristen BillerbeckIn this story we focus on the youngest daughter of the Thomas sisters, Zoe. She is starting her own business being a match maker. There is also a running mystery throughout the books and we come a little further a long in that story as well. I enjoyed this book too, and couldn`t stop after reading it. On to the next, especially when I say the name:Knit One, Love Two by Diann HuntIt starts with Anna, the mom of the group, in her knitting shop, opening a UPS package of Merino yarn. Yup. I was hooked from the first sentence. This particular book I really liked because it talked about those wishful thinking ideas that I have had. Like getting sheep! Any knitter knows that the thought of having your own sheep seems like a good idea LOL. It's like having your own secret yarn stash. Of course it's not that easy, but it is one of the things I always think would be cool. This story progresses the main story that weaves throughout the 4 books, and also focuses just on the mom.Love Blooms by Denise HunterThis book focuses on the middle daughter. Claire is the sensible, dependable type. She lives in her little rut, and she is happy there. She does not like change AT ALL. I could totally relate to Claire. Claire decides she is going to shake up her world instead of thinking through the decision to extensive lengths she decides she will go with her gut. Which she does on that one thing and while she admits it is a great decision, she isn't so likely to do it again. I thoroughly enjoyed watching Claire's journey since I am very much the same. Change is something I don't take to at all. I like to live in my rut, although having 3 little boys have cured me of being boring, and pulled me out of my rut a little.Check out the rest of my reviews of books, and other products at: http://www.theknitwitbyshair.com"}, {"userName": "Amy Bradsher", "userReviewDate": "Jan 22, 2013", "userURL": "http://www.goodreads.com/user/show/8690471-amy-bradsher", "userReview": "I loved the first Smitten book, but this one is much, much better! The common theme in each of the stories - besides love, of course - is a history-mystery-romance, brought into the modern day and just begging to be solved. There's nothing I like better than when characters stumble upon a long-lost love and have to decide how - and if - they should investigate.Written by four authors who just happen to be best friends, these stories are woven seamlessly to create one large book, spanning a year in the life of Smitten residents. The way that each story began in the one prior and then continued on throughout the others really made this book feel like one large novel. That's probably my next favorite thing about it.When a book is really well written, you fall in love with the characters. You're not ready to say goodbye to them when you turn that last page, and no matter how long the book is, it's just not enough. The genius of the Smitten series is that you don't have to. Because each story is set in the same town among the same cast of characters, you continue to learn about the previous story's main character and how their lives are progressing all while meeting new ones. The same may be said of some book series, but with Smitten you don't have to wait around for the next book to be published - you have it in your hand! If you find yourself wanting to share a recipe or invite a certain character over for dinner like I do, this is a major advantage - and you'll want to befriend the women in this book.While the stories are romantically dramatic, you won't need your tissue box to read this book, but you will need your funny bone. I appreciated the drama and the sweet notes written into the plot, but even more than that, there are real life lessons inherent in this book: things that all women struggle with at one time or another. Are we worthy of love? How do you forgive a major hurt? I'm working for a good cause - and so the rules don't apply to me, right?I can't wait to meet the next cast of Smitten characters.I received a free copy of Secretly Smitten from LitFuse Publicity in exchange for an honest review."}, {"userName": "Laura", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/1603322-laura", "userReview": "In a follow-up to Smitten, author friends Colleen Coble, Kristin Billerbeck, Diann Hunt, and Denise Hunter offer another glimpse at the sweet town of Smitten. This time, three sisters are on a mission to solve the mystery of their grandmother's first love, who was thought to be dead many years before. Will they solve the mystery and find love along the way?Love Between the Lines: Coble starts the book with Tess, who is determined to find clues about how her grandmother's old beau's dog tags ended up back in Smitten. The search leads her to Ryan's attic. It's a cute start with two people who like each other but think the other couldn't be interested. Cute food incidents too. Make Me a Match: Billerbeck's character Zoe is a match-maker who is setting up her love connection business if pesky city manager William will just let her bend a few rules. Billerbeck showcases her talent for chick-lit with her novella, once again reminding fans she's the best at witty dialogue and fun characters.Knit One, Love Two: Hunt shares the girls' mother's story despite her reluctant involvement in solving the dog tag mystery. When Anna expands her quilt store to raising her own sheep, she takes Michael up on his offer to help. This one is as cute as the others. I love that a range of age for romance that Hunt adds to the group.Love Blooms: Hunter solves the mystery with the story of Clare, an independent yet scared landscaper. When new-to-town nomad Ethan starts helping at the nursery, Clare has to face her fears of starting her own business and about falling in love. I loved Clare's independence and Ethan was my favorite male character, which made this my favorite of the four novellas.Secretly Smitten is a fun, fast read with sweet romances. Fans of Christian fiction will enjoy a trip back to this quaint town."}, {"userName": "L_manning", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/5107412-l-manning", "userReview": "Smitten, Vermont is known for being a small town that's big on romance. The people of Smitten love to draw people in and make them feel the love. For one family though, they haven't been as lucky in love. Spanning 3 generations, the four stories in this book show 5 different romances. Some are new and fresh and some are older than anyone even knew. Throughout it all, the town must work to try and get a new train line to stop in Smitten, providing necessary tourists. Deep with romance and mystery, this book leads one to believe that Smitten may truly be a romance capital.So this book was interesting in that it was 4 different stories written by 4 different authors. They all tied together in the end though. I found some of the stories to be more entertaining than others; I guess that's just the nature of having 4 different authors write it. Some of them had styles that meshed much more with what I like to read than others. I won't tell you which ones were my favorites, but suffice it to say 2 of them were much more entertaining for me. Just know that if you get in the middle of a story and it's not that appealing, stick with it because the next story may be right up your alley.There is an overlying mystery that helps tie the 4 main stories together. I really enjoyed that part. I did like how things tied together in the end too. It was very sweet. I also love that it's 4 smaller stories. That allowed me to be able to read around my other daily tasks. I also had the flu when I read this, so I was able to get some of the story in between temperature spikes. It worked very well for that purpose. Overall I enjoyed the book. It was just very sweet. This is perfect for when you just want to relax and fall in love...several times.Galley provided for review."}, {"userName": "Ruth Hill", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/2299424-ruth-hill", "userReview": "At first, I thought I might give this a four star rating. After all, it is a romance with a bit of sappiness, and everything works out just as it should in a typical romance novel. Nothing earth-shattering there. It's written by four authors, and the book is a nice, clean Christian romance. At first glance, the book is not a stand-out. I figured it would be four short stories since each author wrote a certain section.Here is what makes this book absolutely unique and makes it deserving of the rating I have given it. Don't let the fact that four authors write this book together cause you doubt how wonderful the book is. I believe the authors have accomplished something that very few authors (if any) could do. This book does not read as four separate stories written by four distinct individuals. Instead, it reads like a cohesive novel that was written by one person. Somehow these four women have made it work. I honestly could not tell the difference between writing styles of these authors, and the story made complete and perfect sense. I have to admit the only truly negative thing I would say would be that I wish each romance had developed a little slower. I realize the authors were working under a time constraint, but I think it could have been accomplished--or at least tried to do so. If you like romances, small towns, and a little inspiration, this is a quick, easy read for you!I was sent a copy of this book in exchange for my honest review. I was not financially compensated, and all opinions are 100 percent mine."}, {"userName": "Nicole", "userReviewDate": "Apr 09, 2013", "userURL": "http://www.goodreads.com/user/show/3624651-nicole", "userReview": "Secretly Smitten is a fun, heartwarming collection of interconnected novellas. If you're looking to read a book that plays out like a romantic comedy with several intertwined plotlines (I love those kind of movies), this is a great little piece of reading entertainment.Each of the four authors tell the tale of one of the ladies in the Thomas family-- each one exposing their own quirks, flaws, strengths and weaknesses. For only having a relatively short time to develop a storyline and its character, each novella portrays its protagonista well, while also giving glimpses into life in Smitten, a Stars Hollow-esque small town.This was one of those fun escapes from the more educational reading I've been doing lately (parenting, food, spiritual living, etc). The characters' relationships with God are a common thread throughout the book, as are the obvious romances, although I wouldn't toss this into the \"cheesy\" pile. And despite the predictable aspects of the individual stories, together they weave together a mysterious family secret which connects them in a surprising way.And married ladies, let's be honest, the passionate hearts described here (in an appropriate way I might add), can't help but put you in the mood for a little quality time with your own man, if you know what I mean. ;)I looked forward to picking this book up at bedtime each night, when I like to treat myself to a bit of fiction, and was sad to say goodbyes to the characters at the end."}, {"userName": "Jamie Cody", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/12132295-jamie-cody", "userReview": "I just love Christian romance novels! Some of my favorite movies are those that are in a small town setting, so this book really fit my likes! At first, when I read that the book was written as 4 “novellas” in one, and by 4 different authors, I was a little worried. I had never heard of a novella, or a book being written by 4 different authors. It didn’t take me long to really get into the first novella. Was a little worried when I started the second one, worried that I the first love story would be forgotten. But each story went on in the next novellas, they were all interconnected.The story setting is an ideal little town called Smitten, Vermont. Everyone knows everyone, and everyone loves the little town. There is also a ski resort there, which is a huge plus with me, as I love to ski!The story was about a family of single women. One of them widowed, another was a divorcee, and the others had never been married. The novellas each focused on one of the women and the man that she met and fell in love with. A common thread in all of the stories was a mystery concerning a long lost love of the Grandma in the story.I will say no more…………… you will need to read it to find out……..I read the Kindle version of the story, as I really enjoy my Kindle. On one of the last pages of this book, there was an advertisement for the next book to come out in January 2014! Soooo excited about that."}, {"userName": "Veronica", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/10113454-veronica", "userReview": "I loved these cozy romances set in the town of Smitten! The four stories feature three sisters and their mother. Slightly overweight Tess has a crush on a guy she's known since high school, who's now widowed with a child. She feels she could never compete with his first wife, though, who always looked so put together. Flighty Zoe has finally decided what she wants to do for a career: start a matchmaking service. Will it even get off the ground when she meets Will, the new town manager who plays by the rules? Their mother Anna was heartbroken when her husband left them to start a new family. Could she ever trust and love again? Clare is predictable and likes to play it safe, but when she spontaneously hires a stranger, will she come to regret it or take a risk on love? One of the story lines running through them all is about dog tags found in the attic of Grandma Rose from her first love who died in the Korean War, but how did they get there? The three sisters decide to investigate the mystery.I love the romance in each of the stories. There are a lot of sweet moments, but also some real issues each woman has to face in their path to love. The town sounds like an ideal place to live and I love the feel of community there. I also liked the mystery ... read the rest here: http://shopgirl152ny.blogspot.com/201..."}, {"userName": "Amanda Stephan", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/3570959-amanda-stephan", "userReview": "This is the first anthology fiction book I've read. I know. Where have I been, right? I was pleasantly surprised. Four very different authors with very different voices came together and pulled off a terrific book. I thought it was thoroughly enjoyable how each author wrote about a specific character and how each had their own twist to the short story. My time is excruciatingly limited, and at first, I was a little concerned at how thick this book was. All that for nothing. Each story was well written and I found myself flying through the book. Each character was well-rounded and likable with her very own traits that endeared them to the reader, and each hero was a perfect match. No one fell in love too quickly, and there was just enough romantic angst to keep you reading. It was a gently told story that weaved in much truth ~ each person, no matter what family they were born into, is different ~ with their own personality and worth. It's a keeper and I will read it again. If I could, I'd give it 4.5 stars.~ I received a complimentary copy of this book, thanks to Thomas Nelson, in exchange for my honest review. All opinions are my own. ~"}, {"userName": "Patricia Kemp Blackmon", "userReviewDate": "Jan 13, 2013", "userURL": "http://www.goodreads.com/user/show/5314062-patricia-kemp-blackmon", "userReview": "Smitten, Vermont is the place for romance and new beginnings. Grandma Rose is unaware that her three granddaughters, Tess, Zoe, and Claire are secretly trying to dig up information about her first love. But the military told Rose and his parents he was missing in action/dead. The girls especially Tess want to learn more about the man her Grandmother lost to the war so many years ago. The girls mother, Anna thinks it needs to be left alone so as not to bring up the hurtful memories Rose had endured.The book follows Cupid's arrow as it hits it's first target. Tess Thomas is always trying to solve a mystery. For some reason she thinks there is a mystery concerning her Grandmother's old beau. But she does not want to harm the memory of her grandfather. She wants her Grandma Rose to love again. In searching information about the soldier Tess finds out her best friend, Ryan from childhood has bought the old house that the soldier's parents had lived in. She wants to search the attic of the old house to see if there is anything there about the soldier. This will give her a chance to spend some time with Ryan. We are sure Tess is smitten now we need to find out if Ryan is smitten.Cupid's arrow hits it's second target! Zoe Thomas is know best for not being able to figure out what she wants to do with her life. The one thing she is sure of is she wants to do whatever it may be in Smitten. With the possibility of the town becoming a train stop she has decided to start a dating service of sort for the Smitten singles. But could it be she herself might be smitten before she even gets the doors of her new business open that is if the old building can pass a safety inspection. It is the responsibility of a newbie to Smitten to determine whether or not it will open. But will his decision be swayed by his attraction to Zoe?Could Cupid really be targeting Anna the girls' mother? Seems so, Cupid's arrow is aimed directly at Anna and her new neighbor, Michael Conners. His mother, Emma comes to her shop for group knitting and to buy supplies for her knitting projects. Anna can't deny he is a looker but she is not looking. Then she becomes the good Samaritan when Michael gets injured in a skiing accident and Emma asks if Anna can drop in on him to make sure he is okay or might possibly need something. She is sure she can handle his flirtations and get back to her own business. Oh no, is she smitten?Has Cupid ran out of arrows? Nope he has a quiver full! This next arrow is aimed at Claire. Surely Claire is to quick for Cupid's arrow! She has ran off every guy that has gotten too close. She is always busy working at potting plants or delivering mulch for the Smitten community. But things are just too hectic and her boss has told her to hire someone to help out with the deliveries. Her new employee is a drifter she stumbled across in the Nursery tool shed. At first she felt threatened by the drifter but for some reason she felt like he could be trusted and he was there looking for employment. He was very kind and worked hard at his job. She even saw him at her church. He seemed to have secrets but who doesn't. He had a close relationship with God and was not embarrassed to share his what he believed. He sounds more like an Angel sent from God.The authors worked these characters together like they were at a quilting bee adding their special pieces to create a mystery family quilt and then adding their fine stitches to top it off and rounding it off by starting and ending with Grandma Rose. All pieces are original. Making this book a keepsake for me and other readers. Please don't ask who was my favorite character or my favorite author. It's my secret!I have several daughters and granddaughters and will pass this book to them. I am sure it will warm their hearts as well. I found the mystery of this book to be LOVE.I highly recommend this book.I rated this book 5 out of 5.Disclosure: I received a free copy of this book from Thomas Nelson/Litfuse Publicity Group for review. I was in no way compensated for this review. It is my honest opinion.If you found this review helpful vote yes or no ere."}, {"userName": "Julie Barrett", "userReviewDate": "May 06, 2013", "userURL": "http://www.goodreads.com/user/show/3023796-julie-barrett", "userReview": "Secretly Smitten by Colleen Coble, Kristin Billerbeck, Denise Hunter, Diann Hunt Each of the authors have a few chapters that pick up where the last chapter left off-with the same characters and story line.Between the lines by Colleen CableSmitten, VT romantic touristy town.At Natalie's baby shower the little girl playing in the attic finds her grandmothers beau dog tags and she says he died in the war so she married another man.The man used to live in Ryans house so Tess Thomas asks if she can help him clean out the attic-any news on David Hutchins, the owner of the dog tags. He takes a liking to her and enjoys having her around him and his daughter. He's a single dad.She runs the local bookstore and he and Sophia read a lot. Besides finding the clues about David the whole community is fixing up the train station in hopes they can get the trains to stop to boost their business. Love hearing all the handiwork that goes into repairing everything.Although there is a lot going on it's easy to keep track of the characters and their professions and their relationships.Easy going folks but there are obstacles to overcome..Make Me a Match by Kristin Billerbeck This section is mostly about Zoey Thomas and her new business. William Singer is the one who must adhere to rules and regulations and he finds fault with Zoe's renovations.She butts heads with him as she wants to cook for the shut-ins but he finds exposed wiring that is against the code for the building. She misunderstandings when the fire chief puts a halt to her meeting as there are too many people in one room...Faith in God helps her get through. The sisters also continue to follow the leads to David. Sometimes the lesson from God is the gift, what a great phrase!.Knit One, Love Two by Diann Hunt Love the name of this as I do knit. Anna Thomas runs the local yarn store and Mrs. Connors meets with others there and knits.Michael, works at a ski lodge, has shown up to pick up his mother after the meeting-he's just back from the Marines and they go to the same church.She's divorced from Joe and she's busy in her daughter's life's.She helps do errands for him when he injures his leg skiing. He shares that he's not been in contact with his son but has been trying to reach him. She shares about how she might want to raise sheep and be able to spin the yarn-for her store.Another mystery: someone buys things for single mothers with children and nobody knows who it is...Again misunderstandings take hold....Love Blooms by Denise HunterClaire Thomas runs the local nursery and loves planting things. The rest of her family had their loves and she has her plants.Ethan Forest she had found in her barn where she stored the tools. He was there to get out of the rain and to answer her ad for work.After she faints at work and he drives her home the rest of the family takes over with their remedies to get her better. It's the first long holiday weekend of the summer and the nursery is busy and her boss is back and she panics as she's not been there for several days.Ethan had taken over and everything was in perfect order, much to her surprise.It's been only a few weeks since the local chess player broke off with her saying she was boring...Ethan shared the family Sunday dinner and they get a chance to talk about their pasts.She learns about the ministry he and Luke were going to go after the war...He leaves before the centennial ceremonies and she realizes she is the only one alone, the others alone had had loves for years. she hadn't.Love how everything is wound together at the ceremonies...I received this book from Ocean State Libraries E-Zone"}, {"userName": "Nicole Rivera", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/5381184-nicole-rivera", "userReview": "Book Description: Summer, fall, winter, spring—Smitten, Vermont, is the place for love . . . and mystery!There’s a secret in Grandma Rose’s attic—a forgotten set of dog tags belonging to her first love. But David Hutchins was killed in action and never returned to Smitten. How did the dog tags end up in the attic?The mystery intrigues Rose’s three granddaughters—Tess, Clare, and Zoe—and they decide to investigate, though their mother, Anna, warns against meddling. But as the seasons turn and the mystery unravels, the three young women and their mother encounter some intriguing mystery men of their own. Has a sixty-year-old puzzle sparked something new for this close-knit family of women?Join popular romance novelists—and real-life BFFs—Colleen Coble, Kristin Billerbeck, Diann Hunt, and Denise Hunter for four delightful intertwined tales of mystery and sweet intrigue.My Thoughts: To be honest, in the first 54 pages I was struggling to get through this book. There are so many characters introduced so fast that I felt as if I was drinking water from a fire hose. In the first story of the book (it is broken down into 4 separate stories that interweave), there is a lot of head hoping. Sometimes we are in Tess' head and other times we are in Ryan's head. It went back and forth without really notifying the reader, which I found strange because the other books give page breaks to notify that we are switching character's points of view. There is a lot of inconsistency in the formatting between the books. Also, in the first book, there are a lot of repetitive words. For example the word, \"tin\" was used five times in a few lines. Additionally, in the first thirty or so pages some of the dialogue felt placed and artificial. There were a lot of typos throughout the book, i.e. sentences beginning with lower case letters. Very obvious stuff. Overall, I think the book could have used one more edit before being released. So then why did I give this book 4 stars? Well, once I got to page 56 my interest was grabbed. I started to fall for the characters (you could say I was smitten ;). Tess reminded me of a Christian Stephanie Plum. As a fan of the Stephanie Plum series, though not a fan of some elements of Plum's life, I felt it refreshing to get all the romance (and wit) without all the sleeping around. And, I was highly disappointed when Tess' section ended. But, then I found myself falling for Zoe's character, and then again for Anne, and finally for Clare. To me the most important part of a book is not necessarily how it is written, or that it is written perfectly, but that the story is captivating. This story was definitely that, and that is why I am giving it four stars. This is a great book to take to your local coffee shop or to curl up on the sofa with a hot cup of tea (or whatever you like). If you want a love story that is entertaining and mysterious, but leaves out the raunchiness, this book is for you. Smitten is an adorable town and I found myself wanting to be there. To walk the streets. To go to Sunday dinner at Mom's house. To visit the Mountain Perk coffee shop. A truly good story gets the reader so engaged that they want to be in it. Secretly Smitten is a truly good story and I can't wait for the next book!This books was provided for free from Thomas Nelson, through Booksneeze."}, {"userName": "Kathleen (Kat) Smith", "userReviewDate": "Jan 20, 2013", "userURL": "http://www.goodreads.com/user/show/4328680-kathleen-kat-smith", "userReview": "Welcome to Smitten, Vermont!!! Where romance is once again the air with many more couples bound to find love in surprising ways when they least expect it. Renown authors Colleen Coble, Kristin Billerbeck, Diann Hunt and Denise Hunter each take a turn charming our romantic hearts once again in four very different stories that are interwoven into each other, in the novel, Secretly Smitten.In Love Between the Lines by Colleen Coble, she introduces us to the first of the Thomas family women, Tess who runs the towns charming bookstore. She believes that there is no way the handsome and now eligible single father, Ryan Stevenson would ever fall for a plain old girl. After losing his beautiful and rich wife earlier and is now raising his young daughter Sophie alone, he finds solace and peace in Tess' girl next door personality who isn't afraid to just be herself. Can Ryan find a special love interest with Tess?Make Me a Match is the second story by Kristin Bellerbeck, who takes on the love life of Zoe Thomas, the youngest of the Thomas daughters who dreams of opening a match making service in town when the new business falls under the scrutiny of the new City Manager, William Singer. Will sparks fly between them or her building with faulty wiring?Knit One, Love Two by Diann Hunt, introduces us to the matriarch of the Thomas daughters where we meet Anna Thomas, mother to Tess, Zoe and Clare, as well as the owner of Sit N Knit. She finally meets what could be the man of her dreams, Michael Conner. Little does she know he lives next door caring for his mother, Emma who has been diagnosed with cancer. Will love find them when they least expect it?Love Blooms by Denise Hunter wraps up the love interest for Clare Thomas who truly believes love will remain elusive for her and her predictable and often boring ways. Just when even finding prospects at her sister, Zoe's match making business seems to come up short, she thinks her own company will be in raising plants and flowers for the town. While putting away tools one evening she comes across a homeless man, Ethan Foster, who will show her that love will often show up in the unlikeliest of places.I received Secretly Smitten by these four talents authors compliments of Litfuse Publicity and Thomas Nelson Publishers for my honest review. The common thread woven into all four of these romance stories is the mystery of what happened to the long lost love of their grandmother, Rose who learns that the man she believed was MIA is found thanks to the efforts of her granddaughters who believe that it's never too late for a lost love. A delightful series that takes readers into the little romantic town of Smitten and teaches us all that love can be found if we are willing to be open enough to let it find us. I rate this one a 5 out of 5 stars and can't wait to see what else these four talented authors will come up with next. Little by little we are slowly meeting each of the town's residents through each of these delightful books. While this book is the sequel to Smitten, you can read this one as a stand alone book but trust me, you'll want to get lost in all the love that this small town seems to have in big doses."}, {"userName": "☕ Kimberly ", "userReviewDate": "Jan 11, 2013", "userURL": "http://www.goodreads.com/user/show/5082615-kimberly", "userReview": "Last year I read the contemporary romance Smitten featuring three romances weaved into one book all surrounding the town of Smitten Vermont, so I was delighted to receive a copy of Secretly Smitten the second book in the series. This time we get four romances and I loved the diversity of their ages and the overall ARC surrounding the tale. I love small town romances and this lightly sprinkled faith-based tale made me smile.At a regular Sunday dinner gathering at Grandma Rose’s one of the grandkids discovers a set of dog-tags belong to David Hutchins. He was Grandma’s first love but was killed in action during the war. His tags were never recovered. So how did they end up in Grandma’s attic and why didn’t she know about it? Tess, Clare and Zoe decide to investigate and the three of them might just find love along the way. Anna their mother warns them not to meddle, but she too may have a change of heart.The first story belongs to Tess. She decides to ask the current resident of the Hutchins’s old homestead a smexy, widowed single father who owns the local cheese and ice cream factory if she can search his basement for clues. Tess a local book store owner is sweet, has some self-esteem issues and thinks she could never attract Ryan's attention. Children’s reading hour isn’t the only reason he keeps visiting the bookstore, and I adored their story.Zoe is the wild child and youngest sister, she flitters from one job to the next, helps the local shut-ins and decides to open up her own business. Newcomer William has been appointed by the town to check permits and ensure safety. When he discovers the wiring in her new business is a fire hazard, he finds himself on the wrong end of Zoe’s snark. This was sweet and I laughed as their story unfolded.Anna the girl's Mom owns the local yarn shop and finds herself annoyed by Michael her elderly customer’s son. But all men aren’t like her wondering ex-husband are they? The dance they engaged in was romantic and I laughed at some of her antics.My favorite story belongs to sensible Clair and the dark, motorcycle driving, tall drink of water Ethan. *swoons* Clair hates change and he has spent the past few years traveling. Ethan is ex-military and there is more to this vagabond then meets the eye. I loved how he unnerved Clair and how he handled the feuding elderly sisters. I needed an HEA, and quickly consumed their rocky romance. Then of course there is the story regarding those dog-tags and I loved hearing and learning about Rose’s first love. It added suspense and a little chaos. I loved spending time in Smitten and seeing old characters, and learning about new developments. I would love to live there and can just picture the main town square, with it's lights twinkling at night and the smell of fresh coffee in the air. The authors are all BFF’s in real life and they did a wonderful job of threading the tale and personalities together. This was the perfect rainy day escape and I thoroughly enjoyed these clean, small town romances.ARC provided for my unbiased review Kimba @ Caffeinated Book Reviewer"}, {"userName": "Deanna Gottreu", "userReviewDate": "Feb 27, 2013", "userURL": "http://www.goodreads.com/user/show/5365853-deanna-gottreu", "userReview": "Secretly Smitten by Colleen Coble, Kristin Billerbeck, Denise Hunter, and Diann Hunt is a collection of four novellas about three generations of women living in Smitten, Vermont. The mystery of the story begins when the young daughter of a cousin finds a pair of dog tags in Grandma Rose’s attic. The dog tags belonged to Grandma Rose’s first love but he was killed in Korea during the Korean War so the dog tags should not have been in the attic. Tess, Clare, and Zoe are determined to solve the mystery of the dog tags but their mother warns them against meddling.In Love Between the Lines, Colleen Coble tells the story of Tess who puts everyone else before herself and has no thoughts of marriage until Ryan, a widower with a young daughter, enters her life and then things start to change. Kristen Billerbeck continues the saga in Make Me a Match with the story of Zoe. People seem to think that Zoe has no ambition and are quite surprised when she opens her own business which is a match mating service. Through a freak accident, William, the new city manager, enters Zoe’s life and then the excitement begins. Anna’s story is told by Diann Hunt in Knit One, Love Two. Anna is the mother of the three girls and since her husband left her for a younger woman, she has put all thoughts of love and romance out of her mind. Life gets interesting when Michael comes into her knit shop to pick up some yarn for his mother. The last story, Love Blooms by Denise Hunter is the story of Clare who works in a landscaping business. On a stormy night she discovers Ethan in the back of a storage shed and even though he looks like a disreputable biker, she hires him to help in the business. Clare has low self-esteem but a fantastic gift for landscaping and Ethan urges her to open her own business.Sometimes when a book of novellas has more than one author the story line can become rather confusing. These four authors did such a fine job that I moved from one novella to the next forgetting that I had started reading the writings of a different author. The plot was well developed and the dialogue was so real and true to life. Through the character development in each story, I felt that each character was a personal friend. All human emotions were covered in the descriptions and scenes making me feel as if I were living each character’s life. The romance in the stories made them great stories but the mystery of the dog tags just added to my enjoyment of the book. I did not want the book to end for I felt as if I were leaving my friends and wanted to know more about their lives.I thoroughly enjoyed the book and would recommend to everyone who likes a great romantic story that also has an intriguing mystery. I plan to go back and read the first book in the Smitten series and am eagerly awaiting the third book.I received this book free from Thomas Nelson Publishers as part of their BookSneeze.com book review bloggers program. I was not required to write a positive review. The opinions I have expressed are my own."}, {"userName": "Victor Gentile", "userReviewDate": "Jan 30, 2013", "userURL": "http://www.goodreads.com/user/show/2528881-victor-gentile", "userReview": "Colleen Coble, Kristin Billerbeck, Diann Hunt and Denise Hunter in their new book “Secretly Smitten” Book Two in the Smitten series published by Thomas Nelson takes us back to Smitten, Vermont.From the back cover: Summer, fall, winter, spring—Smitten, Vermont, is the place for love . . . and mystery!There’s a secret in Grandma Rose’s attic—a forgotten set of dog tags belonging to her first love. But David Hutchins was killed in action and never returned to Smitten. How did the dog tags end up in the attic?The mystery intrigues Rose’s three granddaughters—Tess, Clare, and Zoe—and they decide to investigate, though their mother, Anna, warns against meddling. But as the seasons turn and the mystery unravels, the three young women and their mother encounter some intriguing mystery men of their own. Has a sixty-year-old puzzle sparked something new for this close-knit family of women?The four authors have joined together to bring us four stories about four friends that give us one complete story about one town that stretches over the four seasons. Colleen Coble starts it off with the story about Tess: Love Between The Lines. Then Kristin Billerbeck picks it up with the focus on Zoe: Make Me A Match. Diann Hunt takes the story over to Anna: Knit One, Love Two. And finally Denise Hunter rounds it out with the spotlight on Clare: All Along.Once again we fall in love with the town of Smitten and its people and wish there really were such a place to visit. It really is a terrific idea that these four friends had when they created this town that it is so easy to fall in love in. Technically, “Secretly Smitten” is one story that lasts a whole year told through the lives of the four women. So that means we get four tales of romance as we watch the town change and grow. All four authors know how to write characters that come alive off the page. While the stories focus on Anna and her three daughters the real mystery is with Grandma Rose and the dog-tags. Great storytelling, mystery and romance, what more could you ask for? I know: one more sequel! I recommend this book highly!If you would like to listen to interviews with other authors and professionals please go to www.kingdomhighlights.org where they are available On Demand.To listen to 24 hours non-stop, commercial free Christian music please visit our internet radio station www.kingdomairwaves.orgDisclosure of Material Connection: I received this book free from Thomas Nelson. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255  : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Shahenda Khaled", "userReviewDate": "Mar 25, 2015", "userURL": "http://www.goodreads.com/user/show/26095668-shahenda-khaled", "userReview": "I don't really read a lot of short stories, not at all really. I liked reading one each day, it kept me feeling like I'm reading books without really the urgency to know what happens because, well, it's over pretty fast. It was perfect for my midterms period and maybe I'll repeat the experience.Love Between The Lines by Colleen Coble: 2/5 stars.That story was really pointless. I get they're all romantic stories and I appreciated the lack of insta-love, but I was eager to get it over with. It was predictable and it didn't work for me.Make Me A Match by Kristin Billerbeck: 4.5/5 stars.I loved Zoe and her passion for love and how that sometimes blinds her. She has a pure heart and I felt it in what she does and how she treats people. I loved how protective she is of her town and friends from people she thinks they don't understand, like Will. I loved their relationship, how it progressed and the banter, but there was the insta-love here that made me cringe a bit because it's the only thing that's out of character for both of them.Knit One, Love Two by Diann Hunt: 3/5 stars.I don't really know what to say. It was a nice story, I didn't see in Anna what Zoe and Tess have been saying in the preceding two stories about how she doesn't encourage them and how she doesn't advise them. I found her trying to be their mother and at the same time give them freedom to do what they want, but she worries you know? It was nice seeing her having her share of happiness after losing hope in another chance.Love Blooms by Denise Hunter: 5/5 stars.I fell in love with this story. I loved Clare from the other stories and I was so excited to see her in her own. I felt like Ethan was kind of perfect for her and how each of them need their time to build trust for the other and to untie themselves from previous beliefs that have been pulling them down. I seriously didn't want this to end.I have to say that after reading the first three stories I was kind of doubting myself. Is it the stories or am I not shaped for the short ones? I need more development, more insight to the characters, and maybe short stories are all like this. However, after the last one I was sure that they can be awesome. Maybe it was my low expectations that made Love Blooms so good in my opinion but now I'm willing to try this form of literature again. I think, though, that it's very tricky. There are a lot of things to be done in a story, I have to like the characters and see the setting and care for the plot, and that might be hard to be put in a few pages. I liked reading this book, only because it introduced my mind to a whole new concept of writing."}, {"userName": "Sylvia", "userReviewDate": "Jan 03, 2013", "userURL": "http://www.goodreads.com/user/show/6047895-sylvia", "userReview": "Four fiction authors with four smitten romance novellas, share a setting, characters, and even overlapping plots with fun small town romance. The mystery of the dog tags that were found in Grandma Rose's attic continues throughout all the sections along with mini story lines of Tess, Clare, Zoe and Anna. We learn a lot about each woman's fears and dreams. Together they find the courage to face their fears and see their dream come true. One storyline, with four sections, by four different authors. I enjoyed reading each authors take on the same story. Each section focused on a different character and her love life. Four different protagonists from a single household, \"Secretly Smitten\" read like a single novel.LOVE BETWEEN THE LINES: Colleen Coble wins awards with murder mystery/romance. Not surprising this romance involves a dead man, but a twist of one potentially again alive. Love with suspense propensity. There's a secret in Grandma Rose's attic--a forgotten set of dog tags belonging to her first love. But David Hutchins was killed in action and never returned to Smitten. How did the dog tags end up in the attic?MAKE ME A MATCH: Kristin Billerbeck has Smitten's matchmaker Zoe begin her Cupid's shop in an old building and William, new city manager, must enforce rules and codes. KNIT ONE, LOVE TWO: Diann Hunt places readers inside the Sit `n Knit shop owned by Anna (divorced mom of 3 single adult girls) where she turns a little unraveled when Michael enters for a shopping spree. A revealed secret causes tempers to fly.LOVE BLOOMS: Denise Hunter writes of nursery manager Clare waving a rake as a weapon against a tool shed-hiding hunk of a man, Ethan. All secrets, mystery, conflict, and Smitten romance is cozy-wrapped. I was ready to read something fun and it’s true each novella begins with a conflicting relationship that is predictably to end in romance. After all, it is a novella with great storytelling. I recommend this book for who needs a fun romance to read. It's good Christian fiction, folks, so expect wholesome lust. I received this eBook from Thomas Nelson in the BookSneeze blogger program for my review."}, {"userName": "Glenda", "userReviewDate": "Feb 10, 2013", "userURL": "http://www.goodreads.com/user/show/4897564-glenda", "userReview": "Secretly Smitten by: Colleen Coble, Diann Hunt, Denise Hunter and Kristin BillberbeckI really wish this book was about 400 pages longer, I so enjoyed this visit to Smitten. In this visit we had a nice visit with Rose and her sister Violet and learned of secrets hidden for decades.Zoe and William are adorable couple and just fit together beautifully it was fun to read about the new jobs/business and how these two complement each other.I have a feeling we will be hearing a bit more about Tess and Ryan, they both have very high regards for each other and there is a strong attraction between them as they team up to solve the mysteries surrounding her grandmothers first love. The more time they spend together the more they learn how much they know about each other and how much they enjoy each other's company. It does not take them long to figure out that they have wasted a lot of time by not sharing their feeling with each other.Anna and Michael(now here is one really great guy and lady for that matter)just should have met 35 years earlier they were destined to be together they seem to be kindred spirits, so gentle with each other. Just as Rose and Davy(David Hutchins)were such an important part of each other's life just shows love never ends theirs is a story of a long lost love. Can time heal all?But I admit I'm in love with Ethan and think Clair is one very lucky lady! I think I could read a novel on just these two, there is just something pretty special about Ethan it's as if he is one of the Lords Angels sent here to bring the best out of the people he meets, talk about a keeper..............I am so looking forward to the \"Return of Smitten\"! these (authors)ladies have my support and love and prayers I truly admire each of you!"}], "description": "Summer, fall, winter, spring-Smitten, Vermont, is the place for love and mystery!", "title": "Secretly Smitten\n      \n          (Smitten #2)", "url": "http://www.goodreads.com/book/show/15760496-secretly-smitten", "average": 3.94, "cover": "https://images.gr-assets.com/books/1348640256l/15760496.jpg", "reviews": 154, "authors": [{"url": "https://www.goodreads.com/author/show/33227.Colleen_Coble", "name": "Colleen Coble"}, {"url": "https://www.goodreads.com/author/show/70495.Denise_Hunter", "name": "Denise Hunter"}, {"url": "https://www.goodreads.com/author/show/127433.Kristin_Billerbeck", "name": "Kristin Billerbeck"}, {"url": "https://www.goodreads.com/author/show/81856.Diann_Hunt", "name": "Diann Hunt"}], "type": ["Romance", "Christian", "Contemporary", "Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/15760496-secretly-smitten", "http://www.goodreads.com/book/show/16158374-secretly-smitten", "http://www.goodreads.com/book/show/6605726-the-lightkeeper-s-daughter", "http://www.goodreads.com/book/show/2896711-lonestar-sanctuary", "http://www.goodreads.com/book/show/11942636-blue-moon-promise", "http://www.goodreads.com/book/show/15869688-without-a-trace", "http://www.goodreads.com/book/show/13033553-tidewater-inn"]}