{"ratings": 41295, "userreviews": [{"userName": "Jessica's Totally Over The Top Book Obsession", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/28967089-jessica-s-totally-over-the-top-book-obsession", "userReview": "4.5 I love you Dammit Stars***********Spoilers**********\n“You…you mustn’t stare at me like that.” Soft as the murmur was, he caught it. “With you here, nothing else is worth looking at.” -Annabelle and SimonI love Lisa Kleypas! Now a little while back I bought the whole Hathaways series for 4.00 and it was my first taste of Lisa Kleypas. I fell madly in love with all the Hathaways and when I finished that series I went to goodreads to find more books by LK to read. That was when I found out that The Wallflower series is connected to the Hathaway series and was suppose to be read first. Oops. Of course I went out to every book store I know and found the whole Wallflowers series for a 1.00 each. It was such a good buy! I enjoyed Secrets Of A Summer Night!!! It was everything I love about LK's books. Annabelle and Simon's story was so very sweet. \n“Let me spoil you,” he whispered. “Let me take care of you. You’ve never had anyone to lean on, have you? I’ve got strong shoulders, Annabelle.”-SimonAnnabelle took me a bit to warm up to. At first I wanted to shake Annabelle because she was so snobby and full of self importance. I hated the way she looked down at Simon like he wasn't good enough for her just because he wasn't peer. But slowly she realized that she was a prejudice snob and that Simon was great. And as she grew as a person she grew on me as well. I ended up loving her. She turned out to be a brave, sweet, and loyal. Simon omg Simon!!!! He was amazing and made the book for me. I love a man that knows what he wants and goes for it. I got that in spades with Simon. He seen Annabelle and he set out to have her. Period! He went after her like a lion going for a gazelle. Simon was sexy, sweet, honest to the point of rude at times, possessive, and confident. I loved how he slowly broke down all Annabelle's walls and worked his way into her heart. He could see the wonderful person she was underneath. I also loved that he seen her worth when all the other men seen a broke woman they could take a vantage of. But the thing that melted my heart was that Simon thought she was sleeping with a man for money and didn't care that she wasn't a virgin he still wanted to marry her and take care of her. Of course she was a virgin he was wrong but the point was it didn't matter to him. \n“I love you, dammit.” She brushed her lips teasingly against his. “How much?” He made a slight sound, as if the soft kiss had affected him intensely. “Without limit. Beyond forever.” “I love you more,”-Simon and AnnabelleSimon and Annabelle's relationship was a slow burn since at first she would snub him. But they had serious passion. I felt they had a great build up to a sweet love. It felt real. Simon was so sweet to Annabelle after they were married. He really took care of her and her family. And Annabelle fell hard for her husband. They both had a playful side that was cute. One of my favorite things about this book was the friendship between Annabelle and her fellow Wallflowers Lillian, Daisy, and Evie. They were a funny band of misfits hell bent on finding husbands and helping each other in any way they could. My favorite of the group was Lillian. She was so outspoken and foul mouthed. I loved how her and Earl Westcliff (Marcus) butted heads and took a dislike to each other. There was some major passion burning under all that hate and I can't wait to read their book! This was a sweet, romantic read and I loved it! I only took off a 1/2 star for Annabelle's snobby attitude because I wish she would have changed sooner. Other than that it was perfect! These 2 quotes just sums it up so nicely!! They are my favorite quotes of the whole book!“I realized something,” she said huskily, “when I was standing outside the foundry, watching it burn and knowing you were inside.” She swallowed hard against the thickness in her throat. “I would rather have died in your arms, Simon, than face a lifetime without you. All those endless years… all those winters, summers… a hundred seasons of wanting you and never having you. Growing old, while you stayed eternally young in my memories.” She bit her lip and shook her head, while her eyes flooded. “I was wrong when I told you that I didn’t know where I belonged. I do. With you, Simon. Nothing matters except being with you. You’re stuck with me forever, and I’ll never listen when you tell me to go.” -Annabelle“My God, I can’t stand this! I can’t let you go out every day, fearing every minute that something might happen to you, knowing that every ounce of sanity I’ve got left is hinged on your well-being. I can’t feel this way…it’s too strong…oh, hell. I’ll turn into a raving lunatic. I’ll never be of use to anyone again. If I could just reduce it somehow…love you only half this much…I might be able to live with it.”-Simon"}, {"userName": "Penny Reid", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/18630626-penny-reid", "userReview": "The first time I read this book (in 2012) I didn't appreciate it. I'd just plowed through a bunch of historical romances and this one blended in with the crowd.OMG I WAS SO WRONG!!!!!!!!!!!!!!! This book is magic. I loved it. A LOT. The push/pull between the two main characters was masterfully done. The tension of Annabelle's circumstances (and Simon's ignorance of her circumstances) was so perfect. I loved both of these characters so much. The perfect blend of tragedy, suspense, humor, romance. This book is (and has) everything. It's basically flawless."}, {"userName": "Alp", "userReviewDate": "May 18, 2016", "userURL": "http://www.goodreads.com/user/show/26653561-alp", "userReview": "What a wonderful story!This was another gem from one of my favorite authors. As always, Lisa Kleypas never ever fails me. Secrets of A Summer Night had me hooked from the very start, enraptured me in a way that I never imagined, and I found myself having a hard time putting it down.I loved Simon Hunt! He’s strong, smart, swoon-worthy, and sweet. Yet he could be a bad boy at times. No matter how rich he is, the peers have never accepted him as one of themselves. For the fact that he was born a commoner, a butcher’s son, he knows exactly who he is and never pretends to be someone he’s not. He was attracted to Annabelle since the first time he laid eyes on her and he couldn’t get her out of his mind. Two years later, Annabelle had remained unwed and Simon was more than ready to claim her as his own.\n“I’ve wanted you since the first moment I saw you standing outside that panorama, digging for coins in your purse. I couldn’t take my eyes from you. I could hardly believe you were real.”\nAnnabelle Peyton and her family were in desperate straits. Marrying a wealthy nobleman was the only way for her to save her mother and her brother. I was surprised at how much I enjoyed her character. She’s strong-willed, independent, and smart. Despite her lack of dowry, the way she ignored Simon’s offer was a reflection of the value she placed on herself.It was so sweet seeing Simon taking care of Annabelle in a time of need. And it was so lovely that their feelings grew stronger and deeper for each other with each moment they shared together. I loved the sizzling chemistry between them and how they couldn’t keep their hands off each other and certainly, the way they kissed. **Melt** Not to mention their steamy hot and passionate sexy times.\n“I have no self-control where you’re concerned. Every minute that I’m not with you, all I can think about is being inside you. I hate everything that keeps you separate from me.”\nThis was a very well-written and heartwarming story with an engaging plot, adorable characters, and breathtakingly beautiful romance. It was hilarious, refreshing, and touching all at the same time. Simon and Annabelle’s love story made my heart swell and the ending brought tears to my eyes. The banter between the 4 wallflowers was witty and true to life.I don’t want to say much more because this is a book you should read it for yourself.By the way, this was a very good historical romance story. I was overjoyed that I decided to pick up this one. Loved it!----------------------------------------**Thanks for the buddy read, lovely Ally."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Oct 30, 2008", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "[image error]"}, {"userName": "Auntee", "userReviewDate": "May 10, 2008", "userURL": "http://www.goodreads.com/user/show/886675-auntee", "userReview": "First of all, a big fat boot in the rear (to me) for letting this gem languish in the TBR for so long! Why am I so stubborn? So I have drifted away from historicals, but c'mon, this is Kleypas--I should've known better! I've loved so many of her books, and her heroes are some of my all time favorite romance heroes (Zachary Bronson, Jack Devlin, Derek Craven)--now I can add one more to the list--the deliciously sexy Simon Hunt (be still my heart)! I loved this guy! Talk about swoon-worthy! I'm telling you, there was a time or two that I was wondering if Annabelle Peyton had rocks for brains, rebuffing Mr. Hunt--who wants to marry a 'peer' when you can have Simon (even if he was not the 'marrying type')?I know Annabelle had her mind set on marrying a peer to get out of a horrible financial predicament, and Simon (son of a working class butcher) was anything but. But there was this sizzling attraction, even though she didn't want there to be. This book was just filled with sexual tension, and had me on the edge, just wondering when (and how) Annabelle was going to give in to the temptation that was Simon. So he wasn't a peer, he wasn't the marrying kind, he wasn't in her social class (even though he was filthy rich due to hard work), he wasn't the physical ideal (he was big and brawny and rough looking), and she thought of him as ill-bred...but she couldn't deny the connection that they had. I loved the verbal sparring that they did, loved the whole Scarlett/Rhett vibe, loved how she tried to put him in his place and loved how he came back for more, and wouldn't be denied. He wanted Annabelle and he was going to have her!What else did I love? Her relationship with the other \"Wallflowers\". The scenes with the bold Americans Lillian and Daisy Bowman, and the shy, stuttering Evie Jenner were some of my favorite (non-Simon) scenes in the book. It was so funny how they plotted to snag an appropriate husband for Annabelle (not that I approved of their methods--but their conversations were often hilarious)! And their game of 'Rounders' (which sounds like baseball) where they played in their drawers, only to be seen by Lord Westcliff and Simon? So well written--loved the defiance shown by Annabelle and Lillian!*******spoilers********But my favorite scenes were the ones involving Annabelle and Simon. The extended chess game (*sigh*), the tending to Annabelle after the snake bite (*sigh*), the purchase of the boots (*sigh*), and the honeymoon (Yowza!)...and the bit of suspense at the end, and the declaration(s) of love? P-e-r-f-e-c-t-i-o-n.Oh, I could go on and on, but I'm dying to start \"It Happened One Autumn\"--I want to see the stuffy Lord Westcliff redeem himself in my eyes. For this first book of The Wallflowers series--5 big stars!\nMy idea for Simon"}, {"userName": "Rachel Reads Ravenously", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/14514998-rachel-reads-ravenously", "userReview": "4 stars!   “Having regrets is the only sign that you’ve done anything interesting with your life.”  The first book in the Wallflower series, Secrets of a Summer Night is about Annabelle, a beautiful woman searching for a husband, but her family’s financial troubles prevent this. No man wants to marry a woman with no dowry, but Annabelle must marry soon to prevent her family from being put out on the streets.Annabelle’s only luck seems to be with Simon Hunt, a man not of the nobility, but one who mad a great deal of money is business. He’s unrefined, blunt and even worse, he does not want Annabelle for his wife but as his mistress. Befriending three other wallflowers at a ball, they make a pact to help get every single one of them married, and first up is Annabelle as this is her last season to find a husband. They concoct a plan, and hopefully they’re mischievous ways will work!  “I spent most of my youth hauling sides of beef and pork to my father's shop. Carrying you is far more enjoyable.\"\"How sweet,\" Annabelle mumbled sickly, her eyes closed. \"Every woman dreams of being told that she's preferable to a dead cow.”  Historical romance is not my go to genre, but it’s so fun to dabble in from time to time. Lisa Kleypas is an author I really click with because I don’t end up rolling my eyes at the language or actions of the characters. She does her research really well, and is able to make a smooth transition into whatever time period she places her books in.I also normally don’t like Cinderella stories, and the rags to riches trope. But I loved Annabelle as a character, she was strong but had morals and pride. Her relationship with Hunt was a hate to love kind of story where over time the two get to know each other and fall in love, rather than love at first sight and it worked for me.Beautifully written, I cannot wait to read the rest of the Wallflower books (disclaimer I’ve read Devil in Winter and Again the Magic, but I still really want to read the other two books). This book was exactly what I needed to read at exactly the right time.  “I'm coming to believe that there are two kinds of people... those who choose to be masters of their own fate and those who wait in chairs while other dance. I would rather be one of the former than the latter.”  Follow me on ♥ Facebook ♥ Blog ♥ Instagram ♥ Twitter ♥"}, {"userName": "Heather K (dentist in my spare time)", "userReviewDate": "Sep 16, 2014", "userURL": "http://www.goodreads.com/user/show/13070326-heather-k-dentist-in-my-spare-time", "userReview": "Finally, FINALLY, a Lisa Kleypas book that I actually like! I'm not broken after all!I was beginning to think that perhaps I was the only person on earth to hate Lisa Kleypas. I 2-starred both Suddenly You and Somewhere I'll Find You, and I was really ready to just throw in the towel. However, I already owned Secrets of a Summer Night so I figured I would try one more time. #bathtubbookAnd I'm soooo happy that I gave this one a try. This was a great story with a complex H and h, a great set of side characters, and a romance that developed slowly over time. Despite some awkwardness between the two MCs at the 80% mark or so, the romance was simply divine. I think I found the first Kleypas series I can get behind. Here's to hoping the rest of the books in the series will be winners too."}, {"userName": "Christina ~ Brunette Reader", "userReviewDate": "Mar 09, 2017", "userURL": "http://www.goodreads.com/user/show/19958389-christina-brunette-reader", "userReview": "Finally getting around this vintage Kleypas. I found it much better written and engaging than her latest historical offerings, which I recently read, though I must also admit I enjoyed Secrets of a Summer Night more as a fun series set-up than for the romance itself.Long story short, Annabelle Payton is a genteel but destitute beauty who needs to marry for money, quickly. Simon Hunt wants her, he's handsome and now filthy rich, and well-connected into the Ton, but remains a cleaned-up butcher's son, therefore he won't do. No, no and no! *stomps dainty foot*Oh, conflicts that shouldn't be conflicts, how many innumerable romance books have they spawned?She must be a manipulative uppity lightskirt because... she just is and is been giving me the cold-shoulder for the last couple of Seasons!! He must be a selfish, unsuitable boor because... reasons!!Let's see how long it takes her to become desperate enough to accept a \"would you be my mistress\" proposition. Let's see if I can be the Self-Victimising Queen of the year (1843, by the way).A little more pragmatism from the heroine's part and a little less cynicism from the hero's and this book would have ended by what, page 50? I understand the need of a plot, and this type of scenario can be a legitimate one as any, but at the same time I've never been fond of storylines where each lead is ready to uncritically assume the worst about the other almost at first sight, so it was hard for me to warm up to both Annabelle and Simon. They eventually come to their senses pretty soon, it's a romance after all, though despite the unconvincing villain sub-thread kicking in to infuse some action, the gist of things seemed to boil down to the basic fact that the heroine had to reconsider her morals and overcome her snobbery about the hero's origins. Meh.That said, this is still a quite satisfying read, just not as outstanding as I was hoping for. The writing flowed, there were some nice touches of humour and Kleypas's ability to convey the couple's chemistry and sensuality always top rate, if here somehow disjointed from the emotional progression. The best parts were the scenes involving the secondary characters and their relationship with the protagonists and reading about how the four Wallflowers meet and become a team was really enjoyable. Same goes for Simon's interactions with two future heroes, which also give deeper background information on the \"world\" the author has created for this series and which sound like very promising material for the following books."}, {"userName": "Phrynne", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "This is my kind of leisure reading, a good historical romance, well written with charming characters and a lot of witty dialogue. I very much enjoyed the romance between the two main characters and loved the friendship between the four Wallflowers. The story was really entertaining and full of drama. Loved it:)I am looking forward now to the rest of the series!"}, {"userName": "Ingela", "userReviewDate": "Sep 07, 2014", "userURL": "http://www.goodreads.com/user/show/15589375-ingela", "userReview": "Written April 5, 20154 Stars - Charming, steamy and much chuckling fun. These determined 'Wallflowers' are women to admireYet another amusing 'Wallflowers' HR as audiobook (11 hrs) narrated by always excellent Rosalyn Landor. (You get this one for just $7 incl. the e-book / kindle at Amazon right now.) \nWell done, well narrated, very entertaining HRI liked the of many readers so much beloved Devil in Winter (#3 - 3.9 stars) some weeks ago and this series instalment was just as well written, funny and filled with interesting characters. Looking forward to read about the American sisters and their way to love soon too. ***********************************************************London, 1843Secrets of a Summer Night is the first 'Wallflowers' part and it is about the beautiful Annabelle Peyton. A 25 years old woman in a urgent need of a (rich) suitable husband. She has tried in several seasons to find a match to 'save' her mother and younger brother. But without wealth, assets, other than a pretty face, in her bride coffin it is quite hopeless.Mr. Simon Hunt is a new player in the ballrooms that has an \"good eye\" (an lust..) for Annabelle. Once was Simon just the local butcher’s son but is by now both very wealthy and powerful. Nevertheless maybe not the \"right\" kind of admirer for a well born young lady like Annabelle. In her opinion anyway. ‘What was she doing? Continuing this game, maintaining even this fragile communication with him, was pointless. No …it was dangerous. There was no choice to be made between safety and disaster.’***********************************************************What I maybe like most about this book is that our heroine here isn't always a good & nice girl. Annabelle is both pretty self-absorbed and indeed selfish. Well not always, sure she cares about her mother, brother and girlfriends (these interesting three other Wallflowers) but she also has some narrow-minded preconceptions, she often look down on others and are incredibly snobby when it comes to social class and the nobility. Though it's fun, I actually like the privilege to avoid having to face another admirable good-hearted young historical heroine occasionally. Thus said, so fits course this little rougher, harder and cynical \"working class\" hero, Simon Hunt, her perfectly. They are like two confused magnets that lost each other and yet still not understood it.\n .. ‘Annabelle could hardly fail to note the differences between them. Hunt looked positively swarthy in the gathering dusk, big and potently masculine, with the eyes of a pirate and the casually ruthless air of a pagan king. He was no less arrogant than he had ever been…no tamer, no more refined…and yet somehow he had become the object of such all- consuming desire that Annabelle was certain she had lost her mind.’\nWas it really that bad back in 1840s?Another common beliefs in this particular historical, that really surprises me, is that the men here seem to think it is completely cool to wait out attractive women as 'poor' Annabelle until they were irremediable spinsters. Then they could be bought cheaply as dependent mistresses (sex-slaves) at a more convenient way than as spouses. The strong women's rights part in me wanted to scream and yell. ~ Ugh, for cold-hearted self-righteous men. Thanksgod Mr Hunt was a true gentleman, surprisingly but he did the 'right' thing, in the end. ***********************************************************Ms Kleypas is maybe not my absolute number #1 favorite in this HR genre but her books are nevertheless amusing and very steamy stories. There will be many more. “Having regrets is the only sign that you’ve done anything interesting with your life.”I LIKE - good historical romances in my headphones"}, {"userName": "Shawna", "userReviewDate": "Mar 20, 2009", "userURL": "http://www.goodreads.com/user/show/1802746-shawna", "userReview": "5+ stars – Historical RomanceThis is a great start to a fun, dazzlingly romantic series about four young ladies with very different personalities and backgrounds entering society who form a deep bond of friendship that grounds them as they traverse the rocky course of relationships and husband hunting in stuffy Victorian era England.Beautiful Annabelle Peyton is determined to find a wealthy suitor with a high position in society to wed in order to save her family from financial ruin. Simon Hunt is a commoner with a self-made empire of vast wealth and power who infuriates and tempts her at every turn. He makes it clear that although he wants to be the one to introduce Annabelle to the wonders of passion, he won’t offer her marriage. Of course, it doesn’t take long before he falls hard for Annabelle, but can Simon and her friends, the wallflowers, convince her to take a chance on a love match?Simon is such a butter-melting, swoon-worthy, amazing, romantic, and devoted hero...just yum! It’s a wonderful start to a truly amazing series! Big 5 stars!"}, {"userName": "Jen ", "userReviewDate": "Mar 25, 2012", "userURL": "http://www.goodreads.com/user/show/5962787-jen", "userReview": "I've put off reading this series for so long and I have no idea why! I read the Hathaway books and thought nothing in the HR world could compare. Was I being a tad too judgmental? Maybe. Am I questioning my fierce love of the Hathaway clan? Hell no! Cam's a delicious bit of man and remains to this day one of my favorite book boyfriends.That being said, I'm adding Simon Hunt to that list. Tall, dark, brooding and \"commanding\" in certain areas of his life *ahem*. Oh hell yes! Annabelle was a fantastic match for him and I loved the give and take of their relationship until they finally both (thank you, baby Jesus!) gave in and experienced the wonderful. Well done again, Ms. Kleypas. I look forward to reading the rest of this series."}, {"userName": "María Ángeles", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/23830302-mar-a-ngeles", "userReview": "De los que te enganchan desde el principio y que son un placer leer.Primer libro leído de Kleipas. Ya era hora..."}, {"userName": "Ronyell", "userReviewDate": "Feb 07, 2011", "userURL": "http://www.goodreads.com/user/show/1169488-ronyell", "userReview": "Why is it every time that I read a book by Lisa Kleypas, I am always so into the characters and the situations that surrounds them? Well, the answer to that is that Lisa Kleypas is clearly a brilliant romance writer and reading many of her books has been an awesome experience that I have enjoyed doing over and over again! This time, I have read the first book in Lisa Kleypas’ “Wallflower” series called “Secrets of a Summer Night” and it is surely full of drama, thrills and hot romance that will surely put any romance fan in a soothing mood!Annabelle Peyton, well known for being a wallflower in London society, vows to seek a worthy husband to cover her family’s debt since she does not have a dowry that would make her worthy in any nobleman’s eyes. However, Annabelle has her sights set on Lord Kendall, a lord who is currently unmarried, but suddenly, Annabelle realizes that Simon Hunt, a mysterious man that Annabelle met years ago, is also after her heart and plans to make Annabelle his alone! Will Annabelle allow Simon into her life? Read this book to find out!Oh my goodness! Words cannot describe how much I loved this book from Lisa Kleypas’ popular “Wallflower” series! Lisa Kleypas has done an excellent job at writing this romantic tale of what true love is all about! What I really loved about this book were the characters themselves, especially Annabelle Peyton and Simon Hunt as they are both strong and interesting characters! Let me start with Simon Hunt first since I am really interested in his character. Simon Hunt is easily one of the best romance heroes ever created because not only does he have an awesome muscular body that makes him somewhat of a superhuman, but he has a heart full of gold as he deeply cares for Annabelle during her time of need and he is willing to put his life in the line if anything happens to Annabelle and it was that personality trait of Simon’s that made me really love his character. I have briefly mentioned about Simon’s muscular body and I just love any romance hero who has muscles of steel, especially in the case of Simon as Lisa Kleypas makes sure that the audience knows how hard Simon’s muscles are! Another character I really loved in this book was Annabelle Peyton herself as she is clearly a strong and independent woman who does not let anyone get in the way of her goal of obtaining a husband. I will admit at first that I got a little annoyed with Annabelle always dismissing Simon, even though it is clear from the get go that Simon is a seriously pleasant man, but once she found out what a gentle and loyal man Simon is, she cared as much for Simon as Simon did for her and I was just so amazed at the lengths that Annabelle took to protect Simon! I also loved the brief little relationship between Lord Westcliff and Lillian Bowman as they clearly hate each other, but I guess once I read the rest of the “Wallflower” series, they might change their tune. And let us not forget about the sizzling love making scenes between Annabelle and Simon as they are extremely out of this world hot and they provide the best love making dialogues I have ever read from any romance novel like:“I want to make you scream and claw and faint in my arms.”For anyone who do not like reading about sex scenes in a book, this book has many sex scenes between Annabelle and Simon and it would be best to skip over these scenes if they are uncomfortable to read through.Overall, “Secrets of a Summer Night” is a clearly extraordinary book from the great romantic mind of Lisa Kleypas that all romance novel fans will enjoy for many years to come!Review is also on: Rabbit Ears Book Blog"}, {"userName": "Suzanne (Under the Covers Book blog)", "userReviewDate": "Apr 13, 2010", "userURL": "http://www.goodreads.com/user/show/3575839-suzanne-under-the-covers-book-blog", "userReview": "Miss Annabelle Payton, Miss Lillian Bowman, Miss Evangeline Jenner and Miss Daisy Bowman are regular sights at the peripheral of a ballroom. With each young lady having oddities and foibles that make them untenable to the bachelors of the ton. However, they strike up an unlikely friendship each vowing to help the others out to find a husband by means fair and foul. With the beautiful and spirited Annabelle being the first...Miss Annabelle Payton’s family are on the knife edge of poverty, to stop these dire straits Annabelle must marry and marry well. However, with no dowry to speak and it approaching her fourth season it is becoming nigh on impossible to catch a husband, let alone a peer of the realm. Instead she is starting to receive more dishonourable offers of becoming a mistress, offers that it seems she may have to consider if things don't change soon. One of these men is a Mr Simon Hunt, who has been longing for Annabelle for two long years, despite her repeated rebuffs, but he soon sees his opportunity when they are both invited to the country for a house party. However the Wallflowers also see the same opportunity for Annabelle to find a suitable husband. Let the games begin...This is one of my favourite series, and Mr Simon Hunt is one of my favourite heroes. He is a self made man, a son of a butcher who has made his fortune in financial speculation and then on the blossoming trade of the railway. However, no matter how rich he is, he still will never fit in with the upper echelons of society, something that bothers him not at all. He is blunt, honest and very sure of himself (aka arrogant), how could you not love him? He also has some very dishonourable intentions toward Annabelle...to begin with, I love that as the book goes on his feelings towards Annabelle deepen; in this book it is more a case of lust at first sight rather than love. That is why I loved that Annabelle was such a strong heroine, I think if she was a weaker person and gave in to Simon at the beginning then this story would have been vastly different, and not so happily resolved. The love story between these two was very passionate and there were some hot sex scenes in the book (one in a linen closet, which is most definately my favourite!) which added nicely to the couples growing affection for each other.I also liked the introduction to the other Wallflowers, each having their own very distinct personalities and I look forward to reading Lillian’s book next. One of my favourite parts of the book was when the girls were playing rounders-in-knickers, it was a very funny scene that never fails to have me in fits of giggles.This book is very polished and well written, especially the dialogue, the interactions between the characters are really good, sometimes funny, sometimes intense and other times romantic. The conversations and banter between the wallflowers especially Lillian and Daisy Bowman shows their relationship of teasing and close sisters perfectly, and the conversations between Annabelle and Simon are equally sharp and witty. As well as this the language is elegant and seems very much in keeping with the language of the day, this isn’t a contemporary book dressed in a historical setting. LK gets her setting very well with enough detail to keep it interesting but not bogging you down in details about that historical period.I have read this book many times and it is one of my favourite series a must read for those who love romance, especially Historical Romance. ﻿"}, {"userName": "Mo", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/11856352-mo", "userReview": "I liked this one, a lot. Simon, a self-made man. Born the son of a butcher, he has worked hard to make his money and his place in society. OK, he will never be a nobleman but, honestly, who would want to be. But status matters to some ... and it matters to Annabelle. She needs to marry and marry well. Her family's finances are dwindling fast.\nHe did not strike her as a trustworthy man ... in fact, for all his elegant clothes and polished appearance, he didn't seem quite civilised.He was the kind of man that a well-bred woman would never want to be alone with.\nI really liked Simon. He wasn't afraid pursue Annabelle and show his feeling for her. This is the first book in a 4 book series. Next up is her \"American\" friend. That should be interesting. \n\"It is said that you can never really know someone until you play chess with him.\"\nI suppose there was no real drama in this book, like there was in the last couple of Historicals I read. It was a nice change. \n\"Every time I see you,\" he murmured, \"I think you couldn't possibly become any more beautiful -- and you always prove me wrong.\"\nSigh"}, {"userName": "UniquelyMoi ~ BlithelyBookish", "userReviewDate": "Oct 25, 2009", "userURL": "http://www.goodreads.com/user/show/1113032-uniquelymoi-blithelybookish", "userReview": "My Review::This was a very easy, enjoyable read and though it seemed to drag in the beginning, I did learn things about class distinction that I had not been aware of.I am adding Simon Hunt to my rapidly growing list of favorite heroes, but I can't tell you how many times I wanted to kick Annabelle to the curb. Hmmm...did they have curbs back then? Well, if the did she would have found herself sitting on one had I had my way.I enjoyed the devious banter between the wallflowers, Annabelle, Lillian, Evie and Daisy. I thought they balanced each other nicely. I loved that they were not willing to sit idly by while life moved on without them, and their witty insights and plottings made this a fun read.Simon Hunt should be given Sainthood for the amount of patience he showed while waiting for Annabelle to come to her senses and realize that he wasn't the bottom of the barrel. I was a tad disappointed in him and his readiness to make her into his mistress rather than make a marriage proposal, but hey, it all worked out in the end which is where it matters most.I'm moving forward with It Happened One Autumn and can't wait to see Lillian and Marcus drive themselves insane with their attempts to annoy one another."}, {"userName": "Jilly", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "Historical romances are like my \"Chicken Soup for the Soul.\" They just make me feel better. When my daughter was younger and would get sick and stay home from school, we would watch Pride and Prejudice - in our P.J.'s, with chocolate. And, I'm not talking about the Keira Knightly version - I mean the six-hour A&E Colin Firth one. It took all day, but it was comforting.\nMr. Darcy makes everything better...This book is like that. No matter what's going on, it made me smile. The characters are adorable, the humor is great, and the romance is swoon-worthy. Very good chicken soup!"}, {"userName": "Stacey is Sassy", "userReviewDate": "Aug 20, 2012", "userURL": "http://www.goodreads.com/user/show/12062194-stacey-is-sassy", "userReview": "Awesome narrator enhanced the story.I love this series and was excited to try out the audio version. The narrator does a fabulous job and I never struggled to decipher which character was talking. This is the first book in the series and my second favourite but only by a smidge. I love the rough around the edges, Simon Hunt. I don't particularly enjoy seeing the class distinction and resulting snobbery. I will definitely be listening to the rest of the series in the future."}, {"userName": "Ally ", "userReviewDate": "Mar 13, 2016", "userURL": "http://www.goodreads.com/user/show/26693609-ally", "userReview": "Never has man trapping been so much fun to readBig thanks to Alp for the Buddy Read.Setting / Time / Genre: Regency, EnglandLength: 384 pages Series: Yes and I believe but am not entirely certain I have read the other three. Re-read may be in the works. Sexy times: Light on the sexy sexerson. By my definition, that it. Plan on reading more by the author:  Sure am!Synopsis in one sentence or slightly more: Annabelle's family is basically destitute and she conspires with her wallflower friends to trap a member of the peer but instead end up with the utterly delectable Simon who is a man of trade (damn, how is that for a run on sentence?).Heroine: Annabelle. Ok, let us be honest. MANIPULATIVE. And I get it You are broke, dearest Annabelle. But you and your cackling group of friends, were a challenge for me to love. I mean a few of you were awesome. You were ok. Only ok. For the first half of the book. Then you rescued Simon. And you were a little more than ok. Read the book and you will understand this part:Hero: Simon. At first, you too filled the only OK shoes. You were an ass, out to trap Miss Annabelle as your mistress. But then, you became awesome. A hero. Calm in the face of the storm. You became delicious. Read this book for Simon if nothing else. Why it did or didn't work for me: I do not do well reading about manipulative women. It's distasteful. Annabelle never really became a heroine I would be interested in reading about nor one I liked. Even after her rescue. I found her more than a little vapid. Nothing kills a book faster, you know? Try Evie's book. I recall that I liked that one."}, {"userName": "Lisa Kay", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/2459470-lisa-kay", "userReview": "★★★★★ (This is a review of the audiobook.) Good Gravy Beans...this book is good. I've been having a few major problems with my house remodel, and this book - always my favorite of the Wallflower series, saved my sanity! I popped this book in my ears b/c it was loaded on my iPod and it has helped me get through a rough couple of days. LOVE Simon & Annabelle's story. Love how Simon is attracted to Annabelle at the beginning, and pursues her...but also comes to truly love her. Love how Annabelle resists him (she's a product of her era), but slowly comes to deeply love him. Delish! And Rosalyn Landor's narration is great!"}, {"userName": "April (Aprilius Maximus)", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/20658145-april-aprilius-maximus", "userReview": "OMG SUCH FUN! The female friendship between the 'wallflowers' is 10/10!"}, {"userName": "Océano de libros", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/16000916-oc-ano-de-libros", "userReview": "Annabelle Peyton no pasa por su mejor momento, lleva unas cuantas temporadas sin conseguir un compromiso matrimonial que la saque de las dificultades económicas por las que pasa, a pesar de ser de buena familia su falta de dote la convierte en una florero, es decir, el tipo de mujer que pasa “desapercibida” en los bailes y demás eventos. Es así como conocerá a tres chicas en su misma situación: Evie, Lillian y Daisy, las cuatro jóvenes deciden convertirse así en las “floreros” con un objetivo común: ayudarse a encontrar marido. Simon Hunt es un hombre que se ha hecho a sí mismo, hijo de un carnicero ha sabido alcanzar una posición notable, tiene una considerable fortuna pero la nobleza británica sigue sin considerarlo un igual. Su interés recala en Annabelle pero él la quiere como amante y esperará hasta que se acaben las opciones de ella por conseguir un matrimonio.Éste es el primero de los libros de la serie Wallflores o de las floreros, como queráis decirlo y como siempre Lisa Kleypas no defrauda. La ambientación sigue siendo espectacular como en todas sus novelas y la historia ha sido muy entretenida. Los personaje son otro plus, las chicas florero Lillian, Evie, Daisy, incluida la protagonista tiene su interés y le dan mucha vida a la novela más por eso de no centrarse exclusivamente en los protagonistas; así también conoceremos a Lord Westcliff, avanzándonos para conocerlo de pleno en el siguiente libro.De los personajes principales tanto Annabelle como Simon no puedo ponerles ninguna pega, me gustó mucho como va surgiendo su relación eso sí, en mi opinión acaba muy pronto y nos deja bastante páginas en las que teniendo la relación hecha ya poca emoción podemos tener. Es por esto por lo que no le doy las cinco estrellas, tendría que habernos dejado con la duda hasta el final.Los personajes secundarios son también bastante notables, las floreros lo mejor del libro, cada una de ellas tiene algo especial que me gusta.En resumen, el primero de los libros me deja muy buen sabor de boca y con ganas de seguir conociendo el destino de las fabulosas floreros."}, {"userName": "Julianna", "userReviewDate": "Jun 15, 2008", "userURL": "http://www.goodreads.com/user/show/883725-julianna", "userReview": "Reviewed for THC Reviews\"4.5 stars\" After reading numerous rave reviews, I have been quite anxious to start Lisa Kleypas' Wallflowers series. However, when I first began Secrets of a Summer Night, I found myself wondering if I was going to like it as much as some of Ms. Kleypas' other works. Initially, the story had a much lighter feel than the author's other books I had read to date, with the relationship between the Wallflowers seeming a little like chick-lit (not exactly my favorite genre) in a historical setting. Also, the first third or so of the book is primarily devoted to introducing each of the Wallflowers and their individual situations that have caused them to be passed over by potential suitors, as well as detailing the pact between them to help find husbands for each other and building their collective friendship. During this time, there wasn't much interaction between Simon and Annabelle and in fact, Simon only had two short point-of-view scenes which made it difficult to get to know him or to believe that these two were going to fall madly in love. I shouldn't have worried though, because this is Lisa Kleypas we're talking about, an author who has rarely disappointed me. About 150 pages into the story, things really took off, and from there Simon and Annabelle's romance built slowly and believably into a beautiful tender relationship and a dramatic conclusion that really solidified their love for me.During the early parts of the book, I found myself having mixed feelings about Annabelle. I was sympathetic to her plight of being penniless and desperately needing to marry a wealthy suitor to take care of her family, but her lack of a dowry preventing any nobleman from asking for her hand. Not only was she stuck in this endless loop, but she was also rapidly approaching spinsterhood and the prospect of having no other choice but to become the mistress of a peer in order to survive. My only problem with Annabelle was that she had Simon, a man who was wealthier than most aristocrats, doggedly pursuing her for two years after a brief stolen kiss, but she rejected his offers to dance and openly disdained him that whole time, mainly, it seemed, because she didn't view him as a worthy match due to his low birth. I thought this made her appear rather snobbish, a decidedly un-endearing quality. Annabelle also seemed to have the idea that Simon only wanted her as his mistress, but contrary to what the cover blurb stated, I never really got that feeling from him at all and felt that if she had taken the time to get to know him, he might have surprised her with what he had to offer. Annabelle also was prepared to do literally anything it took to win a marriage proposal from a titled gentleman even if he was a poor match for her. Due to these character flaws, I ended up staying on the fence about Anabelle for more than half the story until she finally came to her senses and realized that her actions would be hurting someone else. When she did the honorable thing, I developed a more definite liking for her which only grew as she herself grew and changed throughout the rest of the novel. I loved how she went though some soul-searching and struggled a bit with not quite fitting in her own privileged world anymore, but neither did she fit in Simon's more provincial one. In the end though, her act of heroism and the changes in her attitude convinced me that she would no longer be looking down her nose at anyone else merely because of the circumstances of their birth.As I mentioned earlier, I didn't really feel like I even began to know Simon until over a third of the way into the book. At this point, Simon and Annabelle's first major interaction occurs when she is in the throes of a medical crisis, and his cool head saves the day. Also Annabelle (and the reader) begin to see his kindness and concern show through in his gentle ministrations. From there, the author does the very best thing she could have done for her hero by showing in every word and deed just what a great guy he actually is. Simon is another one of Lisa Kleypas' self-made heroes who had come into a fortune through ingenuity and hard work. He was born the son of a butcher, but is occasionally welcomed into the world of the upper-crust because of his wealth. Simon isn't really tortured like many of Ms. Kleypas' other heroes, but he was rather mysterious and a mischievous flirt. To say that he is quite self-assured just might be an understatement. There were a couple of times that his behavior bordered on being just a wee bit too cocky for my taste, but thankfully it only happened once or twice and the rest of the time his arrogance was rather endearing. Overall, Simon was another wonderful hero to come from Ms. Kleypas' fertile imagination. I just loved how protective he was of Annabelle and her family and how he just simply wanted to spoil her with all the nice things that she had been denied for so many years. It may have taken a little while to learn about Simon's character, but once I did, I totally fell for him just like nearly every other Lisa Kleypas hero I've read to date.The four Wallflower girls, Annabelle, Lillian, Daisy and Evie have an interesting relationship dynamic and the latter three are all good secondary characters. Lillian and Daisy are sisters and wealthy American débutantes looking for titled husbands who would be worthy of their financial status, but are rather rough around the edges for English society. Lillian is very feisty and seemed to have a bit of a chip on her shoulder, particularly concerning Marcus, Lord Westcliff, her soon-to-be hero. I'm hoping that she will go through a similar transformation as Annabelle in her own story, the next in the series, because out of all the Wallflowers, she seemed to have the least scruples. Daisy seems to be a little bit of a tomboy, being the one most excited about their game of Rounders, an early form of baseball. I'll be interested to see how her character develops as the series goes on, as her book is the fourth one. My absolute favorite Wallflower so far is Evie. She is a shy girl with red hair, freckles and a stutter, who appears to be set upon by controlling relatives, but who also seems to notice and understand far more than most people give her credit for. I can't wait for her book, which is number three in the series.The one other secondary character who plays a strong role in Secrets of a Summer Night is Marcus who is best friends with Simon. I had previously gotten a pretty good feel for his character in two other Lisa Kleypas books that are not a part of the Wallflowers series, Again the Magic and Worth Any Price. In both of those books, as well as this one, he presents himself as rather uptight and arrogant, but he always makes some grand gesture that proves what a good heart he has underneath his blustery facade. I'm really looking forward to reading his and Lillian's book, It Happened One Autumn. It was also nice to get a glimpse of Gideon and Olivia who represented the secondary romance in Again the Magic. While there had been enough of a wrap-up to their story in that book to leave me with the feeling that they would have an HEA, I was pleased to see them quite happy and engaged in Secrets of a Summer Night. Although they didn't play a role in the story, there was brief mention of Lord St. Vincent, the hero of the third Wallflower book, The Devil in Winter, and Harry Rutledge, the hotel magnate who becomes the hero of Tempt Me at Twilight, part of the spin-off Hathaway series. Secrets of a Summer Night may have gotten off to a somewhat slow start for me, but overall, it turned out to be another enjoyable read from Lisa Kleypas with a strong (if not perfect ;-)) hero and heroine. Hopefully, now that the groundwork for the Wallflowers has been laid, there will be earlier and more prominent focus on the romance in the remaining books of the series. For now, Secrets of a Summer Night has earned a spot on my keeper shelf, and I'm eagerly looking forward to reading the remaining books in the series, It Happened One Autumn, The Devil in Winter, Scandal in Spring, and A Wallflower Christmas very soon."}, {"userName": "Carolina", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/12114709-carolina", "userReview": "¿Por qué, señor, por qué? ¿Por qué he tardado tanto en leer esta joyita? Creo que mentalmente estaba esperando que lo reeditaran para tenerlo en papel, así que ¡chica lista yo! :D Simon Hunt ya está en el grupito de protas masculinos de Lisa Kleypas que tienen mi corazón. Demasié <3"}, {"userName": "Hayat", "userReviewDate": "Mar 02, 2016", "userURL": "http://www.goodreads.com/user/show/6116230-hayat", "userReview": "4.5 starsAnother winner from Lisa Kleypas! Secrets of a Summer Night is the first book in this series and on the face of it, the plot is simple and straightforward and yet there are meaningful layers and sub-plots to this HR. The Wallflower series is about romance, about making an advantageous marriage in a society that only cares about pedigree/aristocratic titles and wealth. But there is a new class of people emerging...The newly rich, usually Americans, they are on the fringe of influential English society and need to marry into the aristocracy to gain acceptance and those from the aristocracy are almost bankrupt and need money to survive. You'd think a beautiful symbiotic relation will arise out of this but life is never that simple. The aristocracy have developed an elaborate system to safeguard their lofty position in society...They need to relax these ideas about bloodlines and social hierarchy to survive into the next century. But that's easier said than done. Prejudice, social conditioning and family expectations exert enormous pressure to marry well (into both money and title) and our hero and heroine will need to navigate the pitfalls of society, expectations (especially gender expectations) and prejudice, as well as personal issues, to find their HEA. Secrets of a Summer Night has interesting and well paced plot, well developed characters with distinct voices and personalities, romance, passion, self-discovery and strong female friendship and support. This book even touches on subjects to do with social justice, gender issues and society's double standers when it comes to gender and much more. Everything I've ever wanted in a romance book is here!I may or may not come back and do a more detailed review about the actual plot of this story but for now, I just want to read It Happened One Autumn, presenting Lillian Bowman, an American heiress with independent freethinking American ways and Marcus, Lord Westcliff, London's most eligible aristocrat. This is going to be fun!"}, {"userName": "Jacqueline's Reads", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/4197769-jacqueline-s-reads", "userReview": "4.5 This series is fantastic!!!I’ve been sick for the past few days and what I really wanted were some good romance books to comfort me. Some people eat chicken soup, I curl up with Lisa Kleypas, who I think is one of the best historical romance writers.If you haven’t read this series, you really need to. The series is about 4 ladies and they are consider Wallflowers, which basically means they aren’t the traditional English single ladies and because they are so very untraditional, they aren’t desirable.The first book is Annabelle’s book. She’s poor with no dowry. The only thing she can offer is a title, but even then no one wants to marry a girl with no dowry, even if she is very very very pretty.I wasn’t sure I was going to like Annabelle. I found her very selfish, conceited and very snobby. But I do like that she was pushed down a peg or two because she’s a very snobby poor girl.Annabelle and Simon met one night and had one kiss. It’s two years later and Annabelle is still single and looking for a husband. This is the last season for her to find a husband before she is considered a spinster and no one will want her. Her option is to becomes someone mistress or marry a poor English gentleman.So Annabelle is desperate, you would think she wouldn’t be so choosy, considering the RICH Simon Hunt is well on the hunt for her, but no, she is picky because Simon doesn’t have a title! Heaven forbid she marries a man without a title, even though he’s MEGA rich. It was really hard for me to grasp this concept, but Lisa does a very good job in explaining how hard it would be for a traditional title girl to marry below her class.The whole book is about Simon hunting for Annabelle and I LOVED IT! I love it when the hero chases after the Heroine. I love the banter between the main characters and I couldn’t get enough of it. I just love being sucked in this world and I never wanted it to end!"}, {"userName": "Eastofoz", "userReviewDate": "Feb 25, 2008", "userURL": "http://www.goodreads.com/user/show/939365-eastofoz", "userReview": "What a fabulous read! It's an incredibly romantic book :)Here you have sexy Simon Hunt who has been pursuing a very poor Annabelle for years but in a very roundabout kind of way. He's like a little boy yanking on a girl's ponytail claiming to want to bug her but really just dying to be near her. He's so mean to her at the beginning, mocking her that she's a wallflower during the parties and she should be grateful that at least he comes to ask her to dance--but she refuses and basically tells him to shove it every time. Excellent banter throughout between these two!Even the girls are great in this story the way they band together and have all these girly girl moments. You can just picture it all happening in front of you. Each one has a very distinct personality and they are quite the trip altogether!Great sexual tension, hot, hot steamy scenes and a whole lot of love and emotion that just leaves you with a big fat ol' smile at the end. Good thing there are another 3 books in the series to devour!FYI: If you don't like spoilers you should read Kleypas' AGAIN THE MAGIC before starting this series."}, {"userName": "maggieandteddy", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/15076466-maggieandteddy", "userReview": "Love this. I can't believe I waited so long to read this. My first Kleypas novel. I have most of the Wallflowers & all of the Hathaways but I borrowed this from Overdrive. I will definitely buy this to reread.The heroine, Annabelle grew on me. I loved the Wallflowers. I'm on their side. I want them all to have their own happiness. Simon grew on me. He was so antagonistic, but such magnatism. I just knew that he was attracted to Annabelle. Was it more?I loved \"watching\" them together. They had their ah ha moment. This is 3rd person POV. The language is updated for my modern reading. I didn't exactly feel like a Bronte' peer had written this. Great HEA and Epilogue. I'll be reading through this series. I'm trying to read more HR. I have a lot on my tbr. I have to dig in."}, {"userName": "Daniella", "userReviewDate": "May 20, 2015", "userURL": "http://www.goodreads.com/user/show/43278962-daniella", "userReview": "An impoverished heroine who does not know what she wants. A determined hero who wants her... as a mistress. A psychotic son-of-a-bitch who lusts after the heroine and is sleeping with the heroine's mother.  (WTF!!!!) Debates about how men were superior to women. Drama about belonging to a lower class. And a predictable ending.Yeah, in short, this book was barely okay. There was virtually no character development, man. I did not like the hero, the heroine and most of the characters here (except for Evie and Daisy; I only liked Lillian when she's giving Marcus a well-deserved setdown). Ugh."}], "description": "Las Wallflowers son cuatro chicas con serios problemas a la hora de conseguir un buen marido. Son aquellas que pasan los bailes y reuniones apartadas a un lado como meras espectadoras. Sus nombres son Annabelle Peyton, Lillian y Daisy Bowman y Evie Jenner. Ante la dificultad por cazar un buen partido, deciden unir sus esfuerzos para ayudarse las unas a las otras en tan complicada labor....Annabelle Peyton pertenece a una familia acomodada, tiene un nombre respetable, pero tras la muerte de su padre, la situación económica de su familia ha empeorado drásticamente y tienen serios problemas para subsistir por lo que es imperioso conseguir un marido de la nobleza que se haga cargo de la situación de su familia. A pesar de ser una joven de gran belleza no ha conseguido la tan ansiada petición de mano, pues no dispone de dote. Está en la que es ya su cuarta temporada y con no muy buenas perspectivas... hasta que las Wallflowers se unen en su objetivo...qué puede ocurrir?Simon Hunt proviene de una familia de clase media, de hecho es el hijo de un humilde carnicero, pero es un hombre ambicioso que ha luchado y escalado socialmente. Hoy en día es un hombre rico que invierte que numerosos negocios, se codea con los hombres más influyentes y adinerados del país, de hecho es amigo de Lord Westcliff ( a quien ya conocimos en La antigua magia)y la nobleza solicita su consejo y opinión financiera. No obstante no es considerado un igual, nadie olvida su pasado, ni tampoco lo hace él.Simon es el único que muestra interés por Annabelle, pero él tampoco piensa en matrimonio, él no es de los que se casan, y cree que esperando pacientemente a que finalice la temporada y ella vuelva a fracasar en sus intentos de cazar un marido de la nobleza, podrá hacerla su amante....", "title": "Secretos de una noche de verano\n      \n          (Wallflowers #1)", "url": "http://www.goodreads.com/book/show/693045.Secretos_de_una_noche_de_verano", "average": 4.05, "cover": "https://images.gr-assets.com/books/1270345276l/693045.jpg", "reviews": 2169, "authors": [{"url": "https://www.goodreads.com/author/show/27847.Lisa_Kleypas", "name": "Lisa Kleypas"}, {"url": "https://www.goodreads.com/author/show/3448952.Ana_Isabel_Dom_nguez_Palomo", "name": "Ana Isabel Domínguez Palomo"}], "type": ["Romance", "Romance", "Historical", "Historical", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/693045.Secretos_de_una_noche_de_verano", "http://www.goodreads.com/book/show/114162.Secrets_of_a_Summer_Night", "http://www.goodreads.com/book/show/6587379-secrets-of-a-summer-night", "http://www.goodreads.com/book/show/774635.Secrets_of_a_Summer_Night", "http://www.goodreads.com/book/show/22068159-secrets-of-a-summer-night", "http://www.goodreads.com/book/show/12042561-secrets-of-a-summer-night", "http://www.goodreads.com/book/show/8887429-secrets-of-a-summer-night", "http://www.goodreads.com/book/show/693016.Mine_Till_Midnight", "http://www.goodreads.com/book/show/114166.Devil_in_Winter", "http://www.goodreads.com/book/show/827412.It_Happened_One_Autumn", "http://www.goodreads.com/book/show/306364.Sugar_Daddy", "http://www.goodreads.com/book/show/4066312-smooth-talking-stranger", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}