{"ratings": 2036, "userreviews": [{"userName": "Baily", "userReviewDate": "Sep 12, 2012", "userURL": "http://www.goodreads.com/user/show/12777230-baily", "userReview": "This was an amazing book that I read. The book is set in WW|| occupied Europe. C.H.E.R.U.B (Charles Henderson's Espionage Research Unit B) is a group of covert spies who are all children trained, gathered and run by Charles Henderson. The characters are Troy, an orphan who while trying to protect his brother was abused by his orphanage and rescued by C.H.E.R.U.B. Then there is Marc, a kid who rescued the founder of C.H.E.R.U.B after running away from his orphanage and helping become the first C.H.E.R.U.B spy. Rosie and Paul, brother and sister who escaped from the invasion of France to be recruited by C.H.E.R.U.B. Those are all the characters. In The Secret Army, C.H.E.R.U.B gets trained to parachute and goes on their first training exercise."}, {"userName": "Romana", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/69915585-romana", "userReview": "4 stars (just) - this is much more like what I expected from this series so it’s the best one so far for me.My main criticism from the last book - the unlikely language from young teens - still stands, but the sexism didn’t seem as prominent, mostly because they actually DID something in this book. However I was still confused by Henderson’s domestic issues which were included without much purpose. Ok, Henderson had problems with his wife but it had absolutely no consequences elsewhere and the issues were only skimmed over. I just didn’t see the point.Other than that, I was pretty impressed by the plot. It resembled the Cherub books more in that it focused on Marc, Rosie, Paul, PT and their new friends during training. Granted, they didn’t have a proper mission until very late in the story, but the build up was good and I liked the insight into training.So I’m moving on to the next book, but it’s the last one I actually have in physical form. And so it’s going to have to really impress me if I’m to bother getting hold of the next ones..."}, {"userName": "Dan", "userReviewDate": "Aug 06, 2014", "userURL": "http://www.goodreads.com/user/show/7325648-dan", "userReview": "This is the third book in the Henderson's Boys series, the prequel series to CHERUB. Unfortunately this is the obligatory \"training\" book of the series. If it were a video game, it would be the levels where you learn the controls but are keen to get through so you can play the exciting levels. Charles Henderson is training up his group of child spies but many of his superior officers are threatening to shut the unit down before it even gets going. Paul,Rosie, Marc and PT, along with new recruits Luc and Troy, are going to have to prove themselves to secure the future of the unit...I understand that this book was necessary as there had to be a period when the group were trained up. The trouble is that meant a lot of the best bits of the first two books were lost. The early books were CHERUB in World War II, an action story with a proper historical element. Without the historical element it didn't feel very different from the first CHERUB book, The Recruit. Muchamore tries to liven the book up with some interesting character stuff but it doesn't work too well. Troy is introduced here and then pretty much forgotten for the rest of the book. The main group is gradually becoming more professional, with Paul in particular becoming a little action hero. I hated Luc but appreciated the character- Henderson recognized that horrible people make good spies. And there's also a bit about Henderson and his wife which frankly felt rather out of place. An enjoyable enough read but a definite drop in drop in excitement from the first two books. Probably justified for the overall series plot though and I suspect the action really goes up a knot in the next few books."}, {"userName": "Lauren White", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/51236877-lauren-white", "userReview": "I’m not sure about this book. I enjoyed it, but knowing there isn’t another book in this series it seems like a cop out. All of it is a training exercise rather than any real spy action, which would be fine if they were in France toward the end of the book but they never get there."}, {"userName": "Carla Gallardo", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/78616954-carla-gallardo", "userReview": "When you read this book, you feel like you are reading a story that really happened. Muchamore explores the historic facts around the fictional storyline, like a pro."}, {"userName": "Mella", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/9100170-mella", "userReview": "I really loved reading about Marc, Paul, Rosie, PT and Henderson get out of France but it was also really cool to see them back in Britain being trained as covert agents. Luc is a crazy bastard. Troy seems nice. Marc, Rosie and Paul are still my favourites but."}, {"userName": "Melindaaaa", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/22422904-melindaaaa", "userReview": "Konečně nahlížíme do nitra nově vzniklé špionážní organizace složené překvapivě pouze z dětí. Děti a špioni? Jak by mohli být užiteční? To byste se divili. Charles Henderson se snaží přijít na způsob, jak přesvědčit papaláše, že děcka mohou být pro špionážní práci užitečná. S tvrdým výcvikem pomáhá pan Takada, který mladým CHERUBům dává pěkně do těla. Fyzický trénink, souboj, střelba. CHERUB je zatím jednotka jen pro chlapce, ale pokud Rosie, jediná dívka, se kterou jsme se už dříve seznámili, uspěje, je zde naděje i pro další odvážné slečny.Dozvídáme se o dalších dvou nových postavách, Troyovi a jeho malém bratříčkovi, které vyzvedne superintendantka McAfferty z odporného ústavu pro mladé delikventy, kam vůbec nepatří a vidí v nich velký potenciál pro CHERUB. Také se konečně objevuje Hendersonova manželka a my se o ní dočteme také spousta zajímavých věcí a ona sehraje poměrně důležitou roli v příběhu.Díky Hendersonově vynalézavosti se mladí agenti ocitají na parašutistickém výcviku, který absolvují, včetně zapeklitého závěrečného úkolu. Jak se jim příprava na špionážní práci daří? To vše se můžete dočíst v tomhle báječném příběhu napěchovaném akcí. Charaktery si víceméně oblíbíte a příběh příjemně plyne a vy ani nevíte jak a už je konec. To je pro mě známka kvality a moc jsem si počátky CHERUB užila. Těším se na pokračování :)"}, {"userName": "Kerenza", "userReviewDate": "Dec 14, 2013", "userURL": "http://www.goodreads.com/user/show/13799108-kerenza", "userReview": "This book is the third book in the series and to be honest the did prefer the first two because of the fact that the earlier book are all based in Nazi occupied France and this gives a exciting backdrop to the book. As they have to find a way around the secret police (Gestapo)as well as the check points. This book is more about the training of the characters. I like the growing relationship between PT and Rosie and how Marc reminisces about the past and Jae. This book is done in two main section: The training at camp and the parachuting training. I preferred the parachute training section as it had more action and kept me more interested than the first part of the book had. The character all develop throughout the book especially Paul, who become a real dare devil. The parachute training section also see the relationship of the people in Group A change and I feel it is for the better. Overall this book was better than I did expected it to be but as it wasn't in France and the Fact that it wasn't until the final chapters that more action began and it became fast paced, that it only receives three stars. I felt that the book could of been more exciting, but this won't stop me from the next books in the series."}, {"userName": "Tasha", "userReviewDate": "Feb 05, 2010", "userURL": "http://www.goodreads.com/user/show/1253912-tasha", "userReview": "A sign of a good book? Reading it straight through in an evening, pausing only to grab a drink or food. Well, that's what I did with this one because I literally couldn't put it down!The Henderson's Boys series is pretty much a prequel to the CHERUB series. CHERUB is an organisation that was set up by Charles Henderson during World War II, training youngsters to become secret agents - because no one suspects a kid. The first two books have had Henderson, along with a handful of war orphans, scuppering the Nazi's plans to envade England. they have now made it back to Britain and set up a training facility. Secret Army folllows the first lot of kids through their training and a final test which will enable them to be allowed to be dropped into occupied Europe on actual missions.Really great plot, combining the exciting adventure I've come to expect from this and the CHERUB books as well as loads of great detail about how the CHERUB organisation came to be."}, {"userName": "Nina", "userReviewDate": "Nov 08, 2013", "userURL": "http://www.goodreads.com/user/show/23093957-nina", "userReview": "Done and dusted. Gaining very bad, worsening opinion of this series. However, I must praise this book as it is probably my favourite of all of them. I just don't like them killing other people. I am sorry, but that's just the way that I am. Like, no.So the best thing that happened in this books was that I found out what CHERUB stands for, it was wonderful to finally found out but kinda disappointing and random. SO yes. Not really worth you time, in my opinion. Seriously. I am not going to lie to you, because the truth is, I wish someone told me how bad it was before I READ THIS SERIES. However, persistence may be some help, it may get better. Though I highly doubt it."}, {"userName": "Jdrysdaleanderson4", "userReviewDate": "Nov 02, 2014", "userURL": "http://www.goodreads.com/user/show/35454116-jdrysdaleanderson4", "userReview": "In 1940 a British spy called Charles Henderson was worried about a nazi invasion.He wanted to destroy the nazis but he could not do it alone. So what Henderson did was he built an organization called group B to train teenagers into special agents. Paul, Roise and 10 others were the recruitment of group B. Then when the training started non of them were doing well but when they collaborated and managed to create team chemistry they did much better and were able to fight,think and move as good as men in the special forces. All this training was done all around the world including parachuting in Scotland, and handling guns in England. This story is about love, friendship, and perseverance."}, {"userName": "Holly", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/20539451-holly", "userReview": "It was okay. Of course It might have been better if I'd read the first two books first and then this after... But I have a feeling that it wouldn't have made me like this book any more. It was good enough to hold me attention but not so much that I would want to read the two books before this one and the ones after it.The story was a good idea I just didn't like the book. There wasn't much description of the characters backgrounds and I didn't like that.Marc was my favourite character and then Paul and then Joel."}, {"userName": "Vaughn", "userReviewDate": "Dec 28, 2010", "userURL": "http://www.goodreads.com/user/show/1228016-vaughn", "userReview": "The third book in the Henderson Boys series telling the story of a group of young boys being trained as spies during WWII.The young recruits must complete a training mission or risk the fate of their training unit being shut down.This series is not yet available in the US but can be ordered off the Amazon UK site.The next book in the series (Grey Wolves) will be released in the UK in February 2011.The first two book in the companion series called CHERUB are available in the US as of December 2010.A great series for boys and a perfect way to teach European WWII history."}, {"userName": "Emily", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/5388649-emily", "userReview": "The third of the Henderson Series was again a great story. I love how Muchamore goes into detail about each and every one of the characters so you feel like your actually with them. I generally liked this book apart from a new character comes in called Luc and to be frank I really don't like him haha... But it's a great way to see how CHERUB started and I enjoyed reading the background story. You should definitely read it."}, {"userName": "Scott", "userReviewDate": "Nov 10, 2014", "userURL": "http://www.goodreads.com/user/show/5422122-scott", "userReview": "This volume deals more with the training of the first CHERUB recruits, as the Air Vice Marshall in charge of the Special Operations Executive does everything he can to get the unit shut down. We follow the kids into their final exercise, against several adult units, which they must succeed in to have a chance of their unit surviving. Not as action packed as the previous books, but builds the groundwork between the initial books and the proper establishment of CHERUB."}, {"userName": "Farseer", "userReviewDate": "Mar 25, 2014", "userURL": "http://www.goodreads.com/user/show/22875414-farseer", "userReview": "Henderson and the boys finally get to Britain, and CHERUB is finally created officially. This book tells about life and training at the new CHERUB headquarters, and shows what the final test is for the first batch of CHERUB kids, so that they may be considered qualified to perform undercover missions in countries occupied by the Nazis.I always enjoyed tales about CHERUB training and tests, and this is no exception. Very entertaining!"}, {"userName": "Mel", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/24866033-mel", "userReview": "This is the HB novel that I have struggled with the most so far. I like that fact that a couple of new characters are introduced at the beginning and as the novel progresses you get to see them interact with the established characters and grow as individuals, however I felt that this didn't really happen with Troy and Mason. They were introduced in quite a dramatic way and then left. I also got a bit bored towards the end, but am hoping that this is simply a lull before the next installment."}, {"userName": "Sarah Waters", "userReviewDate": "Nov 07, 2014", "userURL": "http://www.goodreads.com/user/show/19911702-sarah-waters", "userReview": "This book didn't have the action or excitement of the previous books in the series. I struggled to like the character of Luc and although at the end of the book we understand more about why he behaves the way he does this could have been explored more. The character of Troy was introduced at the beginning of the book and then went missing, I'm guessing we will see more of his character in future books in the series. I could see this book was building up characters and action for future novels."}, {"userName": "Jessy Locksmiths", "userReviewDate": "Apr 10, 2014", "userURL": "http://www.goodreads.com/user/show/25198839-jessy-locksmiths", "userReview": "This book is simply amazing! I loved spy and physical training books, especially when it involves smart children! I like how CHERUB is formed (because while reading the CHERUB series I was constantly wondering what the initials stood for and now I got the answer) and the parachute mission test at the end was too suspenseful and heart-thumping. I love Muchamore's works and I loved CHERUB even more. Cheers, James Adams!"}, {"userName": "Nathan", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/5082018-nathan", "userReview": "Secret Army is set in world war 2 Britain.Secret Army is an awesome book about children training to become secret war agents to destroy Germany form within. In this novel Henderson and his boys have to fight to keep there training programme going and to do this they have to parachute into hostile area, capture an anti aircraft gun and return to Britain. Can they make it back oin one piece"}, {"userName": "Michele", "userReviewDate": "Oct 14, 2012", "userURL": "http://www.goodreads.com/user/show/9373341-michele", "userReview": "The biggest problem I had with this book was the number of times the kids attacked adults with considerable violence without considering the consequences. Smashing someone over the head with a 'giant wrench' could easily result in brain damage or death - yet no one seemed at all concerned at Rosie's actions."}, {"userName": "Benedict King", "userReviewDate": "Jun 25, 2016", "userURL": "http://www.goodreads.com/user/show/56064641-benedict-king", "userReview": "Another great book in this author's amazing series. The Henderson's Boys series has become a well developed prequel to the famous and well-loved CHERUB series. Which then leads on to the \"Aramov Series\" in great fashion after finding out key info towards the creation of the 'Charles Henderson Espionage Research Unit B.'"}, {"userName": "Sophia", "userReviewDate": "Aug 13, 2013", "userURL": "http://www.goodreads.com/user/show/7998518-sophia", "userReview": "I think they need to start getting onto the kind of 'bigger picture' of the whole series bUT it was really good. I want more PT/Rosie thingS BECAUSE I THEY'RE V CUTEAnd Luc is crazy I think it's a bad idea having him in cherub ALSO WE FIND OUT WHAT CHERUB STANDS FOR WHAT"}, {"userName": "Jamal Hadjkura", "userReviewDate": "Sep 21, 2013", "userURL": "http://www.goodreads.com/user/show/19367912-jamal-hadjkura", "userReview": "Hendersons Boys are fast paced, historic and factual. You can learn much about history, I now really enjoy reading books about WW2 and what teenagers did, the book Edelweiss Pirates Operation Einstein is another great book."}, {"userName": "Colleen", "userReviewDate": "Mar 02, 2012", "userURL": "http://www.goodreads.com/user/show/4792989-colleen", "userReview": "Breaking the habit of five stars here with Secret Army. It had a lot of pointless drama included for what, at the moment, seems absolutely no reason.Luc was a sore spot for me as well, as was Joan for the limited time she was in it.All in all though, another good book by a great author :)"}, {"userName": "Nova", "userReviewDate": "Apr 16, 2012", "userURL": "http://www.goodreads.com/user/show/1815488-nova", "userReview": "I didn't enjoy this quite as much as the first two as it was mostly about training for parachute drops. However I am still looking forward to reading the rest of the series."}, {"userName": "Sushmit", "userReviewDate": "Jan 27, 2013", "userURL": "http://www.goodreads.com/user/show/16878221-sushmit", "userReview": "Very interesting and lot of adventure. I thought world war 2 was going on right know. There are characters of all kinds."}, {"userName": "Jacinta", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/5398094-jacinta", "userReview": "great 3rd book.I absolutely love learning about WW2 and these books give you information about it and also puts a fiction twist on it"}, {"userName": "Joanne", "userReviewDate": "Dec 11, 2013", "userURL": "http://www.goodreads.com/user/show/7346029-joanne", "userReview": "These books are just so easy to read. Action-packed, yet they have a plot, and the characters are actually real people (faults and all)! Definitely recommended for teens and action/spy lovers"}, {"userName": "Tin Tin A", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/4943225-tin-tin-a", "userReview": "Awesome"}], "description": "Britain, 1941. The government is building a secret army of intelligence agents to work undercover, gathering information and planning sabotage operations. Henderson's boys are part of that network: kids cut adrift by the war, training for the fight of their lives. They'll have to parachute into unknown territory, travel cross-country and outsmart a bunch of adults in a daredevil exercise.In wartime Britain, anything goes.", "title": "Secret Army\n      \n          (Henderson's Boys #3)", "url": "https://www.goodreads.com:443/book/show/6775500.Secret_Army__Henderson%60s_Boys___3_", "average": 4.17, "cover": "https://images.gr-assets.com/books/1328846050l/6775500.jpg", "reviews": 59, "authors": [{"url": "https://www.goodreads.com/author/show/268199.Robert_Muchamore", "name": "Robert Muchamore"}], "type": ["Young Adult", "Historical", "Fiction", "Adventure", "Spy Thriller"], "outlinks": ["http://www.goodreads.com/book/show/6775500-secret-army", "http://www.goodreads.com/book/show/20496213-secret-army", "http://www.goodreads.com/book/show/1166131.The_Recruit", "http://www.goodreads.com/book/show/1303564.Maximum_Security", "http://www.goodreads.com/book/show/1291211.Class_A", "http://www.goodreads.com/book/show/828483.The_Killing", "http://www.goodreads.com/book/show/2025787.Mad_Dogs"]}