{"ratings": 16232, "userreviews": [{"userName": "Jamie", "userReviewDate": "Dec 01, 2010", "userURL": "http://www.goodreads.com/user/show/4605519-jamie", "userReview": "This is the sequel to The Looking Glass Wars. Redd has been banished from Wonderland. She is determined to find her way back to her world by any means necessary. Alyss is the new queen who has much to learn about ruling. And a new enemy is making his move. King Arch of Borderlands is determined to have wonderland for himself. He reeks havoc and even kidnaps Molly. Once again, Frank Beddor has done am amazing job of recreating the magical realm of Wonderland. All the favorites from the last book plus some new faces. Hatter continues to remain my favorite character of the story. We get a lot of insight on Redd and learn a lot about Arch. We also make progress getting to know Molly and Dodge. However, I feel as though Alyss was a bit stagnant in this volume.Seeing Redd is darker than the last. The villains are nastier than before, and smarter. The book also plays on a more political playing field at times. A full scale war involving the Caterpillars, Wonderlanders, Borderlanders, and men of earth clash in this next installment to the series.Again, I loved the character growth and backround information we get here. There were a few dull moments in the book where the pace seems to die off briefly but is quickly back to normal. Overall, a very enjoyable, magical adventure for any with Imagination!"}, {"userName": "Heather", "userReviewDate": "Jan 18, 2010", "userURL": "http://www.goodreads.com/user/show/2615211-heather", "userReview": "I liked The Looking Glass Wars enough to really want to like this sequel, as well. But unfortunately, all of Beddor's flaws in book 1 are even more present in Seeing Redd.In this sequel, Alyss Heart is now queen of Wonderland, but she's got her hands full -- King Arch in neighboring Boarderland is plotting against her and has kidnapped Homburg Molly. Redd and her assassin The Cat have escaped to earth through the Crystal (by means not fully explained) where they're wreaking havoc and amassing an army. Hatter Madigan stumbles on some very personal secrets and sets about to make amends. And Dodge and Alyss struggle with balancing her responsibilities, his bitterness, and their respective obligations while admitting their affections for each other.All of these plot twists have the making for an excellent story -- I was thrilled to see more time given to Hatter especially -- but it fell short, again, in poorly executed descriptions. There was SO much time given to Redd and Arch, and so much less to Alyss and her allies, which wouldn't have been so bad if that time had covered something interesting. But Arch and Redd are shallow, textbook villains, spouting ridiculously corny lines and plotting in predictable ways (for a truly excellent spoof of this fantasy pitfall, check out Joss Whedon's Dr. Horrible's Sing Along Blog). And when we do see the good guys, the storyline is a bit of a mess. Homburg Molly, who was endearing in book 1 because of her pluck and verve, is reduced to a zero-action existence as a captive in Arch's encampment. Hatter's big discovery and subsequent reunions and interactions around it don't really go anywhere exciting (I can't say more without giving away plot, but after all the build-up about his deep, hidden emotions, the actual fell pretty flat). Dodge and Alyss start some interesting conversations about what it means to love and protect someone against their own self-hatred and bitterness, but again, the theme is left undeveloped while the plot turns to repeated vague descriptions of combat. I still don't know what a spirit-dane is, although thankfully I could actually read the map in book 2. And when will that rook be given an actual name???But I admit, I'll tough this out for book 3, simply because the story is creative, and hope Beddor improves."}, {"userName": "Jessica", "userReviewDate": "Sep 08, 2007", "userURL": "http://www.goodreads.com/user/show/202724-jessica", "userReview": "The problem with Beddor's books is that he's created a world so wonderful, so fantastic, and then he doesn't give you enough. Alyss, barely a character in Looking-Glass Wars, really, is not all that more intriguing here. She's growing into a strong queen, but we have no real sense of her as a character. Redd is frankly cartoonish. And many of the oft-mentioned creatures of Wonderland are never described. What's a gwormmy? A spirit-dane? Anyone? Anyone? Despite this I still couldn't put the book down."}, {"userName": "Sammi", "userReviewDate": "Mar 04, 2009", "userURL": "http://www.goodreads.com/user/show/1736691-sammi", "userReview": "I am not going to lie, I liked this book much better than the first. Something about it was so much more interesting, so indefinably more plot oriented, that I just couldn't help but like it more.By the way, Hatter Madigan is still the bomb.One of the reasons I think I like t so much better is because of Redd. She is just such a good villain, cruel, merciless...everything a good reader could want. I find nothing more enjoyable than a bad guy who thinks everything else is below them. It's an odd characteristic to be sure, but the better the antagonist is, the more interesting the book will be, since the main character(s) will have to work that much harder to defeat him or her.I also enjoyed King Arch's position in the story. He pulled strings and made me want to yell at the main characters for not suspecting him (another good quality in a well made villain, though of course he was no match for Redd). Also, his extremely sexist attitude, though annoying, made his character so different from many fantasy kings. Usually in a world such as this, the author eliminates sexist attitudes because the women have so much to offer. Not Arch. He looks down at women, even after having Redd as his neighbor for thirteen years. It is amusing, in a way, how this stupidity both defines and weakens his character.The good guys as well were marginally more interesting this time around. Alyss, Dodge, Molly (though I really wish we had gotten to see more of her); even Bibwit seemed like a little less of a snob. It was excellent."}, {"userName": "Gphatty", "userReviewDate": "Dec 12, 2007", "userURL": "http://www.goodreads.com/user/show/238553-gphatty", "userReview": "I found out about this \"2nd in a triology\" and I was very intrigued by the concept: factions fighting for control of an actual Wonderland, complete with card soldiers and caterpillars, the whole works. But the author just can't handle more than plot-driven writing. Vivid descriptions of the beauty of wonderland are mixed with leaded prose that practically screams \"pay attention: plot point.\" I didn't even bother to finish, even after giving the 1st book in this series a shot. This sequel will probably also make a good movie, one where I fully believe a competent director could actually improve upon the source material."}, {"userName": "Chris", "userReviewDate": "May 07, 2008", "userURL": "http://www.goodreads.com/user/show/1124585-chris", "userReview": "Ah, Alyss and Wonderland. I first jumped down Beddor's rabbit hole with the Hatter M comics and shortly after that with The Looking Glass Wars. I had just finished reading the 'original' Alice stories by Carroll and had that imagery fresh in my head. I thoroughly enjoyed the first book and had a lot of fun with the new and very creative interpretation of the Wonderland world and the characters and interactions found there. Snippets of Beddor's writing style bugged me a little bit, but I got used to them.In Seeing Redd, the second book in the Looking Glass saga, I wasn't quite as happily fulfilled. The first book, while it had a handful of issues like most books do, was a tightly woven story with compelling characters and a great story arc. While it obviously left itself open for the potential of a continuing saga, it also tied up most loose ends and left us with a very fulfilling and happy place to leave Alyss and her friends. The second book did not tie things up neatly. Normally that wouldn't be a problem for me. Some of my favorite books have been members of a series and often ended with wildly dramatic cliffhangers. So what is different about Seeing Redd that leaves me unhappily unsettled? The problem, as I see it, is that the tone and styling of the novel seemed almost ignorant to the fact that it was leaving so much in the air by its end. The writing seemed to believe that everything was going to tie itself off nicely by the end of the final page. Rather than identifying and exposing the suspense of the loose threads, the novel practically disavowed their existence.In the first book, I found myself turning pages faster and faster as I neared the end and as I did so, I was growing more and more nervous that the author wasn't going to have time to wrap things up. In the first book, the action took on a rip-roaring pace to finish things up neatly in a short amount of time. It moved quickly but didn't become disorienting.As I neared the end of book two, I was again nervous that things weren't going to wrap up, but I recalled my previous experience and trusted the author to leave me with a satisfactory ending because I had no suggestions from the text that there would be any sort of suspenseful interlude between book 2 and book 3.As the climax of the final battle wound down, I realized that I was in fact going to have to wait until book 3 for any additional conclusion. I wasn't left with a cliffhanger or any sort of major suspense. Rather, the resulting finish left me in a state of confusion. Most of the major action of book 2 had been nullified completely. There were a few alliances made which could be utilized in future stories. There were some intriguing actions that needed to be re-explored (like the kidnapping of a certain author), but for the most part, I feel like I could probably jump right into book 3 without ever reading book 2 and it's not likely that I would miss anything that a single chapter couldn't recap (\"Character X aligns with Character Y. Characters A and B are betrayed and killed by Character X.\", etc.).Still, I am absolutely enjoying this world and the stories and imagination in this new Wonderland. I look forward to the new adventures. Despite my complaints above, I truly did enjoy this book and had a lot of fun with the characters and their struggles and triumphs. I just would have preferred the book to either be more adept in 'wrapping things up' or in adequately portraying a sense of suspense and anticipation for things to come. The current ending left me in a bit of a stupor.***2 1/2 stars"}, {"userName": "Wendy Cornelisen", "userReviewDate": "Oct 18, 2007", "userURL": "http://www.goodreads.com/user/show/307260-wendy-cornelisen", "userReview": "Here's an interesting twist on the Lewis Carol classic. Alyss is from Wonderland and the heir to her mother's Queendom. Her Aunt Red, who was banished after killing the previous Queen (yes, her own mother) attacks her sister's throne, and gains control for herself. Alyss escapes to Earth, a crude reflection of her true home. The story follows Alyss' new life and trials on Earth, and the horrors that Red, Her Imperial Viciousness, rains down on Wonderlanders. It's a great new look at the classic tale, with lots of action and new characters to keep everyone interested."}, {"userName": "Arielle Walker", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/6762949-arielle-walker", "userReview": "Not as good as the first, but the unique world of Beddor's Alice in Wonderland re-imagining is absolutely worth a revisit. Some of the writing shows up as clunky now that the novelty of Looking Glass Wars has worn off, but it is utterly readable and again, unique and interesting enough to keep me invested with the trilogy."}, {"userName": "Jane", "userReviewDate": "Jul 18, 2014", "userURL": "http://www.goodreads.com/user/show/9706360-jane", "userReview": "I honestly didn't care that much for the first book in this series. I read this because I'm honestly just trying to power through a pile of books I've obtained over the span of a few years, so my expectations were pretty low for this novel.Like the first installment, the writing in this book is about a middle school level (think Stephanie Meyer). The whole, it felt like I was reading poorly written fanfiction (and there are some great, well-written fanfiction out there!). The characters were very flat and lifeless, the relationships forced and predictable. It honestly reads more like a script for a graphic novel, with the amount of obnoxious text sound effects. That format would better suited to the story for a lot of writings, poor writing being first and foremost. As far as the plot goes, the author has some pretty interesting ideas but is terrible at executing them. Some of the concepts of Wonderland and the characters were pretty interesting but just weren't given enough time to develop into something better. King Arch for example. Terribly sexist, awful ruler. He literally sounded like a ten year old who didn't like girls, plain and simple. Instead of using his sexism as a kind of talking point, to illustrate how that shows him as a weaker ruler, etc, he just makes royal decrees that men can't cry or watch rom-coms, basically. Think the MRA skit with Lena Dunham on SNL, another interesting idea that went nowhere.My other complaint would be the magic. I'm totally fine with magic that doesn't have a lot of rules or explanation to it, but the imagination didn't really make sense at all. Another reviewer mentioned that Alyss and Redd seemed to just be doing the same thing over and over, and I agree. It wasn't particularly impressive, imaginative, or unique in it's powers and how Wonderlanders used them. Again, I definitely did not read this book because I had any kind of hope for it, I fully expected to not like it. For anyone who loves Wonderland and all of it's new and different incarnations, I would recommend this book for it's IDEAS but caution strongly against the writing."}, {"userName": "Michael", "userReviewDate": "Dec 23, 2013", "userURL": "http://www.goodreads.com/user/show/13038840-michael", "userReview": "I should have known that this book would be disappointing when The Looking Glass Wars ended with such a fizzle, but I decided to give it a go anyway.Character development is nearly non-existent, and where it is present it lacks the strength of realism; the characters are all rather static individuals who do not stray from their very predictable behaviors.The plot feels rushed, and the danger Wonderland faces at the hands of King Arch and Redd Heart is uninspiring. In fact, the \"war\" for Wonderland spans the course of just one day.Lastly, though I know these are YA books, the magic system and descriptions of combat are tiresomely childish. (Ok, some of the battle scenes would be cool—in a graphic novel.) Alyss and Redd have their entire imaginations as weapons (though, yes, there are some limits), yet they consistently conjure the same items over and over again. And Hatter Madigan, though a cool idea, is ridiculously invincible in combat.Beddor's ideas for Wonderland are quite spectacular; unfortunately, he strives to squeeze too much in too little time, and his characters end up feeling like hollow shells who only serve as instruments of plot continuation. I won't be reading Archenemy."}, {"userName": "Stephanie Cover2CoverBlog", "userReviewDate": "Mar 28, 2011", "userURL": "http://www.goodreads.com/user/show/2822605-stephanie-cover2coverblog", "userReview": "So...I was not too sure about the first book of this series. I like the idea and concept however the writing was a little bad in some ways and was a bit off-putting. I read Seeing Redd in an attempt to pursue the storyline more than my enjoyment of the first book. I think Beddor got a little in over his head with this one. The plot is as follows:After the end of the first book, Redd has jumped into the Crystal Heart, so we aren't sure if she is dead or alive and plotting, meanwhile Arch the king of lands outside of Wonderland is plotting to take over Alyss' queendom by his own means.Where I think that this book went nuts was that the book really doesn't have an ending, nothing gets resolved, you are left on a complete and total cliff when it comes to the overall plot line...meaning you HAVE to read the 3rd book.At this point I have no intention of reading the next one, the writing in book 2 much like book 1 was pretty bad, and seemed a little word vomit-y (everything that came to mind was immediately written and then left be). While I am interested in the plot ending and to see if Alyss lives happily ever after, I am not willing to take up any more of my time at the moment."}, {"userName": "Mizuki", "userReviewDate": "Apr 10, 2014", "userURL": "http://www.goodreads.com/user/show/16842102-mizuki", "userReview": "It's a decent read, the action scenes are good, but the characters and some of the 'shocking plot twists' are a bit too cliched."}, {"userName": "Lexie", "userReviewDate": "Sep 29, 2009", "userURL": "http://www.goodreads.com/user/show/712966-lexie", "userReview": "The second book in Beddor's Looking Glass Wars trilogy picks up fairly closely to the end of the first book. 3 lunar cycles (I'm guessing this means months) later and Queen Alyss is doing her best to reassure the people that White Imagination is once again dominate.There is a little bit of a mislead throughout the book as well, in who's actually the source of evil and motives. King Arch, briefly mentioned and shown in the first book, is a central character this time around (with all his sexist views) and Jack of Diamonds, unfortunately, makes a return appearance. His parents aren't the brightest ever. Redd is more cunning then in the first book, using subterfuge as a way to win out. I admired her, despite her evilness, because she didn't just whine about what she lost (like Jack) or spout impossible ideas (like Arch), but had a solid plan which would have worked.Hatter Madigan, this poor guy, is put through the ringer. He did take his leave, as he said he would at the end of Book 1, and didn't plan on coming back. We learn more about the civilian he loved, Weaver and what secrets she carried. Which all relates back to Molly (I'm sure you can guess how) and has a surprising turn of events. Doesn't last long however. Molly is also put through the ringer--unsure of herself, prideful of her abilities but shamed by her birth, young and basically self-trained, Arch takes advantage of that weakness.In the end I enjoyed this book moreso then the first. I enjoyed learning more about the other lands surrounding Wonderland (even if Borderland is...what it is) and despite the ending leaving itself very open to a sequel, I can't be too upset over that. The conflicts of THIS book were resolved and the ending opened the door to a new conflict."}, {"userName": "Merritt", "userReviewDate": "Aug 20, 2009", "userURL": "http://www.goodreads.com/user/show/1342173-merritt", "userReview": "In the author's Biography in the back of the book, it says that Frank Beddor is currently writing a screenplay for this series to be made into movies. What wasn't mentioned is that he practically already has. This book is just a movie in book form. It has all the blockbuster essentials: cheesy lines, ridiculously long action and battles, conflicted, attractive characters. You know. \"Dodge held his Alyss's face in his hands, wiping of her tears with his thumbs...\" \"Did you lose something? *chops of robot's head* 'cause I think I see your head over there!\" You know it. Not to say I didn't enjoy reading it, as far as enjoyment in that can go. It's a summer trash read! I wasn't expecting much, which is always good to go at. So, despite the fact that Frank Beddor is so obviously trying to create a rabid fan base and huge world for his books before he eventually produces the movie so that he can make lots o money, it's a fun read."}, {"userName": "Samantha wickedshizuku Tolleson", "userReviewDate": "Dec 14, 2015", "userURL": "http://www.goodreads.com/user/show/2237173-samantha-wickedshizuku-tolleson", "userReview": "Wow! This just dove right into the politics, and seems that it's rather outlandish seeing that the settings is Wonderland.Okay, I'm really not a fan of this King Arch. Men, this guy is not an example to follow. If you do, you'll deserve the slap in the face you are sure to get someday.The way Cat and Redd are introduced back into the story is so eerie and morbid. The plot is absolutely everywhere dividing your attention here, there, and everywhere. I was also feeling like there is an aspect that is shadowed that Beddor is hinting at, yet this eludes us and remains unanswered for the next book.I look forward to reading the next as soon as I can, but just might wait for a really rainy day.Until next time.Cheers Pretties!"}, {"userName": "Katrina", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/43099218-katrina", "userReview": "[ I'm so excited that Jack of Diamonds got killed off. I hated him with such a passion (hide spoiler)]"}, {"userName": "SmilingDork", "userReviewDate": "Sep 06, 2015", "userURL": "http://www.goodreads.com/user/show/28626936-smilingdork", "userReview": "Loved it!!!!! Will write review tonight along with several others I need to catch up on. ;P"}, {"userName": "Heather Eames", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/62054070-heather-eames", "userReview": "3.5 stars. I was a tad disappointed with this book as compared to the first it is slow and clunky in places. However, once it got going it was a good story and worthy of notice. I loved Hatter Madigan again, he will always be my favourite character and wish he had been introduced a bit earlier in the story. I did enjoy the book, and have moved on to the last book in the series, however, I do find Mr Beddor's writing style to be a little irritating when describing the fighting scenes with....GAPS and noises etc so were are not completely sure what has happened until a little further on. However, it has kept me hooked enough to read the last book in the series and I look forward to seeing how it all ends."}, {"userName": "Kathryn Snyder", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/58065253-kathryn-snyder", "userReview": "There is a lot to love in this book series. This book is not as good as the first book, but it does build Wonderland & Borderland well."}, {"userName": "Bridget", "userReviewDate": "Sep 14, 2015", "userURL": "http://www.goodreads.com/user/show/16022915-bridget", "userReview": "This book could have gone one of two ways: 1) it could have improved upon the issues of The Looking Glass Wars and risen to be something really spectacular, or 2) it could have deepened the issues of the first book into something really flat and empty. Guess which route Seeing Redd went down?The issues I had with this sequel were basically endless. The plot was half baked, the characters were soulless and the writing was painfully mediocre, which led to an emotionless novel that I skim-read for the last hundred pages. The thing about Beddor is that he does have good ideas - however, he doesn't seem to be able to do anything with them. While there was a basic premise and some tentative gestures at some character arcs, the ground between points A and B was somehow very vague. I felt like I just got handwaved past the important stuff and directed towards a chain of action sequences that, thanks to the handwaving, didn't feel that urgent. I just wish there had been more to it, because what hints of worldbuilding and such I got seemed pretty complex. It was so frustrating to keep getting interested and then have the scene change before any real exposition happened.And dear god, the characters. Anyone that I felt even the slightest affection for in book one felt like a cardboard cut out of themselves in Seeing Redd. Which is saying something, because I didn't think The Looking Glass Wars had all that much characterisation to boast about either. All of their emotional progress was cut short by unconvincing dialogue and all of their actions felt wooden. Like, the most defining feature of Molly was her bloody hat, which she didn't even WEAR for most of the novel. The result was that I just couldn't engage with any of them at all, and the less said about Beddor's villains, the better. They were basically a singular stereotypical Bad Guy trope that had been stuffed into a body and made to sing.What really highlighted all of this was the writing. From the telling not showing, to the in-text sound effects that let Beddor get away without describing key moments of action and emotion (real example: WUUUUUUUUUUUUUUUUUUUUUUUUMMMMMP!!!), this novel just read like it was trying to be a screenplay because the style was so empty.Overall, I was very disappointed by this book. I'm giving it two stars because it wasn't The Worst Book Ever, but I really don't know if I can be bothered to force myself through the last book in the trilogy."}, {"userName": "Jennifer Wardrip", "userReviewDate": "Sep 12, 2008", "userURL": "http://www.goodreads.com/user/show/1125613-jennifer-wardrip", "userReview": "Reviewed by Breanna F. for TeensReadToo.comSEEING REDD, the second book in THE LOOKING GLASS WARS series, continues off from where the last book ended. Twenty-year-old Alyss is now queen of Wonderland. Her aunt, Redd, has disappeared into the Heart Crystal along with her sidekick, The Cat, and everything is starting to calm down. But soon glass eyes start appearing out of nowhere and causing mayhem. Everyone believes that Redd has somehow come back and that they're all doomed. Little do they know that these aren't Redd's glass eyes. Someone else is having them made. And that someone else is the King of Boarderland, Arch. King Arch has plans to take down Wonderland and all of the surrounding cities. And he is determined to do so. He has Molly (the Queen's bodyguard) captured and intends to have her father, Hatter Madigan, come rescue her. Meanwhile, Redd and The Cat find their way to Earth and Redd gets a whole new group of followers. She is determined to get back to Wonderland and kill Alyss so she will finally be Queen. Alyss and Dodge come to terms with the fact that they are meant to be together. But Dodge is still set on killing the beast that killed his parents. Nothing will get in his way -- besides Alyss, that is. Wonderland is in a world of trouble with King Arch and Redd doing all they can to finally get Alyss out of the picture once and for all. Full of violence and mayhem, SEEING REDD is an intense read. It's a pretty good second book to the series; parts were a bit slow but, overall, it was a good read. I definitely liked THE LOOKING GLASS WARS much better; for some reason it didn't seem as wordy as SEEING REDD. But this was still a good book. I especially liked the way it ended, and it should definitely be read by those who enjoyed the first book in the series."}, {"userName": "Bry", "userReviewDate": "Apr 24, 2010", "userURL": "http://www.goodreads.com/user/show/1360862-bry", "userReview": "Listening to the audiobook on this one and really enjoying the man's voice who is doing the reading. They added in lots of effects for the different characters which is fun, and makes it really easy to distinguish who is speaking. Well this book was certainly not as good as the first book. It wasn't bad, just a bit disappointing. The entire time I was reading I was like what are these people thinking? Why can't they just talk to one another, be a bit honest. If they would they would have so many less problems.The writing is very visually driven. The landscapes, weapons, etc are extremely vivid and well described, but it also means whenever something necessary to the plot occurs there is a major shift in the writing. It almost reads like a screenplay. You are going along getting all these wonderful descriptions, then its dialog-dialog-dialog, then back to descriptions. And the segways are not often subtle.Also, I am not all that interested in the characters. For instance, this book gave major insight into the character of Hatter Madigan, but instead of endearing him to me I was more annoyed at what led to the situation. Furthermore, I don't even have much of an interest in the main characters. Alyss is very much 'the Queen'. In the first book she was interesting with her conflicting internal emotions. Was she a child, a Queen, a rebel, or a simple Earth girl? This book she is a Queen and nothing else. They try to hint at that else with her feeling for Dodge but they didn't seem very genuine. She was basically as stiff as a bored. Even Redd who was so awesome in the first book seems more boring this book. It's almost as if she went a bit soft in this book.I will definitely read the 3rd book in the trilogy to determine what happens from this giant mess Beddor has created in their world, but I am not sure I will be impressed."}, {"userName": "Stephanie (ShyNotebooks)", "userReviewDate": "Jan 10, 2012", "userURL": "http://www.goodreads.com/user/show/5864205-stephanie-shynotebooks", "userReview": "[has a family (hide spoiler)]"}, {"userName": "Belle Sabattin", "userReviewDate": "Jun 13, 2015", "userURL": "http://www.goodreads.com/user/show/33852257-belle-sabattin", "userReview": "Solo odio saber que su continuación \"Arch enemy\" no existe en español :(. Simplemente no pueden cometer la maldad de traducir los dos primeros y dejar el tercero de lado! Quién hace eso????!!!Bueno, despues de desahogarme, puedo decirles que me encanta este retelling, sobre todo por la madurez que Frank Beddor le entrega a la historia del “Alicia en el país de las Maravillas\" y también por lo bien que está introducido este mundo de fantasía en el mundo real, incluso haciendo que Lewis Carroll haga unas apariciones ilustres y que sea algo totalmente natural y casi lógico.Además es capaz de otorgarle un nuevo sentido a los elementos propios del Pais de las Maravillas, pero de tal manera que resultan totalmemte naturales y haciendolos calzar perfectamente en la historia.Solamente una pequeña queja. Me costo bastante tomarle el ritmo al libro, ya que, a mi parecer, tiene un inicio demasiado lento, dobre todo si lo comparamos con su antecesor, el cual logra atrapar rapidamente y enganchar a la historia. Lo bueno, esz que esto solo sucede al comienzo, luego la aventura toma su rumbo y ya no cuesta nada seguir a Alyss por Marvilia.Como dije en la reseña del primer libro, recomiendo 100% la saga para quienes gustan de retelling. Aunque si buscan algo romántico, no les servirá, ya que a diferencia de la saga Susurros de A.G. Howard, La Guerra de los espejos, tiene muy poco romance, cencentrandose más en las guerras y conflictos internos de sus personajes... Aunque no por esto está excenta de amor, pero no es muy importante en la historia.4/5 solo por eñ comienzo algo lento ;)"}, {"userName": "L.M.", "userReviewDate": "Aug 04, 2009", "userURL": "http://www.goodreads.com/user/show/2579724-l-m", "userReview": "You know how you watch a movie and it’s pretty great- so then the sequel comes out and it bites the big one? That’s exactly what this book was for me. I didn’t exactly love the first book, “The Looking Glass Wars,” but it was a fun read- whereas the sequel was not. It felt exactly like a segue into another book- but the thing is, there IS NO OTHER BOOK TO SEGUE INTO YET. It’s mostly just Alyss developing as a character, and more sci-fi tech speak. This is the thing too, the book isn’t all that long to begin with. He could have totally made it twice as long and tied up some of the loose ends. This is what the book was- there’s some trouble in Wonderland and nobody knows where it’s coming from. Redd returns (sorry spoiler, but it is the title of the book so it’s pretty obvious) and reeks some havoc, the entire book then ends with a bang and no resolution to anything but the immediate problem. I’m also unhappy because I saw that he had released another book called “Hatter M” that I thought was the first book told from a different perspective(so says Amazon). Completely wrong again! It’s a comic book developing the Hatter M character, and I’m not a comic book reading gal. So yeah, I’m pretty upset, and I don’t recommend reading this series until a few more of the (real)books come out."}, {"userName": "Da", "userReviewDate": "Dec 17, 2008", "userURL": "http://www.goodreads.com/user/show/1639377-da", "userReview": "Seeing Redd is the second book of the trilogy. After jumping into the crystal, Wonderland hoped for peace but awaiting them was perhaps yet another tragedy. New things appear to and fro and leave many bewildered at the facts seemingly to be lies. Citizens who experienced the attack by Redd are still frightened and Alyss, the new queen, holds many responsibilities that trail behind her. Without her kind mother to guide her, she was in no doubt, troubled.The other monarchies conspire in order to take over the queendom. The main powers belong to King Arch and Redd who has returned, fully prepared to slaughter her own niece with her own imagination. Alyss, who has lost her powers, has little faith in herself. Although many support her, it is easy to tell that they are at a high disadvantage without her powers or a great strategist in war.There is still a way to defeat the despicable Redd that Alyss will face many troubles going through. Like every other hero, facing hardships to become a leader is not highly unprobable. Hiding does one no good but running, hiding and building power along the way may just be what all heros need in the face of grave danger. Shocks, as referred to \"new things\" in the start, refer to changes as well. Changes can cause betrayal, a higher state of loyalty, madness or even sanity."}, {"userName": "Suzy", "userReviewDate": "Dec 08, 2011", "userURL": "http://www.goodreads.com/user/show/6352563-suzy", "userReview": "This second book in the series was harder to get through than the first. I felt like there was a lot going on, maybe too much in the beginning. As it progressed through the end I got more into and really wanted to know what was going to happen. I think the cover of this novel is a great version of Redd. I like how Beddor changed everything to be more out there and more grown up, more modern. These books are definitely for teens and adults to read, as they will understand it better. I did like that Hatter has feelings in this book and we get to see the woman he loves and his daughter that he didn't know about until recently. Hatter always seems so strange in the other books and movies and we don't really understand him. I think Beddor did a good job of giving Hatter a prominent character. I also think the most recent version (Tim Burton's) of Alice in Wonderland is actually similar to these books. It makes me think that maybe the producer had read these books too when making that movie. I picture things like the forest and the Pool of tears like things in that movie. It is interesting to see how alike all of the versions are but also so different, especially when comparing them to the books. I would love to see this series made into movies, but they would have to do it well to live up to the imaginative representation."}, {"userName": "Matthew705", "userReviewDate": "Mar 26, 2010", "userURL": "http://www.goodreads.com/user/show/3065962-matthew705", "userReview": ". what really happened to redd i don't think that that was the end of redd. why is arch trying to take over wonderland. who is controlling the glass eyes. is redd working with arch if not how did arch get the glass eyes. hah i knew that redd wasn't dead. i think that redd is where the liddels are. that is really coincidental that redd met another wonderlander in england. redd is trying to amass an army of humans, i don't think it'll work. where is molly she hasn't came back from borderland. i hope that hatter won't try to follow molly into borderland. wow i am suprised i really didn't think that redd could get this many people to join her cause. why is hatter wife with arch i thought she was dead. is this going to make hatter crazy. what will happen with dodge if the cat comes back. why is arch actually being nice to alice. why can't arch just stop being a poop and just let hatter take molly. uh oh redd is coming back into wonderland, this isn't good. why does arch want hatter to create that pattern with the silk over wonderland. what ever arch wants it cant be good. i hope that the caterpillars deny redds request to find the maze. i can't believe that the caterpillars actually let redd in the maze"}, {"userName": "Eric Dunn", "userReviewDate": "Apr 20, 2011", "userURL": "http://www.goodreads.com/user/show/3696600-eric-dunn", "userReview": "This is the second book in \"The Looking Glass Wars\" by Frank Beddor. I'm always nervous about the second book in a trilogy because it always seems to be the weakest link of all of them. Usually it is just a book full of story build up so that the author has something huge to end it with in the last book. This wasn't the case with this one. Beddor does a fantastic job of making this a fun to read part of the overall story.The characters progress along very well from the first book and through this one. As you can probably tell from the title the book focuses a lot on the character \"Redd\". It's fascinating to watch what becomes of her and her cohorts and how that relates back to the other main characters in the trilogy. Along the way there are plenty of twists and turns that you don't see coming at all.While, in my opinion, this book isn't your typical middle book in a trilogy because it has such a great story that could stand by itself; it does do a wonderful job of making you eager to read the final book. There are plenty of open story lines and ways that this whole thing could still play out. Beddor is a wonderfully refreshing author and I can't wait to read the third and final book in this trilogy.Overall Rating: 4/5"}, {"userName": "Eoin", "userReviewDate": "Oct 25, 2011", "userURL": "http://www.goodreads.com/user/show/4848590-eoin", "userReview": "I liked this installment in the Looking Glass Wars Trilogy much more than the first. Although it did not have great transition from it's predecessor. In reality the first book could stand on it's own and I don't think this trilogy was ever meant to be but none the less I loved this book. Frank Beddor has many flaws in his writing but what really draws the reader in is his great use of vocabulary. He uses strong words without over-doing it. Such as: Queendom, Milliner, Astacans, and Onu. Some are made up words but they are enticing and very fun to say aloud. This book skip around like the first but it was much more neatly woven together. It flowed better instead of feeling to cut awkwardly at certain points. Each chapter in this book seemed to have it's on short plot-line with a climax as just as you approach the shock he cuts off the story and does not return to it until five chapters later. This is a great tool he uses to once again keep you reading. No matter how bad another chapter is you want to know what will happen to a character so you keep reading."}], "description": "Alyss of Wonderland's rule has only just begun, and already those who prefer chaos to peace are threatening to destroy everything worth imagining. Trailed by newly appointed royal bodyguard Homburg Molly, Alyss is doing her best to keep pace with the non-stop demands of being queen while attempting to evade Molly for a few private moments with Dodge.Alyss' life is a challenging mix of duty, love, and tough decisions, and then a series of phantom sightings set fire to an urban myth of Her Imperial Viciousness' return and have everyone... seeing Redd.Has Redd somehow freed herself and her chief assassin, The Cat, from the confines of the Heart Crystal? If not, then who has resurrected Redd's brutal foot soldiers the Glass Eyes and set them loose to attack Wonderland on all sides?Battles rage, looking glasses explode, and the Alyssians once again unite to defend White Imagination in this fast-paced follow-up to the New York Times best-selling The Looking Glass Wars.", "title": "Seeing Redd\n      \n          (The Looking Glass Wars #2)", "url": "http://www.goodreads.com/book/show/289695.Seeing_Redd", "average": 3.85, "cover": "https://images.gr-assets.com/books/1354846350l/289695.jpg", "reviews": 1147, "authors": [{"url": "https://www.goodreads.com/author/show/24818.Frank_Beddor", "name": "Frank Beddor"}], "type": ["Fantasy", "Young Adult", "Fiction", "Adventure", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/289695.Seeing_Redd", "http://www.goodreads.com/book/show/933966.Seeing_Redd", "http://www.goodreads.com/book/show/2801635-seeing-redd", "http://www.goodreads.com/book/show/22904555-seeing-redd", "http://www.goodreads.com/book/show/1927039.Seeing_Redd", "http://www.goodreads.com/book/show/507447.Seeing_Redd", "http://www.goodreads.com/book/show/22032318-la-guerra-de-los-espejos-roja", "http://www.goodreads.com/book/show/44170.The_Looking_Glass_Wars", "http://www.goodreads.com/book/show/6178354-archenemy", "http://www.goodreads.com/book/show/3563478-hatter-m-volume-1", "http://www.goodreads.com/book/show/6797842-hatter-m-volume-2", "http://www.goodreads.com/book/show/419954.Princess_Alyss_of_Wonderland", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}