{"ratings": 1687, "userreviews": [{"userName": "Kalliope", "userReviewDate": "Aug 16, 2012", "userURL": "http://www.goodreads.com/user/show/3593962-kalliope", "userReview": "She is a woman. I mean she is female.And she is not just any female. She is of colossal fame.A mythical female she is.And yet she is well alive and exists today.Because she has more presence than you or I have. I am talking about resplendent Paris.For if this woman is outstandingly beautiful and alluring, at times she as also been violent and bloodthirsty and this mix of personas has made her eminently enigmatic and mysterious.Alistair Horne in this book traces the history of Paris through what he sees as her Seven Ages. As he traces her history we see that her life has evolved around a few celebrated men. Or may be it was that these men needed her when pursuing their ambitions and she knew how to position herself as these requirements changed through history. Her Seven Ages succeeded as follows:Lutetia, a young wench from Roman times, was elevated by Philippe-Auguste to the status of a gentle maiden in a chivalrous and First Age. Henri IV stepped in to herald the Second Age and she was the one for whom and in genuine faith and extraordinary credulity, he switched religions. For him this Lady was worth a Mass. She sadly felt neglected in the Third Age when Louis XIV moved all splendor, music and light to that upstart demoiselle of Versailles. But it was Napoleon who, as the hero of the Fourth Age, tamed her when she became a revolutionary and instead raised her to her rightful throne of Empress of all cities. In a characteristic ambitious tone, he had vouched that he would make her the most beautiful city in the world. And even though Horne titles the Fifth Age after the common La Commune who took over and played its jarring tune in her elegant arena, it is still the age of a self-appointed hero, Louis-Napoleon. Nor is the Sixth Age one that can be honorably remembered under one single man. This was a period framed and marked by horrid wars during which her enemies dared to invade her three times, spanning and puncturing the Belle Époque and then adding on a second Thirty Year war. Her politicians had failed her. Horne has identified this age with the invitation to the frivolous upstart from earlier times to come back to stage, this time in strict austerity, and sign the Treaty of Versailles that would supposedly expel Hell but which didn’t. But this long period of no heroes was a period of artists who honored her as their muse. In her final and current Seventh Age we see again a hero, De Gaulle, who once he admitted that he could not be Emperor and put a veil over her past as Empress, gave her, for a fifth and still successful round, the dignified and modern mantle of Lady of the République.But if these five men dominated these Seven Ages, we should not think that these were the only men in her life. There were others, many others. There were those who gave her things, beautiful things. For example, Louis IX gave her the dainty Sainte-Chapelle. Francois I gave her an elegant Renaissance palace to replace the rough Louvre bastion, and invited the inventive Leonardo to visit and pay her homage. She was given many bridges as she grew from the little island and expanded to the two sides of her river. And these were all the gift of cavaliers, for even the Pont Marie was not related to the virgin but designed by the architect Christophe Marie. She certainly offered a fruitful ground for the creations of ingenious architects, national and foreign, all the way to the daring and gaudy Beaubourg conceived by the Italian Renzo Piano.The things she was given were not always strictly material objects. Gabriel Nicolas de La Reynie, the Chief of Police under Louis XIV, gave her street lighting and this was her first step towards becoming the City of Lights. To strengthen her Finances the Banque de France was organized by Napoleon and his bankers and it was also him who realized that hygiene was a sine-qua-non for beauty. A new sewage system and greater access to drinking water were the benefits when she got her Canal de l’Ourcq.In embellishing her some had to mutilate or exert some other traumatic changes. Baron Haussmann, who thanks to this entered the Senate after having been the Prefect of Police, had to demolish areas so as to build avenues plotted according to a regular and structured framework and devised a new kind of housing with façades that would unify long street vistas. The scale of Haussmann’s grid of boulevards, and enduring model for apartment buildings, however, were not entirely new. During the Third Age, both Le Vaux designed the prototype for the beautiful dwellings still surviving in the Marais, and Le Nôtre plotted the Champs-Elysées, well suited and named for our mythical lady. Some reconstructive surgery was later performed by Viollet-le-Duc who thought that Young-Looking-Middle-Ages-Bâtiments were just the thing. And the Would-be-Mutilator Le Corbusier concocted the horrifying and cruel idea of demolishing her center and build in her Right Bank a string of towers like shoeboxes over two hundred meters high. Such an operation would have had a despairing and irremediable damage to this Lady’s beauty. Better and more natural methods were applied by the intellectual André Malraux who prescribed a deep cleansing and whitening treatments as the most appropriate to erase the scars of age in her stone cheeks and skin.It was not always her beauty the main objective. Some of her men were also concerned with her education. It all started with Abelard, who though a friar, had a weakness for women (admittedly educated women with an inclination to epistle-writing) and founded her first University. This University later took on, as her own, the name of another man, Robert de Sorbon, the Confessor of Louis IX. Subsequently François I thought not only of palaces, since he founded the Collège de France, a center of Humanism, and he was followed about a century later by Richelieu who constituted the various Académies (Language, Arts, and Architecture). But as we know, education is dangerous, and in May 1968, it was in some of these centers of knowledge that trouble brewed for this bluestocking.And it was not all things, beauty and centers of learning; she also needed some occupations on which she could spend and enjoy her time. For her culinary interests some cooks established delicious centers, such as those set up by Boulanger or Beauvilliers, and many palates desired restaurants like Chez Noudet or Maxim’s. The Cafés fashion was quickly developed so that most people would have sat around the Café de la Paix, Café de Paris, Café des Aveugles. Her interest in music welcomed many locals such as Berlioz, Debussy, or Ravel, or attracted ethereal virtuosos from Poland, or offered a venue for the celebration of a demonic Rite of Spring for the exotic Russian. And since music beckons her temples, she had her Opera designed by Charles Garnier, a building that became such an exemplary model that replicas sprouted later in Hanoi and Buenos Aires. Knowing that obvious symbols of social differences could breed trouble she proceeded to have the Opera of the People and build, in a place with no lesser emblematic meaning than the Bastille, her second grand music hall. Of course it was not all grand music that tuned the ears of those men who were always orbiting nervously around her. She had to provide a special entertainment for those. Her Moulin Rouge, or the Folies Bergère, or Le Chat noir became world famous as centers of naughty fun and in so doing became also sources of inspiration for her painters, with Toulouse-Lautrec, Manet, or Picasso, to name just a few of those who left unforgettable images. For if she has had an innumerable string of painters that have left us with a history of her countenance, in particular those who exalted the richness of her city life, like Pissarro or Caillebotte, she has also had a series of bards who wrote copiously having falling prey to their fascination. Eugène Sue, Balzac, the Goncourts, Zola, Proust, and a long etcetera, have left volumes and volumes of her splendor and squalor and luxury and vice and mythical grandeur. And it is for this never-ending string of men that she has taken care to present herself in an exquisite toilette. For even if the concept of Haute Couture had its inception in her secluded royal courts, it was thanks to her Couturiers that her style would rank as the most elegant that would set the fashions openly. The English Charles Worth had to establish his business there if he wanted to drape the right model, but plenty of locals, Paquin, Poiret, Dior and Gautier, later exported her allure to the rest of the world. And since dress nicely but with no “parures” could seem that she was displaying a nudity of elegance, thanks to the Cartier males (father and three sons) and their innovative use of platinum for jewellery, she set a trend that most of the European Royals would copy in their tiaras, forgetting the Republican nature of their inspirational model.As we close this book after reading about her Seven Ages, we are left with a whiff of her perfume, for she, the Eve of very many Adams, could only use a scent named Le Fruit Défendu.Evoking her mystery..."}, {"userName": "Sketchbook", "userReviewDate": "Nov 24, 2016", "userURL": "http://www.goodreads.com/user/show/4708498-sketchbook", "userReview": "3 stars ? Very generous. Instinct told me : do not read in chrono order. So I began with the 6th \"Age,\" which begins w La Belle Epoque and covers W1, and moves into the 7th \"Age,\" W2 and ends c 1969. Instinct was kerect. Author Horne -- in 400 pages -- condenses centuries of French history and shows the importance of good writing and  selectivity of material.  Reading about what I knew, fairly well, enabled me to consider what he was up to.Yes, he writes damn well -- but why can't I remember anything vital ? Is it important to learn that Josephine Baker danced wearing only a crotch feather and had a boff w author Georges Simenon? Or that Nijinsky may have performed, at least once, minus a jockstrap? I do like the Sacha Guitry quote: \"The burdens of marriage are too heavy to be borne by two people alone.\" In the 7th \"Age,\" when author turns to post-war2 culture (and his researchers fail him here), he ignores the New Wave cinema revolution (with an off-hand line or two), which dismays me, as this had a profound effect on La La Land. Belmondo, at this time, was on the cover of LIFE, for god's sake, in a French movie:  That Man from Rio.  He was followed by Jeanne Moreau on the cover of TIME (1965). Very rare kudos! Blinkered author gives a mild hiccough over the disastrous building of La Tour Montparnasse, started in 1959 and finished in 1973, that famously obscene skyscraper in the middle of the Left Bank -- a ghastly blight on the Paris he claims to love so well. At this point, I thought,  Aw, piss off Mr Horne!  I do not believe he \"loves\" Paris.So, I dutifully returned to the beginning, \"Age 1: 1180-1314,\" and plodded along, cranky, but curious. He stays very chatty and is never hesitant to repeat a cliche, like \"Paris is a woman.\" Here, I required a double vodka martini. He mostly delivers political strategems-betrayals-deceits-wars-slaughters-royal mistresses & bastards-and the stench of Paris sewage. (It wasn't until the 1970s that every hotel room had a wc -- and many apartments, too.) Aah, the necessity of perfume, so important, I pondered....well, he didn't. Bidet, anyone?Author Horne likes Henry IV (reign: 1572-1610), who was stabbed to death by a Catholic crackpot in his open coach during a traffic jam. (Mull that--) Henry was kindly to Protestants. Nancy Mitford gushes over Louis XIV, the Sun King, though 1000s of Versailles chamber pots had to be emptied, but let's move along... ca va ?  ~~ I like author Horne when he allows that life at Versailles was leaden -- unless you had a taste for cards, hunting and gossip. In sum, my feelings are mixed. And rather blurry. Let me recommend anew \"The French\" by Sanche de Gramont, who offers a perceptive look at everything French, \"from bureaucracy and pettiness, to grandeur, fashion, politics and philosophy,\" and, of course, food and sex. This is the book you want. He points out that the US-English kid is told to \"be good.\" By contrast, the French child is always told,  \"sois raisonnable\"  -- be reasonable. This is called Thinking French.  Ca va."}, {"userName": "Caidyn (BW Book Reviews; he/him/his)", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/13614926-caidyn-bw-book-reviews-he-him-his", "userReview": "This review and others can be found at BW Book Reviews.For me, this book was a great big ball of meh. I got it from a bookstore because I thought it sounded fascinating. A historian telling me what he thinks the seven ages of Paris were and what happened during those ages? Fascinating! A social history, in a way, all focused on certain ages he noticed through his years of study.That wasn’t this book. If anyone knows of a book like that, please hit me up. I think another reviewer said it best: This book is an aging British scholar’s love letter to Paris – and it read that way. He focused on the rulers and the politics of their reign, not the experiences of the people in Paris. Instead of a social history, it was a political history. And that made it super boring since it focused more on the various rulers rather than what the people felt.I found it pretty boring and watered down by the opinions of an aged historian. Such as, he loved assuming the sexuality of various rulers. And he’s using a definition of homosexuality that was created in the 1800s and applying it to people who were around centuries before it was created. So, that’s a bad thing to do as a historian. You don’t apply modern terms to historical people. As an example, I wouldn’t call Joan of Arc transgender because that term wasn’t a thing back then, even though she shows some signs of it. That’s not the best example, but it’s one I could come up with. You just don’t do that as a historian. And he labeled multiple people as “homosexual” when they had relationships with women and some of them actually had kids. Yeah. He called them homosexual when they were, at best, bisexual.Then, he had a bias against Marie Antoinette and he made so many other snide comments that I became exasperated. Great, he has an opinion, but they’re not backed up by history. And it felt like this was, as the reviewer before me put it, a love letter to Paris. It was terribly boring. Especially since Paris isn’t my favorite city in the world.In short, I wouldn’t recommend this book. It’s readable and somewhat interesting at times, but it wasn’t what I was looking for. I should have read some reviews before I went and bought this one, but I’m glad it’s off my TBR."}, {"userName": "John Norman", "userReviewDate": "Feb 04, 2012", "userURL": "http://www.goodreads.com/user/show/141355-john-norman", "userReview": "This book is a real mediocrity. I'm living in Paris for a few months, so it seemed only reasonable to read a book that is a \"history of Paris.\" Well, this isn't it. What this is, is a history of political events in France, and the impact of those events on the rulers of Paris, and, to some extent, the ordinary middle-class and poor. You learn very little of the changes in the governmental structure, the organization of the food supply, the periods of architectural change -- isn't that what a history of a city would tell you about? Instead, the author manages to pack in every bit of gossip he can imagine about the monarchs and generals. We read that Henry IV smelled bad but had many lovers. I suppose that's interesting. We only learn of the architectural style associated with his reign in passing.If you just want an old-fashioned political history of France, centered on Paris, with very little nuance regarding societal structure, this book may be for you. But it is thin gruel if you want to learn about the city."}, {"userName": "Kate", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/7302208-kate", "userReview": "Meh.If you're looking for a history of Paris, I wonder if perhaps one would just do better getting one of the excellent books on the history of France. This book is an aging British scholar's love letter to Paris - and it read that way. My pre-modern knowledge of Paris is weak, so I enjoyed that part of the book more. However, my recent history is fairly good, and there the book really failed. There were a few too many throw-away descriptive adjectives - the Pompidou is an \"eyesore\" (possibly...), Gertrude Stein was \"dumpy\" (relevant how?),Josephine Baker was a \"superb animal from the jungle\" (there are no words). The author showed more sympathy toward young German soldiers suffering cold shoulders and hostile looks in wartime Paris than to French women who became Army nurses (\"many joined looking for adventure\" - I'm waiting for the evidence on this, thanks) or to those Jews who managed to make it back from concentration camps only to find their property and possessions gone (barely discussed). Last, I would, perhaps, not call the 1968 Belleville Jewish - Muslim violence a \"fracas\" - this had far more geopolitcal significance than that.There are some entertaining anecdotes - this would be a useful book if you had to deliver a lecture on French history and needed some good stories to spice things up. Who knew that in the early 1900s, German officers in France were prohibited from doing the Tango in uniform? Or that French women got 8 weeks of maternity leave?Very little, however, is translated or explained. Don't know the significance of the events at Mers-el-Kebir? Be prepared to look them up!Overall, well, see my first sentence."}, {"userName": "Eliot Boden", "userReviewDate": "Jul 21, 2013", "userURL": "http://www.goodreads.com/user/show/10601146-eliot-boden", "userReview": "Incredibly disappointing. While this book is marketed as popular introduction to Parisian history, perhaps something lively to read before a vacation, the writing is dull and oftentimes confusing. Horne could not decide on an audience for this book. Such a cursory overview of millennia of French history cannot appeal to someone already familiar with the likes of Louis XIV or Napoleon. Even so, the oblique references to people and events, often with no background explanation, make the narrative difficult to follow. Paris itself - ostensibly the central focus of the book - is too often mentioned as an afterthought, as Horne spends much of his time discussing the virtues and foibles of monarchs and other greats instead. Surely there are better histories of Paris, but if you must read this one, have a Paris guidebook and French dictionary ready (Wikipedia wouldn't hurt either) if you intend on keeping up with Horne's self-aggrandizing name-dropping."}, {"userName": "Cindy", "userReviewDate": "Aug 19, 2009", "userURL": "http://www.goodreads.com/user/show/339857-cindy", "userReview": "Themes: civilization, war, government, religion, politics, city development, art, architecture, royaltySetting: Paris, France from before 1000 AD to 1968The author starts by saying that every city is like a person, and Paris is definitely a woman. Like any fascinating woman, she is changeable and captivating. I'm not entirely sure this conceit works, but it's not a bad way to start off the book.Here's what works: I could certainly feel the amount of research that must have gone into this book. I'm sure it was staggering, and it shows. The author is obviously really familiar with all the key people, places, and ideas. And I liked being able to link things together. For the first time, I really got a sense of how all those Louis's fit together and exactly who Cardinal Richelieu was.What didn't work: Really, it was too much. I was overwhelmed. Some of that may have been my fault, for trying to read the book straight through, without putting it down for very long, but I was afraid I would lose my place, so to speak, if I set it down. So I pushed through and it got to be confusing. Personal feelings: I was actually glad to see that the writer sort of skimmed through the French Revolution. It became just one of a series of revolts occuring in the capital, and rather than go into all the disgusting violence in a lot of detail, he just hit on a few things, especially how it affected the look of the city itself and the economy. I read The Lost King of France last year and that one had gory detail piled upon detail of dismemberment, torture, and so on, until I couldn't wait to put it down. This book spared me all that, and I was glad. But if you are interested in the history of France primarily during the French Revolution, this is probably not a great book for you.My other observation is probably not the author's fault, but the publishers. This is the kind of book (or I am the kind of reader, I don't know which) where you need some more maps and illustrations and so on to figure out what's going on. Instead of having them throughout the text, there are a few pages of color pictures and a few pages of black and white pictures, and that's it. I would have liked at least a black and white picture of all the major monarchs and landmarks. He assumes that you know what Paris looks like, but I only know what I've seen in books and movies. But like I say, that may be the publisher. They seem to be very picky about how many pictures they will include.Overall: I enjoyed this book, somewhat, but I came away with the strong impression that I am EXTREMELY glad that I do not live in Paris, especially in Paris before 1900. It sounds like a horrible place to live for most people. Yes, there were great artists, musicians, scientists, and politicians who lived there and left their marks on the city. But most of the time, it was a miserable place to be, with plagues, fires, open sewage, constant violence, and little or no civil liberties. Various groups would be rounded up for whatever reason - heresy, political unrest - and summarily executed or tortured. I know this went on in most of the world, but wow, I got really tired of reading about it page after page. I debated between 2.5 stars and 3, but I decided to round up, because I think the author did a pretty good job. It's just that I found the subject rather grimmer than I expected."}, {"userName": "Christoph", "userReviewDate": "Jun 26, 2010", "userURL": "http://www.goodreads.com/user/show/1848234-christoph", "userReview": "Lets make this a 1.5 stars or 3 out of 10. I am so close to giving this book 1 star; it is extremely disappointing. I have had this book sitting on my shelf for years now and I see why I have never read it. You would expect a book entitled the Seven Ages of Paris to be a history of the interminable city; alas, all we get in this tired narrative is a history of the \"Seven Ages\" which are a completely contrived device to make the story somewhat more readable. Further, according to Mr. Horne apparently, an age is merely defined by one man, and always a man. Although, he occasionally assures us that the city itself is utterly female apparently because women have dared to make a mark on its history. Another thumbs down beyond his cult of personality view on history is his subtle, but clear sneering view of left-wing and populist struggles/organizations throughout French history. Although these movements in many ways define modern French culture, they are constantly looked-down on or left on the fringe of discussion in place of what he views as the true defining characteristics of an age, typically an exhaustive review of the nefarious actions of a given autocrat or their minions which normally define the given age.This truly myopic view of French history that in most cases reads like a tabloid gives us little insight beyond your run of the mill high school history textbook. Sure he refers to original sources quite often in his notes and bibliography, but they seem quite often to be to provide the most bizarre anecdote possible from that time. From there, he selects a very short-range of sources for an extremely broad endeavor or, even worse, himself (inevitably he reminds us). The book also suffers from a further problem of having too little information to process in the first three ages which account for nearly 600 years of history whereas in the final 150 which make up the final four of these ages suffers from an overwhelming dearth of information that it all starts blurring together with little context beyond his stream-of-consciousness consideration of it all.If you do not mind a subtly biased, pompous rehashing of French history (note, not Parisian) and are desperate for some extra references for your high school history report, this is the book for you. Those who want a unique, thoughtful perspective on French history should look elsewhere. Those that want a history of the City of Lights itself, do not even bother."}, {"userName": "Noah Goats", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/41735508-noah-goats", "userReview": "Paris has a history that is deep, rich, and exciting. Horne is a great writer who has been writing about French history forever and knows his subject in depth. This wonderful book is about what you would expect from that combination of factors."}, {"userName": "Marti Graham", "userReviewDate": "Jun 22, 2013", "userURL": "http://www.goodreads.com/user/show/7325562-marti-graham", "userReview": "If you want to really know about PARIS, this is the book to read."}, {"userName": "Marguerite Kaye", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/3578169-marguerite-kaye", "userReview": "An absolutely excellent read, thoroughly enjoyable and the best book I've read on Paris. This is a really well-written and highly readable history of Paris, even if you know nothing of the history. It's nicely set out so you can dip in and out of each age if you want, and it gives the reader a really clear and fascinating insight to how the city has developed (and in-developed!) through the ages, how leaders have tried to mould the city to reflect themselves, how they've used and abused it (and its inhabitants) and how the Parisians have struck back. It would be difficult to get a more turbulent city in modern times, and Horne covers the period of revolutions from 1789 and the trashing of the city, through the Napoleonic years and his attempt to make a new Rome of it, through the Year of Revolutions, right up to the Commune in really enthralling detail. Paris in 1815 was filthy place, with sewers running down the middle of the streets and bodies being dumped in the Seine. Horne gives us this Paris, and yet at the same time gives us also the glittering city of light which was its alter ego, and the undercurrent of unrest and poverty which was its downfall and, ironically, in Hauseman's years, its making. I have recently re-read Andrew Hussey's Paris, A Secret History, and of the two, I'd say Horne's book is the one which stands out for me (though both are excellent). So if you're looking to get to grips with this most fabulous city then this is most highly recommended."}, {"userName": "Jenn", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/187472-jenn", "userReview": "One of the most difficult books I have ever forced myself to complete and I kind of think I am pretty good at reading boring books. The author assumes the reader has a general knowledge of Europe over the last millennia and while I admit it is an awful lot to cover, his writing seems overly pretentious. Granted, he appears to be from Europe and an older gentleman (a quick google search confirmed he died in 2017), he insists on frequently using French phrases and quotes without bothering to translate them. His robust vocabulary and intricate phrasing is perhaps not appropriate for his audience, at least not if the audience consists of people like me. For example (a random page chosen): \"Over several anxious days, Paris braced herself for a possible descent from the skies of the paras from Algeria, tough and hard-fighting men fed to the teeth with the tergiversations and pusillanimity of civilian politicians.\" I might give this a 2.5 because I actually did come away remembering some of the names and places and events that made Paris, Paris. I wish it had been dummied down for people like me. Glad to be done with it."}, {"userName": "Emily", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/33144057-emily", "userReview": "A love story to Paris and her history! I did find myself getting confused between all of the French governments. In the span of 250 years there had to be at least 10 different governments/revolutions/uprisings! The epilogue on Père Lachaise Cemetery ended up being my favorite chapter of the entire book! I haven’t been to the cemetery yet, but Horne did a great job of writing about its beauty, despite the fact that it’s a burial ground, as well as describing how that one spot can be a place from which not only to get a great view, but also to walk through Parisian History by visiting famous, and sometimes quirky, graves."}, {"userName": "Jill", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/2943164-jill", "userReview": "I do not recommend this book. Made it halfway through the Fourth Age and gave up. This is the worst history I've ever read. After slogging through centuries of names, dates, mud, and rocks, I have no feel for the forces that shaped Paris. And to foreshadow the 1789 Revolution for decades and then skip from the death of Louis XVI directly to Bonaparte? At this point, I don't want to know what Horn thinks about the 19th and 20th centuries. Very disappointed."}, {"userName": "Barbie", "userReviewDate": "Jun 26, 2009", "userURL": "http://www.goodreads.com/user/show/953207-barbie", "userReview": "I thoroughly enjoyed this book. It's very dense with information on how the omnipresent relationships between Paris, her rulers, her people and her country at large has formed her over her long history, but is written in a very easy flowing, conversational way. Allistair Horne is a master of descriptive language and transitions, but the book is not burdened with fancy language for its own sake.Horne is a Francophile, and writes lovingly of the storied, often tempestuous history of Paris — and thereby France at large — but he does a great job of explaining the political and social contexts without being biased toward one pure ideology or another, which is helpful when one tries to understand what happened and why, sans filtration of a political bias. (The one exception is, of course, the Nazis, though he is academic in his description of their depravity.) All is geared toward events' and people's effects on Paris, and Horne's many often hilarious details are illuminating. He pokes fun, lovingly, at the quirks of the French and their propensity for drama, as well as indexing details of individual lives that truly make this much more than a history book.I happened to be reading on Bastille Day about the Nazi occupation, and Horne's evocative writing nearly brought me to tears. Overall, I would say this book will give a reader a much deeper and more sophisticated understanding of the French, though I would recommend for those unfamiliar with the history at large, to keep a time line of French and some European history or something handy, as Horne handles his subject topically within the larger, well organized chronology, and skips around just a bit. (Names are particularly difficult to keep track of.) Also, Horne sprinkles his writing (without translation) with French phrases, not all of which have made the jump into mainstream English usage, which may be difficult for those who don't speak it, or are just beginning. So, I would recommend a little French-English dictionary to help if you really want to understand it all. (Some of those French phrases are pretty funny, so they're worth the effort!)Though I don't regard this book as difficult, I would describe it more as an \"upper-division\" French history book. It may help to read \"Sixty Million Frenchmen Can't Be Wrong,\" a much quicker glance at why the French do what they do, to get the juices flowing. Together, they will, hopefully, help a reader truly feel sympathique with the French.To anyone who feels an affinity with France, your heart will swell over and over throughout this glorious history."}, {"userName": "Frank Stein", "userReviewDate": "Apr 12, 2010", "userURL": "http://www.goodreads.com/user/show/1398873-frank-stein", "userReview": "Somehow Horne manages to write an entire history of France by telling the entire history of Paris without being pedantic or stodgy. It's an amazing accomplishment from a journalist with no formal historical training.As Horne himself says it was probably necessary to combine the history of the country with the city, because in France, government, business, and culture have been centralized in its capital city as in no other Western country. Ever since Philippe Auguste in the early 1200s built an enceinte around the Right Bank and laid the first stones of the Louvre (probably derived from louver, \"blockhouse\"), the Kings of France have spent an inordinate amount of energy building and expanding their capital, and that effort in turn cemented the city's dominance.Horne shows that this construction was constant. Henry IV lined the Seine with quays and personally created the Place Royale, the first residential square in Europe (originally built for the working class, like many innovative developments it quickly went upmarket). Even though Louis XIV retreated with his government to Versailles, he still worked to level the old city walls and create the first modern \"boulevards,\" as well as Champs Elysee (laid out by his Versailles architect Le Notre). Louis even imported swans to liven up the Seine (it was still too polluted, however, and they immediately flew away). Even while he was conquering Europe, Napoleon found time to write dozens of letters back to Paris on such seemingly mundane issues as the organizing of the city bureaucracy and the straightening roads like the Rue de Rivoli. The book also contains lots of worthwhile side-stories. For one, the power of mistresses under the French kings was astounding. It was probably the Madame de Maintenon who disastrously convinced Louis XIV to revoke the edict of Nantes in 1685. Horne also draws attention to the continual despolitian of the Jews. Ever since Philippe Auguste in 1180 had the Parisian Jews arrested and ransomed for all their wealth, it seems like the Jews were ransacked every few generations, right up to Marshal Petain.Despite an absence of maps and a flurry of proper names, this is the best book on France I've ever read."}, {"userName": "James", "userReviewDate": "Dec 25, 2009", "userURL": "http://www.goodreads.com/user/show/426277-james", "userReview": "I read this as background for my class on the literature of Paris. It is an excellent overview of the history and culture of the city. Covering the history from the foundation of the city the author blends the cultural development with history. The impact of art from the Renaissance to the age of Impressionism that ushered in the twentieth century helped offset the intermittent devastation of war and revolution. Over the centuries is was home to Peace conferences and Art exhibits. Nearest to my passions is the influence that Paris has had as a center of music over more than two centuries. The result of the events chronicled is a unique portrait of what many consider the most beautiful city in the world."}, {"userName": "Nathan", "userReviewDate": "Dec 14, 2010", "userURL": "http://www.goodreads.com/user/show/1064644-nathan", "userReview": "A slog, all the way through. Horne's organization of Paris's history into seven ages is neat, if rather arbitrary, and it highlights the tumult that characterizes the city. If his orgnization is clear, however, that's about all that's clear in this rambling tome. Fact, fact, fact, character, character, date, uprising, some more facts and dates; there is no narrative guidance to speak of. One gropes and stumbles through this book more than reads it.Adding to the obfuscation is Horne's annoying habit of peppering the text with French phrases that he doesn't bother translating. That's irritating in the extreme and served no purpose but to make me dislike Horne in addition to disliking his book. I'm sorry I wasted the time."}, {"userName": "Margaret Sankey", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/5861086-margaret-sankey", "userReview": "Horne loves Paris, and has been collecting information his entire career, most of which has found its way into his accounts of other events. This volume centers that wealth of accumulated stories, connections and poignant details into a portrait of the city herself--medieval center of royal power, focus of the religious wars, left behind by Louis XIV, ground zero of the revolution, given a face lift by Baron Haussmann, lively with the Belle epoque, ravaged by two wars and revival as the center of chic. This is a love letter to one of the world's great cities and a reminder of many lovely visits and historical incidents."}, {"userName": "Jon", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/11280166-jon", "userReview": "Got this to get a sense of Paris before an almost upon us trip in October. Horne's sweeping history is about much more than just Paris: He gives you a nutshell version of French history to provide context for how Atherton city of Light evolved. Descriptive, chatoyant, violent, you come away with the feeling that the city is lucky to be standing at all. One suggestion--read it with a map open beside you."}, {"userName": "Avis Black", "userReviewDate": "Dec 23, 2008", "userURL": "http://www.goodreads.com/user/show/930189-avis-black", "userReview": "I generally like Horne's books but this is one of the most intellectually lightweight volumes he's ever produced."}, {"userName": "Kira Nerys", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/10694618-kira-nerys", "userReview": "Dunno why the goodreads summary of the 2004 edition is so much better than the one for this version, but whatever, I own this publication. I read the majority of this (4/5ths) for school and didn't pick it up and finish it till a year and a half later. An utterly comprehensive history of Paris (and France), the academic writing is impeccable but not necessarily enthralling. I enjoyed it, though some of my classmates criticized its tediousness. For example, since I resumed reading with the German occupation during WWII, Horne did not simply write \"Germans took over Paris's hotels\" but instead delineated precisely which branches of German command occupied which hotels. When I began the book, I was living in Paris, and the historical detail enhanced my understanding of the city itself: its layout, its history, its culture, and the love Parisians hold for it today. If I hadn't been immersed in that history, this love letter of a book would have become dull and confusing very quickly. As it is, Horne never really criticizes the French or their capital; relies on the reader knowing something about Parisian geography; and takes advantage of this book as a venue to show off his knowledge. Without a doubt, the excerpts from firsthand accounts are the best part of this whole book, and well-used. The beautiful construction of the lengthy academic sentences betrays his emotional investment without relating to the everyday reader. If you aren't looking for an intensely detailed read--or you aren't living in Paris--I wouldn't recommend Seven Ages of Paris."}, {"userName": "Derek Douglas", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/30936167-derek-douglas", "userReview": "Started reading this before a week-long trip to Paris, just to learn and get more out of the city and culture. It definitely delivers in that regard, with Horne writing with an obvious love of the city and Parisians and often with a flair of humor.After my trip, I was still reading and really got more enjoyment out of the book since I would know the areas of the city frequently referenced. This book would be difficult if you've never been to Paris or don't have a general sense of the neighborhoods, major buildings and monuments. Also, while this is a history of a city, Paris was involved pretty much in every major event for the last 1000 years in Europe. Having a general sense of European history is also a benefit since Horne will assume the reader does.Overall it is an excellent narrative of the history of the city and its people. I would've preferred more details on the Roman history and the period leading up to the medieval period, but the descriptions of the politics, culture and the frequent civil unrest give you the sense of Paris as a living and breathing organism."}, {"userName": "Nastya Khyzhniak", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/51038656-nastya-khyzhniak", "userReview": "I wouldn't call this book \"Seven Ages of Paris\", more likely Seven ages of France or People who influenced France. Of course, some key events happened in Paris, but their influence to Paris is left quite often to be unspoken. Setting to read this book, I was interested in the Paris-based legends and stories to know better the city I live in. And, yes, I found some of it in this book: small crumbs of useful information amidst so many generalizations. The narration is very chaotic, the author jumps between events, then he goes back, then forth and so on. The thing I hated the most is the comparisons with the future events: \"The King decides to do something like President X will be forced to de in 200 years\". Instantly you have millions of questions about the future, while you are not there yet. Moreover, the tone of the book is very judgemental. It seems to be written not to explore situation or motives of people, but to sell. Thus the non-relevant sex life details or the meticulous descriptions of tortures. How does it help to understand Paris better?"}, {"userName": "Gianluca Micchi", "userReviewDate": "May 16, 2017", "userURL": "http://www.goodreads.com/user/show/25553105-gianluca-micchi", "userReview": "A lengthy book not only about Paris but about the history of France at large, passing through all the kings, emperors, wars, artists etc. that graced the country from its very beginnings up to 1969. It is very interesting and can be read both as a reference book and as a story being told in an engaging way, although slightly inconsistent. Certainly, Horne has his preferences and does little to hide them. But after all, I wouldn't take this as a scientific book where only facts should be told, but also as the view of a person that spent a very long time in daily contact with these topics. Moreover, his point of view is fair enough never to become disturbing.Four stars, looking down to three due to a certain inconsistency in the interest that it sparked in me in various ages, but four nevertheless."}, {"userName": "Drake", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/75754472-drake", "userReview": "I enjoyed this book, but at times I found the scope to be a bit too large and meandering. In the interest of painting a fuller picture, the author draws from a great deal of specific stories and examples, which was at times too much for my attention and background knowledge for me to process meaningfully. I also agree with another reviewer who points out that some of the chosen details are unimportant, and some details that should have been included are somehow left out.However, the book thoroughly accomplishes the implied goal of chronicling these seven ages of Paris. I came away from the book with a much more complete understanding of French History, and the author succeeds at framing the progression of events in a way which resonate as realistic and objective. I will never consider either of the world wars in quite the same way; my previous flat view is now replaced with a more organic view of the brooding multi-century conflict between France and Germany/Russia. My perspective on parliamentary politics has also grown immensely. For these reasons as well as numerous other personal takeaways and lessons, this book deserves all 5 stars."}, {"userName": "Bianca Picinali", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/52654936-bianca-picinali", "userReview": "A thorough history of Paris’ changing face and the characters who drove her changes. At times overly detailed to a point of confusion in the mess of names, dates and complexities. While at others certain moments were almost too vague they can’t be said to have been done justice. This book demanded attention from cover to cover and it was easy to forget details from the start of the book by the time you found yourself 100 pages further along if it wasn’t being read in a few short days. Overall a jam packed timeline of how Paris came to be what it is today. Enjoyable and informative but in ways forgettable like course notes you read once and never need nor manage to remember past that point."}, {"userName": "Queezle", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/1640000-queezle", "userReview": "This book was alright. It was organized roughly chronologically, but within each of the seven ages it wasn't chronological. This ended up being more confusing than it sounds, especially for the early stages of Paris' history. I think this book would be more interesting to someone with more of a background in the history of Paris than I had (because they would be less confused when the timeline jumped around)."}, {"userName": "Daniel", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/11232235-daniel", "userReview": "This is an absolute masterpiece. The author is amazingly well-documented and strictly sticks to Paris, not France or Frenchpeople. It's incredible to think that this city is as amazing as it is today considering its long history of negligence and war. Made me want to go back ASAP!"}, {"userName": "Nancy Bielski", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/2598246-nancy-bielski", "userReview": "Slow."}], "description": "In this luminous portrait of Paris, celebrated historian Alistair Horne gives us the history, culture, disasters, and triumphs of one of the world’s truly great cities. Horne makes plain that while Paris may be many things, it is never boring.From the rise of Philippe Auguste through the reigns of Henry IV and Louis XIV (who abandoned Paris for Versailles); Napoleon’s rise and fall; Baron Haussmann’s rebuilding of Paris (at the cost of much of the medieval city); the Belle Epoque and the Great War that brought it to an end; the Nazi Occupation, the Liberation, and the postwar period dominated by de Gaulle--Horne brings the city’s highs and lows, savagery and sophistication, and heroes and villains splendidly to life. With a keen eye for the telling anecdote and pivotal moment, he portrays an array of vivid incidents to show us how Paris endures through each age, is altered but always emerges more brilliant and beautiful than ever. The Seven Ages of Paris is a great historian’s tribute to a city he loves and has spent a lifetime learning to know.", "title": "Seven Ages of Paris", "url": "https://www.goodreads.com/book/show/137981.Seven_Ages_of_Paris", "average": 3.9, "cover": "https://images.gr-assets.com/books/1320557142l/137981.jpg", "reviews": 141, "authors": [{"url": "https://www.goodreads.com/author/show/11016.Alistair_Horne", "name": "Alistair Horne"}], "type": ["History", "Cultural", "Nonfiction", "Travel"], "outlinks": ["http://www.goodreads.com/book/show/137981.Seven_Ages_of_Paris", "http://www.goodreads.com/book/show/572387.Seven_Ages_of_Paris", "http://www.goodreads.com/book/show/2411472.Seven_Ages_of_Paris", "http://www.goodreads.com/book/show/851576.Seven_Ages_Of_Paris", "http://www.goodreads.com/book/show/18927359-seven-ages-of-paris", "http://www.goodreads.com/book/show/406776.The_Price_of_Glory", "http://www.goodreads.com/book/show/18242.A_Savage_War_of_Peace", "http://www.goodreads.com/book/show/1498079.To_Lose_a_Battle", "http://www.goodreads.com/book/show/961123.The_Fall_of_Paris", "http://www.goodreads.com/book/show/23871147-hubris", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}