{"ratings": 4822, "userreviews": [{"userName": "Inés Izal", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/25759167-in-s-izal", "userReview": "\" —Un solo instante de ti valía todas las eternidades.\""}, {"userName": "Haiiro", "userReviewDate": "Jan 06, 2016", "userURL": "http://www.goodreads.com/user/show/32372791-haiiro", "userReview": "Mấy ngày thời tiết u ám như hôm nay thật là không thích hợp cho tôi đọc mấy thể loại \"trữ tình\" này. Đọc được mấy cuốn hiện thực, xem được mấy bộ phim còn tối hơn cả hố đen bèn cảm thấy màu hồng thiếu nữ của Marc Levy đúng là không thể cảm được nữa :))Thôi không bàn đến tính bất hợp lí của câu chuyện quá mức trên mây trong này (nhiều lắm, nhiều muốn thổ ra một bãi lấp lánh ánh kim cương kim tuyến kim ngân luôn) thì đành phải nói tới chuyện là cô nhân vật chính - cô Zofia (ê chả hiểu sao trong cuốn này bác Levy chọn cho nhân vật toàn tên dị chứ) - quả là một Mary Sue xịn thứ thiệt, còn thánh nữ hơn cả thánh nữ. Thì bởi để cho chuẩn bài rớt từ trên chín tầng hư cấu xuống mà, cô này cổ phải chưa bao giờ biết nói dối là gì, làm công việc giúp đỡ những người bất hạnh toàn thời gian, cảm hóa thằng cha đại diện ưu tú của Lucifer trong một nốt nhạc chỉ bằng cái chớp mắt, lại còn đẹp tuyệt trần nhưng não tuyệt đối không hề ngắn... Thôi đành! Bởi ta nói trong trí tưởng tượng thì mọi thứ có quyền hoàn hảo.Anh zai Lucas thì hẳn phải là bad boy chính hiệu con nai vàng rồi, chứ ai đọc nổi một câu chuyện đã có Mary Sue lại có cả Harry Stu. Lúc đấy trong bụng cũng chả còn gì mà thổ :)) Không chịu nổi cái anh này đã xấu lại còn xa, đã không ga lăng lại còn hà tiện. Ăn cắp xe, vượt đèn đỏ... thì thôi chả buồn nói nữa (thế người ta mới gọi là rưn chơi), nhưng mời gái đẹp đi ăn mà quỵt cả tiền boa nhân viên để nàng phải ra tay tương trợ thì ếu thể hiểu sao mà yêu được ấy. Chả biết cao to đẹp zai thế nào chứ đọc xong em chỉ tưởng tượng ra một thằng xấu xấu bẩn bẩn không hay tắm thôi.Tàu thì cứ phải gọi là siêu tốc, nhưng mà motif nhàm lắm rồi. Lại còn biết trước cả kết quả. Chứ hông nhẽ truyện cẩm hường mà cái ác lại thắng à? Mà buồn cười cái hai người siêu cấp giỏi đấu nhau chả có tí kế hoạch chiến thuật tính toán gì cả, cứ hồn nhiên như cô tiên và thằng điên ấy. Ơ mà thôi đã bảo không bàn tính bất hợp lí rồi.Đọc xong có thể rút ra một kết luận rất chi sâu sắc: khi xưa chuyện tình Romeo với Juliet fail là vì sao? Là vì chưa kịp làm đứa con chứ sao nữa. Ngạc nhiên chưa =))"}, {"userName": "Simon", "userReviewDate": "Aug 20, 2008", "userURL": "http://www.goodreads.com/user/show/745423-simon", "userReview": "I never really got into this one. The main idea (God and Satan agree to send one agent each to Earth in order to battle for the future of humanity) is never fully explored, or even explained. We are given no idea what the agents' powers are (the demon spends most of his time stealing cars, while the angel does little other than visit people in hospital, help old men across the road, and other pitifully small acts of kindness). It just meanders along in a plotless kind of way, with interminable scenes set in the San Francisco docks, where the angel works (for no good reason). There are a couple of good scenes once the two agents actually meet, including a fairly impressive one where the demon tries to tempt her into doing something bad, but it's too little too late, and only hints that the kind of book this could (should) have been."}, {"userName": "Mélodie Landry", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/78099337-m-lodie-landry", "userReview": "One of my favorite book from mark levy!! :)"}, {"userName": "Nina Draganova", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/20038488-nina-draganova", "userReview": "Няма сила , която може да спре Любовта. Нито даже Господ, ни Сатаната.Тя е всесилна.В това ни убеждава и тази интересна история.Написана с чувство за хумор и стил , който те увлича и не ти оставя време да спреш до края.Това е първия ми досег с автора и няма да остане последен.Оказа се , че той е автора на книга по която е направен и един много приятен мой любим филм.Ще се чете. Радвам се , когато откривам отново топлата вода.\"Човешкото творение е може би несъвършено, но нищо не е по-съвършено от света на две същества, които се обичат.\""}, {"userName": "Susana", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/7301000-susana", "userReview": "I liked the concept of the story, but not how it was developed."}, {"userName": "Ne", "userReviewDate": "Sep 25, 2011", "userURL": "http://www.goodreads.com/user/show/5407834-ne", "userReview": "Um livro diferente sem dúvida, tanto de Marc Levy como de outros autores.Adorei a ideia da história, apesar de defender que está muito mal aproveitada e subdesenvolvida. Muito mal talvez seja extremista, digamos que está satisfatoriamente aproveitada. O inicio está mais ou menos, mas depois desde que Lucas e Zofia se encontram fica tudo muito apressado e com alguns lapsos. Por isso, concluo que o melhor de Sete Dias Para a Eternidade é mesmo a base da história.Gostei também das personagens, principalmente de Deus, do Diabo e do Anjo Verificador (mais não digo!), o que acaba por ser negativo para o livro, visto que são personagens secundárias.Gostei particularmente do final, que acabou por ser original, apesar de óbvio, já para não falar de ter uma certa piada.Em termos de \"exteriores\", esta capa não é a mais atractiva, mas sinceramente nenhuma de Marc Levy o é. A sinopse é melhor e inspira bastante curiosidade, principalmente para não-católicos.Concluindo, cada vez fico mais desiludida com os livros de Marc Levy. O primeiro (A Próxima Vez) achei fantástico, mas os últimos dois (E Se Fosse Verdade... e este) tornaram-se muito fracos e acabaram por não corresponderem às minhas expectativas. O que têm de melhor é mesmo o factor de originalidade (mal aproveitado) e o facto de serem pequenos e fáceis e rápidos de ler."}, {"userName": "Anna", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/16697168-anna", "userReview": "They had only 7 days to turn it into their own eternity...I love this book. My favourite by Marc and one of my all-time favourites.I fell in love with this story as soon as I heard what it's about. Characters are amazing, deep, real, light. You sympathize them throughout this book and 'till the end. Just absolutely stunning.And it was one of the few books, with which I cried so hard in the end...(but you'll see, that this book ends differently, when you'll read it.)Just catches you until the last page and never let you go.Read it!"}, {"userName": "Jeanne", "userReviewDate": "Jan 12, 2013", "userURL": "http://www.goodreads.com/user/show/6986121-jeanne", "userReview": "Jusqu'à la semaine dernière, je n'avais jamais lu Marc Lévy. Cet auteur aligne pourtant les bestsellers en France depuis plus de 12 ans, et il est revendiqué par les lectrices de romance comme étant lui-même un auteur de romance. Une façon comme une autre de prouver qu'on trouve de la romance en dehors des collections de Harlequin… L'aspect le plus énigmatique de l'affaire, pour moi, c'est évidemment qu'il est un homme, alors que 99,9 % des auteurs de romance sont des femmes.J'ai lu Sept jours pour une éternité… Je l'ai lu en deux jours. C'est tout petit ; ça fait 300 pages en format poche, mais alors un format écrit gros, rien à voir avec 300 pages chez J'ai Lu pour elle ou chez un éditeur de paperbacks américain. C'est très facile et très rapide à lire. Niveau écriture, c'est bizarre : c'est inégal. Il y a des passages que j'ai trouvés très maladroits, du genre que j'ai envie de sortir mon stylo rouge de correctrice et de m'en servir dessus. Lévy a une façon de juxtaposer entre des virgules des propositions qui devraient être des phrases indépendantes, ou au pire, séparées par un pont-virgule.Il écarta le voile grisâtre et immobile pour étudier la cour intérieure, aucune brise ne viendrait chasser la pollution qui envahissait le bas de Manhattan et s'étendait jusqu'aux limites de TriBeCa.[…]L'œil de Lucas s'éclaira à nouveau, un longeron de métal aiguisé filait vers le sol à une vitesse vertigineuse.Je n'ai jamais vu ça, et je n'arrive pas à le comprendre. Lévy commet aussi une autre faute de goût : il passe du passé au présent d'un paragraphe à l'autre. J'haïs ça. Est-ce que c'est censé s'appeler un \"style\" ?En même temps, vous me connaissez : selon moi, l'écriture, c'est mineur. Passons à l'histoire. Zofia et Lucas ne se connaissent pas ; ils ont chacun leur vie aux États-Unis. Pourtant, ils ont tous deux une identité secrète : elle est un ange au service de Dieu, et lui est un démon au service du Diable. Le monde est coupé en deux entre l'Orient et l'Occident, et Dieu et le Diable dirigent leurs opérations depuis le Transamerica Building (le plus haut gratte-ciel de San Francisco, qui a une forme pyramidale ; une référence aux Illuminati ? LOL).Et attention, ça se corse… Dieu et le Diable ont fait un pari : chacun a le droit de choisir un de ses agents d'élite, et au bout de sept jours, ils fusionnent le Paradis et l'Enfer et le gagnant prend le contrôle. Ouais, le gagnant. C'est un peu là le problème. Vous avez deviné que Zofia et Lucas vont chacun être choisis par leur boss respectif, mais moi, qui ai lu le livre, je n'ai toujours pas compris en quoi consistait leur mission. Ah, si : \"entraîner l'humanité vers le bien ou le mal\".Sauf que Zofia et Lucas se contentent, sept jours durant, de vivre leur vie normale (et de flirter ensemble)… Zofia est officière de la sécurité sur les docks de San Francisco, et en bonne samaritaine, elle est engagée dans un tas d'activités vertueuses (apprendre le braille à des aveugles et passer du temps avec des enfants souffrant de maladies incurables). Lucas, au contraire, débarque à San Francisco avec l'idée de semer la zizanie dans un important groupe immobilier, afin d'entraîner une série de catastrophes boursières. Son plan l'amène notamment à tenter de faire fermer les docks pour pouvoir racheter les terrains et les reconvertir. Du point de vue de la romance, il y a un conflit externe tout fait, qui aurait pu suffire et être proprement exploité.Mais non, il y a cette histoire d'ange et de Diable en plus qui, à mon humble avis, ne fait aucun sens. Certes, ce n'est pas réaliste et ça ne cherche pas à l'être. Mais ce n'est pas vraiment spirituel ou drôle ou inventif non plus. En gros, c'est du fantastique de bas étage. On dirait des raccourcis pour ne pas avoir à justifier des choses qui ne sont pas vraiment justifiables, et là, je veux parler de ce qui pèche dans la romance. L'héroïne est parfaite, évidemment, c'est un ange ; elle est aussi absolument fade. Le héros est… un peu ridicule, et vraiment mal construit. Il ne prend rien au sérieux, il n'est pas poli (oh, mon Dieu !), il est radin et un goinfre, et la mort et la souffrance lui font plaisir. Comme s'il suffisait de coller ensemble pêle-mêle des péchés stéréotypés pour faire un personnage ?Dès qu'ils se voient, ils n'arrivent pas à se quitter des yeux pendant quelques secondes, puis un verre se brise. Après ça, il lui court après, et de son côté à elle, tout le monde lui répète qu'elle est en train de tomber amoureuse, alors elle tombe amoureuse. Hein, quoi ? Je ne vois pas de logique là-dedans. En fait, je n'ai jamais compris ce qu'elle trouvait à ce mufle. Via la meilleure amie de l'héroïne, une ex-droguée, on comprend que Lucas est très séduisant. Mais à travers les yeux de Zofia, JA-MAIS. En fait, on ignore leur physique à tous les deux. Et à un moment donné, ils passent la nuit dans une chambre d'hôtel, mais il n'est pas même suggéré qu'ils ont couché ensemble. Ou alors c'est tellement éludé qu'on dirait que ça n'a aucune importance. C'est vrai que quand on couche avec une personne pour la première fois, ça n'a absolument aucune importance, ça ne change rien du tout…D'autant qu'on n'arrive pas à imaginer Zofia autrement que vierge. Cette fille sans passé, qui bénéficie pourtant d'un étrange enracinement à San Francisco, qui occupe chaque seconde de son temps en donnant aux autres sans rien recevoir, ne sait pas ce qu'est l'amour. Et bam ! en sept jours, elle sait que c'est Lucas, le bon. Alors oui, dans le sens objectif, Sept jours pour une éternité… est peut-être une romance. Il y a deux personnages qui se rencontrent, qui tombent amoureux et qui finissent ensemble. Sauf que si c'est une romance, c'est l'une des moins réussies que j'ai lues… On ne ressent rien, et surtout pas l'amour que se portent supposément les deux personnages, qui n'ont du reste rien d'attachant. (La copine droguée est la plus marrante du lot.)Finalement, j'ai eu l'impression que ce roman était à propos d'autre chose que l'est la romance, mais je ne sais pas quoi. Je ne dirais pas que c'est \"sappy\" (à l'eau de rose, cruche, niais). Ce serait plutôt, au contraire, pas assez sentimental pour moi. Tout en nous racontant cette supposée histoire d'amour, l'auteur passe complètement à côté des sentiments qui nous feraient éprouver de l'intérêt pour le récit. Le ton est étonnamment détaché, parfois un peu sarcastique (mais sans parvenir à être drôle). La partie qu'on peut sauver serait l'histoire un peu policière entre les magouilles de l'entrepreneur que Lucas cherche à manipuler d'un côté, et les dockers syndiqués de l'autre.J'avoue que l'aspect physique de la relation, qui fait partie des codes de la romance anglo-saxonne, m'a vraiment manqué. Cependant, même au-delà de ça, je pense que ce n'est simplement pas mon style de romance."}, {"userName": "Sofia Teixeira", "userReviewDate": "Apr 06, 2010", "userURL": "http://www.goodreads.com/user/show/3547706-sofia-teixeira", "userReview": "Este livro fala sobre Zofia e Lucas. O anjo mais angelical e o demónio mais demoníaco. A luta entre Deus e Lúcifer vem a ser travada numa aposta entre ambos. Têm Sete dias para destruir ou salvar a humanidade. Mas tal como diz na sinopse, nem Deus nem Lúcifer poderiam prever o resultado final do encontro entre Zofia e Lucas.Um livro apaixonante, cheio de emoção, acção, humor e muito mais. Neste livro encontramos o verdadeiro sentido de seres opostos. A derradeira diferença entre o fazer o bem e o mal.Eu adorei este livro. Já tinha lido Os Filhos da Liberdade deste mesmo autor e tinha gostado muito. Mas sem dúvida que mesmo não podendo haver comparação (pois os livros retratam coisas completamente diferentes), este livro deixou-me completamente apaixonada por esta escrita e esta originalidade.Há várias personagens marcantes, cada uma a desempenhar o seu papel numa simbologia tocante e marcante.Sem dúvida um livro que recomendo vivamente a qualquer tipo de leitor. Dá mesmo gozo ler este livro. E digamos que duas personagens como Zofia e Lucas, apaixonam qualquer leitor, até aos mais \"esquesitos\".Aproveitem que este livro está à venda por apenas 3€ em algumas feiras do livro!!! E acreditem que este preço não faz nada justiça à qualidade do livro. Ontem quando o acabei de ler, dei conta que tinha dado uma ninharia por um pequeno tesouro ;)Boas leituras a todos**Deixo aqui um pequeno excerto emocionante =):Zofia,Vejo-te a dormir e, Deus, como tu és bela! Voltas-te nesta última noite a tremer, aperto-te de encontro a mim, coloco o meu casaco por cima de ti, desejaria poder colocar um sobre todos os teus invernos. O teu semblante está tranquilo, acaricio a tua face e, pela primeira vez na minha existência, estou triste e feliz ao mesmo tempo.É o fim do nosso momento, o princípio de uma recordação que, para mim, durará pela eternidade. Havia em cada um de nós tanto de realizado e tanto de inacabado quando estávamos juntos!Partirei ao romper do dia, afastar-me-ei passo a passo, para aproveitar ainda cada segundo de ti, até ao último instante. Desaparecerei atrás desta árvore para me submeter à razão do pior. deixando-os abater-me, anunciaremos a vitória dos teus e eles perdoar-te-ão, sejam quais forem as ofensas. Volta, meu amor, volta a essa casa que é a tua e que tem tudo a ver contigo. Gostaria de tocar as paredes da tua morada com cheiro a sal, ver das tuas janelas as manhãs romperem em horizontes que não conheço, mas que sei que são os teus. Conseguiste o impossível, mudaste uma parte de mim. Desejaria que a partir de agora o teu corpo me cobrisse e nunca mais visse a luz do mundo a não ser pelo prisma dos teus olhos.Onde tu não existes, eu não existo. As nossas mãos juntas inventavam uma de dez dedos; a tua ao pousar em mim passava a ser minha, de tal modo que quando os teus olhos se fechavam, eu adormecia.Não fiques triste, ninguém poderá roubar as nossas recordações. Daqui em diante, basta-me cerrar as pálpebras para te ver, deixar de respirar para sentir o teu cheiro, enfrentar o vento para adivinhar o teu hálito. Agora escuta: onde quer que esteja, ouvirei as tuas gargalhadas, verei os sorrisos nos teus olhos, ouvirei os sons da tua voz. Saber simplesmente que tu estás nalgum sítio nesta terra será, no meu inferno, o meu cantinho de paraíso.És o meu Bachert,Amo-teLucas"}, {"userName": "Duc Hoang", "userReviewDate": "Jul 01, 2012", "userURL": "http://www.goodreads.com/user/show/3035018-duc-hoang", "userReview": "Ý tưởng của cuốn sách rất độc đáo. Đây có thể đã là một cuốn sách hay. Nhưng có lẽ văn phong của Marc Levy đã trở nên nhàm chán với mình. Mối tình giữa nàng thiên sứ và chàng ác quỷ nghe thì có vẻ là một cuộc kết hợp hứa hẹn nhiều bất ngờ, đầy tính nhân văn sâu sắc. Nhưng không, cuộc tình giữa hai người diễn ra một cách tù mù, buồn tẻ, chán ngắt, không thuyết phục được mình ở điểm nào cả. Tại sao họ yêu nhau được, khi tất cả những gì thuộc về người này đối lập với tất cả những gì thuộc về người kia? Mình tin một mối tình như vậy có thể xảy ra lắm chứ, và sẽ đẹp biết bao nếu mối tình ấy đơm hoa kết trái. Điều Marc Levy đã không làm được là khiến người ta có thể tin vào sự kết hợp đó. Ông đã không cung cấp những yếu tố tâm lý để người đọc có thể tin vào một tình yêu như vậy. Cái gì đã kéo hai con người thuộc hai thế giới đối nghịch nhau đó lại với nhau?Của đáng tội, có lẽ mình chưa đọc kĩ nên không thấy được cái hay của cuốn sách chăng? Một ý tưởng hay như dzậy mà..."}, {"userName": "Debora M | Nasreen", "userReviewDate": "May 08, 2011", "userURL": "http://www.goodreads.com/user/show/4247371-debora-m-nasreen", "userReview": "Sarò forse prevenuta su questo genere, ma non credo neanche troppo. Fatto sta che mi è stato prestato da un'amica che me n'ha cantato le lodi due giorni ed alla fine mi sono fatta forza e l'ho letto... Deludente!L'idea di base è buona ma sviluppato in modo veramente pessimo!In molti punti non si capiva bene cosa fosse accaduto e perchè... due giorni prima si odiano, vanno a cena, si amano, lei gli fa una scenata di gelosia (un angelo? geloso?O.o) perchè l'ha trovato a fare una cena di lavoro...Caratterizzazione dei personaggi veramente minima. Un angelo che di angelo ha poco o niente un diavolo che di diavolo ha ancora meno... Una storia d'amore nata in modo assolutamente assurdo (ci manca solo Cupido che passav a di là con l'arco e le frecce ed eravamo a posto...)Mi dispiace, non ho letto altri libri di questo autore ma di certo non credo che ne prenderò in mano altri..."}, {"userName": "Megan", "userReviewDate": "Jul 19, 2016", "userURL": "http://www.goodreads.com/user/show/32216566-megan", "userReview": "So these kids have missions because one is an angel and the other is the son of lucifer... So... Good has to defeat evil or vice versa, but then obviously the obvious thing that's gonna happen is that the two kids fall in love and don't want to go through with their mission because duh, that's gonna hurt their significant other's side.. I didn't find the romance aspect in this book realistic, but I did like the little pieces of dialogue from Zofia at times. I also did like that in the little note at the end, Lucas said that Zofia was able to do the impossible — change a part of him for the better. Aw isn't that lovely"}, {"userName": "Kairi", "userReviewDate": "Oct 26, 2009", "userURL": "http://www.goodreads.com/user/show/2877866-kairi", "userReview": "The angel/demon part was a bit off in this story because I thought it was just a cute love story. Levy created a couple in which the demon(Lucas), falls in love with the angel(Zofia, the good and the bad, somewhat the opposites are attracted together. I thought the character Lucas was very attractive, and if it would have not been of him, the story would have been pointless. Overall, it was a funny, love, light-hearted story to read"}, {"userName": "Melody", "userReviewDate": "Feb 07, 2013", "userURL": "http://www.goodreads.com/user/show/6506600-melody", "userReview": "Je ne suis pas vraiment une adepte des BD, mais comme j'ai adoré Sept jours pour une éternité, je me suis laissée tenter par ce format. L'histoire est bien sûr moins \"aboutie\" que dans le roman (les sept jours passent beaucoup plus vite), mais j'ai tout de même passé un agréable moment de lecture et j'ai été contente de retrouver Lucas et Zofia."}, {"userName": "C. Maria", "userReviewDate": "Apr 01, 2015", "userURL": "http://www.goodreads.com/user/show/30120000-c-maria", "userReview": "2.5 starsThis book was a little confusing and I think the reason was the translation. There were things that didn't made sense, anyway it was ok. But very confusing from the beginning till the end. So I don't really have what to say about it, still trying to figure it out."}, {"userName": "Denitza Vidolova", "userReviewDate": "Aug 10, 2015", "userURL": "http://www.goodreads.com/user/show/45724108-denitza-vidolova", "userReview": "Something light to read during a summer holiday. The story of good vs. evil in a romantic plot. Love prevails as always."}, {"userName": "Gwen", "userReviewDate": "Mar 18, 2012", "userURL": "http://www.goodreads.com/user/show/8261526-gwen", "userReview": "Mon Préféré de loin !!!J'ai adoré la relation entre Dieu et Lucifer ! A la fois complices et rivaux !Tout en essayant de contrecarrer l'autre, ils se contrecarrent eux-mêmes !!"}, {"userName": "Catherine Letendre", "userReviewDate": "Mar 11, 2012", "userURL": "http://www.goodreads.com/user/show/5788938-catherine-letendre", "userReview": "À la deuxième lecture, même si l'écriture est un peu kitsh et tourne dans le roman savon, l'idée est tellement belle que l'histoire en vaut la peine."}, {"userName": "Catia.borboleta Da Silva", "userReviewDate": "May 23, 2010", "userURL": "http://www.goodreads.com/user/show/1934031-catia-borboleta-da-silva", "userReview": "Adorei esta historia de amor entre uma anjo e um ajudante do diabo.Para verificarmos no final que a Terra têm que conviver com os dois."}, {"userName": "Charlotte Winnen", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/5760273-charlotte-winnen", "userReview": "Ik stop! Ik wou dat ik dit boek 0 sterren kon geven amai"}, {"userName": "Kathryn", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/39944905-kathryn", "userReview": "Little moments that make you explode in audible laughter, little moments that make you tear up, little sections you pause to reread... that is what I love about reading."}, {"userName": "Mèo Lì lợm", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/24128122-m-o-l-l-m", "userReview": "Đây là lần đầu tiên mình đọc một tác phẩm của Marc Levy nên chưa cảm nhận được nhiều lắm phong cách viết của tác giả này như là những gì người ta hay viết về.Điều đầu tiên mình muốn nói về cuốn sách này là: bản dịch tiếng Việt rất hay, giữ được những cái nguyên bản, hoàn cảnh của ngôn ngữ mà bản gốc sử dụng, những lời bông đùa, hoàn cảnh ngôn từ,.. quan trọng là cách tư duy, cách viết của nguyên bản nên mình khá thích bản dịch này. (Mặc dù mình chả biết tí gì về dịch thuật cả.)Để đánh giá về cuốn sách thì không có nhiều lắm vì chắc nó cũng có vô vàn muôn thuở đánh giá, bình luận của biết bao cá nhân, tập thể tầm cỡ. Mình chỉ muốn nói về cảm nhận khi đọc nó: thoải mái, trải được nhiều cung bậc cảm xúc nhưng với mình những cảm xúc ấy chưa tới, khá hợp cho mình để đọc thư giãn những khi bị đau đầu.Một điều cũng không hẳn ấn tượng lắm với mình là: cách viết của tác giả giống như kể theo một bộ phim, các phân cảnh cực kỳ rõ ràng nên có nhiều lúc khiến mình thấy giống như là đang bị chìm đắm vào một bộ phim thật sự vậy.Chủ đề Thiện & Ác cũng khá quen thuộc rồi, những giá trị, thông điệp mà cuốn sách muốn truyền tải thì mỗi người có một cảm nhận khác. Riêng với mình thì khi đọc nó mình sẽ không tự chủ mà liên tưởng đến những chuyện thường ngày cuộc sống của mình và từ đó mình sẽ nhận ra vài điều hay ho, vài bài học hoặc vài ý tưởng, khá thú vị.Không giống một bài review lắm, chủ yếu là chia sẻ cảm nhận, suy nghĩ của mình về cuốn sách cũng như sau khi đọc xong."}, {"userName": "Stan", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/1286888-stan", "userReview": "Well, I thoroughly enjoyed the other three novels by Levy, but this one, apparently the second one he wrote, I honestly found to be a piece of crap. While obviously it is a fantasy/ allegory /love story / two-bit philosophy??, it just has so many unanswered questions and unmotivated actions by the main characters that it falls flat. There is absolutely no explanation nor internal to the novel logic for the main characters becoming attracted to each other, nor for Lucas's changes in character. Add that Levy's insistence on putting in some very American style humor (perhaps to show how \"cool\" he is, and how freakin' obsessed with American culture). There are a few moving passages, but on the whole it looks like he just wrote this one on deadline. If I hadn't read the other three novels, and hadn't re-read my own reviews, I think I would have tossed this in the garbage, and would have sworn off every reading him again. As it is, I'll see about the future, but won't re-read him now."}, {"userName": "Mathilda Grace", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/44676387-mathilda-grace", "userReview": "Wenn Gott und der Teufel sich um die Welt streiten, müssen ihre beiden besten \"Krieger\" für die Sache ran, um dafür zu sorgen, dass einer von beiden gewinnt. So gut, so leicht - bis besagte Krieger aufeinandertreffen und sich ineinander verlieben.Die Story hat was. Sie ist seicht geschrieben, bleibt auch nicht groß im Gedächtnis haften, aber die Idee an sich ist amüsant und die Umsetzung sorgte bei mir für einige Lacher. Vor allem, wenn es um Gott und den Teufel geht und beide sich am Ende ihre Wortgefechte liefern. Denn eigentlich kommen sie ganz gut miteinander aus. Natürlich darf man das nicht einfach so zugeben. Ich gestehe, die beiden waren mir mit ihren paar Auftritten sympathischer als das Hauptpärchen im Buch.Wer sich auf ein etwas anderes Buch einlassen kann, dem könnte diese Geschichte durchaus gefallen. Ich vergebe 3* und eine Leseempfehlung."}, {"userName": "Elizabeth Silva", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/31197663-elizabeth-silva", "userReview": "Espere mucho para leer este libro, tenia grandes espectativas, es decir, cuando lo encontre lo dejé abandonado hasta hoy, tres años después...La historia es bastante buena y original de eso no hay duda ¡pero esta muy mal contada! Al final sentí que me faltaron paginas, ya que me habría gustado un final contado por ellos pero no.Son mas las escenas donde los protagonistas salen por su cuenta a donde salen juntos ¡Y ún así se enamoran! Lucas era medio bueno desde el segundo día y nunca se hizo nada hasta que Zofía lo hace ayudar a alguien, a Zofía nunca le sentí esa parte de maldad que estaban tratando de lograr ambos. Además, siento que el autor de dio mas protagonismo a la historia que había de fondo que a Zofía y Lucas, por lo que no llegue a conectame al cien por cien con ambos y su romance. En fin, es una buena historia para pasar el rato."}, {"userName": "Stéphanie", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/81147032-st-phanie", "userReview": "Je n'ai pas réussie à rentrer dedans. L'histoire est plutôt ennuyante et je n'étais pressé de tourner les pages que pour l'avoir enfin finit bien qu'il ne soit pas très long. J'ai été déçu par deux chose :L'histoire d'abord. Elle n'est pas clair. On ne sait pas d'où vienne les personnages et ce qu'il faisait avant le livre et pourquoi. Le pari en Monsieur et Président semble un peu léger et leurs raisons ne sont pas claires. Et Finalement j'ai été déçu par :Les personnages. Zofia et Lucas ne sont pzs attachant et pire que ça leur histoire d'amour sort de nulle part. Ils passent d'inconnu à ennemis puis à amour intense sans transition et donc toute leur course contre la montre pour rester ensemble m'a laissé indifférente. Et quand ils sont seuls, je n'es pas aimé que leur pouvoir n'est jamais montré entièrement ou expliqué. Lucas passe sont temps à voler des voitures et Zofia va rendre visite à des seniors et des enfants à l'hôpital voilà l'étendu de leur action d'ange et de démon. C'est faible.Déçu, je m'attendais à un roman sympas et une lecture agréable mais je me suis retrouvé à m'ennuyer en le lisant."}, {"userName": "Razvan Banciu", "userReviewDate": "May 09, 2017", "userURL": "http://www.goodreads.com/user/show/22804362-razvan-banciu", "userReview": "The subject is a promising one, but it turns into commonplace quite rapidly. Characters are pathetic: Zosia is Mother Teresa reloaded, candid, pure, a real charity champion, she doesn't eat and lives only with thin air, but she's \"vicious\" enough in order to fall in love with the devil; Lucas, the bad one, has the idiotic habbit of stealing cars and throwing them into the water; Heurt is greedy and stupid, Reine and Mathilde are obviously too kind. All of them, including Jules and inspector Pilguez jump one into other, like they are living in a two-hundred person village, not in San Francisco. Only the happy-end had turned the two-star listing into a three one..."}, {"userName": "Julie", "userReviewDate": "May 10, 2017", "userURL": "http://www.goodreads.com/user/show/27157488-julie", "userReview": "Troisième lecture d'un Lévy et je pense que c'est mon préféré. Histoire très agréable à lire, pas trop de choses irréelles et surnaturelles comme Le résumé pourrait laisser penser. Une histoire agréable qui se laisse lire.L'utilisation du paradis Et de l'enfer est sympa car dans la vraie vie nous savons tous que les opposés s'attirent et changent la vie de l'un et l'autre.J'ai tout de même été un peu déçue par la fin. Je m'attendais à quelque chose d'un peu plus palpitant je pense, qui m'aurait vraiment étonné et surprise Mais Bon cela n'a tout de même pas gâché la lecture."}, {"userName": "Laetitia", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/80676965-laetitia", "userReview": "Ultimately, one of my favourite books. I really loved the romance and the characters. The fantasy elements were light but appreciated. I expect that if I ever read it again (now that I am more mature and have read more books) I will probably find more fault to the story but, who cares? I remember loving it so much and I think it is a fantastic feeling (remembering how much fun it was discovering the story)."}], "description": "They’ve tried to destroy each other for centuries, but they’ve failed… So God and the Devil plan a contest to finally decide who will rule eternity: each will send their top candidate to earth. The champions will have seven days to draw mankind towards good or evil, respectively. God picks his favorite angel, a ravishing young woman named Zofia. Lucifer picks Lucas, a male demon with devilishly good looks. The battlefield: present day San Francisco. The winner will rule mankind forever after: they have seven days for an eternity. Neither God nor the Devil could foresee that the two rivals, unaware of the other’s identity, would cross paths from the very start of the contest. Nor did they imagine that they could fall in love... “A love story that is both funny and moving…” - Le ParisienOne of France’s bestselling authors, Marc Levy’s novels have been translated into 45 languages and over 27 million copies of his books have been sold worldwide.", "title": "Seven Days for an Eternity", "url": "http://www.goodreads.com/book/show/17304270-seven-days-for-an-eternity", "average": 3.62, "cover": "https://images.gr-assets.com/books/1359477335l/17304270.jpg", "reviews": 179, "authors": [{"url": "https://www.goodreads.com/author/show/61788.Marc_Levy", "name": "Marc Levy"}], "type": ["Romance", "Fiction", "Cultural", "Fantasy", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/17304270-seven-days-for-an-eternity", "http://www.goodreads.com/book/show/2343752.Siete_d_as_para_una_eternidad", "http://www.goodreads.com/book/show/12134506-b-y-ng-y-cho-m-i-m-i", "http://www.goodreads.com/book/show/1470284.Sept_jours_pour_une_ternit_", "http://www.goodreads.com/book/show/8664354", "http://www.goodreads.com/book/show/8031750-sete-dias-para-a-eternidade", "http://www.goodreads.com/book/show/8086601-sete-dias-para-a-eternidade", "http://www.goodreads.com/book/show/123768.Sept_jours_pour_une_ternit_", "http://www.goodreads.com/book/show/9649458-sette-giorni-per-l-eternit", "http://www.goodreads.com/book/show/17225708-sept-jours-pour-une-ternit", "http://www.goodreads.com/book/show/7538819-sept-jours-pour-une-ternit", "http://www.goodreads.com/book/show/1284982.Sieben_Tage_f_r_die_Ewigkeit", "http://www.goodreads.com/book/show/34036335-p-s-from-paris", "http://www.goodreads.com/book/show/386887.If_Only_It_Were_True", "http://www.goodreads.com/book/show/123765.O_es_tu_", "http://www.goodreads.com/book/show/7970021-le-voleur-d-ombres", "http://www.goodreads.com/book/show/182671.La_prochaine_fois"]}