{"ratings": 165, "userreviews": [{"userName": "Hannah", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/17442587-hannah", "userReview": "[First, the book is more \"shadows\" than hope. It's not edifying to have a woman left in the same pit she was in before the story started, and alone to boot. Her faith is mentioned, mentioned as being different, but the explanation of it is short and hazy and not edifying to us, nor does it share the exact state of her beliefs other than to say they are \"different.\"Second, she acknowledges \"I failed him just as much as he failed me.\" NO YOU DIDN'T. You didn't CHEAT on him and sleep with others and break your marriage vows. Their marriage was not her lone responsibility to uphold. He is the head of the household and thus the primary person responsible before God to maintain his marriage. Look at Hosea, for goodness' sake! Read the New Testament and study the different Greek words used for love. Just because the poor baby boy thought he needed some kind of emotional support in his marriage doesn't give him the right to physically break his solemn vow before God. We aren't supposed to expect our marriage partners to do the hard work for us. If he needed emotional help, he needed to hit his knees and find it in God--NOT in the arms of another woman.Third, the book ends on a sad note with no promise of a sequel. I've never been a lover of tragedies. (hide spoiler)]"}, {"userName": "Michelle", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/369732-michelle", "userReview": "I loved the realistic theme in this book and particularly how it ends. Things don't always go the way we might expect, or even hope for in life. To portray a different ending would be to fluff up the harsh realities that are the consequences of our actions. Every action we take in life directly influences the lives of others whether they are complicit in the sin, or not. Too often the innocent are hurt the most. And some things can never be made right no matter how hard we try.Ironically, I knew someone in the very same situation as the characters in this book. I can't be specific or it would be a spoiler. Let me just say that I found the ending to be very believable because the exact same thing happened to a friend of mine. They say truth is stranger than fiction. It would seem a bit too much of a coincidence if I hadn't known what happened to my friend by direct report. Any other ending would not have rung true to me. Bravo to the author for crafting a scenario that depicts what would really happen as opposed to what people wish would happen. I found even the internal dialog to be honest.This is a bit of a heart-wrenching and sobering read, but it was well-thought-out and also very well-written. I enjoyed it and highly recommend it to people who are tired of stories that have unrealistic themes. This is a story you can really sink your teeth into. Savor it. I know I did.Shadows of Hope will be released in April 2018. I was sent a review copy (ARC) from the author in exchange for an honest review. Most of the books I've started over the past two years I haven't finished. I can honestly say that I finished this one because it held my interest."}, {"userName": "Fiction Aficionado", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/39426033-fiction-aficionado", "userReview": "As you might guess from the book’s description, this is a pretty compelling story. It’s well written, and it’s a plot that you really want to see through to its conclusion once you’ve started reading. That said, I wasn’t sure how I would feel about the story until its very last pages. Aside from the obviously painful circumstances, my heart was tempted to wish for something my conscience couldn’t sanction, and at times it seemed the story might be heading that way. Then, as the ending drew ever nearer with the biggest bombshell still waiting to drop on the characters, I wondered how on earth the story would have any kind of a resolution.As I reflect now, I think the only word for the ending is ‘right’; anything else would have been either unrealistic or bruising to my conscience. Hallmark, it’s not, and some readers might be disappointed by the way the story concludes, but it will make you think. And the more I think about it, the more I’m impressed by this story.First of all, it’s presented from three different points-of-view. Marissa’s point-of-view is written in the first person, whereas Colin’s and Kaitlyn’s points-of-view are written in the third person. This has the subtle effect of allowing the reader to identify with Marissa and her pain first and foremost, but also have insight into the secondary protagonists/antagonists, Colin and Kaitlyn.Secondly, the author did an exceptional job of making all three characters realistic. It would have been so easy to make Colin a two-dimensional villain, but he’s more than the sum of his mistakes, grievous though they may be. And while Marissa is the innocent party in the fallout of the affair, she's not without blame in the breakdown of the marriage. I found their motivations understandable, even if they didn’t excuse their actions, and their emotions complex and authentic.Kaitlyn stands in the middle ground, having made the unwise decision to enter into a relationship with her professor, but without the full knowledge of his situation. She’s an unwitting antagonist—a twenty-six-year-old woman who can’t change the decisions that got her where she is, but who is determined to make the right decisions as she goes forward. As the friendship grows between her and Marissa—and it’s a lovely friendship—waiting for the moment when they would realise their connection wound the tension tighter and tighter.This is the kind of story that takes you out of your comfort zone and lets you experience the mess that unwise decisions can lead to—the kind of mess that leaves permanent stains. How do believers handle those kinds of situations, especially when at least one of the people involved ISN’T a believer? Where do they find hope and strength to move forward? These are the kinds of questions you’ll be pondering as you read this book, along with the ‘if only’s we can all learn from.I received a copy of this book from the publisher. This has not influenced the content of my review, which is my honest and unbiased opinion."}, {"userName": "Maureen Timerman", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/3840941-maureen-timerman", "userReview": "Once I turned the first page I was walking in Marissa, one of the main characters, shoes, and we briefly step into the other two’s shoes, but it was Marissa who kept pulling me back.The author has written a compelling read, and an emotional one, dealing with tough subjects of infertility, infidelity, and being an unwed mother, and they all circle around one another pulling the story together.When the story was finished I felt, even with an epilogue, that the story was a bit unfinished, yes, I enjoyed the read, but I needed to know how things worked out.I received this book through the Publisher Barbour and their Blogger Program, and was not required to give a positive review."}, {"userName": "Mary Jackson _TheMaryReader", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/68319837-mary-jackson-themaryreader", "userReview": "I was so excited about reading this book. I had never read anything by this author and so as a book lover always looking for a new author. I set out with an open mind. I was enjoying the book until the end.As an avid reader, the ending was rather abrupt for me.It took me over the cliff and left me hanging. I did ask the author if there was a book 2 and she said no.I sadly have to give this book 3 stars.I will try her again if she writes another book in the future.The Mary Reader received this book from the publisher for review. A favorable review was not required and all views expressed are our own."}, {"userName": "Sarah", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/11774178-sarah", "userReview": "Dramatic but Underwhelming Let me preface this by saying that this is not the type of book that I would normally pick up. Had this been promoted by a non-Christian publishing company, I would not have considered it. However, the premise sounded fairly intriguing and I wanted to dip my toes into something outside my comfort level. With that being said, “Shadows of Hope” just didn’t really get off the ground with me. The drama, while expected given the subject matter, was in my opinion overdone, and the characters didn’t resonate much with me. The narrative is divided between Marissa—whose viewpoint is related in the first person—her husband, Colin, and Kaitlyn, the “other woman”. I found it difficult at times to sympathize with Marissa because of her self-centered attitude toward her marriage and her sometimes unrealistic expectations overall. Colin didn’t seem to have many redeeming features, while Kaitlyn is portrayed as an angelic figure. The way that these three interact throughout the novel does add a definite human interest aspect, but the plot seemed too drawn out. The faith element was present, but almost as a side note, or so it seemed for much of the story’s duration. Granted, there was no profanity or sexual situations—this was a clean read—but faith was not as prominent an issue as I was expecting and hoping for. This was hard to reconcile with my expectations. I also anticipated more suspense and was surprised when so much of the story’s backbone was revealed relatively early on. Nevertheless, I did want to find out exactly how things turned out in the end for each character. Despite not being the most compelling novel I’ve ever read, “Shadows of Hope” does offer a look at redemption and at facing life’s challenges and heartbreaks. I received a complimentary copy of this book from Barbour Publishing and was under no obligation to post a review."}, {"userName": "Arlena", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/6139982-arlena", "userReview": "Title: Shadows of HopeAuthor: Georgiana DanielsPublisher: Barbour Publishing, Inc. Reviewed By: Arlena DeanRating: FourReview:\"Shadows of Hope\" by Georgiana DanielsMy Thoughts....What a very thought provoking read that will leave you with food for thought long after the read.There are a lots of good question in the ending of this novel that were right on point. Be ready for a read that deals with 'marriage, betrayal, infertility, drama, friendships, secrets, faith, pregnancy forgiveness and moving on.' I found these three characters Marissa, Tristan , Colin and Kaitlyn were all well developed, portrayed and believable giving the reader a decent story in the end. I did enjoy how this author was able to give Christian guidance in their daily life for some of the characters.This is definitely one of those stories [infidelity] where the choices one makes and the consequences that are left in how this all affects everyone involved when it's said and done. I also believe that there are many women who can relate to what has happened in Marissa's position. Bye the end did we have a 'love triangle?' \"How will God work this all out in all these peoples lives? Will Marissa and Colin’s marriage survive this infidelity?\" 'Will God's love heal this relationships?' 'And what about forgiveness? Can they forgive themselves?' 'Will God forgive them?' Well, to find out the answers to all of these questions you will have to pick up this interesting read \"Shadows of Hope\" to see if there is any hope left for these people."}, {"userName": "Suzie", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/7431258-suzie", "userReview": "Rarely have I read a book that I’ve waffled back and forth so much. From wanting Marissa and Colin to work things out to believing she has just cause to end it, the only thing I stood firm on was how much Colin’s actions had hurt these two women.This book is not an easy one to read. There is not a pat, easy answer to unravel the tangle that Marissa and Colin’s marriage has become. And as a Bible-believing, Christian, that says a lot.Throughout this story, I wanted Marissa to find her strength and gain her footing. I was impressed with Kaitlyn’s maturity, and I was disgusted by Colin’s behavior (even though the author tried to throw a little sympathy Colin’s way, it wasn’t near enough to make him a likable character in this story).Readers are pretty much going to wait until the last fifty pages for what you’ve been waiting for the entire book to happen and then everything is tied up quickly but in a bit of a dissatisfying way. Mostly because I wanted to find out whether these three survive or thrive in the futures they’ve chosen (no spoilers here).Georgiana Daniels definitely made a bold move in this story. Readers often revert to fiction to escape the hurts and disappointments of life, but Shadows of Hope is full of those exact things. The bright spot in this book is the friendship that Marissa and Kaitlyn forge but simply reading the book description is enough to hint that even that might not last.Disclosure statement:I receive complimentary books from publishers, publicists, and/or authors, including NetGalley. I am not required to write positive reviews. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255."}, {"userName": "Fizzy", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/6471931-fizzy", "userReview": "Forget the guy for a minute in this all too common triangle. Look at Marissa, she's almost sorta got her life together. She's got a job she loves, a husband who is sometimes home, but she's lacking the one thing she wants. The glue that flaked away in her marriage, a child. Look at Kaitlyn, twenty-something college student who falls for her professor. Entangled in a brief affair she finds herself pregnant, after he calls everything off. Never knowing he was married, but she's still pregnant and now facing life as a single mother. These are stories that are part of our everyday world. Miscarriage, infertility, even unplanned pregnancy are all things that so many women in our society deal with every day. Let's toss the guy back into the mix. I know, I know he's a skeez but wait a minute. Colin is almost a typical guy. His marriage isn't what it once it was, he and Marissa have lost their common ground and even their focus. He finds himself attracted to a young woman and doesn't think before he acts. He tries to fix it but it's already too late, Kaitlyn is already pregnant. It's easy to want to bash him for all of this. It's easy to find yourself more closely aligned with one woman or the other and go on a full scale bashing spree. Don't. The truth is they all played a part in getting there, each of them have something about them that we can identify with, and they each have to find a path to the next step.I'm gonna be honest, while the story was engaging and drew you into the mix of these characters it tended to drag in places. I liked how the story flow switched between the three main characters but sometimes I felt like they weren't connecting with the story and with me. I didn't get a good feel for Colin as a person. I mean I got him as the cheating husband, I got him as the ex, and even to some small margin as the professor but I didn't understand his motivation in any of the bigger picture. I'm not sure if it's because he wasn't solid in his identity so I didn't grasp it but. . . Colin just came across as a self-absorbed jerk that had a fringe of emotions and feelings that he never really explored. Marissa was so deep into her own head that she took all the emotion that no one else had and owned it in spades. I mean, I get that she had a lot to work through from her life but she was an emotion drain that started to come across as a touch whiny. A lot of the same situations came up over and over with no real resolution, much less forward momentum on them that it just dragged. Perhaps about fifty less pages would have been a bit more concise?I know I sound hateful right now but I really did enjoy this book. I would have liked to have a better understanding of Colin and who he really is as a person, and even to some degree Kaitlyn as there's so much about her as a person I'm interested in knowing. Marissa, her I'd love to see her in some intense therapy to deal with her life as a whole though not with Tristan. Tristan and Colin is another avenue that I need to see explored because that right there played such a role in this whole shebang that was never truly addressed. I would love to see an addition to this story. Where they all actually end up. I've not read this author before but I enjoy her writing style, I enjoy that she takes on the hard topics from a Christian perspective, and I look forward to reading more by her.I was provided a complimentary copy of this book by Barbour Publishing, NetGalley. I was not compensated for this review and all thoughts and opinions expressed are my own. I was not required to write a positive review. Originally posted at https://fizzypopcollection.com/shadow...."}, {"userName": "Tamara Tilley", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/1383724-tamara-tilley", "userReview": "SHADOWS OF HOPE by Georgiana Daniels is a griping tale of love lost, love found, and love deceived. Written with a healthy dose of realism—which I absolutely love—SHADOWS OF HOPE does not sugarcoat or whitewash the effects the loss of communication and the sin of self-centeredness can have on a marriage, nor does it take a messy situation and tie it up in a nice neat bow.Marissa suspects her husband is having an affair. Knowing she isn’t without fault for the distance in her marriage, she sets out to make things right. Colin is having an affair because he can’t take the pressure at home. With Marissa laser-focused on conceiving, their marriage has spiraled to the point of perfunctory sex in order to get pregnant. Kaitlyn knows her relationship with her professor is against school rules, but what she feels for Colin is worth the risk, until she gets pregnant.What transpires is a cruel twist of fate. Marissa befriends Kaitlyn when she shows up at the pregnancy center Marissa manages. Feeling lost and alone, Kaitlyn’s relationship with Marissa becomes a lifeline. When Colin finds out Kaitlyn is pregnant, he’s devastated, knowing it will destroy Marissa and jeopardize his chance at tenure, but his desire to be a father also makes it that he wants to be involved with Kaitlyn’s pregnancy. When Colin finally tells Marissa about his affair, and that he and his mistress have conceived a child, Marissa is shattered. Finding out it is Kaitlyn, is beyond anything she ever expected.SHADOWS OF HOPE is absolutely compelling. As the reader, you know everything that is going on behind the scenes, and the angst you feel builds, knowing Marissa and Kaitlyn are going to be devastated when they find out what they share besides friendship is the same man. I give the author credit for pointing out shortcomings in each of the characters, not just placing the blame on Colin, and even going as far as to portray Colin as a man with a compassionate heart, even if it is skewed. SHADOWS OF HOPE shows how easily people can fall away from their faith when they take even a single compromising step, and how we justify sin when we want what we know is wrong. Marissa put her desire for a child before her husband. Colin put his needs of fulfillment before the needs of his wife. And Kaitlyn justified a sexual relationship because she thought it was based on love. SHADOWS OF HOPE explores infidelity, deception, jealousy, adultery, selfishness, the need for communication in marriage, pressure from outside sources and how it can damage a marriage, etc., etc. The ending might be unsatisfying to some, but it is realistic. A heavy subject, but definitely a story that needs to be told, prompting readers to evaluate what compromises they might be making in their own lives.I received a complimentary copy of this book from Barbour Publishing and was under no obligation to post a review."}, {"userName": "Char (1RadReader59)", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/7057054-char-1radreader59", "userReview": "This was such an interesting story on so many levels. You have a man who has cheated on his wife and wants to play it off as just a phase he was going through. Mainly, because he felt so put upon by her demands to have sex to conceive a baby. Wow, I think I could make a list right now of guys calling him a candy-ass. Really?! His wife had a miscarriage of their child he won’t talk about adoption. Yes, it was true his wife was forcing him to have sex. Do you all hear the choir of real men singing out, “Dude, Buck it UP!” She basically, forced him to cheat is the way he looks at it. But when the guilt finally hits him he is pissed at her that he should call it off. Come on really!? Not because he is deathly afraid that he is her professor at the college she attends, that he is up for tenure, or that oh I don’t know, ‘Could lose my job' factor. No, that he is forced, because of his vows and his guilt of his wife may one more time have a meltdown like when they had the miscarriage. His resentment and contempt are so high you could almost feel it coming right off the pages. Not once does he speak of love? When the woman he has the affair with needs to talk he ignores her. She is a woman, Kaitlyn Morey, is twenty-six-years-old. She is what is called a retread. She continues through different methods to contact him but he ignores her. Kaitlyn works at the Bean. A coffee house which happens to be the one where Marissa, Colin’s wife and her best friend and business partner, Tristan Hart, have been meeting for their morning meeting and coffee since the office coffee pot broke. Since the New Heights, a pregnancy resource center, ran mostly on grants and donations it would be awhile before they got a new one since other things were needed first. Since Kaitlyn never knew that Colin was married Marissa never knew about the affair. They have become friends after almost a year of coffee meetings at Kaitlyn’s work. Now Kaitlyn was in need of the services the New Heights provided. See what a tangled web Colin cheats for every one of his selfish needs to have his cake and eat it too. I give this the star rating I do because I thought it was a good story but we really got, no closure. We don’t know do they divorce, work it out, or do they live apart? Except a poor baby is in the mix. I give this: 4 stars. Provided by netgalley.com. Follow us at www.1rad-readerreviews.com."}, {"userName": "Amy", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/5721050-amy", "userReview": "Shadows of Hope was not an easy book for me to get through. I was aware of the subject material before going in and I admit my curiosity was peaked and I wondered how this new to me author would tell this tale. This is a story that we get told by three different people: Marissa, her husband Colin, and Kaitlyn his girlfriend. The synopsis of this story pretty much tells you what to expect. What I was not prepared for was the strong feelings and emotions that went with reading this story.I will admit that parts of the story I had to skim, just so I would not be crying or getting angry over it. The author did a tremendous job of pulling the reader in and showing all sides of the situation. There was really no good outcome. I felt for Marissa as a wife and as a woman who was unable to have a child, especially when she found out that her husband’s affair produced a child with another woman. I felt for Kaitlyn and her trusting yet naïve nature that finds her in the predicament of being pregnant with her boyfriend’s child only to find out he is married. And then we get Colin’s viewpoint. He, in my opinion was confused and desperately wanted to fix things if albeit selfishly. What a tangled mess. I was not necessarily happy with the ending. I understand where the author was taking the story, however I still would have liked more closure. I am curious if there will be a follow-up. If you are looking for a true to life story that deals with infidelity and infertility from a Christian perspective, this is a well told story. I received a complimentary copy of this book from Barbour Publishing and was under no obligation to post a review.https://pausefortales.blogspot.com/20..."}, {"userName": "⚜️Trea", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/5223520-trea", "userReview": "FTC DISCLAIMER: I RECEIVED AN E-ARC FROM THE PUBLISHER THROUGH NET GALLEY. I VOLUNTARILY OFFER MY HONEST REVIEW OF THE BOOK, THOUGH IT IS NOT EXPECTED OF ME! RECEIPT OF THIS BOOK IN THIS MANNER DOES NOT AFFECT MY OPINION OF THE BOOK OR THE CONTENT OF MY REVIEW! I had never read anything by this author before, so when I was asked if I would read this, I read the blurb, and seeing something that seemed to fit my reading tastes, I went ahead and downloaded it. Unfortunately, it didn't live up to the blurb.My biggest complaint is that the ending was very abrupt. Reading some of the reviews on here let me know that there is not going to be a follow up to this, so I kind of feel like I wasted my time reading this to have this little of a resolution to the story. Based on that alone, I would not pick up another book by the author.I also had a hard time connecting with the characters. The story is told from 3 different points of view, so the \"headspace\" is constantly shifting. It got confusing for me after a while, and limited my ability to connect with Marissa and Kaitlyn as much as I should have been able to. Marissa also seemed like too wishy-washy of a character to be able to thrive in the situation she ultimately ended up in, so I have to wonder what the author's purpose in writing this was. The faith angle seemed to be an afterthought in the story, and not front and center like I expected it to be.All things considered, this was a bit of a miss for me."}, {"userName": "Helen", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/37215359-helen", "userReview": "Shadows of Hope, by Georgiana Daniels, is an awesome story that deals with contemporary women's issues. Marissa is a crisis pregnancy worker who befriends Kaitlyn, a college student working at a coffee shop. Kaitlyn is unmarried and expecting a baby as a result of an affair with one of her teachers. Marissa invites Kaitlyn to come to the crisis center and eventually hires her to work there. Meanwhile, Marissa and her husband, Colin, are growing apart after years of marriage and trying unsuccessfully to have a family. Colin admits to having an affair and having a child on the way. Marissa wants nothing to do with Colin's child.This is one of those books that just tugs at your heart. The author writes of issues such as infidelity, infertility and unwed mothers. The story is very well written with minimal major characters who are very well introduced. This is the first story I have read by Georgiana Daniels. I hope it is just the first of many for years to come. I think anyone who enjoys reading contemporary stories of women issues will really enjoy this story. The book contains very good discussion questions that would make this a very good choice for book clubs to read.“I received a complimentary copy of this book from Barbour Publishing and was under no obligation to post a review.”"}, {"userName": "Carolyn Vandine west", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/31406360-carolyn-vandine-west", "userReview": "This was a difficult subject matter and provided an insight into a dying marriage. It did not end the way I thought it would and I was glad for it. Marissa and Colin both seemed to have lost their love for each other long before he cheated. The loss of a child creates a whole hurt that some people embrace and define the rest of their lives. They had already disconnected in so many ways that even when Marissa thought there might be hope for another child, for them, she never told her husband . They lived two separate lives in the same house, he had his job and she had hers and very little interaction between the two other than deception. I know that Marissa seemed to be blindsighted by her husbands unfaithfulness but she shouldn’t have been. When she opened herself up to a friendship with a client things seemed to be looking up for Marissa until her friend became the other woman. The way the story came together at the end was dramatic and I would have liked a little more closure on the ending, but I was satisfied with it.Life is not always a neat tidy little package of God has our backs. He is there to catch us, but life is hard and we are not guaranteed happily ever after."}, {"userName": "Lori Quick", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/4685503-lori-quick", "userReview": "Sometimes life imitates art. Not 💯% but close. I really enjoyed reading Shadows of Hope by Georgina Daniels. It was thought provoking to be sure. Marissa and Colin are married and not able to get pregnant after last miscarriage. They fall about and he ends up having an affair. The girl gets pregnant.The story is how they deal with this little problem. I rooted for the wife and the other woman. The only redeeming quality the husband had was wanting to be in the baby's life. My take away is to always keep your eyes on God, don't give up your faith, and Christians really should not marry non Christians. Great questions in the back of the book for a book club or to do on your own. I would recommend this book. Thank you to NetGalley and publisher for the advance copy in exchange for my honest review."}, {"userName": "Carol", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/56931004-carol", "userReview": "Shadows Of Hope Is heart wrenching and it gets you to feel some very strong feelings as you read this. I mean how stupid he is and how awful for her and what an impossible situation. What breaks my heart the most is that this really happens and that this mess and broken hearts and dreams are torn asunder. Let me tell you this, the ending ends in a for real ending not a fluff ending - cool. How do Christians react in this situation? Well you have to read in find out - to be in full disclosure one of the three is not a Christian. I can't imagine going through what they all go through and not have GOD to Lean on. What an awful situation. I received a copy of this book from the Publisher and Netgalley; all of the opinions expressed in this review are all my own.if you would like to read more of my Christian book reviews go to christianlybookreviewers.blogspot.com"}, {"userName": "Austin Ryan", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/78415838-austin-ryan", "userReview": "This book is well written throughout. Georgiana Daniels is an excellent writer, and the plot is mindblowing and intriguing. I would definitely pick up another book by this author. All that said, \"Shadows of Hope\" is not my kind of book. After reading a couple of reviews, I'm confident that this book would have an even higher average rating if readers weren't expecting a happily ever after.A word of caution: I see it mentioned in a couple of reviews, and I agree:If unfaithfulness, panic attacks, separation/divorce are possible emotional triggers for you, this is NOT your book. Disclaimer:I received a complimentary ARC of this book from the publisher. I was not required to write a positive review. All opinions expressed are mine alone."}, {"userName": "Bhriv", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/44750898-bhriv", "userReview": "Shadows of Hope, written by Georgiana Daniels, is the first book I've read by this author. I thoroughly enjoyed the writing abilities of this author. I liked how she had the POV's by all three of the characters, Marissa (wife), Colin (cheater), & Kaitlyn (mistress).Fictional infidelity stories are difficult for me to read, but I think Daniels did a great job at writing it. These are realistic characters even though many times they don't have redeeming qualities readers would be drawn to initially. The ending...depends who you are as to if you'll like it. It makes you think. Some readers may wish for more closure, but sometimes this kind of ending leaves you with...as the title says, Shadows of Hope.I received this paperback from the publisher. All thoughts and comments are my own."}, {"userName": "Susan Snodgrass", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/7103516-susan-snodgrass", "userReview": "The synopsis of this book sounded good and I thought that it would be quite interesting. It was on most levels. The story is told from three different viewpoints: the wife, the cheating husband and the other woman. Oddly enough, the only believable character is the other woman, who is the most mature of the three. The wife is quite self absorbed and thinks only if her own issues, has allowed her disappointment with infertility to basically destroy her marriage. Don't get me wrong, there is never a reason to cheat on a marriage, but each party must work to have a healthy one. The husband just did not seem real to me at all, seemingly not caring what happened. He didn't want the other woman, but wanted to intrude on her life anytime he wanted to see their baby. The ending was not all it could have been, either, rather sudden. Too bad, for the writing was good.*I received a complimentary copy of this book from Barbour Publishing and was under no obligation to post a review."}, {"userName": "Amy", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/9945907-amy", "userReview": "Just an okay read for me."}, {"userName": "Martha", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/6966032-martha", "userReview": "I found this book to be a refreshing change from some tales similar to this. It addressed the topic head on without skirting the huge issues. Adultery and infertility were two key topics in this book. I loved the mention of doulas, grants for those in need of their services and found that especially wonderful as a doula myself. The writing style is excellent and touched on many key phrases that would be said to a Christian woman in a marriage that is falling apart. My only complaint would be that it left me many questions in the end, which again, is real life. This women's fiction novel is a breath of fresh air, speaking truth and reality, without giving pat answers that suddenly fix everything.This book was obtained through NetGalley and the opinions contained herein are my own."}, {"userName": "Marisa", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/14513288-marisa", "userReview": "Thanks to Netgalley and the publisher for this arc in return for my honest opinion. Well I have great things to say about the writing, however the story left me lacking in praise. I get that it’s a Christian Story. But really what faith should be allowed to have people stay married when they do not love each other in the least, and keep hurting one or the other in this terrible marriage to stay together. How stone-age of them for thinking this."}, {"userName": "Starr", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/5128047-starr", "userReview": "This was disappointing, especially since the writing (for the most part) wasn’t bad. The biggest bombshell wasn’t released until the very end, so the resolution of that was less than satisfying. While Marissa did find strength in the end, it wasn’t enough to make a permanent decision. She again, left it for Collin to make, who has proven to be even more selfish than I could deal with."}, {"userName": "Kate Hendrick", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/57923285-kate-hendrick", "userReview": "[the atheist in the story was the only one who didn’t really get a happy ending. I understand as Christian’s that we want to point out that life is better when you follow Christ, but we must remember that that might not be seen until after death. It’s possible for atheists to live every happy earthly lives, and I wish Colin could’ve at least been given a chance, even if it wasn’t as happy as the others. However, I do give the author major kudos for not using the angsty-atheist-converts trope. (hide spoiler)]"}, {"userName": "J.", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/6279885-j", "userReview": "Shadows of Hope is a story of Marissa & Collin Kimball’s journey to recovery after suffering infertility for years in their marriage. Shadows of hope tells a vivid story of not only their journey to overcome the strain infertility has placed on their marriage, but their individual sources of distraction from the issue. While Marissa is distracting herself with the clinic she has built, her husband has a distraction all his own. Attempting to fast track his career as a college professor into tenured status, Collin has placed everything on the line for a young co-ed; including his marriage. Tristan, best friend to Marissa is caught between a rock and a hard place. He has to watch his friend agonize her way through the situation, without wanting anyone to help. Conflicting with his psychologist nature to help. Tristan may not be on team Collin, but he does a good job of providing unbiased advice. Meanwhile, Marissa is befriending the very women that has her contemplating what to do about her marriage; Collin’s mistress. Saving grace for the mistress, Kaitlyn, she has no idea until it’s too late, that Collin is married. You won’t spend the whole story disliking her or upset (or that could just be me). I think anyone can identify with Kaitlyn’s guilt at being a part of situation she didn’t know the whole truth about until it was too late. Ignoring the red flags, an often in hindsight, obvious signs that something wasn’t right.While there are some spiritual elements & brief scripture references in the story, it wouldn’t be hard for someone who has had the same struggles, and doesn’t believe, to identify with the struggles of Marissa & Collin. Georgiana Daniels uses great imagery & technique to evoke emotional responses to her characters. You will hurt with Marissa as you watch her attempting to cope with the infertility. Which will leave you furious with Collin’s behavior at focusing on his own selfish feelings, from the problems he has created. I gave the book 3 stars, because I didn’t like the development of Marissa. She lacks accountability in her actions and throughout the story. Collin’s affair isn’t justifiable, but her unwillingness to accept responsibility for the state of her marriage prior to knowing is on Marissa. As well as her relationship with Tristan. When you knowingly manipulate a person’s involvement in your life because it is beneficial for you, its wrong. In Marissa’s relationship with Tristan, you get no sense that Marissa has any regard for how her desire for his friendship affects Tristan. She acknowledges awareness, but never accountability. Overall, I would say it is a good story, with a lovable group of characters. The ending definitely came out of left field for me. It was definitely a plot twist I wasn’t expecting."}, {"userName": "Becca-Rae", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/60763817-becca-rae", "userReview": "Have you ever read a book that made you upset because you could see the big picture while the characters remained in the dark? This was me in a nutshell while reading this book. I wanted to shout at the characters to get them to say the right things so that they could all be on the same page. Emotionally speaking this book was a very difficult read. If you're looking for something cheerful and lighthearted, it's not the book for you. It deals with very real issues in a non-sugarcoated way. I think when it comes to reading Christian Fiction we are often spoiled by the way things always seem to work out in the end and we read those types of books expecting that. As a result I think it can cause us to expect those types of outcomes in the real world as well, and life doesn't always go as we plan.Kaitlyn made a mistake by entering into a relationship with one of her professors at the college, but she had no clue that he was also married. Marissa questions her husband's fidelity but she is too afraid to ask him despite finding clues that would lead her to the truth. Colin is remorseful that he was unfaithful to his wife, but in trying to fix things with his wife, he can't help the tug he feels for wanting to raise the baby with Kaitlyn. Despite trying counseling, Marissa and Colin's marriage is in real danger.Currently speaking I am still emotionally processing what I've just read. No, this isn't one of your \"feel-good\" reads, but it's definitely \"real.\" If you can't guess by the actions of the characters, Colin is not a Christian, but Marissa is. Not being equally yoked to your spouse can have devastating effects on your marriage. (I'm not sure where Kaitlyn stands other than expressing her desire for God). The characters battle with very real emotions over the devastating effects of sin. The story is told from the perspective of all three characters so the reader is able to see how each of them is processing the drama of their situations.In my mind I want to give this 4 stars because even though it was very well written, I wasn't emotionally prepared for the ending. On the flip side, the author is facing the difficult battle of publishing a book that doesn't quite fit the mold for what's expected within the genre. Despite finishing the book over an hour ago now, I am still in an emotional fog. It was a good book not just because of how it was written, but because of how deeply it sucked me in. No one ever said this life would be easy, and I believe the author did a powerful job of expressing just that. Therefore, I don't think I can give it any less than the full 5 stars."}, {"userName": "Jill", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/3690313-jill", "userReview": "\"What if......you struggled with infertility but unknowingly befriended your husband's pregnant mistress?...the woman you were seeing behind your wife's back gets pregnant, threatening your job and your marriage?...your boyfriend never told you he was married and you discover you're pregnant?\"Marissa, Colin and Kaitlyn must deal with these questions in Georgianna Daniels' \"Shadows of Hope\".  Told from each of their viewpoints, we see how one situation affects three different people.On a positive note, the story was well-written and had well-developed characters.  However, Daniels does little to create likable characters.  Marissa is so self-absorbed that she doesn't see clearly her role in the demise of her marriage or the inappropriate relationship she has with her long-time friend and co-worker, Tristan.  Collin, who should receive credit for recognizing the error of his ways and trying to salvage his marriage, inadvertently becomes the victim of Marissa's dismal attitude even though she claims to want to save her marriage regardless of the affair.   Kaitlyn, though young, shows more maturity and insight than any of them.Then, there is Tristan, who does not get a chance to show his side, though he is the real victim of the story.  It is clear that he has been in love with Marissa since college.  With no chance of his affections being returned, he chooses to work with Marissa, listen to her self-absorbed rants, enable her behavior even though he is a psychiatrist, and give up a life of his own.  All the while Marissa is totally oblivious. In fact, they are all, in their own way, oblivious.  And I can't say much more without spoilers.Even though the story is fairly interesting, the only reason I kept reading is because I needed to know how it was going to end even though I would be completely frustrated and disappointed.  I waited, quite patiently I might add, for the other shoe to drop, and when it did, the result was anti-climactic.  The one question that was never asked--Why does a married woman have a best friend who is not only male but unmarried and acts around him in such a way that a stranger would think they were married?--is never answered. But that is what you are left considering. And it haunts me.Disclosure of Material Connection: I received this book free from Barbour Publishing, Inc. I was not required to write a review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Beverly", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/65020398-beverly", "userReview": "Marissa works at a pregnancy crisis center, while she, herself is unable to have the child she and her husband, Colin have long desired. Month after month is a disappointment. Their marriage has grown cold and distant, yet they both still yearn for a child of their own.Marissa begins to suspect a larger problem in her marriage and goes so far as to spy on Colin. Her coworker, Tristan tells her that the truth usually isn't as bad as the not knowing. Was he ever wrong about that one.Colin is a professor at a college and had became involved with one of his students. The guilt drove him to break things off. Little did he know that Kaitlyn had earth shattering news for him. After repeated attempts to tell Colin her news, she was finally able to tell him they were expecting a baby. Colin seemed most afraid that the university was going to find out as he was up for tenure.While both Marissa and Kaitlyn are professing Christians, it seemed shallow. They both prayed and Marissa sometimes attended church with her mother. Colin wanted no part of Christianity.Marissa had met Kaitlyn at The Bean, the coffee shop she frequented. Upon learning of Kaitlyn's pregnancy, she encouraged her to come to the pregnancy center for help. This led to the two becoming friends and Kaitlyn even working part time there. All the while, neither had any idea that Marissa was married to the man who was the father to Kaitlyn's unborn child. Marissa had not taken Colin's last name when they married, which seemed strange to me, but it's one of the reason no dots were connected.Kaitlyn had no idea Colin was married, but once he confessed that to her (after being told of her pregnancy), she realized she did not want to be with a man who could do that to his wife.Colin seemed weak to me. He first wanted his marriage to work out, but when he thought Marissa would never forgive him, he then told Marissa they could be together and raise their child. It seemed he didn't care who he was with. Just a needy man who wanted to be with a woman. Colin needed a slap upside the head. In the end, he did want to work on his marriage.Marissa knew Tristan had feelings for her. Feelings he never acted on. But, she seemed uncaring and leaned on him in her crisis.This was a fast paced story and I loved it until the end. I would have given it five stars if not for the ending. I don't want to reveal what my disappointment was as to not spoil the ending for others. It just was not at all what I expected.I was given a free ecopy of this to read by the publisher, Barbour Publishing and NetGalley in exchange for my honest review."}, {"userName": "Catherine", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/4159502-catherine", "userReview": "In the interest of full disclosure, this type of plot is not usually in my range of interest. Stories about infidelity are really hard to make me like. I figured that since this was a Christian novel, it might be something I'd be more apt to like. Unfortunately, that wasn't the case.First of all, I didn't like most of the characters. Colin had NO redeeming qualities to me, and I felt like he was trying to work on his marriage with Marissa because that's what he was \"supposed\" to do instead of actually wanting to, and I really hated being in his head (at least it wasn't first person) for his scenes because of how much I didn't like him or his attitude.Marissa was also pretty self-centered, though when she discovered her husbands infidelity I was much more sympathetic to her. Her character felt very wishy-washy, as she was portrayed as either too aloof to her husband's needs, or too clingy to her husband. Which one was it? Was she obsessed with him to the point where she couldn't have meaning without him and a child, or was she draining him dry putting all of her attention at her job? I couldn't make heads or tails of it and I found it hard to really understand her character.Kaitlyn was fairly likable once she got over her naivete about her relationship with Colin. Mostly that's because you feel sorry for her being in a crappy situation, and she is pretty strong in her boundaries.Tristan was just there so Marissa could have more tension between her husband. His role in her emotional well-being would have just as easily been filled by a woman, but it was clear he was only there so Colin would have a source of jealousy.As for the plot, I felt like the point that everyone was ignorant of their true connections went on way too long. It read as pretty false, considering the supposedly close relationship Marissa and Kaitlyn had. It was hard to feel connected to any of their characters or that they had lives outside of their scenes, and I didn't really enjoy much of the book. I will say it did keep me reading (I took it on a camping trip/relay race) though I really don't like books that mix first and third person. Marissa's character development was there, at least, though I didn't feel like the other characters went through as much development as she did.All in all it was a disappointment, I'm sorry to say. Someone else may like it more. I'm probably just not the target audience for this type of book.I received a copy of this book from Netgalley in exchange for an honest review."}], "description": "A story of hope in the aftermath of inconceivable betrayal and broken dreams  What if. . . . . .you struggled with infertility but unknowingly befriended your husband’s pregnant mistress?What if. . . . . .the woman you were seeing behind your wife’s back gets pregnant, threatening your job and marriage?What if. . . . . .your boyfriend never told you he was married and you discover you’re pregnant? Crisis pregnancy worker Marissa Moreau suspects her husband is cheating, but little does she know how close to home her husband’s infidelity hits. College student Kaitlyn Farrows is floundering after a relationship with her professor leaves her pregnant. Soon she lands a job and a support system at the local pregnancy resource center and things seem to be turning around. But when Marissa and Kaitlyn become friends, neither one knows they share a connection—Colin, Marissa’s husband and Kaitlyn’s former professor. When their private lives collide, the two women must face the ultimate test of their faith and choose how to move forward as they live in the shadows of hope.", "title": "Shadows of Hope", "url": "http://www.goodreads.com/book/show/35658889-shadows-of-hope", "average": 4.04, "cover": "https://images.gr-assets.com/books/1519629856l/35658889.jpg", "reviews": 108, "authors": [{"url": "https://www.goodreads.com/author/show/1515357.Georgiana_Daniels", "name": "Georgiana Daniels"}], "type": ["Christian Fiction", "Fiction", "Womens Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/35658889-shadows-of-hope", "http://www.goodreads.com/book/show/39294913-shadows-of-hope", "http://www.goodreads.com/book/show/15803250-a-daughter-s-redemption", "http://www.goodreads.com/book/show/3578700-table-for-one"]}