{"ratings": 548, "userreviews": [{"userName": "Richard", "userReviewDate": "Jan 28, 2009", "userURL": "http://www.goodreads.com/user/show/1047783-richard", "userReview": "There are three detectives that I've grown fond of: Donna Leon's Guido Brunetti is the most well adjusted of the three. He's a family man, loves his wife and kids, tries to make it home for dinner, treats people well, and solves the horrendous cases he's given. Dotore Brunetti is Italian. Arkady Renko, Martin Cruz Smith's creation, is at the other end of the spectrum. Reviled by his comrades, unsuccessful at most relationships, constantly battling the system, he barely survives from case to case - physically or spiritually - but, he does make it through. Renko, Russian through and through, has grit to spare. Now, even deeper in the murky pools of detective fiction is Herr Nikolai Hoffner, brought to life by author Jonathan Rabb, and inhabiting the ultra-noir city of Berlin at the end of the Weimar Republic and the ascendance of National Socialism. Herr Hoffner comes to life in \"Rosa,\" a convoluted tale of serial murder, and then reappears in \"Shadow and Light.\" Hoffner is a mess. I can't tell you all the reasons why because I'd have to reveal much too much. Trust me, he's a mess. His marriage is wrecked, his kids hate him, he drinks and smokes way too much, he consorts with criminals - it looks like the bottom is on its way up to meet him. He's a hell of a lot of fun to follow around. \"Light and Shadow: A Novel,\" is a step above \"Rosa,\" in milieu, plotting, and atmosphere. We learn a bit about the German film industry, the invention of sound for cinema, and the continuing rise of the Nazi Party, all while investigating a murder clumsily staged as a suicide. We also get to meet a number of famous people. The Hoffner novels have been called alternative history, and they are that. Mr. Rabb is very clever with the \"what if\" portions of both books, more importantly he immerses us in a world that is vivid, exciting, and plausible. One small criticism: I read an advanced copy of the book, so I'm hoping that before it gets to press some eagle-eyed editor removes some clumsy, and contemporary Americanisms from the dialogue. I just don't think Berliners started sentences with that oddly inflected \"Hello...\" that's become so popular; or said things like, \"I'm trying to help you here...\" Four Bright Stars, and can't wait `til the next one."}, {"userName": "Lewis Weinstein", "userReviewDate": "Feb 17, 2012", "userURL": "http://www.goodreads.com/user/show/2231715-lewis-weinstein", "userReview": "This is a complex story, and I'm not sure I understood all of the pieces even when I finished the book, and certainly not while reading it. But that may well be the point. Berlin 1927 was a chaotic combination of dark forces, working at cross-purposes in which the only clear common ingredients were greed and a manic search for power. It was certainly beyond the skills of a single flawed policeman to understand, let alone impact; his well-meaning personal and professional failures are compassionately presented. So the confusion is perhaps the message, shown as if through an ever-darkening gauze screen and never fully explained. If you're willing to suspend a need for total clarity, it is a fine read. For me, as research for my novel-in-progress (tentatively titled Choosing Hitler), Shadow and Light paints a frightening picture of a year early in the Nazi rise, particularly in the relationship between the Nazis and the industrialists who foolishly thought they could use the Nazi movement for their own ends, when of course it turned out to be very much the other way around."}, {"userName": "Tony", "userReviewDate": "May 09, 2009", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "Rabb, Jonathan. SHADOW AND LIGHT. (2009). ****. Despite a labyrinthine plot and, perhaps, one too many characters, this novel from Rabb keeps you reading on and on. The plot begins at the lots of Weimar Germany’s Ufa studio, the home of German cinema. A studio executive is found dead in the tub of his office bathroom. The discovery will set off an investigation that will expose the darker and more desparate side of a country coming apart at the seams. Our protagonist is Herr Kriminal-Oberkommissar Nikolai Hoffner. He is determined to find the identity of what he knows to be murder, although it was arranged to look like suicide. He gets help from two diametrically opposed quarters: Fritz Lang, the German director, and Alby Pinn, the leader of the most powerful crime syndicate in Berlin. As Hoffner probes, he finds himself going beyond the film trade and sinking into the morass of Berlin’s world of sex and drugs, the rise of Hitler’s Brownshirts (the SA) and the activities of prvious monarchists to rearm a post-war Germany. Soon, Hoffner finds himself involved with other people who are involved with his case: a young woman from America – with whom he has an affair – the representative of MGM, and his two sons. His older son, Sascha, has become fully entrenched in the new German Worker’s Party as an aide to its Berlin leader, Joseph Goebbels, and his younger son, Georg, who has dropped out of school to work at the Ufa studios. The author has obviously deeply researched the era and the histories of early filmmaking, and, most interestingly, the development of technology to add sound to film. I’m not sure if this is true or not, but the Germans and the Americans developed techniques to do this at about the same time, but the Americans were confined to the Vitaphone system, where the sound was recorded separately on a disk and played along with the movie. The Germans developed a technique of placing the sound track right on the movie film, so that sound and picture were synchronous. Anyway, a fascinating look at the period with a cast of interesting characters and lots of stumbling police work. Recommended."}, {"userName": "Ron Arden", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/5888899-ron-arden", "userReview": "This book is like the old Raymond Chandler and Dashiell Hammett novels that Hollywood made into film noir. The story takes place in Berlin in 1927 and focuses on a detective, Kriminal-Oberkommisar Nikolai Hoffner, who investigates the murder of a film director at the Ufa studios. Herr Hoffner gets caught in the middle of intrigue, murder, big business, the sex & drug trade, the rise of the Nazi party and of course a femme fatale. Jonathan Rabb mixes real people, like Fritz Lang and Peter Lorre, with numerous fictional characters to weave a wonderful story. The intrigue moves from a sound device that might revolutionize the movie industry through to battles between the communists and the fledgling Social Worker's Party, who became the Nazis.One of the scenes at the end with Alfred Hugenberg showcase what power is really all about and give Hoffner a feeling of helplessness. If Hugenberg gets his way, Germany will rearm to fight the next war, which is ultimately good for business. That is one of the truths of this book. People like Hugenberg supported Hitler, because the Nazis were good for German pride and business. Makes you think about what and who really drive the world."}, {"userName": "Donna Brown", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/2214749-donna-brown", "userReview": "Probably because I was more familiar with the too-numerous characters, I found this an easier read than Rosa. In both books plots are over-complicated and labyrinthine. Nikolai Hoffner is not a very good father, a terrible husband, and very careless of his women. However, I like him and worry about him. He's like a real person to me. The backdrop of Berlin in the 1920s is fascinating. This book helps in understanding the changes Germany was going through.Like Rosa, this book left me lost a lot of the time through the middle but mostly came together at the end. It was good to get to know Hoffner's youngest son and his family, who brought a wholesomeness to the glum detective's life. Although somewhat cold-blooded in his personal life, Nikolai has a strong sense of right and wrong, exceeded only by his compulsive need to solve mysteries.It's a fascinating book in both character and plot and, like Rosa, worth reading."}, {"userName": "Liz", "userReviewDate": "Jun 17, 2012", "userURL": "http://www.goodreads.com/user/show/7379615-liz", "userReview": "This was a difficult book for me to get ... with so many twists and turns. Hubby indicated that it was way too complicated and I agree. The first chapters were just so difficult to get into, but the story did pick up in or after chapter 4(?). The best part of the book was the author's note indicating the actual events that occured after the incidents in this book. If I was more of a WWI/II or movie history buff, I may have found the book more fascinating. As it stood, I was just confused with all the characters and their interaction with each other. I thought it was a nod to the mystery/detective film genre with the detective having a somewhat \"working\" relationship with a known crime boss, the love interest, the personal family turmoil, as well as the work of investigating what started as a suicide. Lots of little plot twists throughout, but not necessarily my cup of tea."}, {"userName": "Peggy", "userReviewDate": "Jun 10, 2012", "userURL": "http://www.goodreads.com/user/show/2091599-peggy", "userReview": "Berlin 1927 Herr Kriminal-Oberkommissar Hoffner is investigating an apparent suicide of a movie producer. He has already suffered from standing with those who do not aid the rising nazi party. In fact they killed his wife. Now he discovers that his older son is running with a group closely allied with several individuals who will become Nazi leaders. I loved the descriptions of Berlin and learned move about 1927 politics but I found the investigation of the suicide and other plots hard to follow..I know the author was writing as Hoffner saw things but please then tell me what Hoffner is thinking, not just doing!"}, {"userName": "Trilby", "userReviewDate": "Apr 19, 2009", "userURL": "http://www.goodreads.com/user/show/1120843-trilby", "userReview": "I started this with some trepidation after my encounter with Rabb's \"The Book of Q.\" This historical novel, however, turned out to be a tightly plotted, atmospheric mystery. The film industry, sex trade(straight and gay), criminal underworld, and of course Nazis all play a role in this novel of 1920s Berlin. The protagonist, Kriminal-Oberkommisar Nikolai Hoffner, wends his way through a labyrinthine set of leads as he investigates the suspicious death of a German film studio executive. Rabb seamlessly interweaves the story of Hoffner's investigation with historical fact. For example, half-Jewish Fritz Lang is shown to have a strained relationship with his bland-blond aristocratic Nazi wife, an accurate depiction. The vast majority of the story is told via dialogue, of which Rabb is a master. In this book Rabb has largely avoided long stretches of snore-inducing background material, as he did in \"Q.\" Instead, the action is packed within a period of only five days, with Hoffner reeling from lead to lead, trying to figure out which are false, and which characters are playing him. The scenes with his two estranged sons are either filled with tension or sadness. Hoffner has no idea how to reconnect with either boy, and his efforts are heartbreaking to see. Similarly, he has difficulty showing affection towards women and frequently prefers walking out rather than engaging emotionally. Rabb does a fine job of sketching the dark,ominous world of post-WW I Berlin, where criminals, fascists, communists, and ruthless business people struggled for control of the city, and no one seemed to care who got stomped on, sometimes literally."}, {"userName": "Surreysmum", "userReviewDate": "Apr 24, 2010", "userURL": "http://www.goodreads.com/user/show/1153430-surreysmum", "userReview": "I enjoyed this, but it was definitely more shadow than light for most of the book The evocation of Berlin between the World Wars was marvellous, but extremely depressing, as was the protagonist detective's defeated attitude. Loved the way actual historical facts about Fritz Lang, his Nazi-sympathizer wife Thea von Harbou, and certain notorious Nazis such as Goebbels were woven into what might otherwise seem an entirely bizarre plot about sound film technology. At the end of the day so many of the actors were bad, that one ceased to care whether it was the greedy Americans or the nasty capitalist monarchists, or the scary Nazis, who really had the upper hand in suppressing the technology. It is Rabb's grim joke, I suppose, that the mob boss who is a pal of sorts for police detective Nikolai Hoffner, is one of the more sympathetic characters.Rabb writes in a very accomplished style, but dense and demanding. In the dialogue scenes, through which he advances most of his plot, the reader must be constantly on the alert to read the nuances in the oblique utterances of characters whose emotional state we are only vaguely aware of, or else risk becoming totally lost. In some ways, this struggle for comprehension replaces the usual, old-fashioned contract of mystery writer and reader, that the former leaves enough clues to enable to latter to solve the mystery on his or her own. Of course you could also claim with some justification that this struggle is what characterizes Hoffmann as well.For the depth of its portrayal of a place and time I had not previously read much about, I've added this book to the \"historical novels\" shelf as well as the mysteries."}, {"userName": "David Lowther", "userReviewDate": "Jan 29, 2013", "userURL": "http://www.goodreads.com/user/show/14288663-david-lowther", "userReview": "Shadow and Light is the second in Rabb's Berlin trilogy. The first, Rosa,was set in 1919 in the politically turbulent Berlin following the German surrender in the First World War. The author mixes real people with fictional and the policeman Hoffner is the leading character in both novels. Both novels have extremely complex plots which, at times, are difficult to follow. In Shadow and Light however, as the narrative reaches its conclusion, I felt an overall sense of satisfaction which I hadn't experienced reading Rosa. The story revolves around the giant German film studios, Ufa, where the legendary director Fritz Lang is putting the finishing touches to his masterpiece Metropolis. An early suicide (or was it murder?), a disappearing gadget which Ufa hope will give them the lead in the race with Warner Brothers to perfect sound movies, the appearance of Joseph Goebbels and the efforts of businessmen backing the fledgling Nazi party, to get control of Ufa combine to tell a very interesting tale. Even Peter Lorre makes a brief appearance, pestering Lang for a part in what was to become the director's first talkie classic M.Rabb's portrait of decadent Weimar Belin is suitably seedy and very convincing. Hoffner, the detective, is persistant but flawed and takes time to get to the truth while trying to keep some kind of relationship with his two sons, one of whom has joined the Nazi party.I'm very much looking forward into reading the third in the trilogy which is set in 1936.David Lowther. Author of The Blue Pencil (www.thebluepencil.co.uk)"}, {"userName": "Oswaldo", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/33974446-oswaldo", "userReview": "Aviso: Éste libro es la segunda parte de una trilogía (La trilogía de Berlin), no necesitan haber leido el primero para entender la historia, pero se recomienda para profundizar en los personajes.------------------------------------------------------------------------------Sombras y luces a primera vista (y leida) suena como un cliché.El detective borracho, que es el mejor en lo que hace, se encuentra con un caso que escapa de sus manos y tiene involucrados a casí todas las grandes cabezas del gobierno alemán en la epoca post gran guerra - pre segunda guerra mundial. Obviamente hay una femme fatale. OBVIO.Pero lo que hace interesante a la obra de Jonathan Rabb son sus desarrollos; a primera vista, el caso tiene pinta de mafia involucrada por cuestiones monetarias, para terminar en un verdadero desmadre... económico por supuesto. El ambiente pre-post guerras realmente se siente en Berlín, el resentimiento de pérdida es palpable en cada calle de la ciudad; las cabezas más grandes saben lo que se avecina, no tienen de otra que modificar sus planes y adapatarlos a lo que viene. ..::SPOILERS::..Y eso es en lo que Jonathan Rabb acierta con su libro: los eventos pasan por que tienen que pasar, y no importa lo que hagas o quien seas, no impediras nada. Eres sólo un tramite legal. ..::FIN DE LOS SPOILERS::..No te das cuenta de lo maravillosa que es la obra hasta que te distanias de ella y la comparas con el cliché andante del género noir. Definitivamente una lectura muy buena y con ganas de leer más sobre esta trilogia."}, {"userName": "Nancy", "userReviewDate": "Apr 29, 2012", "userURL": "http://www.goodreads.com/user/show/108416-nancy", "userReview": "I would love to sit in the room when an author and publisher discuss (or debate) what to name a \"literary\" novel. Often understanding the name requires more thought than the book deserves. This title intrigues me because as I read I kept searching for the light. And searching. And searching. Trust me it was no where to be found except in the technical apparatus of the film industry.Pre WW2 Germany has inspired alot of recent fiction and I've been enjoying a mini-immersion into the Weimer Republic through historical novels. So I picked up this one to continue the experiences and was definitely caught up in the shadows of Berlin in the 1920's. And, searching for some light at the end of the tunnel of darkness.This took me to a place that I was eager to escape. But the squirmy feeling I had reading it slowed me down rather than quickening my pace (as a reader). Although billed as a mystery, I elected to read it as an historical novel (good thing, the mystery was convoluted and somewhat frustrating to follow). The atmosphere of the book was its strength for me--like Raymond Chandler's Los Angeles, the dingy offices and tawdry nightclubs really saved the book for me. And, the family dynamic between the detective and his two sons was heart-wrenching and interesting.So, quite a mixed bag in this book."}, {"userName": "Marley", "userReviewDate": "Aug 20, 2012", "userURL": "http://www.goodreads.com/user/show/2350757-marley", "userReview": "I don't know what to make of this book. I liked Shadow and Light a lot, but found the plot confusing and hard to follow. Some of it made no sense. Rabb writes noirishly with great atmosphere and characters. I especially liked our tortured protagonist Kriminal-Oberkommissar Nikolai Hoffner and his son Georgi, and Alby Pimm. I never quite figured out what Leni Coyle was \"really\" up to but maybe I'm a superficial reader in this case. Or maybe she had no idea herself. I mainly found her annoying. The book is well-researched and peppered with \"real-life\" people, organizations, and events: Walther Lohmann (and the Lohmann Affair), Kurd Wenkel, Alfred Hugenberg and Scherl, Ufa, Phoebus Film, and of course, Fritz Lang and the odious Thea von Harbou (whose wrist should have been broken!)) A special treat is the cameo of the young Peter Lorre. Perhaps I should have read Rabb's other novels first to put it in perspective. Even though I found the plot pretty improbable, I'm giving Shadow and Light 4 stars due to Rabb's portrayal of the Werimar Republic and, imo, it's relevancy to today's America. I plan to read his other books."}, {"userName": "Val ", "userReviewDate": "Jul 09, 2012", "userURL": "http://www.goodreads.com/user/show/2649524-val", "userReview": "The book takes place in Berlin, between the two world wars. When an executive at the renowned Ufa film studios is found dead, it falls to Nikolai Hoffner, a chief inspector in the Kriminalpolizei, to investigate. With the help of Fritz Lang (the German director) and Alby Pimm (leader of the most powerful crime syndicate in Berlin), Hoffner finds his case taking him beyond the world of film and into the far more treacherous landscape of Berlin's sex and drug trade, the rise of Hitler's Brownshirts (the SA), and the even more astonishing attempts by onetime monarchists to rearm a post-Versailles Germany. It took a little while to get into but once the pieces starting falling into place, I couldn't put it down. Since I'm a WWII history buff as well a fan of Fritz Lang's work, I really enjoyed all the historical details."}, {"userName": "John Gaynard", "userReviewDate": "Aug 05, 2012", "userURL": "http://www.goodreads.com/user/show/6570207-john-gaynard", "userReview": "The 1927 period detail in this novel was just as good as in Jonathan Rabb's previous novel in the series, Rosa: A Novel, to which I gave 5 stars. There is an attempt to make a unifying figure out of the film director, Fritz Lang, but this use of a real person doesn't work as well as in the first novel, which was built around the assassination of Rosa Luxemburg.What made it difficult for me to finish the novel was its byzantine plot--around the German-American battle to master the technology of talking movies, and the haphazard characterisation of the novel's central character, Herr Kriminal-Oberkommissar Nikolai Hoffner. In spite of my disappointment, the great impression made on me by Rosa means that I will read other Jonathan Rabb novels."}, {"userName": "Sarah", "userReviewDate": "Dec 10, 2009", "userURL": "http://www.goodreads.com/user/show/1018916-sarah", "userReview": "I wish I could give this book a higher rating, because I love the atmosphere of the book, like a Dashiell Hammett. Berlin is gritty and smoky and dirty and corrupt, but oh so alluring. I liked Detective Hoffner & his son Georgi. I liked that the book included historical figures as characters.So what was it? My fault. I put the book down half-way through for about a month. During that time I forgot who half the characters were and how far the case had progressed. I was so confused I almost skipped to the end to see who the perpetrator of the crimes was. I'm glad I didn't because it was someone I remembered (thank god!) so it was somewhat satisfying. So, I'll blame myself for the low rating & may one day again read it and redeem myself for my forgetfulness."}, {"userName": "Debbie", "userReviewDate": "Apr 06, 2009", "userURL": "http://www.goodreads.com/user/show/2134607-debbie", "userReview": "I had earlier read the first book in this series with Berlin police detective Nikolai Hoffner, Rosa, about the murder of Rosa Luxemburg in 1919 Berlin. This book had all the same strengths and weakness of that one. Hoffner is a great gritty, hardened detective and Berlin is suitably decadent and threatening. The plot, however is so convoluted and the bad guys go to such involved lengths to either do their bad acts of cover them up that I lost track of some of the parts of the story. Hoffner was forever having Aha moments that left me bewildered and thinking \"What? what?\""}, {"userName": "Bruce MacBain", "userReviewDate": "Jul 16, 2010", "userURL": "http://www.goodreads.com/user/show/3194029-bruce-macbain", "userReview": "This is a mystery set in Berlin in the 1920s and draws heavily on true events involving the German film industry. Director Fritz Lang (\"Metropolis\") and actor Peter Lorre make appearances. Kriminal Inspektor Hoffner (who also appeared in the author's previous novel, \"Rosa\") investigates the murder of a film producer and finds that the trail leads both to Hollywood and to the nascent Nazi party. The plot is perhaps overly complex (at least for my aging brain)but its greatest strength is in the characterization--especially Hoffner's painful relationship with his two sons."}, {"userName": "Crystal", "userReviewDate": "May 05, 2010", "userURL": "http://www.goodreads.com/user/show/1893523-crystal", "userReview": "Another book that made me feel foolish when I finished it, because why, oh why did I keep reading it. Set in post-WWI Berlin, it's another book that delves into the atmosphere leading to Nazi Germany and WWII, but it is not as successful as the Frank Tallis books is evoking the era. There was way too much meandering in this book and when the reason became clear for the murders, it still wasn't clear as it seemed too insignificant and far-fetched a motive for the mayhem that it generated."}, {"userName": "Beth", "userReviewDate": "Jan 09, 2011", "userURL": "http://www.goodreads.com/user/show/1497880-beth", "userReview": "I loved the book's premise (set in Berlin in the 1920s focusing on the film industry and the introduction of sound) and throughly enjoyed the first one third to one half of the book. But then the author decided to make the ending overly convoluted so I could not follow his thread. I would read another as I thought the writing excellent and Rabb is particularly good about creating atmosphere. So this is a mixed review."}, {"userName": "Jerome", "userReviewDate": "Feb 09, 2010", "userURL": "http://www.goodreads.com/user/show/77343-jerome", "userReview": "It may be that I liked this book as much as I did because I have read a lot about this era in Germany and am of German decent. I have also seen both movies, M and Metropolis as well as the movie The Blue Angle and liked them a lot."}, {"userName": "James", "userReviewDate": "Apr 11, 2011", "userURL": "http://www.goodreads.com/user/show/3301814-james", "userReview": "All the elements are here - A clever author, interesting history and a gripping story. Somehow though it does not come together quite in the way one would like I always felt like things were just a smidgen too complicated and convoluted."}, {"userName": "Jim", "userReviewDate": "May 23, 2011", "userURL": "http://www.goodreads.com/user/show/2272556-jim", "userReview": "Good mystery story set in Berlin. Rabb builds his mysteries around historical facts, makes for interesting reading."}, {"userName": "Ken Schloman", "userReviewDate": "Aug 30, 2011", "userURL": "http://www.goodreads.com/user/show/5650371-ken-schloman", "userReview": "Super followup to Rosa. Great research on the rise of Nazi Germany."}, {"userName": "Dirck de Lint", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/14197371-dirck-de-lint", "userReview": "I'm hard pressed to think of another novel I've read set in the 20th century featuring loads of references to celebrities and historical figures which is so free of a sense of simpering, \"oh, look how clever I am for inserting THIS person,\" show-off-ery. Whether this is down the the German setting, the aura of exhaustion which the protagonist emits, or a deft control of just how much of the famous folks we're shown, I'm not sure-- it's a tribute to Rabb's skill as a writer, however he's managed it."}, {"userName": "Laela", "userReviewDate": "Dec 28, 2017", "userURL": "http://www.goodreads.com/user/show/16103407-laela", "userReview": "好きだったけど推理小説から分かりにくて途中でちょっと興味がなくなった。読んでて本当のベルリンのことを感じられた。本当の歴史に基づけたから本当に大好きだけど最初から分ければ良かったI liked it but because it was a murder mystery, it was a bit difficult to follow so I lost a bit of interest halfway through. When I was reading it though, I really felt Berlin (the film noir detective smoking in early 1900s Germany vibe). I really loved that it was based on real history but I just wish I knew that when I started the book! **and I also just found out this book is the second in the series??? I haven't read the first one so I'm a bit upset!!"}, {"userName": "Chad Malone", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/51724181-chad-malone", "userReview": "A complex but interesting detective story set in post world war 1 Germany involving the German film studio UFA and the death of one of their own executives. Many twists and turns but an excellent book to read if you are a mystery lover."}, {"userName": "Todd Stockslager", "userReviewDate": "Jun 05, 2015", "userURL": "http://www.goodreads.com/user/show/43477226-todd-stockslager", "userReview": "Midway through \"Shadow and Light\", a character says of American influence in post-Great War Berlin: \"Very clever, these Americans. One day they'll save the world. Whether it needs saving or not.\" Obviously, coming from the pen of Rabb, the quote stands as Rabb's commentary on the arc of American cultural, political, financial, and military influence around the globe in the years since. And regardless of one's views on those subjects it is hard to argue with the accuracy or the irony of it.But this story is about making the world safe for . . . Sound and sex. Jonathan Rabb's Berlin anti-hero police inspector Nikolai Hoffner is on the trail of an apparent suicide (which as we all know in one of the well worn commonplaces of the genre is always a murder) at Ufa, Germany's premier film company. Tied into the case is the appearance of vile hardcore sex films with the startling innovation of synchronized sound on film. It was interesting to see the tie-in between technology and the pornography industry predating the internet--\"Porn drives the internet\" is a catchphrase I've heard and repeated often in my 20-year career in IT because of the truth that many of the technological and business innovations in the use of the internet over the last 20 years have been the direct result of the technical (for example video compression) and business (for example, online ordering and billing systems) demands of the pornography industry.But Rabb goes a bit overboard, weaving in every thread available in his rich geographical and historical setting in a case of historical verisimilitudiness overkill. We have mid-20s Berlin decadence, overbearing American influence in business and culture, the rise of the Nazi party, the rise of quiet but consistent Antisemitism that the Nazi party was able to focus so well, the desire of Jews in Germany to neither hide nor advertise their ethnicity in both denial and recognition of the coming storm, the seemingly cultural if not genetically inborn trait of the average German to look the other way in the face of readily-apparent evil, the secret rise of German military-industrial alliances in opposition to the reparations limitations of World War I--and I may have overlooked some of the touchpoints Rabb crams into a mere 370 pages.The style is appealingly and reverently hard-boiled noir, which helps keep the action moving with minimal dialogue and keeps the page count down. It also leaves the reader sometimes sketchy on the plot details in light of the many threads. So this isn't quite a 5-star classic, but a fun and fast-paced summer adventure for the historically-minded mystery reader."}, {"userName": "Katy", "userReviewDate": "Feb 22, 2012", "userURL": "http://www.goodreads.com/user/show/5552109-katy", "userReview": "Please note: I read this book in January, 2009 from a copy of the book I received from Amazon Vine in exchange for an honest review. This is that review, written in January 2009.About the book: Set in 1927 Berlin, this is Germany as few have witnessed it. Decadent in an almost desperate way, grasping at whatever it can hold on to, and still reeling from being made scapegoat of WWI, its citizens distract themselves however they can.My Synopsis: Out at the Ufa film studios, something is happening that is being held secret, and it is up to Nikolai Hoffner, Kriminal-Oberkommissar for Berlin's Kriminalpolezei, to discover what it is and why it has led to the death of an executive named Gerhard Thyssen, and what it has to do with sexually-themed movies, sound on film, the rise of the SA, the arrival of an American talent agent for Metro-Goldwyn-Mayer and his two sons. Georg has dropped out of school to work for Ufa and Sacha ... well, Sacha is angry and we all know what angry Germans tended to do during that time frame.More about the Story: Hoffner involves Fritz Lang, Alby Pimm (leader of the most powerful crime syndicate in Berlin) and the American woman - Helen (Leni) Coyle as he tries to get to the bottom of the many threads woven into the tangled web of intrigues in this book. By the end the reader almost needs a notebook of his or her own to keep up, but it is a lot of fun to get there. While Hoffner is a morose man - for quite understandable reasons - he also tends to have some very witty dialogue, and the same goes for Lang and Pimm. The author - Jonathan Rabb - has a dark sense of humor that keeps the book from drowning the reader in the darkness engulfing many of the characters and many was the time where I laughed out loud while reading it. I am definitely going to be finding more of his stuff - and if I had known that Rosa was the book before this, I probably would have run out and bought it and read it first - but I'll get it soon, believe me! My husband took a look at the back of the book and said \"Oh - the first book is about Rosa Luxembourg?\" so I'm very excited to see how Rabb takes this historical event and turns it into a novel.My Final Thoughts: I can definitely give this a thumb's up for crime noir, historical fiction, or mystery lovers. There is a lot more to this book, but it is a little hard to define. Give it a chance - I don't think you will regret it - it is a great book."}, {"userName": "Ian", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/3652044-ian", "userReview": "This is the second part of the Inspector Nikolai Hoffner trilogy and though enjoyable it is the weakest of the three. It is set in 1927, 9 years on from part one and both of Nikolai's sons are now young men. His youngest son Georg is just starting out on a career in cinema, effectively working as a runner cum teaboy at Ufa, Germany's main film studio whilst Sascha his elder estranged son is involved with the fringes of the nascent Nazi party. The crime story starts with a death at Ufa's Berlin studio complex that Hoffner is called to investigate and then weaves in and out of several plot lines involving amongst other things cinematic innovations, the demi-monde of the city's sex trade, Hitler's Brownshirts and Germany's secret attempts to re-arm. The descriptions of a Berlin that Hoffner is now falling out of love with remain excellent and the plot is well paced, but central to the story is an American woman whose character I found barely credible. Sadly, just that one really disappointing character brought it all down a notch compared to both the other two in the trilogy, but I would still highly recommend them as a package."}], "description": "Berlin, between the two world wars. When an executive at the renowned Ufa film studios is found dead floating in his office bathtub, it falls to Nikolai Hoffner, a chief inspector in the Kriminalpolizei, to investigate. With the help of Fritz Lang (the German director) and Alby Pimm (leader of the most powerful crime syndicate in Berlin), Hoffner finds his case taking him beyond the world of film and into the far more treacherous landscape of Berlin's sex and drug trade, the rise of Hitler's Brownshirts (the SA), and the even more astonishing attempts by onetime monarchists to rearm a post-Versailles Germany. Being swept up in the case are Hoffner's new lover, an American talent agent for Metro-Goldwyn-Mayer, and his two sons: Georg, who has dropped out of school to work at Ufa, and Sascha, his angry, older son, who, unknown to his father, has become fully entrenched in the new German Workers Party as the aide to its Berlin leader, Joseph Goebbels. What a spellbinding novel \"Shadow and Light\" is, and what a novelist Jonathan Rabb has become!When we last met Hoffner, it was 1919, and he had taken on the disappearance and death of Rosa Luxembourg in \"Rosa,\" a novel the critic John Leonard hailed as \"a ghostly noir that could have been conspired at by Raymond Chandler and Andre Malraux.\" \"Shadow and Light\" is equally brilliant and atmospheric, and even harder to put down or shake off. Like Joseph Kanon or Alan Furst, Rabb magically fuses a smart, energetic narrative with layers of fascinating, vividly documented history. The result is a stunning historical thriller, created by a writer to celebrate--and contend with.", "title": "Shadow and Light\n      \n          (Berlin Trilogy  #2)", "url": "http://www.goodreads.com/book/show/5146086-shadow-and-light", "average": 3.48, "cover": "https://images.gr-assets.com/books/1434583659l/5146086.jpg", "reviews": 73, "authors": [{"url": "https://www.goodreads.com/author/show/447832.Jonathan_Rabb", "name": "Jonathan Rabb"}], "type": ["Historical", "Mystery", "Fiction", "Cultural", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/5146086-shadow-and-light", "http://www.goodreads.com/book/show/7118382-shadow-and-light", "http://www.goodreads.com/book/show/8379611-shadow-and-light", "http://www.goodreads.com/book/show/867781.Rosa", "http://www.goodreads.com/book/show/28502844-among-the-living", "http://www.goodreads.com/book/show/1666740.The_Book_of_Q", "http://www.goodreads.com/book/show/10091629-the-second-son", "http://www.goodreads.com/book/show/2007625.The_Overseer"]}