{"ratings": 13281, "userreviews": [{"userName": "Keertana", "userReviewDate": "Jul 16, 2012", "userURL": "http://www.goodreads.com/user/show/7584700-keertana", "userReview": "When it comes to Shadow Scale, I confess I remain conflicted. Hartman's highly anticipated sequel to Seraphina is the type of novel I've gone and pinned all my hopes and dreams on. I loved Seraphina like I've loved few other books when I first read it and its beauty never dwindled upon my multiple re-reads. Thus, I expected to adore Shadow Scale just as much as I loved its predecessor. Unfortunately, though Shadow Scale is a beautifully written sequel and a truly impeccable ending to this unexpected duet, I still have a qualm too many with it. Shadow Scale picks up roughly three months after the events of Seraphina which the country on the verge of civil war. Queen Glissenda and Prince Lucian Kiggs send Seraphina on a mission to gather all the half-dragons she possibly can as magical abilities only they possess may be the key to winning a war against dragons. The first half of Shadow Scale is devoted to Seraphina's journey as she travels the kingdom in search of other half-dragons. Hartman's world-building truly shines within these pages for every region of this fictional country is teeming with its own customs, religion, and bias. Everywhere Seraphina travels, she is treated differently as a half-dragon and, what's more, the other half-dragons she meets have endured circumstances far removed from her own. Though Seraphina expects to gather a group of people who can instantly connect to one another due to their shared experiences, the reality is far more complex than she can imagine. Building upon Seraphina's insecurities from its predecessor, Shadow Scale continues to challenge Seraphina to think beyond her own life experiences and bind these half-dragons for the betterment, not only of her nation, but of her own heart as well. Hartman infuses each of these half-dragons with personalities so distinct that getting to know them feels like falling in love with aspects of Seraphina herself. From living in her mind's garden, there is already such a strong link between the strangers Seraphina meets and our beloved heroine herself and though the first half of this novel feels slow, in many ways, as it is the build-up to the tension in the last half, it is also necessary. Despite tackling such a large host of characters, most of them newly introduced in Shadow Scale, Hartman maneuvers them with ease and the end result--the reader feeling just as close with nearly ten half-dragons as Seraphina does--is remarkable. Yet, the first half is not merely about Seraphina discovering and meeting these half-dragons. No, Hartman introduces our villain into these first few hundred pages as well and the depth and moral ambiguity she is given from the start makes Shadow Scale a fascinating read. Jannoula, a half-dragon with the capacity to take over the minds of other half-dragons, is both pitiable and dangerous. As Seraphina travels, finding new half-dragons every region she goes to, she also discovers that many of these half-dragons have been possessed by Jannoula who has her own agenda. Though she claims to want to help Seraphina gather the half-dragons, her unwillingness to let go of their minds is frightening, particularly as neither Seraphina nor any other half-dragon knows how to fight her and combat her powers. Jannoula's shadow follows Seraphina on her journeys in Shadow Scale and as the tensions come to a head during the last half of the novel--Seraphina fighting to discover where her uncle Orma is, the half-dragons attempting to expel Jannoula from their minds, the civil war creeping closer to home--Hartman proves her incredible ability to write. Just as with Seraphina, I couldn't predict the plot twists revealed in the second half of this narrative and the resolution reached by the end was truly satisfying. Moreover, I loved the heart-breaking plot line concerning Seraphina's uncle, Orma. Within the pages of Shadow Scale is a rare epilogue that is truly wonderful. Although I didn't expect, at first, for Shadow Scale to be the end of this short series, I couldn't have asked for a better ending to the duet and Hartman's scope of imagination has convinced me that she will--hopefully!--return to this world as there remain many stories left to be told. Where my disappointments with this narrative arise, however, are with the romance. Shadow Scale could have easily simply been the first half of itself, forcing readers to wait for a third novel to discover how the plot thickened and came to a resolution. By choosing to write a duet, Hartman allows her plot to thrive as readers are able to witness the back-to-back nature of the tensions at once instead of with a year in-between. Yet, the rich relationships developed in Seraphina between our heroine and her friend, Queen Glissenda, or her lover, Lucian Kiggs, are minimal as a result. At just over 600 pages, it would be remiss, likely, of Hartman to extend her narrative for the sake of the romance. Nevertheless, I wish that was the route at hand. I was incredibly invested in the romance outlined in Seraphina and though it reaches a conclusion--of sorts--in Shadow Scale, it also leaves many unanswered questions. Moreover, the interactions between Kiggs and Seraphina in Shadow Scale, though full of the intelligent conversation these two adore and incredibly supportive, lacked the longing I felt palpable in Seraphina. Kiggs isn't a significant character in this plot line and though he is important to Seraphina, there are so many other characters--half-dragons and dragons alike--that her relationship with him doesn't pierce the heart. I wanted much, much more on the romance front, particularly due to some last-minute revelations that were sprung upon readers. Especially because Hartman tells us that there has been much discussion as to matters of the heart but the reader is not privy to these discussions and, on the love story angle, I needed more closure. With such a large host of characters, Hartman managed to make Shadow Scale an incredible novel with distinct character personalities and relationships. I only wish the few we had seen develop in depth in Seraphina continue to be as strong in this sequel. While Seraphina was a distinctly character-driven tale, Shadow Scale is more firmly plot-driven. Nevertheless, Hartman accomplishes so much with this sequel. From her world-building to her plot development and beyond to the diversity of race, sex, and gender that she includes within these pages, Shadow Scale feels revolutionary. For fans of Seraphina this one is worth waiting for, minor disappointments and all."}, {"userName": "Valeria", "userReviewDate": "Aug 15, 2012", "userURL": "http://www.goodreads.com/user/show/9719101-valeria", "userReview": "Finds out there's a sequelBut then see's publication date  Is no longer happy"}, {"userName": "Ferdy", "userReviewDate": "Mar 12, 2015", "userURL": "http://www.goodreads.com/user/show/4596358-ferdy", "userReview": "SpoilersSo long and boring, I thought it would never end. The only parts I somewhat enjoyed where when Seraphina was back in Goredd or when she was interacting with Comonot, Orma, Eskar or Glisselda. Everything else was utter rubbish.-I wasn't impressed that most of the plot consisted of Seraphina travelling to different places so she could find other ityasaari (half-dragons). It was all very repetitive, Seraphina would go somewhere and search for her fellow half-dragons, she'd find them, then there'd be some sort of obstacle that had to be overcome (usually evil Jannoula popping up to cause trouble), then she'd travel to some other place and do the same thing, and rinse and repeat. All the travelling and the random new characters/places introduced didn't make for engrossing reading. Way too much page time was spent on that instead of on established characters and plot lines.-The last quarter of the book was more entertaining with Seraphina going back to Goredd and the characters and story finally coming together. The last couple of chapters were quite bad though with some deus ex machina character (Pandowdy) appearing and saving the day, and Seraphina after struggling with her powers through the entire book suddenly having a revelation at the eleventh hour and managing to turn on her snowflakey powers and help save the day. It was all very contrived and convenient.-I wanted there to be more focus on Goredd and the dragon civil war, instead most of the focus was on Seraphina going to random new places and meeting random new people. She just seemed to float from one place to the next feeling sorry for herself and not actually doing much - Abdo had far more agency and sense than her, whereas Seraphina achieved very little apart from meeting some new half-dragons. The ridiculous thing was that if she had stayed at home in Goredd (instead of spending months finding other ityasaari) things would have turned out exactly the same anyway. Seraphina's whole trip was pointless.Also, whenever things would go wrong like when Abdo, Dame Okra or another ityasaari were taken over by Jannoula or when someone was in danger, Seraphina would just monologue about it and then take her sweet time actually doing anything about it, sometimes she would do absolutely nothing and instead ponder about her loneliness or some rubbish. It was so frustrating. -For the most part I didn't find Seraphina interesting. Her self-pity, whining, insecurity, naivety, and her constantly blaming herself for everything was boring and beyond irritating. Also, her nobody-understands-me-or-my-inner-pain attitude was nauseating, she really needed to get over herself and realise that she wasn't a speshul snowflake (although annoyingly at the end she did turn out to be a total speshul snowflake).Another thing I disliked about Seraphina was how she only ever seemed to care about the men in her life, it was all about Abdo, Kiggs, or Orma. There were't any female characters that she truly cared about as much as the menfolk in her life. Bloody typical.-I wasn't impressed that Jannoula, who was a non-character in the first book was a such a huge, pivotal character in this one. The entire story was more about Jannoula than the dragon civil war/threat of war in Goredd. Also, what the hell were Jannoula's powers all about? She could randomly enter the minds of some half-dragons and take over their body yet she wasn't able to enter other ityasaari minds? But then magically she could. And sometimes she had complete control over somebody and was able to fully take over, and other times she'd conveniently disappear from a body or just stay in the background all depending on whether it suited the plot or not. She was also able to randomly charm humans by showing them her aura or some rubbish, it came out of nowhere. She was able to do so much with her mind and was super powerful, which didn't add up to her past/lifelong imprisonment, why wasn't she able to somehow use her powers to escape sooner? She seemed to change from powerless prisoner to all powerful being overnight. Jannoula even said she could use that dragon mind trap by herself, what was stopping her from using it to escape sooner? Then there were times where she could only control one person at any given time but in other parts of the story she was able to control dozens. Her powers were inconsistent and made no sense.-I liked that Kiggs married Glisselda at the end, it was the right thing to do for their country/people. However, the fact that Kiggs/Selda loved each other like brother and sister made it all very creepy and incestuous. But I guess that was realistic since it was a political/arranged marriage.What did bother me was that despite Kiggs/Selda getting married and starting a life/family together, Seraphina didn't take that as a sign to walk away and move on with her own life. Nope, she decided to be Kiggs's mistress for the rest of her life, and be his dirty secret and live in the shadows of his marriage. I thought by the end she'd grow a backbone and gain some self respect, instead she turned out to be a desperate, pathetic loser. Seraphina spent her whole life living a lie and hated herself for it, so I expected after all that that she'd finally embrace being free from all the lying and hiding, but the silly cow ended up living an even bigger lie. How could she be happy being the other women? Why would she give up a chance to live an honest life? Why would she give up the chance to find love again and start a family of her own? Why would she give up so much for Kiggs when he'd done very little for her in return? Why was she happy to demean and degrade herself for a guy who clearly didn't respect or care for her? If Kiggs really loved and respected her, he would have shut Seraphina out of his life so she could have a chance of moving on and finding her own love/family. But the greedy, selfish bastard didn't do that, he only wanted what was best for him, never mind how much he was fucking up Seraphina's life. Also, why was Seraphina so cool with Kiggs having kids with Selda? Did she really have that little respect for herself that she was happy to watch him play happy families with Selda, whilst she got thrown the occasional scraps? He got the best of both worlds whilst she was alone with no kids or family of her own, all she probably got were a few seedy nights with him. Sick, sick, sick. -Ugh, why do all YA books end with the heroines giving up so much of themselves for a love interest that's treated them like nothing but crap? Why aren't heroines allowed to play the field or fall for someone else later in life? Why are they always stuck with their douchey love interest? Why couldn't Seraphina work on her music or meet someone new and start her own family? Why did she have to be content with being Kiggs's bit on the side? What a horrid ending for a YA heroine. The author could have shown that a young female character could have a healthy and happy ending by being on her own, but no she had to end up with a married man, making her a cheap tart with no self-worth. Seraphina could have reconnected with her family, she could have gone on to education or some other passion, she could have become the backbone of the half-dragons, she could have had loads of different lovers and gone on loads of adventures. But instead, she got to be a mistress. None of it worked for me, Seraphina was a blah heroine for pretty much all the book, but at the end she went from being a blah heroine to a cheap-classless-tart-with-no-morals-or-dignity. Kiggs was even worse than Seraphina, he wasn't honourable or decent, he was a slimy-opportunistic-greedy-slutty-sleazy-loser who only cared about himself. I'm guessing since he was cool with having Seraphina as a mistress, he must have been cool with having loads of other mistresses too. Ugh, I hated him.-What was with Glisselda kissing Seraphina and saying she was in love with her? It came out of nowhere. Was Glisselda bisexual or gay? And what did Seraphina mean when she said she realised something about herself after the kiss? Why wasn't any of it elaborated on? Did Seraphina suddenly realise she was bisexual after one kiss? Really? Why was Glisselda cool with her husband hooking up with a woman she loved? Yea, I didn't buy the throw away line at the end that Seraphina/Kiggs/Glisselda had a mutual agreement about their relationship and knew what they meant to each other. There were chapters and chapters of pointless travelling yet the author couldn't even be bothered to show what happened between Kiggs/Glisselda/Seraphina and explore the dynamics between them, there was no discussion or thought processes involved. Their ending just didn't fit with what we knew about the characters. Apparently, none of them were bitter or jealous about how things worked out. I was just expected to believe that Seraphina was magically fine with Kiggs being married and having kids with someone else and her not being able to have any of that, that she was perfectly content to never have a family of her own and was fine with hiding her feelings and relationship with Kiggs from everyone. Yea right. And then there was Kiggs who was apparently okay with being unfaithful to two women despite claiming to love them both, also he didn't seem to care in the slightest that by being with Seraphina he forced her to live another lie. Yet I was meant to believe he was honourable and loved Seraphina when everything actually pointed to him being a low life scum who loved no-one but himself. Whilst Glisselda was supposedly happy to give her blessing to Kiggs/Seraphina shagging around behind her back, even though she was in love with Seraphina, and Kiggs was her husband and would-be-father of her children. Also, it-sort-of-kind-of-might-have been implied that Seraphina would possibly be Glisselda's mistress too, and Kiggs just so happened to be totally fine with that. Ugh, it was all too ridiculous, the characters I'd gotten to know in Seraphina and Shadow Scale would not be okay with all of that. As fucking if someone like Seraphina who wanted nothing more than family and honesty was cool with being 'the other woman' for the rest of her life and having to live with such a seedy lie. Ugh, no fucking way. -There wasn't enough Orma or Glisselda, the way their arcs ended was very unsatisfying. I wanted to know more about Glisselda and how she handled her sexuality and queenly duties. Then there was Orma, the best relationship in the books was between Orma and Seraphina and that ended up completely destroyed, there were barely any scenes between the two and when there were any the emotional connection between them was gone because Orma/Seraphina were no longer Orma and Seraphina instead they were pretty much random stranger and Seraphina. Why couldn't Seraphina have one thing at the end that was pure and untouchable? All she got was a sleazy relationship and isolation from any real family. Her and Kiggs and Glisselda weren't family, she was nothing but their bit on the side and possibly the creepy-sort-of-aunt that hung around like a bad smell when it came to their kids. Yea, what a great ending for a YA heroine. Ugh.-Liked that there were diverse characters. -The computer/camera/phone like devices seemed out of place and didn't fit in with the fantasy setting. All in all, I hated it. It was boring and Seraphina's 'HEA' as a mistress to a married man was disgraceful."}, {"userName": "Melodramaticfool", "userReviewDate": "Aug 20, 2012", "userURL": "http://www.goodreads.com/user/show/6524879-melodramaticfool", "userReview": "2015? ARE YOU SHITTING ME?"}, {"userName": "Lisa Andres", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/1343808-lisa-andres", "userReview": "This was, hands down, one of the most frustrating and disappointing sequels I have ever read.**Warning: Spoilers Below**First of all, I have to say, I loved Seraphina. Devoured it. Stayed up ridiculously late reading \"just one more chapter.\" And I love those kinds of books -- they usually inspire an undying loyalty to the author. But in this case...I'm more than a little angry. (Which is not a good thing to be at 3:00 in the morning.)Where to start? Perhaps with the pacing. Seraphina took a while to get into -- but then, so did The Girl With The Dragon Tattoo. In both cases, it took about 100 pages -- those first 100 seemed to drag on interminably, but then, it was like a switch was flipped and things just took off, racing steadily towards a perfectly timed climax. In the sequel -- and, I will admit, I had NO idea that this was a two-book series; I honestly thought it was a trilogy and everything that Hartman was setting up seemed to reinforce that -- the pacing was just...off. I anticipated a slow start and thought that things were starting to pick up about a 1/3 of the way through, with the (re-)introduction of Jannoula. That's when things started to get interesting.But most of the first half of the book was Seraphina journeying places. She went to Ninys and then to SamSam and then to Porphyry and then, eventually, to Lab Four. And all along the way we met brand new characters, had to establish a clear setting (which, ultimately, didn't matter, because we never went back to that country!), and forge new relationships. Not much happened -- or, at least, what did happen fell into a quickly established pattern: Seraphina arrives somewhere new. She meets new people. She searches for ityasaari. She attempts to befriend them only to find out that Jannoula has already gotten to them. EVERYONE falls for Jannoula, leaving Seraphina pretty much alone and miserable for the majority of the book.Gone is my strong, witty, sensitive heroine. Gone are her relationships with her family, with Orma, with Kiggs, with Selda. Gone is the court intrigue, the suspicious characters, the MUSIC. (The first book dealt SO much with music and now...it's just gone.)And as long as Seraphina is journeying places, not much happens. Even when things do happen, Seraphina seems to be sidelined for one reason or another. The novel only seemed to pick up once Seraphina arrives back in Goredd -- perhaps because we're back in familiar territory and we get a chance to see her interacting with all the characters she's established relationships with. But even then...everyone from the first book is conspicuously absent and all the other ityasaari are hooked into Jannoula so, again, Seraphina is alone and miserable. Most of the last 1/4 of the novel is Seraphina trying to find a way to defeat Jannoula and failing because, apparently, Jannoula is, like, the best evil villain EVAR.Things just...fell apart here. Why is Jannoula so persuasive? Why can she persuade everyone -- humans and ityasaari alike -- but none of the other ityasaari can? She is ALWAYS one-step ahead of Seraphina because she can, quite conveniently, be in everyone's heads at once. How does she manage it? How does she manage to sipher information from everyone? Early on, she can really only manage one person at a time. It just doesn't make sense. And don't even get me started on Seraphina's mind garden. What was once a really cool, unique concept in the first book just seems to have run away from Hartman. It's inexplicably shrinking this whole book (and I don't think it's a coincidence that Seraphina ultimately abandons it in the end, much like Hartman seems to have done). And all this business with inside-outside houses? It's like wibbly-wobbly, timey-wimey stuff; it's more confusing than anything and was incredibly hard to follow. But Seraphina apparently understood it, even if I didn't, because she has this miraculous epiphany at the end -- literally 95% of the way through the second book - and everything is instantly taken care of in an ending which smacks of deus ex machina. Literally. Seraphina has her miraculous inner realization but, since it's not enough to take care of Jannoula, even with Abdo's help (who has also miraculously reappeared), who intervenes but a larger-than-life monstrous saint. He literally plucks Jannoula off the castle parapets and whisks her away -- to do heaven-knows-what with her; her fate is decidedly unclear.You know what's NOT unclear though? Two things.One--the whole big battle between the dragons and the humans and the ityasaari and the neighboring kingdoms? Doesn't happen. This evening, I was talking about the book to my husband, mildly complaining and saying that maybe this book just suffered from middle child syndrome: we'd set up everything here and then get to the good stuff with the climactic battle in the third book. Only...there is no climactic battle. After Jannoula leaves, Queen Glisselda magically restores peace and everything comes up roses. The great, big, belligerent dragons are perfectly content to follow law and order and go back home. WHAT?Two--Seraphina's fate as a lonely spinster with no one around her in her life. Why? Because all the other ityasaari go home, even Abdo (who decides to return to the temple he once denounced). Okay--they were visitors anyway. Let's focus on the characters we loved in the first book.Orma? Oh yeah. He DID have his memories excised, despite Jannoula saying that they weren't. He can't remember Seraphina and he may or may not eventually remember her, since he may or may not have made a memory pearl. That's okay--Seraphina has her other family right? Her dad and stepmother and half-siblings? Nope. Not even mentioned in this book.But even that's okay, because Seraphina still has her BFF, Selda, and her love, Kiggs. WRONG. And this is where I completely and utterly lost faith in the novel. We have been building the relationship between Kiggs and Seraphina since the first book -- they are completely and utterly compatible, complement each other, and love each other. And once Glisselda finds out, she gives her blessing -- because, apparently, she's in LOVE WITH SERAPHINA TOO. Is she a lesbian? Is she bisexual? Is she just going through a phase? No one knows -- because this is casually thrown in and then never acknowledged again. Unless you count the fact that Kiggs and Glisselda get married. MARRIED. Despite the fact that they BOTH love Seraphina, they decided to marry each other. And all of this is, again, casually thrown into the end of the novel in ONE SENTENCE. We don't even get a satisfactory answer--they want to honor their grandmother's wishes? (That didn't seem to matter before.) Glisselda couldn't imagine marrying anyone else because she had always thought that she would marry Kiggs? (That's a complete cop-out, even if you take into account that most royal marriages are political alliances.) And Kiggs was basically married to Goredd? No. Just no. He loves Seraphina and this whole marriage-isn't-actually-about-love is an awful, unsatisfactory message to readers who just slogged through 900 pages."}, {"userName": "Kaora", "userReviewDate": "Jan 29, 2014", "userURL": "http://www.goodreads.com/user/show/7983564-kaora", "userReview": "I was so sure this was going to be a 5 star read. I was so excited to start.So what happened?The kingdom of Goredd is heading towards war as they are caught in the middle of a conflict between Loyalist dragons who want to keep the peace with humans, and those that wish to go to destroy humans. Seraphina is sent on a quest to bring the other half-dragons called ityasaari together in defense of Goredd. Her travels bring out an old enemy, who has the ability to take over others' minds. Seraphina must find a way to stop her or risk losing everything forever.This book pulled me in pretty quick and had me hooked. Seraphina is a strong character, and in Shadow Scale we learn more about her mind garden and her struggles with Jannoula, who was touched upon in the first book. We also learn about the history of this wonderful world Hartman has built and the creatures within it.I love a well developed world with memorable characters, and this one is no exception. Meeting the ityasaari and their abilities was fascinating.But once I hit the 80% mark it started to go downhill.Seraphina never struck me as a naive girl. She seemed strong, and determined and although she had the tendency to rush into things without thinking I felt like Kiggs was her anchor. So when she places herself in danger with no plan or defense and Kiggs happily goes along with it, it seemed out of character. I knew it was going to go downhill from there and I was right.I struggle with the fact that she could stand by for weeks while those she considered her friends and \"family\" were effectively tortured and she did nothing. Except complain about how she felt she had done nothing. Which was completely true. I wanted to reach in and shake her. Grow a pair and help your friends. Oh wait you can't because you left your shit behind in favor of a peaceful approach.Then to top it all off Seraphina, a girl who struggled her entire life with having to lie, who had finally come clean and no longer had to lie ends the book by jumping feet first into another major lie. WHY? What are you thinking? Have you learned nothing? So frustrating.Cross posted at Kaora's Corner."}, {"userName": "Madeline", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/6335780-madeline", "userReview": "When I realized that it was the sequel to Seraphina:When I saw the date:Why do I have to wait so long?"}, {"userName": "Tammie", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/3506989-tammie", "userReview": "[ Kiggs and Glisselda who really have a brother-sister type relationship, marry near the end of the book for the good of the kingdom, and because they promised the Queen they would before she died. And it seems as though Kiggs and Seraphina are to become lovers. Glisselda has revealed that she is also in love with Seraphina. She revealed this after she finds out that Kiggs and Seraphina are in love with each other. This seemed to come out of nowhere. There were no hints to it at all, ever that Glisselda had those sorts of feelings for Seraphina. It felt forced into the story. She kisses Seraphina at this point and tells her she and Kiggs have her blessing. Seraphina then realizes something about herself, but we are not told what that is. In the end it is stated that they are all fine with the arrangement they have made and the way they feel about each other is between them. It made me wonder if they weren't going to have some weird sort of threesome. I seriously don't want to have thoughts of threesomes in my head while reading a YA book. Hopefully I was reading too much into it. Regardless, I don't like the idea of Seraphina being Kiggs's mistress and not his wife.  (hide spoiler)]"}, {"userName": "TheBookSmugglers", "userReviewDate": "Dec 31, 2012", "userURL": "http://www.goodreads.com/user/show/1223249-thebooksmugglers", "userReview": "Shortly following the events of Seraphina, Shadow Scale shows us a different side of the eponymous heroine. For the first time in her life, Seraphina is free. For the first time every, she’s free from the fear of hiding her half-dragon, half-human parentage, and lives as a valued, important, even loved member of Goredd’s court. Serving openly as a trusted adviser to Queen Glisselda, Seraphina helps Selda grapple with her new rulership in the midst of a draconian war that threatens the lives of all in Goredd and to the south. In order to protect from impending attack and devastation, the Queen turns to Seraphina and the legend of a magical net that she and her other halfling kind, the Ityasaari, alone can cast. It is up to Seraphina to gather the other half-human half-dragons she has cultivated in her mind garden, and band them together to protect the home, the people, and the dragons she loves.Fellow readers and Seraphina lovers, this is a hard review for me to write.It’s hard because I loved Seraphina so very much when it first came out. I loved the pressures that Seraphina faced in Goreddian society, the thread of music and magic that ran throughout the book, the quiet romantic storyline between Seraphina and Kiggs. I loved the lyrical writing and the fascinating realm of magic and draconic lore that Rachel Hartman wove into ever page of that first book. This is, in some ways, an unfairness to Shadow Scale because I came into the book with such lofty expectations and hopes – especially considering that I had to wait years for this sequel.So in full transparency, all cards on the metaphorical table: Shadow Scale is nowhere near as fulfilling as Seraphina. While it’s still a solid fantasy novel in its own right, Shadow Scale never quite manages to hit the high, sweet notes that made me fall in love with the first book.Now please do not misunderstand me: there are plenty of things to love about Shadow Scale. The mere fact that there is more to Seraphina’s story is intoxicating, and I love the expansion to her world that Hartman employs in this second novel. The different cities, cultures, customs, foods, and people are varied and fascinating (I particularly enjoyed the completely unexpected inclusion of Lab Four). I also very much loved getting to know other half-dragons on Seraphina’s travels and their interactions with each other; if you’ll recall, Seraphina is one of the lucky few who can (and, more importantly, who has) passed for human, but not everyone she meets is able to do the same (in particular, the figure of doctor Nedouard is so striking and solitary at the onset of the book). The politics of Goredd for both human and dragon (and ityasaari) are also wonderfully detailed and a strong point for Shadow Scale, as the motivations for war and Seraphina’s mission to gather her half-dragon brethren make sense.For each of these very good things, however, there are… well, less good things. The plot, on the whole, is incongruous and oddly stunted when it comes to pacing. Much of the book follows the same pattern: Seraphina travels to find another ityasaari, finds them incredibly easily and with a high success rate, but then STUFF HAPPENS and there are problems because of the Bad Guy (I don’t want to spoil anything but it’s pretty obvious from the start). This happens several times for the first half to two-thirds of the book – there is much hand-wringing and Seraphina feeling tired, and lonely, and disheartened. Where is Seraphina’s agency? It’s almost as though in this novel, the heroine and heart of book 1 has become relegated to the sidelines of book 2. For all that she is the one on whose abilities, smarts, and diplomacy the fate of Goredd rests upon, Seraphina is decidedly without power, happiness, or drive. (Also MIND CONTROL BAD GUY POWERS are an incredibly frustrating cop-out. That is all I will say about that.)More important than an uneven, repetitive plot, however, Shadow Scale is disappointing because it lacks the heart of Seraphina. Where is the music that was so potent and present in the first novel (and prequel novella)? Where is the sensitivity and the underlying romance, and the emotional identity that powers the first book? For that matter, what the heck really happens with Seraphina’s Dream Garden and why is it so quickly and easily abandoned? Why is there a Deus Ex Machina of an ending, that effectively dislodges the Big Bad Guy (who has been pulling all of the strings so far ahead of Seraphina since the get-go)? Why is the war, similarly, so easily resolved so late in the book without the big flippin’ battle the book description promises and that Shadow Scale seemingly builds up to?Frustrations.The one thing about the book’s resolution that I did appreciate, however, concerns the romantic subplot between Seraphina, Kiggs, and Selda. The romantic subplot is firmly relegated to the background in Shadow Scale (as is Kiggs, basically), because though Kiggs and Seraphina love each other so very dearly, there is duty to consider and Seraphina genuinely cares for her darling friend (and Queen) Selda. I love the idea of the subversion that Rachel Hartman employs here with Selda and Seraphina’s relationship, and the ultimate direction of the royal political marriage… at least in theory. In execution? I truly wish that more time was spent on this particular subplot and ending, instead of being glossed over in passing.But, of course, your mileage may vary. For me, Shadow Scale sadly was not quite what I had hoped for in a sequel – certainly, it’s not what I had hoped for as the second half of a duology.I still enjoyed parts of the book very much, but I had hoped for more."}, {"userName": "Steph Sinclair", "userReviewDate": "Sep 06, 2012", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "Why, hello there, lovely. :D"}, {"userName": "Angelica", "userReviewDate": "Feb 07, 2013", "userURL": "http://www.goodreads.com/user/show/16201093-angelica", "userReview": "2014!!!!!!Seriously how are you going to publish one book in 2012 and then the next two years after. That's not cool, not cool at all man! The suspense is absolutely killing me, when it comes out I might have forgotten important things about Seraphina and will have to skim through it again or something. I'm just, just:UPDATE 4/30/13So...it has a title. How very interesting. Now I can look forward to the cover release, then finally the actual book!!!! *looks at release date, cries on the inside\t*Why Rachel why!?!?!?By the way didn't it used to be tittled 'Dracomachina' or something? Oh well at least I can pronounce it now.UPDATE 10/30/13WTF?!?!?!?!?Did they just change it to 2015!!!!!!!!! I'm going to go crazy waiting for this darn thing to come out!!!!!!!!!!I'm having issues right now. I will have forgotten everthing by then and will have to re-read it. I'm so angry!!!UPDATE 1/01/14So it hs an official release date, March 24 2015.That's over a year away!!!!!!!!WHY!!!!!!!!!!!I DO NOT UNDERSTAND WHY THIS IS!!!SERIOUSLYGUESS WE STILL HAVE MORE TO WAIT."}, {"userName": "Maja (The Nocturnal Library)", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/4551536-maja-the-nocturnal-library", "userReview": "Shadow Scale is the long-awaited sequel to our beloved Seraphina, and it’s a worthy one. There’s no denying the value of Rachel Hartman’s prose, the vividness of her imagination, or the quality of her many characters. Shadow Scale may have been “a beast to write”, but the end result is a book the likes of which we rarely see. That’s not to say that Shadow Scale is without its issues, but those only come to light when we isolate the book and judge it by much higher standards. When analyzed comparatively, side by side with others of its genre, it becomes abundantly clear that Shadow Scale is a superior work. The clarity of detail in Seraphina’s Goredd is marvelous, and the sheer amount of information offered is staggering.Emotionally, though, Shadow Scale leaves something to be desired. As much as I appreciate having a heroine that’s just as clueless and powerless in extraordinary circumstances as I myself would be, I expected more from Seraphina Dombeg. I can forgive much stumbling, but I find lack of thought interspersed with bouts of self-pitying truly exasperating and disappointing. In Shadow Scale, Seraphina seemed to just wander about aimlessly, suffering defeat after defeat and not doing much about it.To be fair, Hartman gave her a formidable enemy. As another one of Seraphina’s kind, albeit far more powerful, Jannoula appeared to be everywhere at once. It needs to be said, however, that all-powerful enemies generally lack nuance, and the very fact that Jannoula arrived everywhere before Seraphina by anticipating her every move and being much more clever, while Seraphina kept losing precious time by focusing on all the wrong things, was nothing short of exasperating. For most of this book, Seraphina’s situation seemed to be hopeless on all sides. Luckily, the ending gives us some closure, although it too is a bit too open for my taste. Clean cut endings aren’t always the best choice, but after six hundred pages of struggle, a more substantial epilogue would have been a nice reward.There remains the fact that Hartmann writes YA fantasy of unparalleled quality and that her worldbuilding lends itself to a ten-book series, and not just a duology. My own emotionality aside, these books will likely become classics, and their status will be well-justified."}, {"userName": "Renata", "userReviewDate": "May 23, 2016", "userURL": "http://www.goodreads.com/user/show/45587823-renata", "userReview": "Escamas es la segunda y última parte del libro Seraphina donde la protagonista es una semi dragón. Realmente no sé que decir, Seraphina me encantó por que fue la primera vez que leía algo sobre dragones y la ambientación me pareció increíble y las descripciones y todo. Pero en esta segunda parte sentí que habían muchas cosas que básicamente sobraban, o por lo menos en vez de que tenga sus 600 páginas podría haber acabado en 450 o así. Sé que el estilo de Rachel es así pero la verdad me aburrí bastante en las últimas 200 páginas y no podía esperar a que lo acabe ya y generalmente cuando quiero acabar un libro es por que me encanta y no por que se me está haciendo muy pesado. No lo sé la verdad. Los personajes me encantaron, eso siempre, por que Rachel hace que aunque hayan cinco mil personajes puedas enterarte de la historia y particularidad de cada uno y no te lías con ninguno. Me encantó como le dio tanto precio a la amistad entre Seraphina y Abdo, puedo decir que son mis personajes favoritos y simplemente están para adorarlos. La relación entre Seraphina-Lucian-Glisselda también fue algo muy bonito, quiero decir, desde un principio hasta el final sus historias y sentimientos están muy bien explicados y los entiendes cuando uno hace una u otra cosa y lo que llegan a quererse se queda corto en palabras para describirlo. El final no me acaba de convencer mucho pero lo entiendo y creo que es el mejor para los tres pero no lo sé, realmente esperaba algo diferente y no me refiero a algo bueno, Rachel podría haber escrito un final trágico y hubiera quedado genial pero quedó muy simplificado y es una lástima. El epílogo bueno, me ha dolido. No puedo decir por qué ya que sería spoiler pero ese sí que fue un epílogo 10/10. En general el libro está bien y tiene un final bastante bueno para esta bonita historia, pero como dije, me pareció que la autora se enrolló en temas cuando no tocaba y el final fue bastante precipitado."}, {"userName": "Heidi The Hippie Reader", "userReviewDate": "Aug 25, 2016", "userURL": "http://www.goodreads.com/user/show/7986781-heidi-the-hippie-reader", "userReview": "[The deux ex machina completely ruined it for me. Hartman took such care building her world, introducing the half dragons, spinning the web with Jannoula... I could not wrap my mind around how she ended it. (hide spoiler)]"}, {"userName": "Roya", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/12222982-roya", "userReview": "Shortly after finishing \nSeraphina\n, Argona and I decided to read Shadow Scale. The first half of this book focuses on Seraphina and her search for her fellow ityasaari (human-dragon hybrids). It was interesting, but sadly that was as good as it got. We were then introduced to Jannoula, who is Seraphina's nemesis. That's around the time when things started to get a little dull. Towards the final 20%, things picked up and I had hope again. I even finished this book two days in advance out of sheer curiosity. Now that I've finished it, I feel so let down! In a way, it has erased all of the first book's toil. I feel cheated, but mainly disappointed. I wouldn't recommend this book, even if there are far worse books out there. If this review is short, it's only because the book has exhausted me so thoroughly that I can't say much about it."}, {"userName": "papalbina", "userReviewDate": "Jul 27, 2012", "userURL": "http://www.goodreads.com/user/show/4127748-papalbina", "userReview": "Bookdepository and Amazon set the release date to April 22, 2014. 2014?? NOO!!!!November 2013: New release date for April 2015? WHY??? T_____T"}, {"userName": "Marta Álvarez", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/23281591-marta-lvarez", "userReview": "Mejora en (casi) todo lo que fallaba en la primera parte. Sigue sin ser un libro con un ritmo trepidante pero, aunque algo pausadamente, no dejan de suceder cosas interesantes. La trama es más compleja, más interesante, y sobre todo, más variada. Es un libro largo, sí, pero porque pasa por muchos estadios. \"Variado\" es la palabra: variado en personajes (aunque sin abandonar nunca a su protagonista), variado en tipos de trama, variado en escenarios... Algo que eché de menos en Seraphina fue precisamente eso: variedad. Se notaba que Rachel Hartman había creado un mundo detalladísimo, y sin embargo apenas vimos una pequeña parte. Quizás el mayor fallo que veo en esta bilogía sean sus descripciones DE TODO (aunque sea innecesario) pero tengo que admitir que el desarrollo de la ambientación (su mitología, las diferencias entre unas culturas y otras...) es de lo más atractivo y sorprendente."}, {"userName": "Praiz Sophyronja ", "userReviewDate": "Feb 05, 2014", "userURL": "http://www.goodreads.com/user/show/21693097-praiz-sophyronja", "userReview": "*I've read Seraphina numerous times before, and I really hope this will be a decent sequel. I admit I do have high expectations if the first book is anything to judge this one by... But I really hope Hartman continued writing as incredibly as she did in the first book!!!*"}, {"userName": "Tabitha", "userReviewDate": "Nov 25, 2013", "userURL": "http://www.goodreads.com/user/show/4446517-tabitha", "userReview": "Shadow Scale had a much more complex feel to it then the first book Seraphina. I personally consider these books to be adult fantasy with crossover young adult appeal. Not because they have adult content – they don’t. But because while Seraphina is young she is for all intents and purposes an adult. The first book was closer to being a YA novel with a simpler plot while Shadow Scale toed the line for me towards epic fantasy with its much slower build and deeper world building as well as a broader scope to the plot. It pulled in several nations, peoples, cultures, religions and really tried to give you a “bigger picture” type of story rather then the one character focused story that the first book did.Enough characters to fill a box of chocolatesShadow Scale has a ton of new characters. Much of the slow build during the first half of the book is Seraphina gathering these characters together. She sets off on a quest of sorts wanting to gather the other half dragons like herself and bring them back to her country to hopefully assist in the war that has just started. While I found each new character interesting this section of the book as I mentioned is very slow but still very rich in world building. Readers that enjoy savoring epic fantasy would likely enjoy this novel as a lighter epic fantasy.Hooray romance takes the back burner for onceI was so pleasantly surprised by how the romance wasn’t the central focus of this book, it wasn’t even a secondary focus but more like an extra plot point. It made it so much more refreshing to read. I enjoyed the romance between the characters in the first book but I liked how here it didn’t get in the way of the serious things that Seraphina and Prince Lucien both needed to do. Indeed I have to say that the way it ended really surprised me. I do so enjoy being surprised.Bringing it all togetherAs there were various subplots going on there was still a central antagonist going up against Seraphina and it was very personal. This part of the plot was both a positive and a negative for me. I’m curious to see how other fans will take to that part of the story. In the end the author did a great job of pulling everything together and wrapping everything up for me.Thoughts on the audio narrationThis one was dual narrated by Mandy Williams and W. Morgan Sheppard. Mandy Williams was also one of the narrators of the first book Seraphina. I definitely enjoyed the addition of W. Morgan Sheppard who wasn’t the second narrator in Seraphina. They both did an excellent job here with the narration especially considering the number of characters. The narration was smooth and the voice acting superb. I did like the narration on this book more so then the first but still recommend both."}, {"userName": "Dylan", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/7716112-dylan", "userReview": "Oh hey! Haven't written a review in some time, so bear with whatever comes next. Also this is actually 3.5/5I absolutely loved Seraphina. The writing was exquisite, the descriptions were captivating. I was almost immediately transported into a very well constructed and intricate world. The characters were unique, and intelligent. The relationships were very compelling, especially the Seraphina-Orma one.All of these things can be said again for Shadow Scale. In fact with Seraphina traveling in this one, there was even more amazing world building. I got the impression that the writer was just showing us parts of a world that she had created. There is so much detail (different languages, cultures, customs, food, religion), I feel like this is an actual place somewhere.Sadly though, I had many problems with this book. Most of all was the plot. This book focused on the plot more than the first book. And yet the story arc felt much weaker than it was in Seraphina. It was info dumpy at the beginning, with all the new characters and places. It was a little repetitive at times. And although I liked the end. I didn't like how we got there. Things came about very quickly in the end, in a very rushed and strange way. Hartman didn't make me believe it, didn't explain it enough, and it felt oddly cliched.I cannot tell you how much I wish this was a trilogy. There would have been more time to know characters, develop relationships, and end strongly. I also felt like the magic/fantasy aspects weren't explained enough. It would have been great to be able to spend more time on that, because I loved what I did know.Another thing I was missing, was development in relationships that happened in Seraphina. Not just the romance, but other connections were lacking. Mostly because of the extensive traveling. As you can tell I had quite a few issues with Shadow Scale. But I did enjoy the writing, and I do love this world. I just wish I had more time in it. I look forward to see what Hartman writes next."}, {"userName": "Justine", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/18656418-justine", "userReview": "3.5 stars \"However strenuously the world pulls us apart, however long the absence, we are not changed for being dashed upon the rocks. I knew you then, I know you now, I shall know you again when you come home.\"Like its predecessor Seraphina, Shadow Scale has some lovely lines in it. Hartman can clearly write. Unfortunately this book as a whole isn't nearly as satisfying as the first one in the duology. Shadow Scale is very long, which isn't necessarily a bad thing, but even with the extraordinary length certain plot elements that were important and left unresolved in Seraphina aren't really given much space to be dealt with sufficiently in this book. The main story here has a very slow start and then everything is brought to a finish all too quickly at the end.The biggest problem really is that Seraphina is so good it sets an almost impossibly high bar for the sequel. While I'm glad I read it, Shadow Scale just doesn't have the same magic."}, {"userName": "Elaine", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/1779637-elaine", "userReview": "I was snooping around Ms Hartman's blog hoping to find some awesome stuff and my efforts paid off. LOOK WHAT I UNCOVERED. MY LIFE IS COMPLETE.2015?!?!Hello?! I need dragons in my life!I know that Seraphina didn't end on a cliffhanger but still, I was totally expecting a 2013 release date for the second, only to find out that it's going to be released next year.Oh well, I guess I can wait if the second is going to be every bit as epic as the first (or even better!). I'm also really digging the name <3When this book is finally going to be releasedIn the meantime"}, {"userName": "Patry Fernandez", "userReviewDate": "Jan 13, 2016", "userURL": "http://www.goodreads.com/user/show/21837756-patry-fernandez", "userReview": "Reseňa en el blog -> http://thewordsofbooks.blogspot.com.e...Terminado! ! La historia y el mundo creado por Rachel al igual que en Seraphina me fascinó. Pero al contrario que el primer libro este no llegó a encantarme, y en el final ocurre algo (que no voy a decir) pero me dejó bastante descontenta ya que no me lo esperaba y sigo sin entenderlo del todo."}, {"userName": "Deniz", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/8552841-deniz", "userReview": "2.5 StarsGosh, I don't even know how to begin to review this one!Review: Shadow Scale is a really difficult one to review for me. I am rather heartsore for two reasons:I had huge expectations and somehow they were not met, the other being that this is a well written book, but if you take a look at my rating, I didn't much enjoy it.I adore Seraphina. I couldn't wait for it's sequel, I was convinced that there was no way that I wouldn't like it. But sadly though, I don't loath it, it just didn't work for me. It took me ages to pinpoint what it was actually. Because there are many things that are really good about Shadow Scale. So if you would add it all up this should be great, right? Uhm, wrong. And this fact actually made me think about what makes one like a book? What makes me, specifically enjoy reading one book and not the ohter? Before I go all geek philosopher let's take a look at this particular book.The writings style is beautiful. It is just as I expected. Hartman is an extremely talented writer. Her prose at times feels like poetry. There is a great sense of humour to the characters, which made me smirk, there is a wonderful eye to detail when it comes to descriptions. I enjoy her prose and I am looking forward to hopefully many many more books from her.The world building is exquisite. I adore the quirky and slightly weird world Hartman created. It's unique and really interesting. But there were times when the extensive world building felt more like being dumped on me than elegantly woven into the story, like it was in Seraphina. And while I adored Serphina's mental garden in the first book, for some reason it grated on me in this one. Why? I honestly don't know. I thought about it and I can't explain why, only that it felt more and more tedious, made the pace of the story slow down even more. And at times I just didn't get why Hartman added it. It didn't add to the story, in fact I felt it distracted me. It just didn't work for me.The character building is well done. Again, I didn't expect anything else. There is another rather big cast added to this one. And they were done meticulously. Maybe a tad to meticulous? It is just like in Serphina my favorite part of the book.The plot is probably the biggest let down actually. This is slow. And I mean slow. Look Seraphina was quite slowly paced, there is a lot of world building, tons of details and character building- but I didn't care one bit. Shadow Scale on the other hand felt like a chore to read. It's way to slow paced for me. It took me ages to get into it, well actually I never really did. Towards the end some of the things that happened were just not in character of the MCs, they made no sense to me. Which was rather annoying, then let's not even talk about the odd solution of the romance.... It just, well beyond unsatisfying? It made me wanna throw my kindle, actually. How did Hartman go from doing one of the sweetest love connections to just appalling?! Honestly I more than dislike the end of the series. It wasn't just disappointing, I mean I care for Seraphina, a great lot, I read over a thousand pages about her, and THAT end left her with what? What was the point of the journey exactly? I don't need a HEA but what was that? It's beyond depressing, it's worst case scenario on so many levels....My biggest issue with Shadow Scale though: after reading Seraphina I had certain expectations. Which clearly weren't met. But I guess I could have lived with them... But the elements that I loved so much in Seraphina were no where to be seen in it's sequel. Namely the connection between Kiggs and Seraphina- gone. BUT most importantly the music. I adore Hartman's description of all the musical bits, Serphina's feelings, it's meaning to her... All of it. It's some of the most beautiful writing I ever read. In Shadow Scale there is nothing about Serphina's music - at all. It makes no sense to me, simply because it is supposed to be one of the most important things to Seraphina. Instead I was put through the tedious mind garden excersise- why chose that? I am not quite sure why Hartman went that way. All I know is that looking at the two books, both well written one- moved me to the core of my heart the other really didn't.So what makes one like a book and not another? I guess this will be an eternal question with little answer. Some books just work for me, others just don't....But in the case of this series one spoke to my heart, the other just... well, it just didn't. So despite the great writing, the amazing world building and endearing character building- there was something missing in Shadow Scale- a spark, something that resonates with me... And I can't tell you how much I wish it would have had it."}, {"userName": "Jaylia3", "userReviewDate": "Feb 05, 2015", "userURL": "http://www.goodreads.com/user/show/1794273-jaylia3", "userReview": "With its logic-driven shape-shifting dragons, arcane saint-filled religion, and music permeated, culturally rich, Medieval-like setting, Seraphina by Rachel Hartman is easily of my favorite books of all time. I love its sequel, Shadow Scale, almost as much.The world building continues to be among the most wonderful I’ve encountered. In Shadow Scale, Seraphina is on a quest to collect other half human/half dragons like herself, which takes her away from her homeland of Goredd and into the surrounding countryside. She travels around three human kingdoms, Ninys, Samsam and Porphyry, each with its own history, culture, landscapes, politics, traditions, and relationship with the dragons, and all so vividly imagined that I feel I’ve walked through those lands myself. Seraphina also spends time in Tanamoot, the mountainous home range of dragons, where the immense ash-scented reptiles soar through the skies and lumber on land in their natural forms. A lot of things introduced in the first book are explained further in Shadow Scale. During her journey around the kingdoms Seraphina discovers more about the origin of the saint based religion that all the humans have some connection to, though it’s interpreted with interesting differences in the various lands she visits. She also learns more about the many forms and unique abilities of her fellow half dragons, and each of the curious beings in her mental garden plays some role in the story.Shadow Scale opens with a Prelude you can skip if you’ve recently read Seraphina. It goes over information from the first book that readers might have forgotten, but because it’s written as if it’s by someone living far in the future, long after the events of both books, there were a few bits of implied information about how Shadow Scale ends that I would have prefered not to know, though they weren’t major spoilers. My only complaint about Shadow Scale is I wish there was more. The resolution of the triangulated relationship between Glisselda, Kiggs, and Seraphina is bold but rushed over right at the end and not completely satisfying. I also felt that with a little more time some of the individual powers of half dragons could have been put to more use--I had hoped the soul or mind animated mechanicals shy Blanche surrounds herself with could have played more of a role in the plot. And at the end of the story I was left wanting to know more about what happens with the people and dragons back in Goredd after the resolution of the conflict, since we hadn’t spent much time there or with any of them. Basically I love the series so much I greedily want another book. It seems almost wasteful to have imagined such a graphic dimensional world only to abandon it, but I believe the series is a duology that concludes with Shadow Scale. Perhaps Hartman wants to leave her readers with things to think about or envision for themselves, which isn’t a bad thing. Both Seraphina and Shadow Scale are so rich and immersive I know I’ll be re-reading them again and again.Though I've already ordered my own hardback copy, I read an advanced review ebook copy of Shadow Scale from the publisher through NetGalley. Review opinions are mine."}, {"userName": "Jen (The Starry-Eyed Revue)", "userReviewDate": "Aug 15, 2012", "userURL": "http://www.goodreads.com/user/show/4659650-jen-the-starry-eyed-revue", "userReview": "An ARC of this title was provided by the publisher in exchange for an honest review.This review can also be found at The Starry-Eyed Revue, where for a limited time, you can enter to win a copy!Considering it had been nearly three years since I first read Seraphina, I decided a re-read -- or re-listen, in my case -- was necessary. It's amazing how much you can forget in that length of time and yet still remember just how much you enjoyed the story the first time you experienced it. However, once I returned to this world of dragons and music, I found that it was like I'd never left it.I must admit, though, that after listening to Seraphina prior to picking up this sequel, the pacing of Shadow Scale did seem a bit slow. It definitely picks up, but it required pushing through the first third or so of the novel to get to that point. But once it does, it's twice as engaging as the previous installment. And just as full of surprises.There are far more characters to love and loathe in this sequel -- dragons, half-dragons, and humans alike -- but I found that I missed some of my favorites because of Seraphina's separation from them while on her quest to find others like herself. And I found myself missing some of the characters I'd only just come to know as they morphed right in front of my very eyes. Someone Seraphina had once called a friend is now set on destroying her, using the very people she cares about the most in order to do so. It makes it nearly impossible for Seraphina to trust anyone but herself. But Seraphina is more powerful than even she knows, besides the fact that she's quite intelligent and remarkably observant. She can outmaneuver even the cleverest adversary once she puts her mind to it, which is exactly what the situation warrants in the conclusion to her story.Shadow Scale felt less about dragons themselves and more about politics and alliances and avoiding an all-out war, but it was such an intriguing end to the story, leaving Goredd and seeing how the rest of the world looked upon dragonkind. It was also a bit of a relief to see some of the loose ends in Seraphina finally tied up, including the romance and Orma's exile. The ending was maybe a little bittersweet, and not just because I found myself unready to say goodbye to these characters, but that's what I love about these books: Hartman writes the story as it needs to unfold for these complicated characters and not just the way we want it to be written for them. Her ability to craft such a complex world, full of characters with so much depth that you'll never find the end of them, still has me in awe.GIF it to me straight:"}, {"userName": "Argona", "userReviewDate": "Dec 13, 2016", "userURL": "http://www.goodreads.com/user/show/349639-argona", "userReview": "Review Coming Soon..."}, {"userName": "Misty", "userReviewDate": "Dec 15, 2012", "userURL": "http://www.goodreads.com/user/show/1124284-misty", "userReview": "Prev: Wait, now it's 2015?! *cries*Then: Obviously I was going to love this. OBVIOUSLY.Review to come."}, {"userName": "ALEXA", "userReviewDate": "Jul 29, 2014", "userURL": "http://www.goodreads.com/user/show/4988733-alexa", "userReview": "FIRST THOUGHTS: I love that Hartman expanded this world, allowing Seraphina to tread a dangerous, exploratory path. There is a lot that happens in this book, and it all ends with a satisfactory conclusion. However, it did have a pattern of alternating between engaging and... Less engaging, which made it flow a little less smoothly as a reading experience. Still a good story though.REVIEW:(Originally posted on Alexa Loves Books)It was a true pleasure to be able to go into Shadow Scale right after my reread, as I was still completely enamored with the world, the characters, the story that Rachel Hartman has brought to life in these novels. This novel basically picks up a little after Seraphina ends, and tells of two things in particular: Seraphina's journey to find other ityasaari (half-dragons) and the way the conflict between dragons and humans unfolds. Sounds like a sophomore novel to dazzle, does it not? The world-building, lore and characterization are certainly impressive, as Hartman combines what readers are familiar with from Seraphina with new details in Shadow Scale. I particularly loved getting to know more of the ityasaari, since the lot of them each had an individual talent that set them apart from the others. And in terms of plot, Shadow Scale was great! There was the brewing tension that heralds a war, the subtlety of figuring out who could be trusted and who were enemies, the formation of new friendships and allies, and even just the barest hint of romance. But I clearly had an issue, and it's all got to do with the pacing. While it was fun to see Seraphina venture out of Gorredd to find the ityasaari, too much time, I feel, was spent chronicling her journey. There are certainly some significant moments as she finds, befriends and cajoles each new ityasaari into joining the cause; but for the most part, it could have all been condensed. The pacing does pick up, however, when Seraphina is faced with the main conflict - the war between dragons and human involvement in it. And personally, I like how it ends!In spite of my singular reservation, Shadow Scale is good. Hartman tells the rest of Seraphina's tale beautifully, and readers will be thrilled to be able to learn what becomes of Seraphina, her friends, the dragons and the kingdom of Goredd. It is certainly worth picking up and reading, especially if you loved Seraphina."}, {"userName": "Raph♛", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/15747715-raph", "userReview": "[BRING ON THE CHOCOLATE!!!!!!!!!!!!!because,you knowyeah right (hide spoiler)]"}], "description": "Seraphina took the literary world by storm with 8 starred reviews and numerous “Best of” lists. At last, her eagerly awaited sequel has arrived—and with it comes an epic battle between humans and dragons.The kingdom of Goredd: a world where humans and dragons share life with an uneasy balance, and those few who are both human and dragon must hide the truth. Seraphina is one of these, part girl, part dragon, who is reluctantly drawn into the politics of her world. When war breaks out between the dragons and humans, she must travel the lands to find those like herself—for she has an inexplicable connection to all of them, and together they will be able to fight the dragons in powerful, magical ways. As Seraphina gathers this motley crew, she is pursued by humans who want to stop her. But the most terrifying is another half dragon, who can creep into people’s minds and take them over. Until now, Seraphina has kept her mind safe from intruders, but that also means she’s held back her own gift. It is time to make a choice: Cling to the safety of her old life, or embrace a powerful new destiny?", "title": "Shadow Scale\n      \n          (Seraphina #2)", "url": "https://www.goodreads.com/book/show/16085457.Shadow_Scale__Seraphina___2_", "average": 3.73, "cover": "https://images.gr-assets.com/books/1405355942l/16085457.jpg", "reviews": 2249, "authors": [{"url": "https://www.goodreads.com/author/show/357601.Rachel_Hartman", "name": "Rachel Hartman"}], "type": ["Fantasy", "Young Adult", "Fantasy", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/16085457-shadow-scale", "http://www.goodreads.com/book/show/28523507-escamas", "http://www.goodreads.com/book/show/23280186-shadow-scale", "http://www.goodreads.com/book/show/29934863-escamas", "http://www.goodreads.com/book/show/19549841-seraphina", "http://www.goodreads.com/book/show/15715106-the-audition", "http://www.goodreads.com/book/show/33123849-tess-of-the-road", "http://www.goodreads.com/book/show/666174.Amy_Unbounded", "http://www.goodreads.com/book/show/37559126-amy-unbounded", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}