{"ratings": 225, "userreviews": [{"userName": "Ruzica", "userReviewDate": "Oct 16, 2013", "userURL": "http://www.goodreads.com/user/show/11922312-ruzica", "userReview": "Wow, these hungarian writers are really something! This book made me promise myself I'm going to read more hungarian literature in the future (Peter Nadas here I come). Peter Esterhazy is an amazing author and his writing is so profound, so striking (perhaps even erotic) and it deserves much more attention than it already has. I have to say I have no clue whether he's popular in Hungary; but damn, he should be popular everywhere.I don't know why, but when I first picked up this book, the style reminded me of Herta Muller's writing, but when I got into it, I realized that the atmosphere Esterhazy creates is completely different from Muller's gloomy tone. Everything in this book is witty and charming and it's sort of inviting you to push your boundaries towards something beautifully obscene.Anyway, it's a story about women and author seems to be in love with all of them. At first you get the impression that author is talking about his lover, but as story is revealed you realize that he is talking about god knows how many women. Every story is a little ode to his and hers love."}, {"userName": "Mohacsi Gergely", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/10004036-mohacsi-gergely", "userReview": "Hozzá lehetne tenni a ciméhez hogy \"...és egy férfi,\" de akkor úgy hangzana, mint egy francia film, csak forditva. Az is jó (t.i. a film), csak másképp. Ez viszont a századforduló legszebb (illetve nem, inkább leglebilincselőbb, legelgondolkodtatóbb, legszórakoztatóbb) szerelmes könyve. Például azért szeretem nagyon, mert kiderül belőle az is, hogy ez a nő (férfi) dolog első (másod) sorban nem a nemek (társadalom) kérdéseinek üres boncolgatásával, hanem a szavak (test) által válnak mindenkit érintő és mégsem fontos mindennapi dolgokká."}, {"userName": "Floris Meertens", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/40570954-floris-meertens", "userReview": "Wat voor houvast heb ik in de wereld als zelfs Hongaarse schrijvers me kunnen teleurstellen? Gelukkig heb ik nog altijd Krasznahorkai...Het concept van \"Een Vrouw\" vond ik aanlokkelijk. Korte hoofdstukken die elk beginnen met dezelfde soort zin: \"Er is een vrouw die me haat/Er is een vrouw die me liefheeft.\" Ik hoopte op boeiende karakterschetsen en scherpe analyses van de relaties tussen de ik-persoon en de vrouwen. De vorm is sterk, de wisselwerking tussen haat en liefde is er een die misschien niet vernieuwend is, maar nog niet echt zo is gebruikt. Hoge verwachtingen dus.Maar wat volgt zijn 97 hoofdstukken over vrouwen met amper persoonlijkheid. Hij schetst vage beelden met saillante details die ergens soms betekenis lijken te hebben (of die wilde ik vinden), maar de herhaling zorgt voor een lege, onpersoonlijke ervaring. Na de zevenendertigste beschrijving van volle vrouwendijen haak ik ook een beetje af. Esterhazy lijkt zich bewust dat de gimmick snel oud wordt, zo ongeveer rond hoofdstuk 34. Stopt hij er dan mee? Nee, hij maakt kleine, verwaarloosbare veranderingen aan in de zin, en vindt dat genoeg. Of de vrouw hem haat of liefheeft staat ook los van wat hun relatie, althans, zo kwam het bij mij aan. Ik denk dat dat de bedoeling was, maar dat betekent niet dat ik het geslaagd vind.Erotiek, dat is wat liefde en haat bindt. En dat is waar dit hele boek over gaat. Na de twee hoofdstukken over zijn moeder snapte ik het: Esterhazy is de hedonistische romanticus, hij verlangt naar de verlossing van het verleden, die van voor de geboorte. Hij probeert een weg terug te vinden naar de moeder, en zoekt daarom constant naar een nieuwe flamoes (dit is ook simpelweg het minst sensuele woord ooit). Liefde en lust zijn moeilijk te definiëren en over te brengen, en het proberen met surreële alledaagsheden is een optie. Maar het surreële verliest haar kracht, haar unieke effect, als het keer op keer herhaald wordt, met amper variatie. Bij het eerste hoofdstuk was ik geboeid, bij het vijfde snapte ik waar het heenging, bij het vijfentwintigste was ik verveeld. Op een gegeven moment bedacht ik dat elk hoofdstuk misschien ging over dezelfde vrouw, maar dat was denk ik iets te vrij gedacht.Om niet geheel negatief te zijn, er waren goede hoofdstukken. Sommige waren humoristisch (die over de communismehater), sommige waren ontroerend (Op mijn boekenlegger heb ik de volgende hoofdstukken genoteerd: 69/70/73/77/80,85,88,93. Het eind van het boek is dus veel sterker). Voor de mensen die het centrale concept van dit boek veel te heteronormatief vinden, hoofdstuk 93 gaat over een man. Op de achterkant van de kaft stond iets te confronterend: \"Herkenbaar voor ieder die ooit heeft samengewoond.\" Misschien dat het daaraan lag..."}, {"userName": "Dominika Braná", "userReviewDate": "May 18, 2016", "userURL": "http://www.goodreads.com/user/show/53653684-dominika-bran", "userReview": "Toto bola kniha, ktorá inšpirovala Doru Kapralovú k napísaniu Zimnej knihy o láske. A keďže som po tej Kapralovej ešte nejaký čas čučala uznanlivo do steny, dostala som raz toto na narodeniny (lebo kto vie dávať darčeky, ten vie). Back to the roots.Je to o jednej žene vo všetkých možných podobách, polohách, zo všetkých možných perspektív a vlastne i o tom, o čom sa nehovorí. No a o láske, samozrejme.Zase čosi iné, čo asi neulahodí keleovo-vasilkovským fanúšikom, lebo že je to divné, ale poteší spústu tých, čo to \"divné\" práve cielene vyhľadávajú.No a môj dojem by sa dal vlastne zhrnúť aj v jednej vete:Chcela by som byť raz pre niekoho Jednou ženou."}, {"userName": "Germano", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/9326060-germano", "userReview": "Difícil descrever esse livro que, com tanta maestria, fala de um tema tão difícil — e também tão batido — que é o das relações afetivas entre homem e mulher. A mulher, a do livro, no caso, não é um uma, mas várias, que se desdobram em charmes, idiossincrasias, belezas, manias. A escrita, mesmo sendo traduzida, é de uma precisão vertiginosa, mesmo ao tratar de temas inefáveis, como a atração, como os afetos."}, {"userName": "DilanAc", "userReviewDate": "Aug 10, 2016", "userURL": "http://www.goodreads.com/user/show/51516064-dilanac", "userReview": "Very intriguing series of 97 vignettes that almost all begin with \"There's this woman. She . . .\", They vary in length from a few sentences to a few pages and they all deal with the conundrums of relationships from sex to jealousy to attraction. There is really no narrative arc at all which felt refreshing for a change. Definitely worth a re-read for me.\""}, {"userName": "Krisztina", "userReviewDate": "Oct 03, 2015", "userURL": "http://www.goodreads.com/user/show/26424241-krisztina", "userReview": "I don't get why this is considered \"literature\""}, {"userName": "Gijs Grob", "userReviewDate": "Sep 02, 2012", "userURL": "http://www.goodreads.com/user/show/544212-gijs-grob", "userReview": "Meer dan tweehonderd odes aan een (?) vrouw. Literair, maar prachtig eerlijk met gevoel voor detail en het triviale."}, {"userName": "Fernando Hisi", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/25575064-fernando-hisi", "userReview": "Amor e ódio por 97 mulheres que são todas e nenhuma. Rapido e cheio de voadoras."}, {"userName": "gbkMnkii", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/25441240-gbkmnkii", "userReview": "I don't know what was that but I think this is not literature for me. These are just sentences without conception, chaotic, without humor. Sorry EP."}], "description": "In ninety-seven short chapters Péter Esterházy contemplates love and hate and sex and desire from the point of a view of a narrator who considers himself a great lover, a man who may (or may not) be in love with all the women in the world.", "title": "She Loves Me", "url": "http://www.goodreads.com/book/show/441145.She_Loves_Me", "average": 3.76, "cover": "https://images.gr-assets.com/books/1174795435l/441145.jpg", "reviews": 12, "authors": [{"url": "https://www.goodreads.com/author/show/11573.P_ter_Esterh_zy", "name": "Péter Esterházy"}, {"url": "https://www.goodreads.com/author/show/1991962.Judith_Sollosy", "name": "Judith Sollosy"}], "type": ["Fiction", "Short Stories", "Cultural", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/441145.She_Loves_Me", "http://www.goodreads.com/book/show/21421436-egy-n", "http://www.goodreads.com/book/show/16006619-jedna-ena", "http://www.goodreads.com/book/show/9518076-uma-mulher", "http://www.goodreads.com/book/show/11902996-een-vrouw", "http://www.goodreads.com/book/show/441142.Celestial_Harmonies", "http://www.goodreads.com/book/show/589454.Helping_Verbs_Of_The_Heart", "http://www.goodreads.com/book/show/120041.The_Book_of_Hrabal", "http://www.goodreads.com/book/show/7395907-not-art", "http://www.goodreads.com/book/show/11362812-jav-tott-kiad-s"]}