{"ratings": 47587, "userreviews": [{"userName": "Petrik", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/59458347-petrik", "userReview": "4.5/5 starsColor me impressed, just the first book in the Liveship Traders trilogy alone is already better than the entire Farseer trilogy.Don’t get me wrong, the Farseer trilogy certainly has its charm but the third book of the trilogy, Ass Quest, was a massive disappointment for me. Fortunately, that didn’t stop me from giving Hobb another try because this was just utterly fantastic.Ship of Magic, the first book in the Liveship Traders trilogy—which is also the second out five subseries within Hobb’s gigantic Realm of the Elderlings series—is a completely different book from Fitz’s first trilogy. It contained a new storyline, revolves around a completely new cast, new magic system, and the story took place on a completely different area from Fitz’s storyline. In fact, other than a few familiar places and event mentioned, such as Six Duchies and Red Ship War, there seems to be absolutely no correlation between this book and the Farseer trilogy. Taking place south of the Six Duchies, Ship of Magic focused around a variety of casts with their own agenda and motives in the conflicts of persevering faith, family, and gaining the liveship, a rare ship that can be quickened (brought to life) only when three family members from successive generations have died upon their deck. The different location also provides a great expansion to the world-building element for the series that Hobb has created previously in the Farseer trilogy.\n\n“The man who worries about what will next be happening to him loses this moment in dread of the next, and poisons the next with pre-judgement.”\n\nIt took around 100 pages for me to get used to the characters and the flow of the story but after that, everything ended up being a smooth sailing experience. Same as Hobb’s previous trilogy, this is still a totally character driven book and the main plot moved at a really slow pace with the characters development taking the highest priority. What differs this book greatly from the Farseer trilogy however is the fact that it’s written in third person multi-POV. Whether you love him or not, Fitz is a well-written character and Hobb did a spectacular job in fleshing out his and all the major side characters’ personality even when the narrative was told solely from Fitz’s perspective. However, as great as Hobb did, if we truly want to know all the characters’ true thoughts and feelings, multi-POV is always the best plot device to do it. Hobb is truly a brilliant author, it doesn’t matter whether it’s first person or third person perspective, she knows how to write and make her characters felt realistic, complex, and compelling to read; even when some of the characters were despicable as dog shit (Malta). I forgot the exact numbers but readers get to follow the storyline from the perspective of more or less thirteen characters and I found them all highly engaging and addictive to read (including Malta’s). It was hard to choose a favorite POV here (excluding Malta) when they are all superbly well-written, but I think it’s safe to say that out of all of them, Wintrow was definitely my favorite one. Every character had a magnificent character development, in personalities and relationships between the cast, but Wintrow’s storyline simply excelled above all the others. Just from the first book alone, I already love his POV more than Fitz’s.\n\n“I’ve just been living from day to day. Waiting for something or someone else to change the situation.” His eyes studied her face, looking for a reaction to his next words. “I think I need to make a real decision. I believe I need to take action on my own.” \n\nPirates, amazing ensemble cast, serpents, sentient ships, great actions (when it’s there), Ship of Magic is a superb start to a trilogy. At this point, if someone told me that Hobb is actually a psychologist, I will believe them due to how great she is at characters studies. I absolutely can’t wait to continue to the sequel and I highly recommend this to anyone who’s looking for a great character driven fantasy books.Picture: The Liveship Traders by Marc SimonettiYou can find this and the rest of my Adult Epic/High Fantasy & Sci-Fi reviews at BookNest"}, {"userName": "Bookdragon Sean ", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "This was good, but it wasn’t as good as Robin Hobb's Farseer books. Fitz is an excellent narrator, and an excellent focal point for a series, though this uses several point of view characters. Some are great and some are, unfortunately, as dry as dust. Wintrow was by far my favourite character in this series. He is torn between two lives. As a young boy he was sent away from home and raised as a priest; it’s a life he has gotten used to, but circumstances demands that he returns to his former life: it is one of sea faring hardship, which is something he is not remotely accustomed to. He never had the chance to become a sailor, though he would have if he wasn’t taken away. He is now ineffectual and scribe like. His hands are soft and stained with ink. He is not a hardened sailor, so when his farther orders his return he is forced to toughen up and become something he is not. Wintrow is, naturally, reluctant to accept his new life; however, when he begins to discover his magical bond with his ancestral liveship, he realises he may have some mettle after all: “For the weakest has but to try his strength to find it, and then he shall be strong.” Conversely, Althea views the life on the sea as a thing of wonderment. Unlike Wintrow, she longs for the open ocean and planks beneath her feet. She wants to be aboard her family’s liveship, but the chance has been taken away from her, and handed to the young Wintrow. Resentment quickly forms. But who can blame her? She has spent her life longing to take control of the magical vessel that would make her a fortune on the open sea.This is both painful and soul destroying because in the wood of the ship is a magic that speaks to her blood; this is no simple attachment, but something powerful and innate: it calls to her and beacons her aboard. The liveship’s bond to their owners in a deep and magical way; thus, when she is separated from her ship, Althea goes on a long a perilous journey to get back what was rightfully hers to begin with. Let the adventures begin!  Some  good characters Althea and Wintrow were two very different characters; they contrast well and the dynamic between the two is tense. On the other hand, Veronica Vestrit (Althea’s mum) is a dreadfully dull point of view character. Her life is, simply put, boring. She is not badly written; she is just mundane and uninteresting. Her narrative is vital for the overall story, but her chapters are tiresome. I found myself skimming entire paragraphs because of their triviality. For example, the rest of the characters were undergoing an identity crisis or they were in extreme danger, meanwhile Veronica was evaluating her household budget.Everything else worked really well. I think the idea behind the liveships is great, and it really adds some depth to this fantasy universe. I love the way Robin Hobb has written a new trilogy set far away in her already existing fantasy world. This book was a good opener to the trilogy and it really sets the tone for what is to come. Of all of Hobbs books, I do think this one would make the best television drama.  The Liveship Traders 1. Ship of Magic-  A seafaing 3.5 stars  2. The Mad Ship- A tumultuous four stars.  3. Ship of Destiny- A cresting four stars"}, {"userName": "Marie", "userReviewDate": "Nov 29, 2011", "userURL": "http://www.goodreads.com/user/show/1200328-marie", "userReview": "[After Althea goes off to learn sailing while disguised as a boy (explained in text) she sleeps with Brashen (well, okay, it's clear he's a love interest from the cover copy) while both are impaired. She's concussed and they're both drunk and high, I think. He might be concussed too. It turns out, despite being 'upper class' in this society, and their expectations for women, she's had sex before. The first time when she was fourteen under skeevy circumstances. When she goes home to tell her sister, Keffria makes her get a charm to prevent pregnancy and STDs, assuming her sister is easy. It's the betray of trust that Althea has a problem with, she doesn't think of herself that way. In fact, she's NOT damaged by the experience, and she knows it's supposed to be pleasurable, so she seeks it out herself, occasionally. But it's not a flaw of her character that she's sexually active, and while other characters may not like it, it's never a view condoned by the text. Thought you guys might like that.  (hide spoiler)]"}, {"userName": "Lema", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/18145934-lema", "userReview": "Step aside Pirates of The Caribbean, Robin Hobb is the crowned queen of maritime fiction and she's here to stay!Allow to say that I can't believe I've been putting off starting Robin Hobb's work for the last couple of years just because it's a little bit on the heftier and slow burning side. OH MY GOD I'VE BEEN SUCH AN IDIOT! Well, better late than never and all that rot..I was thinking about saying that getting to this book was worth the time it took me to read through the Farseer trilogy, but I would be lying. I didn't \"go through\" that trilogy, I freaking loved it and enjoyed every dragged out second. So getting to Ship of Magic was not only a reward but a continuation of the wonderful journey I started in the Assassin's Apprentice, and it only gets better and better with every book.First of all, let's be clear that I am not a fan of the sea, I hate ships (urgh just the memory turns my stomach), I don't care for stories with sailors, I do love pirates but maybe once every blue moon I would go out of my way to read a story about them specifically. Well, Robin Hobb just changed my opinion 180 degrees! However, I'll probably still won't think much about them unless those stories were written specifically by her. The atmosphere, the world, the characters, the plot, everything! It's so just immersive so that you feel you are experiencing every setting, feeling and hardship yourself. Bit of warning, it's not a story about pretty ships and hearty adventures in the wide blue ocean, this novel deals of lot of heavy topics regarding family dynamics, inheritance, subservience to the \"man of the family\", slavery, free will, sexism, rape and abuse and many more that are so true to our world's issues today. It's not as flashy as my other favorite fantasy books I've read by Sanderson, Tucker, Gwynne, and others.. Yet it has some of the complexity characteristic of ASIOAF by GRRM, the same darkness I saw in The First Law Trilogy by Abercombie, it's a little quieter and more low key (that's more true of Farseer actually rather than this one) but has the same punches as the best of them. Why I loved it so much? Why, the Characters of course!Captain Kennit probably takes the trophy here, a heartless bastard and a pirate to boot who just happened to do the right thing at the right time, reluctantly and out of sheer dumb luck. His conniving and coldness just serve to make him more interesting, and his interaction with everyone around him is always intrigue-guaranteed, and that ending man! Althea Vestrit is another great character that comes to mind. Spoiled privileged girl who thinks she can do anything because she spent her childhood sailing with her father abroad their family liveship the Vivacia, only to be hit with the cruel reality of life. Her journey and growth were just amazing, she still has a lot to go and I can't wait to see how she'll progress. Speaking of the Vivacia, I've never read about a live ship before, like ever, and that was quite the experience I'll leave it at that!WINTROW! can I hug that precious child and hide him from the world? Is it blasphemy that I think he's much much more interesting and awesome than Fitz ever was? Boy-priest forced into becoming a sailor by has asshole of a father, his arc has probably one of the best character development I've ever read! Vivacia and Wintrow by SephinkaOf course there's a tonload of other great characters that will make you love life or make your skin crawl and then there are a couple that will make you want to bitchslap some sense into them (friggin' Malta that stupid brat!), or just plain smack them into the waiting mouth of a sea-serpent (yes we have those too!!). I was surprise by the strong emotions that Hobb had awakened in me during my read, I won't lie to you it was bloody exhausting! Not to mention all the unsolved mysteries!OK that's enough rambling on my part, every minute I spend babbeling and gushing here is keeping me away from starting Mad ship, so farewell ye scallywags!"}, {"userName": "Kaora", "userReviewDate": "Mar 01, 2014", "userURL": "http://www.goodreads.com/user/show/7983564-kaora", "userReview": "I was a huge fan of Robin Hobb ever since I read her story Homecoming in Epic. And while I loved her Farseer series, this has surpassed those as my favorite books.Vivacia is a liveship, a boat made of wizardwood, that after three deaths of family members on board comes to life. Liveships are the only ships that can make the journey up the river to the Rain Wilds in order to do trade, and are extremely valuable.This book follows several points of view, including a pirate named Kennit, Althea the daughter of the last sailor to die aboard Vivacia, her sister Keffria, her nephew Winthrow, and various others. Some I loved, some I hated.I also really enjoyed the addition to the world she has created in Farseer. While some of the places in the Farseer trilogy are mentioned, this takes place in a different area, and I was fascinated by the magic and depth of this world she has created.To get some perspective, this is an almost 900 page book that I finished in about 5 days. All other books were placed on the backburner to be picked up at a later date, because I could not put this one down.I quickly became invested in the characters, and love watching as events shape their lives and personalities in a very believable way. Even characters I hate with a passion can become favorites in the span of a few pages.Highly recommended."}, {"userName": "Mpauli", "userReviewDate": "Mar 22, 2012", "userURL": "http://www.goodreads.com/user/show/8323869-mpauli", "userReview": "A very, very character-driven book. It reads almost like a classical family drama ala The Buddenbrocks. Despite the plot being rather on the back-burner I pretty much enjoyed all the characters and their development.Maybe not a book for everyone, due to its slow pace but I really enjoyed it, which was surprising, cause I normally prefer plot heavy books."}, {"userName": "Kaitlin", "userReviewDate": "May 25, 2015", "userURL": "http://www.goodreads.com/user/show/19126246-kaitlin", "userReview": "This book was fabulous! I read it as a part of the #TBRTakedown Readathon and as a Buddy Read. It's a little bit on the slow side for sure, but actually it's a very interesting story and the characterisation and development of this was seriously fantastic. It's a slow story which is made up mostly from the introduction of various characters (mostly Traders) and developing our understanding of them and their ways. It's set in a different part of the world from the Farseer Books and it's set on the Cursed Shores (doesn't sound like the nicest area). We join the story when there's a fair amount of outside interference coming into the community of Bingtown, and the Trader families living there are not entirely sure just what to do or how to manage the situation of the new inhabitants trying to come in and change their ways.This is a book which clearly puts the characters at the forefront of the story because despite it being an 880pg book actually only a few very major events stand out. Despite this, there's so much work on defining and understanding the characters that I feel as if I know them all so well now and I can see how they'd react and why they'd react that way in various situations.The world-building of this book is also more unique than that of the Farseer books in that it's largely focused on the sea, and ships at sea, used by the Traders. The old traders of Bingtown are often owners of Liveships which means that they own a ship made of wizard wood for many years and generations and they gradually bond with the ship. Over time this bond develops to the point where the figurehead of the ship will 'quicken' and come to life, filled with the memories and wisdom of all the previous family members it has bonded with.I loved the idea of the Liveships and the way that they become so integral to the town and the trade that they conduct. Not only this, but they are very interesting characters in their own right and the understanding they learn after their quickening can decide how they will react for years to come, being either loyal to the family they are bonded with or turning mad from the grief and savagery introduced to them.We're also introduced not only to the Bingtown Traders in this book but also the Rain Wild Traders who were one of the most mysterious and interesting elements of the book for me. I know that one of Hobb's later series is called the Rain Wild Chronicles and I have to say I am VERY eager to check that one out after what i learned and saw hints of in this book!Pirates and Slavery are big themes within this book and we get to meet one character and crew who have little to do with the Traders other than that they are Pirates who wish to own a Liveship. Everyone knows that a Liveship will only work for the family that it's bonded to and it can easily go mad or savage if it's separated from the family members, but this won't stop the crew who serve under Kennit, a man with high ambitions... The final element I want to point out before diving into the characters is that we also follow some Serpents in this book and we get to see their thoughts as they follow their prey and seek food and wisdom. This section, although initially intriguing, was the only element I feel like I still don't have much interest in, and although we get hints that there's a bigger story ahead involving the Serpents, I didn't find them anywhere near as interesting as the human characters.So, the characters:-- Althea Vestrit - is a young woman who is working on board the Vivacia, her family ship, whilst she waits for it to become quickened. She's a somewhat competent sailor, but she's a little spoiled and she knows that when her father retires or dies she will be the one whom the ship is passed to. She is bold and daring as a character, but she also has some flaws with entitlement and believing she's better than some of the other crew just because she's the captain's daughter. When her father is sick for a long time her story suddenly begins to change pace and things don't always go quite as she may have believed they would, throwing her into some rather tricky situations.I enjoyed Althea's story a lot, although she wasn't my favourite, and seeing her grow as a character and develop more skills and knowledge over the book was very pleasing. She's got a way to go still, but her character was one which grew on me more and more as I got to know her more, and she's a very interesting one to watch.- Paragon - is an old and washed up Liveship whom everyone avoids. He used to be a great Liveship who was proud and happy as any other to serve his family, but something horrible happened and over time he sunk deeper and deeper into madness until he was no longer worth using for fear he would kill the crew he served. He's a sad and forlorn character a lot of the time and he really doesn't have a lot to live for which makes him grumpy and distrustful. I really enjoyed that fact that the ships themselves had pov's in this and that we got to see things from their view as it gave a new perspective on many of the situations. Paragon is a character whose sections instantly gripped me because he was so different to most things I have read before, and his bitter nature was interesting to follow.- Vivacia - is the Vestrit's family Liveship and she's the ship that Althea and her father have worked for all of their lives. She begins the story before she's quickened, and so the events that go on on the ship still affect her, but she has no voice herself for any but those she's bonded with. Once she does become quickened she finds that things are not quite as she'd always imagined they would be and there's actually a lot more hardship and terror ahead for her than she would have ever believed that the Vestrit's would put her through.Vivacia's pov really was great to see, especially as she has the memories of various past Vestrit's within her. She gives us an interesting outlook, one of a newly quickened ship (unlike the Paragon) and she shows us how it is to be born into the life of a Liveship and the toll that this bond can exact upon her.- Brashen - was Captain Vestrit's (Althea's father's) first Mate and he's a well beloved member of the Vivacia. He's a kind and loyal member of the crew and when he sees things turning sour before him he understands that the best thing to do may be to abandon ship and start afresh. Unfortunately, things are not that simple and he's already entangled in the affairs of the Vestrit's, something which will no doubt continue...Brashen is a friend to the Paragon, and he's also a good ship mate. He knows his job and does it thoroughly and well, and he's also a man of common sense (most of the time). I really enjoyed seeing him on his journey, and I liked the way that he dealt with some of the more difficult situations he was put into, using his intelligence. - Kyle Haven - is Althea's brother-in-law and a member of the Vestrit family only by marrying into it. He's a capable sailor and a decent captain, but he's ruthless and only believes in his way. He's always certain that he knows the best way to handle things, and he's unable to see other's points of view even when the evidence of his mistakes are laid bare before him. He's a stubborn and cruel character and whilst he's a little deserving of deference, he's not as deserving of loyalty and love as he first appears.He was certainly the 'bad-guy' of the book for me and I found him rather detestable at times, however it was a very tense moment whenever he intervened and for that his parts kept me intrigued!!- Keffria Vestrit - is the wife of Kyle and sister to Althea. She's a woman who loves and admires her husband so much that she's become accustomed to deferring to him and letting him have his own way both with her and her family. She's a kind and conscientious character who only wishes that she could please everyone, but when everything starts to go wrong and she's in the middle of two strong wills she has to begin to stand tall herself and come into her own.Keffria's character took longer for me to warm to because at first she seemed a little weak and silly, but as the story went on I saw her too grow and become someone I liked a lot and admired for the actions she took.- Wintrow - is the oldest child and son of Kyle and Keffria. He's a true member of the Vestrit blood whether he wants to be or not and he's been in training to become a Priest of Sa for most of his young life. He believe's strongly in Sa's teachings and the ways of following his God, and he's a soft-natured and gentle young man. He's the character that I think I was most easily connected to early on because of his genteel nature and the way that he approached difficult situations and always tried to do the 'right' thing. He may not have always handled things in the most efficient and productive ways, but he's a very loyal and careful character and he stays firm to what he believes in no matter what he's subjected to so I admired him immensely for that.- Ronica Vestrit - is the mother of Althea and Keffria and the Grandmother to Wintrow and Malta. She's a strong-willed character who's handled the affairs of the family for as long as her husband has been sailing the Vivacia and she's very competent at what she does. She's kind and careful and reputation matters greatly to her so she always tries to keep up appearances and do the best thing for her family.I think she was a character whom I enjoyed a lot as she was tested more because it brought out her more soft and tender side and showed how vulnerable even the head of the family can be. She's always trying to do the thing she sees best for them all and sometimes she gets things wrong or makes mistakes, but I liked her ability to try new approaches when necessary and acknowledge her mistakes. - Malta - is the daughter and second child of Kyle and Keffria and she's a very spoilt young girl. She wants things to be her way and none other and she follows firmly in her father's way of managing things. She's silly and foolish and makes many grave mistakes over the course of the book but she's also young and naive and doesn't fully understand the results of her actions.I found her to be one of the most irritating and yet interesting characters and storylines because she made mistake after mistake and refused to bend or apologise even when she was caught out. Her will is as strong as her father's and grandmother's and she tested her family sorely many times.- Captain Kennit - is the pirate Captain of a ship who desires his own Liveship more than anything. After hearing a prophecy about himself at the start of the book he acts upon what he believes as his right and aims to capture and acquire a Liveship for himself. He's a dark and very cruel man with a skill for manipulation and pain. He desires nothing more than reaching his goals and if he has to be a bloodthirsty Pirate to do so he will, but he's equally a fantastic character whose inner thoughts were great to read.I enjoyed seeing the development of him as a character and learning more about how he worked and planned out his moves. He's crafty, thinks highly of himself, and he uses all of this to his advantage to achieve his aims. Certainly another one to watch! So as you can see there's a range and collection of characters who are all very distinct and yet are connected together in various ways. Hobb's development in this book of these characters leads me to believe that the plot of the next two should be a little faster paced and we will begin to learn more of the other elements of the world, but I a, sure there will still be more development and tests ahead for our characters.Hobb certainly didn't shy away from a more dark and gritty reality in this book. She approaches topic such as slavery and gives great insights into how it would have been to be a slave or slaver and she integrates this into the story in a seamless way, making it a key part of the world and plot. She also manages to involve politics and mystery into the book, making it not only thought-provoking but also tense.On the whole, my favourite Hobb book by far and I hope to start the next one in this series sometime later this month to see what will happen next. A wonderful story and a slow but fantastic book, 5*s - highly recommended!!"}, {"userName": "Bradley", "userReviewDate": "Oct 26, 2014", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "It started slow for me until I realized that nothing much was going to happen until the extended family all had their say. That being said, the plot started weaving and the world started blooming. So many bad things started happening to everyone so slowly that I wondered if I, too, was slowly being boiled alive.That's the effect this novel had on me. It's very long, and its very detailed. If you like immersive fantasy and especially nautical fantasy, then you'll love this.Edit 7/5/16Looking back after years and having read the full trilogy plus a third trilogy after this one, I'm a bit more forgiving of the novel. The final interesting events, the redemption and restoration of the mad ship, the tragedy of the main family, and all the proto-dragons, the leviathans, and the wilds, makes me think much more fondly on the whole storyline. :)"}, {"userName": "Kat  Hooper", "userReviewDate": "Mar 31, 2009", "userURL": "http://www.goodreads.com/user/show/2177891-kat-hooper", "userReview": "2015 re-read Originally read in 1995. Still awesome."}, {"userName": "Amy | shoutame", "userReviewDate": "May 04, 2016", "userURL": "http://www.goodreads.com/user/show/10559838-amy-shoutame", "userReview": "I think this could be the one of the best fantasy books I've read so far this year - I can't wait to see what the rest of this trilogy holds!This series is set in the same world at the Farseer Trilogy and so far I am enjoying it a lot more! Unlike the Farseer books The Liveship Traders follows a larger group of characters - from land to sea we are given a whole host of exciting people to share adventures with.One of our main characters is a young lady named Althea. She lives aboard her families liveship named Vivacia. Once a certain number of generations have died aboard the decks of a liveship the figurehead comes to life - at the very beginning of the book Althea's father dies and Vivacia is freed from her static life. Althea's dream of captaining the ship are quickly taken away by her sister's gruesome husband - it is then Althea's mission to regain the captaincy of her families ship!There are so many other things happening in this novel that I wouldn't be able to explain it all here. I would simply say that if you enjoy fantasy and you are looking for a exciting ride I would highly recommend you pick this one up! Robin Hobb is a wonderful writer and I can't wait to see what happens next!"}, {"userName": "colleen the convivial curmudgeon", "userReviewDate": "Dec 13, 2010", "userURL": "http://www.goodreads.com/user/show/1209800-colleen-the-convivial-curmudgeon", "userReview": "12/21/10I'm about 75% through with this book, and I'm finding it frustrating. As others have said, it's very much a character-based book, and I can dig character-based books if I like the characters, but I'm having a hard time really latching onto anyone that I don't want to smack upside the head. Actually, no, I do like some characters (Brashen and Paragon, for instance) - but the ones I do like we don't seem to spend enough time with, while we spend far too much time with the likes of Kyle and Malta. And I have a love-hate relationship with the shifting perspectives. When I'm slogging through a particularlty annoying or slow perspective, I'm grateful for its end, but there are other times when things are finally get interesting, only for the action to then cut-away from what's going on, and I have to wait 150 more pages to get back to what I was interested in. (And then, when we do get back to it, often time has passed, and so we're not taken back to the moment that had captured me anyway.) So far, I've been reading this book for 9 days. That's a long time for me to take on one book. Part of the problem is that I'm just not really motivated to pick it up. I'm not attached enough to the characters to long for the time when I can pick the book back up, and, sometimes, I even find myself putting it off during my daily allotted reading time. But I don't hate it. Thus far, I would probably rate it 2 stars. And I guess that's what's so frustrating, because I think I could like it more, like it could almost be a book I loved, but it's just not. *shrugs****12/22/10So I finally finished. I was promised some actual character development by the end, and it did happen, of a sort. Also, some stuff came together and there was actually some action. Yay! I wish that the events hadn't been quite so predictable, but at least the last 100 pages or so moved at a better pace.I know do feel the need to continue, when, before, it was more of a \"I suppose I must\", but a lot of this is because nothing gets resolved in this book. It's definitely not a stand alone.Anyway, even though I feel slightly more favorable to the book than I did above, I still feel like it could've been chopped down, a lot of the character set-up was repetitious and tedious, and I can easily see how some scenes could've been combined. I'm still not sure I like any of the more major players, though.1.5"}, {"userName": "Victoria Rose", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/4478323-victoria-rose", "userReview": "JEEBUS I love you Robin ❤️ Full review to come when I have the time to flail properly!Reasons to love Ship of Magic:+ Talking ships+ Mean, handsome pirate captain who sets his skin on fire for angst reasons+ Almost cried 20% in+ Character development like a bossI just cannot COMPREHEND how Hobb is able to make each and every character so multi-faceted?! Like even vile Kyle is doing what he thinks is right."}, {"userName": "Helene Jeppesen", "userReviewDate": "Jul 27, 2015", "userURL": "http://www.goodreads.com/user/show/21992464-helene-jeppesen", "userReview": "If you're looking for a great and original fantasy story with a big set of characters and an amazing world building, then this is it. Robin Hobb is a master at creating suspenseful stories with vivid and interesting characters that you feel a connection to. In this book, you even feel a connection to the ships!What I especially like about Robin Hobb's books is that she makes fantasy accessible to me. I'm not the biggest reader of fantasy, but when I do read it I want to be enchanted with the world. I always am when I read Robin Hobb's books. Now, while I really liked this story and definitely recommend it, I didn't rate it 5 stars. That's because even though I did find the plot very interesting, intricate and just about complex enough, I also felt like some elements of the story became too silly in my eyes. I sometimes questioned what was happening - not because it didn't fit it with the story and the world, but because I didn't see the deeper meaning of it. Sometimes it felt like Robin Hobb used a lot of fantastical elements that you can expect from a story like this, and I guess I just missed the element of surprise. Furthermore, while I did love all the characters (their weaknesses as well), they were written as caricatures, and almost all characters lacked nuance in their behaviour. Either they were the good guys, or the evil ones, and they didn't differ from that place. I would've loved for Robin Hobb to bring it up a notch and give the reader the possibility to actually connect with the bad guys as well, and to give the good guys some weaknesses. In my eyes, that would have made the story even better.Nevertheless, this is absolutely great fantasy which takes you on quite a journey, and I'm very interested to see what will happen to these characters in the upcoming books."}, {"userName": "ijeoma Agbaje", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/16037420-ijeoma-agbaje", "userReview": "It will never cease to amaze me how writers can take words, spin it and make you care about characters that exist only in books, make you care about the words these characters utter, how because of words on a page, you're rooting for a character to be better, stronger, braver. It's awe inspiring and just amazing.Robin Hobb is one of those writers that weaves magic with her words. and it's curious, it's not like her books at least the few i've read have an insane amount of gore or are especially grim. but somehow she's captures the essence of a character so thoroughly. You can feel the selfishness of Malta, the apathy that dictated Keffria life, the strength that was Ronica Vestrit, the confusion peppered with shadows of strength, wisdom and the occasional dose of stupidity that was Wintrow, the stinking mess of insecurity that was Kyle Haven, the fire cracker that was Althea Vestrit and the ships, gosh the ships.....I did feel sometimes descriptions ran a tad too long but having read the Farseer trilogy, i've come to recognise that as signature Hobb story telling..All in all a truly delightful book that does not disappoint."}, {"userName": "Loederkoningin", "userReviewDate": "Jan 27, 2011", "userURL": "http://www.goodreads.com/user/show/4878104-loederkoningin", "userReview": "March 2014: Buddy read with Kat, Damian and Em. Ooooooh, Kennit! If I had to choose between you and Toreth, I'd have to chop myself in half.:')Yep, I still stand by my hysterically enthusiastic review from a few years ago *happy sigh*.__________________________2011 fan squealing below :p: Woot woot..Wow, this trilogy is incredible. I mean, I've re-read these bible-sized books three to four times. And I keep discovering new bits and pieces, new clues in this extremely rich, yes epic, (now that I'm on a superlatives-roll: MINDBLOWING) story. Sure, Hobb's first trilogy was such an intense reading experience. I was quite young when I discovered the first Farseer book and I felt like I could almost crawl into Fitz's skin and live his life with him. And Night Eyes' life! I forgot to study. I started missing my train station. I had to wait for half an hour on the opposite platform, in the cold, not minding. I skipped meals so I could keep reading (which is a highly unusual thing for me to do) etc etc..you get the picture?Now The Liveship Traders trilogy is a little different, mostly because Hobb no longer focuses on one character, but introduces a whole bunch of three-dimensional ones. I know how some reviewers keep missing Fitz, but I personally found these books even more compelling.If you like straight forward fantasy books with a main character going on a quest, Hobb's books are probably not for you. As I mentioned, she introduces many, brilliant characters that are all starring in a spectacular fantasy story including evil, yet charming pirates, tough girls' running from home, a sinister island, sea snakes and a long forgotten tribe, that in reality is very much alive in the blood of some people in Bingtown...I particularly liked that, although Hobb definitely makes sure to add plenty of tragedy, drama and torture to The Liveship Traders as well, she didn't go overboard this time. If Fitz had been a real person, the poor fellow would probably have been dead and buried six times already after everything Hobb cooked up for him. Fans of Fitz will enjoy the references and clues to him, that Hobb included in this trilogy. Although reading her first trilogy before this one is not necessary, I would recommend doing so because, let's face it; you'll probably want to do so anyway afterwards. I just wish Hobb would write a trilogy starring pirate Kennit...hey, a girl can dream!"}, {"userName": "David Sven", "userReviewDate": "Aug 27, 2012", "userURL": "http://www.goodreads.com/user/show/8802423-david-sven", "userReview": "I thoroughly enjoyed this book. Ships that bond with their owners, absorb their souls when they die until they become fully sentient. Fantastic concept. Throw in pirates, slavers, sentient sea serpents, other worldly beings; I was hooked start to finish.This story is set in the same Universe as Farseer, south of the Six Duchies and the Chalced States and approximately three to five years after the Red Ship wars.Early on in the book it became apparent to me that this was a deeper story than the Farseer Trilogy that preceded it. With more POV characters from the get go including non-human characters and mysteries like the special relationship between the deformed Rain Wild Traders who build the ships and the Bingtown Traders who buy the ships with “blood or gold.”Without a doubt, the Liveships themselves are the stars of the show, especially Vivacia. Owned by the Vestrit family, we follow both liveship and family from the death of the third generation captain whose soul (Amna) quickens the ship to full sentience, to the adventures and conflict that follows.The characterisation was excellent, the plot was evenly paced, the story was fascinating. Just be aware that this is not a standalone. It does finish at a good spot I felt, but it is part of a bigger story. I am looking forward to continuing on with the next book in the Trilogy.5stars"}, {"userName": "Xime García", "userReviewDate": "Aug 18, 2015", "userURL": "http://www.goodreads.com/user/show/25821784-xime-garc-a", "userReview": "4.5\nLos hombres crean sus propios tormentos.\nDespués de tantas novelas históricas y de la anormalidad de King, necesitaba una buena fantasía de las que sabía que me iban a gustar. Hobb está dentro de mi top 5 de autores fantásticos (esperen, ni siquiera sé si son cinco. Déjenme contar. Top 4 tal vez). Tengo cierto prejuicio con las historias de barco (mi cuerpo se estremece todavía cuando en 2010 me obligaron a leer La isla del tesoro en la escuela. Lo siento por los fans de Stevenson, pero lo único que me hizo completar esa lectura fue imaginarme todo como si fuera la película de Disney), así que compré este libro con ciertas reservas. Pero se trataba de Hobb, y ella ya me había enamorado con Traspié Hidalgo, así que ¿por qué no arriesgarme? Lo malo fue que antes de leer este libro, conocí a Abercrombie en \nMedio Rey\n y me fue imposible no hallar el tema recurrente de barcos, piratas, esclavos un tanto cansador. Me temo que Hobb no tiene la culpa de esto, pero, de haber sabido que Medio Rey involucraría casi los mismos temas que Las Naves de la Magia (quitando lo de los barcos mágicos oh mi dios, eso requiere un capítulo aparte), tal vez los habría leído con más espacio entre medio. Eso a un lado, la verdad que disfruté del libro. Quizás sea porque extrañaba leer a Hobb. También fue un salto enorme para mí: pasé de la contención de la narración en primera que ella me ofrecía a través de Traspié (con el que me encariñé muchísimo) a una narración en tercera que pasó a abarcar muchos personajes y muchos puntos de vista. Es este tipo de narración el que generalmente me gusta, pero en ella se sintió un cambio enorme para lo que estaba acostumbrada. Muero por volver a encontrarme con Traspié en The Tawny Man.Pero lo cierto es que no me gustó tanto como la trilogía de los Vatídico. Estoy segura que se debe a los barcos (old prejudices die hard, ahre que no, pero más o menos) y porque carecí de esa contención que Traspié me daba. La verdad que la mitad de los personajes de la novela me tuvieron arrancándome quejas, puteadas (cof cof Kyle cof cof Malta) y la otra mitad no logró tocarme el alma para nada. Solo fue Wintrow, quien me gustó desde el principio, y que sin duda, para mí, es el protagonista indiscutible (y no Althea), el que se convirtió en mi favorito. Althea, por lo pronto, no me pareció ni verosímil su reacción ni factible todo lo que hizo después. Pero allá ella. Brashen, por su parte, me parece que solo estuvo allí en la historia de pegote: no aportaba mucho a la trama principal, y solo \"aportaba\" cuando de escenas con Althea se trataba - if you know what I mean. Está bien, no todos los protagonistas pueden ser geniales ni tener una conexión mágica con todo, pero realmente me dio la sensación de que Brashen sobraba en todo este drama. Espero que se revierta en futuros libros.Hablando de drama, cuánto drama. No drama barato, pero mi dios, esto es una telenovela mexicana. Nada en contra de las telenovelas mexicanas, dios sabe bien que yo me miré todas las de Thalia y la Usurpadora y etcétera etcétera (les puedo cantar aquí mismo la canción de Marimar, oh pasado oscuro, \nhello darkness my old friend\n). La cuestión es que sí, hay drama familiar, hay drama romántico, hay drama personal, hay mucha mucha mucha MUCHA estupidez por parte de un personaje (COF COF MALTA COF) y momentos en los que uno se queda con la boca abierta como si acabara de presenciar una confesión por parte de Sandra Valeria a Don Fernando Altamirano de Castillo. En serio. Mirando en retrospectiva, me doy cuenta que sé por qué amé más a Traspié que a cualquiera de estos personajes. Traspié me daba lástima y yo solo quería abrazarlo y ayudarlo. Althea, Brashen, Wintrow, Ronica, Kyle, Keffria y Malta solo me daban ganas de zarandearlos uno por uno y apuñalar a dos o tres (COOOOF, MALTA). Pero bueno, allí radica la versatilidad de la autora: no puede crear todos personajes iguales a Traspié, ni tampoco puede recrear la misma historia. La historia. Me gustó. Estuvo... buena, supongo. No sabía qué esperarme y a mitad del libro tampoco sabía cómo terminaría, así que un punto por la impredecibilidad (¿existe esa palabra?). Me encantaron las nao redivivas. Me encantó Ámbar. Me encantó el tema de esta madera mágica, me encantó todo lo que tiene que ver con los Territorios Pluviales y sus antiquísimas tradiciones, me encantó, me encantó, me encantó, incluso más que los eufemismos de Althea y la vida en el barco. Perdonen, soy así. Y necesito saber de dónde viene este tronconjuro, de dónde vienen estos barcos mágicos.No me gustó que Hobb se explanara tanto en explicaciones sobre la vida de los personajes. Había páginas y páginas que relataban sucesos yaaaa pasados mucho antes del libro, o situaciones en las que ahondaba y ahondaba y ahondaba y no ibas a ningún lado. Me gusta un poco de introspección, pero no quiero cinco páginas de lo mismo. Give me a break, sobretodo porque se siente que está puesto para rellenar. Yo ya sabía con la trilogía de los Vatídico que a ella le gusta irse por las ramas con las descripciones, pero de vuelta vuelvo a lo mismo: antes teníamos solo a Traspié, en este tenemos a diez personajes, y la verdad que no me interesa saber todo de todos ellos. Sin embargo, sigo diciendo que esta mujer es una de las mejores autoras con las que tuve el placer de toparme, y escribe como los dioses, y describe con mucha poesía y sensibilidad, y hace que lo que sienten los personajes se vuelva carne en los lectores. Y admiro mucho eso. Pero basta de relleno.En fin. ¿Recomiendo el libro? Te tienen que gustar las historias de piratas. Si buscás algo de fantasía épica, acá no lo vas a encontrar. No hay ni espadas, ni bolas de fuego cruzando el aire, ni ejércitos que se enfrentan, ni ningún mago de barba blanca larga con un báculo. Tampoco hay aprendices de asesinos, ni mañosos, ni vetulus dando vuelta (por ahora. La portada de Las Naves del Destino me dice otra cosa). También he de advertir que este libro (y supongo, el resto de la saga) contiene una filosofía bastante machista. No se separa de los estereotipos de la época en que la mujer tiene que estar relegada a los quehaceres de la casa y no se la acepta para trabajos \"varoniles\", como ser marinero, y en lo primero que se piensa si una mujer está a bordo de un barco, es que servirá de puta para el resto de los hombres que viajan con ella. Lamentablemente, parece que en este mundo antaño las cosas no eran así y la igualdad era más próspera, pero no sé qué pasó en el medio, y caímos de vuelta en este hueco del hombre por encima de la mujer. Para las mentes sensibles, hay numerosos pasajes que harán que quieran tirar el libro por la ventana. \nCuando el pilar que sustenta el mundo de uno se viene abajo, es normal aferrarse al resto, intentar por todos los medios que las cosas sigan lo más parecido a como eran antes [...]. Pero nadie puede volver al ayer."}, {"userName": "Hanne", "userReviewDate": "Nov 11, 2012", "userURL": "http://www.goodreads.com/user/show/9653496-hanne", "userReview": "What can I say? I just loved it!This book combines two things that make up a brilliant fantasy book to me: amazing world-building and a bunch of real characters for me to love or despise (or constantly change my mind about). Add to that many intriguing storylines and you got a five star book right here! Differently to Farseer this book is written in a few point of view characters. It all starts in one place, but quickly changes into many different storylines, all of them moving forward with a steady pace but none getting fully answered or resolved in this book. This really is book one of a trilogy, not a stand-alone.And though I’m impressed with the story and the world-building, there’s really only one thing I can talk about: the characters!Thinking about the four books I read so far, Robin Hobb does characters so well! In Farseer, she turned me into a super-protective lioness, getting furious at everyone who dared to touch a hair on Fitz’ head. In this book, that didn’t happen (yet), but still there are already a couple of characters I thoroughly (and deliciously) loathe: Etta, Kyle, Torg, just to name a few; and there are some that are slowly growing on me: Althea, Malta, Wintrow and Kennit. And then there are the ships, they really are the star of the cast! Paragon the cast-out, Ophelia the gossiping grandmother and Vivacia the newborn. I can see them all sipping tea and biscuits while waiting in the harbour for us to entertain them.Absolutely fabulous!"}, {"userName": "Kylie", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/47437031-kylie", "userReview": "I've finished it. What do I do now? I feel so lost and I don't own the other two yet so I will just have to wait. I feel like I have been waiting my whole adult life to read this trilogy. Obviously 5 stars."}, {"userName": "Laura", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/45400990-laura", "userReview": "review to follow. Right now I'm already on board the Mad Ship! And it's quite the adventure!!!"}, {"userName": "Scott  Hitchcock", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/50894754-scott-hitchcock", "userReview": "A big thanks to Niki and Bill who convinced me this was worth reading in spite of the Farseer trilogy which while well written drove me crazy but Fitz might be the worst protagonist, EVER! 4.5*'sThis book had all the elements I love in fantasy. Smart and real characters who weren't black and white. They all had motivations which led them to both good and bad decisions. Different types of magic and magical creatures and you weren't just told about them, you were made to feel them. What they were about. What they felt. How they interacted with the world and the characters. There was real trauma and hardship, tough decisions to be made. Strife between conflicting characters and their points of view. A lot was left unanswered for us which I love. Don't show me everything at once, play the long game. The customs of the different people interwoven into their lives. I especially love the two ships. To me they are so unique. Looking forward to seeing how their stories play out and for the rest of the series."}, {"userName": "Franco  Santos", "userReviewDate": "Oct 06, 2015", "userURL": "http://www.goodreads.com/user/show/29931457-franco-santos", "userReview": "4.5Esta autora no deja de sorprenderme. ¡Qué personajes! ¡Qué diálogos! Espectacular trabajo de Hobb. Muy introductorio, le faltó fuerza al final y es espectacular. Lo amé."}, {"userName": "Emily", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/2431873-emily", "userReview": "[Everyone's 180 turn on how they feel about Kyle - particularly Ronica Vestrit! - is just too much. (hide spoiler)]"}, {"userName": "Steph // bookplaits", "userReviewDate": "May 24, 2015", "userURL": "http://www.goodreads.com/user/show/37929038-steph-bookplaits", "userReview": "4.5 stars. Absolutely loved this! I didn't really get into it at first; I kind of struggled with the number of characters, but once the story got going and I got to know the characters better, I loved it. Can't wait to finish the series once I've read my other book for book club. :)Reread 2018: Absolutely LOVED this reread and I'm bumping it up to 5 stars on Goodreads. I think the writing is even better than the Fitz books (which obviously I still love) and there are so many complex characters to love and hate. Hobb writes so effortlessly that it's a joy to read this book!"}, {"userName": "Benjamin Thomas", "userReviewDate": "Sep 05, 2010", "userURL": "http://www.goodreads.com/user/show/4209082-benjamin-thomas", "userReview": "Having immensely enjoyed Robin Hobb's \"Farseer Trilogy\", I enthusiastically turned to her next fantasy series, the vast \"Liveship Trader's\" trilogy. This first novel in the series, \"Ship of Magic\", is set in the same world as the \"Assassins Apprentice\" but otherwise has very little to do with it, instead focusing on a whole new and unique fantasy setting. Liveships are large masted sailing ships made of wizardwood that actually become sentient beings after three generations of their owners' families having died on board them. We follow various members of the Vestritt family, an Old Trader family who is in the unenviable position of trying to increase their trading profits before their creditors take harsh action. There are several main characters but chief among them is Althea Vestritt, a young lady who has spent most of her life sailing under her father's captaincy aboard the Vivacia. Upon her father's death in the early chapters of the novel, the Vivacia \"quickens\" into a full-fledged liveship. Unfortunately, through a series of circumstances and inner family squabbling, Althea is not allowed to continue to sail on board her, thus launching the main story thread of the series.There are many well-drawn characters in this novel, but I always appreciate a good villain. Ms Hobb excels once again, with the introduction of Kennitt, an ambitious pirate who has his eye on Vivacia as his prize. To be able to write a villainous character whom the reader can sympathize with as he pursues his dastardly plots is difficult at best but Ms Hobb does it so well. And her good characters come across as very real also, not always choosing the wisest or most honest course. They stumble over bad decisions during their struggles to achieve their goals and we feel for their failures, often seeing ourselves within them.This is, fundamentally, a tale of the sea, albeit in a fantasy setting complete with magic ships and sea serpents. The ship board activity is well researched and fascinating to experience. This is a long book and is followed by two more long books in the trilogy. Where some see extra wording or too much detail or even refer to the \"doorstop syndrome\", I see a richness of character that is essential in understanding these people. Besides, I just like spending time with them. While Ms Hobb provides splendid detail about some of the characters here, she only hints at others. We spend a little time with another liveship, Paragon, who is considered mad by the populace due to several incidents involving the deaths of his entire crew. It seems obvious that we are being set up for much more from Paragon, especially considering the title of the next volume, \"Mad Ship\". We also get tiny scenes involving what appear to be sentient sea serpents, but, quite frankly, I found them to be confusing and so relegated them to the recesses of my memory in order to dig them out again as they become more relevant in future books of the series. Ms Hobb also prepares us for a major role by the Rain Wild magicians and their interaction with another headstrong daughter of the Vestritts, Malta.For those readers who prefer their plot lines wrapped up neatly, I would suggest they have all three volumes of this trilogy readily available. Not one of the major threads is resolved here. But for those who relish complex relationships that are not convoluted, this novel will be sure to please. I for one am searching my book shelf even now for number two of this fine trilogy."}, {"userName": "Dara", "userReviewDate": "Aug 15, 2014", "userURL": "http://www.goodreads.com/user/show/13656026-dara", "userReview": "Like most Robin Hobb fans, I was introduced to her work through Assassin's Apprentice, the first book of her Farseer trilogy. I devoured the next two books but was totally turned off after the ending of Assassin's Quest (most people know that I physically launched the book across the room after finishing it). After that, I declared that Ms. Hobb and I were on a break (yes, like Ross and Rachel [I am Ross in this situation]).Boy am I glad that our break is over. Ship of Magic is a fantastic book with a engaging plot, vibrant characters, and a rich setting. It differs from the Farseer trilogy in a few key ways. First: It's in third person. The Farseer books are really the only books that first person ever worked for me. I like the change to third. Second: Because the books are in third person, there are multiple character points of view. Multiple POVs make the story richer and the world feel more expansive. The cast of characters and the setting are new but take place at the roughly same time as the Farseer trilogy.The characters make this book. We mainly follow the Vestrit family. They are the proud owners of a newly quickened liveship: the Vivacia. What's a liveship? Oh, it's just a ship that basically comes to life and the figurehead can talk to you. The magic isn't explained - which is totally fine by me - but the results are fascinating. The various members of clan Vestrit are deep, flawed, and sympathetic by turns. Few writers elicit such passion responses from me. Hobb is one of them.Let's take a second to talk about Ms. Hobb. Her writing in this book is equal to if not better than Farseer. The world of pirates and merchant vessels and traders is interesting but also fun. It all felt real to me. Her prose is eloquent, engaging, and consumable. She is a wordsmith. She's also incredibly frustrating. She loves to heap hardships onto her characters and I think she hates animals a little.The only real knock I have on this book is that I wanted a little more plot and a little less atmosphere. The worldbuilding is clearly important and this is the first book of a trilogy, so I'm willing to give this one some slack.If you're hesitating about continuing with Hobb, stop. This is a vast improvement over the Farseer trilogy and well worth your time.4.5 out of 5 stars."}, {"userName": "Zayne", "userReviewDate": "Mar 12, 2013", "userURL": "http://www.goodreads.com/user/show/11741913-zayne", "userReview": "Absolutely amazing!I was entranced by this book from the start. It left me wanting more and more with every flip of a page, so much that I ended up slacking in my classes just so I could get the chance to read this. Robin Hobb is going to be my downfall, I swear. Anyways, this book was almost impossible to put down. There was barely an combat (save maybe a scene or two), no insane bursts of magic everywhere, no goblins or demons running around. But it was still fantasy at its finest. There was adventure, some talking ships, but what was so magical about this book was the deep characterization. Everyone felt so real, you could relate to so many of them. They had real life issues to deal with, which was really the story's biggest strength. It was really plot driven. There wasn't a deal of events that happened. I wouldn't say that the plot was nonexistent but it was subtle. What I really paid attention to was the character's actions and relationships with one another. I think that's really what makes Hobb's writing so treasurable. I can't wait to read the next book, and I hope that its as good as this if not better."}, {"userName": "Noel", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/12581658-noel", "userReview": "This book was fantastic. I absolutely love how Robin Hobb writes. There's such richness and depth to her stories. The characters and the world feel real in a way that I rarely experience in books. And this book was just so fun, and pretty intense (never since Professor Umbridge have I hated a character with such vehemence). I loved the ships, and pirates and sea monsters automatically make things more exciting. I just can't praise Robin Hobb highly enough. She's an incredible author. Read her books."}, {"userName": "Lisa", "userReviewDate": "Jul 12, 2015", "userURL": "http://www.goodreads.com/user/show/17591646-lisa", "userReview": "This epic fantasy adventure is awesome!I can't think of anything I didn't like about it (apart from Malta who was SO annoying) - it's imaginative, gripping and fast moving with real and complicated characters who you love then hate then love again!It's got pirates. It's got magic. It's got new and fascinating lands and creatures. But it also has family, politics, love and revenge.Highly recommended for fantasy fans!"}, {"userName": "Patti's Book Nook", "userReviewDate": "Apr 26, 2016", "userURL": "http://www.goodreads.com/user/show/16149849-patti-s-book-nook", "userReview": "My reviews can also be found on my blog at: http://pattisbooknook.blogspot.com/I've been a bit silent on the book reviewing front. Sorry about that! I went through an unusual reading slump after dragging myself through a few books, and took a small break. I wanted to return to a sure thing....and Hobb has proven her excellence time and again. She is truly a master and I can't sing her praises highly enough. If you ever try Fantasy, I recommend her novels as a jumping off point. I have written reviews for the Farseer Trilogy in Hobb's expansive Realm of the Elderlings series, and have been told by countless people on Booktube that this is some of her best work yet (thank the Good Lord she's actively writing!!!). I just started the second book and will marathon these similarly to how I read the first set.  We follow characters in Bingtown and Jamailla, where Old Trader families are experiencing hard times due to slave labor and wars in the North. The ruling leader-Satrap- has allowed the areas to fall into neglect because of his inattention and addiction, which has also made him susceptible to bribes from New Traders hoping to takeover the Old Trader holdings.  The Liveships are the center of this tale. They are ships made from magical Wizardwood, which is only available in the Rain Wild Forests. Once a member from three generations of family have lived and died aboard the ship, it is \"quickened\" and becomes alive- a thriving vessel that brings prosperity and easier sailing for it's family. This valuable resource must be handled appropriately. I have so many things to say that I could ramble for paragraphs on end, and that would be a tedious experience indeed. Here's just a few of my my favorite things in this book. CHARACTERS- Good grief, the development of her characters continues to astonish me. The Vestrit Trader family is nuanced and goes through extreme emotional turmoil as their livelihood is threatened. Each person responds differently to the family threat, and acts according to their life experience. I found I kept making parallels between characters in the Farseer books to these (Burrich to Brashen, Wintrow to Fitz (although Althea could be likened to Fitz as well due to the outcast angle). While this comparison could be problematic with a less-skilled author, the story still felt wholly new and original. Also, there is an appropriate level of death. People aren't killed off willy-nilly. There is time for connections to develop, and when one does happen, it seems imminent and/or realistic for the situation.PERSONIFICATION: The idea of reading about a ship weeping doesn't sound that entertaining. It sounds weird, not beautiful or interesting. Well, Robin Hobb can make it feel like your family member is crying. The beauty of the Liveship Vivacia when talking to Wintrow about family ties is one such surprising passage: \"Who are you, I wonder, you creatures of flesh and blood and bone, born in your own bodies and doomed to perish when that flesh fails?....Yet when one of you is near, I feel you are woven of the same strand as I, that we are but extensions of a segmented life, and that together we complete one another. I feel a joy in your presence, because I feel my own life wax greater when we are close to one another.\" (pg 163)Another quote when Vivacia is feeling anxious: \"It was a terrible division, to feel such need for someone, and yet to feel angry that the need existed.\" (pg 704). Okay, I guess it's still weird that a ship is that complex. But Hobb can pull it off, somehow. WRITING: Stellar, magnificent, awesome, EVERYTHING. I might have said this before (I've certainly heard others mention it), but if you enjoy literary fiction and are curious about Fantasy, she's your girl. PLOT: Even if you don't care about strong writing and simply want good action, she provides. If you like sea adventures (that even feature serpents!), pirates, romance, complex family dynamics, with the backdrop of an expansive world, here ya go. PACING: Even though this story is told in a linear fashion without time jumps, having this many characters is a challenge. Somehow, I always felt like people received their fair time. I wasn't wishing I was back with other characters, everyone got an appropriate page count. I wasn't left with that all-too-familiar readerly feeling of wishing someone had more time in the book because I felt cheated. When I started to feel curious about how the Vestrits were getting on, almost instantaneously (okay, a few pages later) I was back with them. I think you've found your perfect author when that happens...it's like they sense your needs. My least favorite parts were the shortest, such as the sections with the serpent tangle. I knew they were important, but I didn't want to hear from them in full-length chapter detail. Hobb knew. Their interludes were just a couple pages sprinkled throughout the chapters. I'm sure they'll play a larger part in the next two books, but for now have the perfect amount of attention. Readers, the story flows without a hitch.WORLD BUILDING: I love a book with good maps! This series has one of the most extensive worlds I've ever experienced. It's not necessary to read the Farseer books before this, but there are cool passing references that are alluded to in this book. It's fun to to know the Rain Wild people have their own Chronicles in the next trilogy. There are tons of nooks and crannies to get lost in. It's hard for me to pick a favorite location. Every time I decide, I'm reminded of other areas I love.CONS: There weren't any for me. As in most fantasy worlds, it's involved. It will take 50-75 pages to get your bearings with the people and setting. The connections take some mental energy, so if you're wanting a quick, non-taxing read, hold off on this until you can fully appreciate the content. However, it's not needlessly complex and convoluted the way many are. Everything has a point and a payoff.  I really hope you'll pick up Robin Hobb at some point in your reading life. I'd love to chat with you if you do! She's firmly on my \"Authors to Meet\" bucket list. I'm sure I'll simply utter an awkward \"Thank You!!!\", but feel that's sufficient for meeting someone I hold in such high esteem. This is storytelling at it's finest."}], "description": "Wizardwood, a sentient wood. The most precious commodity in the world. Like many other legendary wares, it comes only from the Rain River Wilds.But how can one trade with the Rain Wilders, when only a liveship fashioned from wizardwood can negotiate the perilous waters of the Rain River? Rare and valuable a liveship will quicken only when three members, from successive generations, have died on board. The liveship Vivacia is about to undergo her quickening as Althea Vestrit’s father is carried on deck in his death-throes. Althea waits for the ship that she loves more than anything else in the world to awaken. Only to discover that the Vivacia has been signed away in her father’s will to her brutal brother-in-law, Kyle Haven...Others plot to win or steal a liveship. The Paragon, known by many as the Pariah, went mad, turned turtle, and drowned his crew. Now he lies blind, lonely, and broken on a deserted beach. But greedy men have designs to restore him, to sail the waters of the Rain Wild River once more.", "title": "Ship of Magic\n      \n          (Liveship Traders #1)", "url": "http://www.goodreads.com/book/show/45100.Ship_of_Magic", "average": 4.13, "cover": "https://images.gr-assets.com/books/1360507722l/45100.jpg", "reviews": 1897, "authors": [{"url": "https://www.goodreads.com/author/show/25307.Robin_Hobb", "name": "Robin Hobb"}], "type": ["Fantasy", "Fiction", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/45100.Ship_of_Magic", "http://www.goodreads.com/book/show/25985840-ship-of-magic", "http://www.goodreads.com/book/show/6662349-ship-of-magic", "http://www.goodreads.com/book/show/618211.Ship_of_Magic", "http://www.goodreads.com/book/show/25264832-ship-of-magic", "http://www.goodreads.com/book/show/1833120.Ship_of_Magic", "http://www.goodreads.com/book/show/12479384-ship-of-magic", "http://www.goodreads.com/book/show/13400626-ship-of-magic", "http://www.goodreads.com/book/show/10290219-ship-of-magic", "http://www.goodreads.com/book/show/6460575-ship-of-magic", "http://www.goodreads.com/book/show/25872465-las-naves-de-la-magia", "http://www.goodreads.com/book/show/9848101-ship-of-magic", "http://www.goodreads.com/book/show/24854871-ship-of-magic", "http://www.goodreads.com/book/show/77197.Assassin_s_Apprentice", "http://www.goodreads.com/book/show/25300956-royal-assassin", "http://www.goodreads.com/book/show/33396914-assassin-s-quest", "http://www.goodreads.com/book/show/68488.Fool_s_Errand", "http://www.goodreads.com/book/show/45108.Fool_s_Fate", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}