{"ratings": 110492, "userreviews": [{"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "That was precious =) ♥Mel ♥"}, {"userName": "Trin", "userReviewDate": "Jun 03, 2007", "userURL": "http://www.goodreads.com/user/show/113980-trin", "userReview": "Ahh, how times have changed. I used to consider these books a good guilty pleasure; now I find there's a lot less pleasure and a lot more guilt. Kinsella is still an amusing, energetic writer, but Becky really grated on my nerves this time around. She's just so shallow and so frivolous, and while in the first few books she was also just a regular working girl, now that she's rich (thanks entirely to her husband), her insane overspending and materialism swiftly loses its charm and becomes...icky. It can be difficult to read a whole book about someone you would probably feel uncomfortable having lunch with.So, while I still think there's a...certain charm to these books, and that they're in many ways better than a lot of chick lit, I also just don't think they're for me anymore. I've become too old and cranky to enjoy them. They belong to a part of my life that no longer exists (in which, for example, I also secretly owned an Avril Lavigne CD)."}, {"userName": "Zoë", "userReviewDate": "Mar 07, 2015", "userURL": "http://www.goodreads.com/user/show/9303625-zo", "userReview": "Book 31/100"}, {"userName": "Morgan", "userReviewDate": "Jan 14, 2009", "userURL": "http://www.goodreads.com/user/show/937415-morgan", "userReview": "this was my favorite of the whole series. partly because she doesn't do anything completely ridiculous, and you can see that she is learning and growing and communicating more, even if it's not as much as she should. i seriously love how becky and suze refer to people they don't like as \"cows\". maybe it's an english thing, but it seems like such a random choice of words. even though all along you know how kind hearted, fun and well meaning becky is, i love how it comes out even more in this book. i am a forever hopeless romantic, so i love the many becky and luke moments in this book, and i LOVE the end. i love that becky has grown and matured, but is still the same old becky who loves to shop, and always will. and i love that she is a mom."}, {"userName": "Claudia", "userReviewDate": "May 18, 2013", "userURL": "http://www.goodreads.com/user/show/11729290-claudia", "userReview": "Okay, how do I feel about this series?Dear Becky, Just quick question; why are you so dumb? I don't mean to offend you because academically you seem fine, but the general rule of intelligence is to learn from your mistakes. Have you EVER learned from your mistakes? People around you are aware you're spoiled and shallow and irresponsible but you just can't help yourself can you?Luke could probably do better, but he obviously loves you and that is truly what is important. I do actually quite like your relationship - except for the secrets! You're aware that you should have an honest, open relationship but it's near impossible for you to manage it! Come on!However, I do love pregnant you, and I think you'll make great mum. Hopefully you and Luke get out of your economical problems soon because you will need all the money you can get to support both you and Minnie's shopping. Another thing: Minnie? The name. WHY?I'm sorry, but I just really detest that name. It's like you're asking for your daughter to be a brat. And she will be. Now, Becky, you're loved and you love. You have a big heart and you get great ideas sometimes. But please, please try and learn to not get into any messes because I am this close to just abandoning you completely. Love and well wishes, Claudia"}, {"userName": "Ruthie", "userReviewDate": "Apr 02, 2009", "userURL": "http://www.goodreads.com/user/show/19456-ruthie", "userReview": "I had the misfortune of buying this book before a long flight to Europe. Due to a lack of alternative entertainment, I read the book from cover to cover. While the book had some funny excerpts, my extreme dislike for the main character (Becky Brandon) overshadowed any enjoyment garnered from the book.Rather than being lovable, I found Becky to be irresponsible, annoying and pretentious. For example, after Becky's husband explains that his company is \"hemorrhaging money\" and asks her to reign in her spending, Becky responds by hiding her purchases from him. How very responsible of her, indeed.Of course, I realize the book is of the chick lit genre, but it would have been nice to have a modicum of reality intermixed with the fiction.To me, Becky represents the irresponsible consumerism that has resulted in the current credit crisis, and frankly, I don't find anything laughable about that. Kinsella appears to have mailed in this book, and it's evident that she exercised the same level of brain power as possessed by her heroine in thinking through the plot."}, {"userName": "Irah", "userReviewDate": "Jul 15, 2007", "userURL": "http://www.goodreads.com/user/show/141143-irah", "userReview": "first few pages made me laughed already but as i go later into the story YES....becky has gotten more shallow for some reason;it felt like someting was missing comparing from the previous series.BUTi'll admit;she is fab!\"she's a red-hed bitch,and i hate her\"...that made me laugh so hard.how sophie kinsella create becky's mind is wonderful!shallow and materialistic but creative and one of a kind.just a great fun to read it.some say she's dumb but i find it unique!come on who have that much drama during labour??im always a fan of her ,becky;im sure she'll be flattered."}, {"userName": "Vicki", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/8085705-vicki", "userReview": "Sometimes I find the shopaholic books hit or miss. This one was a miss for me. I did not like the frivolous way that Becky behaved. I always find her odd and flighty, but this story made me totally confused. I understand the doubts and nerves of gaining baby weight and yet, she takes it to the extreme. I found her to be even more self-absorbed while she should have been focusing on the baby, and Luke. As I said, a miss. I am not sure I am going to continue with the rest of the books. Maybe it is time to retire the shopaholic and focus on another quirky addiction."}, {"userName": "Alison", "userReviewDate": "Apr 03, 2007", "userURL": "http://www.goodreads.com/user/show/47383-alison", "userReview": "I read the Shopaholic books as soon as I can get my hands on a copy. Sophie Kinsella is a really funny writer. She has sustained the Shopaholic idea through more sequels than most writers can. However, this book (and the previous one, Shopaholic and Sister) isn't as spot-on as the first two. I mean, isn't Becky ever going to learn to stop overspending? Every book involves her getting in a financial hole, then reforming at book's end, only to start over again in the next book. And of course, now that she's married to a rich guy, it's not quite so nervewracking when she maxes out her credit card. It IS true that when you have your first baby, you buy all kinds of things you didn't know you \"needed,\" and the part of the book when Becky learns about \"baby couture\" and decides she needs multiple strollers is fun. Die hard fans like me will probably keep reading--but it's not the best in the series for sure."}, {"userName": "Sara", "userReviewDate": "Jul 08, 2008", "userURL": "http://www.goodreads.com/user/show/1071388-sara", "userReview": "I'm officially over the Shopaholic books. They are all the same, Becky never learns anything, and I just can't imagine someone being as self-absorbed as she is. It was definitely something mindless to read while sitting by the pool, but won't change your life or anything."}, {"userName": "Michelle", "userReviewDate": "Nov 21, 2010", "userURL": "http://www.goodreads.com/user/show/4569356-michelle", "userReview": "[false labour as she tries to confront \"Cruella de Venetia\"During these scenes I think I fell in love with Luke even more when he finally confronted Venetia. (hide spoiler)]"}, {"userName": "Samantha", "userReviewDate": "Jan 28, 2008", "userURL": "http://www.goodreads.com/user/show/706208-samantha", "userReview": "This is the fifth book in the Shopaholic series by Kinsella, and, I'm happy to say, an improvement over the last (Shopaholic & Sister). I don't want to spend a great deal of time catching you up on the whole series (check past blogs or Amazon for details), but in this installment Becky & Luke are pregnant with their first child. Like usual, Kinsella throws us right into it with three little words: \"Ok. Don't panic.\"Becky's spending habits seem to have toned down as she's gotten older and settled into married life, but even so her shopping gene flares in Pram City and the baby fair and becoming Vogue's number one Yummy Mummy! Then of course there's the major obstacle: the baby's sex! How can she possibly properly shop for the child unless she knows what it's going to be? Solution: get stuff for both!As per usual, there is some crisis to overcome for Becky (creditors, journalists, Luke's ex's, family, etc.) and this time trouble comes in the form of a redheaded obstetrician all the celebrity mummies use (who just happens to be Luke's college girlfriend). It's difficult to tell if something is really going on between Luke and Venetia or not because her hormones are out of whack. Plus Luke can't see how Cruela De Venetia is out to get Becky on a fashion level because he's too busy trying to save his PR company from complete ruin. House hunting, pregnancy, the usual monetary panic, plus the private eye Becky hires have got her frazzled.This was a fun chick-lit read -- not as great as the first two, but definitely better than the last. I wonder if this will be the last in the series. In my opinion it ought to be, but I wouldn't be surprised to see another somewhere down the road."}, {"userName": "Sally", "userReviewDate": "Mar 17, 2009", "userURL": "http://www.goodreads.com/user/show/1002168-sally", "userReview": "In this book, Rebecca and Luke are expecting their first child. Becky has to have everything for the new baby from the best pram down to 400 count crib sheets. Everything is perfect. Luke's job, Becky has the celebrity obstetrician that no one else can get into, a spot in British Vogue. Things couldn't be better. Than her world comes crashing down.To her utter dismay, she finds out the this new doctor is Luke's ex-girlfriend who turns out to be a royal pain in the butt. She really is, as Becky puts it, a \"cow\". However, Beck is not about to allow Venetia, the doctor, interfere in her marriage even if it puts Becky in labor.Then there are problems with Luke's company and Becky's employment as well. But in the end, Becky learns that nothing else matters or is more important than family and friends.Sophie Kinsella has a way of drawing in the reader and falling in love with her characters. She has a way of touching their hearts but making them laugh out loud."}, {"userName": "Melanie", "userReviewDate": "Sep 22, 2012", "userURL": "http://www.goodreads.com/user/show/13048790-melanie", "userReview": "Sophie Kinsella is one of my favorite authors, and the Shopaholic series my favorite books. . I find them witty, humorous, exciting, and so much fun to read! I personally find Becky to be the perfect blend of silly and intelligent. I find all the characters relatable and I think their flaws make them all the more endearing. Although I am definitely not a shopaholic, I could completely relate to the character and I LOVE Luke and their relationship. I get so into the stories I find myself angry or laughing right along with the characters. Sophie is a brilliant author who knows the perfect recipe to a great story. I think that if you are a super serious person who enjoys heavy books this might not be for you. But if you have a sense of humor and enjoy reading about fun characters and humorous yet realistic events, then you will love this book as much as I do!This is my second favorite book in the series because I live when Luke stands up for Becky and gets all passionate about his love for her. Like every book in the series, I get completely wrapped up in their story and can't wait to know what happens next!"}, {"userName": "Alaina Meserole", "userReviewDate": "Jun 09, 2017", "userURL": "http://www.goodreads.com/user/show/50620706-alaina-meserole", "userReview": "[I am in love with their babies name: Minnie. (hide spoiler)]"}, {"userName": "Claire - The Coffeeholic Bookworm", "userReviewDate": "Dec 05, 2015", "userURL": "http://www.goodreads.com/user/show/19367448-claire---the-coffeeholic-bookworm", "userReview": "Becky Bloomwood is pregnant! Of course, these fashionable mom would only want the best and most beautiful for her kid. After learning that shopping is the best cure for her morning sickness and preggy cravings, she couldn't wait to go hunting for baby stuffs! And then there's the inevitable monthly doctor's appointment so she and Luke could checkup on their baby. But wait, what's this? Becky's OB gynecologist is none other than Luke's ex-girlfriend. And a very glamorous and fashion trendy doctor at that! Insecurity slowly creeps through Becky's veins. Now that the ex is back, will Luke finally turn her eyes back to the doctor, especially since Becky feels ugly and looks bloated all the time? Oh this has been another hilarious Becky-filled book. Pregnant Bloomwood is even scarier than jobless Becky, in my opinion, but she's still as sweet as she can ever be. She even made me think about the times when I was pregnant with my three kids. I was insecure and angry most of the time. Good thing my kids came out fine (LOL). But her encounter with Luke's ex was really something - I think it made her even more human and hysterical and likeable at the same time. Thanks Sophie Kinsella, I never had a dull moment whenever I read your books!"}, {"userName": "Tonkica", "userReviewDate": "Jun 13, 2013", "userURL": "http://www.goodreads.com/user/show/21285672-tonkica", "userReview": "Becky... Preporuka za lagan i simpatican odmor za mozak!"}, {"userName": "L.K. Watts", "userReviewDate": "Jul 20, 2012", "userURL": "http://www.goodreads.com/user/show/5240634-l-k-watts", "userReview": "Having read 'Remember Me' by the same author I decided to give this book a go. Despite not being the biggest fan of babies I wanted to read the book to see what makes the author so popular. I liked the subjects raised in the book - some of the issues are potentially very real but I was largely disappointed, not by the story or plot lines, but how the book was written overall. Kinsella repeats a LOT of words -I swear I read the word 'Incredulous' over a thousand times. Her descriptions are vague as well. She also uses certain phrases that she repeats endlessly. In the end it got very annoying. I thought the last couple of chapters were very poor indeed. Kinsella writes good stories but I don't see why she has to make the character's antics so utterly unbelievable at the end. I also noticed lack of depth in certain characters and I realised the author had used the same names here as in her previous books. To me that just shows lack of imagination, and for an author so hugely successful and popular I thought she could have done a whole lot better."}, {"userName": "CaitlinT", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/59918297-caitlint", "userReview": "It was good"}, {"userName": "Aleida Oskam", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/23923171-aleida-oskam", "userReview": "Dit boek viel mij een beetje tegen. Het duurde tot over de helft van het boek voor het verhaal me echt te pakken had. Maar snel door naar het volgende boek."}, {"userName": "Bree T", "userReviewDate": "Aug 18, 2010", "userURL": "http://www.goodreads.com/user/show/3913428-bree-t", "userReview": "Becky Bloomwood Brandon is back in the 5th installment of the Shopaholic series, Shopaholic And Baby. Becky and Luke are back from their extended holiday/honeymoon and Becky is pregnant with their first child. Since discovering that ‘shopping cures morning sickness’ she’s been determined that their baby will have the best of everything, in true Becky Bloomwood style. And that includes the best OB-GYN.The best OB-GYN is Venetia Carter, who looks after pregnant models, stars, etc and Becky is determined to get an appointment. Luke, her husband, isn’t so sure and thinks they should stick with his family OB-GYN but eventually agrees to go along with Becky to a preliminary appointment. Venetia Carter turns out to be an old friend of Luke’s from Cambridge who he even dated for a little while. Becky is suddenly apprehensive about having Venetia as her OB-GYN but Luke, delighted to catch up with an old friend, now decides that they should stay with Venetia.Before long, Luke and Venetia are catching up, re-living their University days, meeting up with all their old Cambridge friends and exchanging texts in Latin. Becky starts to wonder if this, coupled with Luke’s suddenly jumpy, secretive behaviour, means he’s having an affair. Life is a bit stressful at the moment, with the baby coming, as they’re currently homeless. They’ve sold Luke’s flat where they have been living and are looking for the perfect house but there is nothing around to their specifications. Becky has a new job with London fashion store The Look, which tanked spectacularly and is losing money hand over fist. They need to come up with something to get the buyers in fast or they’ll all be out of a job. Becky has the idea to call in her former Manhattan-neighbour-turned-famous designer Danny Kovitz to design an exclusive piece for The Look that will have fashionistas pouring through the door. Danny turns up demanding an absolutely outrageous rider and the full star treatment, costing The Look more money than ever, making Becky’s gamble an even bigger one.I’ve enjoyed the Shopaholic books I’ve previously read/listened to immensely but this one did fall a fraction flat for me, and I think that was primarily about how utterly stupid and frustrating Luke was. He’s supposed to be a very intelligent man and he didn’t get that his wife was a bit insecure about his ex-gf being her OB-GYN, even if she was the one that was all the rage. He went out catching up with her, spending time with her alone, and took Venetia’s advice even when it was blatantly obvious that she was trying to make Becky uncomfortable. You always, always, always back your wife over any previous gf, even if she is a doctor. Did he not consider that Becky’s blood pressure was slightly elevated because of Venetia? Apparently not. And he keeps something from her in this book that I’m sure he does for all the right reasons (trying to save her stress, because of aforementioned slightly high blood pressure) but all it does is make him look ragingly guilty of having an affair, which actually makes her even more stressed out and upset. If he’d actually told her what was worrying him in the beginning, then a whole lot of mess could’ve been avoided. But keeping huge secrets is part of this series (like Becky does in Shopaholic Ties The Knot) and although it often makes for humorous situations, this one made for more frustrating situations than humorous ones for me. What did make up for it was how utterly awesome Luke was at the end when the penny finally dropped that Becky was insecure and that Venetia was deliberately contributing to that. That was definitely the Luke Brandon of Confessions of a Shopaholic. That was definitely how a husband should act when encountering a woman like Venetia! So there were big points for that, it’s just a shame he was a bit stupid throughout the rest of the book.Still though, this book was a fun and light-hearted read. These books are great for picking up when you just want something to chill on the couch with and not have to think about. They’d be perfect for the beach in summer and they’re perfect for me on a cold winter’s day when I’m snuggled up on the couch with a blanket and it’s like, 4 degrees outside and bucketing with rain."}, {"userName": "Angelakfox", "userReviewDate": "May 02, 2011", "userURL": "http://www.goodreads.com/user/show/2813093-angelakfox", "userReview": "The Reader’s Advisory class I’m taking necessitates that I assign Sophie Kinsella’s Shopaholic series to a genre; by measuring it against the criteria presented in Joyce Saricks The Readers’ Advisory Guide to Genre Fiction, I can confidently declare it part of the “Women’s Lives and Relationships” genre. It is told from a women’s perspective (protagonist and titular shopaholic, Rebecca Bloomwood), set in contemporary times (modern day London), and generally optimistic and upbeat (Becky’s happy ending is never truly in doubt). But as Saricks herself points out, the problem with describing “women’s fiction” as a genre is that is the wide variety of work that can be found within. There are books written in every tone, crossed with every other genre. There are books by Serious Writers tackling Serious Issues in thought-provoking, literary ways……and then there is the Shopaholic series.To be fair, someone picking up a book with “shopaholic” in the title is probably not looking for the next Great Novel of our Time. The title, the brightly colored cover art, the playful typeface: everything about the book promises a light, easy “beach read,” and Shopaholic joyfully delivers. As is befitting a book in the “Women’s Lives” genre, Becky struggles with themes that are of special concern to women: family, friendships, and careers—but her particular struggles come with many comic misunderstandings and a sort of literary slapstick humor. In this particular novel of Becky’s misadventures, she finds herself gainfully employed as a personal shopper in a department store, happily married to her dream man, Luke Brandon, and expecting her first child. But when she insists on getting OB-GYN to the stars, Venetia Carter, she doesn’t realize that she’s inviting Luke’s ex-girlfriend back into his life. Becky deals with her glamorous competitor while engaging in her usual shopping shenanigans, surrounded by a supporting cast of recurring characters from the previous three books. There is no real suspense here; it’s hardly a spoiler to say that Becky triumphs in all endeavors while saving her employer, finding her dream home, and stumbling into a small fortune. And if Becky’s ratio of actual talent incredible luck seems a bit skewed toward the unbelievable… well, it’s still nice to see the good guys win. The very things that some critics will hate about the book—the predictability, the stock characters, the increasingly ridiculous plot twists—are the things that fans of the series will love. Shopaholic & Baby is a playful and humorous confection of a story that makes no attempts to deviate from the formula that has suited Kinsella so well."}, {"userName": "Reem_140511", "userReviewDate": "Sep 29, 2013", "userURL": "http://www.goodreads.com/user/show/23860499-reem-140511", "userReview": "This book starts of by telling us about Becky Bloomwood-Brandon who is just a regular mid-20’s year old shopaholic. She got married to her boyfriend, Luke Brandon. As soon as she came back from her wonderful honeymoon, she found out some astonishing news. She’s pregnant. At first when she found out, she was really anxious and nervous about it. Though this would be one of her biggest adventures. As the days went by and her ‘baby bump’ was developing, she discovered that shopping cures morning sickness. She truly wants her baby to have the best of everything. To her, everything has to be perfect, from the baby pram, changing diapers, clothes, down to the baby powder. She also needs the best obstetrician in town. She thought that she had met the perfect one, Venetia Carter. Venetia is a celebrity obstetrician to the stars and Becky thought she really wanted to have her as a doctor. What she didn’t know was that her husband, Luke, used to date Venetia. She finds out when they meet at their first appointment. Becky really doesn’t like Luke’s behavior, since Luke and Venetia have been hanging out and reminiscing old days. She thinks Venetia is a really good doctor and wants to stick to her, but isn’t really sure about it because of her history. She is really stressed with work and trying to find a new apartment. It’s really emotional for Becky, since she’s also pregnant. Becky is afraid that her marriage is falling apart, but she turns out to be really close to her husband by the end of the book. She talks to him and tells him everything. At the end, Becky is blessed with a baby girl, Minnie. Becky can relate everything to this new baby. She admires her, thinking she’ll turn out to be exactly like her. In my opinion, I really liked Sophie’s writing. I’ve read some of her other books and this has got to be my favorite one."}, {"userName": "Tia Brown", "userReviewDate": "Nov 13, 2011", "userURL": "http://www.goodreads.com/user/show/6611098-tia-brown", "userReview": "I checked out this book from our local library in hopes to try something a little different. This is the first I've read of any of the shopaholic books. I was aggravated by this book. How on earth could someone be so consumed with shopping and what other people think of them is beyond me. I don't think I'll ever understand. First off, Rebecca is impulsive and emotional. She's too over the top. Seems like every sentence she spoke had a note of excitement behind it. Honestly, I'm surprised she didn't have a miscarriage during her pregnancy. If it weren't for those raging hormones pulsing through her veins during this pregnancy maybe her thoughts wouldn't have been so cloudy. But I gather that this character is like this anyway.. pregnant or not. I won't be surprise by the time the last shopaholic book comes out that Rebecca Brandon had an aneurysm or stroke. I see why Luke kept her oblivious to his company struggles because she don't know how to take stressful news. And to make matters worse she was hell bent on getting a famous obstetrician, who happens to be Luke's ex girlfriend, to deliver their baby. Idiots! Luke needs a backbone at home. He should stop letting Rebecca run around like a chicken with it's head chopped off. Not one of my favorites for sure. Someone needs to slap Becky and tell her to CALM DOWN. Geez."}, {"userName": "Brooke ♥booklife4life♥", "userReviewDate": "Nov 20, 2015", "userURL": "http://www.goodreads.com/user/show/15928872-brooke-booklife4life", "userReview": "At A GlanceGenre: Chick LitLove Triangle/Insta Love?: Nope :DCliff Hanger: Nope.Rating: 4 StarsScore SheetAll out of tenCover:  8Plot:  8Characters: 8World Building: 8Flow:  9Series Congruity: 9Writing: 8Ending: 9Total: 8In DeptBest Part: Everything :DWorst Part: Dumb red headsThoughts Had: Becky you're crazy; Don't fuck this up Luke!ConclusionContinuing the Series: yes!!Recommending: yes!Short Review: I love Becky, i really do! Investing in \"Future Antiques\" :D Genius right there. Plus Becky's Bank for Girls, that is a bank i am willing to trust with my money :D She had me laughing that's for sure. Then towards the middle this book took a crazy serious tone and i was worried i would be hating a certain fav of mine, but he turned out to still be my fav :D I can't say i like the name Minnie but we'll see what trouble her and Becky get into :DReview in GIF Form:"}, {"userName": "SimBim", "userReviewDate": "Apr 03, 2010", "userURL": "http://www.goodreads.com/user/show/3509728-simbim", "userReview": "I liked the first book, but as the series went on, Kinsella's books kinda lowered on the ratings. First of all, I liked how Becky was pregnant, but maybe is Sophie had shown a little more maturity on the protagonists part, i would have believed that she was actually ready to be a mom.Also, there was basically no romance between Luke and Becky, which got to me.Another thing was that, Becky's shopping obsession was supposed to be something funny and something that shapened Becky to be who she was. However, I think the author made Becky a little dumb in this book. Just because Becky likes to shop doesn't mean she turns into a total ignorant dumbo. especiall since she's having a baby!Overall, I think the book was hilarious (especially the baby names bit!), but the protagonist ruined it for me. Becky had gone from bubbly, excitable and fun to read about, to stupid, inconsequental and immature. And, I'm sorry, but was Luke always so boring????Nice books, amazing writing, hilarious, but the character lacked too much depth for me..."}, {"userName": "Nina Draganova", "userReviewDate": "May 06, 2013", "userURL": "http://www.goodreads.com/user/show/20038488-nina-draganova", "userReview": "Кой друг, освен Беки , ще спретне такова раждане., с хомеопат, ароматотерапевт, йога инструктор и т.н. Човек винаги трябва да се подсигурява отвсякъде.А как ви се струва идеята , да си кръстите детето г-ца Унауатуна Орхидея Бамбукова Брандън?Или Армагедон ?Идеята шнола на \"Миу Миу\" да бъде част от попечителски фонд ?Блестящи идеи има тази жена.Никой не може да си позволява да я подценява."}, {"userName": "Anne", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/30851867-anne", "userReview": "A first for me of the Sophie Kinsella Shopaholic series. I started off not sure if I'd like the heroine, Becky, who at first glance appeared shallow and only interested in the designer lifestyle. However as I got into the story I gradually warmed to her. What a quirky and lovable character, her adventures and misadventures showed her a a generous hearted girl, one upholding traditional family values in spite of her desire for all the designer gear for herself and her baby. There are many laugh out loud moments, and as I take my books out with me to read on the bus, when I go for a coffee in town or at the launderette, it makes all of these tasks so much more enjoyable as I sit there chuckling to myself. Even on days when I feel a little tired, all I need to pick me up is a read of Sophie Kinsella's Shopaholic and I start to cheer up.This is a comedy of errors. Becky registers with a celebrity obstetrician, and is determined to have a natural birth. There are letters from various retail outlets in reply to Becky's helpful suggestions and from the investment broker, advising her as to what constitutes a sensible investment and what doesn't. But Becky shrugs all of this off.An engaging story, with quirky and entertaining characters, from her husband Luke, her sisters, her parents and her numerous friends. I only read the very last line this evening, I now feel as though I'd like to read another Shopaholic novel. Definitely one worth reading, for anyone who needs some uplift and joy in their life, this is the book for you."}, {"userName": "Alison", "userReviewDate": "Jul 06, 2009", "userURL": "http://www.goodreads.com/user/show/592564-alison", "userReview": "This one starts out slow and aggravating -- as Becky Bloomwood so often does. I find the series slightly more annoying now that she's rich and her shopping affliction is less a real problem and more of just a pesky bad habit which her husband can constantly bail her out of. Oh hardy har har, Becky can't possibly choose just one stroller so she buys four uber-strollers when the rest of us struggle to afford one mediocre one that we can make do with. And for some reason, her marriage and relationship with her husband have always seemed a bit awkward to me. He's supposed to be this fantastically rich and intelligent entrepreneur, but yet he has the relationship smarts of a banana slug. But before I knew it this one had me hooked just like all the rest! By about the halfway point I couldn't put it down and finished it in one sitting. I even found myself laughing out loud at some points. If you're a fan of the series, this one is another fun read, although Kinsella has still never been able to recapture the charm of the original book. I don't so much *like* Becky anymore, as I just feel a bit sorry for her and hope things work out for her in the end. This installment is not perfect, by any means, but if you've made it this far with the series, it's still a good diversion for some light-hearted, purely frivolous reading."}, {"userName": "Love Fool", "userReviewDate": "Feb 26, 2014", "userURL": "http://www.goodreads.com/user/show/29084789-love-fool", "userReview": "Becky Brandon (nee Bloomwood) is pregnant! She couldn't be more overjoyed-especially since discovering that shopping cures morning sickness. Everything has got to be perfect for her baby: from the designer nursery . . . to the latest, coolest pram . . . to the celebrity, must-have obstetrician. But when the celebrity obstetrician turns out to be her husband Luke's glamorous, intellectual ex-girlfriend, Becky's perfect world starts to crumble. She's shopping for two . . . but are there three in her marriage?I have never been pregnant but I would think when you are that's when you are most insecure. You gain weight, things happen to your body that you thought would only happen in a horror movie, and you don't feel like yourself. So, I completely understood Becky's feelings.Also, I think I would be like Becky if I was pregnant with the shopping for the baby (the baby needs this is the best line ever). And, I think the worst thing is having your husband's ex be some beautiful, successful, sexy, and thin woman. I thought what Sophie Kinsella did was brilliant and I loved it."}], "description": "Becky Brandon (nee Bloomwood) is pregnant! She couldn't be more overjoyed-especially since discovering that shopping cures morning sickness. Everything has got to be perfect for her baby: from the designer nursery . . . to the latest, coolest pram . . . to the celebrity, must-have obstetrician. But when the celebrity obstetrician turns out to be her husband Luke's glamorous, intellectual ex-girlfriend, Becky's perfect world starts to crumble. She's shopping for two . . . but are there three in her marriage?", "title": "Shopaholic & Baby\n      \n          (Shopaholic #5)", "url": "http://www.goodreads.com/book/show/9420.Shopaholic_Baby", "average": 3.78, "cover": "https://images.gr-assets.com/books/1388274774l/9420.jpg", "reviews": 2503, "authors": [{"url": "https://www.goodreads.com/author/show/6160.Sophie_Kinsella", "name": "Sophie Kinsella"}], "type": ["Womens Fiction", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/9420.Shopaholic_Baby", "http://www.goodreads.com/book/show/4916978-shopaholic-baby", "http://www.goodreads.com/book/show/1245994.Shopaholic_and_Baby", "http://www.goodreads.com/book/show/15998905-opingholi-arka-i-beba", "http://www.goodreads.com/book/show/817581.Shopaholic_and_Baby", "http://www.goodreads.com/book/show/12517778-shopaholic-baby", "http://www.goodreads.com/book/show/3092108-shopaholic-and-baby", "http://www.goodreads.com/book/show/10801036", "http://www.goodreads.com/book/show/9416.Confessions_of_a_Shopaholic", "http://www.goodreads.com/book/show/33724.Can_You_Keep_a_Secret_", "http://www.goodreads.com/book/show/33722.The_Undomestic_Goddess", "http://www.goodreads.com/book/show/1358844.Remember_Me_", "http://www.goodreads.com/book/show/12033455-i-ve-got-your-number", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}