{"ratings": 114, "userreviews": [{"userName": "Richard Derus", "userReviewDate": "Mar 24, 2011", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "The Book Report: In the late 1990s, hustler/street trash Jaeven Marshall gets rescued by remittance man/blocked perfectionsit artist Derek Brathwaite, who grooves on Jaeven's bruised and abused body. The two begin a peculiar and passionate love affair that never involves sex, but truly touches the heart of any romantic in its deep and vital connection. Jaeven uses Derek as a home base, a touchstone, and a security blanket. He rises (!) in the just-then-efflorescing porn world as a porn performer and a model, taking it as his 22yr-old naif would: His due. What no one but Derek, and the strange photographer/trick Richard, know is that Jaeven is a writer. A real one, one who writes and who sponges up images...the book is littered with lists Jaeven keeps of the \"shit and ephemera\" that Manhattan excels at putting in the path of the observant, letting the reader in on Jaeven's private coping mechanism for his rampant ADD (and his inability to break past the surface of anything, too)...so while he's using himself to live and eat and keep moving, he's fueling the creative rage inside himself. Derek, blocked because surfaces are all he knows, uses Jaeven's unpublished writing to break through into an actual creative frenzy, painting at last the gaudy and exciting colors that he's seen but never managed to reach inside to create before. Jaeven's downward track is, well, inevitable: He gets into meth, gets meth-mouth, stops getting calls from his various munificent tricks (except the peculiarly loyal Richard), and even manages to make Derek so angry that he gets thrown back onto the streets he's only just clawed his way up from. In the end, though, as is inevitable in a first novel, the redemption occurs and all is well.My Review: It's a first novel, or I would've been more chary with my stars. I think it's a fun ride through a Manhattan that's been sanitized out of existence. I liked that Manhattan, I trolled it, and I felt at home in it; I'm inclined to spot Mr. Cox some points for that. It's reasonably clear to me that it's also a roman a clef, and that also counts in my ratings. I have no way of knowing how much of it is self-referential, but at a guess I'll say a lot. I like a writer whose take on himself isn't in any way reverential. I like reading about the world that my thirties were spent in. I like a lot the amiably nihilistic, irretrievably broken kid comes out (!) with hope, and therefore a future. It's not perfect, but damn it's good. Read it!"}, {"userName": "Jason Bradley", "userReviewDate": "Jul 22, 2010", "userURL": "http://www.goodreads.com/user/show/2379613-jason-bradley", "userReview": "3.5 stars- This was odd and funny and poignant and funny and confusing and sad and touching and enjoyable."}, {"userName": "Mel", "userReviewDate": "Jul 22, 2012", "userURL": "http://www.goodreads.com/user/show/3906205-mel", "userReview": "I was visiting my mom in hospital, where she was recovering from major abdominal surgery.\"Let's go for a walk,\" she said, but she wasn't doing well, so we only made it maybe halfway down the hall before she steered us into The Family Room to have a sit.This was an extremely terrible Family Room: harsh lighting, torn vinyl couch, and the TV... the TV was so battered that the only way to operate it was to stab a butter knife through a scarred hole in its front and pray to Jesus. That wasn't my idea, okay, the butter knife was partially wrapped in surgical tape and affixed to the TV by a repurposed telephone cord. The hospital provided a metal object to jab inside an electronic device, is what I'm saying.\"It only gets channel 19,\" my mom said, glumly. (A ladychannel, if you wondered: nothing but soft-focus melodrama and home improvement shows, from here to eternity. My mom will watch anything if Shirley MacLaine is in it, but otherwise it's cop shows and action movies, straight across the board.) \"It's turned up to 48, and there's no way to turn it down.\"I was nearly apoplectic with rage. This wasn't the first time this hospital had disappointed us. One day during the period of time when my mom was allowed nothing but ice chips to \"eat,\" the ice machine on her floor broke down, but even though the others still worked, the nurses just left her with nothing till my sister and I were on site to get it for her, hours and hours into a very hot day.But then, a glimmer of hope: I spotted a novel on the TV stand. I couldn't believe someone had left it behind, because it looked like a gooder: sleazy, arty, Canadian, it was far more attractive to me than the LaVyrle Spencer novel that had sat at my mom's bedside unread for ages after a well-meaning roommate left it behind.Then, I saw the little label on the cover: PROPERTY OF ABSOLUTELY FUCKING SHAMBOLIC HOSPITAL AUXILIARY LIBRARY.\"There's a library here?\" I asked, dangerously.\"I don't know,\" Mom said. \"I guess there must be,\" she added, nodding at this book.\"And nobody told you?\" She'd been there for weeks.\"No,\" she sighed.\"I'm taking this,\" I growled, shoving the book into my bag. \"I'm fucking taking this to punish this place for being such a fucking hellhole.\"\"Okay,\" my mom said placidly, and let me tell you, I'm 40 years old and my mom still hauls off and decks me if I put something back in the wrong spot in a store. That's what she's like.Anyway of course it was only a matter of hours before I realized that I wasn't punishing the hospital so much as I was whoever else might have wanted to read the book. Unfortunately, I can't return it, because I fell in love with it on page one. I love it more today than yesterday, but not as much as tomorrow. It's funny, and seedy, and dark, and sad, and beautiful, and the author's style is gorgeously spare, especially considering the subject matter.I don't recommend stealing it from a store, because then the author will never see a dime for your copy, but if you should find it in Family Room of the Damned while your mom is all hunched in on herself because she doesn't want to watch channel 19 and/or die in the trying, just fucking take it, okay, and enjoy it in good health, and then donate its purchase price (plus applicable taxes) to readership in some form or other, as I did.Or you could just buy it. It's not expensive, and it's very, very good."}, {"userName": "Joe", "userReviewDate": "Apr 09, 2011", "userURL": "http://www.goodreads.com/user/show/2785014-joe", "userReview": "Shuck is the story of Jaeven, a street hustler, gay porn star, diarist, meth addict, and unpublished writer. The book takes place in the late 1990's in Manhattan. Shuck consists of short segments, narrated by Jaeven. We follow him episode to episode, and it quickly becomes apparent that Jaeven is a man worth following. He's witty, sometimes happy and somewhat miserable. He is often filled with both bravado and fear. Shuck feels like a true story, and that's because it contains grains of truth from the author's previous existence as a porn star and high-priced escort. Cox has said that Shuck is fiction, but much of it is based on actual events(including an incredible scene where Jaeven shows up for his first porn shoot.) At the heart of Jaeven's life is an artist named David, who allows Jaeven to stay in his apartment for $300 a month, and the promise of showing off any bruises and scrapes he acquires. David needs those bruises to come up with brand new colors. His most recent artistic endeavor includes turtles and markers. The relationship between David and Jaeven (platonic throughout the book) is confusing. Jaeven isn't quite sure if David is jealous of Jaeven's sex with other men, even though David and Jaeven have never had sex, though they sleep in the same bed.There are scenes of great humor in the book, along with scenes that will make you cringe. Some sections consist of lists of reasons why New York is not America. Others contain lists of things Jaeven finds while dumpster diving. Mostly, though, the book is a brief excursion into a life most of us will never know. It was an amazing read. Highly recommended."}, {"userName": "Christopher", "userReviewDate": "Oct 14, 2010", "userURL": "http://www.goodreads.com/user/show/666077-christopher", "userReview": "A cuttingly funny read on the struggles of Jaeven Marshall to be a struggling writer, both in trying to be published and struggling to write. Distractions abound-the sporadic uncertainty of street living, a reprieve with a new relationship (ambiguous) and room and board with another artist, a porn career that feeds, then threatens to subvert the writing, and the personal foibles of self. A pop apocalyptic sense of finality increases as the book careens towards the end of the millennium (Y2K fears read as wacky hilarity) and Jaeven's struggle to make something of himself without self imploding. The ending was surprisingly (slightly too much, or abruptly?) hopeful, given what had come before, though as I recall, that was my issue with Cox's previous novella, but structure aside, the emotion of it felt at least more well earned in this one."}, {"userName": "Shark", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/7410464-shark", "userReview": "It has a lot of the issues of a first novel. And I do think it had potential for a lot more than what was delivered. There were amazing scenes that completely sucked me in, but in between those were parts that made me want to give up on it. But it's a very fast read, for better or for worse. And I do think the ending redeemed the whole book, at least for me. This one is probably something that requires another read, but that'll be easy because it's so short and quick."}, {"userName": "Tristan Goding", "userReviewDate": "Nov 20, 2015", "userURL": "http://www.goodreads.com/user/show/37574258-tristan-goding", "userReview": "If you are a fan of this type of book, this is definitely worth seeking out. The episodes here are as dingy as you would expect, but there is a poetic vibrancy to the writing that I found to be infectious and immensely readable. SHUCK is full of life, but more importantly it is realistic. No words are minced and no feelings are spared. This is a cold book. In its coldness, though, it holds a tale that is as touching as anything you would expect from similar writers. I couldn't put it down."}, {"userName": "Alexis", "userReviewDate": "May 26, 2010", "userURL": "http://www.goodreads.com/user/show/689723-alexis", "userReview": "I read this book in one setting. I'm going to confess that I picked it up because the author started following me on twitter. It's the story of a porn star/gay male hustler and his tricks. It's written in a lovely style that is extremely poetic and a bit non linear. I was surprised by how much I enjoyed it and how much I wanted to keep reading it."}, {"userName": "George Ilsley", "userReviewDate": "Sep 06, 2010", "userURL": "http://www.goodreads.com/user/show/4003368-george-ilsley", "userReview": "A thoroughly enjoyable read from a gifted new writer. The narrative voice is mischievous, perverse and engaging. The narrative is interspersed with charming lists, each of which is a prose poem of compelling details."}, {"userName": "Brian", "userReviewDate": "Jul 22, 2010", "userURL": "http://www.goodreads.com/user/show/731997-brian", "userReview": "A hustler in New York. This book reminds me of Just Kids. Mapplethorpe was a hustler at times he needed money, of course before he became successful.Shuck is explicit. If that bothers you give the book a miss. Other wise it is an interesting but ultimately sad story."}, {"userName": "Bud Perry", "userReviewDate": "Dec 01, 2008", "userURL": "http://www.goodreads.com/user/show/1764545-bud-perry", "userReview": "Wonderfully poetic; a lyric tale about a hustler who fluidly balances between the people who uses him and the people he uses."}, {"userName": "Arsenal", "userReviewDate": "Jan 29, 2009", "userURL": "http://www.goodreads.com/user/show/1405983-arsenal", "userReview": "Nominated for a 2008 Lambda Literary Award for Gay Debut Fiction. The winners will be announced at a gala on May 28 in New York."}, {"userName": "Larry Benjamin", "userReviewDate": "Feb 13, 2012", "userURL": "http://www.goodreads.com/user/show/7046706-larry-benjamin", "userReview": "Shuck is the story of a quasi-homeless, young man—Jaeven Marshall—who seems to be moonlighting as a hustler/porn star wannabe, while waiting for his real life, as a writer, to begin. He’s also the drug-addled dumpster diving narrator of the story. He seems to be half in love with his moody painter benefactor/roommate, who himself is, maybe, a talented painted. Maybe, is, in fact, this book’s one constant: maybe Jaeven is a writer, maybe he’s a no-talent bum. Maybe he’s in love with his roommate, maybe he’s not.Turning a page of Daniel Allen Cox’s Shuck is an experience similar to Jaeven’s dumpster diving: you never know what you’ll find: sometimes new diamonds in platinum settings, sometimes empty food wrappers, sometimes shit. Part urban fable, part nonsense poem, Shuck is a roller coaster ride in the dark. Cox disregards the rules of language, of storytelling. He scatters words across the page, unrelated strings of words like so much flotsam floating on the white sea of the page leaving it up to the reader to pick them up, dust them off, assemble them and make of them what he or she will. Yet sometimes his words sparkle like unset gemstones, as when Jaeven describes his relationship: “Our innocence is still frustrating. I can hardly stand his dry kisses, our hand-holding, our makeshift pajamas, but it’s too late to replace this tenderness with desperate gropes in the dark. The noise would destroy the silence, our bond.” Maybe Daniel Allen Cox is brilliant. Maybe he’s just pulling the reader’s leg. In any event it’s a fascinating book but not for the uncommitted those readers unable to cope with maybes."}, {"userName": "Mattilda", "userReviewDate": "Mar 20, 2009", "userURL": "http://www.goodreads.com/user/show/1150397-mattilda", "userReview": "I'm a bit neurotic, and when I first read this book in manuscript form I couldn't help but notice that it takes place at the exact point when I lived in New York -- and the narrator is a hustler of about my age at the time, no less -- and so I was immediately transfixed by the humor especially and the crazy specifics in common with my (fictional and non-fictional) life, who knew? A friendship was born! But of course I couldn't help calling attention to the things I believed couldn't possibly have happened, or if they did happen they needed some sort of reason, right? So it's so exciting to see this book streamlined and still unreliable as narrator is but also filled with both truth and satire and satire of truth about yes New York New York this narrator likes it much better than I did the poetry and cliché and poetry about cliché, yes yes -- the best part is when the narrator goes off about porn and magazine covers and oh no did I realize that this narrator worked for the same porn company that I unfortunately did a video for? You are not serious! But that's when Daniel really nails it -- slams himself the industry and evokes the narrator's obsession with hope through shutter speed break-me-up, give me more I wanted more and at the end since I'd already read it I was worried about that too-tidy ending from before but no need to worry it's been replaced with something so sad and intimate and silly and unresolved and broken and hold me now yes hold me now I'm a book but hold me."}, {"userName": "Michael Estey", "userReviewDate": "Oct 02, 2013", "userURL": "http://www.goodreads.com/user/show/14049412-michael-estey", "userReview": "What's worse than being an unpublished teenage writer living in New York City?Being Jaeven Marshall, an unpublished teenage writer, who's hustling, selling his body to survive until he gets his big break and someone discovers his writing talent, all the while being addicted to Crystal Meth, living with his off and on sugar daddy, in New York City.Shuck - A novel by Daniel Allen CoxShuck - as in Shucking off ones clothes. The story opens with this young man at the top of his health and looks. A rising young porn star, wanna be writer.Written in a light conversational, easy to read style. I wouldn't recommend this book to anyone under sixteen. Due to some graphic scenes and language.No I'm not a prude! but... a few things did shock me. I know things like this do happen and you don't even have to be in New York City.Some very depressing scenes throughout the book, showing the insides of the hard core porno industry. The humility and the indignities involved.At first! You'd expect, success to follow this good looking determine boy with this narcissistic personality. But... When Crystal Meth was mentioned, I new the ending wasn't going to be as nice as imagined it could be. If you want to know what's worse than being a teenage writer in New York. This book is for you.I give this book five stars. ***** With a warning. Restricted!Michael Estey"}, {"userName": "Adam Dunn", "userReviewDate": "Apr 14, 2012", "userURL": "http://www.goodreads.com/user/show/5895037-adam-dunn", "userReview": "A quick read, worthwhile enough but more for what it indicates the future may bring for the author.A typical first book, coming of age tale with a 23 year old protaganist that likes to use drugs and make bad decisions, like we all did at that time, but I was glad I wasn't 23 anymore as I read this.The novel is at times overly bleak, I would have preferred a more upbeat tone, but there was moments of humour, especially at the beginning, that showed promise of what the author may do in the future with a less downbeat narrator.I know very little about the author but everything I do know was in this book, indicating he based it heavily on his own life. The good was the humour (drawing Turtles, shoe store), and the porn/hustling parts were mostly good and the use of description was good, I could clearly visualize most of what took place in the book.Less good was the lack of a story line, the lack of definition in characters other than the narrator, and the not following through with the humurous elements, keeping them mostly in the first half of the book, leaving the second half a slow depressing slide.As the author ages and gets less in to the \"all about me\" and \"life sucks\" phases, I'm looking forward to seeing what comes next."}, {"userName": "Jennie", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/3118627-jennie", "userReview": "Canuck Mr. Cox does it again and does it like no one else.Now this novel is about a gay porn star/writer/prostitute, so there is some gay sex involved.I liken his words to that of William Burroughs; short descriptive sentences that have you hang on every word. Jaeven Marshall is also a liar, but that just makes you like him more. He ventures to become the next New York Boy and well, telling you more would ruin it. His observations are astounding and his curt comments of others witty and mean. He doesn't mind selling his carnal self to become a writer. This is no Pretty Woman boys and girls, but that's why you'll love it!Unique, inspiring, vunerable, harsh yet beautiful."}, {"userName": "Kirsten", "userReviewDate": "Nov 25, 2009", "userURL": "http://www.goodreads.com/user/show/88255-kirsten", "userReview": "I'm sort of embarrassed to say I read this...but, what the hell. It was an advance reading copy that came in to the office, and a co-worker was so disturbed by it, yet also intrigued, that I picked it up too at a book swap. Crazy read, but also interestingly written, with a few challenging insights about porn and art."}, {"userName": "Black Heart", "userReviewDate": "May 25, 2009", "userURL": "http://www.goodreads.com/user/show/716241-black-heart", "userReview": "Read my review online at Black Heart Magazine: http://blackheartmagazine.com/2008/10...And check out our interview with author Daniel Allen Cox at http://blackheartmagazine.com/2008/10..."}, {"userName": "Laura D", "userReviewDate": "Jul 27, 2009", "userURL": "http://www.goodreads.com/user/show/2513304-laura-d", "userReview": "sonewhat dsitrubing.This is a new genre for me and I'm not sure I like it. On the other hand I've almost read the whole thing in three days!"}, {"userName": "Avivs", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/3842095-avivs", "userReview": "It's more of a 3.5 book.Loved the writing, didn't like the ending and the feeling that there wasn't really a story there.At least it didn't drag. Interesting author."}, {"userName": "John Kitcher", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/3654066-john-kitcher", "userReview": "this book proves that not all stories about sex and drugs are worth reading."}, {"userName": "Erik", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/15103969-erik", "userReview": "\"Shuck\" is a well done attempt at a turn-of-the-century first-person narrative akin to the New York City memoirs that populate its not too distant predecessors. Daniel Cox via Jaeven the street hustler presents a natural character arc in which we watch a boy from the streets rise to the pinnacle of success in his unchosen field all the while failing to rise to the occasion in the field he so desires to succeed in. A both honest and very real account of the life of New York street hustlers, \"Shuck\" does a nice job presenting the fact that such a life is full of positivity and negativity but reminding us that even a successful street hustler struggles in the end.That being said, while Cox does an excellent job developing the character who tells his story, the remainder of his character remain blurs throughout - he fails to tell us why such characters as Richard and Derek are who they are or do what they do.A well done presentation of the life of street hustler, \"Shuck\" had the potential to tell so much more of a story."}], "description": "“Set in the late 1990s, Shuck describes with great clarity and verve the last gasp of a gritty Manhattan.”—Bruce LaBruce, film directorShuck is the intense, dazzling diary of a male hustler in New York who tries to manage his reputation as the city’s porn star du jour when he’s not dumpster diving, tweaking, or trying to get published. A remarkable peep show of a novel about what binds artists and prostitutes, and the collateral damage of what happens when they try to recover what they have lost.Daniel Allen Cox is a former porn star. This is his first novel.", "title": "Shuck", "url": "http://www.goodreads.com/book/show/3733500-shuck", "average": 3.9, "cover": "https://images.gr-assets.com/books/1328760856l/3733500.jpg", "reviews": 23, "authors": [{"url": "https://www.goodreads.com/author/show/1129330.Daniel_Allen_Cox", "name": "Daniel Allen Cox"}], "type": ["Fiction", "Glbt", "Cultural", "Glbt", "Lgbt"], "outlinks": ["http://www.goodreads.com/book/show/3733500-shuck", "http://www.goodreads.com/book/show/8463644-krakow-melt", "http://www.goodreads.com/book/show/24796136-mouthquake", "http://www.goodreads.com/book/show/13237155-basement-of-wolves", "http://www.goodreads.com/book/show/2553086.Tattoo_This_Madness_In", "http://www.goodreads.com/book/show/5083093-second-person-queer"]}