{"ratings": 149, "userreviews": [{"userName": "Mai Laakso", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/49155830-mai-laakso", "userReview": "Amerikkalaisen Lucia Berlinin (1936-2004) novellikirja Siivoojan käsikirja ja muita kertomuksia sisältää arkirealismia ja pudottaa sopivan tasaiseen tahtiin maan päälle kummastelemaan elämää puolelta toiselle. Kirjailijan vahvuus näkyy hänen loistavasta taidosta yhdistellä erilaisia lauseita, jotka sisältävät ajatusten lentoa paikasta a paikkaan y ja kaikkea siltä väliltä. Novellit ovat riemastuttavia tai osa novelleista riemastuttaa, osa surettaa, osa kertoo hänen omasta elämästä ja osa laittaa miettimään, että onko tämäkin kirjailijan omasta elämästä. Ehkä hän on liioittelun mestari, mutta hyvä sellainen. Novellit sisältävät mustaa huumoria ja osoittavat miten hurmaavasti jopa vakavista asioista voi kirjoittaa."}, {"userName": "Suketus", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/7369475-suketus", "userReview": "Erinomaisia, melankolisia, tylyjä, pienen suuren elämän novelleja. Berlin kirjoittaa itsestään vaiko sittenkin jostakusta muusta. Elämä ei ole aina helppoa eikä kaunista, mutta pienetkin välähdykset hyvää voivat antaa paljon. Ja yhtä nopeasti ne katoavat.Tiivis, rytmiltään vauhdikas tyyli, erinomainen suomennos. Hieno novellikokoelma."}, {"userName": "Mira", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/7408742-mira", "userReview": "Aaargh mikä kokoelma! Tämän hankin vielä omaan hyllyyn ja luen lukuisia kertoja. Niin paljon kokemusta ja säröä, ja silti sellaista... en tiedä, riemukastakin meininkiä. Todella hyvä."}, {"userName": "Laura", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/7313532-laura", "userReview": "Olipa mahtava novellikokoelma. Tämä täytyy saada omaksi, sillä näihin nyt vain on yksinkertaisesti palattava vielä monta kertaa, jotta koko voiman ja jokaisen sanan merkityksen saa irti."}, {"userName": "Kirja Vieköön!", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/60806963-kirja-viek-n", "userReview": "Lucia Berlinin aiheet kattavat tavattoman laajan kirjon. Hän hyödyntää loistavasti omaa laajaa ja värikästä elämänkokemustaan. Koskettavimpia novelleja olivat ehkä nuoren naisen abortintekomatka Meksikon puolelle Juáreziin / Tiikerinpuremia ja yksinhuoltajaäidin tuskainen viinanhakureissu varhain aamulla ennen lasten heräämistä / Kaikki karkaa käsistä. Novelleissaan Berlin läväyttää lukijan silmille amerikkalaisuuden karumman puolen - ankeat itsepalvelupesulat, joiden seinillä AA:n iskulauseet tarjoavat pelastustaan; värikästä paikallisväriä tihkuvan elämänmenon Meksikon rajan molemmin puolin, El Pasossa ja Juárezissa; kahden kerroksen väen - siivoojat ja heidän yläluokkaiset naurettavat emäntänsä mainiossa niminovellissa Siivoojan käsikirja. Kokoelma on runsas ja elämänmakuinen; realistinen ja huumorintäyteinen. Minun sydämeni vei lyhyt novelli 'Minun jockeyni'!!!"}, {"userName": "Heidi (KosminenK)", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/28675549-heidi-kosminenk", "userReview": "Sulattelen.EDIT 7.1.2018Sulateltu ja kirjotettu jo blogiinkin tästä elämänmakuisesti levottomatekstisestä novellikokoelmasta. Blogi: kosminenk.wordpress.com."}, {"userName": "Kaarna", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/6905032-kaarna", "userReview": "While reading this, I thought there wasn't much at all special about the stories. Yes, some of them were really good, but most were average. But now, after a day or two, these stories and their characters continue to live with me. Well, not so much the stories but more the atmosphere and the places: The calm hopelessness of watching the washing machine go round and round every week. The joy of losing your body's weight when you are underwater and the colours are nothing you could have imagined before. The red dust that rises when a pickup truck drives by, and how you try not to breath it in.Don't get me wrong, a lot happens in these short stories. But for me, the most important element was the atmosphere. It was somehow never rushed, no matter what happened.Recommended for people who think they don't like short stories (like me). Just take a breath after each one, it won't feel like reading a confusing novel. Many trigger warnings, but I especially want to mention that if you have *any* fear or dislike towards dental operations, please do not read the second short story, (In Finnish called \"Tohtori H. A. Moynihan\"). It goes really horrible really fast. Also, if you can't read about alcohol or alcoholism, there is very little for you to read in this collection."}, {"userName": "Mikko Saari", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/10571401-mikko-saari", "userReview": "A fascinating collection of short stories. It's very tempting to read these as autofiction, even those where the main character is not called Lucia. They all seem very personal, lifelike and seem to reflect Lucia Berlin's biographical details to some extent. But I guess that would be an easy way out.In any case, this is an interesting look into alcoholism, some pretty weird life choices, being a single parent, doing low-end jobs to scrape a living. Miserable at times, but all the time very well written."}, {"userName": "Tuike", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/36275046-tuike", "userReview": "Novellikokoleman esipuheessa Berlinin tekstejä sanotaan säkenöiviksi. Ja sitä ne todella ovat. Upean tarkkaa kuvausta, napakasti putoavia lauseita. Näennäisen arkisen tekemisen kuvamisen lomaan Berlin tirvaisee hurjia huomioita ihmisyydestä tai elämästä, sanoo jotain ihan kamalaa, ja jatkaa sitten muina naisina kotiaskareiden parissa. Teksti pakotti ajattelemaan ja kävi tunteisiin. Ja oli niin elävää, että olen mielestäni itsekin työskennellyt siivoojana ja sairaalan ensiavussa, istunut tunteja New Mexicon itsepalvelupesuloissa, ollut katkaisuhoidossa ja sukeltanut simpukoita. Kun kokolemassa oli enää muutama novelli jäljellä, tajusin toivovani etteivät ne koskaan loppuisi. Luen tämän varmaan vielä aika monta kertaa uudelleen."}, {"userName": "Heidi", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/5893650-heidi", "userReview": "Berlinin novellit ovat juuri lukemaani absurdiin taipuvaan Uraanilamppu-kokoelmaan verrattuna hyvin realistisia. Tarinat ovat vahvasti elämänmakuisia ja pienellä vinolla huumorilla kevennetty. Berlin antaa surutta oman elämänsä paistaa läpi tarinoissaan. Tarinoissa toistuvat rakas Meksiko, katolinen tyttökoulu nunnineen, työ ensiapupolille ja siivoojana, yksinhuoltajuus ja alkoholismi, niin ja suomalaiset, jostain syystä. Erityisen vavahduttava oli aamuyön epätoivon hetkiä kuvaava Kaikki karkaa käsistä, joka kertoo pahasti alkoholisoituneen yksinhuoltajan aamusta, kun viinakaupat on suljettu, mutta ryyppy olisi pakko saada tai kohtaus iskee. Tarinassa oli sellaista omakohtaisen kokemuksen tuntua, mikä teki tästä ja monesta muustakin kokoelman novellista hyvin mieleenpainuvan. Kaiken kaikkiaan Berlinin tyyli, huumori ja aiheet miellyttivät kovasti. Tämän voisi huoletta lukea joskus uudelleenkin."}, {"userName": "JaanaMi", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/25206254-jaanami", "userReview": "Joukko kiinnostavia, rosoisia, tarkkanäköisiä novelleja, joiden kertojat ovat usein sellaisia, jotka eivät kovin usein saa omaa ääntä: alkoholisteja, katkaisuhoidoissa epäonnistuneita, sairaita, köyhiä, yksinäisiä, osattomia. Novellien avaama ja kuvaama maailma ei silti ole ainoastaan lohduton, vaan täynnä värejä, särmää, pilkettä, aistikkaita kokemuksia, pieniä ja suuria havaintoja maailmasta. Vahvan omaääninen, rakenteellisestikin kiehtova novellikokoelma, jota täytyy pysähtyä vähän sulattelemaan."}, {"userName": "Helena", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/29293888-helena", "userReview": "Ihastuttava, elämänmakuinen ja rosoinen novellikokoelma, jonka mustansävyinen huumori nauratti hetkittäin jopa ääneen. Nautin kielestä, joka kuvasi maailmaa sinänsä yksinkertaisin, mutta nasevin vedoin. Saa paikan pysyväishyllystäni."}, {"userName": "Lotta", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/12489132-lotta", "userReview": "Nyyh, piti palauttaa tää takaisin kirjastoon. Harkitsen vakavasti, että ostan tän itelleni, jotta voin nautiskella novelleista kaikessa rauhassa."}, {"userName": "Ella", "userReviewDate": "Dec 19, 2017", "userURL": "http://www.goodreads.com/user/show/16305787-ella", "userReview": "Oli hyvä. Tosin olisin laittanut jonkun toisen novellin avaamaan kirjan. Mahtavaa, että tämä on suomennettu!"}, {"userName": "Pirkko", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/75377471-pirkko", "userReview": "Syksyllä 2017 postuumisti suomeksi julkaistut Lucia Berlinin novellit ovat Valetulenkantajan blogin kirjoittajan mukaan kärpäspaperia, joihin mikä tahansa elämän ilmiö tuntuu asettuvan luontevasti. Valot ja varjot vuorottelevat, ja elämä pulssi sykkii vahvana, vaikka päähenkilöt ovat heikossa hapessa.Novellien nimet kertovat myös paljon. Angelin pesula, Ensiapupolin päiväkirja, El Tim, Riippuu näkökulmasta, Ensi kertaa katkolla, Kaikki karkaa käsistä, Sex appeal ja Kulkukorat kuvaavat jossain määrin kirjailijan elämänkulkua Alaskasta Chilen kautta USA:an. Novellit eivät kuitenkaan ole omaelämänkerrallisia, mutta kirjailijan omakohtaiset kokemukset erilaisista pätkätöistä, alkoholismista, avioliitoista, lapsista jne välittyvät niistä. Kertomukset ovat yllätyksellisiä, täynnä odottamattomia tapahtumia ja uskomattomia juonenkäänteitä. Tekstinä teos oli loppuun asti hiottuja ja viimeisteltyjä novelleja. Rumista ja epämiellyttävistä asioista on saatu luotua jotain kaunista."}, {"userName": "Taija", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/16198236-taija", "userReview": "Yleensä en niin hirveästi tykkää novelleista, koska ne loppuvat aina juuri kun on päässyt tarinaan sisään. Mutta nämä olivat hienoja tarinoita, upeasti kirjoitettuja, täynnä kuivaa huumoria. Kirjailija selkeästi ammensi aiheet omasta, vaiherikkaasta elämästään. Samat teemat toistuvat eri tarinoissa vähän eri kantilta, samat henkilötkin mainitaan siellä täällä. Älykkäitä, hauskoja novelleja, ei voi kuin suositella!"}, {"userName": "Juha", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/5699662-juha", "userReview": "Mainio kokoelma kevyesti omaelämäkerrallisia tarinoita. Lukiessa tulee välillä mieleen novellin suuret taiturit Tsehov ja Carver, mutta silti niissä on selvästi oma ääni ja tyyli. HUOM! Suomennettu kokoelma ei sisällä kaikkia samoja tarinoita kuin samanniminen englanninkielinen kokoelma. Ilmeisesti kokoelman tarinat julkaistaan suomeksi kahdessa osassa."}, {"userName": "Sari", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/4383696-sari", "userReview": "Tässä taitaa olla paras koskaan lukemani novellikokoelma: Teos on täynnä elämänmakuisia kertomuksia, jotka linkittyvät kiehtovasti sekä toisiinsa että kirjailijan omaan elämään. Lakonisia toteamuksia, lempeydellä kuvattuja elämän varjopuolia, pisteliäitä ja miltei ilkikurisia huumorin pilkahduksia. Täydellisiä aloituksia ja lopetuksia, lukijan katse ja mielenkiinto kiinnitetään välittömästi kulloisenkin tarinan ytimeen, ja novellin luettuaan on joka kerran tunne, kuin olisi ollut sisällä suuremmassakin tarinassa, kokonaisessa romaanissa. Myös suomennos on hieno!"}, {"userName": "Eero Sipilä", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/35032432-eero-sipil", "userReview": "Äkkiseltään ei tule mieleen toista kirjailijaa, jota voisi kehua mestarillisesta kielellisestä hallinnasta. Berlinin novellit maistuvat eletyltä elämältä, pölyltä ja hieltä. Ne kertovat paljon sanomalla vähän."}, {"userName": "Minni", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/5859241-minni", "userReview": "Rosoista elämää ei tarvitse välttämättä kadehtia, mutta kyllähän se antaa aineksia monensorttisiin stooreihin. Olipa näkökulma eteläamerikkalaisen touhukkaan lapsen, rikkaan kermaperseteinin tai alkoholisoituneen yksinhuoltajan, niin koukuissa ja yllättävissä lopuissa löytyy."}, {"userName": "Riikka Koo", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/63125493-riikka-koo", "userReview": "Aivan hieno. Oli ehkä ihan pikkuisen liian korkeat odotukset, kun tätä on hehkutettu niin kovasti. Ei sitten räjäyttänytkään tajuntaa mutta kannattaahan tää nyt ehdottomasti lukea."}, {"userName": "Elina Mäntylammi", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/41090767-elina-m-ntylammi", "userReview": "Loistavaa novellitaidetta, josta jää voimakkaita kuvia mieleen."}, {"userName": "Susa", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/63389207-susa", "userReview": "Juuri tällaista tekstin pitäisi olla."}, {"userName": "Tarmo Syvapuro", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/22860886-tarmo-syvapuro", "userReview": "Hyvin sekalainen joukko kertomuksia. Jotkin niistä osui, mutta suurin osa ei. Kerronta sinänsä oli ihan mukavaa."}, {"userName": "Elina Sydänmaanlakka", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/32217479-elina-syd-nmaanlakka", "userReview": "Uniikki, inhimillinen, hieno. Lukemisen, sanojen ja tunteiden juhlaa."}, {"userName": "Elina Huhtanen", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/41137020-elina-huhtanen", "userReview": "Tämä oli vähän vaikealukuinen ja poukkoilevat tekstit tuottivat itselleni hankaluuksia. En ole novelli-ihminen. Mutta mielenkiintoinen kokoelma tuokiokuvia ja kohtaloita."}, {"userName": "Hannele Pennanen", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/75830311-hannele-pennanen", "userReview": "Aivan uskomattoman hyviä tarinoita, elämänmakuinen isolla E:llä"}], "description": "Siivoojan käsikirja on kokoelma yhdysvaltalaisen Lucia Berlinin parhaita lyhyitä kertomuksia. Berlin oli jo eläessään pienen piirin arvostama mestari vaikka jäikin suurelle yleisölle tuntemattomaksi. Yhdysvalloissa 2015 postuumisti julkaistu kokoelma sai kuitenkin sekä kriitikoilta että lukijoilta hurmioituneen vastaanoton ja nosti Berlinin koko lukevan yleisön tietoisuuteen. Berlinin rosoiset, melankoliset ja mustan huumorin sävyttämät tekstit ovat hienovaraisia ja oivaltavia kuvauksia amerikkalaisesta arjesta pesuloissa, tukiasunnoissa, katkaisuhoidossa, katolisessa koulussa, hienostokodeissa ja kaduilla. Kirjasta on tullut suurmenestys myös mm. Saksassa, italiassa ja Ruotsissa.Berlin ammensi kertomuksiinsa omasta lapsuudestaan Yhdysvaltojen kaivoskaupungeissa, yltäkylläisistä teinivuosistaan Chilen Santiagossa, kolmesta epäonnistuneesta avioliitostaan, elämänmittaisesta kamppailustaan alkoholismin kanssa sekä Kaliforniassa, New Mexicossa ja Meksikossa viettämistään vuosista ja niistä monista työpaikoista, joilla hän elätti itsensä ja neljä poikaansa.", "title": "Siivoojan käsikirja ja muita kertomuksia", "url": "http://www.goodreads.com/book/show/36577200-siivoojan-k-sikirja-ja-muita-kertomuksia", "average": 4.13, "cover": "https://images.gr-assets.com/books/1510423123l/36577200.jpg", "reviews": 27, "authors": [{"url": "https://www.goodreads.com/author/show/157697.Lucia_Berlin", "name": "Lucia Berlin"}, {"url": "https://www.goodreads.com/author/show/4622901.Kristiina_Drews", "name": "Kristiina Drews"}], "type": ["Short Stories", "Fiction", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/36577200-siivoojan-k-sikirja-ja-muita-kertomuksia", "http://www.goodreads.com/book/show/37540854-siivoojan-k-sikirja-ja-muita-kertomuksia", "http://www.goodreads.com/book/show/22929586-a-manual-for-cleaning-women", "http://www.goodreads.com/book/show/270393.Where_I_Live_Now", "http://www.goodreads.com/book/show/1136390.So_Long", "http://www.goodreads.com/book/show/489536.Homesick", "http://www.goodreads.com/book/show/29472589-was-ich-sonst-noch-verpasst-habe"]}