{"ratings": 230, "userreviews": [{"userName": "M. Salahuddin", "userReviewDate": "Dec 14, 2010", "userURL": "http://www.goodreads.com/user/show/4070919-m-salahuddin", "userReview": "This is my first published book and it literally erupted from my soul at the start of 2010. Once the basic story idea took shape in my mind (which took about an hour), I was frenzied in pursuit of completing it. For anyone with a soft spot for historical fiction intertwining world events with the personal hopes, dreams, struggles and joys of the protagonist, this book provides a readable western cultural style while describing a wholly alien Muslim Pakistani and Afghani perspective. It immerses the reader in a world most Westerners only learn about through sound bites and video clips.Being a product of a diaspora and having moved from Pakistan to England at the age of 4 and then to the US a little over 20 years ago, I was especially keen to illustrate the dichotomies of perspective that often arise when two very different cultures interact. Among such interactions, misunderstanding and being misunderstood are the causes of so many \"wrong turns\" and that fascinates me. I hope you enjoy it and are challenged by it. You can learn more about my views and background by visiting http://www.sikanderbook.com ."}, {"userName": "Grady", "userReviewDate": "Jul 06, 2010", "userURL": "http://www.goodreads.com/user/show/1362506-grady", "userReview": "Insights and Explanations: A Novel of WonderWere there more novels like this astonishing, absorbing and challenging one by M. Salahuddin Khan then perhaps the confusion and chaos of the world response to the seemingly endless wars of the past decades would ease. With all the grace of an experienced writer (this is Khan's first full length novel though he has served as Publisher for Islamica Magazine, a quarterly journal that is written in English for Muslim readers as a forum for discussing current events and philosophical differences), Khan launches the reader into a maze of pathways of understanding just why we have become so confused and overwhelmed by the cross-section of Christian and Islam beliefs - and he does this in the person of an idealistic Pakistani youth (Sikander) whose life is complexly tattooed with events and coincidences, choices and commitments that lead him from Pakistan to Afghanistan to Scotland to the USA. But the most intriguing and successful part of this fine novel is the insight Khan gives to the plight of prisoner versus captor in the way he explores the Guantanamo apex of the story. In ultimately narrowing this epic to the interaction between an American soldier guard and an innocent Pakistani detainee, Khan manages to explain conflicts so basic and roots of core friendships so unique that he allows us to see the madness of war and its consequences on individuals no matter what their prior backgrounds can mean. This is a book that will affect the thinking of all who are fortunate enough to read it, providing a path to understanding and appreciation for human rights. Grady Harp"}, {"userName": "Michelle Kaye", "userReviewDate": "Sep 04, 2010", "userURL": "http://www.goodreads.com/user/show/3724634-michelle-kaye", "userReview": "M. Salahuddin Khan, Author\tSikanderKarakoram Press, ISBN 978-0-587-05288-5Fiction- Historical, Religious571 pagesAugust/September 2010 Review for BookpleasuresReviewer-Michelle Kaye Malsbury, BSBM, MMReviewMr. Khan, author of Sikander, is of Indian descent. (2010, p.571) He has lived and worked in Pakistan, England, USA, and elsewhere. Mr. Khan attended the University of Southampton in England where he got his bachelors degree in aeronautics and astronautics. He has worked as consultant, producer, designer, engineer, artist, writer, inventor, as well as, held executive positions for major organizations. Currently he calls Lake Forest, IL home. Sikander is the moving, coming of age, story of a young Pakistani man. This tale begins with Sikander in high school looking forward to college and his future, for which he has high hopes and aspirations. Sikander’s family was affluent, but fell upon hard times because of a less that credible business dealing his father made. On the brink of failure Sikander and his father have words. Distraught Sikander leaves and embarks on a dangerous and amazing new life. He ends up in Afghanistan fighting with the Afghan forces against the Soviets and makes many new lifetime friends who eventually become family. As the Soviets leave Afghanistan Sikander comes back home to Pakistan where his family meets his new Afghan wife and they settle in to upper middle Pakistani life. An interesting facet of this book is that it is presented from the Muslim perspective and covers a lot of history in the Middle East. There are numerous references to Muslim culture and it was fun for me to learn more about this complex religion and her people. It touches on the importance of family and reverence to religion as applied to the Qur’an, but far from the extremism that many in America believe is part and parcel of Islam. It is about love, commitment, forgiveness, and inner peace. I really enjoyed the learning process. As America ramps up taking over where the Soviets left off in the wake of 9/11 in Afghanistan Sikander feels compelled to bring his wife’s family over into Pakistan where they can be safer than remaining in war torn Afghanistan. It is a long and arduous trek inside Afghanistan and back. They are in the homestretch of this exodus and relocation when Sikander is shot, captured, and treated as “enemy combatant” by US forces. He is wounded, tortured regularly, and moved to Guantanamo, Cuba to see if he will finally confess to being Taliban or Al Qaeda. He never confesses and reveals little information because he was not in that loop. Beaten, battered, and bruised eventually he is freed and allowed to go back to Pakistan to resume his life with his family. The scars are deep, both physically and mentally, from his experiences with the many and various means of torture. He undergoes therapy and tries to forget and forgive, finally making peace with himself, and his tormentors, in the process. Sikander takes over the thriving family business and expands it into America where he and his extremely wealthy family eventually move because they feel the educational system is better than Pakistan for their three children. They are very happy and things are going quite well until an unfortunate accident changes their lives forever. For more insight into this incredible, fast paced, action filled novel please visit www.sikanderbook.com."}, {"userName": "Rachel Kahler", "userReviewDate": "Oct 12, 2012", "userURL": "http://www.goodreads.com/user/show/12943082-rachel-kahler", "userReview": "This book is HUGE! Not a light read, either. However, it's well worth the effort to read. The story begins with Sikander as a young man in Pakistan. He's the eldest son in an upper-middle class family. He's smart, naive, idealistic, and somewhat bored and over privileged. Sikander is 17 or 18 at the beginning of the story and somewhat antagonistic to his parents, as any teenaged boy who knows everything is. One day, his father discovers that a business associate has bilked him out of a small fortune and put the family's financial and social standing at risk. As a result, both his parents are on edge and Sikander gets in a tiff with his father, which leads young Sikander to sneak out that evening with only half a mind to run away. He takes the contents of his piggy bank and takes himself to a local place of worship. He really only wants to be rebellious, but finds himself in the company of a man, his two sons, and his two nephews, who he discovers are Afghani muhajideen in the war against the Soviet Union. His sympathy for the Afghani fighters being a point of contention between himself and his father, he impulsively asks to join them.Thus begins the journey of Sikander, from being a young, privileged, and idealistic boy to becoming family in a tiny village in Afghanistan, far from his roots financially, yet close enough to share a common bond. He experiences war and killing and wishing for peace. He grows up into an intelligent, thoughtful, and very importantly, loving adult.I learned a lot about Pakistan and Afghanistan from the Afghan/USSR war to 9/11 to the US bombings following 9/11. I learned a lot about Islam and Muslims and recent history. Even though you know that Sikander is a character in a story, it's hard not to imagine him real.My only complaint was that I read this on Kindle, and the book wanted to jump to the glossary at the back. (By the way, it's worth reading the glossary although much meaning can be identified from context in the book.) Because the book is so long, I had to get into the habit of noting the location of my reading before turning each page or I would have to skim from the last point I remembered reading from to get to where I was."}, {"userName": "Allizabeth Collins", "userReviewDate": "Nov 05, 2011", "userURL": "http://www.goodreads.com/user/show/5963757-allizabeth-collins", "userReview": "Description: In 1986, Sikander is a seventeen year-old Pakistani who dreams of going to America to study and live. But his plans are crushed when he flees his home after a disagreement with his family, which leads him to join a band of mujahideen warriors who are fighting Soviets in Afghanistan. After two years away, the mujahideen prevail, and Sikander decides to return to Pakistan and make a life for himself. Here he falls in love with and marries an Afghan woman while running a successful business. But following the 9/11 terrorist attacks in America, turmoil ensues in the Middle East, and Sikander must help his wife's family flee from Afghanistan to Pakistan, a dangerous trek that ends in Sikander's capture, torture, and imprisonment by U.S. Forces. The land he's always dreamed of is now a painful scarring nightmare that he may not survive. Review: M. Salahuddin Khan's first novel is a remarkable coming-of-age journey full of rich detail and remarkable characters. I wasn't sure what to expect when I first received it, but after a few chapters, I knew that I was reading an amazingly crafted and emotionally charged novel. The characters are realistic and well-developed, seemingly taking on a life of their own through the well-written dialogue. The details are vivid and captivating, allowing the reader to experience the Middle East as beautiful one moment and war-torn the next. The plot flows nicely and is very solid, never losing ground and keeping up the fast-pace. The style reminded me of The Kite Runner, another excellent book, and I recommend both to adults interested in the Middle East, biographical historical fiction, or those who just want to read excellent stories about life's journey.Rating: Clean Getaway (5/5)*** I received this book from JKS Communications in exchange for an honest and unbiased review."}, {"userName": "Sheila", "userReviewDate": "Jul 26, 2010", "userURL": "http://www.goodreads.com/user/show/910201-sheila", "userReview": "Sikander, a Pakistani youth who has led a comfortable upper-middle class life, dreams of one day visiting America, a country for which he has developed a great fondness. But his dreams are smashed when, after a heated family argument, he flees his home and manages to find himself in the midst of a nation’s struggle for liberation from an imperialist enemy. But joining the mujahideen warriors in their fight against Soviet oppression in Afghanistan is only the beginning of Sikander’s remarkable story that takes him all the way across the ocean to a country which was once only a part of his dreams. It is the same country that is bound to become a nightmarish proving ground for him. Join Sikander on his journey of self-discovery, loss, growth, and personal evolution as he learns what it means to live in a world as tumultuous as this. Sikander is M. Salahuddin Khan’s first effort at the craft of a novel. It is perhaps for this reason that the novel will seem even more impressive for its eloquence and quality. This remarkably well-crafted bildungsroman-style story is an excellent start for Khan, though he is no stranger to the field of writing. He has served as publisher for the “highly regarded” Islamica magazine and is respected by his peers at the online writer’s community helium.com, where his articles usually rank somewhere in the range of the top five to ten percent. Readers who are partial to coming-of-age novels, stories that involve the culture and character of the Middle East and Pakistan (specifically), or exciting, yet well-grounded works of biographical fiction will especially enjoy the novel Sikander. Also, readers who enjoy fiction related to current national and/or global struggles should definitely look for this novel on bookstore shelves this July."}, {"userName": "June Creedon", "userReviewDate": "Sep 22, 2011", "userURL": "http://www.goodreads.com/user/show/5886226-june-creedon", "userReview": "This is an amazing novel that incorporates the history of the battle between the Soviet Union & the middle east. The U.S. supplied the middle east with high tech weaponry to battle the communist regime & Operation Arrow was a success.Osama bin Laden, the non-Afghan mujahideen, returned to his native Saudi Arabia, though he was frequently in & out of Pakistan.The new threat to an Islamic state was America, the staunchest ally of the mujahideen.On Nov. 24, 1989. Azzam & his 3 sons were killed on their way to an evening prayer at the local masjid. regardless of whoever was responsible, al-Zawahiri's ascendency with Bin Laden was assured.A global jihad aimbed at establishing an Islamic state. It was called the Base, in Arabic it was called \"al-Qaeda\"."}, {"userName": "Mystee", "userReviewDate": "Sep 27, 2010", "userURL": "http://www.goodreads.com/user/show/3735647-mystee", "userReview": "http://amomentwithmystee.blogspot.com..."}, {"userName": "Tahira Shahbazi", "userReviewDate": "Feb 14, 2012", "userURL": "http://www.goodreads.com/user/show/3698008-tahira-shahbazi", "userReview": "Sikander, Sikander. Sikander the character is the best of who we all would strive to be. Sikander the book is simply fantastic, with heavy emphasis on the simply. It manages to show a point of view not often grasped or explained in today's world. I feel it manages to humanize very real and misunderstood people, concepts, beliefs and practices, which beyond the statement it makes about the world we have come to accept that we occupy, is I think perhaps the most generous and important message that comes through. It makes no bones about the fact that there are injustices in the world, and doesn't hide the fact that there a boogeymen out there, but lays ground for the understanding that there are layers and exceptions to every truth. Through Sikander's journeys and life, the author deftly weaves a beautiful message that gives this reader hope, along with a deeper understanding of how the world became the place it now is. I hope that others with less personal experience in this area than I myself have, will pick up this book and have their ideas broadened and their hearts opened to see the beauty in it. Laghar Juy is a place I'd love to see, and it's inhabitants people I'd want to adopt as my own. Sikander's victories in his journey to manhood make you cheer, and his losses throughout his life break your heart. Whether you have an interest in this part of the world, or just want to go on an adventure, pick up this book, and it will take you places you didn't expect."}, {"userName": "John M.", "userReviewDate": "Mar 22, 2012", "userURL": "http://www.goodreads.com/user/show/8333587-john-m", "userReview": "This book is wonderful and heartbreaking at the same time. It is, like M.M.Kaye's novel \"The Far Pavilions,\" two books. The first is a love story, set in an extended family with the cultural and religious traditions of Afghanistan. The second is the story of Afghanistan in the modern era. I cried and became angry, at the same time, for our ignorance of the culture and for what has and is being done in our name. This is a human story, at ground level, not at the level of a B-52 bomber. I recommend this book highly and commend the author for the research and such detail that I think I could now cross through the Khyber Pass from Pakistan to Afghanistan -- and possibly load and fire a Stinger missile. The history is precise, leaving us to wonder, as does the character:\"When did all this start and when will it end?\" Not just a good read to understand a culture --and a religious so mischaracterized in the West -- but truly a beautiful story. The Russians spent 9 years trying to subjugate the tribes of Afghanistan; the U.S. is in its 10th year. This book shows why it is futile -- and counterproductive. When will it end? (John M. Poswall, author of two novels: \"THE LAWYERS: Class of '69\" and \"The Altar Boys.\")"}, {"userName": "Nicki", "userReviewDate": "Oct 29, 2011", "userURL": "http://www.goodreads.com/user/show/5843181-nicki", "userReview": "I won this through the Goodreads First Reads program. And whew, where do I start? This is an amazing book, spanning 21 years in the life of Sikander, a Pakistani man who fights against the Soviets in Afghanistan, and later against corporate America. All of the characters were rich and developed, and by the end of the novel I was disappointed when I couldn't read about what happened next in their lives. I really liked that I could learn a bit more about Islam. I already knew most of the information presented, but it was interesting reading it from the perspective of a Muslim in the novel. And when Sikander was captured by the Americans, and tortured, it made me want to cry. I wonder how many times America has made that mistake in real life. And while I can't criticize the army for allowing it to occur (things happen in war), it made me wish war just didn't happen. I loved this book, and I would recommend it to anyone. It was just so superbly written, and it draws you in so well."}, {"userName": "Chuck", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/230791-chuck", "userReview": "This excellent work of hitorical fiction concentrates on one mans struggle and redemption in pursuit of his life as a devout Muslim. It begins after he leaves his home in Pakistan and joins the Mujahadeen in their struggle against the Russian army in Afghanistan. His many struggles are well documented in this well written novel. I appreciated the \"explanation\" of the Muslim faith and its interpretations. It was interesting to review the U.S. runup to the invasion of Iraq following 9-11 and all its consequences although, that could not be covered in any great detail since this was, afterall, not a historical or scholarly work on that subject. Those of us who would like to consider ourselves openminded concerning all religions could benefit from this very well done piece of historical fiction. An important piece of literature that won many awards probably due to its unbiased covering of a difficult topic. It also recieved many positive reviews by the average reader. A very \"good read\"."}, {"userName": "Julie Schoerke", "userReviewDate": "Oct 09, 2011", "userURL": "http://www.goodreads.com/user/show/2533486-julie-schoerke", "userReview": "I so appreciate that Mr. Khan wrote this sweeping novel that provides perspective on the recent history/current events in the Southeatern Asia/Middle East region, of which he is an expert and a host of a national radio program on this topic. I loved the Kite Runner and I recommend this to anyone who fell in love with that novelThe Kite Runner. Bravo, Mr. Khan!"}, {"userName": "Sami Jo", "userReviewDate": "Oct 07, 2011", "userURL": "http://www.goodreads.com/user/show/5470530-sami-jo", "userReview": "There are so many misconceptions among Americans in regard to Middle Eastern culture and history - especially since 9/11. Salahuddin Khan opens discussion about these topics through his fictional tale of Sikander, and delivers his message in a miraculous way. Although it hits on serious issues, the story is captivating, and will definitely leave you thinking and feeling differently than you did before reading. His research and experience definitely shows! I highly recommend this!!"}, {"userName": "Susan", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/5132374-susan", "userReview": "This was a truly fine book that all Americansshould read. It provides lessons in political history, Islam, Afghanistan and Pakistan - allthrough the eyes of one very likeable man,Sikander. We follow him through youth inPakistan, fighting Russians in Afghanistan,falling in love and marrying, and finally as theinnocent prisoner of the American military after 9-11."}, {"userName": "Vibina Venugopal", "userReviewDate": "Mar 22, 2013", "userURL": "http://www.goodreads.com/user/show/11357188-vibina-venugopal", "userReview": "In a quiet household of Peshawar Sikander was a normal teenager pumping high on adrenaline, but then one day as a result of an argument with his family wherein they choose to sort things out through physical violence..Call it fate or play of destiny he stumbles upon a Afghan Mujahideen group who brain wash him to fight against Soviet..Torn between turning back to family to face their wrath or to play along , he chooses the later..Living through the war zones he realises how it is to be actually living a life of war rather debating staying in the comfort zone referring various intellectual theories and philosophies..But good part was he meets a girl who captivates his heart and mind...Later he is chosen for a training on Stinger Missile funded by Britain...In heaven (Scotland) he learns to create hell (war) rather an irony that he slowly discovers as the way of life..With America's helpful indulgence in terms of weapon all that ends in a positive note as far as Sikander is concerned..Sikandar returns home for the delight of the family with his Afghan girl.. Sikandar dreams for a beautiful life and it starts of that way with his ever loving wife and his flourishing career until 9/11...Sikandar is also falsely convicted like many others as Taliban...Confused and distrust spreads like a wild fire..Afghan becomes a victim of yet another suffocation life, after Soviet they (Afghan people) hope for a life of that of peace and happiness expecting a base line of normalcy but Taliban brought with a harsher life style stricter for women Afghan people in general..Pakistan was dictated to snap off all ties with Afghan and US taking over it in the name of restoring peace only worsened things..Even withdrawing the troops from the country by Obama last year raised many questions all around..Yet the way things disrupted a common man's life is beyond any nightmare..Sikandar is gripping and absorbing tale for a person who wants to learn about the side of the coin...From a life of a priviledged family of Pakistan Life of Sikandar goes all over globe, from his hometown Peshawar to Soviet war torn Afghan, to beautiful Scotland to the camps of Gauntanamo finally to America The country that always fascinated him... This book opens us to world of love, freedom,constraint, discrimination, hate, violence, war, loss, aspiration, disgrace, honor, hope and salvation..First part of the book deals gets us the glimpses of the cold war fought between the Soviet led Afghan and the against multinational insurgent groups called Mujahideen, the effect on the civilians and the consequence of the war itself...This books leaves many questions unanswered that would leave us desperate and saddened..The extreme actions taken in order to strip of terrorism ,can they justified?? Did that really work to serve the cause also about the atrocities upon the common man in Afghan their plight that they had to live for no real reason, though these actions could never been undone still they would serve as a reality check.."}, {"userName": "Anand ", "userReviewDate": "May 24, 2012", "userURL": "http://www.goodreads.com/user/show/8957806-anand", "userReview": "This monster of a lengthy book, coupled with the novelty of language and culture from Afghanistan and Pakistan, ensured that I took close to a week to finish this finding time from daily life. I was not sure what to expect from an unknown Pakistani author, and I purchased this book experimentally. I am glad I did. The story spans a period of about 30 years or so in the life of an upper middle class teenager from Pakistan. If there was ever a masterful, epic narrative describing how eventful someone's life can be, it is this. The story begins from a regular day in the life of a high-school student, and traverses a horizon that is too awesome to grasp. From a confused teenager, to a soldier young-adult, to a respectful and intelligent young man always ready to tackle responsibilities and liabilities of life, to a wrongfully and misunderstood tortured prisoner, only to ultimately still emerge as the epitome of humanity, Sikander's life is exemplary. Apart from the apparent poignancy of this touching story, the author has wonderfully entwined historical facts into this fiction. In fact, as a reader I was provided with a refresher-course of the 1980s mujhaideen offensive against Soviet Union's \"mis-adventure\" in Afghanistan, and then the later emergence of the so called \"Islamic\" terrorism finding its roots from aL Qaeda, about Taliban, Kuwait and Iraq, and finally the first decade of the 2000s that saw America's \"shock and awe\" approach to \"smoke them out\" in a post 9/11 world, this novel covers all of that without being stale, boring or dated. If anything, it was hugely interesting, vastly entertaining and a brilliant work of fiction-thriller-adventure! In doing so, the author manages to reasonably stay clear of making any political comments, which given the extremely sensitive background is commendable.The pace of the novel is extremely fast, with days, weeks and months flying-by. The only disconcerting issue, if I could be audacious enough to point, with this novel is that many a times \"scenes\" shift abruptly. In one para we are reading about something, and in the next the scene/setting suddenly changes. I think it is something that can be achieved with editing. The chapters towards the end of the novel have sufficient paragraph separaters (which in this novel is a small symbol); similar proofing and editing in the first half will only make the narration \"tauter\". Finally, I can mention that the language is more 'American English' than UK or sub-continent English, clearly because of the author's residency in the US over the years.I will remember this story for a long time to come!"}, {"userName": "Marissa DeCuir", "userReviewDate": "Oct 17, 2011", "userURL": "http://www.goodreads.com/user/show/2967349-marissa-decuir", "userReview": "There are too many good things to say about this book. Not only is it one incredible read, but the story is so meaningful - particularly in today's society - and one that needs to be read nation, and world, wide."}, {"userName": "Seth Thomson", "userReviewDate": "Feb 09, 2012", "userURL": "http://www.goodreads.com/user/show/2834039-seth-thomson", "userReview": "I really enjoyed this book. The main character, Sikander, represents the best of us, and the setting is alien and familiar at the same time. This book is long, but worth the time investment."}, {"userName": "Penelope (The Reading Devil)", "userReviewDate": "Mar 20, 2012", "userURL": "http://www.goodreads.com/user/show/5051982-penelope-the-reading-devil", "userReview": "Review is on its way! :)"}, {"userName": "Barbara Bohn", "userReviewDate": "Nov 24, 2012", "userURL": "http://www.goodreads.com/user/show/14828064-barbara-bohn", "userReview": "Some interesting insights of the Muslin culture. The glossary in the kindle edition is very helpful."}, {"userName": "Zohar - ManOfLaBook.com", "userReviewDate": "Mar 17, 2012", "userURL": "http://www.goodreads.com/user/show/3780991-zohar---manoflabook-com", "userReview": "Sikan­der by M. Salahud­din Kahn is a fic­tional book which chron­i­cles the life of a Pak­istani man and how it changed after 9/11. While this book could be con­sid­ered a com­ing of age story, I believe it is more.Sev­en­teen year old Sikan­der is stu­dious Pak­istani who dreams of Amer­ica. His plans change after a rag­ing quar­rel with his fam­ily which prompts him to leave home. End­ing up as a mujahideen war­rior in neigh­bor­ing Afghanistan, Sikan­der fights the Sovi­ets and due to his lan­guage skills is picked to go to Scot­land in order to learn Stinger missiles.As the Sovi­ets retreat, Sikan­der returns to a life in Pak­istan, mar­ries a beau­ti­ful Afghani woman and becomes a suc­cess­ful busi­ness­man. How­ever, Sikander’s life is thrown into tur­moil after 9/11 when, through unfor­tu­nate coin­ci­dences, his trip to Amer­ica is more per­ilous than he envisioned.Sikan­der by M. Salahud­din Kahn is not only inter­est­ing, fas­ci­nat­ing and well writ­ten, but also an absorb­ing glimpse into the daily lives of mod­ern Mus­lims. The cul­tural insights of the book were delight­ful and you will find your­self immersed in them from the beginning.Mr. Salahud­din brings fore­front the chaos and con­fu­sion which cause the pro­tag­o­nist, Sikan­der, both grief and joy. As with other nov­els I enjoyed, Sikander’s life inter­twine in world events beyond his con­trol. As with many of us, we find that very rarely are their big, defin­ing moments, but only small ones which come together to tell the story of our lives.The book also explores the con­se­quences and impacts wars have on both sol­diers and indi­vid­u­als. With the exploita­tion of the “War on Ter­ror” in the media and the short­ened sound-bite atten­tion span, it is easy to for­get that there are actu­ally peo­ple involved and that it is not merely video games played on green screens with big boys toys.As the geo-political sophis­ti­ca­tion of many Amer­i­cans grew so did the acknowl­edge­ment that not all, if not most, of Mid­dle East­ern­ers are “bad”, so did Sikan­der. From a Pak­istani boy to the patri­arch of his fam­ily, from a strug­gling stu­dent to a suc­cess­ful busi­ness­man. Through the eyes of the pro­tag­o­nist we read about com­ing of age in a time of war which first as seen as a bless­ing, then as a curse and ends up, as all things in life – a com­bi­na­tion of both.His­tory and con­flicts can be told from sev­eral angles. The big pic­ture gives the reader some con­text, but to get deeper under­stand we have to delve to per­sonal sto­ries in order to put events within said con­text. The book will give you a dif­fer­ent per­spec­tive of the Afghanistan/Pakistan region. The cul­ture, con­flicts, cui­sine and most impor­tantly – peo­ple – all come through to vivid life.For More Reviews and Bookish Posts Please Visit: http://www.ManOfLaBook.com"}, {"userName": "ILoveBooks", "userReviewDate": "Oct 21, 2011", "userURL": "http://www.goodreads.com/user/show/4177633-ilovebooks", "userReview": "Sikander is the main character and, when the reader first meets him, he is full of hope for his future and pretty young. Due to bad circumstances behind his families control, Sikander's family falls on hard times. When Sikander and his father discuss this, they argue and Sikander takes off. Sikander goes to Afghanistan and fights with them against the Soviets, he later marries an Afghan woman. When he returns to Pakistan, he is able to live comfortably. The story takes off from there.The reader will love this author's fresh perspective on the Middle Easy and the lifestyle and culture of the area. Sikander's character is upfront and honest, the reader will experience the environment through his eyes, nothing is held back. As a character, Sikander is honorable, brave, and determined. He is very easy to connect with and like, he also appears dynamic...realistic. The secondary characters can make the reader feel as if he/she met them in real life. They round out the story. The events are fast-paced, exciting, and should be interesting to any reader remotely intrigued by history and current events. This book is recommended to adult readers."}, {"userName": "Malahat Qureshi", "userReviewDate": "Dec 04, 2011", "userURL": "http://www.goodreads.com/user/show/7113050-malahat-qureshi", "userReview": "Normally I stay away from fiction novels and keep my head down to history related books, I know the author very closely and know his potential and vision I start reading Sikander, since my roots from the same region I can relate to most of the data available in this excellent novel, This is a tale where you find history, current politics, and unrest in society which effecting a common people like us. This book not only a good read but in fact a good place to start a dialogue between major religion to find a common ground to accept each other with respect and harmony."}, {"userName": "Lynn Abbey", "userReviewDate": "Aug 09, 2012", "userURL": "http://www.goodreads.com/user/show/3188210-lynn-abbey", "userReview": "I picked this one up on a whim because it promised to open a window into the day-to-day life of an \"ordinary\" Pashtun Muslim. In almost every respect the book delivered what it promised, although by the end of the book I'm not sure that Sikander was an \"ordinary\" anything. Still, Khan did an admirable job of creating context for interactions that can seem quite alien to a middle-class American woman's eyes."}, {"userName": "Linda", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/896512-linda", "userReview": "Best I've read in a long time. For a factionalized account of life in Afghanistan and Pakistan just before and after 9/11, this novel explores the life of regular people caught up in unusual times. Do we really need to wonder why some in that part of the world harbor real resentment toward the sanctimonious western world brought to life in Jim Mahler?"}, {"userName": "Robert Miller", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/38999433-robert-miller", "userReview": "Historical novel set in the very recent past. Like most Americans, I know much less than I should know about the cultures of Afghanistan and Pakistan and about Islam. The characters in the story provided a perspective new to me. Well worth reading."}, {"userName": "Joey Wiley", "userReviewDate": "Sep 09, 2012", "userURL": "http://www.goodreads.com/user/show/12683309-joey-wiley", "userReview": "Very good book that portrays the Afghanistan and Pakistan cultures and sheds a new understanding on their life and values. The ending shows the power of forgiveness."}, {"userName": "KO", "userReviewDate": "Aug 10, 2010", "userURL": "http://www.goodreads.com/user/show/819075-ko", "userReview": "2.4 stars."}, {"userName": "Cathy", "userReviewDate": "Oct 21, 2013", "userURL": "http://www.goodreads.com/user/show/11230382-cathy", "userReview": "An eye opening read. The author incorporates so many different facets of history, the Muslim religion, daily life and on and on... Great character development in Sikander esp."}], "description": "It's 1986, a time when Ronald Reagan's commitment to the mujahideen of Afghanistan is steadfast. It leads 17 year-old Pakistani student, Sikander, to admire just about everything American and while yearning for the freedom of his ethnic Pashtun brethren in Afghanistan, he also longs to study and live in America. But when Sikander shames his family by being naively indiscreet about their financial difficulties, the resulting verbal lashing from his mother and overbearing father, who also strikes him physically, provokes Sikander into leaving the comfort of his upper middle-class Peshawar life. Unclear about his next steps, Sikander spends the night in a nearby mosque. The following morning he comes across a handful of visiting mujahideen. After brief introductions, they try to persuade him to join their struggle. Torn between returning to face his family once more and serving his passion for their cause, he accepts and soon, they are on their way by mule across the mountains to their remote Afghan village of Laghar Juy. Once there, Sikander takes part in several skirmishes against the Russians, but he also meets Rabia, an independent, largely uneducated, but sharp-witted village girl, for whom he begins to have feelings. After two years of bitter fighting, decisively aided by America's long-awaited Stinger missiles, Sikander and the mujahideen prevail. Victory and the prospects for peace underscore the growing love that Sikander and Rabia feel for each other and inevitably, they marry. With new-found dignity and meaning in his life, Sikander takes Rabia back with him to Pakistan, hoping for reconciliation with his parents. They, it turns out, are regretful of having driven Sikander away, proud of their son's role in the mujahideen victory, and overjoyed at his safe return. They are also thrilled to have a new daughter-in-law.The years pass as Sikander becomes a prosperous entrepreneur, a devoted husband to Rabia and eventually, a loving father to their children. But throughout this time his dream of living in America endures, until that is, late one September evening it's tragically shattered as he and his family members witness live on CNN, the horror of 9/11. When America's military response has her country squarely in its sights, Rabia urges Sikander to do something to help her family to flee for the safety of Pakistan. Assisted by old military friends from the Soviet era, Sikander slips across the border to persuade his wife's family members—some of them now Taliban—to leave with him. They agree and although they do manage to escape, Sikander, while briefly separated from his companions, is not so lucky, a fact that places him on a collision course with the country he's always dreamed of—America.", "title": "SIKANDER", "url": "https://www.goodreads.com/book/show/15938623-sikander", "average": 3.86, "cover": "https://images.gr-assets.com/books/1346417998l/15938623.jpg", "reviews": 42, "authors": [{"url": "https://www.goodreads.com/author/show/4109114.M_Salahuddin_Khan", "name": "M. Salahuddin Khan"}, {"url": "https://www.goodreads.com/author/show/7454437.Akbar_Ahmed", "name": "Akbar Ahmed"}], "type": ["Historical", "Fiction", "Cultural", "War"], "outlinks": ["http://www.goodreads.com/book/show/15938623-sikander", "http://www.goodreads.com/book/show/13600257-sikander", "http://www.goodreads.com/book/show/8545788-sikander", "http://www.goodreads.com/book/show/8715398-sikander"]}