{"ratings": 27, "userreviews": [{"userName": "Mark Woods", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/4786869-mark-woods", "userReview": "It is a fact that some of the best written fantasy fiction is that in which the reader almost can't tell that he or she is reading fantasy. This is why authors such as Robin Hobb and George.R.R.Martin have become so successful- their fantasy novels are so believable that you become caught up and totally ensnared in their worlds!So it is for Silent Heart. This was the first book I have read by this author but it left me hungry for more!Paige is a just young deaf girl living in the woods when she literally stumbles across a group of assassins in the process of decapitating an unknown man. Fleeing for her life and pursued by these armed killers, Paige falls into the arms of Stone; a warrior sworn to protect and to serve. He guards her and protects her from harm and, when he realises what it is she has seen, devotes himself to escorting her back to the palace of King Evard. For the man the assassins killed was a Prince and Stone knows that the killers will not stop until the last witness to their actions is silenced forever. What follows is an epic and dangerous journey as Stone gives up everything to keep Paige safe...This was an absolutely amazing read! It is brutal, harsh and highly emotional but never anything less than compelling. I could not put this down and simply cannot recommend it enough! The descriptive passages are so amazingly well done that you feel as though you are there living the story with the characters, it simply is that believable! To say that this is an emotional journey would be an understatement but one thing is certain, authors as good as this don't come along very often and if you don't pick this up you will definitely be missing out!Susan Simone proves with this story that she is a veritable tour-de-force and definitely a name to watch in the future. If any of her other novels end up being as well written and as cleverly thought out as this one, she deserves every success she gets ~ she has an inimitable style all of her own and I, for one, already consider this one of my best reads so far this year!"}, {"userName": "Joy", "userReviewDate": "Jul 14, 2013", "userURL": "http://www.goodreads.com/user/show/3280955-joy", "userReview": "[A warning. The beginning of this novel deals with the torturous murder of a man the same way it deals with Paige’s rape, with a brutal and frank reality that will leave you breathless. But don’t let that stop you, thankfully the actual events are written in short duration. (hide spoiler)]"}, {"userName": "Amanda Lyons", "userReviewDate": "Feb 19, 2013", "userURL": "http://www.goodreads.com/user/show/3216610-amanda-lyons", "userReview": "Silent Heart is the story of one woman's quest to do what's right in the face of a great deal of uncertainty and upheaval. A witness to the murder of a stranger, Paige is soon swallowed up in a conspiracy that threatens her very life (In a very real way Paige has lived in her own world, she is deaf and speaks her own language made up of hand movements and occasional vocalizations.)and everything in it. Protected by a man she hardly knows she is pulled on a long journey that will change the way she sees the world and challenge her to be stronger than she has ever been asked to be.This has been one of the better reads I've had in a while chiefly because the protagonist,Paige, is such a strong-willed and funny person. Not only that, she has a healthy sense of realism something a lot of romance novels tend to leave out, often to their fault.I liked Silent Heart because it's one of those books that gives you a window into the lives of people facing some of the biggest crises of their lives and beating the odds, not because they're endowed with superpowers, but because they are capable of seeing their own strengths and using them to get what they want.Paige could easily have been just another romantic heroine throwing herself on the hero but instead she utilizes her strengths and forces others to recognize theirs. She also faces a lot harder circumstances than many women face and her response to that challenge is every bit as realistic as it would have been in real life. Simone is a great writer and her prose flows nicely. Once you get into the stronger themes of the story it's pretty easy to get sucked in for long periods and many hardcore readers could swallow this one up in an afternoon given the right amount of time and speed of reading. I'm looking forward to reading anything else she has to offer because she offers such interesting characters and based on both this book and the snippets of writing and synopsis I've seen(she's been posting them on her Facebook page, go check them out!) she has a great sense of subtlety and realism in her work even when some of the events have an edge of the fantastic to them. I hope you'll give her a shot and enjoy it as much as I have!"}, {"userName": "Sarah Weekly", "userReviewDate": "Feb 21, 2013", "userURL": "http://www.goodreads.com/user/show/17684716-sarah-weekly", "userReview": "I don't often rate books, but I know Susan is a new author and I did really like the book. There are a few minor issues including a too quick lead into the action that make it evident this is a new author's first book, but overall it was a great story. The characters are believable with very real emotions. The story is heartfelt with heart-wrenching details in some of the darker places making me wonder how much of this was channeled from her own life. It can be very graphic at times, but I kinda liked it. Made me see things like rape from the other side. The exploration of the way Paige views the world is fascinating. My grandmother is deaf so I know by the writing that the author is not deaf. (deaf people don't use the same subject-verb order hearing people use...sign language doesn't work that way) Still she captures some very intuitive perceptions of life as a deaf woman. The ending was perfect for these characters. As an avid reader I always want to hear more about what happens later, but a sequel to this just wouldn't work. This is an excellent first book and I can't wait to see how the author grows with her next books (not too long of a wait I hope). Very rarely do we get the chance to be among a book's first readers. This is not an opportunity to miss. I highly recommend this."}, {"userName": "Tt", "userReviewDate": "Jan 21, 2014", "userURL": "http://www.goodreads.com/user/show/9934801-tt", "userReview": "Why have I not heard about this book...this author before now? Wow, I just loved this story! I really love reading about characters who have issues or are put in situations that seem impossible to overcome and see how they fight through it all. This book gives the reader all of the above and threw in a sexy sweet and patient hero and wham!....you have a great read! This book was in an era that seemed old and yet oddly contemporary too (odd in a subtle, yet good way). I never really understood what info they thought she had but in the scheme of things it wasn't all that important because the story was all about how these characters faced the hardships and how they overcame them. Loved the fantasy that threaded through the book with Rinald and Bear. I would seriously have loved another book about Stone and Paige but am really so happy with where it ended too. I am a huge fan now and so very glad I found this book and this author!"}, {"userName": "Jill", "userReviewDate": "Aug 11, 2013", "userURL": "http://www.goodreads.com/user/show/15595737-jill", "userReview": "A historical bodice-ripper with a heroine who is completely deaf and who uses sign language to communicate. It is a good well-written story and the deaf bits were mainly credible although I'm not sure that anyone could tell that there were 6 horses coming their way just from the vibrations in the ground. It might be possible! There are some gratuitously nasty bits with far too much detail. This is why I have only given it 3 stars.It has a very happy ending which is great."}, {"userName": "Erin Kyle", "userReviewDate": "May 01, 2015", "userURL": "http://www.goodreads.com/user/show/18509068-erin-kyle", "userReview": "Oh, boy, was this an emotional roller coaster. Definitely will be reading more by Susan Simone in the future. (Looking up her repertoire now...)I definitely would recommend this."}, {"userName": "Natasha Jackson", "userReviewDate": "Feb 23, 2013", "userURL": "http://www.goodreads.com/user/show/14014599-natasha-jackson", "userReview": "I really enjoyed this book. I laughed and cried. I thought the conversations they had were off. It didn't sound like she was deaf. However, it didn't matter the overall story was too good."}, {"userName": "Eboshi", "userReviewDate": "Jun 19, 2014", "userURL": "http://www.goodreads.com/user/show/32318948-eboshi", "userReview": "Nice one! Very violent scenes though..."}], "description": "Paige was alone when she saw them...Deaf from birth and separated from her twin brother, she lived alone in her silent world. When she witnessed a murder it thrust her headlong into a whirlwind she never dreamed; running for her life from dangerous men out for her death, and only a handsome stranger to help her and show her just how strong she could be along the way.", "title": "Silent Heart", "url": "http://www.goodreads.com/book/show/17382340-silent-heart", "average": 4.26, "cover": "https://images.gr-assets.com/books/1361163017l/17382340.jpg", "reviews": 9, "authors": [{"url": "https://www.goodreads.com/author/show/6941373.Susan_Simone", "name": "Susan Simone"}], "type": ["Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/17382340-silent-heart", "http://www.goodreads.com/book/show/18743178-silent-heart", "http://www.goodreads.com/book/show/17793764-under-a-twisted-moon", "http://www.goodreads.com/book/show/20749346-morning-song", "http://www.goodreads.com/book/show/27738943-for-love-of-leelah", "http://www.goodreads.com/book/show/18147100-other-worlds", "http://www.goodreads.com/book/show/23271136-rejected-for-content"]}