{"ratings": 1094, "userreviews": [{"userName": "Shaun Hutchinson", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/2870295-shaun-hutchinson", "userReview": "This was a hard book to read. Where Frontlines was mostly concerned with getting Rio, Rainy, and Frangie through training and into the war, Silver Stars focuses on the real meat of the war. The death and hopelessness (and heroism) of it all. There are scenes that are just brutal to read. But they're so worth it in the end. Unlike many middle books, this didn't feel like a book that was trying to kill time until the conclusion. This book felt like the most important book in the series.My only real complaint is that too much time was spent with Rio and not enough with Rainy or Frangie (especially Frangie). As a result, Frangie's story didn't feel as fully realized as it could have been. I hope Grant will allow us to spend more time with her in the third book."}, {"userName": "Charlie", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/25609617-charlie", "userReview": "4.5 starsLike:- I care about these characters SO much and I genuinely want them to be safe.- I managed to read this almost 600 page book in 3 days because there were many exciting scenes that made want to read on and read just one more chapter. - I thought this was going to be a duology, but apparently there is going to be one more book. YAY! - The title of this book actually made sense towards the end of the story and it made my heart swell. All of characters' stories really came together. - It's so cool to see how the war impacts the characters' outlook on life and death. They feel like they can't just go back to their old life, because they've changed completely. - Grant made a good choice with creating three characters with such different backgrounds. He can show how much their experience differs from each other during this journey.- There are letters interspersed throughout this book as well as journal entries. This whole story is told by one person looking back on the war and adressing the reader as 'Gentle Reader'. Those parts have to be my favourite.- Rio (one of the main characters) and her squad are my FAVOURITES. The way they stick together and overcome all of these obstacles as a team is incredibly heartwarming.- The descriptions are so visual. I could see all the events in this book playing out right in front of me.- There goes a lot of research into this series. You can see it when you look into the bibliography at the end of the book as well as the author's note. I honestly feel like I'm learning about the WWII. This is a HUGE compliment to the author on my part, because I've studied WWII since elementary school. I went to elementary school in Belgium and high school in the Netherlands, so I've learned a lot about it.Dislike:- The fact that I had a hard time coming up with anything I disliked says a lot, but I don't feel like this is a five star read for me. I can't exactly pinpoint why, but it didn't blow my mind or made me really emotional at any point. A well-deserved 4.5 stars, though."}, {"userName": "Sarah", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/3344685-sarah", "userReview": "If you thought Front Lines was good then you've honestly not seen anything yet because Silver Stars ups the stakes in every way possible, the danger is greater than ever and the characters have completely come into their own. If you're new to this series then I'd recommend reading the books in order but to give you a brief recap this is an alternative history of WWII imagining one major change - that female soldiers were recruited into the American army and served alongside the men on the front lines. Pretty much everything else is accurate to what really happened and these books are so well written and believable that you actually feel like you could be reading someone's personal diary as they tell you their own life story.We continue to follow the stories of the three main characters introduced in the first book. First you have Rio Richlin who joined the army with her best friend Jenou after finding out her sister was killed in action. Then there is Frangie Marr who signed up as a medic mainly because her family needed the money, she faces even more prejudice than the others because not only is she a woman she's also black and racism was very prevalent during this time. The third main character is a young Jewish woman Rainy Schulterman who joined the army with the intention of shooting nazis but was quickly recruited into the intelligence community. Each girl has a separate story to tell but there are times when their stories link and I love getting to see the war through their very different experiences.Rio has been fighting on the front lines for a long time now and she's rising up through the ranks because of her experience. She's become quite a ruthless fighter and has had to try and lock her emotions away but she feels a growing distance between her and her best friend and she's struggling to cope with everything that she's seen and done. As a medic Frangie is right there at the front too tending to wounded soldiers who wouldn't have much of a chance without immediate treatment. Her job definitely isn't a risk free one and she constantly finds herself facing danger while trying to protect others. Rainy has the most dangerous job of all though and is sent on an undercover mission to Italy, she has no backup and not much of a plan on how she's supposed to get herself home again so her story is fraught with danger and she suffers badly when she's captured along the way.I have totally fallen in love with all three of these girls, I feel their pain and suffer alongside them and I'm desperately hoping they'll all make it through the war alive but we're constantly being shown how much danger they're facing and I'm worried that at least one of them won't survive it. I don't think I can praise this series highly enough, it's dark and can be quite painful at times but it's also totally addictive and utterly absorbing. Michael Grant has done a stellar job with these books, you can tell they're meticulously researched and they really are a must read.Source: Received from Egmont in exchange for an honest review"}, {"userName": "Skip", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/1389748-skip", "userReview": "[to get their deserved Silver Stars (hide spoiler)]"}, {"userName": "Lizzy (Bent Bookworm)", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/5980838-lizzy-bent-bookworm", "userReview": "OMG I thought this was a duology! Waaaaah. Now I have to wait for conclusions...RTC."}, {"userName": "Rachel  (APCB Reviews)", "userReviewDate": "Oct 15, 2016", "userURL": "http://www.goodreads.com/user/show/12502667-rachel-apcb-reviews", "userReview": "As much as I enjoyed this book, there was something about it that just didn't entertain me as much as I'd hoped.Grant continues to seamlessly marry fact and fiction, history and creativity into a compelling story of women fighting in World War II. The writing delivery in \"Silver Stars\" is as cold and distant as a war story would be told. The character growth from book one to two is astounding yet plausible. Grant did a great job really showing how the events in these women's lives have hardened their personalities. This book was replete with action and (rightly so) low on romance and humor. All I can really say is that the book was good, not great. A fitting sequel to the series, perhaps my love for the series has just waned."}, {"userName": "Bee (Heart Full of Books)", "userReviewDate": "Jan 18, 2017", "userURL": "http://www.goodreads.com/user/show/18364457-bee-heart-full-of-books", "userReview": "Not as good as the first one, but I think I just missed the training montages! Rainy was probably my favourite POV in this story, which is pretty much the opposite of the first book. She got to be a spy running around Italy though! SO COOL. Things are getting serious for Rio, so it's getting harder to enjoy her sections - they're still interesting, but there's a lot of self-doubt there, and her relationship with leadership in general, is, I'm sure, accurate to feelings at the time, so I'm really pleased that Michael Grant is fitting in all of the complexities of being at war!"}, {"userName": "Sarah", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/12204609-sarah", "userReview": "Fuggin brilliant."}, {"userName": "Dash fan ", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/61989809-dash-fan", "userReview": "Silver stars is the second book in a series of 3.However I wasn't fortunate to of read the first book so I found it a little bit daunting. The characters had allready developed and their journey began so it was a little confusing to start with until I got the gist of it.This book is very well researched and I felt the emotions and rawness of the war and it has been portrayed very well.I can feel the characters pain and how the war has changed each women.It's nice to read a book that shows what it was like for women in the war as they played a huge part but it isn't always mentioned. So I applaud Michael for this.Rainy, Frangie and Rio are the three main characters and we see their journey progress throughout the army and different jobs within the army.It's not an easy journey and we witness the sexism and racism within that era.I would recommend reading Silver Stars, but I highly recommend reading the first book.I did enjoy reading this book as I have always been fascinated with the history of the war. If I had of read the first book I'm sure I would of enjoyed this more as I wanted to get to know the characters more.I received this book from the Publisher in exchange for a honest and fair review via NetGalley."}, {"userName": "Drew", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/22104588-drew", "userReview": "“This is the story of three young women who fought in the greatest war in human history.”\nIf you want to read an absolutely amazing Young Adult WWII book, I highly recommend the first book in this series, Front Lines. If features a beautifully diverse cast of characters, following a Jewish girl, an African-American girl, and a white girl, who all have one thing in common: they are strong young women ready to serve their country.This series is fictional in part, because although these \"soldier girls\" did exist during the 1940s - thousands of women served in the war, whether it was in the navy, WASPs flying military aircraft, or bandaging the wounded - women weren't put on the front lines in combat back then. Grant takes a look at \"what if\" - what if women were put through the exact same brutal, grueling circumstances as the men, drafted, sent away from their families, and thrown straight into the heart of the war against Germany?The first book worked so well for me. It was intense, made me furious at the sexism the characters had to endure, and was unbelievably realistic. Grant never portrayed war as some exciting, glamorized thing, but he did show that these young women - and their fellow soldiers - were nothing short of heroes, and I couldn't help feeling awed by them.I wish Silver Stars had worked for me so bad. I'm starting to think Grant has a knack for writing amazing first books in series - like his crazy sci fi thriller, Gone - but the rest of the books just aren't as good. The following books in the Gone series lacked the pull the first one had, and Silver Stars was so much more cheesy and boring than its predecessor.From the first few chapters, I was struggling to tell the narrators apart. I kept asking myself, \"Huh? Which one's Rio again? Is she the Jewish one?\" And sadly, the plot fell short for me. I was excited at the prospect of a spy mission on enemy territory, but Rainy's mission was so cheesy and unrealistic. More time was spent thinking about her boyfriend overseas than winning the war.I finished this book feeling like it wasn't terrible, but completely unnecessary. Front Lines would make a fantastic standalone, and I still hold that story close to my heart, but this sequel just didn't live up to the first one's top-notch quality."}, {"userName": "Yapha", "userReviewDate": "Aug 27, 2016", "userURL": "http://www.goodreads.com/user/show/3722795-yapha", "userReview": "Following immediately after Front Lines, we follow Rainy, Frangie, and Rio from the battles in North Africa to Italy and Sicily, where the bulk of the European fighting is now occurring. I didn't think it was possible, but it is even better than the first (though you really need to read the series in order!). They are moving up in rank and responsibility, though not always willingly, as their experience in the Army progresses.Grant gives a realistic portrayal of what life would probably have been like in a co-ed armed forces of the time, complete with unvarnished examples of racism and anti-Semitism. I'm looking forward to the third book in the series, even though I have a very long time to wait. Highly recommended for grades 8 & up.eARC provided by publisher via Edelweiss"}, {"userName": "Barbara", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/1456717-barbara", "userReview": "3.5 Stars. This is a terrific trilogy. It's an alternative series where woman were allowed in combat during WWII. The books follow three young women on their way to war. While I felt that the individual campaigns were well written and the female characters were 3D and worthy of Grant, I thought the make characters and the end fell flat. That being said, read it. I anxiously await the final installment."}, {"userName": "Juliet-Camille", "userReviewDate": "May 22, 2016", "userURL": "http://www.goodreads.com/user/show/28476785-juliet-camille", "userReview": "I'm really excited to see where this next book takes the seriesMore RainyAnd FrangieAnd Rio"}, {"userName": "Wisty", "userReviewDate": "Sep 02, 2016", "userURL": "http://www.goodreads.com/user/show/5586918-wisty", "userReview": "[ \"And hell itself, which the Krauts called Buchenwald\"  (hide spoiler)]"}, {"userName": "Cecilia", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/5586781-cecilia", "userReview": "I am currently a mess of emotions. Words can not describe how I feel and felt while reading this book. I didn't think that the sequel could surpass the first one, but this exceeded all my expectations. Grant poignantly painted life as a soldier in WWII. Every description was vivid and took me to another world. Frangie, Rainy, and Rio are all equally loved in my heart and each story left me in tears. \"I was a girl. I was just a girl. And after a moment's reflection, she silently adds, past tense?\"  Rio has definitely evolved since she left Gedwell Falls in the beginning of the first book. She is a woman of valor, loyalty, and she's one kick butt soldier.  \"I'm playing a role now. I'm an actor playing the role of warrior.\"  I love the addition of her  koummya   \"The koummya slides easily out of its scabbard. Rio stabs upward, right into his belly.\" These are two parts of Rio's story that I had to put the book down for: \" Two men are standing, one holding a pistol. One man lies on a blanket with a flyer's jacket thrown over him. But his face is visible in the moonlight. Strand Braxton.\" \"A single bullet hits Tilo's half-severed arm, knocking it free of the arties and tendons holding it. The arm lies on the cobbles, seeming to point at Rio...The sniper fires a third time. A fourth time. Tilo falls backward now. The loaf of bread in his shirt is soggy with blood. 'You f***ing Kraut a**hole, he's already dead!'\" Frangie is basically what every nurse, doctor, or anyone in the world should be like; she's compassionate and will do anything for her patients. The horrors that she has to witness honestly left me gagging.  \"And then the front of Daddy D's face explodes.\"  \"Daddy D, a nice family man, his face split open like a melon struck with a hammer. That image joins many others. They're pilling up in her brain, those images: a foot blown off by a mine; a gut wound oozing bile, a compression injury from a man crushed between two trucks...\" Even when she was shot and wounded herself, all she could think of was helping the other wounded soldiers. Like what? She constantly is thinking of others, one of the main reasons she enlisted was to help her family financially. I like that we got to learn more about Frangie's family, her brother was a large mystery that I kept wondering about! I do wish that there had been more chapters about Frangie, I felt Rio had the majority of chapters. If there's another book (which there better be) I wish to see more of Frangie. Rainy. Rainy. Rainy. I have to say her chapters kept me at the edge of my seat. I screamed, cried, laughed, and smiled throughout her journey. The Jewish Yiddish phrases that her and her mother said made my day since I knew what they all meant! I want to write which parts made me scream and cry, so here goes:  \"'Oh Rainy,' he says, and sags back against the wall. head down on his chest. 'Oy vey iz mir.'\"\"'Yes, sir, it is. And your son will not be getting into my pants, not in twenty-four hours or twenty-fours days, or twenty-four years.'It takes a few beats before Don Vito realizes what's happened.'Lei parala Italiano?''Si, Don Vito, un poco.''You deceived me.''I gained an advantage.'\"\"I got on simple request: give me a gun so I can shoot this Jew b***h in her smart mouth.\" (I literally  screamed  when I read this, I flipped to Rainy's next chapter to see what would happen!) This is when the tears started:  \"At last, after so long that Rainy is certain the soldier will leave if she doesn't speak, she quells her sobs long enough to say, 'Sergeant Rainy Schulterman, US Amy.'\"\" 'No.' Rainy stretches the word into an animal growl. 'They'd have known Schulterman is a Jewish names and then...I guess I thought things would be even worse then, but also they didn't expect it. See, they thought I told them the truth, and I didn't, you see, I held it back, and I held it all back, I lied and lied, and it is hard to keep the lies straight, see, Colonel, keep the f***ing lies straight- that was the hard part, because you can't sleep and you just hear the screams and you see men shot down, bleeding, and...' She brings herself up short, painfully aware that she sounds crazy.\" The next quote really made me cry, just typing this right now makes me emotional. As a Jew, I grew up hearing the horrors of the Holocaust. What the Nazi's did not only to my people but to homosexuals,gypsies , physically and mentally disabled people, and countless others, was constantly spoken about in my community. Grant portraying the ruthlessness of the Nazi's struck a chord in me, I cried for all those that suffered at the hands of those monsters. \"'I came to kill Nazi's,' she grates. 'I came because I thought killing Nazi's was the right thing to do, the good thing to do, but that's all over now, because it's not right or good, is it? I've seen what they are. You haven't.Day after day, and week after week, I watched those bastards murder people, people whose blood drained down and I saw it, and I heard it, and I listened to the screams and sometimes I screamed too. I screamed and I cried, and I told myself if somehow, by some miracle, I I ever...' Sobs break up the flow of words. 'I swore. There was a woman, Jon, they raped her, night after night. And an Italian partisan, they tore his fingernails out and... him screaming and crying and those bastards laughed.I swore. It was a holy oath. I don't care if...It was a holy oath. If I ever...I would not stop. Never, never, never, never! I would chase them. To hell. I would...I would find them...I would kill them. I would kill them all until there was none left to kill!\" So yeah, I just poured out my heart and soul. I've never written such a lengthy review with some many quotes! I really hope that there's another book. Grant, give yourself a pat on the back because that was an amazing, well-written, fantastic book! Thank you!"}, {"userName": "Colleen", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/26817538-colleen", "userReview": "Absolutely fantastic continuation of book one. I find that the second book in a series is usually slow; some kind of stepping stone - but this is jammed packed of character development, non-stop action and anticipation of the next installment. It is much more gritty than the first. The language is more direct, the sexism and racism more apparent, and all of it is more accurate and real than the reader expects. There is sex, there is smoking and drinking among the soldiers, and there is such raw emotion that it makes none of those things in a teen book even matter. I forgot during reading this that it isn't completely non-fiction; that women didn't fight on the front; that these 18 year olds are not actual people. They represent thousands of real soldiers though, and one cannot forget that while reading.Grant has captured the life of a front line soldier with unbelievable accuracy. Being an avid reader of WWII fiction (both YA and adult) this is a great YA addition. The only thing I'm disappointed about is having to wait now for the third book to be released."}, {"userName": "Shelley", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/3081722-shelley", "userReview": "*Source* Edelweiss*Genre* Young Adult, Historical*Rating* 4.0*Thoughts*Silver Stars, by author Michael Grant, is the second installment in the Front Lines trilogy. Grant’s brilliant reimagining of World War II with girl soldiers fighting on the front lines is unlike anything in the teen market. Following a recent Pentagon decision to open all jobs in combat units to female service members, (which I fully support FYI) top officers in the army and the marine corps testified that they believe all woman over the age of 18 should be eligible for military service the same as men. *Full Review @ Gizmos Reviews*http://gizmosreviews.blogspot.com/201..."}, {"userName": "Bridgette", "userReviewDate": "Sep 30, 2016", "userURL": "http://www.goodreads.com/user/show/3102625-bridgette", "userReview": "I received a digital copy from Edelweiss to give my honest opinion.4.5 stars, really, but I'm nitpicking. It's a wonderful book. If you enjoyed the first one, you're going to love this one. Silver Stars dives right into the action. There's plenty of action, but also some great moments with all the girls and their best friends, family, and sergeants as the war progresses. Rio definitely has the most page time, but Rainy and Frangie felt like they had more page time than the first book. I did want a lot more of Frangie to see her character development better. I can't say too much without giving away spoilers (especially this many month away from the release date), but this was a fantastic book and an even better sequel. For any readers who might be wary of the slower nature of book one, that doesn't exist here, and if you haven't read book one, read it so you can enjoy this when it comes out. Libraries--if you've got the first in your collection, you'll want the second one. The only problem now is that I have to wait forever for book three."}, {"userName": "Katelynn", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/11346136-katelynn", "userReview": "There were parts in this that just killed me. There is so much horror in war and Grant dragged us through it all, put us down in the trenches and left us all alone to worry about what was around the corner and stranded us with broken hearts without any real hope that we were going to make it out alive but made us keep getting up and going on anyway. It was cinematic and terrifying and the only way you can have me in agony like this is if you create characters like these. Stephen King does it too - his books are scary because he writes fleshed-out people with rich histories who wrap themselves around your finger and you don't want any of the horror to happen to them. It's the same in this series - the action in this is great, it's exciting and nerve-wracking and unbeLIEVABLY well-researched and realistic, but it wouldn't be half as impactful if you didn't feel like it was happening to real people who will shatter your heart if anything happens to them. There is not one single character left standing at the end of Silver Stars that I wouldn't mourn if they're killed in the next instalment. Honestly, this series is so important on so many levels and I don't think any other book has given me the reading experience that this one has. I can't recommend it more."}, {"userName": "Jaelene", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/32330913-jaelene", "userReview": "I can't even put into words how much I love this series! I was so scared that this book wasn't going to be as good as Front Lines, but Silver Stars did not disappoint. Considering both Front Lines and Silver Stars are both around 600 pages long, you'd think at some point you'd get bored and wish something would happen, but no! This book was so addictive and amazing, it kept me on the edge of my seat with every page. I have such a love for every character in these books and cannot wait until the next one is released! If you're not sure if you want to continue on with this series I highly, highly recommend you keep reading because it just keeps getting better!"}, {"userName": "Abbs", "userReviewDate": "Jul 15, 2017", "userURL": "http://www.goodreads.com/user/show/1487857-abbs", "userReview": "Man I love this series. It's right up my alley :) can't wait til Purple Hearts comes out!"}, {"userName": "Baker​ St Shelves", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/13120851-baker-st-shelves", "userReview": "Pretty action packed book and it was cool to see everyone come back and to see their progression as soldiers. Definitely a great book, but some storylines stuck out more to me, like infiltrating the criminal underworld would've been cool to see further explored, however some scenes don't get the time needed, but that's fine. I also appreciate how this book doesn't romanticize war and doesn't hold back from showing how brutal it is. Worth checking out."}, {"userName": "Germany", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/28400225-germany", "userReview": "Authors who write non YA books really need to take a page (several pages actually) from Mr. Grant's books. Why? Because he gives us great female protagonists!! \"But he writes YA books\" you yell kicking and screaming because no worthwhile adult spends their time reading YA books. Right? Wrong!! If you are thinking teen angst, sappy love stories, and characters an adult cannot identity with, you're so wrong. I first started reading Mr. Grant years ago when I was browsing an indy bookstore for a good read. I wandered into the YA section and was struck by the brightness of the book \"Gone\". It is a bit like \"Under the Dome\" by King, but with much more memorable characters. I finished that series and moved on to something else, but the characters stayed with me. After reading \"Front Lines\", in my review I mentioned that I wish there had been more Rainy and more Frangie. Well, with SS he has done just that. What's amazing about all of the women in the book is that they're just kids really - 18-19 years of age. The other outstanding thing he did was make these kids strong, intelligent and passionate about the work that they are doing. One of my biggest complaints about thrillers, chick lit, and fiction is the exorbitant amount of violence against women and violence that is used in a gratuitous manner. None of that occurs in SS. There is violence in the book, it's about war and of course there are going to some violent deaths, but it's necessary to move the plot point. It is not done just for the sake of blood and guts. The women have changed and grown since we last saw them in \"Front Lines\". As a black woman, I identify with Frangie the most and it was nice to see that by the end of the book, she started to think of herself as a person of worth. She had to suffer through the name calling and general disrespect that the white soldiers had for her. I think she accepted this treatment because that's how things were at that period in history. What I find most interesting and sad about WWII for the black soldiers is that they were fighting a war on foreign soil, putting their lives in jeopardy and dying just like the white soldiers, only to arrive back in the states and have to use a different faucet, were not allowed to eat at counters with whites, and were not getting the same recognition on their return as their fellow white soldiers received. The authors note in the back of the book was especially touching for me. It's very rare that a white author can truly relay the pain of being black in America, but he did an excellent job with Frangie. She is by far one of my favorite characters ever written. There are NO other Frangies out there in fiction today. Well, there may be but I certainly have not found another one."}, {"userName": "Taffy", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/47063474-taffy", "userReview": "The basic gist of my review is that you should read this book. But if you want to, you can read it here:https://thecoziestcorner.wordpress.co..."}, {"userName": "Billie", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/3915342-billie", "userReview": "I didn't review this when I rated it because I really didn't know what to say. Or, rather, I knew what I wanted to say, but not if I would be able to do so.This was not the book that I should have been reading in the aftermath of the election. One wouldn't normally think that an alternative history written for the young adult audience would be anything other than escapism. However, in Grant's alternate world, the only difference is that women were allowed to serve on the front lines of World War II. That's it. That's the only difference. So this is a war novel, with all of the violence and death and despair that such novels normally entail. But, even with women serving alongside men on the front lines, Grant doesn't lessen or sugarcoat the sexism and it's fugging (Grant's alternative to one of my favorite words, employed in an attempt to keep the novel clean enough to get past the censors) depressing to read and to recognize as things still being said and done today, and even glorified by a certain DJT and his supporters. And, as bad as the sexism is, the racism is far worse and this Grant did tone down quite a bit. Racism, sexism, war—there was as much about this book that made it feel as much like it might be about the future as it was about the past and it hit me hard.This is a strong novel about strong women but, had I read it at a different time, it would likely not have had as great an emotional impact as it did. Just more proof, if any were needed, that books are different for different readers, and even for the same reader at different times. I don't know that this was the book I should have been reading at this time, but maybe it was the book I needed to read. It reminded me that things often get worse before they get better and even during the darkest times, there are moments of joy to be found. And even though the story of Frangie, Rio, and Rainy hasn't reached that point in the future just yet, even Hitler was eventually defeated.(And, please, don't comment on this review if you just want to argue politics. This is about the book and the emotional reaction I had to it in light of the recent election. If you can frame your political discussion in terms of this book and your reaction to it, fine. If not, this is not the place.)"}, {"userName": "Tara Russell", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/5624855-tara-russell", "userReview": "This was a hard book to read. Not because the plot is overly complicated, or the language too elaborate or the characters unlikeable, but because the handling of the subject of war is, by its nature, disturbing. Consequently it took me longer to read Silver Stars than I expected, and took more reading than Front Lines. However, this is 1944 and the protagonists Rio, Rainy and Frangie are no longer green new recruits, but survivors of battles, with the gravitas that brings. The use of the varying narrative of the three young women, as well as the interstitials with an unnamed narrator means that Grant can widen his exploration of the war. A soldier, a medic and an intelligence agent - each has their own story to tell, and they overlap and diverge in satisfying fashion. This is a great book, and very thought-provoking, but there's something I can't put my finger on that means I'd give it 4.5 stars rather than a perfect 5. In the absence of half stars on Netgalley, though, I'm happy to round up! A very involving read, with a wide range of audience appeal."}, {"userName": "Amy", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/795227-amy", "userReview": "I loved this. The description of battles are so compelling, and told in a matter of fact style that makes it hard to look away. I really appreciated that the plot never became trite and clicheed. The women characters were wonderfully fleshed out. Can't wait for the sequel."}, {"userName": "Sarah", "userReviewDate": "Jan 24, 2017", "userURL": "http://www.goodreads.com/user/show/1261756-sarah", "userReview": "Thanks to the publisher for a digital advance reader's copy, provided via Edelweiss."}, {"userName": "Kelly", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/27151715-kelly", "userReview": "Silver Stars reunites us with Rio, Rainy and Frangie as they continue their wartime journeys. It took everything I enjoyed about Front Lines and notched it up to the next level.So much happens in this book! When I reviewed Front Lines I said that I loved the characters but I just wanted more from the plot. Where the first book built up our characters wonderfully, Silver Stars takes what we know and adds in all the action I so desired. With Rio, Rainy and Frangie following their own separate paths, Silver Stars is a much harsher look at the effect of the war than the first book in the series.This book leaves very little to the imagination and at times was a very harrowing and difficult read. Grant certainly does not beat around the bush when it comes to describing the devastating effects of the war. There are vivid descriptions of the most horrendous injuries imaginable and a lot of deaths. I really enjoyed Grant’s writing style and the way his words on the page are able to create such strong imagery for me as a reader. I honestly felt like I was there on the front lines with Rio and her team and it evoked a lot of emotion in me.I was really interested to see the way in which Grant took more time to explore the effect the war is having on Rio, Rainy and Frangie. Whilst all are some of the strongest female characters I’ve read, in Silver Stars I felt that we also got a glimpse of their vulnerable sides. My heart really went out to each of them at points during this book, but never more so than when Rio and Jenou are discussing how the war has changed their friendship. That was something I found really emotional to read, especially as it really showed how both of them had changed despite never believing they could or would. It was interesting to see how Grant portrayed the different effects that the war has on people whether they are in the same position or completely different positions.I was so happy that our leading ladies are as badass as ever and we certainly get to learn a lot more about their character and personal strength. Rio is fighting on the front lines, but has becoming a killer changed her? Rainy is drafted to carry out a personal mission, but will she survive this dangerous situation? Frangie continues to treat the injured soldiers with her care and her heart, but what will happen to her when she finds herself in a spot of trouble?Whilst most of the POVs are still from Rio, I was pleased to get to spend a bit more time with Rainy in this book as I felt I didn’t get to know her as well in book one. She goes through such a significant experience in this book and I thought her story line was really interesting and the one that really had me on the edge of my seat. I really, really would have loved to spend a bit more time with Frangie. I just adore her and hope that there will be even more about her in book three.The ending of the book was pretty predictable but that doesn’t mean I wasn’t happy with it. I don’t want to spoil anything so I can’t say any more but the way in which Grant wrote in the ending really blurred the lines between fiction and non-fiction. I thought this was a great idea.Silver Stars continues to explore misogyny and racism towards the female soldiers without beating around the bush. I still find it a bit difficult to read some of what is written but I believe that it would be a good reflection of what women and women of colour would have experienced at the time. As difficult as it can be to swallow, I am glad it is there and right at the forefront of these novels as it is important that this is acknowledged in a book like this.On the whole I liked Silver Stars a bit more than I did the first book, mainly because now that I know our leading ladies I could really go on their journeys with them. Full of action and character development, Silver Stars is not a book to be messed with. A great read!"}, {"userName": "Raile Bay", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/56597990-raile-bay", "userReview": "This was a better sequel to the first book.The one thing that I believe Michael Grant has handled the best in this series- character development. While the amount of research he's clearly put into the series is amazing as well, I think this is where the books really take the cake.I've read previous series of Michael Grant- Gone, Animorphs- and the common link seems to be the amazing character development. Rio Richlin reminds me of Rachel from Animorphs- while their starting points aren't similar, the people they begin to become are. Girls who have a love for violence and killing that they never knew existed; and now that they have found it, what are they to do with it, now that it's become all-consuming? How are they supposed to live without the war when it's brought a light that they never knew existed? Violence isn't something you should become addicted to. They know that. But just because something is dangerous, and wrong, and likely to end in misfortune doesn't make it any less alluring.So to see Rio Richlin go from a sweet, naive farm girl to a battle-hardened soldier respected by her peers for all the wrong reasons- nicknamed \"Killer Ricky\" by some in her squad- isn't unnerving, but tragic. Because maybe she has been made for war like nobody else. Inclination for violence doesn't have gender as a determining factor, despite the sexism of the times, and anyone who can look at Rio can see that. But that doesn't make seeing her fall any less tragic, especially considering that we, the readers, are not just aware of it. Her closest friend is aware of it (another tragedy, as their relationship diminishes over the course of the war). Rio is aware of it- and doesn't like the person she is becoming, which makes it all the more sad. Negative character development is an excellent creative device, I think, and if it can be used potently by a skilled writer, it makes a better story. Something we need to see more in the YA genre, please.There was more character development, but Rio's shined the most for me. The other aspects of the novel are also great; the battle scenes, the expected boredom of wartime, the racism and misogyny of the era. Silver Stars is part of an interesting alternate history series that people should be inclined to check out."}], "description": "The summer of 1943, World War II. With heavy memories of combat, Frangie, Rainy, Rio, and the rest of the American army are moving on to their next target: the Italian island of Sicily. The women won’t conquer Italy alone. They are not heroes for fighting alongside their brothers—they are soldiers. But Frangie, Rainy, Rio, and the millions of brave females fighting for their country have become a symbol in the fight for equality. They will brave terrible conditions in an endless siege; they will fight to find themselves on the front lines of WWII; and they will come face-to-face with the brutality of war until they win or die.", "title": "Silver Stars\n      \n          (Front Lines #2)", "url": "http://www.goodreads.com/book/show/30374760-silver-stars", "average": 4.41, "cover": "https://images.gr-assets.com/books/1469334654l/30374760.jpg", "reviews": 215, "authors": [{"url": "https://www.goodreads.com/author/show/1599723.Michael_Grant", "name": "Michael  Grant"}], "type": ["Historical", "Young Adult", "Historical", "War"], "outlinks": ["http://www.goodreads.com/book/show/30374760-silver-stars", "http://www.goodreads.com/book/show/30037861-silver-stars", "http://www.goodreads.com/book/show/33954256-silver-stars", "http://www.goodreads.com/book/show/32182891-silver-stars", "http://www.goodreads.com/book/show/2536134.Gone", "http://www.goodreads.com/book/show/5047880-hunger", "http://www.goodreads.com/book/show/6686092-lies", "http://www.goodreads.com/book/show/6686101-plague", "http://www.goodreads.com/book/show/8811134-fear"]}