{"ratings": 73725, "userreviews": [{"userName": "Kaitlyn", "userReviewDate": "Nov 18, 2013", "userURL": "http://www.goodreads.com/user/show/8369618-kaitlyn", "userReview": "I get the Kelly Clarkson song running through my head every time I see this book. :P"}, {"userName": "Raeleen Lemay", "userReviewDate": "Mar 31, 2014", "userURL": "http://www.goodreads.com/user/show/3452652-raeleen-lemay", "userReview": "In a well-ordered universe.... everybody would read this book.Seriously. It was amazing. If you loved, or even mildly enjoyed Amy and Roger's Epic Detour, pick up this book. YOU WILL NOT REGRET IT."}, {"userName": "Christine Riccio", "userReviewDate": "Aug 02, 2014", "userURL": "http://www.goodreads.com/user/show/10093827-christine-riccio", "userReview": "I LOVED THIS OH SO MUCH. <3"}, {"userName": "Maureen", "userReviewDate": "Jul 21, 2014", "userURL": "http://www.goodreads.com/user/show/10762033-maureen", "userReview": "Reread June 21-23 2015 for #monthofmatsonOH MY GOSH THE FEEEEEEELS. This was the first Morgan Matson book I read and it's still just as good. I love the friendship element, I love the facing fears element, I LOVE FRANK. SO FREAKING MUCH. FRANK IS SO BAE SO SO BAE. HOW DOES MORGAN MATSON WRITE THE BEST GUY CHARACTERS EVER. HOW???Okay I'm done. I just love this book a lot.Reread via audiobook May 6-May 10 2016 for #monthofmatson YEAR 2This has solidified itself as my favorite MM book. It's so freAKING GOOD AND I FEEL SO MANY FEELINGS RN. I love Frank I love Emily I love EVERYONEReread for #monthofmatson 2017TEAM FRANK FOREVER."}, {"userName": "Zoë", "userReviewDate": "Jan 04, 2015", "userURL": "http://www.goodreads.com/user/show/9303625-zo", "userReview": "Watch my interview with Morgan Matson here: https://www.youtube.com/watch?v=yVqHE...Seriously the best book I've read in a while! I am completely obsessed with Morgan Matson's writing and how she can make such a cute story without it being sickly sweet or cheesy! This is a story that will stick with me for a while and I definitely want to see it become a movie!"}, {"userName": "Emily May", "userReviewDate": "May 07, 2014", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "*Maybe* I am too old for this book. That is one possible explanation. The other possible explanation is that this book really is just kinda lame. And tame.Since You've Been Gone tries to be a cutesy summer story about the friendship between two teenage girls. Which was exactly what I wanted. It also tries to be a tale about a girl learning to take chances, be a little rebellious and try new things. Misspent youth and all that jazz. And I can totally get into the excitement of a good-girl-gone-bad story of naughty youth days and craziness, but the problem is that none of the things Emily actually does are particularly exciting or dangerous or rebellious. This is like the Sunday school version of rebellion.Not that I expected (or wanted) these kids to start shooting drugs in their basements and holding orgies... but \napple picking?\n Yes, apple-picking makes this very random list of adventurous stuff which Sloane sets for Emily to do. The main problem I encountered in this book was a complete lack of any tension, excitement or general reasons to care. This is likely partially due to the tasks set out for our protagonist - of which kissing a boy is like the be-all and end-all of human existence - but it also has something to do with the very dry narrative. I felt zero connection to Emily and zero interest in Sloane.Also, did you know that naked bathing is so rebellious these days? Neither did I. I feel somewhat delighted to know that I throw caution to the wind every morning without even leaving the house. Okay, I'm joking. So Emily and some friends go skinny-dipping...\nNow, actually standing in front of the water and contemplating swimming in it naked — with my friends — things were no longer seeming quite so simple.\nOkay, so maybe it's me. But I just don't think swimming naked in some water with your close friends makes you a rebel. Call me a tramp. Maybe it's just because I have the kind of close friends who would (and do) crazy dance around my room in their birthday suits. Or maybe it's because Emily built it up to be such a HUGE thing, edging up to the water with a towel around her, freaking out constantly. Why should I care? You took your clothes off and got in the water - go you! I still don't care.I don't feel the need to give you much more than the description when it comes to the plot - basically, Emily's friend (Sloane) disappears suddenly and stops answering Emily's calls and texts. All Emily has is a list that Sloane left behind, a list of tasks for Emily to complete. Which she does, one by one, hoping they'll lead her to Sloane. It was a quick read that I managed to get through but it was disappointing. The writing and characters felt flat to me and the attempts at rebellion were unexciting. Lastly, I thought the ending was rushed and made the whole thing seem even more pointless. The story felt wrapped up too neatly and nicely, when some of the final reveals warranted a more dramatic handling, in my opinion.Oh well, onto the next.Blog | Leafmarks | Facebook | Twitter | Instagram | Tumblr"}, {"userName": "emma", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/32879029-emma", "userReview": "This is the best Morgan Matson book.I’ve long suspected it. Now, I can confirm it. I’ve reread all her works in the last nine months (and I actually trust the opinions of nine-months-ago me, unlike the opinions of two-or-more-years-ago me, who does ridiculous things like think Isla and the Happily Ever After is a good book, which, guess what, it isn’t).This reread bonanza had a lot of bad parts, including, but not limited to: the realization that Matson is not infallible while reading Amy & Roger’s Epic Detour; that realization, again, except with Second Chance Summer instead; the questioning of why her books are so ridiculously long all the time.BUT THEN THIS BOOK CAME ALONG AND WAS SO FLIPPIN’ GOOD.This book has everything. (Please go back in time and read that in a Stefon voice if you didn’t the first time.) Road trips. Heart-shaped sunglasses. Bucket lists. That thing where characters have significant others but only to add a bit more spice to the will-they-won’t-they (even though the answer is clearly of course they will) and yes there’s cheating but actually it’s okay because the unseen girlfriend was also hella done with the relationship. Summertime. Pizza. Fun banter-y groups of friends. Playlists. The classic contemporary plot format in which everything starts out okay but with definite room for improvement and then gets good and then gets PERFECT and then gets so so so so so bad like even worse than the beginning but then turns perfect again and actually perfect-er than when you thought it was perfect because character development. And also romance, of course.It is, in other words, as if someone took all of the best contemporary tropes and wrote them on lil pieces of paper and then tossed them in the air and then they floated down like confetti or snowflakes onto Morgan Matson’s angel head and she wrote this book.I am a sucker for road trips and for bucket lists and for playlists and for snack descriptions and for summer and for banter and ESPECIALLY for when the friendships are more prevalent in a book than the budding romances.And this book nails all of that. It is the most fun thing ever.To give a touch of synopsis: We follow Emily, who has literally one friend. (Sounds like every character in every other book, am I right? It’s funny because most authors are too lazy or romance-focused to build realistic worlds populated with full, human-seeming individuals!) The friend’s name is Sloane, she is fun and adventurous and superhot, and she full-on disappeared a couple days back without telling Emily where she was going. AND NOW SHE’S NOT ANSWERING HER PHONE.AND HER HOUSE IS EMPTY.AHHHH.Instead of worrying about whether ol’ Sloane and her parents got Mafia murdered, Emily focuses her boundless attention on a list of tasks that gal mailed her. Emily is very shy and introverted, where Sloane is extremely...not that, so the list is stuff like “skinny dip!!!” and “kiss a stranger!!!”In her attempts to finish the list (in the hopes it’ll give her some Sloane-related answers), Emily makes friends and has fun and learns it’s not the end of the quest but the friends you make along the way and blah blah blah it’s cute. It’s fun. It’s summery.It’s the best Morgan Matson book! (So far.)Bottom line: This is essentially if mad scientists gathered all my favorite clichés and mixed em all together and published them in a 500 page hardcover with a reversible collectible cover. In other words: PERFECT.---------pre-reviewin a well-ordered universe, morgan matson would just write every contemporary???she is the only one that seems to recognize that the ideal contemporary is a careful mix of friendship + banter + road trips + bucket lists + summer + snacks and then a liiiiiiiil bit of romance.this book is the sh*t.review to come"}, {"userName": "Kate ♡", "userReviewDate": "Dec 19, 2014", "userURL": "http://www.goodreads.com/user/show/15154637-kate", "userReview": "Since You've Been Gone by Morgan MatsonAt first i was a bit apprehensive about this book, probably because of its length and the amount of hype its received, but oh my gosh, a book has never lived up more to the hype, and well and truly exceeded my expectations. It was everything I wanted it to be, yet nothing I expected it to be and so much more.In other words, I CANNOT EXPRESS MY LOVE FOR THIS BOOK ENOUGH, AHHThis book was unlike any contemporary novel I've read before. It was a perfect blend of all the best aspects that a book can give. The characters were amazing, the plot was one of the best I've ever read, the setting was just so vivid that i found myself completely lost in this book and shutting out everything going on around me, this is how you know you love a book. The whole plot of Emily's journey and her character development was written so exceptionally, the romance was one of the best I've ever read, Seriously, someone find me a Frank Porter. This is definitely a book that's going on my favourites shelf, \nin-fact one of my favourite books of all time\n, and will not be forgotten for a realllly long time, it has made a print on my little reading soul, hahaha, It taught me so much about life and about who I should strive to be as a person. It showed me what real relationships should be like, it provided the most beautiful insight into friendship, and all things to do with becoming who you are.This will most definitely not be my last Morgan Matson book, her writing is amazing! Why has it taken me so long to pick up one of her books?All-in-all, this book was incredible and I'd recommend it to anyone and everyone. Please do yourself a favour and read it.It's honestly changed me for the better"}, {"userName": "karen", "userReviewDate": "Jul 17, 2014", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "this is not the kind of book i would ordinarily read. i tend to stay away from contemporary YA novels, ones where real-seeming teens do real-seeming things. give me grand battles to the death, or a pandemic of some kind, zombies or even just basic wilderness survival, and i am on board. but teens who aren't in peril in some way?? not usually gonna blip my radar. but i read this one at the urging of a work-friend, and i gotta say, i enjoyed it. yeah, it's just an unchallenging summer read, but it's charming as hell. it's an appealing book about girl friendship and loyalty with a dusting of romance and it makes a nice change from the hard-edged teenage girls i've sort of grown accustomed to in my readings. these girls aren't the back-stabby predatory girls of a megan abbott novel, they're good, wholesome girls who care about each other with a refreshing lack of all the competitiveness and jealousy that infects so many female relationships in YA novels, and it's a sweet little lollipop of a read.emily and sloane are the always-together kind of best friends. sloane is dynamic and charismatic, while emily is a little more reserved, shy, and content to hide out in sloane's dramatic shadow. but sloane's not looking for a sidekick, and she frequently encourages emily to break out of her shell, making little to-do lists in the shape of dares for emily on the occasions when she has to go away on vacation with her parents, and encouraging her to take spontaneous risks and stop being afraid. emily appreciates these efforts, but she will generally only fulfill a portion of sloane's lists, avoiding the items she doesn't feel comfortable attempting. but one day, sloane vanishes without a trace, at the beginning of what was meant to be their most epic summer ever, which had already been mapped out in detailed plans and adventures. sloane doesn't answer her phone, her house is empty, and emily has no idea what could have happened to her, until she receives an envelope from sloane in the mail, with a new thirteen-point list for emily. bewildered, emily decides to meet every challenge on the list for once, hoping it will somehow lead her back to sloane and provide an answer to her sudden disappearance. however, this list seems to be more pointed than its predecessors, and calls out some of emily's most ingrained fears and reservations as it encourages her to: ride a horse, kiss a stranger, and skinny dip, none of which emily would ordinarily even consider doing. but if it will bring her closer to an answer, she will do whatever it takes. what follows is a summer of growth and change for emily, as she branches out under sloane's indirect influence, tries new things, makes new friends and with her parents conveniently distracted all summer long, finally gets her answers.this is a book in which there are no \"heavy\" problems. no one gets bullied or sexually assaulted, and it is all very lightweight suburban teenage drama, so it is perfectly safe to give to younger or more watched-over teens. i was hoping for a little twist - part of me wanted this fairytale-like set of challenges to culminate in a lesbian angle where emily found her way back to her princess sloane, but nope. i will say that despite my (mild) sapphic-disappointment, the conclusion is reasonable and satisfying, and it really was a pleasure to see emily's transition into something that wasn't emily-before-sloane or emily-with-sloane, but something all her own, realistically confident and less constrained by her own fears. there is one scene in particular that i thought especially deft and subtly-written, which illustrates both her inner and outer changes.…I texted back without a second thought that I'd be there soon. I reached for a Sloane-chosen outfit - a vintage dress from Twice that I'd worn a lot last summer. But after I put it on, I found myself pulling at the straps, tugging at the hem, not liking what I saw in the mirror. For some reason, it didn't feel like me any longer. I took it off and changed into the denim skirt I'd bought with Dawn last week and a white eyelet tank top. Feeling more like myself, somehow, I dabbed some makeup on, and made sure to get Frank's present before grabbing my flip-flops and heading back to the car.before this, it would have taken her paragraphs to decide whether or not to go to the place she is going, and she would have dressed herself as an accessory to sloane, but in this scene towards the end of her summer, she is finally all herself, and very comfortable in her own skin. looks like emily isn't the only one who has grown this summer - i learned that it is possible for me to appreciate books even when teens aren't getting slaughtered by zombies or bears. and that's progress!"}, {"userName": "Whitney Atkinson", "userReviewDate": "Jul 31, 2014", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "This book was really, really enjoyable! The first 100 pages I was hooked and I loved it, but the book started to lose its luster from then on out. I thought this book was the perfect summer read and it put me in a great, summery mood. I thought the story was interesting and I was definitely unable to put this book down, hence why i'm writing this review at 3:30 in the morning and I have a job interview in less than 7 hours. But really quickly I began to notice that Emily was a bit of a coward. She was overwhelmingly shy, to the point where she chickened out to do most items on her list the first time, and she was terrified of confrontation. This was a bit frustrating to read. I found that the overall plot of this book was just predictable. There was no twist that really surprised me, everything kinda fell into place, etc. This really does take on a very cliche moral of \"omg im so shy and introverted but oh gee im gonna do this list so that i can break out of my shell and oh gee at the end of this, i'm magically more confident!\" This is the main reason I took off a star, just because it was nothing new to me.Lastly, I just kind of had a problem with Sloane's disappearance. First of all, the reason the book says that she disappeared was totally weird and I feel like Emily would have known about it, like there's no way she could have been taken by surprise that her friend was going. Other than the weird premises of Sloane disappearing, I realized as I was reading flashback scenes of Sloane and Emily's friendship that Sloane really wasn't that great of a friend. I was wondering why Emily cared so much about a girl that treated her so poorly. Nevertheless, this book was addicting and the romance-- though a little too angsty for me at parts-- was pleasing. I would recommend it if you're looking for a summer read, but I liked Amy and Roger's Epic Detour better than this one!"}, {"userName": "Mikee Andrea (ReadWithMikee)", "userReviewDate": "Apr 23, 2016", "userURL": "http://www.goodreads.com/user/show/44137919-mikee-andrea-readwithmikee", "userReview": "❝Real friends are the ones you can count on no matter what. The ones who go into the forest to find you and bring you home. And real friends never have to tell you that they’re your friends.❞\n\nThis book was so fun and cute. I rarely read young adult contemporaries because I feel like I've outgrown that stage of my life, but Since You've Been Gone gave me all the giddy school girl feels that I've missed from way back when while I was in high school.I just loved the whole concept of the list and the friendship that Sloane and Emily had. It actually reminded me a lot of me and my best friend and how opposite we really were. We're about as opposite as people could ever get but we somehow make the best of friends. Sloane and Emily's friendship was nowhere near perfect and sometimes it wasn't pleasant at all, but it was real. Morgan Matson was able to portray the ups and downs, the ugly and the beautiful, and how strong friendships will always endure distance and time.The characters in Since You've Been Gone were definitely the best parts of the book. Frank Porter was such a dreamy book boyfriend and I couldn't stop picturing Ansel Elgort while reading this book! XD And Collins omg he was the humor that SYBG needed! I loved all the jokes he cracked and the lightness he added to the storyline. Same with Dawn! I really enjoyed Dawn and Emily's friendship, maybe even more than Sloane and Emily's. I was a little disappointed that the rift between Dawn and Emily was never really resolved but I understood completely why Dawn was beyond upset at what Emily did. As much as I wish everyone could be BFFs again, I don't really see Dawn and Emily making up any time soon. Hopefully, it will happen but sadly we won't see it happen in this book.Since You've Been Gone was the perfect book to kick off my summer reading list! It was my first Morgan Matson book and it did not disappoint me at all. The plot was a bit slow at first and a little throughout the book, but overall, it has the perfect combination of friendship, adventure, and summer romance. Morgan Matson has made a loyal reader out of me and I can't wait to pick her other books throughout this summer break. I am not a huge contemporary reader at all but this book exceeded all my expectations. <3"}, {"userName": "Jillian (bookishandnerdy)", "userReviewDate": "May 21, 2016", "userURL": "http://www.goodreads.com/user/show/3101094-jillian-bookishandnerdy", "userReview": "asjhsflkdlgjfgkfg;kf LOOOOOOVED THIS OMG MORGAN MATSON HOW DO YOU DO THIS TO ME.full review to come."}, {"userName": "Farah", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/10758976-farah", "userReview": "That was basically my reaction when I found out there was going to be a new book by Morgan Matson. I've got to mention that she is one of the most underrated authors ever, which is not fair because her books are amazing! I, myself, wouldn't have heard about Amy and Roger's Epic Detour and Second Chance Summer if it weren't for Goodreads. So I guess I'm glad I'm on this site and OH MY GOD, YOU DON'T UNDERSTAND HOW HAPPY I AM THAT MORGAN MATSON IS WRITING NEW BOOKS! I adore her and I just know that I'll love it no matter what!"}, {"userName": "sreeja (semi-hiatus)", "userReviewDate": "Dec 04, 2016", "userURL": "http://www.goodreads.com/user/show/50309540-sreeja-semi-hiatus", "userReview": "This book was just made of sunshine and butterflies and unicorns. It has been a while since I’ve read something so fluffy and heart-warming. \nif this girl ever wrote a book, this would be it Although this book gave me serious paper towns vibes.  I mean seriously;“perfect” girl:  checkwho also happens to be the missing (best) friend:  checkadventure to find her:  checkmc finding oneself along the way: checkroad trip:  checkFEATURING\nSloane; AKA (Margo)\n\npretty much a manic pixie dream girl, everyone is in love with her and how fun she is, really adventurous (alert, alert: margo)Notice how I start with Sloane instead of Emily (the main character) well, that’s because even if Sloane isn’t present for pretty much the entire book; all Emily can do is think of her. Granted, she is her best friend, but towards the beginning I felt like Emily was the only one who was putting in any effort into their friendship at all, and it made me feel super bad for her. So well, one day Sloane decides to leave without anything but a list for her friend to complete. That made for an interesting plot, but it also made Sloane look incredibly shallow and selfish. Especially since, Emily considered her to be her best friend and he world was pretty much falling apart in the beginning. Throughout the flashbacks that Emily had of their time together all that I could really notice was how critical she was as a friend; calling Emily out whenever she didn’t feel comfortable to do something that Sloane wanted to. Also the fact that she gave her then boyfriend, Sam more importance than her friend was a huge turn off for me personally. Granted, she does end up redeeming herself in the end she was not one of my favourites. \nEmily; the girl next door type who goes through change and finds herself\n\nloyal, where she started off as a shy girl she managed to confront her fears and become a more confident person by the endEmily as a character honestly felt clichéd at the start of the book. She was literally the archetype of the girl next door, who was shy when talking to guys and going to parties. Who also happened to be nervous while making conversation with people. Her character managed to developed a lot and managed to become a whole new person by the end of the book.I felt like her transformation was really genuine and it was great to follow her as she stepped out of her comfort zones. Also it was great to see her come out of her shell and not be dependent on her best friend and instead become a person that could make her own decisions and choices and relations. I felt soooo proud of her by the end of the book for finally confronting her fears and becoming a better person. \nFrank Porter; the overachiever\n\nwitty, charismatic, a super good leader and friendFrank as a friend and a character was such an honest and sweet guy. Since the first time that we are introduced to him I found his character to be so authentic and caring. The fact that he played a huge role in Emily finishing her list just makes me so happy. He was such a supportive friend who made sure that he was there with Emily every step of the way and made sure that she wasn’t getting herself into something that she didn’t want. Also he is so funny and geeky he just won me over like *snaps finger* that. Honourable mentions also goes to Collins for being such an adorable comic relief, with his own interesting story arc. Also to Beckett; Emily’s brother for being a  hyper ninja. Overall you need to read this book to see how amazing it really is, because despite its flaws it honestly is such a great and heartwarming read.PS there are playlists in this book and its so cute"}, {"userName": "Karmen (readingoncloud9)", "userReviewDate": "Feb 12, 2015", "userURL": "http://www.goodreads.com/user/show/40213000-karmen-readingoncloud9", "userReview": "All of Morgan Matson's books that I've read so far have been 5 stars for me. ❤️"}, {"userName": "Aj the Ravenous Reader", "userReviewDate": "Aug 01, 2016", "userURL": "http://www.goodreads.com/user/show/30248594-aj-the-ravenous-reader", "userReview": "I met my best friend when I was 11 and almost 20 years, dozens of fights and thousands of miles apart later, she and I are still best friends and I honestly don’t think I would have survived those scary stages of life without her. Why am I suddenly sharing this random information? Because I was very much inspired by the story I have just read about two best friends and how they shaped each other to be the persons they are. I grew up used to the idea that everything could change except my family (which now includes my husband) and my best friend who remain constant in my life. It’s what Emily in the story believed too until one day, she wakes up with her best friend, Sloane, completely vanishing leaving no trace except a list of things to do for Emily, things that Emily wouldn’t dare do but if it meant leading the way back to her best friend, she just probably would. This is my second Morgan Matson read and I could now say she’s becoming a favorite. There’s just something with the way she writes that makes the reader feel good. Even better is how she dozed her plot with mystery and adventure making this a really engaging and fun read and even though there’s this really cute romance going on in the story, the focus is really about the friendship between Emily and Sloane while discovering their individuality in the process. Though I think the ending could use at least one more chapter to resolve minor conflicts among the characters, it was a still a generally adorable and enjoyable, also refreshing read. Definitely recommended! <3P.S. Happy birthday, Paige!. I hope you’re having the time of your life! <3"}, {"userName": "Liam", "userReviewDate": "Oct 06, 2014", "userURL": "http://www.goodreads.com/user/show/34270521-liam", "userReview": "In a well ordered universe everyone will have read this book and loved it just as much as I did!!What a fantastic read this book has been! I have not been so emotionally invested in a book in a while and this one completely swept me up and took me on a super cute and brilliant journey!First thing first, I'm going to talk about the writing because wOW THE WRITING! It made the book, characters, world etc all seem incredibly real and I truly felt like I was there in the story with Emily our main character. The writing was just so real and honest, making it pretty hard for you to not be gripped to be honest!The main characters in this book will always have a special place in my heart. I want to be best friends with them. I want to spend my summer with them because I'm sure I'd have the best time! We really get to know these characters, in particular with Emily, and it made the book that bit more enjoyable. I felt like I connected and related to them all, they were all so well developed and felt so real.For many, the ending was anticlimactic and disappointing however I quite liked the ending and felt like it was suitable and believable. Of course I wanted a few chapters more because I really did not want this book to end but when it did end I was left with a warm feeling in my heart.Definitely want to reread this over summer as I think it will be the perfect summer read!!I recommend this to you all and you all just have to read it! You will fall in love with it I assure you, you can thank me after you've read it!!"}, {"userName": "Tiff at Mostly YA Lit", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/4163146-tiff-at-mostly-ya-lit", "userReview": "Review originally posted at Mostly YA LitSince You've Been Gone was my most anticipated contemporary YA of this spring - I LOVED Morgan Matson's first novel, Amy & Roger's Epic Detour. I loved it so much that she inspired me to start writing my own novel...which is currently sitting dustily on my computer. ANYWAY.Because Matson has previously written about loss, I wasn't sure what to expect from this book about the loss of a friendship - one that the protagonist, Emily, feels deeply. Emily is a kind of shy, timid teenager when we first meet her - she's a girl who only gets noticed when she's around her wild best friend, Sloane.Because of Sloane, Emily has done a lot of things she never thought she could do - she's gone to parties, she's made out with guys, and she's had the kind of best friend that a lot of us only dream of - one who she can call or text at any moment with a silly idea, and one she can always count on to deliver her \"best night ever.\" But now that Sloane has disappeared for the summer, Emily feels completely bereft. This was a little hard for me to connect with because I've never had a friendship that wound so tightly into my existence.The thing is, Matson writes the book so that you DO believe that Emily would feel this badly about Sloane leaving. The more I got into Emily's character, the more I understood - it's like she's in mourning for Sloane, and she doesn't know who or what to do with herself because so much of her is about Sloane. The only thing she can do is follow a list of crazy tasks that Sloane has left for her (Hug a Jamie. The backless dress - and somewhere to wear it. Kiss a stranger...etc), and hopefully, Sloane will come back and everything will go back to being how it used to be.As a reader, you know where this is going. Everything is not going to be the same, and Emily will have to grow and change because of it. But despite that slightly obvious concept, \n  Matson never lost me as a reader\n. I never felt like I was reading a single cliche because of how beautifully and cleverly she unfolds the story, through both her words and the plotting. Each chapter in Since You've Been Gone is titled with one of the tasks that Sloane has given Emily, and within each chapter, there's usually a flashback to a time when Emily is hanging out with Sloane. These flashbacks illuminate Sloane and Emily's character and why Emily is being assigned that task.But they also illuminate how much Emily has built Sloane up into a magical, ideal best friend. The more I read about Sloane, the more I thought, \"Manic Pixie Dream Girl alert!\"- that is, a character who is so charming and the perfect romantic foil who shows up at the precise right moment for no other reason than to push the main character along his/her path. What's interesting with this version of the MPDG conceit is that Sloane is that person for another girl, and their relationship is not romantic. Moreover, the more you find out about Sloane and Emily through flashbacks, the more you realize that Sloane is only an MPDG to Emily - she might not be that in reality.This is one of the masterful, deceptive strokes of this beautiful book - that it is not only a sweet summer romance and a journey of self-discovery - but that it's also a book that deals so realistically with friendship and how we relate to people. I felt like the story was unique because of that friendship - losing oneself in one's friends is something that happens often, but isn't explored much in YA.I'm making this review sound very serious, but Since You've Been Gone is actually a lot of fun - and funny! The list of tasks that Sloane leaves for Emily makes for a lot of daring moments, and that, plus Emily's new friends and acquaintances that she meets during the summer, creates hilarious and meaningful moments that had me squealing in delight.Since You've Been Gone had me from page one. I read in huge, giant chunks with not a lot of time in between because it was SO delightful. I couldn't stop reading or thinking about the book - it felt like Morgan Matson reached in and squeezed my heart after every single chapter. This is one of those books where you almost don't want it to end because you're enjoying it so much - but at the same time, you can't wait for it to end so you can read it all over again.Bonuses: \n\n\n\n  Kick-Arse Secondary Characters:\n I love EVERYONE in this book. Every single secondary character is a gem, from Emily's parents, the playwrights, to her little daredevil brother Beckett, to Dawn, the pizza delivery girl to Collins, the doofy best friend of Emily's love interest, Frank (more on him in a second). I even love Emily's sort of ex, Gideon, the quiet guy who wants to be more, but was only a convenience to Emily. I'm just listing people at this point, but know this: Matson never takes the easy way out with any of these characters. They all have real personality quirks, and even if they only show up for a few seconds, they are beautifully imagined and surprising every time.\n\nFrank is like Colin Hanks in Orange County...sorta?\n    The Love Interest Who Is Not the Typical Hot Boy: FRANK PORTER, be mine! Ok, first of all - how often is the love interest in a book a class president? Frank is a super-focused dude who goes after causes...but he's not the most popular, hot guy, and he's definitely not  a guy who's nerdy. Basically, he's just a really good leader who just kind of wants to be a normal guy. His relationship with Emily is so evenly-paced, and so well-developed...this is the opposite of insta-love, guys, and I LOVED it.\n\n\n\n  Knock-Me-Over-On-My-Ass Writing:\n Morgan Matson writes beautiful prose. It's a rare writer who can use SAT words, name-drop playwrights in an eloquent way, and still write in the very authentic voice of a teenager. It's an even rarer author who can take a book with what I consider to be a very simple concept, and make it into such a meaningful story. What Matson has is finesse - the ability to not only write the words clearly and succinctly, but to round out each sentence, each chapter, and each moment so that the words kind of curl around your heart like a blanket and leave you feeling hugged. Here are some examples:     \"But that was my best friend, the kind of girl your eyes went to in a crowd. While she was beautiful - wavy hair, bright blue eyes, perfect skin dotted with freckles - this didn't fully explain it. It was like she knew a secret, a good one, and if you got close enough, maybe she'd tell you, too.\" - Since You've Been Gone, Morgan Matson\n\n  \n \n       \"I closed my eyes only to open them once more, and make sure it was all still there - the riot of stars above me, this whole other world existing just out of reach.\" - Since You've Been Gone, Morgan Matson\nThe Final Word: One of my biggest wishlist items for YA is more about friendships - and friendships dealt with realistically. Since You've Been Gone delivers on that, and then some. This is a book about taking chances on friendship, about letting go and holding on, and about carving your own path in life. It's a book with adorable romances and moments that can only happen when you're a teen. And it's a book about bravery and strength. This is a book that any girl - and some boys, I'm sure - can relate to. I'm inspired by Emily, and I know that I will definitely learning from - and re-reading Since You've Been Gone several times in the future."}, {"userName": "April (Aprilius Maximus)", "userReviewDate": "Sep 13, 2013", "userURL": "http://www.goodreads.com/user/show/20658145-april-aprilius-maximus", "userReview": "I HAVE NO WORDS."}, {"userName": "Maram", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/36873117-maram", "userReview": "\"Nothing worth doing is easy,\" Frank said. \"Especially not in the beginning. But I'm not about to give up.\"This story essentially follows best-friends Emily and Sloane who planned to spend the summer vacation together when Sloane suddenly up and left, leaving her with nothing but a to-do list that Emily wouldn't have imagined to do on her own. She then gets an \"aha moment\" thinking that by completing the tasks on that list might just lead her to wherever Sloane is.Oh, I'm so giddy! I loved it you guys, this was super fun to read. The lists were a nice touch, it was nothing too cliche. The chapters were a bit on the longer side and where most of the time I don't prefer that format, it actually worked well because all of the items that Sloane mentioned has a story of its own. I felt at times that I was able to identify myself with Emily. She's shy, not very outgoing as she finds comfort in being at home and with her family even though she's been to many social outings with Sloane. So, it was really nice seeing her mature throughout this novel regardless of the fact that all it took was marking the items off of that list. I also really enjoyed reading about her new friendship with Frank, Collins, and Dawn. All of them had an impact on her growth, especially Frank *he's the cutest btw, I love him*. ALSO ALSO, Collins was HILARIOUS! FURTHERMORE, There was NO INSTA-LOVE and that actually took me by surprise! The last two chapters of the book was really nice and fulfilling for a contemporary so YAS!This is my second novel from Morgan Matson and she didn't leave me disappointed so I'll definitely check out the rest of her written works :) If you're looking for a light-hearted contemporary read with lots of adventure, character growth and a bit of romance, I highly recommend this! //Got a copy of this book earlier today and the cover is giving me such summer vibes (not like my area of residence isn't summer-ish all year round lol). Anyways, at the moment I'm looking forward to mixing up genres in my currently reading shelf."}, {"userName": "Kristina Horner", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/3070540-kristina-horner", "userReview": "I had a very interesting relationship with this book. I ended up giving it a 3.5, because while I enjoyed reading it in the end, I definitely had some issues with it.First of all, I started to think the point of the book was Emily realizing Sloane wasn't a very good friend after all. I was really bothered by the fact that Sloane put \"Penelope\" on the list, when Emily had made it extremely clear to her that she wasn't interested in using a fake ID and going to a bar, and even though she ended up having a decent time, it was selfish and thoughtless of Sloane to pressure her to do something she wasn't comfortable with a second time. But in the end, that wasn't the point! In the end they were BFFs for all eternity and none of that was addressed. That felt like a gaping plot hole to me.There's a big difference between encouraging someone to conquer a fear like riding a horse or stealing something petty or skinny dipping, and encouraging your friend to think you need to use a fake ID and sneak into a bar to really live is not really a good friend. That was a message I didn't appreciate from this book.I also was bothered by the fact that the book never resolved any of the issues in the end with Dawn or Collins. Really? We're just supposed to assume that all gets smoothed over? Dawn was REALLY UPSET with Emily. A conversation needed to happen there. This reinforced the thoughts I kept having that this book, while fun, felt a little amateur.But beyond these gripes, I did end up having a fun time reading it. Before things got weird at the end, I really enjoyed the friendships that grew between Emily, Frank, Dawn and Collins. It felt real. THEY felt real. The side plot with Gideon and Sam felt a little extraneous, but I understood the point it served in the story.It was hard to get through the first half of the book, how desperately Emily clung to the idea of Sloane completing her, being her safety crutch, in this incredibly sad and pathetic way, but I did appreciate how much she grew as a person. I loved the conversation she had with Frank about how she shines now.Their relationship was fun to watch unfold, and while I found aspects of this book a little tedious, I ultimately had a fun time reading it."}, {"userName": "Caleb", "userReviewDate": "Dec 20, 2014", "userURL": "http://www.goodreads.com/user/show/16381356-caleb", "userReview": "This book is fantastic and definitely one of my favorites for the year. I HIGHLY recommend to any contemporary reader!"}, {"userName": "Regan", "userReviewDate": "Mar 30, 2014", "userURL": "http://www.goodreads.com/user/show/19645927-regan", "userReview": "4.5 A great story that makes me waaaay excited for summer."}, {"userName": "Eryn✵", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/17568354-eryn", "userReview": "4 starsI normally don't read novels like these, but I'm starting to realize I should more often! They're really cute easy reads. And what's wrong with that?My favorite thing with this novel, without a doubt, is Frank and Emily's relationship. How they were friends first, only to become something more, was enjoyable to watch unfold. Especially with how it seemed they liked one another before either of them knew. I just felt the connection as soon as they met - even if they only took is as friendship.Another important thing to mention, is how well Matson developed Emily's character. At first, she was painfully shy, only to become someone who tried things and stepped out of her comfort zone. It was nice and exiting to see her grow as an individual. I also want to thank Matson for making sure the things Emily did weren't illegal or anything like that. You don't need to break the law to have a good time! Just grab some friends, food, music, and have a good time!Overall, this was great. I loved how in the end it seemed as though Emily was closer to Frank than she'd been with Sloane. Almost like they were meant to be together (because they were). That was beyond adorable. Really, this whole story was just one easy and comforting read. So glad my friend recommended it to me."}, {"userName": "Elisabeth", "userReviewDate": "Apr 13, 2014", "userURL": "http://www.goodreads.com/user/show/13130014-elisabeth", "userReview": "4.75 starsLove love loved it!! I identified so much with Emily its kind of eerie. Her story was both fun and inspiring and left me wanting more. Like seriously where is the epilogue!!"}, {"userName": "Anja", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/6054186-anja", "userReview": "*5 SUMMERY STARS*This book is such a perfect summer read! Even though it's currently raining outside here, this book really made me feel happy and wanting to go on adventures and meet new people!Since You've Been Gone is about Emily, who wakes up one day, discovering that her best friend is gone but she left her a list of things to do. In the process of doing that, Emily makes new friends, falls in love, finds herself and figures out why her best friend left and where she went.This book isn't the most original story out there, in fact it kinda reminds me of Paper Towns (only I liked this ending way better! This book is the one that made me retract 1 star off my previously-5-star Paper Towns rating btw), and it was a little predictable at times, but it was just so well executed and thought out that I'm giving this 5 stars anyway!I loved seeing Emily evolve from an introverted girl to someone who could make choices for herself and dares to speak up. It kind of reminded me of myself a bit and about how I used to be.I secretly dislike Sloane a bit though. During the flashbacks, I didn't like the power that Sloane sometimes had over Emily. Their friendship just didn't seem all that healthy to me. It's definitely good that Emily grew a backbone in the end! The person I dislike the most is Sam though, no worries!The story was a bit slow at times, but as soon as Frank started helping her on the list, things definitely picked up! I love that there wasn't any kind of insta-love here and you really saw their relationship grow.Overall, I really loved this and I advise anyone who hasn't read this yet, to definitely pick this one up asap!"}, {"userName": "Angela", "userReviewDate": "Jul 14, 2013", "userURL": "http://www.goodreads.com/user/show/7373882-angela", "userReview": "I love everything Morgan writes. Amy and Roger's Epic Detour made me smile uncontrollably, and Second Chance Summer made me cry uncontrollably. So, HELL YES, I'M READING THIS."}, {"userName": "Kai", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/41788524-kai", "userReview": "“I don’t think you have to do something so big to be brave. And it’s the little things that are harder anyway.”3.5/5 starsSo this was a nice and easy going story, a little romance, a lot about friendship and some mystery. The way Emily and Frank fall in love seemed very realistic and incredibly cute. I just like the way they slowly formed bonds, it was more authentic that way. Also, only a tiny bit of melodrama.It was an easy read and it took me little time to get through, but it was nothing that made me get too emotional. So if you are looking for something nice and light, this is your book.Find more of my books on Instagram"}, {"userName": "katherine", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/43359632-katherine", "userReview": "“I somehow knew that the particulars didn't matter. She was my heart, she was half of me, and nothing, certainly not a few measly hundred miles, was ever going to change that.”\ni think i will just read every single thing that morgan writes, like seriously her books are so good she is quickly becoming one of my favourite young adult contemporary authors around!! i hadn’t heard too much about this book from many people, i’m not sure if its a because it’s not a new book but i was easily transported into emily’s life and i began to experience things with her, from the laughs to the hurt and i enjoyed every second of it.emily and frank’s relationship was just adorable from beginning to end, emily was just super awkward and dorky and frank was just so polite and their interactions with each other was just lovely. i wasn’t expecting to see much of sloane and emilys friendship but there was pretty much a flashback every chapter and they truly were best friends, i loved their friendship.the soundtrack that was in this book was great, i always checked each one to see if there was anybody i had listened to before and if if there were some new ones i gave them a listen to, if you enjoy listening to a soundtrack while reading i would for sure look up the soundtrack/playlist to this book as there are some really good songs on there.basically, i have no idea how to say how much i loved this book, but if you enjoy young adult contemporary or her other work then you need to pick this up!!! :)"}, {"userName": "Kassidy", "userReviewDate": "Mar 25, 2014", "userURL": "http://www.goodreads.com/user/show/8937622-kassidy", "userReview": "I loved everything about this book! <3The main character is so relatable to me, and I highly enjoyed going on this journey with her. I absolutely loved the friendship aspect, along with self-discovery and even some romance. It was a blast going through the list with Emily and reading about her defining experiences and moments. I truly felt like I was her friend! Morgan Matson's writing is spectacular. It really drew me in and made everything feel so real. I felt encapsulated in this story and world!!I just love how everything tied together and it even brought a few tears to my eyes.I highly recommend!"}], "description": "It was Sloane who yanked Emily out of her shell and made life 100% interesting. But right before what should have been the most epic summer, Sloane just…disappears. All she leaves behind is a to-do list.On it, thirteen Sloane-inspired tasks that Emily would normally never try. But what if they could bring her best friend back?Apple picking at night? Okay, easy enough.Dance until dawn? Sure. Why not?Kiss a stranger? Um... Emily now has this unexpected summer, and the help of Frank Porter (totally unexpected), to check things off Sloane's list. Who knows what she’ll find?Go skinny-dipping? Wait...what?", "title": "Since You've Been Gone", "url": "https://www.goodreads.com/book/show/18189606.Since_You_ve_Been_Gone", "average": 4.17, "cover": "https://images.gr-assets.com/books/1377702326l/18189606.jpg", "reviews": 9344, "authors": [{"url": "https://www.goodreads.com/author/show/3351454.Morgan_Matson", "name": "Morgan Matson"}], "type": ["Contemporary", "Young Adult", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/18189606-since-you-ve-been-gone", "http://www.goodreads.com/book/show/21551545-since-you-ve-been-gone", "http://www.goodreads.com/book/show/7664334-amy-roger-s-epic-detour", "http://www.goodreads.com/book/show/11071466-second-chance-summer", "http://www.goodreads.com/book/show/17838528-the-unexpected-everything", "http://www.goodreads.com/book/show/32333338-save-the-date", "http://www.goodreads.com/book/show/28187215-detours-do-overs-and-dares---a-morgan-matson-collection", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}