{"ratings": 111, "userreviews": [{"userName": "Guilty Pleasures Book Reviews", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/4391611-guilty-pleasures-book-reviews", "userReview": "Sit, Stay, Love is a heartwarming story that will pull at your heartstrings for the dogs as well as their handlers. The dogs have been rescued from a dog fighting ring and are in bad shape and in need of rehabilitation. Kelsey and Kurt have been put in charge of their rehab and use the donated mansion as an outreach of the animal shelter. Not only do you see the slow changes in the dogs they are helping but you see a slow relationship developing between the humans as they too open their hearts to change.Kelsey has worked hard at the shelter and is up to the challenge of this task of rehabbing the dogs for adoption. Her working relationship with Kurt might have started off on shaky ground but she doesn’t back down to the big, bad ex-military dog handler and stands her ground on what is right for the dogs. She might have a small crush on Kurt but she knows that she’ll have to be careful and go slow if she wants anything to happen between the two of them. Over the course of the story you see admiration turn to respect and eventually into a love for Kelsey. When he reciprocates she knows that she’s find the right one for her and understands her far more than she thought imaginable.Kurt is ex-military and has a few dark secrets of his own and lets very few people into his life. On a whim he accepts the job to work with Kelsey and sees that she too is very much dedicated but a softie when it comes to the dogs. He doesn’t know how but she has wiggled her way into his thoughts and heart and feels that she brings something to balance him out. His family’s dynamics are a bit complicated but when he puts the past behind him, he knows that he can have a good future with Kelsey and deal with anything with her in his life. Sit. Stay. Love is a sweet romance that draws you in to show that both humans and dogs can rescue one another with a little work and patience. The author has created such likable main characters and a supporting cast to propel the story that it is very easy to get lost in it. She’s combined two of my favorite topics together, romance and dogs, and has created a good balance between them to show how it all works together for caring and devoted handlers and the dogs that need rehab."}, {"userName": "Sophia", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/5063928-sophia", "userReview": "A mass rescue operation of dogs abused in a huge dog fighting ring bust for a local St. Louis area shelter leads a sweet yet closed off woman and a scarred and rudderless man a new chance right along with the rescue dogs. I saw the blurb and it was all over. I had to give this new to me author and series a go.Sit, Stay, Love is the second book in the Rescue Me series. Fortunately, it works so well as a standalone because I spotted the blurb and didn't have the patience to go back and start from the beginning though I suspect Megan and Craig's book was a sweetie, too.So, this one begins when a call goes out to local dog handlers, shelters, and volunteers to step up when a hug dog fighting ring is busted up. Megan thinks this is a great opportunity for their shelter to reach out and for her best gal bud, Kelsey, to have an opportunity to get out of her rut and expand her horizons to partner with an experienced dog handler to begin rehab on several of the fighting dogs. At the same time, Kurt returns to the area to visit family now that he's out of the Marines before he heads west for a job doing anything, but working with dogs. Being a K-9 handler with several tours under his belt has left him raw after the lost of human and canine friends. But, he can't look away when he spots optimistic, but woefully out of her league Kelsey looking over the dogs with his old mentor to take back to her shelter. Kurt knows that hugs and kisses and big doggie wishes are not going to cut it.I know it sounds crazy, but I was actually wary about this book It was laid back and sweet and engaged me from the beginning. I kept waiting for it to morph into some sort of soap opera. Yes, Kelsey and Kurt have their hang-ups. Yes, they didn't always see eye to eye on the rehab work. And yes, there was a green-eyed monster moment. But people! This book about adults had the adults acting like adults. I mean... shazam. I know you'd think that's kinda a given, but its not. I think I fell in love with this book for almost that alone. Okay, not really. There was more to love.Kelsey and Kurt were fantastic. Their separate stories and their slow build romance was developed and paced just right. I know this story is not loaded with drama or pulse-pounding excitement, but it was subtle with natural rises and falls of conflict and resolution throughout the story. It was sexy, but again, this was understated letting the relationship develop first.And the dogs. They weren't just wallpaper for the people story. I adored seeing their individual characters fleshed out. Oh, and let's not forget Mr. Longtail, the cranky Maine Coon cat who ran the place and took an immediate liking to dog- guy Kurt. I enjoyed getting glimpses of the training work, but I also appreciated that the author showed just how much work shelter volunteers put in. They aren't just cuddling the cuties all day, though they do that, too. And what a fun variety of folks to fill out the cast of secondary characters, particularly Patrick.So, it was fabulous. It was laid back and sweet, but not saccharine. Gently-paced character-driven romance that was definitely one to make me smile and swoon with the pups and people whose story it was. Those who enjoy light, but engaging contemporary romance should give this a try.My thanks to Sourcebooks Casablanca for the opportunity to read this book in exchange for an honest review."}, {"userName": "Bea  Charmed", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/4186719-bea-charmed", "userReview": "\"Sit, Stay, Love\" was a sweet love story, with delightful dogs and a cat that I want to adopt. I enjoyed this one quite a bit and I'm looking forward to more in the series. I'm really hoping that Patrick will be the lead in the next book. He's an interesting character, who happens to be on the autism spectrum but it's presented as just a part of him, like his hair color or his height. To my knowledge, there's a dearth of romantic leads who have autism so I'm rooting for Patrick to be a romantic hero in a future book.Anyway, back to \"Sit, Stay, Love\". We met Kelsey in the first book. She is a full-time worker at an animal rescue center but has been feeling restless. When the rescue agrees to house, nurse back to health, and re-train almost 40 dogs rescued from a dog fighting ring, Kelsey takes on the challenge of running it and working with a professional dog handler, Kurt. He's just out of the Army and at loose ends. His dog mentor talks him into taking on the job; he thinks is might be good until he figures out what he wants to do now that he's a civilian.Sparks fly between Kurt and Kelsey from the first meeting. I loved the slow development of their relationship, their ability to talk things out like adults (for the most part), the ways they helped each other, and their willingness to learn and to admit mistakes. As they worked together they got know each other and they don't hit the sack together until relatively late in the book. Their romance played out subtly, with few dramatic moments. It was sweet, gentle, steamy, and subtle. The animal element was not forgotten. The shelter, the rescue of the fighting dogs, the dogs themselves, and the adorably grumpy cat, Mr. Longtail were realistic and important. It was obvious Burns knows her animals and rescue work. They are integral elements of the story, not just window dressing. She managed a good balance between enough information and drowning us in information. I enjoyed the animals and the dog training as much as I did Kurt and Kelsey's romance.\"Sit, Stay, Love\" was a sweet story that pulled at my heart, had me rooting for the humans and the animals, and left me smiling.My review of A New Leash on Love"}, {"userName": "Kristen", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/1071692-kristen", "userReview": "In Debbie Burns's Sit, Stay, Love, the second installment in the Rescue Me contemporary romance series, this heart-warming romance novel would make you fall in love and cry. For Kelsey Sutton, she works in a rescue shelter in St. Louis area and seeks the approval of her parents. But when news broke out about a dog fighting ring, it was up to her and her supervisor Megan to bring them into a huge mansion, the estate of Sabrina Raven, to take them in and to tend to them. But that had brought an uproar from protestors who wanted them to be euthanized. That's when she met Kurt Crawford, a veteran of the armed forces, who's looking for a fresh start after finishing his latest tour of duty. When a friend of him asked him to help him out, he debated around the issue and then took the plunge. His life changed when he met Kelsey, while he reconnected with his mother and grandmother, and made a world of difference to Mr Longtail and a bunch of dogs. Together, they formed a stronghold bond and had feelings for each other, when they cared for their dogs and rehabbed them before they would find new homes. In an instant, a love blossomed and transformed before them to give them a happy ending of their own."}, {"userName": "Aly", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/3528600-aly", "userReview": "\"Dogs do speak, but only to those who know how to listen.\"Kelsey Sutton is the adoption coordinator for the High Grove Animal shelter. When the police force disband a dog-fighting ring, the poor canines need a place to stay before they can be rehabilitated in the hope of finding a forever home. But the HG animal shelter doesn't have enough space for the 37 dogs. It's just their luck the refuge got an unusual inheritance with only one particular condition : a 114-year-old mansion they can use as long as they feed the cat that's living there and they let him stay. The TLC is fine, but the distress dogs need profesional training. That's when Kurt Crawford enter the scene.After eight years in the military, the dog handler lost too many friends, too many dogs so now he's out. He doesn't plan on accepting his former mentor's proposition to help with the rehabbing of the fighting canines, especially after meeting the pretty blond who doesn't seem cut out for the job but curiously, she's also the one who'll convince him to take the assignment when he see how fiercely she plead for the dogs' rights. Their relationship get off on the wrong foot. He question her capability because she's all heart and they rub each other up the wrong way. But surprisingly, once they get to work together and spend time at the mansion, they get along well. But even when it become attraction, Kelsey won't take a chance. She did before and the reject hurt too much. I see that Sit, Stay, Love is the second book written by Debbie Burns (it's my first time reading her). I wouldn't have guess she's a debut author. She created a story with heart, charm and depth and put just enough conflict to make things interesting without overwhelming the reader. And she add the little details that for me make a book better, like great secondary characters for example. But the romance was on the slow side (a little too slow and almost no \"sexy time\") and I wanted to see more about the hero working with the dogs. But I liked how Kurt's and his mom's reactions were realistic given their relationship. I also liked how Kurt and Kelsey were with each other. The fact that they didn't always agree when it comes to manage the dogs, but they both took time to express their opinions, listen to the other and sometimes agree to disagree. Finally, I adored how he showed her he wants to share his life with her. When it come to second chance, it's not always a question of romance. Dogs can have second chance too. That's the beautiful message of this book."}, {"userName": "Darcy", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/2225246-darcy", "userReview": "This is such a feel good romance, a bit surprising with how it opened. Kurt was a bit of a curmudgeon, then there was the whole situation with the dogs. Kelsey was so open and happy that I didn't want her with someone like Kurt and I worried that things with the dogs would be too much for her. Instead Kelsey worked her magic on all of them. I loved seeing Kelsey fighting for all of the dogs, but especially loved how everyone saw how great Frankie was! The romance between Kurt and Kelsey had a slow burn, but it worked for them. By the time either of them were really ready to act you knew they were in deep!I loved how this one ended, loved the journey Kurt went on at the end, the decision he made on how to really start his life and how he wanted Kelsey right there with him!"}, {"userName": "Leslie aka StoreyBook Reviews", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/272944-leslie-aka-storeybook-reviews", "userReview": "I am a sucker for any book that has dogs in it, and this one is loaded with dogs. They were rescued from evil owners that pitted them against one another for what they thought was a sport. You expect the dogs to aggressive to all the humans they come across, but not always.Kurt is tough and wants nothing to do with training dogs anymore after losing one overseas to an explosive device. It devastated Kurt because there was nothing he could do. He comes back home and gets rooked into helping his mentor rehabilitate the dogs rescued from the fight situation. He initially turns it down, but one look at Kelsey and her optimistic outlook and knowing who was going to come in and help train the dogs got the better of him.Kelsey may be optimistic but she is a realist too. She loves all animals and the job working at the local shelter is perfect for her. She has a kind heart and we see that when she is checking out the dogs before they can be transferred to their temporary shelter that she will be overseeing. I can imagine seeing any dog in the condition they were in would be hard. It would probably break my heart. But she can be tough when the situation arises.I enjoyed the evolution of the love story between Kurt and Kelsey. They both have some baggage to wade through and leave behind, but having each other to lean on helps their relationship move forward.There were a few situations with the dogs that left me with tears rolling down my face. Not for bad/sad reasons, but for happy ones. Very enjoyable!"}, {"userName": " Reading In Pajamas ", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/4303393-reading-in-pajamas", "userReview": "Spotlight, Review & Giveaway: SIT, STAY, LOVE (Rescue Me) by Debbie Burns https://wp.me/p3d0RZ-aFW Publication Date: April 3, 2018Genre: Contemporary RomanceReviewed by: Reading in Pajamas/ DonnaRated 4.5 Stars This is a lovely, light romance with a cast of varied personalities and emotions. There is no real drama to tense you up, yet it never got boring or saccharine. Kurt may have seemed a bit too standoffish at first, and Kelsey too naively optimistic, but it all worked. It was real people, real life and real love woven around rescued dogs. I enjoyed this feel-good story.*Review copy provided by Sourcebooks in exchange for an honest review.~*~*~*~Kindle $4.99 http://amzn.to/2sxIPNK"}, {"userName": "Elley Murray", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/2768497-elley-murray", "userReview": "This book was great on so many levels. Kelsey and Kurt are both great characters dealing with issues from their pasts, as well as trying to do their best to get through each day and build a better future. I love Kelsey's history with depression, her rainbow color-of-the-day T-shirts, and how she takes one of the shelter dogs home with her each night. I appreciate the amount of diversity in this book - Kurt is dealing with PTSD, Kelsey struggles with depression, Patrick (a wonderful side character) has Asperger's. The romance storyline doesn't really feel front and center of this book to me. It splits its focus on Kurt dealing with his PTSD, his family issues, and the loss of his grandmother; running rehab for 37 dogs rescued from a dog fighting ring in a falling apart mansion, with a specific focus on a few of the individual dogs' stories, as well as issues with protesters and the like; the relationship with Ida (another really great side character). There are also many themes of fate in this book, which at times got a little sappy for me. The sex scenes are also told in a very fade-to-black manner, so this book is definitely more sweet than steamy. At times it got a little too saccharine sweet for me, which is what inevitably made me rate it 4 stars instead of 5. The writing is great, I loved the characters and the world they built, and this book make me want to go adopt a cat exactly like Mr. Longtail. This is the second book in the Rescue Me series, but can be read as a stand alone novel. The first book, A New Leash on Love, is about Megan and Craig who do feature some as side characters in this novel, but the spoilers are really limited to things you already know from reading romance (i.e. that they wind up together and live happily ever after). There is also some set up that makes me really hopeful that the next book will be about Tess and Patrick. *I received a copy of this book from NetGalley and the publisher in exchange for my honest review."}, {"userName": "Pelusa Rivera", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/20225333-pelusa-rivera", "userReview": "We have a retired marine who is fighting battles within and what is helping him deal is the training dogs. While at the shelter he meets Kelsey who comes to realize that this man needs help too not only the animals. This was a sweet story, probably a little too sweet for me, but good none the less."}, {"userName": "Marsha Spohn", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/27349116-marsha-spohn", "userReview": "Reviewed at Keeper BookshelfYou know what I really loved and respected about Sit, Stay, Love – aside from the dogs, of course? Adults acting like adults, okay, maybe flawed, not perfect, have their own issues adults… but, still acting like an adult. I was drawn in to this story by the plight of the dogs, but the human characters kept me captured to find out what happens next to them all. It may sound silly, but so often characters act like children throwing a tantrum – so yes, it is noteworthy and enjoyable to find a non-human driven story (dogs desperately in need of help and a forever home) with humans acting like grown-ups.Both Kurt and Kelsey have realistic issues to be dealt with, there is no denying that. Kurt has lost too many friends, both human and canine, in his time in deployment. The absolute last thing he wants to be doing as a new civilian is training dogs again – yet, he cannot let Kelsey face the realities of retraining now former fight dogs in the hopes of eventually finding them forever homes completely on her own. She’s going to need help and he cannot just walk away from the dog or the woman. Their’s is a slow burning romance, from strangers to team mates with a purpose, to friends and then more. There is little sugar glossing on any of the situations. We all know the reality of life for fight dogs isn’t always a happy ending, yet watching caring humans try to redirect the learned instincts of these rescues is truly heartwarming. Could there have been more harshness? I suppose, but I also liked that the author let her readers be human themselves, and trusted us to know the realities, the hardships and the joy of retraining fight dogs without having to hit us with a sledgehammer.I was easily caught up in Sit, Stay, Love. With dogs who need love and patience, one superior cat, lots of interesting secondary characters and a story that touches the heart whether you’re a dog lover or not – really, what’s not to enjoy about this one? I’d recommend Sit, Stay, Love to any Contemporary Romance reader – and if you haven’t read it yet, I’d also recommend the first story in the series, A New Leash on Love as well.*I received an e-ARC of this novel from the publisher via NetGalley. That does not change what I think of this story. It is my choice to leave a review giving my personal opinion about this book.*"}, {"userName": "Donna (More Than a Review)", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/2219399-donna-more-than-a-review", "userReview": "Sit, Stay, Love by Debbie Burns is an adorable sweet romance. The book immediately caught my interest in the first chapter. I am a dog lover so I really wanted to like it and I was not disappointed. Kelsey was a like able character. She is a manager at an animal shelter. She is asked to handle a big situation where a lot of dogs had been mistreated. It showed her strengths and her heart. I found it realistic how she dealt with her family’s feelings about her career. Kurt is an ex-military dog handler dealing with issues from his past and his family. He has lost his dog and many friends in the service and is convinced that he needs a break from dogs. Once he meets Kelsey and the dogs he cannot help but get involved. The author did an amazing job of making Kurt human and a hero. Kurt lives with ADHD and was a great hero and example for those living with it. Each of the dogs took on a personality and you were championing for them to get a forever home.Debbie Burns is a ‘new to me’ author. I will be looking for more books by her.Alcohol - some minor drinkingViolence - the dogs were rescued from a dog fighting ring, some were very hurt, and there were protestors Sex - 2 there was a make out scene and one physical scene with very little details.I received this book from Netgalley. I was not required to write a positive review.You can see my full review at More Than a Review dot com where I rate the level of sex, violence, language and drug/alcohol use in books."}, {"userName": "Danielle Urban", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/29092975-danielle-urban", "userReview": "Sit, Stay, Love by Debbie Burns is the kind of novel that pulled me deeper into its story. I felt the emotions from the characters as well as the ones coming from the furry creatures. A tough cat who fights an ex marine for a pillow space to sleep, a homeless dog that broke down the wall the marine built around his heart, and a cute female human who has wormed her way into his soul...has left me feeling emotional. An animal shelter takes on dogs that are not fit to be in a regular shelter and houses them into a big mansion with enough space. The building is old and dark. But once the dogs start to arrive, a sense of purpose and action take over the empty fear. A retired marine with inner battles yet to be fought some how finds healing and peace training the dogs. An animal shelter woman loves the animals that come to the new shelter. Helping them find love and new homes will be hard. But in the end it is worth all the struggles.This novel was not just about the dogs needing a rescues but their rescuers needing one too. It was sweet, heartfelt, and engaging. I cried, laughed, and fell in love. Sit, Stay, Love by Debbie Burns is a must read. I recommend it to all animal lovers, contemporary fiction lovers, and to all romance lovers. It captured my whole heart.I received this copy from the publisher. This is my voluntary review."}, {"userName": "Avid Reader", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/16833016-avid-reader", "userReview": "Sit, Stay, Love (Rescue Me #2) by Debbie Burns3.5 starsM/F RomanceTriggers: Dog fightingI was given this book for an honest review by Wicked Reads.Kurt and Kelsey are a couple who would seemingly not have very much in common. Kelsey is a very soft hearted woman who would die for any of the animals in her shelter. She gives everything that she has to them and with that devotion, she also makes an incredible friend. When she is asked to head up a rehabilitation program for a dog fighting ring, she doesn't hesitate.Kurt is just coming home from being deployed. He has been a dog handler his entire career and lost many friends. With each loss, a little part of himself was lost too. When he comes home and is asked to help rehabilitate some fighting dogs and get them ready to be adopted, he balks at first. He came home to lose himself in work, but wanted to stay away from the dogs.Kurt and Kelsey's relationship was a very slow burn. They took their time and despite the communicating hangups that Kurt has, it seems that Kelsey is very intuitive. However, the love story was not very fluid and seemed at times to drag on for a while. Also, the book was a lot about the dogs and less about the romance. I think that my final issue is that it seemed to end very abruptly. But, in saying all of that, if you're a dog lover, you're going to love the personalities of all of the animals involved. The kindness that each character displays for them it truly admirable. I wonder if Kurt's long time friend, Tess will get her own story next?"}, {"userName": "Nicole Smith", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/2714048-nicole-smith", "userReview": "This is the first book I've read by this author and I guarantee it won't be the last. She has gained a new reader. I love books with animals in them and this one got me right in the heart. The stories of the abused fighting dogs broke my heart, but seeing the rescue organization give them a second warmed my heart. It's a beautiful story. Kurt needs to find meaning again, but there is no way he's going to be convinced to help Kesley or will he? Kesley brings Kurt peace he didn't know could exist, but he still struggles to let go of the past. The characters will grab you right from the beginning and the animals will grab your heart. I wouldn't pass up on reading this one. I'm so looking forward to the next book in the series and I'm going to go back and read the first."}, {"userName": "Jo  (Mixed Book Bag)", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/1372248-jo-mixed-book-bag", "userReview": "Kurt and Kelsey are great characters and they are aided by some awesome dogs. A older house left to the shelter becomes on of the characters as well. This is a very well plotted story with two character who have to overcome their past to move on to their future. There is great dialog, interesting side characters and a multilayered story line. Great addition to the Rescue Me series.I received a free copy of the book in return for an honest review."}, {"userName": "Sharon", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/1005685-sharon", "userReview": "Sit, Stay, Love- the 2nd book in the Rescue Me series- is a delightful romance with rescue dogs, a recently retired marine, and true love. What more could one ask for?The ARC was provided by Sourcebooks Casablanca in exchange for an honest review."}, {"userName": "Isha Coleman", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/25556913-isha-coleman", "userReview": "Man's best friend becomes his unwitting wingman in this appealingly adorable bundle of heart. Bring on the cuddles, highlight the wisdom and amp up the humor to create an enchanting tale of faith, empathy and romance. Love is a long time coming, but it arrives right on time."}, {"userName": "Pam", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/25484461-pam", "userReview": "Book 2 of the series and I loved it. Wonderful story with great characters and I want all the dogs starting with Peter Frankie. Kelsey and Kurt are so sweet and great together. Story has romance, friendship, humor and dogs. I can't wait for the next book"}, {"userName": "Lauren loves llamas", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/90874-lauren-loves-llamas", "userReview": "Trigger warning: animal abuse (dogfighting – not on page, but dog’s injuries after surgery are described), PTSD from military serviceThis is a sweet opposites-attract contemporary with just a hint of magical realism. It’s the second in the Rescue Me series, but I read it as a standalone. I’m very much looking forward to going back and reading the first book soon!Kelsey works at a no-kill shelter, and when a dogfighting ring is busted, the responsibility falls on her to figure out which dogs can be safely rehabilitated and rehomed, and how to do it. She initially comes off as a bit overly optimistic and softhearted – she wears a different colored rescue animal shirt each day of the week and has an “I Brake For Turtles” bumper sticker – but she’s actually quite levelheaded. And she has to be, considering she’s signed herself up for housing thirty-eight dogs in a rundown mansion that was donated to the shelter. At one point, Kurt describes her as being “all-heart,” and I think it does fit her quite well. She’s such a kind, loving person.Kurt is everything Kelsey is not – he’s an ex-military dog handler, and initially wants nothing to do with Kelsey and what he sees as her harebrained, doomed to failure idea. He has near-crippling ADHD that’s soothed by being around and working with dogs. His last tour, though, has taken a toll on him, and he thinks getting away from dog training and life as he’s known it is the perfect cure – until he can’t get Kelsey and the dogs out of his mind. Underneath it all, he’s a squishy cinnamon roll, and watching him shake off the prickly outside as the book progressed was fun. They’re still very much opposites, though, and it’s perfectly encapsulated in an argument over whether the dogs should be named (because they’re all going to forever homes!-Kelsey) or referred to by number (so the volunteers don’t let down their guards around possibly dangerous animals-Kurt). And so begins a lovely dance of crushing and sexual tension interrupted by dogs that need to be fed.“I had heard about people feeling like a place was made for them, but never understood it. That wasn’t the desert for me, or the jungle, or the post. But this house… When I’m here, I don’t feel like a puzzle piece that will never fit in. When I’m with you, that rings even more true.”It’s not just about the rescue dogs, though, or about their budding relationship, but also about the house they’re doing the rehab in, which I thought was a fascinating side plot. I loved Ida and Sabrina, the sisters who lived in mansions next to each other, until Sabrina died and left the house – and Mr. Longtail the cat – to the rescue. While most of the book’s POV is from Kurt or Kelsey, there are small snippets from Ida’s POV, and some of my favorite scenes where her telling the history of the house and her sister to them.As for cons, Kelsey verges on being just too sweet and wonderful. I rolled my eyes a few times at some of her antics, but was able to overlook it for most of the book. Also, between Kurt’s ADHD and his PTSD, I would’ve liked to see him get some sort of therapy. Both seemed pretty bad at times, and I left the book wondering how he’d recover.Overall, I really enjoyed this book. I can see where, if you’re not a fan of dogs, this may not be anywhere near appealing, since so much of it deals with their rehabilitation. Other than that, this was adorable and sweet!I received this book for free from NetGalley in exchange for an honest review. This does not affect my opinion of the book or the content of my review."}, {"userName": "Meags", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/9612668-meags", "userReview": "Kelsey is the lead adoption coordinator for High Grove Animal Shelter, and is feeling like she's at a crossroads in her life. She left college abruptly after a humiliating post-coital rejection from her best male friend that sent her into a major depressive episode, but has been more or less content with her job. Her boss, Megan (who's story was in the first book), has noticed her unease and a major project has fallen into her lap, and she eagerly assigns Kelsey to the task. What is the project, you ask? Rehabbing dozens of dogs who were in a cruel fighting ring. Of course, Kelsey can't do this alone, and ex-Marine Kurt ends up stepping in to help after an unfortunate meeting at the warehouse where the dogs are being temporarily held. (Yep, she barfs all over his shoes after being completely unprepared to see the injuries these poor pups have.) Kurt is just as reluctant to be rehabbed post-military as some of the dogs, but Kelsey's calm nature and the old mansion that becomes the dog rehab headquarters begin to win him over.I read the first book in this series several months ago, and was pleasantly surprised. This book has a more interesting plot, however there were some technical aspects that fell a little flat. Sometimes it was difficult to tell where the POV was coming from. There was also a third POV, from the wonderful neighbor, Ida. I didn't particularly mind her POV being in there, but it's generally a thing that in a romance novel, only the players in the actual romance get a POV. If this is something that bothers a reader, it would likely take them out of it. I also found some of the dialogue to be stilted and almost like something a therapist would say. The cadence of the language isn't natural. They seem to talk too much for there to be any conflict at all. Of course, the majority of the conflict is Kurt's inability to open up, but when he does, it seems like he goes from mute to chatterbox almost instantly. This is also a very sweet romance. There is a sex scene, but there's very little of it on the page. I know this will appeal to some readers! FINAL THOUGHTS:I really, really enjoyed this book. It's much sweeter and non-angsty than I usually like, but it had an interesting story and the characters were fun to hang out with for a little while. I'm interested in reading more of the stories from this series, especially since I read recently there are supposed to be 6 of them. I hope Patrick gets a book, because he is a great character."}, {"userName": "Debbie Lester", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/2847613-debbie-lester", "userReview": "Debbie Burns returns with the second book in the Rescue Me series, Sit, Stay, Love. Readers who are also dog lovers will find this one particularly appealing. With a house full of fighting dogs, a former military dog handler with PTSD, and a very invested neighbor, Kelsey has her hands full. You'll love her sweet and saucy personality as she navigates love and rescue dogs. Burn gives us, a slow build romance that gets to the heart of what the saying, 'opposites attract' really means. This one is a keeper!What I liked:To start with I really liked the whole idea of this series. As an avid reader I read a lot of books about a lot of things and I always find myself drawn to books about rescue animals. Main character Kelsey works for a no-kill animal shelter, which I think is amazing. There needs to be tons more of these kinds of shelters and I think books like this show awareness to the issues. It also shines a light on the rigors and taking care of animals that have been abused and need special care. This aspect of the book was really Burns' fortay.A lot of the book was focused on the animals and the mansion that has been donated as a shelter. A dog fighting ring is busted and Kelsey finds herself moving in with a bunch of dogs that have seen better days. From injuries to abuse. I loved the fact that she took on such a huge challenge. She comes across as a character that is almost too sweet at times, but the reader will have no problem seeing her love for her work and these animals. She is driven and optimistic and I felt like that was what was needed in the main character of a book like this. Burns did an amazing job of making Kelsey someone readers would believe was so invested.Ahhh, Kurt. What a great character. Not only an ADHD sufferer but also dealing with PTSD on top of that. I have a soft spot for military men and Kurt was no exception. I liked the fact that Burns shows him as very clinical in some ways but also very efficient and very loving with the animals. His relationship with Kelsey showed such vulnerability and trust once it got going. This one is a slow build, but that's perfect for the type of book it is. This one doesn't have bombs going off or kidnappings or all that crazy stuff. It's more about an everyday kind of life and love and that was such a nice break from books that need too much action to move the plot.What I didn't like:Kelsey is a real sweetie pie and that could come off as a bit saccharine to some readers. You know those overly perky chicks at the drive through window at 6:00 am... Oh yeah the ones you wanna just slap. She could come off like that in the beginning, so give her character a chance to marinate a bit. She gets better. I liked her chatty optimism but not everyone would. Kurt needs some help. A counselor, a therapist, a good friend to talk to. I don't know but I felt like he had some issues that were addressed but not really solved here. I wanted to see him get some relief from some of the things that were weighing so heavy on him. My only real gripe.Bottom Line:If you love dogs and rescue stories, this one is just a really good read. The romance is a slow builder and it when it gets steamy, it fits perfectly. I loved the mansion and the story behind it and the eclectic secondary characters like Ida. Lots of good stuff here. Plenty for the reader to sink their teeth in (see what I did there lol...)"}, {"userName": "Book Gannet", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/36450308-book-gannet", "userReview": "I’m a sucker for books with dogs in, and this one proved to be an absolute tonic. Good people, dogs in real need of rescue, a bit of romance and some really happy endings – what’s not to love?I liked both Kelsey and Kurt. She is compassionate and caring without being unrealistically sentimental, while he’s a bit quiet and seems stern, but is really a huge marshmallow underneath. He gives her confidence, she gives him understanding, and the pair of them made an excellent team.And those dogs, all those dogs, rescued from a fighting ring and in need of so much love. I appreciated that this book wasn’t about quick fixes, and although there was perhaps a hint of shiny gloss over the outlook of most, it was still clear that it would take a lot of work, a ton of patience and an awful lot of expertise to take on such a challenge.However, there were a few things that felt unfinished or were thrown in and then forgotten about. Kelsey’s depression was one of these. The mention of it came out of nowhere, the idea of her wearing a different rainbow colour each day as a way to cope was set up, then it’s completely forgotten about until she realises she doesn’t need the colours anymore. It was a bit too throwaway for me. Like the protesters. I really expected that to go a little deeper. While certain things with Kurt were definitely left unfinished, making the ending feel a touch abrupt.Overall, though, this was a lovely, feel-good read with a working partnership that slowly blossomed into an adorable romance. I loved that there wasn’t a silly falling out for no good reason, even though there were moments when it certainly could have gone this way. These two act like adults throughout, even when Kurt struggled to find words. So if you’re looking for a slow-burn romance that’s full of sweetness and love dogs, then you’ll probably like this. I did, and I’ll definitely be looking out for more from this author.(ARC from the publisher via NetGalley.)"}, {"userName": "Whitney Mcgregor (A Literary Perusal)", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/3620574-whitney-mcgregor-a-literary-perusal", "userReview": "3.5 Stars... Sit, Stay, Love was a sweet read I chose to pick up because I'm a sucker for romance novels involving animals, especially rescue animals. Kelsey and Kurt's story was fell a little flat in places but has a nice sprinkle of interesting side characters that help bring the pages to life. I adored the chemistry between the two main characters and I'd put the heat level at just the right intensity. The love scenes don't overtake the plot but give a little oopmf to the story. Kurt is one of those dream guys, very honorable and sweet once you wear him down a little. Kelsey's love of all creatures great and small made me an instant fan. And there are a few of the other characters I'd love to read more about.The animals in this story stole most of the scenes. From sweet to feisty, a bunch of rescue dogs are featured and while their story is an ugly one, I'm glad the author is bringing attention to animals who deserve a second chance. One of my disappointments actually revolved around the most cantankerous dog and his owner. It's not directly related to the romance at all so I'm not sure why it agitated me but it did. Another disappointment was related to the protestors in the story as it seemed overly dramatic. However, the good outweighed the bad!In short, if you love animals and romance then consider giving this book a try. Although it wasn't perfect, I'm certainly open to reading more from this author."}, {"userName": "Bonnie", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/21782321-bonnie", "userReview": "Sit, Stay, Love by Debbie Burns. Kelsey Sutton, works at a no kill shelter for rehabbing a group of rescue dogs. A woman leaves a older large home to a rescue place for the additional dogs they don't have room for. As long as her cat is living. Kelsey goes over and feeds the cat, who doesn't like people, every day. The rescue center need a dog handler to work with these mistreated dogs. These are dogs who were trained to fight. Kurt Crawford is such a dog handler. Once the dogs are at the house Kurt moves into the house to work with these dogs. Kurt has some of his own problems since he was in the service. Romance does happen. A very good touching read."}, {"userName": "Margie", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/5397913-margie", "userReview": "Sit, Stay, Love, book #2 in Debbie Burns Rescue Me series is a wonderful second chance love story and that includes a number of rescued dogs as well as their human keepers. It is filled with lots of love and laughter. The dogs rescued from a dog fighting ring managed to work their way into the main characters' hearts. And mine too! This author has told a story of loving, caring and dedicated dog lovers. Anyone who has ever rescued a pet will surely relate. I'm sure all who enjoy a love story with dogs involved will really enjoy this book!"}, {"userName": "Addictive", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/4001944-addictive", "userReview": "This was my kind of romance! The dogs were the main focus and the chemistry between Kelsey and Kurt was interspersed. There wasn't any real conflict which was kind of refreshing in a romance novel. Burns wove the the different elements in the story in a way that you didn't feel like you were missing out on any one aspect of the romance between Kurt and Kelsey but you were still very much involved in their lives and the outcome of the dogs. I can't wait to read bk 3."}, {"userName": "Kristen", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/21159132-kristen", "userReview": "What a heartwarming story, with endearing characters and a meaningful pursuit - to rescue and rehabilitate dogs rescued from a dog fighting ring. I enjoyed getting to catch up with Megan and Craig from New Leash on Love, but reading that book was not necessary to be able to enjoy and understand this one. Kelsey and Kurt's story is touching and captivating, both drawn to the many fine, sensitive qualities of each. I look forward to the next book in the series!"}, {"userName": "Amy Bergstrand", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/12583900-amy-bergstrand", "userReview": "Such a sweet love story with a storyline that will captivate animal lovers, especially rescue dog, immediately. I loved the characterizations if the dogs. I want to know what happens to each of the 37 rescue dogs. I also want to know who was remodeling the neighboring house as well as when/if Ida moves. Will Tess and Patrick hit it off? So may questions. I was invested in this lovely story."}, {"userName": "Heather andrews", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/7787656-heather-andrews", "userReview": "Kurt could be a complete gentleman, “I’d offer you my jacket, but I don’t have one. Would you like my shirt instead?” Seriously I loved Kurt the man was just a sweetheart, “it’s probably a good thing that we’re never alone, because I wouldn’t get any work done. Especially now that I’ve gotten a real taste of you.” I really liked thia book, Kurt was an easy man to fall in love with."}], "description": "These dogs aren't the only ones in need of rescue\n For devoted no-kill shelter worker Kelsey Sutton, rehabbing a group of rescue dogs is a welcome challenge. Working with a sexy ex-military dog handler who needs some TLC himself? That's a different story. Kurt Crawford keeps his heart locked away from everyone. Well, everyone except the dogs who need his help...and always have his back. But as Kurt gets to know the compassionate, beautiful woman he's been assigned to work with, he can't help but feel a little puppy love... Rescue Me Series:A New Leash on Love (Book 1)Sit, Stay, Love (Book 2)What People Are Saying About A New Leash on Love:\"A warm cuddly tale full of dogs, cats, kids, and genuinely likable adults...\" —Publishers'Weekly STARRED REVIEW\"Sexy and fun...an irresistible match...\" —RT Book Reviews, 4.5 stars, TOP PICK\"A ragtag cast of supporting characters, human and otherwise, shines...\" —ForeWord, 5 Stars\"Pet lovers will adore all the animals introduced in Burns'sweet romance.\" —Booklist", "title": "Sit, Stay, Love\n      \n          (Rescue Me #2)", "url": "http://www.goodreads.com/book/show/36483809-sit-stay-love", "average": 4.14, "cover": "https://images.gr-assets.com/books/1519421816l/36483809.jpg", "reviews": 51, "authors": [{"url": "https://www.goodreads.com/author/show/16200547.Debbie_Burns", "name": "Debbie   Burns"}], "type": ["Romance", "Romance", "Contemporary", "Animals"], "outlinks": ["http://www.goodreads.com/book/show/36483809-sit-stay-love", "http://www.goodreads.com/book/show/37288543-sit-stay-love", "http://www.goodreads.com/book/show/38631056-sit-stay-love", "http://www.goodreads.com/book/show/32470624-a-new-leash-on-love", "http://www.goodreads.com/book/show/39068287-my-forever-home", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}