{"ratings": 600, "userreviews": [{"userName": "Mylène Brunet", "userReviewDate": "Feb 22, 2015", "userURL": "http://www.goodreads.com/user/show/35081278-myl-ne-brunet", "userReview": "Nicolas Dickner sait vraiment faire les choses avec humour et finesse. Je n'avais pas tant aimé Nikolski (quoique je n'avais pas non plus détesté), mais Six degrés de liberté est un gros coup de coeur. Je n'ai eu que du plaisir à lire cette histoire abracadabrante impliquant des personnages décalés (je les ai aimés d'amour dès les premières pages) avec au centre un… conteneur."}, {"userName": "Amélie", "userReviewDate": "Apr 18, 2015", "userURL": "http://www.goodreads.com/user/show/4998545-am-lie", "userReview": "Comestible, mais pas vraiment conçu pour être mangé. Le biscuit chinois n'est pas une denrée alimentaire, mais une unité de stockage d'information. (p. 77-78)Il y a toujours une élégance amusée dans la plume & les intrigues de Nicolas Dickner : le choix méticuleux des mots, les images judicieuses, les bouts d'histoire délicieusement imbriqués les unes dans les autres. &, en boni dans ce roman-ci, deux personnages féminins complexes & nuancés, toutes deux aux prises avec des moyens limités & des envies insatiables. Ç'a été un vrai plaisir que de laisser tomber la retenue & d'engouffrer les presque quatre cents pages de Six degrés de liberté en deux jours & demi, en barouettant une des copies de la BAnQ dans les transports en commun -- & un peu sous la petite pluie fine, la fois où l'abribus était en rénovation."}, {"userName": "Marilyne Lafreniere", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/31771155-marilyne-lafreniere", "userReview": "Jai haïs ce livre! Pourquoi? Il m'a tenue captive!!!Étrangement, même si les personnages me laissaient un peu indifférentes et que l'histoire ne me rejoignait pas dans les enjeux... La plume de l'auteur est si vive... Nicolas Dickner a su entrer dans ma tête et me happer!Livre parfait quand on a besoin d'évasion A éviter en fin de session ! ;)"}, {"userName": "Penny (Literary Hoarders)", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/3727008-penny-literary-hoarders", "userReview": "3.5 stars but closer to the 4 stars because the writing was superb, the translation like butter and the characters Dickner created were wonderful. It lost me a little in the middle and by the end it was almost like a \"what is the point/meaning here\"? What is it that Dickner was trying to show in the end? I really did enjoy reading this one - something completely different from what I would normally read and I loved the characters and the writing - but I lost some interest toward the end. Thank you to Penguin Random House Canada for sending this one for review. Will this one be on the Giller longlist this year? Is it eligible? I believe this was released before?"}, {"userName": "Karine Mon coin lecture", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/6502028-karine-mon-coin-lecture", "userReview": "Un roman particulier, avec des personnages qui veulent juste voir si c'est possible. Et bon, on retrouve quand même un personnage de Nikolski. Juste pour ça, j'étais contente!"}, {"userName": "Benoit Galarneau", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/25890274-benoit-galarneau", "userReview": "J'ai  bingé  ce livre si une telle chose est possible en littérature. L’histoire en temps réel de Jay, ponctuée de, on le devinera, flashbacks à propos de Lisa et Éric érige une belle architecture de narration. La saveur internationale des histoires parallèles est fraiche et il fait bon de quitter le Québec. Lisa et Jay, deux beaux personnages féminins, comme je les aime. Les chapitres se succèdent en exposant leurs vies et leurs audaces, sans jugement ni artifice. Au contraire, les commentaires doux çà et là apportent humour et poésie. Rapidement, l’intrigue principale prend forme. Où est se foutu conteneur? On le saura mais les vraies questions demeurent libres de réponse toute faite. Pourquoi Jay risque-t-elle sa liberté pour une enquête qui ne la concerne pas? Quel est l’objectif véritable de Lisa (si elle en a un)? Il y a six degrés de liberté. Six dimensions. Le geek en moi aurait aimé que le roman l'explique. Ou n'ai-je pas compris?"}, {"userName": "Jaclyn", "userReviewDate": "Sep 10, 2017", "userURL": "http://www.goodreads.com/user/show/11169412-jaclyn", "userReview": "Not bad. Slow in parts, the ending was kinda meh, and I don't quite get the point of Lisa's plan with the container, but I kinda liked the police chase aspect and Eric and Lisa's GPS balloon int he beginning."}, {"userName": "Sandra", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/2047037-sandra", "userReview": "Every once in awhile you come across a book that defies description and Six Degrees of Freedom is that book. The idea of being able to avoid the limitations of geography is so intriguing. I loved reading it and sad to have reached the end. Thanks to Goodreads for the giveaway."}, {"userName": "Raynald Provost", "userReviewDate": "Apr 22, 2017", "userURL": "http://www.goodreads.com/user/show/66255641-raynald-provost", "userReview": "Que j'aime son style, j'avais déjà été charmé par Nikolski, un autre de ses romans. C'est plein de vignettes savoureuses comme l'espionne qui cherche le chemin de Huntington au départ de Valleyfield, si vous l'avez déjà fait vous savourerez comme moi, les noms de rue qui donnent: coin béatitude et allégresse. les perruches, les chambres secrètes, Ikea, la rénovation...Des personnages exotiques mais familiers: le père bricoleur et sa collection d'outils, la mère acheteuse, le junkie de Whippets, etc.Mais la fin tombe à plat, elle est prévisible et pas intéressante."}, {"userName": "Mélanie", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/6603908-m-lanie", "userReview": "Dickner est certes un bon conteur. Mais il est question ici de repousser les limites de l'expérience humaine dans ce conteneur intelligent. Or, on y entre à peine! Dickner se contente de quoi, deux pages autour des premiers moments avant le commencement du voyage de Lisa. Et c'est tout. On se sent comment, après plusieurs semaines dans un conteneur? On ressent quoi, physiquement, et au plan psychique? Il y a beaucoup de blabla autour de la mécanique de la chose, bien des noms de ports qui sonnent vachement inconnus. Mais le romancier observe son sujet d'un point de vue objectif, avec distance.Il n'entre pas dans le coeur de son projet. C'est dommage."}, {"userName": "Annie Bacon", "userReviewDate": "Apr 06, 2015", "userURL": "http://www.goodreads.com/user/show/7407162-annie-bacon", "userReview": "Je suis tombée sous le charme de la plume de Dickner. Mon nouvel auteur Québécois préféré? Possiblement! Il joue dans ce livre avec deux lignes de temps, et deux personnages féminins à la fois réels et hors des clichés féminins, avec brio. Je vais certainement ajouter ses autres livres à ma pile de choses à lire! Ma seule critique? J'avais lu récemment un Cory Doctorow qui exploitait la même idée de base. L'effet nouveauté était donc moins présent pour moi, mais le sera sans doute pour les autres lecteurs!"}, {"userName": "Niki Vervaeke", "userReviewDate": "Jul 06, 2016", "userURL": "http://www.goodreads.com/user/show/5761615-niki-vervaeke", "userReview": "Een verhaal, drie personages, een personage dat er geen is en toch een grote rol speelt.Een verhaal op basis van een waargebeurd verhaal en een thema dat vandaag de dag meer en meer in onder onze neus geschoven wordt. Automatisering, systemen, flaws en niet weten vs de mens die zoekt, grenzen overschrijdt. Tegelijk realistisch en spannend geschreven. Fijn vakantieboek als je niet wil ingaan op het systemische dat aangekaart wordt en gewoon wil lezen.http://www.tzum.info/2016/06/recensie..."}, {"userName": "Julie Collin", "userReviewDate": "Dec 08, 2015", "userURL": "http://www.goodreads.com/user/show/46278152-julie-collin", "userReview": "Ces 381 pages bien ficelées m’ont fait perdre la notion du temps! La construction du roman est particulière. Deux histoires s’alternent, mais elles se déroulent en différé. Elles se rejoignent à quelque part dans la deuxième moitié. C’est à la fois mélangeant et fascinant. L’auteur insère beaucoup de références culturelles qui ajoutent au plaisir de le lire. J’y vois un potentiel scénario de film.La suite ici : http://julielitaulit.com/2016/02/03/s..."}, {"userName": "Julie Malo-Sauvé", "userReviewDate": "May 09, 2015", "userURL": "http://www.goodreads.com/user/show/5169690-julie-malo-sauv", "userReview": "En plus d'une intrigue bien ficelée et d'une écriture intelligente, le livre est un délice pour la géographe que je suis! Il déborde de références savoureuses à l'économie du XXIe siècle et à la géographie du transport. Les détails s'y entrecroisent, sèment le doute et la confusion, pour finalement s'éclaircir dans un sourire de lectrice satisfaite.Wow!"}, {"userName": "Geneviève Labrecque", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/47012561-genevi-ve-labrecque", "userReview": "Je salue la recherche exhaustive qu'il doit faire pour écrire ses livres. Il s'assure toujours d'utiliser le vocabulaire le plus précis pour chacune des expertises de ses personnages. Ça me fascine toujours."}, {"userName": "Florian Grandena", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/67786144-florian-grandena", "userReview": "Ennui sidéral et manque d’intérêt absolu : mes yeux ont glissé tristement sur ces mots sans pouvoir s’accrocher à la moindre situation, ou personnage, digne d’un intérêt même minimal."}, {"userName": "Carl-frédéric Celles", "userReviewDate": "Feb 28, 2016", "userURL": "http://www.goodreads.com/user/show/23632762-carl-fr-d-ric-celles", "userReview": "Classique Dickner, dans la science et les détails. Manque un peu de sentimental et d'émotif pour vraiment s'attacher aux personnages."}, {"userName": "Marie-Claude Bernier", "userReviewDate": "Apr 20, 2015", "userURL": "http://www.goodreads.com/user/show/13720248-marie-claude-bernier", "userReview": "Vraiment très bon livre, avec une histoire assez originale! Les jeux de mots sont délicieux et m'ont fait sourire à plusieurs reprises. Meilleure description d'un whippet que j'ai vu jusqu'à présent!"}, {"userName": "Martin", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/6695678-martin", "userReview": "Six Degrees of Freedom by Nicolas Dickner is a tight, well written novel with an enjoyable and rewarding payoff. The story follows two separate characters. The first is Jay, a female hacker who is working off her prison time as a civilian in the technology fraud section of the RCMP. The second is Lisa who spends her time building gizmos, such as a DIY weather balloon, with her tech-wunderkind friend named Éric. In classic Dickner fashion, both stories are linked and half the fun is figuring out how. This book is a translation of a 2015 novel written originally in French. Lazer Lederhendler does a wonderful job with this translation as the book is a pleasure to read just for Dickner’s turns of phrase. Dickner is a Canadian from Montreal, and Six Degrees of Freedom is a very Canadian novel with its references to Tim Horton’s coffee shops and it wintry setting. It also has Montreal flair in its subtle cosmopolitanism. For example, I remember distinctly a casual line describing a character who is living on welfare watching subtitled German films. And let’s not forget the many references to bagels! (Of which I must add Montreal bagels are the best variety). The only flaw I found in this novel was that some of the technology described seems limited by today’s standards. For example, some characters are hobbled by the lack of Wi-Fi, which seems absurd in 2017 when smartphones and data plans are ubiquitous. Another aspect that stuck out for me was the frequency that Lisa, who is a millennial, listens to the radio as opposed to finding her music online. These negatives are only tiny details and that I am discussing them at all points to how wonderful overall this book was.  I recommend this books to fans of Nicolas Dickner and to newcomers as well. Dickner is etching his place in the Canadian literary canon and Six Degrees of Freedom is a great contribution to that emerging legacy. Note: I received a review copy of this book from Penguin Random House Canada through Netgalley."}, {"userName": "Tina *KillMonotony* Wagner", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/6467673-tina-killmonotony-wagner", "userReview": "Ein mysteriöser Container, Ermittlungen der Bundespolizei und Langeweile in Kanada — eine kuriose Mischung, die aber funktioniert!Als „Die sechs Freiheitsgrade“, der neue Roman von Nicolas Dickner, bei mir einzog, wusste ich noch nicht, worauf ich mich eingelassen hatte. Der Klappentext roch jedenfalls nach Abenteuer! Lisa und Éric wohnen schon immer im Trailerpark „Domaine Bordedom“, wie ein Graffito verlauten lässt, und leben beide ihr eigenes, kleines Leben. Lisa versucht immer wieder den agoraphoben Éric aus dem Haus zu locken und überlegt sich ständig neue Dinge, die zu erledigen sind — in der Natur. Doch Éric hängt viel lieber vor seinem Computer und programmiert und hackt sich durch die Weltgeschichte (von seinem Schreibtisch aus). Doch als Érics Mutter sich neu verliebt und er mit ihr nach Kopenhagen zieht, bleibt Lisa zurück. Zunächst kann sie ihr Fernweh verbergen, denn gemeinsam mit ihrem Vater Robert bringt sie alte Häuser wieder auf Vordermann – ein Knochenjob. Als Lisa einige Zeit später nach Montreal zieht, um zu studieren, beginnt die Gesundheit ihres Vaters, nicht mehr mitzuspielen. Er wird immer vergesslicher, mauert regelmäßig sein Werkzeug versehentlich ein und scheint ohne fremde Hilfe nicht mehr klarzukommen. Lisa ist gezwungen, zu pendeln, während Éric sich in Kopenhagen ein kleines Firmenimperium aufgebaut hat. Und dann kommt Lisa eine Idee, die sie weit hinaus in die Welt und raus aus ihrem festgefahrenen Leben herauskatapultiert…Klingt bereits spannend? Gut! Denn das ist nur der eine Handlungstrang! 😀 Auf der anderen Seite verfolgen wir Jays Geschichte, die nach einigen Identitätsdiebstählen bei der Bundespolizei für Wirtschaftsbetrug arbeiten muss, bis ihre Strafe abgelaufen ist. Dort verfolgt sie unter anderem oder vielmehr besonders „Papa Zulu“, einem Container, der quer durch die Welt reist und sobald er irgendwo auftaucht, auch schon wieder verschwunden zu sein scheint. Jays Ermittlungen führen sie zur Domaine Bordeur…Die vollständige Rezension findet ihr auf meinem Blog: https://killmonotony.de"}, {"userName": "Rui", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/76691774-rui", "userReview": "this book is one of the best books i have read in a long time. i took it out from the library and read it in one sitting while waiting for my hair dye to set in, and found myself unable to put it down even for a second. i loved many parts of this book, but especially loved the characters, whom were all incredibly capable and intelligent and interesting. the way the female characters were written is so important- there was no mention of what they looked like beyond outfits. no descriptors of beauty or ugliness, of eye colour, makeup, hair, or body. rather, the story always focused on what the women were doing, and creating. (fiona apple, during a photo shoot, was heard telling herself in between shots that there is no hope for women. after reading this book, i feel hopeful.) i loved the way all the elements in the mystery clicked together as you kept reading. i loved how i expected this book to cumulate in a tired, straight romance (as these stories often do) and to my great surprise and excitement it didn’t. this book was strong, interesting, immersive and reminded me that i can do anything. i can’t wait to go on an adventure. i can’t wait to read it again, and read it to my partner."}, {"userName": "Susan Chow-Dukhan", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/56710716-susan-chow-dukhan", "userReview": "One of the quirks of being a prolific reader is that you sometimes find yourself liking a book, but you can't really pinpoint what it is, that you liked. Six Degrees of Freedom fell into that category for me. The two main characters are Lisa, a fifteen year old girl living in a small community and Jay, a thirty-nine year old woman (with a mysterious past), working on online fraud for the RCMP in Montreal. I found it difficult to put down the book. As the story develops, the author piques your interest, as you start to wonder how the story lines will intersect. By the time you reach the end of the book, you feel a sense of contentment, as all the loose ends have been tied up, but then you try to analyze what made the novel so enjoyable. Was it the author's use of prose (bearing in mind that the book has been translated into English), that allowed the reader to visualize the turn of events or the plot itself, that appeals to the readers that lead their ordinary live, with their daydreams of doing something different? Whatever it was, it worked."}, {"userName": "Heather", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/3139648-heather", "userReview": "I thoroughly enjoyed reading this book, especially having grown up in Montreal, I really appreciated all the references to landmarks.Eric and Lisa are best of friends, who grew up in a suburb of Montreal, and are inseparable, until Eric moves with his mother to Amsterdam. Jay, is a reformed ex-con, who is serving mandatory time as a civilian employee for the RCMP. The RCMP is investigating a transportation case, that seems to elude the authorities around the world. When Jay takes it upon herself to try and solve the case, her life intertwines with both Eric and Lisa. This story is an interesting display into how certain minds work, and how and both help and admiration can come from those you least expect."}, {"userName": "Anne Derkat", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/14595991-anne-derkat", "userReview": "I won this book from Goodreads and thoroughly enjoyed it.It's about 2 young people, Lisa a young girl who lives with her father who is sinking into Alzheimers and her friend Erik, an agoraphobic hacker who becomes wealthy before his 18th birthday. And Jay, a former computer pirate who is paying off her debt to society by working for the RCMP in Montreal.Their lives intersect over a missing shipping container which strains credulity but becomes a totally absorbing story and one which I would highly recommend."}, {"userName": "Daniel Kukwa", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/3885089-daniel-kukwa", "userReview": "A delightfully witty and readable book...but one that seems strangely over-complicated. The final result of all the machinations in this books seems to be such a simple thing...why go through everything the book explains just to end up where it does? I'm still trying to wrap my head around it, and all I can conclude is that it feels like a great deal of sound and fury that is entertaining...but slams to a halt with the achievement of its ultimate (and very basic) goal. A strange, unique, puzzling artifact of a novel."}, {"userName": "Tiffani Smith", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/63864557-tiffani-smith", "userReview": "I will admit, several times I wanted to put this book down because I just wasn't getting into it. I couldn't see how everything fit together, but I persevered and it was definitely worth it. The stories of Lisa, Eric and Jay are so beautifully interwoven that you can't help but appreciate all the work that the author went to, to craft this story together. I won't go into full details but this book went from being a ⭐️ to a ⭐️⭐️⭐️⭐️ book for me.I received this book through a Goodreads giveaway in exchange for an honest review."}, {"userName": "Lis", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/2843122-lis", "userReview": "Wow. A good, intricate plot, very interesting characters, and beautifully written.For some reason this was at the bottom of my reading pile — the back of the book blurb didn’t grab me. I finally read it because it was due back at the library — so I thought I’d give it a try, and then couldn’t put it down.And an excellent translation — it didn’t read like a translation at all. The author commends him, saying he “gets even my most obscure allusions.”"}, {"userName": "Evelyn", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/5383191-evelyn", "userReview": "I received this book free through Goodreads. It was a really good read. It took me a while to figure out how the two main characters would come together in the book, but I really like the way it was written. I didn't want to put the book down and it didn't take long to finish the book because I was really interested in the whole story."}, {"userName": "John", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/10951936-john", "userReview": "I enjoyed reading this book until the very end, when it abruptly ends without a real conclusion. Why did Lisa need to take a container that she had elaborately fitted out 3/4 of the way around the world, when she could have hopped a plane to Denmark? Why did Jay bother to make her complicated and illegal parallel search for Eric and Lisa? Otherwise, it is well-written and a good read."}, {"userName": "Sadie", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/10856739-sadie", "userReview": "I won this book from Goodreads. My copy is an ARC (of the English translation), though I think the book has since been released. I loved this book. The writing is amazing. I believed both characters' narrations and the story and plot twists kept me hooked in. This is clearly a very talented author. I loved the writing style."}], "description": "Three characters, infinite paths to freedom...Lisa is a young woman whose longing for adventure is tethered by the demands of an eccentric mother and a father slowly succumbing to Alzheimer's. Lisa's friend Éric is an agoraphobic hacker who becomes independently wealthy before his eighteenth birthday. And Jay is a former computer pirate who's paying her debt to society, day by stultifying day, working for the RCMP in Montreal. But when Jay learns of the existence of the mysterious shipping container Papa Zulu, she begins a clandestine investigation to discover who made it disappear and what they are trying to hide.", "title": "Six Degrees of Freedom", "url": "http://www.goodreads.com/book/show/33245472-six-degrees-of-freedom", "average": 3.81, "cover": "https://images.gr-assets.com/books/1495153223l/33245472.jpg", "reviews": 68, "authors": [{"url": "https://www.goodreads.com/author/show/861580.Nicolas_Dickner", "name": "Nicolas Dickner"}, {"url": "https://www.goodreads.com/author/show/666818.Lazer_Lederhendler", "name": "Lazer Lederhendler"}], "type": ["Fiction", "Roman", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/33245472-six-degrees-of-freedom", "http://www.goodreads.com/book/show/24952453-six-degr-s-de-libert", "http://www.goodreads.com/book/show/30924295-kamer-op-zee", "http://www.goodreads.com/book/show/36431101-die-sechs-freiheitsgrade", "http://www.goodreads.com/book/show/6239484-nikolski", "http://www.goodreads.com/book/show/8699067-apocalypse-for-beginners", "http://www.goodreads.com/book/show/13409940-le-romancier-portatif", "http://www.goodreads.com/book/show/23232622-r-volutions", "http://www.goodreads.com/book/show/2677837-l-encyclop-die-du-petit-cercle"]}