{"ratings": 17, "userreviews": [{"userName": "Colin", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/62286011-colin", "userReview": "Little did I know when I picked this up while browsing Barnes&Noble last December that this author is actually a professor at my alma mater who I constantly ran into at the library on campus. I never had any idea who he was at the time, turns out he's a prolific columnist, lawyer, and a journalist with published works sitting on shelves in major book store chains. Small world...Anyway, obviously \"The Media\" has been a particularly scrutinized topic over the past year or two thanks to the tempest of partisan vitriol and fraternal mistrust that looms over the American public with each passing presidential election cycle. But cries of \"The Liberal Mainstream Media™\" seem particularly resonant this time around, I'm sure generously enhanced by Donald Trump's overt hostility to the press and continuous reassurance to an already polarized support base on the campaign trail that \"The Media\", always made out to be this shadowy anti-Trump monolith, was out to sabotage him. Accusations of liberal media bias have been around since Vietnam so it's nothing terribly new, but given an age in which people can customize their own personalized media bubbles coincides with a widening partisan chasm in the American public, bias in media seems more pestilent now than ever - particularly with \"advocacy journalism\" gaining in popularity.Despite the promise of the title, I found the book to be more of an exposition of the media's relationship with bias rather than a guide to navigating it. Atkins finally gets around to detailing how to spot bias and adequately verify facts in a hefty final chapter, but he spends the majority of the book detailing how the media and its methods of reporting have evolved, and in what I found to be the most compelling part of the book, how \"advocacy journalism\" - factually-based and highly entertaining reporting with an overt political agenda - has boomed in popularity. Atkins contrasts advocacy journalism to the mainstream media, which places a premium on straightforward reporting and impartiality as opposed to pushing ideology at the risk of alienating viewers, compromising ratings, and losing advertising opportunities and sponsors. While the business pressures on the mainstream media serve as an effective bulwark against political bias in addition to the standards the networks themselves hold to their reporters, it still remains susceptible to other forms of bias. For example, they're obliged to report stories that draw the most viewers, the highest ratings and can compete with other news stations while other prominent but less-profitable local or world events may go underreported. This is why major news networks will often interrupt serious newscasts with \"breaking news\" about seemingly trivial events like Justin Bieber facing drunk driving charges, in efforts to stay toe-to-toe with the other networks. So is the mainstream media biased? Yes, but perhaps not in such away our Conservative friends might suggest. Atkins describes the \"mainstream media\" as established organizations reliant on traditional adherence to impartiality and factual accuracy, unlike advocacy journalism where exclusive sympathy to one side is explicit. Even in cases such as NPR where there is a more liberal appeal, there still remains a significant difference between having a slight leaning versus having an agenda. A perfect balance is a difficult position to maintain.To that end, Atkins notes that \"objectivity\" is not a requirement in the modern day media climate. The Society of Professional Journalists removed \"objectivity\" from their code of ethics back in 1996, instead calling for journalists to pursue the truth while maintaining accuracy and independence. Objectivity is a tricky concept, because every reporter and editor approaches a story with a subjective way of searching for and compiling facts, editing, phrasing, and so on. In this day and age objectivity in reporting is viewed more abstractly as a journalistic aspiration as opposed to being adhered to literally. That said, most reporters do strive for objectivity and do a good job of doing so. Media serves as a watchdog for government and politicians on both sides of the aisle, and thus serve a crucial public service.While the subject matter was interesting and most certainly relevant, I was frustrated by the palpable lack of direction in many of the chapters. While descriptive and sporadically insightful, many of them consisted of long chains of quotes from various media experts that eventually diluted the point rather than serving to reinforce it. Atkins did a good job of giving voice to various perspectives, but the conclusions drawn at the end of most of the chapters felt tepid or scattershot. It was almost as though he was hyperaware of the fact that in writing a book about media bias, he ought to tread exceptionally lightly to avoid giving any impression of his own (although I credit him in stating immediately up front that he is a liberal but strives to write from a centrist perspective as per his journalistic training). It was all around a very good book to read to understand the role of the mainstream media has versus the more ideologically-motivated outlets, but at the end of the day, if I were to review this book for someone exclusively interested in reading a guide to identify and assess bias in media as the title implies - I'd say just read the final chapter and you'd probably meet that end well enough."}, {"userName": "Rebecca", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/16583206-rebecca", "userReview": "I love the idea of this book and this subject, but I found it very repetitive. The exact same paragraphs turned up chapter after chapter and the same points were made over and over. This book could definitely be 100 pages or less if the author had made his points more concisely and shared his lists of news sources only once under the appropriate categories.That said, for people who maybe don’t understand that you need to view multiple outlets of news media to gather the facts of stories or are so enveloped in their own bubble that they don’t realize they are only viewing left/right wing sources, it’s good that this book exists.For me, I didn’t really learn anything new."}, {"userName": "Darren", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/9039058-darren", "userReview": "Media bias exists but often bias is in the eye of the beholder. How might a reader, listener or viewer identify possible bias and separate the wheat from the chaff. There is no easy solution but the author has a go.Increasingly conventional media is adopting an advocacy-led approach, yet it may not be explicitly making it clear in the process, whether accidentally or by design. There is very little truly neutral and perfectly balanced media out there. Add in the new-generation of alternative media, electronic publishing and social media which can be more partisan and you have a very big mix indeed. Getting the facts, if you can even find them, may not necessarily be enough as even “facts” can be coloured by presentation and spin. Do you really trust every announcement by your government, council or employer, for example? The material might not necessarily contain lies, yet one’s focus may be directed elsewhere with certain emphasis or guiding; then you add the interpretation placed on it by the media…Armed with this book, maybe you can be better-placed to be critical with your choice of reading, seeking to balance your media sources and not become polarised in the process. It was an interesting, informative and serious look at an important subject. The author has done a good job in avoiding a one-sided rant against one “side” of the media. If you are an avid news consumer, then you should be considering a book like this. Of course, even the regular news consumer would benefit too, if they just would learn about it and pick up this book. If nothing else, you can be better informed and perhaps help your friends and family along the way.Autamme.com"}, {"userName": "Tor", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/50331926-tor", "userReview": "Weak analysis, biased - terrible book!"}, {"userName": "Book", "userReviewDate": "Sep 16, 2016", "userURL": "http://www.goodreads.com/user/show/5686119-book", "userReview": "Skewed: A Critical Thinker’s Guide to Media Bias by Larry Atkins“Skewed” is an interesting book that examines media bias on both ends of the political spectrum. Journalist, lawyer and journalist professor Larry Atkins, provides readers with a useful account of the contemporary roles of journalists in our society and how best to become media literate. This enlightening 280-page book includes twenty chapters covering a wide-range of topics on media bias. Positives:1.\tAn engaging well-written book handled fairly and respectfully.2.\tThe fascinating topic of media bias. 3.\tLarry Atkins has great command of the topic and his lucid writing makes for a fun read. He gives this book an even-handed treatment. 4.\tClearly states the purpose of the book up front, “The point of this book is to examine media bias on both ends of the political spectrum, whether liberal or conservative.”5.\tDoes a wonderful job of defining key concepts in the book. “Advocacy journalists do not just set out to inform; they attempt to advance an agenda, whether it be conservative or liberal.” “Advocacy journalism can also lead to overemphasis and overexaggeration of certain stories.”6.\tImportant and timely concepts are discussed. “it's important to consider the source of the information before we make our judgments.”7.\tA brief history of advocacy journalism. 8.\tGoes over the different types of journalism. “In the late 1800s and early 1900s, something known as muckraking journalism became popular, as noted reporters began exposing important societal ills that needed to be remedied.”9.\tThe rise of talk radio. “The repeal of the Federal Communications Commission's Fairness Doctrine in 1987 cleared the way for the rise of talk radio.”10.\tThe rise of celebrity news and sponsored content. “One of the biggest concerns with sponsored content is that the content and articles are presented in a journalistic manner.”11.\tThe rise of Fox News. “Bartlett also argued that Fox and other conservative news outlets create a bubble that reinforces marginal or false views: “Conservatives engage in self-brainwashing, where certain ideas are repeated so often and with no contrary or alternative point of view that it fulfills the classic definition of brainwashing.””12.\t A look at MSNBC. “MSNBC's slogan of “Lean Forward” reflects its progressive viewpoint. It often focuses on people and stories that the mainstream news outlets tend to overlook.”13.\tFind out the number one principle of journalism.14.\tInteresting look at how young people get their news. 15.\tInteresting look at the media. “D'Alessio told Farhi that news reporting tends to point toward the middle, “because that's where the people are, and that's where the [advertising] money is….”16.\tA fascinating look at the media’s outlet’s decision to cover certain stories.17.\tPolitical polarization. “A 2015 Washington State University study published in the International Journal of Opinion Research found that the federal Telecommunications Act of 1996 and its deregulation of the television industry led to increased political polarization in the United States.”18.\tThe good and bad about advocacy journalism. “People who only watched Fox News performed worse than people who said they watched no media at all and those who said that they watched only the Daily Show.”19.\tThe future of advocacy journalism. “Stanford University's Center for Internet and Ethics states that journalists should abandon the concept of objectivity while at the same time not engaging in advocacy.”20.\tAn excellent chapter on being a savvy media consumer.Negatives:1.\tCould have complemented excellent narrative with tables, charts and related visual material.2.\tSome repetition.3.\tNo formal bibliography.In summary, this is a very good book on a very important topic. The topic of media bias seems to be thrown around lightly but finally there is a book that treats this topic with depth and enlightenment. It also provides some practical advise on how to be critical of how you consume media. Light on the visual material but this book is a must read for news junkies. I recommend it!Further recommendations: “Good Thinking” by Guy P. Harrison, “Bias” by Bernard Goldberg, “The Dynamics of Mass Communication” by Joseph Dominick and “The Media Handbook” by Helen Katz."}, {"userName": "Alain Burrese", "userReviewDate": "Jul 31, 2016", "userURL": "http://www.goodreads.com/user/show/3639199-alain-burrese", "userReview": "“Skewed: A Critical Thinker's Guide To Media Bias” by Larry Atkins shows the good, the bad, and the ugly in regards to advocacy journalism, but also makes a case as to why both advocacy journalism and balanced, impartial journalism are needed in the future.I feel Atkins does a good job of illustrating the differences between advocacy journalism and actual reporting, and how the media isn't as biased one way as many think or say. There are examples of the media being critical of both the left and the right.The book is very interesting to read if you are interested in news and the influences that sway things both ways, including the extremely biased advocacy journalists who entertain and preach to the choir more than report news or change others' opinions. The book looks the history of bias and perceived bias in journalism, as well as the rise of some of the big boys such as Fox News and MSNBC.Atkins also examines blogging, social media, business reporting, and other sources that affect bias and our opinions on politics and society. And after addressing all the good and bad of each, and where he feels you can find the least biased news and how to even out your consumption to form your own opinions, he concludes with a chapter on being a savvy media consumer and how we can help the younger generation learn to be savvy media consumers as well.This book not only explains media bias, it provides tools to critique the media and see both sides of issues. After reading this book, I feel you will look at the media a bit differently and be a better informed citizen and voter."}, {"userName": "Michael Smith", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/64042048-michael-smith", "userReview": "This is a good book to understand why there is so much bias in the news. The author, who is an experienced journalist himself, has a very good inside perspective and is honest about the biases within news organizations. He does an excellent job documenting examples with sources to make his major points. He presents both left and right examples to make clear that media bias is pervasive in much of our news today on all sides of the political spectrum."}, {"userName": "Amanda", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/12999087-amanda", "userReview": "Very thorough and thoughtful book covering some journalistic high points and helping to explain how media is become biased and what can be done as consumers of media (and as journalists) to combat it. It provides some interesting examples and insights of bias and a battle cry for teaching Media Literacy in schools. I did take off one star because it was a bit repetitive at times. Excellent and easy read though!"}], "description": "In a media landscape dominated by advocacy news networks pushing competing points of view, how can the average person uncover the truth about any particular issue? This book will show you how to separate the facts from the agenda-driven spin and selective presentation often used by such news sources as Fox and MSNBC.The author describes the goals of advocacy journalism—i.e., journalism that transparently advocates a biased worldview—and shows that it has been a part of our history since the 1700s. He assesses the role of talk radio, cable news networks, and the more recent phenomena of special-interest blogs, websites, and citizen journalists in creating the current media climate. While conceding that advocacy journalism is undoubtedly popular and has some positive aspects, the author also points out its many negative features. Perhaps the most important of these is its polarizing effect on society.Skewed will give readers the tools to critique the media, to see both sides of any issue, and to become better informed citizens and voters.", "title": "Skewed: A Critical Thinker's Guide to Media Bias", "url": "http://www.goodreads.com/book/show/27246059-skewed", "average": 3.88, "cover": "https://images.gr-assets.com/books/1469414649l/27246059.jpg", "reviews": 8, "authors": [{"url": "https://www.goodreads.com/author/show/3949566.Larry_Atkins", "name": "Larry Atkins"}], "type": ["Nonfiction", "Politics"], "outlinks": ["http://www.goodreads.com/book/show/27246059-skewed", "http://www.goodreads.com/book/show/28234217-skewed", "http://www.goodreads.com/book/show/27277111-astroturfing", "http://www.goodreads.com/book/show/8878197-larry-the-liberal-lawyer-lashes-out", "http://www.goodreads.com/book/show/6136310-grangaard-strategy"]}