{"ratings": 3292, "userreviews": [{"userName": "Katrina Passick Lumsden", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/1964146-katrina-passick-lumsden", "userReview": "Well, cut off my toes and call me a leper, this one was confusing. It started out terrible. I mean it, just awful. Like I said in one of my updates, Roslyn is too stupid to live. I get that she's chafing a bit at having been \"bought\" by Nick, but her repeated escape attempts, her thoughtless screeching, her nonsensical hatred...I mean, I could understand hating the guy if he chained you to a bed and proceeded to rape you. I can even understand hating him if he chained you to a bed and just acted like a callous dickhead. But from the very first, all Nick tries to do is take care of her. She keeps talking about her pride and self-respect, and it's like, honey, you're retarded. There are zombies, killers, and rapists everywhere, and you've managed to snag a kickass Army dude of your very own who not only hasn't raped you, but has also been funny, charming, and genuinely concerned for your welfare. \nThere are times when foolishly clinging to pride and self-respect will get you nothing more than a world of misery. So what if he chained you to a bed? In my house, that's called a party. Get over yourself. The most insanely idiotic aspect of the whole thing is that he wouldn't have chained her up if she hadn't thrown a bottle at his head and tried to run off. And why doesn't he want her to run off? Well, he wants the poon, obviously, but he also doesn't want her to get fucking eaten by zombies!I, for one, think that's a pretty good reason.Roslyn keeps talking about how she can take care of herself out there, but the first opportunity she gets, she runs off, and guess what? She nearly gets eaten by zombies.\nIt was kind of priceless. And she still insisted she could take care of herself. Too much, girl, dial it back. Annnywho, once her fuck-up gets their secured home-away-from-home burned to the ground (yeah, she's a keeper!), the two of them are forced to hit the road and more hilarity ensues. They have a showdown with some other Army dudes and then end up at Blackstone. Where, of course, more hilarity ensues. I really do enjoy the story aspect of these books. Zombie apocalypse tales are almost always fun. There's some OK sex (not nearly as interesting as the threesomes in the first book), and the action's kinda cool, but interacting with the two main characters is like watching drunken middle schoolers put on a dramatic play; entertaining in its own right, but slightly annoying and not anything you'd care to sit through again."}, {"userName": "Dinjolina", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/4438768-dinjolina", "userReview": "Raw, depressing, realistic, edgy, mortal......leaving me desperate for more.I am almost unable to find the words needed to describe my love for these series.I cried. I yelled at my Kindle. I gasped. I chuckled. I smiled.And I \nloved\n e-v-e-r-y agonizing moment of it.The author knows her mind, and she know how to write – which you gotta admit, is a pretty rare combination in itself. But when you dive in to it you see even more...you admire more...you are mesmerized by the fact that the apocalypse is her playground, and her character know no bonds of mayhem and real human feeling.The world she paints is never black and white. \nEverything has colorful shades that stun you, that embrace you, that seduce you.\nHer main protagonists have depth and a gazillion dimensions, her drama is out of this world, the action keeps you glued, and the love is utterly real. And if I was hard pressed to describe this book in one sentence that sentence would be:\n“Darn, you freaking son of a biscuit, I LOVE YOU!!!”\nI dare not say a world about the story itself, or the swirl of characters in it, for a simple reason – it would be a shame for anybody to miss a second of this experience.Every world, every scene - counts.I guarantee it will take your breath away.\nI vow you will love it as much as I did no matter what genre or plot is your favorite. You will get sucked in, and you will be happy about it.\nAs for me?\nI worship at the feet of this author. I would gladly rip my heart out and sacrifice it at the altar of her writing genius – today, tomorrow, always."}, {"userName": "Nymeria", "userReviewDate": "Feb 05, 2013", "userURL": "http://www.goodreads.com/user/show/16051625-nymeria", "userReview": "I'm bailing on another book. I'm getting the hang of this. Feels good. Much less frustration this way.I just couldn't keep reading about that freaking moron of a heroine. She lives in a dystopian world where zombies are hidding in every corner hoping to get a bite out of you and that idiot does everything she can to get herself (and the man who only wants to keep her safe) killed.Roslyn, you deserve this gif I save for the stupidest MCs I have had the misfortune to read about"}, {"userName": "Vikki ~ *squee* lite ~", "userReviewDate": "Jan 24, 2013", "userURL": "http://www.goodreads.com/user/show/3758447-vikki-squee-lite", "userReview": "I really liked this one, but I felt a little cheated in the end. We got hardly any time with Ros and Nick after they finally really got together. I'm excited for who I think the next book will be about. Enjoyed it, but didn't love it like the first one,"}, {"userName": "Mariya-Teodora", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/15768519-mariya-teodora", "userReview": "First of all, this story was better than the first. Secondly, Nick was funny, smart and hot, while Roslyn was the stupidest female I have ever read about!!! It's the end of the world and you find yourself with some guy who prepared everything so you could live comfortable. Yes, he chained her, but does he tries to rape her?! Nope, Nick is witty and gentle with Roslyn, who only keeps repeating one thing - I hate you. Brrrhh... that woman was too stupid to live. She can't stop complaining when the world is literally falling apart and she is with someone who can protect her and take care of her. But is she thankful or trying to think PRACTICAL? Lol, no, why would she, right?! No wonder in every book or movie the woman is the stupid one... Heroines like Roslyn represent us badly. Come on! Give us some dignity! :X And how this book is better than the first you would ask? Well, after Roslyn escapes in a t-shirt and without shoes and leaving the door of the cabin open, she realized she doesn't want to leave. It’s f**kin’ miracle, she gets it!(Horse, my man is feeling me XD - Reaper's Property by Joanna Wylde) Like she can care of herself in a world of zombies... Anyway, the story gets better from here. The pair tries to understand each other, come across some crazy old buddies of Nick and in the end, they go to the town everyone wants in. Well, the latter doesn't end well. Finally, I think the story was more interesting and entertaining than I expected. Would I reread it?! Hell, no, I'd have to feed her the zombies the first opportunity I get."}, {"userName": "Joanne careri", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/7158563-joanne-careri", "userReview": "Annoying heroine! So whiny I wanted to slap her. 3.5 starsSo there's a zombie apocalypse. Everyone you know is dead or has been infected. You are stuck in a school were you used to work as a librarian with other survivors. You're a motley crew of young and old, but mostly old men. One of these dirty old men is trying to get in your pants. Suddenly a hot guy ones along and offers your so called \" friends\" a van full of goodies so they'll hand you over to him. Without a second thought, they hand you over to him for trade.If it were me, I'll say \"eff them\" and try to make out the best out of the situation. it is the end of the world and there only a handful of survivors, much less HOT ex army guy who can look after you. You can do a lot worse than be stuck with him, right? So he wants sex. But then, being stuck in school with mostly old lecherous geezers for 6 long months, shouldn't any normal hot blooded female be hard up, too?What does Roslyn do the very first thing they get \"home\"? She attacks Nick with a broken wine bottle on the face. Then she screams so loud that all the zombies in a 10 kilometre radius can hear her. What choice did he have but gag and tie her up? the zombies will come and eat them if she keeps it up. Then she spends her days following her \"abduction\" plotting an escape. But where is supposed to go? The whole place outside their home is crawling with zombies. Even she manages to evade them, is she supposed to back to the school where her supposed \"friends\" are. The very same people who traded her for a van full of canned goods?I understand that the situation isn't ideal. But why can't she just think and make the best out of a bad situation? Nick wasn't abusive. he was actually quite nice and sweet. He was only trying to protect her from herself by tying her up. She would've tried my patience the very first day. Her \"whiny ness\" really got to my nerves. I would've told her to leave and see how she would fare with all those zombies out there. Roslyn should take leaf out of Olivia's ( from Captive in the Dark by CJ Roberts) book.Since this is a love story, Nick and Roslyn eventually got together. And the sex is HOT! But Roslyn was really really annoying at first."}, {"userName": "Ellen Gail", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/27123577-ellen-gail", "userReview": "Yeah, I'm bailing.Review to come."}, {"userName": "Carisa", "userReviewDate": "Apr 28, 2013", "userURL": "http://www.goodreads.com/user/show/5827877-carisa", "userReview": "Very, very original story, and I loooved the hero. I had my doubts about the zombies, but other than some gruesome descriptions and one TSTL moment from the prickly heroine, it didn’t interfere with my enjoyment of the love story. I didn’t read the first book, but this one felt like a stand-alone.HERO was a Warrior prior to the zombies virus which destroyed most of the world. He’s very strong, resourceful, and determined to convince a certain woman to start building a new life with him.SCENES/CONTENT: several/eroticGENRE/TONE: futuristic/actionLENGTH: 229 pages"}, {"userName": "Pam Nelson", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/15402332-pam-nelson", "userReview": "5 Skin Stars I loved this story, Flesh gave us a beginning and Skin gives us a different perspective. I really enjoyed Nick and Roslyn’s journey. It wasn’t easy but I was totally rooting for Nick the whole time. I knew he could get Roslyn to come around. There are a lot more action scenes and some pretty descriptive “gross” parts but you can totally get over that because the story was great. I loved how different this has been from anything else I have been reading lately. Again the narration was ok, I like Ray better in this book. And Elena is good but I kind of wished we had a different voice than the rest of Kylie's other books.*You don't have to like my review but its 100% my opinion, and I am allowed to have it.*"}, {"userName": "Book Chatter-Cath", "userReviewDate": "Dec 04, 2012", "userURL": "http://www.goodreads.com/user/show/5431814-book-chatter-cath", "userReview": "Full review to come but... OMG I LOVED IT, REALLY REALLY LOVED IT!!!'Skin' is erotic zombie awesomeness in the extreme <3 <3 Full review and giveaway here: http://mybookchatterchat.blogspot.co....I read FLESH, book one in this Australian Zombie series back in November and I couldn't wait to get my hands on book #2. Although I have to admit, I wasn't sure if Kylie Scott could pull off a follow up with all the intensity and heat that I loved in FLESH, but SKIN far surpassed all my expectations and then some, it was incredible.The very first page had me grinning from ear to ear - cheeky thoughts and witty conversation, yes, this was going to be a fun read; and the intensely charged situation in which Ros finds herself went from 0 - 100 in a second and pretty much stayed there for the entire book. The world as Ros knows it has gone to hell and nothing is sacred anymore, especially when starvation is just as likely to kill you as the zombies are!Roslyn is sarcastic, witty, maybe a little full of herself but amazingly real and lovable. And Nick gave off this all brawn no brain persona, along with an arrogant air of superiority that I knew had to be hiding a pussycat somewhere in there. Yeah sure, he's angry and a little self absorbed with getting laid but his intentions are good, in his own way!I also loved catching up with familiar faces, it was great to get a glimpse into how their lives have progressed in the months since meeting them in FLESH (and I love Sean, please be okay!)I was too caught up in this addictive story to stop and write notes but the few I did, read like this...*OMFG, funny as!!*CRAZYTOWN - get the hell outta there!!*SEXY AS ALL HELL - Oh Yeah Baby!!*Ros and Nick are AMAZING!!Not only has Kylie tackled some pretty sensitive subject matter, but she has done it with dignity, class and a shitload of realism. Her characters are witty, opinionated, fierce and sexy! And what starts off as a hate/lust relationship turns into something much more than just a romance.I loved SKIN - every glorious, bloody, crazy, sexy, scary, funny, sexy second of it!! (yes I purposely said sexy twice - lol!)Going on my keeper shelf asap, SKIN is the best read of the year so far and gets 5+ stars from me ~<;]"}, {"userName": "Joanna Wylde", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/2163205-joanna-wylde", "userReview": "Not a huge writer of reviews, but I've really loved this series and thought this was a good follow up to Flesh..."}, {"userName": "(Tori-Smexybooks) smexys_sidekick", "userReviewDate": "Jan 11, 2013", "userURL": "http://www.goodreads.com/user/show/3094317-tori-smexybooks-smexys-sidekick", "userReview": "Skin by Kylie Scott is an entertaining post apocalyptic zombie story that revolves more around the romance (?) of our protagionists-Nick and Ros. Nick, an ex soldier, uses his skills and what not to barter for a woman-Ros. He's lonely and horny so he comes up with this grand plan that he will get a woman who he will treat like a queen and she will be so grateful for his attention that she will want have sex with him on a daily basis. Uh huh.Nick learns quickly that the road to hell is paved with good intentions. Ros does NOT like him. She does not want to be nice to him. She does not want him to protect her, worship her, and DEFINITELY does not want to have sex with him. Ros tries from day one to escape, so Nick attaches a chain to her and keeps her captive, telling himself and her it's for her own protection. He thinks he can eventually wear her down.Uh huh.I seriously laughed my butt off during this book. The characterization and interactions of the H/h are hilarious. Nick, a bit of a caveman, isn't a bad man. He isn't abusive or mean-just really, really clueless. He can't fantom why Ros just won't get with the program. I admit to wanting ot smack him silly quite a few times. Ros, on the other hand, is a strong, snarky, independant woman who is seriously angry about the whole situation and tries everyday to explain to Nick that chaining a woman to a bed isn't conductive to winning her over.I loved that it took Ros a long time to come to like Nick much less become sexually attracted to him. And he had a lot of changing to do before that happened. Trust is a major issue that they both have to deal with. Of course, once Nick realizes that letting Ros go may get him what he wants, the tides turn and they begin to work together rather then against each other. My favorite scene: Ros wakes up chained to the bed after her and Nick argued and Nick is gone. She thinks he has left her for good and begins to imagine having to chew her foot off and drag herself to freedom. Of course, he comes back and Ros lets him have it.“You break your word to me all the time. You’re always pushing for more. Trying to manipulate me …”His mouth opened and widened in a pained expression. “But …”“No. You owe me,” she insisted, pressing the point. This couldn’t happen again. It wouldn’t.His dark brows drew close.“You do.”“I know,” he said. He licked his lips, looked away. But his eyes darted back to her, assessing. “I hate seeing you upset.”“You left me chained to a bed thinking I was going to die here if I didn’t cut off my foot. It happens, Nick.”The idiot lowered his face and set his forehead against hers. “So you’ve forgiven me for the kiss?”She pulled back. “You see why I hate you? This is why.”“I’m not convinced you do. Deep down.”“Oh, I’m pretty damn sure I do.”“No. I think you just think you do. “ He sighed and stared at her. “But deep down, I think you’re afraid.”“Yes. I am afraid. Afraid you’re going to die and leave me chained up to starve to death.”He rolled his eyes. “Ros, we’re talking about feelings.”“Fear is a feeling.”“Other feelings.”“Like my headache because I’ve been crying for hours because you left me chained up and I thought I was going to die horribly?”Nick’s brows danced high. “Alright. Alright. I give in.”While I enjoyed book one of this series, Flesh, I did feel Skin was more structured and developed plot wise. It integrates well with book one and we get to see some character bleed over."}, {"userName": "Jessica", "userReviewDate": "Feb 26, 2013", "userURL": "http://www.goodreads.com/user/show/2974294-jessica", "userReview": "3.5 starsI have to give the author credit for making me enjoy a story featuring a set-up that's usually on my no-fly list. I enjoyed Nick and Ros. They both did stupid things sometimes, but they learned from their mistakes. Actually, once they got over their stupid (mis)communication tricks, they taught each other how to learn from their mistakes. That is usually what makes a romance really work for me: when the characters help each other become stronger and better than they were before.The capture fantasy part did get resolved in a way that worked for me. It veered towards the shores of no-no-no a few times, but never crashed on them in a way that would have led to (me) wailing & gnashing of teeth. That tension and potential angst helped the character development along and furthered the overall plot... (in a fairly obvious way, sometimes).The thing that caused me to round down instead of rounding up was the ending. The fight scene at the compound was confusing. It also introduced half a dozen characters who hadn't been in the book up to that point. Yes, they'd all been in book 1, but even there they hadn't been mentioned by name. It was like a kitchen sink approach to adding last-minute angst and setting up characters for their own stories in future books. Not my most favorite thing in general, and especially not when it interferes with my ability to enjoy the ending of the story I'm reading. Seriously, I'd been planning to read book 3 even before the sequel-bait ending of book 2; it wasn't necessary."}, {"userName": "Kylie Griffin", "userReviewDate": "Nov 28, 2012", "userURL": "http://www.goodreads.com/user/show/5391485-kylie-griffin", "userReview": "Dark, intense and confronting, SKIN not only pushes the boundaries of her characters but readers as well. Scott took me on an emotional roller coaster ride that was sometimes confronting, most certainly thought-provoking, yet ultimately satisfying.The action is fast-paced and gruesome, the romance compelling and intense. Nick and Rosalyn struggle and deal with the very realistic issues of loneliness and intimacy, redemption and survival in a world where the rules of civilisation no longer exist.SKIN is a page-turner and you won't be able to put this book down."}, {"userName": "Angela Verdenius", "userReviewDate": "May 27, 2013", "userURL": "http://www.goodreads.com/user/show/11378467-angela-verdenius", "userReview": "Oh my. Oh my oh my oh my. Traded for a panel van full of food. Would I mind? Well, in the middle of a zombie plague, when my only choices are weak people with no clue, or being traded to a hot ex-military man who wants my body *insert delighted shiver here*, hell no I wouldn't mind! However, the heroine does, and what unfolds is a mix of humour, scares, hot sex and promises!"}, {"userName": "Jennifer", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/4295616-jennifer", "userReview": "Skin is about a different \"couple\" in the same world as Flesh. We do get a peek at the main characters and a couple of secondary characters from Flesh in the last few chapters of Skin. Flesh fell a little flat for me because of how the hero went about getting the heroine. He watched her from afar for a few weeks then set up a house for them and traded supplies to her group at the school she worked at before the zombie apocalypse hit. So of course she thought he was a bad guy and was going to rape her. He had no plans to hurt her but come on, it's creepy the way he went about \"saving\" her from the asshole group she was with.Their start kept me from really rooting for them to be a couple. I did root for them to survive but I wasn't invested in their romance. The love I had for Ray Chase's narration work on Flesh was not the same for Skin. Don't get me wrong, he still did a good job but because he only voiced one male POV I didn't get to hear his different ranges for male characters. I really enjoyed that while listening to Flesh. So much so I was hoping at some point there would be a second love interest so another menage would happen just to hear more male voices. LOL So it's not Ray's fault, it's Kylie Scott for not having another three some. (Just kidding)Over all the series was a dirty, dark and sexy escape. It hit the mood I was in for a departure from contemporary romances I've been listening to lately."}, {"userName": "Rebecca ♥ Warner, Kishan, Magnus ♥", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/703854-rebecca-warner-kishan-magnus", "userReview": "This review can also be found on my blog: A Match Made in HeavenI enjoyed this much more than I at first thought I would, and I would like to give it 4.5/5 because it has really stayed with me. I had no problem with the premise or Nick. I thought perhaps I would have trouble accepting a man who did something so horrible. I have never been into the bad boys, and have always had trouble accepting men with bad habits, which the last book I read proves, Bully. But I fell for Nick and his excuses faster than Roslyn. He had good intentions, and like he said, the world isnt fair anymore. Never really was. There is no law anymore and no society. Nothing but survival. And what he needed to help him survive was a purpose. A woman to protect, a reason to get up and keep going every day. So he kidnapped Ros and treated her like a queen, minus the chains. He had a cabin stocked and ready for her. Full of clothes her size, books to keep her busy, food, even wine. They were set up for the long haul. He cooked for her, forced her to work out and stay fit to stay alive. Taught her how to fight, run, climb trees, shoot, and anything else that would keep her alive against the zombies. He even massaged her after a long day. And he never raped her. He planned to woo her. He may not have kept his hands off her, but I cant blame him if he intended to win her over, and he knew he was an appealing guy. So he had to push his luck a bit if he ever intended to win her over. He gave her a few unwelcomed kisses, and sometimes forced her to cuddle with him at night. All A-ok in my books. The only thing he did which I had a problem with was when he was dry humping her against her will. But besides that, I would have agreed to the deal if I were her. Why would you wanna face the zombies alone when you could have a big military guy do it for you, and do everything else for you too, in exchange for some loving? And Nick wasnt even serious and creepy like rapists and stalkers. He was sweet and funny and a smart-ass. I would want to have at least some sort of connection, however small. But given that we had that, I would have been like, \"Where do I sign?\"\n\"How could you have bought that girl, chained her up and yet still have managed to persuade her to give you a chance? I mean, how the f*** did you pull that off?\"\nBy being that awesome.I also really enjoyed Ros. She was so full of spark and fight, and she was so mouthy. Nick really didnt know what he was getting himself into when he picked her. :P But he still picked the perfect woman for him. I wasnt sure about Nick and Ros' relationship at first. I felt like it wasnt really a romance, just survival. He loved having her around because it gave him purpose, nothing more. It didnt really have anything to do with who she was. Realistically, if he kidnapped the first half decent woman he came across, chances are it wouldnt be his soulmate. But it wouldnt be in a book if she wasnt. :P So, I waited a bit longer than I wanted to to see the natural sparks, and I was sad to see their cabin go, but once they were on the run and Ros was free of her chains, they were free to explore a relationship in a more natural atmosphere, minus the zombies. I love the fact that they were able to get passed their relationship's questionable beginnings, to accept the world they are in and the hand they have been dealt, and just hang on to each other.\n\"I drove a car into a house and killed a man for you. You chained me up for days and I still wanted to come back and talk over our darkly sordid, slightly kinky, and a lot warped relationship. Face it, you're stuck with me.\"\nWe also met the three protagonists from Flesh near the end of this one. I didnt realize who they were at first because I havent read Flesh. It took me awhile before I realized she was with two men. But as soon as I did I went and checked the blurb for book 1, and sure enough it was the same two men. And it still kinda creeps me out. Definitely not reading Flesh. I dont do menage. But I still loved this and will check out Kylie Scott's other books, as long as they dont contain menage. I will read Room With a View: Hot Down Under next, but I would enjoy another full-length book in this series. Maybe one day?"}, {"userName": "Alicia Batista (Addicted Readers)", "userReviewDate": "Jan 24, 2013", "userURL": "http://www.goodreads.com/user/show/14564026-alicia-batista-addicted-readers", "userReview": "FREAKING AMAZING!  \"WoW\" That's how this book left me feeling. When I got to the end of the book I want more, So much more! It was really so good! I enjoyed the world that Ms.Scott created. It was unique and original! I NEVER read any Post-Apocalypse Zombie books like this! It's truly one of a kind! Okay So, This book starts off with a group of survivors hiding out in a school after a zombie outbreak has taken over the world. These survivors have been held up in the school for a while now and the food and supplies are dwindling by the minute. No one has dared to venture out of the school, for fear of being eaten alive by the packs of Zombies that flock to the school like birds on a wire. But one day a man appears at the school gate an offers a trade. But what could they possibly have to trade this man that he could want so badly to trade a van full of supplies for?? Well they get the answer soon enough! He wants a Female but not just any female. He wants a woman! He claims the woman will be treated fairly and in exchange for the woman he will give them boxes of food and supplies that they so desperately need, and without it they will eventually die! So I guess this is the time when you find out who your true friends are, Huh! A woman named Roslynn is sold for the supplies. She was a librarian at that school and the only suitable woman that meets the buyers criteria (Yeah Sick I Know)! So that all happens in the first chapter. Definitely not a slow beginning. Which is great because I alway enjoy books that get right into the main story and this definitely one of them! So as any woman would take being sold Ros was not going down without a fight, and fight she did! She gets chained to the bed of his cabin after she attacked Nick, the man that traded for her. Well Nick claims it's for her own protection because if she's set loose she will take off out his door and straight into the zombies waiting arms. Remind you, Rose has never been outside since the outbreak, so she has no clue how bad it is and how to really survive out their because until now she's been in the safety of her school, locked up tight where no zombie can get in. Or so they thought... Well after Ros is chained like a dog to his bed that's where the book really starts getting interesting! And from there that's when Ros and Nick's adventure starts. Will Ros get away or will she be tortured and raped by the lunatic that chained her to a bed?? Will she learn to forgive the man that has taken her self respect away or will she hate him forever??? But most important will they survive the Zombie Apocalypse or be turned into one their selves??? Well if you want those answers your gonna have to read the book yourselves and find out! And believe me if you like zombie books with romance then this book WILL NOT DISSAPOINT! I really enjoyed this book very much. I like how this concept has never been used. It's fresh and new to the zombie books or a least the one I have read or heard of. This is NOT a Young Adult book, by NO means! It is VERY graphic and does have ALOT of Sex scenes so keep this away from your children because this DEFENTALLY not a book you want them to read! Ms.Scott is truly a REMARKABLE writer and I enjoyed EVERY MINUTE of this book and can't wait for book 3! Check it out you won't be sorry, I wasn't!"}, {"userName": "Arushi", "userReviewDate": "Dec 30, 2012", "userURL": "http://www.goodreads.com/user/show/3979963-arushi", "userReview": "Skin makes for a good sequel to Flesh. The setting is a zombie apocalypse in Australia and this book takes place approximately 6 months after the plague struck. While the first one had a comparatively straightforward plot with a lot of world building, here the world has already been established and so now more space is given to the plot. Hence, of course there is a good story-line and detailed character building. The characters are real in a way that makes them very easy to relate with, especially Ros. She is a librarian, an intelligent and smart woman, yet she is starting to fall for the man who technically bought her and then chained her to the bed. There is no sugarcoating that fact, but she cannot ignore the reality of the world around them and neither can she ignore everything else that he does for her. Her confusion, her anger, her frustration, all of it, is brought out really well. All her actions are never out of character, but rather make sense, in the way that real people tend to make sense, and her choice to be an adult in regards to her life and its decisions made me adore her completely. Nick for his part, gets less space as compared to Ros. But he is also a layered character. He knows what he is doing is wrong, yet he hopes things will work out. But at the same time he is almost always prepared when they do not. He tells himself he can do better, he should do better, knows when he has messed up, but at the same time, he cannot think of anything else. When he does, he tries. He tries to justify his actions by thinking that the rules of the world have changed, yet he cannot convince even himself, and that was why it was okay to see Ros forgive him. He is a control freak with some trust issues and that tends to cause some problems. He too evolves with the story though, working on his relationship with Ros, because as she puts it: “that’s what adults do.” They have more than a small share of problems, mostly due to how they start, and quite a few enemies. It makes for interesting reading and keeps one wondering just how the mess will get sorted. Th eneding was definitely not one that I was expecting. Some of the characters from Flesh show up here again and Skin’s ending, while good, leaves a wide opening for a third book in the series which is great because I would love to read more. The first two books have been set in the same world, and yet so completely different that I would really like to see what Kylie Scott comes up with next."}, {"userName": "TinaNicole ☠ Le Book Nikita ☠", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/6094990-tinanicole-le-book-nikita", "userReview": "Originally read February 1, 2013\nI absolutely loved the first book in this series, Flesh, so needless to say I was highly anticipating the sequel. Unfortunately I was slightly disappointed. My main complaints are about the h, Roslyn, and pretty much the first 50% of the book. She was awful. Whiny, immature and repeatedly putting herself and in turn the H, in danger. She was almost TSTL on multiple occasions. It was frustrating to say the least. Now the H, Nick, was certainly no peach and the circumstances of which they were together were less than ideal but come on, chickie! Most of her actions were along the lines of cutting your nose off to spite your face. At some points I almost hoped she'd get infected or just eaten. She was that bad.Nick was actually quite endearing. Ya know, once you get past the kidnapping her and keeping her chained and such, that is. He did his best to make her happy and take of her. And in his caveman way it was all well intentioned. Not to mention all the saving her from her own stupidity. The other problem for me was the lack of action in the first half. It got kind of boring and only made the h's idiocy all the more obvious and irritating. Now, the second half was great. Definitely had that \"Flesh\" feel to it. Roslyn's character changes drastically in the second half of the book, which is a good thing, but also a complete 180 that came across as unbelievable. I wish she'd been that character all the way through. There are some dramatic events towards the end that were exciting to read and it was awesome to get a chance to revisit the characters from Flesh. Finn, Ali and my favorite, Dan. All in all, it was just okay. If you enjoyed Flesh I'd definitely recommend this one and I will still be reading any more she writes in the future. There were some characters originally introduced in Flesh that may be in the next book. Definitely looking forward to them."}, {"userName": "Wicked Nyx", "userReviewDate": "Jan 11, 2013", "userURL": "http://www.goodreads.com/user/show/14259375-wicked-nyx", "userReview": "Boy sees girl, boy likes girl, boy trades van full of supplies to girl's friends for her. Girl clocks boy in head with a wine bottle. Boy chains girl up.So begins a very unusual courtship, and one heck of a great book.Nick has been just surviving since he was expelled from Blackstone in the first book of the series. Then one day while scouting a group of survivors he sees Roslyn, and she becomes his reason. His reason for living, for making a life, for everything.Roslyn has been holed up since the beginning, and when the people she is with vote to trade her to the man at the gate with the van full of supplies she is rudely introduced to the infected, as well as what people are capable of when peer group effect and rule of law break down.At it's heart this is the story of a man going to any lengths to win the woman he wants. And typical of a man, making major mistakes along the way. Roslyn has some growing up to do, but that is mostly atributable to the sheltered living she has been doing since everything went to hell. She has no idea what it will take to survive this terrible new world on her own, and her stubborness causes her to make some pretty major mistakes herself.Given events in the later part of the book, I would recommend reading Flesh, the first book in the series. We do have some contact with our main characters from the first book, Finn, Ali and Daniel. One of Roslyn's best quotes comes from their meeting:Her imagination had run overtime, he was right. Ali was a lucky, lucky girl having those two big hot men at her disposal. Not that Roslyn wasn't content with her one surly male, but still...two. Some people were enjoying their apocalypse a little too much.A great five star read!"}, {"userName": "Kelly", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/251943-kelly", "userReview": "Yesssssss! Love, Zombie Apocalypse Style continues! We met Nick at the end of book 1 and now we get to see his not-so-conventional approach to wooing the lady he want to spend the rest of the apocalypse with. AND IT IS AWESOME!Honestly, I feel like I shouldn't like Nick. Seeing as how his plan for finding and keeping a lady friend involves kidnapping and chaining her in his house. I mean, that's all sorts of wrong. But... against all odds, I LIKED HIM. He's a little cracked at times and he works ass-backward at trying to get Ros to like him but he drew me in and kept me entertained.Ros is... sheltered. She hasn't stepped a foot outside the school she's been hiding in since the plague went down and she has NO IDEA how bad things are. She's justifiably angry at being held prisoner by Nick and she's not afraid to let him know this. Seeing her go from insanely on edge to wanting him and being afraid for him was a hoot. Watching her convince him that she needs to be his partner if there's ever going to be a relationship between them was fantastic.Poor Nick. He had no idea what he was getting into when he got this spunky librarian.I loved revisiting Blackstone and seeing how things have changed since we left Ali, Daniel, and Finn at the end of book 1. Seeing all those characters again in general made me happy. They're fun and sassy and they know how to fight their way through a horde of ravenous dead.I am seriously all for more post-apocalyptic zombie stories that are heavy on love and sexy times. MOAR! Please.-Kelly @ Reading the Paranormal02/08/14 reread - Still loving this book. It's ridiculously fun and I want moooooore set in this world."}, {"userName": "Mei", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/6876967-mei", "userReview": "Just meh... When I started it I tought I would like the \"poor\" heroine; chained to the bed, forced to sex... Who wouldn't feel for her?Instead, she was a stupid, spoilt, irrational, egoistical idiot!!!OK, the hero strated with a wrong foot, but he tried to explain to her why and how of what he did. And what did she do? Attack him and smack his head with a bottle! That's when he chained her to the bed. And I didn't blame him!He tried to explain the situation once more while treating her well. He was semi-seriously teasing her with sexual innuendo, but he never tried to rape her or to force her. And when he let himself be convinced to trust her, what does she do? She runs away in the middle of the night (and without shoes!!! How stupid is that???!!!) and, obviously the zombies attack her and Nick barely manages to save her. But meanwhile the zombies torch their cabin and everything they had goes up in flames.I wanted so badly to slap the stupid idiot! It was all her fault! I would have left her go and be eaten by the zombies! It would have been better!But Nick obviously doesn't think with his upper head and he does everything to help her and to deliver her in a place where she will be safe even if that means they he's risking his life to do it! And I was asking myself why...So, no, I didn't enjoy this book at all!"}, {"userName": "Carmen Rae", "userReviewDate": "Sep 23, 2013", "userURL": "http://www.goodreads.com/user/show/14534785-carmen-rae", "userReview": "Even though Diana forced me to start this series I have to admit I love it. I really thought it would not be my cup of tea and then I read room with a view and I had to read more. The post apocalyptic elements that I thought would be too much for me made me think more about the characters and their reactions than most books normally do. And I have to say that the relationship in this book was so well written I wanted to to stay in the story for as long as possible. Hopefully Kylie is busy writing the next installment in this series as we speak and we don't have long to wait. Right Kylie? Please?Be sure to check out   for giveaways and book grabs as well as the blog for"}, {"userName": "Jacqueline", "userReviewDate": "Jan 07, 2014", "userURL": "http://www.goodreads.com/user/show/2999717-jacqueline", "userReview": "Enjoyed this second installment of zombies down under. Nick was fun to read about. He hadn't been a sterling example of character so far in his life but he was trying to turn himself around. That is after he buys himself a woman. ;-) Still you did see that he was at the very least infatuated with her which led him to try to buy her in the first place. This one was a little creepier on the zombie front and I was actually anxious a couple of times.Things are not going well for survivors of the zombie plague. Tensions are rising and people are getting selfish and violent. The plot all made sense even if the heroine was a little TSTL. I liked where the book ended up. Lots of room for our little group of survivors to grow and establish some sort of comfortable life. I would like to see more about the actual day to day of what that involves. Show me Dan working on some mechanical solutions, Finn solving or preventing some crime, Nick using his soldierly skills to the benefit of the group, etc.Can't wait for the next book. I think we might have gotten a hint of who it will be about at the very end of this one."}, {"userName": "Heller", "userReviewDate": "Dec 10, 2012", "userURL": "http://www.goodreads.com/user/show/4975636-heller", "userReview": "I think I watch too many zombie movies and read too many zombie books. I have very little patience for characters that take their safety for granted by acting foolishly in perilous times. The first half of this book had me not enjoying Roslyn, the kidnapped librarian. Dear Ros, If you want to escape then do it smartly. Why run out of a well fortified cabin with no shoes, no plan, no clue? You're pretty damn lucky you made it out that fiasco without getting your brains liberated from your melon. Love, HellerThat being said, this book has some clever, amusing lines. Scott writes a well balanced banter between characters and the sex scenes are hot. I enjoyed Ros much better in the second half when she began to take agency for herself and do it with panache. It was just frustrating that it took over half the book to get her to that point. I liked the call back to the other characters from the first book and I really liked how the book ended and what happened to them all. I'm curious to see where things go next and I hope that Sean is still alive."}, {"userName": "Cindy", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/4165396-cindy", "userReview": "4 1/2 stars.Another very solid & wildly enjoyable book by Kylie Scott. I love this series, but I didn't fall in love with the characters in this one quite as fully as I did in \"Flesh\". Still, it's a wonderful story that has opened me up to an entirely new genre and is so sexy and exciting it still almost earns perfect marks.So glad I found this series and recommend everyone give them a try. Very well written, different, and just all around good storytelling."}, {"userName": "Denise ~The Procrastinating Book Diva~", "userReviewDate": "Jul 20, 2013", "userURL": "http://www.goodreads.com/user/show/4133839-denise-the-procrastinating-book-diva", "userReview": "Sexy, funny, and action packed - even with disease infected zombies at every turn - the apocalypse has never been so inviting :D Add in a fiesty librarian heroine and a dirty talking ex-soldier bad boy hero and you've got a book hot enough to singe your fingers off!!! Kylie Scott has a twisted mind and I love it and this series."}, {"userName": "Hollis ", "userReviewDate": "Jul 30, 2016", "userURL": "http://www.goodreads.com/user/show/16668577-hollis", "userReview": "While in general SKIN wasn't bad, and thankfully was very different from the first book in this \"series\", Roslyn made it absolutely painful. One of the worst heroines ever. She gets better near the end but 60% or more of awfulness kind of overwhelms any character improvement. This could've been a tolerable two but.. Roslyn."}, {"userName": "ZARIA (Sheldon Cooper lover)", "userReviewDate": "Apr 12, 2013", "userURL": "http://www.goodreads.com/user/show/7723854-zaria-sheldon-cooper-lover", "userReview": "Roslyn is f***ing stupid and annoying, she is a wretchedly stupid heroine whose standard mode of behavior is to rush headlong into a situation that she cannot handle. I was hoping Nick would leave her sorry ass.Because of lack of chemistry and romance, this book is a NO for me."}], "description": "Six months since the zombie plague struck, former librarian Roslyn Stewart has been holed up in a school with eight other survivors. But now the shelves in the school canteen are bare. The stranger at the gate has supplies that will ensure the group’s ongoing survival, but at a cost. He wants a woman.Nick is a man with a plan. He’ll treat Roslyn like a Queen, devoting the rest of his life to protecting and providing for her. In exchange, of course, for sexual favours. It’s the deal of the century given the state of the world. But Roslyn doesn’t see it that way. The first chance she gets she attacks the ex-army man and attempts to escape, forcing Nick to contain her. And so begins his awkward courtship of the woman, with her chained to the bed for security reasons.Chained like a dog and forced to spend her every waking moment with a creep, albeit a good looking one, Ros is determined to escape. When circumstances force them to band together against a common enemy their very survival depends on their ability to learn to trust each other. An uneasy partnership develops, but can a relationship with such a difficult beginning ever have a future?The hotly anticipated sequel to Flesh, Skin is set in the same universe with a different set of characters.NOTE: This story is rated \"Hot\" (4 out of 5 flames) and contains F/M pairings.", "title": "Skin\n      \n          (Flesh #2)", "url": "http://www.goodreads.com/book/show/16165741-skin", "average": 3.86, "cover": "https://images.gr-assets.com/books/1355182668l/16165741.jpg", "reviews": 293, "authors": [{"url": "https://www.goodreads.com/author/show/6476625.Kylie_Scott", "name": "Kylie Scott"}], "type": ["Horror", "Romance", "Adult Fiction", "Fantasy", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/16165741-skin", "http://www.goodreads.com/book/show/17337334-skin", "http://www.goodreads.com/book/show/39911383-skin", "http://www.goodreads.com/book/show/33368443-skin", "http://www.goodreads.com/book/show/17983690-lick", "http://www.goodreads.com/book/show/19286623-lead", "http://www.goodreads.com/book/show/18461986-deep", "http://www.goodreads.com/book/show/19095025-play", "http://www.goodreads.com/book/show/25671827-dirty", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/40494988-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}