{"ratings": 31165, "userreviews": [{"userName": "Darwin8u", "userReviewDate": "Mar 07, 2011", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "“And how did wethen face the odds, of man's rude slapstick, yes, and God's?Quite at home and unafraid, Thank-you, in a gameour dreams remade.” ― Kurt Vonnegut, Slapstick, or Lonesome No More! My 15-ear-old son broke the screen on his iPhone 6s. I'm letting him buy down the debt (to me) by reading 6 Vonnegut novels before the end of the year. Every book he reads, drops his big OWE down by $10, upto $60. He is still on the hook for the other $80. This is what happens when daddy is an absurdist, but rules like a fascist King. Hi ho.So, I've decided to read a lot of the Vonnegut novels he's going to be reading before the end of the year too. It has been 30 years since I went on a huge Vonnegut tear. It seems in an era of Donald Trump I'm going to need as many absurdist tools on my belt as possible. What better way than a book about loneliness, incest (perhaps not, or technically yes, but also not), disease, the destruction of America, and the Church of Jesus Christ the Kidnapped. There are other, stronger Vonneguts where I could have started, but I'm also trying to go through my Library of America Vonnegut: Novels 1976-1985. Plus, it is hard to avoid a book that uses the phrase “Why don't you take a flying fuck at a rolling doughnut? Why don't you take a flying fuck at the mooooooooooooon?” often and with literary abandon.As far as the stars, the book itself probably only warrants a Vonnegut 3-star (except for the fact that the autobiographical introduction is so good, I'm tossing in another star because, well, I can)."}, {"userName": "Lyn", "userReviewDate": "Jul 20, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "Vonnegut's most farcical, most absurd, but also one of the more scathing satires. Here Vonnegut takes on universalism, and totalitarianism, but on a grander scale than he allowed in Harrison Bergeron; but also this is more surreal. His genius, though, as seen in other novels, is to creatively intersperse pockets of stark realism to accentuate and to highlight the circus like theme. Vonnegut also uses elements of grotesque to further illustrate his none too subtle rebuke of egalitarianism. This is thought provoking, though, in terms of his over the top humanism and decidedly liberal politics. A good read, and a must read for a Vonnegut fan. A new reader to his canon would be better advised to start with Slaughterhouse-Five or Cat's Cradle."}, {"userName": "Paul", "userReviewDate": "Aug 24, 2007", "userURL": "http://www.goodreads.com/user/show/71356-paul", "userReview": "At this point I've gotten fairly familiar with Kurt Vonnegut's tone and flavor. The sense of universalism and equality consistently sound as often as his humor and irony rings.This books reads as a perversion of all four themes. To me.Usually Vonnegut's works seem to read with some underlying sense that no matter how bizarre everything seems, no matter how depressing or how inspiring a situation seems, there's always a punchline, and that punchline brings you back to reality, forcing the reader to realize that we're all human. We're all prone to make mistakes just as often as we succeeed. We're all prone to die just as sure as we're prone to live. We're all prone for 15 minutes of fame surrounded by an average of 76.4 years of mundaneness. But that doesn't ring the same for Slapstick. The introduction gives you an immediate idea of why Vonnegut steps out of his comfort zone on this one.If the introduction reads true, and there's no guarantee that reality and honesty aren't being blurred in any of Vonnegut's novels, then he wrote this following the death of his sister. His sister, coincidentally, died days after her husband was killed in a freak accident. As if this pit of depression didn't dip far enough down, the couple left a cadre of children that Vonnegut would go on to adopt.So this is understandingly, sympathetically a departure from the Vonnegut norm. The main character is a freak that finds himself surrounded by similarly freakish people. Smartly, the freaks in this novel are those people that perhaps seem the most normal and successful. The main character is a grotesque monster who is a successful pediatrician (though he graduated at the bottom of his Ivy League class), a former Senator, and currently the reluctant President of the United States. He had written the best selling novel about child care with his best friend and twin sister. He has revolutionized mankind's interpretation of family. He is one of the few, healthy survivors left on the Island of Death (Manhattan). He has just sold the Louisiana Purchase to the King of Michigan for a dollar. And he regularly gets an erection.Ok. Fair enough. The novel does take place in a post-apocalyptic future where most humans have been killed by a mysterious plague, Manhattan is a haven of corpses, slaves, and candlesticks, and gravity fluctuates with the weather. The usual science-fiction elements are still in place. However, I do not put this side by side with the normal Vonnegut works, and I cannot. There is not a happy ending. However, in hindsight, I don't believe I've read a happy ending in any of his works. I suppose it's safer to say that there's more of an impending doom with little to no hope of salvation in Slapstick. But, to be fair to the reader, Vonnegut delicately expressed this very early in the book when he compared salvation to a Turkey farm one can communicate with via a lunch box.Read it if you're curious. Read it if you're a Vonnegut fan. Go take a flying fuck at a rolling doughnut if you're neither. Or take a flying fuck at the moooooooooon!I love and miss you, Kurt Vonnegut."}, {"userName": "Imogen", "userReviewDate": "May 11, 2008", "userURL": "http://www.goodreads.com/user/show/33887-imogen", "userReview": "And with that, I learned once again that I was an asshole. I read 'Cat's Cradle' when I was in high school and taking a lot of ecstasy, so I hated everything except the Chemical Brothers. Since I hated Cat's Cradle then, I've assumed that I didn't like Mr Vonnegut for the last, what, dozen years? I only picked this one up 'cause I never see old editions of it and Josh said it's his favorite. That all sucks. I mean, I don't think he's perfect- I'd remembered his kind of smug, eccentric uncle persona being at the fore kind of like Tom Robbins tends to do. (Which, by the way, is a big part of why I find Tom Robbins so unreadable- I get it, you're smart, you're charming, you're just like every other straight boy who thinks he's hot shit. Next.) But it wasn't so out front! In fact, this was just a bizarre story about genius twins that Aimee Bender would've told differently, but which she could have told. I also feel like- I don't want to give away anything, but there are some bizarre structural things that happen. Mostly it's nice. Sometimes the way he'll gloss over a few decades is jarring for me. The bit where the main story ends and the postscript starts is such a funny, fuck-you plot decision. Love it. So... yeah. So now I'm gonna read more of this guy. Kerry, you were right about this guy the whole time."}, {"userName": "Barry Pierce", "userReviewDate": "Dec 06, 2013", "userURL": "http://www.goodreads.com/user/show/4593541-barry-pierce", "userReview": "Hmmm deformed, incestuous fraternal twins become geniuses when they touch their heads together. One is the last President of the United States of America. Ridiculous, yes? No. This is Vonnegut! I liked this one. I like all Vonnegut actually. I'm very biased, don't listen to me. Hi ho."}, {"userName": "Susan Budd", "userReviewDate": "Jun 26, 2015", "userURL": "http://www.goodreads.com/user/show/44131812-susan-budd", "userReview": "Any other Sunflower-13's out there?"}, {"userName": "Dan", "userReviewDate": "May 14, 2007", "userURL": "http://www.goodreads.com/user/show/37152-dan", "userReview": "Note that I am giving this book a low rating as compared to Vonnegut's other books, and is not necessarily reflective of my opinion of it as a fine work of fiction.Really, when compared to the similarly-themed \nCat's Cradle\n and \nThe Sirens of Titan\n, this one just doesn't hold up as well. It boasts a classic Vonnegatian comedic end-of-the-world scenario, but Slapstick just doesn't quite live up to the standard set by his previous novels, and achieved again by later ones. I guess I can't really offer a better explanation.I read somewhere that Vonnegut considered this one the weakest of his catalog. I'm inclined to agree with the old man."}, {"userName": "Danger", "userReviewDate": "Mar 28, 2011", "userURL": "http://www.goodreads.com/user/show/5184971-danger", "userReview": "2ND READ-THROUGH: I enjoyed this immensely, probably even more than the first time I read it (probably back in 2002). It’s a little more plot-driven than most of Vonnegut’s works, but it still explores the same basic concepts you’ll find in most of his oeuvre - in fact - diving deeper and more direct into one concept in particular that doesn’t *quite* find its way all of his novels: love. Specifically, familial love, and the meaning and purpose of family. Utilizing copious dystopian imagery and weaving chaotically (but still coherently) between two narratives, there is not a dull moment in this book, even if most of it boils down to a mediation of human connection. This might be one of my favorite Vonnegut books now."}, {"userName": "Chris Dietzel", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/19351209-chris-dietzel", "userReview": "Another example of what makes Vonnegut so great. \"Slapstick\" combines sarcasm, humor, an absurd plot, and a critique of society and every part of it works. This is no where near his best book and yet it's still leaps and bounds over most other books."}, {"userName": "Joni", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/34586167-joni", "userReview": "Un libro flojo a lo que es la obra de Vonnegut. Sus ideas humanitarias siempre claras, pero es el humor el que falla, encima abordado con insistencia fútil resultando en un libro aburrido y pesado. Se pasa de absurdo."}, {"userName": "Samson Martirosyan", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/28032997-samson-martirosyan", "userReview": "Ըստ Կուռտի, այս գիրքը մասամբ ինքնակենսագրական է, իր ու քույրիկի հարաբերությունների մասին։ Այդքան էլ չհավանեցի, մանավանդ վերջը լրիվ աջաբ սանդալ էր սարքել։ Բայց մի քանի պահ կար որ շատ եմ հավանել, ավելի կոնկրետ մենակության դեմ պայքարի միջոցը որ հաջողությամբ գրքի հերոսին բերեց նախագահի պաշտոնը։ Այստեղ մի կարևոր պահ կա, որ ասում է ազգերը պատերազմը չեն ընկալում որպես անձնական մի բան, իսկ այ ընտանիքները՝ հակառակը, պատերազմը շատ անձնական ու ընտանիքին ուղղակիորեն վերաբերվող բան է, հետևաբար ընտանիքները չեն ուզում պատերազմել։ Հստակ չեմ փոխանցում ասածը բայց ես որ կարդամ էս ռեվյուն կհիշեմ ինչ էր ասելիքը։ Երկրորդ բանը որ շատ եմ հավանել դա էն էր, որ նախաբանում հեղինակը իր կյանքի մասին բավականին բաց ու անկեղծ է գրում, նոր բաներ իմացա Կուռտի մասին, որպես հեղինակ ինքն իր գինը իմ աչքերում էլ ավելի բարձրացրեց։ Վոննեգուտին բնորոշ սարկաստիկ հումորն ու հեգնանքը, որ էդքան շատ եմ սիրում, էս գրքում գրեթե բացակայում էր։ Չնայած սրան, բավականին արագ եմ կարդացել։ Գիրքը գնել եմ ինքս ինձ նվեր Երիտասարդականի բուկինիստի անգլերեն լեզվով գրականության բաժնից։ 2018ի առաջին գիրքն է։"}, {"userName": "Katya Bogdanov", "userReviewDate": "Dec 27, 2013", "userURL": "http://www.goodreads.com/user/show/5970167-katya-bogdanov", "userReview": "This was the very first Vonnegut book I’ve read, and while Slaughterhouse 5 is probably the most popular starter (as far as I’ve heard) I picked this volume at complete random because Barnes & Noble didn’t have Sirens of Titan which is what I originally wanted. In any event, I think this was quite a stroke of luck: Slapstick, or Lonesome No More! is a semi-autobiographical work, and for someone like me, who prefers to begin everything with first principles, I think this makes for an especially great start. It gives you a sense of the author’s primary perspective before you venture off to study its other manifestations. I preface my further thoughts with an expression of reservation - I am reluctant to judge a man by his book. Nonetheless, to whatever extent this is true of Vonnegut is a person, I felt that his worldview was most informed by loneliness… loneliness of a very special kind, a sort of intellectual isolation which, it seems, could only be broken by his sister. With his sister dead of cancer in her forties, the novel (and the autobiographical introduction) convey the sense that her death left Vonnegut very much alone. This loneliness permeates every page and it translated instantly to me as the reader. I’m not quite sure how. It is somehow ingrained in the desperation of the prose, and the foolish hope and desire to well, not be lonely anymore. I was surrounded by family as I finished the novel in one sitting, but the isolation Slapstick left me with was overwhelming. Some believed this to be an overstatement, but I think the only other author who left me with such a heavy emotional burden was Dostoyevsky. I couldn’t shake it for a couple of days. It seems to me that Vonnegut is a master of meanings, conveyed with every word and phrase and period - not just broad structural and literary brushstrokes. I am astounded by Vonnegut’s ability to take individually absurd events and ideas and combine them into something so powerful and tremendous. I don’t know whether to let his wit make me laugh or cry. I don’t know if I’m ready for the full extent of his ability to manipulate me.In other words, I’m in love. Hi ho."}, {"userName": "Steven", "userReviewDate": "Jan 01, 2017", "userURL": "http://www.goodreads.com/user/show/4452312-steven", "userReview": "\"I wish that people who are conventionally supposed to love each other would say to each other, when they fight, “Please—a little less love, and a little more common decency.\" (3)Vonnegut famously, while self-assessing his work, gave Slapstick a D. Writers are notoriously poor at evaluating their own work, however, and Vonnegut's assessment of Slapstick is no exception. The Prologue is one of his most personal pieces of writing, as is the work itself – revolving, as it does, around the death of Kurt's sister and the close bond they always shared. Sure, the novel is not as well-thought-out as some of his others, but it is funny and sad and clever in good portions – and hey, after all, it is supposed to be Slapstick."}, {"userName": "Kyle", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/9549139-kyle", "userReview": "Actual rating: 4.5*This shall be one of my shortest reviews, because all that needs to be said of this book, can be derived from the next six words*AbsurdProfoundEndlessly comicalHi Ho"}, {"userName": "Joel Lacivita", "userReviewDate": "May 15, 2016", "userURL": "http://www.goodreads.com/user/show/5459337-joel-lacivita", "userReview": "This is definitely a farcical style Vonnegut novel that takes the reader into a satirical and dark world that Vonnegut fans love. The time is far into the future when the government of the United States barely exists and the protagonist of the novel, the president of the United States, explains how things got this way. The book was written 40 years ago, and its is amazing how Kurt made predictions that have come into being. There are also many comical observations about politics that still hold true today. I liked his idea that everyone will have to change their middle name so they are related to someone else. He points out that political leaders in the USA are actually families of leaders that have been around for decades, much like our current leaders. If everyone had their names changed so that they are now \"relatives\" of powerful people, they would actually have a chance to become powerful too. Like all Vonnegut novels I've read, I enjoyed every minute of it. \"History is merely a list of surprises. It can only prepare us to be surprised again.\" KV"}, {"userName": "J.P.", "userReviewDate": "Oct 24, 2007", "userURL": "http://www.goodreads.com/user/show/424062-j-p", "userReview": "This one was one of Vonnegut's best. He was creating worlds here, folks. Most specifically, a world---ours.The narrator happens to be the President of the United States---the LAST one, as a matter of fact.Wilbur Daffodil-11 Swain and his sister, Eliza, have got to be two of the most sympathetic characters KV ever created. Their voices just envelope you and draw you in. Some of Vonnegut's most ingenious devices & characters are in here---Green Death, the Hooligan (a thingie to communicate with those in the Afterlife), the Turkey Farm, tri-something-Deportamil, the super-feelgood drug Swain gets hooked on, the Raspberry family, Vera's teenaged Tourette's-afflicted son, the King of Michigan.Yes, KV was firing on all cylinders here. Strange, then, that I found the ending to be something of a letdown. Then again, how could it be anything but? If you have to read just one Vonnegut book, I'd say go for SLAPSTICK. SLAUGHTERHOUSE FIVE has the reputation, but in my humble opinion, SLAPSTICK is the better book.\"LONESOME NO MORE!\""}, {"userName": "Ethan", "userReviewDate": "Jun 25, 2009", "userURL": "http://www.goodreads.com/user/show/1436646-ethan", "userReview": "The problem I have with most Vonnegut books is that they feel like they've been churned out of a random plot generator machine. I imagine Vonnegut throwing a bunch of scraps in a hat and then challenging himself to string the items together into some sort of book which will then fly off the shelves because he's VONNEGUT, for chrissakes. Sometimes the ideas hang together in interesting and fun ways. Other times they just flop around uselessly, sort of cute but really kind of gross, like a beagle without any legs. The former would be Cat's Cradle. The latter would be Slapstick.The repetition of hi-ho, which I suppose Vonnegut's idea of being cutesy, drove me crazy by the end of the book. I've seen this sort of writerly tic in some of his other books, and I've never understood why he did it. I get the feeling that he was just looking for filler in a book that was already chock full of nothing anyway.It was a quick read and vaguely entertaining, but definitely not a book I'd recommend to a friend."}, {"userName": "Νατάσσα", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/8119280", "userReview": "4,5/5*. Αστείο, σαρκαστικό, γλυκόπικρο, φανταστικό. Αυτά :-)"}, {"userName": "Wanda", "userReviewDate": "Sep 05, 2013", "userURL": "http://www.goodreads.com/user/show/9246169-wanda", "userReview": "I was prompted to re-read this Vonnegut novel by a non-fiction work that I read recently. The Juggler’s Children was about the use of genetic research in relation to genealogical research and about the search of the modern North American to make some connections with people around them. People are lonely and looking for distant relatives assuages the loneliness somewhat.I was put in mind of this novel and its alternate title, Lonesome No More! I’m not sure why that slogan and the new middle-name scheme espoused by the main character stuck in my mind when all the other details had faded to a hazy blur, but they did. [Each American was assigned a new middle name, a natural object noun and a number—those with the same word are cousins, those with matching word and number are siblings. Voila, instant family!] Like Vonnegut himself, I am lucky to have a large extended family, most of whom seem to enjoy spending time with me as much as I love visiting with them. Also, as a certified introvert, I am perfectly comfortable spending long stretches of time alone--alone but only very rarely lonesome. I do realize, however, that not everyone is so fortunate.KV calls this book semi-autobiographical. It seems to me to be a paen to his relationship with his deceased sister Alice, who he declares he has always secretly written for. I guess we all have an audience in mind when we write and he lost his dearest audience. In Slapstick, Wilbur and Eliza, the freakish twins, who do their best thinking together, are the fictional counterparts of Kurt and Alice. Wilbur is the writer and reader of the two, Eliza is the one who can figure out what is actually going on. Separately, they are much less intelligent, calling their alter-egos Bobby and Betty Brown. If I remember correctly, KV claimed in another work that Alice was actually a much better writer than he was, but did not feel compelled to do something with that talent, as he did.I know what it is like to lose family and how that can affect one’s life. After the death of my mother, I quit reading fiction for many years. Fiction was something that I had shared with her and without being able to talk to her about such books, I just didn’t have the heart to continue reading them. Non-fiction became my go-to reading. So I believe I have some idea how crippling it must have felt to Vonnegut to lose his sister and how he could end up feeling like a much duller Bobby Brown without her. When I read this book in my twenties, prior to losing my parents, I had no proper appreciation of all of this—re-reading the book now, I have much more sympathy. Slapstick contains many of the same themes that make Vonnegut’s writing dear to me: his insistence that common human decency is worth its weight in gold, that kindness is always a good alternative, and that life is has its ridiculous moments even when it hurts."}, {"userName": "Alex", "userReviewDate": "Sep 09, 2011", "userURL": "http://www.goodreads.com/user/show/127941-alex", "userReview": "One of the things that I've always loved about Vonnegut is how simply he expresses complex ideas. Slapstick is no different. Here, he expands on the ideas of artificial families first imagined in his concepts of karass and duprass... the Swain children may be duprass personified, with their collective brilliance and their intimacy far beyond what is appropriate for siblings. Their isolation, however, is what leads Wilbur to create what could be the anti-karass... families built at random, not brought together by fate but by assignment.Yet the idea as laid out is intriguing, despite how much I would hate to see it implemented real-time. Somehow it makes sense, the whole idea behind the book's subtitle, \"Lonesome No More.\" Give someone something to belong to, and they're happier. It's the same concept tying people to religions, jobs, political parties, clubs, etc... we want to be part of something, to have people care about us. Randomly arranged families counteract class structures, cultural differences, race and creed, etc. What Vonnegut does so well is adding these ideas to post-apocalyptic visions. Creating worlds that make total sense, despite shrinking Chinese, variable gravity, plagues, contagions, and kingdoms cropping up in America. Making us see the young Swains not as oddities or deviants, but with a sympathetic eye. We don't really question these things. What I do question, however, is Swain's repetitive tic of \"Hi Ho.\" It's a bit of a pointless thread, especially considering how it echoes Vonnegut's earlier \"So it goes\" device. \"So it goes\" makes a bit of a point. Hi ho just sounds ridiculous. And in a world where we accept the grotesqueness of Wilbur and his sister and the breaking down of the country and the ability to float or not get up depending on the day, it takes a lot to be noticed as ridiculous.(probably 3.75)(Hi Ho)"}, {"userName": "David ", "userReviewDate": "Apr 23, 2011", "userURL": "http://www.goodreads.com/user/show/4829780-david", "userReview": "Slapstick, or Lonesome No More, is a self indulgent book by Kurt Vonnegut in his later years. He writes the book as if he's speaking to you, as a friend, in conversation. This style is great for the many Vonnegut fans, it conveys immediacy, friendliness and humour. For people who aren't fans of Vonneguts I wonder what they would make of his addressing his readers so intimately. He drops many of the contraints and conventions in story telling, but picks up other ways to carry the story. If aspiring authors want to adopt this style, it must be incredibly difficult to master. The story flows along, the writing is never clunky or hard to understand. You know Kurt Vonnegut has the events well in hand, and isn't just making it up as he goes along. But the structure is casual, conversational, like a fireside story telling. The main element for me in Kurt Vonneguts writing is his humanity. He is world weary but able to laugh at the weird way humans treat each other. Humour and pathos and warmth."}, {"userName": "Christie", "userReviewDate": "Jan 23, 2009", "userURL": "http://www.goodreads.com/user/show/1932539-christie", "userReview": "Vonnegut is always a bit strange, isn't he? I picked this book up at a hostel swap library and I read it in an afternoon. It has a bit of the sci-fi quality that he apparently says he doesn't write anymore, but nevertheless, it's there. The book was written in the late 70s, but some of the cultural predictions are, if not accurate, hilarious to read today. For example, the Chinese genetically develop themselves to be even tinier so that they consume less food. They get down to 6cm in size! Also, the President of the United States (oddly enough, he is the narrator) decides that all people will be given a new middle name, which along with 9,999 other people, will form the basis of a new family of relatives. Experimentation with social theory is just one subject this book touches upon. Very interesting for a summer read, particularly if you can just pick it up at the library."}, {"userName": "R.", "userReviewDate": "Feb 04, 2009", "userURL": "http://www.goodreads.com/user/show/184928-r", "userReview": "I was amazed with Vonnegut's tour through an apocalyptic world; his mixture of Gothic, science-fiction and comedy. That said, I stepped toward this reading tentatively, with visions of the horrible Jerry Lewis movie from the 1980s in my head. It was a rental: \"Hey! This movie's got Jerry Lewis!\" - a man whose cinematic ouevre is unparalleled if you give it a chance, you're 10 and the videocassette market is pretty slim pickings (it was, in the 80s).So I feared this: http://www.youtube.com/watch?v=GS9IJf...But what I got was so rewarding and spoke so empathically to the universal condition of loneliness that I was genuinely moved and wanted to give Vonnegut a big hug.Bonus track: http://www.youtube.com/watch?v=4p2Hlp...Bonus track No. 2: Batman, Nazi collaborator?: http://www.youtube.com/watch?v=UHD_53..."}, {"userName": "britt_brooke", "userReviewDate": "Nov 25, 2016", "userURL": "http://www.goodreads.com/user/show/1136632-britt-brooke", "userReview": "\"Why don't you take a flying fuck at a rolling doughnut? Why don't you take a flying fuck at the mooooooooooooon?\" I don't really know what to say about this book. It's totally absurd. Also smart, witty, and completely entertaining. Not my favorite KV, but a worthy read."}, {"userName": "Kate", "userReviewDate": "Jun 17, 2010", "userURL": "http://www.goodreads.com/user/show/658764-kate", "userReview": "My first Vonnegut book. For many years I felt like I should read something by KV as I have always heard great things about him and his writing. Ben suggested I start with this book, so I did. Slapstick was pitched as \"hilarious\", but I found it to be profoundly sad. It took me back to Christmas morning in Singapore when I had a conversation with an aunt of two of our friends. She was Singaporean of Chinese ancestry but lived in San Diego, and was back visiting for the holidays. She said that she found American culture very disturbing because she felt like Americans didn't have our values in place, that we didn't know what was important. She felt that the majority of the Americans she had met didn't understand or respect family, that many of the people she encountered didn't know their grandparents or revere them or even their parents. That when you get old in America, your family just puts you away in a home to be cared for by strangers. She found this quite upsetting and sad, and worrisome as she was concerned about her own future (aging) since she felt that her son was adopting the ways of \"Americans\". Ultimately she was worried about be lonely and forgotten. I wish I had her address because I'd send her this book.Vonnegut examined the idea that Americans were missing out on family and were often creating false families to fill that void—\"Lonesome No More!\"; he also somewhat comically examined East-West, where the Chinese are so far advanced (and have made themselves tiny!) and have way more things figured out than Westerners can even comprehend. There were some really brilliant passages with keen insights into our government and way of life. Some parts were a bit bizarre, but still a good read. Looking forward to reading Slaughterhouse Five next."}, {"userName": "Helene", "userReviewDate": "May 10, 2016", "userURL": "http://www.goodreads.com/user/show/52637624-helene", "userReview": "STRANGEST OF THE STRANGEThis is the first book by Vonnegut that I have read . And honestly it was odd. (But in a good way). One can be odd ,different even eccentric without stereotyping them as weird  Back to the book . I felt his book was both happy even humorous at times . As I read more I felt sadness , deep sorrow . Vonnegut highly imaginative and intelligent book. And I found it written in the most uncomplicated , simple manner . It read much like having a conversation with a very creative person minus the ego . I found this book while sorting through boxes of my Mother's vast collection of books. My mom was a AVID reader . She had a passion for historical non-fiction and health . I laughed out loud when I stumbled across a few romance novels .HEHE! That's my mom for sure . She had such a fantastic sense of humor . I know she left those on purpose just to make me laugh . Now as I am thinking she probably did the same with this book !"}, {"userName": "Ariya", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/11818463-ariya", "userReview": "A comical absurdism. This is the story of the President of the United States in not-so-far away future with a dumb wit and incestuous love with his abdominal sister and the cure for loneliness, on the other hand, it allegories American people and their \"abdominal\"land trying to bond with the primitive and ruthless origins whereas sometimes their ideology is justified to be perished and the U.S. after all can't be reconciled with his sister again (for the moment I write this on-- it reminds me of Wuthering Heights and holy shit it's almost the same plot!)I like the long prologue when Vonnegut talks about his family: his brother in love with his work like the Blacksmith secretly in love with his anvil (my favorite part), the tragic death of his sister and brother-in-law, the museum of childhood memories, family of choices and so on. Also the way he subscribes the book dedicated to the love for his sister (in an incestuous way!) is very creepy and unique."}, {"userName": "Sookie", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/4136921-sookie", "userReview": "It's like staring at a Kandinsky (the later ones) and wondering why it makes absolute sense and kinda mind blowing although it all seems to be splotches of colors and random geometric patterns on a canvas. I kept tripping between smugness and earnestness when it comes to Vonnegut's brand of realism."}, {"userName": "Elizabeth", "userReviewDate": "Jul 09, 2011", "userURL": "http://www.goodreads.com/user/show/5760579-elizabeth", "userReview": "If I could give no stars, I would. I hated every sentence of this book."}, {"userName": "Mike", "userReviewDate": "Jul 29, 2008", "userURL": "http://www.goodreads.com/user/show/1370632-mike", "userReview": "Slapsucked.Hi-ho."}], "description": "Slapstick\n presents an apocalyptic vision as seen through the eyes of the current King of Manhattan (and last President of the United States), a wickedly irreverent look at the all-too-possible results of today’s follies. But even the end of life-as-we-know-it is transformed by Kurt Vonnegut’s pen into hilarious farce—a final slapstick that may be the Almighty’s joke on us all.", "title": "Slapstick, or Lonesome No More!", "url": "http://www.goodreads.com/book/show/9595.Slapstick_or_Lonesome_No_More_", "average": 3.87, "cover": "https://images.gr-assets.com/books/1514342815l/9595.jpg", "reviews": 1158, "authors": [{"url": "https://www.goodreads.com/author/show/2778055.Kurt_Vonnegut", "name": "Kurt Vonnegut"}], "type": ["Fiction", "Science Fiction", "Humor", "Classics"], "outlinks": ["http://www.goodreads.com/book/show/9595.Slapstick_or_Lonesome_No_More_", "http://www.goodreads.com/book/show/1463759.Slapstick", "http://www.goodreads.com/book/show/829859.Slapstick_or_Lonesome_No_More", "http://www.goodreads.com/book/show/1123874.Slapstick_or_Lonesome_No_More_", "http://www.goodreads.com/book/show/13570170-payasadas-o-nunca-m-s-solo", "http://www.goodreads.com/book/show/23263760", "http://www.goodreads.com/book/show/30656471-slapstick-or-lonesome-no-more", "http://www.goodreads.com/book/show/35724301-slapstick", "http://www.goodreads.com/book/show/4981.Slaughterhouse_Five", "http://www.goodreads.com/book/show/135479.Cat_s_Cradle", "http://www.goodreads.com/book/show/4980.Breakfast_of_Champions", "http://www.goodreads.com/book/show/4982.The_Sirens_of_Titan", "http://www.goodreads.com/book/show/9592.Mother_Night"]}