{"ratings": 1929, "userreviews": [{"userName": "Eve", "userReviewDate": "Dec 16, 2017", "userURL": "http://www.goodreads.com/user/show/1283951-eve", "userReview": "Despite the title, I found these stories a delight to read before bed. At the end of each story, I couldn't help but be galled at the twists or miscarriages of justice. They were perfect. Lately, mysteries that focus on what drives an ordinary person to murder, have been of great interest to me. That's what all of these stories, with the exception of one, had in common. It wasn't so much about who the murder(s) was, as to why. In reading this collection, I realize how awesome short story collections can be when you don't want to get bogged down with a novel, or already have a lot of books on your reading plate. Hopefully I can read varying collections in the coming year."}, {"userName": "L.A. Starks", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/5159766-l-a-starks", "userReview": "This collection of short stories is a bit odd for the holidays, but P.D. James' writing, and the twists in several of the six, are well worth reading."}, {"userName": "Blair", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "A high-quality collection of short crime stories – I really liked all six; in fact it's hard to pick a favourite. There's something comforting and familiar about them, but they're also laced with humour and just a little bit of cynicism.The Yo-Yo (2006)Now in his seventies, the narrator comes across a yo-yo among some old personal papers. What connects this innocuous object with a crime he witnessed at the age of thirteen? The rest of the story tells us, with plenty of cosy, quintessentially British details which are ultimately ruptured by an act of violence.The Victim (1973)'You know Princess Ilsa Mancelli, of course...' The narrator is the cuckolded first husband of the luminous Ilsa – except he knew her when she was a small-town girl named Elsie Bowman. They marry when Elsie is just 17, and her affection doesn't last long. When he discovers her deception, the narrator spends a year planning the perfect crime: a lengthy period of psychological torture followed by the untraceable slaughter of Elsie's lover, Collingford. All seems meticulously plotted, but an ingenious ending turns the story on its head and casts doubt on who, exactly, the 'victim' might be.The Murder of Santa Claus (1984)An ensemble cast gives this Christmas-themed tale the feel of a crime classic; a TV adaptation would make perfect festive viewing. The mismatched group – including 16-year-old Charles Mickledore and his wealthy uncle, an elderly couple and a successful actress – assemble at a grand house for Christmas celebrations. As the title indicates, it all goes rather horribly wrong. Many years later, Mickledore (now a successful author of crime fiction) writes to the police, finally confessing what he witnessed that night. The pleasure of this lies more in atmosphere than in plot – I didn't really care whodunnit, but the deliciously camp details (like a damning clue turning up on the Christmas tree) were so enjoyable.The Girl Who Loved Graveyards (1983)'The girl' is taken to live with her aunt and uncle at ten years old after the deaths of her father and grandmother. She's a lonely child, whose happiest moments are spent wandering in a nearby cemetery. But when she overhears an inexplicable conversation about her father between her relatives, what at first seems (to the reader) a fairly obvious conclusion is slowly revealed to be something far more sinister. Worse still, the girl discovers that she has held the key to this secret all along. A tale of the horror that might lurk inside one's own repressed memories, this reminded me of stories by Daphne du Maurier, Shirley Jackson and Muriel Spark.A Very Desirable Residence (1976)A teacher and his colleague are fascinated by the private lives of their headmaster and his much younger, yet remarkably meek and frail, wife. The narrator suspects the headmaster of being abusive, so perhaps it isn't all that surprising when the seemingly docile Emily finally snaps and takes violent revenge on him. In this story, it's the criminal's motive that provides the most surprising twist, and it also adds a rather ironic flavour to the eventual outcome.Mr. Millcroft's Birthday (1992)Lighter and more amusing than most of the rest, this concerns a pair of grasping siblings whose elderly father, now living in a nursing home, makes a startling confession. If the truth comes out, Mildred and Rodney might be cheated of their sizeable inheritance – so they decide to take matters into their own hands and destroy the evidence... Fun and, again, cleverly ironic.TinyLetter | Twitter | Instagram | Tumblr"}, {"userName": "Faith", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/17430801-faith", "userReview": "I'm not a big fan of short stories but each of these had a delicious and surprising edge to it and I really liked them."}, {"userName": "Ammar", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/3569723-ammar", "userReview": "This collection of short stories by the master of crime P. D. James is very very good. The crimes are simple sometimes, yet written in the most beautiful way. Stories that take place during different decades .. and takes you all over England and sometimes abroad."}, {"userName": "Joanna Park", "userReviewDate": "Oct 05, 2017", "userURL": "http://www.goodreads.com/user/show/26160119-joanna-park", "userReview": "I haven’t read an awful lot of short stories but when i was given the opportunity to review PD James’s new book I jumped at the chance.Sleep No More is a collection of 6 short stories each involving a murder and each describing the deviousness of the characters as they plot out the perfect murder. Some of the methods used and the planning of the murder is extraordinarily clever and was a bit of an eye opener to read about.The stories included a large variety of characters that I had mixed feelings for. Whilst i felt very sorry for the jilted husband in “The Victim” and the little girl in “The Girl Who Loved Graveyards” I hated the schoolboy in “The Yoyo” as i found him very obnoxious and full of himself. I think this character is quite real though as I have encountered a few public school children like this. These being short stories there wasn’t a lot of time for the reader to get to know the characters which i felt was a shame as i would like to have spent a bit more time with some of the characters, discovering more about them and what makes them tick.All the stories appear to be set in the past and have quite a lot of historical detail in them at times that helps the reader imagine the setting for the stories. In one the life of a public school in 1930 is well described and in another the stigma of divorce is mentioned giving the reader a glimpse into the life and problems of the characters. These details were very interesting and helped me to image the characters and story better in my mind.In my personal opinion the stories get betters as the book goes along. I definitely enjoyed the later stories more than the earlier ones. This isn’t to stay that the earlier stories were bad just that the later ones were more my style of story and had a little more going on in them.PD James in the author of many full length novels and short story collections. I have read quite a few of her books in the past and will definitely be reading more in the future.Thank you to Sophie Portas and Faber & Faber for my copy of this book a"}, {"userName": "Tanja Berg", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/5935491-tanja-berg", "userReview": "And there! I finished my reading challenge, which was 120 books also this year. I don't think I've finished so late any previous year. I've been in Vienna since last Wednesday. I thought vacation would mean plenty of reading time, but no! All my routines gone, the New York Times for breakfast reading instead of a book.I picked this up at the airport. I was distressed to realize from the jacket that P.D James passed away in 2014, something I had missed. I thought I bought \"the mistletoe murder and other stories\", but shrugged when I realized this.\"Sleep no more - six murderous tales\" was absolutely delightful. They suited my altered reading habits perfectly. Every story manages at least one twist, sometimes several. I loved them all!"}, {"userName": "Fictionophile ", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/4428094-fictionophile", "userReview": "Finding work by a late author that you have revered is rare. Therefore you can imagine my excitement to see that another collection of stories by the inimitable P.D. James has been published. Last year I read and enjoyed \"Mistletoe Murders: and other stories\", this year it is \"Sleep no more\". And yes, there IS a murder in all six stories.The book contains six excellently executed short stories, two of which have a Christmas theme.\"The Yo-Yo\"An elderly man finds a red yo-yo in a box of clutter.  This find spurs memories of the events that occurred when, as a child, accompanied by a teacher, he was shipped off from his boarding school to spend Christmas with his widowed grandmother.\"The Victim\"An assistant librarian plans the 'perfect murder' of his celebrity ex-wife's latest husband. This story has a delicious twist at the end - as do many of the stories in this collection.\"The murder of Santa Claus\"A mediocre mystery novelist tells the story of how his uncle, Victor Mickledore, was murdered one Christmas Eve in an atmospheric Cotswold manor house. A retired policeman, Detective Inspector John Pottinger relates his memories of the case.\"Merry Christmas, Mickledore!Go to be and sleep no more.Take this charm and hold it fast;This night's sleep shall be your last.\"P.D. James puts her own spin on the classic 'locked room mystery'.\"The girl who loved graveyards\"An orphaned girl tells of her life living in a house in East London bordering a cemetery. \"She didn't need friends. She had the graveyard and its occupants.\" She lives with her aunt and uncle and has no memory of the first decade of her life. All is revealed when she grows up and returns to the village where she was born...\"A very desirable residence\"The story of an art teacher, and the frame-up of the unpleasant math teacher at his school - whose Georgian house he covets.\"Mr. Millcroft's birthday\"A story that works as a gleeful omen of what can happen when avarice rules your life. It tells of a cunning nursing home resident as he turns the tables on his greedy adult children.Only P.D. James could write these nostalgic, insightful, sinister, and astute mystery stories.  She portrays murder 'as a means to an end' - murder done by ordinary people, but told in a way that is distinctly 'unordinary'. They are a fine balance between the succinctness of the short story form coupled with James' famous verbosity. If pressed to pick a favorite story from this collection, I guess it would be \"A very desirable residence\".  The irony of the last lines is memorable.A few quotes that I particularly enjoyed from this book:\"The young seldom lie convincingly. They haven't had time to practice like the rest of us.\"\"Memory is always disjointed, episodic.\"\"Marriage is both the most public and the most secret of institutions, its miseries as irritatingly insistent as a hacking cough, its private malaise less easily diagnosed.\"I received this book from Knopf/Penguin Random House via Edelweiss in consideration of a review."}, {"userName": "Diane Barnes", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "A perfect little book of \"six murderous tales\", as it is so aptly sub-titled. Six perfectly executed murders, every detail seen to, each murderer sympathized with, each victim deserving their fate. Every one of these stories had a surprising little twist at the end, making me gasp with the genius of P.D. James. Turns out contemplating murder and revenge is a great way to spend New Years Day."}, {"userName": "Fiona MacDonald", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/2417021-fiona-macdonald", "userReview": "I am beyond sad that there are only two books of P.D. James's short stories. I have adored both of them. This one is not so 'christmassy' as 'The Mistletoe Murder' (although there is a murder set on Christmas Eve) but still perfectly written. Each story is not a page too long, or short, each ends at precisely the correct time. Such good writing, I really enjoyed the book overall. And despite it being a bit much sometimes to read short story after short story, I didn't have a problem with these ones as they were all so completely different."}, {"userName": "Paul", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/11410830-paul", "userReview": "Sleep No More – A Delightful Collection of Short StoriesThis collection of short stories from the late PD James, just reminds us how much she was loved and will be missed. She delivers in each short story something other authors fail to deliver in a full-scale novel. All these short murder mystery stories are pithy, get to the crux of the matter and each one is engrossing.Each of these stories are a standalone story, all written in beautiful prose, full of twists, most of which you never see coming. Each story an original from someone who was the queen of mystery writers, who knew how to entertain her readership.PD James may be gone, but this collection is an excellent testament to her talent and writing, and as she always did, reminds me how many women have really made this genre their own. This is in the grand tradition of short mystery stories first started by Agatha Christie and PD James was a true heir to her crown.I cannot recommend this collection highly enough."}, {"userName": "Sarah", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/7664274-sarah", "userReview": "4.5 stars!I loved this! While it was 100% a cover / seasonal-instagrammable buy (the gold foil is gorgeous), I enjoyed the stories so much! I usually dont *get* short stories... I don't find them enjoyable, and I HATE when they end without resolution. PD James wrote wonderfully, old fashioned vignettes that were perfect for a stormy autumn night... plus all had satisfactory ends. Job well done."}, {"userName": "Lotte", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/25309949-lotte", "userReview": "4.25/5.I think the subtitle \"murderous tales\" describes this collection really accurately. Even though P.D. James’s writing is often linked to Agatha Christie’s, the stories in this collection are not detective stories or murder mysteries in the most traditional sense. Instead, they more or less read like dark, but humorous observations of the human race, repeatedly questioning what humans are willing to lie and what they're willing to kill for. (Don't worry though, there's always a satisfying resolution to every story.)I feel like the author's dark and clever sense of humour and her knack for unlikable characters can also be compared to the writing style of Roald Dahl and Shirley Jackson, two authors I absolutely love. Even though P.D. James likes to use the same twist (or a slight variation of the same twist) a little too often for my taste, I thoroughly enjoyed my time reading this collection, just as much as I did when reading The Mistletoe Murder this time last year. I can highly recommend both of these collections and will undoubtedly read more of what P.D. James has written in the future!"}, {"userName": "Marjorie", "userReviewDate": "Aug 26, 2017", "userURL": "http://www.goodreads.com/user/show/32379875-marjorie", "userReview": "There was a reason P.D. James was the “Queen of Crime”. She knew how to capture her readers. I’ve read all of her work and was so pleased to see these new-to-me six stories being published. They were such a very special treat!I think “The Girl Who Loved Graveyards” was my favorite, if I had to pick a favorite as I loved each of them. This was the most chilling tale. A story of a young girl who fell in love with a graveyard and who couldn’t remember the first ten years of her life. While some of these stories will give you chills, some of them will make you laugh, like “Mr. Millcroft’s Birthday”. They take place in the 1920’s and 1930’s and have a wonderful old-fashioned feel about them. Ms. James must have had so much fun writing these witty, delightful short stories.Most highly recommended.This book was given to me by the publisher in return for an honest review."}, {"userName": "Charlotte Smith", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/38708746-charlotte-smith", "userReview": "Another good short stories book from p.d James. Really enjoyed these ones."}, {"userName": "Melanie", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/4843124-melanie", "userReview": "It has been the \"Tale of the two short story collections\" this week and I cannot help comparing EM Benson's Ghost Stories to this offering by PD James. It's fair to say that I am often disappointed by short story collections, because quite often they are just short. And I find the experience unsatisfying and often quite boring. Enter: PD James. Now, I have been a dedicated fan of hers for 15 years. I read all her Dagliesh novels and I am sad that there will never be another one. Yet, I don't think it's just my fan girl talking here, the stories were creepy, fascinating, great little character studies of murder and those involved with it and the settings were so atmospheric. Perfect for this autumnal week of storm and rain. I have just ordered her Mistletoe Murder stories for December."}, {"userName": "Biblio Files (takingadayoff)", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/3007401-biblio-files-takingadayoff", "userReview": "As a non-fan of P.D. James, I approached the collection without great expectations. (I read the two Cordelia Grey novels but never got hooked on Dalgliesh). Well, they were a lot of fun, very traditional and well constructed. There are only six short stories so this is more of a stocking stuffer than a big collection. I'm glad I took a chance on this one."}, {"userName": "Breakaway Reviewers", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/22317001-breakaway-reviewers", "userReview": "Six little murderous gemsI’ll be honest – I have never enjoyed short stories; you just get into them and they finish! This little collection has really changed my mind; the stories are domestic in scale and involve ‘normal’ people at the end of their rope.P D James died in 2014 and so this is a posthumous offering with a sensitive foreword by Peter Kemp. All the stories have been published before, but not all together.Each story is beautifully formed, a mini-masterpiece; all except the final ‘Mr Millcroft’s Birthday’ are set in the last century, with the first, ‘The Yo-Yo’, set in the 1930s.Despite the subject matter and the warning of the title, I found this perfect bedtime reading; and perfect morning coffee and afternoon tea reading! Whenever you pick up this little volume it will be perfect.P.D. James remains one of the greatest thriller writers of our time. Her characterisation is spot on, her construction and pace immaculate, and her imagination boundless.If, like me, you shy away from short stories seek this out; you won’t regret it. PashtpawsBreakaway Reviewers received a copy of the book to review."}, {"userName": "Marybeth", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/3883965-marybeth", "userReview": "I've never read any of P. D. James so this was a nice change for me. I only give four stars because the format of these stories was so similar that I was able to figure them out after the first one. Still, they're an interesting take on the murder mystery and made me intrigued enough that I've got the first Dalgleish novel on hold at the library. I would definitely recommend to anyone who hasn't read James before."}, {"userName": "Joshua Polk", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/26600120-joshua-polk", "userReview": "Ups and downs but mostly good!"}, {"userName": "Lindsey", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/21190085-lindsey", "userReview": "Creepy fun!"}, {"userName": "Magistra", "userReviewDate": "Dec 19, 2017", "userURL": "http://www.goodreads.com/user/show/7993617-magistra", "userReview": "Excellent set of short stories. I didn't see the end coming in a few of them. Her twists and turns were masterful."}, {"userName": "Amanda", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/11072350-amanda", "userReview": "P. D. James was a fine author with a brilliant but twisted mind.  I had occasionally watched the television series featuring her most celebrated detective, Adam Dalgliesh played by Roy Marsden.  I remember really enjoying them.  Sadly I hadn’t actually read any of her books so when I was asked if I would like to receive a copy of the latest short story collection by P.D. James and appear on the blog tour, I felt that it was an ideal opportunity to acquaint myself with her written works.This is a different sort of review to write for me because I don’t usually review collections of short stories as I normally read full length novels.  They do say that a change is as good as a rest, so it was with a certain degree of excitement that I opened the front cover of ‘Sleep No More’ and when I finished reading the book, my first thought was never has a title been so apt.The characters in the stories were all well thought out and they were believable.  In fact you could have plucked them from any town, village and city high street or they could just as easily be your next door neighbour.  Each character had their own secrets to hide and skeletons in the closet.  It’s almost as if each character has two personas in that they present one persona in public but they have a different persona entirely in private.  At times , the characters in this book were rather creepy to say the least.  More than once I almost shuddered at how sinister some of the characters actually were.  I couldn’t believe how they could commit murder or some other similar crime, not be affected by it and then carry on as normal.‘Sleep No More’ is written in a style not dissimilar to the style used by those classic crime writers and speaks of a bygone era.  I was hooked on this collection from the moment I opened the front cover and I wasn’t released from the book’s grip until I had closed the back cover.  I was so hooked on each and every story that I didn’t realise quite how quickly the pages were turning.  It was almost as if they were turning themselves and before I knew it I had finished ‘Sleep No More’, which I was disappointed about because I was enjoying the author’s writing style so much.  Each story comes with a twist, which hits you in the stomach and strikes without warning.  On more than one occasion I thought that I had figured out what had happened and to whom, but I soon realised that I was wrong and the author sent me down another path entirely.  I genuinely did not see the twists coming.In short I really enjoyed reading ‘Sleep No More’ and I would recommend it to anybody.  This is certainly a book for those fans of classic crime writing.  I enjoyed this selection of short stories so much that I have bought the author’s other collection of short stories called ‘The Mistletoe Murder & Other Stories’.  I also now fully intend to go and read all of P. D. James’ books featuring Adam Dalgliesh. I award this book a well deserved 4* out of 5*."}, {"userName": "Abby Slater- Fairbrother", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/40142516-abby-slater--fairbrother", "userReview": "Six murderous tales from the queen of crime P.D. James1 – The Yoyo:The short story summarises an elderly lady recalling the fateful night of 23rd December 1936 and the crime that marked her teens. 4*2- The Victim:The Victim, details the story of class hierarchy, love and the pain of divorce. With a central character of, the elusive Princess Llsa Bowman…..4*3- The Murder Of Santa Claus:Charles Mickledore retells the murderous Christmas of 1939, where everyone is a suspect and no one is caught….4* 4- The Girl Who Loved Graveyards: A young girl is left orphaned and dumped with distant relatives. She spends her days in the graveyard and becomes obsessed with seeing her father’s grave. Only what awaits her there, is not what it seems…….5* 5- A Very Desirable Residence: This details the trial of Henry Vinson, for the attempted murder of his socialite wife Emily. A detailed tale of treachery and scheming. 5* 6- Mr Millcrofts Birthday:An elderly man makes a confession of murder, to his adult children. But is it true or merely a senile delusion? A tale of intelligence and manipulation, but whom is the manipulator 5* I thoroughly enjoyed this mixture of short stories. Some of the stories have a Christmas feel to them, making this the ideal gift for loyal P.D. James fans. My favourites were The Girl who Loved Graveyards and Mr Millcrofts Birthday. Highly recommended 4.5*"}, {"userName": "Rebecca", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/6294648-rebecca", "userReview": "I love P.D. James’ dark humor and wit. These clever murder mysteries are the perfect length."}, {"userName": "Emma", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/12794623-emma", "userReview": "Don't you just love that as a tagline, 'six murderous tales'!  And that's exactly what the reader gets, the demise of some very deserving victims and the ingenious souls who plot their downfall.I've always found it hard to review short story collections (easy to read, harder to review!).  Do you review each story individually?  Do you write a piece covering the entire work and how well the stories gel, how the book starts and whether it finishes on a high note?  Well, I for one, never know the right way of doing these things so on this occasion I have chosen to write a general review of how I found this wonderful collection of crime.I haven't read The Mistletoe Murder and Other Stories for which this new release is a companion read.  I will be making sure I get hold of a copy soon though, one for the Christmas wishlist maybe?  All of these six stories stand on their own merit, and they stand proud.  P.D. James was a master of suspense which she proves on each and every page of this novel.The Yo-Yo is a great opening story which has a wonderfully atmospheric feel to it.  Despite being a regular reader of all things blood and gore I found myself shocked that such a young child was involved in such a dark and dangerous situation.My favourite story was The Murder of Santa Claus which invites the reader to an old mansion for Christmas day.  One of the party goers is given a gift he would not choose for himself, a bullet to the chest.  This intriguing tale has all the classic threads of a whodunit mystery and it was delightful reading.The Girl Who Loved Graveyards also scored high for me.  A creepy, gothic tale which appealed to my darker side.All stories within this volume are riveting reads which crime fiction fans will devour.  Mr Millcroft's Birthday, the very last story in the book, was the only one I was a little disappointed with (only a smidge, mind you!).  It's a subtle story with the possible hint of a dastardly murder which fell a little flat for me.Would I recommend this book?  I would.  This short book would make a great gift for the crime fiction fan in your life.  I find short story collections to be quite refreshing, a short sharp read you can pick and choose from as you wish.  And as short story collections go, you can't get much better than P.D. James.Four out of five stars.I chose to read and review an ARC of Sleep No More.  The above review is my own unbiased opinion."}, {"userName": "Karly", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/7149482-karly", "userReview": "I'm generally not a fan of short stories, however these six murderous tales definitely piqued my interest. Within a couple pages I felt surprisingly familiar with the characters, settings and plot.The first five stories in this collection had me guessing the whole time and I was completely wrong in the end each time. By the sixth story however, I figured out this author's style and had it mostly figured out. Each story has a wicked twist!These stories are perfect for when you don't have time for a full novel but want to get lost for a few pages.I also think I'm more likely to give other short stories a try now!"}, {"userName": "Anne", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/32280733-anne", "userReview": "4 starsTo usher in the cooler climes of fall, an autumn themed cover feels apt.A collection of murder mysteries with twists, each one unique but similar in style and feel. My top picks from the collection are:- The Murder of Santa Claus: a Cluedo type of murder mystery with all primesuspects narrowed down to the guests and househelp.- The Girl Who Loved Graveyards: this one really gave me the creeps, my favourite.- Mr Millcroft's Birthday: the twist is at the very end and it was cheeky, placing doubt on characters."}, {"userName": "Daniel Kukwa", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/3885089-daniel-kukwa", "userReview": "Now this is skill: four short stories about murder, from old school Poirot-like settings to a nursing home in the present day. Each one delivers a certain type of shock, and each one exquisitely builds a set of characters quickly and efficiently. As an exercise in the ultimate type of concise storytelling, it's first class work. The final story in this collection of six delivers makes for a hilarious climax."}, {"userName": "Deepa Nirmal", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/58651112-deepa-nirmal", "userReview": "P.D. James died in 2014 and yet here are six new murderous tales in 2017. It's a very different experience reading her short stories as opposed to her novels, but even with the abbreviated length she achieves her usual effects. A little bit uneven but still a fun and quick read."}], "description": "No one gets inside the head of the murderer--or makes it a more thrilling read--than the late, great P. D. James. Fast on the heels of her latest best seller: a new, fiendishly entertaining gathering of previously uncollected stories, from the author of Death Comes to Pemberley and The Private Patient.It's not always a question of \"whodunit?\" Sometimes there's more mystery in the why or how. And although we usually know the unhealthy fates of both victim and perpetrator, what of those clever few who plan and carry out the perfect crime? The ones who aren't brought down even though they're found out? And what about those who do the finding out who witness a murder or who identify the murderer but keep the information to themselves? These are some of the mysteries that we follow through those six stories as we are drawn into the thinking, the memories, the emotional machinations, the rationalizations, the dreams and desires behind murderous cause and effect.This selection (c) 2017 by the Estate of P.D. James. \"The Yo-Yo\" written 1996; revised as \"Hearing Ghote\" in The Verdict of Us All, ed. Peter Lovesey copyright P. D. James 2006. \"The Victim\" first published in Winter's Crimes 5, ed. Virginia Whitaker copyright P. D. James 1973. \"The Murder of Santa Claus\" first published in Great Detectives, ed. D. W. McCullough copyright P. D. James 1984. \"The Girl Who Loved Graveyards\" first published in Winter's Crimes 15, ed. George Hardinge copyright P. D. James 1983. \"A Very Desirable Residence\" first published in Winter's Crimes 8, ed. Hilary Watson copyright P. D. James 1976. \"Mr Millcroft's Birthday\" first published as \"The Man Who Was 80\" in The Man Who copyright P. D. James 1992; revised as \"Mr Maybrick's Birthday\" copyright 2005. Foreword copyright 2017 by Peter Kemp.", "title": "Sleep No More: Six Murderous Tales", "url": "http://www.goodreads.com/book/show/35137916-sleep-no-more", "average": 4.0, "cover": "https://images.gr-assets.com/books/1498796990l/35137916.jpg", "reviews": 317, "authors": [{"url": "https://www.goodreads.com/author/show/17452454.P_D_James", "name": "P.D. James"}], "type": ["Mystery", "Short Stories", "Fiction", "Mystery", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/35137916-sleep-no-more", "http://www.goodreads.com/book/show/35134235-sleep-no-more", "http://www.goodreads.com/book/show/36115024-sleep-no-more", "http://www.goodreads.com/book/show/35079533-sleep-no-more", "http://www.goodreads.com/book/show/35487707-sleep-no-more", "http://www.goodreads.com/book/show/35191163-sleep-no-more", "http://www.goodreads.com/book/show/12875355-death-comes-to-pemberley", "http://www.goodreads.com/book/show/41913.The_Children_of_Men", "http://www.goodreads.com/book/show/3832.Cover_Her_Face", "http://www.goodreads.com/book/show/764434.Shroud_for_a_Nightingale", "http://www.goodreads.com/book/show/3833.The_Black_Tower"]}