{"ratings": 149274, "userreviews": [{"userName": "Emily May", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "“The State just sees a dead baby. They’re targeting you because they think you failed as a nurse.”“You’re wrong.” I shake my head in the darkness, and I say the words I’ve swallowed down my whole life. “They’re targeting me because I’m Black.\"\n 3 1/2 stars. I have some issues with the ending, but otherwise Small Great Things is such a pageturner. It's the kind of book you can easily stay up until 2am to finish (even without the teething infant to help you along). True, it's Racism 101 for white Americans, but I kind of think it's a message they need to hear.You know, I guess I had some prejudice against Jodi Picoult before going into this. I had only read one book by her - My Sister's Keeper - and that was at least ten years ago. In my mind, I've always associated her with mindless chick lit novels, especially because people were comparing her to Liane Moriarty on my less than favorable review of Truly Madly Guilty. But if this book is anything to go by, she's vicious.Small Great Things is a horrible, emotive book that puts both racism and white privilege on trial in a nail-biting courtroom drama.It all starts when Ruth Jefferson, a black Labor & Delivery nurse, is told to keep away from the newborn son of white supremacists. On the busy ward, though, it is Ruth who finds herself the only nurse in the room when the baby goes into cardiac distress. She hesitates and is arrested on suspicion of not just negligence, but of racially-charged murder.\nHow am I supposed to encourage my son to be better than most people expect him to be? How can I say, with a straight face, you can be anything you want in this world - when I struggled and studied and excelled and still wound up on trial for something I did not do?\nThe story moves between the perspectives of Ruth, her white public defender - Kennedy McQuarrie, and the neo-nazi father of the deceased child. Picoult develops all her characters, even painting in a back story for the repulsive Turk Bauer, never allowing him to simply be a villain without context. His life is revealed to us, as is his nauseating journey to white supremacism.I think this book works so well because it isn't so much about portraying racism through a black woman's eyes as it is about a white \"definitely not racist\" lawyer facing up to her white privilege, acknowledging its existence, and using it for good. And no, that doesn't mean using it to speak for minorities; it means using it to give them a platform to tell their own story. Small Great Things could have been all kinds of wrong if the white author had attempted to be a spokesperson for black Americans - but it is instead an appeal to white people to open their eyes. Stop pretending white privilege doesn't exist. There's a tendency among white Americans and Europeans to believe that \"I'm not racist\" or \"I don't even see colour\" is somehow good enough. It's not good enough. Not seeing colour is a luxury that only white people have, and most often it's a lie anyway.Look at me. I consider myself an open-minded, forward-thinking person. Yeah, I give myself a little mental pat on the back for pointing out sexism, racism, homophobia and transphobia in books. I'm a dirty liberal (Bernie Sanders is ♥), a former Politics major, with a badass gay brother, a Muslim best friend, and a mixed race baby boy. I'm like a poster child for annoying, white femi-liberal. But a few months ago I noticed something different on Kirkus Reviews. I noticed that all their reviews now state the race of the characters. For example \"this white teen\" or \"the white protagonist\". And my first instinct was confusion - why are they doing that? Why do they feel the need to tell us that she's white? It took me several fucking weeks for it to come crashing down on me like a fat ton of white privilege. The question I should have been asking wasn't \"why are they telling me they're white?\" but \"why didn't I need to be told that?\" and \"why did I assume they were white in the first place?\" That was the problem all along. I looked at that and immediately thought it was unnecessary in a way that I didn't feel it was unnecessary to be told if a character was black. Because white is the default. Still. Today. In 2016. Even by rainbow flag-waving weirdos like me. If you say \"person\", we assume white. And that, my friends, is white privilege.This book is about all the ways, big and small, life is made more or less restrictive for someone because of the colour of their skin. Kennedy tries to tell herself over and over that the case isn't about race, that racial politics have no place in a courtroom, but as the trial wears on, she can't ignore it. Race is in the courtroom; it always has been.Everything was going great until the epilogue. I think I understand it - the author probably wanted to show what could happen in an ideal world if white people check their privilege - but it is a little too idealistic, oversimplifying the solution to racism, hate crime and hundreds of years of American history. While the optimism after such an emotionally draining read is welcome, it feels out of place. A book like this gains strength from its realism, not its hopeful fantasies.Blog | Facebook | Twitter | Instagram | Youtube | Store"}, {"userName": "Tracey", "userReviewDate": "Sep 22, 2016", "userURL": "http://www.goodreads.com/user/show/1705753-tracey", "userReview": "I have tried to write this review several times. I guess I have a lot of thoughts about this novel.My first thought is that Jodi Picoult did not write this for me. I don't know what the demographic is for Ms. Picoult's novels but being a book person for a long time and having been to a couple of her book readings, I think I can make a pretty accurate guess at the demographic that buys her novels. So this is a novel that was written for white women and it doesn't stray far from Ms. Picoult's other novels. So it will most likely do very well in terms of how much it's read.Even as I'm writing this I can feel the huge BUT that comes after all of that. My \"but\" is that this is really Ruth's story. Ruth is the African American nurse who is accused of harming the infant of a white supremacist couple. We see things from Ruth's perspective, the husband's perspective, and Ruth's lawyer's perspective. By showing all of the perspectives, we get the whole well rounded story, right? Not really...because this is Ruth's story or it should have been. As I was reading, I couldn't help but ask myself, how many other novels written by people of color about people of color could have been published? The answer is a lot but how many of them would have been read by Jodi Picoult's readers? I have no idea. (Yes I do.)I don't begrudge Ms. Picoult writing Small Great Things. I don't believe that white authors shouldn't write from the perspective of people of color. My issue (and I guess it is an issue because it's been nagging at me since I finished this book) is the execution of it? Ms. Picoult wrote a how-to not be racist novel for white people. Every single cliche and trope that has ever happened to a person of color is in this novel. The hyenas in The Lion King? They get a mention. The lawyer tells Ruth she doesn't see color? Yes, that happens. Here is where I say that I don't speak for all Black people. Okay?I connected with Ruth very much. I did the same things she did. I did well in school, I didn't \"flaunt\" my color, I believed that if I just acted the same as everyone else around me, I'd be treated the same. And that's just not the case. I've been at work (where I was one of a few people of color) and had someone say something inappropriate. Sometimes I used it as a teaching moment, more often than not, I rolled my eyes and moved on. I've wondered about encounters with salespeople. Are they having a bad day or do they just not want to be helping me buy this? Why are they so friendly to the pretty blonde lady behind me? I didn't want Ruth to have to be a teaching moment. I wanted Ruth to be able to have her story without the function being to teach white people something. I believe that if this was written by a person of color, this would have been Ruth's story.I gave Small Great Things 4 stars...it's more like 3.5 but I do enjoy a Jodi Picoult novel every once in awhile. 10/9/16: I'm updating to include an exchange I had with Jodi Picoult over Twitter during the debate tonight. A black gentleman from the audience asked a question that literally had nothing to do with race but Trump made it about race talking about how he would improve the inner cities for the black people living in hell there. Here was Ms. Picoult's response.This is the kind of thing that she would include in her book as an example of a well meaning white person making a point to Donald Trump. Are the Obamas the only black people she knows? Obviously, Trump is not talking about wealthy famous people like the President and Mrs. Obama. He is talking about me and my family. It's a little thing (which is why it's called a microaggression) but the Obamas aren't all black people and the \"inner city\" isn't hell. And Jodi Picoult knows better. Or she should after writing this book.Update 10/10/16: I don't usually change my stars when I review a book. The more I talk about this book with people, the more I realize that I am giving it the benefit of the doubt and it doesn't deserve that from me. It's a solid 2 stars. The way Ms. Picoult chose to tell this story rubs me the wrong way. If other people get something out of it, that's great. And I'll admit to being a little petty about her Obama text last night. That cost her half a star."}, {"userName": "Deanna ", "userReviewDate": "Oct 14, 2016", "userURL": "http://www.goodreads.com/user/show/15662887-deanna", "userReview": "My reviews can also be seen at: https://deesradreadsandreviews.wordpr...I could probably write a twelve page review on everything I want to talk about from this book, everything I learned from this book. However, my reviews are long as it is so I will try my best to keep it short (well...shorter than twelve pages).I have read every book by Jodi Picoult and they all make me think. As I've said before I always learn something too. But I feel like this book is the one that hit me hardest. I learned so much and from the moment I started reading it, it has been on my mind.Ruth Jefferson is the widowed mother of one teenage son, Edison. Her husband died during his second tour of duty in Afghanistan. She is a labor and delivery nurse at a Connecticut hospital. A highly skilled nurse with more than twenty years experience.While doing a regular check-up on a newborn baby, Ruth notices the mother and father glaring at her. She also notices a tattoo on the father's arm. It's a tattoo of a Confederate flag. Only a few minutes later, Ruth is told by her supervisor that she's been reassigned and she's not to touch the Bauer baby. She finds out that the parents are white supremacists and they don't want, Ruth, who is African-American, anywhere near their baby.The next day at the hospital Ruth happens to be alone in the hospital nursery when the Bauer baby goes into cardiac distress. Ruth has not idea what to do. Does she obey the orders she's been given? Or should she intervene to help the baby who's clearly in need of help?The story is told from three points of view. The nurse (Ruth), the public defender (Kennedy), and the white supremacist father (Turk).What Ruth does and doesn't do ends up with her being brought up on serious charges. Kennedy McQuarrie is the white public defender that takes her case. But Ruth doesn't know if she can trust her. Can Kennedy possibly ever understand what life is like for Ruth? They will need to work together. Can Ruth let go of some of the control she's held tightly to all of her life but still say what she really feels? Will Kennedy be able to face the things she learns not only about others but also about herself?As the trial also plays out in the media it starts to affect Ruth's son. Edison struggles with comments made to him in regards to the color of his skin. Some of these comments hurt even more because they are coming from life-long friends. Ruth's son is an honours student that has always stayed out of trouble. But will what's happening with his mother derail all of his plans?When I read the first sentence from Turk's point of view, I instantly hated him. I thought there was no way I would find anything redeeming in this character. We read a lot about Turk's upbringing. How he got involved with \"The Movement\" and the horrible things he had done. We also learn how him and his wife, Brittany met and the life they lived.This book took me about a week to read. Not because I didn't have time but because I just found it very hard to read at times. The time spent reading Turk's point of view were anxiety inducing. I just couldn't understand such an extreme hatred. It made me angry, sad, and uncomfortable. But maybe that's a good thing?A quote from the author's note...\"I wrote it because I believed it was the right thing to do, and because the things that make us most uncomfortable are the things that teach us what we all need to know\"I had many conversations with my daughter, mother and friends about racism and racism awareness while reading this book. So many things I didn't even realize that still go on. Not all white supremacists walk around with shaved heads and tattoos letting us know what they stand for. Now they have the internet to network and have learned to hide in plain sight and that is beyond terrifying.I thought this book was very well written. It was easy to follow the alternating points of view and the characters were so well-developed. As usual I can tell how much research went into this book. Jodi Picoult never ceases to amaze me with how she can both entertain and teach me with her books.There's so much more I want to say but I will stop here. Although \"Small Great Things\" is tough to read at times, I think it's an important read and I highly recommend it.Thank you to Ballantine Books, and Jodi Picoult for the advanced copy of this novel that I received in exchange for my honest review."}, {"userName": "Tianna", "userReviewDate": "Nov 18, 2016", "userURL": "http://www.goodreads.com/user/show/3119221-tianna", "userReview": "I have so much to say about how terrible this book is. I hated it. I hated it so much idk how I even finshed it. I don't think I've ever rolled my eyes this much while reading a book.I am a black female medical student. The whole premise of this book is completely wrong. There is no way any medical professional was allowing a supervisor's rule prevent them from saving a patient in an emergency. We swear to do no harm and to act in the benefit of the patient. This would never happen, and if it did, then of course the nurse would be guilty of negligent homicide. Ruth is guilty, idgaf what the patient's family said, you save that baby. She has a moral and legal obligation to save that baby. But the point is, that would never happen.Jodi Picoult is not black. Yet she writes in the point of view of a black woman and her life struggles. She does not know our struggle. There are so many little inaccuracies throughout the book that prove that she was not in the position to tell this story. For example, Ruth got bullied for her light skin. Are you fucking kidding me? Yes there is a division between light skin and dark skin, but dark skin is always always always on the losing side. So that pissed me off. Also, Ruth was the only black nurse in the department? Highly unlikely. Walk into any hospital esp on the east coast there are numerous black nurses. Idk if that was for dramatic effect but no. There was this part where Kennedy was like she told me about weaves and extensions, I told her about sunburns. Black people get sunburns, we know how it works like wtf.I can't even begin to talk about this damn trial. Picoult really tried, she did. But again, Ruth is the stubborn angry black woman who doesnt listen to counsel and explodes in court. Ughhh everything about this book made me so mad. I hated the little anecdotes and metaphors, hated all of the characters except maybe Violet and Edison. Also the ending was completely ridiculous. But hey it made me laugh that Britt was half black. The scariest thing about this is the prevalence of white supremacists. I mean Donald Trump is our president we have so much to fear.Maybe I'm nitpicking but all these little things add up and I got so angry while reading this because of how ridiculous it is. If anything, I hope this story inspired white people to pause and acknowledge their implicit bias.I would suggest greys anatomy for a more realistic take on a similar topic. The episode when a white male supremacist enters the emergency room and he has a nazi tattoo and refuses to be seen by non white physicians, but bailey saves his life anyway because she understands non judgmental regard."}, {"userName": "Melissa", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/9684061-melissa", "userReview": "4.5 starsThis is an incredibly heavy read—one that’s told with brutal honesty and a lot of heart.My initial reaction after I read the final page of the story—why would she choose to end things on that note? After all of the hate and uncomfortable feelings throughout this story, how could things ever possibly be wrapped up in such a way? Never. No way. I wasn’t buying it. Then, I read the earnest note from the author following the story and cried my eyes out. I felt like Jodi Picoult had crawled inside my head and answered every single burning question I had while reading this book. She even managed to give me the explanation I needed to accept the ending. Reading her thoughts and inspiration behind the story somehow validated my own feelings and made the story feel that much more real.I had no idea what I was in for when I picked this one up. We all read for a variety of reasons—to escape to a different world, to relax or maybe even to see things from a different perspective. Not every story makes me reflect on my own life, my way of thinking or gives me the opportunity to learn something about myself and the way I view the world. This is one of those rare times that a story managed to do just that. Honestly, my headspace was kind of a wreck, it took me days after finishing to even process my thoughts enough to write this review, but I know in the long run, I’m better for it. \n“Is it better knowing the ugly truth, and pretending it doesn’t exist? Or is it better to confront it, even though that knowledge may be a weight you carry around forever?”\nI believe it’s the way Jodi Picoult tells the story that makes it so powerful. She delivers a pretty provocative and harsh scenario—a white supremacist, Turk, and his wife, the princess of the white power movement, Brit, have a baby boy that has complications and ultimately dies. They’re adamant, Ruth, a black nurse is responsible; that it’s retaliation for having her removed from Davis’ care. After twenty years and a track record of being an exceptional nurse, Ruth finds herself having to prove herself—to everyone; all because of the color of her skin. The story is told from alternating perspectives—Ruth, Turk and Ruth’s public defender, Kennedy. It forces you to examine the situation from every angle, whether you agree or not. It’s enraging at times, thought-provoking, completely riveting and even sort of humbling.There are so many things that come to the surface with this one—racism, white privilege, the sad reality that sometimes hate has the power to color someone’s entire world and the feeling of not belonging . . . anywhere—no matter how hard you work to prove yourself. Racism isn’t an easy or comfortable topic by any stretch of the imagination and neither is this story. So be prepared. It’s front and center, blatantly obvious and in-your-face uncomfortable. If you’re hesitant to give this one a go, Shine is a great way to get a teeny tiny taste of what’s in store. It’s a short story from eight-year-old Ruth's perspective.Of the three characters, Kennedy was definitely the one I found myself connecting with the most. Not because we are both white women, but because of the sense of ignorance we shared on the subject of racism and privilege. Like Kennedy, I don’t consider myself to be a racist, but I don’t think I have ever fully acknowledged privilege and what it means in our society. Please don't take my words as some sort of excuse on my part, it's not, it's the honest truth. This was an eye-opening read for me, so thank you for that, Ms. Picoult. I only wish, I had read this sooner and secured a ticket to her talk here in Atlanta. \n“I’ve come to see that ignorance is a privilege, too.”\n\n“Just as racism creates disadvantages for people of color that make success harder to achieve, it also gives advantages to white people that make success easier to achieve. It’s hard to see those advantages, much less own up to them. And that, I realized, was why I had to write this book.”\n*Thank you to Random House/Ballantine Books book and NetGalley for an ARC in exchange for an honest review."}, {"userName": "Elyse", "userReviewDate": "Jul 08, 2016", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "THIS REVIEW IS SAFE TO READ ......NO SPOILERS. There is nothing in this review which isn't already suggested in the blurb. I begin with an excerpt: \"Suddenly Roarke Matthews is standing in front of me. His suit is ironed with knife-edge pleats, his shoes are buffed to a high gloss. He looks like a soapopera star, except his nose is a off-kilter, like he broke it playing football in high school. He holds out a hand to greet me. \"Mr. Bauer, he says, why don't you come with me?\" \"He leads me into an even more imposing office, this one full of black leather and chrome, and gestures to a spot on the love seat. \"Let me say again how sorry I am for your loss,\" Matthews says, like everyone else does these days. The words have gotten so ordinary in fact that they feel like rain; I hardly even notice them anymore. \"On the phone, we talk about the possibility of filing a civil suit...\" \"Whatever it's called\", I interrupt. \"I just want someone to pay for this\".  \"Ah,\" Matthews says. \" And that is why I have asked you to come in here. You see, it's quite complicated.\" \"What's so complicated? You sue the nurse. She's the one who did this.\"  Matthews hesitates. \"You could sue Ruth Jefferson,\" he agrees. \"But let's be realistic--she doesn't have a pot to piss in. As you know, there's a criminal prosecution underway that the state has undertaken. That means if you file a civil suit simultaneously, Ms. Jefferson would ask for a stay of all discovery, so she couldn't incriminate herself during the pending criminal prosecution. And the fact that you filed a civil suit against her can be used against you in a cross examination during the criminal lawsuit.\"  \"I don't understand.\" The question is.....will you understand what hit *YOU*, once you've finished this brilliant novel? IMPOSSIBLE TO PUT!!!!!!......however, I couldn't wait for a book discussion on this one.... released in stores early Oct. [SURE TO BE A NUMBER #1 BEST SELLER]So, I involved Paul, my husband...(bedtime entertainment). We had some lengthy conversations. Paul's words.. \"A 'no-win' situation from the start\". Jodi Picoult explores areas of race discrimination, race prejudice, race snobbery, anti-semitism, and injustice from every corner of the earth's hemisphere.Jodi blew my mind over a Kosher candy bar. REALLY? Who thinks like this? Geeezzzzz! Jodi continued to 'blow my mind' ... several more times before reaching the final end....until I'm thinking, \"I think like this\". This book is long enough - that in time - 'something' is bound to hook, rather triggerevery reader, on their own difficult journey to question their own morally and racial prejudice. In other words...don't be so sure YOU are so pure.Exquisitely written.....filled with grief - gets under your skin and leaves you changed!!!!Thank You Random House, Netgalley, and Jodi Picoult"}, {"userName": "Angela M", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "This is a powerful book, bold in some ways , as we have a white author bringing to us a story depicting what racism looks like and trying to tell those of us who are not black, what it feels like . But anyone who has read any of Jodi Picoult's books knows that she doesn't shy away from difficult to discuss topics. I don't think very often about white supremacists . Maybe because there hasn't been much about them in the news on a regular basis (until recently) or maybe because it's so uncomfortable to admit that there are people of this way of thinking around us that it's easier to not think about it . Lately though there has been some news attention to white supremacy as it's ugly face comes out, but the ugly face of racism is front and center in the every day life of Ruth Jefferson in this novel not just with the white supremacists portrayed here . This is what makes Picoult's new novel so relevant. An African American labor and delivery nurse, Ruth Jefferson is on trial for the murder of a newborn baby she tries to save after she was told she could not care for the baby at the request of the white supremacist parents. I couldn't help but like Ruth , a hard working widow who works hard at a job she loves to make a good life for her son. Ruth's narrative alternates with Turk, the baby's father. It was definitely uncomfortable reading what Turk has to say about black people but that's the point - showing it to us , jarring us into seeing it. A third narrative is provided by Ruth's public defender, attorney, Kennedy, who has lived a charmed life and who thinks she's up to the job and not racist. She may very well not be racist but she definitely doesn't know what Ruth is feeling. Racism is prevalent in other ways than the blatant views of Turk, in the hospital lawyer, from the police , from friends of Ruth's son, a patient thinking the white student nurse was in charge and not Ruth and worst of all for Ruth from people she thought of as good friends. The ending, the twist are a little too pat. Having said that, Picoult has done an admirable job of raising an issue that so needs to be discussed. A compelling story that needs to be read.  Thanks to Random House Publishing Group - Ballantine and NetGalley."}, {"userName": "Lola  Reviewer", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "AVAILABLE NOW!!Look up at the dark sky. See those stars? They all belong to Small Great Things.The Small Great Things at the end is not the same Small Great Things it is at the beginning, meaning that so much is happening, so much is revealed that there’s no way to read the first chapter and predict the rest of the story.Small Great Things has come a long way. So has Kennedy. So has Turk. So has Ruth. So has Edison. So has the world.That’s how it should be. Doesn’t mean though, that we’re at the finish line yet. Small Great Things definitely proves that we aren’t.Jodi Picoult’s new book didn’t make me realize how naïve I was—Michelle Alexander did with her talk on mass incarceration in the US. But while my eyes were wide due to Alexander’s revelatory comments on today’s caste system, this book opened them even wider thanks to Ruth’s honesty, Kennedy’s character-development and Turk’s sole existence.There are some scenes in this book that seem ‘‘too good to be true,’’ especially the ones related to Adele and the judge at the end, but it doesn’t make the subject of racism less authentically dealt with.Of course, this book made me angry... and that’s good. This means what happened to Ruth affected me. It’s unjust. It’s unfair. It’s inhumane. But what’s surprising is, though I completely hated Turk for suing Ruth, I still questioned whether Ruth was right to hesitate, and whether Turk was redeemable, and whether someone else beside Ruth should have been blamed.We should question situations. It’s not because something seems completely wrong to us that we shouldn’t dig deeper on the subject; consider someone else’s opinion on the matter, which is why I’m so happy with the fact that this book is narrated by Ruth, Kennedy AND Turk.A truly impressive story with great attention to detail and incredibly intense scenes at court.Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Brina", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "Jodi Picoult has been a best selling author for over twenty years. Twenty years ago she wanted to discuss a hot button issue but did not feel like she had the platform to do so. About a year ago, Picoult read where a black female nurse in Flint, Michigan had been dismissed by a white supremacist patient over skin color. Feeling that the time was right to discuss race, Picoult used this court case as a basis for Small Great Things, her current best selling novel. Ruth Jefferson has been a labor and delivery nurse for over twenty years. On one snowy Saturday, she is assigned to Davis Bauer, the child of Turk and Brittany Bauer. When the parents see Ruth, they go ballistic because they are members of the Aryan movement and do not want someone like her touching their baby. Reassigned, Ruth is enraged but does her job, yet by doing her job to the fullest, Davis Bauer dies in her care, or so it seems. The parents automatically point to Ruth, her license is revoked, and the drama begins. Picoult alternates the novel from the points of view of Ruth, Turk, and Kennedy McQuarrie, Ruth's attorney. Employing flashbacks and the present day narrative, Picoult creates rich, multi layered characters who all bring varying perspectives on the rap on race to the table. Ruth- who has been building up rage her entire life by having to fit into a white society that does not accept her. Turk- who believes the white superiority movement from a young age and has just as much rage inside him. Kennedy- a middle class, caucasian lawyer who has enjoyed white privilege for her entire life and has not realized it until taking on Ruth's case. Adding to the tapestry of the novel are supporting characters who bring their own views on race to the table, creating a rich story. While an enriching story, I did find some parts cliched. Additionally, while the story is captivating, the prose is limited and straight forward. This makes for a fast reading novel, but one that most likely will not win awards for its literary prowess. Yet, Picoult weaves an intricate cast of characters, making it easy for me to like Ruth and just as easy for me to detest Turk and Brittany and their followers. As a result, I quickly read through the pages to find the end result to Ruth's case. Easy reading women's literature is not a genre I generally subscribe to. Many of my goodreads friends had read Small Great Things and I was curious about the story. Even through Jodi Picoult has been writing best sellers for over twenty years, she did not have to write about race, just as Kennedy did not have to take on Ruth's case; this takes courage. Basing her title on a famous quote by Dr Martin Luther King, Picoult does take on this issue that still dominates headlines. Despite the cliches and some obvious story lines, I found Small Great Things to be a thought provoking read that had me exploring many sides of the race debate in this country. An easy read that I read in a better part of a day, I rate Small Great Things a solid 3.75 stars."}, {"userName": "Debbie", "userReviewDate": "Oct 03, 2016", "userURL": "http://www.goodreads.com/user/show/8665845-debbie", "userReview": "[I don’t buy that Ruth would ever say, even jokingly, that the baby should be sterilized. I don’t buy that the hospital would actually put a note on the baby’s chart saying that no blacks could go near it. I don’t buy that Ruth got so mad at Kennedy during the trial when Kennedy was doing everything possible to help her. I didn’t buy that Kennedy ended up understanding Ruth’s anger. I didn’t buy that Ruth would insist on going on the stand when it clearly would hurt her, and her lawyer had advised against it so strongly. (hide spoiler)]"}, {"userName": "Will Byrnes", "userReviewDate": "Nov 10, 2016", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "…every baby is born beautiful.It’s what we project on them that makes them ugly.\nA drop of water is a tiny thing. Only a twentieth of a gram. It takes almost six hundred drops to make an ounce, and a hundred twenty eight ounces to make a gallon. That gallon is eight pounds of weight. You can feel the weight of water when you stand on the beach and try to hold your place as waves push you back. It takes only six inches of moving water to take control of your car. If you could stand underneath Niagara Falls you would be pummeled to death by over seventy five thousand gallons, over six hundred thousand pounds a second. Accumulate enough drops and it can carve the earth, move massive objects, or crush a life that gets in its way. Just as the Niagara cascade can be seen as the result of many, many drops of water accumulating to a thunderous, powerful force, so too, many small and not so small race-based slights amass to create a deafening, crushing reality. Jodi Picoult- from Time, Inc. One of the inspirations for Jodi Picoult’s Small Great Things was a quote from Martin Luther King: “If I cannot do great things, I can do small things in a great way.” She explains in the Author’s note that follows the novel that she knew that characters in the book would “have moments …where they do a small thing that has great and lasting repercussions for others.” While there are plenty of positive small things that take place in the novel, the primary significance is the accumulated impact of the negatives, and trying to gain the vision needed to perceive, and hopefully, address them.Ruth Jefferson has been a Labor and Delivery nurse in a Connecticut hospital for twenty years. But when a white supremacist couple, Turk and Brittany Bauer, demand that no African American personnel touch their newborn, the hospital goes along. Staffing levels being what they are, Ruth is placed in an untenable position, left alone with the infant when he goes into distress. Catch-22 accomplished. Leave the baby alone and violate ethical norms, or attempt to save the baby and violate the order for her to keep her hands off. I see Taraji Henson as Ruth - image form Philly.comWhat follows is a complicated legal and personal tale. Picoult wrote the book to try to encourage fellow white people to see how racism manifests in myriad ways. This is particularly intended for people who might never see themselves as racist. We trail Ruth as she is victimized by a cruel system. Kennedy is her white lawyer, a liberal with no notion of her own personal biases. Picoult also shows us Turk and Brit, the skinhead couple who spark the conflict.We see some of how Turk and Brit became the way they are, and get an image of what the lives, worldviews, and tactical considerations are of people in this extreme end of society. Kennedy struggles with her own actions and perceptions. She is our avatar here, feeling righteous, but learning how racism pervades in unsuspected ways, getting educated by Ruth to the reality of pervasive discrimination.\n Old Skinheads don’t die. They used to join the KKK, but now they join the Tea Party. Don’t believe me? Go listen to an old Klan speaker and compare it to a speech by a Tea Party Patriot.\nThere is a steady drip, drip, drip of small racial insults that Ruth endures and recalls. Her son gets a taste as well. If you can think of a racial slight, Picoult has incorporated it here. She uses not so much a broad brush as a steamroller to make sure we get the embedded significance. This is not a subtle book. But while it may use a very direct method, there is much here that shows the author’s skill. She does not, for example, settle solely on white on black bias.Can Leslie Jones play Adisa? Please? - image from Cnet\n My mama used to tell a story about how, once, she was pushing me in a stroller in our neighborhood in Harlem, and two black ladies passed her. One of them said to the other, She walkin’ around like that her baby. That ain’t her baby. I hate when nannies do that. I was light-skinned, compared to Mama. She laughed it off, because she knew the truth—I was hers, through and through. But the thing is, growing up, it wasn’t the white kids who made me feel worst about myself. It was the black kids.”\nRuth is warmly and fully drawn. It is very easy to relate to her strength, determination and vulnerability. Her particular circumstances may be alien to most white readers, but there are similarities in how whites struggle with class that will give Ruth’s experiences resonance. Most of all, Ruth is a good person, and anyone, of any color or background, can relate to that, and hope for her to come through it all ok. This portrayal of Ruth is the strongest element in the book.I totally see Grace Gummer as Kennedy - image from Hollywood reporterSecond is the legal wrangling. It is pretty clear that Picoult is on firm ground here, as her depiction of the lawyerly digging, evaluation and perspective feels very well-informed. The legal strategies discussed make sense, the approaches are defensible, and the courtroom portions of the book race along with the speed of a thriller. Picoult does a pretty good job of pointing out where a lawyerly perspective can be at odds with the actual content of a case. Kennedy tells Ruth, \nAny public defender will tell you that even though the majority of our clients are people of color, you can’t play the race card during a trial.  That’s because it’s sure suicide in a courtroom to bring up race. You don’t know what your jury is thinking. Or can’t be sure of what your judge believes. In fact, the easiest way to lose a case that has a racially motivated incident at its core it to actually call it what it is. Instead you find something else for the jury to hang their hat on. Some shred of evidence that can clear your client of blame, and allow those twelve men and women to go home still pretending that the world we live in is an equal one.\nOJ might disagree about the effectiveness of using race in a trial.  How about Shannon Woodward for Brit Bauer?  - image from Rotten TomatoesPicoult draws on real-world situations for her tale. A labor and delivery nurse in Flint, Michigan really was asked to not touch a racist’s infant. A significant portion of her skinhead character Turk was based on a real-world bigot. Check out the link in EXTRA STUFF for more on this one. It is pretty interesting.This is not a great literary novel. You will not be dazzled by poetic description, or impressed by literary artifice. It is a straight ahead tale told very effectively and is intended to deliver a specific point. It succeeds quite well in that aim, and gives us some very human characters to engage with while on that journey. I do not know what it is like to exist inside a black skin in 21st century America. Never could, never will. But Jodi Picoult is trying to give people like me a bit more of a clue what it feels like to have that experience. I do not have a basis for saying how well that succeeds. But, like the force that accumulates from the many small, great things that conspire to destroy, maybe Picoult’s book offers one more small great thing that, when combined with many other small great things can generate a force large enough to cascade down on our long national original sin and help clear the way for a better tomorrow. Published – October 11, 2016Review – November 11, 2016PS - I have zero intel on a movie option for the book, but cannot believe this one has not already been snapped up. While I had some pretty firm images in my head for actors in certain roles, I came up blank for others, Turk, for example. Gerald McRaney for Francis Mitchum, popped to mind, but he might be a hard sell playing someone as much younger as the character is.=============================EXTRA STUFFLinks to the author’s personal, Twitter, Instagram, Pinterest and FB pagesIn this NPR interview, Picoult talks about things that inspired her to write this novelThere is a nice bit in Picoult’s site about how she researched her skinhead characters.\nThen I met with two former skinheads, to develop a vocabulary of hate for my White Supremacist character. My daughter Sammy was the one who found Tim Zaal – a former skinhead who had Skyped with her class in high school. Years ago, Tim beat up and left a gay man for dead.\n April 28, 2016 – A lovely bit of data gathering from the Washington Post -  The most racist places in America, according to Google - by Christopher Ingraham - It might suggest some places where you would prefer not to live. Please check out, The Forgiveness Project. While Zaal’s tale is not specific to racism, it is very much about bigotry and fascistic violence."}, {"userName": "Susanne Strong", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/4514828-susanne-strong", "userReview": "4.5 StarsSmall Great Things. Powerful. Thought-Provoking. Heartbreaking. Ruth Jefferson is an L&D Nurse with 20 years of experience, working at a Hospital in West Haven, CT. She gets along well with all of her colleagues and all of her patients love her - that is until she assists Turk Bauer and his wife Brit with their new baby Davis. Turk and Brit are White Supremacists and they don't want Ruth touching their baby because she is black. Due to their feelings, Ruth is ordered by her supervisor not to care for baby Davis Bauer, though it goes against her medical training. Further, Ruth feels that she has been discriminated by the hospital due to her race but she is warned not to play that card. The next day, Davis goes into distress, with Ruth watching over him in the nursery as no other nurses available but she isn't supposed to touch him - which goes against every fiber of her being. When others arrive, she is given instructions to conduct chest compressions. Nothing works and Davis Bauer doesn't survive. Turk and Britt Bauer blame Ruth and they file a lawsuit. The hospital does whatever it can to protect itself and Ruth becomes the scapegoat. As she can't afford an attorney, she is assigned a white female public defender, Kennedy McQuarrie. While the two don't always see eye to eye, Kennedy does whatever she can to save Ruth from life in prison. The story alternates between Ruth, Kennedy and Turk’s POVs. For me, Turk’s was the hardest to identify with. I couldn’t find sympathy for him or his wife Brit and pretty much despised them. I know I’m not alone here. I identified most with Kennedy. Not just because she is white as am I. I work in the legal field and I understand her mind and get why she did the things she did and instructed Ruth the way she did. That said, I loved Ruth. Her grit. Her strength. Her smarts. Her unwavering beliefs. I personally thought Jodi Picoult did a great job writing about an incredibly tough topic, though I would venture to guess that if I were black, I might have another view of this book. It is impossible for us to put ourselves, in someone else’s shoes. All we can do is sympathize and empathize. In the case of race, it is almost impossible. The only possible similarity in my mind is bullying, though I could be wrong. Here racism was brought to the forefront in a myriad of ways. It is in your face. Except for in the news, I hadn't read about White Supremacists previously. To be frank, it's not a topic I want to know much about. People like Turk make me uncomfortable. I would rather pretend he doesn’t exist. Like I said in my first post, I grew up in an affluent town bordering New Haven that was mostly white, and predominantly Jewish (I am not Jewish) from the ages of 7-24 years old. In my 30's I worked in Hartford for three years and I have lived in Connecticut for 36 of my 43 years. I feel ignorant in saying that until reading this, I did not know that White Supremacy groups existed in towns near me. In admitting this I guess you could say that I have led a sheltered life. Now it's possible that pockets don't exist quite near me and that the story just took place in CT (but my thinking that would be terribly naïve) and I'm certainly not going to google white supremacy in CT for fear of being “tagged” or something. That said, maybe this goes on in all of our neighborhoods and I personally never opened my eyes and noticed it. Like I said, rose colored glasses. I think this books point is to make us question our own behavior. And to make us more aware of how we treat others. And in some small way, perhaps effectuate change.Now, forgive me but a few things about this novel really bugged the heck out of me. I happen to work in the legal field and I have a working knowledge of that as well as the Connecticut Superior Court System and there were in fact several things that were inaccurate. There is no way that the Mercy-West Haven Hospitals’ Risk Manager, Carla Longo, (who was an Attorney) would immediately throw Ruth Walker under the bus when confronted by Turk Bauer. I believe that she would have stated that the matter was under investigation and that she needed to confer with outside counsel. The issue of whether Ruth was covered by the Hospital's malpractice insurance policy and/or whether she had her own malpractice insurance was never addressed and may have protected her. WTH! In addition, there were several procedural errors about the New Haven Superior Court System and the trial procedures, (scheduling of oral argument, the timing for the distribution of juror lists, etc.) which could have been verified by simply calling the Superior Court Clerk and the Jury Clerk. Lastly, the ending ..well, it was unrealistic. I will leave it at that. Forgive my nitpicking - but since I have intimate knowledge the above referenced things, I just can't help myself. Because of these issues, I had to deduct .5 from my rating, (thus giving it 4.5 v. 5 Stars). That said, the storyline itself was phenomenal. Jodi Picoult tackled a sensitive topic with extreme grace (as she always does). The characters jump off the page. You are immediately immersed in their lives and nothing else matters. Small Great Things has left me with a heavy heart. I expect to carry it around with me for a long time to come. Published on Goodreads and Amazon on 4.23.17.***Initial Review Posted 4.23.17 at 11:30 a.m.Trying to find the words. Finished this Friday and am still stunned. I grew up in an affluent town that borders New Haven, CT and worked in Hartford for 3 years in my early 30's. This book opened my eyes to issues that I have never seen. I realize that I have looked at the world through rose colored glasses (and I have always considered myself a realist)."}, {"userName": "Jen", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/27709782-jen", "userReview": "I had a heavy heart starting this and it got that much heavier as I read. As much as it was not uplifting, there were moments of beauty here that made my heart swell.This is a story about racism told from 3 perspectives: A black nurse not sure what choice to make; A skinhead who is sure of his choices; a defense attorney who is questioning her own choices.A tough theme that still exists, sadly, in our culture. It's about justice - or injustice - and how is this defined? It's about the loss of life which is a no win for anyone.We are given 2 sides of the story: the white one and the black one. How each group is perceived and the emotions tied to them. It's not just about hate. It's how it is taught and embedded in lives from an early age and the differences that even today exist about inequality. One GR friend mentions thought provoking. It is. It spins you from one side to the other and the reader can clearly see why and what the other feels. Is it right? Wrong? Depends from which angle you view it. Picoult, you take daringly tough themes and write them from a place that has clarity or are you blurring the lines? A reminder these misperceptions still exist and society has not yet successfully bridged those gaps and narrowed those chasms. You give us insights that are frighteningly real and remind us that history can still burn in our hearts and cause us to behave in ways that are more emotional than factual. 4****"}, {"userName": "Lori", "userReviewDate": "Oct 08, 2016", "userURL": "http://www.goodreads.com/user/show/3332895-lori", "userReview": "This was a 'beast' of a novel for me... not in the sense that it was long, but in that it was a difficult topic. I, like Picoult, think of myself as not discriminating in how I treat people, however, the issues this novel raises had me questioning that. A very thought provoking novel that I think people need to read. As uncomfortable as it may be, these issues need to be raised and reflected on. We can all do \"small great things.\""}, {"userName": "Mischenko", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/1194517-mischenko", "userReview": "Once again, a great read from one of my favorite authors. The story felt very authentic to me and the topic, I'm so glad she covered. Tons of emotion. I listened to this on audible and enjoyed all the narrators. I've read every one of Jodi's books and this is definitely one of my favorites. Very important authors note at the end..."}, {"userName": "Berit☀️✨Traveling Sister✨", "userReviewDate": "Jul 12, 2016", "userURL": "http://www.goodreads.com/user/show/38946743-berit-traveling-sister", "userReview": "5 Real, raw, and brilliant stars 🌟🌟🌟🌟🌟This book is one of my top Reads of 2017 ......I read this book last January and it still sticks with me today, really a truly powerful story!Jodi Picoult definitely writes books that make you think....Not even sure where to start with this.... there is so much I want to say, but I don't want to ruin it for anybody... The story was told from three different POVs... Ruth a nurse.... Kennedy A lawyer..... and Turk The white supremacist... I think the author did a good job with this, a good job of showing where everybody was coming from... The characters were extremely well developed and for obvious reasons not all of them were likable.... it’s not always easy to give a voice to a character most people will hate, but I really think this was done very well.... Ruth was always trying so hard to be perfect.... to be excepted.... I don’t think she realize this, she never really took the time to embrace who she really was... I really had so much compassion for Ruth, I just wanted to give the girl a hug! I wanted to tell her how amazing she was and that she definitely was more than good enough! Kennedy was very idealistic.... chose to believe like a lot of us do that she did not see color..... her intentions were so good, but I don’t always think she saw the world as it truly can be..... turk was just filled with so much hate and so much anger.... I had a very hard time feeling any sympathy for him.... hate it just seems like such a waste of energy to me, it is just something I will never understand... I found a lot of aspects of the court case very interesting... especially jury selection, I always find that very fascinating... all the psychology that goes into selecting the jury, especially in a case like this.... every part of this book was just so perfect... the beginning... the middle... and the end... I just would recommend it to everybody, it is eye-opening and real.....On a personal and emotional level this hit me I grew up in a multi racial family... of my siblings I am the only one that is white.... and even though I definitely did not grow up prejudiced... I was always aware of people's differences, because even though we grew up in the same house...in the same Socio economic situation.... we were not always treated the same... I will never know what it is like to be anything but white... but at a young age I recognized somethings were a bit easier for me because I was.... that is the unfortunate reality.... and this book just did a very good job of explaining and portraying that.... I strongly recommend this book to everybody! 🎧🎧🎧 you can find my review on the audio narration as well as all the other reviews from my partner in crime and me on our new blog... https://audiokilledthebookmark.com/"}, {"userName": "Brian", "userReviewDate": "Aug 22, 2016", "userURL": "http://www.goodreads.com/user/show/854699-brian", "userReview": "-This Review is Based on an Advanced Reading Copy-- A woman with frizzy hair stands in front of a giant wheel. On this wheel are many many social issues. She glances at the wheel and smiles and then begins to spin it, waiting for her inspiration. The wheel spins around and around and finally lands on “Amish.” The woman frowns a bit and realizes that she had already covered that topic. She spins the wheel again. “School Shooting” appears in the crosshairs. She frowns again and stamps her feet a bit. She spins it a third time. The wheel lands on “White Supremecist.” She goes over to her main character wheel and spins this one and it lands on “African American.” Finally, she goes to her third and final wheel, the technobabble wheel. She recalls that the last time she wrote a book, she researched elephants so when she spins the wheel, she hopes to get another topic. The wheel stops on “medical” and she smiles to herself.In “Small Great Things,” we meet Ruth, a delivery nurse who works at a busy hospital. She stumbles upon a patient named Turk whose wife is pregnant. When Ruth goes to check on her patient, the father, Turk, he says that he doesn’t’ want an African American woman touching his child. But when a medical crisis arises, Ruth must decide whether to intervene or not. What follows is your typical Jodi Picoult plotline involving lawyers, courtroom drama and the twists and turns that we have come to depend on in a Jodi Picoult plot. Jodi spent her time researching the lingo involved in being a maternity nurse and she saturates the reader with technical terms that will confound anyone except for those in the medical field. On the topic of Turk, the white supremacist, it’s an interesting take on having a character whose perspective is so rooted in hatred and ugliness. I didn’t like this character, nor care about their fate but I thought it was definitely an interesting, if not dull choice. The stuff that was included on what this character did in his life and the arc that the author took him on really felt a bit disconnected.Overall, the characters in this novel are nothing remarkable or special. Jodi Picoult has gone back to her tried and true formula that she has used so many times: choose a social issue that is guaranteed to raise eyebrows, do the research to make it sound like you know what you are talking about, and present it in an overly long novel that feels like the plot of a TV movie that you thought you had seen and seems so familiar, but must be new."}, {"userName": "Esil", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "A high 4 stars. I've had mixed experiences with Jodi Picoult. I've loved some of her books, and found others to be real duds. This one goes in the positive pile. Picoult typically picks a social issue, creates a crisis situation and tells the story from the perspective of a few characters caught up in the crisis. When her books work, it's because she is able to create powerful characters who give real dimension to the issues the books grapple with. Small Great Things is one that worked for me -- but I have no doubt that it will stir up controversy. Ruth is an African American nurse who is instructed by her supervisor not to touch the new born baby of a white supremacist couple at the parents' request. The baby dies and the blame falls on Ruth. The story is told from the perspectives of Ruth, her white lawyer Kennedy and the baby's father. A central theme in the book is Ruth's lawyer's ability to understand and speak on behalf of Ruth. Which is ironic because the same question looms over Picoult's book. How can a white author speak of the experience of racism on behalf of her African American character. Picoult doesn't answer this question perfectly, but at least she rolls up her sleeves and gets involved in a conversation about racism, and it's an important and timely conversation. While at times I could feel Picoult struggling a bit with how best to pitch the conversation, I loved Picoult's depiction of Ruth, and the evolving relationship between Ruth and her lawyer. I wasn't as engaged with the depiction of the white supremacist father and the way in which his story is resolved. But the book still worked for me as good fiction that made me think and feel. Thank you to Netgalley and the publisher for an opportunity to read an advance copy."}, {"userName": "Luffy", "userReviewDate": "Dec 23, 2016", "userURL": "http://www.goodreads.com/user/show/7407364-luffy", "userReview": "Jodi Picoult is a daring, talented author who knows how to write new stuff about age old controversies. She can write a male or female character with equal ease. In this book, she writes about Ruth, her grown son, and Jodi Picoult writes from the point of view of the racist father (I thought the 'clan' KKK would be prominent in this book), and her white lawyer who took up her case, Kennedy.Jodi Picoult obviously believes that God is in the details. She cares for each sentence so much, that, she must have weigh them carefully before dosing her language and putting pen to paper, and later ink to paperback.I enjoyed this story extremely so. But it didn't gain 5 stars, because some of the reactions are too politically correct. This is particularly true when Ruth is interacting with her son. The ending is too pat. Also Turk is an overdeveloped character. He is like Daniel Day Lewis was in Gangs of New York. Apart from that, I have no bone to pick with this quite superlative book."}, {"userName": "Cheri", "userReviewDate": "May 25, 2016", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "NOW AVAILABLEWe all have “preferences.” Men, women have a “look” they are drawn to. Blondes. Brunettes. Redheads. Tall. Short. Blue eyes. Skinny. Muscular. Even children, infants, long before they can understand or form words develop preferences, for people, sounds, and colors.Color, the preference for specific “colors” is at the heart of this novel, or more specifically the intolerance for people who are a “different” color, or a “different” religion, a “different” lifestyle. Race, discrimination, hate crimes against people of a certain faith, a certain lifestyle have been in the headlines, on the news on a regular basis. Maybe not “where you live,” but we all live “here.” This place. This planet. We like to think that these things are rare, that they don’t affect others on a continuing basis. We don’t see it when it doesn’t happen to us – if it did, we’d certainly be less blind to it than we are. I have read several of Jodi Picoult’s novels, and I’ve noticed in the ones I read that they all have tackled different areas where we need to be enlightened, and I have felt they’ve been a little better each time than the previous one. This is no exception, for me this is her best book that I’ve read. “Small Great Things” is astonishingly good, a parable for our times. Pub Date: 11 October 2016Many thanks to Random House, Netgalley, and to author Jodi Picoult for providing me with an advanced copy"}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "Jodi Picoult is by far my most favourite author! She has done it again! The subject matter at times was hard to read as the story being told was very heartbreaking and disturbing but it was executed perfectly. This author always makes me think and I have always learned something new from reading one of her novels. The novel was told in three voices that of Ruth, Kennedy & Turk. All three were very strong characters which all brought life to this story.I love how Jodi Picoult finishes the storyline nothing is left out and as you read that last page you are feeling like wow, that was really satisfying & extremely good. Sometimes I need a neat ending and this was one of those times!Bought this one through Amazon so being a hardcover it had that wonderful new book smell which I find totally irresistible!It was a steady paced, thought-provoking, and quick read with a very satisfying ending.All of our Traveling Sisters Reads can be found on our sister book blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "*TANYA*", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/29049556-tanya", "userReview": "OUTSTANDING!!!! This book is one of those books that is educating, jarring and inspirational. Kudos to Jodi for taking on the topic of racism and opening my eyes to things I wasn't aware of. I most definitely was schooled.\"If I cannot do great things, I can do small things in a great way.\""}, {"userName": "Carol", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "[At Ruth’s mother’s funeral the choir sings her mama’s favorite hymns, “Take My Hand , Precious Lord”, and “I’ll Fly Away.” I love both of these. Gospel music has always resonated with me. I can remember walking by one church in a Black neighborhood on Sunday mornings and hearing those voices lifted up to God. I wanted to be in that church with those people but it was forbidden. Not by the congregation but by my parents. Ruth repeats what those trying to bring her comfort say:“She looks like she’s at peace,” I hear, over and over. Or “She looks just like herself, don’t she? Neither one of these is true. She looks like an illustration in a book, two-dimensional, when she ought to be leaping off the page.”This passage nails the grief we feel when we have lost a loved one, a universal one.  (hide spoiler)]"}, {"userName": "Lauren Cecile", "userReviewDate": "May 02, 2017", "userURL": "http://www.goodreads.com/user/show/21468256-lauren-cecile", "userReview": "Six stars!Jodi Picoult has written an outstanding book and shows a keen insight into race, racism and race-related issues. The newborn baby of a white supremacist couple dies during the care of a respected black nurse who'd been told by her boss that she was not to \"touch\" the baby. She is subsequently dismissed from the hospital, charged with murder and represented by rookie public defenders at a tumultuous jury trial. Picoult weaves in just enough backstory to explain the motivations behind the main characters' thoughts and actions. All the voices were distinct - the black woman, the white woman and the male white supremacist. It does take extensive research and speaking with \"others\" to write in an authentic voice. I experienced the same thing writing my novel Eyes Like Mine which features a young, Jewish man. By contrast, the author of The Help, made her black maid characters sound stereotypical, inauthentic and silly - it was condescending. As with many Picoult novels, there is always a dramatic twist. I thoroughly enjoyed the way the story unfolded and was satisfied with the ending."}, {"userName": "Karen", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/12851291-karen", "userReview": "3.5This was surely a timely and serious book. I did however, find it to drone on and on, so I found myself skimming through much of the book."}, {"userName": "Taryn", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/1334938-taryn", "userReview": "Justice will not be served until those who are unaffected are as outraged as those who are. —BENJAMIN FRANKLIN\n\nRuth, a black nurse, is forbidden from caring for a white supremacist's newborn. An unfortunate set of circumstances leads to Ruth being left alone with the baby for a short period of time. The baby goes into cardiac distress under her watch and she hesitates. The infant's file strictly states that African American personnel aren't allowed to care for the baby. Should she follow orders or intervene? When the baby dies, Ruth is held responsible and a difficult legal battle ensues.\nBabies are such blank slates. They don’t come into this world with the assumptions their parents have made, or the promises their church will give, or the ability to sort people into groups they like and don’t like. They don’t come into this world with anything, really, except a need for comfort. And they will take it from anyone, without judging the giver.I wonder how long it takes before the polish given by nature gets worn off by nurture.\nThere are three alternating perspectives in this book:• Ruth has done everything \"right\" in her life, yet she is suddenly about to lose everything. People who she thought were her friends are quick to turn their back on her or dismiss her experiences. The situation forces her to view all the events of her life in a different light. \"I was never a member of any of those communities. I was tolerated, but not welcomed. I was, and will always be, different from them.” She feels frustrated and distrustful, as her whole world is turned upside down.• Turk, a white supremacist, is overwhelmed with grief over the loss of his baby. He finds a perfect scapegoat in Ruth. I have to give the author credit for this character. I hated being in his chapters so much that I had to keep checking to see how many minutes I had left! Not only do Turk and his wife have abhorrent thoughts, but they also commit violent acts. Some of the most interesting parts of Turk's chapters were the details about the movement's attempt to blend in with the general population, their recruitment methods, and the exploration of what causes a person to become so full of hate. Turk has some humanizing moments: the grief over the loss of his child, elements of his and his wife's love story, and a reminiscence about a stint in jail. It shows he has the capability for love and compassion, so maybe he's not a complete lost cause.• Kennedy is the white public defender that takes on Ruth's case. Kennedy sees herself as \"color-blind,\" but Ruth's case is a big learning experience for her. She becomes more aware of her own blind spots and how much she has taken for granted. Her character growth is the central focal point. Her voice is the most natural of the three.Ruth's confusion was understandable in this no-win situation. I found this news article about patients refusing care from nurses and it's just as confusing in real life! Ruth's supervisor Marie made a major judgment call without establishing any protocol. Turk seems more horrified by Ruth performing CPR on his son than he is at her hesitation. His fixation on CPR especially annoyed me, especially because I knew how it was going to play out in court. The villainous risk management lawyer Carla Luongo wasted no time making Ruth the scapegoat with absolutely zero subtlety. She only appears twice in the beginning, but she annoyed me enough that I still remember her!\nIt is remarkable how events and truths can be reshaped, like wax that’s sat too long in the sun. There is no such thing as a fact. There is only how you saw the fact, in a given moment. How you reported the fact. How your brain processed that fact. There is no extrication of the storyteller from the story.\nIf you are wary of Jodi Picoult, I'll warn you that it is still very Picoult-ish. However, I liked it so much more than My Sister's Keeper. I decided to read it because of the fantastic reviews and I can't resist the medical/courtroom combo. I love a dramatic legal battle and Picoult certainly delivers! The jury selection and courtroom scenes were my favorite parts. It was interesting how the issue of race had to be tiptoed around so that the people who held so much power over Ruth's fate wouldn't get uncomfortable and hold it against her. I also liked how the \"days of the week\" argument tied in.\n\"Equality is treating everyone the same. But equity is taking differences into account, so everyone has a chance to succeed.” I look at her. “The first one sounds fair. The second one is fair. It’s equal to give a printed test to two kids. But if one’s blind and one’s sighted, that’s not true. You ought to give one a Braille test and one a printed test, which both cover the same material.\"\nThere's an occasional made-for-TV/after-school-special quality that prevents me from being overly enchanted. Picoult has a message to get across and it's not always subtle. Ruth's sections feel stuffed with everything Picoult wanted to make me aware of and Ruth's voice didn't always sound natural to me. I was always jolted out of the story by the portrayals of the supporting characters, such as her politically-aware sister and her son Edison (who does a complete 180). But for every scene I thought was heavy-handed (Ruth and Edison's dinner with Kennedy's family), there would be an authentic scene (Edison being dissuaded from asking a girl to the dance). I didn't always buy Turk's voice either. He was either rough-around-the-edges or thoughtful and poetic at any given moment. Most of all, the ending irritated me! She set it up well and I knew it was coming, but it was so over-the-top. Even with all that, this book still made me feel strongly. I felt so angry for what was happening to Ruth!\n It is amazing how you can look in a mirror your whole life and think you are seeing yourself clearly. And then one day, you peel off a filmy gray layer of hypocrisy, and you realize you’ve never truly seen yourself at all.\nIn the author's note, which is also available at her website, Picoult explains why she wrote this book and reveals details about her extensive research. I appreciate that I can recommend as a \"gateway\" book to the topic of racial bias and white privilege to people who might usually get defensive at the mere mention of race. (Not awesome, but it's a thing.) Small Great Things challenges readers to confront their own bias and privileges. It discusses the extra institutional hurdles to some Americans have to overcome. It's hard to fix something that a majority can't admit exists, but this book shines a light on how the typical white experience is not universal. It also highlights the difference between active and passive racism. Turk is obviously a racist, but racism and racial bias aren't always so visible. It could be as simple as silence or refusing to believe racism exists; after all, it leads to the same result as active racism. I know that I've been guilty of being silent and this book made me reflect on how damaging that behavior can be. \nWhat if the puzzle of the world was a shape you didn’t fit into? And the only way to survive was to mutilate yourself, carve away your corners, sand yourself down, modify yourself to fit? How come we haven’t been able to change the puzzle instead?\nSmall Great Things is a thought-provoking book that is especially effective as an introduction to issues of racial bias and white privilege. I appreciate Picoult using her influence to educate people on something they may not be aware of and her book will provoke interesting discussion. I highly recommend reading Roxane Gay's awesome analysis of this book.If you would like to read more about the topics addressed in this book, you might be interested in Unfair: The New Science of Criminal Injustice by Adam Benforado (audiobook is available on Hoopla), You Can't Touch My Hair: And Other Things I Still Have to Explain by Phoebe Robinson, and Citizen: An American Lyric by Claudia Rankine (audiobook is available on Hoopla, 1hr 37min)._______________I received this book for free from NetGalley and Ballantine Books in exchange for an honest review. This does not affect my opinion of the book or the content of my review. The publication date is October 11, 2016."}, {"userName": "Suzanne", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/11889829-suzanne", "userReview": "I left it too long post reading to write this review. This is possibly a 4 star read for me. It is hard to rate. I listened to the audio. The narrator of Ruth made this for me. The voice was strong, calm and in control. The hard part for me is that it is written by a white woman, telling a story of a black woman's life. The author adds notes to the end of this book, and in this instance considering this is an audio book, is read by the author herself. She is passionate about this book, and it is her favourite. It appears that she is passionate about race equality herself. She is that passionate about it that I guess she feels she is able to voice herself as Ruth. I just don't know about this confidence. But who am I to question anything? It is a hard one. I do feel she is a tad 'preachy' in her author notes. The story wrapped up too neatly, with lots of lessons learned by everyone. Namely, the white supremacist was the one I grappled with the most. But again, the author states in her notes that she got to know many people over the years that she has loosely based some turns of events here. I am glad the real life man made amends but the story ending I had some trouble with. I am no way experienced in the life of minority groups in any way, I think this really is a hard one for me to review. Perhaps I thought Ruth's story wrapped up a little tidily too? Obviously I enjoyed the book, but it's one that leaves you thinking. I dare say  Jodi Piccoult  planned this all along."}, {"userName": "Jennifer", "userReviewDate": "Oct 25, 2016", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "[why the hell didn't anything ever happen to the hospital in terms of responsibility (hide spoiler)]"}, {"userName": "Wendy", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/1418580-wendy", "userReview": "In Small Great Things the author, Jodi Picoult, writes about race, prejudice, compassion and justice. This story made me so angry and if it can make me feel emotion like that then I loved it!Some of the content is difficult to read but in order to grasp the message the author is sending you must read it all.Captivating, insightful and very well-written.It is easy to see why Jodi Picoult is one of my favourite authors!ReRead Nov 2017"}, {"userName": "Iris P", "userReviewDate": "Nov 21, 2016", "userURL": "http://www.goodreads.com/user/show/2641948-iris-p", "userReview": "“I received an ARC of this book from the publishers via NetGalley in exchange for an honest review, thank you!”In many ways Small Great Things is a quintessential Jodi Picoult novel. She uses a well-known formula in her writing: controversial topics, well develop characters and intense, sometimes over the top court scenes. Add some humor plus a few quirky characters and she has the reader ready to tag right along and stick with the story until the end.But boy what an appropriate time to have this particular book published, talk about a story that jumps right out of the headlines.No doubt Picoult knows how to write a good, smart drama, but kudos to her for having the courage to tackle so many difficult topics head on. Her take on issues such as racism, anti-semitism, white supremacy, the justice system and labor discrimination, is both nuanced and compassionate. It's also easy to appreciate the level of research the author puts in the novels she writes as well as the empathy she shows for every character, even for the \"bad\" guys. And there are some very bad dudes in this story.I thought Picoult was particularly careful not to dehumanize these characters by depicting them as caricatures, but as human beings that even when representing the worst of our instincts (believing that you are superior to another person based on racial differences for example), can still be redeemable at some point.At 16+ hours you might fear the audiobook would be boring, but helped by a fantastic cast, including the wonderful Audra McDonald profiling Ruth the main character, I thought this was an excellent production.There are plenty of reviews where you can learn the background of this novel, so I would just add that Small Great Things would make an excellent choice for a book club. It's also perfect for a movie adaptation. My sense is that Small Great Things will have many readers feel uncomfortable, considering the controversial nature of the story, but that's probably the exact reason why it might be worth reading.There's plenty of food for thought here and this story feels particularly immediate and timely right now. I recommend it to anyone willing to examine their own prejudices and internalized biases."}], "description": "Ruth Jefferson is a labor and delivery nurse at a Connecticut hospital with more than twenty years' experience. During her shift, Ruth begins a routine checkup on a newborn, only to be told a few minutes later that she's been reassigned to another patient. The parents are white supremacists and don't want Ruth, who is African American, to touch their child. The hospital complies with their request, but the next day, the baby goes into cardiac distress while Ruth is alone in the nursery. Does she obey orders or does she intervene?Ruth hesitates before performing CPR and, as a result, is charged with a serious crime. Kennedy McQuarrie, a white public defender, takes her case but gives unexpected advice: Kennedy insists that mentioning race in the courtroom is not a winning strategy. Conflicted by Kennedy's counsel, Ruth tries to keep life as normal as possible for her family—especially her teenage son—as the case becomes a media sensation. As the trial moves forward, Ruth and Kennedy must gain each other's trust, and come to see that what they've been taught their whole lives about others—and themselves—might be wrong.With incredible empathy, intelligence, and candor, Jodi Picoult tackles race, privilege, prejudice, justice, and compassion—and doesn't offer easy answers. Small Great Things is a remarkable achievement from a writer at the top of her game.", "title": "Small Great Things", "url": "http://www.goodreads.com/book/show/28587957-small-great-things", "average": 4.34, "cover": "https://images.gr-assets.com/books/1468057481l/28587957.jpg", "reviews": 16626, "authors": [{"url": "https://www.goodreads.com/author/show/7128.Jodi_Picoult", "name": "Jodi Picoult"}], "type": ["Fiction", "Contemporary", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/28587957-small-great-things", "http://www.goodreads.com/book/show/28765613-small-great-things", "http://www.goodreads.com/book/show/28587960-small-great-things", "http://www.goodreads.com/book/show/34136258-small-great-things", "http://www.goodreads.com/book/show/28588017-small-great-things", "http://www.goodreads.com/book/show/10917.My_Sister_s_Keeper", "http://www.goodreads.com/book/show/14866.Nineteen_Minutes", "http://www.goodreads.com/book/show/10916.The_Pact", "http://www.goodreads.com/book/show/14864.Plain_Truth", "http://www.goodreads.com/book/show/15753740-the-storyteller", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}