{"ratings": 5050, "userreviews": [{"userName": "Nagisa", "userReviewDate": "Oct 15, 2014", "userURL": "http://www.goodreads.com/user/show/10457977-nagisa", "userReview": "I devoured all works of Torey Hayden when I was a teenager and got horrified at the fact that there are some kids of the same age as me or younger who went through abuse or any other aggravated sort. Her books opened my eyes to the cruel side of the world and brought me outside of my comfort zone. And I just couldn't believe there are others who would shatter kids' hearts and lives, and the reality was just shocking to me. Yet, I was drawn to her story, cried and overjoyed with her and her kids in the story.I had a chance of revisiting her world since a member of my book club chose this book for the next read. I don't remember how many times I cried till I finished the book. My love for the kids grew as Torey's did, and I hope they're now doing fine somewhere in the world."}, {"userName": "Shannon", "userReviewDate": "Nov 12, 2008", "userURL": "http://www.goodreads.com/user/show/1414520-shannon", "userReview": "I read \"One Child\" by Hayden and immediately had to have more. I soon owned the rest of the series and blew through them as well. Hayden is a special-ed teacher who works with the troubled kids and completely turns their world around giving them hope and something to live for."}, {"userName": "Silvana (Por detrás das Palavras)", "userReviewDate": "Dec 09, 2015", "userURL": "http://www.goodreads.com/user/show/10311832-silvana-por-detr-s-das-palavras", "userReview": "Torey Hayden é daquelas autoras a quem gosto sempre de voltar. Os livros dela são, para mim, uma verdadeira inspiração. Admiro o trabalho dela e a forma como ela lida com todas as situações. Gostaria muito de falar com ela, trocar ideias e experiências... Cada livro que ela nos traz é um pequeno pedaço de um mundo \"anormal\" que tenta viver na \"normalidade\" de um mundo mais alargado. Porém, eu questiono sempre: O que é ser normal?Eu tenho a minha própria definição e interpretação de normalidade e, por aquilo que vou lendo nas entrelinhas dos livros da Torey, penso que vou de encontro àquilo que ele pensa.Em cada livro é-nos apresentada uma história ou um conjuntos de histórias. Tudo depende do número de crianças que fazem parte do livro. Os filhos do afecto é um livro onde Torey nos oferece a história de três crianças: Lori, Tomaso, Cláudia e Boo, Eles constituem uma turma pouco oficial da autora. Cada um tem as suas especificidades e cada um será protagonista de conquistas, lágrimas, tristeza e aceitação. Ainda não consegui encontrar uma explicação, mas este foi um dos livros da autora que mais me emocionou e tocou. E é estranho porque já li livros dela com histórias bem mais fortes e desesperantes do que estas. Achei todas as crianças especiais e não consigo destacar uma que me tenha feito vibrar mais do que as outras. No fundo, todas elas significaram alguma coisa para mim. Da Lori, admiro a persistência e vontade de fazer diferente. Apesar de toda a força que ela emana e daquele jeito único de lidar com os outros, também ela tem o seu lado frágil. Foi neste lado mais negro que olhei para ele e senti o quão difícil é esforçarmo-nos e, mesmo assim, não atingir aquilo que queríamos. É certo que a Lori tem uma agravante física, provocada por alguém que não sabe o que é amar uma criança. Tomaso, o rapaz irreverente, refugia-se em memórias e esperanças falsas para se ir mantendo à tona. Amor dói, e ele sabe isso tão bem que prefere que as pessoas não gostem dele. Contudo, ao mesmo tempo deixa-se afundar nos braços de Torey, deixa-se amar por ela e por todos os outros meninos e dá também o seu amor, É um rapaz interessante que, com a ajuda psicológica certa, tem um caminho brilhante pela frente.Cláudia é, tal com a Torey, a criança que mais me preocupou ao longo da história. Vive no silêncio e no num mundo muito dela. Tem dificuldade em expressar aquilo que sente e necessidade de receber amor e afeto por parte dos outros. Esta necessidade não me pareceu bem explícita. Porém, ela vem de uma família fria e rigorosa e ao primeiro sinal de amor ela segue e faz o que lhe pendem, porque entende que só assim a outra pessoa não deixa de gostar dela.Por fim, temos um Boo, um menino autista que vive num mundo muito dele. É complicado conseguir tocar naquele espaço onde vive. Mas as ferramentas de Torey e o seu tacto para lidar com as crianças e usar o amor no trabalho conseguem algumas leves conquistas. Para ele, nós somos o mundo anormal e é difícil ele encontrar um lugar no nosso mundo onde ele se consiga encaixar. Ele irá conseguir encontrar o seu lugar, mas dentro dele existirá um espaço que só a ele pertence e nós somos tão limitados que muito dificilmente lá chegaremos. Torey lida com tudo isto de uma forma brilhante. Ao longo do livros são-nos apresentados outros fatores que vão condicionando as decisões e o estado de espírito da autora. Essas pedras no caminho tornam-na numa pessoa mais forte na sua fragilidade. Vale a pena ler o livro. Para quem trabalha com crianças é um livro inspirador."}, {"userName": "Beverley", "userReviewDate": "Jun 23, 2014", "userURL": "http://www.goodreads.com/user/show/1652830-beverley", "userReview": "I read this book as a teen many times over and then re-read it as a young adult. It opened up my eyes on the different issues that my peers were dealing with (when I read it as a teen) and I was drawn in by the teacher (Torey L. Hayden) who never gave up on the children. It resonated with me and now, all these years later, I have worked many years in the field doing similar work. I find the book raw, truthful and inspirational. Well written and highly recommended."}, {"userName": "Yvonne", "userReviewDate": "May 24, 2009", "userURL": "http://www.goodreads.com/user/show/2327939-yvonne", "userReview": "This book was instrumental in securing my drive and determination to help children in some way, when I grew up. It was a remarkable look at teaching children with special needs, mostly behavioral and emotional needs. Her patience, her approach, her attitude, all of it made a huge impact on me, and I've carried many of her principles into the classroom today."}, {"userName": "Bekah", "userReviewDate": "Feb 03, 2010", "userURL": "http://www.goodreads.com/user/show/3245558-bekah", "userReview": "I think I first read this book when I was about 10. I do know that Torey Hayden's books started me on my journey to become a special education teacher. Her descriptions of her students are compelling, sensitive and funny. I don't know if she would withstand the test of time--since many of her experiences were early in the history of publicly funded special education."}, {"userName": "Boilermkr88", "userReviewDate": "Mar 01, 2009", "userURL": "http://www.goodreads.com/user/show/2080073-boilermkr88", "userReview": "I read this book when I was in college, way back in the 80's. At the time I was studying to become a teacher and I wanted to soak up all the books about teaching that I could find. This is an excellent book for anyone who loves children and thinks the world is a better place with them in it!!!!"}, {"userName": "Holly", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/69433137-holly", "userReview": "Enjoyed this book so much! Working at schools I've seen similarities in students. I could relate so much"}, {"userName": "Hannah Almond", "userReviewDate": "Nov 02, 2014", "userURL": "http://www.goodreads.com/user/show/17065536-hannah-almond", "userReview": "This is the second book by Torey that I've read now. After reading 'Ghost Girl' I found myself eager to read Hayden's other offerings. I actually stumbled across her books quite by chance after I had finished reading all of Cathy Glass & Casey Watson's books & was desperately searching trying to find something similar to fill the empty void they had left in their wake. (So, if you’re a fan of either of these two authors you'll enjoy Torey's books immensely) Each time I've started on one of Torey's books I've got so completely wrapped up in it, that sleep evades me until I've finished the very last page. She has such an ability to draw the reader in.I really connected with the book & each of the children Torey so well describes in it. She does an amazing job at describing the absolute beauty that each of her students possess! The abundance of love, care & affection that Torey dedicates to each & every one of them (whether they deserve it or not) shines so so clearly throughout the pages. No matter how hard some *like Tomaso* try to make themselves repugnant This is a book that will definitely make you cry, but it will also help lift your spirits. I was captivated by Torey's easy style of writing. I shared her & her classes’ anger, frustration & joy throughout the pages. I was so drawn to Torey's odd little class, that after finishing the epilogue I found myself wondering how Boo, Lori, Tomaso & Claudia were all doing nowSo, after a little search (thank god for google), I found Torey's website and subsequently a little catch up on how they're all getting on. (I've added this link just in case anyone's interested)I also found this picture of a bluebird that Lori drew for Torey in the book"}, {"userName": "Kris", "userReviewDate": "Aug 25, 2015", "userURL": "http://www.goodreads.com/user/show/1401304-kris", "userReview": "These books are just so emotionally draining. Not because of the kids themselves; their stories are sad, but the way they handle their lives, often with such positivity, is amazing. No, what exhausts me is the fact that there are such horrible people in the world, that would do such horrible things to children. The author, Torey Hayden, is a teacher of special -needs children; in some cases, that means giving extra homework help to a kid struggling with math, but in other cases (as in this book ) it means trying to reach out to a kindergartener with autism, or helping a 10 year old manage severe anger issues, or providing a safe learning space for a pregnant 12 year old. A pregnant. 12 year old. Whose parents refuse to discuss her pregnancy or her post-delivery plans.The majority of my anger and frustration centers around the story of Lori, a young girl who, as a result of child abuse, has suffered brain damage. In most regards she's a typical little girl, but she's physically unable to read; her brain is unable to recognize the different letters and words. She comes to Torey's class for extra help, mainly because her main 1st grade teacher is an idiot who doesn't understand the difference between someone who's being lazy and not trying, and someone who has a physical freaking handicap and cannot freaking do reading, no matter how hard she tries! This idiot teacher makes Lori stand in front of her entire class and read; when she can't read a book, her teacher moves to a lower level book and tries again, gradually moving to ever lower skill levels, the entire time berating Lori for her \"stupidity\" and \"laziness\", until Lori vomits from nerves and runs from the room.While reading this book, I had to constantly remind myself that it was taking place in the 1970s, when special education was a completely different animal. Mainstreaming, or involving special - needs children in the regular classroom as much as possible, was apparently a big thing, and kids who couldn't keep up were (apparently ) out of luck. When I read these books from Karen's list, I try to think how she would have reacted to them. I feel pretty sure that she would have been yelling at the 1st grade teacher and throwing the book in disgust. And crying a little when Tomaso has a breakthrough, or when Boo, the autistic boy, interacts with Torey. I know that's what I was doing."}, {"userName": "Adelina", "userReviewDate": "Mar 19, 2015", "userURL": "http://www.goodreads.com/user/show/27702673-adelina", "userReview": "Tositapahtumiin ja oikeisiin henkilöihin pohjautuvaa tarinaa on vaikea arvostella. Miten voin arvostella toista ihmistä tai hänelle tahtuneita asioita?Kuitenkin, olen lukenut Haydeniltä tähän mennessä jo useamman kirjan ja olen pitänyt jokaisesta. On ihanaa miten Hayden kohtaa lapset ja on heidän kanssaan. Hän uskaltaa myöntää heikkoutensa, mikä suurin niistä on ujous. Välillä kyllä kävi kieltämättä raivostuttamaan että miksi hän ei puolustanut jotakin lasta paremmin. En ollut aiemmin kuullut inkluusiolaista ja siitä millaiset seuraukset sellaisella on. Systeemi on mätä ja voin uskoa kuinka väsyttävää on yrittää taistella sitä vastaan.Ihmettelin että miten suurin osa Haydenin kollegoista oli niin hävyttömiä ja välinpitämättömiä lapsia kohtaan. Onko koulumaailmassa niin paljon huonoja ja opettajiksi sopimattomia ihmisiä?Mitä kirjan lapsiin tulee, he pakahduttavat sydämesi. Olen itse työskennellyt lasten parissa ja pystyn helposti kuvittelemaan monet tilanteet ja tokaisut heiltä."}, {"userName": "Lupi_19", "userReviewDate": "May 28, 2015", "userURL": "http://www.goodreads.com/user/show/39077226-lupi-19", "userReview": "Somebody Else's Kids is a nonfiction book. I believe the reason she wrote this book was to tell her story or to inform people the fact that there are people with needs who need better classes available for them or just someone to lend them a hand. Regardless of which of those was her point I believe she achieved them. I really enjoyed this books story and I really enjoyed the fact that in her story she did not give up on them at all. She tried to help each of those students. There wasn't really anything bad with this book. One of my favorite quotes was \"I had not found resource teaching particularly fulfilling. I had missed the contained-classroom setting. I missed not having my own group of children. But by far the most, I missed the eerie joy I always felt working with the emotionally disturbed.\" ( Page 11, Hayden). I do recommend this book to people. It is very inspiring in a way and I think everyone should read Haydens story."}, {"userName": "Susan Bazzett-Griffith", "userReviewDate": "Jul 15, 2013", "userURL": "http://www.goodreads.com/user/show/19421489-susan-bazzett-griffith", "userReview": "One of Hayden's earlier books, and perhaps if I hadn't read several of her other books beforehand I would have scored it higher, but ultimately, her voice in this book, moreso than some of her others, grated on me. She is very self-congratulatory and though you can tell she cares about her students, she seems a bit arrogant about her own abilities throughout the story. The case studies are varied and interesting in her classroom, but I wish there had been more descriptions and details about their backgrounds and parents than was given by Hayden. Also, because it was written so many decades ago, it was hard to read about how nobody knew how to work with the autistic child, and that the \"regular\" teacher was so awful toward the brain damaged girl. None of that would fly in today's culture. Two stars."}, {"userName": "Maria Elmvang", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/168347-maria-elmvang", "userReview": "Absolutely devastating, just like all her other books, and equally as readable. Torey Hayden really knows how to write a relateable story. The odd thing is that I don't think I'd like her books much if they were fiction... too much emotional manipulation, too little resolution, but because they are memoirs they couldn't be any different.That doesn't mean I don't still shake my head at some of Torey's actions and decisions at times though. But I'm impressed that she relates her failures and mistakes as consistently as her successes.Her books are all very similar though, so after having read these 4 or 5 books by her, I think I'm done. They make for engaging reading, but they're formulaic."}, {"userName": "Phillipa", "userReviewDate": "Apr 05, 2014", "userURL": "http://www.goodreads.com/user/show/4267176-phillipa", "userReview": "Torey Hayden's books seem to bring out the same reaction to me, every time (okay, so this is only the second, but I'm noticing a trend). The stories are well written and captivate you, but the end result generally fails to deliver because these are true stories. At least this one had a little more of an ending than the previous one I read. I think the scariest sub-story for me in this book was the pregnant twelve-year old. And it wasn't due to sexual abuse, she'd had sex. At 12. That's frightening and scarily is not unheard of these days! So sad ... I think of my cousins who turned 12 last year and I seriously just can not imagine how someone the same age these sweet, still mostly innocent children could end up like that ?! Blows my mind and scares me to death."}, {"userName": "Siri", "userReviewDate": "Feb 25, 2008", "userURL": "http://www.goodreads.com/user/show/147489-siri", "userReview": "all hayden books get 4 stars from me bc they changed my life when i was in high school and made me want to be a psychologist to help kids like she did. She is not meant to be a young adult writer.. I think her books are meant for adults, so don't think it's a kiddy book just cuz I read 'em in high school! I don't remember much about the writing (they are all written in first person) but the TRUE stories about the children who she has worked with are heartbreaking and inspiring. Haven't read one of her books in YEARS, BUT if you are interested in child/adolescent psychology, social work, special-ed, child abuse, or if you think YOU'VE had a bad day, READ THESE BOOKS."}, {"userName": "Tiffany", "userReviewDate": "Aug 23, 2009", "userURL": "http://www.goodreads.com/user/show/2635940-tiffany", "userReview": "After reading ONE CHILD and GHOST GIRL, I went back to the bookstore to pick up all the rest of Torey L. Hayden's books. Her style of writing is so easy and engaging. The characters in her stories are powerful and you are drawn to them all. None of the characters have one side to them, Hayden lets us see that everyone has good and bad. She is a truly gifted teacher and writer, and I am sure her works have sent many a young person in the direction of helping troubled youths and children. I know that I have lent my set of books to my young friend who has since gone on to do child welfare in Inuvik, they affected her totally and completely, as they did myself."}, {"userName": "Rebecca Haslam", "userReviewDate": "Dec 29, 2014", "userURL": "http://www.goodreads.com/user/show/5108063-rebecca-haslam", "userReview": "It's been a while since I've read one of Torey's books and I have to admit that I've missed them. However, with that said, I struggled to get through this book as quickly as I had hoped to - I usually devour them in one sitting, but that is ultimately no fault of the writing. It is instead because the writing is good that it took me so long. Torey has long since been able to make me empathise with those she writes about and this book was no different - I just think she has however written better."}, {"userName": "Alissa", "userReviewDate": "Mar 20, 2013", "userURL": "http://www.goodreads.com/user/show/6318983-alissa", "userReview": "An honest, raw, and gripping true story of a special education teacher who cares more about her students than anything else in the world. This is a deeply encouraging story although heartbreaking and somewhat abrasive in its authentic presentation. Oddly enough, there is an underlying sexual theme running throughout the story as well--I'm not really sure how to word or explain that well enough for it to make sense. That is something you'll have to read to understand. I recommend this book to all teachers. It was well worth my time."}, {"userName": "Lisa", "userReviewDate": "Mar 29, 2016", "userURL": "http://www.goodreads.com/user/show/25857507-lisa", "userReview": "I truly enjoyed the story about these kids. I especially identified with the characters of Boothe, Lori, and Tomaso. I have worked with children with autism for several years and could totally picture Boo running around and doing all those odd behaviors. Lori reminds me a lot of me in school and all the struggles to fit in. Tomaso I really liked because it shows how just one person can change the life of a child for the better."}, {"userName": "Naura", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/19201929-naura", "userReview": "As a former teacher; and now a professional who works in the Special Needs Community- I could not put this book down. There were part where, at times, I felt it be to a little too idealistic (even in the challenges and struggles of Torey); but the honest insight of dealing with disabled, disturbed, and abused children is just inspiring. Torey's passionate shines through in every page, and I cannot help but relate to her."}, {"userName": "Pilvi", "userReviewDate": "Mar 03, 2015", "userURL": "http://www.goodreads.com/user/show/38847127-pilvi", "userReview": "Very interesting book to read, and very different from others I have read. Once in a while I wanted to cry because sometimes it was so sad to think that those were real people and real stories. But sometimes I also wanted to cry because of something happy that happened and it made me happy as well. I have another Torey Hayden's book waiting in the self, I hope it's as good as this one and makes me feel the same way."}, {"userName": "Daniela S.", "userReviewDate": "Dec 02, 2014", "userURL": "http://www.goodreads.com/user/show/31421255-daniela-s", "userReview": "Such a wonderful book!It talks about children that people don't understand how smart and kind they are, even with all the problems they have. Even with difficulties, they face their lifes with smiles and they fight so hard to be better. This book also talks about an adult that sees these kids growing up and the fact that we need more hope in this world. I loved reading this book."}, {"userName": "Lucy", "userReviewDate": "Dec 26, 2014", "userURL": "http://www.goodreads.com/user/show/4365814-lucy", "userReview": "This one was not quite what I expected, I expected one of those ‘please Daddy, no’ type books, it’s what it looks like. I guess I shouldn’t have judged by the cover because it wasn’t that at all. It was about kids with learning problems (for a variety of reasons) and the teacher who helps them (that’s Hayden). It was more interesting and a better read than I expected."}, {"userName": "Rebekah", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/33512325-rebekah", "userReview": "Very good. A true story, covering an entire school year - but somehow Torey Hayden kept the story moving and kept drawing the reader right along as well as the best fiction writer. She showed the kids and herself so well that they felt like the real people they were. I agonized over the kids and cared terribly much about what happened to them. This is a story that's going to stick with me."}, {"userName": "Kirsty", "userReviewDate": "Nov 30, 2014", "userURL": "http://www.goodreads.com/user/show/2562425-kirsty", "userReview": "Another cracking book from Torey Hayden. The compassion effort and sheer determination comes through in every book and I admire her tireless work with these troubled and disabled children. off to read another"}, {"userName": "Andrea Kwast", "userReviewDate": "Jul 24, 2014", "userURL": "http://www.goodreads.com/user/show/14169387-andrea-kwast", "userReview": "This book was brilliant. I related to this author so much. Her memoir of working with special ed kids touched home for me. If you work with these amazing little people or are the parent, I thoroughly recommend it."}, {"userName": "Ajengp", "userReviewDate": "Jan 17, 2016", "userURL": "http://www.goodreads.com/user/show/6965210-ajengp", "userReview": "I love Hayden's books because I love two thing, kids and touching stories. Hayden is the teacher I want to meet and the teacher I want to be. She reminds me the most important thing through this book, one kid matter."}, {"userName": "Sage", "userReviewDate": "Jan 13, 2013", "userURL": "http://www.goodreads.com/user/show/51035-sage", "userReview": "One of my all-time favorites. I've read it numerous times since discovering it in college. One of the books that helped move me into studying sociology."}, {"userName": "Loretta", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/9843846-loretta", "userReview": "Anyone who has worked with kids should read this book; it had me in tears!!"}], "description": "\"Were all just somebody else's kids . . . \"A small seven-year-old boy who couldn't speak except to repeat weather forecasts and other people's words . . . A beautiful little girl of seven who had been brain damaged by terrible parental beatings and was so ashamed because she couldn't learn to read . . . A violently angry ten-year-old who had seen his stepmother murder his father and had been sent from one foster home to another . . . A shy twelve-year-old from a Catholic school which put her out when she became pregnant . . .\"What do we matter?\"\"Why do you care?\"They were four problem children-put in Torey Hayden's class because no one else knew what to do with them. Together, with the help of a remarkable teacher who cared too much to ever give up, they became almost a family, able to give each other the love and understanding they had found nowhere else.", "title": "Somebody Else's Kids", "url": "http://www.goodreads.com/book/show/106027.Somebody_Else_s_Kids", "average": 4.26, "cover": "https://images.gr-assets.com/books/1375876983l/106027.jpg", "reviews": 185, "authors": [{"url": "https://www.goodreads.com/author/show/2911935.Torey_L_Hayden", "name": "Torey L. Hayden"}], "type": ["Nonfiction", "Psychology", "Autobiography", "Education", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/106027.Somebody_Else_s_Kids", "http://www.goodreads.com/book/show/1159741.Somebody_Else_s_Kids", "http://www.goodreads.com/book/show/12302680-os-filhos-do-afecto", "http://www.goodreads.com/book/show/4721248-toisten-lapset", "http://www.goodreads.com/book/show/76423.Ghost_Girl", "http://www.goodreads.com/book/show/106022.Beautiful_Child", "http://www.goodreads.com/book/show/76431.Just_Another_Kid", "http://www.goodreads.com/book/show/83101.Twilight_Children", "http://www.goodreads.com/book/show/106025.Murphy_s_Boy"]}