{"ratings": 770, "userreviews": [{"userName": "Joe Valdez", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/26876584-joe-valdez", "userReview": "Some Rain Must Fall: And Other Stories is a collection by Michel Faber, all stories published in 2000. I'm a great fan of The Crimson Petal and the White and The Book of Strange New Things and after Faber transported me to strange new worlds with each new novel, I was curious where he'd take me with fifteen short stories, particularly which genre they'd fall under. Only two or three qualify as science fiction; the others are slices of contemporary life. Like a visit to Loch Ness in Faber's adopted home of Scotland, I felt like a tourist waiting for something amazing to surface. Results like that were inconsistent, but the characters and scenery were memorable.-- \"Some Rain Must Fall.\" Frances Strathairn is no normal substitute teacher. The circumstances which brought her to Rotherey Elementary School and the Primary 6 classroom of her predecessor Mrs. Macshane slowly reveal themselves to the reader through the essays she's instructed her pupils to write on the subject of \"About Me, My School and My Teacher.\" Meanwhile, Frances considers whether her relationship with her partner Nick needs crisis management. This story hit me in the gut and sent me tumbling down a small flight of stairs. Faber's focus is so unique and compelling for a story approaching the subject matter that it does. ***** (5 stars).-- \"Fish.\" Janet and her daughter Kif Kif exist in a world where our sea creatures now swim through the air instead of the ocean. I wouldn't be surprised if Faber wrote this while serving a jury duty summons while someone sitting next to him watched a Studio Ghibli movie on their iPad. ** (2 stars).-- \"In Case of Vertigo.\" Sister Jennifer holds vigil on a deserted cliff, eating and sleeping in her car near a spot that apparently draw jumpers she is ready to save at a moment's notice. Quick little story with odd formatting choices that never made its character come alive. ** (2 stars).--\"Toy Story.\" God lives in an abandoned universe where to keep himself busy, he picks through the trash. One of his finds is a perfect blue planet he takes home and begins to conjure thoughts about. I liked the imagination and abbreviated whimsy of this, but didn't care much for it. ** (2 stars).-- \"Miss Fatt and Miss Thinne.\" Miss Fatt is a voluptuous actress whose career is taking off and her comely roommate Miss Thinne is a community nurse. The pair get along so well they're practically a single organism. What would happen if one day Miss Fatt couldn't stop eating and Miss Thinne couldn't eat? This story is not nearly as obnoxious as it sounds. I kept reading to find out what would become of Miss Fatt and Miss Thinne, intrigued by what might happen to someone who decided to eat constantly or not eat at all. But so far, four of five stories have not measured up to the quality control I expect from Faber. *** (3 stars).-- \"Half a Million Pounds and a Miracle.\" Robbie is a young stone mason contracted to help restore St. Hilda's, a Catholic church that has laid in ruin for over a century near Invergordon. After the Virgin Mary falls off her pedestal and smashes, Robbie searches for creative and budgetary solutions for repairing the statue to something close to its former glory. He shares his ideas with a young supermarket clerk named Catriona he meets at a disco and she expresses interest in visiting his work site. I love reading stories about people at work and Faber does a marvelous job integrating construction and Scottish culture into a story. **** (4 stars).-- \"The Red Cement Truck.\" A woman who has just been shot and likely killed in her home by a surprised burglar travels outside her body while her bumbling killer finishes ransacking her home and releases his bowels in her bathroom. Meanwhile, a vehicle pulls to the curb.The curtains of the living room, which had preserved the privacy, the intimacy, of her encounter with the man who suffering upstairs, rolled aside at a gesture of her hands, flooding her living room with light. It was eleven o'clock in the morning, and the world out there was brilliant with sunshine after a rainy start earlier on. The vehicle which had parked in front of her house, little more than arm's length from her window, was a cement truck so massive that only a section of it could be viewed, as if it were an absurdly enlarged detail from a painting, or a huge close-up filling a cinema screen. The enormous metal barrel was painted deep red, textured by corrosion, aged and weirdly organic. It revolved slowly, glistening with raindrops.It was easily the most beautiful thing she had ever seen.Haunting. Like the other two high quality stories so far, this one belongs to the spectral world of the author's science fiction/horror novel Under the Skin. It reminds me of what makes Faber such a unique writer: X-ray vision and bending genres like Superman bends steel. **** (4 stars).-- \"Somewhere Warm and Comfortable.\" Scott is a thirteen-year-old boy whose priorities are candy, Lego and stealing porn magazines. His sister Christine has been slipping him money their mother has earmarked for the movies or the zoo, buying his silence while Christine secretly visits her boyfriend. Scott wanders the shops getting into boy trouble. Plans change one afternoon when Christine asks her brother to accompany her to a clinic and later, find somewhere she can lay down and rest. Scott chooses an art gallery. Like \"Some Rain Must Fall,\" I appreciated Faber's unique focus on a cultural issue of our day, even if I didn't much like the characters at all. **** (4 stars).-- \"Nina's Hand.\" What if the right hand of a young woman working in a gherkin factory could develop its own consciousness? Faber imagines it for you. Beguiling and more than a bit spooky. In the late '70s, Sesame Street had a segment on the hand which I remember being a model's hand crawling against a black backdrop. This sent me running out of the living room in terror each time I saw it. **** (4 stars).-- \"The Crust of Hell.\" Ivan and Ivanka Silbermacher and their teenager Lydia move from Seattle to an army base in the impoverished nation of Bharatan in the Sahara Desert for several weeks. Ivan has been contracted to solve the country's famine problems and believes he is close to figuring out how to make it rain. Ivanka, his Hungarian wife of twenty-three years, wants to support her husband but begins to have her doubts about his decision-making. Lydia is a Goth who sets out to collect experiences she can use as coolness currency back home. Stunning setting, good character work, but the story didn't punch me in the gut. *** (3 stars).-- \"The Gossip Cell.\" Ed Jerome is an entrepreneur whose relationship with inventor Willie Spink has led to some amazing innovations--like the Sperome Eczema Vaccine--and riches, but none like Willie's latest brainstorm, a \"gossip cell\" that can talk to other cells and keep a beverage hot for indefinite periods of time. This piece reads like the rough draft of something Faber wrote in the taxi on the way to jury duty; sloppy, missing a piece, confusing. ** (2 stars).-- \"Accountability.\" Margo is a thirteen year old girl living on a failed farm in rural Australia. Her life is engaged in caring for her infirm grandmother and subverting Frank, her caregiver who reveals he is not actually Margo's biological father. Unable to leave her grandmother for more than two hours or attend school, Margo's education is regimented to a set of How and Why Wonder Books which Frank presents her each year. When Margo appears in a family way, she writes NASA for help. Faber's whimsy really fails him here. I found this story not only depressing, but boring. ** (2 stars).-- \"Pidgin American.\" Katarzyna (Kasia) is a Polish teenager living in London, where she works as a server at her uncle's restaurant and drifts through the nightlife. She is aware that the world is not what has been promoted on television and has been buying T-shirts in the U.K. with less an eye of going into business in Poland and more survival on her own terms. I really liked this character's voice and Faber's focus on the days and nights of a young immigrant, even if nothing really memorable happens in the story. **** (4 stars).-- \"The Tunnel of Love.\" Unemployed advertising executive in Melbourne takes a job as a spruiker at the Tunnel of Love, an adult bookstore and peep show. He gets to know his co-workers and gradually falls in love with Karen, the caustic manager of the bookstore whose labor of love are children's books. She helps the narrator hone his sales pitch on the sidewalk and seems appreciative of his company, but rejects his attempts at phone conversation outside of work. There's more humor in this story than any other in the book and with the focus on people at their jobs--with emphasis on a recession--I enjoyed it immensely. ***** (5 stars).-- \"Sheep.\" Five contemporary young artists in North America receive invitations to address a conference hosted by the Alternative Centre of the World in Scotland. However, the invitation turns out to be a prank by an anonymous trickster offended by the aesthetic of each artist. The three men and two women are left in a village five hours drive from Edinburgh with whatever cash they have on them. Not a bad story. I really enjoy Faber's Scotland-based tales the best. So much local character and atmosphere creeps into these stories which otherwise might not amount to much on the page. His critique of various modes of modern art is laser sharp. **** (4 stars)."}, {"userName": "Lynne King", "userReviewDate": "Sep 16, 2016", "userURL": "http://www.goodreads.com/user/show/15736557-lynne-king", "userReview": "Miss Thinne heaved herself on the window-ledge like a nightmarish white praying mantis, and lowered her spindly legs carefully down into the dark and humid room. Her forklike feet dangled more than a metre from Miss Fatt’s helplessly supine body.\nWhere to start with this sumptuous anthology of short stories? Coming across this author, whom I had never heard of before, was yet another serendipitous find in GR through reading friends’ reviews. As soon as I saw the title I knew that this book was for me. I always read up on unknown authors before I begin one of their books so that I can get a feel of their psyche and whether or not I am going to like their writing. Well this Faber has certainly not failed me in that respect. I feel as if I’m starting another love affair with an author as I did with John Williams and his four works last year. I found them all spellbinding and it is exactly the same with Faber. Some of the stories are satirical, others paranormal and others, well I can only describe them as utterly fascinating. I had great difficulty in fact putting this book down, kept on returning to various passages I found enlightening and thought about it when I went to bed, until I fell into the land of dreams and into the next morning when I was taking my breakfast. I kept on thinking how on earth does Faber’s thought process work?Faber has the most extraordinarily vivid imagination. He creates stories that only exist in my phantasmagorical dreams and what is even better is that he keeps the momentum up to the end of each story. The descriptions of nature are spellbinding, with such clarity like paintings from the Old Masters. Whatever Faber writes, every single sentence and every single word is so visual to me. I want to be a spider and catch these in my web and never let them go. Where does my love of short stories come from? Well it has to be Guy de Maupassant. I read one of his collections and there was this remarkable story of a woman called “Boule de Suif”. I’m not too sure what the French translation would be? Suet dumpling? Anyway I was entranced and that’s for sure.Getting a feel about a book is of paramount importance for me but where to start with Faber’s incredible book?Out of all the fifteen stories there is not one that I didn’t like but if I describe every one I will go on for pages. So those that were wondrous for me were:FishThis story rather overwhelmed me. It involves the daily life of Janet and her daughter Kif. They have one problem – they are surrounded by fish of all sizes that actually float around and over them. I found it rather disconcerting. There’s a rather dreadful situation involving the Church of Armageddon (which actually is rather apt!) when blue-black whales from low gray clouds suddenly appear and glide over Janet and Kif. After a lot of cruising around they go in the direction of the church and proceed to flatten it. It was an amazing description. Full marks to the author as it left me breathless!Miss Fatt and Miss ThinneMiss Thinne was not thin and she lived with Miss Fatt, who was not fat; they were fairly young ladies. The former worked as a nurse at the Community Health Centre where she “Eleanor” was greatly liked and known “as a marvel”. Whereas the latter worked for a glamour agency (as she was rather busty she didn’t get much fashion work) and was rather successful working on adverts. She had aspirations of being an actress. They were both very content with their lives but then one day strange things began to happen…Faber is at his best when he describes this and the denouement is actually rather sad but superbly written.The Tunnel of LoveYes this is sexually graphic but actually rather sensuous. It is about a pornography bookstore with this title that has a cinema and lots of sexual objects and attractions. It is the story of Mike, an unemployed advertising executive who needs to work. He happens to be passing this shop one day and is looking at the spruiker. I had to look this up. Evidently it’s “Australian slang spruik to give a speech, make a barker's spiel (of unknown origin).”Well Mike is taken with Karen who works in the shop, sharing it with Darren. All said and done it is all brilliantly written and that’s all I need to say.SheepThis story is extraordinary. Five weird artists from New York are invited to go to the Alternative Centre of the World in Scotland. Their airline tickets and all of their expenses are paid and when they arrive in the village of Inver, way north of Edinburgh, they find that they have been conned! The bus driver tosses out a package and abandons them. Each receives a letter and a book of “The Glory of the Highlands\" and a letter from an Art Lover who proceeds with a diatribe against each of them. Nevertheless sheep do indeed come into the equation and I chuckled to myself throughout the entire story.It was an absolutely wonderful experience for me reading this book and now I’m going to explore Faber’s other works. My… Did this make my day.As an afterthought, dreams and expectations are what makes up our life on this incredible planet of ours. Faber has managed to achieve this."}, {"userName": "Peter Boyle", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/1903072-peter-boyle", "userReview": "Michel Faber is one of my very favourite writers. If you are ever unlucky enough to be trapped in a conversation about books with me, I will most certainly bring him up, and I apologise in advance for the excited gibberish and wild gesticulations that ensue.Some Rain Must Fall is his debut collection of stories and the signs are already present of a rare talent at work. There is a such a wide range of styles on show here that one can't fail to be impressed: some are surreal, some are satirical, others examine tragedy with tremendous grace and care. Faber is in possession of such a unique imagination and curiosity about the world, and what a pleasure it is to sample the fruits of his labour.I found something to love in each of the fifteen stories but there are a few that really stood out. Fish, a immeasurably strange and unsettling tale which features sea creatures swimming through the air of an unnamed city, haunted my dreams for many nights afterwards. Accountability is about a pregnant teenager in the Australian outback, who has a surefire plan for escaping the clutches of her abusive father. The ending of that one just broke me. And a story in which the protagonist is a woman's hand (yes, a hand), begins with a slightly comical tone but turns into something quite moving and beautiful:\n\"The air thinned, was less rich in sensation, and such sensations as passed through the hand now were soothingly familiar: the memory of breadcrumbs in the bed, the fine stubble on the jaw of a beautiful man in the morning, the brilliant floes of soapsuds in the bath, the discovery of damp viridescent moss in the world just outside the doorstep.\"\nI would recommend this wonderfully inventive and thought-provoking collection to anyone, especially those who have enjoyed Under the Skin or The Book of Strange New Things. Oh and a word about the gorgeous Canons Edition cover - it is one of the most stylish and eye-catching designs I have seen in quite some time and would brighten any bookshelf."}, {"userName": "Cecily", "userReviewDate": "May 13, 2013", "userURL": "http://www.goodreads.com/user/show/1199525-cecily", "userReview": "[A wealthy fan of more traditional art tricks five American artists to being abandoned in the Scottish highlands, \"the world of real Art, and the environment that inspires it\". Will it change their opinions and practices? (hide spoiler)]"}, {"userName": "Petr", "userReviewDate": "Jan 12, 2012", "userURL": "http://www.goodreads.com/user/show/3355251-petr", "userReview": "Svou prvotinu vydal Faber až v osmatřiceti letech, což jste asi už slyšeli, začíná tím každý jeho medailonek. K nám se dostala se zpožděním dalších třinácti let. Je to sice škoda, ale téhle literatuře čas neublíží. Sbírku tvoří patnáct povídek, jež sdílejí podivuhodnou vlastnost: zapamatujete si je. Mají logiku, mají pointu, emocionálně vás zasáhnou. Odpovídají Hemingwayově poučce: povídka je jako ledovec, devět desetin z ní má tvořit to, co vůbec nebylo napsáno, ale autor to věděl. Z Faberových povídek je vám jasné, že vždy jde o malý výřez z velkého obrazu, který by autor dovedl namalovat, kdyby se pro to rozhodl.Nejsilnější mi Faber připadá tam, kde zůstal u víceméně čistého realismu (Někdy prostě prší, Někam do tepla a pohodlí, Krusta pekla, Skládání účtů, Pidgin američtina, Tunel lásky). Titulní povídka je mrazivě dokonalá, není k ní naprosto co dodat (jen mám pocit, že by její účinek byl ještě silnější, kdyby se z jedné důležité věty škrtlo pět slov). Pidgin američtina a Krusta pekla jsou tak dobré komentáře ke stavu západního světa, že stoprocentně fungují dodnes (i po 9/11 a dalších změnách). Trochu méně mě oslovují příběhy s vysloveně fantaskními prvky (Ryby, Příběh jedné hračky, Slečna Koulová a slečna Luntová, Červená míchačka s betonem), ne že by byly vymyšlené a napsané hůř, ale jdou cestou trochu menšího odporu. Jejich emocionální účinek je však velmi silný, což je i případ povídky Ninina ruka, kterou lze číst více i méně doslova (ale pořád bude dobrá). Příběh jedné hračky, něco mezi H. C. Andersenem, Malým princem a Vesmírnou odysseou, je ideální na důkladné vybrečení. V Rybách je zas pěkně vidět, co by s takovým námětem (postapokalyptický svět, kde ryby létají oblohou) provedl třeba i dobrý autor fantasy a oč jinak si poradil Faber: nevysvětluje, nezdůvodňuje, ale také nezůstane jen u líčení atmosféry (i když by s tím bohatě vystačil, je úchvatně děsivá). Ne; tohle je povídka podle všech pravidel, s ostrou a nečekanou pointou.Což ostatně platí o všech patnácti. Michel Faber je úchvatný talent, spisovatel mimo žánrové škatulky a rozhodně jeden z nejzajímavějších současných angloamerických autorů. Překlad Viktora Janiše je skvělý jako vždy. Janiš má Fabera rád a dělá pro něj to nejlepší, co může překladatel pro autora udělat. — Povídky ve sbírce Někdy prostě prší nejsou radostné, ale jejich čtení je čistá radost."}, {"userName": "Jacob", "userReviewDate": "Oct 21, 2010", "userURL": "http://www.goodreads.com/user/show/637062-jacob", "userReview": "April 2012Miss Fatt and Miss Thinne are not, respectively--although they later become so, monstrously. The apocalypse is full of fish. God didn't create the world, he just found it in the trash heap and thought it was neat. You can fake a Virgin Mary, but you can't make her veil. Something about a hand. Africa. Also Poland. It's hard to find romance in a sex shop. A lonely nun keeps vigil on the edge of Suicide Point. And so on. And I've just removed this book from my culling shelf. It looked interesting when I bought it, then it seemed pretentious when I skimmed the first page (My relationship with this man is in crisis, Francine reminded herself, kissing him on the lips. There is no doubt about that.), then I realized how desperate the back cover was (Acclaimed author! Widely praised! Remarkably diverse! Radically inventive! Compelling collection! FINE I'LL READ IT GODDAMMIT), and then I read it and decided it was a keeper. Unexpectedly good. Sure, a few stories are weak and forgettable (something about a hand), and it may not be as REMARKABLY DIVERSE as the back cover claims (although \"Fish\" is an apocalypse worthy of Maureen F. McHugh, and the god of \"Toy Story\" is far more interesting than Mr g), but it's quite good nonetheless and some of the stories are rather lovely. You may enjoy them as well. I remember reading the first few pages of The Crimson Petal and the White back in high school but abandoning it because it looked huge and threatening, but I do remember how beautiful those pages were, so perhaps I'll try again.And now that this and my last book have survived a bookshelf cull, I'm afraid to read The Corrections..."}, {"userName": "Konserve Ruhlar", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/11957602-konserve-ruhlar", "userReview": "Uzun uzun, dolu dolu öyküler. Kısa öykülerden sıkılmış, daha derin, daha yoğun bir anlatım arıyorsanız size iyi gelebilir bu kitap. Michel Faber ‘in okuduğum ilk kitabı ve kesinlikle diğer kitaplarını da okuyacağım."}, {"userName": "Bosorka", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/14155821-bosorka", "userReview": "Tak jako u většiny povídkových knížek mám i u těch Faberových problém s nevyvážeností. Některé povídky byly výtečné (Tunel lásky, Ovce, Ryby), úvodní Někdy prostě prší byla mrazivá, výborně napsaná a po dočtení celé knihy jsem si ji musela přečíst znovu. Pak jich bylo pár, které mnou jen tak prolétly a za chvíli jsem si nepamatovala, o čem vlastně byly. Nečetly se špatně, protože Faber opravdu vládne jazykem, ale chyběla jim patřičná síla, údernější motiv. Na Faberových příbězích mě baví ty otevřené konce, není mistrem point, ale ani se o ně za každou cenu nesnaží, což je dobře. Atmosféru umí vystavět moc dobře, takže kolikrát vůbec nevadí, že povídka skončí tak nějak najednou"}, {"userName": "Emanuel", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/12490304-emanuel", "userReview": "Some Rain Must Fall - 5🌟Fish - 3 🌟In Case of Vertigo - 4 🌟Toy Story - 2🌟Miss Fatt and Miss Thinne - 3🌟Half a Million Pounds and a Miracle - 3🌟The Red Cement Truck - 4 🌟Somewhere Warm and Confortable - 4 🌟Nina's Hand - 2 🌟The Crust of Hell - 2🌟The Gossip Cell - 3🌟Accountability - 4🌟Pidgin American - 3🌟The Tunnel of Love - 4🌟Sheep - 3🌟"}, {"userName": "Peter", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/5105002-peter", "userReview": "A great collection of short stories, each one very different in form and style. I particularly loved FISH and THE RED CEMENT TRUCK, A CASE OF VERTIGO, and also MISS FATTE AND MISS THINNE - whose theme of eating and bodies reminded me of elements of both the Faber novels I've read: THE CRIMSON PETAL AND THE WHITE and UNDER THE SKIN. The stand out story for me was TOY STORY. About a little boy called God who finds an abandoned planet in the trash round the back of a factory down the road and then hangs is on a string from the light in his bedroom like a mobile. At night, just as he is drifting off to sleep he hears voices from the planet, but he cannot make out what they are saying."}, {"userName": "Tez", "userReviewDate": "May 30, 2014", "userURL": "http://www.goodreads.com/user/show/1090898-tez", "userReview": "Unfortunately I don't remember enough of this short story collection to write a proper review. But two stories stick it out in my mind for being awesome: The one about the substitute/replacement/relief teacher, and the sweet romance set in Melbourne's sex industry (which includes the typical romance trope of \"big misunderstanding\").Those two stories were great. A month later, I've forgotten the others."}, {"userName": "sisterimapoet", "userReviewDate": "Jul 03, 2008", "userURL": "http://www.goodreads.com/user/show/408190-sisterimapoet", "userReview": "The thing that draws me back to Faber is never quite knowing what to expect. It's like mystery pick and mix. I love it. Some of the stories seem very straightforward. Some quite crazy. Each inspire different reactions and emotions in me. But to me, Faber's greatest skill is being able to manage the really odd stories he invents. In lesser writers the idea spiral out of control and end up messy. He handles even shocking content with grace and charm."}, {"userName": "Adam", "userReviewDate": "Aug 25, 2013", "userURL": "http://www.goodreads.com/user/show/4455860-adam", "userReview": "Skvělé povídky. Perfektně přeložené. Autor vykazuje známky hlubokého vhledu do lidí, vztahů, emocí, situací. Témata mají široký záběr, až se zdá neuvěřitelné, kde všude autor stihnul nabrat materiál. Perfektní jsou Někdy prostě prší, Tunel lásky, Ovce. Maje zkušenost s bohémským chováním, u povídky Ovce jsem se pobavil převelice. Doporučuji a mám dojem, že si začas tuto sbírku s chutí přečtu znovu."}, {"userName": "Mirjam Celie", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/30307223-mirjam-celie", "userReview": "I'm afraid there's nothing by Michel Faber that I don't like... These stories are very diverse, fantastic(al) and mesmerizing!"}, {"userName": "Steven", "userReviewDate": "Apr 04, 2008", "userURL": "http://www.goodreads.com/user/show/159477-steven", "userReview": "Here’s a guy that seems to be having some fun with the short-stories he’s writing. Almost as many different styles and forms as there are stories in the collection. Allegories, fables, realism, farce, its all here. And all handled with equal skill and creativity. “Sheep” is a hilarious T. C. Boyle-ish story about a prank played on five avant-garde artists. The title story is dark realism that uses snippets from student essays to reveal the trauma that is otherwise not revealed. I loved “Pidgin American,” which is both a social commentary and a wonderful stew of meaning, and it has a great double-surprise ending. “Somewhere Warm and Comfortable” is another killer of a story that manages to make two stale themes—coming-of-age and abortion—fresh. It also has a beautiful device that creates tension in the first scene and is not released until the end, kind of like the gun on the mantle in a detective story. “The Red Cement Truck” is Faber’s ghost story. And then there’s “The Tunnel of Love,” a story about a laid-off advertising executive who takes a job in a sex shop, but that is really the last thing the story is about. This is an amazing collection, inventive, funny, intelligent, and deep, deep in very sly ways."}, {"userName": "Jen", "userReviewDate": "Dec 13, 2007", "userURL": "http://www.goodreads.com/user/show/681345-jen", "userReview": "I really enjoyed the other books I've read by Faber, and I thought I'd like this one after reading the first story. While there are a few other high points in this book, I found the stories disappointing overall. It seemed like, for some of the stories, he would get a gimmicky idea (e.g.s, \"What if our hands had a separate consciousness from us?\" \"What if we started looking like our names?\") and then follow through with a weak story. This book isn't awful, by any means...I just didn't feel too compelled to read the next story. Under the Skin and The Crimson Petal and the White were both excellent, though, and I'd recommend those books over this one."}, {"userName": "Sofi Corso", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/20291690-sofi-corso", "userReview": "Even though I'm absolutely positive Michel Faber has a beautiful way of writing and makes outstanding word choices, I cannot stop to ask myself: where is the climax? At least in the first two stories. I loved their background and beginning and description and creativity... But there was no point at which I could feel my heart pounding. Maybe it's because I'm accustomed to read conflict after conflict. I had to push myself to read and I eventually finished putting the book down with disappointment."}, {"userName": "Andrés Santiago", "userReviewDate": "Aug 15, 2010", "userURL": "http://www.goodreads.com/user/show/4128372-andr-s-santiago", "userReview": "The most amazing collection of short stories. They vary from the wonderful and lyrical to the frightening and weird. It's a bit like watching Eraserhead by David Lynch. This is Faber's first book and one of his finest"}, {"userName": "Dymbula", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/5838378-dymbula", "userReview": "Povídková knížka plná překvapení. Skvělým, nápaditým a hravým jazykem čtenáři autor předhazuje příběhy mnohdy až potrhlé. Nejvíc na mě zapůsobila poslední - Ovce. Fakt správně černý humor. Líbily se mi úplně všechny."}, {"userName": "lanius_minor", "userReviewDate": "Aug 01, 2016", "userURL": "http://www.goodreads.com/user/show/10298986-lanius-minor", "userReview": "Abych byla přesná, tak 4,5. Více zde: http://www.laniusminor.cz/single-post..."}, {"userName": "Tomáš Radoň", "userReviewDate": "Dec 10, 2014", "userURL": "http://www.goodreads.com/user/show/27359780-tom-rado", "userReview": "Skvělý překlad Viktora Janiše!"}, {"userName": "Dianne Murphy", "userReviewDate": "May 10, 2015", "userURL": "http://www.goodreads.com/user/show/5683958-dianne-murphy", "userReview": "A book of short stories - Faber's early work. Some gems, some completely bewildering, some truly awful. Sorry I ponied up the money for this train wreck."}, {"userName": "Pavel Beneš", "userReviewDate": "Jul 05, 2014", "userURL": "http://www.goodreads.com/user/show/23454952-pavel-bene", "userReview": "Nádherný povídky, v krásně napsaným překladu Viktora janiše. Čte se to samo. A je pak veliká škoda, že to najednou – v nejlepším – skončí."}, {"userName": "Owen Townend", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/75267716-owen-townend", "userReview": "I would have never picked up this collection had it not been for the Under the Skin film. I'm very glad my curiosity took me this far: Faber is a writer that writes the kind of stories I hope to write.\tThough not inherently sci-fi, he does play with the more philosophical aspects and, when not conforming to the genre, he writes considerate speculative fiction. This explores a multitude of complex human relationships from obsession in spite of love to being there for someone in a way that you don't even understand.\tI appreciate certain tales with premises and concepts that soon become apparent though predicting the ending remains disappointing. A couple of stories seem a bit obvious to me and yet not artful enough to keep me invested throughout.\tHowever Faber remains an author on my watch list no matter what he writes, purely because I found and liked him under such unlikely circumstances.Notable Stories•\tSome Rain Must Fall - I wished it had remained with the kids for longer: that kind of trauma should be explored.•\tMiss Fatt and Miss Thinne - though I didn't care for the male gaze, the descriptions were horrifically detailed.•\tThe Tunnel of Love - the love interest is a bit hardhearted but this romance in a sex shop warms my heart."}, {"userName": "Ada", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/38881652-ada", "userReview": "To, že do základní školy plné malých dětských hlaviček vtrhne zoufalý podváděný ubožák s brokovnicí v ruce a potom, co nechá kovovou hlaveň zbraně dostatečně morbidně-teatrálně ocucat svou nevěrnou manželkou, ženě vystřelí mozek z hlavy - to všechno před nechápajícím pidipublikem - to je jen segment z Faberova povídkového experimentu - mnohdy drastického koktejlu, který konzumentům autor servíruje paradoxně dokonale promyšleným chrstnutím do ksichtu. Bez přípravy, stylem rovnou „na věc“ jsou čtenáři stavěni před krátké příběhy postrádající kontext - o to víc tajuplnější, šokující, nutící hledat smysl i výchozí bod pozemských i nadpozemských vyprávění o tisíce podobách. Z textu se dere ven dekadence a neopracovaná syrovost, kterou Faber dosahuje maximálně znejisťujícího účinku na čtenářovo chápání běžného světa a vztahů v něm. Někdy prostě prší je míchanicí surrealismu a expresionismu, cynismu a tragikomiky, kde každá postava, ať letmým a povrchním pohledem sebebanálnější, zápolí se svou navýsost originální a pro publikum přitažlivou existencí. „Lidi už si nedokážou představit, že by někdo mohl mít naděje přesahující jeho vlastní život.“"}, {"userName": "Vicky Churchill", "userReviewDate": "Dec 28, 2016", "userURL": "http://www.goodreads.com/user/show/30323992-vicky-churchill", "userReview": "I haven't read many short story collections, but of the ones I have this one is by far my favourite. The writing is beautiful, though I did expect that as all of the works by Michel Faber I have read before were also written beautifully. The stories themselves are diverse and imaginative and I was left wanting this book to be longer"}, {"userName": "Jules", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/17911821-jules", "userReview": "I didn't think I was going to finish this on, it has certainly taken me some time. The stories are weird and wacky but I just didn't 'get' a lot of them, I kept expecting some kind of punchline that just didn't come. Entertaining but I don't think I would read them again. I much prefer his novels."}, {"userName": "Kim", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/11161028-kim", "userReview": "A varied and interesting collection of short stories from the author renowned for 'The Crimson Petal and the White'. I understand this is his first book and several of these stories certainly shows the promise of what was to come - 7/10."}, {"userName": "Katrina", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/2240622-katrina", "userReview": "This collection started positively but then the stories became strange, a hand with its own conscious, focused on sex or just boring. I didn't finish many of the stories in the second half of this collection."}, {"userName": "Lisa", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/4305546-lisa", "userReview": "поставила бы 3 с половиной звезды, если бы могла"}], "description": "Michel Faber's short stories are markedly diverse-the voice of each is so distinct that the book reads like an anthology of different writers. But Faber's radically inventive style fastens all fifteen stories into a compelling collection deserving of the high praise it garnered in the United Kingdom. One surreal story, \"Fish,\" projects a futuristic world populated with fish swimming in the air. As sharks hover in abandoned corners and human zealots of the Church of the Armageddon loose their fanaticism on the innocent, it's a mother's full-time job to protect her young daughter. The title story, \"Some Rain Must Fall,\" tells of a substitute schoolteacher called on in a crisis, and as she encourages her pupils to express their feelings, we learn the source of the class's trouble: a devastating act that resonates with contemporary America. As Garth Morris wrote in the Mail on Sunday (London), \"these are well-crafted pieces of quiet forlorn intensity in a very real world.\"", "title": "Some Rain Must Fall: And Other Stories", "url": "http://www.goodreads.com/book/show/123066.Some_Rain_Must_Fall", "average": 3.82, "cover": "https://images.gr-assets.com/books/1328876361l/123066.jpg", "reviews": 74, "authors": [{"url": "https://www.goodreads.com/author/show/16272.Michel_Faber", "name": "Michel Faber"}], "type": ["Short Stories", "Fiction", "Fantasy", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/123066.Some_Rain_Must_Fall", "http://www.goodreads.com/book/show/31114473-some-rain-must-fall-and-other-stories", "http://www.goodreads.com/book/show/123067.Some_Rain_Must_Fall_Other_Stories", "http://www.goodreads.com/book/show/13411765-n-kdy-prost-pr", "http://www.goodreads.com/book/show/33897187-ya-mur-ya-mal", "http://www.goodreads.com/book/show/8704004-some-rain-must-fall", "http://www.goodreads.com/book/show/40200.The_Crimson_Petal_and_the_White", "http://www.goodreads.com/book/show/20697435-the-book-of-strange-new-things", "http://www.goodreads.com/book/show/123063.Under_the_Skin", "http://www.goodreads.com/book/show/963940.The_Apple", "http://www.goodreads.com/book/show/123061.The_Courage_Consort", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}