{"ratings": 786, "userreviews": [{"userName": "Sesana", "userReviewDate": "Oct 28, 2016", "userURL": "http://www.goodreads.com/user/show/5172893-sesana", "userReview": "[It's very clear within the first 50 pages that at least one of the mediums will have to be killed. (hide spoiler)]"}, {"userName": "Jennifer Wardrip", "userReviewDate": "Jul 07, 2008", "userURL": "http://www.goodreads.com/user/show/1125613-jennifer-wardrip", "userReview": "Reviewed by Me for TeensReadToo.comI have a thing for zombies. Don't worry, it's not as horrible as it sounds. Okay, yes, it probably is kind of gruesome. But anyway, back to the task at hand, which is Christopher Golden's SOULLESS. I can basically sum up this review in four words: This. Book. Is. Awesome. However, readers have come to expect more from our reviews, so I'll do my best to oblige. The best thing about SOULLESS, besides it's amazing characters, great dialogue, and superb writing, is the actual premise. I can honestly say that I have NEVER run across this plot line in any other book that I've ever read. That point right there makes picking up a copy of the book imperative. So now you're wanting to know what the premise is, right? We've all read myriads of stories about séances. We've also read tons of books about zombies. But have you ever read a book about a mass séance that produces zombies? I didn't think so. This is the dilemma that New York City finds itself in after three leading mediums, Professor Joe Cormier, Annelise Hirsch, and Eric Honen, get the brilliant idea to hold a mass séance on live television. I have to admit, it IS a brilliant idea. While mediums, on their own, can contact someone who has recently died, a group of mediums, \"pooling\" their power and resources, should be able to contact numerous dead, so that they can communicate with the loved ones they left behind. Appearing on the morning show Sunrise, hosted by Amy Tjan and Steve Bell, the three hope to open the lines of communication with all of the recently departed within a few miles of the studio for a few short minutes. Their plan works. Too well. Well enough that hundreds, maybe even thousands, of dead rise from their graves, hungrily searching for the ones they left behind - not to communicate with them, but to eat them. (Yes, I got a little thrill just from typing that. Again, it's that gruesomeness I spoke of earlier.) And so begins SOULLESS, a book that will take you on a wild ride through New York with an unforgettable cast of characters. From the gang member who decides to go searching for his family, to the two college guys who have to put their political differences aside to make it home, to the young actress/singer who just had her heart broken by her girlfriend, to Joe Cormier's daughter sitting in the audience of Sunrise, this is one story that you won't soon forget. Needless to say, I loved SOULLESS. Even if you're not a typical zombie lover, you won't be able to resist this story. Although there's a finite ending to SOULLESS, I really, really hope that Mr. Golden will write more, if not about these same characters, then at least about zombies running rampant, hungering for human flesh. (The thrill, again!) Pick up a copy when it goes on sale on October 21st. You won't regret it - although you might stay up a bit late with the lights on."}, {"userName": "The Flooze", "userReviewDate": "Jan 16, 2009", "userURL": "http://www.goodreads.com/user/show/355739-the-flooze", "userReview": "[WHY THE FUCK AREN'T THEY CREMATING ALL THE DEAD FOLK?? ::headdesk:: Maybe some people deserve to be eaten. (hide spoiler)]"}, {"userName": "Clarice", "userReviewDate": "Nov 15, 2008", "userURL": "http://www.goodreads.com/user/show/43158-clarice", "userReview": "So, I read a zombie book and am terrified of zombies. I think it's because there's no reasoning with zombies. They just want to eat your brains (or in this case, all of you). And are for the most part unstoppable. Yikes!Anyway, this was definitely a scary book. I had to go read something else to counteract the scared of zombie vibe I was in the midst of. Also it was really enjoyable. There are a good variety of characters all with their own stuff going on and I found favorites among them. Overall, an engaging and entertaining read.Yes, I read this in a day due to having to finish so I could be less scared."}, {"userName": "Karin", "userReviewDate": "Aug 16, 2008", "userURL": "http://www.goodreads.com/user/show/72729-karin", "userReview": "For the first time ever, three powerful mediums are going to join hands on a live morning TV show in order to conduct the largest ever seance. The minute they join hands, people in the live studio audience begin to hear voices and feel the bone chilling cold that is so often associated with the spirit world. Panic breaks out and rightly so….the spirits have been given the opportunity to come through an open door into the world of the living and they aren’t wasting any time.Spirits are returning to their dead and decomposing bodies and raising up from their graves. Zombies begin to brutally attack anyone unfortunate enough to get in their path. A group of strangers are thrown together and forced to find a way to survive - even if what they have to do is very unpleasant.Christopher Golden has delivered a genuine horror novel. Blood and gore flow free throughout the chapters. However, as weird as this may sound, the violence portrayed in SOULLESS is done tastefully and not disgusting at all. SOULLESS is a thrill ride - a thrill ride with flesh eating zombies every step of the way."}, {"userName": "Rick Fisher", "userReviewDate": "Mar 22, 2015", "userURL": "http://www.goodreads.com/user/show/5958574-rick-fisher", "userReview": "Very interesting concept. I enjoyed the new twist on how the undead suddenly rise up. There wasn't much to the character development or the overall plot. This read more like a short story with a few extras thrown in."}, {"userName": "Brooke", "userReviewDate": "Oct 31, 2008", "userURL": "http://www.goodreads.com/user/show/126262-brooke", "userReview": "Christopher Golden is one of my favorite horror authors, and while I didn't like Soulless as much as some of his other novels (such as Wildwood Road), I still thought it was enjoyable and mostly well-written. Soulless is a zombie novel with a twist - the zombies are inhabited by the negative side of the dead summoned by mediums on a morning talk show (the positive side having already moved on to the afterlife). These zombies are drawn back to their loved ones in order to taunt and eat them. And then the newly eaten dead people rise up and go find someone else to eat, providing a potentially-never-ending cycle of death.The mediums didn't mean for this to happen, but now they're unconscious and mystically glued together. This being a YA novel, it's up to one of the medium's kids and a bunch of other teens to save the day. Despite being a YA novel, it's pretty grim. The teens have to examine their personal morals as they try to survive the day and find a way to put the dead back in the ground where they belong. Golden has always been very good at making horrific situations seem hopeless and at resolving them without resorting to Hollywood-like flowers and sunshine endings.The only thing that bugged me was that there didn't seem to be an authentic reason why the main characters were the only ones who took action to save the day. From the beginning of the story, it seemed like everyone trapped with the mediums knew what needed to be done to stop the zombies, but they delayed and debated long enough to let the action happen and the teens arrive on the scene. I would have preferred a little more reasoning behind why these kids and why then and not earlier."}, {"userName": "Lucy ", "userReviewDate": "Sep 23, 2008", "userURL": "http://www.goodreads.com/user/show/45923-lucy", "userReview": "Zombies! In New York City!For the first time ever, three powerful mediums join hands on the set of a live broadcast morning show in Times Square. If the seance goes according to plan, there will be a short window where people around the world will have a chance to say goodbye to the spirits of their departed loved ones.But things don't go according to plan. Instead, the mediums slump over, comatose. And as they do, the dead start to rise. They are seeking out their loved ones, but they are also hungry.The great thing about Christopher Golden, and this book, is that he really, really knows New York. When his characters live in New York, it's the real New York, the one I live in and understand, not the glamorized fictional New York you so often see in books like this. This is a New York where people drive on the Merrit and get donuts in Riverdale and realize that there are cemetaries in Washington Heights. It's a New York were people have family in Scarsdale.For nothing other than that, I love this book.Also, I started reading Soulless this morning on the train, and suddenly, in the middle of it, I put it down, and went, \"Crap. There's a cemetary right near my house. If a zombie infestation happens, what's the best possible plan to get me and my family together and safe? Do we have anything useful to barricade the windows with? Maybe we should invest in some more heavy furniture.\"This book is pure zombie fun/horror. If you like zombies and/or New York, this is the book you want to read. Christopher Golden is spot-on with the terror of surviving a zombie infestation."}, {"userName": "Karissa", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/4057501-karissa", "userReview": "This book was an interesting blend of supernatural horror and good ole’ zombie apocalypse. This was well written and hard to put down, I read it in two sittings. The story really explores the question of what people will do to survive. It also looks at the value of saving one person’s life who you know against saving thousands that you don’t know. The book jumps between a lot of different POVs and it was a little hard to keep track of everyone at first. However, this ended up working well for the book. All the different POVs ended up coming together nicely into one cohesive story.Overall this was a well done and engaging read. I would recommend to those who enjoy post-apocalyptic/survival types of stories."}, {"userName": "Tiffany", "userReviewDate": "May 19, 2011", "userURL": "http://www.goodreads.com/user/show/2061456-tiffany", "userReview": "That was intense. I wonder how I would have pictured this book before I watched The Walking Dead. A lot of the horrific imagery the book described could be linked directly to a scene in The Walking Dead for me. The ending was a little anticlimatic but I guess the easiest solution is usually the best? It doesn't take away from the book at least."}, {"userName": "Books On Replay", "userReviewDate": "Oct 02, 2015", "userURL": "http://www.goodreads.com/user/show/26726456-books-on-replay", "userReview": "This book didn't excite me like I thought it would. I made it through about half of it, and I just lost interest and moved onto something else. So many fantastic reviews on here, and I honestly was at least somewhat enjoying it, but I'm just not interested in finishing it. I'd rather read something I'm really excited about. DNF"}, {"userName": "Alicia", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/1806073-alicia", "userReview": "When the dead raise up and co-mingle with the living, all hell breaks loose. However, I couldn't get past the very boring and drawn out introduction of a daughter's dysfunctional relationship with her \"medium\" dad who kind of started this whole mess."}, {"userName": "Lance", "userReviewDate": "May 01, 2014", "userURL": "http://www.goodreads.com/user/show/17628386-lance", "userReview": "One of the more outlandish origins of Zombies I have ever read. They come after a mass seance goes horribly wrong."}, {"userName": "Mari", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/40939701-mari", "userReview": "I haven't read a ton of zombie books; on the basic front of action & survivalism, the book fared well. I appreciate, as always, Golden's approach and creativity.There were a few too many viewpoints in this book, for no real reason I could tell. I appreciated that he wanted ? to make it diverse but everyone asian was described as \"exotic.\" Even the Korean gang member was described as \"he must have had something other than Korean in his background because he had that exotic mixed race look\" (paraphrase) like... there is more than one way to look Korean??? Just not necessary. Phoenix...is that her name? I forgot already. Her internal struggle seemed kind of odd and not super understandable. She's boo-hooing at the end over a single dead guy when ... if we follow the arc of this story right... she essentially stood in the way of that happening HOURS earlier ? I also thought it was a little strange that no one tried to wake them up... that seemed almost like the more logical plan. I guess maybe they tried, though.A fun read..."}, {"userName": "Julieta", "userReviewDate": "May 16, 2017", "userURL": "http://www.goodreads.com/user/show/15807512-julieta", "userReview": "The fact that the zombies had parts of themselves left, that they had memories of who they were before they died, made them a lot scarier than they already were. And let's not forget the fact that they became smarter by the hour and they could even lay traps for the living. This scared the crap out of me. No idea how I'm sleeping tonight lol."}, {"userName": "Kah Cherub", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/5232858-kah-cherub", "userReview": "Pure leftist propaganda..."}, {"userName": "Donna Brown", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/25995065-donna-brown", "userReview": "I'm a real fan of The Walking Dead show so this was an interesting take on zombies for me. I even laughed ad some of the things the zombies said. It was a fast paced spreading of zombies."}, {"userName": "Summer Seeds", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/14485732-summer-seeds", "userReview": "I didn't buy into the premise, and I didn't really feel a connection to any of the characters."}, {"userName": "Ben", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/824532-ben", "userReview": "Scary, quick read. A different take on zombie story, and it gives you an explanation of how the zombie apocalypse. How would you react to the dead coming back? A lot like Snow Blind in that the novel discusses the difference between body, soul and spirit in brief. Truest a book that makes you loose yourself in that universe and ask what if this actually happened"}, {"userName": "B. Hale", "userReviewDate": "Nov 26, 2011", "userURL": "http://www.goodreads.com/user/show/3755315-b-hale", "userReview": "OMG!!!! This book was freaking awesome!!! Soulless was the first book of the horror genre I’ve read and it delivered greatly. I was recently talking to an Aunt of mine about movies not being scary to me ever since the chucky and Michael Myers days when I was younger. But I pick up this book and became full blown frightened after reading the first 30 pages! Lol. There was also the concept of life after death that was fascinating to me but hopefully not true because if when we die, our souls move on but leave behind our spirit which consists of our thoughts, feelings and our thoughts during life (the evilness by the looks of it too) then I don’t see the point of developing any kind of relationship here on earth when in the end it will all mean nothing. I didn’t like how each chapter basically meant the story being told by a different character…until they all met up of course. Also, to me there were no real friendship connections which I thrive on besides the tentative friendship between Tania, Matt, Zack and Sara so that pleased me a bit. I found it annoying that at the studio where the mass séance was held no one thought or took way too long to admit they started the whole zombie apocalypse. When they saw that nothing was working to pull the mediums apart that pretty much confirmed everything and that something drastic had to be done, granted I would have had to work my way up to killing someone too…also because I saw no real friendships I ended up choosing favorite characters, I have to have a favorite(s) in whatever I read…one was Tania because of my soft spot for untainted lesbians and Zack and Sara (as a package only) and that’s because I love any guy knows how to treat a young woman. What made this zombie story so scary… I have seen a lot of zombie movies but I guess because I create the images myself the books seem more real to me but anyway the zombies were freaking intelligent, going specifically home just to eat their loved ones killing whoever they chose on the way…that was just crazy. The fact that they also laid traps was just horrifying which they had done just to get their loved ones who couldn’t be cajoled out of their homes. I’m still freaked out about the zombie leaving the dead baby crying in the car to lure Sara’s father out of his home lol. I’m pretty sure whole generations of families were wiped out throughout the whole ordeal. It was pretty nice too to see people coming together to fight against a shared threat, because with Tania being a mega star they never would have even met if the circumstances had been different. Phoenix was ok but I was annoyed that it took so long for her to admit what was happening and that yes her father was a part of the problem. I just think things could have been resolved much sooner if she hadn’t be in denial and then SHE ended up being the one to end it all only to be mad about it, like Please! So she didn’t make the good list, lol. All in all this book was amazing but I’m not sure if I’ll be reading another horror book anytime soon, it was way too stressful and I tried to stop reading it to get a break but I couldn’t, I ended up staying up all night desperate to get to the conclusion still a good read though."}, {"userName": "Erin", "userReviewDate": "Oct 14, 2009", "userURL": "http://www.goodreads.com/user/show/1733686-erin", "userReview": "I love Christopher Golden. I think he's one of the most imaginative and prolific writers today, and I'm surprised he doesn't have a bigger following among the \"fangirl nation\" that helped series like Twilight ride the pop culture wave to super best-seller status. My own fangirl-ness aside, however, I have to admit -- I was a little underwhelmed by Soulless. I liked the idea -- three powerful mediums merge their talents for the first live, on-air mass seance, after which supernatural chaos ensues -- and Soulless is certainly well-timed for the recent surge of interest in zombie books, TV and movies. But at the risk of sounding glib, Soulless just doesn't have much soul. Soulless tells the story of a modern zombie apocalypse through many different points of view. We're first treated to a first-hand account of the phenomenon through the eyes of the daughter of Professor Joe Cormier, a gifted and ambitious medium who is one of the catalysts of the event. With the help of his spirit guide and the pooled powers of two other well-known mediums, they join hands in a New York City TV studio, \"pooling\" their power and resources to open the lines of communication to all the spirits in the area and urging them to seek out and communicate with their loved ones. Instead of just making contact, legions of dead rise from their graves all over New York. Unfortunately, these are not the people that their families knew and loved. They're manipulative and intelligent husks, motivated only by a ravenous hunger and a desire to fill that emptiness -- by devouring their friends and loved ones, piece by bloody piece. The result is a gore-splashed splatterfest worthy of Bentley Little. (shudder) Golden is a gifted wordsmith and artful with his descriptive language, and that talent produces some stomach-turning sequences. Squeamish (or young) readers may want to stay away.The ensuing race to end the zombie uprising -- and survive -- is predictable, but fun. There is a full cast of stock characters (arrogant college boy and his good-guy class rival, closeted pop star, misguided gang-banger) who unfortunately don't have much time to develop, what with all the dismembering and running-for-their-life going on. Fortunately, the well-paced action and witty dialogue compensate for this weakness. Honestly, Soulless reads like more like a movie script than a book. And that's not what I've come to expect -- and what I most enjoy -- about Golden's writing. Books like Strangewood, Straight on Til Morning and The Boys are Back In Town are propelled by introspection and the inner monologue of the main character. There's none of that here. Just lots of gore, a predictable, pat ending and the a few mindless hours of guilty pleasure reading. But then again, if I need character development with my zombies, there's always The Walking Dead on AMC. ;-)"}, {"userName": "Dia Johnson", "userReviewDate": "Feb 07, 2011", "userURL": "http://www.goodreads.com/user/show/4938897-dia-johnson", "userReview": "I have always been a fan of books that gather suspense, violence, mystery and drama into one pot. Therefore I naturally gravitated towards this book here. After reading the reviews and looking over the summary of the book it seemed to be the perfect read for me. Beside the great use of violence and gore in this zombie novel, many readers also spoke highly of the suspense and mystery, which followed. Written in third person, Christopher Golden’s Soulless, followed the journey of numerous characters as they faced this wide spread chaos. Their paths inevitably cross at the end but that is not before the tragedy and horror they must all face. The story begins by following the character Phoenix, who is the daughter of a famously known medium who makes an appearance on a morning show to undergo a broadcasted séance with other mediums. Their actions were only suppose to result in the contact between individuals and their dead relatives one last time. This assumption was terribly wrong as their séance opened some type of gate to raise the dead from their graves. This horror began within New York but soon after spread like wild fire all throughout neighboring areas. What I liked most about this novel is the fact that these zombies were not the typical monsters you’d see in common media. In this story the zombies were not only fueled by their hunger for human flesh but they were also fueled by the desire to once again connect with their living relatives and loved ones. It wasn’t just the characters that faced emotional conflicts in the story but the dead also had conflicts amongst themselves as they continued to feed on those around them but seemed to hate it while doing so. I loved the originality behind the idea of giving the dead their partial characters back to bring forth a new type of zombie. It became difficult for certain characters to survive as the dead who seemed to still have living memories lured them out. What I also loved about this book is the fact that the words printed on the pages made me really feel as though I was apart of the story. I can recall reading a few pages in class and all of a sudden my heart began to pump faster because I feared for the characters survival, as I was just unaware of the future as them. This way of presenting work is a very good method because the readers will begin to get attached to the characters as they struggled to survive against this incredible zombie outbreak. I have to say that all in all, I highly recommend this novel to all readers. There is a little something for everyone, a little of horror, drama, mystery, adventure and action. This is also not the average zombie story and with such originality, I believe it really has potential at becoming a motion picture. I just might have to read it again LOL."}, {"userName": "YA Reads Book Reviews", "userReviewDate": "Dec 01, 2008", "userURL": "http://www.goodreads.com/user/show/1764232-ya-reads-book-reviews", "userReview": "I’ve always been into the supernatural, and I love the urban fantasy stuff that has been circulating lately. Vampires, werewolves, ghosts – you name it, I’ll read it. But give me something about zombies and I’m more likely to make fun of it . For some reason, zombies and I don’t mesh. They’re the one fictional construct that I just can’t digest. I know it’s irrational (I mean, come on, I like vampires) and honestly, I can’t pinpoint exactly why I feel like this, but its always been this way and I never thought I’d change.Until now.Christopher Golden’s Soulless was so much better than I thought it was going to be. Admittedly, when I picked it up I didn’t really know it was a novel about zombies, so I probably didn’t approach it with the same prejudice that I would if I’d had that information. Silly me didn’t read the blurb properly before I bought it, and I walked out of the store thinking it was a novel about ghosts. I’m happy to report, however, that I’m not sorry I made that mistake.Written in third person, Soulless is one of those novels that follows a whole bunch of different characters through their experiences until they all meet up and cross paths at the end. It starts with Phoenix, the daughter of a renowned Medium who is appearing on the local breakfast news show for a major séance with other known Mediums. No one, not in their wildest dreams, expected that they’d wake the dead for real. Chaos falls upon New York City and quickly spreads to neighbouring communities. Suddenly, America is locked in the biggest stand off of all time: the dead versus the living.What I liked most about this novel was not the zombie, supernatural elements, but the way the characters changed and adjusted to the circumstances around them. What would you do to survive? If it came down to killing just a few innocent people to save several dozen more, could you do it? What exactly would it take to turn you into a murderer? The majority of the novel follows everyone as they run away from trouble, but when they decide to turn around and face trouble head on, these were the questions I found myself thinking. Not surprisingly, some of the characters deliberately put themselves in situations that offered me some answers. And I can’t say I was happy about all of them, either.Fast-paced and action-packed, I could see this making a really great movie. Golden does a superb job of creating a very clear picture of the chaos. And while it was closed off nice and clean, I have to ponder whether there will be a sequel.Soulless wasn’t one of those jaw-dropping, life changing reads, but its definitely worth a go. As long as you’re not too put off by the violence, I reckon everyone will get a little kick out of this one!"}, {"userName": "BizarreLibrary", "userReviewDate": "Mar 26, 2009", "userURL": "http://www.goodreads.com/user/show/1955449-bizarrelibrary", "userReview": "Phoenix Cormier’s father is a professor and just so happens to also talk to the dead. Along with two other very well known mediums, her father plans on communicating with the after life so they can pass messages to the living from their dead loved ones all at once. They do this on a morning New York show called Sunrise. While on live TV, they show all of New York what is happening, but something goes terribly wrong. It seems the spirits have another idea, other then sending messages. It doesn’t take long for all hell to break loose as zombies emerge from the ground. During the novel, the story is told from several people’s points of view of what happens and what they do about it. Soulless is extremely creepy and fast-paced. Zombies scare me in general, so that probably doesn’t help. I like how Golden doesn’t hold back on the gore, even though it’s geared for the young adult, and believe me there is plenty of it. It’s a massive page-turner and I had to read with the lights on. His interpretation of zombies is so different from the normal government virus or witch doctors trying to take over the world. They are like the old-fashion zombies, but not. At first, I was a little skeptical when the zombies started coming out of the ground. Rotting corpses would not have the muscle mass to bust out of a coffin and climb through several pounds of dirt to get out, at least that’s what I tell myself. Regardless, Golden explains somewhat how this happens. These zombies have a drive and a need that makes them stronger than just a dead body. They have no souls and they feel empty. My only issue with this book is with Phoenix. She is so exasperating throughout the novel, but she ends up redeeming herself. I’m fairly certain my issue with Phoenix is a reader to reader thing. I would like to go into more detail with it, but I would give away too many spoilers. I would ask myself though, would you kill one person to save millions?In the end, survival and zombies pretty much sums up this book. If there were a major zombie uprising what would you do and how would you react? Scary thought and I hope I never have to ask myself that."}, {"userName": "♥ Ashleigh ♥  contrary to popular belief i'm not actually mad!", "userReviewDate": "Aug 14, 2011", "userURL": "http://www.goodreads.com/user/show/4690797-ashleigh-contrary-to-popular-belief-i-m-not-actually-mad", "userReview": "Heads up, Possible Spoilers. Continue at your own risk ;)So I waited a bit to long to write an informed detailed review. Though I do recall not really caring about any of the charatcers or being overly interested in their stories until the end. Now the end turned out to be very interesting indeed. For one they actually managed to end the apocalypse! I have never read a book where this has happened before so that was awesome. Now the event that actually had some effect on me towards at least one character. Phoenix spent the whole entire book protecting those who couldn't protect themselves then all this crazy crap went down and it was fairly obvious the only way to survive the zombie apocalypse was to shoot one of the helpless. Well this guy had already been through an ordeal, everyone was arguing, the zombies were about to break in so phoenix steps up and does what needs to be done. Next thing we know its been 5weeks and phoenix is still struggling to live with what she has done, she knows she's saved thousands and thousands of people across America but it doesn't do much to take away from the fact that she had to kill an innocent. Watching her struggle is what got to me. For once we have someone who isn't just blase' about killing anyone. That this is something that is very serious with lasting psychological effects.Pretty much the only other thing I liked about this book was the zombies. Not only did they return home to eat their loved ones but they toremented them as well! The only thing was just disturbingly creepy and fantastic! So that's pretty much all I have to say about this book.Will I be reading more books by this author? Maybe, maybe not. Though I did highly appreciate the unique spin on the zombies, don't get that often.Rating... 2 maybe 2.5 stars. Haven't made my mind up yet"}, {"userName": "Alli", "userReviewDate": "Mar 09, 2011", "userURL": "http://www.goodreads.com/user/show/2058614-alli", "userReview": "Wow. Just. Wow. This book pretty much blew me away. I am somewhat easy to win over when it comes to apocalypses and especially zombies but this was near perfect zombie literature in my opinion. The story grips you nearly right away, the pacing is incredible, I literally could not read it fast enough. It is so action packed and intense and yet amazingly thought provoking at the same time. The whole spirit and soul conundrum is obvious but the more subtle of what it takes to survive of what you become is what got me.The twist to these zombies was amazing. Truly, I could've read more about these zombies for hundreds and hundreds of pages. Particularly creepy was how they got smarter and more devious. Holy awesome terrifyingness. I also loved the varying voices. It got a bit jarring at times switching so fast I had to think about and remember who was talking but when it came down to it, it rarely mattered. It was more about the action but you still heard enough of the characters voice to care about them and marvel about how they were changing and contributing a unique take on what was happening. Unfortunately, the ending almost ruined it a bit for me. Honestly, it was the only reason I didn't start re-reading it right away. It felt wrong. Like it didn't fit somehow. Not the epilogue but how the ending came about ((I wont say more for fear of ruining anything)). I waited for some brilliant twist and it didn't come and while I could be my over analytical self and say that was saying something about the reality of how things end it felt more like there was no other way he could think of to end it. Bummer. I still recommend this book whole heartedly, even if zombies aren't your thing, I think this an incredible read."}, {"userName": "BookNerdette", "userReviewDate": "Dec 08, 2011", "userURL": "http://www.goodreads.com/user/show/2758005-booknerdette", "userReview": "I don’t think I would be spoiling it for you to say this is a book about zombies. You have people like me and you just making it through life the way we think best. Then one day some chaos happens that wakes us up that we are living on borrowed time. Nothing is guaranteed and we should be breathing more and family is very important.The book started off well with a good story that had my interest. It did seem to get hung up on description and past family flashbacks that I tended to skim over.On into the book it drug on for me with the politics discussion. I layed the book down and when I come back to it this weekend – I ment to finish it.After 35% into the book – it picked up somewhat with it reminding me of a movie. Each chapter was on different people in different areas and you just knew they were all linked in some way.This made a fun read for me from this moment on because you want to see how they will all be intertwined and how it would end.I like the characters but had no connection with them. I was reminded of another book I read this year “Dawn of the Dreadfuls”.Mr. Golden I am sorry to say I wouldn’t re-read this book because I dis-liked the ending so much. Toward the end you let it go absolutely gory. I didn’t even finish reading the epilogue because I just was not interested in the characters enough to care."}, {"userName": "Krystle", "userReviewDate": "May 02, 2013", "userURL": "http://www.goodreads.com/user/show/12040266-krystle", "userReview": "The beginning started out fairly normal. I was surprised though, that the zombies appeared rather early on in the story. The first description of the zombies made me cringe and my heart thumping.Christopher has a knack for describing the emotions and expressions of people as they find out about the 'Uprising' endemic. He describes the zombie attacks with great detail and gore, too. I usually HATE anything related to zombies (I have a fear for them), but somehow this book sort of 'drew me in', if you will. There was something about this book when I saw it in a fair that although I had originally picked it up and put it back on the shelves, I was somehow drawn to it and ended up buying it.It might be just me, but I was craving more zombie scenes. Understandably though, a huge chunk of the book writes about how the people keep themselves alive (or not). I got so engrossed in this book that I jumped about an inch in the air at the sound of someone opening my room door.I was really eager to find out about how the zombies would be stopped, and to be honest, I was expecting the little knit of survivors (Jack, Matt, Sara, Noah, Tania & Zack) to survive through the whole thing (ain't gonna say more to spoil it!), but yeah.All in all, it's a very gripping story where the zombies are involved. Just wished there was more zombie action, though. ;)"}, {"userName": "Sarah (saz101)", "userReviewDate": "Jun 27, 2010", "userURL": "http://www.goodreads.com/user/show/3825460-sarah-saz101", "userReview": "I read someone refer to this book as 'the best zombie movie I've ever read,' and I don't think they could be more right. After the world's first televised séance goes horribly wrong, the dead start digging themselves out from their graves, and returning home. They're not just after sweet, juicy, brains (though they'd like some of them too, thanks very much); they're returning to their homes and the people they loved in life ('Honey, I'm home! BRAINS! OMNOMNOMNOM!'). Two college rivals, a young girl and her best friend, a Hanna Montana-esque pop star and an NY gang member fight to survive the zombie apocalypse and stop 'The Uprising'. Meanwhile, Phoenix Cormier fights to protect her father, even though stopping him may be the only way to stop the walking dead. Returning to more 'traditional' zombie lore, Soulless' jombies are not virus infected, but actually the risen dead, digging themselves out from their graves. But they're not mindless; these zombies are clever, they're hungry, and they're not slow--they can run. Oh, and talk. Creepy, much? Soulless is gripping and thrilling, and reading it at night in the dark? Not a good idea--though if you do, you may forego your cardio workout, so maybe it's a win-win."}, {"userName": "GateGypsy", "userReviewDate": "Jan 26, 2009", "userURL": "http://www.goodreads.com/user/show/1366438-gategypsy", "userReview": "Like most of the other reviewers, I have to agree that this book is really great. I'm a huge zombie fan -- as most of the other readers are -- so I, too, was worried about these talking zombies. However, as other reviewers have already voiced, Golden's explanation for why these zombies talk, run, even apparently think and reason, is viable and one that I am willing to accept for the duration of this novel. It's a unique way to create zombies. I did not even once have the urge to slam the book shut, hurl it across the room and shout, \"Heresy!\" I'm sure Golden would be pleased to know that.I haven't read much zombie horror fiction before. I honestly didn't realize that zombies could translate this well onto the page! It was appropriately gory, frightening, gripping, tense... well written!I would recommend this book to other readers, for sure. Especially if you don't mind the blood and gore, 'cause zombies = blood & gore, it's simple math. Lots of people die, in rather gruesome ways.I liked Tania and the best ;-) I also really liked Big Boy & Jack."}], "description": "Newly reissued, the rollicking, action-packed zombie story from one of the genre’s hottest writers!Times Square, New York City: The first ever mass séance is broadcasting live on the Sunrise morning show. If it works, all the spirits of the departed on the other side will have a brief window -- just a few minutes -- to send a final message to their grieving loved ones. Clasping hands in an impenetrable grip, three mediums call to their spirit guides as the audience looks on in breathless anticipation. Then the mediums slump over, slack-jawed -- catatonic. And in cemeteries surrounding Manhattan, fragments of old corpses dig themselves out of the ground . . .The spirits have returned. The dead are walking. They will seek out those who loved them in life, those they left behind . . . but they are savage and they are hungry. They are no longer your mother or father, your brother or sister, your best friend or lover.They are soulless.The horror spreads quickly, droves of the ravenous dead seeking out those they left behind -- shredding flesh from bone, feeding. But a disparate group of unlikely heroes -- two headstrong college rivals, a troubled gang member, a pop star and her bodyguard -- is making its way to the center of the nightmare, fighting to protect their loved ones, fighting for their lives, and fighting to end the madness.", "title": "Soulless", "url": "https://www.goodreads.com/book/show/3348007-soulless", "average": 3.66, "cover": "https://images.gr-assets.com/books/1347521357l/3348007.jpg", "reviews": 113, "authors": [{"url": "https://www.goodreads.com/author/show/4522.Christopher_Golden", "name": "Christopher Golden"}], "type": ["Horror", "Horror", "Young Adult", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/3348007-soulless", "http://www.goodreads.com/book/show/19460554-soulless", "http://www.goodreads.com/book/show/6985544-soulless", "http://www.goodreads.com/book/show/6650355-soulless", "http://www.goodreads.com/book/show/289232.Hellboy", "http://www.goodreads.com/book/show/6721385-new-dead", "http://www.goodreads.com/book/show/17910096-snowblind", "http://www.goodreads.com/book/show/592431.Hellboy", "http://www.goodreads.com/book/show/293389.Buffy_the_Vampire_Slayer"]}