{"ratings": 3416, "userreviews": [{"userName": "Montzalee Wittmann", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/32532051-montzalee-wittmann", "userReview": "Spirit WitchThe Lazy Girl's Guide to Magic, Book 3By: Helen HarperNarrated by: Tanya EbyLOL, This series just gets better! Start from the beginning, you don't want to miss the fun. Something happens in book two that causes Ivy to see ghosts now. It is hilarious! This whole series has kept me laughing. It is a fun series with lots of action, crazy characters, (especially her cat Brutus my favorite), and so much more! This is my new favorite series and I read or listen to over 900 books a year. Be sure to read book 4 too! it isn't in audible.The narrator is super awesome! She makes it so funny, she has the right stuff for these books."}, {"userName": "Berit☀️✨Traveling Sister✨", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/38946743-berit-traveling-sister", "userReview": "Please Helen harper if you’re reading this, please write more books in this amazing series!I have absolutely fallen in love with this series... Ivy and Winter are amazing characters with fabulous interactions.... Ivy and Winter are now officially a couple, and still the banter between them is exceptional....Ivy is just such a brilliant character, I loved when she met Winter’s parents and I loved when she communicated with the ghosts, I just absolutely have a girl crush on the girl! The mystery in this book was very well-developed and kept you guessing and engaged throughout, somethings I definitely did not see coming.... going to pick up a different series from this author, but keeping my fingers crossed there will be more in this series....*** narration:Tanya Eby did amazing just as he did in the previous books!"}, {"userName": "Jacob Proffitt", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/1331641-jacob-proffitt", "userReview": "This is third in a series and I recommend that you at least read the first. It'd be better to read both if you want the full backstory (and you probably do).I liked this one as much as the first. We again have Winter and Ivy working together and that rocked. The difference is that they both want to be working together, finally, and I'm happy to say that Harper managed to make the transition to a stable relationship and still keep the character interactions interesting. Indeed, I think their banter is better now that they have a solid foundation of trust and respect to base it on. It could help that some of their exchanges resemble those between me and Melissa more than a little.The world-building is as light as it ever was, but the story slightly stronger in this one. Which is a bit strange because this is the first time in the series that we have a villain who is outright evil and with fewer redirects and red herrings. Harper makes this work by giving him understandable (though creepy) motivations and keeping the character consistent. Depicting an evil guy who outwits a bunch of people (including our main heroes, sometimes) is tricky and the temptation to pull author caveats that manipulate things in his favor is strong. I think it held together well, though, and I can be a stickler for these things. Part of that is that it wasn't all one-sided—in other words, while the bad guy sometimes outwitted our heroes, they got their own in on him occasionally, too.The weakest part of this novel was the continuing unpunished screw-ups by Torquin. Man, that guy just grates. The only way he isn't dragging the whole story down is that he shows up sparingly enough I don't get completely impatient when he pushes into a scene. Still, I'd dearly like an anvil to fall on his head. Preferably one thrown by the latest victim of his grandiose blathering.Anyway, this is a personal five-star rating and likely a result of a beneficial interaction between being in the right mood and taste alignment.A note about romance and steamy/chaste: This isn't really a romance at all, though the main characters do go from not being together to being together. There's no steam and even the kissing is kept pretty low-key. And that's a good thing, I think. The main relationship concerns with these two is their emotional intimacy and Harper illustrates that through their banter and (fully-clothed) byplay. We know they're having sex, but it's pretty much all inferred by them sharing living space. I'd mark all three novels (so far) as chaste if they were romances, but since they aren't..."}, {"userName": "KatieV", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/18620847-katiev", "userReview": "Lol. Poor Ivy. Ghosts are grumpy and her cat continues to be high maintenance and self-centered. He even pees on the wall out of spite.At least she has Winter."}, {"userName": "Lindsay", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/10326608-lindsay", "userReview": "Ivy Wilde is back and after her brush with necromantic magic she now has the unique ability to see and speak with ghosts. And they're an intrusive and demanding bunch, which is a bit of a problem for someone like Ivy who has dedicated her life to not really doing much at all. As an incentive for Ivy to help the ghosts they let her know about the actions of a mass murderer of witches and soon Ivy and Winter are on the case.This series continues to surprise with it being funny and light entertainment even though the content can be quite dark. The author also goes to some trouble to make each of the books cover quite different material as well as evolving the basic premise around Ivy as slacker and Winter as workaholic. Even Ivy's familiar Brutus (probably the funniest character in the series) gets some solid character moments.I continue to recommend this urban fantasy series."}, {"userName": "Treece", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/1646176-treece", "userReview": "Rating: 4 starsWell. That was fun.This book provides loads of laughs despite some of the dark content. Ivy and Rafe are terrific together and apart. Although in this book they are together mostly. Brutus. Glad he is around to keep everyone on their toes and to me cracking up each time he pulls a stunt.The ending worked. It wasn't twists and turns. Still, it was sitcom-ish and funny. I enjoyed this series and I am not interested in pointing out what didn't work for me at times. That is not important. What is important is that I laughed a lot listening to this. So much so that the saddest scene wasn't as bad as it could have been. Laughter heals all. Especially after a long work day."}, {"userName": "Kevin", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/1660832-kevin", "userReview": "I love this series, I love stories where lazy characters save the day, overcome jerks, or just generally do well. Helen Harper is a very talented author and from her output obviously not lazy like Ivy. I've read her Highland Magic series and this Lazy girl series and the characters and plots have all been excellent, but it's the little touches that she puts in her books that make them worthwhile. For instance, her cat Brutus jumps in a box as any cat lover knows, cats love to do. Ivy closes the lid on the box and whispers to Brutus \"Now we don't know whether you're alive or dead.\"I hope this isn't the final book in the series, I'd really like to see where Ivy goes from here."}, {"userName": "Al *the serial series skipper*", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/4167077-al-the-serial-series-skipper", "userReview": "Our lazy witch extraordinaire is back at it again. Loved it, I hope there are more books to come because Ivy solving crimes is the best thing ever."}, {"userName": "Vannessa", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/4218118-vannessa", "userReview": "I was given this ARC by the author in exchange for an honest review. This was an easy one! I loved it! Ivy is the most hilarious witch and the double act between her and Rafe is just brilliant. They are a perfect couple now! In this one, Ivy has some serious and somewhat irritating side effects as a result of the spell she cast at the end of Star Witch and an investigation into a mass murder comes about because of these side effects. She can now talk to ghosts and is apparently the one in the entire world who can. Now this is where it gets irritating for Ivy as everywhere she goes a ghost seems to pop up to chat to her. Sometimes they are helpful, but more often than not they are demanding and rude. However, Ivy does need their help in catching the murderer, but he is always one step ahead of Ivy and Rafe's investigation. I loved the thrill of this book. Every time it felt like Ivy and Rafe were getting closer in working out who the murderer was or where he might be, they were just that little bit too late to do anything. Ivy was definitely not a lazy witch in this book, as much as she would have liked to be! I know this is the last book in this series, but here I am hopefully wishing that Helen will revisit this series or these characters one day as I have loved reading about them and sharing their relationship and magical journey with them. Thank you again Helen for another fabulous series to read!"}, {"userName": "Whitney (Shooting Stars Reviews)", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/12878912-whitney-shooting-stars-reviews", "userReview": "Reviewed by Whitney@Shooting Stars ReviewsIvy and Winter are practically living together because they can't stay away from each other. And Winter is trying to take care of Ivy since she nearly died. Things are going so good though, when Ivy starts to see ghosts and doesn't understand it. She ends up going to someone for help, and it brings a world of crazy down on her head. Now, she and Winter must help the Order catch a serial killer before he kills again, but they may be too late. This book was really really good. I adored Winter and Ivy together. They were great, and very funny as well. And as always I loved Ivy as well. And then the ending was sort of sad, and strange. Ivy's cat is funny, and a little bit weird too, but it was interesting to read about him. I'm super excited for more now that this one ended like that! I can't wait to see what happens with Winter and Ivy next."}, {"userName": "Alienor", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/16589170-alienor", "userReview": "I like where this series is going! I like Ivy a lot and I like the fact that she doesn't spend one second apologizing for being lazy or unfit. I also like the fact that we're seeing a newly in-love couple and that the story does not revolve around breaking them up - or a love triangle - the silliness of young lovers is actually funny and endearing - why don't we see this more? There are also some fabulously annoying (Tarquin) or cantankerous (Grenville) characters that add spice to the whole thing. And as usual, Brutus saves the day;0)I started reading Bo Blackman, but the Slouch Witch series is my favorite."}, {"userName": "Alice", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/37154381-alice", "userReview": "This was fun! I've really enjoyed this series. The mostly-lighthearted adventures of Ivy and her very rude cat have been a great source of comfort to me while the world's been going crazy."}, {"userName": "Cheesecake", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/19829414-cheesecake", "userReview": "Tanya Eby reads again and is perfect for the snarky wit that endears me to these books!Well that was another fun read! Brutus is being less secretive... well a wee bit. Winter is being wonderful and stuffy at the same time. Ivy is her usual self, thank goodness!Perfect book to listen to when you're having a crappy week!This one starts off a few weeks after the last book ended. Ivy is pretty much recovered except for her regrettable ability to see and talk to ghosts. Now they won't leave her alone. But the ghosts tell her about a serial killer that nobody but his victims know about yet and Ivy is too good of a person to ignore that info.All the old characters are back. Tarquin is even more self absorbed if that's possible. Somehow it's not as annoying now that Ivy has Winter's love and other friends who believe in her and know that he's an ass.Anyways, look forward to the next book!"}, {"userName": "Diane ~Firefly~", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/3264885-diane-firefly", "userReview": "Ivy and Rafe are very good together and he is still pissed at The Order for putting her in danger last book. However, he doesn't deal well with unemployment, so he is eager to help Ivy when she discovers she can talk to ghosts and there is a man killing witches. The Order as well as the police get involved in the hunt. I really love this series and hope there will be more books. I loved seeing how much people in The Order missed Rafe and Ivy wanting what is best for him and her."}, {"userName": "Christa Schönmann Abbühl", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/45642073-christa-sch-nmann-abb-hl", "userReview": "I enjoy the heck out of reading about a lazy, irreverent, disorganized, plump women, who turns being a coach potato into an art form, and still gets her man, and saves the day. Because she is also competent, kind, witty, ingenious, courageous, and loyal. And she does not give a shit. The rest of the cast is nice, too, especially Brutus. I want to spend more time in that world and just hang out with the awesomeness that is Ivy."}, {"userName": "C.J.", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/14201049-c-j", "userReview": "This was a fantastic read with great mystery, humour and romance. I'm assuming that this is the last of this series, if it is I'm very happy with how it ended. Although I would like to see more Ivy and Rafe and especially Brutus. Recommend."}, {"userName": "Lexie", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/712966-lexie", "userReview": "I love the fact that Rafe & Ivy have fallen into this pattern of affectionate indulgence when the other goes a bit hare brained."}, {"userName": "May", "userReviewDate": "Aug 31, 2017", "userURL": "http://www.goodreads.com/user/show/68013693-may", "userReview": "Love it! The ghosts are really funny, and it was fun to see Ivy as her usual self! The Ivy/Winter moments were cute too. I could really tell that Ivy and Winter brought out the best within each other, and they make one kickass team. There was a lot of character growth for both of them, and we can also see how Ivy's idea of what the Order is and stands for changed. She thought they were crazy and strict in the first book, and now she really understands how the Order keeps everything in check. The ending was satisfying and tied up the loose ends too. I also liked that the epilogue was told from Brutus's perspective.Summary:Strong heroineNeat mysteryGhosts were really funCute Winter x Ivy moments"}, {"userName": "Joy (Otherworldly Romance)", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/3794117-joy-otherworldly-romance", "userReview": "READ: Casting Cats in \"The Lazy Girl's Guide to Magic\" series by Helen HarperThe final book in \"The Lazy Girl's Guide to Magic\" series is not as good as the first two, I have to be honest. I think it's because half the fun of the previews books was in figuring out who the bad guy was. In \"Spirit Witch\", we find out immediately who the bad guy is.Overall, I still really enjoyed this book and the entire series!"}, {"userName": "Cherry Mischievous", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/1150670-cherry-mischievous", "userReview": "My Thoughts:Now innocent little Brutus… I also like the fact that this cat familiar is displaying more and more cannily intelligent behaviour… A cat who can ring Ivy on her mobile?!?… Oohh… I wonder what else the author is going to make Brutus do to torture Ivy??… now, there’s a thought!By the way, what’s with the wand? Ivy never uses a wand. She’s too lazy for that. Anyways, this book has the best cover yet in the entire series thus far! Hopefully it will be uphill from here on with the arts department for this series rather than downhill… **fingers crossed**Another good thing going for The Lazy Girl’s Guide To Magic series, is that, it always ends the book nicely. Sure, it leaves hints that there are more books to come, this is a series after all. However, it never leaves a book with a big gaping cliffhanger that you want to smack the author with the book upside the head. Authors like that tends to be unfollowed by me unless they have a really really masterful voice. So for the mediocre ones, they get even less chance of being read, never mind bought.This series seems to be, not only “growing” on me, but also “addictive”. So be warned! Couldn’t wait for the next Ivy Wilde book to come out!Empirical Evaluation:Story telling quality = 4Character development = 4Story itself = 4Writing Style = 4.5Ending = 4.5World building = 4.5Cover art = 4.5Pace = 4.5Plot = 4.5Overall Rating: 4.5 out of 5"}, {"userName": "Jen", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/6107433-jen", "userReview": "I'll miss Ivy. I enjoyed this series so much.I think overall, it was a pretty good series. I was surprised about it because I did read another series by the author and I remember dropping it around maybe book 4 or 5 because I got really annoyed with the characters. It's different with me. I can take having plot holes and having a lot of editing mistakes but I really can't take annoying or boring characters. I really liked the characters here, especially Brutus. I gave it 4 points because I found the scene with Ivy meeting Winter's parents lacking. Why does his dad keep looking at Ivy that way? Seriously? Why isn't he freaking out that there's a talking cat like all the others? Also, I would have loved to hear more about Ivy's family as well. There's almost no information about them.Overall, I highly recommend this series for those looking for a light, fun and action-packed UF series."}, {"userName": "Laura", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/19369208-laura", "userReview": "The third book in this series, like the second, is quite dark: a serial killer is on the loose and thanks to the necromantic chaos in Star Witch (book 2), Ivy is uniquely set up to help, even though it once again hampers her plans to be lazy as she can interact with ghosts. Although the subject matter is quite dark, the author keeps the writing light with Ivy's internal monologue, banter with partner Winter, and the humor of her demanding cat. It's a little longer than the last 2, I'd say, but still a fairly quick and easy read. A fun mystery to wrap up this urban fantasy trilogy, when you're tromping along with Ivy, lagging behind the efficient, striding Winter, and being tsked at by the dead, instead of in bed with biscuits."}, {"userName": "Sandra", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/2650335-sandra", "userReview": "Ivy & Rafe are now an item, this being the 3rd book. Rafe was not impressed with his Boss almost getting Ivy killed in the previous book so he quit The Order. Unfortunately, almost being killed by a necromancer has left Ivy with some after effects ... she sees cursed dead people. Especially dead witches.That is how they find out about a serial killer who targets witches. He's a Null, so magic doesn't affect him, which is hard for most witches to comprehend. Once again Ivy is the brains who figures out where to find the killer, despite her laziness and Rafe is the logical one who deals with the authorities.Lots of narrow escapes, hidden rooms, bad cat Brutus, a plethora of cursed ghosts, bruises & crematoria.Always enjoy Helen's stories."}, {"userName": "Sharon Mariampillai", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/28086295-sharon-mariampillai", "userReview": "Thank you Sharon J for recommending this series to me. This was an incredible read. I fell in love with this series right from the start. This installment just solidified my love for it. Ivy and Winter are fantastic characters. I loved that we got to see them as a couple in this book. They were cute, especially when they banter. My favorite character is still Ivy. She is my type of heroine. She is sassy, bad ass, and funny. I love how she is smarter than she leads on, and that she really has a gift for helping people. The mystery in this book was amazing. I was engaged through the book. I hope there will be more of Ivy and Winter's story. The ending was awesome. Overall, an amazing read."}, {"userName": "Sara", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/4524856-sara", "userReview": "I bloody love Ivy and Winter! Seriously, these two are so funny together. And they are a really cute couple! They obviously love each other a lot and are so perfect for each other. I would have loved to read more about them. It felt like the book ended too soon. And although I enjoyed the epilogue from Brutus' POV, I still missed Ivy or Winter's POV. And I would have liked it to be a longer epilogue too. I will miss these two. I hope there will be a 4th book. Or was it the last? Even a short novella showing how they're faring will do. What about a baby? Or a wedding? Anything. Please!"}, {"userName": "Emi", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/17950608-emi", "userReview": "Cette série ❤J'aime les personnages d'amour. Y compris le chat Brutus (surtout le chat Brutus peut être même!) 😉Encore une fois une enquête encore plus poussée et travaillée que dans les deux précédents tomes, les personnages gagnent en densité et en intensité (même si je ne pensais pas que c'était possible!)Beaucoup d'humour, de subtilité, de personnages forts mais sans que l'on tombe dans l'exagération ou la caricature.Ça se lit tout seul, c'est savoureux.Et je suis en deuil que ce soit terminé (Même s'il me reste une Novella à lire)"}, {"userName": "Eva", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/11765364-eva", "userReview": "Foooood, B****! 😂"}, {"userName": "Aparajita Mukherjee", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/15564946-aparajita-mukherjee", "userReview": "Hilarious... Read the last two books back to back without wasting any time... Not ready to let go of Brutus just yet... Oh Yes! Also Wilde and Winter... Fervently wishing for Book 4..."}, {"userName": "Jay Collins", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/56464474-jay-collins", "userReview": "3.5 Stars, much like the other two, It is a light read and pretty fun book even with a serial killer as the main bad guy."}, {"userName": "Alicia McCalla", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/7228238-alicia-mccalla", "userReview": "I have enjoyed this series. Lots of great action, humor, and mystery. Brutus the cat is a total hoot. I can’t wait to read more of this series."}], "description": "If anyone appreciates what it means to be dead to the world, it's Ivy Wilde. Barely recovered from her brush with necromancy, Ivy is flung once more into a world of intrigue, adventure and potential death and disaster. It's not her fault - it just so turns out that she's now the only person in the entire world who can communicate with the dead. And they're a chatty bunch with a list of demands. When the ghosts offer information about a witch-hating mass murderer in return for Ivy's help, she has no choice but to get involved. She might be getting herself into more trouble than she realises though - and that's even before she's dragged to Sunday dinner so she can meet Winter's family...", "title": "Spirit Witch\n      \n          (The Lazy Girl's Guide to Magic #3)", "url": "http://www.goodreads.com/book/show/35489715-spirit-witch", "average": 4.29, "cover": "https://images.gr-assets.com/books/1498041920l/35489715.jpg", "reviews": 246, "authors": [{"url": "https://www.goodreads.com/author/show/6875729.Helen_Harper", "name": "Helen Harper"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/35489715-spirit-witch", "http://www.goodreads.com/book/show/36680752-spirit-witch", "http://www.goodreads.com/book/show/17191839-bloodfire", "http://www.goodreads.com/book/show/17191855-bloodmagic", "http://www.goodreads.com/book/show/17568427-bloodrage", "http://www.goodreads.com/book/show/17837545-blood-politics", "http://www.goodreads.com/book/show/18247645-bloodlust", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}