{"ratings": 1419, "userreviews": [{"userName": "Mike (the Paladin)", "userReviewDate": "Nov 19, 2015", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "I read this on my Kindle and then tried the audio...no big difference:Again with the dreaded 3 star rating. This of course can mean anything it seems. For me it can mean anything from pretty good to not good but well written.This is an interesting book, with an interesting plot, based on an interesting idea. I definitely plan to follow the series.On Earth ruled by a totalitarian government fighting a civil war with the colonies of the outer planets the people are controlled and \"happy\". You better be happy because if you aren't, if you're different, if you want to think differently than everyone else there's a place for you in reeducation. And those \"places\" get progressively unpleasant. Really unpleasant.The outer planets were once controlled by improved human troops. Bigger, stronger, faster, more intelligent. But they lost control of them. Now they're called The Highborn...humans are, \"premen\".Then there are those few people who just insist on thinking for themselves....you know being reeducated.The book begins interestingly and it pulled me right in. Then about a quarter of the way in it just began to lose my interest. It's not necessarily \"slow\" there is action it just flagged somehow. I had to hang on tight and make myself go on. Then about the last quarter of the book, it picked back up and became very interesting.So, hang in there. I like the book, I like the story and I plan to read the next in the series."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "Again with the dreaded 3 star rating. This of course can mean anything it seems. For me it can mean anything from pretty good to not good but well written.This is an interesting book, with an interesting plot, based on an interesting idea. I definitely plan to follow the series.On Earth ruled by a totalitarian government fighting a civil war with the colonies of the outer planets the people are controlled and \"happy\". You better be happy because if you aren't, if you're different, if you want to think differently than everyone else there's a place for you in reeducation. And those \"places\" get progressively unpleasant. Really unpleasant.The outer planets were once controlled by improved human troops. Bigger, stronger, faster, more intelligent. But they lost control of them. Now they're called The Highborn...humans are, \"premen\".Then there are those few people who just insist on thinking for themselves....you know being reeducated.The book begins interestingly and it pulled me right in. Then about a quarter of the way in it just began to lose my interest. It's not necessarily \"slow\" there is action it just flagged somehow. I had to hang on tight and make myself go on. Then about the last quarter of the book, it picked back up and became very interesting.So, hang in there. I like the book, I like the story and I plan to read the next in the series."}, {"userName": "Glenn Thurmond", "userReviewDate": "Nov 12, 2014", "userURL": "http://www.goodreads.com/user/show/30326150-glenn-thurmond", "userReview": "1 star Mr Heppner of all your books, this is the worst one I've read or at least tried to read.unrealistic, characters weird, story line wanders like a writing that is not following a story outline. This may be a poor start for a series. can't spend the money to find out."}, {"userName": "Steven Stennett", "userReviewDate": "Jan 17, 2014", "userURL": "http://www.goodreads.com/user/show/18562660-steven-stennett", "userReview": "Reminds me of the cinema on a Saturday morning back in the day, when you went to see something like Flash Gorden. A rip roaring yarn that you don't have to be overly concerned about the science fiction content. Solar system based warfare done really well, which sets it apart from the usual intergalactic battles that are waged!"}, {"userName": "Gabriel", "userReviewDate": "Nov 10, 2010", "userURL": "http://www.goodreads.com/user/show/4045464-gabriel", "userReview": "Entertaining but the book is somewhat riddled with repeated passages and could have used a more thorough editor."}, {"userName": "Michael", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/12256415-michael", "userReview": "Overall, this is a very good story and plot - I could believe the scenario - and well worth the 99 cent Kindle price. I am going to buy the second book in the series to see where the author takes me.As another review said, this one could really use an editor / proofreader to spell chack as well as to make sure the words are on the right context in the sentence as it did become annoying here and there: where vs. wear, etc.Editing aside, this is a good tale."}, {"userName": "Charles  van Buren", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/47208326-charles-van-buren", "userReview": "Star soldier, August 21, 2014Verified Purchase(What's this?)This review is from: Star Soldier (Doom Star Book 1) (Kindle Edition)A good read with something to say about individualism in a seemingly impossible situation. A situation in which totalitarian factions don't allow thinking for ones self. I will buy the sequel."}, {"userName": "robert la barbera", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/43621951-robert-la-barbera", "userReview": "Two starsA long drawn out epic. To hard to follow for me, you must sit down and read the. Sole book at once"}, {"userName": "Perry Reed", "userReviewDate": "Nov 25, 2010", "userURL": "http://www.goodreads.com/user/show/3854708-perry-reed", "userReview": "The Doom Star series of books are one of the best sci-fi book series I've read in a very long time!They're set in the distant future where Earth and most of the inner planets in our solar system are ruled by the communist Social Unity, who brutally repress their subjects. The main character, Martin Kluge, starts the first book by escaping the Sun Works Factory, an enormous space station ringing Mercury. He flees to Earth where most people live in giant cities buried miles deep into the ground.As bad as things are under the Social Unity rule, they could get worse, and very quickly they do. The SU rulers had previously created a genetically enhanced super race called thr Highborn, designed to be their army and fight their wars for them. Unfortunately for the SU, the Highborn rebelled and attached the SU and an interplanetary war began.If they SU were the worst sort of communists, the Highborn took more or less the opposite approach, admiring the Nazis of 20th century Earth, emulating the German assumption that they were of a superior race. Genetically speaking, the Highborn were right, being bigger, stronger, and smarter than normal humans.Kluge hasn't been getting along very well on Earth and when the Highborn attack it first helps save his life. He soon finds himself drafted into a human army fighting on the Highborn side of the war, but between the Nazi-like Highborn and communist Social Unity, neither side are the \"good guys\". Kluge wishes nothing more than to find another option, possibly on Mars, home to a group of humans who have rebelled against SU but have not (yet) fallen to the Highborn, or maybe to the outer planets where there are rumors of free humans remaining...Having finished books one through three very quickly, I cannot wait for book four to be released."}, {"userName": "Mike Nemeth", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/5728783-mike-nemeth", "userReview": "Vaughn Heppner launches into his Doom Star series with a vengence. Marten Kluge is a pain in the neck kind of guy who happens to live in space with his parents. He didn't get much of a break growing up, and life got a lot worse when his family organized a union rebellion that was stomped by the government. Forced into a life of hiding, he helps when he can. Then his mother and father are killed and he must escape to Earth. There he attempts to blend in. But society has become Big Brother meets political correctness. He fits in about as much as a dinosaur in the Michael Crighton thriller Jurassic Park. But that's OK in Marten's case. His tenacity gets him through. And his fighter's spirit keeps him alive. The super soldiers created to protect Earth actually begin to take it over and Marten is drafted to fight. He picks the super soldiers who think humans as nothing but cannon fodder. Not good. But he stays alive. Somehow. Loved this book."}, {"userName": "Kevin", "userReviewDate": "Apr 03, 2015", "userURL": "http://www.goodreads.com/user/show/2478157-kevin", "userReview": "An interesting start to a series. Earth is under socialist rule. Vaughn makes out all socialists to be idiots. THe biggest idiots are the party leaders. This seems to me a stereotype used in these types of books. Get over that and you have a good story brewing.The oppressed are sent to war against super humans (made by humans but turned against their makers). Some who survive but are captured are offered the opportunity to join the super humans in their war. Basically slaves whichever way they look.Now that the key characters are on the side of the \"high born\" we get a little revenge against the socialists. But our hero realizes this isn't freedom and sets things up for the second book.I'm hoping this develops more into military sci-fi and not political if that is possible. At least keep the party leader character's stupidity out of the story to keep it realistic."}, {"userName": "Richard", "userReviewDate": "Aug 14, 2011", "userURL": "http://www.goodreads.com/user/show/798841-richard", "userReview": "Bleak, dark, intense, grim, brutal, hopelessness, gloomy, suffocating...not the best way to described this quick-paced futuristic sci-fi military novel. As bleak as Star Soldier (Doom Star #1) is, I enjoyed reading this sci-fi novel and the way the story unfolded.Earth in the future is a planet ruled with an iron fist by the Social Unity, similar to 1984 or Nazi Germany, lots of paranoia. Due to overcrowding on the surface, most people are forced to live in underground cities. Planets within the solar system has been conquered and colonized and there is an enemy determined to conquer Earth as any cost. Looking forward to the rest of the Doom Star series. The one minor issue I had was the amount of typos, which was disappointing."}, {"userName": "Robert", "userReviewDate": "Jan 22, 2012", "userURL": "http://www.goodreads.com/user/show/7142790-robert", "userReview": "I read the first book off of the Kindle Lenders Library for free. The concept is valid, the story is ok, not a lot of closure in character story lines. As soon as a character becomes interesting it dies or disappears from the story. One character is introduce then poof, never mentioned again. Maybe they reappear elsewhere? The worst thing about this book is the editing. When you have to read a paragraph three times and then still end up guessing what the author intended to say, it is not edited well. If you need a free editor, send me your writing, I will edit it for you. It won't be Shakespearean prose, but it will be understandable.."}, {"userName": "Campbell, c", "userReviewDate": "Apr 28, 2015", "userURL": "http://www.goodreads.com/user/show/34439915-campbell-c", "userReview": "Will earth survive?Third set of books by this author. Slowly I get to figuring out where he is going but once established I can put it down. Have gotten used to audio books so instead of being lazy I. An work and listen. Young man and his family have hidden out and fought controlling factions until the loss of his parents. He changes his actions to protect himself and find way to continue course of destruction of ruling class. Then he goes on to face the Doom Star. Downloading next book now. Good reading to you."}, {"userName": "Doc", "userReviewDate": "Dec 09, 2010", "userURL": "http://www.goodreads.com/user/show/1591120-doc", "userReview": "I have very mixed feelings about this whole series.The author is clearly not polished. Much of the writing is quite good, then I'll come across an incorrect word usage (verses vs. versus, used repeatedly), awkward sentence construction, or just something a bit weird that a good editor would correct. Which leads me to believe that these are self-edited and self-published.The overall plot is interesting, although it has some holes. The characters are a bit shallow/cardboard, as well.And that said, I've read the first few books in the series because I wanted to see how it all comes out."}, {"userName": "Arjen Schwarz", "userReviewDate": "Jan 23, 2011", "userURL": "http://www.goodreads.com/user/show/1986593-arjen-schwarz", "userReview": "The first part of a series, but it didn't convince me enough to read the other books. The background for the story was a bit over the top in how it was set up. It also didn't really try to explain the inconsistencies inherent in the various governments, or how they came to be. That I could deal with, but the story simply didn't work for me either. There was no connection with the protagonist that could draw you into the story."}, {"userName": "Eve Mcfadden", "userReviewDate": "Feb 11, 2011", "userURL": "http://www.goodreads.com/user/show/4076250-eve-mcfadden", "userReview": "This is the first in a great SF series, the first SF I've read in a while. There are a lot of plots, but they all mesh and Heppner keeps them all from getting tangled. There are interesting themes about politics, freedom, security and the dangers of science, and what makes one human. One roots for Marten Kluge, the hero, but also for various other characters, such as Osadar Di, a woman who's in the wrong place at the wrong time once too often."}, {"userName": "Mark", "userReviewDate": "Jul 21, 2011", "userURL": "http://www.goodreads.com/user/show/5764934-mark", "userReview": "Took a while to empathise with the main character, just about got there in the end. I was not convinced that the author managed to convey the sheer scale of some of the concepts, geology, geography or space which contributed to my edging towards indifferent response to the book. I'm not sure I'll move through the series which, is unusual for me as I love a good long read :)"}, {"userName": "Stephanie", "userReviewDate": "Apr 11, 2016", "userURL": "http://www.goodreads.com/user/show/1830303-stephanie", "userReview": "Military science fiction. Good story. Interesting how the plot draws out. Kid is on orbiting space station (really, really huge) and parent die while he escapes. Next, he is on Earth. Overpopulation is ridiculously high and there were a few issues I had with the science in this thing. Otherwise. I think you will enjoy this. Looking forward to the next in this series."}, {"userName": "Sonja", "userReviewDate": "Nov 19, 2014", "userURL": "http://www.goodreads.com/user/show/5685641-sonja", "userReview": "Great character development...Another fascinating group of characters that are quick to grab your interest. Well developed storyline, but at times a little too much detail in the strategy of the war games for my taste. I will continue reading this series because I've grown very fond of Marten and look forward to his ongoing quest for freedom."}, {"userName": "Francis J Mallalieu", "userReviewDate": "May 08, 2016", "userURL": "http://www.goodreads.com/user/show/40192469-francis-j-mallalieu", "userReview": "Viciousness, misery and desperation.The story of a man's journey from an orbital station around Mercury to the depths of an underground mine, then to the slaughterhouse of a war's front lines. Compelling and well written. The lead protagonist is well developed and very sympathetic.A very good book, I could not put it down."}, {"userName": "Erica", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/5098482-erica", "userReview": "Not overly thrilled with this recommendation from the hubby. He says the series gets better from here; we'll see if I believe him and try book 2. Lots of description, war account, etc, and less character development. We'll see what I do with the series."}, {"userName": "David", "userReviewDate": "Feb 10, 2014", "userURL": "http://www.goodreads.com/user/show/5576199-david", "userReview": "I had not come across this author before but took a chance and really enjoyed the book. Pretty hard-core military action with interesting protagonist and foes. Will definitely read the others in this series."}, {"userName": "Russell Quinton", "userReviewDate": "Apr 23, 2016", "userURL": "http://www.goodreads.com/user/show/38780866-russell-quinton", "userReview": "A very good space opera war story.This author rattles a 6 on this one. If the rest of the series is this good it will keep me busy for a few days. My opinion this book is as good as the best of space war stories I have read.Regardsrhqjr"}, {"userName": "Shelly Singhal", "userReviewDate": "Feb 12, 2016", "userURL": "http://www.goodreads.com/user/show/44196062-shelly-singhal", "userReview": "Great, fast paced storyLots of fast action and brutal violence. This was interesting in that it was hard to pick a side to cheer for. Both sides were pretty bad. Good fun to read and fast paced."}, {"userName": "Walton Wells", "userReviewDate": "Mar 04, 2015", "userURL": "http://www.goodreads.com/user/show/35564122-walton-wells", "userReview": "Good ReadThe principal character portrayal was excellent and with style. The end was a little disappointing because of the abruptness. However I plan on reading the follow on piece."}, {"userName": "Carl Bailey", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/26747724-carl-bailey", "userReview": "View of the future under socialist rule mixed with space colonization and a rising new fascism. More twists and sub-plots than you can keep track of. Underlying theme is the impact of one man in the scheme of things. After this one I had to read the rest of the series and did so in two weeks."}, {"userName": "Scott Voyles", "userReviewDate": "Dec 18, 2014", "userURL": "http://www.goodreads.com/user/show/28113588-scott-voyles", "userReview": "Good readingI really like this author and in this new series things started slow but got interesting really quick. As usual there is enough reality to keep things in check but still make for a fascinating read"}, {"userName": "janice moore", "userReviewDate": "Apr 08, 2016", "userURL": "http://www.goodreads.com/user/show/38378438-janice-moore", "userReview": "ReviewUncertain but three stars is as high as I could go. The plot was slow to develop and too much like Nazi Germany, slavery; and the high born were all bad guys. Surely some of them could have a good qualities?"}, {"userName": "Karleen", "userReviewDate": "Sep 17, 2013", "userURL": "http://www.goodreads.com/user/show/2190618-karleen", "userReview": "I would recommend this series. Well written & fast paced."}], "description": "It’s survival of the fittest in a terrible war of extinction! Created in the gene labs as super soldiers, the Highborn decided to replace the obsolete Homo sapiens. They pirated the Doom Stars and captured the Sun Works Ring around Mercury. Now, they rain asteroids, orbital fighters and nine-foot drop troops onto Earth in a relentless tide of conquest. Marten Kluge is on the receiving end. Hounded by Thought Police, he lives like an ant in a kilometer-deep city. The invasion frees him from a re-education camp but lands him in the military, fighting for the wrong side. STAR SOLDIER is the story of techno hell in a merciless war, with too many surprises for any grunt’s sanity.", "title": "Star Soldier\n      \n          (Doom Star #1)", "url": "http://www.goodreads.com/book/show/8642055-star-soldier", "average": 3.67, "cover": "https://images.gr-assets.com/books/1329790140l/8642055.jpg", "reviews": 54, "authors": [{"url": "https://www.goodreads.com/author/show/702995.Vaughn_Heppner", "name": "Vaughn Heppner"}], "type": ["Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/8642055-star-soldier", "http://www.goodreads.com/book/show/22645952-star-soldier", "http://www.goodreads.com/book/show/23146375-the-lost-starship", "http://www.goodreads.com/book/show/24616247-the-lost-command", "http://www.goodreads.com/book/show/25605656-the-lost-destroyer", "http://www.goodreads.com/book/show/18713456-assault-troopers", "http://www.goodreads.com/book/show/28067648-the-lost-colony", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}