{"ratings": 2668, "userreviews": [{"userName": "Duane", "userReviewDate": "Oct 26, 2016", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "1969 National Book Award winner.Kosinski is probably best known for his novels The Painted Bird and Being There, which was made into a 1971 film starring Peter Sellers and Shirley MacLaine. But most critics agree that this book, Steps, is his best work. It's listed as a novel but it feels more like a collection of short stories, but even that doesn't describe it properly. David Foster Wallace called it \"a collection of unbelievably creepy little allegorical tableaux done in a terse elegant voice that's like nothing else anywhere ever\". I would describe it as a collection of anecdotal tales, each with it's own type of shock factor that is in some instances quite disturbing, and some of them as short as a paragraph. It's powerful writing, the kind that places it in a category of it's own, the kind one doesn't soon forget. Wallace compared it to Kafka's Fragments saying \"it is better than anything else he ever did combined\". Kosinski took his own life in May 1991, he was 57."}, {"userName": "Jenn(ifer)", "userReviewDate": "Jan 11, 2013", "userURL": "http://www.goodreads.com/user/show/780933-jenn-ifer", "userReview": "What a curious little book...Many fans of David Foster Wallace are familiar with a short essay he wrote entitled \"Overlooked,\" where the man Himself discusses 5 U.S. novels written after 1960 that he considers to be \"direly under appreciated.\" I discovered this essay while reading Gass's 'Omensetter's Luck' (also on the list) which I consider to be one of the top 10 brain explodingly awesome books I've ever read. Another book on the list was David Markson's 'Wittgenstein's Mistress,' which I am still puzzling over and am completely in awe of. Naturally, I wanted to read the rest of the DFW 5. And that's how I ended up here, reading Jerzy Konsinski's 'Steps.'Wallace wrote, \"'Steps' gets called a novel but it is really a collection of unbelievably creepy little allegorical tableaux done in a terse elegant voice that’s like nothing else anywhere ever.\" Bestiality, a woman in a cage, gang rape --- creepy indeed. It was a good little book. I didn't love it, but it was engaging and also a super quick read.What I found myself much more interested in than the book was Jerzy Kosinski himself, for undoubtedly some of this had to be autobiographical. Turns out Kosinski was a Polish immigrant, came to the U.S. when he was 24, worked odd jobs ... yadda yadda yadda... twelve years later he won the National Book Award for 'Steps.' Quite a feat. He married a wealthy woman, lived a life of luxury, kept the company of Hollywood royalty and titans of industry. He wrote several best selling novels; one was even made into a film. Yet at the age of 57, Kosinski was found dead in his bathtub with a plastic bag over his head. Why? Turns out, Kosinski was a fraud. Allegedly. People came forward stating that while Kosinski provided the ideas for his books, the editors did the actual writing. Another accusation was that Kosinski plagiarized 'Being There' from a Polish novel. The final blow was the discovery that the childhood atrocities he claimed to have endured were all fictions (he had told the public that 'The Painted Bird' was autobiographical). The validity of all of these allegations is questionable, but true or false, they ended his literary career and Kosinski's star came crashing down. In his suicide note, Kosinski merely wrote these words: \"I am going to put myself to sleep now for a bit longer than usual. Call the time Eternity.\"Jerzy Kosinsky (1933-1991)****Ghostwritten or not, 3/5 starsLovers are not snails; they don't have to protrude from their shells and meet each other halfway. Meet me within your own self.****Here's a link to the Wallace essay if you're interested: http://www.salon.com/1999/04/12/wallace/"}, {"userName": "Bill  Kerwin", "userReviewDate": "Mar 04, 2009", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "\"Steps\" starts out as a classic: brief tales of sexual exploitation and humiliation occasionally varied with anecdotes of nonsexual dominance and submission, narrated in many different settings by men (or one man?)in different professions and circumstances who share the same clinical--dare I say meditative?--first-person voice. This cold detached voice and the mystery of possible multiple narrators are the things that give the book its magic. Then, about two-thirds of the way through the book (which is only 140 pages or so), the stories begin to sound more conventionally autobiographical, the narrative voice slackens slightly in intensity, and gradually the spell dissipates and the magic is gone. That being said, some of these short tales are very nasty indeed and will haunt you for a long time."}, {"userName": "Jonfaith", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "Frequently I watched the small children wobbling on their plump legs, stumbling, falling, getting up again, as though borne up by the same force that steadies sunflowers buffeted by the wind.Controversy followed Kosinski most of his adult life, likely by design. As noted elsewhere, there remains considerable debate about K. Look elsewhere for positions on such. http://www.artsandopinion.com/2007_v6... is a good point of departure for sifting evidence. Anyway, Steps is a disturbing little book, one which won the NBA in 1969. It is a dirty little secret which malingers in one's imagination. The Wallace, as in DFW, raved about the book. He also liked Coetzee's Barbarians which I find a vastly superior book. Steps would've hurricaned me into submission in my 20s. It didn't do much for me presently. It is enticing and macabre, but scant. There can be little doubt that the author of Painted Bird penned this. There are a nightmares and wet dreams a plenty in this slim volume."}, {"userName": "Cosimo", "userReviewDate": "Sep 02, 2014", "userURL": "http://www.goodreads.com/user/show/34544240-cosimo", "userReview": "“Facemmo del nostro meglio per comprendere il delitto: l'assassino apparteneva alla nostra vita; non così la vittima”.La dimensione di questi brevi racconti è la soglia del perturbante, inquietante, non familiare: frammenti di vita che turbano la pace della coscienza, nei quali una sessualità ineffabile si muove tra potenze oscure, dove a volte si manifesta la perfezione della violenza. C'è una stanza, con l'ombra di una donna, e una presenza segreta; non vieni accompagnato all'interno, l'autore ti ci scaraventa, d'improvviso e ti lascia lì, senza spiegazioni. Ti porta nel centro del racconto, l'amore e l'ossessione per le donne, il loro essere un'enigma che l'uomo desidera investigare, senza riposo. Il male è un'entità trasparente nelle pagine di Kosinski, un dover essere che travolge il lettore come un uragano, in un perpetuarsi del tragico che non si arresta davanti a nulla, in nome della autenticità e della forza del vivere per la vita. Salendo e crescendo, di invenzione linguistica in aneddoti che assumono la luce di un diamante, si giunge ad altitudine Bolano. Non c'è niente da fare, Kosinski è un'eresiarca.“Un giorno mettemmo alcune farfalle in un grande vaso di vetro e lo capovolgemmo, con la larga imboccatura sovrapposta al bordo di un vecchio tavolo sgangherato. L'apertura era abbastanza larga per far passare l'aria, ma troppo stretta perché le farfalle potessero fuggire. Quindi pulimmo accuratamente il vetro. Dapprima, ignare di essere in trappola, le farfalle cercarono di scappare attraverso il vetro. Urtandolo, svolazzavano qua e là come fiori appena tagliati che sotto la mano di un mago si fossero improvvisamente divisi dai gambi e avessero cominciato a vivere una loro vita. Ma l'invisibile barriera li teneva indietro come se l'aria si fosse ispessita di colpo intorno a loro”."}, {"userName": "Lee", "userReviewDate": "Nov 19, 2012", "userURL": "http://www.goodreads.com/user/show/90786-lee", "userReview": "Have had this since 1997, a crusty old paperback taken for free or not much more from a neighbor's yard sale. Read some in the past but never persevered to finish. Recommended for fans of dark, violent, realist fables. Call it skewed yet scarily/stuntedly straightforward post-traumatic stress syndrome lit? Sometimes like Kafka anecdotes but never even a smidge irreal (what seem at first like humanoids are simply humans), also lacking suggestion of a spiritual side? Sometimes like Jesus' Son but without that hazy Christian glow. Heavenly reflection on earth is just the shadow of a rotten brown leaf. Sometimes like an evil Kundera with a long knife instead of philosophical exposition -- at the end of a brief part, when the knife goes in, the whole thing seems to crystallize (sneaky starts, in general, and yowza sensationalist endings). Perpetuates stereotypes of the sicko post-war Old Country (fans of this sort of stuff should definitely check out The Notebook, The Proof, The Third Lie: Three Novels). Right away, ignorance and oppression dupes an innocent into beliving her liberator's credit cards are magic. Decapitations. Gang rape. Crazy naked lady in a cage. Soccer team obliterated by artillery fire. Bored snipers take out strolling couples, a bored guy takes out the night watchman of an abandoned building. On and on, short psychically linked bits, carefully and cleanly composed, often told by a cold if not pathologically calculating post-war narrator. Sometimes italicized psychoanalytic-like dialogue. Suggestion of unspecified international atrocities provides sense of serious heft (ie, human condition significance) throughout, despite book's general brevity. Literature of the \"Oh the Humanity\"- or \"The Horror, The Horror\"-type. A precursor to Brief Interviews with Hideous Men: Stories -- read this after so many years because it's mentioned in the DFW bio as an influence. A particularly vivid bit about a fast driver hired to do just that as business deals go on in the back. I'm interested in Kozinski's others but not about to run out after them. Amazing this won the National Book Award in 1968. A very different literary world back then, huh? 3.5 stars for me? Will come back to parts of it now and again to retrace some unexpected \"steps\" . . ."}, {"userName": "Vit Babenco", "userReviewDate": "Apr 10, 2013", "userURL": "http://www.goodreads.com/user/show/19283284-vit-babenco", "userReview": "An anonymous ego of the chronicler seems to be ruled by libido. And the mind is just secondary so it merely schemes in providing libido with the new raw material…“It was now barely light. No wind reached the lower branches of the birches, and the leaves on the bushes hung inert as though hammered out of lead. Suddenly she turned and stripped, laying her dress down on the leaves piled deep at our feet.She faced me, gently forcing me down onto my back. As she knelt over me she seemed stocky, almost short-limbed. Her forehead rested on my chest, her hands on the ground behind my shoulders; then, in a single smooth movement, she swung her legs into the air. As they passed the highest point of the arc her back made, they seemed to take on the willowy suppleness of young birch boughs weighed down by falling snow. Her heels slowly passed the crown of her head; with her face framed between her thighs, and her knees bending, she brushed against my face her mouth and womb.”Steps is a collection of piquant anecdotes written to lure a reader with a controversy. While the book is being read it grips one tightly but once it is read there is nothing left. And in the final analysis it’s all épatage and no essence, all skin and no bones, all chaff and no wheat, all looks and no brains."}, {"userName": "Jigar Brahmbhatt", "userReviewDate": "Oct 29, 2014", "userURL": "http://www.goodreads.com/user/show/3359025-jigar-brahmbhatt", "userReview": "\"I was traveling farther south\" tells the narrator of the first vignette. This line hints as aimless traveling. Maybe he is on the run. We are not sure. We know he has considerable money with him but we are again unsure of the means with which he acquired it. He stops in one village, finds a poor peasant girl, casually asks her to run away with him at night because he thinks he can provide her a better life, and they finally elope. He makes her buy expensive cloths and accessories the next day. That same night in the motel \"the girl was slightly giddy from the wine we had drunk at lunch, and now, as if trying to impress me with her newly acquired worldliness she must have learned from film and glamor magazines, she stood before me, her hands on her hips, her tongue moistening her lips, and her unsteady gaze seeking out my own\". The scene ends there, but in my mind I visualized, almost immediately, terrible things happening to the naive girl after the narrative gaze was withdrawn from the scene. I was instantly reminded of a line from Franz Kafka's The Country Doctor: \"In my home a madman is raging. Rose is his victim\". That doesn't mean the hint of erotic violence in the scene set by Kosinski comes from our knowledge of having read Kafka. It is very much present on its own, subtly hidden in the tableaux. We are never sure what the narrator is thinking and that creates a chill at the end of every vignette, because this is that strange animal of a book which is comprised purely of capsule stories, anecdotes, reminiscences, and in some cases only two people conversing (mostly a couple about flings one of them have had). For the first few pages my constant attempt to find common characters (because everything is centered on the characters, right?) led me to frustration, but I started adapting myself to the constant ramblings from a source-less voice. Most of the scenes involve an unnamed \"I\", so there must be a central character howling in a nameless desolate terrain. But in every tableaux his profession changes. Sometimes he is a soldier, sometimes \"I was recruited to chip the paint and rust from a ship\", sometimes \"I worked in a long, narrow parking lot and lived off the tips\". We don't get the names of the places and are never sure of the setting. The narrator might as well be a vague human figure in a Giorgio de Chirico painting, charting a landscape rich with sexual and savage motifs. Sometimes he is an emigre. In one episode he even helps another emigre troubled by hoodlums, not out of charity, not without personal interests. Because we don't get or understand the motivation behind his deeds or his observations, totally lacking in moral judgement, he comes across as a hideous man. It can be inferred that he has seen wars in his country and has emigrated to a nameless capitalist heaven doing odd jobs that are finally soul crushing. And even that interpretation smells of vanity because it is the reader's attempt to make rigid something that is flux-like and totally disembodied.This postmodern novel (I am tempted to call it that) works because it is a brilliant example of de-centering, because it is like shredded paper and not a fine, shining page, because sometimes shredded paper is the best we have. In the middle of the book, \"I\" comes across a village where the villagers keep a demented, nude woman in a cage, and figures out that most of the men in the village rape her. The conversation that follows with the village priest and the anger he shows is an epitome of moral courage. That's as high as he could rise. He never rises that high ever again, not in the scope of the book at least. Look at the face on the book cover gazing at you. Look at the eye. It is tired and creepy. Keep looking for some time. Exactly!"}, {"userName": "Mike", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/7272380-mike", "userReview": "I was rereading Steps by Jerzy Kosinski. It was night. I had recently asked a friend what he thought the book was really about. I told him that the author of the biography of Kosinski I’d read had pointed out that in each section of the book, the narrator(s) either takes advantage of someone else or is taken advantage of. The memorable section involving the student who makes a map of public restrooms in a city, designating them as his ‘temples’, is perhaps an exception, but in this case it is the Party that imposes itself upon the student. My friend nodded. “I think it’s about how we don’t have agency”, he said. He had previously pointed out that World War II seemed to be in the background of the book.“Maybe growing up during the war demonstrated that to him at an early age”, I suggested. ...Inevitably, I fell asleep. I woke soon after to what sounded like a thumping on my wall. It sounded as though my roommate, annoyed by my playing of loud music, was hitting the wall between our rooms to indicate that she would like me to turn it down. But my roommate had never done that before; I wasn’t playing music, loud or otherwise; and, perhaps most importantly, my roommate wasn’t home, as evidenced by the presence in my room of our cat, who, whenever my roommate arrived home, ran to her devotedly, but settled for sleeping in my room when my roommate wasn’t around. Deciding that it was just noise from the radiator, I allowed myself to return to sleep.…I woke up again. The noise was louder this time. I sensed movement outside, and realized that someone was standing outside my window, in the alley, hitting the side of the house with either his palm or his fist, looking in at me. I had fallen asleep with the lamp on- I could see that there was the shape of a face at the window, but could not discern its features or expression; whoever it was, on the other hand, could no doubt see me quite clearly. I got up, turned off the light, and cautiously opened the window a crack. Attempting to keep a note of hysteria out of my voice, I asked who it was and what he wanted. I received a quiet mumbling in return.“What the hell does that mean?” I asked, emboldened by the other’s timidity.There was another quiet mumbling, and then the individual, whose face was partially covered by a hood, with either an expression of embarrassment or the affectation of such an expression, quietly turned and walked back down the alley to the street. I turned off the lights in my bedroom and walked into the living room, leaving the Jerzy Kosinski book on the floor by the side of my bed, for the moment forgotten. I sat down on the couch in the living room and opened my cell phone. After a few seconds, I closed it. I did not need the police. The cell phone’s clock revealed that it was now two hours later than it had been when I’d first woken up and decided the noise was from the radiator. What had this individual been doing for those two hours? As I sat there, I realized that my back was turned to the windows that faced the house’s opposite alley, obstructed but not rendered impassable by large recycling and garbage cans, and suddenly became convinced that this man, now my adversary, was watching me. I turned around quickly; there was no one. I resented that I had been drawn out of sleep to engage in whatever we were engaging in, in whatever relation we now had, by an enemy I hadn’t known I’d possessed. As I listened for movement outside, I speculated on his motives. If he had been knocking at the side of the house in order to ascertain that there was no one home, so he could break in and steal something, why not attempt to break in after initially receiving no response? If, on the other hand, he had been knocking precisely in order to attract the attention of someone inside, perhaps with the intention of luring that person (me, as it turned out) outside, in order to neutralize him (me) and thus enter the house unmolested, why hadn’t he been prepared with a persuasive story? I was sitting in the dark across from my roommate’s closed door. It occurred to me that her windows were likely unlocked; I imagined that soon I might hear a screen being pushed up, followed by a thump on the floor and the doorknob slowly turning from the inside…On weekdays, the neighborhood came alive well before dawn, as construction workers slowly emerged from their homes with lunchboxes and backpacks, their co-workers and friends waiting for them at curbs in idling vans. Old men settled into seats in cafes whose windows displayed glowing lottery numbers, to read the paper and sip pensively at cups of tea. One such café was located across the street from my apartment, and on weekends opened relatively late- with the first light of dawn. I would wait.------After listening for a few seconds at the front door, I opened it. No one there. But when I stepped into the lobby of our building, I saw that there was someone, a person wearing a hooded jacket, standing on our porch and facing the street. I went back inside the apartment, our cat glancing up in curiosity at my strange behavior, composed myself, and went back outside again. This time there was no one on the porch.Outside, a woman was standing on our side of the street, near the curb, as if about to cross to the cafe. I was certain that the person I’d seen had been male. But I recognized her jacket- she was the one who had been standing on our porch, just a minute ago. It was raining lightly. I leaned over the railing and stared at her. She appeared to be singing to herself. There was no traffic at this early hour, and she easily could have crossed the street at any time. She either did not notice my staring at her, or affected not to notice. Perhaps a minute or two passed like this. The melody of her song filled the quiet morning, seeming to offer a promise of derangement. Finally, I asked if she needed help.I did not speak her language, and she spoke only a little of mine. She managed to communicate that she was waiting for a bus.“Did you knock at the door?” I asked, imitating the motion of a knock with my hand. “Knock? No knock…”I leaned over the side railing to look into the alley. I then looked back to the street; there was no one else except the two of us, and no sign of a bus."}, {"userName": "david", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/67794375-david", "userReview": "I would like to embellish on my non-review, but I do not feel I can with this one."}, {"userName": "Nate D", "userReviewDate": "Jul 15, 2011", "userURL": "http://www.goodreads.com/user/show/406701-nate-d", "userReview": "Brief, distressing fables of brutality, modest to vicious, and ambiguous moral order. It reminds me at times of the sheer human destruction of Last Exit to Brooklyn, but more condensed, refined, universal. Not a word is wasted, and the simple, eloquent language makes this exceedingly readable if at times difficult to absorb. DFW was evidently a fan, calling this slim set of vignettes better than all of Kosinski's other books combined, and I suspect he borrowed bits of its style and formatting for his own Brief Interviews with Hideous Men."}, {"userName": "Drew", "userReviewDate": "Mar 03, 2011", "userURL": "http://www.goodreads.com/user/show/4675538-drew", "userReview": "Almost a perfect cross between Céline's Journey to the End of the Night and Wallace's Brief Interviews with Hideous Men, complete with the mysterious (and creepy) protagonist and general misanthropy of the former, and the weird quasi-mystical (and, again, creepy) sexual encounters of the latter.Both of those, however, are a little self-indulgent. Journey is long and rambling and vitriolic, and Interviews, while not as long, goes on long digressions and gets mired in self-consciousness and occasionally uses prose impenetrable and soporific. Not that that's necessarily a bad thing. But Steps is way more controlled, way more polished. Kosinski writes in a style that's unadorned, which I usually dislike, probably because it's so rarely well done. You hear sparse and unadorned, and you think, probably boring. Or at least I do. But this is different. It isn't poetic, exactly, though I'm sure it's sometimes called that. Since I can't articulate it, I'll have to resort to quotes:\"I was traveling farther south.\" That's the first sentence of the novel, and it just oozes hidden meaning, although it's hard to figure out what any of that meaning may be. But is it not ominous? This guy is traveling, but not just traveling - traveling aimlessly. And who even does that? Grungy backpackers and criminals on the run. And what's the significance of \"south\" here? If he's not going to say the place itself, why give us \"south?\" Is he trying to slyly play on our stereotypes and make us think \"third world?\" If so, it totally worked on me, although the next sentence starts with \"the villages were small and poor,\" so maybe I'm back-interpreting a little bit. Anyway, it transpires that this guy is pretty rich, although there's the impression of ill-gotten gains. He picks up a young orphan girl in one village, doubtless thinking he's rescuing her from boring, impoverished village life. But it's not hard to see where this is going: he'll buy her nice things, and she'll have sex with him. The anecdote cuts off before this happens, ending with \"...as if trying to impress me with her newly acquired worldliness...she stood before me, her hands on her hips, her tongue moistening her lips, and her unsteady gaze seeking out my own.\"There are maybe fifty of these little vignettes, rarely more than a couple of pages, and just enough to give you a vague picture of the narrator's life. And that's where it really starts to get creepy. Because our fearless narrator doesn't know he's a hideous man. He does deplorable things, no more of which I'll spoil, without questioning his own motivations. He fancies himself a student of the human (specifically female) psyche, but all he's really doing is constructing elaborate fantasies of what he thinks the girls are thinking. The more I think about this, the more I think it'd almost have to be a direct inspiration for Brief Interviews, though that may be just because I know Wallace read and liked it.At any rate, this is one I'll have to reread; I think it will get better with time."}, {"userName": "Anittah", "userReviewDate": "Jul 28, 2008", "userURL": "http://www.goodreads.com/user/show/382032-anittah", "userReview": "From my Amazon.com review:Riveting, gripping, amazing. If art is, in part, the dance between artist and audience, then Steps is art in its highest form. I found myself dancing & reacting in ways I wish I hadn't; found myself physically aroused by portions of the text that I found intellectually / psychologically repugnant. That's a neat trick, Kosinski.In spare prose, the author takes his breathless reader (think of how your oxygen intake changed while watching 'Panic Room') on a \"depraved\" journey into the mind / experiences of his protagonist. The scenes that are depicted would be described by a good buddy of mine as \"filthy\" -- and that they are. Bestiality, rape, exploitation, and beyond. What I found most intriguing about this text, from a historical / sociological / anthropological perspective is that it was written decades ago. Far from the busy streets of NYC where the tranny hos walk amongst us, far from the prevalent teenage-flesh-peddling of 2005. The fact that humans are humans are humans are animals, in all of our glorious base desires and yes, just plain filth, was the most satisfying revelation of all.It is an excellent piece of art, and I can't believe I let it sit untouched on my bookshelf for six years after picking it up from a used bookstore in New Haven. This is one book I won't be selling used on Amazon.com; it's staying in my collection for at least four decades. WOW."}, {"userName": "C", "userReviewDate": "Jul 16, 2007", "userURL": "http://www.goodreads.com/user/show/188450-c", "userReview": "Do you remember the game \"Where's Waldo?\" You can play a similar one with this (47 maybe--If I'm remembering correctly) episodic narrative: \"Where's the act of consumption?\"Note: many of the vignettes are either sexual or violent, or violently sexual. The protagonist is on a quest to find a stable sense of identity in his (post)modern world. The question then becomes whether he succeeds or not."}, {"userName": "Lee Foust", "userReviewDate": "Aug 27, 2013", "userURL": "http://www.goodreads.com/user/show/13984676-lee-foust", "userReview": "Whilst I can see how my, I dunno, 12 to 15-year-old self thought that this was really cool--as a virgin all of the \"sick/perverse/degraded\" sex was mysterious and the existentially alienated, detached narrators of the terse, unemotional prose and the violence was as alluring as a James Bond movie or as some of those loner-based space exploration tales of adolescent science fiction, I'm pretty amazed, at 50, that a grown man wrote this novel and that, judging from the reviews splattered all over the paperback's cover, that other grown men (book reviewers!) also took such drivel seriously. Seriously? C'mon, Newsweek--\"More than a novel.\"??? Actually Steps is much less than a novel, having no characterizations to speak of, no plot, no real themes (topics rather: sex, degradation, the underside of wealth and its relation to power, violence, \"inhumanity\" in the vaguest and most puerile definition of the word) and really nothing much to say about these topics other than attempting to convince us--and his audience is very clearly us, the white American bourgeoisie to which Kosinski aspired (whilst clearly also hoping to scandalize us and feel superior for having suffered poverty and survived the holocaust) and then aspired to supersede through wealth--that some narrator or other had actually seen (hard to say \"experienced\") these yucky things. Of course, now that I say it that way, given that history, and the author's desire to make it big in America the short way (scandalous texts get all the free publicity) the subject matter of the novel is not so surprising after all. I do like the experimental nature of the narrative (and the stark narrative technique)--although, as I insinuated above, the novel is quite empty of any real content, the narrative rather implies, insists even, in a way, that there is no such thing as content--and this is even more scandalous to the bourgeois mind perhaps than the war scenes, the rapes, the prostitution, incest, bestiality, mafia games, exploitations, random acts of violence etc. etc. It's kind of a fuck you to both literature and to the US Bourgeoisie. You'd think I'd be down with that. Still, this reading only produced mild laughter from me. It's like a Madonna video or bad, juvenile punk rock: revolutionary without a cause, formally hostile without substance, disgust without opinion, so merely misanthropic, grossed out by humanity's extra-bourgeois activities (read \"degradation\"), caught, in the end, in a loop of bourgeois perception, scandal and disgust, reactionary rather than revolutionary because it has no hope, no future."}, {"userName": "Jeremy", "userReviewDate": "Apr 27, 2011", "userURL": "http://www.goodreads.com/user/show/869064-jeremy", "userReview": "Steps is like something a younger, hornier Haruki Murakami might write. You've got these terse, surreal little vignettes that are sort-of-but-not-really linked together, and all of which share this dark, creepily sexual sensibility. A bunch of odd little nothings, though not without their charms. I can't imagine what combination of substances the people who chose the national book award in 1969 must have been smoking/drinking/dropping/snorting when they picked this. Fair warning, there's bestiality in it. Several times."}, {"userName": "Lenore Beadsman64", "userReviewDate": "Jan 06, 2014", "userURL": "http://www.goodreads.com/user/show/9446989-lenore-beadsman64", "userReview": "Passi silenziosi nel lato oscuro dell'animaJerzy Kosiński ha avuto una vita dura e alla fine si è arreso alla morte andandole incontro come fosse un'amante, nel mentre che cercava di venire a capo, senza riuscirci parrebbe, di quel che la vita gli aveva riservato, ha lasciato questi piccoli gioielli di cinismo, una prosa scarna, essenziale e tutto il dolore di chi ha vissuto ai margini...un insieme illuminante e impietoso, un esame al microscopio del lato più oscuro dell'animo umano...non un libro per anime illuse che tutto si possa aggiustare, questo è un libro per chi non si racconta frottole e vede la vita per quello che è: una lenta evoluzione il cui culmine è per tutti: buoni, cattivi, giusti e empi, solo e soltanto la morte, la fine di tutto e senza nessuna illusione che ci possa essere altro...ps. l'ho scoperto grazie a DFW che ne parlava e non finirò mai di stupirmi della cultura e della lucidità di quell'uomo che scovava roba di valore fino all'altra parte del globo, senza neanche battere ciglio..."}, {"userName": "Guillermo Jiménez", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/1212012-guillermo-jim-nez", "userReview": "Llegué a este libro por la entrada que Salon le publicó a David Foster Wallace en abril de 1999 Overlooked, donde mi héroe nos otorga breves opiniones sobre 5 novelas de los 60 que han sido “imperiosamente menospreciadas”.Dice algo así: “ganó como un gran premio cuando fue publicada, pero ahora nadie parece recordarla; le llamamos novela , pero, en realidad es una colección de increíblemente pavorosas y un poco alegóricas viñetas, contadas con una voz elegante y tersa como no ha habido otra jamás. Solo el Kafka fragmentario se acerca a donde Jerzy Kosińskihttps://www.goodreads.com/author/show... llega en este libro”.Las otras obras que menciona son Angels, de Denis Johnson; Blood Meridian, or the Evening Redness in the West, de Cormac McCarthy (que se lleva el mejor comentario de todos, y el más lacónico, “Don’t even ask”); Wittgenstein's Mistress, de David Markson; y, Omensetter's Luck, de William H. Gass.Habiendo leído las de Johnson y McCarthy, y dos novelas posteriores a la de Markson, sabía que debía leerme a Kosiński.No me equivocaba.Atorado y armándome de valor para sentarme a escribir la tesis, decidí darme un descanso de las lecturas semi académicas tomando el libro de “Pasos”, el cual leí en unas pocas horas.Y, como le comenté a Rebeca poco antes de terminar el libro: “este es el tipo de libros que representan todo lo que me puede interesar realizar a mí en la literatura”.No hay personajes como tal, hay un narrador, hay cuadros, escenas, diálogos, todo inconexo, solo una voz, un tono, un trasfondo que adivinamos, y una oscuridad tremenda, una eroticidad y una sexualidad violenta.Me recordaba a ratos, así como en oleadas de ecos, a Nabokov, luego descubrí que Johnson le tenía mucha deuda a este libro, pero, por otra obra que no es la que menciona DFW, “Jesus’ Son”; y más lo leía, más me iba ganando: adoro cuando un libro no me hace querer apuntar tanto sus frases como citas, sino más, anotar ideas contenidas en sus páginas.Para ser una obra de 1968 no parece que el tiempo haya pasado sobre ella, más bien el gusto de los lectores ha cambiado. Puedo entender que el tema no sea atractivo, e incluso el tratamiento puede ser enfadoso, sin embargo, Kosiński es un genio al momento de (como dicen) “poner el dedo en la llaga”.Señala, con acierto, grandes problemas actuales como el que somos una sociedad de consumo y que estamos dominados por una corriente filosófica-económica neoliberal. Y todo lo esto lo hace de contrapunteando los andares de un narrador que desfila ante nosotros en brutales apariciones, en conversaciones a veces que rayan la locura y el esperpento, en anécdotas donde la maldad humana es descrita como una cirugía médica: el paciente podrá estar anestesiado, pero, nosotros vemos las vísceras y el interior del cuerpo expuesto. Vemos el interior de la humanidad por medio de sus actos. A pesar de ellos.Es un libro que bien vale la pena."}, {"userName": "Özgür Daş", "userReviewDate": "Jul 10, 2015", "userURL": "http://www.goodreads.com/user/show/35751923-zg-r-da", "userReview": "Kosiński, insanların maruz kaldığı durumları açık ve rahatsız edici şekilde sunuyor 'Adımlar'da."}, {"userName": "Nate", "userReviewDate": "Jul 24, 2016", "userURL": "http://www.goodreads.com/user/show/4820973-nate", "userReview": "Soundtrack: https://www.youtube.com/watch?v=1rpKQ... Let's have a toast for the douchebagsLet's have a toast for the assholesLet's have a toast for the scumbagsEvery one of them that I know. -Kanye West RunawayKosinski's Steps is the literature equivalent of Kanye West's Runaway. If you simply read the lyrics of a lot of West's songs you might think that the music is simply a vapid reflection of its listeners. Especially with this one. The speaker(s) talks about his philanderous actions he commits and then proceeds to ask how or why the girl would possibly leave them. The speaker is a rich pop-star that can buy her brand name stuff and take her on tropical vacations. There are 3 important things expressed in the song 1) the speaker is a bad person (douchebag, asshole, scumbag etc.) 2) the speaker is aware that he is a bad person and 3) the speaker is not really proud of this. And this is besides the fact in how the song is sung. You would probably expect this song to be sung harshly, brashly, proud, bold. But it's not. I can't exactly put my finger on it but it doesn't conjure up any of the previous words. Maybe a sense of rhythmic regret. There's a very concentrated attempt at making it easy/catchy to listen to. In the same way that Runaway isn't meant as a glorification of the speaker, Steps does not read as the endorsement of the narrator's actions. It's a statement of something that is, that exists. A callousness. One key feature of this book is that it resists chronology. It also resists names and place so that the reader is guessing at what country or language is being really spoken. Names, place and time are all convenient fictions, a way to separate and identify. But without that distinction, and with the deployment of the first person it feels as though the narrator is not so much a guy \"out there\" but somewhere inside. The narrator doesn't want to let people in. He likes to have control and manipulate. The only way he lets people in is by telling stories, either directly to us or in the italicized sections when he's presumably speaking to his lovers (sometimes about other lovers). So in this way he puts a degree or two of removal from being penetrated himself. He relates his callousness and vulnerability but does not ask for absolution. He asks for ears. He asks to penetrate in anyway he can. In this way Kosinski and West are striving to achieve the same thing."}, {"userName": "Lukasz Pruski", "userReviewDate": "Feb 28, 2014", "userURL": "http://www.goodreads.com/user/show/2989615-lukasz-pruski", "userReview": "In my late teen years a stupid drinking game was popular in my native country: one was supposed to go to a party, get very drunk, and then puke on as many walls as possible, including the ceiling. I remembered that game when I was reading the first half of Jerzy Kosinski's disjoint novella \"Steps\". Mr. Kosinski, my compatriot, vomits repulsive prose in every direction, spewing about ugly sex, violence, and pain. \"I want to make love to you when you are menstruating\" is a typical example of the novella's content. There is a young woman having sex with a \"big animal\". Genitals are crushed between two rocks until \"the flesh became an unrecognizable pulp.\" The novella is built of 48 vignettes connected mainly by their grim content, sex, and violence. There is a narrator in most vignettes, but it is only in the second half of the book that there is any conceptual continuity. The twenty-first vignette, about a concentration camp designer and about rats as animals that deserve to be exterminated is the only piece of real literature that I can find in this horrid mess, which in 1969 received the National Book Award in Fiction, the highest literary prize in the U.S.Brutality, perversion, and sex obviously have their place in literature, for instance when they serve to amplify the writer's message. I have read painfully brutal novels that also contained kinky sex scenes (J.M. Coetzee's \"Waiting for the Barbarians\" comes to mind), but they might have a purifying effect and make me want to be a force for good. Reading the first half of Kosinski's novella made me feel defecated on. There is no message here; sex and violence are solely for shock value or maybe because of the author's mental health issues. The second half of the book is different; there is a message of alienation, loneliness, and control, but that message has been voiced much better by many other authors. The deep chasm between the two halves of the novella is yet another flaw of Kosinski's work.With the somewhat redeeming second half I can no longer call \"Steps\" the worst book I have ever read.One star."}, {"userName": "Peter Landau", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/861304-peter-landau", "userReview": "What a short vulgar book Jerzy Kosinski’s STEPS is, made up of brief vignettes that sort of connect in a non-narrative way to tell a story that doesn’t begin or end but stays in the middle where the action is. The action is almost universally perverse with kinky sex and violence that happens without clear relation, except in its bizarre repetition. There are chapters of a kind that begin to stand together as thematically linked to sex, religion, work, politics, etc., and how each of these forces distorts the narrator. It’s like a literary Grand Guignol staged not to shock or entertain but expose the common bonds that powers greater than ourselves use to control us. Or maybe not. Perhaps Kosinski is a pervert. I don’t know. The truth is, I don’t care. This novel stands on its weird tableaus and the strangeness embedded in its flat language. So much of the power of literature is in its secrets, not unraveling them, because then you’re left with parts that miss the whole. I prefer the mystery of a good book. When I was a child I longed for the teacher’s edition with all the answers in the back, but the older I get, the more I’ve come to realize that those answers are but another story."}, {"userName": "Rene Ijzermans", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/18771236-rene-ijzermans", "userReview": "Wat een koud en grimmig boek is dit, en daarom ook fascinerend. Een boek vol fragmenten die dan toch wel een samenhang blijken te hebben, maar evengoed los van elkaar kunnen worden gelezen. Geschreven na zijn aangrijpende boek \"De geverfde vogel\" waarin mij vooral het Joodse jongetje is bijgebleven dat ten tijde van WO 2 door Poolse platteland zwerft en stopt met praten omdat het hem teveel is geworden. Het teveel aan trauma's heeft hem letterlijk de mond gesnoerd. Stappen is in eenzelfde kale taal geschreven en kwam daardoor bij mij binnen. Opvallend vond ik hoe makkelijk hij me in een nieuw fragment meenam. Vaak zonder inleiding val je zo in een situatie of gesprek tussen twee mensen en gaandeweg vroeg ik me steeds vaker af of ook dit fragment wreed zou eindigen, of juist niet. Want vaak is dat wel het geval, geeft Kosinski geen al te fijn beeld van iemands ware motieven. Dat is dan ook Kosinski. Lees je hem, wees dan voorbereid op geen al te vrolijke verhalen en flink wat macabere fantasieën. Ach, hij heeft zichzelf ook niet voor niks met een plastic zak om zijn hoofd van het leven beroofd."}, {"userName": "Alex V.", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/334560-alex-v", "userReview": "Consider mortadella. The Italian lunchmeat. It is like baloney but is remarkably better. All boiled and minced meats and chunks of fat pressed into a log and the sliced impossibly thin, each translucent circle having a sharper taste than any thick slab of anything. It is a little repulsive, but in a way that is shockingly delicious. Jerzy Kosiński's STEPS is a pound of fresh, thinly-sliced fiction mortadella, except it is cut from a log of pressed frailty, pornographic fantasy and sharp, hilarious detachment with all the fat taken out. Everything is mostly horrible and everyone is horrible about it and yet, in that horror is the sharp shock of human essence, the thing that separates our rarified meat from the rest of the baloney in the world. I can't recommend this book enough.Continuing the deli metaphor for longer than any of the stories in STEPS, it is a party-platter of finger sandwich stories a page or two each, delicious morsels delivering new pangs of recognition at the next chomp. It's not real food. It is purile, bro-lit at its most egregious, yet delicious. You eat it until you are sick. Bon appétit!"}, {"userName": "Adam", "userReviewDate": "Sep 13, 2010", "userURL": "http://www.goodreads.com/user/show/1884982-adam", "userReview": "Huh. I reread this with the express hope of afterwards being able to articulate what hit me so hard about this book the first time I read it. Now I find myself even more convinced that this is a masterpiece, yet struggling to find the words to write either an extensive or pithy summary of my reaction to it. Naturally, I looked up Kosinski's Wikipedia page, because that's just what you do. I found that one great academic and one great author had both said these great little bits on Steps:\"the narrator of Steps... seems to be nothing more than a disembodied voice howling in some surrealistic wilderness\"- Samuel Coale\"[a] collection of unbelievably creepy little allegorical tableaux done in a terse elegant voice that's like nothing else anywhere ever\"- David Foster Wallaceand really, with the former quote saying much about the weird, inherent sort of creepiness and distance of the narration in Steps, and the latter providing a brilliantly concise summation of the quality of the whole thing, I don't need to write much about this. That isn't to say I won't write much about it. I might sometime."}, {"userName": "Diana Matei", "userReviewDate": "Nov 26, 2010", "userURL": "http://www.goodreads.com/user/show/4536514-diana-matei", "userReview": "Lately, I've been reading all of Milan Kundera's books. I was at the used bookstore the other day and saw this book on one of the shelves. It looked like an easy, light read, so I bought it. I got tired of Kundera's dialogue and decided to take a reading break. I thumbed through the pages of Steps, and I couldn't stop myself. I made myself stop reading halfway through so I would have something to look forward to going home over thanksgiving break. I don't really know what to say about this book, aside from the fact that it will probably never leave my mind. It is very dark and pessimistic, but it made me feel human in comparison to Kosinski's views and rants. The stories are gripping and cringe-worthy. I think everyone should read this book in their lifetime."}, {"userName": "Patty", "userReviewDate": "Jul 31, 2012", "userURL": "http://www.goodreads.com/user/show/574954-patty", "userReview": "there is nothing in this for me, so i gave myself permission not to finish it. i gave it the benefit of the doubt for just under half its length. it's not even a novel, it's just disconnected vignets, in the style of anais nin, and written from a very ugly perspective. the dust jacket alluded to celine and kafka and conrad and nabakov. i see none of them here. it's more like brett easton ellis if he had written erotica. it's erotica for sociopaths."}, {"userName": "Paul Bryant", "userReviewDate": "Apr 30, 2009", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Yes, a single star, but a richly deserved one."}, {"userName": "Marjorie", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/754805-marjorie", "userReview": "Disturbing. Amazing. Reminiscent of _2666_, book 5. When the butterfly chapter comes, the book takes on the question of how the outsider/other adapts into the new society and what the costs are and how the sacrifices might make him/her more willing to take advantage when necessary.Note: This little book won the 1968 National Book Award and I have to say: unbelievable! Even by today’s more lax television standards the book comes across as shocking and horrific (but with purpose). Imagining the reading population of 50 years ago, I tend to envision something much more uptight. But then again, the summer of love was around the corner and this book seems to capture the subterranean, if nascent, sexual revolutions sparked in many. Ultimately, the provocative is a study of a culture’s psychology as set up to explore one immigrant’s ability or lack thereof to assimilate."}, {"userName": "Jessica", "userReviewDate": "May 01, 2011", "userURL": "http://www.goodreads.com/user/show/86946-jessica", "userReview": "Steps is neither a novel nor a collection of short stories, but rather a series of untitled vignettes that may or may not be narrated by a consistent voice. The \"I\" in each story is clearly male, but little else is known about him; in each vignette he passionlessly details a series of events, most often culmintating in some kind of violence, usually against a woman. It is obvious that Kosinski's intent is to delineate a world in which actions mean nothing, and those acting feel nothing. The question is whether he succeeds in making a statement about this kind of worldview, or whether he only stoops to the level of his characters by voyeuristically joining their exploits. I'm not sure I know which is the case.In these tales women are bound, blindfolded, raped, kept in a cage, or otherwise used only for the momentary fulfillment of the narrator's physical desires. Occasionally a woman is given a voice in direct dialogue with the narrator, but these women are unrealistic, possibly products of the man's imagination, because they seem to tell him exactly what he wants to hear rather than what a woman would actually say: she tells him his ejaculation makes her feel \"as though I were being christened: it was so white and pure\"; she says that when he has sex with her during her period, she feels \"as if your hardness made me bleed, as if you had flayed my skin\"; she accepts sex from another man whom her lover had arranged for her because \"the thought occurred to me that they were your hands.\" These are not women's voices, but rather a man placing his own fantasies in a woman's mouth.Reading the book made me angry, and I felt more like Kosinski was outlining his own fantasies than that he was intending to cast judgment against his characters' behavior. I presume he meant to illustrate the consequences described in his introductory quote from the Bhagavadgita:For the uncontrolled there is no wisdom, nor for the uncontrolled is there the power of concentration; and for him without concentration there is no peace. And for the unpeaceful, can there be happiness?But still, I felt like he gloried too much in the telling of these tales, and that while the characters felt no happiness or peace, neither did they feel guilt or a sense that they were behaving inappropriately (or even that there was a standard of propriety by which they could be judged). The last story seems to leave room for the reader to pardon Kosinski for telling these tales; he prefaces it with the narration, \"When I'm gone, I'll be for you just another memory descending upon you uninvited, stirring up your thoughts, confusing your feelings,\" and maybe in this case the \"I\" is Kosinski speaking directly to the reader. Maybe he is telling the reader that his book is just a snapshot of one small segment of humanity, one we must acknowledge but not take to be the whole of human existence. I'm willing to accept this, but I still don't feel that it forgives the telling of these tales, which seem more to glorify the acts than to question them."}], "description": "Winner of the National Book Award for FictionFrom the esteemed author of the classics The Painted Bird and Being There comes this award-winning novel about one man's sexual and sensual experiences, the fabric from which his life has been woven.Jerzy Kosinski's classic vision of moral and sexual estrangement brilliantly captures the disturbing undercurrents of modern politics and culture. In this haunting novel, distinctions are eroded between oppressor and oppressed, perpetrator and victim, narcissism and anonymity. Kosinski portrays men and women both aroused and desensitized by an environment that disdains the individual and seeks control over the imagination in his unforgettable and immensely provocative work.", "title": "Steps", "url": "http://www.goodreads.com/book/show/18464.Steps", "average": 3.8, "cover": "https://images.gr-assets.com/books/1382420032l/18464.jpg", "reviews": 216, "authors": [{"url": "https://www.goodreads.com/author/show/11121.Jerzy_Kosi_ski", "name": "Jerzy Kosiński"}], "type": ["Fiction", "Short Stories", "Novels", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/18464.Steps", "http://www.goodreads.com/book/show/1094343.Steps", "http://www.goodreads.com/book/show/18486842-passi", "http://www.goodreads.com/book/show/7997473-steps", "http://www.goodreads.com/book/show/10491198-steps", "http://www.goodreads.com/book/show/396067.Steps", "http://www.goodreads.com/book/show/17289160-pasos", "http://www.goodreads.com/book/show/11959685-ad-mlar", "http://www.goodreads.com/book/show/1094344.Steps", "http://www.goodreads.com/book/show/18452.The_Painted_Bird", "http://www.goodreads.com/book/show/677877.Being_There", "http://www.goodreads.com/book/show/18462.Blind_Date", "http://www.goodreads.com/book/show/54952.Cockpit", "http://www.goodreads.com/book/show/18465.Pinball"]}