{"ratings": 42, "userreviews": [{"userName": "Carla", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/7965254-carla", "userReview": "I've read one other Noir from this publisher and LOVED it. I made it a mission to seek out others and to read them. Having lived in St. Louis, I was excited to delve into this one. Picking up a book where you've lived, and having authors bring to life places you've known can be quite exhilarating, but this fell flat. Enjoyed a few stories, but most were forgettable. It will not deter me from trying more!"}, {"userName": "Nicola Mansfield", "userReviewDate": "Aug 16, 2016", "userURL": "http://www.goodreads.com/user/show/1682713-nicola-mansfield", "userReview": "This is the second book I've read in the Akashic Noir series . I enjoyed it far less than \"New Orleans Noir 2\". I think having some knowledge of the city these books feature (even if is only from reading or a keen interest) will have an affect on the reader's experience with the book. I knew nothing of St. Louis at all. As a Canadian, I didn't even know what state it was in. A lot of the stories here are about drugs, race relations, vigilantism and politics unique to the city. I'm not interested in these topics, nor am I familiar with them much but a great deal of the stories I wouldn't even call noir. The endings of most didn't use a twist or redemption; if the ending isn't dark I've lost the noir feeling. However, there were a couple of stellar stories combined with the okay stories that the major duds didn't drag down my rating. The book averaged out to a solid 3/5 altogether.1. Abandoned Places by S.L. Coney - Ian's father takes off. Most assume he's dead. The locals think the professionals offed him. But Ian sometimes wonders if his sep-mother of two years killed him. So Ian follows Vickie one night and learns it all. The ending could have been better. (3/5)2. Deserted Cities of the Heart by Paul D. Marks - This is the tragedy and destruction of a man who meets his femme fatale. An IT guy meets a mousy haired hipster ad his happy but mundane life takes a nose-dive into obsession. Nicely depressing. (4/5)3. Blues for the River City Colleen J. Mcelroy - There are three black teens and they narrowly escape trouble when sneaking into a whites-only movie theatre. It's the 1950s and mostly just talks about racism; not really a plot to be found anywhere. (0/5)4. Fool's Luck by Lavelle Wilkins-Chinn - This is the first really good story. It starts off giving background on this African-American family and its quirky members. Then settles on Unk, mentally disabled in the war. Now in '68 the government has sent him a letter saying he'll receive a large settlement since his war work had been the cause of his illness. Now he hooks up with Carla, 20 years his junior, a money-grubbing skank. Nobody in the family likes her, but Unk loves her. She sleeps around etc. and in the end gets hers but not after causing unforgivable harm. (5/5)5. Attrition by Calvin Wilson - Very short. An A&E reporter is a slacker but good at his job. When a business person is hired as the new editor to get people in line he finds he hates her in a way he's never disliked anyone before. He feels she's bad for the A&E section and we end up learning just what it is that makes him tick. A wicked character study more than plot oriented. (3/5)6. Tracks by Jason Makansi - This one challenges our perceptions. It's not often we meet a violent female sexual predator in literature. Starting off from the predator's pov we see inside her head, the sick fantasies and then the attack. The end is seen from the victim's pov. Can't say I cared for the story too much but it was unique. (3/5)7. Four St. Louis Poems by Michael Castro - I hardly ever like poetry even if it's maudlin. (0/5)8. A Paler Shade of Death by Laura Benedict - This is the first author in this collection I've heard of though had not read her before. Also, this story is twice the length of any others so far. It's a pretty creepy story which never lets you know what has really happened. A woman is moving into a duplex, apparently, she's just gotten divorced, has a retraining order against her going near her old house once she gets her last things moved out today. Oh, her son died some time ago, That's when the marriage started to fail. Now there is a boy across the street who is the age her son would have been now. Is this boy real, a ghost, her imagination? Her son drowned; some people think she killed him. Her ex-husband turns up at her door. What follows is either real, imagined, or a nightmare. (4/5)9. Have You Seen Me? by Jedidiah Ayres - A man who works clearing out buildings set for demolishment finds a wall of missing posters in a homeless tenement. He starts to recognise some of the kids and has urges to call the numbers on the posters to tell the parents, their kid is ok even if they are dead. When his boss calls him to help him out when he drunkenly kills his girlfriend in a car accident. The boss finds he picked the wrong person. This is pure noir, well-written and keeps you on your toes as it surprised me with where it went. The main character is left being ambiguous so we end up not knowing what he actually is/or may be. (5/5)10. A St. Louis Christmas by Umar Lee - This is about drug dealers. A vigilante Muslim group whose objective is too rid the streets of drugs hear about a money exchange going down, We learn about Bubba the head of the meth operation and we learn about the backgrounds of the two vigilantes, one Muslim, one Jew. Things happen and the vigilantes, win, I think. I'm not up on all the drug talk or vigilante group names so this was pretty boring for me. Not very exciting, and an ending that made no sense to me. It read well though because of good writing. (2/5)11. The Pillbox by Chris Barsanti - A naive teenager becomes a skinhead for the uniform and music. Moves to the city, makes a couple of friends, Then he gets involved in drug selling working for \"Chicago\". Everything is ok until he finds out these skinheads he works for are of the neo-nazi/white pride variety and expect him to join them. He tries to get out of the situation and has to resort to violence. This was ok but again, hard for me to relate to the drug and skinhead culture, having never experienced it. (3/5)12. The Brick Wall by John Lutz - Now this is more like it. My favourite story at this point. This is the second author I've heard of but again hadn't read before. A good little thriller with a twist ending. The owner of a racetrack enters the current race which includes his friend's son. Someone is killed on the track and the owner is blamed, is sorry, but feels no guilt. A plot is set up to get him making for a tense story, but the twist ending is very good. (5/5)13. Tell Them Your Name is Barbara by L.J. Smith - This one is about the drug world too but much more enjoyable for me as it involves a murder and the solving of the case. All the characters, good and bad, did drugs so their really isn't a hero here, but the case gets solved and at least one person has the possibility of changing their life for the better. Not a very thrilling ending. (3/5)14. One Little God-Damn Thing by Scott Phillips - The final story is the editor's contribution and my favourite of the collection. A convict has served his full sentence of thirty years for murder during an armed robbery. He's out now and goes to visit his hometown (where he robbed the bank) not to let anyone see him but to check-up and make sure his sister is ok. He starts by following her husband, the man who was his accomplice and who actually did the murders. Our jailbird had taken full responsibility for the crime in exchange his b-i-l would take care of his sister. Looks like he didn't follow through. This is perfect noir and has a good ending. (5/5)"}, {"userName": "Sam Sattler", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/8300581-sam-sattler", "userReview": "St. Louis Noir is just the latest of about a dozen of the short story collections in this Akashic series that I’ve read now, and the streak continues – not a single one of them has disappointed me. Each of the collections begins with an introduction from the book’s editor (in this instance, Scott Phillips) that helps set the overall tone for what is to follow. As Phillips says, the St. Louis region has not had an easy time in recent years, and that makes the city the perfect setting for this kind of hardcore crime fiction. Consider that one of Phillips’s definitions of noir is fiction that “traffics in fatality and doom and bad luck and characters who persistently, knowingly, act against their own best interests” and you have an idea of what is to come.Among my favorite stories in St. Louis Noir is one called “Deserted Cities of the Heart” (by Paul D. Monks) in which a loner of an IT nerd with a security clearance is convinced to hack into a witness protection data base with disastrous results by the attractive young out-of-towner who suddenly comes into his life. Another is “A Paler Shade of Death” (by Laura Benedict) about a young woman that many suspect is guilty of killing her four-year-old son. Now that her marriage has fallen apart, she is trying to convince herself that it is time for a fresh start – but is it? Two other stories are particular standouts: “The Brick Wall” (by John Lutz) and “One Little Goddam Thing” by the collection’s editor Scott Phillips. The first is a rather Hitchcockian story involving revenge of the most ingeniously delicate variety, and the second involves revenge of the cruder, but equally effective, type. St. Louis Noir also includes what is titled “A Poetic Interlude,” four short poems from Michael Castro. In very few words, the first two pieces (“In St. Louis Heat” and “Gaslight Square”) paint vividly memorable pictures of St. Louis street scenes, but the third poem, “St. Louis Blues Revisited” strikes a note I wish it had not stricken by referencing “the cold cop who killed Michael Brown.” Perhaps I am misreading the poet’s intention in making that reference, but I do not see that it adds much of anything to mood of the poem, even coming in the poem’s very first stanza as it does. Much worse is a similar reference in author Umar Lee’s short author biography (whether written by Lee or by the editor did, I do not know) to the “murder of Michael Brown.” That reference serves no purpose whatsoever other than to explain the politics of Umar Lee who is “presently a candidate for mayor of St. Louis.”The bottom line: St. Louis Noir is another worthy addition to what is perhaps already the best series of short story collections to be published in decades."}, {"userName": "Jay", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/3255414-jay", "userReview": "Having lived in South City, North county, and St. Charles, I feel like I have a good feel for what St. Louis is like. I have lived only about 6 years of my life away from this area. The stories in this book offer pictures of different parts of St. Louis, some with more detail than others. I notice that I tend to be a sunny-eyed optimist, seeing only the happy good parts of the city, regardless of where I visit. A noir story is going to slog through the locations and cultures of the city that I tend to overlook, so even though many of the locations are familiar to me, the activities going on are not.I find it really difficult to review a short story collection without saying “some of the stories were better than others.” That’s going to be true for any set of stories. My favorite stories were set in North county and Illinois, but that’s because of the stories themselves. One motive for reading this book: to see if the stories did give a good feel for the area. If they did, I figured, then I could read books from other cities and feel like I learned something about the area. This book was the measure I could use to determine the veracity of the other stories. I’d say that it does feel like St. Louis. I’d say that I learned about how some areas where I used to live have really changed since I’ve lived there. The “it used to be like this” images felt true to me, so I expect that the parts less familiar to me were also accurate.Conclusion: yeah, I can read other collections in this series and feel like I have a picture of the darker elements of those cites. I plan to do so."}, {"userName": "Woody Chandler", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/1026784-woody-chandler", "userReview": "Hmm, unlike Nicola Phillips, I feel like drugs, racism & other various and sundry topics have their place in Noir fiction. I thought that her review(s) was/were well thought out & articulated, but I simply disagree with her final assessment. Sure, not every story was a winner, but they all managed to convey a sense of unease in this city & its suburbs. I first visited, via train, coming south from CHI & our nighttime arrival left me feeling disconcerted, the same way that I felt in many of these stories. I have been back a couple of times since, but always with that initial wariness. This collection evoked those same feelings. I was glad that the StL Arch was an integral part of the first story since it so dominates the city. I also liked the deviation from the norm in Part II with \"A Poetic Interlude\". I have been to a number of poetry readings & I could definitely hear \"St. Louis Blues Revisited\" being read aloud in my mind. I wish that more of the anthologies would so deviate. \"Wall Street Noir\" & \"Seattle Noir\" (unsure of the latter) both had comic book-style stories & I would welcome more of the same and more poetry. I wish that fractional ratings were possible as I think of this as 4.25. YMMV. BTW, the length of reading time was due to some horrific assignments, which is usually when I do some of my best reading."}, {"userName": "Christa Van", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/16400390-christa-van", "userReview": "A collection of gritty stories set in St. Louis, some of these are absolute gems and others area bit forgettable. A bakers dozen stories with a poetic interlude from U City's own Michael Castro. If you like noir, there will be something here for you."}, {"userName": "Udine", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/24564970-udine", "userReview": "Some were good, some not so much."}, {"userName": "Julie Failla Earhart", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/1277299-julie-failla-earhart", "userReview": "This is the latest installment of Akashic Noir’s Midwest series, following Chicago, the Twin Cities and Kansas City. In total, the Akashic Noir Series has about 75 titles, set around the world.This particular collection has 14 entries, 13 dark, short stories and one poetic interlude. I recognized six of the authors for a variety of reasons. John Lutz and Scott Phillips are nationally recognized for their work: Lutz for “Single White Female” and Phillips for “The Ice Harvest.” Poet Michael Castro is the City of St. Louis’ Poet Laureate and locally famous before he was awarded the position. Jedidiah Ayres I’ve heard of from writer Joe Schwartz, and L. J. Smith I know from the local writing scene. Calvin Wilson is a reporter for the St. Louis Post-Dispatch.It was fun reading stories that take is familiar landmarks. The book is broken into four section, much like the metropolitan area itself: the City, the County, and Across the River (Illinois). The poetic interlude speaks to the large network of creative talent that call St. Louis home.Phillips did a bang-up job with his Introduction: “High and Low Culture.” That describes St. Louis to a tee, past and present.The collection gets off to strong start with the first story, “Abandoned Places” by S. L. Coney. In this story, after Ian’s father disappears, most assume he’s dead. But Ian isn’t so sure. He follows his stepmother one night and discovers that his father is held prisoner. There is some wonderfully vivid imagery especially involving the slitting of a throat. Without giving anything away (I hope), that one sentence that stood out among the rest was: “The skin gaped on either side, of that opening, giving (deleted to prevent a spoiler detail) a second smile.” This always gives me the shivers.While “Abandoned Places” was my favorite, my least favorite was “Deserted Cities of the Heart,” by Paul D. Marks. It was rather existential, really didn’t have a plot and mostly seemed to center around loner Daniel Hayden lying under the Gateway Arch.The rest of the authors cover the bases; it’s all here: a 1950s story about racism that also has no plot, a mentally unstable African-American man after a tour in Vietnam, slackers, femme fatales, divorces, death, missing children, skinheads, ending with a twist, convicts and drugs and drug dealers. All in all, except for the first story, I felt that all the others were just okay. St. Louis Noir receives 3 out of 5 stars in Julie’s world."}, {"userName": "Tonstant Weader", "userReviewDate": "Jul 25, 2016", "userURL": "http://www.goodreads.com/user/show/2050909-tonstant-weader", "userReview": "Bold travelers always want to go where the locals hang out, wanting to see past the usual tourist route that is programmed to keep them on a pristine path with never a touch of noir. But of course, if you never stray from the antiseptic path, you never see the real city. I think if I were traveling somewhere, in addition to the guide books to the official sites, i would search for an Akashic Noir series for that city, to give myself a taste of the grit and noir. St. Louis Noir by Scott Phillips is an introduction to the noir of that notoriously broken city.Ferguson, a St. Louis suburb, exploded on the national consciousness with the murder of Michael Brown and the subsequent Department of Justice report detailing the exploitation of its citizens by using the police to finance city services with abusive over-policing and policies that impoverished its citizen. It makes sense, then, that race play a central role in many of the short stories in St. Louis Noir. Philips selected a great collection of stores that reinforce his view that St. Louis as a blend of high and low art, culture and society. There are rich, successful criminals and poor and hapless criminals. There’s wealth and poverty. The dichotomies are painful.My favorite stories were Abandoned Places by S. L. Coney, a story of a young boy whose father has disappeared, staying with his dad’s girlfriend in uncertainty, fear and despair. It broke my heart into so many pieces I had to set the book aside for a day before I could approach it again. Another great story is Fool’s Luck by LaVelle Wilkins-Chinn, another story that reaching deep inside and squeezes.I have rows of Akashic Noir books in my bookshelves, so I expected to enjoy St. Louis Noir and of course I did. The only problem is I came to the last page and wanted more, more, more. There were several great stories and poetry that represent the city in its duality. I love short stories, I love mysteries, I love reading about other places. Akashic Noir’s series brings them all together inside one book.St. Louis Noir will be released next week on August 2nd. I was provided a e-galley of St. Louis Noir by the publisher through Edelweiss.https://tonstantweaderreviews.wordpre..."}, {"userName": "Tim Hennessy", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/374755-tim-hennessy", "userReview": "When it comes to fiction, especially of the criminal in nature, the Midwest has long taken a backseat to other regional literature often just seen as the boring, cold weather cousin with stories as spicy and as flavorful as a hotdish.Stories that “traffic in fatality and doom and bad luck and characters who persistently, knowingly, act against their own best interests” might be another ample description for a deep vein of crime fiction or, maybe, a fair assessment of the current day Midwest. It is the lifeblood pumping through the rich assortment of stories in the St. Louis Noir anthology edited by Scott Phillips.Laura Benedict’s “A Paler Shade of Death” wastes no time delving into the waking nightmares of Becca, a suburban mother reeling from grief. In the midst of clearing out of the house she once shared with her estranged husband, a young neighbor boy offers help and an unexpected gut punch, “My dad said your kid died.” As Becca attempts to move on with her upended life she veers between catharsis and psychosis; Benedict’s story thrills to the very end. In Jed Ayres’ “Have You Seen Me?” Betts cleans up properties and scavenges through the unused pieces of buildings to be repurposed in the urban renewal projects of his wealthy boss, a developer only referred to as Citizen Number One. “The city was eating itself and he was part of the digestion process.” Amongst the empty remnants of a once thriving metropolis Betts occasionally comes across bodies he has to remove. He believes them to simply be vagrants, their resemblance to pictures of missing people on fliers he encounters just a coincidence until guilt forces him into action. It’s a dark, chilling tale, one of Ayres’ strongest stories to date. Another high point in the collection, Umar Lee’s “A St. Louis Chirstmas” features a mismatched pair of vigilantes, members of the River City Robinhoodz, who look to appropriate a shipment of cash from crew of meth dealing good ol’ boys. The madcap holiday tale is an excellently paced heist story gone awry that makes for an enjoyable departure from the usual Christmas fare. (my review from Crimespree #65)"}, {"userName": "Krissy", "userReviewDate": "Nov 21, 2016", "userURL": "http://www.goodreads.com/user/show/37393878-krissy", "userReview": "I received a copy of St. Louis Noir from a Goodreads giveaway. I am not an avid short stories reader, but I do like crime fiction/noir/mysteries. The stories in this book were written by fourteen different authors and took place in different areas of St. Louis and in various time periods and with different characters. It is difficult to award a \"stars\" rating because some of the stories were great, others just okay. The standout story to me was \"The Pillbox\" by Chris Barsanti, which took place in the Maplewood suburb of St. Louis in 1989. The story involves a S.H.A.R.P. skinhead (Skinheads Against Racial Prejudice) who gets involved in drug dealing with some racist skinheads. I graduated high school in 1989 and it brought me back to that year very well (warts and all.) I knew several SHARPs at that time and Barsanti's characterization of Randall was excellent. I really felt like he might have been someone I could have been acquainted with. Thank you Akashic Books for giving me the opportunity to read and review this book!"}, {"userName": "Sarah Hayes", "userReviewDate": "Jul 14, 2016", "userURL": "http://www.goodreads.com/user/show/3294425-sarah-hayes", "userReview": "There are a lot of layers of St. Louis life for authors to pull from to fuel their stories’ emotional turbulence: economic disparities, racism and segregation, urban decay, failing school systems, police brutality, environmental disaster zones, and so forth. But at the heart of nearly every story in “St. Louis Noir” is someone who makes mistakes and keeps making mistakes long after any sensible person would have stopped and re-evaluated their life decisions. Some stories are like artful train wrecks, in which readers can barely look away before seeing what disastrous turn the protagonist’s life takes.You can read my full review of ST. LOUIS NOIR at the Current independent student newspaper website. A reviewer copy of the paperback was provided for free by Akashic Books; no other compensation was offered for this review, nor was a review required to receive the book."}, {"userName": "Stacy Cook", "userReviewDate": "Aug 06, 2016", "userURL": "http://www.goodreads.com/user/show/7989497-stacy-cook", "userReview": "I've read a couple of the Noir city anthologies previous to this & by far this one has to be my favorite! Filled with stunning prose & engaging stories from beginning to end.For me there were a few stand outs. The first being Abandoned Places by S.L. Coney. The story of a boy living with his father's girlfriend when his dad just up & leaves one day. While I could see where the story was going I was still left speechless at the end. The second highlight was A Paler Shade of Death by Laura Benedict. Gripping from the beginning it is the story of a woman who is thought to have killed her young son & maybe more. Finally, Have You Seen Me? by Jedidiah Ayres. A \"cleaner\" of the most unusual kind searches for the forgotten of St Louis."}, {"userName": "Steve Dallape", "userReviewDate": "Oct 05, 2016", "userURL": "http://www.goodreads.com/user/show/38840547-steve-dallape", "userReview": "This was a kind of hit-and-miss collection for me. Some of the stories are only loosely what I would consider\"noir\", though that didn't bother me much. Many of the writers seemed to be trying way too hard to cram St. Louis references into their stories. I realize that these are short stories, and it would be difficult to develop a sense of place in a short amount of time with being a little heavy-handed with the local street names, neighborhoods and product mentions, but I think that often they did not even serve the story. That being said, I did enjoy the book and recommend it if you like crime fiction."}, {"userName": "Brian Rothbart", "userReviewDate": "Jul 19, 2016", "userURL": "http://www.goodreads.com/user/show/32212-brian-rothbart", "userReview": "Another solid book in Akashic's noir series. I have read a number of these books and I have not found a dud. Of course some stories are better than others, but on the whole these are great stories. I highly recommend them to anyone who has visited, is visiting or want to visit any of these locations. If you love the noir genre then I highly recommend these books. Short stories are great because they can be read any time, read out of order and if you don't like a story then you haven't invested too much time or effort."}, {"userName": "Laurel", "userReviewDate": "Jul 08, 2016", "userURL": "http://www.goodreads.com/user/show/2134922-laurel", "userReview": "St. Louis Noir, edited by Scott Phillips, is one of the better noir anthologies in the Akashic series and I’ve read quite a few. There’s not a story I didn’t like and the addition of poetry was particularly unique and appreciated. All of the stories Phillips chose to include were easy to understand and quite representative of St. Louis, a Midwestern city under siege that has outlived its past with a future that’s uncertain."}], "description": "\"Featuring a baker's dozen of original stories, plus one 'poetic interlude,' this new entry in Akashic's globetrotting anthology series explores, as editor Phillips, author of The Ice Harvest, tells us in his introduction, the 'collision of high and low' that makes St. Louis so interesting to crime writers...The stories here are uniformly strong. Regular readers of the Noir series (since its inception in 2004, there have been about 75 installments) know what to expect: tightly written, tightly plotted, mostly character-driven stories of murder and mayhem, death and despair, shadow and shock.\"--\nBooklist\n'Phillips lends his own talents as well, bringing the total body count to 13 works of fatalist fiction as well as a poetic interlude featuring Poet Laureate Michael Castro. Joining him as accessories are St. Louis Post-Dispatch film critic Calvin Wilson; LaVelle Wilkins-Chinn, a fiction writer whom Phillips himself taught; and writers John Lutz, Paul D. Marks, Colleen J. McElroy, Jason Makansi, S.L. Coney, Laua Benedict, Umar Lee, Chris Barsanti, Linda Smith and Jedidiah Ayres.\"--\n St. Louis Newspaper\n\"Phillips has shrewdly captured the fundamental elements of noir, transforming St. Louis into a gruesome world that is neither black or white, but quintessentially gray.\"—Alive Magazine\"Joining Seattle, Memphis, Phoenix, and other noir outposts, St. Louis gets a turn to show its dark side in Phillips' collection of 13 dark tales and a poetic interlude...[A] spirited, black-hearted collection.\"--\nKirkus Reviews\n\"Editor Scott Phillips has compiled 13 tales of grim homicidal happenings (plus one poetic interlude) set in the streets of the St. Louis area.\"—St. Louis Post- DispatchAkashic Books continues its groundbreaking series of original noir anthologies, launched in 2004 with Brooklyn Noir. Each story is set in a distinct neighborhood or location within the city of the book.Brand-new stories by: Calvin Wilson, LaVelle Wilkins-Chinn, John Lutz, Paul D. Marks, Colleen J. McElroy, Jason Makansi, S.L. Coney, Michael Castro, Laura Benedict, Jedidiah Ayres, Umar Lee, Chris Barsanti, L.J. Smith, and Scott Phillips.From the introduction by Scott Phillips:\"The St. Louis region has had a rough time over the past few years. A number of our school districts are unaccredited. A large section of a North St. Louis County landfill is burning uncontrolled--yes, it's on fire--and said fire is only yards away from a World War II–era radioactive waste dump. There's the matter of the region's de facto segregation, a persistent pox on the city and county decades after the explicit, institutional variety became illegal. A number of our suburban municipalities have lately been exposed in the act of strong-arming their poorest citizens, running what amount to debtors' prisons. In recent years one of those cities, Ferguson, has become a national synonym for police misconduct and institutional racism...Amid all this is a rich, multicultural history of art and literature both high and low, stemming from conflict and passions running hot...This collection strives for some of that same energy that the collision of high and low can produce...All these writers come at their work with different perspectives and styles but all with a connection to and a passion for our troubled city and its surroundings.\"", "title": "St. Louis Noir", "url": "https://www.goodreads.com/book/show/27131486-st-louis-noir", "average": 3.57, "cover": "https://images.gr-assets.com/books/1462498095l/27131486.jpg", "reviews": 16, "authors": [{"url": "https://www.goodreads.com/author/show/55571.Scott_Phillips", "name": "Scott Phillips"}], "type": ["Short Stories", "Mystery", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/27131486-st-louis-noir", "http://www.goodreads.com/book/show/96621.The_Ice_Harvest", "http://www.goodreads.com/book/show/8848754-the-adjustment", "http://www.goodreads.com/book/show/1468480.Cottonwood", "http://www.goodreads.com/book/show/544941.The_Walkaway", "http://www.goodreads.com/book/show/16129278-rake"]}