{"ratings": 2260, "userreviews": [{"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Jan 17, 2014", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "[It remains a matter of future potential; nothing at all happens here, other than a chaste hug and kiss on the cheek, but Rose and her young man comfort themselves with the thought that they'll be able to pursue the relationship further back at Oxford (hide spoiler)]"}, {"userName": "Debbie Zapata", "userReviewDate": "Oct 26, 2015", "userURL": "http://www.goodreads.com/user/show/22110057-debbie-zapata", "userReview": "I needed two things from this book. One: a print book to keep me from peeking ahead in the book I was reading aloud to my husband. Two: something very easy to focus on since my head is filled with Other Things at the moment.The book fit both those requirements, so I should not feel disappointed in it, but I do. There was Stewart's usual lush descriptions of plants and landscape, which so often leave me wondering just what this or that type of plant really looks like. I would Google such things normally, but simply did not want to make the effort this time. I also felt like I had read the basic plot before, even though I could not remember ever reading this particular book. Single woman goes off for a vacation, expects her brother to join her, he is delayed. Meanwhile she explores the island, getting to know two mysterious men who each claim to have ties to the vacant country house. One is dashing and charming but a skilled liar, the other more down to earth, apparently. I just could not get too thrilled by the story, but it may not be the book's fault. As I said, at this point I have tons of Life Details swirling through my pea-brain and am having trouble concentrating on anything other than in-law visits and trip details. So to be fair to Ms. Stewart, I will re-read this someday when my world is not quite so frantic, and see if my reaction is any different."}, {"userName": "Hannah", "userReviewDate": "Jun 16, 2009", "userURL": "http://www.goodreads.com/user/show/2411388-hannah", "userReview": "One of Stewart's three \"Cottage\" books (the other two being Rose Cottage and Thornyhold)Not as strong in her writing as with the other two (am I right in thinking that this was Stewart's last published novel?). A somewhat weak, anticlimatic ending marrs the stronger beginning.Regardless, a weak Stewart book is still a better reading investment then what dreck passes for romantic suspense today IMO."}, {"userName": "Cphe", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/14907696-cphe", "userReview": "It saddens me to rate this novel two stars. Mary Stewart has been a comfort read for more years than I care to remember but for some reason I just didn't get around to reading Stormy Petrel.Loved the setting and the beautifully visual descriptions of Moila, an island off the coast of Scotland, but the romantic suspense element was weak. I didn't feel any chemistry, spark between the main characters Rose and Neil. Not what I've come to expect from the author over the years. Not a keeper."}, {"userName": "Susan", "userReviewDate": "Sep 25, 2013", "userURL": "http://www.goodreads.com/user/show/2429588-susan", "userReview": "No one creates a story like Mary Stewart! Her location descriptions are so detailed that you feel as if you are there. This was the strong point of this story for me. A house on a desolate island with few citizens amidst birds, seals, rocks, waves, wind, flowers, etc. I really got the sense of the place, the location, smells and terrain. Wonderful!The story itself was interesting, though not really a gothic. It was more of a light mystery and many reviewers said that this type of story is not her usual fare. True, but I look upon this as more of a 'it-could-happen-in-real-life' type of story, not one written with some far-fetched elements to enhance the entertainment for the reader. I enjoyed the characters, though was disappointed that the bad guy was the bad guy! I think he had a more interesting personality than the 'good guy', but overall, everyone in the story was well-written. No surprises in the story, as each new development was revealed in real time but that's OK. It felt like a curl up on the sofa type of read and that is perfect in itself.Buddy read for Madam, want to talk about author Mary Stewart"}, {"userName": "Barbara Klaser", "userReviewDate": "Mar 04, 2012", "userURL": "http://www.goodreads.com/user/show/5285715-barbara-klaser", "userReview": "Reread finished October 22, 2017.February 29, 2012 review: This made me remember why I once loved romantic suspense but have changed my feelings about more modern writings.A gentle, suspenseful story respectful of nature and the slow and easy pace of a blossoming love interest versus blatant lust. Mary Stewart first inspired me to try my hand at writing. Perhaps I'm a bit prudish, but romances were once about the feelings and freshness of meeting someone, wondering, testing the waters, savoring each step of the process of getting to know someone.I'm once again impressed with the author's ability to paint with words, and I find refreshing her ability to tell an intriguing story without rushing to get my adrenaline moving or using cheap thrills as page turners.Stewart soft peddles her suspense and her romance, in this book. But that doesn't mean they're not worth the read. Her characters are people I can relate to, the events are believable, the setting makes me want to visit this fictitious Hebridean isle and hear mermaids in the song of the seals."}, {"userName": "Angie", "userReviewDate": "Jun 03, 2017", "userURL": "http://www.goodreads.com/user/show/1494253-angie", "userReview": "3.5 stars A gentle book with a little mystery and romance. (Squeaky clean, btw). Great location of Scottish Islands with evocative descriptions. Reminded me a little of Rosamunde Pilcher's shorter books."}, {"userName": "Jenny", "userReviewDate": "Feb 27, 2009", "userURL": "http://www.goodreads.com/user/show/2078463-jenny", "userReview": "Mary Stewart is so satisfying to read. She takes you to foreign shores and beautiful climes, then ladles on the suspense and the heroine is always clever and brave. I just love her books."}, {"userName": "Nikki ", "userReviewDate": "Jul 24, 2012", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "As with most of Mary Stewart's work (the Arthurian books so far being the only ones I'll except from this), this is light, easy, fairly predictable, and very comfortable. I read it in the bath, and didn't give one thought to how icky my surgical incisions would be looking afterwards, so I'm not saying that's a bad thing: I read it in one go, I enjoyed it, I smiled, and though I won't remember the details in a year's time, I'll remember a cosy sort of experience with cottages and a brainy, brave, but sensible heroine.I would've almost preferred a twist at the end, for the reveal to be reversed, because a) it would've been harder to predict and b) I could see the whole course of where it could've gone from the moment one of the two men arrived on the scene. Mind you, then it would've been more like The Moonspinners, I suppose.And hey, at least this time she didn't marry her cousin."}, {"userName": "Sue", "userReviewDate": "Dec 28, 2008", "userURL": "http://www.goodreads.com/user/show/1019544-sue", "userReview": "As always, an entertaining story from Mary Stewart.The characters were believable and the descriptions of the island, and especially the weather, were rich. The girl is waiting for her brother to join her for a holiday, but he is delayed due to being involved in a train crash. A stranger turns up at her cottage, explaining that he used to live there, but his story is mysterious. Turns out he has a connection to the big house nearby, the owner of which has recently died. Some of the suspense of the story came from the remoteness of the island, and the cottage itself, leading to the character's vulnerability, and her inability to verify the stranger's story at first. It was interesting to think that, with modern mobile phone coverage, this story just would not work!"}, {"userName": "Tammie", "userReviewDate": "Aug 13, 2012", "userURL": "http://www.goodreads.com/user/show/3506989-tammie", "userReview": "2.5 stars. I'm not sure what category to put this one in. Mary Stewart writes romantic suspense, but The Stormy Petrel was hardly romantic or suspenseful. As always though, I did enjoy her descriptive writing. She has a way of pulling you into the surroundings of the story that I really enjoy, but overall a disappointment compared to her other books."}, {"userName": "Jannah (Cloud Child)", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/3338267-jannah-cloud-child", "userReview": "4/5 Audiobook - Narrated by Isla BlairRose Henmore, teacher at Cambridge by day, poet and author by night gives in to her longing for idyll to write in peace during the summer term, when she finds an advert for an \"ivory tower\", on an isolated Scottish Isle. It boasts nature, nature and more nature with \"relatively mod cons\" and sounds right along her street, so she invites her equally nature loving, bird watching brother Doctor Crispin to join her. Her adventure begins within the the first week of her stay, while her brother is delayed, one stormy night, two strangers ask for shelter, both with something to hide. While she spends her days exploring and writing, someone has other plans which involve the home in which she stays. And so the mystery begins.I can understand why this gets lower ratings as the intrigue was light and the romance further subtle, but they were a backdrop to the gorgeous and isolated Scottish Isle of Mull, home to the seals and the rare bird Stormy Petrel.. And therefore I found it lovely to listen and drift off to. Also the narrator Isla's soft tone sounded perfect and non intrusive, lending to a an atomosphere of idyllic nature and calm.I think as I look back to some of my previous reads which I gave lower stars, if I listened to instead on audio, I would given far higher merit. The beautiful lush description of scenery and nature, which is so key to Stewart's plots, are absolutely divine to imagine. But in the habit I have of reading fast, I dont savour the words the way I can when I listen.It's rather meandering and doesn't necessarily have a fixed boundary but its is very pleasant. So.. If you're looking for a quiet book with dreamy atmospheres, I recommend this, especially with this narrator."}, {"userName": "Amy", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/5684259-amy", "userReview": "What was that? Was it supposed to be a mystery? A romance? A field guide on the roosting habit of birds native to the Hebridean islands? It failed on all accounts. I should have given up at the 60% point when NOTHING had happened. Lame. My LEAST favorite Mary Stewart book."}, {"userName": "Becky", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/45216743-becky", "userReview": "More like 2.5 stars. I think I had high expectations and the novel missed the mark for me."}, {"userName": "Jane", "userReviewDate": "Jul 09, 2014", "userURL": "http://www.goodreads.com/user/show/2050107-jane", "userReview": "I fell in love with a Scottish island when I was eight years old.Looking back it was a mad thing for my parents to do, travelling so far across country with two young children, but that wanted to see Scotland, and they had been guided to a particular place by a very good friend. So if it was madness it was the very best kind of madness, and if I had to live outside Cornwall I should still choose to live on a Scottish Island.That’s what drew me to ‘Stormy Petrel, even though I knew it was one of Mary Stewart’s later novels and not considered to be her best work; it was set on a fictional Scottish island, and island very close to and very like mine.The story opened in a Cambridge where Rose, who write poetry for love and science fiction for money, was a tutor of English. A newspaper advertisement caught her eye: an advertisement for cottage on the Hebridean island of Moila. It sounded perfect. Rose could have the time and space to write and her doctor brother, a keen wildlife photographer, would love to take pictures of the rare birds that nested on the island.Rose travelled north before her brother, and she found the island and the cottage to be everything she hoped them to be.When Rose wakes in the night to the sounds of someone moving about downstairs she assumes that her brother has arrived. But he hasn’t, and another man is making tea in the kitchen. Both are startled, but the intruder is quick to reassure Rose, explaining that he had lived there with foster parents, he had fallen out of touch, he had no idea that they had moved away. And then another man arrived. His explanation was that he was a visiting geologist, he had been camping, and when the storm carried his tent away he had come to look for shelter where he saw lights.The two men claimed not to have met, but there was something in their manners towards each other that told rose that they had, that something was amiss. Rose made a sensible decision: she withdrew to her room, leaving the pair to make the best of things downstairs.When Rose woke again the storm and her house-guests had gone. She thought that was the end of things, but of course it was only the beginning ….I found a lot to like in ‘Stormy Petrel’.Moila is so beautifully and lovingly described that I was transported, and I didn’t doubt for one second that it was inspired by a place that Mary Stewart knew and loved.”It is not a large island, perhaps nine miles by five, with formidable cliffs to the north-west that face the weather like the prow of a ship. From the steep sheep-bitten turf at the head of these cliffs the land slopes gently down towards a glen where the island’s only sizeable river runs seawards out of a loch cupped in a shallow basin among low hills. Presumably the loch – lochan, rather, for it is not large – is fed by springs eternally replenished by the rain, for nothing flows into it except small burns seeping through rush and bog myrtle, which spread after storms into sodden quagmires of moss. But the outflow is perennially full, white water pouring down to where the moor cleaves open and lets it fall to the sea.”I loved that Rose came to love her island as I loved mine, that she appreciated that things that made it so special. And I was pleased that she proved herself to be sensible, capable and practical.I was pleased that the romance was low-key, and that the resolution of the story was gentle, with future possibilities simply suggested.I was less pleased that the suspense was low-key, that it became clear quickly who was the hero and who was the villain, that the villain was not so very wicked, and that there was very little mystery to be resolved or danger to be faced.And so I loved my trip to Moila, I loved the company, but the story - it needed something more."}, {"userName": "Joan Bannan", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/42252751-joan-bannan", "userReview": "This is not as face-paced or as thrilling a some of Mary Stewart's novels, but I always enjoy rereading it. As with some of her other novels, the protagonist falls in love very quickly, which has always amazed me, but I know times were different in her generation. At least in this novel, she looks toward the future instead of including a marriage proposal.Mary shares with us memorable characters who play off each other's idiosyncrasies beautifully. She also gives us a feeling for the Scotland Isles, a view of laid-back, but curious, inhabitants, and teaches about a tiny, but strong, rare bird."}, {"userName": "Theresa", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/18020254-theresa", "userReview": "The heroine of \"The Stormy Petrel\", Rose Fenemore, is looking for ‘an ivory tower’. An English professor/author, Rose finds the perfect set-up for a vacation in the Scottish isles. Her brother Crispin will join her as he is a doctor and a naturalist/photographer on the side. However, events conspire to delay Crispin’s arrival, and in the timed-honored style of Mary Stewart, Rose has an adventure in the meantime.“The walls of the cottage were thick enough to shut out the worst sounds of the storm’s buffeting, and even the creaking of doors and rattling of windows could not keep me awake for long. But something, some sharper, unaccustomed sound, brought me out of my first deep sleep into listening wakefulness.”.This novel is what I would call a quick -and- easy read. Unlike several of her other novels, this one is not chock-full of twists and turns or thrilling adventure or mystery. The closest you get to ‘mystery’ is trying to discern whether or not Ewen Mackay is who he says he is… is he a harmless handsome guy, or is he really, underneath, an escaped convict who likes to rob helpless little old ladies? What is he doing on the island? Did he return, as he confesses to Rose, because of sentiment to his childhood home…or are there more sinister reasons?Mary Stewart’s heroines are usually capable, self-sufficient, and able to cope well with each novel’s plot (although, at times, they are also ‘realistically human’. I am thinking of Nicole in “The Moonspinners” and her obvious anguish over Colin, a fifteen-year-old boy’s, fate.. and the resulting indecision she has. Does she simply, as instructed, ‘walk away’, or should she look for Colin, even if it means danger to herself?)Rose has to decide what to do when two strangers land on her doorstep on a ‘dark and stormy night.’"}, {"userName": "Mary", "userReviewDate": "Feb 26, 2015", "userURL": "http://www.goodreads.com/user/show/4427991-mary", "userReview": "When Rose Fenemore travels to the island of Moila off the west coast of Scotland, she is looking forward to spending a quiet holiday with her brother Crispin in a paradise filled with seabirds and wild flowers. Remote and lonely, the secluded island seems to Rose to be the perfect place to relax and get away from it all. In fact, the isolated cottage she has rented - advertised as an \"ivory tower\" - promises to be the ideal retreat where Rose can finish writing her novel, and Crispin can commune with nature - walking, fishing and indulging in his passion for photography.However, things don't turn out quite so idyllically. Her brother's arrival is delayed, and the island's peace is shattered by the arrival of two men, seeking shelter during a violent summer storm. Each man tells a remarkably different story - conflicting narratives that draw Rose into a web of menace and suspicion.Rose's discovery of the stormy petrels - the fragile, elusive seabirds that nest ashore but spend the majority of their lives flying just above the waves - comes to symbolize for Rose her confusion about Ewen Mackay, the man known as the island's prodigal son, as well as the man who calls himself John Parsons - someone whose account of himself Rose has every reason to distrust.I enjoyed reading this book - it was certainly interesting and a remarkably quick read for me. However, I must say that I didn't really find the plot all that suspenseful - at least not as suspenseful as some of Ms. Stewart's other work that I've read. Although I wouldn't say that this book is Ms. Stewart's absolute best - compared to some of her other books that I've read in the past - it still was quite good. I would give The Stormy Petrel by Mary Stewart an A!"}, {"userName": "Terri Lynn", "userReviewDate": "Jul 12, 2011", "userURL": "http://www.goodreads.com/user/show/5699299-terri-lynn", "userReview": "THE STORMY PETREL isn't really a true mystery. Rose, a professor of English Literature at Cambridge in the UK needs an \"ivory tower\" where she can work on her poetry between terms. Her brother Crispin, a doctor with a hobby of photographing birds, needs to unwind in the country (his wife Ruth loves busy city life). They decide to go off together to a remote, isolated cottage in the wilds of Scotland. When Crispin is delayed, Rose wakes up to find a strange man in the house who entered with a key and says he grew up there and thought his parents were there. He is rather charming, a bit too slick, and not entirely trustworthy. A knock comes at the door and it is another man, this one gives a name he saw on an envelope on the mantel. Who are these men and what do they have to do with the big house on the island left by an elderly lady they both claim to have known. As the story unravels, Rose also meets with two of her students from Cambridge who are there on their holiday, her brother is delayed because he is injured in a train wreck, and after she is stranded and has to spend the night in a tent, the police and the customs agents come to solve a mystery we long knew the answer to. This is no whodunit. We know all along whodunit and only find out why at the end. As always, Mary Stewart's descriptions of the flora and fauna of the scene of her novel is rich and detailed enough that the reader can see it in her mind's eye."}, {"userName": "Bethany", "userReviewDate": "Jul 04, 2011", "userURL": "http://www.goodreads.com/user/show/4314582-bethany", "userReview": "Not the finest of Mary Stewart's romantic suspense novels, but I liked it a lot for several reasons. The first being the heroine ended up with (or it implied she ended up with) the guy I liked better. I always complain to my sister that whenever there are two men in a Mary Stewart novel I always like the one who ends up being the guy she doesn't fall in love with or, on one occasion, the man who ends up being the villain. The second reason is the main character was a writer so I identified with her more than I usually do with Stewart's heroines. I loved several of the passages regarding writing, especially this one on inspiration:\"I sat at the kitchen table, staring at the blind white blankness in front of me, and slowly, like a clear spring welling up from the common earth, the poem rose and spread and filled me, unstoppable as flood water, technique unknotting even as it ran, like snags rolled away on the flood. When it comes, it is worth everything in the world. There is too much easy talk about \"inspiration,\" but at such times one sees it exactly for what it is, a breathing in of all experience, all apprehension of beauty, all love. As a fire needs air to make it burn, so a poem needs to be fuelled by each one of these. And the greatest of these is love.\"The last reason is, well, it's Mary Stewart! Her settings are always so enchanting; I wish I could jump into her novels. Her books and the memories I associate with them make me happy."}, {"userName": "Meagan", "userReviewDate": "Jul 19, 2010", "userURL": "http://www.goodreads.com/user/show/270740-meagan", "userReview": "[What's so mysterious about two strangers, one of whom seems shifty and turns out to be, in actuality, shifty? (hide spoiler)]"}, {"userName": "Diane Lynn", "userReviewDate": "Sep 19, 2013", "userURL": "http://www.goodreads.com/user/show/9796451-diane-lynn", "userReview": "This was a group read with the Mary Stewart group.As usual the descriptive prose of Mary Stewart was front and center in this book. She can describe a place so well that you simply feel you are there. There were also some interesting characters. I enjoyed the interaction between Rose and her two students. I also enjoyed reading about the birds and seals. Unfortunately, beyond that, the book fell short. There wasn't much of a plot, there wasn't really a romance and there wasn't much in the way of suspense. The last few chapters turned out to be more of a statement on the environment and commercial development. Not at all what I was expecting."}, {"userName": "SarahC", "userReviewDate": "Jan 19, 2013", "userURL": "http://www.goodreads.com/user/show/211925-sarahc", "userReview": "This was an interesting Mary Stewart story and includes a setting I would travel to at this very moment. The story itself was not told with the same strength and energy found in her stories that I have read. The plot includes a less mysterious crime element and the cast of characters seem to move in and out of the story in a more random way somehow. I would classify this as a much less romantic suspense tale also."}, {"userName": "Sharon George", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/30521951-sharon-george", "userReview": "Not one of my favorite Mary Stewart books but enjoyed listening to the audible book."}, {"userName": "Kirsty", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/56491386-kirsty", "userReview": "I selected Stormy Petrel as my first full-length Mary Stewart, and very much enjoyed it overall. There is a great depth to it, and whilst I found much of the dialogue to be stilted and awkward, the real strength lies in Stewart's descriptions. Well paced and interesting, Stormy Petrel reminded me rather oddly of a more grown-up version of one of Enid Blyton's Famous Five books, with secluded cottages on remote islands, obscured identities, a mystery at its heart, and strange men walking around at night. The penultimate chapter is undoubtedly odd, but it works well as a whole, and I am very much looking forward to reading the rest of her books."}, {"userName": "Angelica Bentley", "userReviewDate": "Oct 30, 2016", "userURL": "http://www.goodreads.com/user/show/24657006-angelica-bentley", "userReview": "This book completed my collection of Mary Stewart's opus (which I managed to buy entirely in hard cover) but I put off reading it for three years, fearing a let-down. This story was published in 1991 when she was 75 years old. I had already read the last two books that followed this one, and was familiar with the evolution of her style towards a gentler, more reflective perspective; however, I was not prepared for the autobiographical aspect. Considering her fiercely private persona and aversion to giving interviews, I was enchanted by the candour and passion in the thinly-veiled insight into her psyche in the passages where the protagonist talks about writing, particularly the poetry.Woven into a conventional girl-meets-boy tale with mildly suspenseful elements (still her trademark framework), is the full story of Mary Stewart's own love affair with the craft of writing and the magic of constructing a world made of words. I found it charming, touching and fascinating.Rose Fenemore, is a young and talented don at Cambridge University, teaching English (just like Stewart at Durham Uni). She also writes poetry and, under a male pen-name, science fiction. At the end of term, seeking a quiet place to concentrate on her writing, she rents a remote cottage on the tiny island of Moila (Hebrides) described as an “ivory tower”. Her brother, Crispin, is on his way to join her for a 2-week stay but the train he's on derails and a badly-sprained ankle keeps him in hospital for a week. Rose takes advantage of her forced isolation to work hard on both her poetry (muse-dependent) and her lucrative science fiction series. One wild night she finds an attractive stranger taking refuge from the storm in her kitchen, while a second young man also begs for shelter from the weather. Rose is wary but can hardly refuse. Very soon she becomes enmeshed in the mystery of the Big House left empty by the death of the well-liked Mrs. Hamilton, while she's trying to discover the truth about the two men, both of whom are not what they seem.The pace is steady but more leisurely than current fashion dictates. I love Mary Stewart's ability to transport me to her chosen location, and her deep love for the Highlands of Scotland shines in the measured prose. I am familiar with the places she describes, they truly are mesmerizing and like nowhere else I've ever been. This is a rather short book for her (only surpassed by the novella The Wind in the Small Isles, which I consider under-developed), and it certainly lacks the sharp edges and relentless pace of her earlier work, but I found it interesting all the same because of the glimpses into her writing process. As ever, her characters and dialogue are convincingly real, and as developed as the narrative requires.The story is disappointing, ultimately, as there is no romance whatsoever, only a hint at the end about further developments. Also the mystery element is marginal. If you read Mary Stewart for the exquisite blend of suspense and romance of the early work, you may find this novel wanting. The great storytelling is still here but with maturity dulling the edge. I'm glad I read it once but it's probably the least likely of her books that I would want to read again."}, {"userName": "Ape", "userReviewDate": "Oct 08, 2013", "userURL": "http://www.goodreads.com/user/show/3091902-ape", "userReview": "This sounds like heaven to me - set on a little island off the coast of Mull (Scottish island) - very tiny village, but the main character is staying in a remote cottage. Bliss! The atmosphere she creates in this book of the Scottish islands, the coast, the machair and the general peace and wonderfulness is just fantastic. This book was a fantastic read if only for the mental escape away to the tiny island.The voice of this book was a bit curious. It really reads as though the characters are from the 1950s, and yet the copyright is 1991 and things like video cameras are mentioned... so I don't know if it was supposed to be set later, but from the way people spoke, I plonked it firmly in the 50s and that's where it remains in my imagination.Rose is a university lecturer in the south of England (Cambridge I think, or was it Oxford?). Anyway, she's away on her hols, and her brother Crispin will be joining her shortly. One stormy night in the cottage, two men turn up, one having thought his parents still lived in the cottage, and the other claiming to have been camping on the machair, but his tent blew away. They both seek shelter with Rose for the night. But something is afoot - is everyone really who they say they are?For a mystery plot I don't suppose this one is super amazing, but I loved the writing and the atmosphere so much that I wasn't much bothered by all that."}, {"userName": "Alyson", "userReviewDate": "Jan 10, 2008", "userURL": "http://www.goodreads.com/user/show/752985-alyson", "userReview": "A Mary Stewart book that Sofie gifted me—yesterday when I finished Nine Coaches Waiting I was chagrined to realize that I didn't clearly remember the plot or characters of this one, in contrast to the other Mary Stewarts I've read; and since one Mary Stewart book gives the reader a strong longing to read more and more, I picked this up next.The Hebridean island of Moila is described so gorgeously, I feel I might know it—and its residents—if I were to go; Mary Stewart has a way with describing nature and surroundings, and rather than being gratuitous or diverting the reader away from the plot line, the setting is so a part of the action, so important, so essential, and so well-described, that I'm always left with a warm feeling for the location.Despite that aspect, this isn't a regular Mary Stewart; the \"mystery\" is so mild, and it almost completely lacks suspense. Many is the Mary Stewart book when I simply couldn't put the book down when the action ensued, and I actually spoke to the characters out loud trying to guide them, feeling I was there with them. That's completely missing here; I'm just an observer, and nothing is urgent enough at any rate to require my own involvement. The romance is so gentle it's almost non-existent, and the villain not evil enough, and too easily seen and caught.This is a nice, gentle read; but don't take it for typical of Mary Stewart's books because it isn't gripping or fulfilling in the same way."}, {"userName": "Kaethe", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/1072582-kaethe", "userReview": "Not to be all literal, but couldn't they have shown a bird on the cover? Or, I don't know, an isolated island? Because I don't have the foggiest idea what a petral is, and sometimes I can't get to the computer to google.Although I dearly love Mary Stewart, this is not my favorite. It feels a little thin, not fully fleshed out. If you haven't read Stewart before, I suggest you start with Airs Above the Ground or Thornyhold orThis Rough Magic."}, {"userName": "Victoria", "userReviewDate": "Jul 05, 2016", "userURL": "http://www.goodreads.com/user/show/159178-victoria", "userReview": "I love Mary Stewart, but I will freely admit that The Stormy Petrel was subpar as far as Mary Stewart novels go. It is one of the few I've never read and I found it in a used bookstore in Mesa, Arizona, and it was even a first edition so I grabbed it. But her books, including her Merlin saga, usually have a lot more suspense, tension, romance . . .I won't say anything because I dislike spoilers, but let's just say there was very little of any of that. The setting is awesome, not unlike the island of Iona, and her characters are fine, but I guess I just never really cared about them. It is one of her later books, published in 1991, but I thought her first book, Madam Will You Talk\" was better.I did learn a lot about stormy petrels, though."}], "description": "Rose has found the perfect island retreat where she can write in peace and her brother Crispin can photograph wildlife. But it is not so easy to escape the real world.Crispin's arrival is delayed and Rose has to deal alone with two strangers who come in from the sea during a summer storm. Neither man is quite what he claims to be, but how can Rose tell which one to trust?", "title": "Stormy Petrel", "url": "http://www.goodreads.com/book/show/11061454-stormy-petrel", "average": 3.46, "cover": "https://images.gr-assets.com/books/1328105119l/11061454.jpg", "reviews": 147, "authors": [{"url": "https://www.goodreads.com/author/show/15590.Mary_Stewart", "name": "Mary  Stewart"}], "type": ["Mystery", "Fiction", "Romance", "Romance", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/11061454-stormy-petrel", "http://www.goodreads.com/book/show/1440640.The_Stormy_Petrel", "http://www.goodreads.com/book/show/1440641.Stormy_Petrel", "http://www.goodreads.com/book/show/36466300-stormy-petrel", "http://www.goodreads.com/book/show/1135286.Stormy_Petrel", "http://www.goodreads.com/book/show/205760.The_Stormy_Petrel", "http://www.goodreads.com/book/show/668162.Stormy_Petrel", "http://www.goodreads.com/book/show/3052768-the-stormy-petrel", "http://www.goodreads.com/book/show/24328623-stormy-petrel", "http://www.goodreads.com/book/show/19784954-stormy-petrel", "http://www.goodreads.com/book/show/82192.The_Crystal_Cave", "http://www.goodreads.com/book/show/116343.The_Hollow_Hills", "http://www.goodreads.com/book/show/64105.The_Last_Enchantment", "http://www.goodreads.com/book/show/27692.The_Wicked_Day", "http://www.goodreads.com/book/show/27695.Nine_Coaches_Waiting", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}