{"ratings": 236271, "userreviews": [{"userName": "Siria", "userReviewDate": "Apr 27, 2008", "userURL": "http://www.goodreads.com/user/show/115473-siria", "userReview": "I'm not going to pull any punches. This book is a misogynistic piece of shit.All I knew about it before I picked it up was the very basic premise—a wizard in modern-day Chicago, who works as a sort of detective—and that it had picked up quite a cult following. I was expecting to really like it, but before I got to the end of the first chapter, my eyebrows had risen to meet my hairline. I kept reading out of some misguided expectation that things would get better, that there couldn't possibly be such a sustained level of misogyny coming from both the character and the authorial voice. Oh, how wrong I was. The main character, Harry Dresden, repeatedly tells us that he's a chauvinist, yes, and shows no signs of wanting to change that. It would have been difficult enough for me to get into a novel with such an unpalatable main character, but the level of narrative endorsement of his viewpoint nauseated me. The female characters in the book are there only to cry, seduce, and occasionally mother. Some of them are presented as having power of their own, but if you take a second glance at them, that power is always represented as secondary to male power, or a sham. Karrin Murphy is a hard-bitten homicide detective and Harry's friend, true; but she's undermined to constant references as to how \"belligerent\" she is, how small and lady-like her hands are, how she cries when he won't share information with her. Let me repeat that: cries. Bianca, the vampire—sorry, vampiress! must use appropriately gendered language!—is defeated because Dresden can see how she's truly ugly beneath all that fake beauty, and so she's humiliated and he can overpower her! All of them use their sexuality to get ahead—or try to, because clearly Harry is just too intelligent to fall for those silly women's wiles!How about an explanation for the motive behind a murder:I gestured toward the room. \"Because you can't do something that bad without a whole lot of hate,\" I said. \"Women are better at hating than men. They can focus it better, let it go better. Hell, witches are just plainmeaner than wizards. This feels like feminine vengeance of some kind to me.\"Or how about one prostitute talking about another:She shook her head. \"No, no. Nothing like that. That wasn't her style. She was sweet. A lot of girls get like—They get pretty jaded, Mr. Dresden. But it never really touched her. She made people feel better about themselves somehow.\" She looked away. \"I could never do that. All I did was get them off.\"This isn't just Dresden being sexist. This isn't just showing us the thought processes of an un-reconstructed chauvinist. This isn't even just using noir tropes—because god knows there are a thousand and one ways of subverting those and reimagining them. This is holding up a clichéd, smug asshole of a main character as the kind of man every guy wants to be, and the kind of man every woman wants to fuck, as a mirror for how Butcher thinks. It's laden with sexist stereotypes that irritate me and in case you couldn't guess, it made me very, very angry.The book also fails on pretty much every technical level I can think of: I have no idea why it's set in Chicago, or why the location was emphasised, because there's absolutely no sense of place to it. For all Butcher told us, it could all have been taking place in Seattle, or Denver, or Kansas City. The plot is silly, illogical, and by rights everyone should have been dead of Stupid within the first two chapters. The writing style displayed an absolute cloth ear for language. I'd imagine that he was trying to recreate the terse, staccato style of noir detective stories, but didn't realise that in order to do so, you need more than short, simplistic sentences. You need to be attuned to the rhythm of what you're writing, to know how to turn a handful of words to best effect, and Butcher neither knows how to do that, nor how to write realistic sounding dialogue at all.I have not read such offensive drivel in a long, long time. Avoid."}, {"userName": "Patrick", "userReviewDate": "Dec 24, 2009", "userURL": "http://www.goodreads.com/user/show/922495-patrick", "userReview": "I never got around to reading these books until The Name of the Wind was published. And when I first did, I was a little pissed. First person point of view. Magic based on thermodynamics. Gritty, realistic world. Arrogant wizard who doesn't know when to keep his mouth shut. It struck rather close to home.... Some people say that the first few books of this series were kinda rough. But I didn't notice anything particularly untoward about them. In fact, I burned through the whole series (11 books at the time) in about two weeks. As a side note, James Marsters reads the audiobooks. And while his first one was a little rough, all the rest are very enjoyable."}, {"userName": "Nataliya", "userReviewDate": "May 02, 2010", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "Let me tell you how a wisecracking Chicago wizard-for-hire with the most rotten luck imaginable won a permanent spot in my heart, making me a devout Dresdenite.'Twas a week before USMLE Step 1, the most important test for any medical school student as it pretty much determines which medical specialty you are supposedly smart enough to pursue. Basically, the stakes were high and the stress reached the previously unknown heights. By then my poor average-sized brain has been fully stuffed with all the medical trivia it was able to handle. \nHave you ever met an overcaffeinated, freaked out, sleep-deprived, shaky med student with bloodshot eyes and propensity to quote at you random basic medical science facts in a high-pitched shaky voice?\n If so, it was probably before Step 1, and this is an honest representation of what my friends and I looked like:Lovely, no? Anyway, physically unable to study any more, I stumbled upon this book on my Kindle app. And this is how Harry Blackstone Copperfield Dresden, he of the magical staff and a black leather duster, entered my life. Suddenly the anxiety was gone, and instead of omg-it's-test-time-and-I-did-not-study-enough customary nightmares I dreamed about Chicago magical world that night. In the week that followed, I got through most of the series - 11 books at that point in time. The stress was gone with the help of Harry Dresden's adventures - and on the test day I beat my goal score by one whopping point! :D\n“A man's magic demonstrates what sort of person he is, what is held most deeply inside of him. There is no truer gauge of a man's character than the way in which he employs his strength, his power. I was not a murderer [...] I was Harry Blackstone Copperfield Dresden. I was a wizard. Wizards control their power. They don't let it control them. And wizards don't use magic to kill people. They use it to discover, to protect, to mend, to help. Not to destroy.”\nI loved this book despite all its imperfections. Harry Dresden, a wisecracking, self-deprecating, Star Wars-references-dropping, never-knowing-when-to-shut-up, and unwaveringly good guy with a penchant for attracting trouble was someone I'd love to be friends with. I even forgave him the annoying and eyeroll-inducing case of old-fashioned chivalry towards women. Plus, his assistant is an erotica-obsessed formerly-evil spirit living in a skull - how can anyone not love that?\n“Harry,\" Bob drawled, his eye lights flickering smugly, \"what you know about women, I could juggle.” \nThis book is a quick and delightfully pulpy read, modeling Harry's personality and adventures on the hardboiled crime noir detective stories with a generous helping of humor set against the paranormal background. It does not aspire to be life-changing or profound, it does not try to be the capital-L literature (that was an excuse to use my favorite Pratchett quote: \"Susan hated Literature. She'd much prefer to read a good book.\"). All it does is take you on a fun and exciting ride, and that's what I love about it. Yes, sometimes it falls flat, or tries too hard, or gets a bit full of itself, but the feeling of sheer fun that Jim Butcher must have had while writing this story is palpable on each page, and it's awesome!\n“Paranoid? Probably. But just because you're paranoid doesn't mean there isn't an invisible demon about to eat your face.” \nThis is a \"freshman\" book, and is not perfect, but it is nevertheless really good. Jim Butcher's narrative voice gets more confident and more polished as the series progresses, especially beginning with book 4. But it was enough to keep me completely engrossed in Harry Dresden's world and read eleven books of the series in a little over a week. I love the Chicago mystical world, I love the characters, I love the fast, even breakneck pace, I love the detective noir touch, I love Butcher's take on mythologies. I absolutely adore the wisecracking - to me, it never felt annoying, maybe because it's a big part of my own (I assume, completely charming) personality.\n““You don't go walking into the proverbial lion's den lightly. You start with a good breakfast.”\nFor all of that, I easily give it four stars. (I'd be tempted to call Harry Dresden my literary boyfriend, but as I learned from the sequels, nothing good can possibly come out of that).\n“I don't want to live in a world where the strong rule and the weak cower. I'd rather make a place where things are a little quieter. Where trolls stay the hell under their bridges and where elves don't come swooping out to snatch children from their cradles. Where vampires respect the limits, and where the faeries mind their p's and q's. My name is Harry Blackstone Copperfield Dresden. Conjure by it at your own risk. When things get strange, when what goes bump in the night flicks on the lights, when no one else can help you, give me a call. I'm in the book.”"}, {"userName": "Jesse", "userReviewDate": "Jun 17, 2007", "userURL": "http://www.goodreads.com/user/show/133010-jesse", "userReview": "You know, the premise of this book actually sounded good. A wizard P.I., sure why not. I like wizards and I like P.I.s, so what could be the problem. The problem was I over estimated this author's abilities.The main character is like some kind of emotionally retarded uber-geek's idealized life. He lives in a basement and subbasement. He ALWAYS wears a black duster and cowboy boots (even when he's wearing sweats and a t-shirt). He has an abnormally large alley cat that likes to drink coke and doesn't get violently ill from the caffeine. He can't get anywhere with women, for no real reason at all. The first woman that broke his heart, he actually killed (but for good reasons, I mean she was evil). I could go on and on. The protagonist of this story is an immature weiner. He is a walking dorky cliche, that feels like he is some kind of Peter Parker wizard. Constantly bemoaning the weight of the world on his shoulders, even when its actually not on his shoulders. Add to this the characters inability to have basic levels of trust for his friends/allies, lack of common sense, and a very low level of intelligence for someone that relies on brains and willpower for their strengths. And you end up with a guy that is very annoying to read in most any situation.Now throw that character into a Noir Detective style situation. This is not a confident man, nor is he a physically tough man, and he lacks much in the way of street or even book smarts. I find it highly unlikely that this guy should have survived past the first 100 pages, let alone through all the other blunders he makes through the entire book. Take a gander back to the beginnings of the Noir Detective genre, and you'd be ashamed that this man besmirches the genre's good traditions. Sam Spade has no magic what so ever, but he could quite easily have out smarted and out fought this guy with his bare fists.Don't even get me started on how annoying magic is in this book. Not since the magic of Terry Brooks' Shanara books have I felt magic meant little to nothing. This guy is constantly like, oh shit I don't have my wand or staff or special ring, so if I do my magic now I'll kill everyone. What the fricking good is magic that can't be used unless you've got your stick of power. If magic is going to be used the way it is in this book, as basically a crutch to hold the rest of the weak aspects of the book up (as it is in most non-awesome fantasy); then at least have it around to do its job and make cool things happen.So to close, this book is immature and not fun to read. There was a time in my life when I would have found this book awesome, when I was going through that phase of life where you're 13, emotionally retarded, and just discovered AD&D 2nd edition. Which there is nothing wrong with, that's a phase that me and most other nerds went through. Then we grew out of it, because we matured in to adults. But this book isn't be lauded to me as \"great writing\" by 13 year old nerds and geeks, its being held up as a \"Great Book\" by adults, and that's who its marketed to. Look if you like this book and you're in Junior high then fine (though I could recommend better things for you to read that are aimed at your age group), but not adults. If your an adult and you think this is even just \"good\" writing (and again I'll state that most tell me its \"great\" writing) then I think you need to try reading some other stuff by much better authors. Go find and read Neil Gaiman, Joe Hill, Joe R. Lansdale, Walter Mosley, Warren Ellis, or Charles Stross. These are all writers that have written either modern fantasy/Horror or Noir and/or Crime fiction, so they are working on some similar concepts. Then if you don't find those to be far better book written by actual good writers, well then I'm just going to have to say that you and I may be from different planets or something.This book is not fun to read. Its poorly constructed. The plot is about as complex as 6th grade math, and less original than that. The characters are 2 dimensional at best. Magic is used a focal point of the story rather than something to enhanced the flavor of original and real feeling plots and characters. At one point the author describes someone by saying he looks like Sean Connery's character from the Highlander, instead of I don't know just describing the dude as having a pony tale (since that was where those two character's physical similarities ended). Most of his other descriptions of characters are like police descriptions of people being given to me by the narrator which completely takes you out of the narrative. The author at one point even wrote \"I was a wizard\" when his point of view character is lamenting about going into a house or building to solve a problem and I was thinking \"wait did you stop being a wizard at some point?\". If you're going to write in the first person perspective then learn to write in the present. Of course one would expect a decent editor could have fixed this, but I'm going to assume that decent editors get assigned to decent writers. Look, its not a good book. I didn't make it a bad book, it just is. I'm told that the book get much better after or on book three (so some day I hope to get a copy of his second book for free and see, though I have my doubts since I've read enough bad authors in my day to know they don't usually start becoming good authors, just more experienced bad authors) but that's a really spurious argument since I need ALL book I read to be good if not great right away. I'm not going to recommend an author to someone because his first work was really awful but if you just read two more books by him he gets good. Well then perhaps he should have just started with book three and spared us the bad books. Its bad and I don't recommend it to anyone who's not reading it as a goof to lampoon it in there own head. End of statement."}, {"userName": "Kat Kennedy", "userReviewDate": "Feb 12, 2011", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "[image error]"}, {"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Mar 03, 2014", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "2/7/18 - ON SALE for $2.99: \nhttp://amzn.to/2yOviAoReviewed by: Rabid Reads3.5 starsLover of Urban Fantasy that I am, it may come as a surprise that before now . . . I have never actually . . . read Jim Butcher . . .I KNOW. I'm such a poser.In my defense, I haven't had much luck with male authors in the genre, and come on . . . we're up to what? FIFTEEN installments, with the SIXTEENTH already in the works, so yeah--DAUNTING. Cut me some slack.  And besides, better late than never, right?Also, I'm holding all of you partially to blame, b/c someone should have told me that around book 3 or 4 the series becomes seriously FAE oriented. So what's up with that, huh? I've said more than once that Fae are my FAEvorite, and based on the PUNS in Storm Front alone, I'm the one who should be feeling betrayed, not you.*snickers*Okay. I have adequately blame-shifted, so moving on.I knew going into this that I'd be entering a longterm relationship with Harry Dresden. I was willing, but skeptical. Even with the image of \nPaul Blackthorne\n firmly planted in my subconscious, I knew from experience that commitment requires more than a pretty face.Little did I know how right I was.You see . . . longterm relationships are WORK. And often, the things you love the most about another person are the same things that enable that person to drive you NUTS.I love how realistically flawed Harry is.I hate how realistically flawed Harry is.He gets himself into a tight spot, so he rationalizes:\n\"It wasn't as though I was actually going to be doing any black magic, I told myself. I was just going to be figuring out how it was done. There was a difference. I was helping the police in an investigation, nothing more.\"\nBut then he immediately calls his own bluff:\n\"Yeah, right. And maybe one of these days I'd go to an art museum and become well rounded.\"\nHe's also incredibly self-aware. He knows his weaknesses as well as his strengths, and he presents both sides very matter-of-factly. It was refreshing. There was no false modesty or self-deprecation. No melancholy search for affirmation. Harry Dresden just lays it all out in plain site, do with it what you will.But that same openness allows you to see (over and over again) how hapless he is when it comes to the fairer sex . . .You know . . . for a self-proclaimed, socially awkward wizard with very little relationship experience, Harry Dresden finds himself surrounded by beautiful, flirtatious women with uncommon frequency . . . *rolls eyes*But then he gleefully reveals his boyish, mischievous side by the sheer delight he takes at pulling one over on someone who has underestimated him. *rolls eyes again, but this time while grinning*One second I wanted to smack him on the back of the head, and the next, I wanted to ruffle his hair and kiss him on the cheek.So that's Harry.There's also Bob the (peeping) Skull, Toot the pizza-loving faery, Mister the cat, Mac the surly pubkeep, Murphy the hard case female cop, and glimpses into possible future interactions with a literal faery godmother and the mysteriously intimidating White Council.The plot was . . . eh . . . *shrugs* I'm giving it a pass this time, b/c I'm pretty sure a lot of groundwork was laid for future installments, and while this was a fairly entertaining read, it was also fairly predictable, and Bad Guy was just a stock power hungry Bad Guy.On the world-building front, we were given a lot of hints, but nothing substantial, but that was okay, b/c so far, we've only been in the real world, so as much as I'd like to know more about the Nevernever (RIGHT NOW), there's plenty of time for that when we get there.Overall, I definitely see this series being worth it (and not just b/c if I read this one, I will have read every, single one of the Big Deal UF series . . . which may or may not be a personal goal . . . *shrugs noncommittally*). Harry Dresden is a realistically likable character who I have a suspicion will turn out to be quite formidable, and Butcher lays a promising foundation with this first installment. Will it live up to my expectations? Only one way to find out . . .My other reviews for this series:\nFool Moon (The Dresden Files, #2)\n\nGrave Peril (The Dresden Files, #3)\n\nSummer Knight (The Dresden Files, #4) by Jim Butcher"}, {"userName": "Lyn", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "Urban fantasy is a sub-genre that I have been very much enjoying for a few of years and Jim Butcher’s Harry Dresden series usually tops the lists of readers’ favorites and it has proven wildly popular.For good reason.Butcher first published Storm Front in 2000 and it was in this first edition that Butcher introduced readers to Harry Blackstone Copperfield Dresden, Wizard. Butcher describes his protagonist as a kind of occult private investigator, being chiefly active in the Chicago area. Dresden’s advertisement is as follows:WIZARDLost items found. Paranormal Investigations.Consulting. Advice. Reasonable Rates.No Love Potions, Endless Purses, or Other Entertainment.I’m coming to the party late, as I write this review Storm Front has over 160,000 ratings on Goodreads, so a lot of fantasy fans are already well acquainted with Harry and what a cool series Butcher has created. To date, there are over 15 novels and scores of related media, and there are two upcoming novels already planned.Butcher’s talent was in creating a charismatic, cool urban fantasy character and then placing him (and the stories) in the category of mystery / thriller. This provides an almost endless assortment of possible magical / occult / fantasy settings for Harry to explore and Scooby Doo mysteries to solve. Butcher’s prose is evenly paced and his world building and magic rules forming skills are in good form and I will likely read more from him."}, {"userName": "Bill  Kerwin", "userReviewDate": "Aug 03, 2010", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "The first volume in the Dresden Files series introduces us to our hero, Harry Dresden, a wizard who is also a private investigator and police consultant. It is written in a breezy, colloquial style that makes you want to keep reading, but except for a few interesting magical twists on the private dick genre (e.g., Harry's tipster is a faery, lured with a bowl of milk and honey and confined within a magic circle until Harry gets the information he needs), the book is thin on plot, lacking in wit and deficient in interesting characters. Maybe they get better. I might read the second volume sometime. Then again, I might not."}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Jul 10, 2014", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "3.5 stars. Final review, first posted on Fantasy Literature:Storm Front has been on my TBR list for ages, but I’ve dawdled in picking it up, given the many disappointed to mildly encouraging reviews for this first book in the DRESDEN FILES series, a mix of urban fantasy and the noir detective genre. A lot of fans of this series say it really only picks up with the 4th book, Summer Knight. (I tried reading Summer Knight out of order last year, and doing that didn’t really pan out for me. Apparently you have to live and grow with this series, along with Jim Butcher’s writing skills.) But a couple of weeks ago I ran across Storm Front on my local library’s shelves, so I decided it was finally time to give it a shot.Harry Dresden is a down-on-his-luck wizard trying to make a living as a magical private investigator, in a version of our world where magic has recently become more open and powerful. He’s an occasional consultant to the police on crimes with a paranormal aspect, and this latest job they call him in on ― a mobster and a call girl violently murdered by magical means in the middle of the act ― is a doozy. Unfortunately, several key players think Harry did it! It’s highly inconvenient when you’re one of the only people who have the magical ability to carry out a particular murder. Harry’s only got a limited time to prove them wrong … especially since several people would find it extremely convenient if Harry were dead.I thought Storm Front was reasonably good for an urban fantasy and a series starter, though I suspect my lowered expectations had to do with my ending the book feeling pleasantly surprised. The subplots, including a Chicago mobster intent on keeping Harry out of the case, a woman with a missing husband who may be teaching himself black magic, Harry’s troubles with the wizardly White Council, and more, were well integrated into the overall mystery. I appreciated that Jim Butcher creates an unusually interesting backstory around Harry Dresden, fleshing out his world, without feeling the need to fully reveal all yet.Don’t expect a whole lot ― just a fun, if sometimes quite dark, paranormal mystery with which to while away a couple of hours ― and I think you won’t be disappointed. I plan to continue with the series, although it’s not my highest reading priority.Content notes: violence and some sexual content."}, {"userName": "✘✘ Sarah ✘✘ (former Nefarious Breeder of Murderous Crustaceans)", "userReviewDate": "Nov 13, 2014", "userURL": "http://www.goodreads.com/user/show/7298986-sarah-former-nefarious-breeder-of-murderous-crustaceans", "userReview": "[Oh will you please stop snickering back there? (hide spoiler)]"}, {"userName": "Markus", "userReviewDate": "Jul 30, 2014", "userURL": "http://www.goodreads.com/user/show/26681101-markus", "userReview": "\"My name is Harry Blackstone Copperfield Dresden. Conjure by it at your own risk. I'm a wizard. I work out of an office in midtown Chicago. As far as I know, I'm the only openly practicing professional wizard in the country. You can find me in the yellow pages, under 'Wizards.' Believe it or not, I'm the only one there.\"Harry Dresden is Chicago’s only wizard. One day he is contacted by a nervous woman who wants him to investigate the mysterious disappearance of her husband, whom she thinks has dabbled in the forbidden arts of magic. Shortly afterwards, Harry’s contacts in the police summon him to a scene where a couple has been brutally and horribly murdered without any trace of the killer. The investigation takes him all across Chicago and its underworld, to encounters with crime lords and supernatural beings, all the while being observed by the watchful eyes of the White Council, who think that Harry himself is behind it all...Harry Dresden is quite an interesting protagonist. Despite being a wizard, he’s incredibly... well, normal, and he lives and acts just like any other guy would. He has his good sides and bad sides and plenty of flaws, and despite that he’s not particularly complex, it’s refreshing to read a book from the viewpoint of a guy like this. Sadly, Harry is the only real character in the book. All the others are completely shallow and one-dimensional. Most of them are stereotypical and simplistic, and the female characters in particular are badly portrayed. And while some of these characters are really interesting despite all that, it’s just not enough.Storm Front is a book which attempts to do quite a lot and falls a bit short in almost every area. It’s straightforward and predictable, lacks an organised plot, and contains whole chapters that are unfortunately quite boring. As a murder mystery, it lacks both style and suspense. As an fantasy novel, it’s not much better.But of course, there are positive things to say as well. It seems I spent two paragraphs mostly slaughtering the book, and that won’t do at all. Because it was an enjoyable book to read. Despite its obvious issues, it was certainly entertaining. Sometimes it can even be a real page-turner. But like any expansion novel or any form of pulp fiction, it’s primarily just mindless entertainment. It’s not particularly complex, it’s not particularly well-written and it’s not particularly exciting. But if the opinion of the general public is correct and this is one of the weakest books in the series, then I am definitely looking forward to reading the others.Of course, I should mention that urban fantasy is a long, long way from being my favourite genre. It's been a genre I've been skeptical to for quite some time, yet I still find it enjoyable occasionally. So if you're normally a fan of urban fantasy, I would recommend this book. If not, I'd say skip it."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Sep 23, 2009", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "Okay, some who have looked at my other reviews will immediately note I gave this book 5 stars which I noted earlier I save for very special books. I plan to give the Dresden books (so far anyway) 5 stars. Why? Well while they are not Dumas or Dickens (but then again...I'm not sure I'd regularly be giving Dickens 5 stars, how much Dickens can we all really take anyway???) these are wonderful absorbing reads. Special Books.I won't be giving a long synopsis of each book... I will say they are an original idea in what is rapidly becoming a glutted genre. That would be \"Urban Fantasy\". So far I've found a lot of Urban Fantasy I like, and a lot more I'd pitch on the discard pile of literary history. Dresden is a wizard...he maintains a downtown office and advertises in the yellow pages (no parties please). He has problems with the Sidhe (pronounced \"Shee\" ) (some would say \"fairy\" but that is insulting to the very powerful Sidhe royalty...like calling Queen Elizabeth a \"babe\" or worse). It seems his mother had some sort of dealings with the Sidhe and left him a sort of Sidhe godmother (Bad fairy godmother????)... And that's only the tip of the iceberg.No spoilers...but in Storm Front Dresden will meet a sorcerer who has some extremely violent and nasty tendencies, magic drugs, biased superiors, and....... well, anymore and I might give a spoiler...read the book, you'll love it!If your only exposure to Dresden has been the short lived TV series then you have a great surprise in store and a whole list of great books to look forward to (in a way I envy you). While the TV series wasn't awful and I too mourned it's demise (there is so little on the idiot box that actually makes it to a decent standard of \"watchability\" [made up word, I know:]) it doesn't come close to the books... This/these are wonderful books. Definitely 5 Stars."}, {"userName": "Amber", "userReviewDate": "Dec 17, 2012", "userURL": "http://www.goodreads.com/user/show/3795626-amber", "userReview": "[THIS MAN JUST SAVED YOUR PATHETIC, USELESS EXCUSE FOR A LIFE! And Dresden's first emotion isn't awe or new-found respect or gratitude for the person who brought him back from the brink of death. Not even for a moment; he just jumps straight back into his snark. Even almost dying can't penetrate his ego. (hide spoiler)]"}, {"userName": "Hannah Greendale", "userReviewDate": "May 24, 2015", "userURL": "http://www.goodreads.com/user/show/43377498-hannah-greendale", "userReview": "Click here to watch a video review of this book on my channel, From Beginning to Bookend."}, {"userName": "Robin (Bridge Four)", "userReviewDate": "Mar 25, 2015", "userURL": "http://www.goodreads.com/user/show/14105531-robin-bridge-four", "userReview": "Sale Alert Books 1-6 together for $7.99 on 29Nov17 on AmazonThe buddy with a few of my friends at Buddies Books and BaublesHarry Dresden is not your sauvé hero type, he has trouble with money, women, demons and keeping his clothing on. But he does have actual business cards.Actually the clothing problem seemed almost worse then than some of his other dilemmas. You try fighting evil naked or in sweats and cowboy boots and see how well you fair. He does seem to have a few wizard tricks up his sleeve and a pretty cool lab equipped with an awesome helper trapped in a skull named Bob.I really didn’t expect much from this book as it is the first in the series and really just an introduction to the world. That is all you get a simple intro. Much of the story is plot driven and a few things are expanded on along the way but most things are really just touched on briefly so that I was never overwhelmed but information. I’m fine with that as long and I can understand what is going on in the story and I definitely could.Harry is helping the police discover who with supernatural powers killed a mob henchman and an escort in a compromising position. Harry has about three days to figure it out since the magical community is pretty sure he is the primary suspect. I guess wizards get a bad wrap.The beginning starts a little slow but after about the 40% mark all the fun really starts and it is a pretty solid ride to the end. Enough hints are dropped about Harry and his past to make him pretty interesting and so I’m looking forward to seeing how that starts to play out throughout the series.All and all a pretty good start and better than I expected because rumor has it that the series doesn’t really pick up until book 3 or 4. What I do know for sure is Audio Note James Marsters (Spike from Buffy the Vampire Slayer) does the audio and he was fantastic. It made my listening experience even better."}, {"userName": "TS Chan", "userReviewDate": "Apr 29, 2015", "userURL": "http://www.goodreads.com/user/show/30279227-ts-chan", "userReview": "This is an updated review.\nMy name is Harry Blackstone Copperfield Dresden. Conjure by it at your own risk. When things get strange, when what goes bump in the night flicks on the lights, when no one else can help you, give me a call. I'm in the book.\nHarry Dresden is a wizard living in modern Chicago who works as a private investigator for all things supernatural or paranormal. He wears a black duster coat, carries a staff (well, a blasting rod in his own words) and has a basement where he concocts potions and has a spirit-embodied skull as an assistant of sorts. Surely it can't get any more clichéd than this for an urban fantasy with a wizard.The last urban fantasy I've read was probably Terry Brooks' Word and Void series at least 20 years ago. While I love fantasy in general I can't exactly call myself a big fan of this sub-genre, even though I did occasionally dabble into it. The Dresden Files is probably one of the most spoken of urban fantasy series and it will be remiss of me not give it a try. I can appreciate the allure of this sub-genre which by definition means fantasy which takes place in contemporary times on Earth, albeit not exactly one in which we currently live in. When compared to high/epic fantasy or even classic fantasy, this is much lighter reading as one does not need to spend too much time familiarising or immersing oneself into a new world. Clichés aside, this first instalment of the Dresden Files was really quite entertaining. I like Harry's character as he felt real and not perfect. He is flawed yet heroic, powerful yet fallible. And there’s an interesting and, in all likelihood, a dark back-story in there which was just begging to be discovered. However, there isn’t much character development elsewhere and I can't say I felt much for the rest of the characters although Johnny Marcone might have been fascinating if we can learn more about him. The plot in Storm Front is straightforward and fairly predictable; sufficed to say that I pretty much guessed who the antagonist may be really early in the book. Nonetheless, the pacing is good and it kept me engaged throughout the story. Written in a first person perspective, Harry's self-deprecating and dry sense of humour was also easy to connect with. All in all, this is an enjoyable read and a good breather in between all the heavy epic/high fantasy reads on regular rotation in my reading schedule. As many fans will proclaim that the series improve with each and every book, I will undoubtedly continue with the series given that it does not take much time commitment for the entertainment value it presents.This review can also be found at Booknest"}, {"userName": "Brooke", "userReviewDate": "Jun 12, 2007", "userURL": "http://www.goodreads.com/user/show/126262-brooke", "userReview": "Earlier this year, I greatly enjoyed the first season of the Sci Fi Channel's The Dresden Files. It certainly wasn't Buffy or X-Files caliber, as far as paranormal television goes, but it was great escapism fun with some interesting characters. As I'm likely to do after discovering that something I watched and enjoyed was based on a book, I went out and got the first book in the series.I read the 300-pages of Storm Front in less than 24 hours, and it was such a relief to read something light after a lot of the books I've been reading lately. The series is about a wizard named Harry - but not that Harry. Harry Dresden lists himself under \"Wizard\" in the phone book, and basically serves as a private eye. His friends include Karrin Murphy, a police lieutenant who turns to him for help in supernatural crimes, and Bob, a memory spirit who lives in a skull.I was instantly reminded of the Anita Blake Vampire Hunter series; it's told in the first person by a hardboiled character who lives in a world where the paranormal is normal. Luckily, unlike Anita, Harry doesn't engage in insane sex with long-haired men who wear thigh-high boots every 10 pages, so I guess the comparison is to the early Anita books. As a stand-alone novel, it would be rather disappointing, but it's just perfect as a beginning to a series. It sets up the characters and hints at things in their pasts that are sure to be explained more later on. I've got the rest of the series lined up on reserve at the library, and hopefully they will live up to the expectations Storm Front created."}, {"userName": "Will M.", "userReviewDate": "Jun 16, 2014", "userURL": "http://www.goodreads.com/user/show/20408288-will-m", "userReview": "Harry Blackstone Copperfield Dresden is a wizard. He is also a detective, and he's best at what he does. When a suspicious magic related murder occurred, the Chicago P.D. comes to him for answers. Aside from that though, he also has other personal cases at hand. My very first Urban Fantasy novel. I've been wanting to read this for months now, and I'm glad that I finally did. Crime/Detective-Fantasy is something new to me, but not anymore. Two of my favorite genres combined, and executed wonderfully. I heard ravishing remarks regarding this series, and I now understand all the hype. This is not a perfect novel, it had a few flaws here and there, but it was enjoyable overall.Harry Dresden reminded me of a lot of characters that I love. Tony Stark, Sherlock Holmes, and Dr. House to name a few. He was not created as a perfect character, and that is the right way to do it. Despite being a wizard, he still had flaws. Aside from him reminding me of some favorites, the novel itself felt like it was a crossover of NCIS and a superhero TV show. His relationship with Murphy was really similar to those of the crime genre. The woman hates him yet ends up giving him what he wants, and ends up arresting/hating him in the end. Typical crime stuff that I really enjoy. \n\n I was a wizard. Wizards control their power. They don't let it control them. And wizards don't use magic to kill people. They use it to discover, to protect, to mend, to help. Not to destroy. \n\nI was not expecting that at all. I've watched quite a few shows and movies regarding wizards, and they're all badass crazy. Dresden was just crazy, but he was good. He obeyed the  first law  thing that magic shouldn't be used to kill. I heard about that rule already somewhere, but I remember main characters breaking that rule and getting away with it. I was expecting the same form Dresden, but didn't get what I wanted. I was expecting a lot of magic spurting out of his staff and all, but the magic present in the novel was mellow. There were a lot of action in the novel, but I wanted it to be more badass than it was. This novel seemed to follow realistic ideas, despite it being a fantasy novel. It's not a huge problem for me, but I am hoping for more action in the next ones. And more magic.Little did I know that wizards are  weaker  than witches. Weaker in a sense that they follow the rules more, so they use less magic. If you use less magic and battle with someone who uses a shit load of magic, then odds are you'll lose. Or die. I still like Dresden a lot though.The plot itself was not bad. Despite this being a  huge  series, this novel still ended with closure. I hate forced cliffhangers, and this one didn't have that. There is a note somewhere on goodreads stating that each novel from the series is sort of a standalone, but each one heavily relies from the latter. I like those kinds of series, because sometimes you need a break from it. Especially those never ending ones. I'm quite excited of what the author has in stored for the next books. 4.3/5 stars. My very first Urban-fantasy novel, and it will not be my last. I'm starting to enjoy this genre. Recommendations will be greatly appreciated!"}, {"userName": "Justin", "userReviewDate": "Dec 22, 2014", "userURL": "http://www.goodreads.com/user/show/2795921-justin", "userReview": "March 2017 Review:This is now my third time through Storm Front, and while my rating is holding tight at three stars, I enjoyed it more this time thanks to Spike from Buffy and Angel reading it to me. That guy nails Harry Dresden's character and breathes new life into him. His carefree \"whatever yeah here I'm reading the book, alright?\" tone was awesome. It made the story so much better. It also made me realize how one of the only adjectives Butcher knows is the word \"naked\". Everything and everyone in the book is naked at some point. Harry walks outside with naked feet. A room is illuminated with naked color. Lots of naked people. He just really seems to like the word. I felt like it showed up at least a dozen times and stood out because at times another adjective would have worked better. But I digress...This is a good book to just get lost in and not think too much. Don't overthink the magic or the spells or weird characters. Just let the story play out and you'll be fine. It feels like a weird episode of the X-Files in book form, or like I said two years ago, it's like a Goosebumps book for adults. I'm gonna try a different approach and not be overly critical as I read through these first few books. I'm having a good time, and I hear things only get better as the series progresses. I kind of enjoy the pulpy writing style with a mix of crime and fantasy genres. I'm not crazy about Harry being all macho but then stepping aside to remind us all how old fashioned he is. He just likes opening doors for women and bringing flowers to dates, alright? Leave him alone. Not sure why he keeps bringing that up and then goes back into tough guy mode. I've read the next two books before and then quit. I promised myself I was done, but I've never been good at keeping promises to myself. I should really stop doing that. Anyway, I hope I enjoy those s little more this time around and plow through the other books. Looking forward to seeing what happens. Third time is a charm... right?Previous review from January 2015:Second time through, and I feel about the same way. It's like Goosebumps for adults. it just needs a more clever title. Here are my contributions:\"Thunderbolts and Lightning, Very Very Frightening\"\"Say Cheese and Die with ThreeEye\"\"The Wizarding World of Harry Dresden\""}, {"userName": "Heather K (dentist in my spare time)", "userReviewDate": "Dec 20, 2012", "userURL": "http://www.goodreads.com/user/show/13070326-heather-k-dentist-in-my-spare-time", "userReview": "Dear Harry Blackstone Copperfield Dresden, First of all, the audiobook edition of this story is freaking incredible. James Marsters could recite the dictionary and I'd be hanging on his every word, but combine that voice with the awesome writing of Jim Butcher and I'm in heaven, I'm simply in HEAVEN! The \"first book info dump\" wasn't too bad here. I easily kept up with the world-building and I loved what the author created. I loved everything about it, actually. My only issue with this story was that it was a bit \"the world is conspiring against me\" for my tastes. So much $hit doesn't go Harry's way that it became a bit painful for me to read at times. However, all signs point to me loving this entire series so I have the next book locked and loaded, ready to read! I know I'm about 15 years behind the times with this one but I'm on the train now and I'm PUMPED!"}, {"userName": "Heidi The Hippie Reader", "userReviewDate": "Jan 18, 2017", "userURL": "http://www.goodreads.com/user/show/7986781-heidi-the-hippie-reader", "userReview": "Urban fantasy about a modern day wizard who acts as a consultant for the Chicago police. Candy in book form but I enjoyed it. The narrator for the audio book managed to sound world weary and dour the entire time, which was actually rather impressive.My favorite part is when Bob, the spirit of intellect that Harry keeps around as a sort of wizard computer/database, advised using tequila as the base for a love potion. Harry argues for the more traditional champagne but Bob shuts him down, saying something to the effect that tequila is more Harry's style and he would know because he'd been alive and courting women since before Harry was a twinkle in his great grandmother's eye. It's a great scene. If you read or listen to this one, watch for it.The mystery itself isn't all that mysterious, but the fantasy portions of the story are excellent. We get to meet a fairy, who acts very much like I imagine one would, demons, a wizard guardian, vampires, and more. Through it all, there's Harry, trying to keep a roof over his head and bread on his table, while everything mechanical falls to pieces around him because of his magic. Like I said, a lot of fun.Recommended for fans of Kevin Hearne's Iron Druid chronicles (starts with Hounded) or Stacia Kane's Downside Ghosts (starts with Unholy Ghosts)."}, {"userName": "Conor", "userReviewDate": "Jun 06, 2014", "userURL": "http://www.goodreads.com/user/show/30552336-conor", "userReview": "[ I also really liked the inner turmoil caused by his desire to pone the villain at the end using ‘black magic’. That was a really intense scene that added some intriguing depth and complexity to his character. His final decision, which could have easily been annoying and/or moralising, was handled brilliantly by the poignant intervention of his mother’s spirit, which had been nicely set up earlier by Harry’s mention of his mother’s amulet.  (hide spoiler)]"}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Oct 31, 2008", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "Harry Dresden is a wizard for hire. His advert even says so. Enter a very interesting character in the urban fantasy genre. Having grown up in the Chicago area, it's very cool to see this fine city through the eyes of an interesting guy like Harry. In some respects, he's a very normal guy. However he truly is a wizard. He inherited his magical abilities from his deceased mother, and makes a living at it. Helping people. He also works for the Police Department solving crimes of an unusual nature.This is like most starter books in a series, it doesn't exactly get off the ground running. But that's okay. We get to enjoy the experience of getting to know Harry. Things I liked about him that endeared him to me: He doesn't date much. He says himself he doesn't have much luck with women. He's a catlover. He has a big, huge kitty named Mister that eats better than he does. He's got a great sense of humor. This book is in the first person, so you are treated to Harry's very wry but perceptive view of the world. We are not on the same page about Christianity, but I don't hold that against him. How could I when he's such an ethical, caring person. Harry's a bit of a soft touch, going out of his way to help people, even to his detriment. Some readers might get annoyed at how often Harry gets hurt. I like that about the series. He's not invulnerable. His magic can help him, but he can die just as easy as another human, and he almost does many times. That raises the stakes, because Harry can't seem to stay out of trouble. I love watching Harry get dressed for battle: fedora hat, cloak, oak staff, pentacle pendant from his mom, and her ring. The latter are his magical accoutrements used to focus the natural magic that flows through him and is in the environment. Let's not forget his .45 gun for extra insurance. It's like watching Batman put on his suit and all his gadgets (yes my not-so inner geek is coming out).The world that Harry inhabits is much like the one we live in, but magic and creatures we consider mythical actually exist. There is a White Council (They are the governing body over wizards to prevent them practicing black magic or using magic to harm people) who is holding the Doom of Damocles over Harry's head for killing his uncle (done in self-defense, although few would argue that he didn't deserve killing). So we see Harry trying to stay one step ahead of the very intimidating magical enforcer, Morgan. We also see Harry deal with a fairy who loves pizza to get information, while trying to avoid his godmother who really is a Fairy, the Queen in fact, and to whom he owes a favor. And Harry has to deal with the very shadowy Red Vampire Court, not to mention a very nasty demon assassin that interrupts the first date that Harry's had in a very long time. Try having a love life around all of this. Then there's the fire spirit Bob, who's beholden to Harry, helps him work his spellcraft, and lives in a skull.These books are pure fun, but there are moments of tension and thrills, as well as moments that will stir poignancy in you. If you like the genre of occult detective novels, this book is the start of a series that you must add to your collection. I must say I love the later books more because the introductory stuff is out of the way, but this was a solid entry and a grand introduction to the wonderful, endearing Harry Dresden, Wizard for Hire."}, {"userName": "Emma", "userReviewDate": "Jun 15, 2014", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "I am a fan of this series. I haven't caught up yet- I think the next I will be reading is Cold Days. Many of my goodread friends are also Harry Dresden fans and there seems to be a general acknowledgement that the first three books are good but the series gets better over time. I've always agreed with that. Then audible had an offer on Stormfront and as I had heard good stuff about the narrator for this series, I jumped in for a reread.Well- this was fantastic the second time round. I remember when I first read this, I wasn't completely sold on the faeries or Bob. But now I realise with hindsight how brilliant the first book is! It's all here right in the first book.Harry Dresden: his skills, his wish to do what is right and good., his chivalry, his practical applications of magic, the faulty technical equipment around him... All this, plus the realisation of how far he progresses as the story line continues through the series. I had to upgrade this to a 5 star read. Urban fantasy doesn't really get much better than this."}, {"userName": "Laurel", "userReviewDate": "Mar 02, 2011", "userURL": "http://www.goodreads.com/user/show/1079533-laurel", "userReview": "Hot damn, that was a fun read! I know full well the reason I've been avoiding the series was that I would get hooked, and have even more books on my to-read shelf, but I just can't help it! Dresden is a sarcastic, bitter, tongue in cheek rogue that would make Han Solo proud. The plot moves quickly, the action is imaginative, and the humor puts the perfect cherry on top. What a great character!"}, {"userName": "Lindsey Rey", "userReviewDate": "Apr 09, 2014", "userURL": "http://www.goodreads.com/user/show/5436213-lindsey-rey", "userReview": "I enjoyed this way more than I was expecting! I cannot wait to get my hands on the next one."}, {"userName": "StoryTellerShannon", "userReviewDate": "Nov 17, 2011", "userURL": "http://www.goodreads.com/user/show/6773727-storytellershannon", "userReview": "This is a revised review as of 4/14/2013. Several of the images were off Google Image detailing the graphic novel for visual impact but this is an actual review of the novel. Tale focuses on a man, well, not just a man, but, a wizard in current day Chicago who uses his magical powers to solve mysteries. Most of them focus on the supernatural and there's a whole underbelly of mythical creatures which mortals are mostly unaware of . .. vampires, werewolves, enemy wizards, faeries, ghosts, etc. \nSTRENGTHS (1) Innovative ideas which hasn't been pursued effectively in quite some time; (2) Typical wise cracking P.I. type with some funny lines; (3) Follows a lot of plot/story elements of the typical investigation;\n(4) Oh so kewl explanation of how magic works which are typically overly detailed in most fantasy tales (Thirdeye, Soulgaze and Doom of Damocles among others); (5) Great climatic ending (writing this revised review makes me want to reread it); (6) A funny talking skull named Bob; (7) Teaches you how to defeat a demon that's banging on your door; and (8) Shows you how to be one of the good guys. NOT SO GOOD (1) A few cliches at time but nothing to make you want to throw the book against the wall, like other fantasy tales, and yeah, I'm looking at you Terry Goodkind; (2) subplot love story felt sophomoric (though it had some funny moments when it wasn't trying to be serious); and(3) Wizard's rants about how he wishes to treat women sometimes feels, well, not so believable. Dude, wake up.That said, it's still easily in the top three for the year (if you appreciate light fantasy) and refreshingly different, so, HOORAY!!!! CHARACTERS/DIALOGUE: B; STORY/PLOTTING/EDITING: B; WRITING STYLE: B to B plus; WORLD BUILDING: B plus; WHEN READ: 2007 (second reading) (revised review 4/14/2013); OVERALL GRADE: B to B plus."}, {"userName": "Fey", "userReviewDate": "Mar 16, 2010", "userURL": "http://www.goodreads.com/user/show/2056399-fey", "userReview": "Decided to try this series, as I keep hearing 'Dresden files' everywhere for some reason, and apparently it's even a tv series? I couldn't let an urban fantasy get so popular without knowing what its about! There are many mixed reviews about this, some love it and some hate it. But I am suprised at the negative reviews, as many complaints could be raised against the genre as a whole, but if you pick up an urban fantasy book - don't you know what you're getting into? I've seen complaints about the following; the way Harry does magic, what Harry wears, the sexism, the private investigator cliche.. But I don't see the problem, as just about ever Urban Fantasy novel does it the same. And even despite this, the book is still original, well planned out, and generally very good.If you want to find sexism in UF, try the Anita Blake series, thats 10 times worse, except no one would complain about that because it's the Woman surrounded by Good-looking males. Somehow, it's apparently a problem to some readers, that Harry happens to be a straight male, who notices good looking women, and some of those women happen to be attracted to him. Hey it's fantasy! If I wrote fantasy, It'd have sexy girls in it too! (And food.. possibly cake.) But anyway you can't complain that a Fantasy is too.. fantasy.. End Rant.The best part?The potions! I have never seen a single wizard in Urban Fantasy use potions before now, I have to say it was the best bit for me. It was like Harry Potter for Adults, but not as lame as that sounds..In the end, a very solid 4 stars, enjoyed it, nice easy read, with original interesting ideas, and a decent mystery. Definately going to continue reading the series.See my other reviews of The Dresden Files:#2 Fool Moon →"}, {"userName": "☘Misericordia☘  ⚡ϟ⚡ϟ⚡⛈   ❂❤❣", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/6603759-misericordia", "userReview": "Actually, I started with the TV series, for once. And it was a rather atmospheric show with the exception of that charred body too naturalistically (for my liking!) shown, which I managed to watch during my lunch. Totally ruined that freaking lunch! Offputting, that's what it was. And it put me off for, like, 5 years in reading the series. But now I still am here, ready to enjoy this installment to my everlasting paranormal reading addiction. And from the very start this novel feels superb. I think I'll stay with this series for the long run."}, {"userName": "Ashley", "userReviewDate": "Apr 05, 2009", "userURL": "http://www.goodreads.com/user/show/1343864-ashley", "userReview": "Originally rated three stars.March 2016: If you follow me at all closely here on Goodreads, you'll probably know how much I love The Dresden Files, but that I initially didn't like it very much, to the point where I gave up after reading book three way back in 2009. I just didn't think the series was for me. That I thought that at the time is alternately hilarious and horrifying. I almost didn't pick this series back up, and so I almost missed out on what has turned out to be more and more of a favorite series as it goes on. So I've been meaning to revisit these first three books for quite a while now, because I knew I would like them more if I gave them another go, knowing what I know now about the characters and the world, and how much Butcher's writing has improved on all fronts.Also, I really really wanted to listen to the audio versions of the first three books, since I read the paperbacks the first time through, and James Marsters is life. (I of course will also be re-reading all the rest of the books as well, because if I read three of them twice, and the others only once, my brain will break.)Anyway, just as I expected, I liked this so much better this time around. But what's really weird about this re-read is that I was able to pinpoint exactly why past Ashley felt weird about this book and didn't really like it very much, even though I wasn't really able to do that at the time. It's still very weak in comparison to every book in the series excepting #2, Fool Moon, which I remember being my least favorite, but my mindset is so different this time around, it was like I was reading an entirely different book. But also, the same book. Because it's the same book. You know what never mind, you know what I mean.The biggest difference for me this time was that I no longer felt emotionally distant from Harry or the other characters, so I automatically cared more about what was happening, and I was much more willing to forgive Harry and his idiotic flaws, which really rankled me the first time through. He really is very sexist in these early installments, although benignly so (as benign as sexism can get, anyway--he calls it being \"old-fashioned\"). He's also way too mistrusting of his allies, and if I didn't already have a substantial emotional attachment to the big idiot, I would be bored and frustrated with his seeming inability to connect to other people. It's not good if your story has a main character who won't actually form relationships and have significant interactions with your other characters.I also noticed this time that Butcher hadn't quite found his tone yet, and that a large part of my dislike for the book was due to its lack of flavor. It was still incubating as a story/world. Butcher was going more for an urban fantasy version of hardboiled noir in the vein of Raymond Chandler, but he doesn't have Chandler's way with words (nobody does), so what ends up happening is you get the lowlifes and the atmosphere of Chandler, without the wit or the unique flavor. This book feels bland in comparison both to the genre heavyweights it's imitating, and in comparison to later books in the series after Butcher had found his and Harry's voice. (I actually feel similarly about Marsters' performance, which while still pretty great, was inconsistent not only with later books where his Harry is more of a smartass and way less dour, but with itself. He kept pronouncing words and names differently throughout, i.e. trading off between pronouncing Marcone \"Mar-cohn\" and \"Mar-coney\". That may also be an audiobook producing error.)At the same time, in hindsight, it's clear that Butcher at least had a rough idea of where his story was going from the beginning. So many of the pieces that will come to be important are set up here (or, alternatively, he's just really good at taking a base and building on it, but I tend to believe the former theory, given how Butcher has shown his love for setting things up way in advance).Anyway, re-reading this has only solidified my feelings about this series, so I guess that means I will never shut up about it, and every time someone gives up before reading at least book four, I will have to hound them mercilessly until they repent.[3.5 stars, because it's still pretty weak, but rounding up because of happy feelings]Original Review, April 5, 2009: I keep wavering on whether or not to give this three stars or four, because I'm optimistic that the series will eventually get better. Fast paced and quick from beginning to the end, it was an enjoyable read, but it was a little too *neat* for my tastes. I'd like to see more character development, not just Harry getting beaten up and being all Solitary Man and junk. Harry as a character seems like the male version of the hero of your dreams, but I need more than a lonely guy kicking some ass with a magic staff to hold my attention. The first person narrator also gets on my nerves a lot, but that's just a personal choice. First person sometimes doesn't feel like storytelling to me, just somebody bragging, and it always feels a little too *written*, if you know what I mean. You have to be very talented to pull it off.And honestly, the only reason I'm being so optimistic is because this series comes to me highly recommended from several sources, so I'd like to at least get through the next two books before I make my final decision."}], "description": "HARRY DRESDEN — WIZARDLost Items Found. Paranormal Investigations. Consulting. Advice. Reasonable Rates. No Love Potions, Endless Purses, or Other Entertainment.Harry Dresden is the best at what he does. Well, technically, he's the only at what he does. So when the Chicago P.D. has a case that transcends mortal creativity or capability, they come to him for answers. For the \"everyday\" world is actually full of strange and magical things—and most don't play well with humans. That's where Harry comes in. Takes a wizard to catch a—well, whatever. There's just one problem. Business, to put it mildly, stinks.So when the police bring him in to consult on a grisly double murder committed with black magic, Harry's seeing dollar signs. But where there's black magic, there's a black mage behind it. And now that mage knows Harry's name. And that's when things start to get interesting.Magic - it can get a guy killed.", "title": "Storm Front\n      \n          (The Dresden Files #1)", "url": "http://www.goodreads.com/book/show/47212.Storm_Front", "average": 4.02, "cover": "https://images.gr-assets.com/books/1419456275l/47212.jpg", "reviews": 12940, "authors": [{"url": "https://www.goodreads.com/author/show/10746.Jim_Butcher", "name": "Jim Butcher"}], "type": ["Fantasy", "Fantasy", "Mystery", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/47212.Storm_Front", "http://www.goodreads.com/book/show/6219313-storm-front", "http://www.goodreads.com/book/show/511150.Storm_Front", "http://www.goodreads.com/book/show/764354.Storm_Front", "http://www.goodreads.com/book/show/10446243-storm-front", "http://www.goodreads.com/book/show/91477.Fool_Moon", "http://www.goodreads.com/book/show/91476.Grave_Peril", "http://www.goodreads.com/book/show/91478.Summer_Knight", "http://www.goodreads.com/book/show/91479.Death_Masks", "http://www.goodreads.com/book/show/17683.Dead_Beat", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}