{"ratings": 10, "userreviews": [{"userName": "Cullan", "userReviewDate": "Jul 22, 2008", "userURL": "http://www.goodreads.com/user/show/1352743-cullan", "userReview": "I HIGHLY recommend this book for ANYONE, regardless of your interests. You should just buy it. Buy right now. I mean it. Now. I'm forced to add that the above is all in jest. Apparently humor of the subtle sort isn't something modern readers grasp well, as one individual demonstrated in a comment to this review that I deleted. If words are not accompanied by attendant emoticons (to wit, \"smilies\"), then how will anyone ever know we aren't being serious? Look forward to my new novel in which I will liberally pepper the following: j/k! OMG! and :D--the author"}, {"userName": "Codey Long", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/17216635-codey-long", "userReview": "I’m from Oklahoma and I enjoyed this book. Often books like these can be dull to read, something about the flow of how the writer gives the information but this book had great flow and was an easy read. The author didn’t exaggerate and tried to give any sides of the story, which I loved. If a story didn’t seem legitimate he would say so. This however did not take away from the mystery and the what if’s. I didn’t know there were so many alien abduction stories and Bigfoot sightings in Oklahoma. Ghost and hauntings I knew their were quite a few of those because I have already read about several. I have no complaints about this book. It was great."}, {"userName": "Marilyn Hudson", "userReviewDate": "Aug 21, 2011", "userURL": "http://www.goodreads.com/user/show/5920049-marilyn-hudson", "userReview": "A book that covers almost everything of the bizarre in Oklahoma history. From Bigfoot sightings to tales of zombies - yes, zombies, this book is \"the book.\" Witty at times, always honest, and sometimes truly unanswerable, the stories from over a hundred years of history will delight and mystify."}, {"userName": "Jennifer", "userReviewDate": "Jul 08, 2013", "userURL": "http://www.goodreads.com/user/show/4911381-jennifer", "userReview": "As a life long Oklahoma resident I found this book fascinating. Would definitely recommend. Can't wait to visit some of the sites in this book."}], "description": "In this updated third edition, Oklahoma's legends and mysteries are examined. Included are: UFO's, Spook Lights, Bigfoot, Hauntings, Hidden Treasure, Historic Mysteries, Voodoo, Witchcraft, and others.", "title": "Strange State: Mysteries and Legends of Oklahoma", "url": "http://www.goodreads.com/book/show/3800962-strange-state", "average": 4.1, "cover": "https://images.gr-assets.com/books/1311603927l/3800962.jpg", "reviews": 6, "authors": [{"url": "https://www.goodreads.com/author/show/1620612.Cullan_Hudson", "name": "Cullan Hudson"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/3800962-strange-state", "http://www.goodreads.com/book/show/12137133-the-mound"]}