{"ratings": 1454, "userreviews": [{"userName": "Daren", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/11995655-daren", "userReview": "Edit: 29/12/16 - Best Travel Non-Fiction read of 2016. Eric Hansen's memoir of his travel across the wilds of Borneo. In 1983, hardwood timber prices had just doubled twice in 3 years, and there was significant felling underway on the coastal perimeters, but it had not yet pushed its way inland and to the highlands. On the best map he could find, Hansen found large blank areas, with the words 'insufficient reliable relief data available'. These were located on his planned route. His goal, was to travel from Sarawak on the West Coast, across the highlands to the East Coast and the Celebes Sea. He had a lot of preparations to make, and some false starts. Leaning the trade goods appropriate for his journey, learning the language, understanding the culture, were all equally important. His journey is told relative simply, and honestly. He introduces the tribesmen and women he travels or temporarily settles with well, his writing conjures the images, and picks up on the character traits well. For me, it makes compelling reading.Its not spoiler, as it is signalled on the dust jacket, but 137km into his journey, a mere days journey from the Celebes Sea, Hansen falters. He stops walking, and has a realisation. He can be back in San Francisco in under a week - but he realises he isn't ready to go home. He stops his eastward journey, and heads back to the west. He decides to undertake the return journey to Sarawak.I have a particular compulsion to read books on Borneo. For me it was always a exotic destination I wanted to travel to - jungles, headhunters, longhouses, semi-nomadic tribes living an almost stone-aged existence. Many of those iconic images we conjure up are no longer, destroyed by the three-pronged pressure of hardwood logging, palm oil plantations and missionaries. For me there is no one of three worse, or better than the others. I did manage some travel in Borneo over the years - nothing as ambitious as Eric Hansen of course, but I did manage to visit a handful of the places he spent time and writes about in this book. For me it was fascinating to read about how they were, and to know what had changed at the time I was there. I dread to think how they have further changed now. Bario, in the highlands was the most poignant for me to read about. In his epilogue, Hansen is lamenting the progression of logging roads in Borneo generally - bulldozers giving access for the logging trucks. He mentions in passing that \"the network of roads expands closer to the highlands of Bario\". By the time I was there, the road was not only formed, but there was a contract underway to widen and seal the road to Bario.Great book, 5 out of 5 for me."}, {"userName": "AC", "userReviewDate": "Jul 11, 2013", "userURL": "http://www.goodreads.com/user/show/1655437-ac", "userReview": "In 1982, Eric Hansen - who must have then been no more than 27 or 28 (?) - walked (that's right.... walked) across and through the tropical rainforests of Borneo... sometimes with native guides, but sometimes by himself. He spent months in the rainforest. Then, when he was 50 miles from from the east cost of Kalimantan, he suddenly (and impulsively) turned around and trekked back to Sarawak. This book describes this fascinating journey. The author is an intelligent and unpretentious man. Especiallly interesting are his descriptions of the forest itself, which is vivid, and his marvelous tales about the Penan and about the Kenyah in Apo Kayan. A fine and worthwhile book."}, {"userName": "Steve Woods", "userReviewDate": "Jan 11, 2012", "userURL": "http://www.goodreads.com/user/show/3688618-steve-woods", "userReview": "This was a great travel story. I really enjoyed it. I have to admire the man's courage and perseverance, I did some treks in Malaysia in the 70's and though this book reminded me vividly of my own experiences once past the purvey of the \"white man\" my excursions were no where near as ambitious as his. I was particularly touched by his description of the close connection of these so called primitive peoples with their environment and their felt sense of what was happening around them, both in their surrounding environment and in their contacts with others.I have spent years working to free myself from the bondage of intellect in favour of a deeper felt sense of my life experience and it is a hard road. The constant reassertion of the sense of separate self is frequently troublesome. It says something about our culture that we are so alienated from who we are as human beings that the constant ebb and flow, the current of life for these people seems somehow strange to us. The value of what we hold dear in our livescan be seen clearly in this book by comparison between the life of those in the forest and those touched by our so called civilization. The absolutely destructive and evil agency of Christian missionaries glares out from these pages just confirming me in the anathema with which I hold these people and all their doings. The closely intertwined lives of the jungle dwellers with their environment and its spirits and the framework of existence that imposes makes much more sense in every way than the patronizing gobble dee gook that Christians spout as a faith that must be followed on pain of eternal damnation. I despair that the places where a person can have experiences like that outlined in so captivating a manner in this book are now almost non existent. The plastic west, bags, bottles and Jesus are everywhere!"}, {"userName": "Missy J", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/7406091-missy-j", "userReview": "We moved farther into this steaming, fetid world of great horrors and indescribable beauties whose elements were impossible to separate one from the other; and, as I learned, there was little sense in making simplistic distinctions of \"good\" and \"bad\".\n Eric Hansen is one crazy adventurer. Since he was young, he dreamed about exploring the rain forest. In the 80s, a twenty-something Hansen finally made his way to Borneo and tried to trek further inland. His first two months in Sarawak were not very fruitful. He injured himself and was unable to reach the hinterland by boat. However it wasn't time wasted. During this time, he became more fluent in Malay/Indonesian, learned about how the people in the jungle trade and their way of thinking. His third expedition to Bario and then crossing over to Kalimantan was a success. By that time, he had adapted to the life in the rain forest. When he almost reached the eastern coast of Kalimantan, he quickly turned around and headed back into the rain forest. He spent a couple more months exploring the rain forest before making his way back into Sarawak and civilization.Hansen came into close contact with two tribes in particular - the Penan and Kenyah tribes. The lives led by these tribes in the rain forest is utterly fascinating. They work closely together and share everything. That's because they live in such a remote area that they have to be dependent on themselves. They do not measure time or map out their surroundings. Their knowledge of the rain forest is all in their head. And they love hunting (vegetarians may squirm at some of the descriptions)! When Hansen visited and stayed at several villages, he was surprised to find out that prostitution, homosexuality and rape did not exist there. When he described to them life in the city, it was difficult for them comprehend \"private property\" and \"hoarding things for oneself only\". For the people in the rain forest, stinginess was the worst possible crime.However, the modern outside influence was already starting to shadow over these remote areas. Hansen met some tribe's men who were willing to leave their families for a couple of years to work along the coast. They would bring back a variety of modern goods to the rain forest. Often these men would be tempted by what was offered in the city and would easily fall into debt. Missionary groups were active in the rain forest and would provide airlift services to transport goods. If a certain village didn't obey the missionaries, they would punish the village by abruptly putting a stop on the airlift services. People in the village would suffer greatly because they already relied on the comforts of quick delivery, sugar, batteries, etc. Without a plane, a jungle trek to the coast would've taken six weeks at least.Another dark side Hansen learned about the people in the rain forest was their susceptibility to superstitions. In one village, word got around that an evil spirit in the form of a white man was roaming the jungle in search of human blood for sacrifice. Hansen encountered a lot of difficulties because of this in the second half of his adventure. This account is from the 80s, and I get wary thinking of how things must have changed even more since that time. There's so much wisdom we can actually learn from people who live so close to nature. Yet, the system labels them as \"primitive\" and dictates that they have to \"get along\" with modern times. So much wisdom will and is already lost. Hansen wrote a great book which in the future can be treated as a historical document. \"Keep your money. You can print money, but you can't print land. We want our land.\""}, {"userName": "Kay", "userReviewDate": "Aug 02, 2007", "userURL": "http://www.goodreads.com/user/show/241691-kay", "userReview": "Hansen's tale of his trek through Borneo is absorbing, especially as he comes to grips with his own inadequacies along the journey. Relying (one might almost say at the mercy of) native guides, he's initially almost unable to cope. His gradual adjustment to the jungle is what makes this account so compelling. Like Redmond O'Hanlon's No Mercy, this is an account of a spiritual as well as physical trek. (Although this is nowhere nearly as dark a travelogue as O'Hanlon's, I'm happy to say.) Hansen learns from his guides as he progresses, and his admiration for their jungle skills is obvious. His gradual mastery of a complex bartering system and a wealth of survival lore make for fascinating reading. Sadly, I'm sure that Borneo has changed for the worse since Hansen's day, and that the modern world has encroached considerably on both native cultures and the environment. When Hansen returns to \"civilization\" he finds himself loathe to resume his life as he'd led it before, and the reader understands why he turns around and goes back into the jungle. Hansen is a skilled narrator, and this is wonderful armchair traveling."}, {"userName": "Cherie", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/6460330-cherie", "userReview": "I cannot believe that this book is classified as \"travel/adventure\". Until I read it, I might have thought it a correct shelf designation. Now, my shelf designation might be: \"life and death in Borneo\", \"is this guy crazy?\", \"less than forty years ago?\" \"ewe, bee pupa soup\", \"2400 miles in one pair of running shoes!\", or \"blow pipes and bamboo spears, oh my!\"It is unfair to Bill Bryson, but I kept thinking about him walking along the trails in the eastern United States, stopping to make camp, and cooking dinner each time Eric Hansen discussed his adventure for the day. I know! It sounds crazy, but I had nothing else to compare it against. Eric's amazing story of what he went through during a day's walk on the trails in the wilds of Borneo in the mid 1980s is an eye opening account of one man's endurance, hardship, and suffering, along with beauty, discovery, friendship, and accountability. I will never forget it."}, {"userName": "Logan", "userReviewDate": "Oct 21, 2007", "userURL": "http://www.goodreads.com/user/show/548085-logan", "userReview": "best travelogue ever. I've been through this one like 4 times. all of the fun with none of the ethnocentric bs i've found in other travelogues that cover the late 70's early 80's. Once you're in, it's impossible to stop. even as i write this, I'm trying hard not to walk over to my book shelf and to start reading this. that good."}, {"userName": "Tim Martin", "userReviewDate": "Aug 30, 2012", "userURL": "http://www.goodreads.com/user/show/2014250-tim-martin", "userReview": "_Stranger in the Forest_ by Eric Hansen is easily one of the most absorbing and well-written travelogues I have ever read. This extraordinary book chronicles Hansen's remarkable journey across the island of Borneo in 1982. The author traveled some 2,400 miles on the island, largely on foot and through tropical rain forest on an island that straddles the equator; actually he made two trips, traveling four months and 1,500 miles before turning around and going back across the island, a mere 50 miles from the ocean (to the astonishment of his traveling companions and shouts of \"Crazy man!\").Writing of his childhood imaginations about exotic and faraway jungles and his own later adult fantasies after spending hours in the library reading about the island, Hansen found he had a lot to learn about the realities of Borneo. Emboldened by an earlier visit to the island in 1976, his first attempts to penetrate the interior and reach the highlands and meet real forest nomads - the \"jungle of my library fantasies\" - met with continual frustration. For over eight weeks he went up one river after another, sometimes getting as much as 70 miles before being stymied by dishonest guides, insufficient amounts of gasoline for the outboard motors, or unfriendly villages, which would often price gouge Hansen, charging exorbitant rates for simple services and fail to provide him the necessary guides to proceed further on foot. The trade goods he bought generally did not interest the locals, Hansen found it hard to interact in the non-monetary economy of the interior, and even his Western manners were a source of problems (it took the author a while to realize direct questions were quite rude in many situations and would not likely produce the answers or results he sought).Retreating to the coast, Hansen reevaluated his trip and had the very good fortune of becoming friends with Syed Muhammad Aidid, a man in Marudi, Malaysia. This businessman, familiar with both the ways of both the West and the jungle interior, took Hansen under his wing, teaching him the complex economic system of the highlands and jungle. The author learned that an empty, 8-ounce tin of sweetened condensed milk was the standard unit of measure and was called a mok, with all other volumes being calculated in multiples of 1 mok (for example, 3 moks of dry rice equal one day's rice for a man). He learned of valuable, light-weight items to bring to trade for food and services, items like sugee (Lombek chewing tobacco), manik-manik (colored seed beads used for decoration), and in particular shotgun shells (1 shell equal to one day's labor for a man or if caught - as they were illegal - 1 year in jail). He also learned of valuable items he could procure in villages for trade later, such as gaharu, a local wood with concentrations of aromatic sap, favored in Asian medicine and in the Middle East for making incense and perfume.With Muhammad Aidid's help, Hansen was soon on his way back into the interior, paying his guides with wages made up of shotgun shells, manik-manik, and sugee. He managed to secure guides for his particularly successful first half of his trip with two Penan men, John Bong and Tingang Na; being his first guides, they were vital in his become proficient on the island. Communicating in bahasa pasar, a basic form of modern Malay that is the trade language of Sarawak (the Malaysian side of the island) and Kalimantan (the Indonesia side) - and later on in Indonesian with other guides - Hansen spent four weeks with these two guides before reading the Kelabit highlands (where he spent two weeks). These two guides (and after leaving the highlands, two other Penan guides, Bo `Hok and Weng) showed Hansen the ways of the rain forest; how to walk without tripping all the time, what plants and animals were good to eat and which were not, how to make camp for the night, how to hunt, and a great deal of tribal and jungle lore. The journey through the rain forest was portrayed in vivid prose and was extremely well-written. Hansen learned of many locally useful plants, such as akar korek (the \"matches vine;\" once lit, the dried vine smokes for days and is excellent for transporting fire), akar sukilang (a vine that can be beaten to a pulp and spread in water to stupefy fish, making them easy to catch), and most of all the sago palm (from which the Penan get their staple food, sago flour, which he was able to witness being made). He encountered many animals also; flying snakes and lizards, fire ants (with which he had an unfortunate encounter), flying foxes (which taste terrible), wild pigs (which taste excellent and are an important food source), gibbons, black hornbills (which come when called), and barking deer among others.The star though of the book were the people of Borneo, both the settled tribal groups (of where there eleven, which included groups such as the Kelabit, Iban, and Kenyah), and the shy forest nomads, the Penan, true experts of the forest but uncomfortable in direct sunlight and in large communities. He had many excellent encounters with these people, as a number of them were friendly and generous, allowing him to participate in Gawai Antu, an Iban tribute to departed spirits, a time of much merry-making and drinking of large quantities of arak (a type of rough distilled spirit); learn about the peselai (the \"long journey,\" undertaken by young men to seek status and gain coveted goods from the coast, a journey taking months or even years); watch blowpipes being made, and much more. He also had bad experiences; in addition to some gouging in some villages, during his second journey, when traveled alone for a time, he was feared by some villages of being a bali saleng, an evil and nearly invulnerable spirit that walked alone at night, seeking to get blood for magical ceremonies."}, {"userName": "Bill", "userReviewDate": "May 09, 2017", "userURL": "http://www.goodreads.com/user/show/3925186-bill", "userReview": "Very quick read full of interesting adventures. I would've loved color photo plates and some sections to be expanded but Hansen's attention to detail, sense of humor, and emphasis on human connections made this a memorable story.My favorite section was about how every year a blood-stealing demon appears in a slightly different form. Due to Hansen's bad luck, that particular year the local gossip is that the demon takes the form of a white man traveling alone in the forest. He effectively captures the surreal and frightening experience of villagers thinking he is a dangerous monster. On a lighter note, I also liked the story of the man carrying a heavy sewing machine on his back home to his wife he hasn't seen for years. I'm going to be visiting Sabah in Borneo soon and I expect it to be equally beautiful but also heartbreaking as the beginnings of deforestation trends that this book witnesses have only accelerated since then, with palm oil plantation replacing logging as the main cause of destruction."}, {"userName": "Mel", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/16301842-mel", "userReview": "I loved it. It is on for re-read."}, {"userName": "Sonatajessica", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/3577389-sonatajessica", "userReview": "I looove traveling, so naturally I love reading about it, too.The main difference between me and Eric Hansen is not so much that he has managed to go to more exotic locations and write books about it (though that is one of the differences), the main point where we go on diverging paths is what we consider a n adventure. See, when I was in New Zealand I decided while backpacking around that I wouldn't book a place for the night of New Year's Eve and spend it on the beach to watch the sunrise instead. I thought this was a darn adventurous plan. When it started to rain in the afternoon I realized my plan was awful, I was all alone and close to despair. See, I panic over rain. Hansen spends months in the jungle with leeches crawling over him, wounds at his feet getting infected, tribes consider him an evil spirit and ponder on spearing him, he gets lost in high grass, so far so forth, and in the end he calls it a wonderful experience. I got through my rainy, lonely new year feeling kind of proud over my 'adventure', yep, I am not quite up the league Hansen is in. Therefor I prefer reading about the more extreme journeys while in real life I journey on smaller scaled adventures. Thanks for writing such books, Mr. Hansen!"}, {"userName": "Cat Chiappa", "userReviewDate": "Jul 31, 2011", "userURL": "http://www.goodreads.com/user/show/2209428-cat-chiappa", "userReview": "This was a fabulous book and one of the best travel memoirs I've ever read, and I have certainly read my share. I appreciated the author's willingness to actually learn about all of the other cultures and he never mocked them for their beliefs. He had such an amazing adventure and it makes me sad to think of what the logging industry has done to Borneo.The only two criticisms I had about the book was how dense it was...even though it isn't really a criticism. I found this book a little hard to pick up once I had put it down but whenever I read it I really enjoyed myself. The other thing I wish it had was an updated forward. It was written so long ago and I was really curious to hear what the author is up to now and what his take is on Borneo at this time. Did he ever go back? Does he have recommendations for people who want to experience Borneo?Overall, this was an entertaining and deeply interesting anthropological delight."}, {"userName": "Marty", "userReviewDate": "Mar 23, 2009", "userURL": "http://www.goodreads.com/user/show/2154139-marty", "userReview": "I like books that can insert into the readers mind a way of thinking that is utterly foreign. The forest dwellers, viewed by westerners, are so utterly clueless, yet, this traveler sets ripples in motion in the forest that announce his presence to all the inhabitants. Their measure of 'distance' from one location to another, is actually measured in days. Beyond a few hundred yards, our notion of distance is unfathomable to them. There are no straight lines or predictable rates of travel in their forest. I wish I had the guts to have made such a trip-- I wouldn't be tempted now-- dont like the leaches and mosquitoes and snakes."}, {"userName": "Lela", "userReviewDate": "Sep 27, 2013", "userURL": "http://www.goodreads.com/user/show/9920233-lela", "userReview": "Fantastic, interesting, enlightening, inspiring foot journey across Borneo! Makes me want to drop years & work on fitness then strap on walking shoes! Loved it!"}, {"userName": "Kevin Tangonan", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/7317697-kevin-tangonan", "userReview": "An anthropological adventurer's guide to the deep jungles of Borneo. It was an amazing read for a traveler like myself interested in the old world and places not commonly explored. Though written more than 20 years ago, I shudder to think as to what happened to the vast greenery he once trekked with the palm oil and timber deforestation. It was quite an enlightening piece, how I wish I could have traveled with Eric Hansen through thousands of miles of drifting through rivers, hiking through mountains, and hunting with the native Penan tribes, among many other things. It's such a mysterious and mystic place, I've learned so much from this book about my ancestors as a Filipino who's roots are intertwined with the old Malay of the region. From the hilarious yet confusing measurements and commerce system of colorful beads and biscuit tins of rice to the ancient stories of the Naga and the Black Shaman. I wish there would be a follow-up sequel adventure in which Eric would return to Borneo many years later like with 7 Years in Tibet and Return to Tibet by Heinrich Herrer, though I don't blame him for the journey seems excruciating and pain must have been a constant companion through the trip. I definitely would recommend and finding this book made me want to read his many other works. 5/5"}, {"userName": "James King", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/49647734-james-king", "userReview": "Hansen has a very easy style to read, and develops a great sense of relatability to the reader. Even on a journey so mammoth that most could never consider it, you still get the sense you're not only travelling alongside him, but that you're experiencing the same emotion. The journey is also stunning, delving into the culture of a ancient way of life and a whole new viewpoint. A beautiful human perspective."}, {"userName": "David P", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/49086874-david-p", "userReview": "A wonderful book, has given me a severe case of wanderlust.Having travelled through Indonesia as a student, I found it particularly interesting and rewarding. I even remembered some of the language!"}, {"userName": "Kirk", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/68363219-kirk", "userReview": "This is my favorite book I've ever read on the topic of outdoor adventure and certainly in my top 3 ever. Just a truly incredible story. I tend to really enjoy outdoor, adventure books both fiction and non-fiction especially in tropical forest settings."}, {"userName": "Jay", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/50771646-jay", "userReview": "Excellent. Authentic. Fresh. Respectful. Balanced. Touching. Could be 5-star."}, {"userName": "Seamus Geraghty", "userReviewDate": "Feb 02, 2017", "userURL": "http://www.goodreads.com/user/show/24230067-seamus-geraghty", "userReview": "I have never had a great desire to walk across the jungles of Borneo before, but that was before I read this book..."}, {"userName": "Ann", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/874107-ann", "userReview": "Quit at page 80 out of 280. Not sure why I didn't like it. Partly because I dislike hearing people say they did something \"solo\" when actually, they pay/barter the locals to navigate and carry things."}, {"userName": "Spencer", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/206689-spencer", "userReview": "Getting 2015 off to a flying start, I finished this book in one day. After a recent documentary featuring the exotic fruits of Borneo and the Penan who so skillfully seek them, I put the world's third largest island on my list to learn about. The author's well-researched and determined trip is remarkable in its achievement alone, but his frequent journaling and excellent writing skills combine to make this a fascinating and evocative read. The book chronicles his early research, first intoxicating trip, three failed attempts to penetrate the interior, and his eventual success in trekking across the island both with guides and alone. Along the way, we're treated to a relevant but thoughtful history, a survey of native plants and hunting methods, and a caring and considered view of the native people he encounters. Not every experience is a positive one, but with the perspective of hindsight, Hansen is able to see each situation -- and his own development -- much more honestly than he might have at the time. The fact that he spent four years combing his journals to write the book shows. It's tight, interesting, and factual while still remaining entertaining. While humor is used, and the author does delve into his own thoughts quite frequently, I still felt a little detached from him as a reader. I'm not sure whether I just couldn't understand his reason for doing the trip, or that he didn't give much in the way of a personal history, but something was missing. Regardless, lack of a relationship with an author should never really hinder one's appreciation for their story. I've now read several stories of brave (or foolhardy) solo travelers in exotic locales, and this is probably the best so far. I'm not sure I have it in me to do the kind of undertaking described here, but hopefully every story is a step closer to taking the trip that will allow me to write my own.Sadly, this book is over 30 years old, and the idyllic scenes depicted in the story are likely to be no more. Even in 1982, the trappings of western life had begun to encroach, and with the advance of logging operations and the increasing availability of air travel, it seems highly unlikely that many of the highland people of Kalimantan or Sarawak really have to take 2-month longboat journeys to the coast anymore. The thought of an iphone in every hand is a bit disconcerting, but it's not up to us to decide who gets \"modernized\" or when.More heartbreaking is the continued plight of the Penan, diminutive nomadic forest experts, whose native habitat continues to disappear at the hands of timber companies (whose land rights apparently come from sweetheart deals with entrenched politicians) and the government (embarrassed by such \"primal\" hunter gatherers), who continually to attempts to \"resettle\" people who have lived in a respectful and symbiotic way with the forest since before Malaysia was a country. Anyway, I'll be off my soapbox now, but if you do read this book, take some time to research the folks involved. It's such a shame that even today, we continue to see the kind of aggressive forced resettlement that has cast such a dark shadow over our own country's relationship with its native inhabitants."}, {"userName": "Natalie Saar", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/14158584-natalie-saar", "userReview": "I read this book while I was actually in Borneo and I found it so inspiring! I loved the author's sense of detail, and his spirit of adventure. I think the trick is that Eric Hansen is not only a courageous and determined traveller, he's also an insightful and self-aware writer, and I think it is that combination which gives the book both body and charm. He really conjures the highs and lows of his journey, without attempting to impress the reader with his triumphs or make the reader pity all his trials either. It's like he's edited (very well!) his personal journal and opened the first page and offered it to you to read. He creates a vivid and informative picture of Borneo in the late 70s, providing detail about the political and environmental situation in Borneo, the culture and demeanor of the Penan people, the complexities of their bartering and trade systems, and (my personal favourite) vivid imagery of all the exotic terrain and bizarre foods he encounters. What I liked best was how he strikes a good balance between this informative description and the more emotional portrayal of his own personal struggle and resilience through many a wrong turn, mistaken decision or just plain bad luck. Honestly its such an emotional roller coaster ride that often I had to remind myself that it wasn't fiction!! Personally I usually find non-fiction dry when it's just a list of facts. Here I think Hansen does a great job of integrating natural suspense and tension into the story without overdramatising it. In fact, I think the way he creates a flow of a plot makes the journey into a cohesive and appealing travel novel that transports you into the heart of the Bornean jungle. However, for people looking for a more purely instructive book on Sarawak, then they will probably get annoyed by Hansen's inevitably bias (though I must say well-informed) deviations into his own opinions of cultural practises and superstitious attitudes in the rural communities, or the penetration of refined sugar and Christian missionary movements into remote villages, etc. For these readers, his narration of personal acquaintances along the way will also probably seem unnecessary. But of course to me, these personalised touches werr fascinating and thoroughly contributed to the interest of the narrative and the intimacy of the novel. It allowed me to get to know Borneo much more than I could have from a list of names and dates ever could, even if it is coming from one man's perspective. Overall I'm so glad I found this book before I came on my trip through Borneo and Cambodia. There was plenty of literature to be found about Cambodia, but very little about Borneo. It seems I stumbled upon a real gem here though! Reading it made me want to follow Hansen into the jungle myself, spear in my arm and 12 kilos of rice in my rucksack, and take a life-threatening but life-transforming journey just like him! If you like travel literature, especially if you're planning to venture into South East Asia sometime soon, Borneo even, and if you are excited by the wilderness and survival in the unknown, then this book I would definitely reccomend! You will simply gobble it up!"}, {"userName": "Yeo_heng_hau YEO", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/6796513-yeo-heng-hau-yeo", "userReview": "Eric Hansen's account of his trek across the jungles of Borneo will certainly interest anyone who enjoys jungle trekking, yearns for nature or simply wants to know what the deep jungle of Borneo is like or life there feels like. Eric has the innate skill at keeping the reader fully engaged as he narrated his trials and tribulations in making the trek on foot across Borneo, the third largest island in the world and the largest in Asia. Eric's deep sensitivity to the environment and his feelings and emotions towards the people he dealt with, whether in the small riverine towns, the native guides who helped him navigate his way through the jungle terrain, the headmen or villagers in the deep interior, shines through in the book. One can't fail to feel and sympathise for him as he recounted how his first attempt at trekking into the jungle failed miserably - how he learned the hard lesson that carrying cash will not simply interest guides to help him to carry his stuff or to rent a room in the village for the night or two. As a reader we are fully caught up and intrigued with the thoroughness that Eric went through in packing his travelling bag with items that constitute the real needs of the natives as he embarked on his second attempt which was successfully completed. From an experienced trader in Marudi he learned that only stuff that helps the natives get by their living in the jungle, stuff like shells for shotguns for hunting, tobacco and hill rice are items highly sought after which can be bartered for services that the natives will be willing to accept to serve as guides or accept to rent out rooms.To me, the highlights of the book are what he experienced and learned during the beginning of his second trek into the jungle through the deep forests of Borneo with the two Penan guides and his final journey to the river basin of the Rejang river with an 11-member Kenyah group comprising families and individuals seeking work in the timber camps located there. His explicit account of the two-week journey was truly fascinating. His account of how working together with this group they navigated a 40-foot boat through the river from the natives' village, trudged the boat up the tough mountain terrain into another river which finally took them to their destination. We get to feel first hand with Eric how he killed a deer from close range to save his fellow group member and the survival skills he had to master to live from day to day in the jungle. We also get to experience many emotions that Eric went through: his love for a Western lady botanist who offered to share her room with him, the fear that Eric has to live through at a certain stage of his trek when some villagers suspected hims as the bearer of the evil spirit that brings harm to the villages and the marvel that he felt at how a native was willing to trudged on his shoulder and trekked through the jungle a brand new Singer sewing machine from the savings he put aside over the years of working in the timber camp.I have thoroughly enjoyed reading Eric's book and certainly will recommend it to everyone."}, {"userName": "Răzvan Molea", "userReviewDate": "Jan 11, 2016", "userURL": "http://www.goodreads.com/user/show/37204777-r-zvan-molea", "userReview": "Eric Hansen evocă o lume care a dispărut de mult. Era pe cale de dispariție chiar în timpul lui. Deși paginile abundă de frumusețe, de locurile sălbatice pe care le-a vizitat, de localnicii, sau mai bine zis ”băștinașii” cu care a trăit și pe care a ajuns să-i aprecieze, mai ales felul lor de viață și cum înțelegeau ei să-și trăiască viața. ”A warm, moist wind blew from the south down a valley lost in green folds of undulating rain forest. Carried on the wind were thick earthly smells of sweet-scented plants and decomposing leaf litter that carpeted the jungle floor. The sunlight soon dimmed and and with it the last familiar traces of my own culture. Bo' Hok and Weng were having quite the opposite experience. They disliked the popular areas and direct sunlight, and it came as a relief to return to a familiar place where in the cool darkness no movement, sound, or scent held a mystery. This jungle, so foreign to me, was their home; yet within minutes of entering it I felt myself willingly moving into a timeless world of natural rhythms.”Nu este păcat că aceste feluri de viață se pierd, iar cu ele tipuri de oameni și caratere și feluri de a fi?Singurii oameni care par să trăiască în armonie cu natura, cu pământul se pare că sunt băștinașii - nu contează țara.Citeam un studiu zilele astea care spunea că pe planetă există momentan 3,04 trilioane de copaci, adică 422 de copaci la un singur om (și-au dat seama cu ajutorul sateliților). Sună bine, nu? Da, dar suntem responsabili de tăierea a 15,3 mld de copaci anual, iar de la începutul civilizației umane, am tăiat mai mult de 45% din pădurile pământului. Pentakill! Unstoppable!Probabil că ăia din Interstellar aveau dreptate: ”we are not meant to save the world, we are meant to leave it” Good luck with that!I read somewhere how important it is in life not necessarily to be strong, but to feel strong, to measure yourself at least once, to find yourself at least once in the most ancient of human conditions - that's the way it is here - Christopher McCandles - from his journal in the wilderness of Alaska"}, {"userName": "Joel Thimell", "userReviewDate": "Dec 09, 2016", "userURL": "http://www.goodreads.com/user/show/58501878-joel-thimell", "userReview": "I really enjoyed Stranger in the Forest: On Foot Across Borneo. It brings to life an exotic locale and its peoples which 99% of us will never have the opportunity to visit in person. The book is well written, informative and entertaining.Hansen's ten-month trek across Borneo reminded me of my own wanderings through Africa as I hitchhiked from Kenya to South Africa during the same era. (The environment, the lodging, the food, the transportation, the activities and the means of exchange were completely different in Africa.) But the similarities were more important: both Hansen and I left comfortable, modern American lives to immerse ourselves in untamed nature and simpler cultures. Both of us (re)-discovered that the \"best laid plans\" often go astray and whether it's the wilds of Borneo or the savannahs of Africa, there WILL come a time when you are completely at the mercy of nature and/or strangers.My adventure changed the rest of my life. Finding grace and protection in several scary situations deepened my faith in God. Personally struggling to find safe shelter, wholesome food and drinkable water each and every day made the problems of the Third World real in a way that a TV documentary or book never could. Most importantly, it gave me a heart of thankfulness for the blessings I receive daily.My only disappointment with Hansen's book is that he doesn't tell us how HIS adventure changed him. Perhaps he wished for the focus to be on the people he encounters and their plight. Maybe he hadn't fully digested the personal impact of his journey yet. I only know that I felt like there was a chapter or two missing at the end of the book."}, {"userName": "Joel", "userReviewDate": "May 28, 2012", "userURL": "http://www.goodreads.com/user/show/9058325-joel", "userReview": "An account of Hansen's long trek through the jungles of Borneo in the 1980s, helped by native guides. This is really one of the best travel narratives I've ever read. Hansen has an eye for detail; the ability to relate his interactions with native people without showing a sense of cultural superiority; and a keen, self-deprecating appreciation for his own inability to survive in the jungle without expert help. It helps, too, that his journey was full of interesting events and encounters. There's an encounter with a man laboriously carrying a heavy, old-fashioned treadle sewing machine through the jungle, many miles from the nearest village. There's an account of watching a master craftsman create a blowpipe. There's the time the author was almost killed in a remote village because the people mistook him for a blood-stealing boogeyman. There's an explanation of how the people of one indigenous culture choose different names for themselves at different points of their lives; and how they christened him with a name that meant \"King of the Mustaches\". There's a description of how he traveled with a group of nearly a dozen natives, hauling a heavy longboat over a mountain pass. And he gives an honest accounting of the difficulties which made the adventure less fungo experience than thread about- most especially the leeches which infest the mud of the Borneo rainforest, and which he has to keep picking off his body as he travels.All in all, it's a perfect book for the armchair traveler. Not a journey I will ever want to undertake myself; but fascinating to read about."}, {"userName": "Christopher Roth", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/5926097-christopher-roth", "userReview": "Delightful stuff! Full of ethnographic tidbits, the most memorable including a long sequence in which the author is mistaken for a ghost and nearly loses his life--something which has more than a faint resonance with cargo cults, which raises all kinds of interesting questions--and a lengthy description of the Kenyah people of interior Borneo, just on the Indonesian side of the border, who have an elaborate technology for fashioning sex toys and for inserting screws, bars, sticks, etc. into the glans of the penis to enhance female pleasure--ribbing created by scarification as well. Apparently the men don't particularly like it, but the women demand it. A quote from an interview with the village specialist in surgically installing these enhancements: \"'One method of determining the length of a man's palang [inserted oblong penis ring],' Pa PK continued, 'is to measure the length of the second joint of his thumb. The palang should be about half an inch longer.' I cast furtive glances around the room, casually comparing thumbs. Then Pa PK proudly stated that he had not one, but two, palangs, placed at right angles. 'Just like the four-bladed propeller on the monthly missionary plane,' he explained as he held his hands together in prayer.\" I'll never read \"Budgie the Little Helicopter\" by the Duchess of York quite the same way again. And who, you might ask, was the first Western traveler to describe this tribal practice? Robert Burns, grandson and namesake of the Scottish poet. Who knew."}, {"userName": "Marshall", "userReviewDate": "Oct 01, 2008", "userURL": "http://www.goodreads.com/user/show/971451-marshall", "userReview": "This is a travel memoir about hiking through the Borneo rain forest. Camping overnight in a state park is my idea of roughing it. This book makes that look like a five-star luxury hotel by comparison. The rain forest is teeming with life. He said he felt like he was inside an organism that could easily consume him. There were a few times his life was at risk.He couldn't have done it without the help of native guides, and most of this book is stories about his interactions with various natives he encountered. They were real characters. Most of them were very silly and fun-loving, and some were a bit nutty. Probably the most poignant scene was when he was captured and accused of being a demon. He kept his cool, and eventually figured out how to escape, by playing along with their superstition. I was impressed, and sometimes amazed, by his integrity, his preparedness, and his ingenuity.It's easy to think of the natives as a simple people, but in that environment, it was he that was simple. Sometimes he felt like he was going native himself as he adapted to living with these people in this environment. The title of this book refers to himself and how he felt when he first entered the forest. By the end, he was no longer a stranger to the forest, and even impressed some of the natives with some of the parts of Borneo he'd tackled.This is not normally my kind of book. It felt like a chore to get through it, or else I'd give it a higher rating. But if you like travel memoirs like this, it would probably be a page-turner for you."}, {"userName": "Matthew", "userReviewDate": "Mar 01, 2012", "userURL": "http://www.goodreads.com/user/show/7082132-matthew", "userReview": "This is a travelogue that covers religion and cultural change. The author walked from one end of Borneo to the other and back again. In the time spent doing this, he encountered various people who survive by hunting supplemented with subsistence burn-and-slash farming. These groups, particularly the Penan, practice an animist religion that explains most events with magic and remedies many problems and aliments with shamanism. Accordingly, these people can be used as an example when explaining the anthropological concepts of religion, the supernatural, magic, and shamanism. The book also deals with the effects of globalization; in particular, the effects of mining and lumbering on the various highland people of Borneo. The book does not predict a great future for the various highland people of Borneo; indeed, it predicts a land-grab on the part of the unregulated multinational corporations (The peoples, who merely live on the land, but do not have legal claim to it due to their only “dwelling” on it instead of “developing” it.) with cultural and possible physical extinction of these peoples.The book is a good read. It should be of interest to anyone who is interested in gaining an understanding the toll globalization is taking on the various peoples of the Third World."}], "description": "Eric Hansen was the first westerner ever to walk across the island of Borneo. Completely cut off from the outside world for seven months, he traveled nearly 1,500 miles with small bands of nomadic hunters known as Penan. Beneath the rain forest canopy, they trekked through a hauntingly beautiful jungle where snakes and frogs fly, pigs climb trees, giant carnivorous plants eat mice, and mushrooms glow at night. At once a modern classic of travel literature and a gripping adventure story, Stranger in the Forest provides a rare and intimate look at the vanishing way of life of one of the last surviving groups of rain forest dwellers. Hansen's absorbing, and often chilling, account of his exploits is tempered with the humor and humanity that prompted the Penan to take him into their world and to share their secrets.", "title": "Stranger in the Forest: On Foot Across Borneo", "url": "http://www.goodreads.com/book/show/15667.Stranger_in_the_Forest", "average": 4.11, "cover": "https://images.gr-assets.com/books/1403183182l/15667.jpg", "reviews": 104, "authors": [{"url": "https://www.goodreads.com/author/show/9691.Eric_Hansen", "name": "Eric Hansen"}], "type": ["Travel", "Nonfiction", "Adventure", "Autobiography", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/15667.Stranger_in_the_Forest", "http://www.goodreads.com/book/show/1347425.Stranger_In_The_Forest", "http://www.goodreads.com/book/show/1347424.Stranger_In_The_Forest", "http://www.goodreads.com/book/show/20751580-stranger-in-the-forest", "http://www.goodreads.com/book/show/334212.Motoring_with_Mohammed", "http://www.goodreads.com/book/show/785418.Orchid_Fever", "http://www.goodreads.com/book/show/735389.The_Bird_Man_and_the_Lap_Dancer", "http://www.goodreads.com/book/show/900004.The_Traveler", "http://www.goodreads.com/book/show/26762560-hiking-michigan-s-upper-peninsula", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}