{"ratings": 3681, "userreviews": [{"userName": "karen", "userReviewDate": "Oct 27, 2012", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "as much as i hated the opening sentences,The books flew open like startled birds trying to escape the flames. One after another I savagely hurled them into the hottest part of the bonfire, watching them ignite almost before they landed.**no!! don't burn the bookas!!**i really liked this book. more than the first one, actually. although they both get four stars because i don't do math. i think this one skews darker than the first one, and builds upon the consequences arising from the first book's events.(tiptoe, tiptoe...) you can't unring a bell, and you can't recapture lost innocence, so it is only natural that the characters have a darker feel to them now, after that first book. oppel is very good at writing all of the story's elements; the action/horror parts, the sibling relationships, the romantic/rival parts, and the inner turmoil/raw ambition psychological elements.it is a page-turner, but one with real momentum and weight to its story. he is also good at passing off byron's poetry as the poetry of a different character, with no credit given. what's that all about, oppel?? and later, one of the characters claims, \"The place makes us mad, bad, and dangerous to know.\" please to explain yourself, sir. are we going to see more byron in the future?? properly-attributed? i await my answer.apart from that, it is a really compelling mystery/action/horror novel with some realistically-written characters and a solid \"will there be more...?\" ending.and, man, i love that new font."}, {"userName": "Scarlett", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/53419883-scarlett", "userReview": "Who will go rogue? Who will lose their mind? Who is the wicked?In the sequel to “This Dark Endeavor”, Victor, Konrad, Elizabeth and Henry are transported into a paranormal spirit world. Alchemy and potent potions will first lend to superior strengths, but won’t stand against time. Slowly, these characters go through their own little nightmares influenced by grim and dark forces from the other side. “Here's all I know: that the world is uncontrollable. Chaos reigns. That anything and everything might be possible. I won't subscribe to any rational system again. Nothing will bind me.” ― Kenneth Oppel, Such Wicked IntentOne by one their minds play tricks on one another, or pull them away from each other. Will the power over what they have created in the spirit world tear them apart or save them?“I'm just trying to spare you hurt. Her love for Konrad is like the foundation of the earth.\" \"The earth sometimes shifts.”  ― Kenneth Oppel, Such Wicked Intent Or is the other side so compelling that it will collapse with them and all they know and love?This was a super enjoyable read. An easy intro to the paranormal genre. Again, it was well written, good pace and you never know what happens around the next page. Since the characters were already established in the previous novel, you won’t get to delve into more character development. Instead it focuses more on action, plot and scenery. Keeping the reader on his toes solving the riddle of the wicked!"}, {"userName": "Ashley Daviau", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/35915119-ashley-daviau", "userReview": "I was hoping that this book would blow the first one out of the water and come to a stunning conclusion. That wasn’t the case but it was just as good as the first one so at least there’s that! I found this book to be much darker than the first and I quite enjoyed the twists and turns it took. Quite a few times I was completely caught by surprise by the turn of events. This book was definitely action packed and a page turner! My main issue with this series is the love triangle. It’s actually quite painful at times and really affected my enjoyment of the story. I really love how the subtle nods the author gives to the original Frankenstein story. They’re subtly and effortlessly blended in and a big part of why I enjoyed the story so much."}, {"userName": "Katherine", "userReviewDate": "May 24, 2013", "userURL": "http://www.goodreads.com/user/show/13311251-katherine", "userReview": "[Victor makes a baby made out of mud, his first experiment in making life. His experiences afterwards toward the infant creature are a huge foreshadower to when he makes the Creature. (hide spoiler)]"}, {"userName": "Kisses A", "userReviewDate": "Apr 10, 2016", "userURL": "http://www.goodreads.com/user/show/41833669-kisses-a", "userReview": "Let's do this!Oh and this is the guy( I forgot his name)Wow!!!!! I loved this!!!! A bit sad at the end though. Full review to come."}, {"userName": "TheBookSmugglers", "userReviewDate": "Sep 20, 2012", "userURL": "http://www.goodreads.com/user/show/1223249-thebooksmugglers", "userReview": "Originally reviewed on The Book Smugglers**WARNING: This review contains unavoidable spoilers for the first book in the Victor Frankenstein series. If you have not read This Dark Endeavor and do not wish to be spoiled, LOOK AWAY.**Review: It has been weeks since Konrad's death, and Chateau Frankenstein is frozen in a state of cold grief. Victor's failed concoction - the elixir of life, brewed at much danger and cost Victor the fingers of his left hand - is a bitter blow. In his grief and rage, Victor turns away from alchemy and burns every book from the chateau's Dark Library - all except for one book, which survives the flames. This book holds the key to another obsession and the hidden history of Chateau Frankenstein's original patriarch, the enigmatic Wilhelm Frankenstein. Victor's ancestral home holds many more secrets, from ancient caves beneath the home's foundation, further hidden passages and secret rooms, and even a key to the realm of the dead. Using the notes and tools left behind by Wilhelm, Victor and friends Elizabeth and Henry unlock a way into the spirit world, where they are overjoyed to find Konrad, waiting in a kind of limbo. Once again, Victor vows to save his twin brother and find a way to bring him back to the world of the living, using the occult arts and the knowledge he amasses in the spirit realm. But something else in the spirit world longs for life and light, and will use Victor's obsessions, his jealousies, and his schemes to accomplish its own ends.The second book in the apprenticeship of Victor Frankenstein series, Such Wicked Intent is every bit as well-written and haunting as This Dark Endeavor...if somewhat less satisfying. Whereas This Dark Endeavor focused on alchemy and the kindling of Victor Frankenstein's obsession with the shadowy reaches of science, Such Wicked Intent absconds the sciences completely and shifts its focus to the occult and actual magic. I'm not sure how effective this switch is, or how in line with Mary Shelley's text (which, after all, is the end goal this series is building towards). Traveling to the spirit world and resurrecting the souls of the dead in golems made of mud and bone seems a trifle more magical and sophisticated than Victor's ultimate creation, his Modern Prometheus hewn from the bodies of men, and activated with his understanding of the alchemy, science, and electricity. The question of the unquestionably supernatural flavor of this second novel aside, there's no question of Oppel's skill as a storyteller, as Such Wicked Intent is a compulsively readable book with formidable monsters, twists, and incredibly effective character building - I'm just not entirely convinced that I liked the book. Take the characters, for example. In this second installment, Victor's passions burn even brighter, his schemes and manipulations more pronounced, his arrogance and hubris all the more glaring even after losing his twin. Victor is so consumed with his quest for knowledge and power, at the cost of anyone in his way, that it's hard to feel any affinity for the character. He vows to save Konrad, but soon is making plans to ship the resurrected Konrad away from his family so that he can steal Elizabeth's affections for himself. By the book's end, there is some redemption for Victor - but it's becoming increasingly hard to stomach him as a character. But perhaps that is ok, for likability is irrelevant - we all know Victor's future and his fate, after all. But I can't help but feel like we need something more, that we need something to root for Victor, ultimately. But perhaps that's just me.Victor aside, it's hard to like any of the characters in this second book - Elizabeth in particular is frustrating in that she is the perpetual object of obsession, not just for Victor and Konrad's ghost, but now also for Henry Clerval.* Additionally, Henry is given credit for one of Lord Byron's most famous poem \"She Walks in Beauty,\" supposedly penning this piece for Elizabeth.** And it's not just Konrad, Victor, and Henry lusting/fighting over Elizabeth, either - even the long dead supreme spirit of a past boogeyman (and a violent golem in Konrad's form) longs for her. This is Elizabeth's role in the series - to be fought over and desired by all she meets. Not my favorite type of storyline or heroine.These criticisms regarding characterization said, Such Wicked Intent is a beautifully written book and a bonafide page turner. The idea of the spirit world, of the secret caves beneath Chateau Frankenstein and the people who built these burial chambers, is fantastic. The monster of this piece (and some very creepy butterflies) is terrifying and original. I'm not exactly sure if the existence of the spirit world or of Chateau Frankenstein's place in it ultimately makes sense, but this otherworldly storyline is haunting and effective stuff. Suffice it to say, my feelings for Such Wicked Intent are conflicted. I appreciate, as always, Kenneth Oppel's obvious skill as a writer and storyteller. I also appreciate his daring to create a conflicted and decidedly un-likable protagonist. I appreciate these things, but ultimately, I can't say I loved this book. I'll be around for Victor's next dark obsession, though, with a wary eye.----------* Yes, seriously, there is a new overlapping love triangle in this book between Henry, Elizabeth and Victor. In addition to one between Victor, Elizabeth, and Konrad. And Konrad, Elizabeth, and the spirit of a girl named Analiese. No thank you.** While I appreciate this nice allusion to Mary Shelley's relationship with Lord Byron, attributing the poem to a lovestruck teenage Henry Clerval about Elizabeth is rather annoying."}, {"userName": "Celise", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/4653644-celise", "userReview": "[ So does anyone else feel really shuddery and panicky about that last paragraph?  (hide spoiler)]"}, {"userName": "Kat Heckenbach", "userReviewDate": "Dec 10, 2012", "userURL": "http://www.goodreads.com/user/show/2712862-kat-heckenbach", "userReview": "I have to say that I liked this book better than the first in the series (This Dark Endeavor) although I did find a few minor things frustrating. My biggest gripe was that the pacing was a bit too fast in places. But overall, the story was pretty gripping. This book is even darker than the first, and there were times I somewhat regretted reading so late at night ;). The ending resolved things for the most part, although I felt there could have been more exploration/discover of what the pit god was and where it came from, how it ended up in the pit, what killed it, etc.I would recommend this for fans of horror and dark fiction. The concept is really cool, too--Victor Frankenstein as a teen and how he ends up on the path of scientist obsessed with reanimation. I like that the story takes a winding route, not jumping straight to the traditional Frankenstein's monster.*side note*Yes, you can totally read this without having read This Dark Endeavor. Reading TDE first would probably make reading this one a richer experience, but it's not necessary to understand the plot at all. Likely though, if you read this, you'll want to read the other anyway.Looking forward to the next in the series.My WebsiteFind me on FacebookMy YA fantasy series:book 1\nbook 2"}, {"userName": "Kristina", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/4810658-kristina", "userReview": "I must say that I enjoyed the first book of this series MUCH more than this volume. I wouldn't say this is a \"bad\" book, but honestly it was just okay. It had a few moments of triumph that were exciting and heart pounding, but for the most part all the characters just became more annoying or whiny versions of the great characters they were in book one. I did enjoy it enough to keep reading and I honestly wanted to finish it, but it is not a book I think I would ever want to read a second time. I think the author would have been better suited to have concluded the story with the heart-wrenching that ended book one. It would have been a great motive for the single-minded passion that would have lead into the original story of Frankenstein. Instead we are left with a conclusion that should have made Victor Frankenstein give up his quest making the original story seem like an alternate ending. *** I won this book through Goodreads First Reads ***"}, {"userName": "Trisha", "userReviewDate": "Oct 10, 2013", "userURL": "http://www.goodreads.com/user/show/1238273-trisha", "userReview": "What an amazing adventure of a book. I'd read This Dark Endeavor, book 1, a while ago and absolutely loved it. Dark and gothic, it took me to an unbelievable time and through awful tragedy.and here we are, Elizabeth and Victor, after that tragedy. Even Henry is touched by the loss. When Victor burned the dark library and all it held, I really couldn't imagine where this could go.But then the life board, the pendulum, the creepy words. The clock, the elixir and the story just took off. I'm still reeling a bit, from all that happened. It was a great book 2."}, {"userName": "Anna J. Shelby ☕", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/36740745-anna-j-shelby", "userReview": "I'm such a klutz, I've read the sequel first *sigh*"}, {"userName": "Ceitidh", "userReviewDate": "Nov 19, 2011", "userURL": "http://www.goodreads.com/user/show/3850693-ceitidh", "userReview": "Read more of my reviews at Dazzling ReadsThose Seeking Excellence will Definitely Find it HereThere are not so many YA Canadian authors out there. But let me tell you something, Kenneth Oppel alone, counts for a thousand more.There is no biggest pleasure in the world than to read a book written by Kenneth Oppel. He was born to write and to express his thoughts in the most eloquent and graceful way. From tender and heartwarming moments, to the most gruesome and ghoulish scenes, Mr. Oppel's quill never ceased to dazzle me.Such Wicked Intend, sequel to This Dark Endeavor, kept me completely absorbed within its pages. Its haunting and utterly bewitching atmosphere, strong cast of characters and out-of-this-word marvelous plot, make this book one of the best YA novels I have ever read.It is impossible not to love the impulsive, ambitious, jealous and highly arrogant young Victor Frankenstein. Victor, who always wants to prove others that he's right and whose thirst for power is like the one of a man who has been long lost in a desert, is one of my favorite characters in the YA world. But, underneath those pejorative connotations, there is a young man whose heart feels and suffers (as much, or even more than the rest) the lost of his beloved twin brother. Victor's complex personality, if well is full of flaws, I as a reader can easily feel sympathy for him. Kenneth Oppel masters the creation of multi-layered and mountain-thick characters. Victor is the perfect proof of that.Within the darkness of this book there is so much beauty. Beauty in the writing, beauty in the character's noble hearts, beauty in the outcome. But there is also outrageous ambition. Victor wants to be his own master and create his own rules and limits of what it is possible and not. Again, playing God is an irresistible temptation for Victor. His insatiable hunger for power, and his constant unbearable grieving (emotional and physical), leads him to discover once again the evil secrets of the dark library, now almost completely burned.With an extraordinary narrative, Such Wicked Intend delivers with fiery passion a grandiose piece of YA literature. Those who seek excellence will certainly find it here. Bravo!"}, {"userName": "Nicola Mansfield", "userReviewDate": "Nov 02, 2012", "userURL": "http://www.goodreads.com/user/show/1682713-nicola-mansfield", "userReview": "Reason for Reading: This is the author's latest book.Absolutely stunning. The first book was good and this one is twice as good. Oppel has stepped up the gothic atmosphere, introduced the supernatural element, played the romance element and kept the entire story very dark. There is not one character in this book who is not immune to the elements of the darkside. The reader doesn't really know if anyone is truly a 'good' character. I found this to be one of the best books I've read by Oppell and I've read his entire oeuvre except his early novels. Very dark, Oppel has managed to keep the same religious undertones that are found in the original Shelly's Frankenstein. Keeping the character of Elizabeth a Christian, Victor's actions are questioned over and over again as to whether he is playing God, does he have a god complex and while Oppel delves into the supernatural, unlike Shelly, I realistically get a good feel that this could indeed be the set up that turns the boy into the man who eventually creates the creature known most commonly by his own name. This was a page-turner for me and I'm quite impressed with the variety of styles Oppel is capable of writing to such perfection. This is his forte though,when he turns to the atmospheric, dark and moody he is in his element. A must read for fans of gothic literature."}, {"userName": "Mel", "userReviewDate": "Jan 21, 2013", "userURL": "http://www.goodreads.com/user/show/10697179-mel", "userReview": "A weaker 4 stars than the first in this duology.I quite enjoyed this series that is a sort of prequel to Frankenstein I prefer the first book, just because Elizabeth's character was unbearable in this book. It seems unreal to me that these 2 people keep going along with Victor when clearly they should know better by now.Definitely a fun entertaining read and I hope you check it out some day :)"}, {"userName": "Tarmia", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/46015060-tarmia", "userReview": "Set as the second of two sequels to Frankenstein, this book is darkly twisting and wildly unpredictable. Although more fantasy than the first, the science-fiction theme is strong and prevalent. Maybe not better than the first, it is at least as good. I'm really happy I finally got around to ready this!"}, {"userName": "Liv Chanin", "userReviewDate": "Mar 18, 2012", "userURL": "http://www.goodreads.com/user/show/6612902-liv-chanin", "userReview": "I got this as an ARC from the PLA conference this past week, and I read it on the bus ride home. I LOVED this book. To me, it's always a happy day when the sequel is better than the original. Oppel did some fantastic character development in this book. I repeat, fantastic. He has really delved into Victor's psyche, and what can I say about Henry other than I love him. This book was downright frightening at points, and the unexpected plot-twists had me flying through the pages. Nothing about this book is cliche. This is the best book I have read in a long while, and I hope there is a book three."}, {"userName": "Stefanie Hasse hisandherbooks.de", "userReviewDate": "Jan 18, 2013", "userURL": "http://www.goodreads.com/user/show/10992486-stefanie-hasse-hisandherbooks-de", "userReview": "Zitat:\"Ein Tropfen Blut quoll aus meinem Finger auf das Schmuckstück und sofort wurde das Ding in meiner Hand zu etwas Lebendigem.\"(S. 15)\"Immer schneller wächst die Kreatur heran, sieht jede Sekunde mehr aus wie ein Mensch. Seine Haut ist nicht länger lehmig, sondern nach Farbe und Beschaffenheit menschlich.\"(S. 133)\"Ich kratzte mich an der Stirn und wurde irgendwie das Gefühl nicht los, dass wir einen Fehler begangen hatten, aber der konnte jetzt nicht mehr rückgängig gemacht werden.\"(S. 167)Inhalt:Nach dem Tod seines Bruders ist Victor völlig verzweifelt. Konrad war fester Bestandteil seines Lebens, sein Vertrauter. Und nun ist er plötzlich nicht mehr da.Kurze Zeit nach Konrads Tod werden auf Geheiß seines Vaters sämtliche Bücher und Phiolen aus der schwarzen Bibliothek verbrannt. Nur ein metallenes rotes Buch hat das Flammeninferno unbeschadet überstanden. Victor findet dieses Buch und wird davon sofort wie magisch angezogen. In dem Buch findet Victor Anweisungen für das Hexenbrett. Damit soll man mit den Toten kommunizieren können! Es liegt in Victors Natur, dass seine Begeisterung für manche Dinge gegen jegliche Bedenken die Oberhand gewinnt. Beim Versuch, das Hexenbrett in seinem Zimmer auszuprobieren, wird Victor von Elizabeth überrascht. Er kann sie davon überzeugen, den Versuch zu wagen. Immerhin schreckt Elizabeth vor Herausforderungen nie zurück. Tatsächlich scheint das Vorhaben zu gelingen! Das Pendel des Hexenbretts schlägt aus... Hastig notieren Victor und Elizabeth die Buchstaben, auf die das Pendel zeigt. Erst erscheint alles wirr, doch schließlich kann Victor eine Botschaft entziffern.Am nächsten Tag erzählen sie Henry von diesem Erlebnis. Natürlich ist Henry skeptisch. Aber er scheint ihnen zu glauben.Kurz darauf kommen Elizabeth, Henry und Victor einem gut gehütetem Geheimnis auf die Spur. Jetzt haben sie Zugang zur Welt der Toten!Dort stoßen sie allerdings auf etwas, was besser unentdeckt geblieben wäre...Meinung:Es ist meiner Meinung nach immer schwer, eine Fortsetzung zu einem wirklich guten ersten Teil zu schreiben. Kenneth Oppel ist dies allerdings eindrucksvoll gelungen! Seine Ideen für diesen zweiten Band und die Umsetzung haben hier einfach eine Geschichte entstehen lassen, die gelesen werden muss. Alles ist stimmig, jede Seite verspricht Spannung und Unterhaltung! Mehr kann man von einem guten Buch ganz einfach nicht erwarten...Auch wenn der erste Teil nun schon einige Zeit zurück liegt, hat es der Auto nicht versäumt, wichtige Geschehnisse aus dem ersten Band nochmals kurz rückblickend zu betrachten. Diese Schreibweise hat mir auf jeden Fall dazu verholfen, wieder schnell in diesen spannenden Plot einsteigen zu können. Herr Oppel brachte mir die Geschichte aus Victors Sicht in der Vergangenheitsform nahe. Das ist vermutlich auch der Grund, weshalb ich mich immer sehr direkt am Geschehen und an den Protagonisten fühlte. Und die Charaktere in diesem Buch sind einfach einzigartig!Victor, der Draufgänger, der Weltverbesserer, und manchmal auch der Taktiker... Mit besseren Eigenschaften kann man ihn eigentlich kaum beschreiben! Hautnah fühlt man mit ihm, erlebt seine Gedanken und versteht auch seine Handlungen. Einerseits so, wie man sich jemanden vorstellt, der Geschöpfe erschafft oder erschaffen will und jede Herausforderung annimmt. Andererseits erlebt man Victor eben doch als Menschen mit echten Gefühlen... In einigen Szenen hat er mich definitiv überrascht!Elizabeth ist natürlich mein Herzblatt in diesem Buch. Auch sie fühlt sich hin- und hergerissen. Da sind einerseits ihre wirklich starken Gefühle für Konrad, dem sie nun in der Totenwelt begegnen aber nicht näher kommen kann. Andererseits hat sie dort auch diesen animalischen Instinkt, der sie zu Victor treibt. So richtig kann sie sich nicht entscheiden und so manches Mal war ich doch aufgrund ihrer Reaktionen zumindest erstaunt. Aber nach wie vor bleibt sie eindeutig meine Herzdame.Der Protagonist mit der größten Entwicklung ist für mich jedoch eindeutig Henry. Hat man ihn im ersten Teil noch als schutzbedürftig und mitleiderregend erlebt, kann man nun eine völlig andere Seite an ihm entdecken. Aber gerade bei ihm möchte ich eigentlich nicht zu viel verraten. Lest es selbst! Allein Henry ist es schon wert, dieses Buch gelesen zu haben...Ich kann mich an keine Stelle in der Geschichte erinnern, an der ich mich von Langeweile getrieben sah. Im Endeffekt war eine durchgehende Spannung mit nachvollziehbaren Handlungen zu verspüren, die mich durch die Seiten rasen ließ. Ganz, ganz kleine Unebenheiten verflogen zu Nebensächlichkeiten und ich hatte einen vollkommenen Lesegenuss! Der Autor hat mich mit einem zufiedenstellenden Ende zurückgelassen; Potential für eine eine Fortsetzung ist aber definitiv vorhanden!Urteil:Solange ich auch überlege, ich finde einfach kaum etwas, was ich an diesem Buch zu bemängeln hätte. Für diesen wirklich guten zweiten Band muss ich ganz einfach 5 Bücher vergeben. Ich bin eindeutig dem Frankenstein-Wahn verfallen...Für alle Fans spannender Abwechslungen, die sich nicht auf das klassische Genre versteift haben und Überraschungen lieben. Ein Must-Read für alle, die bereits vom ersten Teil begeistert waren...Die Serie:1. Düsteres Verlangen - Die wahre Geschichte des jungen Victor Frankenstein2. Ein dunkler Wille - Das Schicksal der Brüder Frankenstein3. laut Autor wird evtl. noch ein dritter Teil erscheinen© his-and-her-books.blogspot.de"}, {"userName": "Sierra Abrams", "userReviewDate": "Nov 20, 2011", "userURL": "http://www.goodreads.com/user/show/4925774-sierra-abrams", "userReview": "Such Wicked Intent by Kenneth Oppel (#2)Pages: 310Release Date: Aug. 21st, 2012Date Read: 2012, August 11th-12thReceived: ARC (borrowed)Rating: 5/5 starsRecommended to: 14+There are some maaaajor spoilers in this review, so if you don't want the first book ruined for you, I suggest you skip reading this! Howevvver...I HIGHLY recommend this series, so if you're interested, check out my review of the first book, This Dark Endeavor.SUMMARY -Victor has made a promise - an oath. After the death of the one closest to him, Victor has promised to bring him back from the dead. But since they burned the Frankenstein library, how will he discover the way? When he sees the unburnt binding of a book among the ashes, he snatches it and gives rein to curiosity. What he and his friends, Elizabeth and Henry, discover through the book, the thing they can do in the spirit world, suck them into a dangerous game. What all can they accomplish with this new-found power? How can they raise Konrad from the dead...and at what cost?MY THOUGHTS -Oh holy gracious, I'm just so happy. Not that I was doubting Oppel's genius or anything...I was just a bit nervous, because I'd hyped myself up about this book and was worried if wouldn't live up to my expectations. But heck, why did I ever worry my little head over it? It was perfect, from beginning to end. The only thing stopping me from awarding this series \"forever favorite\" is that I haven't read what comes next, and that will be the deciding factor.CHARACTER NOTES -I know I'll need to do a lot of explaining for this statement, whether you've read the book or not: I am madly in love with Victor. Goodness, he's just so...amazing. Obsessive, unrelenting, disobedient, and proud, yes... But every time he does something, foolish or no, I fall a little more in love. I believe he's one of the only \"bad boy\" types I've ever loved like this. The passionate way he sees things, especially his love for Elizabeth, makes me blush and read faster for more. And you know what? I think that's just it - his passion. I love him for it, so so much.Now, Elizabeth. She's amazing, too, in a very level-headed, sweet-tempered way. She is very maternal, but also very wild, like an animal, and only Victor really sees that side of her. I think she and Konrad had a comfortable love, but she and Victor could have something very passionate, a love like fire, and I'm rooting for that without a doubt.Henry seemed to grow so much this time around. He became so manly and attractive. The story really compared Henry's/Victor's strengths and showed how selfish Victor can be sometimes. Henry was almost like an angel, pure and strong. I loved him all the more this time!And the pit-god... Oh, I shudder at that name! What a formidable, unbeatable enemy!STORY NOTES -I think Oppel's trademark is that he makes everything that could possibly go wrong happen, one thing after another, slamming the heroes in the face until it seems like they won't be able to win after all... And that's also his brilliancy. It's rare that a story sucks me in so much that by the end I can no longer sense things going on around me, that my heart is beating wildly, my stomach is churning with worry, and htat my hands shake with anticipation as I turn the pages. And this book - it did exactly that.From beginning to end I couldn't stop. I read it all in 2 sittings, only putting it down 'cause I had to, only picking it up once I knew I could just sit and finish it all.This is a dark, sad, humorous, startling, gripping, and completely lovely. It holds twists I couldn't foresee, and writing that sweeps you up in TWO different tenses. Victor's voice and Oppel's style, while both unmistakable, mesh perfectly.It's also a story that sticks with you. I know that in my review of This Dark Endeavor I said the story wasn't very memorable, but I take that back. I remembered everything about Book 1, and now Such Wicked Intent sticks out to me even more.Also, as Christian, I found the religious discussions and aspects of the story VERY fascinating. They weren't over the top or taking over the whole story, but OMG (excuse my lack of proper grammar) but that was a brilliant touch. You have the dynamics of an athiest, a Catholic, and a Protestant. So, soooo fascinating!!So, honestly, I have nothing bad to say. At all!SUMMING IT UP -Just....wow. I personally cannot recommend this series enough. I want everyone to read it - hurry hurry go go go go go go go go!!!!!For the Parents -A kiss or two (Victor thinks about one of them afterward and about the intimacy between he and Elizabeth, but not in explicit terms). Maybe a curse word or two. Some intense action but not really any violence. Some spooky scenes (looooved those!). Overall, recommended 14+.Read more reviews at Yearning to Read!"}, {"userName": "Evie", "userReviewDate": "Nov 25, 2011", "userURL": "http://www.goodreads.com/user/show/4335276-evie", "userReview": "I was extremely lucky to be able to feature Kenneth Oppel's first installment in The Apprenticeship Of Victor Frankenstein series during my MEN in YA event in 2011. This Dark Endeavor was fabulous and I absolutely and utterly loved it. It ended up being one of my TOP 10 favourite reads of 2011, and since then I have re-read it at least 5 times. When back in June 2012 I was lucky enough to get my hands on an ARC of the second book in Oppel's gorgeous series, I won't lie - my eyes prickles with tears. Tears of joy! I did not waste a single day, I immediately dived into it. And it was phenomenal. Such Wicked Intent is a sublime and unparalleled work of literary genius. Dark, stately, and highly atmospheric, it pulls the reader in with its lush, 19th century-sque prose and wildly original plot line. It's astonishingly fluent, deliciously adventurous, moody and sinister - in other words, it's YA adventure at its very best. Very few can pull off dark and eerie the way Kenneth Oppel does it! An ancient myth, long buried (and terrifying) secrets, forbidden knowledge and a dark endeavor of even greater proportions than Victor's previous one - in Suck Wicked Intent you'll find all that and much, much more. If you loved the first book, you will definitely love the sequel, too (if not more). Victor is back, and the restless spirit of his does not let him stay out of trouble. His unquenchable thirst for knowledge and power pushes him to continue his exploration of the underground caves and hidden chambers of the Frankenstein chateau. The Biblioteka Obscura has been destroyed by Victor's father, its dangerous collection burned to dust, but if you think that The Dark Library was the only secret the old chateau held within its premises, you're very wrong. When by sheer accident, Victor and Elizabeth discover a portal to the spirit world, they can not resist the temptation of seeing Konrad again. Convinced they stumbled upon a way to raise him from the dead, the two of them, together with their friend, Henry, will embark on yet another dangerous quest, and one that may prove to be too much for them to handle.  I loved the premise of this novel, especially the way it focused on exploring Victor's psyche, with all its flaws and imperfections. Entering the spirit world gives Victor unnatural physical strength and intelligence, but it also awakens his more lustful urges, selfishness and craving for forbidden knowledge and power. Victor finds himself attracted to the newly discovered realm, much like a moth is drawn to the light of a flame. He's addicted to its lustrous colors and textures, the clarity it brings to his thoughts and visions, and the new possibilities it reveals. The mysterious butterflies enhance his abilities and fill him with a torrent of knowledge. But the thing about power, especially one that comes from a dark and evil source, is that.. it always comes at a price.  Kenneth Oppel did a phenomenal job depicting Victor's wild, arrogant nature. His portrayal is overblown in the best sense of the world - rich in detail, flavour and spirit. Victor is a character like no other I have met before - he's as uncontrollable and unpredictable as a tornado, passionate, obsessive, brave (bordering on suicidal), and completely intriguing. He's not entirely a positive character, neither is he a downright evil one. Misguided? Perhaps. Too curious and ambitious for his own good? Most definitely. Hurtful, bold, forceful and selfish? Yes, quite often. He's also dedicated, clever and sharp. It's a potentially deadly mixture, but one absolutely enthralling nevertheless. What can I say? I love Victor. I adore his flamboyant, eccentric personality. I know, it probably means there is something very wrong with me and I should seek help - oh, well. Blame Kenneth Oppel!  When you turn the last page of Such Wicked Intent, you will be struck by how gorgeous this book is from the first page to last, and you'll be tempted to go back to the beginning and read it all over again. I did just that. I couldn't stop myself. I've read this book and then went ahead and read it again. And I still can't say that I had enough of it. It's no secret that I'm a total sucker for books with dark and eerie themes, and if they have enthralling gothic settings and memorable, unique characters - even better! I loved Marry Shelley's Frankenstein - her timeless story has sent shivers down my spine many times, but as much as I appreciated her boldness and inventiveness, she did not manage to evoke as many emotions in me as Oppel did in his series. His portrayal of Victor is truly magnificent and insightful, and it really allows you to understand both the motives behind his actions, and the events that shaped his tragic future.  All in all, Such Wicked Intent is a compelling and engrossing piece of literature. It's full of gothic thrills, chilling mysteries, burning passion, and alchemy. Fast-moving, action-packed and dripping with atmosphere, it's one of the 2012 absolute must-reads."}, {"userName": "Khwahish", "userReviewDate": "Feb 14, 2013", "userURL": "http://www.goodreads.com/user/show/16367701-khwahish", "userReview": "'Such Wicked Intent' by Kenneth OppelDone By: Khwahish Kenneth Oppel's most recent book, 'Such Wicked Intent' (sequel to 'This Dark Endeavour'), has fascinated readers of many ages with its captivating and gothic tale regarding the early life of Victor Frankenstein. Being one of this year's Red Maple picks, just as 'This Dark Endeavour' had been last year, it has a promising look towards being this year's winner! Sixteen-year-old Victor Frankenstein has been coerced to cease his passion for alchemy forever, due to a horrible family catastrophe. However, when Victor finds a book that refuses to burn in the remnants of the flaming Dark Library, temptations take over his vows to never dally with alchemy again- or with his brother's betrothed, Elizabeth. But, when Henry (a family friend), Elizabeth and Victor uncover a secret portal to the spiritual world, all their beliefs of an afterlife float away and there is no enduring the power and potential of this dark place. As the three of them search for a way to resurrect a loved one, they unknowingly unravel a nefarious force of which they could be trapped forever. Kenneth Oppel writes yet another riviting novel with action, adventure, love and the desire to have a hand at power. Throughout all of 'Such Wicked Intent', I was on the edge of my seat! There was a lot of suspense that just seemed to pull me into Victor's world. Although Kenneth Oppel didn't build on the original Frankenstein story, there were no problem for me latching onto this amazing book. There were many things that I greatly enjoyed about Kenneth Oppel's writing; the main two being the descriptions and the suspense. The descriptions in the book were extensive and really made me feel as I was in the character's shoes, allowing me to clearly viualize the scene. Here is an excerpt from page 106,\"Behind my eyes I feel a great pressure building, words and images and ideas assembling themselves, and then in a blinding torrent I see-A body lying on the earth, its flesh corrupted. I see the legs of many living men encircling the body, standing over it. I hear their rough voices joining in a chant. Some kind of scythe comes down and severs the foot at the ankle. I feel my stomach rise. I see things in little bursts of light.\" Don't you feel as if you are in the protagonist's shoes? I did! But, not only is the description a vital part of any book, so is the suspense. No matter what part of 'Such Wicked Intent' I was reading, there was suspense in every nook and cranny. Just the excerpt above is a great example of both the key aspects of this fantastic book!  As for the weaknesses, for me, I found no flaws in this book. This is the type of book that would appear on my favourites list (being the type of writing that I enjoy reading) and is what I look for when I am reading and looking for books in various genres.  Overall, this was a excellent book that I relished through and through; definitely worthy of 5 stars! I highly recommend this to YA readers, fans of Kenneth Oppel and the Frankenstein story and of course, anyone who loves a dark, gothic tale (Stephen King fans, this is for you). I hope this book appeals to you just as it did for me, because I gurantee, it's worth it!"}, {"userName": "Georgie", "userReviewDate": "Nov 07, 2014", "userURL": "http://www.goodreads.com/user/show/8309145-georgie", "userReview": "[ plays with Henry's emotions and strings him along despite having no romantic interest in him whatsoever. She and Victor are as bad as one another, and I do think she genuinely loves Konrad, I'll give her that, (despite her kissing Victor and flirting with Henry) but her treatment of Henry is just despicable  (hide spoiler)]"}, {"userName": "Michelle Isenhoff", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/5319195-michelle-isenhoff", "userReview": "I loved the occult-free scariness of book one. It left me with the same nicely unsettled feeling as the classic novel, Frankenstein, for which this series serves as a prequel. But in book two, after the Elixir of Life fails to save his brother, Victor burns all his books of alchemy and turns his focus to the spiritual. Mr. Oppel does weave a page-turning story which I did finish and enjoy, but I do advise much more caution than with book one. My fear of dabbling with spirits closely resembles Elizabeth’s when she admonishes Victor for trying to talk to his dead brother:“The occult? I actually believe in a world beyond ours, Victor. I haven’t seen them yet, but there may truly be ghosts—and devils too—and I think it very unwise to try to summon them.”But Victor will try any means to get Konrad back:“I tell you, I want to see my twin again!”“But how?” Henry demanded.I sighed. “I’ve no idea, not yet. Here’s all I know…That anything and everything might be possible. I won’t subscribe to any rational system again. Nothing will bind me.”“That is the way to madness,” said Elizabeth.“If it makes me mad, so be it.”Victor’s determination lands him, Elizabeth, and Henry squarely in the spirit world. And the result is horrible. For in the spirit world, a shifting, strange, parallel dimension, Victor finds ancient cave writings that describe how to grow a soulless body that exactly resembles the deceased, which the kids do in an outbuilding on the manor. When it is grown, Victor intends to retrieve Konrad’s spirit and unite them. But the spark of life needed to grow the body (the liquid butterfly shadow that accompanies them out of the spirit world) they learn, is subject to a dark force. They have dabbled in evil far beyond their expectations.This book also contains a few other cautionary details. There are one or two mild profanities and a scene in which Victor strips off all his clothes to capture the parasitic butterfly shadow that crawls on him. And at one point Elizabeth narrowly escapes being raped. But the demonic element is my greatest caution.On the literary side, Mr. Oppel continues to create a character in line with the original selfish, violent, power-hungry Victor Frankenstein. His metamorphosis is clever. And the conflict between religion and science continues to be represented brilliantly by Victor and Elizabeth. A main theme of the series, as in Frankenstein, is how far should one go in playing God? Just because we can do something, does that mean we should? It’s a great discussion starter and very relevant to today’s medical advances and ethical issues. It also illustrates man’s limits. For with all our learning and technology, we are still unable to create life.This plot is complex, suspenseful, and contains several twists and surprises. It’s a thought-provoker. But it also delves into uncomfortable and potentially dangerous spiritual areas. I couldn’t put it down. But for kids, I strongly advise parental guidance and age 14 at the least."}, {"userName": "Emily S.", "userReviewDate": "Oct 16, 2012", "userURL": "http://www.goodreads.com/user/show/925510-emily-s", "userReview": "I've decided that I'm a fan of gothic horror novels. Really, no time period does horror better than gothic. It's dark, twisted, terrifying...while being free from all the gore and disgusting stuff that turn me off in modern horror.This series is no exception. When I read the first book, I was a little put off in the beginning by the slower pacing. By the time I finished, however, I realized that it was perfect. The story NEEDED it. It didn't need to speed by at a pace I couldn't keep up with.The sequel is no exception. Slow moving, but perfectly paced. It's just exactly what makes a gothic horror story so fabulous. You never really know where it's going or how things will be resolved. There isn't a lot of 'Oh, I can guess what's going to happen next because this is YA.\" Sure, we know that things are going to work out in the end. But they rarely work out in the way one expects, and the characters never come out of it unscathed. They are figuratively torn apart and have to put themselves back together in some cobbled fashion. This is, for me, a metaphor for the larger Frankenstein story. We all know that one. Oppel is a brilliant story crafter. The way he weaves the tale leaves me breathless - not because it's all happening so fast, but because I can't figure out where we're going next. The world building is fabulous and so realistic. There were times when I felt like I could smell the same things that the characters were, see the same sights, experience the same feelings. It was great.As far as characters go, WOW. After reading this, and having read Mary Shelley's Frankenstein, I can totally see how Victor got to be the way he did. The two authors should really go hand-in-hand. Read the books together.Victor is power hungry and always wanting what he knows he can't have. It never stops him from trying though, which carries through to Shelley's masterpiece. I really liked getting a glimpse of teenage Victor. The way Oppel writes him leads perfectly into Victor as an older student. He isn't a bad person; he's just consumed with the need to KNOW and the need for power.The supporting characters are also strong. Elizabeth, Konrad, and Henry all serve as foils for Victor. Each one of them has a characteristic that he lacks. Elizabeth is staunch in her belief in God and refuses to back down from that when challenged. Konrad has a love for life and living things. Not that Victor doesn't, but Konrad is motivated more by love than power. Henry is loyalty and quiet strength defined. There is nothing loud or showy about any of them and it's the perfect contrast to Victor's bravado.I'm guessing that there is another book coming in this series, based on the ending of Such Wicked Intent. I will definitely be on the lookout to continue this story.4.5 Eiffel Towers"}, {"userName": "Lynn", "userReviewDate": "Apr 26, 2012", "userURL": "http://www.goodreads.com/user/show/1796771-lynn", "userReview": "Such Wicked Intent. When does obsession become madness?April 26, 2012 I must confess, I begged the wonderful assistant marketing manager at Simon & Shuster for an early copy of Such Wicked Intent, Kenneth Oppel’s second installment in the Apprenticeship of Victor Frankenstein. I LOVED This Dark Endeavor (see “There is a Passion in You That Scares Me,” November 2011). I danced around the room when TDE was put both on the Texas Lone Star and the TAYSHAS reading lists (it has also won many other awards—but hey, I’m a Texan and our awards are more important. Chillax, please—Texans are not known for our humility, and I’m just kidding around). I was thrilled that Summit Pictures purchased the movie rights. With all that going on, I knew there was NO WAY for me to wait until the August 21st release date for Such Wicked Intent. so Venessa at S&S hooked me up with a sequel that is every bit as good (and perhaps even better) than book one. Now, if you haven’t read This Dark Endeavor: The Apprenticeship of Victor Frankenstein, please do so. It’s amazing. Even if you don’t read TDE though, you can still enjoy Such Wicked Intent. It’s brilliant that way. Most sequels either spend an inordinate amount of time filling the reader in on back story while those who read book start flipping pages, or dig right in to book two leaving those who finished book one a while ago (or didn’t read it at all) in the dark and confused. Oppel weaves what readers need to know from book one into book two—never so much at one time as to make the reader think they can skip paragraphs. I am completely against spoilers so I must be very careful here so that you will go read This Dark Endeavor. Such Wicked Intent picks up with Victor and Elizabeth a few months after the end of This Dark Endeavor. Victor has burned the Dark Library but in its ashes finds something completely unknown but also somehow familiar. When he learns that he can enter the spirit world, he cannot resist knowing what is beyond death, even if it puts his own life and soul at risk. There, amid the black butterflies, he and Elizabeth discover heightened abilities, intelligence, and passions. How can he possibly resist Elizabeth now? In the spirit world, Victor discovers how to bring the dead back to life. But should they come back? As the butterflies enter the world of the living, and their purpose becomes twisted, Victor, Elizabeth, Henry, and Konrad have some disturbing decisions to make."}, {"userName": "Libellus", "userReviewDate": "Oct 03, 2015", "userURL": "http://www.goodreads.com/user/show/27589180-libellus", "userReview": "The apprenticeship of Victor Frankenstein by #2 Such Wicked Intent by Kenneth OppelOctober 20153/5*I read the French translation “L’apprentissage de Victor Frankenstein #2 Un vil dessein”*Translations ruin everything. Do not read the translation of a book if you can read it in its original language, kids. The writing style will feel awkward and like something is off, and the reading experience will seriously be affected by it. Also I hate sentences like this ‘Victor thought what Elizabeth said was wrong but he couldn’t help but wonder if what she said was actually the truth.” You know what I’m talking about, a character that doesn’t really know anything about his feelings and can’t get their shit together. I guess I can’t say anything about the writing style because of that reason but I can say that the atmosphere was still really great. A+ for chills and mystery and suspense. It’s not scary but it’s thrilling, kind of like watching a Criminal Minds episode: you know you’re safe under your little blanket, but the adventure still makes your blood pump way faster than usual. For the characters I have very mixed feelings about them. Victor was interesting because of his anti-hero personality. He was so selfish, so greedy for power, so arrogant and sometimes it got on my nerves a lot. I do love a good anti-hero story but I feel like this was overdone. The other characters I feel like there was no real progression from the first book. They still stayed exactly the same except with more grief. Especially Elizabeth, I mean her fiancé died because of alchemy but she is convinced to do occultism without too much arguing to try to bring him back which totally defies her religion, she accuses Victor of trying to play God but she is doing the exact same thing. I found that just a bit hypocrite. Another big turn off for me was the whole love-square (?) thing. Like c’mon 3 guys crushing on one girl all trying to win her over. This jealousy created unrealistic moments all through the book and it was predictable and not that interesting. I think I liked the plot of the first one better, but it is still enjoyable. Maybe the mud baby was a bit too farfetched for me. There was a lot of foreshadowing just like in the first one which added to the thrill of it, always trying to guess what this or this could mean in the next chapters. Overall good series, but there are better ones in this genre."}, {"userName": "Shawn Spjut", "userReviewDate": "Oct 16, 2012", "userURL": "http://www.goodreads.com/user/show/8942708-shawn-spjut", "userReview": "Once again Oppel has managed to successfully lead me down the dark and twisted pathways of the heart and mind of the young Victor Frankenstein in such a way, that even now, twenty-four hours after reading those hateful words, \"The End\", I have yet to decide whether to embrace the main character in hopeful love, or toss him in an asylum for the criminally insane before it’s too late. I don't know whether to applaud his willingness to explore all the possibilities to try and save his twin, or resign myself to the fact, that regardless of how honorable Victors intentions may seem, the bottom line is, in the end, all things serve his god-like purposes.Even if those purposes are to bring his twin back from the dead.[youtube=http://www.youtube.com/watch?v=ER4E5m...]From start to finish, the author has enriched us with his ability to bring to fruition the life of one of literatures most classical figures in a way that we might mistakenly think that it was Oppel, and not Shelley, who was the original author and creator of Victor Frankenstein. So full and colorful are the protagonist-antagonist's narrative of himself, his comrades, and the events surrounding his baptism into arcane things better left alone, that he makes the reader forget that they are merely observers of the events, rather than its participants.If there had been a Book Three, to \"The Apprenticeship of Victor Frankenstein\" series waiting on a library shelf or Amazon Kindle reader, I'd have already gone out and bought it. But since there isn't, I'll just have to content myself with the hopes that it won't be too long until I can rejoin my newfound friends on their quest to uncover the dark and forbid magics of necromancy.On a scale of one to five, I'm giving \"Such Wicked Intent\" a five; as I found it even better written than its predecessor.Book One: The Apprenticeship of Victor Frankenstein: \"This Dark Endeavor\""}, {"userName": "Victoria", "userReviewDate": "Dec 31, 2013", "userURL": "http://www.goodreads.com/user/show/24310114-victoria", "userReview": "In the second installment of the The Apprenticeship of Victor Frankenstein, a great tragedy has forced 16-year-old Victor Frankenstein to swear never to dabble in the dark arts and sciences of alchemy again-just as he had promised to no longer covet his brother's betrothed, Elizabeth. If only these things were not so tempting to him. One day, Victor and Elizabeth discover an easy portal into the spirit world, where Victor's dead brother, Konrad, is. With their best friend Henry, Victor, Elizabeth and Konrad unlock to mysteries and secrets shrouding this spirit world and a mysterious young lady who lives there with Konrad. There, passion and power reign and Victor quickly becomes obsessed, but as they search for a way to raise the dead, they unknowingly open the door for a dark evilness to seep out from which they may never escape.I picked up this book because it was one of this year's Red Maple nominees and I really wanted to read it. But, when I heard that this was the second book, I wanted to read the first book first. However, I had already started reading this second book and could not put it down.I finished this book because it was really tempting. I could hardly put it down. One electrifying event chased another like heartbeats and I just had to find out what happened. The mystery, the fear and the suspense kept me reading.I think Aiyana would like this book because she reads a lot and I think that she might enjoy this type of book. Also, I think she likes books with romance and this book has some.:)"}, {"userName": "Holly", "userReviewDate": "Aug 27, 2012", "userURL": "http://www.goodreads.com/user/show/2127955-holly", "userReview": "I was a HUGE fan of the first book of The Apprenticeship of Victor Frankenstein series, This Dark Endeavor. That book was chock full of genuinely creepy surprises, and I loved the whole Gothic, claustrophobic feel of the story.Unfortunately, this book seems to suffer from \"2nd Book Syndrome\". Which is what I call the annoying trend of sequels never living up to the awesomeness of the first book in a series. I have been running into this quite a bit lately, and it's more than a little depressing.While the overall story was enjoyable, there were several times that I did find myself rolling my eyes while reading about the adventures of Victor, Henry and Elizabeth. While the first book did have it's intense moments, I feel like Such Wicked Intent went more for the gross-out factor, then for the much more satisfying uber-creepiness that was found in TDE.Victor was a cocky SOB from the beginning, but his un-likability level went up a bit in this book, and I found it hard to root for someone so hell-bent on self-destruction.But, even though i did have several issues with the book...this series is still quite entertaining, and one that I hope the author decides to continue. My YT Channel: http://www.youtube.com/user/BookgasmicMy blog: http://ravingbookaddict.blogspot.com/"}, {"userName": "Beth", "userReviewDate": "Oct 21, 2012", "userURL": "http://www.goodreads.com/user/show/1279072-beth", "userReview": "This book picks up shortly after the first one leaves off. Just as Victor is dealing with the death of his twin, Konrad, he discovers a portal into the spirit world where he finds his brother in a state of limbo. Together with his friends he searches for a way to bring his brother back from the dead.This one is slightly darker in tone. Where the first one focuses on science and the dark arts, this one is centered around the spirit world and the paranormal. I found I did not like this approach quite as much. Evil spirits, trying to create life from clay and bone, and the general atmosphere of unease I sensed whenever they were in the spirit world left me a little uncomfortable. It is another masterfully told story though with plenty of action and suspense. The thing I found most disconcerting was the growing dislike I find myself feeling for Victor. He becomes more arrogant, more obsessive and more unreasonable with every passing moment. There is some redemption for him by the end, but only just. I will still follow him on his next dark adventure."}, {"userName": "Ashley", "userReviewDate": "Jan 14, 2016", "userURL": "http://www.goodreads.com/user/show/16232134-ashley", "userReview": "Kenneth Oppel spins a delightful twist on the classic tale about a young man who would aspire to the greatest heights, giving up all he holds dear for the promise of triumph. Konrad is dead, and his twin, young and ambitious Victor Frankenstein, despairs of ever seeing his brother again. The failed brewing of the Elixir of Life has brought him, his best friend Henry, and Elizabeth, his brothers' betrothed, to an all-time low. The burning of the Dark Library was just the icing on the cake, until Victor finds a box with instructions on how to enter the spirit realm. Enlisting his friends, they journey to the other side. Soon, they will learn of an ancient resurrection ritual, but they will also discover things aren't quite as simple as they first appeared. With darkness lurking around every corner, our trio will soon face the trial of their lifetime. This Dark Endeavor was well written, and I was very pleased with this sequel. The origins of Frankenstein and his early experiments are fun to read, watching as he slowly morphs into the mad scientist we all know and love."}], "description": "When his grieving father orders the destruction of the Dark Library, Victor retrieves a book in which he finds the promise of not just communicating with the dead, but entering their realm, and soon he, Elizabeth, and Henry are in the spirit world of Château Frankenstein, creating and growing a body.[Book two of The Apprenticeship of Victor Frankenstein series.]", "title": "Such Wicked Intent\n      \n          (The Apprenticeship of Victor Frankenstein #2)", "url": "http://www.goodreads.com/book/show/13063098-such-wicked-intent", "average": 4.0, "cover": "https://images.gr-assets.com/books/1321411633l/13063098.jpg", "reviews": 582, "authors": [{"url": "https://www.goodreads.com/author/show/88922.Kenneth_Oppel", "name": "Kenneth Oppel"}], "type": ["Young Adult", "Fantasy", "Historical", "Horror", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/13063098-such-wicked-intent", "http://www.goodreads.com/book/show/16074837-such-wicked-intent", "http://www.goodreads.com/book/show/17612928-such-wicked-intent", "http://www.goodreads.com/book/show/13118952-such-wicked-intent", "http://www.goodreads.com/book/show/15020818-such-wicked-intent", "http://www.goodreads.com/book/show/428042.Airborn", "http://www.goodreads.com/book/show/857920.Silverwing", "http://www.goodreads.com/book/show/428036.Skybreaker", "http://www.goodreads.com/book/show/9779094-this-dark-endeavor", "http://www.goodreads.com/book/show/1191449.Sunwing"]}