{"ratings": 18745, "userreviews": [{"userName": "Betsy", "userReviewDate": "Jan 25, 2008", "userURL": "http://www.goodreads.com/user/show/221050-betsy", "userReview": "As I see it, there are two different ways to adapt a fairy tale into a full-length novel. You can either reinterpret the entire shebang with a whole new spin on the formerly familiar (ala A Curse Dark as Gold or The Magic Circle) or you can take the essential parts of the original tale and just fill them out with some depth and padding (ala Beauty). Sun and Moon, Ice and Snow falls squarely into the latter category. Now if I was a fairy tale snob I might get all huffy that Jessica Day George's book stays so close to the original fairy tale East of the Sun West of the Moon. And maybe I'd even have a reason to object, if it weren't for the fact that George's text is just so enjoyable to read. Basically it all comes down to a likable heroine, a great story, wonderful Norwegian touches, and a tale that will age beautifully as the years go by. When it comes to adapting a fairy tale into a full-length novel, George writes with a steady hand.She never had a name, this small girl, the last born in her family. The daughter of a poor woodcutter, the child's mother is so disappointed to have yet another female mouth to feed that everyone refers to the girl as simply \"the pika\". Not having a name can be dangerous when you live in a land of trolls who'd like nothing better than to snatch you away. Fortunately, one day the pika frees a white reindeer trapped in the wood and it gives her two gifts as thanks: a name and the ability to understand the words of animals. The second gift seems great but turns against the lass when a huge white polar bear enters her home one night and demands that she come with him to his palace in the north. If she does so for just one year then her family will be rich and she will be free to go back. But what is it about this palace that seems so odd? What do the strange inscriptions say? Why do the servants disappear when she asks questions? And why, oh why, is there a strange man sleeping next to her in bed every night?I think that more than almost any other fairy tale East of the Sun, West of the Moon has always been one of my favorites. It's this bizarre amalgamation of a bunch of different stories. There's the man under a beastly spell like in Beauty and the Beast. There's the girl looking at his forbidden face at night like in the tale of Cupid and Psyche. And then there's the long journey as the girl encounters magical beings in a quest to regain the man she loves, as in The Snow Queen. Stories where girls go out and get a job done appeal to me, and George's heroine is likable while still making the requisite mistakes needed to keep the plot going.What George does well is to take the original tale, stick with it practically to the letter, and then explain some of the moments that don't make as much sense out of context. For example, why would the troll princess love something as simple as a golden spindle or a golden carding comb? Well, trolls have an obsession with human objects and try to act as human as possible sometimes. That, in turn, reminded me of the polar bears in the book The Golden Compass, and so it goes. The pacing is also pretty good, though I was surprised that it took us to page 181 for the lass to betray the isbjorn (the other word for polar bear).Of course, there aren't many moments of deep introspection in this novel. For example, when the heroine makes a deal with the isbjorn on the condition that her family become wealthy, he promptly forces another bear to kill itself so that her no good brother can find the corpse and become rich. You'd think the lass would think long and hard about the consequences of her choices, but I suppose she has other stuff on her mind. And for an all-powerful Troll Queen who inspires fear in her minions, the final showdown between her and the lass is accurate to the original tale but may strike some as vaguely anti-climactic when compared to contemporary fantasy face-offs.I also would have liked it if a little more time had been spent examining the fact that no woman has ever stayed a whole year in the polar bear's frozen palace without somehow seeing his face at night. Clearly this original tale was one of those curiosity-killed-the-cat stories ala Pandora. I don't know that it's a fair criticism for a story to make these days, though. It would have been nice if George has spoken a little bit about how unfair it is to withhold the rules in a game and then blame a player for not following them to the letter. Ah well.In terms of age appropriateness, there's no reason in the world that a fairy tale loving ten-year-old wouldn't enjoy Sun and Moon, Ice and Snow. Yes, part of the story involves a girl who keeps finding a man coming in and sleeping in her bed, but he's always full clothed and never so much as speaks to her. Really, this is just an adventure novel couched in a great old tale. The kind of thing everyone can enjoy, and many will.For ages 10-17"}, {"userName": "Cait • A Page with a View", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "[She has to return home for a short time when her father's ill, but then she comes back and... long story short, she succeeds in going to \"Her\" castle located east of the sun and west of the moon to save everyone. The girl finds her prince sitting on a stool by the throne, staring blankly ahead while all of the trolls dance and feast. This goes on for a bit and she eventually saves the prince with her cleverness and ability to perform a task. (hide spoiler)]"}, {"userName": "Gail Carriger", "userReviewDate": "Nov 22, 2009", "userURL": "http://www.goodreads.com/user/show/2277045-gail-carriger", "userReview": "This is a retelling of a Nordic fairy tale set in an atmospheric Viking world that follows a girl who can speak to animals and a bear who is a prince. If you liked Uprooted, this is a wonderful lyrical tale in a similar vein."}, {"userName": "C. L.", "userReviewDate": "Oct 17, 2012", "userURL": "http://www.goodreads.com/user/show/13723459-c-l", "userReview": "[When her bedfellow came in that night the lass was still awake. Annoyed, she hopped out of bed as soon as he got in. She tripped over her slippers, struck her arm on the divan, and shouted in anger.\"I am not in the mood for you,\" she said between gritted teeth. \"One of us is going to sleep on the divan.\" She waited, but there as no answer. Of course. \"Fine then, I will,\" she snapped. She yanked the white bearskin off the bed, dragged it over her shoulders, and lay down.Her visitor didn't even wait until she had gotten comfortable before he got out of bed, picked her up, and tucked her in on her side of the bed. She tried to jump back out, but he pinned her down. When she finally relaxed, he let go and went to his side of the bed.\"If this is part of the enchantment, it's a very stupid part,\" she griped. But, tired and wanting to think over all that she had seen that day, she stayed in the bed. Her bedfellow heaved a sigh that reminded her of Rollo and went to sleep.\n (hide spoiler)]"}, {"userName": "Ashley", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/9871824-ashley", "userReview": "first read: May 2013first reread: September 18 - 23 , 2016I still really liked this book, though, being 27, I would say its a bit young for my liking.....buuuuuuuuuuut because of my love for the movie \"The Polar Bear King\", I can't help but want to read it over and over."}, {"userName": "Jacob Proffitt", "userReviewDate": "Aug 17, 2012", "userURL": "http://www.goodreads.com/user/show/1331641-jacob-proffitt", "userReview": "This review has been hard for me to write because the author, Jessica Day George, is a friend—and not in some squishy, internet way, either, but in a book group, get-together-every-month kind of way. You wouldn't think that'd make this hard considering that I enjoyed the book immensely—and despite several strikes against it from a personal taste perspective, too!The novel has a fairy-tale feel, though in a solidly Norsk setting (I don't know how better to name it—it's northern with all the ice and cold and Viking-like details, but not actually Viking or from an identifiable, known (to me) country). As such, it has many unexplained fantastical elements and pacing designed to invite exploration and reader self-insertion. That kind of thing normally drops me out of a story.But it didn't drag and my interest was fully engaged throughout. I liked “Lass” (she has no given name because her mother couldn't be bothered) a great deal. She was kind and care-full and not in any cloying way, either. She did her best with what she was given and didn't go in for a lot of “poor me” or moping. It didn't hurt that her primary motivation throughout was love for her brother and a desire to ease the soul-pain she could see was plaguing him so desperately.And I looked forward to how she would solve the puzzles she ran into, as well. The story maintained its fairy-tale logic throughout so you knew more or less why things worked (or didn't) and I never felt that the story cheated to be clever or sly or manipulative—this even as Lass finds help from three kindly (to her, anyway) crones or manages to dragoon the four winds into doing her favors.The one thing that fell flat for me, in the end, was the love story. Lass builds close emotional ties to a number of creatures in the castle she visits. One of those is closer than the others and you can kind of tell that her relationship with “him” is deeper and has more meaning for her. Unfortunately, most of the interactions where their bond is solidified are summarized or lumped together as a group in retrospect. I didn't get the feeling that I knew enough of their relationship to participate in the romance of it. So the payoff in the end, where Lass gets to leave her dreadful mother and live her happy-ever-after, was robbed somewhat of its impact. Since I am an incurable romantic, I regret that missing dynamic.Anyway, the book is a solid four personal stars and would easily merit five for someone more in its target audience—which is probably why this review was so hard for me to write for a friend. I want to give it the five stars its target demographic would, but I can’t really justify changing my rating policy just to benefit a friend…"}, {"userName": "TL ", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/4342402-tl", "userReview": "[The Brother Winds, as I will call them. Each different but fascinating in their own ways.  (hide spoiler)]"}, {"userName": "Angie", "userReviewDate": "Feb 21, 2008", "userURL": "http://www.goodreads.com/user/show/50378-angie", "userReview": "In the fairy tale mood, I was looking for something to follow up Master of Shadows. Jessica Day George's Sun and Moon, Ice and Snow looked like just the ticket. A retelling of the East of the Sun, West of the Moon fairy tale, I was both excited and nervous. For various reasons I have a hard time getting into retellings of this fairy tale and, though I did enjoy Edith Pattou's East, I've been hoping ever since to find a version I liked better. And I found one. I first loved the cover. I like the profile shot. This girl looks like she's ready to take on the frozen tundra. The story follows a girl called \"the lass.\" The last of nine children, she had the gall to be born a girl and, out of spite, her mother refuses to give her a name. The family refers to her as pika, or little girl. Her oldest brother Hans Peter is the one who calls her \"the lass,\" and the two of them are the closest of all the siblings. The story follows the fairy tale pretty closely, but George manages to fit in some twists and new angles that I found very refreshing.Many elements of this tale are a hard sell in a novel. The family who is willing to give their daughter up to a random snow bear. The girl who lets a stranger climb into bed with her every night and then falls in love with said snow bear enough to take on a troll queen to save his life. George's version of the tale addresses these issues to some extent. The girl is the unwanted ninth child (and a daughter) and therefore expendable. Particularly when the random snow bear offers wealth and opportunity in exchange for their daughter. The girl is lonely in the palace of ice where the walls smell of rotting meat and no one will answer her questions. After it becomes clear the stranger is not going to hurt her, his presence next to her at night is a comfort and a ward against loneliness. And when the lass decides to take on the troll queen, she is doing it not only for the enchanted bear, but the various servants who befriended her in the palace and then disappeared or died as a result of their kindness. I still struggle with the central relationship. It seems there's never enough of a connection for me. That said, the story desperately needed fleshing out and George rises to the challenge. Her deft touch with Norse traditions, language, and everyday life adds a welcome layer of warm reality to this icy tale."}, {"userName": "Arielle Walker", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/6762949-arielle-walker", "userReview": "I couldn't help but love this. East of the Sun, West of the Moon has long been my favourite fairytale, and there are myriads of re-tellings that never quite do it justice. A Court of Thorns and Roses is probably the most recent, and unfortunately the series only became incredibly good once the fairytale aspects had already been dealt with.This re-telling kept everything good - the brave heroine, the trolls, the candle, the carefully crafted ending - and simply made sense of it all. The love still feels a little rushed (I wish more time was spent with the bear) but the time spent with the heroine's family is wonderful, and the girl herself, nameless though she is, feels real and engaging. I'm beginning to collect re-tellings like these as it seems more and more likely that comparative literature is going to be the main part of my post-grad study. As simple and gentle as this is, I think it deserves a place among the better fairytale stories - and I would happily read it again."}, {"userName": "jesse", "userReviewDate": "Aug 11, 2009", "userURL": "http://www.goodreads.com/user/show/1185127-jesse", "userReview": "1.5/5this version of east of the sun & west of the moon was a pleasant read. pika, lass or whatever you might call her, lacked substance, meaning she wasn't a fleshed out character. all of jessica day george's books seem to have this particular problem. the author draws a strict line between evil vs. good, so the reader makes no mistake as to categorize who's the hero and who's the villain. which is a shame. there is more than just one side to a person than that! i'm disappointed once again by george's lack of layered characters ...if you want to read a modern and more importantly better version of this fairy tale. you should try reading ice by sarah beth durst!"}, {"userName": "Anne Osterlund", "userReviewDate": "Jan 08, 2012", "userURL": "http://www.goodreads.com/user/show/2232237-anne-osterlund", "userReview": "The lass has no name.But she has a gift. The ability to speak to animals.And the inability to give up.When the white bear arrives on her doorstep, promising her family wealth if she will live with him for a year, the lass says, “Yes.”A promise that will take her west of the moon and east of the sun.A fairy tale with echoes of Beauty and the Beast and Rose Red and Snow White. I particularly liked the Norwegian setting. From the lefsa to the white reindeer."}, {"userName": "Julie", "userReviewDate": "Jun 23, 2008", "userURL": "http://www.goodreads.com/user/show/1019307-julie", "userReview": "The ability to tell a story with characters who have warmth, humor, and humanity to them is my greatest reason for loving Jessica Day George's work. Sun and Moon is a fabulous retelling of the fairytale: East of the Sun West of the Moon. The Nameless ninth daughter of a poor woodcutter saves a white deer and is given the gift of speaking to animals which leads her on an adventure where she's stuck living with a polar bear for a year and a day so her family can have wealth. Loved the book, love the moments of humor, loved the characters, and HATED that it all ended when I closed the book.I love how our heroine was spunky and imaginitive enough to try to solve her own problems (even if she made a few things worse for herself) I can easily see fans of fairy tales placing this book on their \"favorites\" shelf. The writing was beatuiful and lyrical, and yet straightforward and simple to read, which makes it accessable to a wider audience. Loved it and cannot wait for more!"}, {"userName": "Talltree", "userReviewDate": "Dec 04, 2016", "userURL": "http://www.goodreads.com/user/show/1869868-talltree", "userReview": "3.5 stars!"}, {"userName": "enqi ✨&#x1f352; (high lady of the night court)", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/41427900-enqi-x1f352-high-lady-of-the-night-court", "userReview": "Long ago and far away in the land of ice and snow, there came a time when it seemed that winter would never end. The months when summer should have given the land respite were cold and damp, and the winter months were snow filled and colder still. The people said the cold had lasted a hundred years, and feared that it would last a hundred more. It was not a natural winter, and no one knew what witch or troll had caused the winds to howl so fiercely.   Sun and Moon, Ice and Snow  is a classic fairytale retelling, steeped in myth and magic. The tale follows a nameless girl (the Lass, as she is known to her family) who has the ability to talk to animals and is often overlooked and neglected by those closest to her. When a great polar bear - an isbjørn - asks her to come and live with him for a year in his castle, in exchange for her family becoming wealthy, she gladly accepts. Yet the bear's castle is made out of ice and serviced by a silent staff of servants, and nothing is as it seems. Only a grueling journey on the backs of the four winds will reveal the truth: the bear is really a prince trapped in an enchantment, and the Lass has only days to travel to the castle that is east of the sun, west of the moon and free him before he is married against his will to a troll princess. So I actually went in thinking this was supposed to be a retelling of the traditional fairy tale Beauty and the Beast. I didn't know it was supposed to emulate East of the Sun, West of the Moon, although I guess there are similar elements in both  Beauty  and  East.  Nevertheless, I think it might've influenced my rating a little - I saw some reviews saying this was really unoriginal and boring. It was the complete opposite for me.I loved the haunting icy lore of the medieval North that was so rampant in this tale. Something about the North has always fascinated me inexplicably, and there was something about this book that I couldn't put down. Enthralling with many unexpected twists and turns, this book hooked me from the very first page to the very end. Although the ending felt a little rushed, the story was still so beautifully written and the ancient tales of the Nordic lands only enriched it further. Side note - I really loved the names in this book!! Especially Princess Indæll, the troll princess. And there were so many words Jessica Day George used that had me all heart eyes. This author and I definitely have one thing in common and that's our love for anything Northern, the cold region of the world where the wind never stops blowing and finding a white bear on your doorstep is almost normal. 💗Breathlessly magical and poignantly nostalgic,  Sun and Moon, Ice and Snow  exceeded my expectations by far, and truly embodies the timeless enchantment of the fairy tale it was hoping to emulate."}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Feb 11, 2014", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "Middle-school level retelling of the fairy tale East of the Sun, West of the Moon. I think I would have liked this much better when I was 13. For older readers who like fairy tale novelizations, Edith Pattou's East is a more complex retelling of this particular story."}, {"userName": "Angela", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/30837909-angela", "userReview": "Oh gosh I loved this probably my favorite yet of hers"}, {"userName": "Misty", "userReviewDate": "Apr 23, 2009", "userURL": "http://www.goodreads.com/user/show/1124284-misty", "userReview": "The lass leads a lonely life. She lives in a remote little Norwegian village that is blanketed by a strange, never-ending winter. Her mother refused to name her, and she is largely disregarded by all but her father and her beloved eldest brother, Hans Peter, who seems to the lass to be hiding a deep pain. But when the lass is blessed with the strange ability to be able to speak to animals, her life begins to change. People of all kinds seek her out for help -- and then, so does an isbjorn, a massive polar bear with a trouble and a loneliness of his own. When the isbjorn promises the lass that her family will be wealthy if she will agree to live with him in a remote castle for a year, the lass agrees and finds herself in a strange palace of green ice, waited on by even stranger servants. But the plush surroundings mask a dark secret, and soon the lass must decide to risk everything she has ever wanted for something she never knew she could have, and embark on a fantastic and daunting journey that has the potential to change the world in which she lives in this well-wrought retelling of the tale \"East of the Sun, West of the Moon\".It's hard to write about something when it's either very bad or very good, so this will be a (fairly) short review:There is very little I didn't love about this story.Something to understand about me: I am a tabber. I have a crazy amount of those little post-it flags in just about every color, and as I'm reading I tab things I like or want to be able to find again. There are no tabs in this book -- I flew through it too fast, and was too absorbed to reach for the tabs.Jessica Day George followed her passion and chose to study Norway, and that passion shows. She crafts a story that is layered and has depth beyond what is generally seen in a fairy tale or retelling. The traditional elements are there: the downtrodden heroine who, it turns out, has some pluck; the rags to riches; the fantastic element; the danger and tension; the family dynamics, good and bad, and the sort of \"karmic\" balance -- everything works together to create one of the strongest retellings I've ever read. George's love of Norway and fairy tales help her create a rich and believable base for a story that shines and flows beautifully. Things are well developed and rich. It is very visual and alive, and thoroughly enjoyable. The romance-aspect was enjoyable and not at all creepy, which I was initially worried about.The only drawback for me was that, compared to the rest of the story, the end felt a little rushed and underdeveloped. It wasn't a complete bust by any means, but after so much layering and depth, I would have liked to see that followed through to the conclusion; an opportunity to pack in a bit more oomph was missed, but this should not at all keep you from picking up a copy. Now.The \"Beauty and the Beast\"-esque story that is \"East of the Sun, West of the Moon\" has captured many writer's pens lately, but I have trouble believing that any of the other retellings will top George's.I really didn't mean to write a rave, but sometimes, that's what happens.Bonus materials here, and a brief Teaser Tuesday reading here"}, {"userName": "Shadowshock", "userReviewDate": "Mar 18, 2012", "userURL": "http://www.goodreads.com/user/show/2755358-shadowshock", "userReview": "I had picked up this title because I had read other books on the legend of \"East of the Sun, West of the Moon\", the one I remember the most titled \"The Lady and the Lion\" by Jacqueline K. Ogburn. I loved the story of how slowly the Lady fell in love with her monster and then spent SEVEN years getting him back. That was devotion.This book was an OK read. It started out lovely enough, the description of the main female character and how her life started, the continual winter and the hardships, all this was drawing enough.But after that it didn't seem to go anywhere. The bear came, the youngest daughter went with the bear and the daughter tried to find out what the enchantment was. In some ways, it almost felt like the author had much more description and action laid out but then had to reduce to to just the lines of \"They spent several weeks having dinner together and talking about the various books she had read.\"Because of this, I didn't really feel like I had time to learn about the enchanted bear's personality or get attached to him in any type of manner. He was just... there. So when he did get whisked away by the troll princess I felt no sadness in it. There seemed to be nothing of him to fallen in love with for the main character except that for the fact that he had been a constant presence in her life for the past year and she had cried on his shoulder (as a bear) a time or two). In fact it seemed like she was doing it more for her brother then she was doing it for her own enchanted bear.So when they finally did meet back up in the troll princess's palace, all the sudden hugging, kissing and crying seemed... a bit out of place. What was there to suddenly kiss the man who we've hardly gotten to know about? In fact, I had no idea if he was brave, had a temper, disliked dancing... I knew nothing about him and so felt out of place when the main female character made such a deal about him. This more then anything else made the book a one-time read only for me.And then, just as it seemed like it was starting again... the story ends."}, {"userName": "Gunjan (NerdyBirdie)", "userReviewDate": "Jul 26, 2016", "userURL": "http://www.goodreads.com/user/show/38552452-gunjan-nerdybirdie", "userReview": "This was another light and quick read! Definitely something I needed after some books that I’ve read this month. This book has enchantments! Trolls! Talking animals! Talking winds! More talking animals! And the writing style was great! Personally, I think if I were to ever reread this book again, I’d listen to it on audiobook because the author does such a great job of writing this is a fairytale tone. I really like her writing style. Also, best acknowledgments that I’ve read in a while: \nThis book was made possible by the letter “ø.”\n Hehe, that was funny (and mostly true). I thought the pika was a great female lead. She did naturally what I think I would’ve done in her place. But she learned from her mistakes, and she was strong and determined to do what was right. “That is because you are nothing more than a foolish human child,” the west wind retorted.“And you are nothing more than a rude little breeze, blowing sand in my eyes and quivering,” the lass snapped back. She had not come this far just to be turned away by a wind. You go, pika!Putting things together and seeing how everything connected was really interesting. I liked the isbjørn and Rollo a lot. And I want an older brother like Hans Peter! A really enjoyable story with great characters and writing style throughout. Pick up this book if you want to read something light and fairytale-ish! I think this should be read as an audiobook though, just because the writing style felt really nice to listen to."}, {"userName": "Colleen Houck", "userReviewDate": "May 28, 2010", "userURL": "http://www.goodreads.com/user/show/1163228-colleen-houck", "userReview": "A sweet rendition of the classic fairy tale. Enjoyed the read."}, {"userName": "Lara Mi", "userReviewDate": "Jun 02, 2016", "userURL": "http://www.goodreads.com/user/show/21924792-lara-mi", "userReview": "“Never look back, never forget.” \nWhen a great polar bear offers her family fortune in exchange for her living with him for a year, the lass, who had never been given a name, agrees. Not only is the polar bear and his palace of ice more than what they seem, they also hold secrets over the curse that has been laid on the lass’ oldest brother. In order to save her brother, friends and the great polar bear, the lass must now solve the riddles of the ice palace and travel east of the sun and west of the moon. This was the first time I read a book that was recommended to me by someone on Goodreads. It was a fun book to read and kept me well entertained – there were several times where I did not want to stop reading. After finishing the book, I found that my thoughts on this tale can be put into likes and dislikes quite easily. What I really liked was the winter atmosphere. The book was set in a Norway where winter never ends and one could tell that the author did research and added several nice details. It gives the whole book a cultural touch rather than being a fairy tale set somewhere in Europe where the actual setting would be interchangeable. One of the strongest points of this book was the mystery. I think the author did a great job with building up to the mysteries – solving them slowly and adding new ones timely. It was really the mystery that made me want to keep on reading. It was great how the author kept coming back to little things and giving them importance later on. I had mixed feelings about the characters. It seemed as though characters were either good or bad – I did not feel as though there were any complex character traits. That being said, I think the lass’ oldest brother, Hans Peter, was probably the most complex of them and I liked him the most. In fact, his story was more exciting than the lass’ own adventure. I am glad that the author worked with both of their stories at the same time as I might have enjoyed it less otherwise. The relationship between the lass and Hans Peter was endearing. Right from the early chapters down to the last – I just loved these two siblings. And I am almost sorry to say that I felt that they had the greatest bond. The romance of this story was totally lost on me. I felt a closer family connection than the one between the lass and the one she loves. Her interest in her loved one seemed awfully sudden. I did not feel as though there was any interaction between the two that seemed romantic in any way. I think that was my biggest disappointment; I really was hoping for a nice romance for the lass. It is a little hard going into what I did not like without spoiling anything but; I did actually like the lass’ prince. His character only seemed to come through towards the end and I did like what I saw. But that was it, there was too little of him and too late to make much use of. I generally felt that the later chapters of the book were less detailed and almost seemed rushed. I also felt as though there were plot holes. Okay, calling them plot holes might be saying a bit much but there were a few things where I would have loved a better answer for; what exactly is troll magic and why is it so bad? What really happened to all the servants? Where were they taken from? How did Hans Peter escape? How did the polar bear get involved? What became of the old women once everything was over? There are so many things I still would have liked an answer to. Sadly, all I can do is guess. I also thought that the lass’ brother, Askel, and their mother were horrible characters. To the end, I hoped that they would learn a lesson or two – but for all we see, they don't. And that was disappointing. It is not that they were evil like the trolls, but their behaviour was infuriating – it was so frustrating that no one ever stood up to them.But all of that aside, this was a very nice fairy tale and a great read for when it is cold outside. If there had been a tad more romance I probably would have loved it. But then, the mystery and family ties around it made it a very worthwhile read."}, {"userName": "Hazel West", "userReviewDate": "Oct 13, 2012", "userURL": "http://www.goodreads.com/user/show/6747285-hazel-west", "userReview": "Thoughts on the Overall Book: I've never not liked one of Jessica Day Geroge's books and this one has turned into a new favorite. It was just lovely in every way her stories usually are and was a very enjoyable read.Cover--Yea or Nay: I do like the cover, it's not bad, but it's not super interesting either nor does it look like the girl. I think it should have the ice palace instead.Characters: The Lass, as she is named (or not named really) is a lovely character, and very typical to Jessica's heroines. They are always heroic when they need to be, but never have an attitude and and very kind and quietly strong. I personally like when the reader never knows the name of the character; it's an interesting ploy, and where I can see how some people might find it annoying, I think it's oddly poetic. Especially in fairy tale like books. I guess it wouldn't work for everything. I also always love Jessica's heroes. And I LOVED the Lass's older brother Hans Peter. He was a tortured character done right, and I just loved his obvious love for his little sister, pretty much being the only one who paid her attention. Her mother and father weren't terrible, in fact, I liked her father, he was just busy, but her mother was always wanting more and ill contented and stuck up on one of their other brothers who was really a jerk. And then of course, I loved the Bear (Asher, as we find out his name is) I loved the slight Beauty and the Beast feel to this story, and while not as angry as the Beast, he was still another tormented, slightly brooding hero who was done right and not all annoying and lame. The trolls were gross and fun to hate, and of course I loved The Lass's pet wolf Rollo. He was adorable :) In short, a typically lovely cast!The Romance: Very sweet and subtle as Jessica's books are wont to have. Not only did we get to see the Lass's romantic plot line but I also liked the one for her brother too.Writing Style: As always, Jessica Day George gives us a fantastic retelling with such lovely writing that pulls the reader immediately into the story and the plight of the characters. I have always instantly fallen in love with her characters because she has such an easy and human way of describing them. And the language always sounds so much like traditional fairy tales too, like something you can easily read aloud. I'm not as familiar with this story as others but it seems like a good rendition of it, and I loved it very much.Accuracy/ Believability: Not applicable.Problems/What bothered me: Nothing to report!Conclusion: 5/5 stars. I always enjoy reading her books and I really hope she writes more retellings because they are always so good!Recommended Audience: Girl read ages 13 and up. If you like retellings, definitely give this one a try!"}, {"userName": "Koala", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/5920731-koala", "userReview": "Having read a similar story before, I could roughly guess what the story was about but I was curious as to how this one would be different. And it was indeed different.The story, for me, was very slow-paced and nothing much ever happened. After the first few days \"the lass\" spent wandering around the palace, it gets pretty repetitive. She gets curious, she asks one of the servants, they die. You would think that at some point she would realize that she should STOP asking or find other ways to figure everything out. For all that she wanted to save them, her lack of control over her curiosity brought about their end.Once she had understood the enchantment and set out for her rescue, I thought things would start picking up and she would meet interesting characters on her search. Aside from her first stop, the visit to the winds were nothing but a repetition once again: meet the wind, trick him into sending her off, reach destination, repeat. I am most glad that there were only 4 winds cause I feel like this would have gone on forever otherwise.The ending was quite flat to me too. There was no big climax or intensity when the story resolved. But this could be because I've read a similar story before and knew the ending.Honestly speaking, I lost all interest when I reached her journey with the winds. The only thing that kept me going was that I knew it was coming to an end very soon. I have read re-tellings of stories before and they were quite creative and different. So I doubt that I am highly biased from my knowledge of the story. Their conversations made much much more exciting than any of the conversations in this book. There was also very little character development. I barely felt any empathy with any of the characters and I usually feel connected with at least ONE character in any story I read. Overall, I think this story could have been better written and made MUCH more exciting. The basic plot of the enchanted bear was already there after all. The only thing left to make the story more intriguing was to have more character development. Having them sit and share stories over dinner is fine, but merely including an excerpt of one such story for the reader could have been that little detail that would have kept the readers' interest."}, {"userName": "Sierra Abrams", "userReviewDate": "Feb 04, 2011", "userURL": "http://www.goodreads.com/user/show/4925774-sierra-abrams", "userReview": "This story is about a girl, the youngest in a family of twelve children, a girl with no name. The lass, she is called by her older brother, Hans-Peter. They live in a fantasy version of Nothern Europe, where snow is always falling and the families are always cold. After being effected by the enchantment of a White Reindeer, the lass finds she can talk to animals… And when she has a sudden encounter with a magical bear, called an isbjorn (which literally means ice bear), the lass heads off on a journey with the isbjorn to give her family the freedom and wealth they have always desired – all the while playing a dangerous game with the wicked spell-casters of the Northlands and the bear she comes to love.This story was expertly told. It is original and adventurous. Jessica Day George once again delivers with her excellent writing and ability to retell folklore and fairytales with a spin. This story was originally a Nordic fairytale called “East of the Sun, West of the Moon.” I’ve never read/heard the original story, so I don’t know how close she kept it. However, because of how exciting George’s version was, I want to find a copy of the original fairytale and read it.Again, Jessica Day George writes wonderful fantasy romances while keeping things clean and sweet. I can’t wait to own all of her books – to see them lined up all neatly on my shelf, and to think about the wonderful stories inside of them, knowing they’ll always be a good choice."}, {"userName": "Selena", "userReviewDate": "Sep 12, 2012", "userURL": "http://www.goodreads.com/user/show/3855249-selena", "userReview": "First of all, let me say that I am a sucker for fairy tales. Retellings, stories that are fairy-tale-esque, whatever. I've read a lot of retellings, both for fairy tales I've read and ones I haven't.This retelling was very well done. It kept the fairy tale feel while still feeling like a fleshed out novel. The characters were well-put together well enough, the story fit the chapter-book format without feeling like it was a stretched-out version of something else.My only complaint is that we don't get much characterization of the enchanted bear. He's in the story so little that, but for the fairy tale feel throughout the novel, I know nothing about him and it's a stretch to say that our nameless heroine could fall in love with him.I still enjoyed the book despite this. The writing was good, and the narrator did an excellent job reading for the audio book.If you like fairy tales, particularly those of the Beauty and the Beast variety, you'll probably like this one as well."}, {"userName": "Thomas", "userReviewDate": "Jun 22, 2009", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "I gave this book five stars after reading it a couple of years ago, but now I'm moving it down to four. I don't think it was as great as the other books I've given five stars, why is why I'm lowering its rating.Sun and Moon, Ice and Snow is a retelling of the Norwegian fairytale East of the Sun, West of the Moon. I had never been exposed to the story before, so I can't really compare the two - however, I did thoroughly enjoy this book. Jessica Day George keeps the plot moving without sacrificing key elements of the tale, and it was easy to get lost in her vivid descriptions of the snowy setting.Recommended to anyone who's looking for a solid fairytale retake or a decent young-adult fantasy novel.Want to read more of my reviews? Follow me here."}, {"userName": "Karlyflower *The Vampire Ninja, Luminescent Monster & Wendigo Nerd Goddess of Canada (according to The Hulk)*", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/17243568-karlyflower-the-vampire-ninja-luminescent-monster-wendigo-nerd-godde", "userReview": "In a fairy tale mood as of late.  Sun and Moon, Ice and Snow  suited that mood wonderfully. I'm by no means a fairy tale aficionado, I'm not sure how closely this follows the age old Norwegian tale. I just know that I fell for the characters, for the story that Jessica Day George unfolds within these pages. Pika/Lass is everything I like in my fairy tale heroines: Kind, merciful, strong, brave and selfless. Jessica Day George's language is enchanting, lulling with a glorious lullaby effect. All the creatures are fascinating and interesting in their own right. If you are looking for a fun little fairy tale I highly recommend this one :)"}, {"userName": "Lexie (Books & Tea Leaves)", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/52399802-lexie-books-tea-leaves", "userReview": "Love, love, LOVE this book! Full review to be posted on my blog in the morning :) For now I'm going to get some much needed shut eye!"}, {"userName": "Zainab ALsaffar", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/46329487-zainab-alsaffar", "userReview": "3.5"}, {"userName": "Majo", "userReviewDate": "Aug 17, 2014", "userURL": "http://www.goodreads.com/user/show/30569725-majo", "userReview": "[¿Quién no sentiría curiosidad viviendo en un palacio de hielo con un oso? Aun más cuando su hermano Hans Peter parece tener algo que ver. Y obviamente, dormir con un extraño todas las noches también debe ser perturbador.  (hide spoiler)]"}], "description": "\"Blessed\" or \"cursed\" with an ability to understand animals, the Lass (as she's known to her family) has always been an oddball. And when an isbjorn (polar bear) seeks her out, and promises that her family will become rich if only the Lass will accompany him to his castle, she doesn't hesitate. But the bear is not what he seems, nor is his castle, which is made of ice and inhabited by a silent staff of servants. Only a grueling journey on the backs of the four winds will reveal the truth: the bear is really a prince who's been enchanted by a troll queen, and the Lass must come up with a way to free him before he's forced to marry a troll princess.", "title": "Sun and Moon, Ice and Snow", "url": "http://www.goodreads.com/book/show/1210754.Sun_and_Moon_Ice_and_Snow", "average": 3.97, "cover": "https://images.gr-assets.com/books/1317065700l/1210754.jpg", "reviews": 1928, "authors": [{"url": "https://www.goodreads.com/author/show/359109.Jessica_Day_George", "name": "Jessica Day George"}], "type": ["Fantasy", "Young Adult", "Fantasy", "Romance", "Retellings"], "outlinks": ["http://www.goodreads.com/book/show/1210754.Sun_and_Moon_Ice_and_Snow", "http://www.goodreads.com/book/show/6443645-sun-and-moon-ice-and-snow", "http://www.goodreads.com/book/show/12576693-sun-and-moon-ice-and-snow", "http://www.goodreads.com/book/show/10692379-sun-and-moon-ice-and-snow", "http://www.goodreads.com/book/show/17287093-sun-and-moon-ice-and-snow", "http://www.goodreads.com/book/show/12576690-sun-and-moon-ice-and-snow", "http://www.goodreads.com/book/show/3697927-princess-of-the-midnight-ball", "http://www.goodreads.com/book/show/669570.Dragon_Slippers", "http://www.goodreads.com/book/show/7199667-princess-of-glass", "http://www.goodreads.com/book/show/2208744.Dragon_Flight", "http://www.goodreads.com/book/show/10508431-tuesdays-at-the-castle"]}