{"ratings": 104062, "userreviews": [{"userName": "Jim", "userReviewDate": "Sep 06, 2010", "userURL": "http://www.goodreads.com/user/show/1448125-jim", "userReview": "Mostly more of the same as Freakonomics with riffs on Malcolm Gladwell's books thrown in. The glaring difference is the chapter on climate change which attempts to go waaay beyond the author's expertise in behavioral economics and contains unfortunate misrepresentations of climate science. For a detailed critique, I'd recommend: http://www.ucsusa.org/global_warming/... Still, there's no denying that convincing the public to recognize the need to curb CO2 emissions is an almost impossible task. Also, there's a laughable line about how Congress undid the repeal of the estate tax for 2010. Apparently, the authors had a deadline to meet and tried to predict that the Senate would behave rationally! All in all, I'm starting to think that behavioral economics is better at explaining after the fact than predicting."}, {"userName": "Petra X", "userReviewDate": "Apr 14, 2014", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "All the chapters in this book start with 'How is' and then two subjects are compared or contrasted, so in this spirit I ask, How is a follow-up book like a Shepherd's Pie?Because shepherd's pie is made with the bits of meat discarded or not finished at a previous meal. And so it is with this book. Chapters not good enough to make it into the superb Freakonomics: A Rogue Economist Explores the Hidden Side of Everything have been recycled into this book. It's ok, but like anything that isn't first-choice, it's not got that wow factor, amaze me, tell me all these things about the world I'd never even thought of. More, uh huh, really, yeah, interesting to know...3 stars."}, {"userName": "Caroline", "userReviewDate": "May 06, 2016", "userURL": "http://www.goodreads.com/user/show/6257531-caroline", "userReview": "[TELEVISION, AND THE QUALITY OF LIFE FOR WOMEN IN INDIAMany initiatives have been instigated to improve the lives of women in India, where they are often treated badly, both as children and adults. None of these projects have been very successful. Then American economists Emily Oster and Robert Jensen compared villages with cable television, to those without television. They examined data from a government survey of 2,700 households, most of them rural.In households with television...Wife beating was less tolerated.Parents were less likely to admit to having a preference for male children.Women were more likely to exercise personal autonomy.The families had a lower birthrate (associated with more autonomy and fewer health risks.)They were more likely to keep their daughters in school.MACROECONOMICS\tEconomists' predictions are generally worthless. They have a hard enough time explaining the past, much less predicting the future. (They are still arguing over whether Franklin Roosevelt's policy moves quelled The Great Depression or exacerbated it.)It seems part of the human condition to believe in our own predictive abilities - and, just as well, to quickly forget how badly our predictions turned out to be.SPORTY WOMEN ARE SUCCESSFULBetsey Stevenson discovered that girls who play high-school sports are more likely to attend college and land a solid job, especially in some of the high-skill fields traditionally dominated by men.SELLING HOUSES BY YOURSELF ON THE INTERNET V SELLING VIA A REALTOR (ESTATE AGENT.)With the latter you pay a commission of about $20,000 on a $400,000 house, and research shows that there are very few benefits. If you do it yourself you must do it on the internet - on a website specialising in selling houses. Paying to do that costs just $150....but you have to do all the work yourself. Houses sold directly on the internet take an average of an extra 20 days to sell.A third way is flat-fee real estate agents, and they are even MORE expensive than realtors.BABY FORMULA MILKThe introduction of this allowed thousands of women to get right back into work.FEMALE TEACHERS100 years ago this was one of the few non-menial jobs available to women. At the time,6% of all working women were teachers, and by a large margin it was the choice of female college graduates. 55% of all college-educated female workers in their early thirties were employed as teachers.Soon afterwards opportunities for smart women began to multiply, and they could enter law, medicine, business and finance....and there was a brain drain from teaching, and standards dropped.WOMEN EXECUTIVES Research has shown that gender discrimination plays only a minor role in holding women back. Women take far fewer finance courses - and all being equal, there is a strong correlation between a finance background and career earnings.Women also work fewer hours than men. A study of people completing their MBAs showed that women in the study worked 52 hours a week, whilst the men worked 58 hours a week. The big issues seems to be that women love children.Women with no children work 3% less hours than men.Women with children work 24% less hours than men.Women also take more career interruptions than men. After 10 years in the workforce...10% of men with MBAs went for 6 months or more without working.40% of women with MBAs went for 6 months or more without working.HIGH STATUS CONFERS LONGEVITYEven amongst those nominated for the Nobel Prize. Winners live longer than those who have just been nominated but don't win.People voted into The Baseball Hall of Fame outlive those were were narrowly omitted.----------------------------------CANCERChemotherapy helps with leukemia, lymphoma, Hodgkin's disease and testicular cancer....but in most cases it is pretty ineffective. There is a long list of cancers where chemotherapy has zero effect....multiple myeloma, soft tissue sarcoma, melanoma of the skin, and cancers of the pancreas, uterus, prostate, bladder, kidney, breast and lung. (Some oncologists argue that with these types of cancer chemotherapy helps one out of ten people.)So why is chemotherapy used so much?*Oncologists are amongst the highest-paid doctors.*They typically derive more than half their income from selling and administering chemotherapy drugs.*If they give a lung cancer patient an extra 2 months to live (when he only expected to live 4 months), on paper this will look an impressive feat. 'The doctor extended the patient;s remaining life by 50%.'There has been little difference in how many people die of cancer in the last 50 years. The age-adjusted mortality rate for cancer is essentially unchanged over the past half-century.BUT.....Over the same period age-adjusted mortality for cardiovascular disease has plummeted. From nearly 600 per 100,000 to beneath 300.THEREFORE...Many people who in previous generations died from heart disease are now living to die of cancer instead. So the statistics are better than they initially look.Cancer death rates are falling amongst younger people:People 20 or younger - mortality has fallen by over 50%People 20 - 40 - Mortality has fallen by 20%.This is an especially good result, as incidents of cancers in this age group have been rising. (Probably due to diet, behaviours and environmental factors.)-----------------------------HEART DISEASEDeaths from heart disease have fallen substantially over the past few decades. Expensive treatments like grafts, angioplasties and stents have only had a very small impact.The decline has come rather from the success of medications which treat high cholesterol and high blood pressure. This accounts for half the drop.Much of the remaining decline has come from ridiculously cheap treatments like asperin, heparin, ACE inhibitors and beta-blockers.HORSE TRAFFIC ACCIDENTS IN NEW YORK IN 1900 VERSUS CAR TRAFFIC ACCIDENTS IN NEW YORK IN 20071900 - Horse accidents claimed the lives of 1 out of every 17,000 residents.2007 - Car accidents claimed the lives of 1 out of every 30,000 residents.= People were nearly twice as like to die in 1900 from a horse accident than from a car accident today.THE LAW OF UNINTENDED CONSEQUENCES IS OFTEN SEEN WHEN GOVERNMENT LEGISLATION IS PASSED.eg governments who have tried to reduce trash by charging people for extra bags of trash.1) Some people just stuff their existing bags more and more full (a tactic now known by trash officers around the world as \"Seattle Stomp\".2) Others just dump their trash in the woods.3) In Germany, trash tax-avoiders flused so much uneaten food down the toilets that the sewers became infested with rats.4) A new garbage tax in Ireland generated a spike in backyard trash burning. St James's Hospital in Dublin recorded a near tripling of patients who had set themselves on fire while burning trash.FORCEPSThese can save lives if a baby is stuck in the birth canal.They are thought to have been invented early in the 17th century by an obstetrician called Peter Chamerlen. They worked so well that Chamberlen kept them a secret, sharing them only with sons and grandsons who continued in the family business.It wasn't until the mid-18th century that they passed into general usage. The surgeon Atul Gawande says that millions of babies' lives were lost as a result of this hoarding.DIRTY TIESDoctors should be forbidden to wear ordinary ties, as these collect pathogens and are rarely laundered. Instead doctors should wear bow ties.NITRATE FERTILIZERSThese are astonishingly cheap and effective. They feed our world. If we lost them we would only have fruit and animal products on special occasions, or they would only be eaten by the rich.WHALE OIL AND OIL UNDERGROUNDIn the 19th century whales were the economic engine that helped turn the USA into a powerhouse. Every inch of whales could be used. Most valuable was whale oil, a lubricant for all sorts of machinery but also for lamps. In the 19th century there were 900 whaling ships, 735 of them were in the USA.1835 - 1872 An average of 7,700 whales a year were killed. It was the fifth largest industry in the US.Then the industry was exhausted through over-whaling, and it begun to fail. That is when a retired railway man called Edwin L Drake, using a steam engine to power a drill through 70 feel of shale and bedrock, struck oil in Titusville, Pennsylvania.The new oil industry provided work for unemployed whalers, and it saved whales from near-certain extinction.CHANGING PEOPLE'S BEHAVIOUR IS HARD WORK/SEAT BELTSFor instance the introduction of seat belts in cars. These were initially thought of by Robert McNamara, who worked for The Ford Motor Company.Congress began setting federal safety standards in the mid-1960s, but even 15 years later seat belt usage was laughably low - just 11%.Over time the numbers crept up, thanks to a variety of nudges.1) The threat of a traffic ticket2) Expensive public awareness campaigns.3) Annoying beeps and dashboard lights if the belt wasn't buckled.4) And eventually, a societal acceptance that wearing a seat belt wasn't an insult to anyone's driving ability.Seat belt usage in 1985 - 21%Seat belt usage in 1990 - 61%Seat belt usage in 2009 - Over 80%In fact seat belts reduce the risk of death in traffic accident by as much as 70%, and at about $25 each, are one of the most cost-effective life saving devices ever invented.COWS, SHEEP AND METHANERuminants - cud-chewing animals - are wicked polluters. They do this via exhalation, flatulence, belching and their manure.Methane is 25 times more potent as a green house gas than carbon dioxide released by cars (or humans.) The world's ruminants are responsible for about 50% more greenhouse gas than the entire transport sector.Possible solutions:* Shift away from eating red meat to eating chicken, fish, eggs, or a vegetable based diet. This does more to reduce greenhouse gases than eating locally-resourced food.* Eat kangaroo meat - they produce much less methane. In fact Australian scientists are trying to replicate the digestive bacteria in kangaroos' stomachs so it can be transplanted to cows.....GLOBAL WARMING HEROESAl Gore is usually held up as a marvellous campaigner for global warming issues, but the authors of this book think a lot of his ideas are wrong. Instead they promote Nathan Myhrvold, and his Budyko's Blanket (A plan to put sulfer dioxide into the stratosphere), which they believe could reverse global warming.http://greenmanblog.com/?p=251GLOBAL WARMING AT THE POLESGlobal warming is largely a polar phenomenon. High latitude areas are 4 times more sensitive to climate change than the equator.\n(hide spoiler)]"}, {"userName": "Ryan Melena", "userReviewDate": "Apr 10, 2011", "userURL": "http://www.goodreads.com/user/show/4838339-ryan-melena", "userReview": "Ugh, pop culture trash masquerading as economics (in turn masquerading as hard science).There were so many glaring flaws in the authors' assumptions, \"logic\", and conclusions that within just the introduction they had already lost all credibility.Right up front the authors declare that fears about global warming are overblown because the issue will likely be solved by technological innovation and then offer as proof the fact that cars eliminated the problems caused by horse-based transportation. So, you know, don't worry everyone we're sure to have a \"solution\" to global warming with even larger negative externalities any day now! That's not even taking into account more subtle problems with the \"we always innovate our way out of problems\" argument like survivorship bias, or the assumption that human ingenuity is unbounded, or the assumption that we'll recognize pending catastrophes in time to act, or the assumption that global changes will be politically acceptable on a global level, or the complete disregard for loss of life while waiting for the technological solution, etc.I quickly concluded that this book wasn't worth the effort to finish."}, {"userName": "Trevor", "userReviewDate": "Jan 29, 2010", "userURL": "http://www.goodreads.com/user/show/175635-trevor", "userReview": "I liked this book more than I expected I would like it and liked it more than their previous effort – but have given it less stars this time than the last one. The reason for this is that their last book introduced me to the whole field of behavioural economics and one is always fond of books that introduce entire new fields.I had some real problems with some of the contents of this book – or rather, not the contents so much as the underlying philosophy. There is a lack of consistency of thought behind this one that is quite startling. Look, I’m more than happy to go with the whole Walt Whitman thing about being large and complex beings and therefore admitting of contradictions, but only so far.The underlying premise of this one is that people respond to incentives. The problem is that people don’t necessarily respond to incentives in the ways that we might expect. As a theme this is utterly fascinating (although a much better book on this subject is Predictably Irrational: The Hidden Forces That Shape Our Decisions). The problem with this book is that the thinkers here aren’t able to hold an idea like that in their heads the whole way through and to see where their examples illustrate that idea and when their examples contradict that idea. What the lesson of this book ought to have been.The world is a very complex place. We learn rules and laws and tendencies of behaviour mostly by holding all the endless numbers of variables more or less equal while fiddling with only one variable at a time. Sometimes this brings great insight, often not – but in trying to understand incredibly complex systems this method of fiddling has the advantage that in holding all other things equal we get an idea of what the particular knob we are fiddling with effects when you turn it. With human behaviour (even economic behaviour) you are always dealing with incredible complexity. However, people tend to behave in ways that are fairly predictable and we can devise experiments that test how they will behave that do hold some of the other variables pretty constant. Some of those experiments say incredibly fascinating things about what it is to be human. But don’t ever forget that people are not simple – they are always complex – and just because you think you have them down pat they are always, ALWAYS capable of surprising you either with how nice they can be or with how bloody appallingly they can behave.If this book had done this and been consistent in having done this I probably would have given it five stars. As you see, I don’t ask much. I don’t think this book really does know what message it truly wants to get across and so it reads like a series of sometimes interesting bits of information that are spat out one after another before they have been properly digested or even properly masticated. The whole thing is a bit of a mess, really, saved only by the inherent interest there is in the subject. This might be best illustrated with an example from the first book where they spoke about the Israeli day care centre that started charging parents for being late – fascinating example of incentives and unintended consequences – but if you want to understand this example then don’t read about it in Freakonomics: A Rogue Economist Explores the Hidden Side of Everything, get hold of Predictably Irrational: The Hidden Forces That Shape Our Decisions. I would have thought that the lesson this book would have wanted to make abundantly clear would be that complex systems respond in unpredictable ways to simple interventions. There may be consistent patterns that we can understand, but overall you are better having an open mind when you come to a new example of incentives and interventions and go back to the data (rather than theories) to judge the effectiveness of particular interventions. And this is the lesson of the book in part – when they are discussing car accidents or drunk walking they do go back to the data. The fact that I think they seem to have misrepresented some of the data and that I would rather they had given more detail to support their views is a little beside the point, at least they were behaving in a way that I could follow, if not necessarily agree with.But when they started solving climate change I figured they had completely lost the plot of their book entirely. I’ve no idea if pumping the upper atmosphere with sulphur really is a low cost solution to climate change (and great if it is), but the authors were so keen to prove their thesis that simple solutions are always best and that governments are congenitally incapable of ever coming up with a simple solution that I’m rather certain most readers of this book will tragically believe that global warming has now been solved by an ex-owner of Microsoft. I mean, if it was someone who had helped set up Apple I might have believed that such a solution to global warming might even exist – but Microsoft??? Don’t be silly. As if simple and Microsoft were words that could reasonably be used in the same sentence. After telling us that the climate is so difficult to understand that we can’t even really model it they then say they have the solution to all our problems and all it involves is a great big bloody hose pumping rotten egg gas into the sky. Like I said, maybe global warming all will be quite so easy to solve – but even so, you are messing with a complex system, you shouldn’t be too surprised if your simple intervention has unpredictable consequences. And what if this intervention is too effective – I know it might only take three years for things to get back to normal, but how are we to survive without food for three years? Do you really want someone from Microsoft pissing around with our climate? It makes my skin crawl that Microsoft have something to do with my computer (and really, in the great scheme of things my computer doesn’t really matter if itcrashes), but leave my planet alone!The part of this book that dealt with the story of a woman being raped and murdered in New York while 38 people watched on was interesting as it showed there was much more to this story than just that people are arseholes. Whenever a story seems a little too pat there is probably going to be more to the story. That they explain that this story is not so simple is probably worth the price of the book. It is a service provided to humanity that the authors deserve to be praised for.The stuff on prostitution was interesting, as was the stuff on Indian women and television. I quite liked the stuff on how to get doctors to wash their hands – but what was most interesting about many of these examples was that they were about finding ways (incentives) to change a culture and that often the way found was cultural rather than financial – that is a lesson you will find much easier to learn and understand from reading Predictably Irrational than it is to get from this book. And why? Well, I can only assume it is because it is a lesson the authors here have not quite learned themselves yet.I’ve made it as plan as I can – this book has a couple of interesting examples, but very few interesting insights. If you want to read a book that actually will do what this book promises to do – that is, change the way you see the world – then don’t read this, read Predictably Irrational: The Hidden Forces That Shape Our Decisions."}, {"userName": "Lyn", "userReviewDate": "Jul 18, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "Those renegade, cold blooded micro economists are back for more fun filled worldly observations and scathing attacks on the status quo. This time around the pair explore the economics of the worlds oldest profession and the myths and realities of global warming. Makes me want to consider the incentives of most every occurrence and transaction. Levitt is on to something pretty cool here."}, {"userName": "Ann", "userReviewDate": "Jan 16, 2010", "userURL": "http://www.goodreads.com/user/show/638033-ann", "userReview": "TABLE OF CONTENTS (close to verbatim):Intro--In which the global financial meltdown is entirely ignored in favor of more engaging topics:the perils of walking drunkthe unlikely savior of Indian womendrowning in horse manurewhat is freakonomicstoothless sharks & bloodthirsty elephantsthings you always thought you knew but didn'tChapter 1--In which we explain the various costs of being a woman:LaShanna, part-time prostituteOne million dead \"witches\"The many ways in which females are punished for being born femaleEven Radcliffe women pay the priceTitle IX creates jobs for women; men take them1 of every 50 women a prostituteThe booming sex trade in old-time ChicagoA survey like no otherThe erosion of prostitute payWhy did oral sex get so cheap?Pimps vs. Realtors (pimpact vs. rimpact)why cops love prostituteswhere did all the schoolteachers go?what really accounts for the male-female wage gapdo men love money the way women love kids?can a sex change boost your salary?meet Allie, the happy prostitute; why aren't there more women like her?Chapter 2--In which we discuss compelling aspects of birth & death, though primarily death:the worst month to have a babythe natal roulette affects horses toowhy Albert Aab will outshine Albert Zyzmorthe birthdate bulgewhere does talent come from?some families produce baseball players; others produce terroristswhy terrorism is so cheap & easythe trickle-down effects of Sept 11the man who fixes hospitalswhy the newest ERs are already obsoletehow can you tell a good doctor from a bad one?\"bitten by a client at work\"why you want your ER doc to be a womana variety of ways to postpone deathwhy is chemotherapy so widely used when it so rarely works?\"we're still getting our butts kicked by cancer\"war: not as dangerous as you think?how to catch a terroristChapter 3--In which people are revealed to be less good than previously thought, but also less bad:why did 38 people watch Kitty Genovese be murdered?with neighbors like these...what caused the 1960s crime explosion?how the ACLU encourages crimeLeave it to Beaver: not as innocent as you thinkthe roots of altruism, pure & impurewho visits retirement homes?natural disasters and slow news dayseconomists make like Galileo & hit the labthe brilliant simplicity of the Dictator gamepeople are so generous!thank goodness for \"donorcycles\"the great Iranian kidney experimentfrom driving a truck to the ivory tower: John List,economistwhy don't real people behave like people in the lab?the dirty rotten truth about altruismscarecrows work on people tooKitty Genovese revisitedChapter 4--In which big, seemingly intractable problems are solved in surprising ways:the dangers of childbirthIgnatz Semmelweis to the rescuehow the Endangered Species Act endangered speciescreative ways to keep from paying for your trashforceps hoardingthe famine that wasn't300,000 dead whalesthe mysteries of poliowhat really prevented your heart attackthe killer carthe strange story of Robert McNamara (seatbelts at Ford)let's drop some skulls down the stairwellhurray for seatbeltswhat's wrong with riding shotgun?how much good do car seats do?crash-test dummies tell no lieswhy hurricanes kill and what can be done about itChapter 5--In which we take a cool, hard look at global warming:let's melt the ice cap!what's worse: car exhaust or cow farts?if you love the earth, eat more kangarooit all comes down to negative externalitiesTheClub vs. LoJackMt Pinatubo teaches a lessonthe obscenely smart, somewhat twisted gentlemen of Intellectual VenturesAssassinating mosquitoes\"Sir, I am every kind of scientist!\"an inconvenient truthinesswhat climate models missis carbon dioxide the wrong villain?big-ass volcanoes and climate changehow the cool the earththe \"garden hose to the sky\"reasons to hate geoengineeringjumping the repugnance barrier\"soggy mirrors\" and the puffy-cloud solution (over water)why behavior change is so harddirty hands and deadly doctorsforeskins are fallingEpilogue--Monkeys are people toomicroeconomics experiment teaching monkeys to use moneyprice shocks & income shocksgambling: loss aversioncrime paysprostitutionfear of damage to monkey social structure ends experiments"}, {"userName": "Michael ", "userReviewDate": "Apr 01, 2010", "userURL": "http://www.goodreads.com/user/show/1282203-michael", "userReview": "Does anyone actually believe this crap?The first chapter (about the economics of prostitution)in this one was way better than the entire Freakonomics. As a result, I had faith that the authors would stick more to their field. As it turns out, they get more and more ridiculous as the book progresses, finishing off with a pair of shitshows. I'm still trying to figure out if the global cooling chapter and the monkey chapters are jokes. What bothered me most about the global cooling chapter wasn't so much the views the authors develop but that they were trying to influence people on something they seem to know little about. While earlier in the book, they explain how economics has expanded to \"social economics\" (a.k.a. sociology, political science and psychology), they never really explain why economists suddenly can become scientists. Why didn't they stick to the economics of global climate change? That would have been just as interesting and more their field. Instead, they take it upon themselves to select a handful of \"geniuses\" who have found simple solutions to a complex problem. Entertaining? Yes. Funny? Yes. Interesting? Often. Legitimate? Hell no."}, {"userName": "Yousif Al Zeera", "userReviewDate": "Aug 21, 2012", "userURL": "http://www.goodreads.com/user/show/12086858-yousif-al-zeera", "userReview": "This book is even better than Freakonomics. The amount of insights and information (from different fields) you get exposed to is incredible. I am liking \"economics\" much more after reading their books (Levitt and Dubner)."}, {"userName": "Jesse", "userReviewDate": "Aug 28, 2011", "userURL": "http://www.goodreads.com/user/show/795733-jesse", "userReview": "the first few chapters were just a continuation of the first book in terms of ideas, tone and excecution; thus, i was feeling pretty satisfied that i was reading such a book and becoming more of a \"cold-blooded economist\", than a \"warm-blooded humanist\" (or whatever condescending, self-congratulatory phrases they used were). and then these guys got derailed, in a very sad, strange and self-defeating way. they did this weird about face, where in one chapter they talk about the law of unintended consequences and then - in the very next chapter - they talk about solving global warming (the phrase they consistently used, instead of the more accurate global climate change) by spraying sulphur dioxide into the stratosphere. seriously. and after i picked my jaw up off the floor - because i mean talk about unintended consequences - i listened to them list there reasons why this would be a good idea and why other people (you know actual climate scientist, as opposed to inventors and economists) were afraid of this idea because of some ingrained dogma. and they did all this while consistently misrepresenting facts, stating easily falsifiable quotes without challenge, and dissing al gore, noble prize winner. did i mention they didn't talk to actual climate scientists. this was another stange aspect of this chapter: while in other sections they used large amounts of data to come to their conclusions, in this chapter they talked with the folks at \"intellectual venture\" and presented everything they said as truth without: 1)checking their statements for factual accuracy, 2)checking for logical fallacies and specious arguments, or 3) talking with a disinterested or antagonistic party to try and understand the full scope of the idea. if i took their chapter at face value, i would think that the solution for global climate change was simple cheap and without scary consequences, but a real easy (and fast) google search showed me the many mistakes that they made. they started their climate change chapter by presenting the \"gobal cooling scare\" of the 1970's as something that was scientifically agreed upon and reported in trade journals, when in reality (again, a quick google search) there were publications in popular magazines (with natgeo being the most \"scientific\", but not exactly peer-reviewed), and scattered papers that were never conclusive and there was nothing even close to the scientific consensus that we have today about human induced global climate change. the story about cooling in the 70's is something you hear alot from global warming skeptics, which is concerning when you read it in a book by so-called \"cold-blooded economists\", a simple look at the meta-analysis will show you there was no scientific conclusion about the 1970's \"global cooling\". this chapter made me pause, and wonder about the whole freakonomics phenomenon. when i read the first book, i was astonished at how many things they discovered that were caused by simple adjustments to human incentives, or were just sitting there in the data the whole time and they were the ones smart enough to find the pattern. but now it makes me wonder how much of their \"data\" and \"conclusions\" were just a presentation of one side of the arguement. because just the way they use the phrase \"cold-blooded economist\" makes it sound like if you don't agree with their conclusions it must be because you are irrational and don't see the workd for what it really is: one large incentive experiment (which i don't wholly disagree with). but maybe the authors are missing their own incentives: having a new york times bestseller and becoming known for irreverant, yet spot on conclusions that others just \"fail to see\" - these are very strong incentives. just look at james frey, people will do alot to be famous and be seen as a genius. i'm not saying that this is what they did, just that if i learned anything from these books, it is to find out where the incentives come from and there you will usually find your causation. maybe the pressure to live up to the success of their first book got to them, or maybe they wanted to try and show how you could solve the world's biggest problem with a simple, cheap solution. or maybe, against all odds (and most climate scientists) they actually believe all that they wrote to be true. but i can't see how people this intelligent would take a problem this complex and ignore the power of unintended consequences – of which they just wrote – and take the word of just one company (for-profit, I might add), consult zero climate scientists and pretend that they have some sort of actual solution to climate change. following incentives on this one, it’s hard to conclude anything else but a selfish desire to appear clever, forward-thinking, and best-selling - and using a seriously dangerous problem to do so. and this is sad, from two guys who really can do great work."}, {"userName": "K", "userReviewDate": "Jun 19, 2010", "userURL": "http://www.goodreads.com/user/show/13779-k", "userReview": "A reluctant 3 stars. I'll give this book the benefit of the doubt and say that it probably would have worked better for me had I read it rather than listening to it. While I love the fact that audiobooks allow me to multi-task, it means that I'm less focused when I'm listening to them. That's fine if it's a book like Savannah Blues but this book demanded more concentration, especially since the writing style was highly tangential to begin with.Those who read “Freakonomics” are familiar with what the authors offer: a conglomerate of light, entertaining facts which offer new ways of looking at things, generally falling under the umbrella of studying the way people respond to incentives, a.k.a. behavioral economics. “Freakonomics” was probably the first book of its kind that I read and I enjoyed it thoroughly; I have since discovered Malcolm Gladwell and no longer find this genre particularly novel although that doesn't diminish my enjoyment.In fact, there were some interesting and entertaining tidbits here -- the career path of a successful self-employed call girl, the truth behind the \"38 bystanders\" of Kitty Genovese's murder (a fundamental topic when I studied social psychology – who knew that the facts were misreported?), experiments with teaching monkeys to value currency, etc. Unfortunately some of the other topics bored me, particularly when the authors focused less on behavior and more on science (e.g., global warming and global cooling). The authors often lost me in part because of my own distractibility while listening, but I found that it was hard to come back once I did lose focus. I highly recommend the first Freakonomics: A Rogue Economist Explores the Hidden Side of Everything book. Though there's room to quibble with a lot of the authors' claims, it's provocative and entertaining reading. There were moments where this one lived up to the standard set by the first, but overall I can't recommend it with the same enthusiasm."}, {"userName": "The Book Whisperer (aka Boof)", "userReviewDate": "Oct 17, 2009", "userURL": "http://www.goodreads.com/user/show/1253478-the-book-whisperer-aka-boof", "userReview": "From monkey prostitution to raising a terrorist......I found this book interesting, frustrating, fascinating and infuriating (mostly at the same time). The duo that brought  Freakonomics  with answers to why drug dealers live with their mothers and how the name that your parents gave you can determine which job you end up getting have now given us  Superfreakonomics. To rogue economists or mad scientists this books meanderings may be make perfect sense, but to the likes of me I had a job trying to fathom how we got from one subject to another and then back to the original one at times. It almost seemed like a couple of kids that get so excited about their school project that they just want to tell you everything all about it all at once. That said, some of the themes and questions posed I found fascinating: Why should suicide bombers buy life insurance? Why is May the worst month for a baby in Uganda and Michigan, USA to be born? How did 9/11 start the trickle down effect of the credit crunch? Why could eating kangaroo meat help save the planet? Why did 38 people watch Kitty Genovese be murdered and say nothing? When I read Freakonomics a few years ago I gave it 2 stars. It attempted to tell us that teachers cheat, estate agents lie and black kids are usually given different names to white kids. You don't say! After having read this second offering I have decided to accept it for what it is - fun and light entertainment. Some of the findings are really fascinating and some are pretty banal and even confusing (the global warming section had my eyes glazing over). However, to end on a positive note, the epilogue was genius! If you have ever wondered if monkey prostitution exists, wonder no more....."}, {"userName": "Ron", "userReviewDate": "Jan 24, 2012", "userURL": "http://www.goodreads.com/user/show/1256262-ron", "userReview": "An interesting dog's breakfast of apparently unrelated essays supposedly on microeconomics, though the chapter on global warming ended up almost entirely on \"global\" issues. One gets the impression they wrote a bunch of columns for a newspaper, say the New York Times, then decided to cash in on the fame of their previous book by publishing the essays together. Oh. That's what they did!That global warming chapter \"What to Al Gore and Mount Pinatubo have in common?\" is the best in the book. No, the answer is not because both spouted a lot of hot air; it's \"Gore and Pinatubo both suggest ways to cool the planet, albeit with methods whose cost-effectiveness are a universe apart.\"The cost-effectiveness ration of the $40 asking price is out of whack, too, but I found it on the \"80% off table\". At $8 it's lots of fun."}, {"userName": "Paul", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/1783298-paul", "userReview": "The basic premise of this book is simple: to apply economic principles and methodology to understand the reasons why people do the things they do (or as the authors call it, the incentives behind behavior).Or, as the authors paraphrase Gary Becker on page 12, the \"economic approach.\" That being said, it is very similar to their first book, which I also read. This one builds upon it in that it goes on to explain more cases of things that seemingly have no connection or common theme, but in fact do once you look a little deeper. They use the same processes as any other data-driven field of study: they make a few guesses, do an experiment or ten (or get others to do it), collect data, analyze the data, and then revise their initial guesses in light of what the data says. The book is a fun, quick, and for the most part easy read. If anything it'll make you think a bit more about why people do the things they do, at least in a more \"economic\" sense. When they use jargon, they do so sparingly, and they always either include an explanation or use the context of what they are discussing in order to explain the concept to the reader. They try not to get too technical or complicated in their explanations for anything, and when they do, they almost always include a separate \"this is what we're trying to say\" way of explaining it. They realize who their audience is (non-economists), and do their best to keep our attention and focus on what they're saying. Most important of all, though, is that they include their sources in the endnotes - their own studies and the sources and studies of others who they included in the book. This is important because while they are writing for a more general, non-economist audience, they also know that they need to show their sources so people who are interested can follow up. More than that, though, is the fact that all of this is legitimate research that has been used by other organizations and institutions (including the government), and thus is subject to peer review and analysis. So their inclusion of their sources indicates that while the book may seem a bit... silly... at times, it is really a well-written cover for some serious research and investigation. This, I might add, is a bit more of the journalistic side of the book - taking the hard to understand stuff and distilling it down into something that the rest of us without Ph.Ds in economics can understand, and in this, the authors have done a pretty good job, to say nothing of the investigation and fact-digging and checking that was probably done while this was being written. Some of the reviews on here about this book have said that the authors got this thing right and that thing wrong, and while that may (or may not) be true, the fact is this: they've included their research sources, so if you really do have an issue with them, then it's game on. However, that isn't their aim with this book. While they are using economic principles and methods to explain some rather unusual, non-economic things, they aren't trying to be the end-all source of wisdom. They probably say it best here:\"Many of our findings may not be all that useful, or even conclusive. But that's all right. We are trying to start a conversation, not have the last word. Which means that you may find a few things in the following pages to quarrel with.\"In fact, we'd be disappointed if you didn't.\" (pg. 17)It seems that they're just trying to use their own discipline-specific approach to understand and examine things in a way so that they can be discussed, in order to try and understand why people do the things they do. That's all."}, {"userName": "Brian", "userReviewDate": "Jun 08, 2012", "userURL": "http://www.goodreads.com/user/show/1345508-brian", "userReview": "I enjoyed the original, which, if memory serves had much more cohesive chapters around specific theses. While the chapters treated the topic at hand, they seemed to be much more scattershot in terms of finding a number of correlations in data that \"swirled\" around the main hypothesis of the chapter.As with many reviewers, I think that Dubner and especially Levitt have stepped a little outside their expertise with some of the topics in this book and with the ongoing Freakonomics \"brand,\" particularly their podcast. In my opinion, Steven Levitt is now the major force behind this brand, and the result has been a reduction in academic quality in favor of sensation. There's nothing wrong with that, but it's not where the series started. And whether it is Dubner or Levitt to blame, their forays into natural science have been pretty disappointing. Of course there are the problems with the climate science in this book, but also there have been several episodes of their podcast that have seemed overly credulous, particularly when it comes to \"rogue scientists\" who fit well with the \"rogue economist\" brand. In short, while I always like the popularization of science, whether natural or social, It must be done with care. And I fear that Dubner and Levitt are slowly leaving that caution behind as they pursue their brand."}, {"userName": "Beth", "userReviewDate": "Oct 23, 2009", "userURL": "http://www.goodreads.com/user/show/2568265-beth", "userReview": "I wanted to love it, because I loved Freakonomics. But, alas, I did not. I don't know if they really chose less captivating topics than last time, but it felt like it. Also, if you happen to have read all or several of Malcolm Gladwell's and Atul Gawande's books, and even that Oshinksy book about the history of polio in the U.S., this book will feel largely like something you've already read somewhere else. I think my review might be a bit unfair. Perhaps if you haven't read any of those other books, this one might feel original and interesting. But I bet it still won't feel as interesting as Freakonomics was."}, {"userName": "Mike", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/5912724-mike", "userReview": "I really enjoy reading books that challenge you to question conventional wisdom. If you like Malcolm Gladwell I definitely recommend this book. HOWEVER, many of the topics are covered it Gladwell's books The Tipping Point, Blink, and Outliers, so be prepared to hear some regurgitation (the brutal murder in queens with 38 onlookers who didn't call the cops, how the month you were born greatly affects your ability to play professional sports, and many others that have been covered in other more popular books). Also, many of the statistical conclusions are nothing short of outlandish, for example, telling me that statistically I could drive in a car continuously for 285 years before I would be likely to die in a drunk driving accident. The assumptions leading up to that conclusion are vague and weak. With that caveat out of the way, most of the book was facsinating and it was a very quick read (only 200-ish pages). For example, the accidental death rate for soldiers in the 1980's was larger than the hostile death rates for every year since we've been in Iraq/Afghanistan, therefore, training for war in the 1980's was more dangerous than actually fighting a war, yikes. Also there's an interesting piece on prostitution and how lucrative it used to be, who knew that they made the equivalent of over $100k/year plus medical/dental/education/food/apartment benefits paid for by the brothel owners. Also, definitely look up the group called \"Intellectual Ventures\", they are brilliant minds who believe the best solutions are cheap and simple. I had heard about them before this book but finally decided to look them up, very good stuff. I definitely recommend this book but read it WITH A HUGE GRAIN OF SALT. Nothing should be taken literally or for truth. But I really believe their fundamental premise that \"the laws of supply and demand are often more powerful than the laws made by legislators.\""}, {"userName": "Elizabeta", "userReviewDate": "Apr 05, 2016", "userURL": "http://www.goodreads.com/user/show/41884184-elizabeta", "userReview": "Awesome read!"}, {"userName": "Clif Hostetler", "userReviewDate": "Feb 09, 2010", "userURL": "http://www.goodreads.com/user/show/793473-clif-hostetler", "userReview": "This is a book about decisions, incentives, unintended consequences and statistics showing how conventional wisdom isn’t always wise. The examples given are varied and totally unrelated to each other. The conclusions are not fully documented and the generalizations provided do not recognize exceptions or alternative points of view. If you can get past these issues the book is a lot of fun to read. Reading this book is much the same as listening in on a bull session discussion between two clever comedians who know just enough information to be dangerous. The writing is spiced with puns and humor to keep the reader entertained.I suppose every reader has their own axe to grind or issue to praise from this book. I have too many axes to grind to mention here. However, there is one issue for which I praise the authors, which happens to the issue for which most people are criticizing them. That is their discussion of global warming. I agree with their assertion that efforts to achieve international agreements to limit releases of carbon dioxide require an impossible degree of cooperation to be humanly or politically feasible. The book also indicates that if, by some miracle, such agreements were achieved it would be too late to make any meaning contribution toward preventing global warming. Based on the above premise, the book suggests that the most effective way to reduce global warming is to use geo-engineering methods to directly address the amount of sun energy reaching the earth. The authors then discuss several optional approaches to achieving this goal. Their suggestions may sound a bit crazy. But changing human nature—which would be needed to voluntarily reduce use of fossil fuels—is just as farfetched as their suggestions. The use of fossil fuels will probably decrease in the future because of high prices brought about by limited supply. Unfortunately, this won’t happen in time to prevent global warming. But as this book suggests, there are other options available which can provide time for the world’s economy to transition to renewable energy sources. This type of transition will be pushed by true economic reality, not cap-and-trade rules.The following are some multiple choice test questions that cover some of the issues contained in this book. They provide an indication of the scattered variety of subjects discussed by this book. The questions are copied from Amazon.com. You’ll need to go to the Amazon.com Page for this book to get the correct answers. Question 1: According to Superfreakonomics, what has been most helpful in improving the lives of women in rural India?A. The government ban on dowries and sex-selective abortionsB. The spread of cable and satellite televisionC. Projects that pay women to not abort female babiesD. Condoms made specially for the Indian market Question 2: Among Chicago street prostitutes, which night of the week is the most profitable? A. SaturdayB. MondayC. WednesdayD. FridayQuestion 3: You land in an emergency room with a serious condition and your fate lies in the hands of the doctor you draw. Which characteristic doesn’t seem to matter in terms of doctor skill? A. Attended a top-ranked medical school and served a residency at a prestigious hospitalB. Is femaleC. Gets high ratings from peersD. Spends more money on treatment Question 4: Which cancer is chemotherapy more likely to be effective for?A. Lung cancerB. MelanomaC. LeukemiaD. Pancreatic cancer Question 5: Half of the decline in deaths from heart disease is mainly attributable to:A. Inexpensive drugsB. AngioplastyC. GraftsD. Stents Question 6: True or False: Child car seats do a better job of protecting children over the age of 2 from auto fatalities than regular seat belts. Question 7: What’s the best thing a person can do personally to cut greenhouse gas emissions? A. Drive a hybrid carB. Eat one less hamburger a weekC. Buy all your food from local sources Question 8: Which is most effective at stopping the greenhouse effect?A. Public-awareness campaigns to discourage consumptionB. Cap-and-trade agreements on carbon emissionsC. Volcanic explosionsD. Planting lots of trees Question 9: In the 19th century, one of the gravest threats of childbearing was puerperal fever, which was often fatal to mother and child. Its cause was finally determined to be:A. Tight bindings of petticoats early in the pregnancyB. Foul air in the delivery wardsC. Doctors not taking sanitary precautionsD. The mother rising too soon in the delivery room Question 10: Which of the following were not aftereffects of the World Trade Center and Pentagon attacks on September 11, 2001:A. The decrease in airline traffic slowed the spread of influenza.B. Thanks to extra police in Washington, D.C., crime fell in that city.C. The psychological effects of the attacks caused people to cut back on their consumption of alcohol, which led to a decrease in traffic accidents.D. The increase in border security was a boon to some California farmers, who, as Mexican and Canadian imports declined, sold so much marijuana that it became one of the states most valuable crops.The following is a review from the 2007 PageADay Book Lover's Calendar of an earlier version of Freakonomics which I've also read:Surprise BestsellersThe little idea that could. Dubner is a journalist who in 2003 wrote a New York Times Magazine profile of Levitt, a University of Chicago economist with unorthodox interests. That article became this bestseller, which then became a column in the magazine. What’s so interesting about Freakonomics (besides the name)? Levitt creatively uses economic methods to explain different outcomes in such varied areas as cheating, crime, and parenting. Revolutionary reading. \nFREAKONOMICS: A ROGUE ECONOMIST EXPLORES THE HIDDEN SIDE OF EVERYTHING,\n by Stephen J. Dubner and Steven D. Levitt (William Morrow, 2005)"}, {"userName": "Dhruv Sharma", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/70298156-dhruv-sharma", "userReview": "Educating, entertaining & fascinating!Dubnar & Levitt did it again and much better this time. Its an amazing book and couldn't be better. This book (Series actually of freakonomics& super-freakonomics) helps the reader seeing the word from an economist (or homo economicus) point of view where everything is understood, explained and presented purely based on data. This is one hell of a thing to implement in one's life, and if you do, you always talk about stuff in numbers & by which you effortlessly convince people on your point of view, simply put it in terms of data and they will agree with you.Let me appreciate the author's effort and put further review in terms of quantified measurements:1. Out of 5 chapters 4 were amazing and 1 was above avg. so (20*4+10)=90% of book will keep you glued to it.2. The facts & data presented will educate you on various topics about which usually people have misperception, so 100% educating.3. Author will make you laugh on Avg. every 2 pages even though it is on serious issues so 100% marks on entertainment.4. The social pain areas topics like prostitution, global warming etc. gets your attention and makes the whole read 100% fascinating.Am a big fan now of authors now.Full marks, 5 out of 5.2018: 5 Down 45 to go (or as homo economicus would say.... 10% of total target achieved & on 96% of average required speed)!"}, {"userName": "☘Misericordia☘  ⚡ϟ⚡ϟ⚡⛈   ❂❤❣", "userReviewDate": "Oct 14, 2015", "userURL": "http://www.goodreads.com/user/show/6603759-misericordia", "userReview": "Incredible, fast, entertaining read. Thinkers like this one occasionall remind me just why I have chosen my profession.Short Synopsis (Q):Putting the Freak in EconomicsIn which the global financial meltdown is entirely ignored in favor of more engaging topics.The perils of walking drunk…The unlikely savior of Indian women…Drowning in horse manure…What is “freakonomics,” anyway?…Toothless sharks and bloodthirsty elephants…Things you always thought you knew but didn’t.Chapter 1. How is a Street Prostitute Like a Department-Store Santa? In which we explore the various costs of being a woman.Meet LaSheena, a part-time prostitute…One million dead “witches”…The many ways in which females are punished for being born female…Even Radcliffe women pay the price…Title IX creates jobs for women; men take them…1 of every 50 women a prostitute…The booming sex trade in old-time Chicago…A survey like no other…The erosion of prostitute pay…Why did oral sex get so cheap?…Pimps versus Realtors…Why cops love prostitutes…Where did all the schoolteachers go?…What really accounts for the male-female wage gap?…Do men love money the way women love kids?…Can a sex change boost your salary?…Meet Allie, the happy prostitute; why aren’t there more women like her?Chapter 2. Why Should Suicide Bombers Buy Life Insurance? In which we discuss compelling aspects of birth and death, though primarily death.The worst month to have a baby…The natal roulette affects horses too…Why Albert Aab will outshine Albert Zyzmor…The birthdate bulge…Where does talent come from?…Some families produce baseball players; others produce terrorists…Why terrorism is so cheap and easy…The trickle-down effects of September 11…The man who fixes hospitals…Why the newest ERs are already obsolete…How can you tell a good doctor from a bad one?…“Bitten by a client at work”…Why you want your ER doc to be a woman…A variety of ways to postpone death…Why is chemotherapy so widely used when it so rarely works?…“We’re still getting our butts kicked by cancer”…War: not as dangerous as you think?…How to catch a terrorist.Chapter 3. Unbelievable Stories About Apathy and Altruism. In which people are revealed to be less good than previously thought, but also less bad.Why did 38 people watch Kitty Genovese be murdered?…With neighbors like these…What caused the 1960s crime explosion?…How the ACLU encourages crime…Leave It to Beaver: not as innocent as you think…The roots of altruism, pure and impure…Who visits retirement homes?…Natural disasters and slow news days…Economists make like Galileo and hit the lab…The brilliant simplicity of the Dictator game…People are so generous!…Thank goodness for “donorcycles”…The great Iranian kidney experiment…From driving a truck to the ivory tower…Why don’t real people behave like people in the lab?…The dirty rotten truth about altruism…Scarecrows work on people too…Kitty Genovese revisited.Chapter 4. The Fix is in—and It’s Cheap and Simple. In which big, seemingly intractable problems are solved in surprising ways.The dangers of childbirth…Ignatz Semmelweis to the rescue…How the Endangered Species Act endangered species…Creative ways to keep from paying for your trash…Forceps hoarding…The famine that wasn’t…Three hundred thousand dead whales…The mysteries of polio…What really prevented your heart attack?…The killer car…The strange story of Robert McNamara…Let’s drop some skulls down the stairwell!…Hurray for seat belts…What’s wrong with riding shotgun?…How much good do car seats do?…Crash-test dummies tell no lies…Why hurricanes kill, and what can be done about it.Chapter 5. What Do Al Gore and Mount Pinatubo Have in Common? In which we take a cool, hard look at global warming.Let’s melt the ice cap!…What’s worse: car exhaust or cow farts?…If you love the earth, eat more kangaroo…It all comes down to negative externalities…The Club versus LoJack…Mount Pinatubo teaches a lesson…The obscenely smart, somewhat twisted gentlemen of Intellectual Ventures…Assassinating mosquitoes…“Sir, I am every kind of scientist!”…An inconvenient truthiness…What climate models miss…Is carbon dioxide the wrong villain?…“Big-ass volcanoes” and climate change…How to cool the earth…The “garden hose to the sky”…Reasons to hate geoengineering…Jumping the repugnance barrier…“Soggy mirrors” and the puffy-cloud solution…Why behavior change is so hard…Dirty hands and deadly doctors…Foreskins are falling."}, {"userName": "Raf", "userReviewDate": "Dec 08, 2009", "userURL": "http://www.goodreads.com/user/show/85049-raf", "userReview": "Disappointing! I loved the first Freakonomics, but since then, they've started a blog, and they inspired me to read/watch/listen to other economists who study popular phenomena or rational/irrational thought (Tim Harford and Dan Ariely are two favorites among them). So I found most of the stories here are things that I've either read about before, or didn't find interesting. The sections on prostitutes and terrorists are as boring as anything about prostitutes or terrorists can be, and certainly not as interesting as the gang culture investigation, or the crime vs abortions parts of the first book. Also, there's not much here; I probably read the book in 6 hours reading time, over the course of a day.There's been a bit of controvery surrounding the global cooling section, which seems overblown. They are certainly not environmentalists, but they simply say that climate modeling in the future is difficult (true), that it is exceedingly difficult to get people to change their behavior (uh, yeah), and that cost-benefit analysis suggests that maybe if we don't globally change people's behavior, geoengineering might benefit us (maybe true). They aren't climage-change denialists, but a sensitive person reading this might think so; they certainly aren't advocates. But, that controversy (like the book) is more boring than interesting. I think this material is best suited for their blog - short posts about interesting studies/observations are more enjoyable."}, {"userName": "Trpnstn", "userReviewDate": "Jun 28, 2011", "userURL": "http://www.goodreads.com/user/show/4621238-trpnstn", "userReview": "coming from a research background heavy in statistics, I immediately recognized the interpretive errors contained in Freakenomics. Initially I found it amusing to see the absurd conclusions made through cherry picking outlier results based on correlational and/or poorly designed research studies. Half way through the book, I got bored but continued through just so I could quote my concerns first hand during debates with the many non-scientists that became so excited about the book. The second book, SuperFreakonomics, didn't bore me or amuse me, it scared me. Once again, statistics is used to over-rule proper research design and the requirement of all good research to provide support from literature reviews based on quality methods was ignored. It's one thing when Levitt is using stats to make funny conclusions that any scientist would see as light hearted humor, it's a whole other thing to use statistical manipulations and faulty logic to try to debunk the REALITY that human behavior is the MAIN contributor to environmental toxins in the air and propose outlandish and un-researched solutions such as pumping even MORE toxins into the air to create shade. This book only serves to enable those that are still holding on to the hope that they are not responsible and don't have change as they feed their greed and addiction to over-consumption."}, {"userName": "Glenn", "userReviewDate": "Feb 08, 2010", "userURL": "http://www.goodreads.com/user/show/51432-glenn", "userReview": "Levitt returns to his rogue genre ostensibly to unearth more secrets of the universe using an economist's toolkit. Unfortunately brash comments litter his second foray into popular literature from intro to the final page, hardly masking the lack of clever or quality research. Levitt claims profit is not the primary reason for publishing this book, but it's hard to imagine why he would otherwise leverage the success of his first with so few good ideas. Levitt dwells on prostitution far longer than the topic merits (we get it: simple economic principles like supply, demand, and pricing tend to hold even in this unconventional industry), seemingly largely for a platform to make juvenile sex jokes. A mere sentence on the hardships of the rank and file amidst pages of \"research\" resonates as insincere.Once Levitt gets around to matters of consequence like global warming, he dances around any meaningful conclusions and instead romanticizes doomsday geoengineering fantasies. A thoughtful rebuttal can be found here: http://www.realclimate.org/index.php/...Overall, extremely disappointing given the hype and relative quality of the first incarnation. To its credit, it can be read in a single plane ride."}, {"userName": "Jan", "userReviewDate": "Jan 24, 2010", "userURL": "http://www.goodreads.com/user/show/1492258-jan", "userReview": "Generally a disappointment. When the first \"Freakonomics\" came out, it was a fresh foray into a field that had yet to make an impact on the popular literature: behavioral economics applied to social phenomena. Since that time, plenty of volumes have come out, giving Levitt and Dubner more competition. They certainly deserve credit for bringing the genre into publishing viability! Meanwhile, the first book's popularity has generated a heady incentive for the two of them to produce a book more quickly, no doubt clearing a lower bar to reap the significant profit coming from their expanded readership. A prime example of the effect of competition on this book is the mention of impact of birth month on sporting careers; the authors mention that they had been preparing a longer article on the subject, but Gladwell beat them to it. The result is an unfocused effort, often piling up a bunch of \"cool facts\" in an uninsightful fashion. High points such as the article about climate change remind me why \"Freakonomics\" isn't such a dismal science, but they don't qualify as a fully realized book."}, {"userName": "S.Baqer Al-Meshqab", "userReviewDate": "Jun 06, 2016", "userURL": "http://www.goodreads.com/user/show/19072481-s-baqer-al-meshqab", "userReview": "This book, as its title assures the readers, is SUPER. Freakonomics was a big success that made me an addict to the Superfreakonomics right away. This has never happened before in my reading experience.Superfreakomoics, similar to its predecessor, simply outlines the relationship between incentives and human behavior. This time however, the authors discuss even more interesting topics.The book is so well written because it uses the question-and-answer method, and not any question, and amazingly the anwsers are mostly freaky. I just wish that this series would cover literally EVERYTHING there is in this world.Super interesting. Super entertaining. Not difficult to understand at all. Will make you think like a freak, or will it, yet? Can't wait for the next book in line."}, {"userName": "Michael", "userReviewDate": "Mar 19, 2010", "userURL": "http://www.goodreads.com/user/show/356012-michael", "userReview": "About half way through the book, I felt this to be a less interesting sequel to the authors’ previous effort. The stories/studies seemed diffused by too many digressions into perhaps-parallel realms that didn’t always seem to support the main thesis of the chapters. I felt like there was something like incongruous name dropping (not Brad Pitt nor your local, not-yet-indicted Governor mind you, but a situation where acknowledgement or tribute needed to be paid to innumerable “rouge” colleagues). Then I got to the Iranian organ harvesting part! Finally someone agrees with me that not being able to sell organs happens to be an absolute absurdity in this country - everything else is for sale! (Yes, including sex. The fact that the privatized realm of prostitution is illegal, porn – mass distributed evidence of people getting paid for sex – clearly negates such stupid illegalities. Levitt and partner also include prostitution as an essay topic but not necessarily on this basis). The most common indignant response I get to my “barbaric” transplant position is, “but that will create an unlevel playing field – only the rich will procure organs.” For that I have five words: Mickey Mantle and David Crosby. I’m not going to claim that I actually knew a teetotaler who was on the Texas list years before Mantle and died waiting shortly after the Hall of Famer got his two month extension (I did) but I’ll simply say that a transplant ain’t free people! If the, no doubt, somewhat correct information on Wikipedia.com is any indication, any given organ transplant in the US costs between $100,000 and a cool million. Some people and some institutions are making a fortune off this so the altruism and morality spiels just don’t hold water in my opinion. But I digress…The other chapter of much interest (the first recorded case of monkey prostitution notwithstanding) is where Levitt spends time with the apparently brilliant scientists of the IV group in Seattle. The discussions about Global Warming are most interesting with, of course, a certain scientific disregard for most of what floats the simplistic Gorisms that we’re constantly barraged with; those that elicit the inevitable flashbacks of the boiling frog, submerged Florida, and the only extant polar bear making cameos on Lost. If I read these scientists correctly we’re likely to have at least some uncooked frogs and ill-equipped voters into the distant future. I’ve read the infamous (or completely unknown, depending on everyone I ask) 1976 National Geographic article on Global Cooling and they have a believable answer to why that was the obvious global peril of such a distant past. The inevitability of earthly cooling was the result of – get this – atmospheric pollutants! (coincidentally, if you reference THE bona-fide 1644 page engineering systems tome known colloquially as MEEB – edited by one Ben Stein, yet amazingly unfunny – you can find official charts showing circa 1960 as the high point of human-resultant emissions, with a dramatic decline in every category since then). The brains in Seattle actually propose pumping pollutants into the stratosphere to counteract the recent warming trends. This is probably a despicable idea, but I found the dialogue to be a good retort to the canned dialogue based on questionable matrices. Their day-to-day operations – a technological invention enterprise – has a strong Bill Gates link, so perhaps that influences their outlook? At any rate, beyond a sluggish start, Levitt and Dubner come through again – subverting some of the various “truisms” we’re always subjected to within the Information Age."}, {"userName": "Megan Blood", "userReviewDate": "Jun 13, 2010", "userURL": "http://www.goodreads.com/user/show/614561-megan-blood", "userReview": "3.5 stars, but the car seat chapter made me extra happy so I'll give it a boost. I particularly appreciate that, for the most part, they present their evidence with very little opinionating at the end (contrary to most books in this genre). I hate that people write these off as 'pop' literature. Sure, they're easy, fun reading, but that doesn't mean they don't tell us something about ourselves as humans and the world we deal with. I'd rather learn about it this way than from some jargon-filled thesis paper. Did I mention that I'm in love with the car seat chapter? Of course, I was already on Team \"Are Car Seats Really All That Necessary?\", so this just promoted my cause. I hate having this discussion with other moms because so many of them will respond with, \"If it makes my child safer, it's worth it.\" I remember reading something from Tom Sowell about water purification. They had managed to get the water in some stream 98% pure (which is way higher than anything in nature). But that wasn't enough--the government wanted it 99% pure. The purifiers argued that it would cost an obscene amount of money (billions of dollars) just to remove 1% more of the particulates. But Congress wanted 99%, and 99% they got (your tax dollars at work!). Anyway, what I'm saying is that there is ALWAYS a trade off. Keeping your kid rear-facing until he's 4 might decrease his chance of being seriously injured by 5%, but increase his discomfort and chance of screaming all the time by %40. Which is worth it to you? If you're that serious about your kid's safety, then just stop driving with him in the car. Anyway, what the authors found was that after age 3, a regular old seatbelt is JUST AS EFFECTIVE as a car seat for preventing major injury during a car crash. Granted, a car seat reduced minor injuries by 25%, so they're not useless. But, they argue, why not just make seatbelts in the backseat more kid-sized? You could even have a pull-out 5-point harness in a fold-down seat for a little one (some mini vans have these). Why do we have to spend all this money on all these car seats/booster seats, not to mention the huge pain-in-the-butt of hauling them all over the place if someone else is taking your kids in their car. Ever go to the airport with two or three car seats on top of all your luggage? And if you don't think the car seat companies are in on it, you're insane. It's obvious from the book--the test facilitators were terrified that the car seat companies would find out what the authors were doing. If a car seat is really that necessary, why would they be afraid to let people experiment to find out? I'm always very, very wary of any government mandates that work to the benefit of some industry, whether it's oil or pharmaceuticals or car seats. It's hard to be completely honest when your livelihood is at stake. Would you make any recommendations that would DECREASE the use of car seats if that's what your company makes?Anyway, this book is fantastic. Even the part about prostitutes. (This is a ridiculously long review. You get a gold star just for making it to the end)."}, {"userName": "Nguyên ngộ ngộ", "userReviewDate": "Sep 04, 2016", "userURL": "http://www.goodreads.com/user/show/7150676-nguy-n-ng-ng", "userReview": "Những nhận thức mới, còn đọng lại được trong quyển sách “quá ư lập luận, dẫn chứng”•\tBao cao su của tổ chức WHO không hợp với người Ấn Độ.hahha. Phụ nữ là “máy đẻ”•\tCái Ti-Vi làm tăng tỉ lệ tội phạm. Nhưng ko phải nội dung chiếu, mà là trẻ em ít tiếp xúc với gia đình, nói chuyện với mấy đứa hàng xóm•\tBẫy dữ liệu: trung bình, 1 con người trên thế giới, có nửa dương vật và nửa bầu ngực. Mà thực tế có air a vậy đâu, lấy trung bình của nam và nữ đó mà•\tKhi xay rượu, đi xe an toàn hơn đi bộ.•\tMại dâm, ma túy…hoạt động y chang doanh nghiệp, cũng từ CUNG-CẦU để lý giải giá cả.•\tTình dục phóng túng đã làm các gái mại dâm điêu đứng.•\tĐối thủ của công ty bán nến là “mặt trời” nên chính phủ ra chính sách” không được mở cửa sổ đón mặt trời ban ngày…•\tCô gái đứng đường giống ông già noel trong tiệm tạp hóa, ì NHU CẦU MỘT MẶT HÀNG TĂNG ĐỘT BIẾN TRONG KỲ NGHỈ•\tGái dâm y chang “cô vợ tốt được thuê theo giờ”. Người đàn ông mua hoa thực ra đang “giao tiếp với vợ, phiên bản trẻ trung hơn”•\tRèn luyện có chủ đích: (1) đặt mục tiêu cụ thể, (2) thu thập phản hồi ngày, (3) tập trung vào kỹ thuật nhiều như tập trung vào kết quả.•\tChủ nghĩa khủng bố: giết chóc ko phải là mục đích của nó, PHÁ VỠ BÌNH YÊN mới là mục đích nó.•\tThuật toán là gì: các lệnh excel để lấy thông tin dữ liệu. nôm na là vậy. Trong bảng này, lấy giúp tôi dữ liệu của các kẻ tình nghi, là, ko giao dịch tiền vào thứ 6.•\tThí nghiệm về lòng vị tha: KẺ ĐỘC TÀI KINH ĐIỂN. Anh có tiền 20$, anh có cho bạn kia 20$ ko, phiên bản 1, 2, 3, 4, dẫn tới đáp án: vị tha có phải là thiên tính con người không là câu hỏi sai, con người là con người, bị chi phối bởi ĐỘNG CƠ. Nên chỉ cần động cơ thích hợp, họ làm thôi•\tCâu chuyện 38 người đứng dòm 1 phụ nữ bị đâm ba lần…động cơ của nhà viết báo, ko thật•\tSự thật về sự việc NAM ĐỠ ĐẺ và phụ nữ bị chết hậu sản: do không rửa tay sau khi chạm vào tử thi•\tNgoại ứng: ví dụ về cái khóa xe trộm mình, gây ra thằng bạn mình bị mất trộmNgoại ứng tích cực: xe gắn chip định vị, xe ko gắn được hưởng lợi.•\tNathan myhrvold: gã khổng lồ bằng sáng chế.•\tNăng lượng mặt trời góp phần làm nóng trái đất lên (vì phản chiếu, chứ hấp thụ được 12% à)Thật sự kinh ngạc trước những nhà kinh tế học giải quyết các vấn đề toàn cầu, làm những cái mà mình nghĩ vô nghĩa nhưng thực ra ảnh hưởng tới toàn nhân loại.Các suy nghĩ lập luận, thu thập dữ liệu chứng cứ manh mối, thực sự đọc đi đọc lại theo không kịp nổi mấy suy nghĩ của mấy ông này. Đặt ra vô vàn giả thuyếtTìm manh mối, bẻ từng lập luận.Đôi khi ta đang núp dưới bóng râm của thành tựu của những người khác mà không hề biết.Họ đang vật vã lý giải, giải quyết những vấn đề sinh mệnh.Qua những lần LẬT NÃO (bẽ ngược lại nhận thức thông thường),Họ hé lộ được bức màn căn cơ bên dưới, mà google không thể vén nổi.Mới, hại não, nể!"}, {"userName": "Christina", "userReviewDate": "Jan 10, 2010", "userURL": "http://www.goodreads.com/user/show/1740420-christina", "userReview": "I read Levitt and Dubner's first book, Freakonomics, in March 2008, and I absolutely loved it. I thought it was ingenious, witty, and made economics interesting for the Average Joe who doesn't find this particular field as fascinating as I do. Therefore, it should come as no surprise that when the \"sequel\" to the book hit the shelves in October 2009 I would immediately add it to The List.SuperFreakonomics -- subtitled \"Global Cooling, Patriotic Prostitutes, and Why Suicide Bombers Should Buy Life Insurance\" -- covers everything in the subtitle and then some, including child car seats, drunk walkers, emergency rooms in America, volcano eruptions, chemotherapy, and why you don't want to be born nine months after Ramadan.My first reaction when I finished this book was I'm still not quite sure how prostitutes are patriotic. No, really, I don't understand. And somehow discussion of terrorism can lead to discussions about the syncing of medical data on computers and how to rate and rank doctos, which then leads to emphasis on the timing of your birth and the importance of the first letter of your last name, only to be rounded out with a British banker who created an algorithm to find terrorists based on their banking habits and why terrorist should buy life insurance. The book is comprised of one tangent after another that are thinly stringed together; it reads more like anecdotes or bits of each graduate student's research.There is a chapter focusing on a Seattle man who says that the way to prevent hurricanes were to warm the ocean in the context of unintended consequences. However, wouldn't warming the temperature of the ocean have unintended consequences that would most likely exceed its benefits? That's never discussed in the chapter. When discussing the introduction of seat belts into cars, Levitt and Dubner ignore the probability that air bags, safer car exteriors, safer auto glass, etc might have had some influence on the decline in the car accident related deaths.Everything else I've already forgotten seven hours later, which means this book was a sore disappointment."}], "description": "Here at last is the sequel to the international bestselling phenomenon, 'Freakonomics'. Steven Levitt, the original rogue economist, and Stephen Dubner have been working hard, uncovering the hidden side of even more controversial subjects, from charity to terrorism and prostitution.Four years in the making, Superfreakonomics will once again transform the way we look at the world. It reveals, among other things, why you are more likely to be killed walking drunk than driving drunk; how a prostitute is more likely to sleep with a policeman than be arrested by one; why terrorists might be easier to track down than you would imagine; how a sex change could boost your salary; and how there really is a cheap fix for climate change.This freakquel is even bolder, funnier and more surprising than its predecessor. With their unflinching analysis Levitt and Dubner overturn received wisdom: looking more deeply, asking more questions and, above all, thinking a little differently. Because sometimes the most superfreaky solution is the simplest.", "title": "SuperFreakonomics: Global Cooling, Patriotic Prostitutes and Why Suicide Bombers Should Buy Life Insurance", "url": "http://www.goodreads.com/book/show/6877044-superfreakonomics", "average": 3.97, "cover": "https://images.gr-assets.com/books/1349093163l/6877044.jpg", "reviews": 4131, "authors": [{"url": "https://www.goodreads.com/author/show/798.Steven_D_Levitt", "name": "Steven D. Levitt"}, {"url": "https://www.goodreads.com/author/show/1928.Stephen_J_Dubner", "name": "Stephen J. Dubner"}], "type": ["Economics", "Nonfiction", "Business", "Science", "Psychology"], "outlinks": ["http://www.goodreads.com/book/show/6877044-superfreakonomics", "http://www.goodreads.com/book/show/6402364-superfreakonomics", "http://www.goodreads.com/book/show/8126288-superfreakonomics", "http://www.goodreads.com/book/show/7190979-superfreakonomics", "http://www.goodreads.com/book/show/6402366-superfreakonomics", "http://www.goodreads.com/book/show/7890203-superfreakonomics-illustrated-edition", "http://www.goodreads.com/book/show/25245393-super-freakonomics", "http://www.goodreads.com/book/show/7600589-superfreakonomics", "http://www.goodreads.com/book/show/6999910-superfreakonomics", "http://www.goodreads.com/book/show/24938325-si-u-kinh-t-h-c-h-i-h-c", "http://www.goodreads.com/book/show/1202.Freakonomics", "http://www.goodreads.com/book/show/17331349-think-like-a-freak", "http://www.goodreads.com/book/show/23019295-when-to-rob-a-bank", "http://www.goodreads.com/book/show/20655234-freakonomics-superfreakonomics", "http://www.goodreads.com/book/show/301930.Readings_for_Foundations_of_Communication"]}