{"ratings": 135, "userreviews": [{"userName": "Natasha", "userReviewDate": "Dec 01, 2012", "userURL": "http://www.goodreads.com/user/show/2496802-natasha", "userReview": "This zombie western is an exciting, action packed read that's full of guts! I haven't read book one of this series and I think I wish I had first, just because I enjoyed the characters so much that I wanted a bit more of a back story for them. Although, I didn't read book one, I wasn't so left out of details that I couldn't really get into a good story. I still plan on reading book one to fill in some of the spaces. SURVIVOR ROUNDUP is a unique twist on the zombie genre. I love that the author mixed cowboys and zombies. I was also intrigued with the premise and just after reading a couple of pages, I was hooked. It's such an original, fast paced read that will have you feeling a string of emotions.The characters were nicely written and expressed well. I loved Red(Elizabeth). I couldn't imagine going through what she has in such a short amount of time. It was tragic. I also enjoyed Trance. He's a great character who's loyal, loving and determined. I felt pain at the loss of a certain character, but I guess there's always loss in a zombie apocalypse. One thing I have to say is because I didn't get the full introduction, since I missed book one, I didn't really see it as a YA novel. Not much indicated it as such. I may have missed the part where she told her age, but I couldn't seem to find it mentioned said in the novel. Either way, YA or adult, this novel rocked! It has The Walking Dead touch, where you have a variety of characters you're routing for and seeing them survive is one hell of a ride! I can't wait to read Dead Plains, which will be released in the Summer of 2013. Come onnn Summer!"}, {"userName": "Tammy", "userReviewDate": "Dec 19, 2012", "userURL": "http://www.goodreads.com/user/show/10627459-tammy", "userReview": "Imagine it! Zombies in the wild west! What an exciting mixture of zombies and cowboys! That is the only world that Red has ever known. Red and her new family have found shelter in an old fort. Surrounded by thick walls they don't have to worry about the walking dead outside. New beginnings and a food shortage force Red and Trace to go salvage for supplies. With Red's special \"ability\" they can get closer to the zombies than most people.Red and Trace soon run into trouble. Someone from Red's past has not forgotten about her and would do anything to have her back. They have some tough choices to make, not to mention there are a lot of people counting on them back home. Will they make it back in time?When I first started reading this book, I was unaware it was the second book in a series. It was not until I was half way through that I realized it. There is enough back story that the book can be read by itself, though I really want to read the first to get caught up on all the action. The characters are wonderfully written and well liked. Red and Trace have to go through so much and still prevail. I also enjoyed the Native American characters we are introduced to. Aponi, a great healer and her little brother Kitchi, who is destined to be a great warrior. I am a true zombie lover, I have read all types of zombie genre. Some great and some not so. This is one of the great ones. You can't go wrong reading Angela Scott's Zombie series."}, {"userName": "Misty Baker", "userReviewDate": "Jan 23, 2013", "userURL": "http://www.goodreads.com/user/show/4056115-misty-baker", "userReview": "You know that saying “I don’t have to be faster than everyone, I just have to be faster than you?”I call bullshit.See, I am not a runner. As a matter of fact, “running” is a four letter word in my house (strictly forbidden upon pain of spork in eye.) Knowing this (the running part, not the “I’m one step away from a loony-bin spork threats” part) I’ve had to devise my own zombie Apocalypse plan.1. Running is for suckers (or really skinny chicks names Kelley <–with an e.) Avoid it at all cost because one block in your ass is going to be on the ground puffing like a hypertensive blow-fish.)2. Guns blow. They are loud and unless you took a “bullet making” course at your local community college, chances are you are going to run out of bullets before your town runs out of brain deprived mommy munchers.And 3. Swords worked for King Arthur they are good enough for me.So feel free…run. When you get tired (and inevitably die a horrible death that is bound to involve missing limbs of some sort) I’ll be sure to collect you scattered parts and use them as kindling.Why does this matter? It doesn’t… I just wanted to talk about my awesome plan. Oh…and this book about zombies and a girl who uses a sword. Take that naysayers!!!“Red always knew she would have to face the man who nearly destroyed her. She just didn’t figure it would happen so soon…With the plague sweeping across the nation, destroying many and turning others into walking corpses, survivors head West in search of a chosen land, a place designed to keep the infected out, while sealing survivors inside. In theory, the idea seems the only way to keep humanity alive. In practice, it doesn’t matter whether a person is on the inside or the out—there is no humanity.…And even though John Gatherum hunted her down and instigated their reunion, Red’s no longer the passive girl he once manipulated. This time, she has a hidden agenda of her own.Kill him. Save her family. Save herself.”Ok, so now that you’ve confirmed that I may in fact be a lunatic, how about we talk about Survivor Roundup (book #2 in the Zombie West Series)Keeping with the tradition of me being a total hardass, I’ll start off by saying SR was not as good as it’s predecessor. Good but not AS good.Why?Because I didn’t like the Indians. (Hmm…maybe I should have worded that differently. You know, where I don’t sound racist.)Anyways, in the beginning of SR we are reintroduced to Red and Trace. The super/awesome/we-can-survive-the-end-of-humanity-as-we-know-it power couple. Things are great (minus the almost starving part) and the zombies are out of arms reach. (Cha-ching.)But, this is a story about zombies and Red the “almost zombie” (<–yes, that is a technical term. *cough*) so things can’t stay happy right? Right! So Red and Trace set off on an epic journey to find food. (Duh… I did say that almost starved, remember.) And after one day (I think) tragedy befalls them. They are separated and this is where the story really starts to take shape. (Ahem…Indians.)So what was my problem with the Indians?Nothing really…the actual Indians were great. I loved their individual personalities and they served a purpose. The problem I had was that I was bored. For some reasons these particular chapters (which happened to be from Trace’s POV) seemed to drag. Maybe it was the repetition of “you are weak” “you are lazy” that had me yawning and clamoring for Red’s chapters. (We get it!!! He got his ass handed to him.) Maybe I just have a raging girl crush on Red. (Come here honey…give mama a hug) Regardless, I found myself sighing (on more than one occasion) when I flipped the page to find I was no longer with the red-headed hotshot, but her long-lost beau instead. (Boo!)Indians and perpetual boredom aside…Ms. Scott had absolutely zero problem delivering in the ick department. Need proof? Ok! The passage below illustrates just how proficient she is at building a scene. A nauseating/completely rad scene.“The thick smell of blood and rotting fish hit him hard, but that wasn’t what threatened to turn his stomach. Metal pans, scalpels, saws, butcher knives, ice-pics, and unidentifiable tools of equal destruction reflected the dim light. Bottles filled with god-knows-what sat on shelves. Hooks hung from the edges of a large, wooden table that appeared stained with…Oh jeez.” Still not convinced? Try this on for size:“Foamy saliva leaked through the cracks of her mask as she snapped and growled, and the table shook when she banged the back of her head against it over and over again. One end of the rubber tubing plunged straight into the top of the girl’s skull, the other stuck straight out of her open chest, revealed her blackened, un-beating heart.”Makes you hungry doesn’t it? (lol)All kidding aside, though not as good as her debut…it was still one heck of a kick-tush zombie romp. One that genuine zombie fans are sure to enjoy.Drama + Zombies + Evil Dr. Frankenstein-ish type wacko =awesome, bang-up, capital, champion, excellent, fine, first-rate, fly, top, whiz-bang, wonderful.Happy Reading my fellow Kindle-ites and remember: Swords only need to be sharpened!!!!"}, {"userName": "Maria", "userReviewDate": "Dec 31, 2012", "userURL": "http://www.goodreads.com/user/show/2745176-maria", "userReview": "I received a complimentary copy of this book as a part of a book tour in exchange for a fair and honest review. I rated it 4.5 Stars. In an alternate old West roamed by zombies and survivors, Angela Scott's Survivor Roundup, the story of Elisabeth, aka \"Red\", a woman stuck between both worlds, and Trace aka \"Cowboy\", the man in love with her, begins where Wanted: Dead or Undead left off. Introducing a handful of new secondary characters, new adventures and a climactic faceoff with Red's nemesis, John Gatherum, this rousing addition to The Zombie West series is sure to please any paranormal or western romance lover. It kept me turning the pages late into the night.Beginning where we last left the resilient group of zombie fighters; Red and Trace little family gets a new addition when Wen and Carolyn have a baby. Realizing the fort where they've been living is getting low on supplies, Red and Trace know things will have to change in order for all of them to survive. Leaving Wen, Carolyn, and the children behind, Red and Trace decide to leave the fort and forage for supplies agreeing to come back within a month with whatever they've been able to scavenge. As Red and Trace travel in search of food, it becomes obvious Red's body has truly changed as a result of her continued exposure to zombie bites. While still human, Red is now able to walk among zombies without them even picking up her scent - she appears invisible to them. While Trace considers this a miracle - it makes Red uncomfortable. She's worried about the state of her humanity. When Red and Trace are split up by a group of roaming cowboys - it'll take more than all of the skills each has acquired to survive. They'll end up having to rely on the help of acquaintances they make along the way. I really enjoyed how Ms. Scott continued to develop Red and Trace's relationship as both a couple and as individual adults; we get to see them at both their best and at their worst. We also get to meet some really interesting and incredible secondary characters in this installment, from Kitchi and Aponi, two native American Indians, who help Trace survive his experiences to Nash, Red's temporary kidnapper and Davis Story, her older brother, two men who are instrumental in helping Red face off against her enemy, John Gatherum. Ms. Scott did a good job developing and exposing us to John and the evil he has become - he was the perfect villain and it was easy to root for Red and her group to win.Will Red and Trace be able to make it back home together in time to save their friends? And what new secret will Red have to share with Trace? You'll have to read Survivor Roundup to find out. I enjoyed it and can't wait to read the next installment in this series, Dead Plains, set to release in 2013."}, {"userName": "Nancy (The Avid Reader)", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/7149266-nancy-the-avid-reader", "userReview": "The following review is my opinion and not a paid review. I received a free copy of the book from the author for an honest review.Red, Trace, Wen, Caroline, their new baby girl, Rivers, Fisher and Ira are all still living in the military fort. What few supplies that they have are dwindling away. If they are going to survive someone has to risk going outside the walls of the fort to face the zombies and bring back more. So Red and Trace volunteer to be the ones to go find more food for everyone.They run into a whole world of trouble outside the walls. The zombies are not the only thing they have to worry about on the outside. Humans are their biggest problems. Red and Trace is kidnapped by some evil and cruel brothers. They end up separated from each other and Red thinks that Trace is dead.In Survivor Roundup we have some new characters join us Aponi and her little brother Kitchi along with Nash one of her kidnappers. Red's brother Davis also joins them after he figures out what kind of person John Gatherum really is. John has been using Davis to lure Red into his lair only Davis did not know this. John will do anything he has to in order to get his hands on Red no matter who it may hurt or how many lies he has to tell.Red has a plan she is tired of running and hiding from John so she is going to find him and kill him. Then she can go back to her \"family\" and not have to hide any more. She has to be quick about it or her \"family\" will not survive without her. Her \"family\" is waiting and depending on her to bring food back to them.I love reading books or watching movies with zombies in them. I have been known to watch a few westerns like Lonesome Dove in my time too. But to have zombies and cowboys together in the same story is one extremely brilliant idea. I love it! Wouldn't you just love to see Trace on the big screen? I loved reading the first book WANTED: Dead or Undead in the Zombie West Series. I also love Survivor Roundup. And now I can't decide which one I liked the best. They were both so awesome.I can't wait to find out more about Red, Trace and all the other characters in the next book Dead Plains which is not due to be published until summer 2013. I got a sneak peek at the first chapter at the end of Survivor Roundup. All I'm going to say about it is it will be another fantastical read. I sure am going to miss Red, Trace and everyone else. Summer is a long time to have to wait for the next book. I have so loved reading the Zombie West series and would like to say thanks Angela for writing it and giving me the opportunity to read it. Angela, you and the Zombie West series rock!"}, {"userName": "Lissette", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/4008232-lissette", "userReview": "Since discovering that she can withstand the zombie's bite, and still survive, Red's life has never been ordinary. John Gatherum has placed a price on her head, and he'll stop at nothing until she's in his grasp once more. She's gone to great length's to make sure he never lays another hand on her, but she knows time is running out.Her new husband, and family mean everything to her. She's promised herself to protect them, at all costs. They're all she has left, aside from her brother, Davis. Their survival is a must, if they're to get to the bottom of things, once and for all. Yet she can't help but to wonder what the changes the plague has wrought on her body will mean in the long run.Hunkering down in a fort they've come across for the time being, Red and her beloved family have had to deal with a lot of changes much too soon. The undead have surrounded their home, and more keep coming every day. Their stocks dwindle by the day, and she's no longer sure whether they'll survive the winter. She knows she'll need to do something soon, but the thought of leaving her family to fend for themselves eats her deep inside.When word of a cure reaches her ears, she soon realizes that she's been given the very opportunity to deal with John. The compound is supposed to keep the infected out, and ensure that people live a peaceful life. Yet appearances are deceiving, and things are not what John wants people to believe. With no other choice but to deliver herself into his hands, Red vows to put a stop to his wretched plans, and save herself and those she loves in the process.This was another great addition to this series. Picking up where it leaves off, we're re-immersed in Red's world. We get to see her deal with her feelings for Trace, and her insecurities when it comes to what she's become. She's presented with several tough choices to make, choices she's not sure she'll be able to withstand. But through it all, we get to see her come out on top as she battles to save her beloved family, and restore humanity's faith once more. So can't wait for part three of the series!"}, {"userName": "Liz at Fictional Candy", "userReviewDate": "Dec 31, 2012", "userURL": "http://www.goodreads.com/user/show/6062267-liz-at-fictional-candy", "userReview": "A couple months ago when I read Wanted: Dead or Undead, I was excited about this fresh and unusual take on zombies and I couldn’t wait to read more. With Survivor Roundup I definitely got my wish granted. This story takes place not too long after the first book in the series ended. Supplies are getting low so Trace and Red decide they will be the ones to go and scout for supplies. Any time they leave the confines of the fort they know they are taking a chance, and those odds haven’t lessened at all. The number of undead seem to be increasing. So they are off and running, and then the unthinkable happens – they are discovered and separated. This book really tugged on my heart strings at times. I really love these two characters, and their happiness is important to me. They are so good together, that even when they are separated and they don’t even believe the other is alive – they are still acting like a married couple. During their time apart they could both easily go their separate ways. There were definitely times I was fearful that’s what was happening. But their story definitely wasn’t over. This book has a multitude of different reunions – and it includes reuniting Red and Trace, thankfully. I’ve become attached to these characters, and I loved reading more about them. The action was terrific in this story. There are monsters that are definitely more scary than the zombies, and that is the monster that is within the living. Everything was definitely amped up in this story. It was very engaging, and I was quickly turning the pages to find out what happens next. There are also some big surprises in this book. One of those looks like it could lead to a book three, so I am crossing my fingers. I definitely want to know how this will be handled, considering that Red is the person that she is. If you read the first book in the Zombie West Series, you will definitely want to continue on with this book."}, {"userName": "Steph", "userReviewDate": "Aug 31, 2013", "userURL": "http://www.goodreads.com/user/show/2142019-steph", "userReview": "... zombies, uglies, nutters, undead, walkers, unfortunates ... Of all the terms, \"munchers\" did get straight to the point.\n Red's group has been hold up in the fort for several months now and supplies are dwindling. In order for the group to survive, she must venture outside of the walls to find food supplies. The zombies are surrounding the fort and there's no guarantee she'll find what she's looking for, but without the supplies there's no hope for the group. \n\"Pretend to be brave until you can be.\"\n While on the hunt, Trace and Red are separated and fear the worst. But, they each stay on mission and do what's necessary to survive. I'm not normally drawn to westerns, but when I found Angela Scott's first book, WANTED: Dead or Undead, free on Amazon I grabbed it. I was surprised by how much I liked it. Survivor Roundup gives readers the same gore and tension found in book 1. And, it moves Red's story along by showing how she's changed from the loner to the protector. I look forward to reading the conclusion, Dead Plains.[Full rating: 3.5 stars]"}, {"userName": "Carin", "userReviewDate": "Dec 19, 2012", "userURL": "http://www.goodreads.com/user/show/2236215-carin", "userReview": "Survivor Round up is the 2nd book the first being Wanted: Dead or Undead, you will not follow this book very well without reading the first one.Red and Trace are back and life in the fort is getting to the point that they need more supplies, this leads to the adventure in this book. I really enjoyed the first book, Wanted: Dead or Undead, I think the second, Survivor Roundup is even better. I feel like the characters have matured a little in this book and as in the first Ms. Scott creates an amazing dystopian world in the old west. The characters in Survivor Roundup are funny, easy to like and full of complex emotions that we are allowed to see and be a part of. I felt that in this second book the characters are even more approachable and it was easier to dive in and be a part of the book. This is written for a young adult audience and while it touches on the physical side of love briefly nothing explicit is ever said or used.Even if you are not a zombie fan I think you will like this book and enjoy it a great deal, I know I did. I received this book in exchange for an honest review"}, {"userName": "Susan", "userReviewDate": "Dec 19, 2012", "userURL": "http://www.goodreads.com/user/show/5114331-susan", "userReview": "\"Survivor Roundup\" is the second book in the series. Angela pens her characters strong, funny and full of emotions in a plot that just doesn't stop until your finished. I had a really hard time putting the book down and do suggest that you read book 1 \"Wanted\" Dead or Undead\" so your not lost. A must read for all zombie and non-zombie fans.This review is based on a complimentary copy from the author which was provided for an honest review."}, {"userName": "Allyson", "userReviewDate": "Jan 01, 2013", "userURL": "http://www.goodreads.com/user/show/7907180-allyson", "userReview": "I was given this book in exchange for a honest review! I normally don't read zoomie books, but I truly enjoyed this one! Red was a great character, her strength was amazing, she was funny, whitty and just an all around great character! I enjoyed the banner between her and Trace, some was laugh outloud funny! As soon as I finished Wanted: Dead or Undead I immedately started Survivor Roundup, which is the sequel!"}, {"userName": "Kathy", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/5426452-kathy", "userReview": "Loved this book as much as the first! The characters are awesome, there's lots of twists and turns to keep you on your toes. I can't wait for the next one in the series!"}, {"userName": "Jess the Audiobookworm", "userReviewDate": "Mar 05, 2016", "userURL": "http://www.goodreads.com/user/show/32296672-jess-the-audiobookworm", "userReview": "4.5 ★ Audiobook⎮Because I heard the last two installments in such quick succession, without even a break for writing a review in between, I’ve decided to combine my thoughts on them into one review. The continuity and fluidity of this series’ storyline makes the combining of reviews that much easier. Even if a listener had not heard the installments practically back-to-back, as I did, Angela Scott (the author) makes it extremely easy to jump back into the story as if it never ceased. This also makes it hard for me to recall precisely which installment certain events occurred in, which is not necessarily a negative thing. The continuous nature of the writing is one of the series’ greatest appeals. There were miniscule bits and pieces of the storyline that bothered me from time to time, the main one being the steady weakening of the way the main character was written and my declining opinion of her that went along with it, but it was never enough to murk my overall opinion of her or of the story, in general. There were times towards the end of the second installment and especially in the third when I questioned the way she and Trace were written, but in reality, I was just being nitpicky and impatient. Having finished the series, I can clearly see that now. Which leaves my largest standing complaint as being the extremely graphic, vivid, and revolting descriptions. Before you yell at me, I know this is a zombie series. I’m sure those kinds of descriptions are par for the course among zombie literature and there would probably be a lot more fans upset if that type of thing was excluded or watered down. Heck, the graphic nature of this series may pale in comparison to that of its contemporaries. I don’t read enough zombie stories to know. I’m just saying that, for me, it was a bit much. I quickly learned that I couldn’t listen to this while eating or trying to fall asleep at night. Not big sacrifices. But there were a couple of times when I actually had to stop listening for a period because the descriptions were so stomach-turning. I don’t consider myself overly squeamish either. Mind you, this type of thing may appeal to some listeners, but consider this a warning if you are not one of them. I would find it completely unnecessary and any other type of story, but in a zombie series, I’m guessing mine was probably the intended reaction. And it isn’t like the guts and gore didn’t serve a purpose because that would have really disappointed me. It all added to the story’s atmosphere. This story was woven together exceptionally well with relatable characters, plenty of heart warming moments, and some laughs thrown in as well. Speaking of heartwarming, let’s talk about that epilogue. It positively made my heart swell and also made me ache for a spinoff series set several years in the future. The epilogue set the stage perfectly for that type of thing, should Angela Scott ever feel so inclined. I would definitely, definitely have to get my hands on that. I’m salivating just thinking about it! I felt this series was extremely well-balanced, well-developed, and well-written. The Zombie West series tops my burgeoning list of favorite zombie stories, for sure."}, {"userName": "Sherry Fundin", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/9198006-sherry-fundin", "userReview": "Spoiler Alert: Survivor Roundup is Book II in the Zombie West Series by Angela Scott. I could hardly wait to start this book, after finishing Wanted: Dead or Undead, Book I. This is any unlikely story for me to rate 5 STARS, but it is full of suspense and surprises, as it twists its way down the dusty trail. If you like Zombies in any way, shape, or form, this book is a must read.Caroline was having the baby and called for Red. Red was afraid to help. She knew she was different from the others and was afraid of what she might do to the baby when she smelled the blood. Rivers said she would help her and took Red’s hand, leading her to Caroline.The Zombies outside the fort were screaming and howling more than usual. It was like they knew the birth was imminent. When the baby gave its first cry, the Zombies went wild, trying desperately to enter the fort, losing body parts as they walked and climbed over each other, scratching at the doors.Their food supplies were getting very low. They knew they would have to do something, and soon, or they would all starve to death.Red knew she was their first and last line of defense. She would have to go out among the Zombies and open the way for Trace to get the wagon out of the fort. She was shooting and slashing, blood and body parts flying through the air. The blood covered every inch of her body. The plan worked.The rest of her “posse” would be safe in the fort, until they returned.They had been searching for anything of value, anywhere, but came up empty. After two days, they came across a cabin with smoke rising from the chimney. The old woman told them she had nothing to give them. She was barely able to take care of her kids. She told them not to go to Mill Creek, because it was overrun with Zombies, so they knew that was where they had to go.Red entered Mill Creek, walking among the Undead like she was invisible to them. She scavenged whatever she thought they could use.Trace never saw the men coming. What was worse, they saw Red in town with all the Zombies.When Red returned to the wagon, the men descended upon her.What would become of her?Red had a secret and it gave her a reason to survive.What about her posse?5 STARS – Would Buy It For Them (lol)First off, I am not a big fan of Zombies and haven’t read many Westerns since I used to read my father’s books many years ago. I don’t get into Zombie movies and have not read a lot of Zombie books, but this one was amazing. The book took it to a level that made me want more. It captured my heart and my imagination.Sometimes a second book will not compare to the first, but this just kept getting better and better. I find myself smiling as I picture some of the scenes. Pretty sick, huh? The more I read, the more I liked the story. It made me realize I have missed reading Westerns and will be looking for more of them. The book was so realistic, at times I would forget about the Zombies.The book is very well written and the suspense kept me racing through the pages, wondering how this could end well. I kept thinking, what can you do with the story? Where can it go?The characters seemed so real to me. I loved most of them. But, there must be a bad, evil, black-hatted monster for the white hats to fight and prevail over.I love Rivers. Even though she was only eleven, being raised in the Wild West gave her a maturity that the kids nowadays sorely lack. Due to the harsh living conditions, she was forced to grow up fast. She didn’t think about things much, just did what was necessary.Desperate times call for desperate measures.It seems Man sinks to its lowest, loosing their most evil depravities on humanity, when the chips are down. The most corrupt seem to rise first. Then, it is up to the white hat to take them down. Is that because we dwell on the awful and don’t see the good?The part where the bandits were being attacked by the Zombies was awesome. I could picture the Zombies under the wagon, grabbing the guy and pulling him off his feet. Sounds like something I saw on Supernatural. I love seeing the bad guys get their comeuppance.Munchers, uglies, nutters, undead, walkers, unfortunates.When Angela talks about the young boy eating his own fingers and toes and Red giving him the freshly killed rat, I could picture it. How gruesome. So, be prepared and be afraid.I will be looking for Book III, Dead Plains, due out this fall.I won a signed, first edition, paperback Arc of Wanted: Dead Or Undead, The Zombie West Series Book 1 by Angela Scott, back in December. Then, in April, I won Survivor Roundup, Book 2. The books were screaming at me to be read. I am so glad I won Book 2, because I wanted to start reading it as soon as I finished with Wanted: Dead or Undead. So I can. And you can too.Be sure and read the author bio. I love learning about the authors of the books I read and oftentimes find them as entertaining as the books themselves. Like a super short story.\nAngela Scott"}, {"userName": "Tara Shaw", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/4827400-tara-shaw", "userReview": "Hello again, my sweet little cupcakes!!Back so soon? Yes, I know!It’s only because the wonderful author from my last review, Angela Scott, has me hooked on her books!!This round is the second in the Zombie West series, Survivor Roundup!Survivor Round up picks up a few months where Wanted: Dead or Undead left us yearning.Yes, yearning my dears.I did quite a bit of yearning..for about 10 minutes. XDAll is not well with our Red, Cowboy and the little family they’re come to care for.Supplies are dwindling, the undead grow in number and it seems they MUST venture beyond the safety of their fort for provisions!Oh my, no!I worried, fretted, even bit my LIP, from page to page.At times, my heart was in my throat, as the words whisked me away to a somewhat simpler, but ultimately more dangerous time.Fiends can be forged in the most unlikely of situations, as Red and Cowboy are parted!!Dramatic gasp!Red finds a saviour in a sweet man, who does right by her in the end.Cowboy winds up the unwilling object of affection to a young Indian healer.Well, by today’s standards we’d call her a shaman.Such power and knowledge in her mind.I believe what amused me most was the healer’s wise cracking younger brother. Reminds me of my own sisters!This time, we travel alongside the couple from the fort, to an abandoned, but zombie infested town, into an Indian camp, to the last place Red ever thought she’d return to..But fear not! Our heros find more than they ever imagined in three most welcome new friends and return home!Worse for wear, but happy in the end..The third installment to the Zombie West series is due out in October!!So feel free to twiddle your thumbs, lose all focus and wait, oh so impatiently, for the next book!!I know I will!!"}, {"userName": "Tamara! aka Amy G. Dala", "userReviewDate": "Apr 13, 2014", "userURL": "http://www.goodreads.com/user/show/15362335-tamara-aka-amy-g-dala", "userReview": "Continuing the incredibly descriptive saga of a band of survivors trying to live a life, love, and not get bitten. There's so much going on, yet while it is fast and furious, it's also touching, scary, creative and intriguing."}, {"userName": "Penelope Bartotto", "userReviewDate": "Oct 22, 2013", "userURL": "http://www.goodreads.com/user/show/1304867-penelope-bartotto", "userReview": "Scott, has managed to do what most movie sequels do not... succeed in being better than the original. How can someone top a 5 Star review, get another one. Admittedly I am fairly stingy with them, but this series has kept me guessing and anticipating the next chapter from the beginning of Wanted: Dead or Undead. A group of strangers brought together in book one, due to various circumstances, some within their control, and others totally out of their control, have gone from strangers to being a family. A changed world surrounds them, and the need for survival is the uppermost thought on everybody's mind. Having found a safe haven, the reality that they will have to move on hits them hard as supplies dwindle and biters gather around their temporary home by the hordes. Even the zombies are hunting for the last vestiges of food in the wilds of the west. What do Red, Trace, and Wen need to do? The answer is the premise of the intense book that is Survivor Roundup. Winter has strapped the group of supplies, everything is running low and with a new mouth to feed, they have to make some hard choices. Trace and Red, the fittest of the bunch head out to scavenge for supplies, promising to return to the group within the fort, return to their family. Red, has changed, in more ways than one. Love, can be both a wanted joy, and a dangerous enemy. For love, we sacrifice much more than we normally might. Here is where Scott marches into a tremendously powerful plot, filled with emotion, action, challenges, and definitely evil. Survivor Roundup is packed with poignant decisions that the characters must make in a split-second or risk death or maybe worse, undeath. Every character is challenged and new characters appear that have been perfectly crafted to fit within the existing story seamlessly. The story is superb, I cannot tell you how deftly Scott has taken you from one book to the next without a hiccup, and moved forward with the plot, only strengthening the foundation of an awesome series. The ending of book two, also was less sappy and more realistic to the story being told... my one tiny criticism for book one. The end was solid and very touching, providing closure on some fronts and opening new doors on others. I personally am 100% addicted to Angela Scott's writing style, and in particular this series, but will definitely be checking out her other series (see below) very soon. I see great promise in Scott's skill and talent, and many more top sellers in her future."}, {"userName": "Ryan Snyder", "userReviewDate": "Sep 05, 2013", "userURL": "http://www.goodreads.com/user/show/4730743-ryan-snyder", "userReview": "3.9/5I had a serious emotional breakdown when I was around 56 percent through with this book. lol. I am going to be honest with you. I had a small problem with one of my beloved characters and almost stopped reading because they were pissing me off. O.O But then I thought about it and a lot of it was overreaction on my part. Some of it was justified because my character just CHANGED and I was a little dumbfounded. But it was a justified change and my character was having a moment, so I decided to let it go. I put my big girl pants on and told myself to stop being a whiny brat and keep reading. It got better and I am happy to say that I still loved the book. Not nearly as much as number one, but it was still good. (: And I am working towards forgiving this character. Not quite there yet.. but working. I will say this though, I was into the book enough that when that one part presented itself, I nearly lost it. haha. You can ask Tiffany, I was venting at her. But it caught my attention and stuck with me and it earned my respect due to that. Any book that can make me attached enough to the characters that when something goes wonky with one of them, I become that upset... well, *shrug* like I said, respect. You guys! There are more characters in this book that I have come to love. *smiles* meep! Oh. *shrug* And a few that I absolutely HATED. whatever, I'm over it. *pouts*I feel like in each book, a new character is added that I just want to hug so hard. lol. and in this book, that character is Kitchi. He was great. (:Also, this book made me smile so hard it hurt in this one part. It was just so hilarious to me and I completely sympathized with Trace. haha. Smiling just thinking about it. \"KAW!\" *giggle*And then BAM another part made me want to curl up in a ball. D:There was some serious darkness in this book and at some points I was just like... O.O You are going to break my heart, you MONSTER. lol. But.. I kind of loved it. I know, I know, I'm SICK. Also, WHOAH, Villain alert. O.O That is one crazy B*****d. *shudders*So.. all in all? The second book was slap full of some new and AWESOME characters with unique personalities, and plenty of dry humor. There was some crazy darkness, but there is still that fantastic underlying since of family love and devotion. Oh, right. Can't forget about those crazy zombies! :D They were all \"IMA EAT CHOO\" and people were all... \"OMA GAWD! D:\" It was great. :D"}, {"userName": "Meganm922", "userReviewDate": "Jan 16, 2014", "userURL": "http://www.goodreads.com/user/show/2327196-meganm922", "userReview": "review originally posted at Love Literature Art and ReasonSurvivor Roundup was action packed and full of zombie mayhem. I loved the plot and the way the series seems to be progressing. It had me on the edge of my seat, especially when Trace and Red got separated. I didn’t know what to expect, if either of them would live in their new circumstances, and if they would find each other again.It was so agonizing to see the two characters separated. Trace was injured and inside of an Indian camp. Red was kidnapped by people who saw the Wanted posters. I was so worried about both of them and also worried about the people around them. An Indian girl tended to Trace’s wounds and was giving him googly eyes, while one of Red’s captors was being super nice to her. My brain was screaming NO NO NO! the entire time. Survivor Roundup mirrored some of the same type of set up as in The Walking Dead in season 3 with the compound that seemed to work relatively well under the supervision of one man who is thought to bring hope to everyone. And much like in the show, that place wasn’t all it was cracked up to be, but that wasn’t news to Red. The man running the compound was the same man who did all sorts of horrible things to her. I was happy to see Red handle things the way she did. I really love her character. She’s always tough. I liked the plot and the way the author kept me on my toes by separating the two characters and intertwining their stories. The zombie horror was awesome, too. I absolutely love the way the author writes about the zombie apocalypse. It’s terrifying and gory and gross, but the plot revolves around the characters, too. I’m invested in the story and the fate of the characters, while also being thoroughly entertained by the zombie mayhem. The fact that it’s all set in the Wild West makes it even more interesting, especially with the addition of the Indians in this book.I definitely recommend the series and I’m glad that Survivor Roundup was a wonderful addition to the series. I still think I liked the first book more, but I’m excited to continue and see what happens to the characters in the following book."}, {"userName": "Laura Thomas", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/7491783-laura-thomas", "userReview": "The story picks up where it left off. The author gave me just enough back information to catch up and then the story took off, pulling me back in time, to the west and the characters I’ve come to love.The relationship between Trace and Red strengthens now that some of their secrets have been shared.Red and Trace head out to gather much need provisions, making it past the horde outside. Their journey takes them to Mill Creek.The town is like undead central, zombies everywhere. Red’s secret comes in handy as she slips past the zombies as if she’s invisible, scrounging up as much as she can and heading back to Trace, waiting at the wagon. The zombies might not have noticed her, but others did, and now they want Red.She may have made it past the horde, but will they survive what’s coming? Either of them?I always to into the next book in a series with a bit of trepidation. Will it give me the answers I seek? Will it be as good as the first book?My fears were allayed in the first chapter. Survivor Roundup is as awesome as Wanted: Dead or Undead.I’m also big on character driven stories, so the group dynamics were important. Those of you who watch apocalyptic movies and read the books know it’s not just about surviving the cause of it. It’s also about making those life and death decisions, recognizing trouble when it raises its ugly head, and compromising when necessary. Their has to be give and take if the group is to survive. The author had me so wrapped up in her characters lives. Even the ones I couldn’t stand.And for you die-hard zombie fans. Angela can write those gut-clenching, gory, munching and hacking scenes. What’s a good zombie story without some gnashing and slaying. She does this so well I’d call it writing in color.The ending for the first book was hopeful. One of the best I’ve read. The ending for this one is darker, harder to take, and you do get left hanging. But that’s what a series is all about. Just like your favorite TV show, you can’t wait for the next episode.And there’s a big surprise waiting for you in this one. You’ll love it.I received this book for my honest and unbiased review."}, {"userName": "Rachel", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/6648750-rachel", "userReview": "I loved (devoured) the first book, and I was a cynic before reading. Zombie books are one of my favourite reads, and when I was given a zombie western to review, I was intrigued but figured that it would not work. I almost willed myself to hate it, being a die hard zombie book fan, but the opposite happened. How wrong I was, I grabbed this sequel as soon as I could to hear more of the characters Red and Trace. Their stories have moved on somewhat, and it is as atmospheric and gripping as the first was before it. I loved Nash, which was a surprise to me for reasons that become apparent when you read it, and the integration of characters old and new is brilliant. To pull off an accurate western book is hard: to chuck a load of zombies into the mix and still make the story realistic, endearing, shocking and unputdownable too is an awesome feat, and Angela Scott pulls this off with aplomb. I have only one question: when is book 3 out?One not to be missed, in my opinion. Rachel DoveThe Kindle Book Review"}, {"userName": "Jo-Anna Walker", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/5856059-jo-anna-walker", "userReview": "Angela Scott does it again with another fantastic read! I'm honored to say that I was approached back when a tour was being for regarding her second Desert book I believe and I fell in love with her writing that I had to read everything written by her and now I can proudly say, I HAVE READ EVERY BOOK BY ANGELA SCOTT!!! (so far that is) ;)Angela does it again with the sequel to her to The Zombie West series. I just love Red and Trace and every single character in these books. The zombies are awesome too cause who doesn't love a little zombie action?Again, the people of The Zombie West books are trying to keep away from the zombies and fight for survival. These books are about hardship, rough times, survival, laughter, friendship, love...*swoon* They are just fantastic. If you've read the first Zombie book, definitely read this one.I can't wait for the 3rd installment of this series! I know Angela will not disappoint and she'll do us readers proud!!"}, {"userName": "Kysha", "userReviewDate": "May 01, 2013", "userURL": "http://www.goodreads.com/user/show/9725930-kysha", "userReview": "I had to buy this book after reading Wanted Dead or Undead. There was no way I couldn't know what happened to Red and Cowboy.As the group got split, we don't know anything of Wen, Caroline and the kids until the end. The addition of the Native Americans and Davis was a good thing. I am usually leery of the addition of that many new characters, but they are key to the groups survival.The relationship between Red and Nash was touching and creepy at the same time, think Stockholm Syndrome. I was happy to see that John got killed. He was a !!@#$%^. I feel really bad for Trace, that man gets the short end of the stick everytime.I look forward to the 3rd book.Once again I cannot say anything bad about the writing style or the structure."}, {"userName": "Nicole Luiken", "userReviewDate": "Jan 13, 2014", "userURL": "http://www.goodreads.com/user/show/6130916-nicole-luiken", "userReview": "I received a copy of the ebook in return for an honest review.More zombies in the Old West. Good pacing with short punchy chapters alternating between Red (Elisabeth) and Trace. Book one was them finding each other and learning to survive, book two tackles Red's arch-nemesis John Gatherum, the doctor who cruelly experimented on Red. I liked how Red's zombie-fighting ability evolved and changed from book one and I liked the complicated relationship between her and her captor Nash. On the other hand, Aponi's crush on Trace struck me as unnecessary and annoying."}, {"userName": "Carlie", "userReviewDate": "Mar 01, 2015", "userURL": "http://www.goodreads.com/user/show/12016624-carlie", "userReview": "This one is better than the first. There is not a lot of zombie fight action, it focuses more on the new adventures away from the fort with a new gang of people. I love Aponi and Kitchi. I'm glad the author loved them as well and kept them around. Trace and Red are apart for a great portion of the book but find their way back to each other and we finally meet the villain. This is a good quick read. On to the last book to see how it all turns out."}, {"userName": "Leanne Crabtree", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/14187989-leanne-crabtree", "userReview": "OkayI read the first book in this series about three years ago and didn't do a re-read before starting this, which wasn't the best idea ever.That being said, I remembered enough to get into the story--though it took me a little while--but I think my taste n books has changed a little since then and I'm not sure if I'm interested in finishing the series."}, {"userName": "T.", "userReviewDate": "Oct 29, 2013", "userURL": "http://www.goodreads.com/user/show/9274125-t", "userReview": "Book two of Scott's western-zombie series is a hit! Excellent story, and the author has a great writing style. Most of the character development already happened in the first book, so I was already familiar with the characters and interested to see what would happen in this book. Book 2 was all about the journey and giving us more of the horror that was John G. I loved it."}], "description": "Red always knew she would have to face the man who nearly destroyed her. She just didn’t figure it would happen so soon....With the plague sweeping across the nation, destroying many and turning others into walking corpses, survivors head West in search of a chosen land, a place designed to keep the infected out, while sealing survivors inside. In theory, the idea seems the only way to keep humanity alive. In practice, it doesn’t matter whether a person is on the inside or the out—there is no humanity....And even though John Gatherum hunted her down and instigated their reunion, Red’s no longer the passive girl he once manipulated. This time, she has a hidden agenda of her own.Kill him. Save her family. Save herself.", "title": "Survivor Roundup\n      \n          (Zombie West #2)", "url": "http://www.goodreads.com/book/show/19218377-survivor-roundup", "average": 4.3, "cover": "https://images.gr-assets.com/books/1386282514l/19218377.jpg", "reviews": 27, "authors": [{"url": "https://www.goodreads.com/author/show/5335592.Angela_Scott", "name": "Angela  Scott"}], "type": ["Horror", "Westerns", "Horror", "Fantasy", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/19218377-survivor-roundup", "http://www.goodreads.com/book/show/13554016-survivor-roundup", "http://www.goodreads.com/book/show/16133865-survivor-roundup", "http://www.goodreads.com/book/show/23487625-anyone", "http://www.goodreads.com/book/show/13581407-wanted", "http://www.goodreads.com/book/show/13636317-desert-rice", "http://www.goodreads.com/book/show/16088656-desert-flower", "http://www.goodreads.com/book/show/18482668-dead-plains"]}