{"ratings": 3445, "userreviews": [{"userName": "Sarah - ", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/9479196-sarah--", "userReview": "Interesting job for the main character to have - cleaning abandoned homes. But the whole bakery thing, I have read so many of these 'cozy mysteries' and 'chick lit' books where the main characters own or work in bakeries. Blech. I did however like that this MC was a little older and would consider reading others in this series."}, {"userName": "Sarah", "userReviewDate": "Apr 30, 2015", "userURL": "http://www.goodreads.com/user/show/4495744-sarah", "userReview": "What is it with American cozy mysteries? Weak plot, weak mystery, lots of cookery... The structure of this type of novel is like many surburban houses: same house, different curtains."}, {"userName": "Karen", "userReviewDate": "May 25, 2012", "userURL": "http://www.goodreads.com/user/show/5117803-karen", "userReview": "What a fun book..This is the first I've read by this author and it was so enjoyable..Can't wait to start the second in the series.."}, {"userName": "Judie", "userReviewDate": "Jan 06, 2014", "userURL": "http://www.goodreads.com/user/show/10820707-judie", "userReview": "At age fifty; Samantha Sweet’s dream was to own a bakery featuring cakes, cookies, and cupcakes. Currently, she was doing her baking at home under less than ideal conditions. Until she saved enough money to accomplish that she worked part time for a government agency cleaning and maintaining homes that had gone into default. Her job was to get them into shape to be sold. \tOne day, she found a very ill, very unusual woman lying in bed in one of the houses. The woman gave Sam a box which she said had special powers, then she died. When she was mowing the yard at the next house, she discovered an unidentified grave. Both those finds play major roles in SWEET MASTERPIECE.\tHer new powers give her more energy and the ability to see things others cannot. The body in the grave is that of a recluse, an elderly man who turned out to have been a famous painter. The sheriff’s department initially believes he may have died from pneumonia or another natural cause.\t\tWhile the book was a fast read and well-written, I found the plot to be very thin. There were some very good descriptions of various locations. It had a lot of filler material about making cakes and cupcakes (no recipes were provided) and an overview, repeated several times, of what Sam did to prepare a house. \tThe book has a lot of characters, primarily some of Sam’s long-time friends. She talks about her daughter Kelly who cleaned out Sam’s savings. Later the daughter returns but the story doesn’t give enough details about why she quit her job or why she suddenly changed.\tAnother main character is the sheriff, Beau Cardwell. The relationship between him and Sam moves too quickly without explanation of Beau’s motivation. \tOverall, I found the book to be boring because of all the surface attention given to Sam’s jobs.\tIt might have made a better short story.\tThis book was a free Amazon download."}, {"userName": "Laurel", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/23301973-laurel", "userReview": "Sam is a 50 year old, pudgy? heavy? stocky? (Don't really know) woman who wants to open a bakery but cannot afford the capital investment. To save money she works for the USDA cleaning homes currently in foreclosure and caters baked goods she prepares in her very small kitchen. At 16 she left Texas to explore Alaska where she was employed as a camp cook on the Alaskan pipeline. She became pregnant, left Alaska without telling the father, moved to Denver, etc., etc., etc. She is still sexy enough to attract Beau, a gorgeous deputy sheriff. They have amazing sex. Sam's daughter stole her life savings but returns again after quitting a $70m job and walking out on her mortgage. She is suddenly reformed and starts a new job as caregiver for Beau's aging mother. LET ME KNOW WHEN THIS STORY BECOMES TOO CONTRIVED BECAUSE WE HAVE YET TO GET TO A MAGIC BOX WITH MYSTICAL POWERS, A WEALTHY GAY WRITER FRIEND, AN EX HIPPY B&B OWNER, AND THE MYSTERY ITSELF."}, {"userName": "Nancy Haddock", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/6233405-nancy-haddock", "userReview": "A sweet findFabulous book with an excellent plot, great characters, and a bit of romance. I have a new series to read!"}, {"userName": "Leslie aka StoreyBook Reviews", "userReviewDate": "Nov 15, 2015", "userURL": "http://www.goodreads.com/user/show/272944-leslie-aka-storeybook-reviews", "userReview": "I really enjoyed this book! The protagonist works for the USDA when houses are foreclosed upon. Samantha maintains the properties until sold. In her spare time, she bakes out of her own with a dream of owning her own shop. Things are going along well until she finds a grave at a house she has been asked to secure. This leads into several mysteries - who is the dead person and what about an artist's work that is found in the closet? How did it get there?There is also this mystery box that she takes from a home where an elderly woman dies not long after she breaks into the house. We don't know much about this box other than it seems to give her some healing abilities for others and energy. Hopefully if this is a series it is addressed more.In regards to the dead body in the grave, there aren't many characters to choose from in figuring out who the murderer is. I suspected because I was running out of options, but it was interesting to read why.apparently there are 8 books in this series (so far) so I'll be looking into reading more."}, {"userName": "Barb", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/2682283-barb", "userReview": "Samantha Sweet breaks into houses for a living—all perfectly legal as a caretaker for the USDA. But her real dream is to open her own pastry shop, Sweet's Sweets. Life is a little crazy for Sam right now. At one of her break-in properties a dying woman insists that she take a small wooden box. Sam doesn't realize that the old woman was known locally as a bruja, a witch, until she begins to feel some strange effects from the box, herself. Meanwhile, at another property, she finds an unmarked grave and the authorities come to investigate. The property owner disappeared a few months earlier and Sam wonders—who is the body in the grave? A small mural in the house leads to a connection with a famous artist; a bogus will points to possible fraud; and the handsome deputy investigating the case seems completely enchanted with Sam. While Sam scrambles to fill bakery orders and keep her properties in order, she's equally intrigued with the idea of a new romance. It all makes for a delightful romantic mystery with elements of the paranormal.I loved this mystery. It's a little supernatural, a little romance, and a whole lot of mystery. Very well written. 5 stars."}, {"userName": "Nancy", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/3967198-nancy", "userReview": "amantha Sweet breaks into houses for a living--all perfectly legal as a caretaker for the USDA. But her real dream is to open her own pastry shop, Sweet's Sweets.Life is a little crazy for Sam right now. At one of her break-in properties a dying woman insists that she take a small wooden box. Sam doesn't realize that the old woman was known locally as a bruja, a witch, until she begins to feel some strange effects from the box, herself.Meanwhile, at another property, she finds an unmarked grave and the authorities come to investigate. The property owner disappeared a few months earlier and Sam wonders--who is the body in the grave? A small mural in the house leads to a connection with a famous artist; a bogus will points to possible fraud; and the handsome deputy investigating the case seems completely enchanted with Sam.While Sam scrambles to fill bakery orders and keep her properties in order, she's equally intrigued with the idea of a new romance. It all makes for a delightful romantic mystery with elements of the paranormal."}, {"userName": "Sue Ross", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/6363846-sue-ross", "userReview": "Another wonderful seriesThis is the first book in a new to me series. Sam Sweet breaks into vacant houses for a living. It's legal though. She is caretaker for houses that have been foreclosed on. When she discovers a grave in the back yard of one of her houses, things get dicey. On top of that she has an elderly woman die in one of the houses she was cleaning. Not before the old lady gives her a wooden box. I really enjoyed this book and I'm glad there are more in the series."}, {"userName": "Anastasia", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/12171404-anastasia", "userReview": "Sweet Masterpiece by Connie Shelton is the first Samantha Sweet mystery. Samantha Sweet cleans out repossessed houses but dreams of opening her own bakery. At one of her houses she finds a fresh grave with the body of a well known artist. A fun start to the series. Some paranormal elements with a box which seems to have magical powers. Interesting and likeable characters. A quick and light entertaining mystery."}, {"userName": "Bea Whetsel", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/63005541-bea-whetsel", "userReview": "Sweet MasterpieceThis was my first novel by Connie Shelton. I was pleasantly surprised by how good it was. A very likable protagonist and supporting characters coupled with an interesting plot made for an enjoyable fast read."}, {"userName": "Georgiann Hennelly", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/1946881-georgiann-hennelly", "userReview": "Samantha Sweet works for the USDA. Her job involves breaking into houses. Her real dream is to own a Pastry shop. Things are going well until she finds a grave at a house she has been asked to secure. This leads to several mysteries including a mysterious box and some artists work found in a closet. Can Samantha solve these mysteries?"}, {"userName": "Pam Falbo", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/62761088-pam-falbo", "userReview": "I loved this book! I enjoyed the characters, the setting, the story line....everything! Sometimes I look for an easy read, and this fit the bill PERFECTLY! I am thrilled Connie Shelton has 10 more books in her Samantha Sweet Series! Love it!"}, {"userName": "Susan", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/2237864-susan", "userReview": "My First \"Samantha Sweet\" Book☺️...Loved all The Unsolved Mysteries,till the end..Kept me Very Interested in Samantha's life... \"Multitask x 3\" is What Samantha does so Well... 🔍🔎 Plus!"}, {"userName": "JoAn", "userReviewDate": "Oct 03, 2013", "userURL": "http://www.goodreads.com/user/show/4924750-joan", "userReview": "\"Sweet Masterpiece\" by Connie Shelton was, for me, a good introduction into the life of Samatha Sweet. She was a likeable central character who presents a strong and positive image. I also liked the fact that she was in her 50's and working two jobs to pay her bills and save for her dream of owning her own bakery. I had never heard of her job for the government before I read this book. I found it fascinating that she broke into homes that people had defaulted on their government loans and walked away. She cleaned up these homes so that they could be sold at auction. This type of job added to this original plot because Sam had a \"real\" reason for being at the homes instead of just her being nosy (as so many other cozy mysteries characters).However, there were a couple of times during the story where Sam did do things that I call \"TSTL\" moments and they jolted me out of the story. I was shaking my head thinking \"why did she do that?\".This series is set in Taos, NM. I have visited there and loved the area. Her descriptions of the town and the surrounding area were so vivid that I was quite happy to \"see\" familiar spots that I had visited before.The secondary characters were really well developed and I enjoyed meeting them all. The handsome sheriff and his mother, Sam's daughter and Sam's friends helped to keep the plot moving. The story was interesting with enough twists and turns that kept me reading till the end. I look forward to the next book in this series."}, {"userName": "Jeanne Jenkins", "userReviewDate": "Feb 15, 2014", "userURL": "http://www.goodreads.com/user/show/4785126-jeanne-jenkins", "userReview": "Sam Sweet moved to Taos New Mexico to start a new life. She works for USDA. Apparently when a home is left vacant and money is owed, the USDA takes it over. Sam cleans the home, disposes of old stuff and personal stuff. Apparently is pays well. But her love is her baking. She makes cakes and cup cakes and cookies for parties, etc. One day she wants to open her own bakery and call it Sweets Sweets. Life is going well until she is cleaning one of the houses and finds what she thinks is a grave in the back yard. She calls her boss and then calls the police. Sure enough, it is a grave. She then starts to clean the home and finds a painting done in a bedroom closet on the wall. Odd. She calls a friend that knows art and discovers that it is from a famous painter. Then as they say, the plot thickens. There are lots of good people trying to do the right thing, and tons of bad people, doing what bad people do. It is a great mystery that I think you will enjoy. Make yourself a cup of tea and enjoy."}, {"userName": "Thomas Paul", "userReviewDate": "Jul 29, 2016", "userURL": "http://www.goodreads.com/user/show/6949571-thomas-paul", "userReview": "Secret power magical boxes. Sentences desperately in need of editing. More random love stuff than mystery writing. Predictable plot. Anyway, I think you get the idea of what this book is like and about. A woman who wants to open a sweet shot (Sweet's Sweets, perhaps the most imaginative thought in the book) also cleans out abandoned houses to make extra money. In one of the abandoned houses she finds a dying woman who gives her a magical box. In the next house she finds a grave in the backyard and an amazing painting by a long missing artist. And then the local sheriff falls in love with her and her daughter who had walked off with all her money returns and becomes a saint. Is it the magical box or just lousy writing? Perhaps we will never know. Perhaps we will never care. I can at least give the book credit for being a fast read. Anyway, if you like mysteries then don't waste your time here. This should be in the SF/Romance section under one-dimensional books."}, {"userName": "Farozan", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/55350579-farozan", "userReview": "Mystery, magic, and cakes!All Samantha Sweet wants is to have her own bakery. But her life becomes more interesting when she receives a mysterious box that imbues her with powers and stumbles upon a murder mystery in the small New Mexico town. This was very different from the mystery and paranormal stories I have read. It's a light read and has some interesting characters and set up, again different from the usual mystery fare. Perfect for a rainy day!"}, {"userName": "Melanie Jackson", "userReviewDate": "Jul 19, 2011", "userURL": "http://www.goodreads.com/user/show/4134897-melanie-jackson", "userReview": "What a fun read! Sam has unusual careers-- government sanctioned housebreaker and baker. The housebreaking is just until she get enough money together to open her own bakery, but as we all know, money is in short supply these days. Though cleaning repossed houses is usually more boring than scary, Sam manages to find two bodies in the course of one day. Could the deaths be related?"}, {"userName": "Ted Tayler", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/23827747-ted-tayler", "userReview": "\"You can't judge a book by its cover\"An entertaining mystery, that is obviously by an accomplished writer. Not a fan of the supernatural element though, and if I had been searching for a paperback to read, the cover would have put me off straight away. That would have been my loss, because what was inside was far better than the sugary, sweet coating suggested."}, {"userName": "Natalie", "userReviewDate": "Jul 25, 2014", "userURL": "http://www.goodreads.com/user/show/944550-natalie", "userReview": "Oh dear God. I'm on a roll. This free book was written by someone who has mastered the art of sentence fragments. I tend to not be picky about things like that but when it's constant and there are sentences like \"Two perky ears.\" it's just too much."}, {"userName": "Sonia Cristina", "userReviewDate": "Sep 01, 2016", "userURL": "http://www.goodreads.com/user/show/4457513-sonia-cristina", "userReview": "Muito secante, de ação lenta, poucos desenvolvimentos e pouco interessante."}, {"userName": "Mandy", "userReviewDate": "Feb 04, 2014", "userURL": "http://www.goodreads.com/user/show/18318291-mandy", "userReview": "An enjoyable, light-hearted quick read. I really liked the main character and look forward to reading more in this series."}, {"userName": "Sophie", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/3955938-sophie", "userReview": "This is an easy read. I did enjoy it to some extent, but the writing style is very basic. The plot doesn't have much substance to it and there aren't many characters (but this does make it easy to follow). For a free book it is good, though.I like some of the ideas in it. One of these is a wooden box with Pagan symbols on, given to the protagonist by a dying lady, which seems to give her extrasensory powers. This is never really followed up or investigated though. There are a few mysteries and the main characters seem naive. The police and investigative service/Beau seemed to think that a place with an unrecorded burial in the backyard involving someone just wrapped in a blanket (no coffin) and a house with a mural, claiming to be painted by an important artist who had gone missing was not important to the investigation! And the mural was just cut out and passed on and sold. Weird.Sam also touches things of importance for the first time without gloves (the envelope and the hidden sketchbook which she forgot to tell the investigator about that she just stuffed under her mattress!) Many questions go unanswered.What caused the wooden box to give magical powers? Was there a limit on how often it should be used for this? Who really was the old woman? I don't believe Kelly was as genuine as she made out to be. Sam thought this to be out of character. I don't know if any of these things are followed up in future books in the series. At least it was easy to read and it did have promise but fell flat.This is definitely not one for murder mystery enthusiasts - it's too basic. If you want chick lit it pretty much falls flat on that front too. It has free narration too on amazon, the quality of which is very good and better quality than some of the other ebooks from amazon that came with audible narration (expressive, not too fast, not too thick an accent).Enjoyment: 7-8/10Quality 3/10"}, {"userName": "T K Nelson", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/35590383-t-k-nelson", "userReview": "[ After the only likely suspect is eliminated, there is only one other person who has been introduced so it was a pretty easy leap to guess who the murderer was  (hide spoiler)]"}, {"userName": "April", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/11213519-april", "userReview": "If you’re looking for a brilliant piece of fiction, this book is not for you. It’s fairly predictable - I’m fighting the flu, and I had the mystery solved moments after finding out what the mystery was - and Samantha Sweet is the typical spunky middle-aged heroine who dreams of opening her own bakery and stumbles across a mystery. (Side note: why do spunky heroines almost always dream of opening/running either a bakery or coffee shop? Does my complete lack of desire for either a bakery or coffee shop doom me to an uneventful, non-spunky, unheroic life?) It’s basically fluff... but for fluff, it’s pretty decent. The author tried to introduce a mystical element to the book, but to be honest, that part felt a little forced... sort of like someone decided, “hey, we need a little something different to set Samantha Sweet apart from the other spunky, dreaming-of-a-bakery heroines, let’s toss some random magic in there too.!” I don’t know if the “magic” comes into play more in later books, but it didn’t really work for me in this one. All in all, it was okay, and I’ll likely pick up the next book next time I’m between other reads.Also, side rant: I found it slightly annoying how often Sam “whips up” an elaborate cake. Baking is fun, but it’s work. The number of times Sam gets a last minute order and “whips up” the perfect cake/cupcake/whatever... *especially* when that’s in addition to the physically demanding cleaning/caretaking work she’s doing... nope. Sorry."}, {"userName": "Nancy", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/33575344-nancy", "userReview": "\"Sweet Masterpiece\" was my first Connie Shelton book and I am happy to say that I did enjoy this quirky, lighthearted little mystery.From reading a few of the previous reviews (which I generally try not to do before I read a new book), I knew this wasn't going to be a dark or heavy mystery. I was looking for something easy and quick to start my 2017 reading challenge and this story was exactly what I was looking for.Sam is an easily, likeable character. Her struggles, challenges and self critique are relatable to a lot of women, especially women entering their 50's and/or single women in general.Loved her sidekick Rupert, their antics made me laugh and I'm hoping that Beau makes it through the other storylines as her love interest. \"Sweet Masterpiece\" was a quick, fun read and I plan on reading other stories in this series. I will recommend \"Sweet Masterpiece\" to my friends who are looking for something light."}, {"userName": "Nandie", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/71356664-nandie", "userReview": "Samantha Sweet is in her 50's and cleans up abandoned houses, bakes sweets and solves crime! The more I read this book the more questions I had. The story of the magical box and how she got it was interesting but I finished the book and still don't know anything about this magical box other than she touches it , it feels warm, and she gets about 12 hours of energy. But why?? I read that this box is mentioned in the 2nd book in the last pages. The romance is good but the clues to the crime were odd. I don't get how a man is wrapped in blankets and buried is not suspicious to them at first. The characters think that he wanted to be buried there but how does one wrap himself in blankets? I just think that there were too many clues that were not followed up until later in the book. Overall it was good. A cozy mystery with romance. I gave it 3 stars."}, {"userName": "Nadine Brown", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/1199097-nadine-brown", "userReview": "5/17-22/18 Sweet Masterpiece ebook Ahhh such a Sweet story of middle aged Samantha (Sam), single mother to Kelly who ran off, cleaned out sams checking account. Returns home after having quit job. Sam maintains properties for government to resell (foreclosure, death, abandonment). Finds dying woman in a house. Old woman insisted Sam take wooden box for safe keeping. Wooden box gives sam energy, power to soothe others. Finds fresh gravesite at another property. Calls police. Leads to death of famous painter, Pierre Cantone. Who killed him? Nephew, Bart who had come to live n help his uncle? Neighbor, over fence dispute? He died from pneumonia, traces of unknown substance, could have been poisonous plant (deathcamus), traces (green powder only Sam could see) found around Cantone's house."}], "description": "An alternate cover for this ASIN can be found here.Samantha Sweet breaks into houses for a living--all perfectly legal as a caretaker for the USDA. But her real dream is to open her own pastry shop, Sweet's Sweets.Life is a little crazy for Sam right now. At one of her break-in properties a dying woman insists that she take a small wooden box. Sam doesn't realize that the old woman was known locally as a bruja, a witch, until she begins to feel some strange effects from the box, herself.Meanwhile, at another property, she finds an unmarked grave and the authorities come to investigate. The property owner disappeared a few months earlier and Sam wonders--who is the body in the grave? A small mural in the house leads to a connection with a famous artist; a bogus will points to possible fraud; and the handsome deputy investigating the case seems completely enchanted with Sam.While Sam scrambles to fill bakery orders and keep her properties in order, she's equally intrigued with the idea of a new romance. It all makes for a delightful romantic mystery with elements of the paranormal.", "title": "Sweet Masterpiece\n      \n          (Samantha Sweet #1)", "url": "http://www.goodreads.com/book/show/9130970-sweet-masterpiece", "average": 3.75, "cover": "https://images.gr-assets.com/books/1328353710l/9130970.jpg", "reviews": 394, "authors": [{"url": "https://www.goodreads.com/author/show/157462.Connie_Shelton", "name": "Connie Shelton"}], "type": ["Mystery", "Mystery", "Romance", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/9130970-sweet-masterpiece", "http://www.goodreads.com/book/show/18769267-sweet-masterpiece", "http://www.goodreads.com/book/show/9574957-sweet-masterpiece", "http://www.goodreads.com/book/show/8131432-deadly-gamble", "http://www.goodreads.com/book/show/12981868-sweet-holidays", "http://www.goodreads.com/book/show/13486937-sweet-hearts", "http://www.goodreads.com/book/show/10320058-sweet-s-sweets", "http://www.goodreads.com/book/show/18191939-sweets-begorra"]}