{"ratings": 455, "userreviews": [{"userName": "Brenda", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/1898046-brenda", "userReview": "This was a book that I read when I was waiting for a family member or eating a meal by myself. The plot was full of twists and turns, this kept me interested and made for a few times of continued reading. The characters could have been real people. I might try and get the rest of these books because the characters really drove the story. I was impressed that this story was easy to read; but had some very deep thoughts."}, {"userName": "Kristine McCord", "userReviewDate": "Mar 13, 2014", "userURL": "http://www.goodreads.com/user/show/10962891-kristine-mccord", "userReview": "I really enjoyed this prequel. I'd read Bait first, so it was cool to go back and get this story, since I'd gotten fond of the characters and had been curious about Liam's relationship with Andrea. As a side note, I've grown picky about suspense since I don't like a lot of blood and gore or super disturbing mental imagery these days. So I found this book did a great job giving me a good story with enough suspense to keep me hooked while still not blindsiding me with too much disturbia."}, {"userName": "Caitlyn Santi", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/6980753-caitlyn-santi", "userReview": "My first time reading this author so I didn't know what to expect but I really enjoyed this novella. I liked the characters, and while there were many romantic moments (Mainly due to the Hero's desire to protect the heroine, which totally made me melt!) I did feel like it was a little bit too much of an insta-romance for my personal taste, but it didn't seriously affect my enjoyment of the story, especially because I'm sure that even though these characters aren't the stars of the next book in the series, there relationship will develop more in the subsequent books. I also have to say that while the ending was quite suspenseful, there was zero closure, but that was okay it just made me want to read the next book even more! Overall, this was a good novella which I enjoyed!"}, {"userName": "Heather", "userReviewDate": "Mar 13, 2014", "userURL": "http://www.goodreads.com/user/show/8349937-heather", "userReview": "If you're thinking about reading Bait, I highly recommend reading this fast-paced prequel first. I read them in opposite order, but once I read Target I loved the characters and the story that much more."}, {"userName": "Sobia", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/2125909-sobia", "userReview": "Let me preface by saying this is really not my genre. I was in desperate need of a story to read, and a romantic suspense title seemed to fit the bill. It wasn't til after Id started that I realized this was a Christian fiction title. Now I don't begrudge anyone their genres ( or beliefs for that matter) but I don't like to mix theology in with my fiction. So, usually at the first hint of religiosity encroaching, I will abandon a book, but this time I kept with it (I'd already gotten a good deal into it!) ...and I'm glad i did, if for no other reason than trying something new. Okay,so...Would I read another? probably not, this really isn't my genre, it was alright in the begining, but got a little preachy for the second half of the book. Also the h annoyed me. She's described as distant and remote, and she definitely fits those descriptors. It was just very hard to like her ESP as she kept pushing the H away...then she sorta changed her mind, seemingly arbitrarily, and wanted forever with him instead. The H was pretty decent in the beginning, but sorta fizzled, later on. Also the h's FBI partner was a little too often center stage,.Also and I don't know how to explain it, but the theological discussions, some of,them seemed to just pop up randomly. And while most of the suspensey bits were decently written, though some bits didn't make sense, I'm not sure it warrant being called suspense. It was very light, IMO. Oh also because I'm a spaz, and don't pay attention, I didn't realize this was a novella. And a prequel to boot! Yeah so there's totally a cliffhanger. So 2, 2.5 stars maybe."}, {"userName": "Becky Avella", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/4719140-becky-avella", "userReview": "This was a quick, entertaining prequel. I thought the friendship between partners Liam and Caisey was fun, and the cliffhanger ending made me look forward to reading Bait, the next book in the series by Phillips. Fans of inspirational romantic suspense will enjoy this series."}, {"userName": "Sarah", "userReviewDate": "May 13, 2014", "userURL": "http://www.goodreads.com/user/show/23875155-sarah", "userReview": "This is a good story. It's very short & sets the scene for Bait. When you finish this you will want to go directly to the next book. There was a couple places that were a little choppy or a sentence or two didn't make sense to me. But overall Ms. Phillips writing was suspenseful and engaging."}, {"userName": "Melanie", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/5396610-melanie", "userReview": "For being so short, Target was actually a good read and held my interest. It ends with a huge cliffhanger that makes me want to pick up the next book and see what happens next."}, {"userName": "Anita Burkett", "userReviewDate": "Oct 05, 2017", "userURL": "http://www.goodreads.com/user/show/31267540-anita-burkett", "userReview": "Another Good StoryI made the mistake of reading the next book first. This one was interesting and held my attention. But I can't help but compare it to the other one. This had less pages and characters. It was easier to keep up with them. It was less adventurous. But still good. I look forward to reading more from this author."}, {"userName": "Barbara Keigher", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/62049462-barbara-keigher", "userReview": "It was very good, but I hate it when it's more or less a cliff hanger ending....not totally but still the only annoying part....it's not the way, to get me read the next in the series.Still it was a good story."}, {"userName": "Linda Rainey", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/23269085-linda-rainey", "userReview": "Suspense!Suspense grabs you and pulls you through the twists and turns of this mystery.I loved the story line filled with well crafted characters.Be sure to read book 1 in this series.This novella is recommended for Christian romantic suspense readers."}, {"userName": "Tesser White", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/6848361-tesser-white", "userReview": "REALLY cheesy."}, {"userName": "Shelia Hall", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/7744469-shelia-hall", "userReview": "Real spinetinglerLisa Phillips writes a great mystery! She will have you on the edge of your seat waiting for the next move. Great book!"}, {"userName": "Tanya", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/67191155-tanya", "userReview": "GrippingWhat a gripping story line as you wonder if she will be safe from the killer. He's angry and will get her if he can. Will everything work out? Will they catch him?"}, {"userName": "Paula Shreckhise", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/47984664-paula-shreckhise", "userReview": "Very good prequel. Makes you want to read the whole series. I connected with the cast of characters."}, {"userName": "Tracey Billing", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/14382304-tracey-billing", "userReview": "I really enjoyed this book."}, {"userName": "Mike Hipp", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/32302868-mike-hipp", "userReview": "good readlooking forward to reading Bait next, good drama and well developed characters. Held my attentionstrong pairing of crime and fbi"}, {"userName": "Lydia", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/6600735-lydia", "userReview": "A great mystery introduction to the series, but watch out, its a cliff hanger!"}, {"userName": "Diane Higgins", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/16416156-diane-higgins", "userReview": "Loved this book! I couldn't put it down! I highly recommend anything by Lisa Phillips. I've never been disappointed!"}, {"userName": "Nancy", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/20261476-nancy", "userReview": "I really didn't get this and where was the ending ??"}, {"userName": "Sheila", "userReviewDate": "Sep 01, 2014", "userURL": "http://www.goodreads.com/user/show/7284284-sheila", "userReview": "The main plot line to this story was good, and I liked the characters. I did have some problems with the story in that it seemed to progress a bit too much quickly and it seemed like there wasn't enough seriousness placed on the situation with the Chloroform killer. Putting myself in the story, I would think that there would be more terror and fear on the part of the characters; some of the lighthearted talk just wasn't in keeping with the somberness of a killer being on the loose. With that being said, however, the ending definitely has me on the edge of my seat, and I am eager to start Bait, the next book in the series.Thank you to Lisa Phillips for allowing me to review this book--the opinions which I wrote are my own."}, {"userName": "sandra sprenger", "userReviewDate": "Feb 23, 2015", "userURL": "http://www.goodreads.com/user/show/31049874-sandra-sprenger", "userReview": "Good read.Good storyline with strong writing. Enjoyed the fact that Ms. Phillips does not go into gory details about the victims. Our minds can do that on our own. Characters are still developing in the story. Only downside is the high-ranking to the book. I like sequels but leaving the plot hanging is not the way to end the book. That's why my rating is so low. I would have given it a 5 with an ending."}, {"userName": "Annie", "userReviewDate": "Jun 22, 2015", "userURL": "http://www.goodreads.com/user/show/26607110-annie", "userReview": "Great read!Definitely had me going, and the end of the book makes it positively impossible not to read the next book in the series. I think the author could have been a bit more fluid in the writing aspect, but the book earns a good four stars from me. Now for book one from this prequel: Bait! Can't wait!"}, {"userName": "Nichole", "userReviewDate": "Apr 22, 2014", "userURL": "http://www.goodreads.com/user/show/8468536-nichole", "userReview": "Great read!Definitely had me going, and the end of the book makes it positively impossible not to read the next book in the series. I think the author could be a bit more fluid in the writing aspect, but the book earns a good for starts from me. Not for book one from this preq: Bait"}, {"userName": "Deloris  Mercer", "userReviewDate": "Feb 03, 2015", "userURL": "http://www.goodreads.com/user/show/36700875-deloris-mercer", "userReview": "Excellent bookExcellent book. Thank you Ms. Phillips for writing such a wonderful read. Great characters and the setting is very good. I do not like reviews that just reflect the storyline, or give away the plot. Just want the \"facts\" , is it a good story, how is the language?......This is great writing."}, {"userName": "Ann Behrens", "userReviewDate": "Mar 05, 2016", "userURL": "http://www.goodreads.com/user/show/38617148-ann-behrens", "userReview": "Predictable, but ended wanting more.Would have liked it little more character development and interaction. Two main characters family relationships could have been more of the story. Because of how it ended, I have downloaded the next book, and hope to learn more about these people as well as new characters introduced."}, {"userName": "Barbara", "userReviewDate": "Sep 12, 2015", "userURL": "http://www.goodreads.com/user/show/11737928-barbara", "userReview": "Sweet romantic suspenseSweet romance and suspense. Hero and heroine both have dysfunctional backgrounds, which makes opening themselves to love very hard for them. Book was well written. I would have given it a 4 if had been longer."}, {"userName": "Sharon", "userReviewDate": "May 19, 2014", "userURL": "http://www.goodreads.com/user/show/26173369-sharon", "userReview": "I struggled at times to follow the author's narrative but the book was okay, over all. This isn't a stand alone book, in my opinion, because the story doesn't have a resolution. The plot continues in \"Bait: Denver FBI Book 1\"."}, {"userName": "Bree", "userReviewDate": "May 07, 2014", "userURL": "http://www.goodreads.com/user/show/24445160-bree", "userReview": "Very short story. Was a bit confused until I realised at the end of the book their was a sample of the next book. Liam witnesses an abduction in his neighbourhood. It ends up being the girl who he has the hots for sister."}, {"userName": "Kay (Brigidsmomma) Compton", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/37593918-kay-brigidsmomma-compton", "userReview": "I really enjoyed this, but was a tad disappointed when the serial killer is not caught at the end, and this ends up being a prequel to another book. Still, it's a good read and the pace moves fast and keeps my attention without too much gore or violence to wade thru."}], "description": "Special Agent Liam Conners is the only witness to his neighbor’s abduction: the Chloroform Killer has struck again.But when his neighbor, Andrea James, returns from a business trip, they realize the killer’s mistake—her sister has been abducted in her place.Now the killer is coming for Andrea, and Liam and his partner are the only ones standing in the way. Can they catch the killer and protect the target?A Christian Romantic Suspense", "title": "Target\n      \n          (Denver FBI 0.5)", "url": "https://www.goodreads.com/book/show/21398732-target", "average": 3.93, "cover": "https://images.gr-assets.com/books/1394207383l/21398732.jpg", "reviews": 48, "authors": [{"url": "https://www.goodreads.com/author/show/7792356.Lisa_Phillips", "name": "Lisa     Phillips"}], "type": ["Christian", "Christian Fiction", "Suspense", "Mystery", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/21398732-target", "http://www.goodreads.com/book/show/22665184-sanctuary-lost", "http://www.goodreads.com/book/show/23611786-sanctuary-buried", "http://www.goodreads.com/book/show/21409755-bait", "http://www.goodreads.com/book/show/32509579-sanctuary-forever", "http://www.goodreads.com/book/show/25610649-sanctuary-breached"]}