{"ratings": 2188, "userreviews": [{"userName": "Whitney", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/66575688-whitney", "userReview": "This is a sweet little novella about Rip and Esme coming together at last! |sighs dreamily| I really wanted this to be a 5 star read for me, but I wanted more. I needed more. But then I realized how lucky I was to even be reading about their story in the first place. It is assumed that Esme and Rip are a couple at the end of Kiss of Steel. Without this novella, we wouldn't have gotten to see the struggles Rip had to endure and Esme's longing for him. Bec McMaster blessed us with their heartwarming story, and while I still wanted more, I was happy with what I was given. \n\"I'll wait,\" she whispered. \"I'll wait for you, John. Always.\"\n\n4 STARS!"}, {"userName": "Celestine", "userReviewDate": "Oct 06, 2016", "userURL": "http://www.goodreads.com/user/show/13928747-celestine", "userReview": "The Caretaker and the ColossusI love to read stories about big, ugly guys who get their happily-ever-after. This novella takes place after Kiss of Steel and expands the story for Esme and Rip. If you recall, Rip is the sidekick behemoth with the mechanical arm in the first book of this outstanding series. For a novella, I thought the story was satisfying and well-paced, with very strong characterization.Housekeeper Esme is 30-something, curvy, kind, and has been harboring a crush on Rip for years. Standing in their way is Rip's insecurity with blood cravings following his recent turn. As a big guy without the face of an angel, a missing arm, and a reputation as an enforcer in the toughest neighborhood in London, John \"Rip\" Doolan doesn't see the lovely Esme falling for him anytime soon. However, with a little meddling from Blade (book one), a mystery to be solved regarding missing women, and a little ego-baring honesty, these two mismatched characters might find love amid the squalor of McMaster's steampunk world."}, {"userName": "☆★Tinja★✮ A Court of Pizza and Laziness", "userReviewDate": "Apr 25, 2016", "userURL": "http://www.goodreads.com/user/show/11904521-tinja-a-court-of-pizza-and-laziness", "userReview": "Awww I loved Esme & Rip <3"}, {"userName": "Marta Cox", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/14378267-marta-cox", "userReview": "I'd somehow missed this novella that fits between Kiss of Steel and Heart of Iron but was overjoyed to discover yesterday that I had it lurking in my kindle library. Let's face it the London Steampunk series has amazing world building with characters that scream out at the reader and are impossible to resist.Rip is such a tortured hero and I'm pretty sure numerous readers will enjoy his story. Savaged and nearly at deaths door he has struggled to learn to cope with his hunger and dark thoughts. Yes he wants Esme with every bone in his body but there's no way he would ever hurt her so it's pretty ironic that that's exactly what he does.Esme has made a life for herself in this peculiar 'family that she now lives with. She's felt a closeness to the man she calls John but is she kidding herself ? Yes Esme can be patient but what if he really doesn't want her at all ? This couple are so exactly right for each other that the sweetness of it all just takes my breath away. Friends to lovers doesn't usually really grab my interest but the way this story is written meant I had no doubts that they were meant to be a couple. They struggle, they confuse each other and then with a little meddling they are almost on the same page . Alas though in violent and dangerous London it's best to always look over your shoulder!"}, {"userName": "Caz", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/4368838-caz", "userReview": "A really nice filler to complement book one Kiss of Steel and lead the way into the next book, Heart of Iron - the edition I read has the story, Lena's Decision, included as well.Tarnished Knight picks up the story of Blade's housekeeper, Esme and one of his lieutenants, John \"Rip\" Doolan who was so badly injured during a vampire attack that the only way to save him was for Blade to infect him with the craving virus.Rip is having an incredibly difficult time adjusting to the cravings, and it's badly affected his friendship with Esme. In the previous book, there was clearly the potential for something to develop between them, but now that Rip is worried about controlling himself around her, he's distanced himself and she doesn't know why.That whole \"I can't be with you because I might hurt you\" thing is a common trope in romance, but it's well done, and the author skilfully combines the romantic storyline with one involving the Slashers, a group of nasties who kidnap people, drain their blood and then sell it to the draining factories in the East End.For a novella, there's plenty of meat on the bones of the story, lots of action and some steamy love scenes. Now all I have to do is find the time to read book two..."}, {"userName": "Susan (susayq ~)", "userReviewDate": "May 23, 2013", "userURL": "http://www.goodreads.com/user/show/5305480-susan-susayq", "userReview": "I am in love with this world! I can't wait to get somewhere that my kindle picks up wifi to get the next book lol Rip was such a tortured hero - my favorite kind :) Rip and Esme had huge communication problems. Thankfully, Blade meddled and helped them get it straight :) The few chapters at the end about Lena and Will were wonderful! And as I said at the beginning of the review, I can't wait for the next book which is theirs :)"}, {"userName": "NiteReader", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/7986862-nitereader", "userReview": "A special little treat!!I love the steampunk \"Whitechapel\" world Ms McMaster has created in this series. In this book we get a peek into the love story of Rip and Esme. They fit so perfectly together; they really have that spark! The reason I knocked off a star is because their story is too short! (That seems to be my biggest complaint with most novellas!)"}, {"userName": "Laura (Kyahgirl)", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/2906277-laura-kyahgirl", "userReview": "4/5; 4 stars; A-I really enjoyed this novella. After meeting Rip and Esme in book 1, it was so nice to read more about them and more about the steampunk world that McMaster has created. I am really enjoying this new author."}, {"userName": "Aly", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/3528600-aly", "userReview": "It's been six months since Rip got the craving virus to save his life. With a new thirst for blood, Rip is determined to keep his distance from his friend Esme because he's afraid to hurt her and she confuse him too. No one can pretend that Esme is not a patient woman. Blade's housekeeper waited and waited for Rip to realize she wants more than his friendship. But if she doesn't want to wait forever, it's gonna be up to her to show him what she wants. And maybe she'll need someone to interfere because the big, stubborn and frustrating man doesn't seem to take the hint either. So it was not the best plot and romance wise, probably because there wasn't enough time for deeper developments and more adventures, but I'm still glad I finally got the chance to read Rip and Esme's story. We see more than ever how Blade and his friends became like a foster family. I also liked the fact it was kind of a Christmas novella :)"}, {"userName": "Sarah", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/3344685-sarah", "userReview": "Tarnished Knight is a novella that was originally offered as a free read on Bec McMaster's website but that has since been released as an ebook including an additional prequel story for the 2nd book Heart of Iron. This story is set approximately six months after the ending of Kiss of Steel and I'd definitely recommend it to fans of the series before you move on to book 2.I really liked both Rip and Esme when we were introduced to them in the first book, they are both incredibly loyal members of Blade's household and I it was obvious from the beginning that they had feelings for each other. When Rip was badly injured and on the verge of death Blade's only choice was to infect him with the Craving virus to ensure that his friend would survive. Rip has spent the last six months learning to control his hunger but he hates what he has become. He loves Esme but doesn't feel worthy of her so he is determined that they will remain friends and nothing more. Esme has had feelings for Rip for a long time, he is her best friend but he is also everything she ever wanted in a man, someone who is kind, generous and protective. She wants desperately to become not just his Thrall but also his lover but she doesn't know how to make him realise that. She has tried subtle hints but nothing seems to be getting though to him and she is heartbroken by what she feels is his rejection of her offer.Rip and Esme don't have the easiest start to their relationship but they have a solid friendship to build upon and the pair also have great chemistry. It is only really a misunderstanding between them and Rip's lack of confidence in his ability not to hurt her that is keeping them apart. When they are forced to work together to protect Blade's territory from a new gang of Slashers they can't stop their emotions from getting involved but can Rip keep Esme safe when their enemy sees her as the perfect target?Tarnished Knight is a fabulous novella in a brilliant series that I'm looking forward to continuing. I loved Rip and Esme's story and it was great to see the pair of them start to work things out. I also really enjoyed the prequel to Heart of Iron, Will and Lena are both really interesting characters and it was a nice way of getting inside both of their heads and understanding what they think of each other. I have a feeling I'm going to love their book even more than this one!"}, {"userName": "Melindeeloo", "userReviewDate": "Dec 30, 2012", "userURL": "http://www.goodreads.com/user/show/2766907-melindeeloo", "userReview": "So far this is available for free on the authors website... Tarnished Knight falls sixth months after the first book in McMaster's London Steampunk series (Kiss of Steel), there are enough hints about the 'world' here that Tarnished Knight probably could be read without reading the first book, but it is more fun if you have since there are references to what has gone before, plus Kiss of Steel is worth reading as well. I really liked this novella, it was originally serialized with one chapter a day on the author site as a Christmas present to fans, but I am glad I waited and read the whole thing in one sitting. I loved both of the leads: Rip (Blade's enforcer) and Esme (Blade's housekeeper) who had been friends but had yearned for more. After the events in the previous book changed Rip, he no longer feels that he can pursue Esme and they do a bit of a rejection polka here as Esme tentatively tries to reveal her heart - but a bit too subtly for Rip to be sure of what he is turning down. Fortunately - as poetic justice - Blade's 'meddling' saves the day, but Blade's enemies do their best to make sure that Esme and Rip's happily is not ever after.This was wonderful, I love the friends to lovers trope and I loved seeing more of the London Steampunk world. Can't wait for the next book Heart of Iron (May 2013.)"}, {"userName": "Mariana Zapata", "userReviewDate": "Jun 01, 2013", "userURL": "http://www.goodreads.com/user/show/7595879-mariana-zapata", "userReview": "I might be biased toward this book because I started harboring a major crush on Rip from the first moment he was introduced in Blade's book (a big man with a mechanical arm? Have mercy on my ovaries). I was beyond excited to see John and Esme's relationship hash out, and though I would've killed for a full-length novel, I loved that this wasn't rushed and didn't feel short. On another note, Bec McMaster, I love you. Please write a book a month. I'd buy every single one."}, {"userName": "Iliada", "userReviewDate": "Sep 01, 2015", "userURL": "http://www.goodreads.com/user/show/15329466-iliada", "userReview": "3.5 stars It's not a secret I'm not a fan of novellas, but as far as novellas go, this was pretty good. I loved the theme of this little book and I just wish it was longer. Oh well...As a bonus there's a little introduction for book #2 that will whet your appetite to read more about Will and Lena."}, {"userName": "Arie ☂", "userReviewDate": "Nov 07, 2015", "userURL": "http://www.goodreads.com/user/show/604059-arie", "userReview": "4.5 stars. I would like to rename this 'Misunderstandings and Mechanical Arms'. This was a fabulous little christmas tale that gives you insight into more than just Esme and Rip's dance around each other. I wish this novella was longer, but I'm absolutely salivating for Will's story now. Love, love, LOVE."}, {"userName": "Amyiw", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/6396633-amyiw", "userReview": "I read this out of order and after Lena and Will's book, which is the next one. I'm glad I did because it was short enough that it was easy to get into, and reconnected me to the series. I didn't like Lena here as she is a bit of a brat but in her own book she is all grown up and I liked her even less. Will was great but Lena was self-absorbed. So Esme and Rip (John) make me want to go on..So this novella of about 160 pages put my faith back that perhaps not all the women are going to be unlikable. I'd been avoiding reading on. Here we have two insecure characters when it comes to thinking they would be chosen for love. They both know they are valued by their friends and those that they've made family but for love... Well, Esme was thrown out by her husband's family after he died and then as Blade's thrall, he never chose her as a mate. John has mechanical parts and that makes him unwanted by many. Now that he is (vampire) a Blue Blood, he doesn't want Esme because she thinks she \"should\" or feels \"obliged\" to become his thrall. He wants her as a lover but before the craving (becoming vamp) he didn't think he was good enough, and now without the control needed, he thinks he is even less.To be fair, John really doesn't understand relationships. His assumptions hold the relationship back. Esme might not come out and say \"I want you for sex\" but I think kissing him passionately is quite enough. Yet, he runs away because of the craving and then makes assumptions, the wrong ones. He almost is simple minded about relationships. It is sad how he sees himself in women's eyes, whores didn't even want him as a brute of a burly mech man. Now whores are the only ones who would accept him and it is only because of the craving and the euphoria it brings. I really liked them both but felt it was hard for Esme to take the hurt he creates with the assumptions he makes.Really good story and relationship. Very nice to see the others and the Christmas that they make."}, {"userName": "Clephiro", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/7357268-clephiro", "userReview": "This was a cute and quick novella set between the first and the second books in the London Steampunk series.So in the first book Rip clearly had a thing for Esme, but they never really got together. When Rip was infected with the Blueblood virus, it took him a while to get it under control. Esme has just been waiting patiently for that to happen in the hopes that Rip will totally want to, you know, drink HER blood.Rip and Esme were pretty cute together but like 100% of all the problems could have just been resolved by having a mature conversation. Bec McMaster also really loves the macho super-manly man archetype and that may be wearing a bit thin on me. I did really enjoy that even the novella added to the world building and I am looking forward to the second book in the series."}, {"userName": "Amanda", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/4726159-amanda", "userReview": "This book was reviewed on Where the Night Kind RoamI very quickly came to love this series! I am so glad that Anne from Under the Covers Book Blog recommended this series to me. It is a unique blend of historical, paranormal and steampunk. This book takes place approximately 6 months after the first book left off. Rip was given the blood-craving to survive a mortal wound at the end of the first book. It was Esme who provided blood for the first time to Rip so that he would survive. For the last six months Rip has been fighting his control of the craving. He has no intention of ever letting Esme be his Thrall. He believes that she is better than that, better than him. For the past six months Esme has been waiting for Rip to take her as his Thrall. She has would give anything to be so close to him, only he doesn’t seem to realize that he is her craving. In this novella we are taken on a rollercoaster of misunderstandings which make for an entertaining read. Esme and Rip can never quite seem to get on the same page, he can’t believe that she would want likes of him and she can’t seem to make him understand that she wants him as more than just her friend. She is ready to take their friendship to the next level, more than ready, like years ago ready. But he never makes the move. Rip is a giant but a gentle giant at heart, Esme’s friendship means everything to him and he is not willing to do anything to jeopardize that. He can’t seem to make Esme understand that he respects her too much to take her to Thrall. When the Slasher’s make a play for Blade’s territory, it is Rip that risks his life to take them out. Only the tasks becomes more than he can handle alone. When woman start disappearing he realizes that everyone is in danger. Could it be that Esme will be the next victim of this sadistic bastard. The danger that the Slasher’s pose adds an exciting element of danger to the story. This book may not be very long but it certainly packs all that it can in a short span of time. This book is an action packed tale with plenty of romance. It was a fantastic installment to this exciting new series!"}, {"userName": "Cindy", "userReviewDate": "Sep 29, 2016", "userURL": "http://www.goodreads.com/user/show/42723186-cindy", "userReview": "Well writtenThe world in this story is getting even more detailed and vibrant. This time we get the perspective of Esme and Rip. They were like teenagers really, which was a bit frustrating. So many communication issues. Rip really isn't as dense as he seems with Esme's clear intentions, it's just that he has been told that he's big and scary so he doesn't see himself as someone that could be loved. That broke my heart. It probably would have been more clear if there was more details on his past."}, {"userName": "Katie", "userReviewDate": "Aug 13, 2014", "userURL": "http://www.goodreads.com/user/show/1710785-katie", "userReview": "Uh, so this feels like a weird complaint to make about a novella, but I think this might've been too long for me! Rip was a little TOO stupid for my tastes, especially since Kiss of Steel made me kind of think things were somewhat settled between him and Esme. And the plot seemed a bit too simplistic, I guess.Still, I'm glad Rip and Esme got their story told!"}, {"userName": "Lisa - (Aussie Girl)", "userReviewDate": "Dec 25, 2012", "userURL": "http://www.goodreads.com/user/show/3741108-lisa---aussie-girl", "userReview": "A Christmas novella serialised by Bec McMaster and only available at this stage on her website. Beautifully romantic tale set in her London Steampunk world this is the story of Esme, Blade and Honoria's housekeeper and John \"Rip\" Doohan Blade's enforcer. Amongst the mystery of disappearing people in Whitechapel and the evil slasher gangs, Rip must face his own demons if Esme is ever to be his. If you loved Kiss of Steel, you must read this. It's great."}, {"userName": "Carmel (Rabid Reads)", "userReviewDate": "Apr 23, 2013", "userURL": "http://www.goodreads.com/user/show/4561998-carmel-rabid-reads", "userReview": "I really enjoyed Rip and Esme's love story; they are two secondary characters that definitely deserved their own HEA. Felt more like a full-length book than a novella―a great addition to the London Steampunk series! You'll probably get more out of this one if you read Heart of Iron first though."}, {"userName": "Dawn", "userReviewDate": "Jul 27, 2016", "userURL": "http://www.goodreads.com/user/show/44434125-dawn", "userReview": "++Spoilers+++Not my thing.I am done with this author. She wrote one book in this series that I liked. Not going into it.Safety-not safe for me too pissed to go into it.Returned for refund"}, {"userName": "Monique", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/40572117-monique", "userReview": "A sweet and cute novella about Esme and Rip finally getting together.I would prefer a full-length novel because the story was a little rush but I still loved it."}, {"userName": "Kira Simion", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/27960680-kira-simion", "userReview": "3.5 stars.An adorable short story that I felt could have been a little more fleshed out for the character development when it came to backstories and friendship/romance backgrounds. However, I find that the writing is one of my favorite styles as it includes detail during the action and good pacing for the majority of the story.<3"}, {"userName": "Danielle Gypsy Soul", "userReviewDate": "Sep 22, 2016", "userURL": "http://www.goodreads.com/user/show/35114142-danielle-gypsy-soul", "userReview": "I fell in love with this world when I read the first book and I still love it in the second book. This was a short novella about two characters John \"Rip\" and Esme that we met in the first book. Esme and John definitely had some communication issues and John was a bit of a tortured character but I enjoyed this quick romance. I really liked the suspense portion of the story that dealt with the Slashers who were stealing women within Blade's territory and I enjoyed catching up with Blade and Honor and watching Blade \"meddle\" in John and Esme's relationship. Overall a fun, entertaining and quick edition to the series. I can't wait to read the next book with Will and Lena. I highly recommend this series for PNR fans!"}, {"userName": "Beth", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/5375148-beth", "userReview": "In a world were vampires rule, the dark and desperate human lives have one hope, the protection of a kind vampire. When the protection is threatened, newly turned Rip will do everything in his power to stop these attacks and restore the trust of the people of their town.This is a wonderful novella length story about how Esme and John \"Rip\" Doolan finally get together. As a wonderfully crafted steampunk series, this novella provides some much wanted background into the side characters we've come to love. Bec McMaster once agains blends a dark and gritty existance into the perfect vampire romance story.Written by: Bec McMasterSeries: London SteampunkSequence in Series: 1.5Print Length: 162 pagesPublisher: Bec McMasterPublication Date: April 21, 2013Rating: 4.5Genre: Steampunk, Fantasy, RomanceAge Recommendation: AdultBec McMaster's WebsiteThis book is free today 6/29/2013 on Amazon Ebook. Unsure how long this deal will last so check price before you one click.You can also find this book on Barnes & NobleFor more reviews check out Tome Tender's Book Blog or find us on Facebook."}, {"userName": "Ami", "userReviewDate": "Apr 05, 2014", "userURL": "http://www.goodreads.com/user/show/134600-ami", "userReview": "After finishing Kiss of Steel I immediately went hunting for the sequels. I started with this novella as it was listed as #1.5. The story was taken place six months after the event in Kiss of Steel; after Rip was turned into a blue blood by Blade.While the main issue of this story was COMMUNICATION problem -- which sometimes I dislike -- somehow I couldn't get myself being annoyed by it because it did create a delicious tension. Rip was an idiot, that I could say. Esme had been throwing hints, heck she even made the first move. And this guy truly couldn't see what was in front of him, when even Blade and Will could?! Come frickin' on, Rip!!Oh, I loved that Blade was doing some \"meddling\" to put Rip on the right path. Blade was such a papa bear *LOL*. He took care of his family.I found out that this novella started as serialized free story on the author's website for Christmas (huh, THAT was why there was Christmas scenes here, with the men cooking, which was adorable!). BUT it didn't feel like a work-in-progress. The story's flow was smooth. I am totally in love with this world and characters. And after reading the short \"Lena's Decision\" which was short of prequel for the next book, I really can't wait to read Will and Lena's story!Personal Steampunk Romance Challenge April 2014: story #2"}, {"userName": "Noura ", "userReviewDate": "May 09, 2015", "userURL": "http://www.goodreads.com/user/show/17896144-noura", "userReview": "A quick one day read, this one tells the story of one of Blade's men, Rip who was brutally attacked by the vampire in the first book and had to be turned into a blue-blood in order to survive and live. 6 months after the attack, Rip/ John is still trying to come to terms with his change as a blue blood and is very wary of showing his love to Esme, Blade's widowed housekeeper. The story revolves around how she tries to convince him that their love is worth the risk and how he at last finds a way to accept his transformation while keeping Esme by his side.Has some Christmassy episodes thrown in (i personally wonder why many novellas and in-between stories such as this always have christmassy themes)"}, {"userName": "Erin Arkin", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/5488337-erin-arkin", "userReview": "Review to come"}, {"userName": "Melann", "userReviewDate": "Dec 29, 2015", "userURL": "http://www.goodreads.com/user/show/8779497-melann", "userReview": "Le format nouvelle (avec 120 pages sur ma liseuse tout de même) sert cette histoire, car on va à l'essentiel et on ne se perd pas en ressentiments inutiles ou péripéties ennuyantes."}], "description": "In the steam-fuelled world of Victorian London, vampires, werewolves and slasher gangs stalk the night and a man made partly of metal is about to discover just how far he'll go to protect the woman he loves…After a vicious vampire attack left him struggling to leash the dark urges of the craving virus, John \"Rip\" Doolan thinks he's finally starting to master the darkness within. The only thing that threatens to shatter his hard-won control is Esme, his closest friend and the only woman he's ever wanted. If the stubborn beauty ever realized precisely what was going through his mind, their friendship would be ruined.For six months, Esme has waited for Rip to recover and take her as his thrall, not daring to hope for more. Too afraid to put her heart on the line, she is devastated when Rip reveals that he never had any intentions of making her his.But when a savage gang of Slashers start causing havoc in Whitechapel, Rip and Esme have no choice. They must face up to the depth of the passion that burns between them and forge a new relationship…or risk losing each other forever.", "title": "Tarnished Knight\n      \n          (London Steampunk #1.5)", "url": "http://www.goodreads.com/book/show/17181953-tarnished-knight", "average": 3.82, "cover": "https://images.gr-assets.com/books/1363144626l/17181953.jpg", "reviews": 230, "authors": [{"url": "https://www.goodreads.com/author/show/5763301.Bec_McMaster", "name": "Bec McMaster"}], "type": ["Science Fiction", "Romance", "Fantasy", "Romance", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/17181953-tarnished-knight", "http://www.goodreads.com/book/show/17875087-tarnished-knight", "http://www.goodreads.com/book/show/27734421-de-sang-et-de-glace", "http://www.goodreads.com/book/show/13507512-kiss-of-steel", "http://www.goodreads.com/book/show/15927484-heart-of-iron", "http://www.goodreads.com/book/show/17310126-my-lady-quicksilver", "http://www.goodreads.com/book/show/17901769-forged-by-desire", "http://www.goodreads.com/book/show/18667312-of-silk-and-steam", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/11781578-lover-s-leap", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/36685093-the-unimaginable"]}