{"ratings": 39, "userreviews": [{"userName": "TC", "userReviewDate": "Dec 23, 2011", "userURL": "http://www.goodreads.com/user/show/4652823-tc", "userReview": "As I've gradually been opening my eyes to the fantasy genre this book looked like it wouldn't be too far from my comfort zone and well worth a look. This book is the first in the War of Whispers series. Rather than attempt to summarise the plot I'll leave that to the description.The two young main protagonists have a touching relationship that develops gradually as they journey to Claire. The childhood friends are bound by common experiences, not least watching their fathers battle their demons, but become closer when driven away from all they know. I found them both likeable, and particularly enjoyed Galadin's awakening. There are various sub-plots, including their fathers' efforts to raise an army and a storyteller who is keen to keep his identity under wraps. However I had no problem in keeping the threads clear in my mind, as moving between them was well signposted.This book has an epic feel, and it full of new lands, races and creatures. The history of the piece is clearly important and enough is revealed to support the developing plot, although I'm sure there are more revelation for future books. While I wouldn't go as far as to make a direct comparison with the Lord of the Rings it has that sort of feel about it. At times I found the volume of new places and characters a little overwhelming, and at others would have liked more description of characters like Elabea's rusk (a creature helping the pair through the trials they face) as I felt unable to visualise them properly. This would be my main critcism.I've read a few books this year that form part of a series where I have been frustrated by the ending. However this book ends with a massive revelation that is both an end and a beginning. As such I was satisfied yet enticed by the prospect of the next book. I'd also like to continue reading the series to find out how the paths of various characters cross and whether good or evil will triumph (and indeed whether good really is good)"}, {"userName": "Donna", "userReviewDate": "Feb 14, 2012", "userURL": "http://www.goodreads.com/user/show/5005350-donna", "userReview": "Received from author for review.Not too many books can truly be described as epic. Narnia, Lord of the Rings, Pullman's Dark Materials...and now TEARS OF MIN BROCK. This is one book that clearly deserves the 'epic' description. It is a marvelous fantasy tale.Book 1 in the War of The Whisper series.Elabea and Galadin (love their names) are two young people looking for answers. Answers which will explain how the \"Dark War\" impacted their lives. To understand the enormity of this question, you mustrealize that it is against the rules of Cauldron (current rulers) to speak or even ask questions about anything that happened prior to the Dark War.Elabea hears whispers from the land of Claire, an area which was supposed to have been destroyed during the Dark War. Her friend Galadin accompanies her to find the answers. I say accompany, but they are really running for their lives after the Cauldron discovers they are seeking answers.Are the whisperers good or evil?J.E. Lowder spins his tale as easily as C.S. Lewis creates the land of Narnia. Lowder's world is both good and evil. Faint spiritual undertones can be felt throughout this story.This story is labeled as a YA Fantasy novel. I think, even younger audiences will appreciate this story. I understand it started out as a bedtime story. It is truly a classic good vs evil tale.My only question....who will play Elabea and Galadin in the movie version?"}, {"userName": "Danica Page (One Page at a Time)", "userReviewDate": "Dec 19, 2011", "userURL": "http://www.goodreads.com/user/show/2368342-danica-page-one-page-at-a-time", "userReview": "I’ve been reading a lot of fantasy novels lately, but this one stuck out. This idea was so original. The idea of the war of whispers was intriguing and fresh. There was still the battle by swords, but the main battle was being fought by whispers one from the Cauldron, the evil whisper, and one from the Only, the good whisper. I also loved the character Elabea and Galadin from the very beginning and they grew on me as the story progressed. By the time the novel ended, I truly loved them both. The other main characters and supporting characters were also equally intriguing and entrancing. I’m interested in seeing how Lowder develops his characters in the next novel in the series and will admit that I myself want to read the sequel.Often times I feel invested in the novel and feel like I have to read the next in the series to see what happens, but this time I actually want to read the sequel. I actually want to see how Lowder expands his story and to see what happens.It took me thirty pages or so to really get into the novel, but after that I was hooked. A great read.For my extended review, please visit this link."}, {"userName": "Rachel", "userReviewDate": "Jan 27, 2012", "userURL": "http://www.goodreads.com/user/show/5526736-rachel", "userReview": "Here's the truth about me when it comes to fantasy: I'd love to write it, but I don't know how much I love reading it. I loved Finnikin of the Rock by Melina Marchetta, so that's kinda what sparked it. I wasn't sure about Tears of Min Brock when I got it from the author. Naturally, it blew me away. It's the story of Elabea and Romlin as they hear the Call to go to Claire, because she is to a great storyteller, and he a great warrior. It's told in third person, but shifts from Elabea and Romlin to others. Which really made the book interesting and set it up the sequel. The plot line and characters were also so well developed. Tears of Min Brock lived up to my expectations for fantasy reads. So good work Mr. Lowder!"}, {"userName": "Shelley", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/2094389-shelley", "userReview": "Author's guest post at my blog:https://bookfare.blogspot.com/2016/10..."}, {"userName": "L.A.", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/4055856-l-a", "userReview": "Article first published as Book Review: Tears of Min Brock by J. E. Lowder on Blogcritics. Some of the best stories I can remember are those that take me out of my own existence and insert me into a world I have never known. I get to become a part of the story and the adventure and excitement also becomes a part of my own. In Tears of Min Brock by J. E. Lowder, I have again found one of those fascinating epic fantasy worlds that are daunting and dangerous, yet broodingly beautiful as well. Set in a time after the Dark War, Lowder brings about an adventure that is frightening and visual. His captivating world is filled with the darkness and dread and full of the creatures that cause fear, and yet throughout the story weaves an intricate pattern of light. He takes his characters into untold highs and lows of problems and beliefs as well as concerns for their families. When the darkness fights the light, we often rely on the light to win, yet what happens when it doesn’t? In a world where a darkness rules, Lowder has brought us whispers of light, and a fierce young heroine. Can a young girl along with her best friend bring about the destruction of darkness, or is the light that whispers to her just a figment of her imagination?In a deep and mysterious world where evil has appeared to win the war, Lowder brings us a story of hope and longing. His descriptions and embellishment’s are both enchanting and dangerous. His young hero, Elabea can hear the whisper of the lightness from the land of Claire that had been rumored to have been destroyed by the Ebon, during the dark war. Elabea is slated as a storyteller, one of the great magic users of time, but will she live to fulfill her destiny? She is young and yet malleable, but her belief is deep and profound.Her best friend Galadin too begins her journey with her, but he has his doubts. He does not hear the whispers, but he does believe in her. Both of their fathers fought in the war, and were now different men from the proud warriors they once were. Galadin dreams of becoming something more. He knows he will follow Elabea where ever she leads, and soon he too finds his place in this story.They are joined by others, an old storyteller from before the war, as well as a hero many thought had died during the war. But can they escape the false whispers of the cauldron. How to they decipher which are the true ones, and when they do, will it be too late? I enjoy fantasy and I found myself unable to put this one down. The evil and danger are inherent, and yet the light finds a way to twist throughout in thoughts and actions. The whisper is exciting and the fight and chase scenes hold you spellbound. In a world where the very darkness seems to hold sway, brightness seems to burn through the pages. If you love the power of words and enjoy epic fantasy this is a world waiting for you. Our heroine is a 14 year old girl and with her is her young best friend, so while this could be construed as a YA Fantasy, make no mistake, it heralds the themes and storyline that cross over into the adult experience. I found this to be one of my favorite books of the year, and am looking forward to the sequel. Lowder writes a story that does not disappoint. This would be a wonderful work for your budding reader and one for your long-term reader as well. A wonderful book for your library, Lowder has ratcheted up a notch on the playing field.This book was received free from the author. All opinions are my own based off my reading and understanding of the material."}, {"userName": "Victor Gentile", "userReviewDate": "Oct 30, 2012", "userURL": "http://www.goodreads.com/user/show/2528881-victor-gentile", "userReview": "J.E. Lowder in his new book, “Tears of Min Brock” Book One in The War Of Whispers series published by WordCrafts Press gives us a fantasy adventure that introduces us to Elabea.From the back cover: Areall crept toward the parchment as if an evil spirit possessed it. “Its beauty is its deception,” she whispered. “Burn it, child. Destroy it or you will curse us. The Cauldron will know. The Cauldron will see. They will come.”Elabea calmly lifted the parchment from the coals, where it had refused to burn. “How can something so beautiful be evil?”The Dark War is over. Betrayal, defeat and death forever accompany any mention of the battlefield known as Min Brock. The shining kingdom of Claire is no more. Any hint of rebellion is supressed by the constant drone that echoes throughout the land. The Oracles of the Council of Ebon, the dark lords who feed the perpetual flames of the Cauldron, forbid even mentioning the name of the Only, the King of Claire, on pain of death.Yet in the night… a whisper comes to Elabea, a girl of 14 summers, who hears and dares to believe there might be more to life than the drone. Accompanied by her lifelong friend, Galadin, Elabea embarks on a dangerous journey to become one of the most powerful creatures in the land – a storyteller. Along the way she must learn to discern the true whisper of Claire from the counterfeit whisper of Ebon. One might lead her to restore light and life to a world ruled by darkness. The other leads to certain death.The War of Whispers has begun.“Tears of Min Brock” is going to become a classic right up there with “The Lord of the Rings”. J. E. Lowder has created a new world filled with new Peoples, dark terrors as well as new and old civilizations. And then there is the quest. All classic stories rest upon a quest and the heroine, Elabea, has been given the quest in a whisper that no one else seems to hear. With her friend, Galadin, they set off to find the lost kingdom of Claire that everyone believes to be destroyed in a centuries old battle. Along the way they meet new quest mates and evil forces set to destroy them. Fasten your seat belts this is going to be a wild, exciting ride. Mr. Lowder knows how to write a story that is full of suspense and action. In addition to being a great story ”Tears of Min Brock” is also an allegory for the Christian experience. To really appreciate just how terrific this book is you really have to read this book for yourselves. This is not a book that you want to rush through. ”Tears of Min Brock” is a book to be savored as you try to understand the deep things that Mr. Lowder put in his story. Mr. Lowder has done an outstanding job of bringing Elabea and her quest adventures to life on these pages. I liked this book and recommend it highly! I can hardly wait for book two in this series.If you would like to listen to interviews with other authors and professionals please go to www.kingdomhighlights.org where they are available On Demand.To listen to 24 hours non-stop, commercial free Christian music please visit our internet radio station www.kingdomairwaves.orgDisclosure of Material Connection: I received this book for free from WordCrafts Press for this review. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255  : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Hollie", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/1981372-hollie", "userReview": "This review was first posted on Music, Books and TeaI honestly have no clue where to start my review. I haven’t read a lot of fantasy this year. I’m not a particularly huge fan of the genre, so a book has to sound really good for me to be interested in reading it. Let me say this: reading a book as good as Tears of Min Brock is making me want to grab every single fantasy book I possibly can and devour them.This book gripped me right from the very beginning, and when I wasn’t reading it, I was thinking about it.The action starts right from the beginning, and does not let up at all. I honestly don’t see how anyone could get bored reading a book like Tears of Min Brock, as there is always something interesting going on. If we’re not following Elabea and Galadin’s journey, we’re travelling with Newcomb and Lassiter, or we’re watching Brairtok receive news that his Ebon soldiers have been defeated once more. Any fantasy novel has a huge cast of characters, and it’s easy to get confused, but each character had a distinctive voice, and the story flowed well.As the story mainly centred around Elabea and Galadin, I became attached to these two characters the most. Elabea was desperate to escape her boring Allsbruth life, and when the opportunity arose, she took it. And Galadin, her loyal friend, accompanied her on that journey to the mystical land of Claire, all on a mysterious parchment shot onto their doors and by the words of Il-Lilliad, one of the last story-tellers ever. I found the concept of the story-tellers to be so cleverly thought-out and executed, and it was easy to see why the Cauldron feared them, because of the power they held by being able to read someone’s heart to discover all their secrets. It’s easy to see that Elabea will continue to grow and be an excellent story-teller, if her progress from Tears of Min Brock is anything to go by. And Galadin’s transformation into Romlin was just incredible. He went from being a boy, fiercely loyal yet still slightly ignorant to being a man, still loyal, but able to see what was expected of him more clearly. I loved these two characters so very much, and I cannot wait to see what is in store for them in the next two installments of the series!There are tons more things I could gush and praise about, but I honestly haven’t got the space to do so in this review. I can only encourage you to get yourself a copy of this book and read it. This has opened me up to a whole new genre that I’ve read very little of in the past, and if every fantasy book is nearly half as good as Tears of Min Brock, then I know I’m in for a treat. And finally, what was up with that ending?! Talk about a cliffhanger. I need the second book. Honestly. I might just have to re-read this one until I can get my hands on a copy! But if you want a fantastically written, well thought-out fantasy book, then this is the one that you want.I received this book in exchange for an honest review."}, {"userName": "Jonel Boyko", "userReviewDate": "Jun 01, 2013", "userURL": "http://www.goodreads.com/user/show/15432163-jonel-boyko", "userReview": "Lowder creates an awe inspiring world in the first novel of this series. This world is a mix of medieval and the fantastical. It melds brilliantly in order to create a uniquely new and solidly built world as a backdrop for this awesome novel. It also has all of the usual elements of a fantasy tale – magic, war, fantastical creatures, character names that you’ve never seen before and will never see again, etc – but Lowder puts these all together with a twist. Through this tale he brings to light the importance of stories to spark the imagination in those of all ages, which is true not only in the story but in the world as a whole. It’s all about the power of the written word – something we experience every time we read but rarely, if ever, find as the subject matter for a series. Lowder also develops an intricate history of the land that is presented in the way of the bard. It is so captivatingly real that you feel yourself traveling through time with the storyteller.The main characters in this novel are quite well developed. I enjoyed that they all started together only to travel on a few separate journeys. Yet, at the same time you have the feeling that they will be reunited in the future. By following their separate trials and challenges you get to know a great deal about the characters, the land in which they live, and the challenges that they face. I love that none of the characters are intrinsically good or evil. They all had their choice. They could choose which whisper to follow. None were forced. The battle of willpower was interesting to see, and the choice was left to each and every character: to fight for good, to fight for evil, to do nothing.This novel was a brilliant escape from reality that kept me wrapped up in its brilliantly fabricated world with equally amazing characters. This is definitely a series that I’ll be following closely throughout.Please note that I received this novel free of charge from the author in exchange for an honest review."}, {"userName": "Ruhi", "userReviewDate": "Jun 11, 2013", "userURL": "http://www.goodreads.com/user/show/6379326-ruhi", "userReview": "I won a free e-copy of this book from http://purejonel.blogspot.ca/ Yayy!! Looking forward to reading it!"}, {"userName": "Isaac Ezell", "userReviewDate": "Jan 01, 2013", "userURL": "http://www.goodreads.com/user/show/15986697-isaac-ezell", "userReview": "Really enjoyed this book. Powerful allegory. Really made me examine where I might be living in fear."}, {"userName": "Jane", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/28376786-jane", "userReview": "Not in a fantasy phase of life right now."}, {"userName": "Brian Wilkerson", "userReviewDate": "Jun 14, 2013", "userURL": "http://www.goodreads.com/user/show/8125445-brian-wilkerson", "userReview": "A Trickster Eric Novels reviewJ.E. Lowder asked me to read \"The Tears of Min Brock\". It is the first book in the \"War of the Whispers\" saga between The King of Claire and the Cauldron of Ebon. I will examined plot, characters, polish and then assign a grade.PLOTThe plot follows the classic Hero's Journey. The hero (in this case, Elabea) receives the Call to Adventure and journeys into the Unknown World where they encounter Trials and Tribulations. The hero's goal is to arrive at their destination and then return with a boon for their people. In this case, Elabea wants to become a full fledged storyteller so she can inspire the people of her hometown and overturn Ebon's oppressive rule. This structure, plus the rich and enchanted setting Mr.Lowder has developed, give this story an epic and mystical air. It was a joy to follow her journey to Claire.I also like Mr.Lowder's take on the Hero Of Another Story. Elabea is the main heroine but her journey is only 1/4 of the narrative. There are others working toward the overthrow of Ebon and facing their own trials and tribulations. To my surprise, the story doesn't feel cluttered because of this. Instead, they enrich the story. Perhaps this is because all four of them are different fronts in the War of the Whispers.For a third point, I give Mr.Lowder props for making a christian fantasy without introducing a story breaker. It is nigh impossible to include a benevolent and omnipotent deity while maintaining dramatic tension but Lowder makes it work. The War of the Whispers is as much (or more) spiritual than it is physical. The journey enables Elabea and Galadin to mature and ward off the Cauldron's drone as they make their way to Claire, thus enabling them to become the heroes the world needs to overthrow Ebon. While Manno Vox could airlift Elabea to Claire or defeat all her enemies in place of Galadin, that would defeat the point of the journey; while Galadin defeats trained soldiers on his own without training because of The Only's presence, without personal courage and faith he would lose anyway. It truly is a 'War of the Whispers', instead of a 'war of soldiers'.@However, I have two problems with this plot; an idiot ball in the backstory and a cliff hanger ending.As for the backstory, Brairtok, the King of Ebon, decimated Claire's Army and killed its leader, Manno Vox, because of a deception that a military leader shouldn't have fallne for. He pretended to have wagons of wounded troops and wanted to pass Manno Vox's lines, presumably to have them treated. Manno Vox allows him to pass without checking the wagons or demanding weapons or anything. Once in their midsts, the ebon soliders wipe out the Claire soldiers and Manno Vox is so shocked by this that Brairtok takes him out with a crossbow. On another occasion, the entire crop of story tellers, the best defense and weapon against Ebon, are given up for execution in exchange for Ebon to retreat from a location. Naturally, they don't retreat.These two things are a problem because they undermine the premise. I think that if the people in the backstory weren't so stupid, then the bad guys wouldn't have taken over. It breaks my Willing Suspension of Disbelief that Claire with so many soliders and so many storytellers and generally outclassing Ebon in all ways, could have lost so completely that everyone thinks the place is myth one generation later.As for the cliff hanger ending. I despise cliff hanger endings because I see them as cattle prods. I don't ask for a neat package with a bow on it but I want a sense that this leg of the journey is over. I don't get that here. I feel like there's a chapter missing or an eplilogue that was never written.It's because of these two problems that, as much as I like it, I can't give this book a perfect score.CHARACTERSThe characters are complex are diverse. There are cynics, idealists, cynics who want to be idealists but can't manage it. There are warriors and jesters and badass animal companions and angels! It's a wide cast and Lowder does an admirable job developing them all. It's especially impressive because they don't form a single group and so they can't be developed simultaneously.Newcomb's party has enough characterization and plot importance to be the main party and so are Elebea and Galadin's fathers back in their hometown and Il-Lilliad's quest for allies.For a second third point, the ebonites are not monolithically evil. They're still evil but in different ways. There are Punch Clock Villains working in the military, Brairtok has this 'glory and power seeker' thing, the Cauldron's Council have this 'evil priesthood' thing and the Cauldron itself is like some primordial First Evil.POLISHThere is no word cruft, which is a 'delight'. Also no problems in terms of spelling or grammar. On another note, there are patches in the story that are written in all CAPS. I have no idea what this means so I ignore it. Overall, there's good flow in this storyline.Trickster Eric Novels gives \"The Tears of Min Brock\" a B+"}, {"userName": "Harper Alexander", "userReviewDate": "Feb 04, 2014", "userURL": "http://www.goodreads.com/user/show/28184227-harper-alexander", "userReview": "Elabea and Galadin live in a very suppressive society. They aren't allowed to learn to read or write, and no one in their village, Hetherlinn, is allowed to keep weapons. They aren't allowed to play in the meadow on the oak tree, and most of all, they aren't allowed to speak of Claire, the kingdom that was supposedly destroyed in the Dark War. When the people in Hetherlinn all receive invitations from someone claiming to be the King of Claire, most of the villagers panic or ignore the parchments. After all, everyone knows that the Cauldron can see all things and knows when the rules are being broken. However, Elabea and Galadin accept the invitations, and so begins a dangerous journey to the land of Claire. Fantasy has always been a favorite genre of mine, from Lloyd Alexander's PRYDAIN CHRONICLES to Cornelia Funke's INKHEART trilogy. However, I've found that, as of late, fantasy novels have sort of exhausted me, and I've been having difficulties just finishing them, let alone enjoying them at all. I feel that TEARS OF MIN BROCK was a breath of fresh air. It was captivating, and J.E. Lowder seems to be a natural story-teller. The world he created was interesting and different. Some complaints about the fantasy genre would include the fact that they all seem the same, and that there's very little differentiation when it comes to the creatures. For instance, how many times have ogres or giants or dwarves been used? But here, Lowder has created new creatures, and it's just very fresh and new. Elabea's father is a drunk, but he is looked down on for it, and later encouraged to stop drinking. There's also some war violence, fighting, and bloodshed.There are some magical qualities throughout the story, and you can read my blog post, \"Magic, Sorcery, and Wizardry\" for more information about what the Bible says about magic. However, you'll find that I mentioned in that blog post that the author's intent is a key factor when considering this aspect of a book or movie. J.E. Lowder is a devoted Christian, and you will see evidence of this in the short Q&A session I had with him over email. 1.) What is it that inspired you to write this series?Well, I had a crisis of faith which led to me being broken, beaten, defeated, depressed, discouraged.... Get the picture? And in my darkest moment, I cried out to God to show up in a big way, which he did. My circumstances didn't change, but I discovered a deeper, more intimate fellowship with Christ. As a creative, I wanted to write about my experience, specifically to those not of faith to express, I hope, what it's like to go through tough times as a believer without the story sounding \"Christianese\" or preachy. 2.) Is there a character that you feel you relate to especially?I can relate to Elabea since she will be tested and experience the pain of life, but I'm probably closest in personality to Linwith, Quinn's brother. This wasn't planned, but the more I develop his character, the more I pop in for guest cameos. Be afraid. Be VERY afraid :)3.) You mentioned that you were in the process of publishing a third book. Will this be your last installment, or will you be writing more, either in this series or just more books in general?Yes, I'm really excited about Book III. It was a LOT of fun to write and is where the overall story kicks into high gear. After that, there are 1-2 more books planned. Actually, they're all written. I'm simply re-writing and tweaking.4.) I noticed a few aspects of your story that seemed to very much reflect Christian/Biblical things. Can you explain these references (who different characters represent, etc.)? Good catch but I typically don't like to specify what this or that represents as I want the reader to pull this out on their own. I will say that there are Biblical themes running throughout the series (see Malachi 4:6. Also, think good vs evil, God's delight, spiritual warfare, etc.) 5.) Here's a hard one: what is your favorite book?That is tough! Per fiction, there are too many to list. But if favorite is defined by what I read most often, then it's the Bible. Scripture, prayer and great friends were the only things that got me through that season. 6.) What would you say to someone to convince them to read your books?Have you been through dark times? Are you in a perilous place now? Then I think you'll enjoy the War of Whispers series, not in that it has answers to your problems or will cure your blues, but in that you'll be able to relate to the characters. And if you're lucky, maybe you'll hear the whisper calling your name.All in all, this was an excellent read, and I strongly recommend it to anyone! You can find J.E. Lowder at http://www.jelowder.com. There is also a sample available to read on Good Reads.Love,Harper(This review may be found on my blog, www.christianbookreviewsblog.wordpres....)"}, {"userName": "Shawna Dunbar", "userReviewDate": "Apr 09, 2013", "userURL": "http://www.goodreads.com/user/show/18466278-shawna-dunbar", "userReview": "This is the first book of the series, War of Whispers and tells of tales of a land that once was ruled by a great and loving king who had a multitude of storytellers but now is ruled by a cold and dark leader, the cauldron. There is a young girl and boy though who don't want to follow the cauldron and believe in the King of Claire so the story begins. I do not want to give any spoilers so I won't talk too much about the story in detail except to say that you will find many creatures, characters, lands, stories and so much more to let your imagination run. It will take you through many emotions and you seem to really get to know the characters. The way J.E.Lowder tells this story is enchanting, easy to follow and allows the story to form in your mind and a movie to flow. Well that is my true opinion because I loved this book and how it allowed me to see every land, creature, or being that he was talking about. While I read I could easily picture the story and follow as each chapter would show a different characters journey and their part in this war. The entire plot, characters, lands, and creatures are developed in such a way that you are not overwhelmed with too much information and are unable to remember but with the ease of a true storyteller. I plan to read this to my son so I recommend this book to any parent who love reading to their children because this would make a perfect reading time story. I loved it so much that I started the second right after. I would like to add that I was able to read this book because when I won a free copy of his second book, Martyr's Moon, he gave me a code so I could download and read this one for free also. Thank you J.E.Lowder very much for your generosity."}, {"userName": "Jessica Bronder", "userReviewDate": "Aug 04, 2016", "userURL": "http://www.goodreads.com/user/show/5781282-jessica-bronder", "userReview": "The world is a dark place filled with a drone from the Cauldron. No one is to look into what happened at Min Brock or the Dark War. But Elabea hears a whisper that is different from the drone. Wanting to be a storyteller, Elabea wants to learn more about the whisper, especially since it is coming from Claire, a land destroyed during the Dark War. Elabea and her friend Galadin follow the whisper and hope to bring life to the world. You will also meet Lassiter, a boy that also hears the whisper. He is traveling with Newcomb and DeMorley, the minstrel. Will they be able to bring light to this darkened world?Elabea is a 14 year old girl that is willing to go against the law to bring life back to the dark that has become the world. I really liked how important and powerful the storytellers were. As with every quest, we meet new characters and we face tough trials along the way to Claire. But what I really like were the characters were very realistic. They all had a fault of some sort and they clearly grow along their path.This is an amazing story. It drew me in following Elabea go against all rules to stop the drone. This is the first book in a series. I can’t wait to read the next book. I also feel really bad that it has taken me this long to get the review written. Sorry about that.I received Tears of Min Brock for free from WordCrafts Press in exchange for an honest review."}, {"userName": "Heather", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/2966320-heather", "userReview": "Tears of Min Brock grabbed my attention from the very beginning and didn’t let go until the end of the book. I immediately started reading the second book because I needed to know what was going to happen. I’m eagerly looking forward to the third book in the series. (Review of second review is coming tomorrow.)Darkness has taken over this world, and the people live their lives in fear of what evil may do if they do not do as commanded. One 14-year-old girl in a small village hears the whispers of good and listens to the calling. Her best friend joins her in the journey, but they aren’t sure they are making the right choice. Their fathers are seen as traitors and are an embarrassment to their families and others in the village. Can they overcome their family history and overcome the evil that constantly calls to them?There is a lot of darkness in this book, but the glimmer of hope and friendship of the two main characters keep some lightness in the story. J.E. Lowder did a wonderful job developing this whole new world. The characters are believable and real, and I was able to connect with them.After reading the book, I immediately passed it to my 13-year-old daughter to read. She was drawn into the book and didn’t want to put it down. Like me, she immediately went to the second book as she wanted to know what was going to happen, and she can’t wait for the third book to be released.Disclosure: I received a copy of this book from the publisher."}, {"userName": "Tywyll", "userReviewDate": "Mar 17, 2013", "userURL": "http://www.goodreads.com/user/show/4685763-tywyll", "userReview": "Tears of Min Brock is an enjoyable fantasy novel. The world is expansive; the concept of storytellers being powerful really intrigued me. Lowder's writing style is pleasant to read. He's descriptive, and uses comparisons and a variety of sentence types, so the reader can see his world and characters. Each character had their own voice and objectives. The creatures throughout the novel are interesting and creative. I haven't come across their like before.However, there was one thing I did dislike about the novel - the fact that it is so allegorical. A lot of \"tales\" and events sounded like biblical references or inspirations. When I first came across this novel, I had no idea this would be the case. However, upon pursuing his website in search for a map (which every good fantasy novel needs), it appears this was part of his inspiration for writing. Personally, I tend to avoid Christian lit or novels with Christian overtones or undertones. So that aspect was a bit off-putting for me. Had it been strictly fantasy without any hidden meanings or interpretations, I'd have enjoyed it more. But as each began more and more obvious, I sighed. In spite of that, it was still an interesting concept and world. I look forward to reading the sequel and seeing how their adventure continues against the Cauldron and towards finding Claire. 4.5 starsNote: I received a free copy from the author for a fair and honest review."}, {"userName": "Mike Parker", "userReviewDate": "Jan 27, 2012", "userURL": "http://www.goodreads.com/user/show/7272690-mike-parker", "userReview": "The opening salvo in the War of Whispers saga, \"Tears of Min Brock\" introduces us to Elabea, a young teenage girl, who lives in a village long oppressed by dark and sinister overlords. There is little joy in her community, but when a mysterious visitor appears in the night, delivering a remarkable message of hope, she is thrust on a great quest to become one of the most powerful beings in the world...a storyteller!Lowder writes with verve and confidence, creating a complex, intricate world, one of exquisite beauty, unimaginable danger and rare adventure. There are no two-dimensional characters here. Each one, whether good or evil (or somewhere in between), is fully fleshed. \"Tears of Min Brock\" is a strong and compelling start to what could just be the next major fantasy series."}, {"userName": "Jodi Woody", "userReviewDate": "Aug 22, 2013", "userURL": "http://www.goodreads.com/user/show/20356481-jodi-woody", "userReview": "I really loved this book! It just kept getting better the farther I got. I loved the storyline, the characters are loveable. I found myself wiping away a few tears as I read. A great fantasy world. Will definitely be reading more from this author. There are several main characters, similar to Lord of the Rings. You have to pay attention to keep them all straight. For this reason I think that ages 14 and up would best understand it all, but a good read for jr. high students as well. The story is set in a society with strict rules and regulations about everything. The people live in fear and have given up on thing ever changing, but there is a whisper of hope!"}, {"userName": "Rebecca McKinnon", "userReviewDate": "Mar 07, 2013", "userURL": "http://www.goodreads.com/user/show/1667189-rebecca-mckinnon", "userReview": "2.5 stars.I'm not quite sure where to start with this one. When I first read the blurb, I thought \"Great, that could be really good.\" Then I started reading it. And I struggled. I really wanted to like it, but neither the characters nor the plot were able to hold my attention. However, this could be because I didn't have a lot of reading time and could only read the first part in small snatches.The idea for this story was very well-thought-out, and had all the aspects necessary for a good fantasy. I can't put my finger on why it didn't work for me.If you're a fan of fantasy, you should give it a try."}, {"userName": "iamjenai", "userReviewDate": "Jan 07, 2012", "userURL": "http://www.goodreads.com/user/show/2659454-iamjenai", "userReview": "I started and stopped reading this book at least five times and I can't really get past the first quarter of the book. The writing is okay but neither the story nor characters held my attention."}, {"userName": "Ariella", "userReviewDate": "Jun 06, 2013", "userURL": "http://www.goodreads.com/user/show/4728871-ariella", "userReview": "Amazing read!"}, {"userName": "Brenda", "userReviewDate": "Mar 09, 2013", "userURL": "http://www.goodreads.com/user/show/17538937-brenda", "userReview": "I liked the story up until the end of chapter 8 where it stopped. I wish the prologue would have told me this was a sample and not the whole book."}], "description": "\"A whisper pierced the winds...the War of Whispers has begun.\"Five Star Reviews!\"I give it far more than the usual five stars!\" Opus 'N' Pen\"Fasten your seat belts this is going to be a wild, exciting ride. Mr. Lowder knows how to write a story that is full of suspense and action\" Vics Media Room\"As the book began, I thought the characters of Elabea and Galadin reminded me of Katniss and Gale from Suzanne Collins' The Hunger Games.\" Literary R&R\"This book gripped me right from the very beginning, and when I wasn't reading it, I was thinking about it.\" Music, Books & TeaDark and brooding, Tears of Min Brock follows a young girl of 14 summers, named Elabea, who hears a whisper calling her to the shining land of Claire; a kingdom that was supposedly destroyed in the devastating Dark War. Outcast from her family and village, with her childhood friend, Galadin, her only companion, Elabea sets out on an epic quest to become one of the most powerful beings in the world - a storyteller.Fans Want More! \" I can hardly wait for book two in this series.\" Vics Media Room \" Can't wait for the next installment.\" Amazon reviewer \"I found this to be one of my favorite books of the year, and am looking forward to the sequel. Lowder writes a story that does not disappoint.\" Tic Toc Do you have the courage to battle the War of Whispers? Download a sample of Tears of Min Brock and find out today!", "title": "Tears of Min Brock\n      \n          (War of Whispers #1)", "url": "http://www.goodreads.com/book/show/16054071-tears-of-min-brock", "average": 4.26, "cover": "https://images.gr-assets.com/books/1348968672l/16054071.jpg", "reviews": 24, "authors": [{"url": "https://www.goodreads.com/author/show/5135352.J_E_Lowder", "name": "J.E. Lowder"}], "type": ["Fantasy", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/16054071-tears-of-min-brock", "http://www.goodreads.com/book/show/12381491-tears-of-min-brock", "http://www.goodreads.com/book/show/17404726-martyr-s-moon", "http://www.goodreads.com/book/show/27430443-when-kings-clash"]}