{"ratings": 742, "userreviews": [{"userName": "Misfit", "userReviewDate": "May 19, 2011", "userURL": "http://www.goodreads.com/user/show/1375548-misfit", "userReview": "Marah and Brendan O’Flynn started life as the pampered (albeit illegitimate) children of an Irish lord, only for things to turn rough when he decides to dump his mistress for a younger model. Their mother returns to the career she knew, the stage, and her children carry on that tradition after her death – but it’s a hard life and the pains of childhood betrayal have left bitter scars and Marah eases the pain by leading on wealthy young men just to spurn them like her father did to her mother. Her latest conquest ends in near tragedy as she believes he’s shot himself over his lost love and she and Brendan flee for safer territory, not knowing that Julian asked his uncle Nicholas de Montaigne Chantale to exact revenge for Marah’s bitter perfidy.Fast forward a couple of years and our pair is preparing to land in California at the height of the gold rush, but Brendan loses at cards and the winner convinces them to let Marah pose as his niece (it really is too complicated to explain why) and they’re off to a large California rancho for a little game of bait and switch, although when Nicholas shows up unexpectedly that ole’ house of cards might come tumbling down around them. Nicholas thinks he’s found the elusive Marah, but allows himself to be convinced she’s really Amaya Vaughn and he’s hard put to resist her beauty, but what will he do if he does discover Marah’s true identity?After more more trials, tribulations and misunderstandings in San Francisco, Marah sees the writing on the wall and decides to return to London. But, this being a romance novel and all events happen and she lands on the same boat as Nicholas headed towards New Orleans. Our pair is soon swept up into a mystery over the death of Nicholas’ father, as well as who might actually have pulled the trigger during a duel with his older brother all those years ago, which resulted in Nicholas being banished and disinherited.This was a highly enjoyable romance and one I had a hard time putting down. Originally published in 1979, I didn’t find it dated at all, nor overly endowed with heaving bosoms, forced seduction, rape or other tropes you’re used to finding in the old school romances. The sex was well done and rather tame by today’s standards, and you’ll have to wait until page 200 or so before you get any of that. Yes, there are some misunderstandings that keep our pair from declaring their true feelings, but again not as bad as the Big Misunderstandings you’ll find in some romances. Marah’s character was just right, a hardened gal with a good heart underneath it all, definitely not TSTL nor one of those run-out-into-danger-in-the-middle-of-the-night-so-the-hero-can-rescue-me kind of heroines. As for Nicholas? Be still my beating heart, a good gentle man and not OTT in the alpha-male department. I felt the early parts could have used some judicious editing, but that’s a common complaint about these older historical romances. I plan on hunting down and reading more from this author and kudos to Sourcebooks for giving these old gems new life.FTC, advance copy courtesy of publisher. Thank you."}, {"userName": "Regan Walker", "userReviewDate": "Apr 14, 2013", "userURL": "http://www.goodreads.com/user/show/7363897-regan-walker", "userReview": "Irish Heroine Finds Love in America from Old California Ranchos to San Francisco to New OrleansSet in 1848 (prologue) and the early 1850s, this is the story of Mara O’Flynn and her brother Brendan, who live with the stigma of being bastards of an Irish nobleman father who left them to survive on their own. Both Mara and Brendan, like their mother before them, are actors. Mara’s mother died in poverty after her wealthy lover cast her aside, and Mara will never forget it. She has no desire to follow in her mother’s footsteps. In her private revenge, Mara intentionally makes noblemen fall in love with her only to send them away brokenhearted. In one such encounter the young man shot himself. Unbeknownst to Mara, she made an enemy of the young man’s uncle, a Creole Frenchman from New Orleans, Nicholas Chantale—who vows revenge.In pursuit of a new future, Mara and Brendan set sail for California on a clipper ship. Ever the Irish optimist, Brendan hopes to find gold. While on the ship, however, Brendan gambles away what little money they have, and they are forced to agree to the plan of another passenger, Don Luis, a Spanish Californian. Don Luis wants Mara to act the part of his half English niece who, from her youth, has been the fiancé of another ranchero in the Sierra Nevada. Mara and Brendan become involved in the lives of the rancheros even as they long to leave for San Francisco. Then one day a stranger shows up--Nicholas Chantale.The beginning takes a bit of patience as McBain meticulously brings to life old California when gold was discovered and the Californian ranchos were beginning to disappear. As is typical of her novels, she includes much historic detail adding richness to the story. It’s a tale of people fleeing their past hoping for a better tomorrow. Tara flees poverty and shame and Nicholas flees his aristocratic family that cast him out when they thought he murdered his brother.The story moves from London to California to New Orleans as Mara and Nick are continually thrown together and Mara resists the love she feels for the man who only wants her to share his bed. Once the story picks up in San Francisco, it moves along at a fast pace and will definitely keep you turning pages with some great action scenes, mystery and intrigue and a heartwarming ending. I recommend it."}, {"userName": "Tammy Walton Grant", "userReviewDate": "Jan 11, 2010", "userURL": "http://www.goodreads.com/user/show/3047961-tammy-walton-grant", "userReview": "Mara O'Flynn has lived a hard life. She and her brother Brendan lead a hard-scrabble existence as actors, one step ahead of their creditors and constantly wondering where their next meal is coming from. Filling out their family unit is Brendan's son Paddy (his mother has long deserted Brendan and Paddy to seek her fame and fortune) and their long-suffering servant/companion Jamie. Mara's mother was a famous stage actress who became the mistress of an Irish nobleman; Mara and Brendan had the best of everything until their father tired of their mother and cast her aside. She has sworn to never love a man after watching her mother die of heartbreak.She has become cold and calculating - when the story begins she has just cast aside an unfortunate young dandy named Julian in a most callous way. Mocking his love for her she cuts his heart and pride to ribbons. Jamie, later dispatched to return his gifts to him, hears a gun go off and learns that poor Julian has shot himself. Mara, Brendan and her family immediately leave London before anyone can connect them with the tragedy. Mara and Jamie, of course, do not tell Brendan of the outcome of her wicked game.Julian, however, is not dead. Delirious and weak, he lies abed with his uncle Nicholas Chantale, visiting from California, keeping vigil. His mother extracts a promise from Nicholas to exact revenge on the wicked creature who has done this to Julian. \"You will promise me, Nicholas - please! I beg this of you, for you are the only one I trust to be ruthless enough to do it. You have no softness in you, Nicholas. You do not forgive.\" Nicholas finds a locket containing her picture and follows the O'Flynns to America. The stage is now set for the rest of the novel.The story follows Mara and her clan from London to New York then on to the California. Brendan gambles their savings on board the ship and loses to Don Luis Quintero, a Californian returning home from England. Don Luis has problems of his own and hires the O'Flynns to assist in an elaborate charade which will allow him to regain his family's land and his fortune. Mara agrees to pose as \"Amaya Vaughn\" in exchange for forgiveness of their debts and a promise of payment. They travel to Rancho Villareale and the play begins in earnest. Mara and Brendan are cast in the role of a lifetime and enjoying the famed hospitality of the native Californians. One of the many guests at the hacienda is Nicholas Chantale - convinced that Amaya is really Mara O'Flynn. Nicholas, who spotted Mara by chance in San Francisco, has followed her. He confronts Don Luis with his suspicion but is rebuffed. He accepts Don Luis explanation of her identity but is fascinated with Amaya/Mara. He begins to court her while at the Rancho. Mara lets her guard down and falls in love. Then, of course, the house of cards built by Don Luis comes crashing down.I won't say much more about the story except that the reader is swept along with Mara and Nicholas to San Francisco, during the heart of the gold rush, then on to New Orleans and the lush plantation Beaumarais, where Nicholas claims his birthright. There is intrigue, betrayal, love, a death, a kidnapping, a pregnancy, revelations of long-held family secrets and, finally, a murderer is exposed. All of this is the backdrop to the burgeoning love between Nicholas and Mara -- she, who has sworn never to love, and he, who has sworn never to forgive.I love this book. I first read it in about 1980 - one of the first historical romances I ever read (after Kathleen Woodiwiss' Shanna and Shirley Busbee's Lady Vixen) and I was hooked. The historical detail, the \"sweeping\" scale of the story - from Ireland, to Paris, to London, to New York, California, then New Orleans . The author transports you from the tranquil luxury of a Californian rancho to the bustle of a rooming house in San Francisco to the brooding beauty of a Louisiana plantation all without missing a beat. It's not as explicit as I remember it being (but of course, I was 12!) but the love scenes are there. This isn't really a bodice ripper -- they come together before marriage, based only on mutual attraction with no blackmail, rape or bargain in sight. Mara falls in love first and is unable to fight her feelings for him - which she keeps from him. Nicholas, on other hand, seems to be almost unaware of his feelings until close to the end of the book. He is almost a complete alpha hero - except that he isn't brutal or \"alphole\"ish to her - he doesn't take the time (nor does the author!) to examine his feelings or motives very closely. What you do get to see during the course of the novel is the emotional growth of both the H/h. Mara becomes so much more than the brittle, bitter young woman she was in London. With Nicholas we learn about the tragedy in his past - he was accused of murdering his brother and disowned by his father. Nicholas and Mara overcome betrayals and \"big misunderstandings\" caused both by each other and outside influences and still manage an awesome HEA.All in all a wonderful, vintage historical romance -- one that I'd recommend to anyone who enjoys an \"epic\" style read. This book review has been provided by the  No Book Left Behind Campaign - A Bodice Ripper Readers Anonymous  group initiative to review the un-reviewed."}, {"userName": "KatieV", "userReviewDate": "Aug 29, 2013", "userURL": "http://www.goodreads.com/user/show/18620847-katiev", "userReview": "This is one of the old fashioned epic romances that span several years (4-5?) and continents.As the book opens, 18-yr-old actress Mara O'Flynn cruelly spurns a young English nobleman who claims to love her and wants to set her up as his mistress. He gives her expensive jewels and clothes (including a locket with her miniature in it) and she laughs in his face. When her maid returns the expensive gifts, she overhears a shot and is under the impression that the young man has killed himself over Mara. Actually he survives, but his uncle, the American Creole Nicholas Chantale, vows revenge on Mara.Mara, for her part, is horrified by the supposed suicide. You learn over the next 2-years as she travels with her brother, nephew, and maid on a long voyage to California that she is not the cruel person she seemed. The incident changes her greatly and starts her on the journey toward growing up.Basically, she didn't think men had feelings, at least not for their mistresses. Because of her beauty she was constantly pursued by wealthy, often titled, men who wanted her as a mistress. Just because she was an actress it was assumed she was 'for sale'. Actually, she was a virgin who'd never allowed a man close to her. The thing she most feared was turning into her mother, another beautiful actress who became the mistress of an Irish Lord and eventually died penniless and broken. The mother was with Mara's father (the Lord) for 15 years before he got tired of her, decided he wanted a younger model and basically threw them out on the streets. Mara and her older brother, Brendan, went from being raised almost like an aristocrat's children (lessons, education, etc) to being paupers. Mara's mother was no longer able to get the roles she used to before becoming kept by Mara's father. She had been out of the scene for too long and there was a new generation of younger actresses who had taken her place. She descended into hard living and was dead within a few years when Mara was only twelve. Luckily, they had a loyal maid who had followed Mara's mother and due to her attachment to the children she'd helped raised, she stayed around even after the money was gone.Needless to say Mara was traumatized. I imagined that every time she pulled her trick of drawing a man in and rejecting him, she felt she was getting back at her father and scoring a point for her dead mother. She'd been warned she was going to get in trouble for it one day, but was too young, naive and over-confident. It took the incident with the hero's nephew and the revenge plot to prove her wrong.The hero, Nicholas, just so happened to travel to California too, where he planned (like Mara's brother) to search for gold. He had carried the locket with him and thought he recognized Mara, who was masquerading as someone else. She fell in love with Nicholas and gave him her virginity before she realized who he was. Of course, when her true identity was confirmed he declared his vengeance. They meet again in San Francisco where she happens to befriend his best friend. Nicholas is still attracted to her, but mistrusts her. She is still very much in love with him.It's an interesting journey as they begin to really know one another, although Mara continues to hold herself back out of fear of repeating the past/becoming her mother. Lots of interesting adventures and twists which I won't spoil. There are also some very sad moments. But we finally get our HEA, which I found very satisfying."}, {"userName": "Nona", "userReviewDate": "Apr 06, 2012", "userURL": "http://www.goodreads.com/user/show/1521956-nona", "userReview": "I bought my very first romance for twenty five cents at a flea market, Devils Desire by Laurie McBain and have loved them(romances) ever since. A few years ago I picked up Moonstruck Madness and was a little bereft at how it wasn't Devils Desire but still good. A few days ago I picked up my third McBain read, Tears of Gold, hoping for that reconnection with her books I had felt with the first and though I found it it was different this time could be I've aged a bit since I created this ultra-romance super author cape for McBain at the whopping age of thirteen.the O'Flynns, childern of an actress and nobleman, have made it through the tough times and the good times relying on their wits and abilities to act, charm and gamble until one incident scars Mara that pretains a young gentleman. Nicholas the uncle of the young man is hell bent on vengeance against the little Irish woman who caused his sister and nephew such pain. Through this vengeance comes mixed feelings from both parties, Mara wants to forget the past and build a new future with her family in America where gold is plenty and Nicholas is wanting to distroy her at any chance, as they come together time and again the insults fly waging a war of mistrust, hurt feelings and damaged pride to uncover something greater.I love the detail McBain brings out in her stories, the conditions of cramped space damp with salt water on the ship or the alluring Spanish Moss, it has a way of seducing the reader in itself. The characters I thought were strong in who and what they were. Nicholas was an arrogant rake who knew his power of seduction and was willing to do everything it took to get what he wanted regardless of if it was proper or not. Mara was a disillusioned young woman and turned out she was far more then the wrapping you might say, she turned into a woman of great fortitude, keeping strong when life beat her down and she had no clue how to fix all that had gone wrong. It's got murder, travel, great steam scenes, gold aplenty and a Swede! (I was really hoping he played more a part but maybe in another book?)I will be keeping this one for a reread at a later date and see if the feelings are still the same but would suggest this to anyone who likes a tortured alpha hero and a equally strong willed heroine."}, {"userName": "Francesco", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/31435345-francesco", "userReview": "Tears of Gold deserves to be rediscovered. This is not the typical historical romance of the 70's where the heroine gets raped or abused by the hero. Mara and Nicholas, the main characters, have great chemistry: she is sassy and he, a typical Fabio look-a-like guy, has a big heart. Anyway, after reading the last page, I feel sad; I really need a sequel."}, {"userName": "BRNTerri", "userReviewDate": "Dec 28, 2010", "userURL": "http://www.goodreads.com/user/show/1046522-brnterri", "userReview": "SETTING: Louisana & California, 1850TIMESPAN: A year or soBODICE RIPPER? NoPART OF SERIES? NoRAPE? NoThis didn’t live up to my expectations in any way. Mara, 20, and her older brother Brendan, 26, involved themselves in an odd charade that didn’t make much sense to me. When the hero, Nicholas, 35ish, discovered it, his reaction should have been more explosive than it was. This wasn’t much of a love story. The main couple didn’t meet until over 100 pages in. They didn’t spend too much time together until about the last third of the story. I never sensed an emotional connection between them. Yes, they were attracted to each other and it was evident with Nicholas but Mara, she always seemed indifferent toward Nicholas. They admitted their love for one another at one point but I was left feeling cold about it. They never seemed like a true couple to me.I didn’t care for Mara’s brother Brendan at all. The story could have done without him. He was prominently featured throughout most of the story. I found him to be very annoying and I didn’t like this personality or he way he spoke. I did like his six year old son, Paddy, a lot. Brendan and Paddy’s mother are married yet estranged from one another. She’s a pretty evil woman and you’ll get to read about her should you ever read this book. I wasn’t paticularily interested in the heroes family and he sure had a lot of it. One male relative in paticular is pretty evil. Nicholas wasn’t as exciting a hero as I’d have liked for him to have been. He wasn’t alpha enough for me. Mara, she was OK as a heroine but nothing special. I liked that she was helping her brother raise Paddy and Paddy saw her as his mother. Overall, this was a pretty boring story that was filled with unmemorable characters. It could have been 150 pages shorter too."}, {"userName": "Karen Hogan", "userReviewDate": "Mar 14, 2012", "userURL": "http://www.goodreads.com/user/show/7861140-karen-hogan", "userReview": "I see many readers loved this book. I didnt really care for it, though. Too much background information and the characters didnt really meet each other until about 100 pages in. By then my interest had strayed."}, {"userName": "Sherry", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/38107684-sherry", "userReview": "What a wonderful read!!!Reminded me of Judith Mcnaught's or Kathleen E. Woodwiss's great historical novels. Mara life has left her with many reason to lose hope and despair. She was born illegitimate and turned out by her father and watched her mom die too young. She swore no man would control her life. Nicholas is a rambling man who has promised to destroy Mara for causing sorrow to his nephew. Their story is filled with an overwhelming chemistry and unwillingness to let each other go!"}, {"userName": "Laurie Collins", "userReviewDate": "Dec 09, 2013", "userURL": "http://www.goodreads.com/user/show/10849634-laurie-collins", "userReview": "I couldn't finish this. This cover isn't the one that was on the book I read, and as anybody who knows me knows, covers make a huge difference to me. There, that justifies the careers of many people out there. Yay! I was looking for a good, old-fashioned romance to lose myself in for a little while. This one had promise but the execution sucked. The heroine doesn't even meet the hero until half way through the book, and then it stalls. It just gets boring."}, {"userName": "Pamela(AllHoney)", "userReviewDate": "Feb 07, 2008", "userURL": "http://www.goodreads.com/user/show/884792-pamela-allhoney", "userReview": "This follows the story of Mara O'Flynn and her brother, Brendan, who are actors, as they gamble and con their way from England to America. Then enters Nicholas Chantale, who wants revenge against the lovely Mara. Not one of my favorites by Laurie McBain but still a good story. One of revenge and passion. I wasn't in love with the characters but the story itself was good."}, {"userName": "Ana Rosa", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/30934463-ana-rosa", "userReview": "Tears for sureit's an amazing story. I captivated me with the emotional turmoil that both heroine and hero had. I was going to be upset if it didn't end happily. It did though had a happy ending."}, {"userName": "Lisa Marbly-Warir", "userReviewDate": "Apr 07, 2015", "userURL": "http://www.goodreads.com/user/show/39652784-lisa-marbly-warir", "userReview": "I read this book quite a few years back. I remember it being a very good read."}, {"userName": "Ashley", "userReviewDate": "Sep 14, 2011", "userURL": "http://www.goodreads.com/user/show/3210539-ashley", "userReview": "Slow to begin..."}, {"userName": "Mandy Snel", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/19707793-mandy-snel", "userReview": "I really wanted to like this book. I liked the cover, and the premise, but the writing is so very very boring that I cannot even finish it... I read about 1/3 of the book, and in this part the descriptions about cities in their time are planted in coverstations in a most awkward way. I mean: two pages about Orleans during the goldrush after a question like \"How are you?\"It is nice to notice a writer did their research, but you don't have to shove it in my face every chapter."}, {"userName": "etherealfire", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/5138895-etherealfire", "userReview": "Library Kindle e-book"}, {"userName": "Judy & Marianne from Long and Short Reviews", "userReviewDate": "Oct 02, 2011", "userURL": "http://www.goodreads.com/user/show/5126172-judy-marianne-from-long-and-short-reviews", "userReview": "Originally posted at: http://longandshortreviews.blogspot.c...Different parts of mid-nineteenth century America come to vivid life in this book. The setting is unusually colorful and descriptive in this moving book, one filled with spunky characters and melodious dialogue. The beginning is sad, as are other parts of this book, but that gives it more poignancy.Mara is an interesting heroine, an Irish lass traveling with her light-hearted brother, Brendan, his son, Paddy, and their maid. The two Irish siblings sure know how to get into trouble. Their adventures are entertaining.They end up in California during the time of the gold rush. Rich details bring this era and world to life and even offer the reader a deeper understanding of the people there. Later, New Orleans and life there ispresented vividly.Nicholas, a sexy Creole man is after Mara for something bad she did: hurting a member of his family. They meet up and don¹t get along, to say the least. I was startled a bit by how quickly their relationship went from hatred to courtship. Nicholas goes from suspecting she was his villain, the one he searched for and yet they end up in the bedroom with little development to get to this point and then they become enemies again shortly after. The story has its share of suspense as well. I wondered what would happen when the siblings' deception was discovered. The history is vivid, interesting and spot on. Readers will be entertained and learn a lot.It¹s also good that there is character growth for the two leads. Something quite sad happens and, while unexpected, fits in with the developing plot.Occasionally, the story rushes over certain parts, and in other areas, there are so many details. At times it becomes annoying that Mara and Nicholas see the worst in each other so easily and so often, despite the passion between them.Still, this is a good tale filled to the brim with adventure and romance. It's on the long side but worth it, having a satisfying ending and enough suspense to keep up the tension."}, {"userName": "Linda Banche", "userReviewDate": "Sep 17, 2011", "userURL": "http://www.goodreads.com/user/show/1521544-linda-banche", "userReview": "Sweeping from London to the ranchos of Spanish California, gold rush San Francisco, and antebellum Louisiana, Laurie McBain's TEARS OF GOLD plunges headlong on a vivid, heart-pounding story of love, adventure, deceit and mystery.Mara will never end up like her mother, the cast-off mistress of a rich man. Mara spurns men first—until a young London suitor shoots himself after her rejection. The young man's uncle, Nicholas, vows revenge on the villain who hurt his nephew.Not knowing the young man's fate, Mara, along with her con-artist brother and his son, leave London for the gold fields of California. Mara masquerades as a California ranchero's long lost niece as she reluctantly becomes part of her brother's latest scheme. Here Nicholas first encounters her, unaware she is the woman who rejected his nephew. Thus begins Nicholas's fascination with the beautiful and enigmatic Mara. When he discovers her identity, he smothers his growing admiration for her with contempt. The attraction is mutual, and Mara also fails to keep her distance, even as she knows she should.TEARS OF GOLD is big story in every sense of the word--historic events, life-and-death consequences, and dramatic settings. Today the book would be a series, with each of the three major locations, all full of historic and descriptive detail, a separate connected novel. The story itself is a wider-ranging, mid-nineteenth century version of PRIDE AND PREJUDICE, although I found the leads less appealing. Ignoring the introduction of new information, Nicholas continually mistreats Mara, his prejudice blaming her for something that was not her fault. Mara is strong and independent, but her too-strong pride prevents her from explaining her side, and she makes excuse after excuse for Nicholas's continued ill-usage.Despite the hero's and heroine's shortcomings, I enjoyed this big, sprawling, complex novel. If you also long for stories like this that no one writes any more, TEARS OF GOLD , published in 1979, is the book for you.ARC provided by Sourcebooks"}, {"userName": "Chelsea", "userReviewDate": "Sep 06, 2014", "userURL": "http://www.goodreads.com/user/show/6328907-chelsea", "userReview": "This gets 2.5 stars, and 1.5 of those stars are for the last 30-40% of the book. This is TERRIBLY slow for the majority of it, and I felt like the characters NEVER SHUT UP about the scenery around them. Honestly, the first third of the book should have been scrapped entirely and the second third reworked drastically. The last part was good, but bore a heavy burden in holding up its predecessors. I found the characters' written accents grating, and would have liked to slap pretty much everyone in this book upside the head. The minor characters--with the exception of one or two--were the absolute worst; dear Lord, I'm not sure I've ever read a more annoying cast of supporting personalities. Not only that, but McBain apparently felt the need to shovel in an abundance of plots, only one of which really interacted with the main \"romance\" storyline, if it can even be called that, because with the exception of two (yes, TWO) encounters, the romance didn't materialize until the aforementioned last part of the book, at which point it decided to materialize very, very abruptly. Overall, this one isn't a winner, and I'll be turning my attentions to greener pastures in the future, leaving McBain's books where they belong."}, {"userName": "Readitnweep", "userReviewDate": "Aug 18, 2010", "userURL": "http://www.goodreads.com/user/show/3576329-readitnweep", "userReview": "It was hard to rate this. I first read Tears of Gold around 1977. I'm on my third copy. I re-read it repeatedly for years, though it's now been probably 10 years since my last read.It was my first historical romance beyond Victoria Holt and Phyllis Whitney, and I loved it. I wouldn't feel the same reading it for the first time now, though. Nicholas's masculinity would come off rather forced now, I think. And sometimes Mara seems a bit too fictional, too strong, too brave, too beautiful.I also probably would no longer buy off on the reason Nicholas followed her for so long to begin with. His spoiled nephew fancied himself in love with Mara. Because of her childhood, she gets what she can from men without sex and then cruelly dumps them. Yeah, that's bad, but I can't see Nicholas truding across the country looking for her just because his nephew decided to try and kill himself over her.The ending twist was okay; I still think it was done pretty well, and I'll still go back and re-read this, but probably more out of nostaglia then because it's really a great read - though back in 1977, considering waht was on the romance market, I think it was."}, {"userName": "L.   (Super Easy. Barely An Inconvenience.)", "userReviewDate": "Nov 12, 2016", "userURL": "http://www.goodreads.com/user/show/5954350-l-super-easy-barely-an-inconvenience", "userReview": "Irish actress Mara O'Flynn is hired to impersonate a Spanish senorita because, yeah, they're practically the same thing. While set in the sunny American West, there was a certain Gothic feel to the story, as Mara realizes she's not the only one at the ranch with dark secrets. This part takes up a good chunk of the book, nearly the first half. Then Mara leaves the Hacienda of Secrets and we never hear from these characters again.The next short section takes place in San Francisco during the Gold Rush. Characters, both Good and Bad, are introduced... and never heard from again as Mara takes off for a plantation in New Orleans. I thought the story was going to head back into Gothic mode once she reached Louisiana but no, it just turned into your typical HR romance."}, {"userName": "Avidreader", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/24492757-avidreader", "userReview": "Loved this book. Expected only a romance with a little bit of a supporting story but WOW it was more than that. There was some comedy, a mystery, annoying brothers and a hero who was arrogant and out for vengeance. It's super long but that really helps with creating a more solid story. My only gripe is that I would have loved to see the hero and heroine have a longer time together after declaring their feeling to each other. Rather I felt like the last two pages were rushed. If you going to bother writing such a long book then you can spare twenty more pages rewarding us for rooting for the couple. And therefore 4 out of 5 But still AWESOME!!!!"}, {"userName": "Michelle °O°", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/23418016-michelle-o", "userReview": "[ Even though you broke my heart  (hide spoiler)]"}, {"userName": "Misfit", "userReviewDate": "May 19, 2011", "userURL": "http://www.goodreads.com/user/show/1375548-misfit", "userReview": "Very enjoyable romance. There is some sex, but very tame by today's comparisons. A nice lead pair, Nicholas not overly alpha, Mara is definitely not TSTL nor one of those damned fool headed run out into the middle of the night so someone needs to save her heroines. Can't post a review until closer to new pub date late July. Sorry."}, {"userName": "Robin Dilks", "userReviewDate": "Feb 11, 2015", "userURL": "http://www.goodreads.com/user/show/33041216-robin-dilks", "userReview": "This was perhaps my favorite historical romance.Tears of Gold is a wonderful example of what historical Romance is at its best. The story goes from England, to California to New Orleans. Laurie McBain brought to life extraordinary characters that were beautifully flawed. for anyone who loves historical romance this story is a must read. Even though its an oldie its so well written its timeless."}, {"userName": "M", "userReviewDate": "Feb 11, 2012", "userURL": "http://www.goodreads.com/user/show/5810032-m", "userReview": "I remember reading this book in my late teens and loving it. I was actually kinda scared to re-read it because I really thought it wasnt going to live up to that memory. So not necessary, the story sucked me back in and I loved the characters all over again. Laurie McBain just writes beautifully and she hasnt disappointed me yet."}, {"userName": "Kris Rafferty", "userReviewDate": "Dec 03, 2014", "userURL": "http://www.goodreads.com/user/show/19220634-kris-rafferty", "userReview": "Held up well over the years."}, {"userName": "Snowmore", "userReviewDate": "Oct 08, 2011", "userURL": "http://www.goodreads.com/user/show/6526586-snowmore", "userReview": "One of my favourites from my teen years! A cherished novel in my collection."}, {"userName": "L-J Johnson", "userReviewDate": "Dec 16, 2011", "userURL": "http://www.goodreads.com/user/show/3633137-l-j-johnson", "userReview": "Her usual good storyline and characters, but too much history and not enough.... interpersonal relations."}, {"userName": "PK Reeves", "userReviewDate": "Jul 21, 2011", "userURL": "http://www.goodreads.com/user/show/3495168-pk-reeves", "userReview": "A masquerade where all the characters lives are intertwined. Loved it!Read Aisle B's review http://aisleb.tumblr.com/post/7872513..."}], "description": "Haunted by the memory of her aristocratic father's desertion of his mistress and children, Mara O'Flynn grew up despising men. She sought her livelihood in the theater, where, as a beautiful actress, she found vengeance in enchanting and discarding suitors, teasing them with subtle promises of ecstasy only to reject them with an air of finely tuned cruelty. It was an amusing sport...until the young Lord Julian--half mad with desire--shot himself. Then Mara, with her brother Brendan and his small son Paddy, departed for America. Brendan hoped to strike it rich in the California hills...Mara wanted only to forget young Julian's desperate act. She had no idea that Julian's uncle, Nicholas Chantale, was in pursuit. Dashing, reckless and rich, Nicholas Chantale had vowed revenge on the temptress who brought his nephew to such an extreme. Nicholas desired one thing--to win the affection of this evil beauty and then spurn her! Unsuspecting, Mara found herself in love, her long-suppressed passions awakened for the first time....by a man whose seductive allure concealed the hate in his heart!", "title": "Tears of Gold", "url": "http://www.goodreads.com/book/show/702026.Tears_of_Gold", "average": 3.9, "cover": "https://images.gr-assets.com/books/1274032192l/702026.jpg", "reviews": 37, "authors": [{"url": "https://www.goodreads.com/author/show/105578.Laurie_McBain", "name": "Laurie McBain"}], "type": ["Romance", "Romance", "Historical", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/702026.Tears_of_Gold", "http://www.goodreads.com/book/show/11048010-tears-of-gold", "http://www.goodreads.com/book/show/12684163-tears-of-gold", "http://www.goodreads.com/book/show/21957968-tears-of-gold", "http://www.goodreads.com/book/show/22238957-tears-of-gold", "http://www.goodreads.com/book/show/12460446-tears-of-gold", "http://www.goodreads.com/book/show/10762173-moonstruck-madness", "http://www.goodreads.com/book/show/702027.Devil_s_Desire", "http://www.goodreads.com/book/show/622475.Wild_Bells_to_the_Wild_Sky", "http://www.goodreads.com/book/show/448625.Chance_The_Winds_of_Fortune", "http://www.goodreads.com/book/show/181108.Dark_Before_the_Rising_Sun", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/11781578-lover-s-leap", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/36685093-the-unimaginable"]}