{"ratings": 1971, "userreviews": [{"userName": "Connie", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "\"Teatime for the Firefly\" was an engaging combination of Indian culture, history, and romance in the unusual setting of an Assam tea plantation. Layla Roy was born under an unlucky star and was orphaned at an early age. Fortunately she was raised by her wise grandfather to be an educated, independent thinker. Manik Deb, a recent graduate from Oxford who had taken a managerial position on a remote tea plantation, fell in love with the lovely Layla. After they married he brought her to the tea garden in the jungle of northern India. They had to adjust to being surrounded by British colonial managers, the \"coolie\" workers, man-eating leopards, rogue elephants, venomous insects, snakes, snakes, and more snakes. (I would not have lasted very long in their bungalow!) Layla and Manik were likable characters and I enjoyed reading about how their relationship developed.Cultural attitudes toward different castes, widows, the education of women, and other traditions were incorporated into the story. After Indian and British soldiers turned back Japanese troops in the mid 1940s, there were other sources of unrest such as the Hindu-Muslim conflicts, and the push for the independence of India. Although the book is fiction, the author's parents lived through this era on a tea plantation which grew rare, high-quality Assam tea. Shona Patel also drew from her personal experience in Assam to transport us to an exotic locale."}, {"userName": "Melissa Crytzer Fry", "userReviewDate": "Jan 03, 2014", "userURL": "http://www.goodreads.com/user/show/3857699-melissa-crytzer-fry", "userReview": "I won this book through the Goodreads First Reads program and was immediately transported back to my youth – not because I have any ties to Assam tea plantations in India, but because of a pen-pal relationship I experienced with a young Indian girl, Urvashi, who was forced to change her first and last name when she entered into an arranged marriage as a teenager. In my foolishness, I wrote back to her, indicating my horror at the thought of an arranged marriage, of losing her identity, her name and her freedom in so many ways … and, sadly, I never heard from her again, despite repeated attempts to reach her. I think of her today… and how badly she needed me as a friend, and how, with only pen to paper – in my ignorance as a pre-teen – I ensured that never again happened. I’m not sure if her husband screened her letters and forbade her from communicating with me or ??? But to this day, I am heartbroken.And so this story, which touches upon the role of women and the practice of arranged marriages in India – and so much more, namely life among the Assam Tea Plantations in the jungles of India in the 1940s – struck a chord with me in the main character, Layla, and even Kona, as well as Jamina. Each was a woman of strength and character, enduring societal stigmas and pushing new boundaries, enduring hardships unimaginable to so many of us.In Patel’s first novel, the reader’s senses will be tickled – from the sounds, sights and smells of life among a foreign jungle to the dangers that lurk there. Teatime for the Firefly is also a love story, a story of survival and self-preservation, a story of creating one’s own destiny, and a story of choosing one’s fate.I am so happy to have had the chance to read a local author and learn so much more about India after World War II, and its struggle for independence from British rule, as well as Hindu-Muslim tensions. The descriptions of the tea plantations (which I knew absolutely nothing about, nor was I aware of military ‘scorched earth’ policies) were intense, and in many instances, lovely and frightening all wrapped into one. One quote really stuck with me, as well, which proved prophetic as the story moved to its exciting conclusion: “Aye. But only a fool tries to tame Assam. The harder we try to change the land, the more it will change us.”I also loved learning that the author’s parents were, themselves, Assam tea planters. What great homage to her familial ties."}, {"userName": "Judith Starkston", "userReviewDate": "Dec 15, 2013", "userURL": "http://www.goodreads.com/user/show/4596767-judith-starkston", "userReview": "Teatime for the Firefly creates a vivid portrayal of the exotic world of the Assam tea plantations and Indian life during both WWII and the momentous upheavals immediately following the war. The tensions between British colonialism and Indian aspirations for a free nation are played out against the intensely personal story of Layla and Manik. From their chance and rather magical meeting through their unusual marriage, Patel has given us a sophisticated understanding of daily life in India through the eyes of one young woman. Layla, born under an “unlucky star” and orphaned early on, has been given the great gift of choosing her destiny by her wise and progressive grandfather. With a good education and a strong will, she moves between challenging the assumptions of her world and conforming. The violence and bigotry of this period add excitement to a plot that is as much about place and richly developed character as it is about actions. The reader will feel, smell and see this isolated, remarkable corner of India. Patel has wound into her story many themes and events imbued with Indian culture and in the process woven a rich tapestry for the reader: leopard attacks, rogue elephants, the paternalistic role of the tea companies, the childlike naiveté of the “coolie” workforce, children sold into prostitution, the racist attitude of the English toward all things Indian, the Hindu-Muslim riots, the need for education reform, the rejection of widows and the vulnerabilityThis review first appeared in the November 2013 issue of Historical Novels Review."}, {"userName": "Tara Chevrestt", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/2544368-tara-chevrestt", "userReview": "If you are interested in the life of tea planters in India after WWII, this is the book for you.I'm afraid it doesn't offer a lot more beyond that, except it does show us some Indian customs and traditions and superstitions and just overall way of life during that time as well.I struggled with some of this. I almost tossed it in the quarter because while I was hooked in the beginning, when the love interest, Mani went to become a tea planter, leaving the heroine behind for three years, their \"romance\" was through letters and there was nothing remotely romantic about the letters. It was all about the tea life and wild animals.Then they finally get married and this is where it got interesting. The wedding preparations, the ruckus, the traditions. It is truly intriguing. I was riveted once again.Then they went to the tea plantation. Enter hornet bites (this was actually kind of cool, but I won't explain why), the clash of cultures: Indian and British, prejudice, a mysterious 11-month pregnancy, man-eating leopards, thieving servants...this had its interesting moments. But again, I began losing interest. I'm just not that interested in the making of tea. I also never felt the wonderful connection between the hero and heroine that I felt like I should be feeling.There's no huge love story here. It's simply everyday life on a tea plantation and because of this lack of....solid plot, it came off as never-ending at times.But I did like the writing style overall and the heroine of the story grabbed my heart.http://wwwbookbabe.blogspot.com/2013/..."}, {"userName": "Missy J", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/7406091-missy-j", "userReview": "Set in a very exotic part of India that I wasn't even aware of until this year. \"Teatime for the Firefly\" is a story set in the lush and green tea plantations of northeastern India in 1947. The author Shona Patel was inspired by her grandparent's life when she penned this novel down. I was pleasantly surprised how much I enjoyed reading this book , especially at the beginning. The characters were unconventional and not dictated by society's expectations, which was a prevalent theme in India books that I read this year. Unfortunately, halfway through the novel, the characters' behavior changed 180 degrees and I found it less credible. It picked up again towards the end, but overall, I still feel lukewarm towards the entire story. Great setting, but inadequate plot line and erratic character development."}, {"userName": "Laurie • The Baking Bookworm", "userReviewDate": "Apr 17, 2013", "userURL": "http://www.goodreads.com/user/show/5289134-laurie-the-baking-bookworm", "userReview": "This review, as well as many more, can be found on my blog, The Baking Bookworm (www.thebakingbookworm.blogspot.ca)Author: Patel ShonaGenre: Historical FictionType: Advanced Reading Copy (ARC)Source: NetGalleyPublisher: HarlequinPublication Date: September 24, 2013First Line: \"My name is Layla and I was born under an unlucky star.\"My Thoughts: After adoring other books based in India (namely The Secret Daughter by Shilpi Somaya Gowda) I was eager to read another book set in the very rich culture of India. From the book description I was expecting a story that showcased how the strict and limited role of women in India affected Layla who was raised by her very liberal thinking grandfather, Dadamoshai. He believed that women weren't given enough opportunity to succeed due to their lack of education which only caused his numerous opponents to view him as upsetting the social order. It was this discrepancy, between Layla's upbringing and the cultural role of women, I thought the book would showcase.This was true in the beginning of the book and I really enjoyed seeing India through Layla's eyes and seeing how Layla struggled to fit into her very strict society. Unfortunately as soon as Layla moves away to a tea plantation, in the middle of nowhere, the book takes a sudden turn. It goes from following the relationship between Layla and Manik Deb to becoming focused on the politics of Indian tea plantations which slowed the pace of the book considerably. I have to admit that I continued reading the book in the hopes that the story would shift back to the initial feeling that I had in the beginning but unfortunately that never happened. The pace lagged dramatically and the focus on the political issues of the time seemed to take centre stage. While beautifully written and descriptive I unfortunately didn't enjoy this book as much as I would have hoped.My Rating: 2.5/5 starsNote: My sincere thanks to NetGalley and Harlequin for providing me with a complimentary Kindle e-book copy of this book in exchange for my honest review."}, {"userName": "Linda Hicks", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/5157433-linda-hicks", "userReview": "I highly recommend Shona Patel's debut novel, Teatime for the Firefly. I enjoyed everything about this book. The characters are fully formed, the imagery is strong and the story is well developed throughout with an especially strong conclusion which opens the door to future books. Shona introduces the reader to the challenging life on the Assam tea plantations through the eyes and experiences of the main character, Layla. From the opening lines of the unique novel, \"My name is Layla and I was born under an unlucky star.\" this story unfolds layer by layer. I cared about Layla, her wise grandfather, her hardworking, clever husband, Manik Deb, and many lesser characters who are fully developed despite their smaller roles.Shona Patel's voice can be heard throughout Teatime. It is evident that she knows and loves this region of India and she made me care as well. She uses humor, passion, historical references, strong imagery and excellent storytelling techniques to keep the reader engaged. I recommend Teatime for the Firefly without reservation. I've bought 3 copies so far. That should tell you something!"}, {"userName": "Donna Kimball", "userReviewDate": "Jul 11, 2013", "userURL": "http://www.goodreads.com/user/show/18001187-donna-kimball", "userReview": "This lyrical novel will entrance you. It takes place in pre-partition India, in a magical place--the tea gardens of Assam.The early portion of the book follows Layla's early life--as someone born under a bad astrological sign, she has few prospects for her future. She is raised by her eloquent grandfather, and is an articulate and caring young lady. When she falls in love(secretly) with Manik(who is betrothed to her friend), the magic then begins. Manik sends letters to Layla from Assam, and Layla is entranced, no only with him but the tea gardens. Layla and Manik marry and begin a life in a very magical, yet unstable area. Their life together reflects their love for each other and the love for their country. When unrest comes to Assam, Manik sends his very pregnant wife to safer territory. But unrest and injury only bring the still recovering Layla back to her husband in Assam. When you read this book you too will be draw into Layla and Manik's world: the servants she must train, the Anglo women who are the other wives, the eccentric other managers and friends. Ms. Patel's lyrical prose and strong characters will keep you entranced. I cannot wait for her next book, this new voice in fiction is wonderful! Thank you Ms Patel for a wonderful trip to the past and a far away land."}, {"userName": "Ruth", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/922881-ruth", "userReview": "This was historical fiction well done. Layla was born under an unlucky star. Because of this she knew that no one would ever want to marry her. Luckily, her grandfather had been British educated and believed that women should educated and should be free to make decisions for themselves. Imagine Layla's surprise when she is asked for her hand in marriage and becomes the wife to an assistant manager of a tea plantation. Her husband, also British educated is one of the first Indians to be given a manager's position on a tea plantation. It is after WWII and India is looking to be independent. Dangerous times have arrived and no one seems safe. Vivid descriptions of the tea plantations and life in the jungle are outstanding. There were also parts that have you holding your breath wondering what is going to happen and rapidly turning the pages to find out. Well done debut novel, Shona Patel!"}, {"userName": "Rose", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/6845309-rose", "userReview": "Teatime for the Firefly is really two love stories. The first is the story about Layla, an Indian orphan born with an unlucky future, and a British educated Indian man, Manik Deb. An arranged marriage brings Manik into Layla's world because his intended lives nearby. He throws away his future by accepting a job on a tea plantation with his real purpose to break off the engagement so he can marry Layla.But there's another love story, the second one about Layla's growing appreciation for the isolated Assam rain forest in northeast India. It's an exotic Eden, remote, wild and full of mystery. The story unfolds as Layla comes to understand the people, the plants and the animals in the wilderness. The plot takes on more drama towards the end as Patel's story weaves in the tumultuous upheaval when India tries to break free of the British Empire.Aside from the wonderful characters, a big part of the enjoyment in reading the book is learning about the Assam tea plantations and the lives of the people who endured the hardships required to live with rogue elephants, man-eating leopards and all sorts of insects and snakes. Patel brings to life the people and the place with a beautifully written novel."}, {"userName": "Celia Bishop", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/24880070-celia-bishop", "userReview": "[I also enjoyed the similes and metaphors. I never thought of a green coconut as empty or hollow, and I had to smile when Ms. Patel wrote, “Rai Bahadur’s granddaughter avoided the opposite sex like a Hindu avoids beef.” Roots that never touch the ground, prickly cacti in a pot, rivers that divide and merge – these were beautiful and insightful words.This book brought so many emotions! How amusing when Layla dragged Manik home from the card game; how scary when she was on the train ride (so relieved when Layla could see the dark tattoos of her rescuer – I was wondering how she was going to get out of that situation); and how poignant when Dadamoshai explains that Layla was loaned to him for awhile, and it’s time for him to let her go.Of course, Layla and Manik were wonderful characters with tremendous growth throughout the story. In Layla, we find a heroine who tries to \"create her own luck\" despite her ill-fated horoscope, the confusing rules in society, and the superstitions that were ingrained into the culture. In Manik, we find a man forging new territory away from societal expectations, a man who's honest and courageous and an independent thinker, not unlike Layla's grandfather.Because there are plenty of comments on the main characters and the storyline, I would like to concentrate on my favorite character, Dadamoshai. Layla was very lucky to be raised by him. I know he gave her a wonderful formal education, but I was more intrigued by his words of wisdom and his actions in life that gave her roots, shaped her values, and allowed her to fly. We parents should all be so lucky to give our children “choice”, to avoid shielding them from truth, to show them how to treat people (Chayna, Kona), to raise them to be curious, to remind them to “use their mind”, to explain how we can all create our own luck, and above all to keep our sense of humor through this journey we call life. Dadamoshai’s support of Layla’s engagement reminded me of Mr. Bennet in Pride and Prejudice – “I could not have parted with you, my Lizzy, to anyone less worthy.” I can definitely see bits and pieces of Albus Dumbledore and Atticus Finch. I can’t wait to read more from Ms. Patel.  (hide spoiler)]"}, {"userName": "Denise", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/33518247-denise", "userReview": "I rarely give 5 stares. Especially since I read mostly crime,murder or just plain drama. But sometimes I question How am I am going to pick my next read? Is it by title, best seller, suggestion & yes book cover? I feel this was by title - a no brainer for me. My mother loved tea & I could never, as much as I tried, enjoy the cuppa with her. So in her memory I may read an occasional book with tea in the the tile. I loved this book from page 1 to the end. I loved all the characters good & bad. It was for me a wonderful story which historically was in a turmoil era in India. Shona Patel wrote this without blaming one but sharing all as one."}, {"userName": "My Book Addiction and More MBA", "userReviewDate": "Oct 03, 2013", "userURL": "http://www.goodreads.com/user/show/7909095-my-book-addiction-and-more-mba", "userReview": "TEATIME FOR THE FIREFLY by Shona Patel is an interesting Women's Fiction set in 1940's India. The first thing we learn is that Layla Roy was born under an unlucky star, that makes her a Manglik,which is bad news for her. You see this makes her an unlucky one according to local superstition, and the Hindu horoscope. But things change for Layla on April 7, 1943,when she falls in love with Manik Deb......A very poignant story enriched with culture and history of the Hindus, Muslims, British and the tea plantations of Assam and Aynakhal, in Eastern India, on the skirts of the Second World War. The story is told through the eyes of Layla, a feisty,seventeen year old with a bit of humor and who is very likeable. Ms. Patel has written a debut that is well written and with the expertise of a long time writer. A much loved story of love, diversity,danger,racial divide, cultural changes and life during hardship. Many things are changing! Well done indeed! If you enjoy the Tea industry of India, India history, cultural diversity and so much more, than \"Teatime for the Firefly\" is a story you will enjoy. A beautifully written romance! Received for an honest review from the publisher.RATING: 4HEAT RATING: MildREVIEWED BY: AprilR, Review courtesy of My Book Addiction and More"}, {"userName": "Iznaya", "userReviewDate": "Jan 18, 2014", "userURL": "http://www.goodreads.com/user/show/604064-iznaya", "userReview": "Some interesting historical information imparted about the tea plantations in eastern India, but not enough to make this book highly commendable.Pleasantly easy to read, but annoyingly punctuated with obvious similes, spelled out uncreatively for the reader. I found the title after a genre search of my local library catalogue, and there was no indication in that search that this was a Harlequin publication. Nevertheless, it didn't pan out like a nauseating love story, and with some tighter editing and change of clumsy phrasing here and there it could have transcended it's current format.Despite my comments, it was a pleasant read for a summer holiday."}, {"userName": "Tina Panik", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/31464774-tina-panik", "userReview": "It's interesting to see how Layla's fated bad luck changes over the course of the book, and the details about the Assam Tea Trade are fascinating."}, {"userName": "Ganga", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/53675177-ganga", "userReview": "I admired the woman empowerment during that period. I loved the character ‘Dadamoshai’ sure many women wish to have a grandfather like him. The book wonderfully unfolds the tea garden life which many are unaware. Hindu-Muslim riots, India’s Independence,the romance between Layla and Manik , all makes the book as a good read. The author ended it well and the final pages didn’t let me to put it down"}, {"userName": "Maddie", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/4585480-maddie", "userReview": "This review can be found on my blog: http://wordingmythoughts.wordpress.co...Title: Teatime for the FireflyAuthor: Shona PatelISBN: 9780778315476Publisher: Harlequin MIRASource: Advance copy via NetGalleyRelease Date: September 24, 2013Rating: 4.5 out of 5From Shona Patel’s blog:\"My name is Layla and I was born under an unlucky star. The time and place of my birth makes me a Manglik. For a young girl growing up in India in the 1940’s, this is bad news. The planet Mars is predominant in my Hindu horoscope and this angry, red planet makes people rebellious and militant by nature. Everyone knows I am astrologically doomed and fated never to marry. Marriages in our society are arranged by astrology and nobody wants a warlike bride. Women are meant to be the needle that stitches families together, not the scissor that cuts.But every thing began to change for me on April 7th, 1943.Three things happened that day: Boris Ivanov, the famous Russian novelist, slipped on a tuberose at the grand opening ceremony of a new school, fell, and broke his leg; a baby crow fell out of its nest in the mango tree; and I, Layla Roy, aged fifteen years and three days, fell in love with Manik Deb.The incidents may have remained unconnected, like three tiny droplets on a lily leaf. But the leaf tipped and the drops rolled into one. It was a tiny shift in the cosmos, I believe, that tipped us together—Boris Ivanov, the baby crow, Manik Deb, and me.\"I loved this book! It is such a beautifully written book that I couldn’t put it down but somehow I made myself stop to just let the words wash over me and to feel the characters and live with them for some more time. Shona Patel’s storytelling and writing ability is so powerful that it transports you and you can’t get out of that magical place. While reading the book, I felt nostalgic for an era I didn’t even live in. Is it even possible?In Teatime, we follow Layla’s journey from her laid back life with her grandfather, Dadamoshai to the turbulent times she faces during India’s independence and thereafter. Layla is born under an unlucky start and is orphaned at a very young age. Yet, she is brought up by her wise and forward thinking grandfather to be a smart, educated and independent thinking girl. After marrying Manik Deb, Layla moves to the borders of Assam to live in the tea plantations where her husband works. Overnight she finds out that she is a now a memsahib with a fully staffed bungalow at her disposal and has to look and act accordingly. Soon we see that her relaxed life with her grandfather is over and she has to face many issues arising out of the changing economic situations at that time. Set against the spectacular backdrop of tea plantations, Shona Patel remarkably portrays the contrasts of an idyllic exotic location and it’s flawed society. Through Layla we see the life and times of the local plantation workers as they face racism, poverty, superstition and even politics.I fell in love with Layla first and with her grandfather a little later – but these are not the only people who are delightful to read. The other motley of characters that Patel weaves in this story are equally captivating and touching – from Layla’s extended family to her servant staff, her husband’s colleagues and their wives and mistresses – every character is a joy to read – they are real, believable and you can easily picture them in your head with their nuances.Shona Patel’s prose is lush and lyrical. It transports you to the India in the 1940′s and completely immerses you in that time and place . Layla’s story is funny, adventurous, dangerous and courageous. You would at times wish to stop and savour the moments yet find yourself distraught at the thought of staying away from the beautiful place and characters of this book. A coffee addict myself, after reading this book, I craved for a cup of tea…Highly recommended! Can’t wait for her next book!"}, {"userName": "Shreya Vaid", "userReviewDate": "Apr 21, 2016", "userURL": "http://www.goodreads.com/user/show/27443174-shreya-vaid", "userReview": "Some books share stories with you. And then there are book like Teatime For The Firefly which transport you totally into a whole new world! A world which we never knew about, which was hidden until someone as talented as Shona Patel shared it with us.Teatime For The Firefly follows the story of Layla Roy. Born under an inauspicious star, she is raised to be intelligent and independent by her unconventional Dadamoshai, who from time to time stands up and questions Indian society's crude and decaying social norms. By cleverly manipulating the hand of fortune has dealt her, Layla manages to find the love of her life in Manik Deb, who is already engaged to Layla's neighbor, Konica. Thanks to Manik's maneuver of taking luck into his own hands, he manages to betroth Layla and take her away to his humble abode, Aynakhal tea estate, which is located in deep dark jungles of Assam.Layla's new life as a bride takes her away from her regular schedule and starts grueling her to understand what life at a tea estate means . Fascinated by expats who drink down their whiskey swiftly even during major of earthquakes and among snakes and man eating leopards, she struggles to find her place in a whole new world altogether. A world full of prickly English wives, some weird servants and crazy schedule of her husband who works as Assistant at the estate.But Teatime For The Firefly is not just about settling in. Layla and her new life is growing right in the center of a huge political change, where India has started to flush out Britishers and clouds of second world war are looming. Local communists are moving in the deep jungles to claim their lands from colonials and Manik and Layla find themselves caught in treacherous racial divide that threatens their existence.Teatime For The Firefly is a story that will take you back to the colonial times when India was at the verge of joining Second world war. Colonials were cooling their heels and ex-pats were working like crazy at tea estates, away from all the tension. All little things that Layla faces in Teatime With The Firefly, are nothing less than a miracle during a time when lives of Indian women were predetermined by societal norms and horoscopes. Between all the tension and cultural norms, Manik and Layla's love story blossoms and is beautiful in it's own way.After reading Shona Patel's debut, I am left with a feeling which is called \"asking for more\"! Teatime For The Firefly is such an engaging book that you will not feel like keeping it down. The story takes you back to a time unknown to many, a life never discovered by anyone. I researched a little and got to know that even Shona Patel was raised at a tea plantation in Assam, and that's what made the source of Teatime For The Firefly. I can only imagine the amount of research and creativity must have gone into making of such a good book! Sharing a different culture from a very different time without boring the reader is something that a very few writers can pull off, and Shona Patel is one of them.Teatime For The Firefly is like a hidden treasure full of insights into the colonial time of tea plantations, a hard lifestyle with it's own perks, hidden in this book. A book which you should definitely devour into this summer!"}, {"userName": "Letitia", "userReviewDate": "Mar 17, 2016", "userURL": "http://www.goodreads.com/user/show/86892-letitia", "userReview": "This book had some absolutely riveting moments and draws from experience in a world that few understand, but I had just as many, if not more, problems with it as I did lovely moments. For one thing, it fails to do the one thing it had true potential to do: be a moving story of persevering and sacrificing love between a husband and wife. It's not that. We're supposed to think it's that, but the only times we get insight into Layla's heart, it's to describe how put out she is with her husband, or worried about his character. The part where she falls madly in love with him and their passion becomes more than physical just is not there.It's also not a riveting look at the transition from colonial to post-colonial India, although that is the context and the reality is drily narrated for us by various characters (there is an enormous cast) who show up I suppose to illustrate different aspects of British Indian culture. Those who have an interest in Partition and the neocolonial world of tea plantations will be disappointed, as these areas are mentioned, but never thoroughly contemplated or dealt with.The most riveting thing, in fact, happens in the last two chapters. I have found a trend among my books recently, where it's boring going for sooooo long and then the very end demonstrates extremely refined writing skill and an ability to arrest the reader's interest, but I'm left wondering \"why didn't you do that for the past 400 pages?\" This book has the same issue. There is simply not much to awaken the reader until the end, which is, I must admit, exciting and satisfying.Patel can turn a phrase beautifully, but her dialogue is stilted and artificial. Ultimately the discerning reader is left a bit confused by everything, because there are moments of thoughtfulness and brilliance, but the novel simply does not come together as a cohesive whole, with any clear reason for existing. So I ended up giving it a moderate rating mostly for the lovely \"slice of life\" narration and the end, but still keeping in mind my frustration that I simply did not have a strong feeling about any of the characters nor a good sense of what this book is FOR."}, {"userName": "Cynthia", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/5198643-cynthia", "userReview": "The road to my grandfather’s house was wide and tree-lined, with Gulmohor Flame Trees planted at regular intervals: exactly thirty feet apart. Their leafy branches crisscrossed overhead to form a magnificent latticed archway. On summer days the road was flecked with gold, and spring breezes showered down a torrent of vermillion petals that swirled and trembled in the dust like wounded butterflies.(end excerpt)Set against the backdrop of Assam tea plantations in the 1940’s, and the civil unrest that led to India dividing into two nations, Teatime for the Firefly tells the story of Layla. An unusual girl by the standards of the time, born “under an unlucky star” and orphaned young, she is the blended product of her culture, and her exceptionally forward thinking grandfather, Dadamoshai.From the privileged household of the District Magistrate, to the servant staffed bungalows of the British-owned Aynakhal tea plantation where she moves with her new husband, Layla grows from a naive young girl into Memsahib of Aynakhal. Through her eyes we see a world that bears more than a passing resemblance to the pre-civil war cotton plantations of the southern United States. Though the coolies are not slaves, picking tea is all they’ve known for generations, and it keeps them in thrall to the plantation managers, to whom they look up as small children to a God, depending on the largess of the managers for their precarious well-being. With dream-like names like: Bogopani (White Water), Hatigarh (Elephant House) and Rangamati (Red Earth), the ‘tea gardens’ as they are called, are rendered in vivid, playful prose that evokes a steamy, verdant bygone India. Interwoven with the often funny story of Layla’s personal experiences and her growing love for Manik, are stories of a child attacked by a tiger; rogue elephants and rhinos terrorizing workers; the prostitutes of Auntie’s—who, interestingly, dye their bottoms bright pink!; the chokri girl sold into slavery who ends up with a British title and an heirloom diamond as big as an almond; snobbish, miserable young English wives who cannot adapt, and their older, wiser counter-parts—grand British dames who fully embrace life as Memsahib on an Indian tea plantation. Author Shona Patel weaves in a sobering dose of cultural and social issues that are still recognizable in today’s India: arranged marriage, the plight of widows, the vulnerability of women in a society that undervalues them, poverty and child-selling.The characters are deftly-drawn and believable, the stories at times funny, at times frightening. One of the best historical novels I’ve read this year, Teatime for the Firefly is full immersion in the experience of a place, time and culture. I highly recommend it."}, {"userName": "Colleen Turner", "userReviewDate": "Sep 29, 2013", "userURL": "http://www.goodreads.com/user/show/3339335-colleen-turner", "userReview": "I reviewed this book for www.luxuryreading.com.While Layla was born under an unlucky star her grandfather raised her to be educated and progressive, determined to try and give her the freedom to make her own destiny in a traditional Indian world that saw her as having very few choices. And with her independent and intelligent spirit, Layla does just that. Marrying a man previously betrothed to another and leaving behind everything she has ever known to follow her new husband to his job as an assistant manager of a British tea plantation in Assam, Layla and Manik set off on the adventure of a lifetime to chart their own course in a world previously clearly mapped out. But with the freedom of choice comes consequences neither envisioned.Almost completely isolated in a strictly regimented colonial world, Layla must learn how to interact with the English men and women who have their own preconceived notions of her, the Indian servants she is now in charge of as well as the wild and often dangerous animals in her very own backyard. Even when Layla and Manik find deep love and contentment in the world they have chosen the ground shifts again as India in the late 1940s begins to fight for its own independence against British rule. In an insecure world that places the Debs on the knifes edge of an ever changing social, political and cultural divide, Layla will have to use every bit of ingenuity and bravery her grandfather instilled in her to survive the world crumbling around her and keep this life she has worked so hard for intact.Teatime for the Firefly is absolutely mesmerizing. The writing provokes such vivid and beautiful imagery that it is easy to get lost in the language and lose track of time. From the brightness of the fireflies and the colorful saris to the stark savagery of the vicious environment that surrounds the tea planters I couldn’t tear myself away.Knowing very little about India during this time, I also loved getting a peek into traditional Indian culture, the English influences on that culture and the various shifts and changes that occurred as the country was driven into the modern world. Both Layla and Manik refused to let tradition determine their futures and it was such a treat getting to see the good and the bad that resulted from going against tradition. Top all of this with unexpected humor and a tender yet powerful love story and Teatime for the Firefly is the full package."}, {"userName": "Shonna Froebel", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/14633278-shonna-froebel", "userReview": "This novel is set in Assam, India in the 1940s. Layla is a young woman of seventeen who has been brought up by her grandfather, an educated man who believes in the importance of educating women so they have choices. Layla birth time and the death of her parents have led many traditional Indians to believe her to be bad luck and she has resigned herself to never marrying. She aims to continue her grandfather's legacy of education for girls and has started training to be a teacher. Her grandfather often hosts guests and the Russian author Boris Ivanov is a frequent visitor. One day when he is expected to come and make a speech for the opening of the new school her grandfather has started for girls, Layla encounters a young man, Manik, recently back from being educated overseas. His unusual attention to her and his outlook on the future draw her to him, but she soon finds out that he is engaged to a young woman down the street, an arranged marriage. When Manik gives up his civil service job to go work as an assistant manager on a tea plantation, everything becomes less certain, and the two young people begin a correspondence.The historical events of India and partition come alive, but what is really brought to life here is Assam itself. The geography, scenery, and climate are well described, and life on the tea plantations comes alive for the reader. Their remote location, and how that draws misfits and thus unusual friendships is a big part of this story, as is the paternal relationship between the plantation managers and the workers.Layla and Malik both grow through the challenges and circumstances that their lives bring them. This provides a glimpse of a life in a certain place at a certain time in an engaging read."}, {"userName": "Candice", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/189647-candice", "userReview": "The author's parents worked on a tea plantation in Assam and the author did borrow some details from their lives, but much of the story is pure fiction. Nevertheless, the fact that she has some experience with this life lends an authenticity to the story. The first page intrigued me: On April 7 1943 \"Three things happened that day: Boris Ivanov, the famous Russian novelist, slipped on a tuberose at the grand opening ceremony of a new school, fell and broke his leg; a baby crow fell out of its nest in the mango tree; and I, Layla Roy, aged seventeen, fell in love with Manik Deb.\"Layla had anything but a traditional upbringing. Although she was born under an unlucky star, she was raised by her grandfather, her Dadamoshai, a progressive and well-respected intellectual who had no tolerance for such silly beliefs and who encouraged his granddaughter to use her mind. Skipping ahead, we find that Layla and her husband are living on a tea plantation in the Assam region of India. This was just after the second world war and before India and Pakistan's independence. I thought the book gave an excellent picture of what life was like on a tea plantation during those years. Despite the very interesting setting, the story of the relationship between Layla and Manik seemed quite ordinary.Inspired by the book, I went to our local tea shop and bought some Assam tea."}, {"userName": "Elizabeth☮ ", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/990216-elizabeth", "userReview": "Lalya Roy is raised by her grandfather, Dadamoshai, during the 1940's in India. Layla is raised to be independent and to think for herself, which makes her difficult to prepare for marriage (in a culture where women and men are party to arranged marriages). Layla meets her match in the erudite Manik Deb. The two are drawn to one another like a magnet and it is a series of events that finally brings the two together. Manik takes a position in Assam on a tea plantation. When Layla arrives, she must assimilate to life away from Dadamoshai and the insular culture of the tea plantation.There is beautiful scenery in this book. An area of the world that is made tangible in Patel's writing. There are many issues addressed in the book: the role of women in society; British colonialism; the caste system of India; communism and the rights of workers. Many times Patel inserts scenes that feel too neat and trite and simply added for the sake of illustrating a point about any of aforementioned issues.I liked the slice of history and I found the story interesting."}, {"userName": "Tricia Douglas", "userReviewDate": "Dec 05, 2014", "userURL": "http://www.goodreads.com/user/show/3448494-tricia-douglas", "userReview": "I'd really rate this book a 4.5 if I could. I thought the subject matter was unique and I liked learning about the tea plantations of India. The story took place in the 1940s and told about the difficult lives of the managers of tea gardens. The characters were wonderful. When Kayla and Manik marry they move to the jungles of Assam where some of the world's best tea is grown. We follow their lives through the daily trials of living so far from home, revolts from the workers, Japanese attacks and being affected by the British way of life. I don't think I've ever read a book about the tea industry. Patel writes well and describes the lives of some very interesting people. Overall, I enjoyed this book very much."}, {"userName": "Carrie", "userReviewDate": "Nov 02, 2013", "userURL": "http://www.goodreads.com/user/show/2136557-carrie", "userReview": "This was an interesting story about a young couple in 1940s India, with emphasis on life on a British-owned tea farm. I wonder a bit who the audience is for this book. In the background of the story is the story of India's independence and the eventual creation of Pakistan, but very little of that is explained, so I imagine the intended audience is someone who knows more about Indian history than I do. In spite of that, the love story of the young couple is very endearing, and the description of their lives is very interesting. The ending of the book is very rushed, as if the author realized that she needed to stop writing at some point. I just wish the story ended earlier or later than it did."}, {"userName": "Kandice", "userReviewDate": "Jan 20, 2014", "userURL": "http://www.goodreads.com/user/show/2617370-kandice", "userReview": "This is a lovely book from first-time author Shona Patel. Her main character, Layla Roy, develops from a well-educated, naive young woman, into someone ready to face down revolutionaries for the man she loves. While a somewhat idealized version of the times the book is set in, the story will grab anyone who loves historical fiction, especially that set during the turbulent history of India in the 1940's-'50's. It also provides an interesting insight into the Assam tea plantations which were known for the best tea in the world at that time. After reading this lovely book, I can't wait to see what Patel chooses as her next subject."}, {"userName": "Liz Leiby", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/4907140-liz-leiby", "userReview": "I want to give this 3 stars, or like 2.75 because it wasn't a BAD book. I think it was a little long for the story she was telling, but it wasn't horrible. My biggest issue with this was that it seemed plot-less. It was missing the basics- inciting incident, rising action, climax, falling action- it was just.. plot point, plot point, plot point. I usually abandon books like this but somehow I made it through all 400+ pages of this. I guess I kept expecting something to happen. I was definitely disappointed with this one."}, {"userName": "Georgia Carvalho", "userReviewDate": "Aug 22, 2014", "userURL": "http://www.goodreads.com/user/show/1404822-georgia-carvalho", "userReview": "This is a beautifully written story. Her writing is quite poetic and very pictorial. At times you just feel transported to the Assamese country side. I thoroughly enjoyed the setting in northern India in the early and mid 1940's, even if that was just in the background. The reader gets to learn so much about Assam and workings of tea plantations in that region. I also felt that the characters, especially Layla, Manik and Dadmoshai, were brought to life in this story about love and courage. I think this is a great read, and especially suited for fans of historical fiction."}, {"userName": "Usha", "userReviewDate": "Nov 18, 2014", "userURL": "http://www.goodreads.com/user/show/1293102-usha", "userReview": "Experiences of a young girl who is brought up by a grandfather who had forward thoughts regarding women's education, the plight of young widows in the 1940's before India's independence from the British and her later experiences of marrying a tea planter and living amid the forests in Assam are well wriiten. I wish there was more of the tea plantation revolution. Interesting read and I give 4 stars."}], "description": "Layla Roy has defied the fates.Despite being born under an inauspicious horoscope, she is raised to be educated and independent by her eccentric grandfather, Dadamoshai. And, by cleverly manipulating the hand fortune has dealt her, she has even found love with Manik Deb—a man betrothed to another. All were minor miracles in India that spring of 1943, when young women's lives were predetermined—if not by the stars, then by centuries of family tradition and social order.Layla's life as a newly married woman takes her away from home and into the jungles of Assam, where the world's finest tea thrives on plantations run by native labor and British efficiency. Fascinated by this culture of whiskey-soaked expats who seem fazed by neither earthquakes nor man-eating leopards, she struggles to find her place among the prickly English wives with whom she is expected to socialize, and the peculiar servants she now finds under her charge.But navigating the tea-garden set will hardly be her biggest challenge. Layla's remote home is not safe from the powerful changes sweeping India on the heels of the Second World War. Their colonial society is at a tipping point, and Layla and Manik find themselves caught in a perilous racial divide that threatens their very lives.", "title": "Teatime for the Firefly", "url": "http://www.goodreads.com/book/show/17622960-teatime-for-the-firefly", "average": 3.88, "cover": "https://images.gr-assets.com/books/1372089699l/17622960.jpg", "reviews": 370, "authors": [{"url": "https://www.goodreads.com/author/show/6444141.Shona_Patel", "name": "Shona Patel"}], "type": ["Historical", "Fiction", "Cultural", "Romance", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/17622960-teatime-for-the-firefly", "http://www.goodreads.com/book/show/25031584-flame-tree-road", "http://www.goodreads.com/book/show/18291993-the-next-page", "http://www.goodreads.com/book/show/23222186-the-next-page", "http://www.goodreads.com/book/show/38768023-the-returned-i-ll-be-seeing-you-teatime-for-the-firefly-the-sweetest-hal", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}