{"ratings": 2427, "userreviews": [{"userName": "Carol Storm", "userReviewDate": "Apr 23, 2016", "userURL": "http://www.goodreads.com/user/show/5032322-carol-storm", "userReview": "Wonderful book on baseball legend Ted Williams, though the book Williams wrote, MY TURN AT BAT, is probably just as good. Leigh Montville is a fine writer, but I really don't envy him taking on this huge project. When you think about it, Babe Ruth retired from baseball in 1935 and just seemed to quietly fade away. He was dead not long after World War II. But Ted Williams, as Montville says, lived a whole life after baseball -- and a lot of really painful, ugly, shocking stuff went on in that lifetime. Poor old Montville gets the short end of the stick, having to write over and over again stuff like \"Ted just lost it\" or \"Ted couldn't help himself\" or \"Ted's thunderous rage was just something he couldn't control and once again he was forced against his will to destroy his marriage, ruin his kids' lives, humiliate his fans, and tarnish his legend.\"So like, when he hit .400 that's because he worked at it and made it happen. But the other stuff was beyond his control? Inside the batter's box Ted had almost superhuman patience and self-control. That's because he worked at it. And people encouraged him. Maybe he should have worked at not being a monster who hurt people all the time? But why bother being a grown-up when guys like Montville will forgive anything the Kid says or does?I could see, reading the book, why Ted was so angry all the time. His father was never around. His mother was like something out of PSYCHO, a repressed religious fruitcake. Problem is, Montville doesn't really connect the dots. He doesn't analyze, doesn't have a vision or an explanation. He just piles on everything that ever happened in this epic life. And so many compelling details emerge that you end up being fascinated in spite of yourself. Ted's yelling and screaming that his kids are worthless, but when Richard Nixon(!) dies he bursts into tears. \"He loved Nixon like a father,\" someone says. Kind of shows you Ted's not too discriminating where father figures are concerned, and how could he be? But Montville doesn't really get it. He just keeps heaping up odds and ends in an epic life."}, {"userName": "Joe", "userReviewDate": "Oct 19, 2009", "userURL": "http://www.goodreads.com/user/show/1553027-joe", "userReview": "A good biography of a weird dude. In reality, nowhere near the legend you might think he was."}, {"userName": "Jaime Contreras", "userReviewDate": "Jul 24, 2011", "userURL": "http://www.goodreads.com/user/show/5557725-jaime-contreras", "userReview": "This is a revealing biography for baseball and Ted Williams fans. Ted Williams was a complex man who could be classified as a good man but he had a temper. He was not a prima donna because he said he was the best hitter in the history of baseball because it was the truth. He was blunt and honest to his detriment. He said what was in his heart. Much is revealed about the man by learning of his childhood. He had a difficult childhood by his athleticism carried him through tough times. He did not have a great relationship with his own father and that carried into his role as a father. He was quite critical of his role as a father and had no patience for people. But, he was a pro on the field and was a loyal and proud American. Something I learned was that he was half Mexican and born in San Diego which makes him one of the three Latino ballplayers of all-time, Clemente and Carew being the other two. I enjoyed reading this biography about one of the best ballplayers of all-time."}, {"userName": "Gerry", "userReviewDate": "Mar 24, 2013", "userURL": "http://www.goodreads.com/user/show/15162550-gerry", "userReview": "A great book, a storied and some times troubled life - I simply have no criticism of this book. I read this for the sake of a friend and an interest in the game of baseball. From a historical point of view this book holds interest of a sport time frame that has gone by. I have to admit that as a hockey guy I was pleased to see that Ted Williams had a friendship and fishing time with Bobby Orr the Hockey Hall of Fame player of the famous 1972 Stanley Cup team. I truly enjoyed the fishing stories and all the places Ted went to in order catch the fish he wanted, whether the Pacific Northwest, Canada, Florida, Russia among other places.If you like sports biographies then you will love this book."}, {"userName": "Cindy", "userReviewDate": "Oct 13, 2013", "userURL": "http://www.goodreads.com/user/show/1888098-cindy", "userReview": "I had no idea what a pain this athlete was to those around him. How sad that a man of such greatness is shrouded in all the mire."}, {"userName": "John Cloward", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/7384077-john-cloward", "userReview": "This book could have been half as long. A lot of really boring details. It took me forever to read as I continually lost interest."}, {"userName": "Jason Russell", "userReviewDate": "Mar 12, 2012", "userURL": "http://www.goodreads.com/user/show/8166793-jason-russell", "userReview": "(Written in 2004)There are few names in baseball that evoke reverence (and perhaps disgust) like the name Ted Williams. Teddy Ballgame was truly one of the game’s greats. Depending on who you ask, he was easily one of the three or four greatest to play the game. There have been a lot of books about or even by Williams, and this is one of the best. Ted Williams: The Biography of an American Hero vividly captures the complex, combative Williams from his rough childhood all the way to his death and the resultant controversy and battle over his remains. Author Leigh Montville, whose experience includes time with the Boston Globe and Sports Illustrated, had done a remarkable job of telling us about Ted Williams, The Man, which includes Ted Williams, the ballplayer, Ted Williams, the Marine pilot, Ted Williams, the fisherman, Ted Williams, the vulgar, distant father. The most amazing aspect of this book is that you almost feel like his baseball career is a minor element of the story, a footnote to Ted’s life. The book is 493 pages long (not counting the “Acknowledgements” and index), and by Page 236, Ted is already done playing baseball. Montville clearly shows that baseball was just one part of Ted’s life. As a kid, Ted wanted nothing more than to be the greatest hitter in baseball who ever lived. Some (like me) would say he reached that goal. (Aside: One has to wonder if Barry Bond’s recent superhuman seasons will help him eclipse Williams. Then there’s this kid named Pujols in St. Louis who is making a name for himself, too…I happen to be a die-hard Cardinals fan). Ted attacked everything he did in life, striving for perfection, and hitting a baseball was only the most visible example of that. Ted’s only failures were in his marital and parental relations, but then again he didn’t have the best examples growing up. Troubled Childhood Anyone who has read about Williams knows all about his upbringing in San Diego. Ted was born into “the cold climate of a bad marriage” (as Montville describes it) of Sam and May Veznor Williams. Sam wasn’t around much. He drank. Ted and his brother, Danny, were not a priority for May, either. Instead, the Salvation Army was all she cared about. The interesting thing about May is that she was Mexican (or, at least, both of her parents were Mexican). Ted Williams was half Latino…probably Major League Baseball’s first Latino star, and no one knew it. Anyways, Ted and Danny were often left to their own devices. “The boys went for the two traditional dramatic enticements: Ted went for sports, for baseball, and Danny, two years younger, went for trouble.” And of course, Ted had the physical gifts: big, strong, the “legendary” eye-sight. And once he put his mind to something, as mentioned above, he excelled. The early pages of the book talk about Ted’s love-affair with baseball, or, more specifically, hitting. Then came the mentors who would mean so much in Ted’s baseball life: Rod Luscomb, a San Diego playground director who “became Ted’s batting practice pitcher and confidant.” Montville quotes Williams from Ted Williams: My Life in Pictures: “I can’t give [Luscomb] enough credit for making me a ballplayer.” It’s interesting to note that Ted, for all his shortcomings, got along well with authority in his life, including managers and umpires. Certainly Luscomb filled a void where Ted’s own father should have been. Other adult men were also surrogate fathers of a sort. Montville describes the relationship between Ted and Les Cassie, the father of a friend. One almost gets the impression that Ted did more with Les Cassie Senior than he did with Les Cassie Jr. Another critical figure in Ted’s life was Wos Caldwell, the coach of the Hoover High School baseball team. At Hoover High, Ted was also a very good pitcher. And, before Ted had graduated from high school, “Ted had already played half of the 1936 minor league season.” He was playing for the San Diego Padres of the Pacific Coast League. A Glorious Career that Could Have Been More Even if, as I stated above, Ted’s career feels like a minor element of the book, Montville doesn’t leave out any of the standard stories that have become a part of baseball lore. We read about Ted’s budding talents with the Padres, including a .291 batting average and 23 home runs in the season after he graduated from high school. There’s Ted’s 1938 season with the Minnesota Millers before reaching Fenway. I guess hitting .366, with 46 homers and 142 RBI was reason enough for Ted Williams to make it to the majors in 1939. There’s his rookie season: .327, 31 homers, and leading the league with 145 RBI. And then came the second season and Ted’s infamous feud with the Boston press. Ted said a few things that he shouldn’t have. The press reported it…and piled on. “No headline would jump sales any faster than a headline involving Ted and controversy. A story on Ted was the ultimate good business,” Montville writes. “There were writers who liked Williams, writers who despised him, writers who bounced back and forth. The ground troops were the baseball writers, appearing at the ballpark every day, chronicling what they saw in front of them. They were the irritants, buzzing around his head. The writers who move inside his head were the columnists.” It’s hard to imagine a player who contributed to the Red Sox so much being degraded and ridiculed the way Williams was in his time. Perhaps a useful parallel is Barry Bonds. Bonds obviously elicits strong emotions and carries a lot of baggage. The press has often challenged his attitude, but never his talent, never his contributions to his team. For 20 years, the Red Sox failures were always laid squarely at the feet of Ted Williams, the greatest hitter who ever lived. It’s hard to fathom. In 1951, Dave “The Colonel” Egan, the “ringleader” of the Anti-Williams crowed, wrote “I am on record stating, with some heat, that the Red Sox never will win the pennant so long as TWmsEsq. is around to throw sand and monkey wrenches into gears and machinery.” It boggles the mind. As a player, Ted never liked the press, or what he called the “Knights of the keyboard.” He softened a little in his later years, but never forgot the poison from his playing time. There is of course the magical 1941 season when Ted hit .406, the last major leaguer to hit .400. 1941 gets its own chapter, 19 pages in all, five pages devoted to the final, deciding weekend. Countless writers have detailed Ted’s .406 season, and yet Montville cover’s new ground and captures the tension, the drama of the closing days. Montville even quotes Fred Caligiuri, who started the last game of the season, the game in which Ted Williams was 2-3 and finished the season at .406. There are the interruptions of World War II and Korea, with Ted sticking to what he thought were legitimate complaints about serving his country, and yet serving well nonetheless. As always, Ted wanted to be the best at what he did, that included being a pilot. Montville quotes Captain D.D. Gurney of the Bunker Hill Naval Air Station, “His flight instruction was completed more than two weeks ahead of schedule, and he was right up with his class in ground school subjects. He has an inquiring mind, and that is a splendid piece of flying equipment.” There's the '46 season, when Ted returned from his time in the Marines. The Red Sox were red hot and made it to the World Series. Ted was the MVP that season. But the Cardinals won the series in seven games. The Cards used a shift when Williams batted and Ted hit just .200, just five singles, a miserable series for the game’s best hitter. Then there’s Ted, on a fishing trip when his first child, Bobby-Jo was born. Definitely not a good PR move. Throughout, Montville catalogs Williams’ idiosyncrasies. In his quest to be the best hitter, Ted assumed a super-human discipline at the plate, never swinging at balls out of the strike zone. A good rule in the abstract, but in the heat of the game, not always wise or practical. Montville recounts a story where, while playing the Tigers, Williams crushed a pitch and launched it into the bleachers at Fenway. “The slugger ran the bases, didn’t shake hands with the next batter Vern Stephens at the plate, and came into the dugout in a huff. He yelled at himself even as his teammates came to congratulate him. ‘G****mn it,’ he said. ‘I never should have swung at that son of a b____.’ “‘It wasn’t a strike,’ he said. ‘’’Never should have swung.’” “The Red Sox were in the middle of a pennant race. Williams was mad at himself because he had swung at a bad ball and hit it 14 rows back into the bleachers? He was more worried about his own little code than the pennant race?” Then of course there’s Williams’ petulance. It’s not easy to admire Williams as a hitter and acknowledge his shortcomings as a person. There were spitting incidents. There was horrible, vile language that would shock the saltiest sailer. After one spitting incident, Ted ripped a drinking fountain off a wall in the tunnel leading to the clubhouse, flooding the tunnel. But the very next day, after 17 years in Boston, Ted “’realized that people were for me. The writers had written that the fans should show me they didn’t want me. And I got the greatest ovation ever.’” One fan, Phil Resnick, wrote to the Boston Globe, “A nonunderstanding, cruel press has gone the limit in crucifying a brave man and I want to reply to their viciousness. Ted had two hitches on combat missions. Ted had marital trouble. Ted had several severe injuries. Ted received a continuous barrage of abuse in the papers. Ted was booed while hitting .372” (emphasis added). Finally, the members of the press had to defend themselves. “In the noisy court of public opinion, this was a showdown Williams pretty much figured he had won.” Then there’s 1957, “his late-career masterpiece.” At the end of that season, Ted had a .388 average and was 39. Montville tells us the key to that season was a heavier bat, 34 ï¿½ ounces. Ted liked it in spring training and started the season with it. As a result, Ted wasn’t pulling the ball as much. Teams stopped shifting on him. “After the first two weeks of the season, he was hitting .474 with nine home runs. This was the best start of his career.” Then Williams went back to his lighter bat, started pulling more pitches. “’This was the beginning of the breakthrough for me,’” Williams said. “’This was the real secret of this year.’” If Ted could have had eight more hits, he would have hit over .400 again. At age 39!. And again, Montville paints the picture for us amazingly well. Then of course there’s his final season, his final homer in his final at-bat, and quotes from John Updike’s famous article for The New Yorker. “Gods do not answer letters.” Life After Baseball After baseball, Ted could be Ted for a living, basically a paraphrase of Montville. He was a spokesman for Sears sporting goods. He could fish, visit trade shows, hunt, play for a living. Anyway, I feel like I’m dragging this review much too long. After baseball, there were two more marriages. A son, John-Henry (more on him later) and a daughter, Claudia, were born Ted missed those, too. He started the Ted Williams Baseball Camp. Ted managed the Washington Senators (later the Texas Rangers) for four seasons, but despite some incremental improvements in team hitting, couldn’t lift them from mediocrity. In 1966, Ted was inducted into the Baseball Hall of Fame and Montville reprints the full text of Ted’s speech…at least I think it’s the full text. In it, Ted says he hoped “some day the names of Satchel Paige and Josh Gibson in some way can be added as a symbol of the great Negro players who are not here only because they weren’t given a chance.” I love Ted Williams for that. Montville writes, “No one ever had said this from the podium. The major leagues were seen as ‘real’ baseball, anything else inferior. Negro League players never had been on the ballot. This was a first crack in the door that ultimately would open and include Paige and Gibson and other Negro League stars in the shrine.” There were troubles with his daughter, including drugs and supposed suicide attempts. There was foul language, and cruelty, and fishing in Florida, and Canada…all kinds of stuff. And then there was John-Henry Williams. Montville paints a most unflattering portrait of John-Henry and I have to say I don’t doubt a word of it. John-Henry used Ted’s stature in the world of baseball collectibles to write his own meal ticket. John-Henry basically kept Ted as a slave in his own home. Regarding the controversy over Ted’s remains, there is no doubt in my mind that Ted’s so-called agreement to be cryogenically frozen was either coerced or is an outright fabrication. The whole situation smells bad. I don’t want to recap it all, because there’s a lot to it. If you want to know why I’m so sure John-Henry is a conniving, no-good, bloodsucker, read the book for yourself. It’s a sad way to end a great book, but it is, of course, the final chapter of Ted’s life. Well, you’re probably bored to tears right now. Sorry for going on so long. Perhaps I’ve given you an idea of how rich and vivid this book is. I read the book in May, so I should had written this review back then. Like Peter Gammons, I do know this is the best “baseball” book since Richard Ben Cramer’s Joe DiMaggio: The Hero's Life. If you are a Red Sox fan, a Ted Williams fan, or a baseball fan of any devotion, you will certainly enjoy this book."}, {"userName": "Mike", "userReviewDate": "May 23, 2011", "userURL": "http://www.goodreads.com/user/show/2467970-mike", "userReview": "I am drawn to Ted Williams for his single-minded dedication to his vocation. He was a man who cared almost exclusively about accomplishing one thing: being the best hitter in baseball. Until his retirement from the game, his whole life focused on perfecting his craft. He saw his calling clearly and built his life around it. I cannot help admire his certainty of self and his dedication (perhaps obsession), even while recognizing the costs it entailed. His success is legendary.Jeanne gave me this biography for my birthday last year. Leigh Montville provides a detailed account of Williams’s life without bogging down in unnecessary minutiae. Montville’s subtitle indicates the character of the book. He casts Williams as the iconic American, the John Wayne of baseball: a sailor-mouthed, tough-as-nails athlete and Marine combat pilot (he served in two wars, even surviving a crash-landing after taking fire), perpetually at odds with the Boston sports media, who grew up from nothing and spent his off-seasons hunting and fishing. He also details how Williams’s personality and profession severely damaged his personal relations and family life. Williams was a horrible father (he was absent for his kids’ births, not for away games but for fishing trips), and this probably came back to haunt him in the end (however poor he was as a father, no parent deserves the manipulation his son unleashed in Williams’s twilight years). I would have liked more pages on his baseball career. Only about 150 pages out of 500 cover his career as a player in the major leagues. Overall, however, it is a well written biography and a worthwhile read for any Williams fan (but be prepared for him to lose some of his shine)."}, {"userName": "Daniel Lowder", "userReviewDate": "Sep 18, 2007", "userURL": "http://www.goodreads.com/user/show/393075-daniel-lowder", "userReview": "Ted Williams is my hero. Not because he was a perfect example of how a man should conduct himself through life, but because he achieved such a high degree of accomplishments in spite of his personal shortcomings.Leigh Montville does a wonderful job of personally connecting the reader with the subject, through the myriad of highs and lows of his long and ridiculously eventful life. Through the fractured childhood, the awkward growing periods, the realization of the mammoth potential, we are given in depth accounts by people who lived alongside Ted. Throughout the book, you get to experience Williams' vivid language and colorful sense of humor... you should laugh frequently throughout the book. We are shown how he handled himself within the walls of the military in World War II and Korea, how he dealt with the many wives and many subsequent divorces, the strained relationships with his children, and his life after baseball. And, the fishing! Montville seems to have left no stone unturned in his research.The chronicle of John Henry Williams' treatment of his aging father in the last few years was gut-wrenching to read. The last years of Ted's life are shockingly in violation of what he deserved to have experienced. As someone who has read and delved into a multitude of throwback works regarding baseball and, in particular, Ted Williams, I can definitely say that Montville's work is far and away the most well-done and in-depth piece on Ted that I've read yet. It will attach you emotionally to him and give you the deepest measure of who he was as a person.Wonderfully, amazingly flawed."}, {"userName": "Mike", "userReviewDate": "Sep 05, 2014", "userURL": "http://www.goodreads.com/user/show/1173289-mike", "userReview": "I heard his name. I have seen the numbers, but now I met the man. I got the full story. I thought the author did a great unbiased view.So much information that i learned i thought was most interesting:- he was born and raised in San Diego (lucky!).- there was hardly any baseball in southern california at the time- he had a few high impact mentors- he had a near perfect swing from an early age- His mother was big into salvation army and lived a binary view of this world. often left to be at home on his own, Ted took to baseball his brother to the bad boy life- throughout his career he took heat from reporters and it was a adversary he would never shake.- he served in two wars in the prime of his career, fighter pilot, was shot down, plane caught on fire and he landed safely.- He took a pay cut later in his career because he thought he was paid unfairly for his performance-He loved to fish- He never could figure out women or kids, but he always had time for fans-Away from the fans he was foulmouth, rude, obnoxious and just plain mean.-he almost always followed the rules and would only social talk about baseball-His son ruined he later years, forced him to sign balls for his benefit even when crippled, and humiliated him during and after death.-He was a special man, with great eyesight, a controllable anger that made him a champion and a focus unattainable by most on one thing, in his case hitting.true american hero. bigger than life."}, {"userName": "Gary Mesick", "userReviewDate": "Mar 16, 2015", "userURL": "http://www.goodreads.com/user/show/79258-gary-mesick", "userReview": "I love Ted Williams. We was, as the subtitle says, my hero. When I was young, both \"My Turn at Bat\" \"The Science of Hitting\" were favorites. And so I wanted to like this book. And I did like this book. I just didn't love it.I did learn more details about his playing life and his military record. And these things raised my esteem for him. Then the book told me things I didn't know--mostly about the infighting in his family. And, frankly, I didn't care to know it. I guess that's what bothers be about this book. In it, Williams is subjected to the kind of tell-all treatment that serves no greater purpose. He wasn't a politician. He wasn't caring for young people, or selling them retirement plans. The guy just hit a baseball. Why dig deeper than that? Williams himself seems unable to dig deeper. Why should we?"}, {"userName": "Donald Gallinger", "userReviewDate": "Jun 16, 2008", "userURL": "http://www.goodreads.com/user/show/1028795-donald-gallinger", "userReview": "Leigh Montville's biography of Ted Williams is exhaustive in its analysis of one of baseball's greatest hitters. At times childish and self-absorbed, but always focused upon his art, Ted Williams emerges as a troubled genius in this wonderful book. Some of the anecdotes about Williams' intensity evoke a character who loves a few things in life to obsessive delight while ignoring almost everyone and everything else. An absolute master in the science of hitting a baseball, Williams loves his talent and nourishes it in a way that illuminates how beautiful, powerful, and fragile is the human desire to achieve greatness. A must for baseball fans."}, {"userName": "Paul Miller", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/51949098-paul-miller", "userReview": "I was worried because this same author's book on Babe Ruth was only 'ok' - however, turns out that he grew up in Boston, worked for the Globe, so the topic of Ted Williams is clearly in his wheelhouse. Great read! You'll learn about Ted's Mexican American upbringing, being a Marine fighter pilot, all the travails with the press in Boston, Sears, fishing, .... and finally his body being frozen by his crazy, nutty kid John Henry. Not a likeable character to me, but definitely a fascinating one. A must read for baseball historians."}, {"userName": "Mike", "userReviewDate": "Nov 22, 2013", "userURL": "http://www.goodreads.com/user/show/4086173-mike", "userReview": "Leigh Montville's life of Ted Williams is a brilliantly written and eye-opening biography, filled with details that are harrowing and heartwarming, and which ultimately provide a very human look at a man who was larger than life. There was much more to Teddy Ballgame than baseball, starting with the fact that he was Latino. I highly recommend this book to baseball fans looking to expand their understanding of one of the great figures of the game."}, {"userName": "Jason Cote", "userReviewDate": "Feb 04, 2014", "userURL": "http://www.goodreads.com/user/show/21651459-jason-cote", "userReview": "Good biography, dragged a little at times but overall it was complete and well written. It is clear the author is a Ted Williams fan, but really, are there any baseball fans who aren't? This book gives great insight into the life of Ted, I just wish there had been a longer focus on his playing career."}, {"userName": "Dan", "userReviewDate": "Jul 30, 2011", "userURL": "http://www.goodreads.com/user/show/1430202-dan", "userReview": "Another great baseball read. I read a biography he wrote about Babe Ruth and really liked it so I went for this one too. Here's what I knew about Ted before the book: a really great hitter, head is cryogenically frozen. It was very interesting to learn about his life and baseball prowess. His baseball career is over by the middle of the book and rest is basically about fishing, but whatever."}, {"userName": "Rebecca", "userReviewDate": "Mar 19, 2015", "userURL": "http://www.goodreads.com/user/show/9133042-rebecca", "userReview": "One of a very, very few sports biographies I've read that actually reads like a good, entertaining book. It is a full portrait of Williams, warts and all, although the very unsympathetic portrayal of his son John-Henry seems a bit one sided."}, {"userName": "Stan Shelley", "userReviewDate": "Sep 27, 2014", "userURL": "http://www.goodreads.com/user/show/2735937-stan-shelley", "userReview": "This was a marvelous biography. Montville did not hold back on the negative stuff, nor did he dwell on it. There were many references to old ball players, which I loved. And many interesting details that I did not know. The writing was in a casual style which seemed appropriate."}, {"userName": "Tim Snyder", "userReviewDate": "Jan 30, 2014", "userURL": "http://www.goodreads.com/user/show/196917-tim-snyder", "userReview": "A well balanced and complete biography that captures all of Ted's contradictions. It was fun to read and provided insights into some of the great moments of baseball history and many of the back stories."}, {"userName": "Easton", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/74606117-easton", "userReview": "The book that I read for my outside reading book was Ted Williams, a biography written by Leigh Montville. It was about Ted Williams who was a famous baseball player for the Boston Red Sox. The book takes place in many places, but its main setting is in Boston while he was playing baseball. The main characters in the book were Ted himself and his rival Joe DiMaggio. They spent most of their time as rivals but learned to get along during the War. I got the idea to get this book because I like playing baseball and I like the Red Sox, so it only fits to get a book about a player who played for the Red Sox. \tThe book is a biography which is telling you about Ted Williams’ life. It tells about the problems that he had to go through and the good he faced throughout the years of being a major-league baseball player and a family member. It starts out by showing his life as a little boy and going on through his teen life, adult life, war life, and much more all the way until he dies and how his life affected others. The ending of the book was mellow because it was when Ted passed away and it was showing how his life changed everyone around him, even Joe DiMaggio, his rival. He changed his life because it made him a better player knowing that he wanted to be better player than Ted. This stood out in a way that showed that everyone can have an effect on someone’s life even if we don’t notice it. \tI really enjoyed this book for many reason, one of the reason being it was about a baseball player and reading about someone like that could help me myself because I player baseball too. Reading about him tells me how hard the road to get to where he was at the time he played. The second reason was that it was a biography. I like reading biographies because it is like you were living with the person you were reading about. It tells you about mostly everything about them, and you feel like you know the guy even though you didn’t truly know them. The third reason why I liked this book was because it was about one of the greatest baseball players to play on my favorite team. Ted Williams is the greatest players to play for the Red Sox, most people when they think of Ted Williams they think of the “Red Seat.” The “Red Seat” is the only seat in Fenway Park that is red, its red because Ted hit the farthest ball ever in that park. It is and ionic symbol of Fenway. In my opinion this book was 5 stars for the reasons above. \tMy opinion on this book is the best book I have read, I enjoyed this book because I like reading about people and their lives, and it’s even better if that person played for your favorite team. If you like biographies or even like sports you should read this book because it shows their life and all of the struggles they went through to be as good as they are, and how they got there from a young age too adult hood and the road they took, from making the right choices and the practice they put in to be as good as they are."}, {"userName": "Chad Simons", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/30842460-chad-simons", "userReview": "Maybe a spoiler.... Prior to reading this book, all I knew about Ted Williams as a huge baseball fan was that he hit over 400 one season, close to it in others, served in the military, and wanted to be carbon froze upon his death so that in the future the technology could bring him back to life. I have always looked upon his legacy in a favorable light. After completing this book though, I realize he was kind of a jerk. Maybe that is a little harsh, but as a player he seems like the type that I would not have likes, no matter what his skills. The book captures his treatment of people quite well. Kind of a cocky, conceited, and disrespectful prima donna. As he got older, this book makes it sound like he lightened up a bit in some regards. Anyway, I enjoyed the book, but think my perception of Mr. Williams has definitely decreased because of it. The title of this book is also misleading, because I do not feel like the author truly thinks Ted Williams is a hero. I guess the truth can be truly bitter at times. There are many good things that Williams did off the diamond. I like that he was mindful of kids and did a lot to raise money for certain causes. Anyway, good book, but I had hoped to come off liking Ted Williams more than less. Perhaps anyone that reads this could recommend another book that is more \"Pro\" Ted Williams than this one seemed to be? One thing that made me laugh a lot is his choice of insulting cuss words. Calling someone a syphylittic(sp?) whatever... classic."}, {"userName": "Jay", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/71234576-jay", "userReview": "Good life story about Ted Williams. A Lot about his life after retiring though"}, {"userName": "Jon Finkel", "userReviewDate": "Jun 30, 2017", "userURL": "http://www.goodreads.com/user/show/6976685-jon-finkel", "userReview": "This is pretty much word candy for a Sox fan. Montville and Williams are the best pairing of subject and author maybe ever."}, {"userName": "Paul Frandano", "userReviewDate": "Mar 28, 2014", "userURL": "http://www.goodreads.com/user/show/5861132-paul-frandano", "userReview": "The Kid. The Splendid Splinter. Teddy Ballgame. \"The Greatest Hitter of the Modern Era.\" There's really nothing left to say about Ted Williams that hasn't been said in triplicate, somewhere, sometime. He was not a very likable guy, mistreated his wives, most of those around him, sportswriters (natch, those \"Knights of the Keyboard\"), Bostonians (ptoo!), but was kind to children, and especially the Jimmy-Fund kids - going strong after 60 years, the Jimmy Fund supports Boston's Dana-Farber Cancer Institute - and had some endearing characteristics as an old man. Unfortunately, one of those seemed to be an unconditional love misplaced, for his genuinely wicked, greedy, needy, ugly, manipulative, vindictive, vainglorious POS son, John Henry, who decapitated his father and froze the nut and all the rest up, like Han Solo, in the hope that medical technology would work a miracle in the 22nd century, enable both the late JH (two years after Dad: leukemia) to reunite with his ghoul father to auction off the DNA that hit .406 to parents eager to have a Teddy Ballgame of their own.Not an inspirational story, but a shocking, amusing, entertaining, and quite the ripping, and ultimately horrific, yarn. Montville has a nice, easy narrative style - I read him back in his Boston Globe days, the mid 1970s, when he was a serious columnist with a great sense of humor, and later when he wrote features in SI - doesn't dwell on the ballgame, but on the man in the ballgame. He seems to have talked to everyone alive at the turn of the century who knew Ted. And his chapters on angling made me want to stalk the wild, cunning, powerful salmon, even though I've not fished, nor have I given a moment's thought to fishing, since my 10th year, which would be 56 years ago. It doesn't seem like such an utter waste of time, but a rather cerebral sporting exercise, reading about how Ted attacked a stream. Curious, though, that I cannot recall him ever having cooking up a catch in nearly 500 pages.Leigh omits mention of Ted's affection for jazz music, which is documented elsewhere but was nevertheless not common knowledge. He went to jazz clubs, loved Errol Gardner and Stan Getz, had the radio tuned to jazz stations. Giving Ted a passionate attachment to music would have given him another dollop of humanity. And I would have enjoyed seeing his playlists or knowing something about his album collection.Someone needs to make a Ted Williams biopic, with Montville's book as the template. Leigh! Let's do it! But let's add the jazz..."}, {"userName": "Steve", "userReviewDate": "Apr 21, 2012", "userURL": "http://www.goodreads.com/user/show/5720388-steve", "userReview": "Eye opening, revealing, strange, sad.I thought this was an excellent book about Ted Williams...a book that surprised me in not only addressing the things I did know, but more about the things I didn't know. Leigh Montville pulled no punches in writing this biography which not only showed Ted Williams as a player who could back up his talk with his bat; but also showed the darker sides of the last man to hit over .400 for a major league season.It was the off-the-field exploits of Williams that surprised me as I read this book. His hatred of the Boston press (especially Dave Egan), his two tours as a combat pilot (WWII and Korea), his absolute love of hunting and fishing, his ability to grab people off the street and make friends and his marital and family \"relationships.\"I found Montville portrayal of Williams as a giving person to kids -- especially those in medical distress -- wonderful. I found Williams's treatment of his own kids horrible. I also found Montville's portrayal of Williams as somewhat gullible, arrogant, and it amazed me that his treatment of his army of loyal friends and baseball family was as vulgar and demeaning as his contributions to the game was strong. He loved being the outdoorsman...and Montville made it seem that baseball was means to his total love of hunting and fishing. Name recognition meant the best benefits...and hunting and fishing seemed to be the way Williams escaped from the criticism of this editorial critics and the day-to-day issues of being a celebrity. Williams, despite his crankiness and his obscenity-filled commentary, didn't deserve what his ill-fated son John Henry Williams threw at him. Exploited for every cent he could get, Montville spent a good part of the final chapters depicting Williams' fade from glory at the hands of a greedy, immature son.I'm a Yankee fan, but I learned about Ted Williams, saw highlights of his career and heard stories of how a player who lost prime seasons due to two military tours still hammered 521 career homers and a still considered the best hitter ever to play the game. The book was interesting, insightful, but also very depressing."}, {"userName": "Mr. Kovach", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/6321297-mr-kovach", "userReview": "This was pretty good as sports biographies go; they're usually not pillars of literature, and sometimes they're plain hagiography, but this was well written and certainly not hagiography. Williams was a complex man is the nice way to put it. The reality is he was a genius at the plate, a war hero without question, and fine fly fisherman, and an a**hole who could be by turns petulant, obnoxious, and incredibly generous and caring, especially to kids, most especially to sick kids, to whom he was so often their angel. He was also a classic atheist; if I EVER come across an atheist who isn't miserably unhappy I'll CONSIDER their viewpoint, but it's never happened yet. Their unhappiness is the greatest argument against their denial of God. But enough about MY hangups, Teddy Ballgame was one of the greatest hitters ever (I personally don't see how so many people put him above the Bambino [which is heresy of its OWN kind] or Gehrig but the challengers to greatest ever run out QUICKLY and Williams is definitely in the conversation. In any case, interesting man, interesting life (including the outdoorsman part, definitely, and the spokesman for Sears part - I still have an old Ted Williams hunting jacket of my Dad's with Williams's name stitched inside). Good read; nice work, Mr. Montville!"}, {"userName": "Kurtbg", "userReviewDate": "Jun 25, 2008", "userURL": "http://www.goodreads.com/user/show/174365-kurtbg", "userReview": "The great Ted Williams. He would have been the greatest, no doubt, if he hadn't spent 5 years of his prime to fight in 2 wars. what creates a great hitter?Underneath this foul-mouthed, outdoorsman, SOB who could hit for nothing one is inclined to think what drove such a man.Having a mother who would rather sing and play with the Salvation army then raise children and an alcoholic father who abandons you can lead to some seruis issues with abandonment and lack of self-worth. At a young age Ted was almost OCD with hitting a ball and swinging a bat, a paper, anything he could get his hands on. He was an early candidate for ADD. His younger withdrew into crime to get attention and prove self and Ted did the same with Baseball. Maybe it was being the first born, the oldest-- the feeling that you had to make something of yourself for the family that kept him away from the bad. He also had a soft spot for kids helping out, anonymously, at hospitals and being a big supporter of the jimmy fund. Unfortunately he didn't show that same type of attention to his kids who took care of him in his last days. How well did they do that? Well, they had him sign autographs and then rewarded him with decapitation for posterity. Lesson: Don't let your parents mess you up and in turn neglect your kids... because your kids will take care of your when you're older... really take care you.There's something about people who demand the attention of everyone in a room. As long as your produce people forgive and they forgave Ted.The book has some fun anecdotes and loves to take tangent trips."}, {"userName": "David Lucander", "userReviewDate": "Oct 10, 2015", "userURL": "http://www.goodreads.com/user/show/21736738-david-lucander", "userReview": "A pretty okay book about a pretty neat book. Like Stan Musial: An American Life and Willie Mays: The Life, the Legend, this book is by a sports writer doing history. As such, there's not a lot of sophisticated critical analysis about much of anything, but there's countless quotes from hundreds of people who were associated with Ted Williams. I wish there was more on how Boston fans and ownership felt about Williams, because there's lots about how he and the media clashed. Did Mexican Americans or Hispanics embrace him as one of their own? What did Williams do to become such a larger than life figure after he retired? To what extent is Ted Williams responsible for the memorabilia industry? Most importantly, why did he make such a bold statement regarding Negro League players at his Hall of Fame induction speech and how did broader aspects of the civil rights movement impact him? Montville deserves a lot of credit for presenting a nuanced portrait of Williams as a pilot, I never knew that Williams tried getting a deferment in WWII and that he was pretty perturbed about called on again in Korea - most just talk about his as a patriotic demigod hero."}, {"userName": "Brad", "userReviewDate": "Feb 01, 2012", "userURL": "http://www.goodreads.com/user/show/6335548-brad", "userReview": "Indulge me, at the start of this book review on Leigh Montville's Ted Williams: The Biography of an American Hero, to send a personal message to the author. Mr. Montville: When using an abbreviated word as an adjective, there is a proper rendering. Let's use the word \"stinking.\" As in, \"This stinking guy...\" To abbreviate this word properly as an adjective, you simply remove the \"G\" and add an apostrophe. \"Stinkin'.\" Pretty simple. Not \"Stinken,\" which for some reason you continually chose. At least you were consistent. But consistently wrong.On to other matters. What a story. What a complicated man Ted Williams was. I was flabbergasted at his generosity and his wrath, his deep love for the same children he verbally abused, his passion for hitting and fishing and hunting, his swiftness to visit an ailing child but reluctance (failure) to make it home for the birth of his own. An incredibly complex persona, The Splendid Splinter.Montville's writing style is a little too conversational for my taste, but he tells the story vividly. From his Salvation Army mom in San Diego at the start of his life, to the controversy over cryonics at the end, and including all the baseball and military service and foul language and broken marriages in between, Williams' life makes a fascinating story that is well-woven in this book."}, {"userName": "Leon Lee", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/20107197-leon-lee", "userReview": "the best book I read in a long time... This book ( in my opinion ) is a 6 star book. I am just a regular red sox fan, and I didn't know much about Ted williams before I picked up this book. All I knew was that Ted Williams was a great player for the red sox, ( and pretty much the best in MLB history ) and I wanted to learn more about him. This book looked pretty interesting, so I started reading, and I had no regrets of EVER starting it. Ted Williams was a angry man; he had very short temper, but one thing kept everyone from hating him; baseball. The splendid splinter was too good in baseball for anyone to ever hate him. If he didn't have baseball in his life, he probably would've just been this guy that no one likes. But not only baseball, but Ted also served in two wars. He missed 5 years of baseball because of the war, but he is still considered one of the best hitter in MLB. Before I read this book, I just thought of Ted as a ball player, but once u read this, u will think way different. The splendid splinter, the kid, teddy the ball game, the Ted Williams is not only a ball player, but an American hero"}], "description": "He was The Kid. The Splendid Splinter. Teddy Ballgame. One of the greatest figures of his generation, and arguably the greatest baseball hitter of all time. But what made Ted Williams a legend – and a lightning rod for controversy in life and in death? What motivated him to interrupt his Hall of Fame career twice to serve his country as a fighter pilot; to embrace his fans while tangling with the media; to retreat from the limelight whenever possible into his solitary love of fishing; and to become the most famous man ever to have his body cryogenically frozen after his death? New York Times bestselling author Leigh Montville, who wrote the celebrated Sports Illustrated obituary of Ted Williams, now delivers an intimate, riveting account of this extraordinary life. Still a gangly teenager when he stepped into a Boston Red Sox uniform in 1939, Williams’s boisterous personality and penchant for towering home runs earned him adoring admirers--the fans--and venomous critics--the sportswriters. In 1941, the entire country followed Williams's stunning .406 season, a record that has not been touched in over six decades. At the pinnacle of his prime, Williams left Boston to train and serve as a fighter pilot in World War II, missing three full years of baseball. He was back in 1946, dominating the sport alongside teammates Dominic DiMaggio, Johnny Pesky, and Bobby Doerr. But Williams left baseball again in 1952 to fight in Korea, where he flew thirty-nine combat missions—crash-landing his flaming, smoke-filled plane, in one famous episode.Ted Willams's personal life was equally colorful. His attraction to women (and their attraction to him) was a constant. He was married and divorced three times and he fathered two daughters and a son. He was one of corporate America's first modern spokesmen, and he remained, nearly into his eighties, a fiercely devoted fisherman. With his son, John Henry Williams, he devoted his final years to the sports memorabilia business, even as illness overtook him. And in death, controversy and public outcry followed Williams and the disagreements between his children over the decision to have his body preserved for future resuscitation in a cryonics facility--a fate, many argue, Williams never wanted. With unmatched verve and passion, and drawing upon hundreds of interviews, acclaimed best-selling author Leigh Montville brings to life Ted Williams's superb triumphs, lonely tragedies, and intensely colorful personality, in a biography that is fitting of an American hero and legend.", "title": "Ted Williams: The Biography of an American Hero", "url": "https://www.goodreads.com/book/show/410841.Ted_Williams", "average": 4.09, "cover": "https://images.gr-assets.com/books/1320433152l/410841.jpg", "reviews": 76, "authors": [{"url": "https://www.goodreads.com/author/show/232680.Leigh_Montville", "name": "Leigh Montville"}], "type": ["Sports and Games", "Sports", "Biography", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/410841.Ted_Williams", "http://www.goodreads.com/book/show/1925222.Ted_Williams", "http://www.goodreads.com/book/show/7914612-ted-williams", "http://www.goodreads.com/book/show/820878.The_Big_Bam", "http://www.goodreads.com/book/show/9080316-evel", "http://www.goodreads.com/book/show/2407107.The_Mysterious_Montague", "http://www.goodreads.com/book/show/1616782.At_the_Altar_of_Speed", "http://www.goodreads.com/book/show/32336168-sting-like-a-bee"]}