{"ratings": 121, "userreviews": [{"userName": "Debra", "userReviewDate": "Nov 25, 2014", "userURL": "http://www.goodreads.com/user/show/1135162-debra", "userReview": "Iranian born Reza Malek enjoys living and teaching in New York. He’s been in America since age twelve and has no desire to return to Tehran. But a request from close friend, Sina Vafa to come back and help him with legal matters worries Reza enough to make the trip and see what the anti-American Sina has gotten himself into. Of course, the legal matters are much more complicated than Reza imagined. Sina is being watched by a bureaucratic middleman with an agenda. The unexpected reunion with Reza’s mother and meeting her friend Anna adds another layer to this world of varying lifestyles and multi-ethnicity.Tehran at Twilight is a terrific story that reveals subtle and not so subtle layers of relationships, wants, needs, and decadence in this crowded and complex city. Every paragraph has a purpose, every minor character plays a role in revealing political and social landscapes. It’s interesting to me that author Salar Abdoh chose to reveal these landscapes through the relationships of two childhood friends and their mothers, and that the fathers are only backstory references. In fact, the five women in this story, (major and minor characters) portray a starker, more poignant contrast in lifestyles than Reza and Sina.The book gives us a glimpse into Tehran’s strengths and weaknesses, its ubiquitous corruption, political tension, hidden agendas, and violence. It made me look at Tehran’s citizens differently, to understand that the city is an intricate patchwork of diversity. For instance, I had no idea that many Polish refugees, including Jews, wound up in Iran during WWII, which save them from both the Holocaust and Stalin. And this was the most insightful part of the book for me. Most of us in North America know little about Iran’s incredible history, and we probably should. This novel is a very good start."}, {"userName": "Tony", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/151601-tony", "userReview": "This is a tough book to write about because it's kind of packaged as a thriller, but it isn't really one -- or rather, isn't a thriller in the sense most people think of the genre. It's a lot more quiet, subtle, and meditative than that -- it's really more about exile, friendship, family, and showing how life in Iran really works. The story revolves around Reza, an Iranian-American whose moved to California as a teen after the 1979 revolution, went to Berkeley and got a PhD, then worked as a translator throughout the Middle East, and is now a middle-aged journalism professor on year-to-year contracts at a Fordham-like school in New York City. When his closest friend from Berkeley asks him to come to Tehran, he gets embroiled in a convoluted scheme involving the friend's potentially vast inheritance of property seized during the revolution. Meanwhile, Reza becomes friends with a former US Marine officer who joins the faculty at his school, and also gets tangled up in the plans of an ambitious American journalist he used to translate for.The inheritance is more or less a MacGuffin to draw Reza to Tehran and give the characters some stakes. But the story's real aim is to show the reader just how much of what happens in Iran, and the Middle East in general, is about money and power, rather than religion and beliefs. Every conversation Reza has is a veiled negotiation, and behind every player are untold layers of other players, and within every scheme are three others. Where a conventional thriller would have the hero discover all this in wide-eyed shock and suspense along the way, the strength of this book is that Reza knows all this and recognizes that he can only play the game within certain margins and only push so far before things get very dangerous. This all happens among an array of colorful characters -- from a semi-official minder/fixer who may or may not be working for the Iranian government and/or intelligence, to functionary thugs, a mysterious Afghan crime boss, and even the jetsetting, yoga-loving, elite of the city.Meanwhile, Reza is constantly recalibrating his relationship with the old friend who dragged him into all this. The friend may or may not be involved in some kind of murky quasi-terrorist group operating in Iraq, and may or may not have found religion along the way. Readers who need everything clearcut are advised to stay away, since the whole point of the book is that notions of set ideology, allegiance, or belief are laughably naive in Tehran. In contrast to this is Reza's ex-Marine friend, who is a real American hero who grew disenchanted with the war and dropped out. Although his internal code of honor is naive to Reza, it is also the one true good thing he can point to as cause for hope. Along with the aforementioned plot lines, there is another involving Reza's long-lost mother, and an entirely separate strand involving her dying neighbor, who came to Tehran as a Polish refugee during World War II. This latter element is well handled, and yet feels largely shoehorned in to share the remarkable story of how 115,000 Polish refugees came from the USSR to Iran during World War II. So, there's a lot going on in a relatively few pages -- and at times it can get a little busy and distracting. Still, this is an excellent and thoughtful book that will do more to give a reader a sense and feel for contemporary Iran than any number of long articles in the Times or Economist."}, {"userName": "Tuck", "userReviewDate": "Oct 20, 2014", "userURL": "http://www.goodreads.com/user/show/565487-tuck", "userReview": "a sketch of iran/persian worldview all wrapped up in a noir story of a usa prof brought back to tehran to help his old college buddy, finds out his mother still lives, his buddy is an international jihadist, and iran really really does not want him there, if the shady dudes can first get him to sign over a fortune in real estate. yeah."}, {"userName": "Taylor Yardley", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/9367169-taylor-yardley", "userReview": "Could have been amazingly immersive but it fell short. The story being told felt like it was missing some crucial detail to make the reader truly empathize with Rez's experience. On one hand, I appreciate an author assuming the reader is intelligent. Leaving some details unsaid as opposed to spelling out everything shows trust in the reader's comprehension. For me though, especially when dealing with a culture and country I am not as familiar with, some things need to be spelled out to truly grasp the emotion. For example, I can assume that the political climate in Tehran was tense and that dealings such as property exchange when a lot of money is involved could be dangerous and even deadly. That's as far as it goes though, and I felt the novel rushed through some of the scenarios that could have been discussed a bit more thoroughly for the reader to connect with the protagonist."}, {"userName": "Marvin", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/2582387-marvin", "userReview": "A complicated story set in a complicated place. A young Iranian American immigrant gets drawn back to Tehran by his longtime friend to participate in a complex scheme with many tentacles, requiring him to negotiate the corruption and violence of contemporary Iran. As my rating suggests, it was OK."}, {"userName": "Tom", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/1490689-tom", "userReview": "Just wonderful. Nice plot twists. good insight into someone straddling cultures."}, {"userName": "Sarah-Hope", "userReviewDate": "Nov 10, 2014", "userURL": "http://www.goodreads.com/user/show/9059923-sarah-hope", "userReview": "I’ve been doing my best to read any fiction I come across that depicts life in contemporary Iran. Thus far, Salar Abdoh’s Tehran at Twilight is the best of those I’ve read.Abdoh’s Iran is a place where the question isn’t if one has been complicit, but rather the extent of one’s complicity. Malek Reza, the novel’s protagonist, is an Iranian-American, one who initially supported the revolution, but moved to the U.S. with his father when the revolutionary government became as violent towards its own citizens as the shah’s had been. As Reza notes near the end of the book, “Change always carried a price. Often that price was that there would be no change at all”—words that, unfortunately, ring true in too many countries, including the U.S.Reza’s best friend, Sina Vafa, has returned to Iran after he and Reza finished their educations at U.C. Berkeley. Vafa is still committed to the revolution despite its disappointments, still eager to engage in clandestine activity in Iran or in surrounding countries.After years of separation, Vafa contacts Reza, asking him to return to Iran and—upon Reza’s return—asking him to accept Vafa’s power of attorney. This request, not surprisingly, is more complex than it seems, ultimately sundering the two men’s friendship:Later on, whenever he thought about it, Malek would come back to this night as the precise moment when something broke between him and Sina. It was like he was watching his friend drift away in a boat and there was nothing he could do to stop it or reel him back in. Something was finished. But they still had to play along.Part of the novel’s richness is that it looks beyond these characters’ lives to see present-day Iran through other sets of eyes as well. There’s James McGreivy, a former marine grown critical of U.S. policy, who’s been hired to teach writing at the same New York college where Reza is employed. Importantly, there are two mothers as well: Reza’s, who walked away from him and his father before the revolution, and Vafa’s, living in straightened circumstances since her son evicted her from the one piece of property she’d been able to reclaim from the revolutionary government. The relationships among these characters balance love, distrust, and bitterness in varying amounts. In the Iran of the novel, no relationship is simple.Tehran at Twilight begins a bit slowly, but is worth sticking with. As the characters and their predicaments engage you, you’ll find yourself reading more quickly, hungrily, and feeling unwilling to put the book down. Read this book both for the picture of Iran it offers and for its insights into human relationships."}, {"userName": "Jennifer Collins", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/1894213-jennifer-collins", "userReview": "Abdoh's Tehran at Twilight is smart and artful, centering on a jaded academic who is both transplanted Iranian and American translator & professor. His interweaving of politics with intrigue, day-to-day frustration with basic emotion and common sense, and jadedness with idealism, make it a frighteningly realistic book, one which follows a man who does his best to remain impartial and jaded, and is still, irrevocably, swept up.The book's sole failing is that, if anything, protagonist Reza Malek is portrayed too believably as he moves between the chaos of Tehran and the stale politics of his barely-retained job at a small university in America. He is, absolutely, jaded and detached from all about him, and believably so given his position. The untenable position of the novel, though, is to make a character such as this engaging and human, and in a short span of time. Abdoh succeeds at the task, but it isn't a quick journey. As such, the first half of the book proceeds as something of a testimonial to events with Malek as the witness, but his lack of emotion puts the reader in a similar position--it's difficult, at best, to engage with the humanity behind the book. Yet, for readers who follow through, drawn on by the plot, the second half of the book is all but a one-sitting read, as Malek is forced to reckon with the fact that impartiality can only take him so far, and that his two countries will, very simply, force him to make choices and acknowledge his own humanity, and that of his family and friends.Simply, he cannot remain impartial and entirely detached in a world that refuses to view him as such.In the end, the book is powerful, but it is also a slow-burner. I went into the second half of the book acknowledging that it was well-written, but all the same, ready for it to hurry and finish. And then, after having plodded along slowly for more than a week, I couldn't put the book down for those last 115 pages. Call it political noir or a thriller or a drama or anything else you wish--this book truly does defy boundaries; and while it is, if anything, too realistic to move quickly in the beginning, it is also unfailingly impressive by the end.No doubt, I'll be looking for more of Salar Abdoh's work in the future, and if noir or the politics of a chaotic world could entice you to read anything...well, this comes recommended. Wander through the beginning, I'd say, and then hold on until you reach the end."}, {"userName": "Genevieve", "userReviewDate": "Sep 30, 2014", "userURL": "http://www.goodreads.com/user/show/5177572-genevieve", "userReview": "Tehran at Twilight by Salar Abdoh is a bare-bones political thriller that alternates between New York City and Tehran. Malek, a journalism professor teaching in the Big Apple is contacted by his best friend, Sina, a former classmate at UC-Berkeley. Sina asks him to meet him in Iran to discuss a business arrangement. The request is shrouded in mystery and Malek is both intrigued and interested in helping his friend. Reluctantly Malek agrees and travels immediately to Tehran. Soon Malek gets sucked into the quicksand of politics and religion. A revolution is in the air and his friend Sina is wrapped up in a militant group clawing for more radicalization. The atmosphere in the book is tense, and a buzz of paranoia permeates Malek's world as he tries to navigate the shady clerics, agents, and fixers who try to push their agendas. Meanwhile things get complicated with the arrival of Clara, a fellow journalist with whom Malek has had an affair and for whom he does translation and guide work. Clara is on an assignment in Iran and wants Malek's help to uncover a story. Other subplots work their way in: Malek finds his long-lost mother; Malek runs errands around town, all the while trying to dodge spies, particularly one wily watchdog, Fani.The great thing about Tehran at Twilight is that it is a hard-nosed look at the Tehran underworld from the eyes of locals. The city comes alive in Abdoh's hands and he captures the machinations of all the special interests at play (and at war). As a no-frills genre read, it's pretty good. Abdoh manages to pack a lot of story into a slim book. Sadly, it doesn't have the complexity of your typical Le Carre book and lacks the lush prose that I crave, but I think that's the stoic, noir style coming through. Toward the end, the book reveals itself less as a traditional thriller and more as a prodigal-son-returns-home tour and quiet exploration of personal loyalties.[Disclaimer: I received an ARC of this book from the publisher for an honest and candid review. This review was originally written for LibraryThing Early Reviewers.]"}, {"userName": "M", "userReviewDate": "Aug 07, 2014", "userURL": "http://www.goodreads.com/user/show/27102110-m", "userReview": "I received an advance review copy from publisher through LibraryThing Early Reviewers program.Reza Malek, an Iranian born American, returns to Tehran after a frantic call from his friend, Sina Vafa. Sina is vague about his problem but insists that he needs Reza’s help. Reza steps into a world of intrigue and double-dealing with shady characters as part of an apparent scheme to recover the assets of Sina’s family. But there is more going on than getting the vast Vafa holdings back from the revolutionary government. Sina is involved with an underground movement and he disappears leaving Reza with his power of attorney. With the aid of a less than honest lawyer, Reza works through the tangled bureaucracy and the slimy underworld where things get done with threats, violence, and money.Reza also reunites with his mother, Soaad, and wants to get her out of Iran. Sina’s mother and stepfather also need Reza’s help. A sub plot involves the story of Soaad's neighbor Anna, a Polish born Jewess turned Catholic turned Muslim.Reza’s activities highlight the muddle of Middle Eastern intrigue, American interference, Iran’s relationships with neighboring states, the religious divides, and the opposition parties in Iran itself. But the core of this story is in Reza’s relationships with his friend and with his mother. Amid all the lies and deceit, there is a code of loyalty to friends, family, and country. When loyalties collide how do we set our priorities?Salar Abdoh deftly leads us through this maze of custom, ethics, and morality that is often difficult for outsiders to comprehend. This novel is a worthwhile contribution to the understanding of contemporary Iran."}, {"userName": "Cindy", "userReviewDate": "Sep 06, 2014", "userURL": "http://www.goodreads.com/user/show/32434512-cindy", "userReview": "I received this book from a Goodreads First Reads giveaway. I was really interested in the book, based on the synopsis of the story, and also because I had read Prisoner of Tehran and subsequently attended a lecture by that author after I finished her book. And so, this one also piqued my interest. The other reviews tell the story line of the book, so I won't include it. I am always interested in the personal interactions of people who live in countries other than the USA. (We) USA people have a tendency to assume the entire world thinks and reacts as we do, which couldn't be further from the truth. We've travel internationally a lot and we love to visit out of the way places and experience the every day lives of the citizens. Iran and other places, are too dangerous for an American to travel to, so I love to read books on that subject matter.This book didn't disappoint. It's a fictional \"slice of life\", and to be honest, I was sorry when it ended. I thoroughly enjoyed it and the author's struggle between the life he left in Iran and the life he'd become accustomed to in the USA felt real, even though the book is fiction. I liked the way the author spoke to the reader, frankly and without being pretentious. It moved along at a good pace and I was never bored. I like his style of writing and I would like to read more from this author. I'm going to keep it on my shelf of books that I would like to read again some day. Thank you for a great book!"}, {"userName": "Betty", "userReviewDate": "Sep 04, 2014", "userURL": "http://www.goodreads.com/user/show/3541694-betty", "userReview": "“Tehran at Twilight” is very well written; however, I just could not get into the story. It really seemed to drag for me. The tone of the book is a combination of tenseness and mystery. Most of the book is on Malek trying to figure out what his friend Sina is up to. Sina has asked Malek to be the power of attorney on his assets, should the government finally turn them over to Sina. As the story is set in Iran, there is a lot of paranoia. I did enjoy the subplot of Malek finding his mother, a total surprise to him, and his effort to get her out of Iran. There is also an interesting subplot involving Anna, the friend of Malek’s mother. Anna was born a Polish Jew. While most of the “Tehran children” were sent on to Palestine, she was not. So she grew up as a Catholic and then converted to Islam in order to get married. I normally enjoy books with Middle Eastern politics but this one was just too slow for me."}, {"userName": "Darius", "userReviewDate": "Aug 07, 2014", "userURL": "http://www.goodreads.com/user/show/9710621-darius", "userReview": "After winning \"Tehran At Twilight\" in a Goodreads giveaway, I was excited to begin reading a novel that primarily takes place in Iran. I myself am half Iranian so I was intrigued by a novel that was both written by an Iranian-American and whose plot centers around the capital city of Iran. While those aspects of the book made it more interesting for me, the story itself lacked a lot for it to get anymore than a two star rating. In many instances, the dialogue between characters was very vague. Also, some parts of the story were just unrealistic; I wasn't convinced that they could actually happen. Those are the two main bad aspects that I found. The good aspects are that Abdoh portrays cynicism and despair fantastically. I really felt the overwhelming sadness and struggle of the main character Reza.Thus, overall, \"Tehran At Twilight\" was an enjoyable read and one that was worth my time. But not something I loved."}, {"userName": "Christopher Dean", "userReviewDate": "Nov 24, 2015", "userURL": "http://www.goodreads.com/user/show/7549163-christopher-dean", "userReview": "Tehran at Twilight may be described as a noir mystery-thriller, albeit a quiet one. The story focuses on Iranian-born Reza Malek who, along with several other major characters in the novel, is faced with a number of divided loyalties related to friendship, country, family and politics. The story moves against a backdrop of recent Iranian political history which culminates in the major protests held in Iran following its 2009 elections. In this respect, the novel is not only a very interesting read as a thoughtful thriller, but it also coincidentally educates the reader about the complexities of middle eastern politics where there is no black and white - only grey. Macro politics aside, Tehran at Twilight narrates a very personal story and provides many insights into the mind of a one-time refugee who has yet to decide where home is - both physical and spiritual."}, {"userName": "Frank", "userReviewDate": "Nov 27, 2014", "userURL": "http://www.goodreads.com/user/show/5459444-frank", "userReview": "An interesting Noir Novel which is significant in its depiction of life in Tehran before and after the Revolution and the impact these changes have had on the criminal element and their subsequent interactions with the government officials in power, clerics, spies, Islamic militants and other nefarious types within the City. The Author is Iranian and writes a good story about two college pals one, an Iranian American and former interpreter for the Americans fighting in Iraq and Afghanistan while the the other is an Iranian triple agent whose parents are among the most affluent in Tehran. Salar Abdoh weaves a somewhat unbelievable tale of true friendship and loyalty."}, {"userName": "Elizabeth Fredericks", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/28627805-elizabeth-fredericks", "userReview": "An interesting premise, and a window into a place and time that many English-language readers have only limited familiarity with. Abdoh does occasionally give readers a peek into these places, but the prose has such a quality of reserve that the story's emotional stakes never feel fully established, or characters fully realized. A stronger sense of who these people are and why they matter to each other would have made the partial tragedy of the story feel more real, and its limited victories more of a relief."}, {"userName": "Susan", "userReviewDate": "May 23, 2015", "userURL": "http://www.goodreads.com/user/show/1879479-susan", "userReview": "From the book cover descriptions, this novel sounded better than I actually found it to be, although it's a decent-enough read. When Reza Malek, a professor at a NY college gets a call from his best friend, Sina Vafa, in Iran, the former reporter of the Afghanistan conflicts returns to Iran to help his friend. In agreeing to a favor his friend asks of him, Malek becomes immersed in Tehran's instability, and we read of political repression, revolution, and corruption."}, {"userName": "Denise", "userReviewDate": "Sep 10, 2014", "userURL": "http://www.goodreads.com/user/show/1329090-denise", "userReview": "Thriller set in Tehran & the Mideast. Gained some appreciation for all the Iranian people, as well as other nearby countries have gone through in past years. Iranian-American professor is called by his childhood friend to help settle his estate, but there are complications, plus danger involved. In the process, he reestablishes a relationship with his long-lost mother and gains some unlikely friends."}, {"userName": "Megan Geissler", "userReviewDate": "Aug 10, 2015", "userURL": "http://www.goodreads.com/user/show/22262218-megan-geissler", "userReview": "A bit overwrought - there's this mysterious undercurrent and angst but it's not always clear what the point is. It's an entertaining read if a bit sloppy. I like the way different ethnic and racial elements are included. It handles some socioeconomic issues skillfully and without politicizing or being overtly biased. I'd read more by the author."}, {"userName": "Gina", "userReviewDate": "Sep 05, 2014", "userURL": "http://www.goodreads.com/user/show/15392592-gina", "userReview": "I received this book from a Goodreads First Reads giveaway. While I was really interested based on the synopsis and premise of the story, I felt like there needed to be more to the characters and their stories."}, {"userName": "Sherri M. Weiler", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/54727452-sherri-m-weiler", "userReview": "Highly realisticCovers both the gritty realism of life in today's Tehran as well as the choices each character must make in order to survive in a world of increasingly complicated loyalties."}, {"userName": "Megan Tristao", "userReviewDate": "Jun 15, 2015", "userURL": "http://www.goodreads.com/user/show/6924236-megan-tristao", "userReview": "This book was boring for me. A lot of the beginning was written in dialogue, so when I didn't quite understand something, I didn't get much context to help me out. Maybe a stronger knowledge of the events in the Middle East around 2008 would have made this book more interesting."}, {"userName": "Abdul Mackie", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/6793630-abdul-mackie", "userReview": "A good political thriller and good insight on Iranian society from an Iranian American university professor."}, {"userName": "Sonia Hernandez", "userReviewDate": "Jul 01, 2015", "userURL": "http://www.goodreads.com/user/show/13069359-sonia-hernandez", "userReview": "The storyline was ongoing, just enough background information for each character and situations of Iran, read as if it was a non fiction."}], "description": "\"Swift, hard-boiled novel...Shadowy zealots exist everywhere, whether in conference rooms or interrogation rooms or--most often--in rooms that can serve as both.\"--\nNew York Times Book Review\n\"Abdoh paints a gripping portrait of a nation awash in violence and crippled by corruption....Captivating.\"--\nPublishers Weekly\n\"Abdoh...gives readers a visceral sense of life in a country where repression is the norm, someone is always watching, and your past is never really past. Recommended for espionage aficionados and for readers who enjoy international settings.\"--\nLibrary Journal\n\"A fascinating glimpse of contemporary Iran through the familiar story of childhood friends whose paths are beginning to diverge irreversibly.\"--\nShelf Awareness\n\"A penetrating look into contemporary Tehran.\"--\nKirkus Reviews\n\"Salar Abdoh is an acute observer of the patterns, flaws, and simple beauties of everyday life...[Tehran at Twilight is] an unpretentious, cross-cultural political thriller that rings true in the way only a skillfully crafted novel can.\"--\nSan Francisco Book Review\n\"Abdoh's restraint with the brutality in present-day Iran in no way tamps down the adrenalin that keeps his characters in action...Goodness and mercy eventually carry the day, within limits, and this relatively new author may already have potential readers looking forward to his next novel.\"--\nThe Buffalo News\n\"New history and a fresh take on the same old dirty tricks result in a clever and compelling tale.\"--\nThe National\n (UAE)\"Abdoh is superb...Tehran at Twilight is an impressive work of fiction...Abdoh's talent is obvious from the first scene in the story until the bittersweet end.\"--\nCounterPunch Magazine\n\"Abdoh's Iran is a place where the question isn't if one has been complicit, but rather the extent of one's complicity.\"--What If KnitsIncluded in Library Journal's \"Books That Buzzed at BEA\" Roundup, the first word on titles and trends from Barbara Hoffert, Editor\"Abdoh deftly captures the uneasy atmosphere of 2008 Tehran, swirling with betrayal and corruption.\"--\nLibrary Journal\n, Books for the Masses/Editors' Picks BEA 2014The year is 2008. Reza Malek's life is modest but manageable--he lives in a small apartment in Harlem, teaches \"creative reportage\" at a local university, and is relieved to be far from the blood and turmoil of Iraq and Afghanistan where he worked as a reporter, interpreter, and sometime lover for a superstar journalist who has long since moved on to more remarkable men.After a terse phone call from his best friend in Iran, Sina Vafa, Reza reluctantly returns to Tehran. Once there, he finds far more than he bargained for: the city is on the edge of revolution; his friend Sina is embroiled with Shia militants; his missing mother, who was alleged to have run off with a lover before the revolution, is alive and well--while his own life is in danger.Against a backdrop of corrupt clerics, shady fixers, political repression, and the ever-present threat of violence, Abdoh offers a telling glimpse into contemporary Tehran, and spins a compelling morality tale of identity and exile, the bonds of friendship, and the limits of loyalty.", "title": "Tehran at Twilight", "url": "http://www.goodreads.com/book/show/20949544-tehran-at-twilight", "average": 3.31, "cover": "https://images.gr-assets.com/books/1404782867l/20949544.jpg", "reviews": 25, "authors": [{"url": "https://www.goodreads.com/author/show/462415.Salar_Abdoh", "name": "Salar Abdoh"}], "type": ["Fiction", "Cultural", "Adult Fiction", "Mystery", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/20949544-tehran-at-twilight", "http://www.goodreads.com/book/show/23510637-tehran-at-twilight", "http://www.goodreads.com/book/show/20949595-tehran-noir", "http://www.goodreads.com/book/show/902374.The_Poet_Game", "http://www.goodreads.com/book/show/5145923-urban-iran", "http://www.goodreads.com/book/show/1633086.Opium", "http://www.goodreads.com/book/show/36475946-baghdad-noir", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}