{"ratings": 476, "userreviews": [{"userName": "Cassie", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/22841883-cassie", "userReview": "Update: Only the shortened board book version doesn’t follow the tune of “Ten on the Bed.” The paperback version is great and I’m upping my rating to 5 stars. The board book version still gets 2 stars.———I was so disappointed to find that only the first page followed the tune of \"Ten on the Bed.\""}, {"userName": "Dorine", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/6942470-dorine", "userReview": "I borrowed this one from the library, thinking our youngest granddaughter would enjoy it. Instead, the nine-year-old caught on to the similarities to Five Little Monkeys Jumping on the Bed and thought it was cute.The illustrations are beautifully rendered with great expressions on the animals. What I enjoyed about the story, of course, is that it reminded me of my favorite Five Little Monkeys Jumping on the Bed, but also the words used in each example. When one \"fell\" off the sled, they would spill, or whirl, or squeeze out, etc... They would duck under, hold tighter, glide and ride. The variety is very well done.I think the words used are what are most important in this story for teaching similarities and variety to a child. The illustrations and sing-song style of the story seem to hold their interest.Review by Dorine from a borrowed library book."}, {"userName": "Pamela", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "Rollicking . . . Rhyming-ly . . . Frolicsome . . . FUN!  I loved it!! Delightfully lyrical text. Double thumbs up for the playful illustrations.A sing along, count along, sledding adventure with a motley crew of animals from the Land of the Midnight Sun. My younger Grands will love it too. Perfect for sharing during winter festivities. And if you don't have any Grands or Children of your own to read to, public libraries and various other literary agencies are always in need of passionate volunteers. FIVE **** Delightfully Frolicsome, Read Aloud Picture Book Fun ***** STARS"}, {"userName": "Omid Milanifard", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/51738076-omid-milanifard", "userReview": "It's about teaching number to kids, but I think is not attract child good enough.."}, {"userName": "babyhippoface", "userReviewDate": "Jan 17, 2013", "userURL": "http://www.goodreads.com/user/show/282057-babyhippoface", "userReview": "I'm diggin' the fox wearing a crash helmet. Safety first, especially near the North Pole, I guess.There were ten on the sled, and the caribou said, \"Slip over! Slide over!\" So they all slid over, and Seal spilled out.Before long, all the Arctic animals have toppled out, from walrus and wolf to moose and squirrel(not the Rocky and Bullwinkle type moose and squirrel, although that would've been great). Kids will recognize the meter of this book quickly and will like the comical illustrations, as well. It's a fun, snowy romp to share with lower elementary classrooms who are learning about all things Arctic."}, {"userName": "Megan Edwards", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/77153557-megan-edwards", "userReview": "Description by Goodreads: Author Kim Norman (Crocodaddy) and illustrator Liza Woodruff have whipped up a rollicking, jolly, snow-filled adventure!In the land of the midnight sun, all the animals are having fun speeding down the hill on Caribou's sled. But as they go faster and faster, Seal, Hare, Walrus, and the others all fall off…until just Caribou's left, only and lonely. Now, a reindeer likes flying-but never alone, so…one through ten, all leap on again!An ideal picture book for reading-and singing along with—over and over. Reason for choosing this book:I chose this book because the book shows the process of subtracting by taking animals off the sled. By the end of the book students will know how to subtract 1 digit numbers. Personal Reaction:I enjoyed this book because it is about animals. The animals all try to squeeze on a sled together but they do not all fit. As the sled goes down the hill animals fall of making the book silly."}, {"userName": "Emma Zvonar", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/70685356-emma-zvonar", "userReview": "I read this book in a practicum class for 2 year olds. I used a felt board and made felt cut-outs that matched the ten animals and had the children help me take down the animal that fell off the sled then count how many were left each time. This is a fun book to sing and is great to use for a simple math activity of counting backwards from 10. The illustrations are fun and the children have fun laughing at the animals that fall off."}, {"userName": "Lynn  Davidson", "userReviewDate": "May 20, 2017", "userURL": "http://www.goodreads.com/user/show/8457950-lynn-davidson", "userReview": "This is a funny rhyming story about ten animal friends who go sledding together in the moonlight. It's a counting book, but the counting starts with ten and goes down to one as one-by-one the animals fall off the sled - all except for caribou. It's made more fun because of word choice, such as Seal spilled out, Walrus whirled out, Wolf wiped out. This story is full of action while taking the child reader through a learning experience. The illustrations are gorgeous, bold, bright and fun."}, {"userName": "Jessica Hostetler", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/70785199-jessica-hostetler", "userReview": "This counting book is set in the winter and the animals are sliding down the hill and it counts down until there is only one on the sled. It is a fun counting book that young children can sing along to. The pictures are well drawn and colorful which makes the read more enjoyable. Teachers can use this book to sing with the children while counting down from ten."}, {"userName": "Jesse", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/5478838-jesse", "userReview": "We've had this book checked out for foreverrrrrr! We love it a bunch! A new take on the familiar Ten in the Bed song/book. This time there's a winter twist! We'll be adding this to our personal collection."}, {"userName": "Tomi Alger", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/43124532-tomi-alger", "userReview": "Ten animals, mostly from the forest, ride down the mountain on a sled. But, wouldn't you know it, as they zoom downhill, one by one the animals bounce off the sled. This is a counting down book. Kids will love it."}, {"userName": "Katy", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/57738880-katy", "userReview": "This one is pretty fun, and definitely a winter storytime possibility."}, {"userName": "Jennifer Margeson", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/11138949-jennifer-margeson", "userReview": "My favorite! My students love it - well written and plenty of action words to involve my listeners. I love singing this to my preschool music classes!"}, {"userName": "Viviane Elbee", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/61572976-viviane-elbee", "userReview": "Fun winter-time book. There are ten animals smushed on a sled..."}, {"userName": "Mallory Vickers", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/77226119-mallory-vickers", "userReview": "I read this book during class. I like this book because its a winter time book and also a counting book. I think one lesson teachers could do with this book is doing subtraction and addition problems with it."}, {"userName": "Rebecca Gomez", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/22527440-rebecca-gomez", "userReview": "If you like sledding (or at least the idea of sledding) and counting backwards from then, then you'll enjoy this book."}, {"userName": "Amber", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/22563494-amber", "userReview": "Title: Ten on the SledAuthor: Kim NormanIllustrator: Liza WoodruffGenre: CountingTheme(s): Counting, animals, winter, friends, verbsOpening line/sentence: On a sunlit night,‘neath a snowy moon,there was ONE on the sled,then TWO, but soon…Brief Book Summary: In a winter wonderland, 10 animals are gliding down a hill on a sled too small to fit under them! One by one the animals fall off until it’s just the caribou. Once it’s just him, he invites all his friends back on because sledding alone is no fun!Professional Recommendation/Review #1: Kirkus, 2010A caribou, polar bear, moose, wolf, walrus, squirrel, bighorn sheep, fox, hare and seal all pile onto a toboggan, beginning a North Country riff on the familiar chant: \"There were TEN on the sled / and the caribou said, / 'Slip over! Slide over!' / So they all slid over, / and Seal spilled out.\" One by one, the animals tumble off, each with a different active verb (Hare hops out, Sheep shoots out, Walrus whirls out, etc.). The final line of each stanza is printed with lively disorder, swooping, jumping and sliding on the page. Woodruff adds extra humor by collecting all of the fallen animals in an increasingly bigger snowball that rolls down the hill alongside the toboggan. What with animal identification, counting, vocabulary building and print awareness all scaffolded on a can't-lose rhyme, this one's a keeper.Professional Recommendation/Review #2:Randall Enos (Booklist)Ten on anything is never a good idea. In this case, 10 animals on a sled in the Arctic become 1 lonely caribou as one by one the riders exits are described in alliterative action words: Seal spilled out. Hare hopped out. Sheep shot out. The sled gains momentum, while the displaced animals are picked up by a giant snowball, which races alongside the sled. All 10 reach the bottom at the same time in a tame, anticlimactic ending only to leap on for one more run / and a little more fun / in the moonlit land / of the midnight sun. Although it s not the most thrilling ride, children will enjoy the anticipation as each cartoon-style animal is booted off. The counting down as the sled goes along adds to the fun, while descending numbers and action verbs are emphasized with a colored font.Response to Two Professional Reviews:The first review by Kirkus I thought was spot on. I wish it mentioned how easy it is to sing along. I think this book would be a hit in any classroom or home. The second review seemed to be somewhat negative towards the book, but I liked how he mentioned the alliteration and action verbs as an important aspect to the book. Evaluation of Literary Elements:This book is perfect for children who love a silly, up-tempo book. The characters are all arctic animals (naturally since it takes place on a snowy mountainside) and all have their own personalities. Each one falls off the sled in a silly way and the illustrations add to each of their personalities. For a counting book, the language used seems challenging. The action verbs used are some that seem to be advanced, but with older children this book could be a lot of fun in teaching different verbs. Consideration of Instructional Application:In a classroom many things can be done with this book. First, we could have number magnets on the whiteboard or on small trays that children could take off in order of how many were left throughout the story. Another application with older children is to focus more on the verbs and have the class try to act out the verb of the animal that fell off the sled!"}, {"userName": "Chelsea Williams", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/38896975-chelsea-williams", "userReview": "This is a wonderful little story about counting backwards from 10. It would be a great book to use with Preschool/Kindergarten on counting backwards from ten. It includes a diverse array of different animals, and talks about including everyone in what you do. I really liked this book and hope to use it in my classroom someday. It was fun to read, and I believe that kids would really like it. I know the cover really enticed me to open the book."}, {"userName": "Laurie", "userReviewDate": "Dec 23, 2014", "userURL": "http://www.goodreads.com/user/show/1302875-laurie", "userReview": "Booklist (November 15, 2010 (Online))Preschool-Grade 2. Ten on anything is never a good idea. In this case, 10 animals on a sled in the Arctic become 1 lonely caribou as one by one the riders’ exits are described in alliterative action words: “Seal spilled out.” “Hare hopped out.” “Sheep shot out.” The sled gains momentum, while the displaced animals are picked up by a giant snowball, which races alongside the sled. All 10 reach the bottom at the same time in a tame, anticlimactic ending only to leap on “for one more run / and a little more fun / in the moonlit land / of the midnight sun.” Although it’s not the most thrilling ride, children will enjoy the anticipation as each cartoon-style animal is booted off. The counting down as the sled goes along adds to the fun, while descending numbers and action verbs are emphasized with a colored font. Pair with Suzanne Williams’ Ten Naughty Little Monkeys (2007) and Tedd Arnold’s Five Ugly Monsters (1995) for more countdown fun.Horn Book (Spring 2011)\"There were eight on the sled / and the caribou said, / 'It's slicker! Go quicker!'\" Ten animal friends squeeze onto a toboggan and start a wild ride down a bumpy hill. Animals fall off one by one until only Caribou is left, and the fun begins again. This wintry variant of \"Ten in the Bed\" is accompanied by cheerfully silly illustrations. Kirkus Reviews (October 1, 2010)A caribou, polar bear, moose, wolf, walrus, squirrel, bighorn sheep, fox, hare and seal all pile onto a toboggan, beginning a North Country riff on the familiar chant: \"There were TEN on the sled / and the caribou said, / 'Slip over! Slide over!' / So they all slid over, / and Seal spilled out.\" One by one, the animals tumble off, each with a different active verb (Hare hops out, Sheep shoots out, Walrus whirls out, etc.). The final line of each stanza is printed with lively disorder, swooping, jumping and sliding on the page. Woodruff adds extra humor by collecting all of the fallen animals in an increasingly bigger snowball that rolls down the hill alongside the toboggan. What with animal identification, counting, vocabulary building and print awareness all scaffolded on a can't-lose rhyme, this one's a keeper. (Picture book. 3-6)School Library Journal (December 1, 2010)PreS-Gr 1-In this counting book, a caribou and his Arctic friends pull a toboggan uphill; with 10 aboard, they speed down the mountain. One by one, they fall off the sled: \"Seal spilled out,\" \"hare hopped out,\" \"sheep shot out,\" and so on. While squirrel, who is wearing a skull-and-crossbones hat, squeezes out of polar bear's paws onto a pine-tree branch and almost gets struck by a zooming pinecone. All those wipeouts create a big snowball made of the various animals, and the race is on. Will it be the snowball or the sled that reaches the bottom first? Part of the fun of sledding is to trudge back up the hill to do it again, and that is what happens. The comic-style illustrations in watercolor have hints of pastel and colored pencil, especially in the sky, which gives the landscape a winter warmth while the characters themselves exhibit a playful, cheery spirit. Colored typeface for each number from ten to one adds to the page design, and alliteration plays a part in the rhyming pattern. A light read for libraries with a high demand for winter-themed books.-Sara Lissa Paulson, American Sign Language and English Lower School PS 347, New York City (c) Copyright 2010. Library Journals LLC, a wholly owned subsidiary of Media Source, Inc. No redistribution permitted."}, {"userName": "Jacque Stengel", "userReviewDate": "Nov 13, 2010", "userURL": "http://www.goodreads.com/user/show/4505615-jacque-stengel", "userReview": "A cute backwards counting book that entails a moose, a squirrel, a fox and all sorts of other animals. Along to the tune of \"Ten on the Bed\", the animals find themselves going on a thrilling sled ride and one by one they all fall off until..... (well, you'll just have to read the book)What made me smile:I'll start by mentioning the illustrations. They are adorable! Each animal has it's own personality as they fall off the sled. The story itself, with all of the rhymes is really neat. It goes very quickly and all too soon you are at the end of the book! My favorite line is: \"Great Thunder! Duck Under!\" A very imaginative take on \"Ten on the Bed\".What I didn't like:Well, except for the fact that the song is now rolling around in my head I found nothing I didn't like!In Summary:I would highly recommend this book for some cold weather reading! A great book to snuggle up to and watch the snow outside and just imagine what the animals in your backyard might be doing!The Author:Not only is Kim Norman a talented writer, she is also an artist and a storyteller. Her website is full of pictures of her talented self as well as a cute get to know the author by the kids who love her books! This book gets 7 thumbs up out of 7All views expressed in here are entirely my own"}, {"userName": "Mundie Moms & Mundie Kids", "userReviewDate": "Nov 20, 2011", "userURL": "http://www.goodreads.com/user/show/4397975-mundie-moms-mundie-kids", "userReview": "If there is one children's picture book you buy this year, this should be it! I picked this up last week while working at my son's school's Scholastic Book Fair and it's been a hit ever since! This story has been read numerous times since coming home. It's funny, it's engaging, and it can be read to the tune of \"There Were 10 In The Bed\". In fact, I usually sing the story to my kids to that tune. This story is not only highly entertaining, as hysterical laughing ensues, but it's bright illustrations are great for toddlers as well. If I gave out 10 stars, this book would get that. I love the way the story rhythms, how easy to read it is and the memories that are being built each time we sit down to read this story. I HIGHLY recommend picking this book up! This year it's been re-released in paperback format to be distributed at the Scholastic book fairs, which also makes it a very inexpensive purchase."}, {"userName": "Jennifer", "userReviewDate": "Nov 29, 2011", "userURL": "http://www.goodreads.com/user/show/66673-jennifer", "userReview": "The big draw here is that most of the text can be sung (with a little practice) to the tune of \"There Were Ten in a Bed.\" The story's pretty basic with ten animals on one toboggan sledding down the hill and falling off the sled one by one. Wackiness ensues. Each animal has some sort of winter gear be it earmuffs, a sweater or even a helmet, but moose takes the cake with goggles and rainbow colored leg warmers. Liza Woodruff's get the plot across competently while adding fun details like the snowball that forms out of some of the fallen animals and races the sled to the bottom of the mountain. Water color, colored pencil and pastel all blend well together with lots of motion lines to indicate the speedy action.Used for preschool outreach storytimes. For 3 yo February 2011 and 3-5yo at Sunshine Early Learning Center 11/16/11."}, {"userName": "Luann", "userReviewDate": "Dec 19, 2011", "userURL": "http://www.goodreads.com/user/show/651844-luann", "userReview": "With rhyming text and great word choice, this one begs to be read aloud! (Or even sung aloud to the tune of Ten in the Bed as many others here have suggested.) It also uses fun alliteration (hare hopped out, squirrel squeezed out, moose muddled out) and counts backwards from ten as each animal falls off the sled on its way down the hill. Kids will enjoy keeping track of all the animals as they continue down the hill in a giant snowball after they've fallen off the sled. This is perfect for a wintertime read-aloud."}, {"userName": "Jen", "userReviewDate": "Nov 17, 2016", "userURL": "http://www.goodreads.com/user/show/1833384-jen", "userReview": "Well, this is nonsensical and adorable. It's a counting backwards book (which I didn't realize was a thing, but totally makes sense you think of how often you're taught to count up but rarely taught the other direction) about a crew of critters and their alliterative verbs sledding down a mountain. No great statements are made, each animal is wearing some kind of phenomenal clothing (I see you, moose with the rainbow leg warmers), and the illustrations are beautiful. This would be fun to read aloud, but also it's just fun to read."}, {"userName": "Aleece", "userReviewDate": "Feb 20, 2014", "userURL": "http://www.goodreads.com/user/show/4500965-aleece", "userReview": "This is one of my favorites because instead of monkeys on a bed there are winter animals in a sled. While they start with ten animals it soon goes all the way down to one.This is a very cute and clever story that is really fun to read and kids tend to get a laugh out of the animals and how they leave the sled. The illustrations are really colorful and fun to look at. There is also a snowball full of animals that continues on each page which is interesting to see if kids see it too."}, {"userName": "Rosa Cline", "userReviewDate": "Sep 29, 2016", "userURL": "http://www.goodreads.com/user/show/27718966-rosa-cline", "userReview": "Loved this book! My adult special needs son giggled throughout it as well. Made in the rhyming (song) of \"10 in the bed and the little on said\" but it's 10 in the sled and it's artic animals. A fabulous way of learning about the animals from artic in the winter and of counting backwards. And of friends having fun on a sled!"}, {"userName": "Janet", "userReviewDate": "Nov 23, 2010", "userURL": "http://www.goodreads.com/user/show/3428840-janet", "userReview": "The raditional counting chant form of counting backwards and one leaves. This time its various animal friends leaving a sled. Great wintertime story with lots of rhyming words. I love an author/illustrator team that teaches early literacy skills in a fun way, the children will not know it is happening in this story. Children will be caught up in the fun of it all."}, {"userName": "Dolly", "userReviewDate": "Nov 01, 2010", "userURL": "http://www.goodreads.com/user/show/1019021-dolly", "userReview": "Fun, rhyming narrative that follows a meter that reminds me of Karma Wilson's Bear stories (like Bear Snores On.) The backwards counting is fun and the illustrations are hilarious. We enjoyed reading this book aloud."}, {"userName": "Sheri", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/1412187-sheri", "userReview": "Read this book to some little kindergarten kids and some of the pages with their rhyme are hard to get to work to the music of \"Ten in the Bed and the Little One Said\" tune. This is another book about arctic animals sledding and falling off and then doing it again. Fun winter story and cumulative instead of the Magic 3 structure."}, {"userName": "Michelle", "userReviewDate": "Aug 01, 2012", "userURL": "http://www.goodreads.com/user/show/5788709-michelle", "userReview": "In this cute story, ten different animals all want to go sledding, but as they speed up down the hill all the animals fall, bounce or bail out one by one until only Caribou is left! It's just a fun little story that helps reinforce numbers via basic subtraction with some short rhymes and funny adjectives."}], "description": "Author Kim Norman (Crocodaddy) and illustrator Liza Woodruff have whipped up a rollicking, jolly, snow-filled adventure!In the land of the midnight sun, all the animals are having fun speeding down the hill on Caribou's sled. But as they go faster and faster, Seal, Hare, Walrus, and the others all fall off…until just Caribou's left, only and lonely. Now, a reindeer likes flying-but never alone, so…one through ten, all leap on again!An ideal picture book for reading-and singing along with—over and over.", "title": "Ten on the Sled", "url": "http://www.goodreads.com/book/show/8354061-ten-on-the-sled", "average": 3.96, "cover": "https://images.gr-assets.com/books/1328766934l/8354061.jpg", "reviews": 92, "authors": [{"url": "https://www.goodreads.com/author/show/2856783.Kim_Norman", "name": "Kim Norman"}, {"url": "https://www.goodreads.com/author/show/2090045.Liza_Woodruff", "name": "Liza Woodruff"}], "type": ["Childrens", "Animals", "Childrens", "Number", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/8354061-ten-on-the-sled", "http://www.goodreads.com/book/show/26826911-ten-on-the-sled", "http://www.goodreads.com/book/show/18228566-puddle-pug", "http://www.goodreads.com/book/show/13542527-i-know-a-wee-piggy", "http://www.goodreads.com/book/show/15947585-if-it-s-snowy-and-you-know-it-clap-your-paws", "http://www.goodreads.com/book/show/27284689-still-a-gorilla", "http://www.goodreads.com/book/show/24612714-this-old-van"]}