{"ratings": 28534, "userreviews": [{"userName": "Grace", "userReviewDate": "Apr 29, 2012", "userURL": "http://www.goodreads.com/user/show/1136088-grace", "userReview": "This was a terrible book. Who are these people giving really high ratings to retarded literature? I mean, this had terrible grammar, editing, the writing was CRAP. I mean, it was seriously crap. The beginning of the book was supposed to be from a child's point of view, and it sounded retarded. And I am being nice. If I could give this book NEGATIVE STARS, I WOULD.Basically, it is SUPPOSED to be about a sporty girl who grew up with sporty guys, who's supposed to be \"one of the guys.\" Instead, I am reading about a slutty girl who makes out with her sporty-guy friends, dates randomly, and ends up with one of the friends (Philip, if you're wondering, it's PHILIP, NOT DANNY). And even after Danny marries one of her close friends, she still flirts crazily with him just b/c the friend is okay with their past? No, that is beyond skanky. This is about some crazy party girl who plays strip football (wth??) with her guy friends or plays football in her bikini. The first 65% of the book, it just teases you with who you think she's going to end up with, Danny or Philip or Danny or Philip. Is it Danny, who's hot and makes out with her all the time despite the fact he has girlfriends? Or is it Philip, who's hot and comes to her aid in the middle of a date with his girlfriend? Throughout the entire book, she's just this boy-crazy, lustful, hormone-infused girl who's talking about this guy and how hot he is (times the other guys that appear in the book -- there are about 20). Then she disperses that with comments on how DIFFERENT she is from other girls who are not into sports and into fashion. Even though she herself wears decent clothing and is always getting hit on (or getting it on) with other guys.I am guessing the high rating is b/c at the end of the book, you see that Philip does this HUGE first date thing for the girl, wherein he rents a limo, gives her a charm with all the things that are supposed to mean stuff to her (including a cross and the place she was when her parents died in the car accident -- what the heck...), gives her a spa day, buys this gorgeous dress for her, and then proposes with a 2c diamond ring that she had dreamed of previously. Yeah, yeah, and it's SOOOO realistic. I have found that really really REALLY crappy writing has ended up with high ratings on goodreads because of the gooeyness factor. You can't trust anyone's opinion these days, @#$@#$. I wish I could write 100 reviews to bring down the rating so that innocent byreaders don't get hurt. WHAT A WASTE OF MY LIFE AND I DON'T HAVE THAT MUCH TIME FOR READING THESE DAYS.I will add a note that the first 40% was slightly entertaining and I wanted to find out who she ends up with. However, then it just got annoying, and by annoying, I mean...refer to my above review."}, {"userName": "Marie", "userReviewDate": "Aug 20, 2012", "userURL": "http://www.goodreads.com/user/show/6594537-marie", "userReview": "This book taught me 3 things: 1. That Strip football is the best sport EVER. \"Your shirt or a shoe?”That boy gets a nasty look on his face, but then the look changes and he smiles a wide, slightly evil smile at me.Devil Danny is back, I think, and he's standing right in front of me.I glance at Lisa. She can barely contain her excitement. I mean this is what she has been out here braving the cold for. Danny stands in front of me and very, very slowly pulls his T-shirt up over his chest. He is doing a strip tease act just for my benefit. Although I'm willing to bet, Lisa will warp things in her mind and be convinced that he was showing off for her.Most of me wants to collapse in a fit of giggles, when he gets the shirt off and swings it above his head like a lasso. But I have to admit, when he takes his shirt off, even though I have seen it a million times, it kinda takes my breath away.Just for a minute.Somehow, he is still tan and the sweat on his naked chest glitters in the sun, just like it glitters in the snow all around him. Which shouldn't be that much of a surprise, really. I mean Danny pretty much glitters all the time. His last name is really quite appropriate.God, he has a great chest!I realize that Danny has tossed his sweaty shirt on my head. I take it off and fling it over to Lisa, who catches it and cuddles it with affection.I stand there and grin at that boy. “Chilly, honey?”“Absolutely not, Darling. You?”2. That what doesn't kill you only makes you stronger. “I'll help you.” He grabs my wrists and leads me to a pew. “My family will help you. You know our parents agreed to take care of each other's kids if anything happened to them. Your being eighteen doesn't change how they feel about you.” He runs the back of his hand across my cheek, then holds my chin, forcing me to look up at him. “We love you. I love you. We'll get through it together.” He breaks a little smile. “You know, Grandma Mac used to say, God never gives you more than you can handle.”“My grandma used to say something like that, except hers was, What doesn't kill you makes you stronger.” I shake my head, “It looks like I'm about to get a whole helluva lot stronger.”3. That best friends aren't friends their family. “You'll do fine on your date.” He kisses me on the cheek, throws his arm around my shoulder, and says in a practiced Southern drawl, “JayJay dar-lin', when you're ready ta move on past kissin' and want ta do some more practicin', you just come and see ol' Uncle Danny. Any time. Keep it in the family, Luv.”Oh jeez, now he's British.I just shake my head at him. He really cracks me up.“You're sick. You know that?”“Yeah, well, that's why you love me,” is his smart ass reply.This book was a little bit heart breaking, very very funny and sweet as hell. Jayden... Well you can't help but envy the girl she has courage, looks, popularity and two of the hottest guys as her best friends. Both of whom would do anything for her. She's nice to everyone and everyone loves her.But damn if she does get it rough. All her boyfriends are players, cheats, scumbags and The guy who's been in love with her for years is right infront of her and she does t see it. Her parents are in a tragic car accident and her two best friends are there for her through it all and not to mention their parents who are now her family even though they kinda were before. This book was so Heart Achingly beautiful. I loved every inch, page, and word. I loved Jayden. Phillip, Danny, Lori- there's not one person apart from the EX's that I didn't love. It takes you all through Jayden's life since she was a little girl up until she was 22! Not only do you get to now the charachters inside out but you expierience eir childhood, adolescence and adult years. You grow to love them, feel proud of their accomplishments and of the lives they've chose to lead. Whilst also seeing them wild, hormonal, and adventurous side of them. These are some of my favorite scenes;He reminded me of when we were ten, and he gave me my first kiss. We were on the swings out behind school, and right after he kissed me, he got up and ran away. Then all of a sudden, he stopped, turned around and yelled back, Will you marry me someday? I smile big at everyone as I remember this and tears start streaming down my face.“And I yelled back to him, YES! And so he said that if people ask, I could tell them that we've been secretly engaged for the past twelve years. And so,” I close my eyes for a second and think, here goes nothing, open them and look straight at Phillip, “you will probably all think I am very crazy, but I had to say YES again tonight!”Everyone screams and laughs and claps.I think he saw me giving you a piggyback ride across campus.” Phillip shakes his head at me. “I really don't know why I let you get away with the stuff that you do.”“Because I'm irresistible, Phillip,” I smile and shrug my shoulders. “You can't help yourself. Besides, you didn't go across campus, you only went about fifty feet before you pretended to have a heart attack from supporting my weight and collapsed on top of me in the grass.” THIS BOOK STARTS GREAT, COMTINUES GREAT AND ENDS AMAZINGLY. I CANNOT HONESTLY THINK, OF ONE BAD THING TO SAY ABOUT IT.THE FIRST PAGE IS JUST, WOW. IT BLOWS YOUR MIND FROM THE START. I LAUGHED, CRIED, SWOONED, GIIGGLED- BUT THROUGH IT ALL I HAD ONE BIG GRIN PLASTERED TO MY FACE. I KISSED THIIS BOOK AT THE END. SO SO SO ONE OF MY FAVORITES. BIG BIG BIG FAT 5 STARS!"}, {"userName": "Christy", "userReviewDate": "Jul 31, 2012", "userURL": "http://www.goodreads.com/user/show/11284813-christy", "userReview": "[DANNY! (hide spoiler)]"}, {"userName": "Amy Hollsh", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/11977393-amy-hollsh", "userReview": "Um.... Did I accidentally purchase the incoherent ramblings of a 2nd grader instead of the actual book? Seriously... Who is giving this book 5 stars??The writing is juvenile.The dialogue was so absurdly unrealistic it made me cringe.Our narrator, JJ, is immature and unlikable. I really thought that she would eventually stop sounding like her 3rd grade self but that never happened...She had so many opportunities to grow but completely blew it. GAH. Her parents die for Pete's sake and she's in the hospital thinking about flirting with her attractive young doctor who is delivering the news of their death. Gee, how utterly realistic and mature (insert heavy sarcasm here).Why did everyone love her so much?? The author tried to imply that it was due to her sparkling wit and personality but that surely can't be it since she didn't possess either.She was absolutely boy crazy in the worst way possible.I guess her tomboyishness was supposed to be appealing to Danny and Phillip... But honestly it was such a contrived aspect of her character I can't even.... UGH. Phillip was so goddamn dull.The list goes on and on. For those of you still debating whether or not you are going to read this book, take my advice and DON'T BE FOOLED BY THE EXCESSIVE AMOUNTS OF FIVE STAR REVIEWS. Those people are all crazy. Bottom line: Just don't read this book, it's not worth it!"}, {"userName": "Susanne ", "userReviewDate": "Feb 09, 2012", "userURL": "http://www.goodreads.com/user/show/7179798-susanne", "userReview": "Best book ever! After re-reading it, I am sure. It is divine! It was even better the second time around and I could not put it down! I want to write the most amazing review ever because this book is the most amazing book but until I have time and focus my old one just have to do.I just want to say that this book was so good. It was utterly amazing. I didn't want to change a thing (and I usually have plenty of opinions). I was just so happy to sit back and let Jillian Dodd take me for a wonderful trip. I want to put posters up: you have to experience this little gem.I know that there are do many good reviews of this book but I would never ever imagined that this was going to be the book that made me remember how joyful reading can be. It completely blew me away. I wasn't planning on reading this but I had a sample on my kindle and I checked it out. I was drawn in from the first line. This is also one of those books you cannot explain! It makes me wish there were more stars on goodreads. This book shines and it is way to good to be lumped together with my other five-stars books. It is one of the best books I've ever read. It's about growing up, about friendship and about finding \"that boy\". It isn't romance, it isn't young-adult and it isn't chick-lit. It is pure gold."}, {"userName": "Jenny••Steamy Reads Blog••", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/12634115-jenny-steamy-reads-blog", "userReview": "not gonna spend a lot of time trying to pick the perfect words for this review, this book is old, most everyone, but me, has read it. But if you haven't, please do. I can't wait to read on to see what becomes of this amazing new couple!!!!❤❤❤Love the love you find as kids. It makes for such a journey of a story. Enjoyed this story!!!"}, {"userName": "SueBee★bring me an alpha!★", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/15735368-suebee-bring-me-an-alpha", "userReview": "📚 📌 FREE on Amazon US today (10/3/2017) 📌 📚A CLASSIC!!! Book 1. Series complete.FREE: https://www.amazon.com/That-Boy-Sweet...BLURB:You know, being friends with two cute boys does have its benefits.There's Danny. Danny is a golden boy in every way. He has dreamy blue eyes and blonde hair that always looks perfect, even when it’s windblown or been stuck under a football helmet. He’s the boy every girl crushes on. The boy I get into trouble with, the boy I fight with, the hot quarterback no girl can resist. Being with Danny is like being on an adventure. He has a bright, contagious smile and abs to die for. Equally crush worthy is Phillip. Adorable, sweet Phillip, who I have known since birth. Phillip has dark hair, a perfect smile, brown eyes, and the sexiest voice I have ever heard. He’s the boy I talk to every night before I go to sleep. The boy who rescues me, the boy who can read my mind, the boy who is always there for me, the boy who tries to keep me out of trouble, the boy who irritatingly keeps getting hotter, and whose strong arms always seem to find their way around me. And when he gives me that grin, I can never say no.One boy will give me my very first kiss.One boy will teach me to make out.One boy will take me to prom.And finally, one boy will ask me to marry him.They will both be my best friends.But only one of them will be the boy I fall in love with.Only one of them is That Boy.FREEBIES are often good for MORE than one day. I have gathered all my FREEBIES on a special shelf: Kindle-freebies (currently over 700 books)https://www.goodreads.com/review/list..."}, {"userName": "Jillian Dodd", "userReviewDate": "May 21, 2011", "userURL": "http://www.goodreads.com/user/show/5451642-jillian-dodd", "userReview": "That Baby is releasing soon!! Get it ordered today!That Baby:Amazon: http://smarturl.it/ThatBabyAmazoniBooks: http://smarturl.it/ThatBabyiBooksKobo: http://smarturl.it/ThatBabyKoboGoogle: http://smarturl.it/ThatBabyGP"}, {"userName": "Beverly", "userReviewDate": "Aug 03, 2014", "userURL": "http://www.goodreads.com/user/show/13095060-beverly", "userReview": "* * * * * 5 Love That Boy Stars * * * * *I completely adored this story! It is a quick read, but the story has depth and heart. The story is told from JJ’s (Jadyn Reynolds) point of view. It starts with her telling us about her best friend Phillip, and the horrible day Danny the Devil moved into their neighborhood. See Danny being the devil that he is thinks JJ can’t keep up with him and Phillip since they are big tough boys and she is a wimpy girl, she proves him wrong when she lays him out with a punch. From that day forward a friendship formed. The story is told in chronological order and we follow JJ as she goes through middle school and is made fun of for receiving her first kiss from one of her best friend. High school when she must go on her first date-date with a senior and doesn’t know if she knows how to kiss, so her best friend teaches her how. Then to college where her two best friends help her get through college life. Their friendship helps JJ through some of the most difficult times in her life, they love and protect her but only one can be \nher boy\n.While this trio would immediately make you think…love triangle, drama, angst, big mess - you couldn’t be more wrong. Each person has a role in their dynamic group, and they fit together perfectly. \nI highly recommend this book for everyone!"}, {"userName": "Kellie Maddox-Ward", "userReviewDate": "Apr 22, 2012", "userURL": "http://www.goodreads.com/user/show/7309666-kellie-maddox-ward", "userReview": "I AM ABSOLUTELY IN LOVE WITH THIS BOOK What a breath of fresh air!Lately all I have read is books that literally rip my heart out, make me fall the guy then leave me on a horrible cliffhanger.. Not this one.. I mean yes I got my heart ripped out once... I fell for 2 guys... but I got a HEA with a promise of more... This is the story of JJ, Phillip and Danny. 3 next door neighbours3 best friends told through Jayden's eyes from 4th grade until a few yrs out of college. I laughed, I giggled, I wanted to play strip football, I swooned, I cried (yes literally cried on a train, full of people!) I laughed some more, I swooned some more, I got frustrated, and swooned and laughed some more... then I was just HAPPYIf this was a movie I would watch it ALLLLLLLL the time to make me as happy and giddy as I am right nowI loved the way it was written all choppy, like a diary kind of, with silly little doodles on the top of the page, or in the middle of a sentence. The way JJ would start to go off on a rant and then back on the subject. Sigh I jst loved it HIGHLY RECOMMEND! I can't wait to read the next"}, {"userName": "Lint ", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/8162651-lint", "userReview": "Looking closely at the candle, she says with a sigh so big it blows her bangs up off of her face, “Jadyn, this blows.”That's funny. Candle. Blows. Get it? Oh never mind.My first thoughts:Did a twelve year old write this?Sorry to be the rain to your sunshine, but I did not like it.First of all, JJ was a little childish.Danny is just an ass. One that gives all guys a bad name.Phillip deserved better.But still.I thought JJ was petty.And wasn't all that 'tomboyish'She was actually quite the opposite.Then I was thinking:You. Have. Got. To. Be. Fricking. Kidding. Me.Not only does this book rush into things,but JJ turns out to be an idiot.So much for smart, independent protagonist.And Danny.Again.JJ must have been a real idiot for thinking she had a chance with him.I just cannot believe she did not see what I saw.Well, to put it correctly, what I read.Is she blind, or what?I think everything was horrible.JJ.All she wanted was sex.Yeah, I'll put it out there.At first she hesitated.Then she wanted to get laid.Make up your mind.Now, I'm still thinking:(Or at least trying to wrap my head around this)This book was kinda a waste of 14 hours of my life.Going from page, to page, to page.I think I might have died in the process.JJ was, and still is, an idiot.Danny is still a womaniser in my eyes.And Phillip still deserves/deserved better.Every page had 'kiss'Oh yeah?Well you can kiss my ass.Then there was times when my eye would chuck a spasm.Yes, it would twitch.Too cheesy was the romance.Too foolish was the main character.Too dumb were her actions.Ah, I need a break."}, {"userName": "Kristin (KC) - Traveling Sister", "userReviewDate": "May 11, 2012", "userURL": "http://www.goodreads.com/user/show/4971692-kristin-kc---traveling-sister", "userReview": "*4.5 stars*That Boy is one of those stories that picks up momentum quickly, allowing you to refreshingly dive right in. It was sweet, tender, completely HILARIOUS, and it hooked me instantly!The story is written in the intimate and sort of choppy style of a diary. It begins with the end; a current moment of impact in the life of Jadyn (JJ) Reynolds. It then rewinds to JJ's childhood, filling in all the details of her life leading up to that intense moment-- as we learn just exactly who \"That Boy\" is...JJ's character is incredibly funny, down-to-earth and relatable, as she takes us on her emotional journey from the fourth grade into adulthood. At times, I found her a little immature and superficial, which was understandable during her teen years, but I was hoping for a bit more character growth when she reached her twenties. However, this did not spoil the story or hinder my admiration towards her.Phillip and Danny...JJ's childhood best friends and practically perfect in every way! I wasn't certain who I wanted her to end up with, for the most part. This definitely isn't your typical love-triangle; it has none of the emotional turmoil or heartlessness typically involved and was handled with a delicate grace. And \"the kissing lesson\" was one of my favorite scenes! ;)In sum, this book just made me happy. The writing was witty, realistic, and engaging. The beginning filled me with such incredible excitement, which I felt began to fizzle out towards the end, but then it SMACKED me with another round  of awesome in its final pages! I was in awe-- left with happy, satisfied tears because That Boy was that good!!"}, {"userName": "Eunice", "userReviewDate": "Apr 03, 2012", "userURL": "http://www.goodreads.com/user/show/6078895-eunice", "userReview": "I've been eyeing this book for quite a long time but was a little reluctant to read it since, you see, it involved two boys. You know how I avoid love triangles because it definitely give me headaches and heartaches. And well, I'm scared I might fall for the wrong one and end up being disappointed. BUT all the reviews I see were quite contradicting what I was thinking, not one was actually complaining about a love triangle because, really now that I've read it, there wasn't actually any love triangle. And although ,as expected, I liked the other boy (Danny), I wasn't really disappointed. I didn't have a hard time appreciating the love story and I definitely enjoyed and swooned over how it ended. And that's what made this book really great. You can definitely enjoy both boys without getting disappointed. They both had their fair shares and it was awesome. With the way the story was told it was easy to accept and understand everything. It was definitely a well thought and written book about love, friendship and growing up. When I started reading it I wasn't caught up instantly. At one point I even asked myself what the readers loved about this book. I find JJ a bit whiny and naive and I didn't really loved her right away. Those were my first impressions but as the story progressed, as I saw JJ, Philip and Danny grew up, how they learned stuff and experience new things, JJ eventually grew on me and I started to appreciate the story more. She's more like expressive than whiny and though sometimes she could be a little dumb, that's the thing that actually made her more adorable. Her relationship with Philip and Danny was really funny and cute! And to tell you the truth I was so freaking jealous of her! It was also very heartwarming to see how much those boys loved her and cared for her. I enjoyed every moments between them. It was just really wonderful. One thing I also really loved about this book was that it was fast-paced but still was able to show all the essential parts of their lives starting from their childhood. Well, I tried to do the math and I think the story has a span of 10 years, the first scene was when they were 12 years old and in the ending they were already 22. Right? Uh, not so sure but you see, it was great because you really see how they went to different phases in their lives and how their experiences formed their characters. And that made it easier for me to know and understand them better. It was great when you reached the ending and when you go back to some parts you'll say that wow, they really did grow! It was like you were also reminiscing the past like you were the one who experienced it and that would just made you smile. The ending definitely made me so happy! It was one of the sweetest and most heartwarming endings I'd ever read. It convinced me this is worthy of a 5-star rating. I applaud Jillian Dodd for making such an awesome story and wonderful characters. There were a lot of moments that made me really swoon, laugh so hard and warmed my heart. I highly recommend this! You're gonna love Danny and Philip! And JJ too, of course. It was a fun, sweet and very touching read! :)) This review is also posted at Book Overdose"}, {"userName": "Abbi Glines", "userReviewDate": "Nov 23, 2011", "userURL": "http://www.goodreads.com/user/show/5629438-abbi-glines", "userReview": "This was so freaking good! Loved it."}, {"userName": "Alexis *Reality Bites*", "userReviewDate": "Jul 26, 2015", "userURL": "http://www.goodreads.com/user/show/5587514-alexis-reality-bites", "userReview": "5 STARS! LOVE THIS SERIES! LOVE THESE CHARACTERS!!!!This was actually a reread I originally read this back in March 2012!Here is my goodreads review which was done with the original cover---> https://www.goodreads.com/review/show...  (Pic taken from authors Facebook page)"}, {"userName": "Amy (Foxy)", "userReviewDate": "Jan 17, 2013", "userURL": "http://www.goodreads.com/user/show/9955253-amy-foxy", "userReview": "[leaving out the names so not to spoil the story  (hide spoiler)]"}, {"userName": "Leslie", "userReviewDate": "Feb 09, 2012", "userURL": "http://www.goodreads.com/user/show/5433591-leslie", "userReview": "This hilarious story begins through the perspective of Jadyn, a 4th grade tomboy, who is best friends with Phillip, the boy next door.  Which is nice because he likes throwing a ball around and doing fun non-girly stuff. Although, not long after, a new boy named, Danny, who's mean and thinks football should only be played by boys...hummph!, moves in down the street. So not cool! It takes a couple of days, but Jadyn finally convinces Danny, GIRLS CAN PLAY FOOTBALL TOO and soon, she, Phillip and Danny become the best of friends with an equally rich bond. Through the years that bond carries each of them through wonderfully great times and also some equally tragic ones as well.It was incredibly fun moving through the years with these three, \"I-seriously-got your-back\" friends, starting with their elementary school into middle, high school, college, and beyond. Oh, and did I mention both boys are REALLY cute? Yeah, well, as they grow older, Jadyn sure notices and yep, both Phillip and Danny also begin realizing just how \"hot\" Jadyn has become, too! This'll be interesting when the hormones kick in and \"boy-howdy\", do they ever and ultimately, one will be Jadyn's first kiss, one will take her to her first prom and one will finally be her first real love. Jillian Dodd can sure tell a story, and a funny, emotional and surprisingly gut wrenching one, at that! Honestly, I usually don't cry in books...I cried in this one. The power that grips you through Dodd's wonderfully entertaining storytelling makes you sincerely feel like you've lived right along with these three BFF's. So much that you're completely unprepared for the emotion that slices right through you when anything happens; good or bad. I wasn't expecting that with this book. I normally don't expect that with most books, frankly. But, WOW, it grabs a hold and doesn't let you go until the very end when you can actually take a deep breath and whisper to yourself, \"Ahhh...finally!\"I loved this book!"}, {"userName": "Nadia ", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/9268500-nadia", "userReview": "GOD THIS BOOK IS THE MOST PATHETIC THING EVER. PEOPLE STILL LIKE IT SOMEHOW. SOME PEOPLE JUST HAVE IT EASY. HOW THE HELL DO THESE BOOKS GET PUBLISHED WHEN J.K. ROWLING WAS REJECTED 12 TIMES WITH HER MASTERPIECE HP? #I_DO_NOT_UNDERSTAND_THE_WORLD_AT_ALL!!!The book stars 3 pathetic losers, the biggest of them being the so-called tomboy (yeah right), our main protagonist JJ. At first she's in 3rd grade and her stupidity makes sense, but it can't be forgiven when she doesn't change much, even after graduation. SPOILERS AHEAD. But I'm doing a charity for the society here. Run while you still can. Everything about this book is stupid. First there's lot of contradiction showing the author wasn't sure how to present her characters. JJ is at first shown as a tomboy, but then pretty soon is, as she likes to call it, a flirt. When did that happen? Then she's kissing Danny and can't leave him for a second. Pretty soon though, Danny is dating another girl and JJ seems totally chill with that fact. Danny gets married to this girlfriend and JJ has no emotion towards it whatsoever. This marriage of Danny is another problem all together since Danny's a playboy at the beginning of the book. All of a sudden he's madly in love with this girl he met in college. They even get married right after graduation, and then BAM!...the wife's now expecting. There was no indication of Danny growing up by the way. It just happened. I guess we are just supposed to go with it.Then there's this other loser Philip who calls JJ princess (Creepy much?) but is always dating other people. Then all of a sudden wants to get JJ and proposes on their first date. Plain weird.JJ is the most annoyingly bullshit character ever made in the history of literature (\nAssuming\n this piece of junk can be considered that, ahem). Her parents get in a car accident when her mom's already dead and dad's barely hanging there. Instead of mulling over her life, she is still worrying about \"OMG me and Philip had a fight what if he doesn't talk to me anymore what would I do all alone?\" and \"Danny just kissed me was it to make Jake jealous only or did it mean something? What's happening at the party now?\"Just plain pathetic. Worst book ever. EVER I'm utterly baffled over its popularity. Are they, by any chance, reading another book?"}, {"userName": "Alexis *Reality Bites*", "userReviewDate": "Mar 25, 2012", "userURL": "http://www.goodreads.com/user/show/5587514-alexis-reality-bites", "userReview": "Spoiler Free Review!-->WHERE THE *&%# IS THAT BOY?? Internal thoughts of Jayden in That BoyI Love That Boy!!! This was an adorable contemporary romance Following Jayden Reynolds and her two best friends Phillip and Danny. I sooo loved this book and just when i tought i had the story all figured out the author hit me with a curveball that left me stunned. The two leading boys to men are both very swoon worthy and you will fall in love with them i kno i did! I enjoyed the writting style and the art illustrated for each chapter i found that so cute! I also enjoyed the many That Boy phrases that came into play like Damn That Boy,I Hate That Boy, and my fave WHERE THE *&%# IS THAT BOY? I Recommend this book to Romance lovers looking for a Goodread!!!Book Summary below from GoodreadsThat Boy is a contemporary romance about falling in love with the boys next door. You know, being friends with two cute boys does have its benefits. There's Danny. Danny is a golden boy in every way. He has dreamy blue eyes and blonde hair that always looks perfect, even when it’s windblown or been stuck under a football helmet. He’s the boy every girl crushes on. The boy I get into trouble with, the boy I fight with, the hot quarterback no girl can resist, not even me. Being with Danny is like being on an adventure. He has a bright, contagious smile and abs to die for. He’s pretty much irresistible. Equally crush worthy is Phillip. Adorable, sweet Phillip, who I have known since birth. Phillip has dark hair, a perfect smile, brown eyes, and the sexiest voice I have ever heard. He’s the boy I talk to every night before I go to sleep. The boy who rescues me, the boy who can read my mind, the boy who is always there for me, the boy who tries to keep me out of trouble, the boy who irritatingly keeps getting hotter, and whose strong arms always seem to find their way around me. And when he gives me that grin, I can never say no. One boy will give me my very first kiss. One boy will teach me to make out. One boy will take me to prom. And finally, one boy will ask me to marry him. They will both be my best friends. But only one of them will be the boy I fall in love with. Only one of them is That Boy"}, {"userName": "Splage", "userReviewDate": "Nov 11, 2011", "userURL": "http://www.goodreads.com/user/show/4755656-splage", "userReview": "[The sexual chemistry was written much stronger with one boy than the other and I was slightly disappointed with the direction the story headed, but the author was soooo RIGHT!  (hide spoiler)]"}, {"userName": "Kelli C ~ Jack Sawyer's Heart", "userReviewDate": "Jul 05, 2014", "userURL": "http://www.goodreads.com/user/show/14931216-kelli-c-jack-sawyer-s-heart", "userReview": "So sweet and fun! I never expected to read a book with a love triangle and enjoy it so damn much...but this is a unique experience in that there is no way not to fall into this story without embracing all 3 characters.Lets begin with JJ...This is your ordinary girl who has all the normal growing pains associated with growing up...she just has 2 secret weapons in the form of the bestest friends. So Phillip and Danny just happen to be insanely hot...but they are amazing, loyal and all in with anything JJ oriented.This story is full of fun times, endearing heartfelt moments, and frustrating female drama. It is mostly a series of hits and misses for JJ and her boys in terms of \"what if\" moments that could turn into a relationship. Phillip is JJ's constant support, her conscience, her go to shoulder. Danny is her spark plug, her life challenger, and her fun times guys. Both are 100% loyal and awesome. Their progression from grade school til life out of academia will have you yelling....COME ON, OPEN YOUR EYES!It is quite a ride for JJ to realize just who THAT BOY is...and from the beginning...who he always was! Perhaps that first kiss really was the road to forever!"}, {"userName": "Michelle [Helen Geek]", "userReviewDate": "Feb 12, 2012", "userURL": "http://www.goodreads.com/user/show/5557851-michelle-helen-geek", "userReview": "11/18/2015 -- Reread this recently and enjoyed it once more. I agree with everything in my previous review. I probably wouldn't go to 5 Stars, more 4.5 Stars, but I don't modify ratings for a re-read. I tried to jump right into That Wedding, and lost interest for a bit. I've been in a bit of a book funk. You'll see. Either way, this is a good read; unique, original story .. if you stick to the end, and interesting characters.Happy Reading!++++++++++++++++++++++++++++++++5 Stars.Okay, 5 Star books for me are either very creative/unique, or pull really strong emotions out in me. This book tipped the emotion scale. It may just be me, but it really hit me right between the eyes. I was just cruzing along, reading a bit of a fluff story - cute, but just, and then BAAM. Baby it starting knocking my socks.. I really can't tell you why, or I'll give it all away, but I was just floored. Really fantastic read.Anyone who knows me, knows I hate to spend buttloads of money on eBooks - $5 is about my limit. But, I didn't even blink at the $10 price for this authors next book. This one was just that good. I'm jumping right into it in a few minutes.There were a few things I didn't like, but not enough to detract from my complete enjoyment of this book. This one will stay with me for a very long time. It may not hit everyone the same way it did me, but WOW!I recommend it to anyone who enjoys a emotional ride. One minute I was crying my eyes out, then I was hootin' with tears of laughter. I could be having a nervous break-down, but really thing it is the book [hoping - fingers crossed!!]. So, if you read this and really enjoy it - after my recommendation - I accept flowers and chocolate, but not necessarily in that order.. thank you very much [imagine Elvis's voice].Lovely, lovely book.Happy Reading!"}, {"userName": "Tough Critic Book Reviews", "userReviewDate": "Feb 22, 2012", "userURL": "http://www.goodreads.com/user/show/5336035-tough-critic-book-reviews", "userReview": "Reviewed at http://toughcriticbookreviews.blogspo...This book completely melted me into one big pile of goo reminding me exactly what romance is all about. It was so real, honest, and vulnerable; I completely lost myself in the story. Jayden, Phillip, and Danny's relationship will melt your heart. You literally get to see their friendship develop before your very eyes. How many times have you read a book and everything happened too fast; the relationship, the story, the plot. That's definitely NOT the case here. Jillian Dodd gives you everything!! Allowing you to follow their lives from being kids to graduating college. By the end, you are so invested into what happens to them that you truly feel part of the story. Jayden's two best friends are both guys. Danny is fun, care-free, hilarious and HOT! Phillip is literally prince charming, so completely sweet it hurts, and of course HOT!! They are so totally protective of Jayden and there is nothing they wouldn't do for each other. I completely ate every word up!!! This story has just the right amount of drama topped with real dialogue, heartache, love and a story you'll never forget. Don't get me wrong, I love my fantasy and paranormal, but this book didn't need that. It was true life; it was perfect!!!If you aren't convinced yet, I'll let you know that I literally said WOW out loud to an empty room (at four o'clock in the morning) after reading the very last word (not to mention my alarm did go off an hour later). This is That Book you'll love and not soon forget!!Check out the BOOK-tunes for That Boy at:http://toughcriticbookreviews.blogspo..."}, {"userName": "I ♥ Bookie Nookie (bookienookiereviews.blogspot.com)", "userReviewDate": "Apr 21, 2012", "userURL": "http://www.goodreads.com/user/show/1488662-i-bookie-nookie-bookienookiereviews-blogspot-com", "userReview": "THAT BOY really gets to you - I mean the book and well, that boy :-) Which boy? Well, both of them - I can't choose which one I want her to end up with...choices, choices...***Maybe I should wait to write a review - when I am not feeling quite so giddy about it - the characters were just awesome and the story was told in such a way that you really get to know them like you are part of their lives! As many naughty books as I usually read, this was refreshingly sweet. I found myself half expecting the trio of BFFs to become lovers in a polyamorous relationship - but then I slapped myself back to reality and reminded myself that this is not one of those type of books ;-) Trust me when I say you won't even miss the lack of nookie - yes, it's that good!✳✳ Reviewed on I ♥ Bookie Nookie Reviews___________________________________________________If you like this type of book, you might enjoy one of these groups. Check us out!Menage ReadersErotic EnchantsBookie Nookie's Erotic Lending Group"}, {"userName": "Kahina .", "userReviewDate": "Jan 07, 2012", "userURL": "http://www.goodreads.com/user/show/5824447-kahina", "userReview": "GODDDD!!!!! THIS IS AMAZING!!!!! THIS IS A MASTERIECE!!!!! I'M SO SPEECHLESS!!!!!(Which means i'm not going to make my full review right now but i'll wait until i calm down a little. xP)I'm not that calmed down right now, still so emotional about the book but i'm going to write the review, though!The Cover :I'm generally not the kind of person to judge a book by its cover. So if you do, i advise you not to do it with that book cuz despite the cover, (In fact, i find this cover kind of cute, but well!) the containt is just PUUUURE AWESOMENESS!!!The Story :Owhyééé! As i said when i started reading, THAT'S WHAT I CALL AMAZIIING!!It's romantic, funny, tough, sweet!! Everything you'd love to see in a book!I felt like living with them since JJ told us the story from when they were little children.Jillian Dodd has a great writing style and a sweet humor sense! I loved her words' games!!The little drawings through the chapters where so a great idea!I liked the fact that they decreased while JJ aged. That showed she really was aging xDThe book taught me :- A girl can like football but still be girly and sexy and all.- Friendship between a boy and a girl DOES exist! And is even stronger than girl/girl friendship.. xD- That people who are too much alike couldn't fit together.- Love can be everywhere and everybody can love.The Characters :Jadyn, THAT GIRL! OMG!! You can't imagine how much i love that girl. She's not like the others, that's why. She's the girl i'd love to have as a best friend. The \"boy-yy\" girl!!! The two best parts for me where when she kicked Danny in the face and when she said YES to Phillip *_*Plus, i loved how she rolled Phillip's name.. Philllipp!! Aaaah!So i guess you have guessed. I'm not accustumed to love girls but i love this one so very much i'd drown myself in the book to meet her xDDanny, WOW WOW WOW! He's so.. hmm.. so really HOT!! In every side. I liked him since his arrival. Since he was called Devil Danny. And i wanted him so bad to be with JJ. I was so sad when he said he couldn't..But then, we he found Lori and felt in love with her, i was so happy. 'Cuz in fact, he couldn't really fit that well with JJ. I loved the part when he asked Lori to marry him in front of the sorority sisters and the candle stuff pleased me so much!!Anyway! He's an awesome character. He had an awesome end. And i'd love to hear about him in the sequel for that book.Phillip, In fact, i didn't like him at first. He was too bossy, too strict!! And i was mad at him because JJ couldn't be with Danny but then i started liking him. He was romantic and sweet to JJ!The plan he had before asking her to marry her was genius. And i'm glad they finally are together. They belong together.Hope there wouldn't be any problems between them in the sequel. (Which is kind of sure, i guess xDD)ANYWAY, LOVE IT, LOVE IT, LOVE IT!!!!5 Stars!! Best Book Ever!! Eager to see what the sequel has!! *__*"}, {"userName": "Say", "userReviewDate": "Oct 27, 2011", "userURL": "http://www.goodreads.com/user/show/3193958-say", "userReview": "WARNING!!! DON'T JUDGE THIS BOOK BY IT'S COVER!!! AND I SAY BETTER NOT JUDGE THIS BOOK BY IT'S LOUSY COVER!!! sorry i hated the cover....but hey what's inside is more important, right?ok! i know there are a LOT of books out there with beautiful covers but when you open it and start reading the story? what do you get? A LOUSY BOOK THAT YOU WISH YOU HAVEN'T BOUGHT OR WORSE A BOOK THAT YOU WOULD WANT TO THROW TO YOUR NOISY NEIGHBOR. but this book, has simple cover that one might past browsing through all of the hundred books out there. but hey, don't be fooled by the cover because this book is A.M.A.Z.I.N.G!!!reading this book was a journey for me. it was not your typical book wherein the girl falls in love with two boys, \"tries\" (hehehe) both of them out, gets confused, makes the boys fight with each other, and the end duh? asking yourself....WTH just happened? well, this book makes the reader understand \"the complicated but blissful quest of JJ finding THAT BOY.\" i won't write a long review explaining who i think should JJ pick Danny (the bad boy) or Phillip (the good boy) but i would rather tell you guys to: READ THIS BOOK NOW!!!P.S. i love the snippets of drawings in between the book....cute!!!"}, {"userName": "aria [dear darling reader]", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/5769334-aria-dear-darling-reader", "userReview": "When I think about the guy I want to marry, I think I might prefer someone who knows where they are going. I mean a prince pretty much has his whole life planned out already, doesn’t he? And this is important because I have no idea where I’m going or what I want to do with my life.--------------------------------As a kid I’ve always believed that my prince would come someday. I don’t mean like a prince with a crown and white horse who live in a palace prince but the prince who will sweep me off my feet and treat me like his princess. I mean who doesn’t want to be treated like that right? JJ was no different. The story started with Jaydn James “JJ” Reynolds her surprise engagement party that was supposed to be her first date with “that boy”. She was actually complaining about how “that boy” was so sure she was going to marry him and then it suddenly the flashback happened. We get a glimpse on JJ’s life way before she was old enough to date. Everything actually started when one of her best friend Phillip kissed her on the fourth grade and followed by the arrival of her second best friend Danny. The story was told in JJ’s perspective starting from when she was in the fourth grade up to where “that boy” asked her to marry him. I wasn’t really expecting to have this much fun reading this book. This book was recommended to me by a friend here in Goodreads, Belkis. It has been so long and finally I’m actually reading it. I am so glad I picked up this book! The story line was actually very simple but what makes it great is how it was told. It was written in a journal form. You’ll see how a fourth grade girl grew up to the girl that she was when “that boy” asked her to marry him. I mean not much have changed with JJ. She was still a little immature but I liked her which is unusual for me because I hate boy-crazy and whiny characters but I think I have to make an exception for her. JJ is one character you’ll never forget.The guys here Phillip and Danny were awesome really! I wasn’t expected to be torn up on JJ not choosing one of them because they are so amazing in their own way. Phillip was this sweet guy who was slightly bossy (according to JJ but not for me! I’d be willing to get bossed around all day by this guy!) and was someone you can depend on when a situation gets tough. He was the type of guy who would stick to you like glue when you’re his friend but will stick to you forever when you’re his girlfriend. Danny, on the other hand, was this jock who all the girls go for. He was sexy and cool but he also respected girls despite him being with so many girls this guy was loyal. \tWhen he chooses you, its you. I’m not saying Phillip isn’t one but Danny has a reputation of being with tons of girls so I felt the need to emphasize on that on his case. If you are looking for a book that would make you smile, feel giddy all over, make you sad and confused over which guy to choose I HIGHLY suggest reading this book. There are tons of things to love about this book starting with the writing style, to the drawings on each chapter, to the characters and finally the ending. It was a major “Awww” moment for me! I want a boy like “that boy”! I want one. JJ always wanted to have a prince that will sweep her off her feet and guess what? She got it! I would be reading the sequel of this book “The Wedding” soon just so that I would know what will happen to JJ and “that boy’s” love story. I hope everything works out because if not I’ll be waiting in the wings for “that boy”. :)Of course I give it 5 stars!"}, {"userName": "Nikki", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/15914783-nikki", "userReview": "4 StarsSo I totally thought this was gonna be the dreaded Triangle of DOOM!But I have to say was super impressed with how it all played out. You meet Jayden when she was a kid and then are introduced to Phillip and Devil Danny. The 3 are BFF's growing up and you learn about their adventures over time along the way. What I loved about the story the most was that its sooooo easy to cause drama in a story like this, but there was no jealousy between the 3 of them and that is what made me love this story. They really are amazing friends. Although, I loved Devil Danny and their kissing adventures. So at about the halfway mark, a bomb is dropped. Had no freaking clue it was coming, and man it was gut wrenching. I was also very impressed with how the author really got out of the dark times quickly and kept the story on a lighter path. There was definitely that element in the background but after \"the thing\", I just completely fell head over heels with Phillip. What an awesome guy, sigh.So overall, I really enjoyed this book. I loved both of \"those boys\" and probably would rank this as one of my fav young adult reads."}, {"userName": "Brenna", "userReviewDate": "Nov 03, 2012", "userURL": "http://www.goodreads.com/user/show/12928663-brenna", "userReview": "[ Even if she didn't want to be with Danny at that moment and was happy for him. I loved that she didn't get jealous of Danny getting engaged to Liz. It would have been so easy to do so. And she was genuine about it.  (hide spoiler)]"}, {"userName": "Tessamari ♥Many Waters...♥ ~ Sweet Spot Book Blog", "userReviewDate": "Nov 03, 2011", "userURL": "http://www.goodreads.com/user/show/4597644-tessamari-many-waters-sweet-spot-book-blog", "userReview": "4.75 StarsWhat the hell?!!!!That's JJ's mantra after all, \"what the hell.\" I'm so happy I picked up this book. It made me a very very happy girl. This book was a surprise hit for me. It was a unique story about a girl and her two best friends, Phillip & Daniel, and which of these boys is That Boy, the boy she eventually ends up with. The way this book was written, it was like reading JJ's diary, with illustrations and all (a very cute touch that just added to it's charm). The book started off where the book eventually ends, her at her engagement party declining a marriage proposal, we just dont know to whom she is declining. We then flashback to how everything began. It takes us to the very beginning, from birth to college, all in JJ's POV and all with Phillip and Daniel always at her side. Oh, and as a side note, may I add that I wished I had two gorgeous guy BFFs? I wish I was That Girl growing up. lol. Anyway, I digress, whoops my bad :) Anyway, what really surprised me was that it wasnt yor typical love triangle story and i was perfectly okay with it. I loved their friendship too much and I found myself worrying along with JJ that taking the next step with one of them would ruin one or both friendships. Throughout the book, she comes awfully close to that line you cross between friends and something more. I really loved this story and I'm happy to read that the author is working on a sequel. So which boy is That Boy? Just read it and find out. Definitely recommend :)"}], "description": "Fall in love with the boy next door in this sweet contemporary romance by USA Today Best Selling Author, Jillian Dodd.You know, being friends with two cute boys does have its benefits.There's Danny. Danny is a golden boy in every way. He has dreamy blue eyes and blonde hair that always looks perfect, even when it’s windblown or been stuck under a football helmet. He’s the boy every girl crushes on. The boy I get into trouble with, the boy I fight with, the hot quarterback no girl can resist. Being with Danny is like being on an adventure. He has a bright, contagious smile and abs to die for. Equally crush worthy is Phillip. Adorable, sweet Phillip, who I have known since birth. Phillip has dark hair, a perfect smile, brown eyes, and the sexiest voice I have ever heard. He’s the boy I talk to every night before I go to sleep. The boy who rescues me, the boy who can read my mind, the boy who is always there for me, the boy who tries to keep me out of trouble, the boy who irritatingly keeps getting hotter, and whose strong arms always seem to find their way around me.  And when he gives me that grin, I can never say no.One boy will give me my very first kiss.One boy will teach me to make out.One boy will take me to prom.And finally, one boy will ask me to marry him.They will both be my best friends.But only one of them will be the boy I fall in love with.Only one of them is That Boy.If you're a football fan, love small town romance, and cute boys next door, you'll love the That Boy series.", "title": "That Boy\n      \n          (That Boy #1)", "url": "http://www.goodreads.com/book/show/11382346-that-boy", "average": 3.96, "cover": "https://images.gr-assets.com/books/1305572809l/11382346.jpg", "reviews": 2131, "authors": [{"url": "https://www.goodreads.com/author/show/4833990.Jillian_Dodd", "name": "Jillian Dodd"}], "type": ["Romance", "Young Adult", "Contemporary", "New Adult"], "outlinks": ["http://www.goodreads.com/book/show/11382346-that-boy", "http://www.goodreads.com/book/show/26057374-that-boy", "http://www.goodreads.com/book/show/16168721-that-boy", "http://www.goodreads.com/book/show/16125434-that-boy", "http://www.goodreads.com/book/show/11294143-that-boy", "http://www.goodreads.com/book/show/26179842-that-wedding", "http://www.goodreads.com/book/show/34804503-stalk-me", "http://www.goodreads.com/book/show/34812471-kiss-me", "http://www.goodreads.com/book/show/34953155-date-me", "http://www.goodreads.com/book/show/35494935-love-me", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}