{"ratings": 748, "userreviews": [{"userName": "Cheri", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "“ Buddha and Moses and all the nosesFrom narrow to flatHad to stand in the lineJust to glimpse the divineWhat’cha think about that?Well, it seems like our fateTo suffer and wait for the knowledge we seekIt’s all His designNo one cuts in the lineNo one here likes a sneakYou got to fill out a form firstAnd then you wait in the lineYou got to fill out a form firstAnd then you wait in the line\t\t-- The Afterlife, Paul Simon, Songwriter: Paul Simon”Exit heartbeat.Exit breath.Exit every mood, every memory.Exit you.To where?””First, their voices – the nurse’s, the doctor’s, my parents’.”Pulled from death’s grasp, Jim Byrd hears the doctor asking for his full name and if he knew, pointing to the television on the wall, what it was for. Momentarily wondering why the doctor doesn’t know these things, a young nurse explains that he’d been discovered at the bottom of the stairs in his building by a man who then proceeded to give him CPR until the paramedics arrived. ”’If not for him,’ she said, ‘you’d probably still be dead.’””A misfire, my cardiologist called it.‘But was I really dead?’‘Clinically.’“Dying, he clarified, was a process, not a single event. It was like a wave pulling back from the shore.””You died, and then you died a little more, and then just a little bit more until you were all the way completely dead – or not, depending.”Jim Byrd died, was brought back to life, and his heart was now connected to a device that regulated and monitored his heart – HeartNet – an implanted defibrillator, which he can track with his phone, and that will send him alerts when your heart fails to beat on its own. This is the story of Jim Byrd, his life and those in his life, his parents, his wife, and a house with a history. A fire. A death. An interest in connecting with the departed, a woman named Sally Zinker, a professor at UNC, a physicist who is focused on connecting with those who are no longer among the living. There is a love story or two, the “investigation” into traveling to visit those in the ‘Afterlife,’ but that is almost just a device to connect us to the idea of life after life. The connection of the here and now to the always present, forever view of mankind and the heavens, but not in a religious sense, or even so much a “ghostly” presence. More in the eternal nature of things, but in an almost playful sense: life after life. I don’t know what I expected from this, except I was skeptically hopeful. I’d wanted to read this since I own a copy of it, a gift, and I felt somewhat obligated to read it. It was a bit of a surprise, although I can’t say that I gushingly loved this, I was surprised how much I enjoyed it overall. Jim Byrd had experienced death. Had, in a sense, been plagued by the idea that he didn’t recall experiencing any angels, harps, gates…any… anything. As he grows older, as the world changes, as technology takes larger leaps into our lives he is haunted by the thought: What if this is all there is? Why didn’t he see anything? Or, perhaps… does he just not remember what he saw? When his father dies, he keeps waiting for some sign, some way to find out more. To talk with his father once more, to know what is …there.There’s a bit of everything in this, at least that’s how it felt at times, love stories and mysteries with everyday life as well. Occasionally there’s a lovely, if fleeting, glimpse at some of these everyday moments, which I enjoyed.”His suitcase, on the bed, needs packing. It can wait. Everything can wait. The curtain, flitting in the breeze, continues its flirtation with the end of his cigarette.””I wanted to appreciate every aspect of this moment, to preserve it, to live in it forever. Annie’s light wheezing breath, the dance of the curtain across the AC vent in the floor, the clock’s red flashing colon that held the hours from collapsing into minutes.”Many thanks, once again, to the Public Library system, and the many Librarians that manage, organize and keep it running, for the loan of this book!"}, {"userName": "Blair", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "This is a peculiar book, and I liked it but I'm not quite sure what to make of it. From the start I found the narrator offputting, but whenever I thought I might as well give up, something hooked me and pulled me back in – a story about a ghost on a staircase that's titled 'The Tale of the Dog on Fire'; an organisation called 'the Church of Search' which has holograms giving inspirational talks; historical chapters that move back and forth through a character's life as though time is not linear but a picture book to be flipped through. The Afterlives is set in the not-too-distant future, hence the holograms and the app Jim Byrd uses to monitor his heart after a brief 'death' from cardiac arrest. In the aftermath of this incident, Jim reconnects with his high school girlfriend, starts attending church and develops a preoccupation with a local ghost story. A restaurant in Jim's hometown – specifically, a particular spot on its staircase – is home to a number of unexplained phenomena, which he learns about when he visits in his capacity as a loan assessor. (An anomaly in the restaurant's accounts turns out to be the owner trying to exorcise the ghost, or ghosts.)The occasional historical chapters tell the story of the building's former residents/possible phantoms, Clara and Robert Lennox, and their families. Surprisingly, these are among the best parts of the book. Pierce uses a brilliantly effective structure here, moving swiftly and non-chronologically through the characters' histories but making us aware, via the subjects' apparent awareness of their timeline-jumping, that these are perhaps more than memories (a nod to the book's title). He also teases out unexpected connections between the historical and contemporary characters in so subtle a style that I didn't see them coming – yet they made perfect sense.Unfortunately, there's this whole dull plot strand about Jim's relationship. This is a personal quibble I have with lots of fiction, but in this case it's exacerbated by the characterisation. Annie, Jim's girlfriend (later wife), is given about as much personality as a blank sheet of paper. We know Jim is attracted to/has feelings for her, she's a widow, and she has a daughter – who is for some reason named 'Fisher' – and that's about it. We are told facts about her, but rarely, if ever, do they seem to fit together and constitute a believable person. (Jim, meanwhile, isn't especially likeable, but he's fleshed out enough that I did feel emotionally invested in what happened to him by the time it... happened.)This is a novel of the fantastic – from ghostly presences to futuristic tech – yet it's grounded in the banal, creating an oddly folksy strain of science fiction. Critics' reviews of The Afterlives tend to make it sound like it has a solid plot, suggesting Jim goes on some kind of quest for hope or meaning, but when you're reading it, it feels more like a meandering meditation on mortality (alliteration unintentional, but quite fitting).I received an advance review copy of The Afterlives from the publisher through Edelweiss.TinyLetter | Twitter | Instagram | Tumblr"}, {"userName": "Ken", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/730754-ken", "userReview": "Part ghost story, part love story, part philosophical/scientific time-travel mishmash, Thomas Pierce's The Afterlives has a little something for everyone. If you like reading plot books that highlight relationships, or wonder a lot about theories of death and existence and \"daisy holes\" (as they're called here) separating present from past from future, eureka! You've found your book!For me, a fun pleasure read, which I don't often treat myself to. I like my books a bit chewier, as a rule, but sometimes your jaw gets sore and you need a smoothie (hopefully made with power greens). I think it was a bit fat at 363 pp., but I'm always in favor of scissors (except when it comes to my own writing, ha ha).And Pierce did give us some quiet, descriptive moments, such as this:\"She slept peacefully, her warm rump turned toward me, the blanket halfway up her leg, a burn mark on the sheet from the dryer. Everything felt significant, fleeting.“I wanted to appreciate every aspect of this moment, to preserve it, to live in it forever. Annie’s light wheezing breath, the dance of the curtain across the AC vent on the floor, the clock’s red flashing colon that held the hours from collapsing into the minutes. I was in agony. I was crying. Sobbing, actually, face pressed to the pillow, the heat of my face rebounding off the fabric.\"See? Pierce seems to be saying. I can do description, too. But mostly it was storyline and train stops for plots and subplots. Get on, get off. Flip pages. What happens next? Who dies? Does anyone die? And how do we communicate with the dead? And do we want to communicate with the dead?Here, it seems, the answer is yes, every time. Yes, yes, yes. Life after life after life. You're going to need your Dramamine, in other words. The cover should serve as a hint."}, {"userName": "Jessica Sullivan", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/1246157-jessica-sullivan", "userReview": "Following a near-death experience during which he technically died for several minutes, 33-year-old Jim Byrd becomes hyper-aware of his own mortality. Death seems to be everywhere. There's a ghost haunting a restaurant owned by one of his clients. He even lives in a retirement town where \"old people come to die.\"Consumed by his uncertainty about what happens in the afterlife (and convinced from his own experience that the answer is nothing) Jim and his wife Annie search for proof. They learn about an elusive physicist named Sally Zinker who believes that human beings only 93% exist in this world and has supposedly created a machine that allows the living to connect with the dead. But will they find the answers they so desperately want, or merely end up more uncertain than ever?The Afterlives is a smart, funny and imaginative work of speculative fiction written for those of us who battle the existential dread of knowing that one day we and everyone we love will die—those of us who don't have the comfort of a firm belief in any sort of afterlife.The technology and science-fiction aspects of this book are intriguing and thoughtful, and the parts about marriage and love are insightful and relatable. Pierce took on an ambitious topic and handled it with deftness and heart. If you're the type of person who likes to think about the big questions in life, I think you'll find this a satisfying read."}, {"userName": "Ron Charles", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "Thomas Pierce approaches the interplay of technology and immortality with considerable subtlety in his debut novel, \"The Afterlives.\" The story opens as 33-year-old Jim Byrd is revived from sudden cardiac arrest. He is happy to be back but dismayed that during the minutes he was technically dead he “saw nothing. No light, no tunnels, no angels.” That would seem to snuff out prospects for the great beyond. Yet Jim, a loan officer, ends up approving the mortgage for an old building that may be haunted. Pierce, one of the National Book Foundation’s recent 5 Under 35 Award winners, wanders wherever the spirit moves him, which may frustrate readers looking for drama, but I was enchanted by his thoughtful ruminations and wry comments about church and spirituality. Intercalary chapters about the haunted house’s original residents vibrate with ectoplastic energy. Pierce is particularly unsettling when he describes. . . . To read the rest of this review, go to The Washington Post:https://www.washingtonpost.com/entert..."}, {"userName": "Art", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/1280758-art", "userReview": "I work in an independent book shop and we have countless ARCs at our disposal. I'm always looking for an interesting read by an author I have never heard of. I found a little gem in this one. This is a quiet, but very engaging, story with likable and believable characters. There is also a ghost story within the story that stands on its own. After a near death experience, the main character becomes obsessed with the afterlife and what it may hold for all of us. It's a very thought provoking book. I'll keep Thomas Pierce on my radar."}, {"userName": "Tyler Goodson", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/7540065-tyler-goodson", "userReview": "Jim's new life begins when he almost dies, a life in which he finds love, hears a ghost, meets a psychic, and tries to find out what happens after we die. His journey leads him through life, death, and in between, but for Jim, the questions keep coming. What does it mean to lose? Or to move on after loss? Pierce has written a brilliantly imaginative and beautiful novel about the big, impossible questions, fear of the unknown, and the people who keep us from spiraling into the darkness."}, {"userName": "Caitlin", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/24534218-caitlin", "userReview": "Rating: All of the stars!!!!! There are no words!!Recommended for: Everyone who wonders what's next or enjoys the big questions or loves to see the gorgeous in the plain mundane everydayness of life or those who like their sci-fi light and sprinkled with a very contemporary feel.Totally fangirling right now!"}, {"userName": "Jaclyn Crupi", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/13323030-jaclyn-crupi", "userReview": "Pierce is not afraid to confront the big questions about life, death and the thereafter in THE AFTERLIVES. His exploration of mortality and technology was particularly interesting (holograms are terrifying). How do we live when we know we will die, everyone we love will die, everyone who loves us will die? How? It’s unbearable and yet we face it each and every day. This book is definitely for those of us who spend a lot of time thinking these thoughts. I loved it."}, {"userName": "Lori", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/744602-lori", "userReview": "I was pretty convinced this was a 3 book, which for me still means quite good, but the last 1/4 really upped it and I’m left feeling adrift. I want to reread the ending, and I want to discuss with someone, wah!"}, {"userName": "Amber (ItsJustAmbr)", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/27634338-amber-itsjustambr", "userReview": "I finished this the other day and I have mixed feelings about it. The premise was good. I was super interested in this book the first 3 parts of the book and then I found myself falling asleep while reading. Not highlighting or tabbing anymore. I became a bit bored in the last 2 parts. This story follows a man named Jim who dies for a bit after having a heart attack. Once surviving he was mad because he didn’t see like a light or angels while he was out. He has to have like a “pacemaker” type thing that tracks his heart beat called HeartNet and he also uses a app. Throughout the story Jim and his wife Annie tries to understand the mystery of this ghost story. A old house turned restaurant has a stairwell where weird things were happening to people. And they believed the house/restaurant was haunted. I enjoyed the writing of this book & there was a bit of humor throughout but the talk about Afterlives and angel,God and all that sort of dragged on for a bit in some parts (even though I know that’s the point of the book) the mc is questioning all that and what happens once we die. This is my first read by this author. I found this book in a thrift store for $1. I didn’t know it was a arc until I got home so that’s cool. This book comes out on January 9th so thank you to the person who donated the book to the thrift store because i was able to read this early 😂"}, {"userName": "Jovy", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/5253813-jovy", "userReview": "I really wanted to like this book. I read the synopsis and was so excited when I finally got my hands on it! However, this book ended up putting me to sleep. I couldn't get into it at all. I enjoyed the main character's thoughts but unfortunately none of it was memorable. It also doesn't help that the book is divided five parts with no chapters within each section to help you digest the story easier."}, {"userName": "Elaine", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/7948278-elaine", "userReview": "The Afterlives\n has a quirky, off-beat premise that caught my attention when I read the synopsis. Unfortunately, the premise was the most interesting thing about it.After a near death experience, thirty-three year old Jim Byrd embarks on a quest to find the meaning of life. Is there an afterlife? Do we live on after death? Does it matter?These deep, existential questions fall flat when we meet Jim Byrd, a boring, dull, bland white male who lacks wit, talent or any discernible quality that makes him interesting. He pretty much coasts through life working a meaningless job and meets an old girlfriend at a restaurant. Eventually, they marry.Interspersed with Jim's recounts of his daily routine are vignettes of a couple from over fifty years ago that experienced a traumatic event in a home that was later converted into the restaurant Jim will later visit in the future as part of his duties as a loan officer at a bank. This couple's unhappy marriage has permeated the core and structure of this building and infused it with a supernatural quality that continues to affect residents or anyone who comes in contact with this building.When I picked \nThe Afterlives\n up from the library, I noticed it was categorized as romance but that doesn't feel right.Just because Jim pontificates about his wife and marriage and their quest on searching for the existence of an afterlife does not make this a love story. In my opinion, this story is more about the subject of love; the love that comes from the connections we make with our family, our friends, our colleagues, people we respect and admire, not the romanticized and/or sexual love we feel for a partner.The problem with this book is that it meanders. I'm not sure what its trying to say. The writing is good but wasted here on various story threads that lack cohesiveness.If the author had focused on the supernatural quality of the building and what it may mean for the existence of an afterlife, the story would have been more grounded.Instead, we get side stories about this unhappy couple alongside Jim's unimaginative outlook on life despite his near death experience. As their marriage progresses, science and technology develop at a rapid pace, so much so that it is difficult to differentiate between reality and surreality. When Jim and his wife meet a female scientist who has devoted her life and career to proving the existence of an afterlife, they are both confronted with personal issues from the past; Jim and the loss of his father, his wife's loss of her first husband, and what it means to go on after we lose the ones we love and care about.This book had such a fascinating idea but it was bogged down with a weak main character and too many tangents about minor characters I did not care for nor could I understand why we were given these small histories about them in the first place. Seeking answers to the meaning of life and why we are here in this world is a fundamental part of living, of growing, of evolving and of the way we process our own mortality. But as I read on, it felt like the author was unsure of where to go with his story. Is it about ghosts?Is it about marriage? Family? Death?Or is it about none of this?People die, we die and life goes on?The lack of a strong narrative focus created confusion on how I should approach the book as I read it. I was hoping this book was about ghosts and the supernatural but it ended up as a boring recap of characters I neither liked nor identified interspersed with brief reflections about life, living and marriage.I really enjoyed Mr. Pierce's writing. Unfortunately, I can't say the same for how I felt after reading \nThe Afterlives."}, {"userName": "Sarah Tittle", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/1806730-sarah-tittle", "userReview": "3.5 stars. I like what Pierce is doing here--exploring how technology has changed the way we think about death, or at least the way we think about what happens after we die. I like the fact that the main character is an average-Joe-type person, and I like the setting (maybe only because that part of the world is familiar to me). But after a big warm up, I grew increasingly disappointed with this story. Maybe it's the hologram twist and the way it lends a vague sci-fi tone that really turned me off. Every time the \"grammers\" show up I'm sort of, ewww, just stop. But points to Pierce for making this futuristic aspect of the novel feel pretty commonplace. I have to say, I'm a little obsessed with what happens to us after we die. I don't understand why we don't know the answer to this, and I feel like we should. But the fact that this one important question is still completely unanswered, after all the technological/scientific advances we have made, is sort of the answer itself. We don't know because we either can't comprehend it, or there's just nothing, or it's so horrible no one wants to tell us. Or maybe it's wonderful and no one wants to tell us because then we'd all just kill ourselves. At any rate, my own philosophical musings aside, I appreciate an author trying to tackle this subject. But this novel just didn't land for me. At times it lagged, at other times I felt that the characters were a little too bland. And the ending felt a bit like a cop-out."}, {"userName": "Jonathan", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/1948461-jonathan", "userReview": "I wish this book had been a little less Straight White Dude in its perspective. The writing is great, especially in how genuinely it earns its emotional payoffs, but at the end of the day what I couldn't shake off was the disappointment in how obvious and boring the narrator's problems were. He's another white dude concerned with mortality but only in a philosophical sense, which speaks to his relative safety and comfort living in the world. I'm not calling for the book to be written from a marginalized perspective, to be a blistering account of sexism or racism, because I know not every book can tackle every problem in the world, but I don't think it's too much to ask for a little more consideration re: intersectionality in fiction.For me, the text lacked a propulsive energy because the issues at hand felt so mundane, though it does certainly ratchet up the intrigue in the last fourth. I wish that drive had been consistent.I was offered an eARC of this book in exchange for an honest review through Edelweiss.3/5"}, {"userName": "Katherine Moore", "userReviewDate": "Oct 20, 2017", "userURL": "http://www.goodreads.com/user/show/21365174-katherine-moore", "userReview": "This book almost defies description and I'm still basically 'speechless' upon finishing. Yes, I can say it's a fictional novel (unless author Pierce knows things we don't!), but then I can tell you all the different genres and subjects it touches: fantasy, the supernatural/ghosts, sci-fi and aliens, relationships, religion and the question of God, conspiracy theories, and the biggest question of all - what happens to us all when we die.The novel begins when Jim Byrd dies for a few minutes, but he is left with no experience of seeing an 'afterlife', ie, no 'tunnels with lights'. This leaves him with huge life questions and starts seeing the world in a whole new way, along with his new 'HeartNet' to keep his ticker beating safely. The world in which this novel is set in, is even filled with holograms, and so many questions for Jim, and consequently for the reader. I didn't read this as quickly as some books because of that, and I was often putting it down to digest and think about what I'd just read because of everything I just had to absorb. There's actually a lot of humor in the novel too, so even though there are huge topics on the table like life and death, the tone of the book remains light, even when big events happen. Originally I was put off by the fact that Jim's romance and subsequent relationship with his wife Annie, would be central to the novel, but it ended up being such an original journey that they were on, that I was absorbed by their story within the bigger story.This is such a unique and intelligent novel, one that will get your brain thinking and your heart thumping. I know I won't read another quite like this in 2018, and it's got to be read to be fully appreciated. Fabulous."}, {"userName": "Myles", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/1630205-myles", "userReview": "Jim Byrd died of heart failure. He was revived in time and being a young man suffered no lasting damage. After the installation of a new device to monitor his heart he makes a full recovery. What gnaws at him is the fact that he has no memories of his experience. He saw no light at the end of the tunnel and he realizes he needs to know what, if anything, happens after death. Following a whim he comes into contact with a haunted house and, coincidentally, an old girlfriend. Him, his father, and his girlfriend are all pulled into the mystery of this house and the larger question of life after death. Religion, technology, philosophy, love and fear intersect in The Afterlives as we follow Jim's quest for understanding. The stories of those who lived in and visited the haunted house periodically break up the story and deepen the mystery.Thomas Pierce's writing was a pleasure to read. He tackles enormous issues with respect and genuine insight. His characters often deliver their lines and thoughts with a wry sense of humor. Once I picked the book up, I could hardly put it down. I haven't read anything like it in a long time."}, {"userName": "Abby", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/6262367-abby", "userReview": "Thomas Pierce brings all the components of a good story to the table: humor, empathy, and ingenuity. I lapped up this creative and touching novel, flying through it as I was flying home over the Pacific Ocean. Jim and Annie build a life together and wander through a future that does not feel too far away from us now. I'll be thinking about them and the elements of their story for days and weeks to come. The future of American fiction, honestly, feels brighter to me, knowing that it is buoyed by writers like Thomas Pierce."}, {"userName": "Uriel Perez", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/24464060-uriel-perez", "userReview": "A tender and often comical telling of one man's quest to discover the existence and depths of the afterlife — a journey that takes Jim Byrd to New Age churches, into an investigation of a haunted staircase, and in pursuit of a physicist who may or may not have constructed a machine with the ability to bring us in contact with the deceased. Thomas Pierce's first novel is layered with heart, humor and tremendous revelations concerning our technology-ridden lives."}, {"userName": "Tracie Gutknecht", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/32210966-tracie-gutknecht", "userReview": "First off, I think the cover is stupid. There is a thing about the dog in the book, but like the book, it doesn't really convey the message of the story.Jim Byrd dies for a few minutes and remembers absolutely nothing, no white lights, no dead family members visiting, nothing but blank/blackness. He is given a heartnet which keeps his heart beating and is a replacement to a pacemaker, but with a battery life of 200 years. Thus, conceivably his heart could continue to beat even after he is dead. Quirky, right?Jim is an average guy, except for this heart anomaly. He approves bank loans. He comes across an unusual charge in a loan application that peaks his interest. He visits the restaurant in question, meets the owner, runs into a former girlfriend, hears about a weird experience and it sends him on a research hunt for the former owners.Ultimately, I feel like this book fails it's grand undertaking. To quote from Bill and Ted's Excellent Adventure--time is like a burrito. The story hops around between the past and the present and the authors point is that our lives are still taking place and each moment is being relived again and again and that if we can reduce or subvert our consciousness we should be able to relive those experiences with those people just like the first time.I'm giving the book 3 stars, because it does make you think, the story is different, I'll probably remember it years from now, but I don't know that I enjoyed it."}, {"userName": "Melissa Rochelle", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/71171-melissa-rochelle", "userReview": "This novel defies description. It's a ghost story. It's futuristic. It's a love story. It's science fiction. It’s a mix of all of that and somehow comes together into a cohesive story that I really enjoyed."}, {"userName": "Bob Nolin", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/27551285-bob-nolin", "userReview": "The year 2018 is turning out to be the year of DNF. This may be due to my trying new authors, getting outside my comfort zone. The current book was just not drawing me in, and 200 pages in, I'm out. I figured out what's been bugging me: the book reads like nonfiction. You know, the kind of nonfiction written in first person, like an episode of \"This American Life,\" except in this case the first person is boring as hell. If I'm going to listen to you talk about yourself for 300 pages, you'd better be an interesting talker. And you'd better have a good story to tell. Scenes are described, not shown. We don't get to experience the story; we're told what happened. Dialogue is rarely used. Secondary characters have jobs at Bank America and CNN. People drive Sentras. Does this add to the realism, the sense that this really happened? No. It's just stuff. Boring stuff. The grand issues the book promises to deal with -- life after death, love, etc -- are lost in a sea of daily toothbrushings and trips to the Piggly-Wiggly. Disappointing. Back to the library you go, boring book."}, {"userName": "Nick", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/69696166-nick", "userReview": "What is next for us after death? The Afterlives' Jim Byrd, struggles with this question after suffering a heart attack, and dying at the age of 33. Given a second chance by advances in technology and medicine, Byrd sets out to find answers, all while living a more meaningful life.In The Afterlives, Thomas Pierce creates a world filled with ghosts, holograms, and old folks. A world abandoning the older generations, and flirting with the future. These changes are monumental, for better or worse. With life saving heart monitors, and holograms, Pierce is not afraid to dabble in science fiction. He's also not afraid to dabble in the consequences of such technology. The heart monitor hack stories were fascinating, and could easily spin-off into another novel.In questioning death, no one ever really has all the answers. Bryd's realizations by the end of the book leave you hopeful for the future, even if we all know how it will eventually end."}, {"userName": "Alex", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/5738137-alex", "userReview": "Jim is in his 30s when he has a cardiac arrest and is dead for several minutes before being revived. He doesn't see a bright light, snapshots of his life don't cascade before him, he isn't beckoned forward by loved ones who've passed on. He is disturbed by this lack, and this leads him to an emotional journey about what death is, what life is, what consciousness and the soul might be. He meets a woman and marries her. His father dies. He reads a book by a scientist who says she is on the cusp of being able to communicate with “ghosts.”This is a beautiful novel that shares the compelling theme (of how time is not linear) with the beautiful story by Ted Chiang called “Story of your life,” which I also cannot recommend highly enough."}, {"userName": "Olivia", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/38773606-olivia", "userReview": "This was a surprisingly clever book that used the rapid development of technology to explore big subjects: the meaning of life, ghosts, the afterlife, religion. In this story, technology that already exists in our world evolves. Sometimes dangerous, always disruptive to the social order. It was amazing to me just how well Pierce engages with these questions through the story of Jim and Annie. It was quirky and well written. My one critique would be the formulaic nature of the historical portions at the end of each section, I didn't feel as though they added to the story. For me, this book was a bit like the only Black Mirror episode I've watched: San Junipero. Unsettling, challenging, but also hopeful."}, {"userName": "Cletus Van", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/4828090-cletus-van", "userReview": "This booked echoed many thoughts I've had in my life. I absolutely loved The Afterlives, I didn't want the story to end. It was poetic, insightful, funny, generous, and a little futuristic. Full of faith and doubt and complex characters. It left me reminiscing about vignettes in my life for days on end."}, {"userName": "Vikki", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/3313826-vikki", "userReview": "I actually really enjoyed this very different by Thomas Pierce. It was all about death but in fiction form. Very interesting to see how it was done. Jim and Anne Byrd were interested in a restaurant in the town of Shula. That reataurant had an interesting history, which we explore."}, {"userName": "Mike", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/3365766-mike", "userReview": "At the age of thirty-three, Jim Byrd died. But after being resuscitated with zero memories of the afterlife, he becomes haunted by his experience and sets out to solve life's greatest mystery.3.5 stars -- A bizarre and poignant novel about ghosts, time travel, and death."}, {"userName": "Lori Gibbany", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/40609711-lori-gibbany", "userReview": "This was not what I expected from this book. Couldn't stop reading this one. The storyline is great. The flawless moving in and out of people's lives was amazing. I loved the way they care for the teenager. some stories leave out where the kid goes and it's always disturbing was glad this was not overlooked. Some stories are made by small details and this is one of those."}, {"userName": "Cristine Mcguire", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/13924285-cristine-mcguire", "userReview": "great read, i have been waiting a long time to come across a book like this, that has captived me, and made me get pulled into their world and felt what the characters felt."}], "description": "Will we meet again? I believe we will, but as for proof I can only offer my story, nothing more.Jim Byrd died. Technically. For a few minutes. The diagnosis: heart attack at age thirty. Revived with no memory of any tunnels, lights or angels, Jim wonders what—if anything—awaits us on the other side.Then a ghost shows up. Maybe. Jim and his new wife, Annie, find themselves tangling with holograms, psychics, messages from the beyond and a machine that connects the living and the dead. As Jim and Annie journey through history and fumble through faith, they confront the spectre of loss that looms for anyone who dares to fall in love. Funny, fiercely original and gracefully moving, The Afterlives will haunt you. In a good way.", "title": "The Afterlives", "url": "http://www.goodreads.com/book/show/37855197-the-afterlives", "average": 3.58, "cover": "https://images.gr-assets.com/books/1515423399l/37855197.jpg", "reviews": 144, "authors": [{"url": "https://www.goodreads.com/author/show/821199.Thomas_Pierce", "name": "Thomas Pierce"}], "type": ["Fiction", "Adult Fiction", "Contemporary", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/37855197-the-afterlives", "http://www.goodreads.com/book/show/35172510-the-afterlives", "http://www.goodreads.com/book/show/35172505-the-afterlives", "http://www.goodreads.com/book/show/22309576-hall-of-small-mammals", "http://www.goodreads.com/book/show/17154657-shirley-temple-three", "http://www.goodreads.com/book/show/25207261-this-is-an-alert", "http://www.goodreads.com/book/show/33832290-chairman-spaceman", "http://www.goodreads.com/book/show/22551177-ba-baboon"]}