{"ratings": 418, "userreviews": [{"userName": "Mahdi Lotfi", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/52374183-mahdi-lotfi", "userReview": "درباره نویسنده:آگاتا مری کلاریسا، لیدی ملووان (به انگلیسی: Agatha Mary Clarissa, Lady Mallowan) (زاده ۱۵ سپتامبر ۱۸۹۰ - درگذشته ۱۲ ژانویه ۱۹۷۶) مشهور به آگاتا کریستی (به انگلیسی: Dame Agatha Christie) نویسنده انگلیسی داستان‌های جنایی و ادبیات کارآگاهی بود. او با نام مستعار ماری وستماکوت (به انگلیسی: Mary Westmacott) داستان‌های عاشقانه و رومانتیک نیز نوشته‌است، ولی شهرت اصلی او بخاطر ۶۶ رمان جنایی اوست. داستان‌های آگاتا کریستی، بخصوص آن دسته که در باره ماجراهای کارآگاه هرکول پوآرو و یا خانم مارپل هستند، نه تنها لقب «ملکه جنایت» را برای او به ارمغان آوردند بلکه وی را به‌عنوان یکی از مهم‌ترین و مبتکرترین نویسندگانی که در راه توسعه و تکامل داستان‌های جنایی کوشیده‌اند نیز معرفی و مطرح نمودند.آگاتا کریستی در کتاب رکوردهای گینس مقام اول در میان پرفروش‌ترین نویسندگان کتاب در تمام دوران‌ها و مقام دوم (بعد از ویلیام شکسپیر)در میان پرفروش‌ترین نویسندگان در هر زمینه‌ای را به خود اختصاص داده‌است. تخمین زده شده‌است که یک میلیارد از کتابهای او به زبان اصلی (انگلیسی) و یک میلیارد دیگر در ترجمه‌های گوناگون به ۱۰۳ زبان دنیا به فروش رسیده‌است. محبوبیت جهانی کریستی به آن درجه‌است که بطور مثال در کشوری چون فرانسه تعداد کتابهایی که از او تا سال ۲۰۰۳ به فروش رسیده بالغ بر۴۰ میلیون جلد بوده‌است."}, {"userName": "Susan", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "This was Agatha Christie’s first published short story and appeared in The Sketch in 1923. Events were based on the death of young actress Billie Carleton after the notorious Victory Ball (an event I read about recently in the Kindle Single, “The Rise and Fall of ‘Brilliant’ Chang: London’s Jazz Age Drug Lord”). Apparently, the notorious case led not only to this short story, but also to a play by Noel Coward and it was certainly a scandalous news story at the time; involving the death of a beautiful young actress due to drug use.Poirot, of course, had already appeared in the novels, “The Mysterious Affair at Styles,” (1920) and “Murder on the Links,” (1923), but this is his first appearance in a short story and, as such, is well worth reading for that reason alone. Indeed, the 1920’s saw Agatha Christie write many more Poirot stories than novels. This story was included in the short story collection, “Poirot’s Early Cases,” published in 1974.Our story begins in London, where Poirot and Hastings are residing. Hastings is drawn to the news story about the events at the Victory Ball, when Japps appears to ask for Poirot’s advice, while making it seem as though he is involving him out of the kindness of his heart. A party of six people attended the ball – including Lord Cronshaw, the young actress Coco Courtenay, Cronshaw’s uncle, the Hon. Eustace Beltane, a widow names Mrs Mallaby, the actor Chris Davidson and his wife. During the evening, Lord Cronshaw seemed moody, while Coco was tearful and begged to be taken home. Later, Lord Cronshaw was found stabbed in the private room where the group had taken supper, while Coco Courtenay was dead the next morning due to an overdose of cocaine.Of course, Poirot orders the facts and discovers the murderer, just as Japp hopes he will. It is really interesting to read this, very first, story featuring my very favourite fictional detective. I enjoyed the way the Kindle Single about ‘Brilliant’ Chang led me on to discover this story and would highly recommend both this short story and the Kindle Single to anyone interested in 1920’s London."}, {"userName": "F.R.", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/1309606-f-r", "userReview": "Torn from the headlines! Written from fact! Agatha Christie takes one of the great tabloid stories of immediate post First World War London – the death by drug overdose of Billie Cartleton – and somehow manages to make it both more exciting and more stultifyingly middle class. In this version there’s a drug overdose and a murder in the same evening, so you get double the death for your money, but the dénouement is one that can easily be sorted out in a drawing room rather than in the more real and dingy streets of the East End. Still, the actual reveal does find Poirot at his most pleasingly melodramatic."}, {"userName": "bella", "userReviewDate": "Aug 29, 2013", "userURL": "http://www.goodreads.com/user/show/6827846-bella", "userReview": "The Affair at the Victory Ball was first published in \"Poirot's Early Cases\" in 1923. The Victory Ball was to be a stunning ball that was to be talked about all season. Unfortunately it is talked about for all the wrong reasons when two people attending the ball end up dead - one from a cocaine overdose and the other stabbed. Hercule Poirot is called in to investigate and solve this one for Inspector Japp.I'm not really a short story kind of person. I like to really immerse myself in a mystery of at least 200 pages, but I'm getting highly attached to Agatha Christie's short stories. She doesn't waste any words and packs quite a punch with her short stories. This one with Hercule Poirot was quite interesting. The six people that attended the ball were dressed as characters from a \"Italian Comedy\" figurine set and it was from this set that the murderer was found. Unlike me, Hercule Poirot had this one solved early, but being Hercule Poirot he has to do the flair of his \"denouement\" which I've come to admire. The Affair at the Victory Ball was a fun short story and I'm looking forward to picking up another Agatha Christie short story soon."}, {"userName": "Susan Molloy", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/29670035-susan-molloy", "userReview": "This is Agatha Christie’s first published short story (based on a true 1918 crime) and features the confident and splendid Hercule Poirot, in a tale of two deaths at a fancy-dress ball.This tale moves along at a even and moderate pace, the writing is tight, and the dénouement is right to the point.One of the points I very much enjoy about Christie’s writing while employing Poirot is her use of French words and phrases, deftly sprinkled in the dialog. It adds a bit of panache and realism to Poirot’s character."}, {"userName": "Noella  Van Looy", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/54964706-noella-van-looy", "userReview": "Kort verhaal van Agatha Christie. Ik hou eigenlijk meer van de langere verhalen."}, {"userName": "Alida Arabelle", "userReviewDate": "May 04, 2017", "userURL": "http://www.goodreads.com/user/show/26065104-alida-arabelle", "userReview": "All ive to say is its awesome and sooo creepy that it gave me nightmares.."}, {"userName": "Sifat", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/67289689-sifat", "userReview": "A lady leaves a favor dress ball early and is later found to have kicked the bucket from a medications overdose. Hercule Poirot researches in this, the main story expounded on him."}, {"userName": "Raghu", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/8038316-raghu", "userReview": "Double homicide. One made to look like an accidental cocaine overdose or suicide (Miss Courtenay) while the other a stabbing. The stabbing victim, Viscount Cronshaw was declared to be strangely stiff by the doctor who was called upon immediately. Apparently only a few minutes could have lapsed since Cronshaw's death. Japp suggested perhaps he was poisoned. That cannot be right. Why poison someone when you're gonna stab him anyway Poirot pointed out dismissing Japp's theory.Poirot deduces that there must have been a curtained recess even though he has not been to the place before. Also found on Cronshaw's body is Miss Courtenay's enameled box labelled COCO but Cronshaw was against drugs. I was confused by the names of the characters from the Italian play going on at the ball otherwise I was able to follow thus far. Viscount's uncle, lord Cronshaw was to Hastings and Japp the prime suspect but Poirot already knew who the killer was. He makes a big show of it (building the suspense) by inviting everyone and showing six pictures, each picture is a costume for the play. Everyone seem to recall six but Poirot points out that there were only five as one person seemed to have manipulated his costume to look like another. All loose ends tied up really well in the end. Don't you just love mysteries. It was inspired by and based on the death of young actress Billie Carleton after the notorious Victory Ball apparently. A really magnificent tale I highly recommend."}, {"userName": "Lizabeth Tucker", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/1121235-lizabeth-tucker", "userReview": "Viscount Cronshaw is found dead at the Victory Ball with a table knife in his heart shortly after fighting with actress Coco Courtenay. Coco herself is later found dead of a cocaine overdose in her bed. Inspector Japp comes to Hercule Poirot and Captain Hastings for help untangling the mystery.A good example of a typical Poirot mystery, keeping all the facts and his observations a secret until the grand reveal before all the people involved with the murder. 4 out of 5."}, {"userName": "Fredrik Reinsborg", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/65254682-fredrik-reinsborg", "userReview": "A double murder mystery set at a masquerade victory ball (after world war 1). The victims/suspects are a group of young british aristocrats/actors dressed as characters from commedia dell'arte. Cocaine plays a central part in the plot. The mystery is presented and solved in typical Christie-style. The killers intent was not fascinating to me in this story. Although the mystery is short, and Christie is able to tell a rich story with few words!"}, {"userName": "Tabrizia Jones", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/8390878-tabrizia-jones", "userReview": "Another good Christie read! It is nice to Poirot from the beginning!"}, {"userName": "Eric Morand", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/19572677-eric-morand", "userReview": "Intéressante plongée dans le quotidien d'Hercule Poirot, certaines nouvelles néanmoins sont invraisemblables."}, {"userName": "Emily Weigel", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/6519670-emily-weigel", "userReview": "A great Hercule Poirot short story! He's a very clever detective and makes for a good read."}, {"userName": "Trois Pommes", "userReviewDate": "Aug 26, 2017", "userURL": "http://www.goodreads.com/user/show/69688489-trois-pommes", "userReview": "Des situations et des énigmes peu crédibles..."}, {"userName": "Gmjohnson", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/6048677-gmjohnson", "userReview": "Stodgy.I'm looking for a good mystery, but this style isn't it.Agatha Christie isn't my cup of tea."}, {"userName": "Alice", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/7838864-alice", "userReview": "Mlle Alice, pouvez-vous nous raconter votre rencontre avec Le Bal de la Victoire? \"Je continue ma redécouverte de l'oeuvre d'Agatha Christie et plus particulièrement des aventures d'Hercule Poirot.\"Dites-nous en un peu plus sur son histoire... \"Le Bal de la Victoire est le titre de la première histoire que vous trouverez dans ce livre qui est en fait un recueil de nouvelles des aventures du celèbre détective belge.\"Mais que s'est-il exactement passé entre vous? \"Je me suis bien faite avoir par le titre de cet ouvrage qui ne stipule nul part qu'il s'agit de nouvelles et non d'un roman. Et je suis d'autant plus énervée que, non seulement je n'aime pas les nouvelles, mais qu'en plus je n'avais pas vraiment apprécié le dernier recueil des aventures d'Hercule Poirot que j'avais lu. Et c'est donc sans surprise que le même phénomène se reproduit ici. J'ai été moins gêné par les personnages, Hastings est moins ridiculisé que d'habitude et je me suis habituée à la pédanterie de Poirot, mais je ne trouve aucun intérêt aux intrigues. Chaque nouvelle histoire consiste à nous présenter un crime, à la suite de quoi Poirot pose deux ou trois questions puis résoud le crime. Il n'y a pour moi aucun plaisir à la lecture de ce genre de procédé, sans parler du fait que les déductions de Poirot ressembleraient plutôt à de la divination. Et pour couronner le tout, enchaîner ces histoires met en lumière le fait qu'Agatha Christie utilise très souvent le même ressort, chose que j'espère oublier avant de lire son prochain roman pour ne pas me gâcher le suspense.\"Et comment cela s'est-il fini? \"Je ne peux pas dire que je n'ai pas du tout aimé pour autant. La plume de l'auteur est exceptionnelle, parsemée de répliques cultes et on s'amuse toujours beaucoup mais la prochaine fois je ferai bien attention de ne pas choisir un recueil de nouvelles, j'ai eu ma dose.\"http://booksaremywonderland.hautetfor..."}, {"userName": "Etienne Mahieux", "userReviewDate": "Apr 25, 2015", "userURL": "http://www.goodreads.com/user/show/14680725-etienne-mahieux", "userReview": "Ces \"Poirot's early cases\" ont été dotés en français d'un titre à la Modiano, celui en fait de la (traduction de la) première de cette quinzaine de nouvelles écrites dans les années 1920 et 1930 ; Poirot en est l'inévitable protagoniste ; la plupart sont narrées par l'excellent Hastings, un type normal lâché au milieu des pervers et des détectives belges maniaques. Dans le format court de la nouvelle, les intrigues délicieusement tarabiscotées d'Agatha Christie tendent à se réduire à une sorte de principe logique. Certaines sont manifestement, sinon des réécritures, du moins des réponses à Conan Doyle : quand Christie annonce \"Les Plans du sous-marin\", on tâte par réflexe son portefeuille pour vérifier que l'on n'a pas égaré ceux du Bruce-Partington... non... ouf : c'est \"La Seconde tache\" qui était en fait visée. À d'autres moments l'intertextualité fonctionne dans un autre sens et l'on prend conscience qu'on est face à la première esquisse d'un roman ultérieur. Ces derniers cas sont les moins intéressants à la première lecture puisqu'il arrive que le souvenir de l'oeuvre aboutie gâte le charme de l'esquisse. La vivacité de l'ensemble ne charme pas moins le vacancier en quête de repos."}, {"userName": "Gloria", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/9576361-gloria", "userReview": "[ Davidson,a member of the party, killed Lord Cronshaw. Lord Cronshaw was a staunch opposer of drug use. It was revealed that his girlfriend was a user, and the story indicates that they broke up. Davidson killed him, hid his body and then impersonated him until an opportune moment. This was easy to do because of the costumes used by the party.  (hide spoiler)]"}, {"userName": "Mazel", "userReviewDate": "Aug 07, 2009", "userURL": "http://www.goodreads.com/user/show/1743499-mazel", "userReview": "Ladies richissimes, jolies intrigantes et danseuses célèbres ; puissants industriels, princes étrangers et membres du gouvernement... Voilà le monde que côtoie Hercule Poire. Car il ne veut s'occuper que d'affaires extraordinaires, scandaleuses, délicates ; de crimes à la hauteur de son incomparable intelligence. Et tandis qu'à Scotland Yard les infortunés inspecteurs battent la campagne à la recherche d'empreintes de pas ou de mégots de cigarettes, Poirot s'installe dans son fauteuil où, une tasse de chocolat fumant à la main, il pense. Et comme par magie, le mystère s'éclaircit. C'est cela, le génie !"}, {"userName": "Thabata", "userReviewDate": "Dec 03, 2016", "userURL": "http://www.goodreads.com/user/show/58240440-thabata", "userReview": "“The Affair at the Victory Ball” involves a drug dealer claim to self-preservation in the killing of a couple. One, the addict, the other, a suspicious man opposed to vice. As the double death begins to be investigated by Hercule Poirot, what in the beginning seems to be an eerie coincidence of a lover’s demise in the same day, but two different places, turns out to be a crime not as instigating to the curiosity as the suggestion of mysterious coincidence. A pity! This could have been something else entirely, something much better."}, {"userName": "Jeffrey", "userReviewDate": "Dec 28, 2014", "userURL": "http://www.goodreads.com/user/show/8001805-jeffrey", "userReview": "Yet another story from the collection titled, Poirot's Early Cases, this is a clever murder mystery involving all the classic elements.A ball is thrown complete with dinner and a performance in which the guests are dressed in costumes. Naturally, someone is murdered and the little Belgian detective must solve the mystery and find the killer.This story is a lot of fun, and I recommend the entire collection."}, {"userName": "Pagli Rajkonna", "userReviewDate": "Oct 07, 2013", "userURL": "http://www.goodreads.com/user/show/15878206-pagli-rajkonna", "userReview": "It was okay.. I think I'll need to read more Hercule Poirot stories to get used to with this character. His know-it-all attitude makes me not like him as much.. I hope I'll like him better in the next ones. The story was well developed for such a short length. Gonna read more of Agatha Christie now :) Read the English version"}, {"userName": "Rosemary", "userReviewDate": "Jun 03, 2009", "userURL": "http://www.goodreads.com/user/show/2138575-rosemary", "userReview": "Hercule Poirot s'occupe d'affaires extraordinaires et délicates - des nouvelles. C'est difficile d'écrire des nouvelles - on n'a pas beaucoup de mots pour élaborer le mystère et designer les personnages. L'auteur a bien crée les mystères, et le fait qu'on connait déjà son détective l'a aidé beaucoup parce qu'elle pouvait viser les autres personnages."}, {"userName": "Brooklyn Tayla", "userReviewDate": "Apr 17, 2016", "userURL": "http://www.goodreads.com/user/show/34712899-brooklyn-tayla", "userReview": "I've read this countless times. I'll read it countless times more. I love Agatha Christie. I love Hastings, Japp and Poirot. Oh, you little egg shaped headed Belgian and those grey cells of yours. <3 :)"}, {"userName": "Amy Knighton", "userReviewDate": "Dec 30, 2016", "userURL": "http://www.goodreads.com/user/show/48751278-amy-knighton", "userReview": "I enjoy the short stories narrated by Captain Hastings. However, I've seen most of the movies based on these stories and already know the outcome. I regret that I saw the movies before reading them."}, {"userName": "Веселка Бачева", "userReviewDate": "Dec 23, 2014", "userURL": "http://www.goodreads.com/user/show/19120932", "userReview": "Кратки разкази, но брилянтна Агата Кристи."}, {"userName": "Jan", "userReviewDate": "Nov 04, 2016", "userURL": "http://www.goodreads.com/user/show/2067728-jan", "userReview": "Good short Hercule Poirot mystery"}, {"userName": "Laura", "userReviewDate": "Sep 16, 2014", "userURL": "http://www.goodreads.com/user/show/8858381-laura", "userReview": "Short and sweet"}, {"userName": "Gnani", "userReviewDate": "Aug 19, 2015", "userURL": "http://www.goodreads.com/user/show/26621760-gnani", "userReview": "Superb!"}], "description": "Previously published in the print anthology Poirot's Early Cases.A young lord is murdered at a masked ball, and his fiancée dies of a cocaine overdose. Can Poirot find out who the killer is?", "title": "The Affair at the Victory Ball: A Short Story (Hercule Poirot Mysteries)", "url": "http://www.goodreads.com/book/show/20647027-the-affair-at-the-victory-ball", "average": 3.6, "cover": "https://images.gr-assets.com/books/1390928525l/20647027.jpg", "reviews": 38, "authors": [{"url": "https://www.goodreads.com/author/show/123715.Agatha_Christie", "name": "Agatha Christie"}], "type": ["Mystery", "Short Stories", "Mystery", "Classics", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/20647027-the-affair-at-the-victory-ball", "http://www.goodreads.com/book/show/6887744", "http://www.goodreads.com/book/show/25231116-the-affair-at-the-victory-ball", "http://www.goodreads.com/book/show/17824594-the-affair-at-the-victory-ball", "http://www.goodreads.com/book/show/3008215-le-bal-de-la-victoire", "http://www.goodreads.com/book/show/6240525-le-bal-de-la-victoire", "http://www.goodreads.com/book/show/5834365-le-bal-de-la-victoire", "http://www.goodreads.com/book/show/33211831-the-affair-at-the-victory-ball", "http://www.goodreads.com/book/show/1086330.The_Affair_At_The_Victory_Ball_and_other_Stories", "http://www.goodreads.com/book/show/16299.And_Then_There_Were_None", "http://www.goodreads.com/book/show/16343.The_Mysterious_Affair_at_Styles", "http://www.goodreads.com/book/show/853510.Murder_on_the_Orient_Express", "http://www.goodreads.com/book/show/16331.Murder_at_the_Vicarage", "http://www.goodreads.com/book/show/16328.The_Murder_of_Roger_Ackroyd"]}