{"ratings": 3942, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”Self-preservation was a basic directive, but there wasn’t a robot functioning that prioritized it at the top of the list. Like biologicals all robots were seeking a purpose. Autos and drones were lucky enough to have that built into them. A bot had to find his own way and I’d figured out that functioning for function’s sake was pointless. The real question was finding a directive worth getting scrapped for.”Mack Megaton was at the bottom of the sludge heap of Empire City, a city where weird science and toxic chemicals were turning biologicals into all kinds of interesting mutants. His best friend is a talking, book reading addicted Gorilla. The guy that keeps him out of trouble is a rodent biological by the name of Detective Sanchez. Mack is driving a cab and damn lucky to have that job instead of being in pieces at the spare part boneyard. You see, he tried to take over the world. It wasn’t his fault; he was programmed for world domination. He was supposed to bring biologicals to their knees. His creator was obviously brilliant, but something went wrong. ”That defective electronic brain of yours is too prone to sentimentality, concerned with certain illogical motivations. They assumed you were the next step in their evolution, yet they can’t reconcile the apparently randomization of your behavior.”He is still a cold calculating machine, but he is developing really bad habits that are traits only biologicals have. ”Of course they’d known I was lying. That was okay. It was one of the marks of sentience, the ability to distinguish reality from fantasy and still indulge in fantasy. In other words: I lied, therefore I thought.”When in Rome, right? He is on his way to full citizenship if he can just stay out of trouble.He can’t do it.Mack decides to try and find a missing family of biologicals and soon finds himself up to his neck screws in trouble. Sam Spade with a spade for a face. Even before he pulls on the pin stripe suit of a private detective, he has Dame with a capital D problems, a four armed mutant trying to ”Burn him a new exhaust port,” and a telekinesic arsehole putting a virus into his software. He ”had him by the directives.”As if it isn’t hard enough just being a bot. I absolutely blew through this book. I was looking for something breezy with a zing, and this fit the bill perfectly. The action is non stop. The robot hardboiled dialogue was fresh and at times had me laughing out loud. I was hoping that A. Lee Martinez had written a follow up book, but as far as I can tell, this is it folks. Irresistible, great fun!If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Carol. ", "userReviewDate": "Apr 27, 2012", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "Adams-Chandler Jambalaya (aka The Automatic Detective)Gently brown one abducted family in heavy cast iron sci-fi universe seasoned with mutant-inducing radiation.Remove family, leaving well-oiled universe.In the same universe, sautée:-A seven-hundred sixteen pound (robot) cab driver trying to keep a low profile until he clears probation.-One (genius) blonde dame with a thing for robots.-One overworked (mutant) detective who resembles a white ratCook until tender, or at least everybody understands they have a case to solve.Stir in liquid from a jazz club, a seedy flophouse and a penthouse suite. Season with small-time thug, one female (cybernetic) psychologist and a handful of broken arms (all from the same thug). Return family to pot, and simmer in secret location while covered for an hour.Bring to boil and add two factions of feuding aliens.Cover and simmer without stirring (may use big guns, a bot with a Brooklynese accent and a sentient gorilla). The dish is finished when the aliens have cooked.Truly a delightful dish. The initial chapters have a great take on the noir detective book, but instead of a jaundiced, rough detective, the lead is an emotion-impaired bot who has been subjected to \"the Freewill Glitch,\" an unpredictable error imbuing robots with ability to override programming. (Don't you just love that free will is called a \"glitch?\") Martinez cleverly hamstrings the virtually indestructible robot by limiting his power through immense electrical costs, demanding careful energy management. Action starts off quickly within the first few pages, allowing development of the robot character as he mulls his interpretations and actions in a thoroughly Sam Spade way. Like the noir detective, the best intentions soon draw him into a path that shakes up his routine but empty life. I worried we were headed into silliness when the gorilla appeared, but truly, Martinez is able to keep the focus on the plot even as his tongue is firmly in cheek. He is able to create the feel of the emotionally drained noir detective in a thoroughly delightful way. Once the noir atmosphere and character development is fully underway, Martinez begins throwing curveballs and dastardly evil villains at our hero, and then it gets truly odd. The bot character ends up being a great anchor through the fantastical, as he negotiates the very real challenges of friendship, ethics and complex decision-making. A fast read, and one I will plan to re-read at some point, as I dream of electric sheep--or at least of Martinez writing a sequel."}, {"userName": "Melki", "userReviewDate": "Aug 25, 2016", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "Damn, some days I wished I'd been made a toaster.Mack Megaton is a robot. He's built for destruction, but spends his days driving a cab. When his neighbor and her family go missing, Mack steps out from behind the wheel, and turns amateur P.I. to find them.The first half of the book moves much like a standard detective novel. There's delightfully crackly dialogue, and some great descriptions of a city in decline:Crime was a dirty public secret in Empire. No one talked about it, and if you listened to the Learned Council, you'd think Empire was a shining utopia of order and decency. True, there were plenty of districts where a citizen could live in complete safety, where police were omnipresent, reliable, and completely effective, where no one ever got mugged or slapped around, or murdered. Then there was the rest of the city.. In a town where technology was supposed to be the answer to all society's ills, there were plenty of ills to go around.Just like Sam Spade, Mack investigates leads and interrogates suspects, albeit suspects who have tentacles and/or extra limbs.Not that I wanted to hurt Ringo. His bones snapped too easily to give me much satisfaction.\"Have it your way. But I don't have much time, and you've got a lot of arms.\"The second half of the book is an action lover's wet dream filled with robot-smashing exploits and Godzilla-like monsters. All of a sudden, Mack's search for one family has led to the discovery of a sinister plot that threatens all of mankind.I started the countdown. Less than one day before people started dying in the thousands.This fun and unusual read is the September selection for the Pulp Fiction Group - https://www.goodreads.com/group/show/.... There's still plenty of time for you to join us for this read."}, {"userName": "Jokoloyo", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/1902630-jokoloyo", "userReview": "[The protagonist and his friends attacked the building where the antagonists were doing their vital project. (hide spoiler)]"}, {"userName": "Algernon", "userReviewDate": "May 31, 2012", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "One of the first books I've discovered through Goodreads. I don't normally ask for recommendations (my TBR pile will last me a couple of years) , but I was in the mood for something fun, and I picked A Lee Martinez from the comedy shelf of one of my friends here. Lucky me!R. Daneel Oliwav is one of my all time favorite characters in SF, and I read each Robot books by Asimov 3 or 4 times already. Mack Megaton is not that kind of robot though. He's the ultimate killing machine, designed by a mad supervillain to be unstoppable and to enjoy smashing things up and \"squeezing throats until the eyes pop out and the tongues turn purple\" . That is, until he developed the Freewill Glitch and refused to follow orders to kill. Now he is applying for citizenship of the most progressive metropolis on Earth - Empire city - and makes a poor living as a taxi driver.The plot and the dialogue are vintage Raymond Chandler and Dashiell Hammett, transplanted to a futuristic setting of chemical and radioactive waste, mutant humans, miniature gadgets, powerful and mysterious ganglords, cynical policemen and blonde bombshells. For all his artificial intelligence detachment and cold analytical power, Mack has really mastered the staccatto delivery of short sentences and the wisecracks of a classic gumshoe detective, so his soon acquired wardrobe of pinstripe suit, fedora and mackintosh is entirely appropriate. His style of solving problems may have more to do with bulldozing through every obstacle than clever deductions, but it proves nevertheless effective. The metal man even gets a romantic interest in a socialite beauty that hides genius level technological talents and a passion for nuts and bolts. The finale was spectacular in an explosive, over the top way: think Godzilla and Mission Impossible directed by Kevin Smith.The novel was a fun ride from start to finish, but it also shows surprising and pleasant depth in the characters and in the debate of artificial intelligence and morality. The writing is more than adequate in the mixing of classic noir with science-fiction. A Lee Martinez is now added to my list of serious humorists like Christopher Moore, Terry Pratchett, Spider Robinson, Jim C. Hines, Douglas Adams etc."}, {"userName": "Tom Mathews", "userReviewDate": "Sep 10, 2016", "userURL": "http://www.goodreads.com/user/show/22063432-tom-mathews", "userReview": "This book makes my brain hurt. It’s a story published in 2008, set in the future but written in a 1940s noir style from the point of view of someone in the 1970s. If that doesn’t make your head spin, you’re not a biological as they say in this world.Our hero is Mack Megaton, a 716 lb. robot, built by an evil criminal mastermind to be an enforcer but now working as a cabbie in Empire, (aka Mutantburg. Robotville. The Big Gray Haze, or The City That Never Functions). When one of his human friends and her children get kidnapped by a four-armed mutant, Mack sets out to track them down and rescue them. What really makes this story is the author’s keen ear for dry noir humor and his tongue-in-cheek style ability to create a world where a beautiful dame like Lucia Napier, could fall for a big, and I mean big, bot like Mack. I also loved how Martinez slipped in the cynical philosophizing that is a quintessential part of all noir fiction. After all, ” A bot had to find his own way, and I’d figured out that functioning for function’s sake was pointless. The real question was finding a directive worth getting scrapped for.”4 stars###FYI: On a 5-point scale I assign stars based on my assessment of what the book needs in the way of improvements:*5 Stars – Nothing at all. If it ain’t broke, don’t fix it.*4 Stars – It could stand for a few tweaks here and there but it’s pretty good as it is.*3 Stars – A solid C grade. Some serious rewriting would be needed in order for this book to be considered great or memorable.*2 Stars – This book needs a lot of work. A good start would be to change the plot, the character development, the writing style and the ending. *1 Star - The only thing that would improve this book is a good bonfire."}, {"userName": "ᴥ Irena ᴥ", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/5252054-irena", "userReview": "4.5\n'Name's Mack Megaton. I'm a bot. Or automated citizen, as the Learned Council liked to phrase it.'\n This is a ridiculously entertaining story. You follow a huge bot Mack Megaton on his journey to find his purpose. He is one of a kind bot, though. Built as an almost invincible war machine, he is on probation for a full citizenship in Empire City ('...if your ideal tomorrow was a sprawling, impersonal city with rampant pollution, unchecked mutation, and dangerous and unreliable weird science, then I guess you would be right at home.'). Four more years to go. He even visits a therapist. Mack goes from working as a cab driver ('the biggest ethical dilemma I'd suffered was whether to take a few extra turns to jack up a fare') to something way more serious. He even finds true friends and maybe even a girlfriend. He also learns to trust. This story is funny as hell. Mack and his thoughts or comments on various topics are hilarious.Just a couple of those: \n'If I'd been paranoid, I might've assumed the dispatcher didn't like me. Especially since every shirt he owned had a patch for the Biological Rights League stitched on the pocket.'\n... \n'Messy business, biological existence. All fluids and tissues and passing DNA around in some vain hope that it'd produce something useful.'\n ... \n'There were odd paintings on the wall, full of shapes and colors but all abstract and unrecognisable. Somewhere a six-year-old finger painter was making a fortune.'\n ... \n'In the messy business of biological evolution, defective designs were inevitable. It wasn't much different than robots, except we got to learn our lesson after one or two unsatisfactory prototypes. But biologicals, they just kept churning out the useless ones.'\n Mack and compliments: \n\"I look exquisite, Mack.\" I nodded. \"Like you're going to church. Or maybe a very casual funeral.\"\n Mack and romance: \n'She stepped beside me, and we silently admired the view for seventy seconds.'\n ... \n'One-sixth of a second from confused to idiot.'\n ... \n'I stood beside her. We enjoyed the view for twenty-five seconds.'\n If it weren't for a therapist's unfortunate and distracting name (one mention was too many), this would be perfect."}, {"userName": "j", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/2863914-j", "userReview": "\"Look, I wrote a detective novel!\"No one reads those anymore. People like more modern things nowadays. Robots and suchlike.\"Robots, eh?\"With just glance at her, I knew in a second that this dame was more trouble than she was worth, even if she did have the longest legs I had ever seen, right up to here.\"Just need to edit this a bit and...\"With just one scan, I knew in a microsecond that this biological was more trouble than she was worth, even if she did have the longest legs in my memory banks, right up to here.\"...there.\"Um, why is your robot detective still talking about her legs?\"BECAUSE HE WAS PROGRAMMED THAT WAY OK.\"Ok, whatever. Calm down."}, {"userName": "Tfitoby", "userReviewDate": "Nov 25, 2013", "userURL": "http://www.goodreads.com/user/show/5454475-tfitoby", "userReview": "Being the first adventure of Mack Megaton, Private Eye; The Automatic Detective is a combination of The Maltese Falcon and Iron Man, a wicked blend of hardboiled noir, fantastic sci-fi and cynical humour.Set in the fictional Empire City, Mack is a robot with 'the Freewill Glitch' who's in the process of applying for citizenship. Empire City is home to all kinds of mutations, in addition to Mack the former killing machine gone straight his cab-driving buddy Jung is a monkey and his friend Sanchez the chief of police is furry with a tail. There are still normal biological entities, 'norms', kicking about, Mack's neighbour Julie is one of them but her daughter is psychic and now they've been abducted and Mack is ready to destroy even himself to guarantee their safe return.It's a really interesting world that A. Lee Martinez has built for his novel and a neat concept with plenty of room for development if he chooses to take the popular route to unit shifting and creates an ongoing franchise. Mack is a fun character, his internal conflict between logic and freewill is one ripe with humour and observations of the fallible nature of man, the very nature of his construction leads to some great action sequences of vivid description too. Although there's some obvious and lazy plot developments, a beautiful woman science genius just happens to take an interest in Mack, giving him free upgrades etc. but that's minor quibbling in what was otherwise a thoroughly entertaining read."}, {"userName": "Jim", "userReviewDate": "Sep 03, 2016", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "This is a classic detective novel (think Chandler & Hammet) told from the point of view of Mack Megaton, a sentient robot in a futuristic cesspool of a city (think Stan Lee on a bender). After that things get even stranger, but that's OK. It made me laugh & think in equal proportions & the action never stopped. Mack's comments on biologicals, their propensity for bulk fueling, disposal of the used product, & inefficient mating drives were great. Electricity & cold logic work for him, except when the Glitch (consciousness) gets in the way. There's even a femme fatale of sorts.If it sounds like a train wreck, it kind of was, but a really fascinating one. This won't work for everyone, but it somehow hit all the right buttons for me. I was tempted to give it 5 stars. The dialog, characters, & all were just fantastic. I can't recommend it highly enough.I saw this as the group read in the Pulp Fiction grouphttps://www.goodreads.com/topic/show/..."}, {"userName": "Michael", "userReviewDate": "Jul 15, 2011", "userURL": "http://www.goodreads.com/user/show/4015835-michael", "userReview": "This book combines the feel of hard-boiled with the joys of a Sci-Fi novel. I’ve never seen this cross genre before but The Automatic Detective pulls it off so well. The best description I’ve found about this book was by a Goodreads user; ‘Raymond Chandler and William Gibson had one drunken night, nine months later, this book would be born’. I’m not sure if there will be anymore books in the series, but I secretly hope for more."}, {"userName": "Mauoijenn ~ *Mouthy Jenn* ~", "userReviewDate": "Dec 15, 2015", "userURL": "http://www.goodreads.com/user/show/2569271-mauoijenn-mouthy-jenn", "userReview": "Weirdly entertaining. Another great story from Martinez. This one was not as fast paced like the rest of his stories, in my opinion. But, still a great piece of work."}, {"userName": "Josh", "userReviewDate": "Jun 25, 2012", "userURL": "http://www.goodreads.com/user/show/1108056-josh", "userReview": "Empire City is a futuristic metropolis ruled by a mix mutant populace which includes biological, robotic, alien, and mutated inhabitants. Technology powers progression, enhances efficiencies, and dilutes the humanist aspects to inner city living. The foundation piece for THE AUTOMATIC DETECTIVE, Empire City has an aura that compliments the protagonist as he smashes his way through villainy towards his objective. The safe return of a kidnapped biological family – the only beings he can call friends in his two year existence.Mack Megaton, a seven foot robot cab driver with free will (an anomaly of his programming) watches as his neighbours are kidnapped in front of him. A four armed mutant is responsible, having used a teleportation device to whisk the family off into the ether; he vanishes, leaving a handful of angry underworld figures and one determined ‘bot in his wake. Mack doesn’t take to this sudden disappearance. Ignoring all reasoning, he sets out to locate the missing family at any cost – even at the expense of Empire City itself.He has a few helpers along the way in the devilish beautiful and dangerously smart Lucia Napier, a 22yro genius, Doctor Mujahid, Mack’s shrink, and Jung, a fellow cabdriver and ape. It’s an odd mix that works very well. Not only do these characters have their own distinct roles to play but they also add an element of humanity to the protagonist.From government conspiracies, alien invasion, mad scientists, and robotic technology to hardboiled detective gumption – THE AUTOMATIC DETECTIVE has it all. Author A. Lee Martinez has crafted a deftly good tale encompassing the futuristic world of sci-fi, the dark and dangerous alleyways of noir and hardboiled exploits of a unique and engrossing detective.THE AUTOMATIC DETECTIVE is Mack’s first case and judging from what I’ve read about A. Lee Martinez, it looks to be the last we’ll see of him as the author isn’t big on ‘series’ books. That said I’m hoping readers get to see more of Mack at some stage. This review also appears on my blog: http://justaguythatlikes2read.blogspo..."}, {"userName": "Shivesh", "userReviewDate": "Apr 14, 2008", "userURL": "http://www.goodreads.com/user/show/605899-shivesh", "userReview": "What a well-written tale this was! Kept me turning pages.This is the story of Mack Megaton, a sentient robot who was designed for mindless killing and destruction but decides on a much more peaceful way of life after developing \"Freewill\". So the novel opens with his occupation as a cabdriver. Like any sentient being, he wants to know where he came from, who is is and what he is meant to do: in essence he is the soul in the machine, seeking a purpose, like any human does.Along the way, Mack navigates his way through Empire City, which is Martinez's amalgamation of dozens of sci-fi tropes and noir conventions: like mutants, private detectives, secret aliens, a powerful mob boss, a sexy brilliant blonde, all in a dirty, hazy, grimy city. All in all, this is such a cool setting for a sci-fi-noir where murderous robot enemies lurk around every shadowed corner and your best friend is a talking gorilla with a banana complex.Martinez has a way with words and plows through the plot, which is well planned. You have to ignore some of the convenient setups and twists you may see coming - this is the only aspect of the writing that cost this book the fifth star. The shadows of the conspiracy along with our increasing affection for a stand-up bot like Mack really pulls you through the story, waiting to see whats next. The characters are well written and above all, funny. I keep forgetting how good books have memorable characters that always have a humourous side to them even amidst whatever insanity and carnage may be going in. The descriptions of the various mutants will crack you up.The real star of this book is the city itself and the evocations of classic detective tales in the imagery. If you are a fan of old school classics like Double Indemnity, Maltese Falcon, or Chandler books, then the Automatic Detective would be great for you. It gets even better if you are also a fan of science fiction.This is a great weekend read, and hopefully Martinez will follow-up with the further adventures of this giant robot detective."}, {"userName": "Guy Gonzalez", "userReviewDate": "Jul 24, 2012", "userURL": "http://www.goodreads.com/user/show/2594660-guy-gonzalez", "userReview": "This was an unexpected disappointment; it's not a terrible read, but Martinez may have been a little too impressed with the presumed \"cleverness\" of his premise, ending up with a surprisingly derivative and bloodless mash-up of hard-boiled detective, gadget-driven sci-fi, and dystopian futures. While there are a couple of deeper philosophical themes that get touched on, it's very superficial, and the emphasis is on mildly dark humor that often misses the mark.As a result, all of the characters are pretty one-dimensional, including the lead, a robot struggling with coming to terms with his own nascent sentience. The energetic, made-for-Hollywood finale almost pulls it all together, but the maudlin epilogue only serves as a reminder that Martinez never really finds his footing with the story.On the positive side, it's a brisk, mindless read."}, {"userName": "Still", "userReviewDate": "Sep 18, 2016", "userURL": "http://www.goodreads.com/user/show/6752847-still", "userReview": "Great entertainment.Futuristic hard-boiled detective novel with a terrific cast of characters that becomes -near the end- a wonderful giant monster movie comic as drawn by Jack Kirby.Dialogue was superb ...caustic... tough-guy robot with a non-programmed sense of humor cracking wise when the occasion dictates.I had a rockin' good time with this.Highest Recommendation Possible."}, {"userName": "Paul", "userReviewDate": "Apr 30, 2015", "userURL": "http://www.goodreads.com/user/show/24437998-paul", "userReview": "Mack Megaton is a seven foot tall, 300lb robot living in Empire City, working as a cab driver, when his neighbours are kidnapped. Mack vows to rescue them. Empire City is polluted with toxic waste, peopled by mutants, robots, normals and, oh yeah, aliens. Of course it is. “Napier followed. “Come back any-time, Mack. I'll leave your name at the front desk, let them know to let you up any-time you please. Any-time.” I didn't reply. But staying away from Proton Towers was now on my short list of directives, right in front of not poking my optics out with a diamond-tipped auger. The tube doors parted, and I stepped inside. I was tempted to keep my back to Napier, but something made3 me turn. She was still smiling, though it was a softer, less frisky expression. I wondered when the damn doors would close. They were two seconds behind schedule.”and… “The door opened, and a nurse walked into the room. She was blue skinned, voluptuous, with breasts threatening to spill out of her low-cut uniform, which I doubted was regulation. Maybe it was this new detective gig that made me notice, but she had long legs that went on forever, circling the curve of space and meeting themselves back at the end of eternity. And her face: it belonged in the movies. Monster movies. The kind where something with six eyes and a lamprey mouth sucks out teenager's brains.” This is a mildly amusing take on the hard-boiled detective as robot. It could easily continue as a series but given this was published in 2008 that seems unlikely. Good. As much as I quite enjoyed this, I have no interest in reading any more of Mack Megaton's adventures. It's 3 1/2 stars from me."}, {"userName": "Kalin", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/741149-kalin", "userReview": "The following excerpt captures the spirit (and speak ;) of this novel well:It's always a little strange for me sitting with another robot that hasn't qualified for citizen status. Here I was with all the rights (well, most of them anyway) of a biological citizen, while Knuckles was basically considered a walking refrigerator. I could bust him to pieces, and it'd only be considered an act of vandalism. We were both made up of the same basic components. Except I'd passed my minimal sentience examination, and he hadn't. Maybe no one had ever bothered to get him tested. Maybe he had taken the test and flunked out on the Rorschach portion. Maybe when they showed him that blot of ink he'd answered honestly, saying it was just a blot of ink instead of lying like I had.Butterfly, my tin-plated ass.Of course, they'd known I was lying. That was okay. It was one of the marks of sentience, the ability to distinguish reality from fantasy and still indulge in fantasy. In other words: I lied, therefore I thought.For whatever reason, I always felt bad among less fortunate robots. Even an old Mark Three that, from what I could tell, would've been a real exhaust port."}, {"userName": "Jesse", "userReviewDate": "Oct 21, 2009", "userURL": "http://www.goodreads.com/user/show/2119409-jesse", "userReview": "Mack Megaton is a robot designed to bring mankind to its knees. Instead of following his intended directive, his ‘freewill glitch’ allows him to join the ranks and try to gain citizenship. His freewill gives him the personality of a typical street detective when he realizes his neighbors are missing and it is up to him to find them. Soon, Mack is deep in Empire City’s seedy, radioactive underbelly involved in something much bigger than just missing persons. Mostly science fiction, partly noir, all entertainment.Martinez possesses a sarcastic wit to his storytelling I haven’t seen since Douglas Adams. I found it very easy to get lost in the story of a gigantic robot and the underworld of Tomorrow’s City. It was very engaging and well written. The protagonist is unforgettable as are the other characters. It is a very original story. I deeply enjoyed this book and cannot wait to read something else by Martinez."}, {"userName": "Nicholas Karpuk", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/1574263-nicholas-karpuk", "userReview": "\"There was something appealing about breaking bones and asking questions, about mixing it up with lowlifes and intellectual dames.\"Indeed, Mack Megaton, indeed. Even a robot can understand why people are into crime fiction. There's a reason detective stories made up such a healthy portion of old pulp novels. While the fairly undemanding structure attracted plenty of hacks, it also brought authors who preferred to spend more of them time on snappy dialogue, good pacing, and colorful characters. While Martinez throws in a great deal of wacky elements, most of them resembling the sort of pulp elements usually seen in science fiction novels. What surprised me most is that almost everything had an organic explanation.If there's one thing that bothers me about bizarro fiction, it's that it usually involves one non-sequiter element stacked on another stacked on another. The Automatic Detective takes the opposite path. Every absurd element has an explanation and a reason for existing within the universe. For something that at first glance seems like pure high-concept whimsy ultimately ends up feeling thoroughly thought through.And it helps that the characters are likable. I could read an entire book about a gorilla taxi driver or Lucia, the brilliant inventor, in this city. Barring one particular villain, almost everyone in this story has a motive and a demeanor that generates interest. If there's a flaw here, and it's a brief on, it's the ultimate villain. He's a bit one-note, and the way they raise the stakes with him at the end too closely resembles the sort of escalation that blockbuster movies have been abusing for about a decade now. But the way the characters deal with that cliche situation actually redeemed it, leaving me rather impressed with the whole thing.It's odd, but I realized that Goodreads has been recommending A. Lee Martinez books to me for years, and I was just put off by the covers. It's easy to assume stuff like this will be the kind of lazy pastiche that comic books are often saturated with. But no, Martinez brings a genuine love for his characters and setting, and that joy is evident throughout."}, {"userName": "Mike", "userReviewDate": "Feb 27, 2008", "userURL": "http://www.goodreads.com/user/show/238286-mike", "userReview": "I really liked the ending. The rest of the book was good, but I really liked the end. And as I think about the writing of A. Lee Martinez I find that I have almost always really liked the ending. The ends of his novels are the best parts in my opinion, he does a great job of world building and a great exploration of the story and tells a good story, but undoubtedly I'd have to say that the best parts of all his books are usually the end. This has a great pulpy feel to it, the title detective is a robot that was built for some untold world ending reason by a mad scientist in a world straight out of a 1950s look at the future. There's the flying cars and the 100-foot tall sky scrapers and there's the robot butlers and ray guns and then there is also the darker side of The City Of Tomorrow. The darker underbelly where most of the city lives, where toxic run off has made mutation, if not normal and accepted, at least expected. And the story is good, it just feels sometimes that it's not quite sure if it's trying to be campy or not, that's the feel I got at least. There are moments between the main detective and his talking ape pal that are good, and the scenes with the robot secretary in the detective agency are priceless, totally brilliant comedy, but then there's the harsh reality of one character getting beat to death and another getting his mind erased which are treated in, if not a realistic manner at least a more serious one, which is good since otherwise they'd probably be really creepy scenes.So, overall I liked the book, I thought the characters were well written and well thought out and I think that of all the books by A. Lee Martinez this is the easiest to give a sequel and the one I'd look forward to the most. Wait, no I think I'd rather see a sequel to \"Gil's All Fright Diner\" because that was a really great comedic horror novel which are hard to find, but this is definetly the second book I'd like to see a sequel for. Also, great ending."}, {"userName": "Jeanne", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/6207706-jeanne", "userReview": "When a bruiser machine robot's, neighbors go missing, Mack Megaton is on the case. Mack's neighbors are friends with some very special gifts that will be useful if misused by the family nappers. Mack is forced to work on the margins of the law to rescue his friends, while trying to stay on the path to citizenship that requires strict adherence to the law plus a resumé of good deeds. Can Mack save his friends and get his citizenship too? You'll be cheering for Mack all the way."}, {"userName": "Bryan Brown", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/17539226-bryan-brown", "userReview": "This book was extremely pleasant and I enjoyed reading it. I have waited several days to do this review and I still don't have anything substantive to stay about it. The book is a fast, lighthearted read. It revels in it's own silliness and does an excellent job keeping the tongue firmly in cheek. The story is a twist on the old school noir hardboiled detective stories. But not the books, more like the lighthearted versions that were presented in radio dramas. Think Howard Duff as Sam Spade (google it up, I love Old Time Radio, maybe you would too) and you will have a pretty good idea of the character of the hero, Mack, the not-world-destroying robot. Always ready with a quip and not afraid to get mixed up in things he isn't getting paid for. He complains sometimes, but always ends up helping out the little guy and lets the results land where they may. Mack has a want-to-be partner, and a mysterious beautiful benefactor, and a grumpy but dedicated police sergeant as friends. All of the characters play true to the tropes of the genre and are distinctly voiced. Speaking of voices, the writing does have multitudes of silly jokes like the line that says \"There is an old robot saying: Does Not Compute.\" Nuggets like that were scattered through the book but not so many as to cause silliness overload. All in all I would read another story in this world. I'm not sure how Martinez could do it. Searching his writings it appears that this was a one off, and the way the world is left in the end I suppose that makes sense. He could pull off another Noir story, but he would have a lot of changes and upheavals to account for in another story. Anyways, if he pulls it off, I'll be glad to read it."}, {"userName": "Debra", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/4816194-debra", "userReview": "I have thoroughly enjoyed everything I’ve read by this author. This story was wonderfully imaginative and original. Wish it were a series. Would love to follow the great characters in further adventures."}, {"userName": "Tina", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/3971007-tina", "userReview": "[then I realized her attraction to Mack made sense if you think about it, given the things we learn about her: 1. She’s obviously a technophile. 2. She’s intellectually bored and he’s a one-of-a-kind robot that’s unpredictable and thus exciting (and he lets her tinker with his alien tech). 3. She likes physically strong guys (given she was sleeping with Ringo, who was an idiot so probably had no other attributes she’d find interesting, other than slumming it). 4. Mack looks good in a suit. And Martinez also makes Mack mention that he’s heard of other technophiles, so it wasn’t like she was the only one. Frankly, I thought their romance was cute. Also, where else would he get his weapons and suit from, given his lack of funds? (hide spoiler)]"}, {"userName": "Carly", "userReviewDate": "Feb 05, 2012", "userURL": "http://www.goodreads.com/user/show/4490040-carly", "userReview": "**edited 12/04/13Dresden Files, move over. The Automatic Detective has stolen my heart as the best scifi/fantasy-detective noir crossover out there. The characters are fun and funny and it is a well-written, enjoyable spoof that carries and twists all of the tropes of the noir genre. Our first-person narrator and PI, Mack Megatron, is an AI-driven robot, which, created to help destroy civilization by a mad genius, unexpectedly developed the \"Freewill Glitch\" and refused to kill. So now he's trying to eke out a living in the big city as a cab driver while waiting out his probation. As the first killer robot to get the Freewill Bug, the city is still waiting to see if he'll snap back to his violent programming. He isn't adjusting too well--he can't really understand how \"biologicals\" think and, despite quite a few sessions with a robot psychiatrist, he still thinks of himself as a machine rather than a person. Isolated and practically friendless, he spends a lot of time on low power, staring blankly at his refrigerator. But suddenly he's forced to snap into action. When one of the few families who is kind to him, his next-door-neighbors, are kidnapped, Mack forswears logic (that requires turning off his \"difference engine\") and sets out to find them. The remaining adventure pulls elements from standard noir--femme fatals, gangsters, and banter abound--and science fiction--almost everyone in the town has some sort of mutation due to vast amounts of pollutants--in a completely original way and from a totally new perspective epitomized by his appearance: a bright red robot wandering around in trenchcoat and fedora. ...And that's all I'm going to post here. \nThe rest of my (rather verbose and quote-filled) review is posted over here at Booklikes.\nWhy? Because I disapprove of GoodReads' new policy of censorship."}, {"userName": "Keith Phillips", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/5178360-keith-phillips", "userReview": "The Automatic Detective is exactly the kind of book I’ve been looking for. A real fun mix of Scifi and Sam Spade. Martinez has just the right amount of gritty detective banter and Scifi gadgetry to keep me hanging on every word. What a great ride through the future world that Mack Megaton lives in. A world where Bots and Autos live alongside of human beings, and by law, even apply to become citizens.Mack becomes involved in a mystery that he just won’t let go of when his neighbors are attacked by a thug, and then suddenly disappear. And, following Mack’s cybernetic psychologist’s advice to increase his level of interaction with humans, he goes on a rampage to find and save his friends.Martinez keeps you laughing with the wry humor of Mack, and how he perceives the people and other Bots around him. The characters he creates are natural, and the dialog is great. Some of the names that he’s come up with for things in his world are a bit campy, but it just adds to the whole theme. Also, some of the descriptions are a bit repetitive. Those were minor issues that I hardly even noticed, because I was on a romping fun roller coaster called Mack, and he never let up.I would highly recommend this book for anyone who loves robots, gruff tough detectives, and Scifi. I couldn’t stop reading."}, {"userName": "Douglas Debner", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/65280922-douglas-debner", "userReview": "I wonder what the author's take on his own novel is here. To me it didn't seem like Mr. Martinez was even trying to be funny, instead he told a story where his own sense of humor effortlessly came through. And what a story.What would you do if you were a relentless killing machine designed by a mad scientist to lead his army and you suddenly became self aware? Apparently you start abandoning your would be master for a job as a taxi driver in a city full of mutants, robots and damsels in distress. Naturally such a dynamic environment leads the main character, Mac Megaton, into his own unique hardboiled detective experience."}, {"userName": "Uber", "userReviewDate": "May 12, 2017", "userURL": "http://www.goodreads.com/user/show/6535589-uber", "userReview": "I like this guy, he writes predictably entertaining books. This one has a superpowered robot, a psychic 6 year old and a supergenius waif. good entertainment."}, {"userName": "Natalie", "userReviewDate": "Sep 04, 2014", "userURL": "http://www.goodreads.com/user/show/5332067-natalie", "userReview": "Fun AI take-off on the noir detective story. Metal gumshoe with a heart of gold in a 7-foot, half-ton chassis."}], "description": "Even in Empire City, a town where weird science is the hope for tomorrow, it’s hard for a robot to make his way. It’s even harder for a robot named Mack Megaton, a hulking machine designed to bring mankind to its knees. But Mack’s not interested in world domination. He’s just a bot trying to get by, trying to demonstrate that he isn’t just an automated smashing machine, and to earn his citizenship in the process. It should be as easy as crushing a tank for Mack, but some bots just can’t catch a break.When Mack’s neighbors are kidnapped, Mack sets off on a journey through the dark alleys and gleaming skyscrapers of Empire City. Along the way, he runs afoul of a talking gorilla, a brainy dame, a mutant lowlife, a little green mob boss, and the secret conspiracy at the heart of Empire’s founders---not to mention more trouble than he bargained for. What started out as one missing family becomes a battle for the future of Empire and every citizen that calls her home.", "title": "The Automatic Detective", "url": "http://www.goodreads.com/book/show/1265289.The_Automatic_Detective", "average": 3.96, "cover": "https://images.gr-assets.com/books/1312026748l/1265289.jpg", "reviews": 396, "authors": [{"url": "https://www.goodreads.com/author/show/63669.A_Lee_Martinez", "name": "A. Lee Martinez"}], "type": ["Science Fiction", "Mystery", "Humor", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/1265289.The_Automatic_Detective", "http://www.goodreads.com/book/show/1265290.The_Automatic_Detective", "http://www.goodreads.com/book/show/6572125-the-automatic-detective", "http://www.goodreads.com/book/show/7095706-the-automatic-detective", "http://www.goodreads.com/book/show/28163614-the-automatic-detective", "http://www.goodreads.com/book/show/225606.Gil_s_All_Fright_Diner", "http://www.goodreads.com/book/show/5931576-monster", "http://www.goodreads.com/book/show/6390127-divine-misfortune", "http://www.goodreads.com/book/show/109986.In_the_Company_of_Ogres", "http://www.goodreads.com/book/show/10979852-emperor-mollusk-versus-the-sinister-brain", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}