{"ratings": 118, "userreviews": [{"userName": "Georgia", "userReviewDate": "Apr 16, 2017", "userURL": "http://www.goodreads.com/user/show/13555902-georgia", "userReview": "Review can also be found in Chill and readWOW!! That is one horror, thriller, whatever you want to name it crazy great book! All you horror freaks are down for it, that’s true!This is the second story in “The Rebecca Underhill Trilogy”. The story develops eight years after Rebecca’s abduction ended over an abandoned wooden house, not very far from the house she sent her childhood. Even though, her abductor, Joseph William Whalen, is dead and gone, her life is not going into peace. She has to think of her only son and the daughter of her friend Robyn, Molly. I turns out the two children can see the boogeyman out in the cornfield, so something is up.The plot is amazingly good, as the author starts the narration of the story by telling the reader about an escape an old honest detective reads about. So the scene is set for what is to follow. Then he continues by introducing the two artists, single mother friends. He describes enough so the reader can understand their way of living, their history and their current story, without becoming tiring. This is also a very good reason that the book can be read as stand alone and can be fully understood and followed up.The writing is keeping up with the suspense and it creates the horror type of atmosphere that one would expect of such a book. The creepiness is there to remind the reader of the true nature of the villain. Don’t fall for this guy, unless you have serious psychiatric issues to deal with…It is a true horror thriller like book, no question about that. The scenes are visualized in the reader’s mind as if watching a movie. It is all about action and suspense and going through the good stuff that can clearly evolve to a good old nightmare, given a vivid imagination."}, {"userName": "Coco.V", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/42214962-coco-v", "userReview": "💝 FREE on Amazon today (1/6/2018)! 💝"}, {"userName": "Jennifer", "userReviewDate": "Dec 05, 2016", "userURL": "http://www.goodreads.com/user/show/47681565-jennifer", "userReview": "Crazy Good!!Once again, Mr Zandri's writing has floored me. This book had me on pins and needles. I will not be screaming any spoiler alerts, suffice it to say if you have read book one, The Remains, hold to your pants, this was as good or even better!!! It can be read as a stand alone, as Mr Zandri, gives enough hints of The Remains to kind of clue you in as you go. That being said, you really should read them in order. For one, it gives you a better background for this book, as the main characters are the same. And second, it ramps up the adrenaline as you read this one. If you have read any of Mr. Zandri's writing, you will not be disappointed. Once again he takes you on that psychological roller coaster ride. His descriptive way of writing, puts you right in the moment!! GREAT READ!!! Thank again Mr. Zandri."}, {"userName": "Jay Williams", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/18276597-jay-williams", "userReview": "A topflight horror story with suspense so thick you feel it. The Boogeyman is real, and he lives in the cornfield behind your barn. You have to stomach the gore associated with a villain who skins people alive and uses their faces as disguises. The story is less about the characters and more about the action. It reminded me of a \"B\" horror movie."}, {"userName": "Cheryl", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/1179650-cheryl", "userReview": "Warning: If you are not a fan of blood and gore than you have been warned. Although, I will tell you that the blood and gore is minimum. The horror is not so much in the blood or gore but in the suspense. Yet, you might want to read this book with the lights on. If you thought your fears of the Boogeyman was over; after reading this book they just might come back. This is the second book in this trilogy. I have not read the first book, yet it did not de-track from my experience reading this book. In fact, I had a good idea of what happened in the first one as this story was somewhat connected to the prior novel. Again, however I did not find it necessary to have read the first one prior to reading this book. After finishing this book, I do plan to go back and read the first one. Additionally, as this is a trilogy and that means three books, I can't wait to read the third one as well. After enduring the horrific ordeal that Rebecca did in the prior novel, it would have been easy for her to just lay down and give up. Rebecca was not the strongest female but she was still strong when it counted the most. I hope to see Rebecca come out the ultimate survivor in the third book. Mr. Zandri has just gained a new fan in me. The Ashes is just what the doctor ordered for horror fans!"}, {"userName": "Tere Fredericks", "userReviewDate": "May 09, 2017", "userURL": "http://www.goodreads.com/user/show/20909438-tere-fredericks", "userReview": "Although this is the second part of a trilogy, it CAN be read as a standalone. However, you do get more out of it if you read The Remains first. Eight years after the events in The Remains, Rebecca and her best friend Robyn, and their children, Michael Jr. and Molly, are living together in the house where Rebecca and her twin sister Molly (for whom Robyn’s daughter is named). They have made the barn into an art studio and are generally enjoying life. As they have extra land to one side of them, they rent the land out for a neighbor to grow corn.Their nearest neighbor, Sam Goodman, has bought the house next door, where Rebecca’s good friends lived until their deaths. Sam also rents out part of his property for the same neighbor to grow corn. Rebecca is concerned that Michael has been talking about two different voices he’s been hearing. One – from the barn – is his father, he says. The other, even more disturbing, is from the cornfield, and he says that voice is from Mr. Skinner. Michael is only eight, but he has the ability to draw that Rebecca’s friend Franny did. He draws a very good likeness of his father, which Rebecca puts down to having seen pictures of him all over the house. However, the person he calls Mr. Skinner makes her skin crawl. Little does anyone know that Mr. Skinner had been a former cell mate of Whalen, who had kidnapped Rebecca twice.As the book progresses, learning about the man, Skinner, who adored Whalen before Whalen was released and Skinner escaped (after Whalen’s death) and why the police may not be broadcasting the fact of his escape scared me to death. What if this is going on right now, anywhere? Whalen had a preference for basements. So, it seems, does Skinner. Only Skinner makes basements more terrifying. I’m glad our washer and dryer are upstairs and I have no reason at all to go into ours. The last few chapters, as in The Remains, will have you holding your breath, reluctant to release air for fear you will be gasping in more in a paragraph or two. Literally until the last chapter, when everything you are scared for for Rebecca to admit takes her where she needs to go comes true, you cannot help but be terrified for what comes next. This is another edge of your seat, what the holy baloney can he have happen next, type of book. The characters (with the obvious exceptions of the boogeymen) are very likeable. You want to urge them on to the best life ever. Until we learn of Skinner. Then we are terrified for them. You know those movies where you scream at the character: don’t go into the basement. Well, here you go. There’s a reason for that! Loved this book and the one before it, and highly recommend it. Where’s Rebecca #3?"}, {"userName": "Lori", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/4817090-lori", "userReview": "3.5 starsAn entertaining and enjoyable story. I would definitely listen to the series the order. I was a little lost in the beginning, but the story gives you enough details from the first book to fill in the blanks fairly quickly. The story pulls you in from the start and keeps your attention until the end.The story is full of suspense and creepiness that builds continuously keeping you on edge never knowing what to expect. The really intense action, violence and gore happen farther into the story, more towards the last quarter of the book. Rebecca is a survivor. She has been through more than most could handle. She's a strong, independent woman but then there were also several things/decisions that made Rebecca come across as not the sharpest crayon in the box and one of those characters that’s TSTL at times. So one minute your rooting for her and the next your thinking. Seriously? Really? Why would you do that? Skinner is one of those Villains/Psycho's that will stick with you and have you thinking about long after the story is over.It will definitely make you think twice before running into a cornfield. You never know what could be in there. It's a great hiding place. This is not the first time I have listened to a book Evie Cameron has narrated. She does a good job with the narration. Her voice fit the main character and sounded age appropriate. There isn't a lot of difference between her character voices in this book. Still her voice is easy to listen to for long periods of time and the narration is clearly spoken with a nice even pace. A bit more difference in the character voices, especially Skinner's and the more intense moments of the story would have been nice though. I was voluntarily provided this free review copy audiobook by the author, narrator or publisher."}, {"userName": "Teresa", "userReviewDate": "May 09, 2017", "userURL": "http://www.goodreads.com/user/show/36388413-teresa", "userReview": "The Ashes (The Rebecca Underhill Trilogy Book 2) by Vincent Zandri This is the 2nd book in the Rebecca Underhill trilogy. I did not read the 1st book but will be soon. Even though I had not read the 1st book I had no real problems following this this book as it can be read as a stand alone. Mr Zandri does give you enough of a back story to let you easily follow along. I think if you had read the 1st book the amount of backstory would just give you enough of a refresher but not to much to bore you. I love horror so this book was right up my alley. There were some blood and gore but not very much so it would be great for someone not into that as well. This is more of a creepy physiological book. It is a real page turner. It kept me on the edge of my seat and in a few places had me looking over my own shoulder. You don't want to read this book in the dark and some may not want to read it while alone either. This book takes place 8 years after Rebecca's harrowing ordeal in a wooded cabin. Rebecca narrowly escaped a deranged killer then, but now has bigger problems as \"The Skinner\" is after her. Rebecca's original boogeyman Joseph William Whalen who is dead, had a cell mate while in prison. Lawrence Frederick Hanover AKA The Skinner. The skinner has escaped prison and is now after Rebecca, but instead of going straight for her he has decided to get her where it really hurts, Her Kids. Rebecca may be weak in some aspects but when it comes to the dark she is strong. She must save her kids as well as herself."}, {"userName": "Teresa", "userReviewDate": "May 09, 2017", "userURL": "http://www.goodreads.com/user/show/36388413-teresa", "userReview": "This is the 2nd book in the Rebecca Underhill trilogy. I did not read the 1st book but will be soon. Even though I had not read the 1st book I had no real problems following this this book as it can be read as a stand alone. Mr Zandri does give you enough of a back story to let you easily follow along. I think if you had read the 1st book the amount of backstory would just give you enough of a refresher but not to much to bore you. I love horror so this book was right up my alley. There were some blood and gore but not very much so it would be great for someone not into that as well. This is more of a creepy physiological book. It is a real page turner. It kept me on the edge of my seat and in a few places had me looking over my own shoulder. You don't want to read this book in the dark and some may not want to read it while alone either. This book takes place 8 years after Rebecca's harrowing ordeal in a wooded cabin. Rebecca narrowly escaped a deranged killer then, but now has bigger problems as \"The Skinner\" is after her. Rebecca's original boogeyman Joseph William Whalen who is dead, had a cell mate while in prison. Lawrence Frederick Hanover AKA The Skinner. The skinner has escaped prison and is now after Rebecca, but instead of going straight for her he has decided to get her where it really hurts, Her Kids. Rebecca may be weak in some aspects but when it comes to the dark she is strong. She must save her kids as well as herself."}, {"userName": "Sweetpea", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/36103396-sweetpea", "userReview": "The Ashes is Book 2 in The Rebecca Underhill Trilogy. There was enough background given on the events of Book 1 that I was able to dive in with no problem. Rebecca has survived two kidnappings and is now being stalked by Skinner, a Hannibal Lector-like character.This was a great thriller, full of suspense and just so utterly creepy. There was also some gore, so it may not be for the squeamish. I thought that the narrator did a good job with the pacing and character voices. Some of Rebecca's actions didn't quite make sense though. When the children go missing, Rebecca and Robin have a cigarette before looking for them? Why aren't the police immediately brought in when her son tells her that the man he's seen is the same escaped killer on her computer screen? What's with her dead sister and ex-husband's voices in her head? And why does she still live in that house with all those horrible memories? Even with those niggling questions, I still loved The Ashes and would recommend it.I was voluntarily provided this review copy audiobook at no charge by the author, publisher and/or narrator. This review is my honest opinion."}, {"userName": "Gayle Pace", "userReviewDate": "Mar 16, 2017", "userURL": "http://www.goodreads.com/user/show/13488728-gayle-pace", "userReview": "MY THOUGHTSWOW! This put me on the edge of my chair and the hairs on my arm were tingling. I missed Book One, The Remains, but after reading this one, it's next on my list. You can definitely read as stand alones but I only wish I'd read the first book before this one. This was a thrill ride for sure.  We get a little of the background from the first book to give us an idea of what's going on. You won't want to be alone when you read this and be sure to keep the light on. Above all, lock the doors and close the curtains. You'll find yourself jerking at every little noise and rattle. I'm a real fan of horror stories and this is right up there. It will make your heart beat fast for sure. Your imagination will go on over drive and you'll remember this one for a long time to come. The author gives you all of it. Suspense, the creepiness, murder, and so much more. You might even have a nightmare from an over active imagination.So many twists and turns with each page you flip. Eight years passed after Rebecca Underhill,a single mom, was taken and left to die. A house, broken down, in the middle of a deep, dark forest. Eight years after and it has started again, someone is after her. Her original abductor has since died. Who is stalking her? Someone wants to finish the job the first kidnapper didn't. Why and Who? How will he get to her? Rebecca is facing the worst of all. You have to read this and find out how and who the stalker is and how he plans to get to her. Perhaps the first kidnapper really wasn't killed! OR? Are her children in danger? The suspense will keep you turning those pages even though you may want to set the book down. A must read for horror, suspense, murder and thriller lovers. All I can say is WOW!I received a copy of this book from the author and PUYB and voluntarily decided to review it."}, {"userName": "Quinesia Johnson", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/28933467-quinesia-johnson", "userReview": "Really great book. The only problem is when you have this much perfection going on, imperfections stick out like a sore thumb. The book is everything the summary pumps it up to be, except for the major prominent flaw that ruins things. Skinner, the killer, flays his victims' faces off and uses them as functioning masks, among his other deplorable attributes and deeds. Impossible stretch! This could have easily been resolved by Zandri expressing how Skinner thought he was fooling others, but wasn't. Or by expressing Skinner going through painful processes to make the skins real- to- life.Nevertheless, it's true- to- the- core horror/ thriller stuff, if you're into this genre. The reading is really easy too. Also, apart from the \"prominent flaw\" everything is in place. I enjoyed myself."}, {"userName": "Elisha", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/3851696-elisha", "userReview": "I love suspense and the synopsis for this book had me especially intrigued. although I don't care for blood and gore - at all. Thankfully it was at a minimal so that made that aspect of the book tolerable. That said... this author does not disappoint in the suspense department at all! I truly had a hard time putting this book down! And, this is the second in this series. I haven't read the first one, but even not reading the first one (yet!), this can be read as a stand alone book. Although I do like that the author gives you just enough information from the first book to give you a better, clearer understanding for this book ( although I always recommend reading a series in order). For anyone who enjoys horrors, this is a book (series) for you. If you're not a fan of horrors, I understand; neither am I but, maybe you could/should try this...For my full review, go to:http://bookjunkiemom.blogspot.com/201..."}, {"userName": "Rhonda Holle", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/7368106-rhonda-holle", "userReview": "What a thriller! It scared the heck out of me. I wasn't sure I could finish this scary psychological thriller but I'm a looky-loo, I had to know what happened next. THE ASHES reminded me a book I read some time ago not in theme but by the scariness. Max China, The Life and Times of William Boule. Vincent Zandri you are right up there with the best like Stephen King. Great work! The suspense is paced just right to keep you on your toes and the lights on. I didn't want to read it too close to bedtime so I wouldn't have nightmare. This also reminds me of some of the creepy Criminal Minds episodes. I'm still getting chills down my spine."}, {"userName": "Donna Ryan", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/49428664-donna-ryan", "userReview": "CreepyThis book was creepier than the first book \"the remains\". Will be reading other books by Vincent Zandri. If you like spine tingling, creepy reads, this is the book for you. Loved it!"}, {"userName": "bonnie kirchner", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/42778629-bonnie-kirchner", "userReview": "The AshesI gave this book only three stars because this book was practically the same as the first book in this series. The only thing different was the bad guy. Except for that the two books tell the same story. Boring"}, {"userName": "Meredith Jesser", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/63502313-meredith-jesser", "userReview": "RivetingWanted to stop reading book in some parts. But skimmed through. And drawn back to the excitement. As always in Zandri books an unexpected twist and gripping read to the end. I'm definitely hooked on Zandri's writing."}, {"userName": "Jessie Mckissick", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/27287635-jessie-mckissick", "userReview": "Wow! Wow! WOW!THE ASHES, is by far the best psychological thriller that I have ever read. I gave book one, THE REMAINS\" a big 5, but this book gets a whopping 10! Vincent Zandri is a phenomenal author. This book scared me silly, and the end \"stopped\" my heart. Wow!"}, {"userName": "Jackie", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/45282317-jackie", "userReview": "Unbelievable that the second book can be better than the first. Such an outstanding fantasy. Anything by this author works for me. Received an ARC."}, {"userName": "Shirley", "userReviewDate": "Jun 20, 2017", "userURL": "http://www.goodreads.com/user/show/8870686-shirley", "userReview": "Very well written. I didn't want to put down. Great characters and storyline. Looking forward to purchasing and reading books 1 and 2."}, {"userName": "Galem", "userReviewDate": "May 12, 2017", "userURL": "http://www.goodreads.com/user/show/9540710-galem", "userReview": "Too scaryOnly 4 stars because this is too scary. Had to put it down a couple of times. I quit reading Stephen King because he was too scary. Not sure I will read #3."}, {"userName": "Laura Craven", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/79456558-laura-craven", "userReview": "Very well written Held my interest to the end . I look forward to reading more of your work Vincent Zandri. Thank you."}, {"userName": "carol Blacklidge", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/44365700-carol-blacklidge", "userReview": "CreepyI had to set this down to gain my composure...It freaked me out.. I didn't like the feeling it gave me..Although I had to finish it..."}, {"userName": "Stacey Schneller", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/47986820-stacey-schneller", "userReview": "Wow what a story. This is my first read by this author and boy this book was really good. I actually got scared while reading this book and got goosebumps. I normally never get scared like this when reading a horror story. A job well done. The author gives you just about everything in this story, horror, creepy, suspense, gory. A well written story for sure and characters well done. Going back to read the first book for sure. Recommend to readers that love a good thriller. FTC: I was given a ARC of this book from pump up your books to give a honest review all reviews are 100% my own."}, {"userName": "Margaret Tidwell", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/7037554-margaret-tidwell", "userReview": "FTC: I received a free copy of this book from Pump Up Your Book in exchange for my honest review. I received no other compensation and the opinions expressed in this review are one hundred percent true and my own.The Ashes by Vincent Zandri was different from anything that I have read lately. I read this book from cover to cover in two days because I didn’t want to put it down. Once I started reading it, I just kept on reading it because I wanted to know what was going to happen. I spent a good part of this book trying to figure out if “Skinner” was a real person or if he was some creature. I am not going to say what I found out because I don’t want to ruin the book for anyone. I enjoyed this book the entire time, and it is one that I know I will read again in the future. This is also the second book in the series, and I am for sure going to go back and read the first book because I am hooked. If you love horror books, I would for sure recommend this book to you because I am not usually into horror books and this one made me want to check out more books in this genre."}, {"userName": "Kelly (Simply Kelina) C.", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/7334179-kelly-simply-kelina-c", "userReview": "I was sent this book as part of a blog tour.This was my first Vincent Zandri read, and I was pleasantly surprised. Not only am I not usually a fan of horror,but I have only read a handful ever. I was hesitant to give this a try, and was not sure if I would get through it, but I am glad I gave it a chance.I will recommend reading book 1 in this series first. The Ashes is actually the second book in the Underhill series. I think you can still read this as a standalone like I did, but I personally wanted to know more about the back story with these characters. I knew within the first few pages I wanted to read book 1 to see what happened. I think the author did a good job filling in enough blanks though, that if you did not read book 1, you can still enjoy this.This kept me on the edge of my seat, and it was really creepy. I did not like reading this at night but that also has to due to with the fact I normally do not read scary books. I am just a chicken and get scared easily. If you do not like scary books, this may not be for you.After finishing this, I will be picking up book 1 even though I know somethings that happened due to book 2. I really enjoyed this author and look forward to reading more of his work."}, {"userName": "deanna josephitis", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/45195337-deanna-josephitis", "userReview": "I thought this book was really creepy. I had to put it down a couple times and wait a few days to pick it back up. It actually gave me a nightmare. I have read a lot of books in my life and this though maybe not as detailed (thankfully), is just as creepy as any Stephen King book. I am grateful that he did not kill the children off. It describes just enough to let your imagination take over. This is where the nightmare came from, my own crazy imagination. It was a very good book and anyone who enjoys suspense, murder, serial killers, and the likes should give this book a read. I am not going to give any details other than the kids live. Enjoy..."}, {"userName": "Mimi Davis Hopkins", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/38104394-mimi-davis-hopkins", "userReview": "Know your neighbor and protect your babiesThis is a well written story. The characters and the storyline are very well defined, this story took a lot of imagination, and the author did a great job. Imagine someone having a secret entrance into your home, and it's the children who knows that someone is in your home. That's scary."}], "description": "\"Don't go down into the cellar, Mommy...\" From Thriller Award winner and New York Times and USA Today bestselling author comes the long awaited sequel to the No. 1 Overall Amazon Bestselling suspense thriller, THE REMAINS. HORROR IN THE DARK WOODS It's been eight years since artist and single mom, Rebecca Underhill, was abducted and left to die in an old broken down house located in the middle of the dark woods. But even if her abductor, Joseph William Whalen, has since been killed, another, more insidious evil is once more out to get her in the form of the Skinner. The son of an abusive butcher, Skinner intends on finishing the job Whalen started but failed at. How is he going to get to Rebecca? He's going to do it through her children, by luring them into the cornfield behind the old farmhouse they live in. HORROR IN THE DEPTHS Now, armed with the knowledge that the Skinner has escaped incarceration at a downstate facility for the criminally insane, Rebecca must face the most horrifying challenge of her adult life: Rescuing the children not from a house in the woods, but from the abandoned tunnels that run underneath her property. But the Skinner is watching Rebecca's every move. Horrifying question is, will she live long enough to save the children?", "title": "The Ashes (Rebecca Underhill Trilogy #2)", "url": "http://www.goodreads.com/book/show/33586949-the-ashes", "average": 4.13, "cover": "https://images.gr-assets.com/books/1483007867l/33586949.jpg", "reviews": 35, "authors": [{"url": "https://www.goodreads.com/author/show/278833.Vincent_Zandri", "name": "Vincent Zandri"}], "type": ["Horror", "Thriller", "Suspense", "Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/33586949-the-ashes", "http://www.goodreads.com/book/show/32614114-the-ashes", "http://www.goodreads.com/book/show/23588454-everything-burns", "http://www.goodreads.com/book/show/8300976-the-remains", "http://www.goodreads.com/book/show/18459025-the-shroud-key", "http://www.goodreads.com/book/show/9504504-the-innocent", "http://www.goodreads.com/book/show/15954433-murder-by-moonlight"]}