{"ratings": 1238, "userreviews": [{"userName": "Michael", "userReviewDate": "Jul 07, 2016", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "A well-oiled caper of high stakes espionage by the big boys in the tradition of Tom Clancy. As revealed in early pages and on the book jacket, agents from China are shown sneaking a nuke into the Norfolk estuary of Virginia, site of a major naval station and shipyard where a gathering of the fleet is being planned. China’s ambition and needs to exploit the resources of the South China Sea’s fish and oil and islands for bases call for degrading U.S. naval capacity to intervene with their imperialist designs. The same kind of lure as Pearl Harbor had for the Japanese leads China to cripple the American navy through an improved plan founded on anonymity.Our heroes here must detect and avert the plan. Hero number one is played by old CIA veteran, Jake Grafton, who has recently been asked to take the helm after the drowning death of its director . His key partner in saving the day is an operative he has long used for special wetwork missions, Tommy Carmellini, who we frequently join in interludes rendered in first person. Soon other suspicious deaths muddy the waters and creates chaos and fear, making it impossible for them to trust anyone else in the alphabet soup of security agencies. Luckily, the cyberespionage specialty work they need off-the-books can be accomplished by a female wizard he knows at the NSA who owes him favors big time. Tensions rise as the Chinese plan evolves ever closer to completion and clues of its scope only begin to emerge. The personal lives of the enemy and our heroes bring interludes of humanity to insanity playing out in realistic technicolor. An exciting and satisfying ending is pulled off. Nice ride with this one. A movie of the tale would be fun."}, {"userName": "Pat Byrnes", "userReviewDate": "Dec 07, 2015", "userURL": "http://www.goodreads.com/user/show/3590612-pat-byrnes", "userReview": "Coonts hit this one out of the Ballpark!!! What a Thrilling game of Cat & Mouse!!! The Art of War is the first novel I’ve read by Stephen Coonts and I wish I would have picked up one of his novels earlier in my reading adventures. I’ve seen Coonts’ name, but never picked up the name from friends that read. I do have the luxury of now going back and reading from the start.The novel was quick and very entertaining; I didn’t want to put the novel down. The characters of Friend & Foe were masterfully woven together to create a HIT (High Impact Thriller). What good novel doesn’t have a little humor placed just at the right moment? With the intense Cat & Mouse action between the U.S.A and China, the humor just added to my enjoyment in reading this novel.Mr. Coonts… Awesome Job!!!"}, {"userName": "Tim", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/17042835-tim", "userReview": "Much of this story is unfulfilled. It's not such a good idea to kill off decent characters and replace them, if at all, with clueless ones. 4 of 10 stars"}, {"userName": "Travis Jackson", "userReviewDate": "Jan 10, 2016", "userURL": "http://www.goodreads.com/user/show/7583986-travis-jackson", "userReview": "Admitting a potential bias from the start, I have been reading Steven Coonts' work for twenty years. With that said, the high expectations are set and met once again with The Art Of War. Jake Grafton and Tommy Carmellini (and even Toad Tarkington) are back once again to save the day. Intelligence chiefs are being killed, but the enemy's \"main attack\" is just a diversion. The Chinese are looking to nuke a Navy base. There are plenty of twists and turns throughout the book, just as you would expect from a Coonts novel. Well worth the read, especially if you have been a loyal follower of Grafton and Carmellini."}, {"userName": "Joan Mitchell", "userReviewDate": "Nov 15, 2015", "userURL": "http://www.goodreads.com/user/show/26681567-joan-mitchell", "userReview": "WOW!! This was great from the first page before you even knew what exactly was going on. Painted some pictures of our government that could be good or could be bad - depends on circumstances. The story was suspense u til the last page. I couldn't put it down. Was glad it ended because it was so realistic I didn't want to be so emotionally involved, but couldn't help it. I would recommend this book to anyone. I received this book from Goodreads for free."}, {"userName": "Carl Alves", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/1435359-carl-alves", "userReview": "In The Art of War, China is trying to make a major power play to upset the balance of power in the world. Their devious and dastardly plan is to take out half of the United States’s aircraft carriers and kill a couple million people in the process by planting a nuclear missile at the Newport naval base. Adding to their dastardliness is their plot to take out high ranking US officials as a diversion. On the case is Jake Grafton, a hard-nosed SOB who becomes the acting CIA director, and Tommy Carmellini, a snarky, sarcastic thief and spy.This is a fast paced novel that is aided by the classic plot device of the ticking clock. It’s a fight against time to first figure out what the Chinese are plotting and then to find the nuclear missile. The character development is proficient. There are many well-developed characters in the story besides Grafton and Carmellini. Even the president, who is entirely off screen, is very reminiscent of a former president. I liked the way the author played off of current events. One of the main flaws of these types of novels is a lack of realism, but I thought the novel stood up rather well in that regard. Without trying to spoil anything, the only downer involved Carmellini’s female relationships, which I thought harmed his otherwise well-developed character. I also liked the little quotes at the beginning of the chapters from famous people about war, politics, and combat. This was a strong novel that I would recommend reading.Carl Alves – author of Reconquest: Mother Earth"}, {"userName": "Steven Raszewski", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/26940967-steven-raszewski", "userReview": "Ok, so I listened to it on PlayAway from the library. Still a good story which I would have read, just wanted to listen to a book on tape to see if I like them. I still prefer reading with a old fashioned book in my hands. But in case I go blind I got my backup plan ready :-)"}, {"userName": "John Purvis", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/31181778-john-purvis", "userReview": "“The Art of War: A Novel” eBook was published in 2016 (February) and was written by Stephen Coonts (http://www.coonts.com). Mr. Coonts has been the author or co-author of over 40 fiction and non-fiction novels. This is the 10th in his ‘Jake Grafton’ series. I received a galley of this novel for review through https://www.netgalley.com. I categorize this novel as ‘R’ because it contains scenes of Violence and some Mature Language. The setting of this Thriller is primarily Washington D. C. and Norfolk, Virginia, though some scenes do take place in the waters off of China. The primary characters are Admiral Jake Grafton, now working for the CIA, Tommy Carmellini (Author Coonts has a separate series with him as the primary character), who works for Grafton at the CIA, and Lieutenant Commander Zhang Ping of the Chinese Navy. The heads of three intelligence and counter-intelligence agencies, including the CIA, die. Grafton is appointed interim head of the CIA. Zhang leads a Chinese commando team planting a nuclear bomb in Norfolk harbor. He is then positioned in Norfolk to trigger the bomb. He waits patiently for the time to strike. The Chinese have intelligence indicating that the US Navy will bring 5 carriers into Norfolk at the same time. Their goal is to cripple the US and open up the western Pacific to their own expansion and control. Carmellini is tasked by Grafton to handle several delicate missions. Along the way he encounters a lost love and their relationship rekindles. The assassin who took out the heads of government agencies targets Grafton and Carmellini. Others target the President of the US. Grafton and the rest of the US intelligence community struggle to find out who is behind these moves and why US leaders are being targeted. I enjoyed the nearly 9 hours I spent reading this 350 page novel. I had read the first of the ‘Jake Grafton’ series years ago and was not a particular fan of that novel. This Thriller was quite good. There is not a lot of action, but enough to keep things moving along. There was a lot of intrigue on the part of US intelligence and the Chinese government. I would certainly pick up and read others in either the ‘Grafton’ or ‘Carmellini’ series after reading this novel. I give this novel a 4.5 (rounded up to a 5) out of 5. Further book reviews I have written can be accessed at http://johnpurvis.wordpress.com/blog/."}, {"userName": "William Lovejoy", "userReviewDate": "Feb 12, 2016", "userURL": "http://www.goodreads.com/user/show/12977020-william-lovejoy", "userReview": "The Art of War is another dazzling product from Stephen Coonts. His familiar characters chase their ways through a tightly woven plot that will keep a reader hanging on. And just when one thinks the story will end, wonderfully, it doesn’t. Highly recommended."}, {"userName": "Adam", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/13006155-adam", "userReview": "I received this book for free from the Goodreads free book giveaway contest. What a fun book! China is seeking to change the span of control in the Yellow Sea and in order to take full control, they must get rid of the US Naval presence in those waters. Unable to take the Navy 0n and determined to strike at the heart of the US, China covertly sneaks in to the Norfolk naval yard and plants a nuclear bomb to destroy the carrier fleet, and all cities within a hundred miles of Norfolk. China, knowing that an explosion of this magnitude will destroy the US, will be free to do as they please with no further US interference. But China may have miscalculated, when they require a distraction to move the bomb into place, by assassinating the heads of several government agencies and attack Air Force One. With the US on full alert, will China get away with their plan? I highly recommend you take this journey and find out!! Filled with twists and turns, intrigue and action, 'The Art of War' a great book to start off your summer reading! Unless you are near Norfolk..."}, {"userName": "Clwseattle", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/6828643-clwseattle", "userReview": "The Art of War Chapter 8 \"Tragically, making war may be what humans do best.\"- Ralph Peters I have followed our hero Jake Grafton from his first appearance in books as a naval aviator through all his military and government assignments and by association that of Tommy Carmellini. Stephen Coonts, so much like Tom Clancy, is exceptionally knowledgeable and scarily prescient. Both loom large in The Art of War, but I was a bit disappointed in The Art of War because while the plot was engrossing, both Jake Grafton and Tommy Carmellini were flat, almost boring caricatures of their usually large personalities. The end of one semi-minor character was incomplete and very unsatisfying.4.5 stars for plot, 2 stars for making the personalities of Jake Grafton and Tommy Carmellini repetitive, flat and boring, therefore 3.5 Stars, mid C overall."}, {"userName": "Derek Mcknight", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/9427878-derek-mcknight", "userReview": "Sorry, in almost every respect I wanted to love this book. It is exactly the genre I like and I have enjoyed SCs books in the past but this was full of repeated statements, things that didn't make sense and a real lack of depth of character development and plot suspense. Plodded along okay but I won't be revisiting SC for a while after this"}, {"userName": "Steve", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/3333825-steve", "userReview": "The Chinese are flexing their muscles in the Pacific. They develop a plan to cut the strength of the US Navy in half with a second Pearl Harbor at Norfolk. A series of assassinations are meant to disrupt the government as well. Interesting twists at the end of the story. Tommy and Jake are interesting characters as well."}, {"userName": "Connie", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/11874691-connie", "userReview": "I am so tired of men who are old enough to know better beating their chests like little boys playing \"king of the hill\" and justifying violence and cruelty by claiming that \"the end justifies the means.\"Picked the book up on impulse. Had not read his earlier books and will not read any others."}, {"userName": "John", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/8537096-john", "userReview": "What a wild rollercoaster ride This book was just a good as any of Coonts Jake Grafton books there are a few surprises around the corner and it is filled of excitement and action. I will look forward to the next book with Jake and Tommy"}, {"userName": "Michelle", "userReviewDate": "Oct 22, 2016", "userURL": "http://www.goodreads.com/user/show/12950218-michelle", "userReview": "I loved this. It was a thrilling plot and felt like it could be happening now. It's nice to read a book with such a great variety of characters. A few that were integral to the plot were even \"mature\". It's nice to have a few heroes that actually have a little gray in their hair!"}, {"userName": "Bonnie", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/5961041-bonnie", "userReview": "An entertaining read with some insights into how how our military, government and intelligence organizations operate. And, perhaps, how those of China operate. Coonts fans will be glad to see what their favorite characters have been up to."}, {"userName": "Jason Brewer", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/17956888-jason-brewer", "userReview": "While the reader knew what the bad guy was up to, it still had its measure of suspense while the clock ran down and the hero had to figure out what was happening and why. Meanwhile, it was done with a very believable background of geopolitical motivations."}, {"userName": "anthony lanigan", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/61816118-anthony-lanigan", "userReview": "An excellent, well researched action bookI liked reading this book. The storyline and the characters were very realistic and the action sequences were gripping.I would recommend this book to anyone who likes action stories"}, {"userName": "Michael Chan", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/71463995-michael-chan", "userReview": "Very delicious light reading"}, {"userName": "CartoonistAndre", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/22327959-cartoonistandre", "userReview": "OK for a good summer action read."}, {"userName": "Gareth Taube", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/73236956-gareth-taube", "userReview": "Great novel!Well written and kept the suspense the entire time. Lots of plot twists and action. A fun read for anyone."}, {"userName": "Bill Reed", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/11214478-bill-reed", "userReview": "outstanding."}, {"userName": "T.J.", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/49847051-t-j", "userReview": "Unabashed Stephen Coonts fan so can't be subjective. Love the way he weaves backstory into a complex thriller with strong character focus in this one."}, {"userName": "Ktbird", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/5637491-ktbird", "userReview": "This isn't really my type of book, but I have to say I enjoyed it more and more as it went on."}, {"userName": "Robert J. Stanek", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/52969118-robert-j-stanek", "userReview": "A PAGE TURNERA real page turner!would make a very good movie. The story played out very well and finally come with a unexpected ending"}, {"userName": "Jenny", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/52697761-jenny", "userReview": "The Art of WarGreat story. Have read all Jake Grafton novels, . Love his character and how he handles the world around him"}, {"userName": "John Polson", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/20992385-john-polson", "userReview": "Think I preferred Sun Tzu's version..."}, {"userName": "Jason Seaver", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/2860976-jason-seaver", "userReview": "I've long felt Stephen Coonts was underappreciated among the techno-thriller authors that emerged based upon the success of Tom Clancy, and I'm still enjoying his novels even as I've found myself less enamored with many others writing in the genre as we diverge ideologically. If nothing else, his characters have earned a great deal of fondness from me, and the nuts and bolts of his plots are still a lot of fun.I must admit, though, it was a bit odd reading this one while waiting to transfer flights in the Beijing airport."}, {"userName": "Read Ng", "userReviewDate": "May 10, 2016", "userURL": "http://www.goodreads.com/user/show/8414890-read-ng", "userReview": "It has been a little while since I last read a Jake Grafton novel. He has moved up in the world. He is sharing the stage in this book with his up and rising protégé. Oh, my big mistake. This is his protégé's 6th story. It really has been a long time since I have visited the Grafton Universe. I have some catching up to do. Sounds like an excuse to read the entire series from the start. I wouldn't want to miss any action.I liked this book. Just enough realism to create credibility. I thought some of the technological instruments used were not quite up to snuff. The downing of Air Force One did not seem credible enough. I don't believe it is that easy to shield radiation emissions from a nuclear warhead. Why limit your search to within military controlled areas? But the worst is if your cell phone can't ping to a cell tower, you will not save battery power, but rather your phone battery will run out even faster as you phone is continuing looking for an active tower and will drain your battery very quickly. Still in all, this was a GoodReads that you will find very enjoyable."}], "description": "The Chinese dragon is flexing its muscles. As its military begins to prey on neighbors in the South China Sea, attacking fishing vessels and scheming to seize natural resources, the US goes on high alert. But a far more ominous danger lurks closer to home: a Chinese sleeper cell has planted a nuclear weapon in the harbor at Norfolk, Virginia, the biggest naval base on the planet. The target: a secret rendezvous of the Atlantic Fleet aircraft carriers and their battle groups. When the CIA director is assassinated and Jake Grafton is appointed to take his place, he gets wind of the conspiracy, but has no idea when or where the attack will occur. In the meantime, a series of assassinations, including an attempt on the life of the President, shake the country and deliberately mask a far more sinister objective. Can Jake Grafton and his right hand man, Tommy Carmellini, stop the plot to destroy the US Navy?", "title": "The Art of War\n      \n          (Tommy Carmellini #6)", "url": "https://www.goodreads.com/book/show/25614599-the-art-of-war", "average": 4.27, "cover": "https://images.gr-assets.com/books/1448830711l/25614599.jpg", "reviews": 109, "authors": [{"url": "https://www.goodreads.com/author/show/6866.Stephen_Coonts", "name": "Stephen Coonts"}], "type": ["Fiction", "Thriller", "War", "Spy Thriller"], "outlinks": ["http://www.goodreads.com/book/show/25614599-the-art-of-war", "http://www.goodreads.com/book/show/26035770-the-art-of-war", "http://www.goodreads.com/book/show/31212228-the-art-of-war", "http://www.goodreads.com/book/show/377425.Flight_of_the_Intruder", "http://www.goodreads.com/book/show/529839.Under_Siege", "http://www.goodreads.com/book/show/1133452.Final_Flight", "http://www.goodreads.com/book/show/377412.America", "http://www.goodreads.com/book/show/1093382.Fortunes_of_War"]}