{"ratings": 894, "userreviews": [{"userName": "Audrey", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/5363332-audrey", "userReview": "What a great memoir. I think the genre could take some direction from Porpora. He adds a lot of dialogue, even into stories that take place when he is very young. It was odd at first but it made the story feel more genuine, like it was taking place in real time, and wasn't some hashed collection of memories based on photo albums. The author grows up in poverty in a custody battle between his alcoholic mom and his father, an elderly vet. However, the story is far from melodramatic. The author shows nothing but acceptance and love for his family and for nearly everyone he meets. This book will probably draw comparison to \"The Glass Castle,\" but \"Autumn Balloon\" is significantly better. He doesn't portray either parent as a martyr. They're both human beings with flaws who are doing the best they can. Highly recommend this book!"}, {"userName": "Jessica", "userReviewDate": "Feb 05, 2015", "userURL": "http://www.goodreads.com/user/show/15992304-jessica", "userReview": "Rarely will I ever recommend a book or say a book was truly powerful enough that I think my friends across the spectrum might enjoy it. Books are personal. What I choose & you choose to read is personal. Book tastes are more different than the style of clothes you like to wear one day to the next. This book is different. It's a personal memoir, but it reads like a best selling fiction novel and then gives you more. It's a novel that touched my soul & is one for the generation of us Y2K'ers. It's the story of a friend we probably know in some capacity- you will likely find yourself associating with some peripheral, un-named character at some point & thinking you may even remember someone like our author here. But this book goes way deeper than scratching the surface of some interesting- yet cloaked in the unknown- understanding of someone you knew growing up. This beautifully written book makes you laugh, makes you cry, makes you want to go hug your brother, your mom, your best friend, your childhood pet...and then commit to put on your big kid undies and make life even better than it already may be. And for something so personal & powerful to be delivered in such an entertaining manner...well, that's a book I can stand behind!"}, {"userName": "Macey Austin", "userReviewDate": "May 02, 2016", "userURL": "http://www.goodreads.com/user/show/52780827-macey-austin", "userReview": "I think it's kind of judgmental to rate a memoir because it's the story of someone's life but this story is very insightful and has a happy ending! Warning: there are TONS of cuss words"}, {"userName": "Denise", "userReviewDate": "Feb 17, 2015", "userURL": "http://www.goodreads.com/user/show/27408481-denise", "userReview": "Full Disclosure: I was chosen a first reads winner, and received a beautiful hardbound copy of The Autumn Balloon in the mail. That in no way affected the review that follows.Kenny Porpora's first book, his memoir The Autumn Balloon, is such a moving story -- in fact, often heart-breaking -- in which his loving but very dysfunctional family tries to eke out an existence despite death, addiction, divorce, and other difficulties. Kenny himself has a special talent for writing, and that's evident in the memoir in terms of his descriptions of characters (including his wonderful little dog, Wozels) and relationships, as well as his very realistic dialogue writing. Several other reviewers commented on the difficulty of reading sad and difficult memoirs and speculated as to why this one is different. For me, it is the prologue that makes the difference: the reader learns from the very beginning that Kenny is going to emerge OK on the other side of the tale. That knowledge alone kept me reading through all of the trials he faced in this true story.A really good first book; I hope he continues to write and wish him continued success! I was very grateful for the opportunity to read this book."}, {"userName": "Sharon", "userReviewDate": "Jun 16, 2015", "userURL": "http://www.goodreads.com/user/show/835611-sharon", "userReview": "Having lived most of my life on Long Island, and visiting Arizona many times... the setting of this book produced a familiarity that made me feel that I \"knew\" Kenny Porpora in a way that I have never felt belt before about an author... I was a teacher for many years in Amityville (one of the places mentioned often) and it again felt like Kenny's life and persona held a special place for me... To me this memoir was all the more amazing in that it was his first book... I am not a writer and I have no idea how he decided what things to tell and what things not to tell... I was so rooting for him to \"make it\".. and to be happy... perhaps they are one and the same. It is a book I would like to reread... and he is a person I would love to meet... his heart shines through. It is rare to read of so much loss and still feel uplifted. I have no idea why, but I also read every word of his acknowledgments (not something I usually, if ever do).. and I plan to look up his newspaper work. This is a book, whose content and feeling will stay with me... Bravo..."}, {"userName": "Kristen", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/1564302-kristen", "userReview": "I bought this book on a whim at Dollar Tree, so my expectations were not high. The author's experience made me sad and angry, but I am glad he shared it. Worth reading!"}, {"userName": "Elyse", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/35386998-elyse", "userReview": "3.5 stars. I am 100% positive that I want to be friends with Kenny Porpora. He's just so likeable. But I can't quite figure out if I actually liked this book. Part One takes up a 2/3rds of the book and details Kenny's childhood, with a focus on the selfish aspect of addiction and how addicts struggle to balance their love of drugs with their familial love. Although Kenny has a truly tragic childhood, his writing in Part One was so journalistic that I oddly didn't feel affected by his very disturbing stories. I had almost given up on the book, but then I LOVED Part Two, which is an inspiring montage of how he took control of his life and dedicated himself to becoming a journalist. Once I read Part Two, I started to think that maybe Kenny had intentionally written Part One in a detached voice because he truly feels disassociated from his childhood, as he had so little control of his world at that time. I wish Part One had been shorter and that Part Two had been longer. Personally, I would have preferred to hear less about the well-meaning but self-centered family members who made his childhood so deeply unsettling, and more about his life now and all of his very impressive accomplishments. I do hope he writes more, because I'd love to see what he'll do in the future."}, {"userName": "Nicole Rollins", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/28839252-nicole-rollins", "userReview": "I can't say I loved or hated this book. I was always waiting for the climax. I would think, okay, this is a lot like The Glass Castle and With or Without You. I'm enjoying the story (kind of), but I'm not surprised. Maybe I'm a bit desensitized to this stuff. And I would read on, waiting to be surprised. It never happened. When he mentioned he was gay (about midway through), I thought: \"Man, I hope that wasn't the climax. Who cares?\" It's an okay read. Maybe if you haven't read other memoirs about dysfunctional, drug-abusing families, this would be a great first read for you."}, {"userName": "david", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/67794375-david", "userReview": "I am, typically, not a reader of bestsellers. I bought this book because it was cheap and it garnered some amazon stars. that said, I finished the book in two sittings, crying throughout most of it. This author is not of the caliber of some of the many authors I have read, such as Tolstoy, Dickens, etc. However, there was a brave awareness in his memoir. And he was not one to point fingers at others for his personal tumult. And all that combined, I respect."}, {"userName": "Rambling Reader", "userReviewDate": "Sep 05, 2015", "userURL": "http://www.goodreads.com/user/show/33854695-rambling-reader", "userReview": "impressive debut"}, {"userName": "Jennifer", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/28212782-jennifer", "userReview": "This was such a poignant story. I could identify with some of the things Kenny has gone through in his life, and feeling like you are an adult long before you should due to circumstances out of your control. This is a memoir, a story of addictions, death, the impact it can have on you, and to persevere despite the odds you feel are stacked against you."}, {"userName": "Patricia", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/9113276-patricia", "userReview": "A powerful memoir by Kenny Porpora sharing his life experiences as a child and becoming a young man living in a highly dysfunctional family filled with alcoholism, drugs, poverty, homelessness, no role models and little hope. Kenny and his brother are bounced in custody battles between their father and mother, both whom love the boys very much, but they are both so trapped in poverty and drugs they can barely hold life together. They boys live in New York, Arizona, Florida, Arizona and New York and often in extreme substandard living conditions. Aunts Kathy and Gina and uncle Carter die from drugs and alcohol. An unfathomable existence for two children. The only consistent security and love Kenny receives is from his dog Wozel. He has no friends but while living in Arizona a boy, Brian, takes him into the adolescent crowd. Kenny finds solice in books and becomes intrigued with writing. He ultimately gets his GED and completes college at Hofstra. Through his determination and grit he gets an interview with Roger Ebert. Ebert shares with Kenny that he always wished he'd gone to graduate school and tells Kenny Columbia is a great school. Kenny graduates with a four-point-oh from Hofstra, is accepted and completes the graduate program at Columbia, writes for the NYT and moves to San Francisco. At times the book is heartbreaking to think about how Kenny and his brother lived as children. Kenny's story is remarkable to see how his perseverance, some luck and a couple people encouraging him pushed him beyond the destructive patterns of everyone on both sides of his family. The lives of Kenny and his mother and father were like \"The Myth of Sisyphus\" by Camus. \"It's about a guy who's been punished to a lifetime of futile labor,\" I tell her. \"He has to push a boulder up a hill, and when he gets to the top it just rolls back down again, and he has to start all over.\" This was always the situation with Kenny's parents.\"He interrupts. \"You feel like you're constantly shoveling shit against the tide.\" \"Yeah.\" I say. \"I'm always so worried,\" I say. \"It's like I'm always waiting for a piano to fall out of the sky.\" My father laughs. \"Kiddo, this is life. Bad things happen.\" He puts his hand on my shoulder. \"And good things will happen too.\"\"For Camus, death isn't the answer, but neither is hope.\" He looks down at his notebook and reads from it verbatim: \"He says, 'The hero of ordinary life is the person who resolutely shoulders the responsibilities that life imposes.'\"\"I've spent so many years hardening my heart against addictions, so many years making fists, that I had forgotten all about the child who lives behind those dead eyes, and in those small moments when I let myself remember, when those familiar voices whisper, I am brought back to a different time, before I even knew what a monster was, and I am sad to accept that somebody who once was so kind to me, who took the time to make me feel a little bit less alone, could not find that same kindness for himself. I look into the mirror, and I'm not sure how I wound up the lucky one, but I'm happy to be alive today.\"\"Sometimes I think, Was she thinking about me when she was drinking? Did any of them ever think about me when they were putting straws in their noses and needles in their arms? Did they think about me once?\""}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "I won this book in a Goodreads giveaway for an honest review. Thank you! I don't even know where to begin! I totally fell in love with this book. Kenny has a most dysfunctional family, but there is love under all of the craziness. His mother is an alcoholic and his father is so much older, people think he is his grandfather. He has an older brother as well. And a sweet beloved little dog that he names Wolzels. The Regis and Kathy Lee show had the North Shore Animal League on one of their programs with the dog up for adoption. Kenny really wanted her and his mother got her for him. They live a long and happy life together. Kenny and his brother Stephen get separated for a bit of time. Kenny with is mom and the dog and Stephen with his father. His father ends up getting custody of both boys, even though they would rather live with their mother. The thing I don't understand is how in the world can you take the kids away from a mother that is an alcoholic and the dad takes them to live in the basement of some creeps, the man being a pedophile that hurts the little girl that lives there. They have a pig in the house and nasty filth everywhere. It takes their mom fighting and the boys finally saying they want to live with her for them to get back. I mean when the people come to investigate this stuff and the smell hits them at the door they don't think it's a place children shouldn't live! I feel bad and angry for children that the system don't help very well. I don't want to give too much more away but this story is so wonderful and so sad. There are many times I'm cracking up over the things their mom says. They have a crazy dynamic that just works for them. Their mother loves them so much and cleans up a lot of times and gets on track. The good thing is the boys both get to go to college and become and Kenny gets to become what he wants. There is plenty of heartache, deaths, victories and a lot of love. It makes you see that not everything is perfect in the world but if you have people that love you and fight for you then you have all that you need."}, {"userName": "Frederick", "userReviewDate": "Feb 25, 2016", "userURL": "http://www.goodreads.com/user/show/117377-frederick", "userReview": "This memoir is vivid, clear and to the point. It is the memoir of a survivor. Kenny Porpora grew up in Bay Shore, Long Island and in Arizona, tossed between his volatile parents. For all the madness he saw in the various adults around him, he held enough hope to reach out to a few mentors who ultimately guided him through college, graduate school and his career as a journalist. Emailing successful people yielded one answer at least. The film critic Roger Ebert, who most readers will remember for his intelligence and warmth, gave Kenny Porpora a moral boost.Someone whose name many readers will have heard but may not place is Katie Beers. When he was ten or so, the author lived downstairs from her just before her abduction. She was kept chained in the house of a neighbor for seventeen days. This throws everything in the book into sharp relief. This was the world outside the author's door.Beers has written a memoir as well. Stories of survival come at great cost.What makes THE AUTUMN BALLOON different from many memoirs is its tone. While it is a story with a beginning, a middle and an end, it is made up of vignettes, dispassionately told. There is the father doing stand-up at nursing homes. Here is the author's mother putting ornaments on the tree, with names of the dead painted on them. Here are Kenny and his older brother, confronted by bullies their own age, suffering ignominious defeat. (Actually only Kenny suffers it, making this a funny-sad incident.)There is no boasting of destructive indulgences here. Kenny avoids the trap of drugs and alcohol which destroys the lives of so many around him. The one moment of indulgence he describes teaches him caution. This self-restraint, I think, is a reason Kenny Porpora is able to write with such forgiveness."}, {"userName": "Karen", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/3060349-karen", "userReview": "This is a memoir written by Kenny Porpora, the youngest son of a fractured and poor family, one that just can’t seem to catch a break. It chronicles his journey growing up in a dysfunctional but caring environment, one filled with severe addiction and painful loss. The novel is his therapy of sorts and I felt as if I was privy to a personal diary. At times it is a painful read as his life seemed bleak. I am not convinced of his recollection of the complete details of conversations, especially when he was very young, but that didn’t interfere with my satisfaction of the book. Through it all, his resilience and forgiveness are inspiring. The kindness of his mentors who believed in him made a monumental difference in his life. He develops strength and perseverance. Kenny is determined to rise above, convincing a college to take a chance on him. He studies hard, defies all odds and graduates from an Ivy League school. He is a survivor."}, {"userName": "Toby Murphy", "userReviewDate": "Aug 15, 2016", "userURL": "http://www.goodreads.com/user/show/7851980-toby-murphy", "userReview": "This is a stunning memoir. From the first page, Porpora pulled me in as he tells his story of growing up with addiction in a broken family. He does not fall into the usually traps of the genre and does not rely on being too emotional, but rather does what a memoir should do: tell the story as it happened. He relies on being straightforward in telling his experience and his use of dialogue is worthy of study. This novel begs to be read, and that is evident in the fact that I could not put it down. My only disappointment is that I read it to quickly as I was absorbed by Porpora's storytelling ability."}, {"userName": "Britney King", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/16049736-britney-king", "userReview": "Captivating. And beautifully told. I'm not even sure I have the ability to write a review worthy enough to describe how stunning this book is. Brilliantly written—this story consumed me from the moment I picked it up. I couldn't put it down—I began and finished it within the same day. The authors story felt like my story, perhaps because it was so beautifully told—but so much so that at times I wondered whether we were living the same childhood, miles apart. All in all, a story of hardship, loss, and struggle—but more importantly, one of hope and triumph in the face of those things."}, {"userName": "Amy", "userReviewDate": "Feb 25, 2015", "userURL": "http://www.goodreads.com/user/show/5121079-amy", "userReview": "Such a wonderfully, heartfelt, loving story of heartache, addiction, and hope. I work at a peer support agency for people who are in recovery for mental illness and addictions, I would love to have this book be a part of one of our groups.This story was so raw and honest. There are so many paths that a person can take and I am just thankful the author went on the journey he did, so he could share it with all of us. I would recommend this book to everyone, especially those of their recovery journey or peer supporters.I would like to thank NetGalley, the author, and the publisher for allowing me to read this amazing story."}, {"userName": "Melissa", "userReviewDate": "Jun 04, 2015", "userURL": "http://www.goodreads.com/user/show/39678170-melissa", "userReview": "The Autumn Balloon is a powerful memoir that I won't soon forget. Mr. Porpora's childhood was one that no child should ever have to experience. Filled with tragedy & loss, it broke my heart reading about what he and his family have endured. However, the unwavering love of his family, as well as his determination, strength and success as an adult have helped to mend it a bit. His story moved me & I sincerely wish him and his family the best."}, {"userName": "Karen", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/27652377-karen", "userReview": "This is a powerful memoir! Kenny Porpora's life was devastating in so many ways, and yet he tells his story with not a hint of bitterness or pity for himself. His prose makes you feel as though he is sitting beside you, talking to you. And yet, many passages will make you weep with emotion. What a testament his life is to his tenacity and strength of spirit. You will applaud this young man for the success he has made of a life filled with emotional obstacles!"}, {"userName": "Rebecca McNutt", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "This true memoir invites readers to view a family in danger of becoming a casualty. When so many of them have been gripped by troubling addictions, it's going to be difficult to stop the legacy - difficult, but possible. The Autumn Balloon is an inspirational and unforgettable book about breaking habits and reuniting people."}, {"userName": "Lauri Taylor", "userReviewDate": "Apr 06, 2015", "userURL": "http://www.goodreads.com/user/show/40548058-lauri-taylor", "userReview": "Heartbreaking, inspiring and beautiful debut!"}, {"userName": "Elizabeth", "userReviewDate": "Mar 26, 2015", "userURL": "http://www.goodreads.com/user/show/12450101-elizabeth", "userReview": "Wow. I could not put it down."}, {"userName": "Diana", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/10356013-diana", "userReview": "I really loved this book. It made me laugh out loud a few times, and it made me cry a LOT."}, {"userName": "Juliana Philippa", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/1378820-juliana-philippa", "userReview": "What a wonderful book. I spent the last 20% or so with tears in my eyes, and sometimes straight out crying, which is unusual for me; as emotional as I can in real life and as much as I love books and am touched by those I read, they rarely bring me to tears. This memoir is lovingly written and full of humor, stark honesty, sadness, and inspiration. The first chapter takes place more in the present-day, and after finishing the book just now, I went back and reread it and cried some more, but with a smile on my face.She likes to write messages on balloons and send them to the sky. She takes out a black Magic Marker and she starts writing on the dozen or so balloons, one for each member of our family who died. She doesn't think she can write well and asks me not to read her notes.She likes to think they'll soar all the way to heaven. I think she knows they end up tangled in power lines or deflated in a pile of orange leaves in someone's backyard miles away, but I can never bring myself to say that to her. I've often wondered what they must think, those people who find our balloons. I've wondered if they read the messages and understand what they mean.I remember watching those balloons as a little boy, each fall, wondering if someday I, too, would be nothing but a balloon in the sky, soaring toward the sun until I began to fall slowly back to earth and into the hands of a stranger. (p.4-5)Porpora writes with such a soft and starkly honest voice. He presents us with an unvarnished portrait of his family, warts and all, not making them out to be anyone other than who they are, but there is no harshness in the presentation; even in those moments of anger or despair he describes, you can feel his love for these flawed but oh-so-human people. The book is unflinching and given the tragedies and difficulties that he is writing about, it is easy to see how with a less talented author and a less sensitive person, these depictions could come off as caricatures, with the writer ridiculing his subjects. There is none of that here though, and Porpora writes passages of (all too real) absurdity in such a way that you are laughing with (sometimes-unwilling) affection for the people involved, as opposed to in any way laughing at them. For example, despite all the crazy, fucking shit his mother pulls and puts he and his brother through, I finished the book absolutely fucking loving that woman and wanting to meet her in real life. (I love the f-word, yes, but I also thought it especially appropriate to employ in a sentence about her, in her honor ;-). His dad with his nursing home gigs, his brother and the gruff love clearly underlying their interactions, his Uncle Carter and his mad schemes, Wozels—oh, Wozels, Brian with his easy confidence and seemingly carefree life, etc. Saying it's a wonderful cast of characters doesn't feel appropriate, because these people are all too real, and Porpora brings them to vivid life within the book's pages. G-d—him and his Roger Ebert obsession!! Okay I'll stop, because otherwise I'll just start rehashing all the little passages and incidences that bring a smile to my face (the conversation between him and his mother in the car at the end when he tells her he has a date, lol!!).When I came on to GR to update that I had finished reading this book, I was surprised to see that I had started it last summer in 2016; I knew that I had been slowly going through it, but hadn't realized I'd drawn it out that much. I mention this because I usually read books much more quickly, but the fact that I started this a year ago and am only finishing it now has nothing to do with the book itself and more to do with my crazy schedule and uneven reading habits.There's an author interview section at the end (of the Kindle version at least), and I loved what Porpora responded when asked what message he wants people to draw from The Autumn Balloon:I'd like them to appreciate the power of the individual—and I don't mean me; I mean the power each person has to make choices and be accountable for himself or herself. I've noticed that people are quick to put you in a category—if you come from this place then you are that thing. But I've never placed much value in statistics and trends, bar graphs and socioeconomic data that sum people up. I stop listening when somebody asks me if I know what my chances are. I don't know that I believe in probability. People are inexplicable and incomprehensible, and nobody really knows what's possible until they try. I prefer the exceptions to the rules. I like people who try, even when their chances are zero. (p.295)I couldn't agree more."}, {"userName": "Trevor Pearson", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/13458191-trevor-pearson", "userReview": "Received a copy of The Autumn Balloon by Kenny Porpora through the GoodReads First Reads Giveaway program in exchange for an honest review \n\"There's a bottle of vodka standing upright on the table. And I stare at it too long. I step closer. I know that label. I know the seductive, womanly shape of the bottle, the same one my mother picks up from the bottom shelf at the grocery store. I've seen it in my closet on Easter morning. Under the sink. Hidden beneath garage tarps puddle with wet leaves and old rain. It stares back at me, grins at me with charming eyes, gestures for me to come closer. It knows me. It's seen more of my family die than I have. It's always been here.\"\nEvery year as Autumn approached performing her beautiful transformation of leaves to the frost firmly settling on the blades of grass, Kenny Porpora knew it was a matter of time before his mom would conduct her annual tradition; her very own Day of the Dead celebration in Long Island, New York. Mrs. Porpora would write personalized messages for the many of her friends and family that have come to meet there demise at the hands of their very own addiction. For every new death there was an added balloon, and as each period of grief was forced upon her, any progression she had made in her life was conceded, and succumbing to her own personal addiction would take her complete attention. The only way she knew how to deal with her pain was to drink and watch television while remembering the good old days before dark days fell upon them all. Kenny and his older brother Steven were the proverbial pawns in their parents custody chess match that resulted in court supervised visits, various calls to child protective services, cross-country travels, sibling separation, and the coaching of children to lie to the people you're told to trust the most. Kenny hardened his heart dealing with all of the deaths and addictions that surrounded him, traversing through the world with dead eyes, unflinching and purposed. Throughout it all Kenny maintained his devotion to his parents because he needed them almost as much as they needed him. \n\"I look at her, and I can feel the warmth of the tears in the back of my head and I want to tell her I was the only one who didn't get invited to the coolest party of the year and that they made fun of my Wozels T-shirt and they tease me because of the gap in my teeth and because I talk with an accent and because I wear the cheap jeans from Kmart. I want to tell her that I'm tired of not having any friends, and I want to break into pieces. 'It's nothing,' I say. 'Just a lot of math homework.' \"\nA born mommy's boy, Kenneth withstood many verbal barrages and provocations knowing that everything would go back to normal in the morning, and sure enough it did, leaving television figures to be the subject of her abusive nature. Kenny dealt with grief his own way utilizing different methods at various stages in his life. As a child he used wrestling as a way to have an outlet for fun with his aggressive and condescending older brother. As a teenager, after finally finding a friend he could lean on for support, he maintained his sobriety at a time when it's so easy to give in to peer pressure. This allowed him to focus on his family and his beloved dog Wozels. As a young adult he found inspiration through an unlikely source who urged him to achieve something in his life that he never did but wish he had. He suddenly felt, with this turning point that involved a measly 15 minute interview, that a better life was truly attainable, there was just one big, giant obstacle firmly entrenched. Kenny spent the majority of his adult life trying to find his own way, but never fully committed to cutting the cord that bound himself to his alcohol-addled mother. It would take a strength and a determination for him to reach his dream; and what gave him an advantage was that his trade was mastering life using past losses and hope as his tools to achieve it.\n\"It's funny...when you're young you spend your life trying to convince yourself you're not like your parents. And then, every now and then, you'll do something a certain way, some mannerism, or you'll say something. When our car broke down upstate, I remember I hit the wheel and said, 'I'm not made of money!' And I caught myself and thought, Gee, Louie, you just sounded like Pop. When you're young and it happens, it drives you crazy. And then you live long enough, and it makes you smile a little.' He wipes a tear from his eyelashes with the back of his hand. 'That's a nice part of life,' he says.\"\nWriting the stories of his life brought a sense of forgiveness for the addicts and criminals that he never allowed himself to feel as well as an understanding of their motivations as ill sought-after as they may have been. A book that showcases the vulnerability and the power that encapsulates that of being a human being; emphasizing the importance of accountability in moving forward and to forego doubt even when the chances for success are minute. Kenny was fearful of the passing on of failure from generation to generation as a progressive trait in the Porpora gene pool gaining strength to a point of becoming insurmountable. Relying on a multitude of get rich quick, or however long it takes schemes as a means for survival never seemed so ominous. Kenny fears that he is going to end up like his fallen family, because he realizes that at one point everyone laughs and smiles knowing that they have their future ahead of him, he is no different than anyone else.\n\"I look over at my uncle, and he smiles, gives me a thumbs up with his bandaged hand, and I wonder if he thought about me when he was punching through our window, rummaging through our house, stealing everything we had. I wonder if he knew how it would break his sister's heart. I imagine him at the pawn shop, trading everything he stole for a handful of crumpled twenties, then cropping up the powder it bought on the plate and snorting away my brother's baseball cards and the seven hundred dollars my mother had saved in the teddy bear shaped cookie jar on our kitchen counter and the TV and the wallet my father gave me.\"\nThe book is about how the way you respond to challenges will determine your future and to focus on the beauty of the uncertainty that tomorrow can bring. Once you accept that death is everyone's ultimate fate, you will finally find happiness in the struggle. A straightforward and honest recounting of a horrific childhood when coming home from school you expect to see cop cars in your driveway, or a seemingly ordinary day could involve a trusted family member pawning off your baseball cards to feed their own addiction. A reality where on one hand when staying with your mom, the various scents of a motel room are all to familiar, but it sure beats sleeping in a car. When staying with your dad, you are constantly reminded how your father looks more like a grandfather because he's in his seventies while you still count your age with 1/4's and 1/2's, the shoe polish hair dye and charm just isn't enough for convincing when the lines on your face are that of a cross section on a Yew tree's stump.\" 'Our parents died at least twice, the second time when we forgot their stories.' \"While reading this memoir I couldn't help but relate it to pretty much any one of Augusten Burroughs books given all of the dysfunctional elements and soiling of bedsteads, as well as Jeannette Walls The Glass Castle as it compares to constantly being on the move but also the missed opportunities in life for parents with many talents. Through all of his mother's misgivings, she did provide her children many experiences, memories, and opportunities that helped shaped them and become the men they're today. The Autumn Balloon is a solid read but fails to impress the person looking for the magnificent.\n\"She says the boy encounters a wise old turtle during his travels, and the turtle tells him, 'Remember then that there is only one important time, and that time is now. The most important one is always the one you are with. And the most important thing is to do good for the one who is standing by your side.' And the turtle says, 'This is why we're here.' \""}, {"userName": "Donna", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/25770629-donna", "userReview": "An inspiring story of a person with an extremely dysfunction family life who overcame many difficulties to graduate with a Master's degree from an Ivy League university and become a published author.And it is written so convincingly that the reader feels he is there with every defeat and agony. The details are made alive. The reader can smell the stench of dried urine, blood and other bodily fluids. He can feel the physical pain of violence and illness and the fear for personal safety and the heartache of loss and rejection. He can see the holes in the wall made by fists, the darkness of substandard rented basements, the shabby clothing, and every detail of the 27-year old car. He can hear the cursing and verbal abuse. He shudders when the young brothers close their eyes when forced to watch pornography by a perverted landlord and when the mother uses extremely crude language. But he also feels the love, appreciaton and respect of the author for his parents.Raised by parents who seemed addicted to alcohol, violence and failure (yes, failure can be an addiction), he rejected family role models, peer pressure and his own loneliness and refused to become a victim of alcohol and drugs. Accomplishing only this would make him a success. But this was only the first obstacle that he overcame.As a school dropout, he worked at minimum wage jobs, took second jobs, rejected illegal get-rich quick schemes, and achieved his GED qualifications and acceptance into university. Finally, after being told it is impossible, he is accepted into an Ivy League university and finally writes his first book.Emotional and realistic and inspiring. A tale that can be told only by someone who has lived it."}, {"userName": "Sonya L Moore", "userReviewDate": "Feb 18, 2015", "userURL": "http://www.goodreads.com/user/show/4799499-sonya-l-moore", "userReview": "I am really glad that Tiffany Sanchez, connected somehow with the Hachette Book Group, sent me a complimentary copy of this book, as I very seldom pick up modern memoirs to read - especially those by young writers from dysfunctional addicted families. I have read a few and they are all too much alike. To tell the truth, I did not even notice in small type \"a memoir\" on the front cover and thought I was reading a novel. Happy circumstance because with every page I turned, I liked it more. The narrator, Kenny, is an old second grader when the book opens to a scene of his drunk mother, cursing the television, him, his brother, his father who has just been arrested for domestic violence and life in general. It is obvious that he is the adult in the house. I watched as he grew older, more mature and his parents did not, as his uncles and aunts and friends died of one drug/alcohol-related incident after another. Kenny was treading in deep water, trying to save those around him, as well as himself. The book is darkly comic, with very nice prose (always a dire necessity for me to finish a book), but it was also a beautifully epic struggle for survival. AND it had a dog, always a plus for me.From Amazon: Every autumn, Kenny Porpora would watch his heartbroken mother scribble messages on balloons and release them into the sky above Long Island, one for each family member they'd lost to addiction. As the number of balloons grew, his mother fell deeper into alcoholism, drinking away her sorrows every night in front of the television, where her love of Regis Philbin provided a respite from the sadness around her. When their house was foreclosed upon, Kenny's mother absconded with him and his beloved dog and fled for the Arizona desert, joining her heroin-addicted brother on a quixotic search for a better life. What followed was an outlaw adolescence spent in constant upheaval surrounded by bizarre characters and drug-addicted souls.In the wake of unspeakable loss, Kenny convinced a college to take a chance on him, and turned to the mentors, writers, and poets he found to rebuild the family he lost, and eventually graduated from the Ivy League with a new life.Porpora's memoir is the story of a deeply dysfunctional but loving family, and follows his life from the chaos of his youth to his triumphs in the Ivy League. At times darkly comic, at times elegiac, The Autumn Balloon is a beautifully written testament to the irreplaceable bonds of family, even under the most trying circumstances, and one that marks the debut of an exciting new writer.Editorial Reviews:\"Porpora describes the realities of his life with humor, grace and laudable neutrality, never once falling into the surviving-against-all-odds tone so frequent in this genre. . . .a brilliant debut from a fine writer . . . Four out of four stars.\"—USA Today\"[A] piercing first book.\"—Kirkus Reviews\"Compulsively readable. . . alarmingly engrossing. I sat down with this book with the intention of reading a chapter or two and came up for air hours later, bewildered and with my cheeks wet. . . A memoir that should be moved to the top of everyone's to-read list immediately.\"—Lambda Literary\"It is a rare and essential book that begs to be written, that must be written. One senses that the writer's very survival is at stake, and the writing had better rise to the material or else all is lost. It is an artistic high wire act that only a precious few can pull off and when they do, the result is mesmerizing. Kenny Porpora more than achieves this in his brave and heartbreakingly beautiful memoir, The Autumn Balloon. This unforgettable tale lays bare the squalor of addiction and the poverty of the mind, heart, and body that comes from that, yet it is also a fearless meditation on the surprisingly enduring love of family, those eternal blood ties that ultimately save us all. This is one of the strongest literary debuts I've witnessed in years, and Kenny Porpora is an important new voice among us.\"—Andre Dubus III\"Spellbinding, gut-wrenching, and wildly cathartic, Kenny Porpora's heady literary debut is everything you want a memoir to be. This book will leave you with a sense of gratitude for life's biggest heartbreaks, and remind you that our greatest triumphs arise from our deepest struggles. Kenny Porpora is one of those rare individuals who was utterly destined to become a writer, and The Autumn Balloon will no doubt find a place on the shelf among the very best of its genre.\" —Claire Bidwell Smith, author of The Rules of Inheritance\"Kenny Porpora's stunning memoir, The Autumn Balloon, had me from the opening pages and wouldn't let me go until the very end. Even then, I didn't want to say goodbye to my narrator and his extraordinary ability to find something of beauty in the darkest places. This family story of addiction is full of moments--some tender, some funny, some ordinary--that speak of the love that persists even in a family's most brutal times. This is a story of what we take from one another and what we do to move forward. A beautifully written book about loss and redemption,The Autumn Balloon is as real as it gets.\"—Lee Martin, author of Such a Life and From Our House\"Kenny Porpora's startling and incisive debut memoir cuts a wide swath, from heart-rending to hilarious. In an eloquent voice, he tells of one of the most horrendous childhoods imaginable, avoiding any hint of self-pity. Out of the shabbiest materials, he has found a life worth living, and grown into a man who is capable of forgiveness and love. His testament will not be forgotten.\"—Robert Goolrick, author of A Reliable Wife and The Fall of Princes About the Author:Kenny Porpora has written for The New York Times, New York Daily News, and Newsday. He is a graduate of Columbia University's School of Journalism and Hofstra University. The Autumn Balloon is his first book."}, {"userName": "Lana Shartle", "userReviewDate": "Nov 14, 2016", "userURL": "http://www.goodreads.com/user/show/14286434-lana-shartle", "userReview": "If pain can be beautifulThe autumn balloon grabs you and swallows you whole until you get to the final page. Even after you are finished you are mesmerized by images that are so clear in your mind because of the amazing descriptions. There is hope weaved into this story without being sappy or Pollyanna. It's a memoir so touching you wish you could reach into the pages to hug and hold the author and make everything better."}, {"userName": "Nancy", "userReviewDate": "Nov 03, 2016", "userURL": "http://www.goodreads.com/user/show/35714314-nancy", "userReview": "Kenny Porpora's memoir is a difficult one to read. We first meet him at his Columbia graduation celebrating with his mother so we know the ending is promising. His road there, however, is not an easy one. He has described his flawed parents, friends, and circumstances in such a clear way that you ache for him. He doesn't hide the fact that he didn't fit in very well due to his own behavior. I cannot help but think that his not fitting in was the cause of his success."}], "description": "NEW YORK TIMES BESTSELLER Every autumn, Kenny Porpora would watch his heartbroken mother scribble messages on balloons and release them into the sky above Long Island, one for each family member they'd lost to addiction. As the number of balloons grew, his mother fell deeper into alcoholism, drinking away her sorrows every night in front of the television, where her love of Regis Philbin provided a respite from the sadness around her. When their house was foreclosed upon, Kenny's mother absconded with him and his beloved dog and fled for the Arizona desert, joining her heroin-addicted brother on a quixotic search for a better life. What followed was an outlaw adolescence spent in constant upheaval surrounded by bizarre characters and drug-addicted souls.In the wake of unspeakable loss, Kenny convinced a college to take a chance on him, and turned to the mentors, writers, and poets he found to rebuild the family he lost, and eventually graduated from the Ivy League with a new life.Porpora's memoir is the story of a deeply dysfunctional but loving family, and follows his life from the chaos of his youth to his triumphs in the Ivy League. At times darkly comic, at times elegiac, The Autumn Balloon is a beautifully written testament to the irreplaceable bonds of family, even under the most trying circumstances, and one that marks the debut of an exciting new writer.", "title": "The Autumn Balloon", "url": "http://www.goodreads.com/book/show/22511154-the-autumn-balloon", "average": 4.11, "cover": "https://images.gr-assets.com/books/1415581701l/22511154.jpg", "reviews": 156, "authors": [{"url": "https://www.goodreads.com/author/show/8316696.Kenny_Porpora", "name": "Kenny Porpora"}], "type": ["Autobiography", "Nonfiction", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/22511154-the-autumn-balloon", "http://www.goodreads.com/book/show/23617310-the-autumn-balloon", "http://www.goodreads.com/book/show/28823854-the-autumn-balloon", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}