{"ratings": 693, "userreviews": [{"userName": "Amanda", "userReviewDate": "Sep 11, 2007", "userURL": "http://www.goodreads.com/user/show/193580-amanda", "userReview": "After reading the other two books by Kathy Hepinstall, I was excited about reading this one. Though different from the other two, the book still flows poetically with descriptions of place and time that take the reader back to the early seventies and into the world of a young child. Maybe that's part of why I liked this book so well...it's told from the innocence of a twelve year old but with the knowing of a smart young girl who knows she's in trouble but is fairly helpless to do anything about it. On a day of picnicking with their mother Meg, Alice and Boone watch as a stranger saves Meg from near drowning. But from the beginning, Alice doesn't trust the man. As he becomes closer to being part of the family, the children find out just how cruel the man is. Each deals with it in their own way...Alice sacrifices things to some invisible God she's unsure about and Boone prays to his the God of heaven, preferring to find the goodness in their new stepfather while Alice just wants him gone. As the stepfather becomes angrier and more volatile, so too does the premonition that something bad could happen. When their mother one day tells them to run away, they do so in fear of what their stepfather might do. Hiding out by the lake on a hidden island with an teenage girl who escaped from the mental hospital, the two must decide what to do. As in the other books, there are subtly told twists that make the story even better to read (one I knew soon and one I never saw coming). The only part I had a hard time dealing with was the spousal and child abuse, but I have a hard time with that anyway. For this book, those descriptions were needed to tell the story. This is definitely one I recommend for anyone."}, {"userName": "Jaime", "userReviewDate": "Jun 25, 2008", "userURL": "http://www.goodreads.com/user/show/1271115-jaime", "userReview": "Lyrical and haunting; scary, sad, and gorgeous. I loved this book. Hepinstall's best book."}, {"userName": "Venus", "userReviewDate": "Aug 28, 2010", "userURL": "http://www.goodreads.com/user/show/4216381-venus", "userReview": "I read this book years ago and immediately wanted everyone I knew to read it as well. Now I'm reading it once again and I remember why I enjoyed it so much."}, {"userName": "Kerry", "userReviewDate": "Jun 06, 2009", "userURL": "http://www.goodreads.com/user/show/616503-kerry", "userReview": "I liked it. Not my typical genre, but set in East Texas, author from Austin, was reccomended and my interest was peaked. All of the pieces fit very nicely together, too nicely for my taste but still a good read."}, {"userName": "Cathe Olson", "userReviewDate": "Jun 14, 2010", "userURL": "http://www.goodreads.com/user/show/2192498-cathe-olson", "userReview": "I picked this up by chance at the library book sale last weekend and it was great. The book is about a twisted new stepfather who doesn't like his stepchildren very much (to say the least). It reminded me a bit of some of the evil stepfather movies I've seen but this had the added twist of one of the kids idolizing a teen girl who poisoned her parents who he constantly writes to in prison and tries to make contact with on one of her frequent escapes from a mental institution. Good creepy fun."}, {"userName": "Ariane", "userReviewDate": "Apr 19, 2009", "userURL": "http://www.goodreads.com/user/show/2237786-ariane", "userReview": "You will love to hate the father in this book. I had a very ragged copy that I got for free from a thrift store. Truly a diamond in the rough. The story is very involved and I could not put it down."}, {"userName": "Merline White", "userReviewDate": "Aug 31, 2010", "userURL": "http://www.goodreads.com/user/show/2965136-merline-white", "userReview": "Fabulous!"}, {"userName": "Panpanpandy", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/57028624-panpanpandy", "userReview": "As the survivor of an abusive stepdad of my own, this story resonates with me in a way few stories ever have. I originally picked it up used as a teenager, maybe in some vain hope that it would give me some pointers on how to deal with my own abusive stepfather, and it's even more chilling to re-read as an adult, knowing just how normal Simon's actions seemed to me as a child.There are parts of the story that seem a bit far-fetched, yes, but more than anything else, this book reads like an abused child's revenge/survival fantasy. There is a part of me that wholly believes that Kathy Hepinstall either has experience with an abusive adult, or is very close to someone in a similar situation. She does an amazing job of showing Alice's steady loss of faith in her god and her mother, and her decline into helplessness and hopelessness. For someone who has experienced a violent, unpredictable stepdad and a passive mother, this was chillingly familiar.The ending seems a bit rushed, with little more than a list of what happens over a period of time, but it's ultimately quite satisfying. The ending itself is what solidifies my belief in Kathy Hepinstall's experience with abuse; while the story is wonderfully detailed up until that point, painfully familiar to someone with my own background, the \"happily ever after\" sort of ending speaks far more of wish fulfillment than experience.A good read for sure, though."}, {"userName": "Lena", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/57753722-lena", "userReview": "The thing I liked the most was the writing, really different from what I've read so far. The story in itself was interesting and thanks to the said writing I really got caught in the character's point of view, I could read her mind and feel that she felt. The plot twist was an important point for the plot and I think it was well done eventhough, in my opinion, it was quite predictable. I really liked the suspense, the atmosphere was pretty stressful and the characters were perfectly built."}, {"userName": "Jean", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/3245345-jean", "userReview": "I've read historical novels by this author which I liked a lot. I knew this was a coming of age novel when I started it, and I like this genre. It is also a mystery, another favorite genre. However, the premise behind this novel is a bit extreme and an unlikely coincidence is revealed at the end.I'm being generous giving it ***."}, {"userName": "Kay Kay", "userReviewDate": "Dec 27, 2016", "userURL": "http://www.goodreads.com/user/show/7843109-kay-kay", "userReview": "I really liked this book. The characters were interesting and well formed. It moved along at a nice pace, and the story was engaging."}, {"userName": "Simone Jeffrey", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/26266931-simone-jeffrey", "userReview": "Such poetic beauty."}, {"userName": "Anita", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/56529858-anita", "userReview": "This is a weird little book, with weird characters...and I loved it!"}, {"userName": "Marie", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/2487816-marie", "userReview": "Napínavý příběh, tušení neustále přítomného zla, svět viděný očima dítěte, bezmocného vůči zlovůli dospělých. Není to úplně šálek mého čaje, ale napsané velmi dobře."}, {"userName": "Nancy", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/68321233-nancy", "userReview": "The writing is stilted. Conversation is not realistic"}, {"userName": "Karis!!", "userReviewDate": "Sep 30, 2016", "userURL": "http://www.goodreads.com/user/show/59448538-karis", "userReview": "Let me talk about this book.\"In the living room, God's Bible sits open on Simon's chair, where he'd been leafing through it, bloody. This part of Texas can't save us. We eat our chicken.\" - The Absence of Nectar.I devoured this book in a day. The characters are wonderful and well-rounded, the story is so much deeper than you think upon first picking it up, and the setting is perfect. Everything about it pulls you in. Generally, I read fantasy. I've been trying to branch out lately, especially into the Southern Gothic genre, and I am glad I came across this. I now want to read everything Kathy Hepinstall ever wrote. Her writing is beautiful, poetic, and poignant. This book will stick with me for years to come, and I already want to re-read it."}, {"userName": "Christian Engler", "userReviewDate": "Sep 19, 2013", "userURL": "http://www.goodreads.com/user/show/20269800-christian-engler", "userReview": "A multi-layered, rousing novel of suspense that fuses psychological terror and violence with childhood innocence, The Absence of Nectar is a novel that is unified by different literary genres that forms a reading experience that is not simply unique, but also intellectually edifying, entertaining and occasionally corrosively comical. The protagonists - Alice and Boone Fendar - could be an updated Texan verson of Jem and Scout Finch from To Kill a Mockingbird. But their battle is not with the evils of racism and those who are benighted by unbridled hate; it is against an evil of equil horror: Simon Jester, a psychopathic stepfather whose rancorous and injurious deeds knows no bounds. It is the summer, a time of carefree, languorous innocence, a time for swimming, softball, drinking homemade lemonade to gobs of other summer fun - or so one would believe. As life is good for some, it is less so for others, the others being Alice and Boone. The crack-up of their family darts forth when their father abandons them, leaving Meg (the mother) to fend for herself as a beekeeper. But for someone who has consistently been dependent on the economic progression of the husband - the primary bread earner (in this case) - the task of becoming 'career-oriented' or evolving into a 'learned' woman of business, is something less than easy. An emotional struggle ensues within Meg - a battle against depression and all the mental infirmities that commonly strike women who are slowly stripped away of not only their identity and confidence, but most importantly, their perceptions of themselves, their self-worth. She takes drastic suicidal actions to prevent the obvious from occurring. The act fails, but it invokes enough of a scare to keep the family thinly glued together. But it does not last. Hence, things become unhinged, a role inversion happens: Meg becomes vulnerable and dependant while the kids become the caretakers. In order to regain a degree of family normalcy, the kids take their mother to Hollow Cove on Lake Shine, and while there, Meg nearly drowns but is later saved by a stranger who eventually becomes husband #2. As Meg is blind sighted by all that she has endured, she fails to see what is most obvious to her children: Alice, keen in insight, rebellious in manner and Boone, lovingly innocent and somewhat odd, for he has a deep attraction to Persely Snow, a famous teenage murderess with a liking for poisons. The obvious is that Simon Jester has a very questionable past, the death of his wife and 'son.' The latter is a jaw dropping surprise. The Absence of Nectar is quirky, because it encompasses crime, coming-of-age cuteness and hard, trim prose. To relegate it as traditional fiction would be innaccurate, for it is mystery, literature, young adult and contemporary - all nicely knitted together - a coming-of-age novel that is not overly imbued with oozing saccharine hyperbole. Fans of Hepinstall's earlier novel, The House of Gentle Men, will not be disappointed with The Absence of Nectar."}, {"userName": "Jeanette Stingley", "userReviewDate": "Oct 07, 2010", "userURL": "http://www.goodreads.com/user/show/2900499-jeanette-stingley", "userReview": "For those of you who are writers, we all know that you must hook your reader within the first few pages to keep the reader turning those pages. With The Absence of Nectar, Kathy Hepinstall jumps right into the tragic tale of our narrator, Alice. Alice is 12 but is more mature then most her age. The story begins with a scene of abuse from her step-father, Simon.After Alice’s father leaves his family behind for a new woman, her mother, Meg, falls into a terrible depression and leaves Alice and her brother Boone to fend for themselves. Alice prays for a man everyday to come into their lives to make their mother happy again. Meanwhile, Boone becomes obsessed with a teenage girl who manages to constantly escape from juvenile detention center that she has been placed in for poisoning and killing her parents.Simon is extremely abusive to the whole family once he makes his way into their lives. I adore how this story was written even though at times it was frustrating because you wanted to reach into the pages and shake the madness from Meg for allowing things to go on or reach into the pages and strangle Simon yourself! I wasn’t expecting the twist and turns of the plot. Just when you think things can’t get worse, they do. From the start, Alice suspects Simon is trying to poison her and her brother. There are many passages from Alice becoming obsessed with learning of poisons and what symptoms to look for if you are poisoned. Boone tries very hard to see the good in Simon. Boone is always talking of God and how God would want Boone and Alice to love and except Simon.The story is slow to start but once Boone’s letters are answered by Perseley, the escape artist, the story grabs a hold of you and it is hard to put the book down! Normally, I am disappointed with how a story ends. The ending was so so for this. I am glad the story ended the way it did but I was hoping for a little more drama like the rest of the story. Definitely a great book for a lazy weekend read!"}, {"userName": "Gale", "userReviewDate": "Apr 07, 2013", "userURL": "http://www.goodreads.com/user/show/17664194-gale", "userReview": "EVERY BETRAYAL DESERVES A SACRIFICE!Simon Jester is deadly serious about teaching children lessons in loyalty. Wives and pets too. No one is exempt in this dizzying novel of insensate bitterness, in which Hepinstall has created a world devoid of the sweetness of human compassion and divine love. All must sufer, for many sacrifices are expected by a jealous man who sees monsters in still waters--whose lurking insanity reaches out with a ripple effect to touch all within his sphere of hatred. Why does no adult realize that a bizzare tempest is brewing in Meg's house? What kind of community forces its children to fight battles for their very survivial, completely on their own? Is the sweltering, shimmering heat of Texas vaguely responsible for this microcosm of humanity gone amock? Meg's bees are not the only ones who require nectar; she herself is emotionally dying after her husband leaves her. But her children, 11-year-old Alice and 13-year-old Boone, are suspicious of their stepfather. Narrated by the cynical sister, this book focuses on the activities and terror of these youngsters over a year--a story about kids but written for adults. It is a tale of distorted and tested faith: Alice sacrifices her possessions to a do-nothing god in the bush, while Boone steadfastly believes in the hope of a forgiving God. Their mother naively trusts in men, while Simon believes only in his personal avenging power. Unfortunately these fatherless kids serve as catalysts for mayhem; each is privately drawn to freaks of society. Despite the weird family next door, the greatest menace to Meg's home is the monster she invited into their lives. Drowning in Simon's tyranny the family struggles to recognize the truth of their situation, but who will ultimately save the children? Expect swirling tensions as this book hooks you from the first page.  (April 11, 2012.)"}, {"userName": "Robert Beveridge", "userReviewDate": "Mar 07, 2012", "userURL": "http://www.goodreads.com/user/show/766524-robert-beveridge", "userReview": "Hepinstall returns with her second novel, and what a twisted one it is. Part coming-of-age novel, part crazy-preacher novel, part slice-of-life novel (but a slice of the kind of life one finds in, say, Joyce Carol Oates’ more depraved characters), and all charming, in the same sort of way Ted Bundy is said to have been charming.The plot is pretty straightforward (girl finds evidence that her stepfather is trying to kill her), the pace is adequate, the pages turn themselves with relative ease, and Hepinstall keeps us interested enough; all this would make for an average mystery/thriller in most circumstances, but Hepinstall pulls herself one step above by creating characters more memorable than most. The family from The Hills Have Eyes adopted a few characters from Steve Aylett’s Bigot Hall (with a dash of Stewart Home’s Come Before Christ and Murder Love for good measure) and stopped by Twin Peaks on their way to Kathy Hepinstall’s pen. Among the menagerie to be found within these pages are a brain-damaged dog who spends his days carrying a live toad around in his mouth, a pair of five-year-old twins who are both destined for the Serial Killer Hall of Fame, a teenager confined in a mental ward whose hobby is escaping, and the aforementioned crazy preacher. Set beside them, our narrator, a precocious eleven-year-old with an encyclopedic knowledge of poisons, seems normal.This is wonderfully fun stuff. Quite highly recommended for those who don’t mind their laughter with a deeply disturbing tinge to it. ****"}, {"userName": "Robert Beveridge", "userReviewDate": "Jan 25, 2008", "userURL": "http://www.goodreads.com/user/show/766524-robert-beveridge", "userReview": "Hepinstall returns with her second novel, and what a twisted one it is. Part coming-of-age novel, part crazy-preacher novel, part slice-of-life novel (but a slice of the kind of life one finds in, say, Joyce Carol Oates' more depraved characters), and all charming, in the same sort of way Ted Bundy is said to have been charming.The plot is pretty straightforward (girl finds evidence that her stepfather is trying to kill her), the pace is adequate, the pages turn themselves with relative ease, and Hepinstall keeps us interested enough; all this would make for an average mystery/thriller in most circumstances, but Hepinstall pulls herself one step above by creating characters more memorable than most. The family from The Hills Have Eyes adopted a few characters from Steve Aylett's Bigot Hall (with a dash of Stewart Home's _Come Before Christ and Murder Love_ for good measure)* and stopped by Twin Peaks on their way to Kathy Hepinstall's pen. Among the menagerie to be found within these pages are a brain-damaged dog who spends his days carrying a live toad around in his mouth, a pair of five-year-old twins who are both destined for the Serial Killer Hall of Fame, a teenager confined in a mental ward whose hobby is escaping, and the aforementioned crazy preacher. Set beside them, our narrator, a precocious eleven-year-old with an encyclopedic knowledge of poisons, seems normal.This is wonderfully fun stuff. Quite highly recommended for those who don't mind their laughter with a deeply disturbing tinge to it."}, {"userName": "Mimi", "userReviewDate": "Mar 03, 2010", "userURL": "http://www.goodreads.com/user/show/2690037-mimi", "userReview": "This book was a fun, albeit slightly predictable, 1-day thriller. For this I was truly grateful after being so disappointed in Mary Higgins Clark's recent fiction (I used to count on her for a good, fast read!). Kathy Hepinstall is a talented writer whose ability to use her prose to create a suspenseful tale kept me intrigued from beginning to end.This first person narrative is \"told\" by Alice, an 11-year-old girl who has not only had to deal with her real father's abandonment but also a stepfather intent on draining all \"nectar\" (sweetness/joy) from her life. Simon Jester is a possessive psychotic who demands the loyalty of his new wife, Meg, even if it means sacrificing her own children. Nobody wants to believe Alice when she says that Simon is trying to poison both herself and her brother Boone and it isn't until her mother, Meg, sneaks into their room one night and whispers \"RUN\", that they finally decide to take things into their own hands and run away. The engrossing tale surrounding their escape introduced some fascinating characters, although the conclusions reached were not entirely surprising - I was able to figure out much of it ahead of time.Despite the predictability of plot, I still found this excitingly well-written and I hope to read \"The House of Gentle Men\" and \"Prince of Lost Places\". I'll have to remember those next time I spend a day at the beach or on an airplane!"}, {"userName": "Nadine", "userReviewDate": "Feb 28, 2011", "userURL": "http://www.goodreads.com/user/show/3603663-nadine", "userReview": "Ein wichtiges Kriterium eines Buches hat \"Ein Hauch von Bittermandel\" auf jeden Fall erfüllt: Ich habe es verschlungen. Trotzdem nur 2 Sterne...Das Buch fängt extrem spannend an, mit zwei Kindern, die fürchten, vom Stiefvater vergiftet zu weren, und sich per Zeichen wie Blinzeln verständigen, ob er zum Beispiel mit dem Reis unbeaufsichtigt war. Wunderbar und schrecklich zugleich auch der Moment, wo sie die Körperfunktionen kontrollieren und im Geiste die Symptome möglicher Gifte durchgehen.Ich war begeistert, wie spannend das Buch beginnt und sofort gefangen. Dann aber folgt eine etwa 200 seitige Rückblende, wie es zu der Situation gekommen ist, dass die beiden um ihr Leben fürchten müssen.Das Buch ist sehr vorhersagbar (auch wenn man natürlich während des Lesens noch hofft, es ist doch nicht alles so wie es scheint). Der große Clou kommt zwar, ist aber nun wirklich keine Überraschung, da es einfach zu viele HInweise gab.Ich bereue zwar nicht, das Buch gelesen zu haben, aber kann es nicht weiter empfehlen."}, {"userName": "Eric Hall", "userReviewDate": "Mar 24, 2010", "userURL": "http://www.goodreads.com/user/show/3489125-eric-hall", "userReview": "Yes, if you've read my other reviews of her books, this is basically the same. You'll like the story, you'll love reading the words. I'm mostly a fantasy novel fan. But, I recognize good writing when I see it. Kathy is a joy to read and I'll pick up her next book when it comes out. Very well written book. The characters are fun, the conflict is entertaining, and the story is very well told.Kathy has a way with words. She's a throwback to times when well written books also meant that the language used was musical, almost like coherent poetry. That's how Kathy writes; it's a trait you will find in all her books. Kathy has a gift for immersing the reader in vivid imagery. She blends the environment into her stories in such a way as to add color and substance to the environment enhancing the story. So many writers detract from the story by trying to describe the glorious landscape or the fetid living conditions. Kathy is one of the only authors that I have read that really gets it right."}, {"userName": "Loraine", "userReviewDate": "Feb 02, 2013", "userURL": "http://www.goodreads.com/user/show/3262240-loraine", "userReview": "Way too much swearing in my humble opinion. I know it happens. A lot. In the real world, but why bring it out again and again when it truly is not necessary? No, not even for emphasis in literature, to make the bad guy seem really, truly bad. I honestly don't think we need to hear (or read) those offensive horrible words to intimate that someone is really, truly a bad guy. Any more than we have to get graphic for any type of murder, violence, or sexual scenes to get the point across.Otherwise, it was a tragic story. I would have definitely given it a much higher mark, but for the unnecessary swearing. The referrals to abuse were not graphic, although it could have been so. Why the author decided to refrain from making the abuse and violence non-graphic, but throw in all the swearing, I couldn't say. Unfortunately for her, she made a mistake in my opinion.Good story, good writing, EXCEPT for the foul language. So, if you choose to read (or listen), be warned."}, {"userName": "Sarah", "userReviewDate": "Apr 13, 2012", "userURL": "http://www.goodreads.com/user/show/4961341-sarah", "userReview": "I read this book cover to cover in one sitting all in a hospital emergency room and I absolutely loved it. I was captivated by the writing – which was so well done, and the suspense of the book just thrilled me and then had me turning each page with anticipation. I didn't predict the end of the book, there is one huge coincidence and that is pretty unlikely, but the overall story is so powerfully believable that I was able to take it in stride.the characterizations were great – the story was very suspenseful, as I said. The main character is a precocious and likable little girl, the villain, her stepfather, is truly evil – I couldn't understand the brothers attachment to the teenager who poison her parents until the end. The characters were flawed but were extremely believable and I love the book from beginning to end. I will definitely be reading more by this author."}, {"userName": "Michael Sump", "userReviewDate": "Sep 07, 2013", "userURL": "http://www.goodreads.com/user/show/3050876-michael-sump", "userReview": "An old friend of mine, Liz Natale, once told me that she was too old to read “bad books.” This is a wise philosophy at 80 or at 8. Suzanne and I violated this wisdom by completing the audio book, long after we knew that it was not worth our time. This book has a decent premise but somehow never met the promise of its outline. There are definite good guys and bad guys and guys who could go either way in this novel but--by by the time you're half way through it—you don't care which ones die and which ones live. You just want something to happen. Eventually, the novel limped to a close. A wiser man would have abandoned the quest long before getting that far. My only confusion about this review was whether to rate it a “2” or a “1” but there can only be one ranking for a book this bad."}, {"userName": "Audrey", "userReviewDate": "Mar 14, 2014", "userURL": "http://www.goodreads.com/user/show/202754-audrey", "userReview": "This was a very good book it was suspenseful and the characters seemed very real and true to life. The main story involves an evil step father, a passive, somewhat clueless mother and two young siblings that try to survive in the mess their life has become in just one summer.At the center of their story is young girl, she's on the run from the mental institution she has been held in for killing her parents. Her life and the lives of the two teenage main characters intermingle to create a lot of tension and eventually they learn to depend of each other to survive the summer.This book takes on a lot of issues, abuse, runaways, the belief in God, adults not listening or really paying attention to children, parents turning their back on their children and children having to grow up and make decisions far to soon.This was a pretty quick read and difficult to put down."}, {"userName": "Patricia Baker", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/11220424-patricia-baker", "userReview": "loved this book. chosen by my book group for the monthly selection. have never read this author before, but will look for her other title. Alice is an in-your-face eleven year old who does not like her stepfather and tried to live in the same house with the possibility of being poisoned by him. Simon, the evil stepfather, enters the picture as a savior of a drowning mother and uses the guise of godliness to firm his place in the family. the mother, Meg, is a soft hearted backboneless woman who needs that man in her life. she has little actual mothering in her daily life. Boone, the older brother brother, is in love with the ever escaping family poisoner. somehow all characters come together. good read"}, {"userName": "Claire Grasse", "userReviewDate": "May 03, 2012", "userURL": "http://www.goodreads.com/user/show/2177985-claire-grasse", "userReview": "The mark of a good book, in my opinion, is if something startles me into looking up and when I do, I can't remember where I am or how I got there. Kathy Hepinstall weaves words that way, like a spell. Her characters never stagnate, never fall flat. The sense of doom in their lives builds relentlessly from the first glimpse of the dead bees on page three until the climax. And she ends with hope, which is vital to me, as a reader.It's not often you find flawless characterization, lyrical setting descriptions, AND a compelling plot under the same roof (or... hardcover), but this author pulls it off beautifully."}], "description": "If only Alice could get rid of her new stepfather, Simon Jester. No one wants to believe that the pieces of his tragic past don't seem to fit-or that he is trying to poison Alice and her older brother. Until the one night her mother comes in to kiss her goodnight and instead whispers a single word...\"RUN.\"", "title": "The Absence of Nectar", "url": "http://www.goodreads.com/book/show/614064.The_Absence_of_Nectar", "average": 3.86, "cover": "https://images.gr-assets.com/books/1309212399l/614064.jpg", "reviews": 93, "authors": [{"url": "https://www.goodreads.com/author/show/61173.Kathy_Hepinstall", "name": "Kathy Hepinstall"}], "type": ["Fiction", "Mystery", "Suspense", "Adult"], "outlinks": ["http://www.goodreads.com/book/show/614064.The_Absence_of_Nectar", "http://www.goodreads.com/book/show/865881.The_Absence_of_Nectar", "http://www.goodreads.com/book/show/15780275-un-t-sans-miel", "http://www.goodreads.com/book/show/614066.Ein_Hauch_von_Bittermandel", "http://www.goodreads.com/book/show/12331596-blue-asylum", "http://www.goodreads.com/book/show/30763908-the-book-of-polly", "http://www.goodreads.com/book/show/22749804-sisters-of-shiloh", "http://www.goodreads.com/book/show/106670.The_House_of_Gentle_Men", "http://www.goodreads.com/book/show/430917.Prince_of_Lost_Places", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}