{"ratings": 898, "userreviews": [{"userName": "Erika", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/23743588-erika", "userReview": "I'm reading every Pulitzer Prize winning novel, in order, and reached 1924's The Able McLaughlins. With a deep breath, and gritted teeth, I started a book I'd never heard of, that I was sure I wouldn't like. I thought the title was stupid and the plot didn't interest me.But, as it turned out, I judged The Able McLaughlins too fast.The novel takes place in a midwestern Scottish farming community during the 1860s. The McLaughlin family's oldest son Wully has just returned from the Civil War ready to marry his sweetheart Chirstie McNair. But for some reason, she won't talk to him, and, worse yet, she won't tell him why. Wully is hurt and confused until he finds out the cause of her rejection and the terrible secret she’s been harboring. The rest of the novel is about the effect Chirstie's secret has not only on her and Wully, but on the entire community.This is a simple, highly accessible novel. Some have called it melodramatic, and I get that, but for me, the word \"sentimental\" does a better job of describing it. Wilson's depiction of life on the prairie owes a lot to Willa Cather, and while the characters aren't nearly as complex and interesting as those seen in Cather's work, Wilson clearly loves them, and does a great job celebrating the simple life they lead.Ultimately, this is a book in praise of everything good that humanity has to offer. The last 30 pages had me riveted and I wasn't sure how Wilson was going to end it, but she clearly comes down on the side of generosity and grace in a way that feels truly life affirming.There are no complicated metaphors here, no symbolism, no subtlety. Yet this small, sweet story still has a lot to offer."}, {"userName": "Roxanne Russell", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/12406850-roxanne-russell", "userReview": "This book won the Pulitzer Prize in 1924, but is about a Scottish community in the Midwest in the 1870's. Though Wilson's flowery prose made me lose interest at times, I loved how she lingered sentimentally over all of her characters. And how she interspersed glimpses of the future into the story. She handles a horrific and tragic prairie rape with unflinching attention to the emotions of all who are touched by it. And presents a complete portrait of this community and its culture. I really loved this book."}, {"userName": "Mimi Stamper", "userReviewDate": "Jan 14, 2011", "userURL": "http://www.goodreads.com/user/show/3050672-mimi-stamper", "userReview": "I loved this book. The writing was a bit archaic and full of Scottish dialect, but once you got past that, it was beautiful. The story follows a group of families from Scotland who settled the American prairies in the 1860s. The heartache of ten kids in a one-room cabin and endless days of back-breaking labor are offset by the beauty of the prairies and the love the families share and the joy of freedom and possibility. Hard as it was, the freedom of this country and the ability to own land made this the promised land. There is a love story at the heart of the book, but my favorite passage involved a prairie woman who passed on cuttings from her peonies. They had been carried by her on the wagons from back East, and by her mother before her, and by her grandmother before. Lonely women carrying a bit of color close to their hearts into this foreign land; she held it high as they crossed an unbridged river so it wouldn't get wet. They had to leave their trunks and all household goods behind, but she held onto her peony. What a beautiful story of strong women."}, {"userName": "Steven", "userReviewDate": "Apr 07, 2010", "userURL": "http://www.goodreads.com/user/show/3504578-steven", "userReview": "This book has great characters and great descriptions of the setting of the novel. I love the opening sentence of the book. The book is set in Iowa during pioneer days and gives a good view of what life was like at that time. A refreshing read as it is devoid of edgy elements that writers seem to think must be included in today's novels."}, {"userName": "Irene", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/1887310-irene", "userReview": "Although I enjoyed this short novel, it did not seem like the type of book that would be awarded a Pulitzer. It certainly illustrates how our taste in literary fiction has changed over the past century. This is the story of a young soldier who returns to his Iowa farming family and the girl he loves. I appreciated how far ahead of its time it seemed to be in describing a family responding to a victim of rape. There was the hint of the morality tale in the portrayal of characters and the novel’s resolution. Hard work and decency are rewarded in the end while cruelty and laziness are punished by forces beyond human justice. I was disappointed that the author did not capture the Scottish dialect. At one point, a younger brother being educated in Chicago criticizes the family for a speech that is neither English nor Scottish. But, the dialogue only contains smatterings of phrases such as “wee one” or “lass”. 3.5 stars"}, {"userName": "Jessica", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/40514068-jessica", "userReview": "I'm reading my way through the Pulitzers  - and my guess is most people who have read this book are undertaking the same project as me. I have a few bones to pick with Margaret Wilson. First, I do not understand her decision to sneak in references to future events at completely random moments. For example: \"What he saw there made so great an impression on him, that fifty-seven years later, when that stranger’s grandson was one of the disheartened veterans of the World War who came to his office looking for work…\"There were so many of these future references peppered in at the most inane times, it seemed like Wilson was substituting glimpses into the future for adjectives. I read that there was actually a sequel written to this book called The Law and the McLaughlins, but from what I can tell on Wikipedia, it doesn’t actually address any of the little insights into the future that Wilson peppered into this story.Second, this story was summarized as a “love story between Chirstie and Wully” but there was no palpable chemistry between the two. Chirstie didn’t have much of a personality beyond vulnerable and scared, and neither of these characters had much depth. The wooing of Chirstie seemed more like Wully forcing himself onto her because he fantasized about her the entire time he was in the Army. The fact that Chirstie ultimately accepts has more to do with her own personal circumstances and not at all due to reciprocating Wully’s feelings.My favorite character was Barbara McNair, whose relationship with Chirstie’s father served as a nice foil to the troubles of Wully & Chirstie. Barbara comes to Iowa thinking that Chirstie’s father is a large, wealthy property owner (which he is, but only because he’s able to buy land by saving money on everything else). She is a kindhearted, generous, and independently wealthy woman, which is my favorite kind of woman!However, although the main characters were a little lacking, I thought Wilson did a really good job of creating a Scottish community in the 1860s (although I’m not an expert.) From the farming process, to how close and gossipy the locals are, to the social dynamics at church and in town, I was enamored with the atmosphere, if not the plot. In this way, this book reminded me of Booth Tarkington’s The Magnificent Ambersons, which I recommended reading for the wit, and not the characters or plot. However, if you’re not trying to read all of the Pulitzer winners, I would say you could skip this book altogether."}, {"userName": "Melissa (ladybug)", "userReviewDate": "Nov 15, 2011", "userURL": "http://www.goodreads.com/user/show/2494726-melissa-ladybug", "userReview": "I loved this book. I started to read it and found myself having a hard time putting it down. It was really descriptive of what the Civil War and the aftermath for one family was like. I liked the fact that Wully didn't let what happened to Christie stop him from loving, marrying and caring for her and her son. Wully tried his hardest to care for her and I believe he was successful in the end."}, {"userName": "Zorro", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/5141125-zorro", "userReview": "1924.....Hmmm. Virginia Woolf was writing at this time. Americans Fitzgerald,Hemmingway, Faulkner hmmmm....and this was the best the US could choose??? Sweet story."}, {"userName": "Manda", "userReviewDate": "Jan 09, 2015", "userURL": "http://www.goodreads.com/user/show/21443134-manda", "userReview": "Nomadic SA Chick's Book ReviewsSummaryWully is in love with Christie, but doesn't realize it he's about tp return to the fight in the Civil War. Wully promises Christie that as soon as he returns they will get married and start their lives together. Christie is excited about her future. Though her father is recently deceased, and her mother is severely depressed, Christie carries on with her days, caring for her younger siblings, and waiting for Wully's return. Wully is shocked he he comes home to find that Christie is not the sweet loving girl he left behind. She's not scared and pregnant with another man's child. This does not matter to Wully, he loves Christie unconditionally, and follows through with his promise, even if it means taking credit for Christie's baby and shaming his family's name.ReviewI had to talk myself into picking this book up. I made the mistake of reading reviews before had and saw so much hate for this book. I was dreading what was between the covers. I am so happy the dread was pointless. I loved this book. Wilson decorates the pages with beautiful and heart-felt prose that make your heart ache for Christie and fall in love with Wully for being such a good human. Growing up in Iowa and spending a lot of time in small towns, I can tell you that this is still very reflective of life there. Neighbors know each other, care about one another, and community actually means something. So does someone's family name and reputation; these things are more important than your credit score. Much like Wilson's Iowa town, small town Iowans look out for one another.Ratings (based on a 10 point scale)Quality of Writing - 8Pace - 6Plot Development - 7Characters - 8Enjoyability - 9Insightfulness - 6Ease of Reading - 7Photos/Illustrations - N/AOverall Rating - 5 out of 5 stars"}, {"userName": "Jimmy", "userReviewDate": "Jul 25, 2014", "userURL": "http://www.goodreads.com/user/show/11270481-jimmy", "userReview": "While I would say that this Pulitzer winner is mediocre writing, I can also say that I liked the story. It's one of those rather idyllic prairie/frontier immigrant farming stories that seemed to have captivated so many writers of the 1920s and 30s, albeit a story centered around a really tragic event. Reminded me of Willa Cather's \"My Antonia\" and Edna Ferber's \"So Big,\" among others. What I'm really appreciating about my project of reading all the Pulitzer fiction winners is that I'm getting an interesting view of what stories resonated in the American consciousness at certain times in the history of fiction writing over the past 100 years. There are definite patterns and trends. And I'm also able to observe lots of snapshots of life that show how things were so vastly different in the various regions of the country when communication between them was nearly non-existent. Life was so parochial and provincial. And this novel paints a portrait of life in 1860s Iowa for Scottish immigrants that is just so removed from life in 1860s Georgia (Mitchell's \"Gone With the Wind\") or 1860s Alabama (Stribling's \"The Store\") or 1870s high society New York City (Wharton's \"Age of Innocence\"). Anyway, this novel is a part of that body of literature that contributes to these parochial snapshots of mid-19th century life in the US. That's what makes it valuable to me, though the writing isn't great."}, {"userName": "Dusty", "userReviewDate": "Aug 31, 2016", "userURL": "http://www.goodreads.com/user/show/655483-dusty", "userReview": "The easiest way to summarize this likeable melodrama would be to focus on the male protagonist, Wully McLaughlin. The oldest boy in a family fairly recently immigrated from Scotland to Iowa, Wully is a reluctant Union soldier who comes home after the war's end, discovers the sweetheart he had been dreaming of marrying has been raped by another man (Wully's cousin), and then begins a family with this dark cloud of sexual abuse behind him. However, I think a better summary would focus on the older women who weave in and out of Wully's life and are, without a doubt, the most richly drawn personages. Wully's mother, Isobel, who loves her son a little more forwardly than an outside observer might think appropriate, is the real star of the book, and Wully's stepmother-in-law, Barbara, executes a fabulously entertaining feminist rebellion against her good-for-nothing country husband. Wilson excels at infusing her story of rural Iowa in the late 1860s with regionalist charm, but her aim exceeds her grasp. She seems to want to draw some kind of link between this story of the sprawling McLaughlin clan in the 1870s and the world she herself knows in the early 1920s, but this is only suggested in odd paragraphs that interrupt the first few chapters and discuss a future relationship between one of Wully's brothers (Andrew) and the heirs of the man who drives Wully home during his leave from the war. Maybe this is cleared up in the sequel?"}, {"userName": "Joyce Lagow", "userReviewDate": "Apr 20, 2010", "userURL": "http://www.goodreads.com/user/show/2220862-joyce-lagow", "userReview": "Pulitzer Prize winner for 1924.[return][return]The story of a Scottish community in Iowa, it is mainly the story of Wullie and Chirstie, two young people who fall in love and get married\u0014 but not before Chirstie suffers a scarring experience that affects her marriage.[return][return]It\u0019 s a simple story and it\u0019 s told in simple prose. I\u0019 ve read reviews that compare Wilson to Cather, but as far as I am concerned, Cather\u0019 s prose is far more sophisticated and flows more easily. Still, Wilson tells her story of the Scottish community with great effect. Her dialogue feels authentic and the characters, while uncomplicated, are warmly drawn.[return][return]While the story is ostensibly about Wullie and Chirstie, Wullie\u0019 s mother Isobel is a powerful figure\u0014 a tower of strength with a vast capacity for compassion.[return][return]The resolution of the story is the weakest part, but it still leaves the reader more or less satisfied with its resonance to Wullie\u0019 s experiences during the Civil War.[return][return]A good book that illuminates the lives of hard-working Scots immigrant farmers in the 19th century."}, {"userName": "Linda", "userReviewDate": "Jan 03, 2008", "userURL": "http://www.goodreads.com/user/show/730108-linda", "userReview": "I love reading Pulitzer Prize winners for what they reveal about what was on the United States' mind, so to speak. Especially because they often seem to be set in the past, and it can be very interesting to see what the past (in this case, 1924) thought about the past past (in this case, prairie life around the end of the Civil War). This book is a simple story, simply told, with a surprisingly thoughtful ending and a bit of an interesting glimpse into the frontier prairie life. It has an old-fashioned feel to its phrasing and isn't particularly literary or heavy; it goes quickly and draws you into the life of the two-main-characters couple. It is sufficiently interesting about the Scottish immigrant community in which this couple dwells, but more interesting for its moral statement on human character and rising to the occasion."}, {"userName": "Katherine", "userReviewDate": "Jun 08, 2012", "userURL": "http://www.goodreads.com/user/show/2837258-katherine", "userReview": "I wanted to like this book, I tried, I really did. After seeking out and purchasing a rather pricey used copy (because not a single edition was to be found within my entire inter-library loan system) it only made sense to give it every opportunity to prove itself. Sadly, it turned out to be a disappointment. The writing was so awkward and choppy and the characters acted inconsistently enough that I found it difficult to conceive how it won the 1924 Pulitzer for fiction. What is perfectly clear, however, is why it has now sunk into obscurity. If you have an opportunity to read it and don't mind spending your time on a mildly interesting story and mediocre writing it's possible it might be worth the effort but I'd avoid going to a lot of trouble to put your hands on it."}, {"userName": "Sbussey", "userReviewDate": "May 22, 2016", "userURL": "http://www.goodreads.com/user/show/1261950-sbussey", "userReview": "From 1915, the account of a Scottish immigrant family settling in Iowa when it was still the frontier. Not sure why I never heard of this book or this author, but I thought this was surprising. It was easy to read, had strong characters (especially strong female characters, for the time period), represents a historical moment. It might not be strong on lists because it is more realist/naturalist, when the novel form is shifting to modernism. But I would gladly assign this over \"The Octopus\" or any Steinbeck..."}, {"userName": "Diego", "userReviewDate": "May 26, 2016", "userURL": "http://www.goodreads.com/user/show/56235381-diego", "userReview": "The characters are lovable, funny, and enduring. The book is a drama - a young man promptly marries his pregnant sweetheart (there's more to it) to save her from the shame of a shotgun wedding and spare her from the scorn of her neighbors - but the focus is much more centered on this community of immigrants, their mannerisms, and how they all get along. It’s the relationships of the people involved that bring this story to life and give it its sharp comic edge. I enjoyed it very much."}, {"userName": "Christine", "userReviewDate": "Aug 11, 2011", "userURL": "http://www.goodreads.com/user/show/5991102-christine", "userReview": "A nice gentle story about a man returning to his family after the Civil War that won the Pulitzer Prize in 1924. Not a heavy book, like many Pulitzer novels are... more like Little House on the Prairie for grownups. Enjoyable if you can find it, but the book is scarce. I couldn't even find a copy at Powell's, wound up borrowing it from the library."}, {"userName": "Katie", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/927789-katie", "userReview": "I may be weird, but I loved this book!! It was definitely a different kind of writing style than we are used to, but kind of reminded me of Conrad Richter (who I happen to really like!). I thought that Wully and Cristie learned and grew so much together as they were married and I loved how they changed by the end of the story. And the mother-in-law figure is sooo fantastic. loved it!"}, {"userName": "Carolyn", "userReviewDate": "Feb 14, 2012", "userURL": "http://www.goodreads.com/user/show/1176701-carolyn", "userReview": "A great story! I love when good conquers evil and when love conquers all! Great characters!"}, {"userName": "Philip", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/11900636-philip", "userReview": "I can see how this book would have won the Pulitzer Prize. The craftsmanship of the writing is simple but beautiful in its simplicity. The story is about chain migration of the Scots to Iowa from 1840-1865 and the difficulties of prairie life. The resolution of the plot would be unacceptable by today's standards. The main character had married a woman who had suffered her cousin raping her. The marriage was done quickly because he wanted people to think that the child, the product of the rape, was his child. People were scandalized, but he preferred they think poorly of him rather than the innocent child. One should note that the audience is never told that she was raped, but the animal terror exhibited when the rapist returns provides the evidence. The book ends with the woman unable to look at or stand the presence of her rapist, but her husband decides that the man should be forgiven because the main character had the joy of his wife's and child's love. Literally, he forgives the rapist in his heart, and the author writes, \"The End\". Clearly, the woman should have been the focus of the story and her path to forgiveness or refusal. So, what Margaret Wilson viewed as the power structure in 1924 has changed greatly by 2018. Read this as a sociological study of the attitudes of Americans in the 1920's toward sexuality and secularism, but don't be shocked by the ending!"}, {"userName": "Kevin Courter", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/54021772-kevin-courter", "userReview": "Had it not been for reading through Pulitzer Prize winners, I’m sure I would have missed this one. The story is simple and unrushed. Set in the Midwest just as the Civil War is ending, the novel introduces a community of Scottish Presbyterian farmers through the eyes of a stranger: a soldier who has accompanied Wully McLaughlin back from the War. In the course of reestablishing himself in his hometown, Wully meets an old childhood acquaintance, Chirstie, and falls in love. On the day he decides to propose, her demeanor changes and she wants nothing to do with him. The rest of the story focusses on Wully’s reaction when he discovers the problem - from his willingness to sacrifice his own reputation for that of the woman he loves to his struggles with the temptation to take the ultimate vengeance."}, {"userName": "George", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/10168276-george", "userReview": "A very enjoyable, easy read about two young people, Wullie and Chirstie, who fall in love. Set in the 1860s in a Scottish community in Iowa, Wullie comes back from the civil war to find Chirstie has been raped and is pregnant. He decides to marry her, claiming the baby as his own and keeping Chirstie's rape a secret. The novel provides good descriptions of the hard working and harsh life of the Scots immigrant farmers. I liked Chirstie's step mother, Barbara McNair, enjoying her battle with her husband to have a house built that was a little better than Wullie's house! This book won the 1924 Pulitzer Prize. It's a sweet story with likeable characters and an interesting plot. It's a well told, simply written, entertaining story."}, {"userName": "Claire Osgood", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/14877074-claire-osgood", "userReview": "As this was a Pulitzer Prize winning novel in 1924, I believed it would be a quality read, if somewhat tame by today's standards. The historical background of Civil War times in the Midwest was interesting, The viewpoints of the immigrant settlers of this previously unfarmed land were of particular interest to me. The day to day life of a Union soldier returning to his family of origin was depicted in this novel published around 60 years after the end of this bloody war. The power of forgiveness was an essential element of the author's motivation in writing this book about such a harrowing time in the US. It did not seem to matter if the situation was on the battlefield or on the homefront."}, {"userName": "Jerry Pogan", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/59682834-jerry-pogan", "userReview": "Well written for the most part. The first page verged on poetic verse and I was hoping that this would continue throughout the book but it was fairly inconsistent after that, which was disappointing. The story is about a Civil War soldier returning to find his girlfriend is pregnant by another man and so he marries her to protect her dignity and all of the drama that follows."}, {"userName": "Judy", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/1824927-judy", "userReview": "A Pulitzer Prize winner for 1924. Excellent for its writing, for description of the unbroken plains and of the people who emigrated from Scotland to settle here. The plot is an unusual love story, but also a story of forgiveness. It is a glimpse of a thriving plains family and community at the turn of the 20th century."}, {"userName": "Krystina Thiel", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/31552785-krystina-thiel", "userReview": "The Able McLaughlins by Margaret Wilson, is yet another great read from my journey through all the Pulitzer Prize winning novels. I loved Wilson’s descriptive writing and intimate portrayal of the characters. The end of the novel is especially gripping, as the main characters struggle with forgiveness and redemption."}, {"userName": "Richard", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/38502415-richard", "userReview": "Pultizer winner from the 1920's which characterizes well but dwells on harsh and tedious episodes in this family's life, which of course is harsh and tedious. Would have liked more depth, less repetition."}, {"userName": "Katrina", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/22135060-katrina", "userReview": "3.5 starts"}, {"userName": "Eleanor Ruffes", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/50840336-eleanor-ruffes", "userReview": "Loved this quick read. True love. Family scandal. Scottish clan in America."}, {"userName": "Raoul", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/5467506-raoul", "userReview": "A nice easy read with interesting characters, setting, and plot. It appears to give a good historical setting to the post civil war era in the \"wilderness\" of western Iowa."}], "description": "This neglected novel tells the story of Wully McLaughlin coming home from the Civil War to find his sweetheart pregnant with another man’s child.", "title": "The Able McLaughlins", "url": "https://www.goodreads.com/book/show/542883.The_Able_McLaughlins", "average": 3.64, "cover": "https://images.gr-assets.com/books/1347800994l/542883.jpg", "reviews": 70, "authors": [{"url": "https://www.goodreads.com/author/show/298677.Margaret_Wilson", "name": "Margaret Wilson"}], "type": ["Fiction"], "outlinks": ["http://www.goodreads.com/book/show/542883.The_Able_McLaughlins", "http://www.goodreads.com/book/show/40028242-the-amazing-secrets-of-vinegar", "http://www.goodreads.com/book/show/6713471-daughters-of-india", "http://www.goodreads.com/book/show/25274897-the-struggle-for-sovereignty", "http://www.goodreads.com/book/show/10113784-the-valiant-wife", "http://www.goodreads.com/book/show/40060992-the-only-meditation-book-you-ll-ever-need", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}