{"ratings": 201045, "userreviews": [{"userName": "Robin Hobb", "userReviewDate": "Feb 24, 2013", "userURL": "http://www.goodreads.com/user/show/17730703-robin-hobb", "userReview": "Nothing compares to the original. If you really want to know Holmes and Watson, this is what you read. The characterization and pacing is, for me, delightful. The insights into a London of trains and mail more than once a day, the manners of the time, the dialogue . . . this is a feast.Very honestly speaking, none of the movie or television adaptations have ever given me the sensation of 'being there' at Baker Street, with Holmes and Watson, that I get from the original stories.Read them. You owe it to yourself!"}, {"userName": "Trevor", "userReviewDate": "Dec 09, 2008", "userURL": "http://www.goodreads.com/user/show/175635-trevor", "userReview": "I’ve been listening to Sherlock Holmes stories in the car and think I’m going to go through and listen to all of them now. I’ve started with The Adventures and have enjoyed it immensely. There must have been any number of psychological studies performed on Mr Holmes. There is, of course, that wonderful line by Borges in his lectures on Verse in which he says that he believes in the Character of Sherlock Holmes without actually believing in any of the stories in which that character appears. That is such a clever thing to say and I think it is also remarkably true. Although, as with most other true things, I never seem to have too much trouble ‘believing’ in the stories as they are being told. If I was doing a psychological analysis of Mr Holmes (something, obviously, I’m grossly underqualified to perform – but I feel quite safe, given he never actually existed and even if he did he would be well dead by now and so would be quite unlikely to be adversely affected by any nonsense I might come up with) it would probably have a lot to say about the beginnings of these stories. There is a bit of a pattern to how these stories start. Either a client or, all too often, Dr Watson is presented to Holmes and he makes some remarkable logical deduction about these invariably astonished characters from a seemingly insignificant detail he notices via an article of clothing or their hat.What I find so psychologically interesting about him doing this at the start of each story is that I can’t help but feel he does this to present himself as the intellectual superior to those around him. The relationship between Watson and Holmes really isn’t the same as that between Boswell and Johnson, despite the constant reference to the similarities. Watson may be the dutifully biographer, but his role is also that of the slightly foolish, but endlessly appreciative audience. It is as if it is only through his reactions that we learn when to gasp and when to applaud with awesome wonder. Watson is the laughing track of his day. But Holmes repeatedly asserting his intellectual superiority at the beginning of each story is fascinating as it also hints at insecurities in his character. He requires reassurance. He is a flawed character, our Holmes. Rational, empirical but also all too often only interested in ‘people’ for the complex ‘cases’ they present him with. There is also the problem of his drug addiction which he invariably turns to out of sheer boredom - and invariably that is intellectual boredom. I can’t begin to tell you how surprised I was to find that Doyle was a spiritualist. It is something I found myself remembering as Holmes performs his tricks. Because there is something terribly similar about the tricks Holmes performs and the ‘cold reading’ performed by a spiritualist. His ‘explaining’ often results in his audience saying something like – now it is explained I can see how easy it all is, which then has Holmes complaining he should keep his methods to himself. Except I think there is a deeper significance to him doing these performances – and that is to constantly have his audience wondering what else there is about them he can ‘see’ - what other secrets has he access to?A lesser character would have ‘mystical powers’ – Holmes achieves the same thing through the force of his intellect. The only wonder is, given our culture’s clear distrust (if not active loathing) of the intellect, how he ever came to be quite so loved in the first place. Perhaps his 'coldness' explains this - perhaps it is because he is the model of the detached scientist that it is alright to like him.Now, talking of love. My eldest daughter became particularly fond of Mr Holmes about five years ago. So much so that she read all of his stories after we watched many of the BBC TV shows of his works made in the 1980s. One day she had been reading one of the stories in this book and Watson mentions, in an off-hand way, that one can calculate how tall someone is from the length of their stride. And so Fi actually tried this, taking various measurements and doing a series of calculations. It is hard to exaggerate the utter joy children bring into one’s life. They come highly recommended – as do the wonderful stories in this collection.Oh, and there are a couple of stories where it is mentioned that someone is reading a book with a yellow cover – a mystery/detective story. In Italy detective stories are still referred to as ‘Yellows’. I wonder why these stories tended to be printed in books with yellow covers? I must wiki it at some stage."}, {"userName": "Councillor", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/40792319-councillor", "userReview": "As a rule, the more bizarre a thing is, the less mysterious it proves to be. It is your commonplace, featureless crimes which are really puzzling, just as a commonplace face is the most difficult to identify.\n\nWho doesn't know Sherlock Holmes these days? Even if not everyone might be familiar with the original version invented by Arthur Conan Doyle, Mr. Holmes has become such a legend in his own right, a development fed and supported by numerous stage, screen and radio adaptions, that it is nearly impossible to hear the word 'detective' without immediately associating Sherlock Holmes.'The Adventures of Sherlock Holmes' is a collection of altogether twelve short stories, published as the third part of the Sherlock Holmes series following Doyle's novels \"A Study in Scarlet\" and \"The Sign of Four\". Not without reason do many readers consider this collection to be Doyle's masterpiece, myself included. It simply was no masterpiece which absolutely thrilled or stunned me. Blame it on me or my inability to read all the stories from this collection in less than four months, but a lot of the fun about Holmes' and Watson's adventures was deprived from the novel by repeating exactly the same concept in each and every one of those stories.Let's take a look at the short stories itself, which may very well represent the very essence of Doyle's works in the Sherlock Holmes canon. Beginning with A Scandal in Bohemia and concluding with The Adventure of the Copper Beeches, Doyle invented two famous female characters frequently associated with the stories about Holmes: Irene Adler and Violet Hunter. Both may be considered ahead of their times, surprisingly independent and brave. The other characters Doyle brought into play during the other ten stories were not quite as memorable, however. The Red-Headed League turned out to be a sweet little short story which isn't very outstanding in the Sherlock Holmes series because of its predictability, but still includes some interesting quotes and follows a suspense-packed plot with a conclusion which will keep you turning the pages ... just as The Boscombe Valley Mystery, an interesting mystery story about a man being suspected of having murdered his father, consisting of fast-paced dialogues and an exciting turning point. Everyone seems to have guessed the ending correctly before reading it - everyone except for me -, which may be the reason for why I liked it so much.A Case of Identity was far off being nearly as intriguing - I have written a full review for this story here - while The Man with the Twisted Lip emerged as a really good short story with an interesting twist I would never have figured out on my own. In addition, Arthur Conan Doyle included some interesting material surrounding Sherlock's drug addiction here, and once again, he masterfully explored the friendship between Sherlock and Watson. Afterwards, a story about the influence of the Ku Klux Klan, The Five Orange Pips, eloquently narrated by Watson as usual, once again followed the pattern of a classic Holmes tale with an interesting plot and new layers of depth to the character of Sherlock Holmes. Sadly enough, it wasn't as unique as Doyle wanted the story to appear.Another rather interesting little story, but not outstanding or mind-blowing was The Adventure of the Blue Carbuncle, enjoyable, but nothing more. Therein, Holmes has to deal with a stolen carbuncle appearing in the throat of a Christmas goose, entering on the search for the real culprit. The Speckled Band is one of the most well-known stories in this collection, and the hype this short story received is understandable due to its complex mystery and the stunning conclusion. I liked the story myself. However, never before has Doyle confronted us with so many plot holes, which ultimately disappointed me. A story full of potential which was stripped from its credibility for the sake of cutting it short - the story certainly provided home for more potential than some of Doyle's full-length novels. The Adventure of the Engineer's Thumb deals with an engineer whose thumb is chopped off, stinging Sherlock to work out the background of this new case.The Noble Bachelor focuses on the disappearance of a Lord's bride immediately after the wedding ceremony. Quite an entertaining story with snarky Sherlock Holmes at his best, and a stunning conclusion which once again made the reader feel as dumbfounded as John Watson about Sherlock's investigative talents. The second-last story, The Adventure of the Beryl Coronet, deals with the damage mysteriously inflicted to the coronet of a British earl, and, finally, during the conclusion of the collection Doyle rises to fresh heights of his writing with The Adventure of the Copper Beeches, breathing life into a suspenseful story surrounding a woman who assumes work at the mansion of a strange couple with dark secrets.While most of these stories are independently enjoyable and memorable on their own, added up on each other they amount to a collection of great mysteries Doyle could have been proud of. However, for me, the problem in getting through the anthology proved to be the similar execution of each and every story. All of them started with Sherlock and Watson sitting or conversing in Sherlock's home, right before the case's new victim appeared - in most cases on the story's second page. After elaborately recounting their experiences in a way so explicitly formulated that they might have been the starting-point of a story without Sherlock or Watson being present, the second part of all the stories mainly consisted in Sherlock and Watson calling upon the location of the occurence, right before the third part was used to allow Sherlock to narrate the real events leading up to the upcoming of the mystery based on his investigations. Now and then, the second step was even skipped if Sherlock started the investigation without Watson (who was the first-person narrator, which resulted in us only being allowed to look at Sherlock's approach if Watson was present as well), and it just bothered me to read the same concept over and over again, only embedded in different plotlines. And, just as a footnote, someone should have told Sherlock not to consider every single one of his cases as the greatest challenge of his career. It became repetitive after a certain point.However, \"The Adventures of Sherlock Holmes\" remains a great work and can be seen as a tribute to the wonderful and world-wide famous characters of Holmes and Watson. My only disappointment results in my shattered hopes that Mycroft - Holmes' brother - or Moriarty - Holmes' archenemy - might be introduced during one of these stories, but my anticipation of meeting them obviously needs to wait slightly longer. Up next on my Sherlock Holmes quest: The Memoirs of Sherlock Holmes."}, {"userName": "Namratha", "userReviewDate": "Jan 27, 2012", "userURL": "http://www.goodreads.com/user/show/114559-namratha", "userReview": "To have a slight measure of the pleasant chills that race up and down your spine when you delve into a meaty Holmes mystery, do read the introduction passage by Mark Gatiss (co-creator of BBC Entertainment’s Sherlock). Amidst a host of admirable emotions, Gatiss’ one nostalgic paragraph captured my fancy.It goes thusly, \n\n “I’d never read any of the original stories until one fateful Saturday when, recovering from German measles, I was given a treat : a trip to WH Smith, and the purchase of any book I wanted. There, nestling amongst all the possible contenders for my shiny fifty-pence piece was a gorgeous, plump, purple Pan paperback, with a colour-tinted Sidney Paget illustration on the cover: The Adventures of Sherlock Holmes. Everything about it promised the thrill of mystery and the faintly queasy allure of Victoriana with which I was already and headily in love. But first came the introduction. I can’t remember much about it now, except that it ended with the moving sentiment: I wish I were reading these stories for the first time.“\n\n*I wish I were reading these stories for the first time*Never has a statement so effectively captured the sheer bliss of nose-diving into an old and much cherished spot of literature. What prompted me to revisit the series was BBC Entertainment’s hugely popular and marvellously brilliant show : *SHERLOCK*. A fellow fan, sharp reviewer and possessor of the prodigious talent to pick the perfect book (Yes, Mith....I am talking about you) and yours truly were jamming up our Tumblr dashboards with the magnificence of a certain Mr. Benedict Cumberbatch. Said Cumberbatch has done a splendid job of yanking Mr.Holmes into modern day London and playing him with aplomb. It doesn’t hurt that he’s very easy on the eyes too.Ergo, when Cumberbatch (he of the cupid curls, vertiginous cheekbones and manic eye-glint) with his trusty bro-mate, Watson (Martin Freeman) graced the cover of yet another Sherlock edition, I had to lay my hands on it. All the foaming-at-the-mouth fans (and I mean that in the nicest way possible since I unashamedly head the pack) can be forgiven for labouring under the misconception that this book here, is a TV Series adaptation. It’s not.Sadly...well, not really (because, *KNOCK KNOCK*, it’s Sherlock Holmes, the O.R.I.G.I.N.A.L.)...the book is a reprint of the twelve original mysteries as written by Sir Arthur Conan Doyle.So when Holmes is not marvelling over the cleverness of Irene Adler, he’s scratching his head over the sudden collapse of the Red-Haired League. Whether it’s the trivial case of the Blue Carbuncle or the horrifying finale of the Speckled Band, Holmes is striding about with a befuddled Watson in tow. Dignities are being restored....genteel ladies are being chivalrously rescued.....and pages are being fraught with drama, deceit and old-fashioned danger. In short, everything that you would expect from the most famous detective of all fictional times.What could I write in my review that would add anything new to the reams that have been dedicated to the snarkiest sleuth of them all? How do I delve into a character that’s a delightful blend of humility and egotism? How do I gush and fawn over a mind that could dissect an individual down to the tiniest speck of dust on the tip of his frock-coat? From the moment a knock falls at the door of 221B Baker Street, you know that you are in for a treat. From the pithy to the sensational, no case escaped the interest of Holmes and his partner in crime-solving, Dr.Watson. Holmes would settle down before the roaring fireplace, light his pipe, give the despairing individual a clinical onceover, draw his (almost always correct)conclusions and then just as quickly, proceed to unravel mysteries on the strength of observation, infallible logic and that essential spark of genius cloaked in eccentricities.In the times of darkly dreaming Dexter and stiletto wearing Detective Kate Beckett, Holmes may pale in comparison. And then again....maybe he won’t. In the cold of Victorian London, amidst the ladies who sniffed into their lacy kerchiefs and the gentleman who blustered around in their breeches, Holmes cut a dashing figure. With his dry wit and baffling disguises, he plundered the murky underbelly (ah, how I love my clichés) of crime, and almost always got his man/woman/murderous cult.Yes, we love our modern day detective-dramas and high-octane police chases. We love the forensics lab with it’s meticulously laid out tools. We love the fact that a well-worded Google search might just catch that horrendous serial killer by the end of the one hour episode.But, as Steven Moffat (co-creator of BBC Entertainment’s Sherlock) puts it: \n\n\"Conan Doyle's stories were never about frock coats and gas light; they're about brilliant detection, dreadful villains and blood-curdling crimes – and frankly, to hell with the crinoline. Other detectives have cases, Sherlock Holmes has adventures, and that's what matters.\""}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "[being one of the few total fails by Sherlock Holmes (hide spoiler)]"}, {"userName": "Luís C.", "userReviewDate": "Sep 12, 2014", "userURL": "http://www.goodreads.com/user/show/34132356-lu-s-c", "userReview": "Read for the second timeIn sixty investigations, narrated by Dr. Watson, his eminent memorialist, Sherlock Holmes gave only twenty-five guilty to justice.Nine others had escaped the just punishment that awaited them after the riddle's resolution of the enigma.Eleven investigations had the result only of revealing a supposed crime or a pure fantasy having no relation of gravity with that supposed.At the end of the remaining fifteen investigations, Sherlock Holmes, substituting himself for justice, makes himself the guilty one, either that he considers him a victim, or that he proposes to redeem himself, that he wants to avoid a scandal, to be satisfied with a bargain, or to accept a substitute for justice.Watson calls Holmes \"the most perfect machine to observe and reason on the planet.\" He thus reveals the two main parts of his method: observation and deduction.Dust inspection, the origin of mud spots, and the classification of tobacco ash is an aspect of the police technique used by Sherlock Holmes long before the ultra-modern investigators who are now jostling in the literature and on our screens.This imaginary detective is an innovator.With the coming on scene of Sherlock Holmes landed on the sinister crime empire the iron hand of the logicians.This genius misogyny left behind him an abundant and exciting posterity ... before provoking in reaction the birth of the black American novel.Sir Arthur Conan Doyle in his memoirs and adventures cites his three great sources of inspiration, Edgar Allan Poe and Gaboriau, but also his former master Joseph Bell, a surgeon at the Edinburgh hospital, from whom he borrowed first its physical appearance but also its sense of diagnosis and observation.The third volume of these adventures of Sherlock Holmes closes this original and careful incursion into the universe of the most famous detectives. And it is only to have the pleasure of plunging back... Elementary, my dear Watson...."}, {"userName": "Adrian", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/22809267-adrian", "userReview": "This was a re-read , (I'm guessing for the 4th or 5th time ) and it was as fabulous as ever.It comprises 10 short stories :- A scandal in Bohemia -- A case of identity -- The Boscombe Valley mystery -- The five orange pips -- The adventure of the blue carbuncle -- The adventure of the speckled band  The adventure of the engineer's thumb  The adventure of the noble bachelor  The adventure of the beryl coronet  The adventure of the copper beechesThese stories are all well written, with wonderful characterisations and great settings. As with Miss Marple or Poirot, I see a certain actor whenever I read a Sherlock Holmes book and that is Jeremy Brett. To me he is the epitome of Sherlock-ness.In this collection we see Sherlock and Watson involved with royalty to beggars, from geese to snakes, from central London to the suburbs (when they were suburbs) to the South Wset, from bank robbers to murders to \"The Woman\".If you've never read any Holmes, this is a great place to start and will give you an insight into his amazing abilities, his relationship with Watson and fantastic descriptions of Victorian London."}, {"userName": "Jan-Maat", "userReviewDate": "Jun 15, 2011", "userURL": "http://www.goodreads.com/user/show/5617661-jan-maat", "userReview": "[ or both (hide spoiler)]"}, {"userName": "Apatt", "userReviewDate": "Aug 29, 2011", "userURL": "http://www.goodreads.com/user/show/2457095-apatt", "userReview": "[you can almost feel the ceiling closing in (hide spoiler)]"}, {"userName": "Paul Bryant", "userReviewDate": "Nov 26, 2012", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Sherlock Holmes is one of the great characters of literature - who can resist the aloof arrogance and limitless self-satisfaction which stems from that intellectual superiority with which he squishes all the dodgy baronets and rum foreign coves that turn up in the mysteries presented to him by the clients who never fail, when recounting their tangled tales, to speak in perfect paragraphs full of precisely recollected speech in a style exactly like a Conan Doyle story? I love the love story between Holmes and Watson - they may or may not be closet cases, but yes it is rather interesting how in \"The Man with the Twisted Lip\" when Watson stumbles over Holmes in disguise in an opium den from where Watson is retrieving the erring husband of his wife's friend late one night, without a second thought, Watson packs the stoned husband into a cabriolet and sends him home whilst he goes off with Sherlock to spend the night – never mind what a fretting wife will be thinking! Watson is of course the Boswell to Sherlock's equally-eccentric Dr Johnson and just as the great doctor got rather aggravated at Bozzy at times and swatted him like a fly, so we get this rather grim pronouncement from Sherlock - they are discussing the accounts Watson writes and publishes of Sherlock's cases, the very accounts we have been reading in this book, yes, rather postmodern of Conan Doyle:\"You have erred perhaps in attempting to put colour and life into each of your statements, instead of confining yourself to the task of placing upon record that severe reasoning from cause to effect which is really the only notable feature about the thing.\"\"It seems that I have done you full justice in the matter,\" I remarked with some coldness, for I was repelled by the egotism which I had more than once observed to be a strong factor in my friend's singular character.\"No, it is not selfishness or conceit,\" said he, answering, as was his wont, my thoughts rather than my words. \"If I claim full justice for my art, it is because it is an impersonal thing – a thing beyond myself. Crime is common. Logic is rare. Therefore it is upon the logic rather than upon the crime that you should dwell. You have degraded what should have been a course of lectures into a series of tales.\"That's telling him. But Sherlock, these are beautifully written tales! For instance, I love the pause which allows some conversation before the moment when the next agitated client twangs the Baker Street bell with another very unlikely tale. A pause where Sherlock makes some random, unexpected observations about London life or makes of tobacco or the problems of succession in Schleswig-Holstein. And then, in comes the client shaking an umbrella - Sir, a foreign gentleman cut off my thumb last night. Mr Holmes, my wife disappeared thirty minutes after we were married. Mr Holmes, they believe I killed my father. Sir, a person sent my father five orange pips through the mail, and he died shortly thereafter. Now I have received five orange pips through the mail.The unlikeliness of the mysteries and their resolutions are delightful in many ways. Sometimes it turns out no crime has been committed. Sometimes Sherlock turns out to be the criminal! He has to break a law to obtain justice. And he dishes out summary punishments too. Sometimes the police never get involved, often they're flat-footed stooges or simply noises off. The stories become the vehicle to make many comments on England and the English – here's one I liked. Holmes and Watson are driving out into the Surrey countryside on a beautiful Spring day :\"You look at these scattered houses and you are impressed by their beauty. I look at them and the only thought which comes to me is a feeling of their isolation, and of the impunity with which crime may be committed there.\"\"Good Heavens!\" I said, \"who would associate crime with these dear old homesteads?\"\"They always fill me with a certain horror. It is my belief, Watson, that the lowest and vilest alleys in London do not present a more dreadful record of sin than does the smiling and beautiful countryside.\"Always fascinating, glinting with intelligence, ascerbity and occasional indirect humour, and human affection, all these stories surpassed my dim memories of them and made me very happy that there are another four volumes to go."}, {"userName": "russell barnes", "userReviewDate": "Aug 23, 2007", "userURL": "http://www.goodreads.com/user/show/72919-russell-barnes", "userReview": "It's the end of the world and Watson and Holmes, on the cusp of having their brilliant lives snuffed out by the impending doom decide their simmering sexual tension can go no further.As they remove their clothes, Watson turns around to see Holmes brandishing a tub of Lemon Curd.\"Holmes!\" Watson exclaims, \"I know what we're about to do goes against God's nature, but what in the name of all that is Holy are you doing with that breakfast condiment?\"To which Holmes replied, \"Lemon entry my dear Watson, Lemon entry\"."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jul 16, 2016", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Adventures of Sherlock Holmes (Sherlock Holmes, #3), Arthur Conan Doyle تاریخ نخستین خوانش: سوم اکتبر سال 2016 میلادیعنوان: شرلوک هولمز؛ نویسنده: آرتور کانن دویل؛ مترجم: محمد قصاع؛ تهران؛ شهر قلم؛ 1394؛ در 112 ص؛"}, {"userName": "James", "userReviewDate": "Jul 22, 2015", "userURL": "http://www.goodreads.com/user/show/41609617-james", "userReview": "Classic Sherlock Holmes, Arthur Conan Doyle at his finest.If you've read and enjoyed any books in the Sherlock Holmes series - then read them all, they are all consistently great. Sherlock Holmes must be one of the greatest literary characters ever created and the stories are so very well written.Intriguing, compelling, intelligent, exciting, page-turning fun of the highest order."}, {"userName": "Teresa", "userReviewDate": "Feb 02, 2017", "userURL": "http://www.goodreads.com/user/show/541416-teresa", "userReview": "It’s been fun zipping through one of these stories each night for the past twelve nights. I’ve even felt rather clever after guessing correctly on a few of the outcomes—even without counting “The Speckled Band”, a story I remember very well from grammar school. I’m not sure why I remember it after such a long time, except for it being one of several short stories we read that year that opened up a new world for me, thanks to a favorite English teacher. (Other stories I remember from then were by Guy de Maupassant and, of course, O. Henry, as well as the very sad “The Scarlet Ibis”, which I didn’t remember was written by one James Hurst.)However superficially clever I might’ve felt, my guessing the outcome is not the attraction for me with these stories: it’s more of seeing the original elements that have since become the stock-in-trade of works about two very different buddies, working together as their personalities clash.I also enjoy Doyle’s disparaging remarks on his own (Watson’s) stories through the mouthpiece of Sherlock. The last story of this set (“The Copper Beeches”) starts off with Watson feeling ‘cold’ toward Sherlock after the latter has noted that Watson has ‘embellished’ his published statements of Sherlock’s deductions instead of sticking to a ‘record’ of ‘severe reasoning from cause to effect’, going on to admonish Watson that he has ‘degraded what should have been a course of lectures into a series of tales’. Doyle then goes on to pen his most sensationalistic tale yet. (Sort of meta, isn’t it?)"}, {"userName": "Julieta", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/22351902-julieta", "userReview": "• Escándalo en Bohemia 4/5⭐️• La liga de los pelirrojos 4/5⭐️• Un caso de identidad 3/5⭐️• El misterio de Boscombe Valley 3/5⭐️• Las cinco semillas de naranja 3/5⭐️• El hombre del labio torcido 4/5⭐️• La aventura del rubi azul 3/5⭐️• La aventura de la banda de lunares 4/5⭐️• El dedo pulgar del ingeniero 3/5• El aristócrata solterón 3/5⭐️• La aventura de la corona de esmeraldas verdemar 3/5⭐️• La aventura de Copper Beeches 4/5⭐️"}, {"userName": "Huda Aweys", "userReviewDate": "Jan 30, 2014", "userURL": "http://www.goodreads.com/user/show/16197752-huda-aweys", "userReview": "Sherlock Holmes ...What a day :) ***** حزينة جدا على أفول نجم (شيرلوك) في أواخر ايام السير آرثر كونان دويل .. ماكانش يعرف ان دي البداية :)"}, {"userName": "Simona Bartolotta", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/5312173-simona-bartolotta", "userReview": "4.5"}, {"userName": "Jean", "userReviewDate": "Jul 21, 2013", "userURL": "http://www.goodreads.com/user/show/19300421-jean", "userReview": "Here are my reviews of individual stories:Link to review of the first story, A Scandal in BohemiaLink to another one, The Adventure of the Speckled Band"}, {"userName": "Meltem K.", "userReviewDate": "Jun 21, 2016", "userURL": "http://www.goodreads.com/user/show/54746583-meltem-k", "userReview": "\"...when you have excluded the impossible, whatever remains, however improbable, must be the truth...\""}, {"userName": "Pau", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/31115154-pau", "userReview": "4/5Los relatos de Sherlock Holmes siempre son una lectura segura a la que recurrir. Y es que da igual que todos sigan el mismo patrón y ya esté muy familiarizada con los métodos deductivos de Sherlock, siempre me reconforta leerlos. Ya hablé en otras reseñas de Arthur Conan Doyle de lo que me gusta el personaje de Sherlock. Es impresionante cómo a través de Watson descubrimos a este genio, que a veces me inspira asombro y otras veces me parece el mejor personaje cómico que haya existido. Y además de esto, lo buenos que son los casos a los que se enfrenta. De verdad que no entiendo cómo Sir Arthur pudo inventarse tantos casos que además son tan originales y misteriosos. Ojalá nunca se me acaben los relatos de Sherlock Holmes porque es una delicia leerlos y un acierto seguro."}, {"userName": "K.D. Absolutely", "userReviewDate": "Jan 08, 2010", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "A Scandal in Bohemia (3 stars) Wilhelm Gottsreich Sigismond von Ormstein, King of Bohemia is arranged to marry the daughter of the King of Scandinavia but he loves another girl. Irene Alder. Entertaining. Fast-paced. I love the disguises!The Red-Headed League (3 stars) Mr. Jabez Wilson has an apprentice in his pawnshop whose name is Mr. Vincent Spaulding. One day, Spaulding recruits his boss to the association of people with red hair to copy encyclopedia, Very funny storyline. I love the twist!A Case in Identity (3 stars)Mary Sutherland, a typist, who inherits riches from her uncle in New Zealand, wants to find the whereabouts of Mr. Hosmer Angel, her boyfriend. Hmm, I can’t believe that Mary does not have a hint about her uncle in disguise. It reminded me of Roschester disguising as a fortune teller in Jane Eyre. Still funny, though.The Boscombe Valley Mystery (2 stars)James McCarthy is suspected to have murdered his father, Charles McCarthy. However, through Charles last words and striking the conscience, Holmes finds out the real killer. After the first three short stories, this one pales in comparison but still okay.The Five Orange Pips (4 stars)Elias Openshaw hires his favorite nephew John Openshaw as his household manager. One days Elias receives an envelope containing five orange pips that are the traditional symbol of Ku Klux Khan, a post-Civil War American terrorist organization. This organization kills the supporter of African-American voting rights. My first fiction on K.K.K. and I loved it!The Man With the Twisted Lip (1 star)Neville St. Clair is missing so his wife is looking for him. The last time she sees him is on top of the building staring down at her. When she goes up she sees the beggar Hugh Boone. All these disguises! All these disguises! Hannibal Lectern does it better by scraping the skin of his victim but make up? I dunno. In whatever angle I see my wife, near or far, I could spot her without any effort!The Blue Carbuncle (3 stars)The Blue Carbuncle is a stolen jewel belonging to the Countess of Morcar. This is believed to be stolen by a hotel employee named James Ryder. It is found inside the throat of a goose that is goes together with a hat. Both of them are owned by a plumber named John Horner. Quite clever using the poor goose to swallow a diamond! I liked this one.The Speckled Band (3 stars)Helen and Julia Stoner have a stepfather Dr. Grimesby Roylott who will get poor if any of them gets married. The reason is that the will of their mother has named Roylott as the trustee as long as either of them ties a knot. Roylott does everything to stop Julia’s wedding to Percy Armitage. The solution that Holmes used here is quite simpler but the flashback approach seemed to have differentiated this to the other stories.The Engineer’s Thumb (2 stars)Victor Hatherley is a hydraulics engineer but has no job so when Colonel Lysander Stark approaches him for a task that will pay him a huge amount of money, he accepts. It’s just that he is not aware of the risks that go with it.  I just had a hard time understanding what is the meaning of fullers but this story has lesser suspense that the others in my opinion.The Noble Bachelor (2 stars)Lord St. Simon, son of the Duke of Balmoral, has a missing wife, Hatty Doran. The main suspect is another woman, Flora Miller, who tries to stop the wedding of the two.  Another story regarding marital problem, the spouse ditching her partner. Quite similar to “Twisted Lips.”The Beryl Coronet (3 stars) Lord St. is a senior partner of one of the biggest banks in London. One day, a customer asks for a big loan with Beryl Coronet, a golden crown with 39 beryls (a kind of gem) inset, as a collateral. Worried about the security, Lord St., brings the gem home and tells his son and niece about it. When Lord St., wakes up 3 beryls are already missing. Very good story. The twist is solid and the denouement is well-thought of. The Copper Beeches (4 stars)Violet Hunter wants Holmes’ opinion whether she should be a governess or not of a family with peculiar demands, including to cut her hair, but the rate will be double. The funniest story in the whole collection. Reminds me that governess or housemaids should not be discounted as they could be as smart as anybody else.Twelve short stories that prove how clever Sherlock Holmes is as a detective. They also show us the friendship between him and his lifelong partner, Watson. This friendship is almost like a bromance, it’s just that it is really platonic and based on mutual respect and admiration. No wonder my friend in our bookclub is crazy about Sherlock Holmes. I bet he dreams of finding not a bromance but a close friend who will stay by his side up to his twilight years on earth."}, {"userName": "Piyangie", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/48056505-piyangie", "userReview": "This short story collection on the adventures on Sherlock Holmes set the famous fictitious detective at his best and Mr. Doyle himself at his best as well, save except in the Hound of the Baskerville. All twelve short stories in this collection are well written and varied between 3 stars to 5 stars in my opinion on them. A Scandal in Bohemia **** - I really liked it. It was one instance that famous detective was outwitted, and that too by a woman!The Red-headed League *** - This was a clever mystery where Holmes finally apprehend a most wanted criminal.A Case of Identity *** - A simple mystery but nevertheless an enjoyable read.The Boscombe Valley Mystery **** - An interesting mystery though the culprit was pretty predictable. Still, I liked it very much. The Five Orange Pips *** - I wish the end of this mystery was made more satisfactory. The Man with a Twisted Lip **** - I was really surprised at the end result to his mystery. Never for a moment guessed what it would be. The adventure of the Blue Carbuncle *** - The famous detective shows the world that under a detached analytical self, a kind and compassionate man lives, by pardoning a thief and giving him another chance in life. The Adventure of the Speckled Band ***** - A great mystery, a sinister villain, the exceptional analytical skill of Holmes combines in creating a great adventure. Simply, an amazing read. The Adventure of the Engineer's Thumb *** - The mystery was interesting enough. My only regret was that the villain were not apprehended. The Adventure of the Noble Bachelor **** - This is the one story out of the twelve pack in which I found a comic relief. I had a hearty laugh over the way this story was presented. The Adventure of the Beryl Coronet ***** - This is my most loved mystery out of the lot. Apart from Holmes and the dear doctor, I found an admirable character in Arthur Holder.The Adventure of the Copper Beeches **** - Again we come across a sinister villain and how Holmes, a governess, a servant and a lover rescues an injured victim. Overall, it was a enjoyable read. Highly recommended to those who would enjoy some quick adventures with our most beloved detective, Mr. Sherlock Holmes!"}, {"userName": "Kelly", "userReviewDate": "Dec 21, 2009", "userURL": "http://www.goodreads.com/user/show/94602-kelly", "userReview": "So, I volunteer at a library, in what the librarians call the \"Popular Library,\" which consists of the area with the DVDs, music CDs and of course, the audiobooks. The majority of the titles in the audiobook section are romance novels. It struck me as a hilarious idea, and indeed, each of the audiobooks I've stuck in the CD player they have there to listen to for a few minutes has borne that out. Romance novel dialogue is barely okay on the page- can you imagine all that \"Oh, FABIO, your gorgeous quivering member is so BIG! OOH BABY, LET'S DO LIKE THEY DO ON THE DISCOVERY CHANNEL!\" stuff being said out loud? It really is just as bad as you'd think.This being my only experience with audiobooks, you can understand that I was somewhat apprehensive about listening to Sherlock Holmes on audiobook, especially with stories I'd not read before like this particular collection. I felt like the prose could certainly tend towards the melodramatic and could extremely easily sway into the land of the cheesy, and I was reluctant to see that happen.However, nothing of the kind was the case. These dramatizations by BBC Radio were almost entirely and uniformly excellent. The radio format suits these tales admirably, and I could just see some family sitting around a radio in the 1930s on the edge of their seat with some of these. I was on the edge of my seat through these as well(in my case the seat was most likely on the subway though, which made for some shocking reminders of reality when the train swung to a stop). Also, it's a great bonus that the guy playing Sherlock (Clive Merrison) has a really sexy voice, and the Watson can really sell a \"dark and stormy night\" like nobody's business.As for the stories themselves, there are several really excellent and creative ones in here where one really hasn't the slightest idea where the end is going to come from, or how Sherlock is going to defeat the villain. My personal favorites were \"A Scandal in Bohemia\" (this is where Irene Adler is introduced, just by the by), \"The Red Headed League,\" (truly delightful and playful plot) \"The Adventure of the Speckled Band,\" and \"The Man with the Twisted Lip.\" The dialogue is fantastic, the plotting moves along quickly and believably, and Sherlock Holmes usually has just enough trouble to make you think that he is human, and each plot is totally solvable once you go back and pay attention to what you missed. Only quibbles: Has anyone else noticed that Arthur Conan Doyle's marriage plots are kind of boring and all alike? It almost feels like someone told him that he hadn't written enough romance and he threw it in grudgingly to make somebody happy, but was a little too resentful to put any effort into it more than once, and so all the plots kind of sound the same? It's always some girl's annuity that is at issue, always some malicious and poor relative. Really annoying. He also really did seem to think that Americans were a bunch of uncivilized hicks- every American character in here fed some sort of stereotype. I suppose that's not all that surprising when you're writing suspense stories for your home populace about an exotic Other of some kind, though.Those things don't really bother me so much though, just some observations, in the spirit of Holmes and all. Listening to The Sign of the Four next!"}, {"userName": "Irene△⃒⃘", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/55991704-irene", "userReview": "3.5/5 ~ The edition that I own is a collection of stories taken from both this book and another one! This book was a fun mysteries read, coolest part was definitely seeing Sherlock’s mind in action 👌🏻"}, {"userName": "Sonia", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/18450298-sonia", "userReview": "Como siempre, la agudeza y el ingenio de Holmes hacen que cada aventura parezca compleja al principio y que transcurra con muchas rapidez, además de resultar simple y menos dramática al final. Mi admiración no hace más que crecer por el simple hecho de que a fin de cuentas todo se reduzca a la explicación más elemental."}, {"userName": "Lau ", "userReviewDate": "Apr 07, 2012", "userURL": "http://www.goodreads.com/user/show/7597758-lau", "userReview": "Me declaro fanática absoluta de Sherlock Holmes... creo que es la mejor opinión que puedo dar."}, {"userName": "Chris_P", "userReviewDate": "Feb 23, 2016", "userURL": "http://www.goodreads.com/user/show/44309339-chris-p", "userReview": "A Scandal in Bohemia: ****The Red-headed League: ***A Case of Identity: ***The Boscombe Valley Mystery: ***The Five Orange Pips: ***The Man With The Twisted Lip: ****The Adventure of the Blue Carbuncle: ***The Adventure of the Speckled Band: *****The Adventure of the Engineer's Thumb: ****The Adventure of the Noble Bachelor: ***The Adventure of the Beryl Coronet: ****The Adventure of the Copper Beeches: ****3.58I have to make clear that the ratings only represent how I personally felt reading each story, portraying the interest I had in them and how much I got carried away. It is a fact that all of them are well made and ingeniously crafted. Now, as to how I felt, there were times when I was amazed and others when I was \"meh\". For instance, I found \"A Case of Identity\" to be too obvious while Sherlock asked Watson questions that I could answer and the latter couldn't, making him look dumb. And then there was \"The Adventure of the Speckled Band\" which I found perfect. In any case (ha! see what I did there?), \"The Adventures of Sherlock Holmes\" is an exciting collection of stories that will make your brain cells disappear in no time!"}, {"userName": "Antonella", "userReviewDate": "Mar 09, 2015", "userURL": "http://www.goodreads.com/user/show/28330621-antonella", "userReview": "\"Tan acostumbrado estaba yo a sus invariables éxitos que ni se me pasaba por la cabeza la posibilidad de que fracasara\"\n\nMe gustaron algunas más que otras, pero lo que más me llamó la atención a leer cada historia fue el carácter de Sherlock, que al ser misterios cortos y que por ahí no generaban problemas para resolver, su personalidad e inteligencia es lo que más destaca.Escándalo en Bohemia 5/5\n\"Para como un carácter como el suyo, una emoción fuerte resultaba tan perturbadora como la presencia de arena en un instrumento de precisión o la rotura de una de sus potentes lupas. Y sin embargo, existió para él una mujer, y esta mujer fue la difunta Irene Adler, de dudoso y cuestionable recuerdo\"\nLa liga de los pelirrojos: 3.5/5\n\"Si queremos efectos extraños y combinaciones extraordinarias, debemos buscarlos en la vida misma, que siempre llega mucho más lejos que cualquier esfuerzo de la imaginación\"\nUn caso de identidad: 3/5\n\"Querido amigo. La vida es infinitamente más extraña que cualquier cosa que pueda inventar la mente humana. No nos atreveríamos a imaginar ciertas cosas que en realidad son de lo más corriente. Si puediéramos salir volando por esa ventana, cogidos de la mano, sobrevolar esta gran ciudad, levantar con cuidado los tejados y espiar todas las cosas raras que pasan, las extrañas coincidencias, las intrigas, los engaños, los prodigiosos encadenamientos de circunstancias que se extienden de generación en generación y acaban conduciendo a los resultados más extravagantes, nos parecía que las historias de ficción, con sus convencionalismos y sus conclusiones sabidas de antemano, son algo trasnochado e insípido\"\nEl misterio de Boscombe Valley: 3.5/5\n\"Las pruebas circunstanciales son muy engañosas. Puede parecer que indican claramente una cosa, pero si cambias un poquito tu punto de vista, puedes encontrarte con que indican, con igual claridad, algo completamente diferente\"\nLas cinco semillas de naranja: 3.5/5\n-He venido en busca de consejo.-Eso se consigue fácilmente.-Y de ayuda.-Eso no siempre es tan fácil.\nEl hombre del labio retorcido: 4/5El carbunclo azul: 4/5La banda de lunares: 4.5/5\n\"Vivimos en un mundo malvado, y cuando un hombre inteligente dedica su talento al crimen, se vuelve aún peor\"\nEl dedo pulgar del ingeniero: 5/5\n\"Experiencia. En cierto modo, puede resultarle muy valiosa. No tiene más que ponerla en forma de palabras para ganarse una reputación de persona interesante para el resto de su vida\"\nEl aristócrata solterón: 4/5La corona de berilos: 3.5/5\n\"Su silencio me parece un arma de dos filos\"\nEl misterio de Copper Beeches: 4.5/5\n\"El hombre que ama el arte por el arte suele encontrar los placeres más intensos en sus manifestaciones más humildes y menos importantes\"\n\n\n\"Ya sabe usted, Watson, que una de las maldiciones de una mente como la mía es que tengo que mirarlo todo desde el punto de vista de mi especialidad. Usted mira esas casas dispersas y se siente impresionado por su belleza. Yo las miro, y el único pensamiento que me viene a la cabeza es lo aisladas que están, y la impunidad con que puede cometerse un crimen en ellas\"\n\n\n\n2015 Reading Challenge:"}, {"userName": "Wanda", "userReviewDate": "Sep 15, 2014", "userURL": "http://www.goodreads.com/user/show/9246169-wanda", "userReview": "If you are an enthusiastic reader of crime/noir/mystery novels, at some point you should get back to its roots—by reading The Adventures of Sherlock Holmes. Sir Arthur set many of the patterns which can still be observed in the modern genre novel.Sherlock Holmes is an eccentric expert—but he defines the crime expert, what with his monographs on cigar ash, his studies of foot prints, and his encyclopedic knowledge of the history of crime. Many of the heroes of today’s literature are forensic anthropologists, FBI agents, and police detectives, people with formidable and specialized expertise in their fields. Holmes was multifaceted, in that he was also an expert boxer and an amateur violin player. It reminds me of Patricia Cornwell’s Kay Scarpetta, who is also a wonderful cook and who cooks to clear her mind of the case at hand—just as Holmes works on his chemistry experiments or plays his violin in order to come at a problem obliquely.Especially prescient was Conan Doyle’s depiction of what we would now call profiling, getting into the mind of another person and using that insight to catch the criminal. It is especially pronounced when Holmes is dealing with his nemesis, Professor Moriarty—he bases his judgments of Moriarty’s next moves upon what he himself would do. They are equally matched.Many of our favourite 21st century protagonists also have their Dr. Watson, a sidekick who can assist as necessary and provide an ear to listen to the latest theory, thereby filling in the reader on what is happening in the main character’s mind. Think Benton Wesley or Pete Marino for Kay Scarpetta (Cornwell) or Amelia Sachs with Lincoln Rhyme (Deaver). The Scandinavian noir writers seem to prefer the isolated expert—like Holmes, who has only 1 or 2 friends and absolutely refuses a romantic relationship, the Scandinavian main characters are frequently divorced, unable to maintain healthy relationships with their girlfriends and/or children, and generally somewhat socially isolated. For example, Henning Mankell’s Wallander, Arnaldur Indridason’s Erlandur, or Yrsa Sigudardottir’s Thora Gudmundsdottir.Of interest to me was the story which I think we would all think of as The Curious Incident of the Dog in the Night Time—the dog which didn’t bark, indicating that it knew the man who entered the barn. Conan Doyle called this story Silver Blaze, after the stolen horse of the tale. Also interesting to me was the Adventure of the Speckled Band, in which Holmes foils a plot involving a trained venomous snake. This snake was trained to respond to a whistle—not a physical possibility for snakes, which cannot hear air-borne sound waves. Realistically, the criminal might have recalled his pet by thumping on the wall, causing vibrations which the creature might have picked up through its lower jaw (but then if it was busy biting the inhabitant of the bed in the next room, it would likely miss even this cue.)An interesting and entertaining series of stories, albeit a trifle repetitious when read one after the other in this volume. They would have been much more effective when read one at a time, as they would have been at the time of publication. Many of the prejudices of the 1890s are firmly on display, making this an interesting historical document as well. I wonder what our literature will reveal about us to future generations?"}, {"userName": "Melora", "userReviewDate": "Feb 28, 2016", "userURL": "http://www.goodreads.com/user/show/5586131-melora", "userReview": "I've read quite a few Sherlock Holmes stories before, more than half of these, probably, at one time or another, but this collection of twelve, taken all at one go (really over three days, but you know what I mean), gives a different impression than the stories do when taken individually. The thing that most impressed me, and which I likely noticed because Zach Dundas pointed it out in The Great Detective: The Amazing Rise and Immortal Life of Sherlock Holmes, which I just read, is how nice Sherlock Holmes is. Significantly nicer than he usually is when translated to film or television. Okay, it's true that even in the stories he can be pretty catty about Watson's storytelling, but he's consistently solicitous and sympathetic with his clients, and generally is appreciative and cordial to Watson. Also noticeable is that his mood swings are even more dramatic in the original than in interpretations of the character. Jeremy Brett and Benedict Cumberbatch, for instance, may go from still and pensive to energetic and intense, but Doyle's Holmes “chuckled and wriggled in his chair, as was his habit when in high spirits” (pg 26, The Red-Headed League). Can you even imagine Jeremy Brett “wriggling”? He certainly can be intimidating, intense, and mysterious, but he comes across in these stories as more of a charming (if occasionally alarming) eccentric than a high-functioning sociopath/Asperger's sufferer.Not only does Doyle make his Holmes sometimes surprisingly playful, but he also seems to have a bit of fun at Holmes's expense. In particular, Holmes's party trick of astonishing new clients by telling them details about their lives is presented as something in which he takes a childish delight. His “Oh, but of course it was all completely obvious” routine after he's gotten his “How can you know that, you brilliant man?” fix becomes quite comic and, oddly, sort of sweetly needy after you read it in a few stories in a row.I was also reminded that not all the mysteries are “crimes.” “The Man with the Twisted Lip” and “The Noble Bachelor” are more along the lines of “confusions which need clearing up,” and “A Scandal in Bohemia” is a sort of blackmail case in which our sympathy is rather more with the lovely and clever Irene Adler than with the absurd and pompous King of Bohemia.Doyle's style is modern – none of the convoluted sentences, sentimentality, or ornateness which characterize some of the Victorians – and these little stories really zip along. I look forward to reading The Memoirs of Sherlock Holmes and revisiting The Hound of the Baskervilles soon!"}], "description": "The Adventures of Sherlock Holmes is the series of short stories that made the fortunes of the Strand magazine, in which they were first published, and won immense popularity for Sherlock Holmes and Dr Watson. The detective is at the height of his powers and the volume is full of famous cases, including 'The Red-Headed League', 'The Blue Carbuncle', and 'The Speckled Band'. Although Holmes gained a reputation for infallibility, Conan Doyle showed his own realism and feminism by having the great detective defeated by Irene Adler - the woman - in the very first story, 'A Scandal in Bohemia'. The editor of this volume, Richard Lancelyn Green is editor of The Uncollected Sherlock Holmes and The Further Adventures of Sherlock Holmes. With John Michael Gibson, he compiled the Soho Series Bibliography of A. Conan Doyle.", "title": "The Adventures of Sherlock Holmes\n      \n          (The Adventures of Sherlock Holmes #1-12)", "url": "http://www.goodreads.com/book/show/4788505-the-adventures-of-sherlock-holmes", "average": 4.3, "cover": "https://images.gr-assets.com/books/1348611597l/4788505.jpg", "reviews": 5387, "authors": [{"url": "https://www.goodreads.com/author/show/2448.Arthur_Conan_Doyle", "name": "Arthur Conan Doyle"}, {"url": "https://www.goodreads.com/author/show/26513.Richard_Lancelyn_Green", "name": "Richard Lancelyn Green"}], "type": ["Classics", "Mystery", "Fiction", "Short Stories", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/4788505-the-adventures-of-sherlock-holmes", "http://www.goodreads.com/book/show/3590.The_Adventures_of_Sherlock_Holmes", "http://www.goodreads.com/book/show/12320698-the-adventures-of-sherlock-holmes", "http://www.goodreads.com/book/show/3353110-the-adventures-of-sherlock-holmes", "http://www.goodreads.com/book/show/2561002.The_Adventures_of_Sherlock_Holmes", "http://www.goodreads.com/book/show/162847.The_Adventures_of_Sherlock_Holmes", "http://www.goodreads.com/book/show/6216010-the-adventures-of-sherlock-holmes", "http://www.goodreads.com/book/show/17876034-las-aventuras-de-sherlock-holmes", "http://www.goodreads.com/book/show/121604.The_Adventures_of_Sherlock_Holmes", "http://www.goodreads.com/book/show/20899335-the-adventures-of-sherlock-holmes", "http://www.goodreads.com/book/show/20802278-las-aventuras-de-sherlock-holmes", "http://www.goodreads.com/book/show/6548001-the-adventures-of-sherlock-holmes", "http://www.goodreads.com/book/show/18688860-le-avventure-di-sherlock-holmes", "http://www.goodreads.com/book/show/18749844-las-aventuras-de-sherlock-holmes", "http://www.goodreads.com/book/show/16100496-sir-arthur-conan-doyle-the-adventures-of-sherlock-holmes", "http://www.goodreads.com/book/show/13723150-the-adventures-of-sherlock-holmes", "http://www.goodreads.com/book/show/102868.A_Study_in_Scarlet", "http://www.goodreads.com/book/show/8921.The_Hound_of_the_Baskervilles", "http://www.goodreads.com/book/show/188572.The_Complete_Sherlock_Holmes", "http://www.goodreads.com/book/show/3586.The_Complete_Sherlock_Holmes_Vol_2", "http://www.goodreads.com/book/show/608474.The_Sign_of_Four", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}