{"ratings": 377906, "userreviews": [{"userName": "Anastacia", "userReviewDate": "Jul 02, 2008", "userURL": "http://www.goodreads.com/user/show/49938-anastacia", "userReview": "I was meandering around Borders one Saturday when I saw a dog's head on the cover of a book, and since I am magnetized to animals (especially dogs), I had to pick it up and leaf through it. I was pleasantly surprised to read the cover to find out it is written entirely from the perspective of a dog. Adorable and unique; I have always wanted to know what it's like in the mind of a dog. Although obviously written by a person (or my dog has some explaining to do as I was under the impression that dogs do not have opposable thumbs and can't write), it would be so interesting and heartwarming to read through a dog's perspective.By page six I was sobbing and sniffling. I didn't buy the book then because, as an animal lover, I am especially sensitive to certain subjects. As a doggy mom, I am more sensitive and I can't bear to think about certain things, whether peaceful or otherwise. I cry watching Animal Cops. I cry whilst watching Wild Discovery. I love animals intensely. So when I read those first six pages and discovered how the story would unfold, I didn't think I could do it. I felt like I needed to get my bearings. I did and I bought it. The book isn't short, but I read it on one Sunday. I couldn't stop. There were many times where my tears were blurring my vision and I couldn't read further until I wiped my eyes sloppily. But there were also many times when I laughed out loud, something I rarely do. When you're an avid reader, you tend to immunize yourself to a really good laugh (or a good scare, although that wasn't at play here). But Enzo, the dog, is witty, hilarious, immensely introspective, brilliant and sensitive. And I cried more because of this, because he is all of these things and because he was being so unflinchingly brave and honest. And, yeah, I know it was written by a man and not a dog, but if you've ever been a parent to a dog you'll know that the author's voice is eerily similar to expressions and personality \"isms\" that are directed at you every day. My pup is very well taken care of and loved with a fierceness that astonishes me, but after reading this book I have been talking to him, laying on the floor with him, treating him more as a friend who can hear and understand me even though he can't form or speak the words through his mouth. This story is beautiful and hopeful and devastatingly sad, but it is told in such a delicate way that you'll find yourself sobbing but feeling okay about it. If Enzo is okay, I thought, then so am I. Maybe it's because this is what I want to hear and what I want to think because I know my own boy will leave me some day, but I want to believe that all of Enzo's thoughts are real and that when it is time, they want you to let them go. I can't imagine it and I'm tearing up just writing this, but maybe thinking about this when I'm forced to will make it just a tiny, infinitesimal bit less paralyzingly heartbreaking.The book took my breath away and makes me feel closer to my dog. For that alone I am indebted."}, {"userName": "Jason", "userReviewDate": "Mar 06, 2011", "userURL": "http://www.goodreads.com/user/show/4426615-jason", "userReview": "You know that guy who comes up to you when you’re having a bad day and says something like, “just think positive thoughts and good things will happen” as if it were really that simple? As if the spirit of Karma or whatever is patiently waiting around for you to will happiness upon yourself so that it can be befittingly bestowed? Yeah, well fuck that guy. Bad things happen all the time to people who don’t deserve it, regardless of whether or not they are in touch with their “positive energies.” Similarly, people who are jerks are at no greater risk of having a safe fall on their heads while they walk down the sidewalk than anybody else is. Not in the real world, anyway.Apparently this book does not take place in the real world.By now, I think it is pretty much known that this book is written from the perspective of a dog. While this may be a turnoff for a lot of people, it is not what ruined it for me; I can be very open to unconventional styles of storytelling. No, what ruined it for me is the fact that the entire thing is horribly botched.First of all, when you are a writer and you choose to narrate your tale through the eyes and ears of man’s best friend, you need to adhere to your own limitations. If your story involves any kind of tromping through courthouses, police stations, or hospitals, YOU CANNOT GO THERE. Nor can you give your canine narrator ESP or amazing powers of deductive reasoning, either, as compensation. That is cheating.Second, please don’t be smarmy. You are already asking your reader to suspend his convictions enough to buy into this whole concept of a dog harnessing a human soul; please do not expect him to swallow that your dog is also an earthy-crunchy environmentalist with a belief in the law of attraction and a distrust of the medical community to boot, because that is just asking too much. When you do that, you expose yourself as a fraud trying to push your own agenda onto the reader through your characters. Again, cheating. (And as an aside, I can assure you that doctors and drug companies are not sitting around boardroom tables scheming over how to swindle sick people out of all their money. How ridiculous.)Putting all this aside, the book still fails on so many other levels. Its characters are hollow shells, driven by motivations I could in no way relate to. This, in turn, translates to an exceedingly weak plot in which events occur unnaturally, giving the entire novel a contrived quality. It also tries—constantly—to draw analogies to race car driving, which comes off sounding rather pathetic. And its ending actually nauseated me. Truly, I am at a loss to explain the popularity of The Art of Racing in the Rain, because really? This book is for the dogs."}, {"userName": "Nicholas Sparks", "userReviewDate": "May 03, 2012", "userURL": "http://www.goodreads.com/user/show/8721294-nicholas-sparks", "userReview": "If you have yet to read this wonderful novel, do yourself a favor and do so. It's original and captivating, and I simply adored Enzo (the narrator ... who also happens to be a dog). It tells the story of a particular family, with twists and turns that keep the pages turning. It's a perfect read for a rainy afternoon or while laying in bed, the kind of novel that you'll remember long after you've finished."}, {"userName": "Lucy", "userReviewDate": "Sep 17, 2008", "userURL": "http://www.goodreads.com/user/show/307208-lucy", "userReview": "I'm shocked...shocked, by how much I loved this book.The narrator is a dog.There is much mentioning of racing - Formula One, NASCAR, Indy....and the narrator is a dog. But I think I mentioned that already.I liked this book so much that it made me want a dog. No, it made me want this dog. And I don't even like dogs.Enzo, a terrier/lab mutt, believes in his next life he will be human. As he feels practically human already, just limited to grand gestures due to his loose-muscled tongue and lack of opposable thumbs, he spends his dog years closely watching his ownder, Denny Swift, to learn the art of being human so that when it's his turn, he'll have a head start.Denny, a race car driver/mechanic/down on his luck dad is a kind owner who loves his dog and uses racing philosophies in his own life. There are many to choose from, but my favorite is, \"No race has ever been won in the first corner; many have been lost there.\" Denny's own story is one of work, patience, courage, endurance, hope, and love. It's not an easy story to read. There are times I felt like throwing the book I was so mad at Denny's in-laws, but (kind of embarrassing to admit here), Enzo kept me sane. I just loved that dog. Just when I'd about had it, he'd make me laugh and I could manage another chapter.Enzo dies in the end. It's not a secret. From the opening pages, you are reading the words of a dying dog. But that didn't take away my sadness in the end. I bawled when Denny held his beloved friend in his arms and says, \"It's okay. You can go.\" Think Where The Red Fern Grows and Old Yeller only for adults. There is some mentioning of \"mounting\" (it's a dog's perspective, remember) and language.Several times throughout the book, Denny or Enzo say, \"Your car goes where your eyes go.\" Enzo knew that applied to life as well. Your life goes where your eyes go. I'm happy my eyes rested on this book."}, {"userName": "Raeleen Lemay", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/3452652-raeleen-lemay", "userReview": "VIDEO REVIEW: https://www.youtube.com/watch?v=-UFYm...Marvellous.There were some things, plot-wise, that felt a bit unnecessary (those damn grandparents) but other that that, I loved this! It never felt weird to be reading from the perspective of a dog, which was a huge surprise to me. Enzo sort of reminded me of Garfield in some ways, like how he had snarky little comments and criticisms that we, as readers, are privy to. It was super entertaining!This was an incredibly emotional story, but it never felt too heavy, which I appreciated. I look forward to checking out more of Garth Stein's books in the future!"}, {"userName": "Matthew", "userReviewDate": "Oct 12, 2008", "userURL": "http://www.goodreads.com/user/show/752750-matthew", "userReview": "Yet another book I was reading as a preview to see if I should purchase it as a gift. Sadly, no.Equally disappointing is disliking the work of a local author. I always want to like local authors (and artists of all stripes), but it isn't always possible.First, I don't think automobile racing is a good metaphor for life. Maybe it is, but I have a bias. I hate the automobile. I think the personal automobile is the single most destructive concept we've conceived. To then race them (in circles, no less) seems pointless at the very best, and perhaps even criminal when one considers the environmental costs. As I said, I'm biased.The reason I read this in the first place was the dog-as-narrator. I'm really trying to find a good dog-as-narrator book. This isn't it. The dog-as-narrator in Stein's book is gimmicky. It doesn't add to the story, it doesn't clarify the plot, and it doesn't enhance the narrative. I kept asking, \"Why is the dog telling this story?\" I still have no satisfactory answer.The narrator was particularly unlikable to me due to his obsession with being reincarnated as a man. It rubbed me the wrong way for several reasons, and seemed to detract from the story whenever it came up. It also underscored my question about why we were listening to the dog in the first place.My final disappointment with this book involved a little deus ex machina action that tied a little bow around the story and robbed it of any emotional truth it had held for me up to that point.Ultimately a discouraging read, but I finished it in the unrealized hope that it would redeem itself.[I should probably read this review after getting some sleep and edit it for clarity and accuracy, but I doubt I will.]"}, {"userName": "Malbadeen", "userReviewDate": "May 21, 2008", "userURL": "http://www.goodreads.com/user/show/128745-malbadeen", "userReview": "A). This book is written from the perspective of a dog.B). The first line of this book is, \"Enzo knew he was diferent from other dogs\"C). This book is written from the perspective of a dog.D).Inside the book there are statements such as, \"That which you maifest is before you.\" and \"No race has ever been won in the first corner; many races have been lost there\".E). This book is written from the perspective of a dog.F). Starbucks is heavily promoting it.G). This book is written from the perspective of a dog.H).The amount of paper being used to promote it should be illegal!I). This book is written from the perspective of a dog.J). Wally Lamb says this book makes him look at his dog and think, \"I wonder...\"K). This book is written from the perspective of a dog.Books about dogs should be writtenA). from the perspective of a humanB). for kids and young adultsC). Not promoted at Starbucks"}, {"userName": "Miranda Reads", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/71848701-miranda-reads", "userReview": "That beginning - whew - nearly shorted out my kindle with the tears. If you're like me (avoiding sad books like the plague), you'll feel the urge to abandon this book after Chapter 1. \nDon't do that.\n There is an absolutely \nbeautiful story \nthat has to be told (and don't worry, the ending is not as sad as the beginning implies.)\nI’ve always felt almost human. I’ve always known that there’s something about me that’s different than other dogs. \n Enzo belongs to Denny (and Eve and Zoe, but mostly Denny). He loves car rides, treats and his stuffed dog BUT Enzo is a peculiar sort of dog. He understands English, the finer points of racing and the emotional needs of his humans. But he's trapped in a dog's body - no thumbs and no talking - and he is in anguish when his humans are hurting. But this has led to one supremely useful skill. As he says, \nLearn to listen! I beg of you. Pretend you are a dog like me and listen to other people rather than steal their stories.\n This book is all about listening - what can be learned and gleaned if only people spent their lives as dogs do. When Eve gets sick, when Zoe is snatched by her grandparents and when his beloved Denny about to truly give up, only Enzo is able to listen. But how can Enzo help them when he's trapped in a dog's body? \nI know this much about racing in the rain. I know it is about balance. It is about anticipation and patience...It is about believing that you are not you; you are everything. And everything is you.\nThis was a truly excellent book - the writing, the plot, the characters - all just stunning. This is one of those books that everyone should read once - it has such a solid story and that ending (oh that ending!) was just what I needed. The 2018 PopSugar Reading Challenge - A book with a weather element in the title"}, {"userName": "Dana Stabenow", "userReviewDate": "Apr 03, 2010", "userURL": "http://www.goodreads.com/user/show/1608124-dana-stabenow", "userReview": "Note on May 18--Oh man. My book club's selection this month. Just started reading it last night. A dog narrator. And car racing. I dozed off in self-defense.May 20--Not my kind of book. Don't read any farther if you loved it.-----Elsewhere on this site my friend Judy compared Garth Stein to Robert James Waller. I think that's insulting to Waller. It felt like Stein had a list -- dog hero, check. Wonderful woman with fatal brain tumor -- check. Adorable child -- check. In-laws from hell -- check. False accusation of rape -- check. Wait, what was that last? Are you kidding me? Daughter taken away -- check.And then of course fairy godFerrarifather -- check. Rape victim recants -- check. Gets his daughter back -- check. Reconciliation with estranged parents -- check. Who also give him check -- check. No good deed goes unrewarded! The top of his profession -- oh of course check, how could it be otherwise. But wait, there's more! Dog reincarnated as human boy and race car driver wannabe!I didn't buy the dog as narrator for a moment. I'm not saying an animal's point of view can't be done, and done well (The Incredible Journey, The Silent Meow, Watership Down, The Wind in the Willows), but not here. And the whole plot was just so implausibly over the top. I put it down at page 3, page 26, and page 29, and then I remembered that I, too, have picked books for book club that people hated. Readers, I finished it. I consider it to be a triumph over my gag reflex.I see now that I've been completely wasting my time for the last twenty years. My next book will be about the mother of a little girl with leukemia as told by their cat. Husband deserts them -- check. Mother loses her job because of bad economy -- check. Has to work three jobs to replace it -- check. She sells their house to pay medical bills -- check. Arrested and child removed by family welfare due to child neglect -- check. Husband's mother sues for custody -- check. Through it all the only comfort is the cat -- check.Child dies. Cat runs away. The abyss.No, wait, this is a cynical feelgood Stephen Spielberg book, what am I saying? Of course the child doesn't die, the child is cured by a all! new! and improved! treatment! Check! Mother discovers an ability to make yarn from cat's hair -- check! Fairy godartgallerymother discovers cat hair sweaters on mother's do-it-yourself website online and gives her her own show -- check! She sells them for millions -- check! Doctor who invented the treatment falls in love with mother -- check! Cat lives to twenty-one and comes back as third child of now leukemia-free daughter, and grandma gives her knitting lessons.On the other hand, Stein's book sold a zillion copies and I'm sure he's crying all the way to the bank. I just hope they don't make a movie out of it."}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "THE ART OF RACING IN THE RAIN by GARTH STEIN is an inspirational, wonderful, and sad story that had me feeling so many different emotions while listening to this book. Laughter...happiness...sadness....anger...and even a few tears. I had chills and goosebumps! That is good writing to make me feel so many different emotions while reading/listening to a book.It was such a touching and uplifting story about the life of Enzo the dog, which was told from his own perspective. I found this story to be quite endearing, enjoyable, sad, and even funny with a few good twists and turns to keep me interested to the very end. Would recommend!Audiobook - The book is performed by Christopher Evan Welch.All of Brenda & my reviews can be found on our Sister Blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "Lisa", "userReviewDate": "Jul 01, 2008", "userURL": "http://www.goodreads.com/user/show/267169-lisa", "userReview": "this is positively one of the most masterfully simple yet profound novels i have read/heard in years. i listened to the audio version on the way back from my last trip to pittsburgh and, as another reviewer commented, it's a tear jerker. i boo hoo'ed quite a bit and then raced to the nearest borders to reread the parts of the story that moved me the most. this story is a fascinating study of the human condition as witnessed by Enzo, the dog narrator. this will at once seize your emotions and provoke more thought than you could ever have predicted. another reviewer asserted that racing is a metaphor for the lessons we are on this planet to learn. we chose the car (body and life) and even the obstacles (rain, curves, speed) before arriving. this concurs with other authors who believe, in spirit form, we chart a path and body with \"masters or guides\" prior to life in this plane (see brian weiss, richard webster, and sylvia brown). through Enzo, this author forced an examination of my sense of purpose...and i am better for having read it."}, {"userName": "Lisa Kay", "userReviewDate": "Jul 04, 2011", "userURL": "http://www.goodreads.com/user/show/2459470-lisa-kay", "userReview": "Ferrari F430\n★★★★★ An amazing book; one of the best I’ve read in over a decade. Some of you, who know me, are aware that I am still friends with my ex-husband; a relationship that spans over 32 years. What you may not know is that he is battling the Big “C” – cancer. Now, after five valiant years, he is debating whether to enter Hospice or not. Needless to say, the last thing I, a dog-lover and ex-ICU nurse, wanted to do was read a book where a wonderful canine, Enzo, on the eve of his death, recalls his lifespan with an owner who races cars. An existence that includes the experience of losing a loved-one to cancer.But, my best friend in the world, Anita Who-Doesn’t-Have-Time-To-Recreational-Read-Because-She-Does-Tons-And-Tons-Of-Reading-At-Work, gently insisted I read this one. And I’m glad she did because The Art of Racing in the Rain is so much more than a book about dying. One reviewer said it is kind of the Jonathan Living Seagull  meets Zen and the Art of Motorcycle Maintenance for dog lovers. It is full of insights into everyday living – and it is full of racing analogies to get us through the realities of life with compassion, warmth, humor and hope. Like life, this book has a few unexpected turns in it. I cried over almost every chapter, but I also laughed. Sometimes I did both at the same time – not recalling which emotion started first. It was very cleansing.Did I mention that my ex used to race “showroom” stock? Consequently, I recall the lazy spring and summer week-ends of our youth spent at some of the race tracks mentioned in this story, with the smell of oil, gasoline, and burning rubber in the salty sea air. Ahhh… to be young, in love, and following your bliss again with a dog at your side."}, {"userName": "F", "userReviewDate": "Mar 24, 2013", "userURL": "http://www.goodreads.com/user/show/8161922-f", "userReview": "Amazing.I just loved it.So sad."}, {"userName": "Mandy", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/30940542-mandy", "userReview": "Tear jerker! I'm writing this and sobbing! What a beautiful work of art. Enzo the dog was such a life force to reckon with. I love him and he's just a made up character! All of these characters... Denny, Zoe, Enzo, Mike, Eve.. Such masterful people! It ended the way I expected but I so loved the very end. Such a perfect ending to the story :) read this!!!!! You will not be sorry you did! Such a magnificent story as told by a dog. Would love to see a movie based on this story."}, {"userName": "Emilie", "userReviewDate": "Apr 24, 2008", "userURL": "http://www.goodreads.com/user/show/119970-emilie", "userReview": "What I loved:1. Enzo is the coolest. dog. ever. And that includes my dog, who happens to be pretty hip. He's caring, he's funny. I love it.2. The way Enzo narrates is awesome. I have a feeling that if dogs - smart dogs, who are about to come back as men - could talk, this is what they would sound like.3. I plowed through this book because I was utterly unable to put it down. It isn't so much that I wanted to find out what happened next in the plot; I wanted to find out what Enzo had to say and what happened to the characters.4. Even though it's clear from the first chapter what will happen at the end, the last 20 pages made me cry great, shuddering sobs. My dog came over to make sure I was okay. I told you he was hip.What I didn't love:1. The language was a little too flowery and contrived at times. Not always, but there were definitely times when I felt like the author was reaching.2. I agree with Erin that not all of the characters were very well developed. Denny was, as was Enzo (generally) and Luca (who we don't meet until the end). But with the others, there was no real motivation for much of their actions. There was too much telling on the part of the author, and not enough showing.3. Along those same lines, some of the plot was the same way. The end felt a bit contrived. I haven't decided yet whether I will read anything else by this author. But all things considered, I loved this book. Read it. Read it now!"}, {"userName": "Nikki ", "userReviewDate": "Oct 21, 2010", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "I was rather sceptical about The Art of Racing in the Rain. I continued to be so as I read, even when I was more than halfway through. It bothered me: the description of Eve's illness, the situation with Annika. And I wasn't sure I was getting much out of it in return for getting so unsettled. I didn't think that much of the narration -- the conceit of a dog narrating the story. Parts just didn't go together: you can't have a really smart dog with ideas on philosophy who then gets confused about really simple things. Neither rang true.But somewhere, around three quarters of the way through, I really began to care. And the emotional punches began to hit, until somewhere in the last fifty pages I found that I was tearing up that little bit (and I needed to blow my nose: gross, but true).It's still, honestly, a bit thin. The central conceit, Enzo's narration, it really didn't work for me. The story itself is believable, but the choice of narrator nearly killed it for me, before I even picked it up. It's also totally unsurprising, in everything that happens, but the end borders on painfully cliché. I still liked it, in the moment, but it's a flaw. It's not something I'll reread, and I'm not sure I'd recommend it, but I'm glad I read through to the end."}, {"userName": "Jamie", "userReviewDate": "Jun 25, 2008", "userURL": "http://www.goodreads.com/user/show/404400-jamie", "userReview": "This book was a gift from my father-in-law, who knows that I like to read and that I like dogs. I knew the moment I read the title and looked at the cover and read the inside of the dust jacket that it wasn’t the kind of book I would ever choose for myself, but it was a gift, and I read pretty much anything whenever I have the chance to, so I decided I’d give it a shot. I made it all the way through, but barely. The first thing I could not help but notice was the writing style, composed of simply constructed sentences and sentence fragments, presented in a generic philosophical style. My next issue was with using a dog as a first-person (er…canine) narrator. I plead guilty to anthropomorphizing my dog, but I still find it annoying when other people do it, and an entire book narrated by a philosophizing dog just doesn’t work for this story on many different, important levels. There are several funny, dear moments, but they happen rarely.Perhaps if I was interested in car racing I would have liked this better. A huge portion of the book is spent discussing races, racing, cars, professional drivers, car racing history, and drawing analogies between car racing and life, repeated over and over in case you missed it the first, second, third, or fourth time. The best part of the book was the first chapter, and then the second to the last chapter. In these pages, Enzo’s voice comes through clearest and most successfully. Besides Denny and Enzo, all the characters are poorly developed and function only in their role to continue the ridiculously dramatic, tabloid-worthy plot which succeeds only in provoking a sense of outrage. Between the shock-and-awe plot jumps, the story is stuffed full of mundane, pointless details and trite catch-phrases meant to be deep and meaningful. I found it to be obvious and artless. I know a lot of people have rated this book highly, but I just can’t. It’s not a terrible book, but it’s certainly not good. Or rather, it is good in the way reading about Britney Spears’s meltdown is good, and it is good in the way listening to one of her pop songs is good. If you’re the kind of person who cringes when the song forcibly modulates up a step and back, and that’s the extent of its harmonic interest, you’ll hate this book. If you have no idea what I am talking about and love that kind of music, you may like this book. If you can’t help but notice bad writing and sentence fragments, this book will bother you. If you don’t care about stuff like that, and prefer sensationalism instead, if you just want to feel outraged and emotional and cry a bit at the unfairness of it all, this book might be for you."}, {"userName": "Ann", "userReviewDate": "May 13, 2008", "userURL": "http://www.goodreads.com/user/show/336445-ann", "userReview": "Judging from the other Goodreads reviews and the recommendations of my friends, I seem to be a minority of one in my low estimation of this book. It's not that I disliked it, per se, but I really resented the way this sappy, anthropomorphic story stomped on every emotion in my body. If you need a good cry for some other reason, by all means grab yourself a box of tissues and a copy of this book and go for it. You can get it all out and no one will ask you what's wrong when they see what you are reading. If crying is not high on your agenda, skip this one and move on to something more worthwhile."}, {"userName": "Anita", "userReviewDate": "Jul 08, 2008", "userURL": "http://www.goodreads.com/user/show/762136-anita", "userReview": "I was a little doubtful I would like this book when I first heard about it. (I mean it was a Starbucks book recommendation and so what kind of new age garbage would I be getting into?) But I need to read more fiction, and I heard from another source it was very good, so I bought it.I was immediately sucked into the book and did not want to put it down. It has very short chapters so I kept saying, \"Just one more,\" and then the book was over. But it is still in my thoughts, a really good sign.I think what held me was that the unique narrator of the book is a dog, Enzo. He thinks very philosophically (and humanly) about life because his master, Denny, talks to him like an equal. Denny is a semi-pro race car driver and they watch lots of racing videos together and Denny tells him about racing techniques required under difficult conditions on the track. Enzo, being the dog he is, applies these techniques to how to get through life's difficult conditions.The book is told from Enzo's perspective on the eve of his death. He recounts his life, which is really his observation of Denny's life and the many hardships Denny, his wife Eve, and daughter Zoe have to live through as a humans. Enzo desperately wants to be human. And this brings humor to his philosophy. He saw on a documentary about Mongolia that if dogs are ready after they die, they come back as humans. Enzo does everything he can to be ready. He longs to experience life as a human. He desperately wants a pair of thumbs and a tongue that will allow speech!If it were a movie, I would have to give it a pg 13 rating for some language and one adult situation. Thankfully the language is very limited and the adult situation is not terribly explicit. A great book about love, loyalty, and the importance of family. I felt a full range of emotions reading this book, another good sign.The only real complaint I have about this book is the picture of a yellow lab or golden the publishers put on the cover. Enzo was a mixed breed with wirey terrier hair...a lab/airedale mix which produced a dog that was sold as a lab/poodle/shepherd mix. I kept fighting trying not to see Enzo as a lab or golden. Both great dogs, but not Enzo."}, {"userName": "Maxwell", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "I haven't given a book less than 2 stars in a very long time because normally I won't finish a book if I'm disliking it that much. But this was for book club and I felt like I should give the whole book a shot; plus the audiobook was well performed and helped me get through most of it. Unfortunately, this book was not for me.I think the idea of a dog narrator is novel and fun—and going into the book I was really excited to see how it was done and read from a unique perspective. However, I thought it was executed very poorly. There was absolutely no logic behind the dog's perspective. Sure, I can suspend my disbelief that we are reading from a dog's POV; that's fine. But if you don't assign some sort of logic to what the dog can and cannot understand, then you've lost me. How can he watch television, understand Mongolian philosophy, and the intricacies of race-car driving but not understand human reproduction or same-sex marriages?Besides that there was nothing really in this book that I loved or even really liked. There were just things I didn't necessarily dislike. Overall I was pretty unimpressed with the story—full of deus ex machina and overused plot points—and all of the characters were one-note. When bad things happened I wasn't emotionally invested enough in the characters to care; and same thing applies for when good things happened. In the end, everything felt too convenient and simplistic and didn't challenge me as a reader in any way.People might claim I'm over-analyzing a sweet, simple story. But I think you can have a nice, light read that is still confident in the reader to put things together, to not require everything being spelled out or simplified for easy consumption. That's how I felt about this book and that's why it gets 1 star. I know plenty of people who absolutely LOVE this book, so don't just take my word for it. If it sounds like it's up your street, give it a go—it just wasn't up mine."}, {"userName": "Carol", "userReviewDate": "Aug 24, 2014", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "2015 Super Favorite!I went into this novel not knowing much about it really, only afraid I wouldn't be able to handle it if it was too sad (being the animal lover than I am) and had already started a great classic play I was eager to get into, but after reading two chapters of The Art of Racing in The Rain I knew it would be utterly impossible to put it down...and it was.This story is so much more than I thought it would be. It is touching, inspirational, filled with kindness, understanding and just an absolutely unputdownable work of fiction. It makes you think about your pet's life and their thoughts through gestures. It even has twin humanoid villains and an imaginary striped demon...and yes...there is some sadness and despair within these pages, but overall, it is a happy, feel-good amazingly enjoyable book.If this is on your agenda to read, don't wait....read it now. If it's not, add it....you won't be disappointed you did. (IMHO)\nI actually feel like starting over and reading it again!"}, {"userName": "Char", "userReviewDate": "May 15, 2015", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "4.5 stars!This novel was as close to perfect as they come. I saw this book going through everyone's feed a year or so back and naturally, my inner rebel came out and I refused to read it. A few weeks ago when I was browsing the available audio books at my local library, I saw this and put a hold on it. Even I can't be a rebel forever. It came in at the end of last week and I finally read (listened) to the damned thing.I just finished one of the biggest crying jags a book has ever caused me. I loved this dog, Enzo. I loved him because he was a good boy. I loved him because he loved and protected his owner so much. I loved him because he is a race fan like me. I just loved him. This is an excellent story about the love of a good dog and the heartbreaks of a close family. It was realistic and extremely well written. I imagine it's pretty difficult to pull off writing a book from the dog's point of view, but Mr. Stein made it look easy. Regarding the narrator, Christopher Evan Welch, he was just wonderful. I never doubted that he was Enzo. I liked his performance in this so much, I looked him up. Which caused another, albeit slight, crying jag because the guy died at age 48. I recognized his face and some of the roles he's played too. RIP Mr. Welch. Overall, I loved this story and all of its twists and turns. I loved the characters-both human and canine. I loved the wonderful narration. And in some twisted way, I loved crying my eyes out, too. I can't say enough good things about this beautiful, imaginative story. Highly recommended, but bring a box of Kleenex, just in case!"}, {"userName": "Andrea", "userReviewDate": "Jun 19, 2008", "userURL": "http://www.goodreads.com/user/show/228427-andrea", "userReview": "This is the best book I have read in a long time!Let me just say - I'm not a race car fan at all, but this book really isn't about race car driving. It's about the love a dog has for its humans, the nature of life, and how - according to the dog - race car driving is a metaphor for all of life. (And I have to admit that I'm crying my eyes out right now!)To start at the beginning, the book is narrated by the dog - Enzo. He is smart and funny, observant and clever, good and loyal. He is everything a dog should be. He watches TV and learns from TV documentaries - although he's never learned to read even though he tried by watching Sesame Street. He thinks that humans are evolved from dogs and not monkeys - as in case study #2 when he says \"The full moon rises. The fog clings to the lowest branches of the spruce trees. The man steps out of the darkest corner of the forest and finds himself transformed into...A monkey? I think not.\" After watching a documentary about Mongolia and how they believe that dog's are reincarnated as humans, he knows that he is a misplaced human soul in a dog's body and when he dies he'll become human. He has it all planned out and while he doesn't long for death, he is certainly ready to embrace it. And so he practices being human and controlling his base animal instincts. His love of race car driving? He watches races all day, and his owner, Denny, is a race car driver. Often they even watch the races together!As the reader, you become intimately connected with Enzo - his every thought and emotion. But reality isn't so skewed in this book that he can talk. He has to communicate with gestures which frustrates him greatly. But that's one reason why this book is SO good...at least if you've ever owned a pet. It's believable. Reading this I believe - I believe that pets could/do communicate with us and understand us. I became completely immersed in Enzo's world.Of course, Enzo's world centers around his family which is absolutely just torn apart by tragedy and maddening circumstances - his wife's death due to brain cancer, his in-laws suing him for custody, a made up law-suit against him so they can win custody of his granddaughter. Visitation rights being revoked, his entire life's savings gone with lawyer and trial fees. Almost giving up time after time after time. Enzo is there narrating the entire thing, giving his perspective of the situation and being there completely and utterly for a human in need.There is a heartbreaking scene when Enzo is hit by a car and Denny rushes him to the hospital. And Denny can't afford to pay the vet bill because he has nothing. And even though Enzo is in such pain afterwards and he never fully recovers, he pretends he is fine for Denny because he knows that Denny doesn't have the money to pay for more vet bills!In the end, everything works out for Denny and his daughter Zoey. And in the end, of couse, Enzo gets what he wishes for. But in the end, he realizes there is so much more to life that he wants to live. In the end he realizes that he doesn't want to leave Denny and Zoey even though they don't need him as much anymore. And in the end, Enzo is reincarnated as a human - a boy who is a natural born race car driver named Enzo who is Denny's biggest fan.I loved this book! Loved it! I can't express how much I loved this book. Go out and read it today!!!! \"Sometimes I believe...Sometimes I really do believe!\""}, {"userName": "Frank", "userReviewDate": "Jun 26, 2008", "userURL": "http://www.goodreads.com/user/show/1196125-frank", "userReview": "I'll start by saying that I'm not much of a \"dog person\" and nor am I a race car fan. I've never been to Seattle, and the novel as fable genre has not done much for me. That being said, after \"The Art of Racing in the Rain\" - I need a new dog, I drive faster, and I loved this book.I had stumbled across three reviews of this book within one 24 hour period, so I felt like I was being led to read this book that on the surface help only a small appeal - a story from a dog's perspective - pretty unique for me. It's the story - at it's core - of Denny and Enzo, man (race car driver among other things) and dog (hoping his father was a terrier among other things). True companions that move through a series of events that lead, as life often does, to heart rendering triumphs and heart breaking tragedies, all as told from Enzo's canine perspective as he looks back on his life as he prepares himself for his soul's next life.The story struck me from the beginning and I just didn't want it to end. Not only because it was entertaining reading, but also as meaningful reading. \"You manifest what is before you\" is one of the philosophical perspectives that the author uses to tie together dog and man, racing and life, and so many other relationships in the story.Intertwined stories of faith, family, failure, hope, and perseverance makes this a very special tale and one I am glad I stumbled upon."}, {"userName": "Linda", "userReviewDate": "Jun 20, 2008", "userURL": "http://www.goodreads.com/user/show/1256523-linda", "userReview": "I expected this to be another \"Marley and Me.\" In that it is about a dog's love for its people and its peoples' love of the dog, the two books are alike. But there is a sad undertone throughout \"Racing in the Rain,\" that I never felt in \"Marley.\"Here's why: from the beginning we know that Enzo (the pooch!) is recalling his life story on the eve of his death. That fact struck like an arrow in my heart because in August I had to put my dog to sleep. A first for me even though I've been around for a few decades.I've had other dogs die, but never before did I have to decide. This time I had to look my poor, sick, trusting Nikki in the eyes and tell her good-bye. Others have walked that walk and know how brutally hard it is. It was the right decision because she was a senior dog with a serious illness, but no less gut-wrenching.Enzo's tale helped me believe that if Nikki could have talked, she would have told me it was okay. She would have said that she was ready to stop hurting and to not be sick. She might have told me she loved me, our family, and would miss us, but she needed to rest peacefully.For any dog lovers, the book is worth reading. For those who just like to read, I recommend it, too. It's a life story, with the ups and downs and peaks and valleys of real life, yet it ends with hope. Something I always appreciate in my pleasure reading.Especially for me, I am thankful for a newfound peace of mind from the book. My sense of guilt in making the decision to end Nikki's struggle eased and I believe like Enzo, she will return to life in human form and I'll bump into her someday."}, {"userName": "Juli", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/38617426-juli", "userReview": "Ever since I was completely traumatized by Old Yeller in elementary school, my policy is to avoid any books that involve the death or injury of pets. This is further cemented in my Bibliophile Personal Commandments List above even the biggies like \"Do Not EVER Dogear Pages, Useth a Bookmark'' and \"No Murderous Spine Creasing.'' When my son came home last year from school carrying That-Evil-Book-I-Can't-Stand, I went so far as to completely spoil the ending for him from the start. That book -- known as OY from here on out as I can't even say its name without cringing -- should come with a warning label for children: Warning Warning Warning....young child has to shoot his pet at the end of this book. Make therapy appointment now in preparation. As it was, my son was the only one who didn't cry in class when they read and discussed the ending. 22 kids traumatized. 1 kid pre-prepared and able to deal. I call that a Mom-win. But I digress.....back to The Art of Racing in the Rain. The above rant does figure in to this -- I promise. When I saw the blurb for The Art of Racing in the Rain, I immediately started my OY-esque shunning behavior. I avert my eyes from you .....oh dog-killing tome! But, the cute dog on the cover did bring my eyes back to the page. Then I read a review. The reviewer said the story is emotional, but kind. That the author gives the dog the love he deserves....not a shot gun blast to the head. Ok. Commandments get broken all the time, right? Gray areas do happen. It's not a Biblio-sin to do a bit of a side-step and let the right one in. So, I took the plunge. I had to do this as a buddy read though. I needed a hand to hold as I read into a plot area I had avoided like the plague for 40 years. This is a beautiful book. Lots of emotion, humor and life lessons within its pages. The dog is one of the main characters and talks a lot about what it's like to be a dog, how he wishes he could talk to the people around him, and even how he wishes often that he had thumbs. Oftentimes while the people around him were fumbling around and really making a mess of their lives, the dog was the one that understood and had the answers. But he had to creatively try to impart his wisdom on his family. Beautiful dog. Beautiful story. A bit of a tear-jerker in spots.....but decidedly hopeful and beautiful as well. The ending was definitely full of joy and hope. Just a lovely book. And I went and hugged all 4 of my dogs when I was done reading. :) I still hate OY. But I'm glad I broke my commandment to read this book. For more information on the author and his books, check out his website: http://www.garthstein.com/"}, {"userName": "Vanessa", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/25545124-vanessa", "userReview": "I enjoyed this so much more than I thought I would. I thought the novelty of the book would wear off quick, a narrating dog, surely not? but I was a believer. I loved Enzo and all his dog thoughts! I thought it such a clever way to tell this story! It was charming, witty and utterly heartbreaking. So many emotions felt during the reading of this book. Not once did I question the validity of Enzo telling this story. I think that makes this book 5/5 for me! Read it and weep. Literally."}, {"userName": "da AL", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/50966750-da-al", "userReview": "The idea for this book is very fun. The carrying out of the idea was just fun. I loved it up till about the last third, where the story seemed to want to turn into a different sort of book. All in all, though, it was a worthwhile read. Audio narration was terrific."}, {"userName": "Jean", "userReviewDate": "Sep 27, 2014", "userURL": "http://www.goodreads.com/user/show/19300421-jean", "userReview": "\"There is no dishonor in losing the race ... there is only dishonor in not racing because you are afraid to lose.\"\"We are the creators of our own destiny.\"The Art of Racing in the Rain is a novel by Garth Stein from 2008, about an aspiring racing driver, his dreams and his life struggles. The novel would be a fairly ordinary contemporary tale, except that it is written from the point of view of the main character's dog, a labrador retriever, terrier cross called Enzo. The dog was named after Enzo Ferrari, the founder of the Ferrari corporation.The convention of writing a book from a dog's point of view is not a new one. There are quite a few whimsical and sentimental stories from Victorian novelists, and more recently James Herbert's \"Fluke\", a full-blown novel in its own right. But whereas \"Fluke\" had a mystery story embedded in it, The Art of Racing in the Rain is more of a story of domestic ups and downs, with a tragic episode halfway through. It is based partly on Garth Stein's own experience with racing cars (and dogs), and partly that of a close friend who was having family difficulties. Stein himself stopped car racing after having a crash whilst racing in the rain.Underpinning the story, however, is an allegorical element about the journey of life. The idea of how life should be lived was inspired by a 1998 Mongolian TV documentary, \"The State of Dogs\". The Mongolian belief is that dogs return to this world as humans after they die. The dog Enzo watches the television quite regularly in the story, car races being a particular favourite. He too sees the documentary about Mongolian dogs, and decides to base all his future behaviour on the belief that,\"when a dog is finished living his lifetimes as a dog, his next life will be as a man,\" adding, \"I've always felt almost human. I've always known that there is something about me that's different than other dogs.\" Enzo began to view other dogs in terms of whether they had reached the higher spiritual state, or whether they needed to live a few more dog lives first,\"Not all dogs return as men, they say; only those who are ready. I am ready.\" Enzo often feels trapped in his dog form, and very excited at the prospect of reincarnation. After watching the programme he is absolutely convinced that he will return as a human, and his actions show he is mentally capable of doing all of the things intelligent humans do. But because he is without the ability to speak, he is made incapable; he is merely a dog,\"I see green as gray. I see red as black. Does that make me a bad potential person? If you taught me to read and provided for me the same computer system as someone has provided for Stephen Hawking, I, too, would write great books. And yet you don't teach me to read, and you don't give me a computer stick I can push around with my nose to point to the next letter I wish to type. So whose fault is it that I am what I am?\"Enzo frequently conveys his messages by other means. He is a human in dog's form, constantly frustrated by his lack of thumbs and abnormally long tongue. His complaints about these do provide some gentle humour,\"Those monkey thumbs were meant for dogs. Give me my thumbs you darned monkeys!\"He is also in deadly fear of a stuffed toy giraffe, which seems to him to have devilish powers,\"the demon, the evil zebra, the dark creature that possessed the stuffed animal ... Trust me when I tell you that devils like the zebra are real. Somewhere the zebra is dancing.\" Only on one occasion do Enzo's dog instincts overpower his reason. It is a very emotional episode, and all he can do is run and run. Afterwards he feels he has let both himself, and his master, down. The advantage to Enzo in being in a dog's body is that people give away their secrets to him. They always feel safe in disclosing their worries to a \"mere dog\". He also can anticipate some events before they happen, because of his exceptional sense of smell, and understanding of body language.The story is told in flashback. At the start of the novel Enzo is in constant pain. His joints are stiff, he can barely wag his tail - clearly he is at death's door. Yet his only concern is that his master Denny will not be too hurt about it. Enzo is looking forward to his death because of his belief that after his death he will be reborn as a human. He is excited waiting for this transformation to a human life, and imagines meeting the people he knows and loves when he is in a human body. So the reader knows what is to come, when the story then rewinds to when Enzo is brought home from a puppy farm by a much younger Denny. The novel tells of his early happy years with his master, the boy-meets-girl tale of Denny and Eve Swift, and the consequent routine of happy families in Seattle with their baby Zoe. What we do not yet know is what is going to ruin this domestic harmony enough to make us want to carry on reading about it. And the novel does deal with huge life and death issues. It depicts a lot of contemporary stresses, legal battles, illness, and tragedy in the second half of the book. They are all observed by Enzo, with a view to what he, in his doggy role, can do to help the situation.The novel's weakest points are when Garth Stein places too much emphasis on telling his main story. There is a lot about death and dying. We know that Enzo is extremely intelligent and perceptive, yet the fact that he is a dog is sometimes lost, except at key points, such as when Enzo is not allowed inside the hospital. It feels very much as if this is added on for verisimilitude, and the focus, that the events are viewed by a dog, has been lost.The allegorical parts are an interesting take, but the homespun philosophy does become a little wearing. It is not perhaps as illuminating as the author intended. Denny hopes to be a champion Formula One driver some day and Enzo shares this dream, this love of speed and both physical and emotional control. \"Your car goes where your eyes go.\"One of the most valuable skills that Denny has is his exceptional skill at driving in the rain, not fearing the wet track or skidding. He has the ability to anticipate what will happen next, and taking charge; responding to it before it happens,\"If I intentionally make the car do something, then I can predict what it's going to do. In other words it's only unpredictable if I'm not ... possessing ... it.\"There are quite long parts of the novel where Enzo is philosophising, and using racing as a metaphor for life. It does not really need to be hammered home so insistently. The novel's title itself if a metaphor for life; life can be compared to racing car driving. Events in the novel illustrate that it is about much more than speed alone, that life involves change, acceptance and overcoming hardship too. \"I am a racer at heart, and a racer will never let something that has already happened affect what is happening now.\"But the main message is that living in the moment is crucial; life is about about learning \"how to race in the rain\", and living to your full potential. As Enzo says,\"With your mind power, your determination, your instinct, and the experience as well, you can fly very high ... My soul has learned what it came to learn, and all the other things are just things.\""}, {"userName": "Michael", "userReviewDate": "Jan 04, 2014", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "Despite being sappy with melodrama and rather silly how humanly wise the dog is portrayed, I enjoyed the illusions as a fantasy and the overall metaphors for life from the world of car racing. The tale here is a narrative from the mind of Enzo, an airedale mix living in the Seattle area with his beloved master Denny, a race car driver. We experience a dogs-eye view of his courtship of Eve, the birth and babyhood of their daughter Zoë, a family crisis from a slowly developing medical condition of Eve, and the disastrous, evil interference from Eve’s parents. Denny is gone a lot for his career, often leaving Enzo in the poor care of others. What shines through is how much Enzo is part of the family and a true friend to Denny through his travails and triumphs.Who knows how much dogs understand of human affairs? It’s not hard to believe that they can read emotions in speech and achieve some levels of understanding. Certainly their mammalian limbic system is sufficient basis to believe they could be subject to a broad range of emotions common to humans, including hope and despair, pride and shame, empathy and disgust. Supposedly, the true test of self-consciousness is awareness of one’s own mortality. For me, the biggest source of grief at losing a beloved dog is that they have so little understanding of what is going on. The book starts with Enzo in decline and imagining his coming end, so readers who are wary of mercilessly getting emotionally jerked around over loss of a creature innocent in their ignorance can take some heart. Still, I have mixed reactions over Enzo believing he will be reincarnated as a human. It is a “nice” fantasy nonetheless. Ultimately, I was disappointed with how knowledgeable Enzo was, undermining the magic of a dogs-eye view. For example, it’s a bit too cute that he has a long list of favorite actors and movies. And his understanding of how metaphors from car racing apply to lessons for life is a bit much coming from a dog. At such points, imagining Enzo as a stand-in for an omniscient narrator is the best strategy. Then I could appreciate the tie-ins of the story to such lessons as: The race is long—to finish first, first you must finish.One can never be angry at another driver for a track accident. One can only be upset at himself for being caught in the wrong place at the wrong time.At one point, Enzo gets to ride with Denny in a test run around a track, and we get something closer to a dog’s experience:Faster! The feeling. The sensation. The movement. The speed. The car. The tires. The sound. The wind. The track surface. The apex. The exit. The shift point. The braking zone. The ride. It’s all about the ride!I end up rendering 3.5 stars for this as a fantasy of a dog’s life. This leave room at the top for dog stories that really shine, such as “White Fang”, Mowat’s “The Dog Who Wouldn’t Be”, and Kerasote’s “Merle's Door: Lessons from a Freethinking Dog”."}], "description": "Enzo knows he is different from other dogs: a philosopher with a nearly human soul (and an obsession with opposable thumbs), he has educated himself by watching television extensively, and by listening very closely to the words of his master, Denny Swift, an up-and-coming race car driver.Through Denny, Enzo has gained tremendous insight into the human condition, and he sees that life, like racing, isn't simply about going fast. On the eve of his death, Enzo takes stock of his life, recalling all that he and his family have been through.A heart-wrenching but deeply funny and ultimately uplifting story of family, love, loyalty, and hope, The Art of Racing in the Rain is a beautifully crafted and captivating look at the wonders and absurdities of human life...as only a dog could tell it.", "title": "The Art of Racing in the Rain", "url": "http://www.goodreads.com/book/show/3153910-the-art-of-racing-in-the-rain", "average": 4.2, "cover": "https://images.gr-assets.com/books/1377206302l/3153910.jpg", "reviews": 33344, "authors": [{"url": "https://www.goodreads.com/author/show/194531.Garth_Stein", "name": "Garth Stein"}], "type": ["Fiction", "Animals", "Animals", "Contemporary", "Adult Fiction"], "outlinks": ["http://www.goodreads.com/book/show/3153910-the-art-of-racing-in-the-rain", "http://www.goodreads.com/book/show/2686103-the-art-of-racing-in-the-rain", "http://www.goodreads.com/book/show/9828666-the-art-of-racing-in-the-rain", "http://www.goodreads.com/book/show/34845477-the-art-of-racing-in-the-rain", "http://www.goodreads.com/book/show/4951746-the-art-of-racing-in-the-rain", "http://www.goodreads.com/book/show/3144123-the-art-of-racing-in-the-rain", "http://www.goodreads.com/book/show/6980839-the-art-of-racing-in-the-rain", "http://www.goodreads.com/book/show/8695258-the-art-of-racing-in-the-rain", "http://www.goodreads.com/book/show/11062338-the-art-of-racing-in-the-rain", "http://www.goodreads.com/book/show/13258121-a-sudden-light", "http://www.goodreads.com/book/show/9786641-racing-in-the-rain", "http://www.goodreads.com/book/show/613959.Raven_Stole_the_Moon", "http://www.goodreads.com/book/show/18112204-how-evan-broke-his-head-and-other-secrets", "http://www.goodreads.com/book/show/11100623-hotel-angeline"]}