{"ratings": 136, "userreviews": [{"userName": "Patricia", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/6975222-patricia", "userReview": "Please Note: This is a review of the Advanced Reader Copy of “The Affair,\" which I won on Goodreads. I don’t know how much it will be edited and how much the story will be revised, though I hope it will be substantially revised. Several chapters into the story, the only adjective I had in my mind was “chaotic.” This story is so chaotic at times that it is hard to tell what is happening and who this story is about. Midway through the chaos leveled out, but I have to admit that it took determination not to toss this book into not one but two bonfires. In the end, the story became very chaotic once again. The shoelaces need to be tied up! Shoelaces of characters that would have been better had they been made of a simple Velcro instead. It was sad to see them trip all over the place. Many times this story felt very flat, as though it was a bit in a newspaper. The writing was very journalistic as opposed to what it should have been...creative. And not good journalism. Rookie journalist yellow journalism. Tabloid in the supermarket journalism. Drama over misunderstandings, what ifs, and half-truths. Drama due to immaturity and ignorance. Or perhaps it was more like a made for television family drama...a very bad one at that with no A- or B- or even Z-list actors and both plots and sub-plots tossed in for good measure. The commercials were no better---a few scribbles on yellowed scraps of paper….written by an author in a story that had held so much promise and whose sense as a writer I never got. At least the cover of the book is pretty. Not really. Not if you look closely. The lovers are made of stone and exist only because someone was commissioned to sculpt them. Reminds me of Celia and her Alexei. Reminds me of Margaret and Charles. Reminds me of Celia and Frederick. And the beautiful and colorful Monarch butterfly on his shoulder….Katharine was no butterfly---she wasn’t created that way. In fact, she was barely created at all. A small moth on Celia’s shoulder might have been better….then again, probably not. We have a beautiful evergreen next to them with a few yellow leaves and the words “THE AFFAIR” in bold. All I can think of is this: Two affairs that never really happened and a Whopee of an affair that did and that I really could care less about. I wanted Celia. I wanted Frederick. I even wanted Alexei. But I never got them. In the end, I was left settling for a Bud that never really blossomed, which wasn’t the point at all--at least my sense of logic tells me this. This was Celia’s story, perhaps it came out this way. Celia’s voice cut off much like she cut Frederick off from her heart---referring to him many times only as F----. What pains it must have been for Celia to write out the R-E-D-E-R-I-C-K when referring to her most handsome and beloved husband. There is a Celia, and a Frederick. A Charles and a Margaret. There is a cold house with warmth and a warm house in the cold. There is England, and Africa. There is a Crinkle of a Sarah and a Whoopee of a Derek. There is a Bud of an Emily and a Spud of a Stephen. A Bet and a Jack and a few abortions even.There is a Mel, a Robert, a Guy and a Jenny. A Theo and a Evie. There is an Albert and an Ella. A Priscilla and a Rupert. There is even an Alexei. A cold war, a café, a hotel and an iron curtain. Has this tune been played before….Sam? There is a William and yet another Sam and a dog with a leg of lamb...or was it a ham?There is a little girl and her Mother, Helen. She was a Farmer you know. There was a ghostly Naomi, who never spoke a word. A house near the water, the beach and a lime tree. A garden, its keeper, and a Lady. There is a Miranda and a bastard baby to be....a girl of course. Could have been worse…thankfully Miranda quit seeing red.They say it was the war. They say it was the suicide. Then came the soldiers, the boats and the wrens, nesting with papa birds that didn’t belong to them. There was a beach and a garden and a lime tree---oh, I already said that. The garden it withered and became overgrown as gardens do once time turns their keepers into the soil that once was their toil. Rest in peace good Mr. Peters. Perhaps you will meet the little girl you once saw in the shadows. Naomi is her name if you don‘t recall. There was a Lady with a bottle of wine. In fact, there was a lot of wine, but not as much as there was tea for as you know this happened (for the most part) in England which was then imported to Africa across the high sea…....There were children sent off to boarding school, emergency hospital visits and a mother who was quick to un-worry. Shiny teeth on servants and a snobbish aristocracy. There were a couple of cats. A Georgette and a lady. Scratches on a face and a call in the night that gave Celia quite a fright. No worries everything turned out alright. And the cat lady had never purred---at least not with Frederick, though he doggedly left Africa--Celia in tow and a career in a fever---cat scratch it was rumored. There were ghosts remember? One was a moth. One was a sweet little girl. A best friend if you will….I never met her. Oh how I wanted to. A playing of dolls, a sharing of secrets, the things best friends do. She wanted to be, at least for me. And the moth. He had a handsomeness to him I suppose. Not like the handsome Frederick who might have been the Monarch on the cover, after all he was King of his castle and made no bones about it you know. No, Alexei’s beauty --handsomeness was somewhere in those brown fibers. If only he could get out of his cocoon. But not matter. These the two ghosts didn’t really matter. There was a lady ghost. Not the lady with the wine---though the lady ghost tipped her elbow quite often as well. Whiskey. And oh it left a sour taste in her mouth! Thank goodness for eternal repose lest she sour herself and Frederick in the process some more. But it wasn’t his love for her, it was the crash due to drink that caused the worry in the man. Oh, Frederick was handsome, that much is true, but when it came to taking care of your foolish youth what can you do? Handsome that is only skin deep is too small to measure its what’s inside that is all the treasure. If only Celia had seen she would have known, Frederick thought, and her love for him and his handsomeness would never have grown. But of course it would have, for these people are shallow and Celia is crazy. And they only lost out on true love due to her stupidity. Celia you wallow in your own abysses while sharing with Frederick your sweet false kisses. What a foolish and pathetic child of a woman!Poor poor Celia! A writer who wrote real people, but never shared her realness with others. Not mothers, not friends, not children or lovers. Toss it to the bonfire! Toss it all!! Toss the old house that wasn’t left standing. Toss all of Celia’s immature misunderstanding! Toss the affairs that never took place! Toss the car that Frederick shouldn’t have raced! Toss out the computer that remains off to this day! I don’t want to know what lies inside it now anyway. Toss out the extras! Toss out the tea! Toss out the once beautiful but now mine ridden sea. Toss all of the cats. Toss out Whoopee! Toss out the old roses! Toss out the painting!! Toss it all!! Throw it away! Down from the attic! Who really cares? The reader is left in a world of blank stares! What happened? It was so promising…. Toss out the drama and give me the story. Kick out the journalism. Please in a hurry! Stop and relax. Pull out the red pen. Edit and Edit and then Edit again. There once was a girl who lived in a house. She had a mother who loved her and father who was dead. She was lonely and so she made things up in her head. She grew up and married a handsome older man who already had a story. Even so, he wanted to write a new one with her. And so they ventured on their story. But what she did, was heartbreaking. She wrote stories in her head about her significant other. His actions and thoughts, but she didn’t have a right to. Oh poor Celia! Of course, the photograph was of someone he loved. But not of a lover. He was, though she didn’t know, a one time grieving brother. But she hated him anyway even when she found out. If he hadn’t become a living vegetable, she would have tossed him right out. Oh poor Frederick! This story is sad, but because of the beginning. There was a time Celia’s smile and love for Frederick was never-ending. In photographs she didn’t have to be told to smile. But she lost that and it seems her mind as if she ever had it, after a very short marital while. Her mind it played tricks on her and her sense didn’t let her see that their true love needed true love from her so it could be. Oh poor Celia!Frederick was an army man you know and never had much to say. But what he said Celia never heard anyway. But still he loved her and couldn’t understand why she expected him to be an emotional man. He never lied, but he omitted and for this he hoped he’d be acquitted. But he was charged and guilty found and so their chance at TRUE LOVE never took ground. Oh poor Frederick! Oh poor Celia!But the saddest of all, and though I don’t know why, Celia made up an affair and she made herself cry until the day she died. If only she could have woken up and grown up and seen the love that she had. Not in a moth, not in a cigarette, not in a painting---but in the hands of the tall dark-haired handsome Frederick. I can only assume. I can only surmise. But really it comes as no great surprise. You can’t love another until you love yourself and count yourself of worthy of wonderful things: Of forgiveness in love and the TRUE LOVE it brings. THE END.A long way to say: “This one is a miss for me.”"}, {"userName": "Mary", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/4427991-mary", "userReview": "Over the years, Celia Bayley's books had inspired her readers and won her legions of fans. It was generally considered that Celia's comprehension of the ways of human heart was almost legendary - and that those insights are what made her famous as an author. And why shouldn't Celia Bayley's fans believe this? After all, she had married a handsome war hero and produced three successful children - the very definition of a 'happily ever after' kind of life. Yet, as Celia's family gathers together for her funeral, the diaries and notebooks and letters she left behind paint an entirely different picture - one that shocks those who loved her and will ultimately force them to confront the difficult conflicts in their own lives.A life torn apart by secrets is revealed. The husband Celia adored deceived her early in their marriage and had broken her heart, although they persevered as a family. Then, years later while on a trip with friends, she meets a man for whom she feels a passion she never believed was possible. In one brief moment, Celia's life is turned inside out, and she is faced with an agonizing choice.I thought this book was beautifully written. It took me a few pages to get into the story, but once I got the characters straightened out, the story became easier for me to follow. The characters were sympathetically drawn, and I found myself caring for them and the various dilemmas in which they found themselves. Extremely powerful and moving, this book is ultimately about marriages, families, and the definition of personal happiness.I must admit, despite some unanswered questions left in my mind, this book was exactly the kind of story that I like to read. I give this book an A+! and will certainly keep my eyes open for more books by this author to read in the future."}, {"userName": "Molly Vercillo", "userReviewDate": "Nov 02, 2011", "userURL": "http://www.goodreads.com/user/show/6643918-molly-vercillo", "userReview": "I received an ARC of this book through Good Reads First Reads. I wanted to give this book a fair chance despite the negative reviews. Unfortunately, my best efforts finally fizzled out as the pages were turned. Between a huge (and often pointlessly so) cast of characters and a plot that for the most part, falls flat, I just couldn't get into it. The idea behind the book is a good one, unfortunately the end product didn't reflect that."}, {"userName": "Natalie", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/5856384-natalie", "userReview": "I received this book through a Goodreads giveaway. The book is about Celia, a successful writer who had a secret affair that was uncovered after her death by a journalist writing her biography. The book was a little slow to get into with lots of characters that weren't really developed. At points the book seemed to build up to something but then fell flat."}, {"userName": "TJ", "userReviewDate": "Nov 04, 2011", "userURL": "http://www.goodreads.com/user/show/2346207-tj", "userReview": "4.5/5.0Don’t let the title of this book fool you! Whether one likes it or not, this story is a complex, rich masterpiece full of layers that makes one think. For a complete review, visit Affaire de Coeur magazine, hard copy or online, March 2012 issue."}, {"userName": "Ang", "userReviewDate": "Jun 02, 2012", "userURL": "http://www.goodreads.com/user/show/39727-ang", "userReview": "Meh with a side of meh."}, {"userName": "Lisa", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/984947-lisa", "userReview": "I received a free advance reading copy of this book through a Goodreads First Read giveaway. Lovely book."}, {"userName": "Adrian", "userReviewDate": "Dec 12, 2011", "userURL": "http://www.goodreads.com/user/show/6146629-adrian", "userReview": "I tried liking this book. I tried for weeks. I forced myself to keep reading by telling myself that it would get better. I finally gave up. And I have to say I absolutely HATE not finishing books that I've started. If I start reading it, I feel like I have to finish, even if I don't like it. Most times, the book gets better and I'm glad I stuck with it. That was not the case with this one though. I made it to page 195/290.The copy I have, I won from the Goodreads First Reads giveaway. It's an advanced reader copy. I hope, really REALLY hope that they made a lot of changes before printing the final copy.If I had to describe this book in one word, I'd say it's confusing. It's written in 3rd person, but it doesn't really pick a character or three to follow. It jumps around so much it's confusing. I'd compare it to throwing you into the middle of Christmas dinner of a family you don't know and describing what everyone's doing and who they are and how they're related...all within a few short pages. It's really hard to keep up. And then after the chaotic start, it dies. In the beginning, I was struggling to understand who was who and such and then next thing I knew, I was skipping paragraphs...then skimming over whole pages. It just never grabbed my attention and made me want to keep reading. And I hate admitting that. I really wanted to like the book. But I just couldn't.Another issue I had was the way things were worded and sentence structure. I'm no grammar nazi by far, but the sentences just didn't flow right for me. It felt like the book had been written in a different language and then poorly translated into English. I had to read some sentences a few times in order to understand what the author was trying to say."}, {"userName": "Ann", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/4849602-ann", "userReview": "Free ARC through First ReadsI am no stranger to books with a large cast of characters. I love them - but only when those characters serve a purpose. Sadly, most of the people in The Affair are pointless. The large cast wanders about, but none of them have any weight. They are bland and interchangable for the most part. The Bailey family is repressed. The end. Most of them behave the way they think they should, and they do not speak honestly or openly, and it makes them a little unhappy and deadly dull.There's no conflict in this book. It appears there is - the reader is teased with the knowledge of a life-changing affair - and then, nothing. We get the reveal, and the book is over. Things happen, but the family is much as it was before. There is some growth, but it is perfunctory. This happens, then that, and there is no exploration or follow-up. The author has good ideas, and there could be a story here. However, she does not know how to tell that story. There's a lot of off-stage action, and major developments are rushed. I felt like I was reading an outline for a book, not the finished product.I wanted to like this, and sometimes parts of the book were very successful (all of Celia's youth was interesting) but in the end I did not care about any of the characters because I did not know them."}, {"userName": "Kathy", "userReviewDate": "Nov 30, 2011", "userURL": "http://www.goodreads.com/user/show/6843550-kathy", "userReview": "First, I must disclose that I received a free advance reading copy of this book through a Goodreads First Read giveaway.Celia Bayley seemed to have the perfect life. She was a successful writer, a beloved mother and grandmother, and wife of a handsome and successful soldier. After her death, her family is faced with the fact that she may not have been the woman they thought they knew at all.As the family uncovers the truth surrounding Celia's life, they also uncover a new idea of what constitutes love, happiness, and success. While Celia was writing wonderful works of fiction, she was also living one and trying to live up to a past that never existed, just as her children have been trying to do. Through her death, and the discovery of her true life, her children begin to gain new understandings of their own lives.Alicia Clifford's novel is a beautiful story of love, loss, and family. It is wonderfully written, filled with stunning imagery and heartfelt emotion. At times, the flashbacks and character changes may seem confusing, but as one becomes more familiar with the characters and the story, this becomes less of an issue and sometimes even aids in whisking you off into the world of Celia and her family. Soon you become completely wrapped up in a world somewhere between truth and fiction, the world of Celia Bayley. A definite must-read."}, {"userName": "Sheri", "userReviewDate": "Jun 11, 2012", "userURL": "http://www.goodreads.com/user/show/1982-sheri", "userReview": "I really enjoyed this book. Celia and her mother go to live in house by the sea, her mother as head housekeeper, after her father dies. They are in dire straights and Helen, her mother needs a way to provide for herself and her daughter. There are many interesting characters that serve the lord and lady, who kive on the other side of the house. Celia is glad they live on their side because everything and everyone is so much more intersting and lively. Celia marries quite young, at 17, to a commanding soldier who has become quite enamored with her on a visit to Far Country, the name of the estate. Not knowing that she is the housekeeper's daughter. he makes her keep her background a secret after the marriage. There are several secrets, in fact, that Fredrick and Celia have throughout their lives that their three children discover after Celia dies, several years after her husband. I love books that have secrets. Much more fun to read, not knowing what you'll find!"}, {"userName": "Pam", "userReviewDate": "Dec 07, 2011", "userURL": "http://www.goodreads.com/user/show/5089871-pam", "userReview": "I won this as a first reads off goodreads. It was an enjoyable book that went back and forth between two generations. When a woman dies it's up to her kids to go thru her things. What they find shocks them. The mother was a writer and had lots of papers everywhere. She also didn't come from where she said she did. She changed her life for her husband who had secrets he kept from the kids. The kids are all dealing with issues themselves. Pregnancy, infidelity, bad marriages you name it they have it going on. I really enjoyed reading about the family. It keeps you guessing about family secrets with a shocker at the end."}, {"userName": "Tanya T", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/52576289-tanya-t", "userReview": "At first I was going to quit this book because the characters and settings were mainly in the UK and that is just not my thing. Once I got past the confusing British slang and by chapter 3 I was pulled into the storyline. Though at times I was a bit annoyed with The main character and her obsession over her husband's deceased first wife. She never seems to give her husband a break for not revealing he was a widower when they met. In my opinion he never gave her a reason to be jealous of his first wife so I don't understand her bitterness towards the deceased wife."}, {"userName": "Jenny", "userReviewDate": "Mar 31, 2012", "userURL": "http://www.goodreads.com/user/show/1485924-jenny", "userReview": "Throughout the book, I struggled with the long list of characters and their relation to each other. I would have to keep checking back on previous pages. Also, the chapers were written by different characters and different points of time. However, I liked the ending of the story and how it tied all the events together. In hindsight, I should have written a family tree to help with the characters."}, {"userName": "Patricia Cal", "userReviewDate": "Apr 08, 2012", "userURL": "http://www.goodreads.com/user/show/5476265-patricia-cal", "userReview": "Very interesting family dynamics. If you come from a family which, interacts on a daily basis, I am sure you will recognize your own family members, in the progression of the story. Celia Bayley can be identified as a strong woman, holding her family and herself together under adverse circumstances. Every woman has a hidden moment in her life shared only with girlfriends and not family members."}, {"userName": "Rebecca Gernon", "userReviewDate": "Aug 31, 2012", "userURL": "http://www.goodreads.com/user/show/6069583-rebecca-gernon", "userReview": "Slooooooow moving. I think this story could have been told in 50 pages, but I was trapped with nothing do to because of hurricane Isaac so I plodded through it, skimming much of it. Characters seemed shallow, I think because they lived most of their life with deceit, not telling the truth. I kept hoping something would happen, but it never did. A few nice images, but that was it."}, {"userName": "Tomio", "userReviewDate": "Dec 16, 2011", "userURL": "http://www.goodreads.com/user/show/5698290-tomio", "userReview": "I won this book from the Goodreads giveaway.The story was a bit too slow for me but Alicia made up for it in her desriptive style of writing. I loved the many characters she created. I also liked that the details of the affair were not revealed at once but slowly throughout the book. It is a book that made me think more of my own relationships."}, {"userName": "Courtney Wagner", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/6964994-courtney-wagner", "userReview": "Didn't get great reviews on goodreads but I liked it. Not an easy read but a really interesting story. It was hard to keep track of all the characters but by the middle i knew them and didn't have to keep going back."}, {"userName": "Shane Cormier", "userReviewDate": "Dec 06, 2011", "userURL": "http://www.goodreads.com/user/show/6236173-shane-cormier", "userReview": "I really enjoyed this book. It did keep you a little confused at times but if you can keep up with it and dont mind a lot of back and forth, then you should be ok lol. It kept my brain on its toes with lots of information and lots and lots of description. Thanks for the win. Its a shelf keeper."}, {"userName": "Sneaks", "userReviewDate": "May 30, 2015", "userURL": "http://www.goodreads.com/user/show/15337939-sneaks", "userReview": "Received this book as a gift. Although I enjoyed it overall, I did find that there was a larger group of superfluous characters who could have perhaps been \"condensed\" into fewer characters with real substance. However, the story line was very intriguing."}, {"userName": "Teddi", "userReviewDate": "Nov 11, 2013", "userURL": "http://www.goodreads.com/user/show/14229630-teddi", "userReview": "an interesting exploration of what happens when a family discovers more about their mother's and father's characters.... there is a lot of sadness...."}, {"userName": "Sue", "userReviewDate": "Feb 18, 2012", "userURL": "http://www.goodreads.com/user/show/2400987-sue", "userReview": "Could not finish the book. Made it about 50 pages in. Too many characters and too much back and forth between the present and the past - confusing."}, {"userName": "Gingerkat", "userReviewDate": "Aug 28, 2012", "userURL": "http://www.goodreads.com/user/show/7657876-gingerkat", "userReview": "Fair to middlin. Had some good family interaction."}, {"userName": "Diannablack123gmail.Com", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/53169389-diannablack123gmail-com", "userReview": "Well written and kept me guessing til the end :) I love that!"}, {"userName": "Karen Mcdonald", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/8713260-karen-mcdonald", "userReview": "I liked \"The Affair,\" it was different from what I have been reading and in fact was a bit of a period piece which I usually can't get into. A good story!"}, {"userName": "Kay", "userReviewDate": "Jan 21, 2013", "userURL": "http://www.goodreads.com/user/show/150752-kay", "userReview": "Sorry just couldn't get into this book. Too many others out there to read instead of forcing myself to finish."}, {"userName": "Jennifer", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/18781974-jennifer", "userReview": "Wow!"}, {"userName": "Debbie", "userReviewDate": "Dec 12, 2013", "userURL": "http://www.goodreads.com/user/show/2533847-debbie", "userReview": "Tried to read this but couldn't! I could not follow it! Next time I will read the reviews!"}, {"userName": "Debra", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/9027662-debra", "userReview": "Clifford introduces a lot of characters in a short time. I found it helpful to create a family tree to help me remember. Once I had the time to devote to reading, the book progressed quickly."}, {"userName": "Rita", "userReviewDate": "Oct 13, 2012", "userURL": "http://www.goodreads.com/user/show/5920970-rita", "userReview": "I really enjoyed this. Interesting family story. Very believable. Readers who rated it low missed the whole point."}], "description": "\"All happy families resemble one another, each unhappy family is unhappy in its own way.\" --Leo TolstoyAs a writer, Celia Bayley's insights into the ways of the human heart made her famous. And why not? She had married a handsome war hero and produced three successful children. Yet, as her family gathers for her funeral, the diaries and notebooks and letters she left behind paint a very different picture, one that shocks those who loved her and will force them to confront the difficult conflicts in their own lives.A life torn by secrets is revealed. The husband she adored had deceived her early in their marriage and broken her heart, though they persevered as a family. Then, years later while on a trip with friends, she meets a man for whom she feels a passion she never believed possible. In one brief moment, her whole life is turned inside out. Utterly compelling and beautifully written, The Affair makes vividly real the agonizing choice one woman must make. Powerful and moving, the novel is about marriage, families, and the definition of happiness.", "title": "The Affair", "url": "https://www.goodreads.com/book/show/12160844-the-affair", "average": 2.95, "cover": "https://images.gr-assets.com/books/1318518197l/12160844.jpg", "reviews": 35, "authors": [{"url": "https://www.goodreads.com/author/show/5074282.Alicia_Clifford", "name": "Alicia Clifford"}], "type": ["Fiction", "Womens Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/12160844-the-affair", "http://www.goodreads.com/book/show/38319169-f-r-immer-deine-celia"]}