{"ratings": 28848, "userreviews": [{"userName": "Aubrey", "userReviewDate": "Aug 19, 2011", "userURL": "http://www.goodreads.com/user/show/412355-aubrey", "userReview": "First I have to say---what a tremendous book! I don't usually read thrillers---I usually find them too stressful to read on top of everything else I have to deal with in life---and also the title threw me off initially because reading about atrocities done to children is not something I want to read about (if the last bit throws you off too, take it from me as someone who can't read that sort of stuff, you will be surprised when you open this book what it actually turns out to be---I can't say more than that without giving anything away) but this book had gotten a lot of buzz (the NYTimes wrote a very positive review but be warned it also includes lots of spoilers: http://www.nytimes.com/2011/11/17/boo... ) and my friend Juliet Grames HIGHLY recommended it to me. All that being said it has been a long time since a book has kept me up several hours after I should have been asleep on a work night and this one certainly did that! I roared through this book!So, what I liked about it:-The main characters/mystery solvers are women. They are not stupid or vapid---they are strong and intelligent---of course they have flaws but their flaws make them supremely interesting and truly make you care about them. They also compel the reader to keep reading to see what decisions these women will make next----they are unpredictable while at the same time they feel like women you might know or might have met at one time or another.-This story was believable and all the characters' actions rang with truth---every character had very specific motivations---they were all very fleshed out.-I felt the pain of the characters---and everything was very visceral. -Short chapters and great pacing made this book a breeze to go through.-I felt like I was right in the story and could visualize everything going on.I would recommend this to people looking for a great thriller---I would also recommend this to anyone who likes to read books involving strong female characters. This recommendation would be made to 2 separate groups.I could definitely see this book being made into an incredible film.I will buy a copy for my boyfriend's Mom who likes thrillers---I think she will love this one."}, {"userName": "Doreen", "userReviewDate": "Apr 17, 2012", "userURL": "http://www.goodreads.com/user/show/8083149-doreen", "userReview": "A three-year old Lithuanian boy is kidnapped;his single mother tries desperately to find him. Meanwhile, in Denmark, a nurse named Nina Borg finds him in a suitcase and sets out to find his family. Will mother and child be reunited?The point of view skips between various characters and countries. The effect is to create suspense: how will all these characters be brought together? The multiple perspectives also humanize the characters, even the villains. My problem with the book is the character Nina Borg. She is a nurse who works helping refugees and immigrants; in fact, she is totally obsessed with helping people, to the point that her own family is neglected. Towards the end of the book there is a reference to a childhood trauma which is supposed to explain her compulsion to help people. Withholding this information until the end is manipulative and the event described provides insufficient motivation, especially for Nina's indifference to her husband and children.Furthermore, some of Nina's behaviour is unrealistic. She has a great reluctance to contact the police, a reluctance that is not understandable since she would have a great deal of credibility with authorities. Having a major character make illogical decisions so that she endangers herself and others is manipulative plotting. Apparently this is the first in a series featuring Nina Borg, but she is not a strong enough character to entice me to read future books.Please check out my blog (http://schatjesshelves.blogspot.ca/) and follow me on Twitter (@DCYakabuski)."}, {"userName": "Britany", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/5550397-britany", "userReview": "Could you imagine opening a suitcase and finding a tiny little boy inside? What would you do?I really enjoyed this one. It's been at the top of my tbr for what feels like forever, and I can finally replace it with another older book that I haven't gotten to yet. Nina Borg- a red cross nurse in Denmark gets sucked into an ill advised plan when she opens the locker containing the aforementioned suitcase. This one moved at a pretty fast pace, and rotated between the cast of characters narrating the different chapters. At times, it was hard to follow and figure out who was speaking and who was who. I got into a great rhythm and towards the end couldn't stop listening to see how it would all enfold. It came together and for me, wasn't too far fetched of a storyline for me to believe. Looking forward to the next one in the series."}, {"userName": "Mathura", "userReviewDate": "Apr 25, 2012", "userURL": "http://www.goodreads.com/user/show/8971088-mathura", "userReview": "I liked the story line but that's about it. I don't think it was executed well enough for my tastes or maybe I am judging this book rather harshly after just reading two great books. This is a list of problems I had with this book: 1)I did not like the way the characters were introduced in the book. 2)I do not like keeping track off too many characters that just kept cropping out at the beginning of the book without any idea of how they related to one other. 3)Every chapter was a new character with their story and no corralation to the previous chapter. 4)I wouldn't have minded the chapter jumping so much if at least held my interest long enough to read on which it didn't.Other than the title and the first page of the book everything else was a bore."}, {"userName": "Miamikel SS", "userReviewDate": "Sep 23, 2012", "userURL": "http://www.goodreads.com/user/show/4246902-miamikel-ss", "userReview": "Remember \"it was a dark and stormy night ...\" the headline that grabs your attention and leaves you a little jumpy, wondering what's around the next corner? That's THIS book! I loved this book literally AT THE TITLE.I wanted to know - what boy? Why was he in a suitcase? Alive? Or Not?This book is John Hart meets Stieg Larsson! Even though this book started out a bit confusing - the characters are jumbled together and introduced a little haphazardly, I found that part of the intrique! It does start to flow once it gets going and the characters all mesh together in the way the author, I think, intended. I LOVED the fact that it's an international book - based in a Danish setting with the richness of the area and people so descriptive in this tale.When Nina, a nurse and working at a Copenhagen center for social services, agrees to do a favor for a friends, she is shocked to see the suitcase she is sent to get has a small 3 year old Lithuianian child inside, stolen from his mother. They can't speak to each other, adding to the mystery. Some of the characters made my skin crawl ... others left me saying 'YES! You GO!' Enriching, engaging, great book and awesome teamwork by Lene Kaaberbol and Agnete Friis. I heard this is a new series 'to-be' - I sure hope so! I'm sold!!"}, {"userName": "Lyn", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "Danish writer Lene Kaaberbol’s 2008 novel The Boy in the Suitcase, originally published as Drengen i kufferten, introduces us to the very original mystery heroine Nina Borg.Neither a police detective nor a prosecutor, Nina is a Red Cross nurse working in a welfare clinic, down in the trenches dealing with domestic violence and substance abuse. I liked her and I was digging how Kaaberbol put this unique but contextually understandable protagonist and crime situation together. A little three-year-old boy is found in a bag in a train station locker and Nina is given the responsibility for helping to keep him alive and safe from the serious mess he’s in. Kaaberbol uses a shifting perspective narrative to also describe the child’s Lithuanian mother and the underworld human trafficking network at the heart of these nail biting events.Fast moving and empathetic, Kaaberbol has created in this book a likeable hero we can get behind and a realistic crime fiction that grabs the reader from the first few pages. I very much enjoyed this but can see where someone would LOVE this writing. I’ll likely read more form her."}, {"userName": "Becky", "userReviewDate": "Mar 13, 2014", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "This is just what I needed right now. I've been in such a reading slump that I feel like everything that I've tried to read has just dragged on forever. I don't know if it's the new job or what, but it's been making me crazy to feel like I've been going through the motions of reading without actually feeling or caring about most of what I've read. There've been exceptions, but it's mostly just been a slog of book after book that I just want to be done with so I can try something else. So this was a welcome change. Almost from the very beginning of this book, I was hooked and definitely invested. I've come to realize that I really like crime thrillers from this region of Northern Europe. It's gritty in a way that I love, and dark in a way that I dread (but secretly love). But... the dread (that I love) was mitigated in this case because of the fact that this is a series centered around Nina Borg. This is Nina Borg's series, so Nina Borg will be in it, and therefore she can't die in the first book, and therefore I wasn't as concerned for her well-being as I would have liked to have been. Contrast that to Steig Larsson's Millennium series. Or George R.R. Martin's Song of Ice and Fire series. (Yeah, I know it's not crime - I'm making a point here.) Because these series titles didn't hint that any particular character(s) were central to the overall story arc, I was on the edge of my fucking seat when the characters were in danger, because I couldn't rely on them being the center of the story's universe and thus have to make it into subsequent books. GRRM kills off people when he gets tired of typing their names in his manuscripts, so nobody is safe... and I fucking LOVE that quality. I want to have my heart in my throat when I read because I want to care about what happens to the characters and I want to feel that it's real. And I got that here... just to a lesser degree. But there were a lot of things that I loved about this book, so don't let that mini-bitchfit turn you away. This book has great characters, and one of most believably flawed main characters I've read in a long time. I was going to devote a good chunk of this paragraph to talking about Nina, but then I decided against it. Because me talking about her flaws seems to be simplifying them, and it's not really doing justice to the character that has been created here. She is nuanced and... human. And the way that her character is revealed to us is fantastic as well, because it's not just infodumped onto our heads in the beginning. What we learn about Nina comes from the whole of the book, in tiny little smidges of hints that must be tacked on to the small pile that we've picked up already, until gradually a shape starts to take place. I say this because my perspective on Nina's family changed about a dozen times during the reading of this book. In the beginning, we see Nina trying to help a co-worker avoid her sexually abusive fiance (unsuccessfully), and then right away we're treated to our first impression of Nina's husband, Morton. (Not sure on the spelling - audio.) Nina's husband is painted in rough strokes as an overbearing control freak who has to speak slowly and condescendingly to make sure that Nina can comprehend. Lunch for their son is to be a peanut butter and jelly sandwich, no crusts, Superman lunchbox. Do you think you got that, or should I write it down? Stuff like that. I was immediately turned off and immediately disliked him. Especially in light of what I could tell of Nina at that point, a strong, independent woman who isn't afraid of standing up to a man who is hurting her friend. But... the more I got to know Nina, the more I got to know Morton, and the more I got to know their whole family dynamic, and the more it all came together into a coherent picture that really changed how I felt about them. And in the end, I came to really respect Morton for his patience and understanding and almost saint-like forgiveness. And that's just the background. The main plot of the story was great as well, and kept me on my toes to know what would happen. The main antagonist, Yuchas (spelling?), was frightening. Not because he was an intensely violent and unscrupulous man, but because he chose to be that way as a means to an end for his dream of being a normal family man. I could see the desire to be good and normal and happy, but the way that he decided to bring that about was to be completely the opposite. I think that he disturbed me so much more because I have a soft spot for big bearlike thugs who, underneath, are really gentle and kind. And I could see that in him, or the potential to be that, and he decided to reject any kindness and just rage and not think or take control of oneself or responsibility. The main story revolves around a little boy who was kidnapped, and man, this storyline was heartbreaking - especially from his mother's perspective. I felt for her so much. Her fear and dread and helplessness and anger were all crystal clear and expertly shown. The reader gets to see both what's really happening to her little boy and her fears of what's happening to him, and I couldn't help trying to mentally send her status updates on him because her emotional distress was real to me. I'm not sure if that's completely due to how she was written, or because I have a superactive empathy gland... but whatever it was, it worked for me. I would have liked a little more closure with Sigita at the end, and maybe a little more about her life and employer. Her job seems to almost parallel that of Karin's... and that's a little concerning. Maybe there will be more about her in subsequent books. Ok, so all that's about the story itself, which I really enjoyed, but I need to talk about the audio now. I have very mixed feelings about the reader of this book. One the one hand, I really appreciate being able to hear the Danish names pronounced and hear the accents... but the regular narration was quite distracting. The reader has a tendency to get extremely animated and loud and excitable during action scenes, and the end result is that, rather than letting the story speak for itself, it feels like she's forcing a reaction down my throat. \"BE ANXIOUS HERE! THIS IS SCARY STUFF!\" I think I can decide that on my own, thanks. I can almost picture her leaning forward, eyes wide, hands clutched, heart racing as she reads... and that's how I want to feel at those times, but when I am picturing the reader and NOT the events she's reading, that's a problem. So.. In conclusion. Story = Awesome. Reader = Not so much. I probably will continue the series at some point, but I likely won't go for the audio again."}, {"userName": "LeAnne", "userReviewDate": "Feb 21, 2012", "userURL": "http://www.goodreads.com/user/show/7862560-leanne", "userReview": "This was an outstanding psychological thriller set in Denmark with a main character you could not help but care about and yet be frustrated by at the same time. Nina, a nurse at the local camp for foreign refugees, also secretly helps out illegal immigrants with medical emergencies. These people, ill or injured, cannot visit the hospital or regular doctors no matter how badly off they are health-wise. Should they do so, they would be reported to the authorities and then shipped back to the horrific circumstances from which they have fled. Nina is a nurse who has traveled the world helping the downtrodden. A woman intent on saving others, she is unafraid to break rules and can obviously be entrusted with a secret.Her best friend from nursing school, with whom she has lost touch over the years, does indeed hand over a secret to Nina and then takes off so she no longer has responsibility for it. As the title tells you, it involves a little boy and a suitcase. Because the book was originally written in Danish, the names of all of the characters are northern European and may be a bit confusing at first for the average native-speaker of English. I listened to this on audio, however, and it made the characters easily discernible from one another. The audio was so excellently done that I purchased a hard back of the book, and when two more novels followed the character of Nina, I had to buy those as well. Really good.Beside the twists and turns - which are logical, but unexpected - these authors did a phenomenal job in drawing each of the characters. There are scenes of an impoverished young Lithuanian girl whose father finds an incredible deal on black-market button down shirts. He takes every bit of money they have to invest in these shirts, but sadly, nobody wants them - no matter the price. They hang for years, like white surrender flags, all over every surface of the family's tattered home as a signal that perhaps it is time to just give up. The dual authors, Lene and Agneta, did a marvelous job throughout this story in showing us poverty or desperation or tenderness through actions of the various characters, not through simple narration.The do-gooders in the story have huge flaws to their characters, and you eventually grow to understand them. Nina Borg is a frustrating protagonist with quirks that seem entirely random - until we learn about her childhood at the end of the story. Holy smokes - that ending was good. The handful of bad guys in the tale have enough subtle background written into them that they are perhaps not forgivable but absolutely understandable. We see their night time dreams and their lifelong longings - windows into them that make them seem real, not just two-dimensional monsters. What does it say about a book's writing when the reader gets a little misty eyed over a raging murderer? I highly recommend this book and would especially consider reading it before the follow-up stories entitled Invisible Murder and Death of a Nightingale.THE SERIES... I saw the later books again illustrating a handful of excellent stories that tie to the situations a typical relief nurse - and somebody with Nina's psychological mindset - might encounter. The illegal immigrants that nurse Nina treats - under the radar - come from and occasionally end up in some terrifying conditions. These people bump into strange and dangerous circumstances, and I found all the books believable. As a bonus, these novels introduce a handful of female characters who have been preyed upon by circumstance and take matters into their own hands without looking back. The series reminds me a bit of the good works of that wonderful Stieg Larsson. I gave this 5 stars and put it on my Favorites shelf."}, {"userName": "Kirsten ", "userReviewDate": "Oct 03, 2011", "userURL": "http://www.goodreads.com/user/show/833700-kirsten", "userReview": "An excellent book! What is about the Scandinavian/Northern European mystery/thriller writers? This book is set in Denmark and the main character is an aid nurse dealing with immigrants. Immigrants in Europe are a touchy subject, a bit like the Hispanic/Mexican illegal immigrants to this country. The story deals with dark topics and is very gritty. Much grittier, I have to admit, than my view of what Denmark is really like. A boy is found in a suitcase. What was he doing there? Who put him there? Where is his family? Do you want to know? Read this book! It's a nice trip!"}, {"userName": "Lance Charnes", "userReviewDate": "Feb 18, 2012", "userURL": "http://www.goodreads.com/user/show/7296900-lance-charnes", "userReview": "The Boy in the Suitcase is yet another entry in the growing catalog of Scandinoir coming to these shores, and in many ways fits the general pattern: a socially maladapted protagonist, evil doings involving underage victims, societal rot, Eastern European villains, heat waves. That its central figure isn’t a police detective doesn’t move it very far out of the middle of this particular stream.Nina Borg (that protagonist) is a Danish Red Cross nurse who allows herself to be badgered by her slightly-less-dysfunctional friend into retrieving the titular suitcase and discovering the titular boy. The narrative switches between Nina’s efforts to figure out who the boy is and why he’s in Denmark, the Lithuanian mother’s attempts to find out what happened to her son, the Polish and Lithuanian kidnappers’ attempts to get paid, and the ultimate culprit’s maneuverings to make everything turn out right.This multi-viewpoint approach works pretty well and ensures the reader doesn’t spend prolonged periods with any character who bugs him/her. It also helps illuminate the various motives at work and the stakes involved using each character’s take on the problem at hand. The prose is clean for the most part, the dialog convincing, and the short chapters keep a loping pace through the shortish (just over 300 hardcover pages) plot.This should’ve worked better for me than it did. What happened? Three big things:-- The central crime – the kidnapping of a Lithuanian toddler for delivery to a wealthy Danish family – ought to resonate strongly, since it’s the pivot on which the entire plot turns. It didn’t for me. Perhaps the biggest obstacle is the victim himself. At three years old, Mikas is little more than an object on which forces act, and as such it’s hard to invest in him as anything other than (at best) a generic little boy, or (at worst) an animated Maltese Falcon. We hardly even hear direct quotes coming out of his mouth, since he’s speaking Lithuanian and Our Heroine doesn’t understand him. If you find it hard to care much about the crime, you’ll find it harder to care about the events that go on around it.-- While the interior settings are generally well-limned, the exteriors are mostly blank canvases. I know little more about what the featured parts of Copenhagen and Vilnius look or feel like now than I did going into this. I sensed little specific Danishness in the Danish scenes and only somewhat more Lithuanianness in the Vilnius scenes. This leaves the story strangely unstuck in place; it could with very little effort be relocated to Veracruz and St. Louis, or Bangkok and Sydney.-- Nina is clearly supposed to be the lead protagonist. She follows in the footsteps of Kurt Wallander and Harry Hole: a savant (she’s said to be a crisis-nursing ninja, though there’s little evidence of that capability here) who is barely able to keep herself fed and clothed and mostly unable to function in adult relationships. She often doesn’t know what to do with Mikas, but is unwilling to turn him over to people who would know (the police or social services agencies); she’s aware a killer is on her trail, but does little to protect herself or the boy. Her lack of a badge doesn’t keep her from plunging heedlessly into this case, shredding what few societal attachments she’s somehow managed to form, spending all her money and lurching from one half-thought-out plan to the next. I found Nina as difficult to engage with as I do Wallander and Hole…bad news when she’s the star.Unfortunately, nearly all the other characters are as damaged and traumatized as Nina. The boy’s mother is perhaps the most proactive protagonist, yet she spends much of her page time in a slough of despond (perhaps appropriate for a mother whose child has been stolen, but still, there’s a limit). There’s not a single intact marriage, normal childhood or non-derailed life to be found here. Nobody does anything that gives them pleasure. While we expect a certain level of sturm und drang in the new Baltic republics, it’s difficult to credit that the residents of the cleanest, safest, most prosperous societies on the planet are all such miserable wretches.The Boy in the Suitcase isn’t a bad book, just another entry in a genre I’m increasingly finding off-putting. There's plenty here to like if you’re a fan of Scandinoir. That the plot isn’t police-centric (indeed, the police are largely beside the point) may be a nice change of pace for you. There’s even a sequel. Just don’t read this book if you’re already depressed, because there’s nothing in it that will make you feel any better about yourself or the world."}, {"userName": "Vivian", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/3947172-vivian", "userReview": "I'm quitting this book. It might be interesting, it might not, but I really don't like four different point of views for telling a story. Twenty-two pages in, five chapters and four characters; it's a nauseating whirl. This isn't the first time I've seen this technique, it was another Nordic Noir book too, maybe it's a regional style issue, but I hate it."}, {"userName": "Vegantrav", "userReviewDate": "Nov 29, 2011", "userURL": "http://www.goodreads.com/user/show/834122-vegantrav", "userReview": "The Boy in the Suitcase is yet another Scandinavian crime novel (this one from Denmark), and it's a solid thriller, but there's nothing that makes it too terribly memorable with the exception of the nearly unbelievable stupidity of one of the main characters, Nina Borg.Nina is an educated woman, a nurse, but time after time in this novel, she makes unbelievably stupid decisions. Of course, had she made common-sense choices--nothing requiring great wisdom, just simple common sense--then there would have been a good deal less drama in the story. As I was reading the novel and observing some of the ridiculous actions that Nina took, I would often say to myself, \"No one is really this dumb.\" But then I would think about the people encounter in my job (I work with the general public) and would correct myself: yes, some people--in fact, far too many people--really are as stupid as Nina. So, I guess the general imprudence of Nina's actions are actually realistic.Overall, this was a quick, easy read. It was enjoyable but not particularly noteworthy."}, {"userName": "Florence (Lefty) MacIntosh", "userReviewDate": "Jul 15, 2012", "userURL": "http://www.goodreads.com/user/show/10856439-florence-lefty-macintosh", "userReview": "Rate 2 ½ stars. Nina Borg, Red Cross nurse, wife and mother of two to the rescue! Reviewer's continually compare this to Steig Larson’s “The Girl with the Dragon Tattoo.” Both are action packed by respected Danish authors. It is a really satisfying account of the rescue of an abducted child. My low rating is based on the writing style rather than the plot. It did not flow well, choppy and difficult to follow. In any event it’s still worth reading if this is your genre."}, {"userName": "Emma", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/26734926-emma", "userReview": "[ Nina's decision to not involve the police was very bizarre. I suspect this decision was taken to draw out the plot  (hide spoiler)]"}, {"userName": "Steve", "userReviewDate": "Mar 14, 2016", "userURL": "http://www.goodreads.com/user/show/2314568-steve", "userReview": "4 stars, rounded up: 4 stars for the story itself, 3 stars for the narration.\"The Boy in the Suitcase,\" by Lene Kaaberbøl and Agnete Fris, is set in and around Denmark, and definitely falls under the \"Scandinavian Mystery/Thriller\" genre in setting and style. For the record, I really enjoy this genre.The first few chapters are very confusing with new characters being introduced continuously. On top of that, the narrator wasn’t much able to differentiate the voices of the female characters, making it even more confusing.The twisted web of the plot involves several interesting and well-developed characters: Wealthy Jan Marquat, able to buy whatever he wants; Lithuanian Jucas, with a fierce temper, and his girlfriend named Barbara; Sigita Ramoskiene, mother of Mikas, the boy in the title; and Nina Borg, a Danish Red Cross nurse who is unable to say no to any of the world’s downtrodden. I was especially enamored with Sigita and her back story, which ended up being a somewhat surprising plot twist in the book.All of these people are linked, and it takes a while for the authors to connect the dots. Nina, in a misguided attempt to help a friend, winds up trying to protect a terrified toddler who speaks no Danish. The authors change POV in each chapter, switching between Nina, Jan, Jucas, Sigita, and a few others. It becomes obvious that Sigita, Nina, and the little boy are in grave danger.Although there is a very high level of suspense, the plot hinges on a far-fetched twist that required a near-complete suspension of reality. Even still, the protagonists’ welfare and how the story plays out drove me to finish the book. In spite of its over-the-top conclusion, this is an engrossing provocative thriller. I’ll definitely be continuing this series."}, {"userName": "Tom Mathews", "userReviewDate": "Mar 29, 2016", "userURL": "http://www.goodreads.com/user/show/22063432-tom-mathews", "userReview": "This is my first Nina Borg story and may not be the last. The plot and the characters were interesting but the mystery took all of a minute to figure out. My biggest concern about the story is that I found myself thinking of the story based on the Hitchcock term McGuffin, which is an object whose sole importance is its ability to drive the story's plot forward. Party A steals the McGuffin from Party B. Party C ends up with the McGuffin and tries to find where it belongs while keeping it away from Party A. If the reader sees a kidnapped three year-old child as little more than a plot device, is that indicative of a lack of imagination on the part of the reader or the authors?"}, {"userName": "Cindy", "userReviewDate": "Oct 23, 2012", "userURL": "http://www.goodreads.com/user/show/3532544-cindy", "userReview": "Another entry in the Scandinavian mystery/thriller category. This one was very good and not nearly as violent as Steig Larsson's first book (I prefer the lower violence levels). Will read the next book then see if this is a series I want to stick with. This book had lots of characters moving in and out. I did not pay close enough attention to this in the beginning, so sometimes was confused about who was related to whom. I'll do better on the next book!"}, {"userName": "Diane S ☔", "userReviewDate": "Nov 30, 2011", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "When the book first starts it is a little confusing, trying to figure out who is in what country, but easier as the book goes on and more is revealed. Very well written, with building suspense and a slow reveal. Although what is going on we know from the beginning but the why of it remains a mystery until almost the end."}, {"userName": "Syahira Sharif", "userReviewDate": "Mar 06, 2012", "userURL": "http://www.goodreads.com/user/show/4247818-syahira-sharif", "userReview": "The label of #1 Scandinavian Thriller doesn’t lie. If Sweden have Man Som Hattar Kvinoor (The Girl With The Dragon Tattoo), Denmark have Drengen i kufferten (The Boy in the Suitcase). The story started with a woman towing a suitcase down to her car. Before she put the heavy suitcase in her bonnet, she open it and found a boy - barely alive - curled in it.Then there was the quite mysterious monologues of a rich man called JAN who had some problem with his idea of a perfect house to his inate need to please his beautiful wife and his confusion with his wife's 'needs'. A mysterious picture of a boy and a mysterious phone call later, he toss his phone at the side of the cliff and then went to get it later to get himself a mysterious ticket to Zurich. While in the plane, the airline had a long setback from technical difficulties that made Jan anxious as the time drags from minutes to hours of delays. He contacted his secretary, KARIN, to bank-in a six-figure sum of money to a bank in Zurich.Another character was JUČAS who wanted a family with his girlfriend, Barbara who was older than him and proceed 'making babies 'in a voyeuristic way at the side of a lake.And another character named SIGITA who is a single mother of a toddler, Mikas. While playing in a empty playground, she caught a russian woman secretly giving her child's chocolate. When questioned, she found out that the woman have been giving her child chocolates before and told her off before she let her boy play in the sandbox. That was the last memory she had before she regained her consciousness in a hospital bet with a high alcohol level in her blood, broken arm and a concussion.... with her child missing.And then we have NINA, a nurse who was helplessly watching a mean bastard luring his Ukranian fiance, who exhibited signs of sexual abuse, out from the clinic using a six year old child as hostage in his car. With Natasha's unwillingness to report his action against her fiance (and risked getting herself deported out of the country), Nina's hand were all tied up. A friend of her, KARIN, call her to meet up in a cafetaria.Okay, for a couple of pages from the beginning of the story, thats a whole lot of characters to take note to. Reading this, is like reading a tv series script. Loads of fade in and out and \"show a tiny bit but never tell until the later part of the story like treats\" thing. Come to think of it \"The Killing\" was based from a Danish's tv, so I'm really hoping they could consider making this book into adaptations so that Lene Kaaberbol would be famous enough that people notice her AND GET HER TO TRANSLATE THE THIRD SILVERHORSE BOOK!!! But the book was written in a way you expect from watching a movie, which can try your patience in some ways. I'm not kidding about making her famous thing, since this series was already in the third book but only this singular translated book of the series. Lene is one busy girl who want to write and translate her novels by herself. But why cant you just hire someone and then reedit everything? The writing is just too realistic. Thats why I like Lene Kaaberbol when she wrote YA fantasy. The mystery itself is too emotionally nerve wrecking. The blood and the body fluids just what I expect from LK. I never include quotes in my review but come on.....A few beatings, a gang rape or two, and a note bearing the address of her family in some Estonian village—that was usually enough to break even the most obstinate spirit. And the real beauty of it all for the cynical exploiters was that ordinary people didn’t care. Not really..... pages later...Marija frowned, and Nina guessed that she was searching for the right words, comforting and unthreatening enough that she wouldn’t upset the boy too much. A stab of outrage at Marija’s own capsized life went straight through Nina’s chest. She felt such rage at the thought of the Danish, Dutch, and German men who felt it was their perfect right to serially screw a young girl month after month until not the least remnant of the girly sweetness and the coltish awkwardness would remain. What do such men tell each other? That it is quite okay because it is her own choice? That they are offering her a way to make a little money and start a new life? How very grand of them.thats not preachy, thats plain truth. Kinda like \"flickan som lekte med elden\" (TGWPWF).What Sigita had to go through while the person who betrayed her 'scolded' her for searching for her lost son“You feel so put-upon, don’t you?” she said. “Poor little Sigita who has had such a hard life. But did you ever pause to think what it’s been like for your mother? You taking off like that, not even leaving a note? She lost a daughter. Did you ever think about that?”The authors were straight as it is with the treatment of women and girls in this book. If you need a gentle read reminiscent of Nancy Drew, this book is not for you. This book tackles child kidnapping, human trafficking, prostitution, manhandling, woman abuse, child abuse - that the writings itself was too real for some people. *I read this during the time when it was confirmed that the unidentified body that was found burned in an abandoned building in Johore was the missing girl, Dirang, and just earlier the little boy who slipped into the lake in Titiwangsa Park and drowned. I actually saw the body floating face down in the lake from the tv and remember acutely where the boy in which part of the lake since I lived near Titiwangsa Park during my university days. To read this book with the details of horrified mother who found her boy missing really struck me to the bone. I hugged my 2 year old nephew and prayed my thanks to God and send my prayers to the mothers who lost their children. Dirang's kidnapping and murder was premeditated. There was a case of neglect of course but it was disheartening to found out your child in one moment of pure happiness and then suddenly they were snatched away in matter of seconds. This book will bring those fear alive.*The book that made me read from 2am to 4am."}, {"userName": "Clickety", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/85271-clickety", "userReview": "I read this book WHILE I WAS AT DISNEY WORLD, and if you know me, and you know how much I love Disney World, you'll know that's pretty darn significant. This was not a story I devoured all in one go, like a box of Sugar Babies. I found myself stopping every few chapters, not because I wanted to think about it consciously, but it kind of felt like the story was simmering way back at the base of my brain, like when you put on a batch of ham-and-potato-and-cheese soup in the slow cooker allll day so that when you get home from work the entire house has that gentle savory scent, and it greets you as you walk in the door. And so I'd pick it up again later that day, and even though there's multiple POVs and the setting skips around as a result I didn't have trouble picking up where I'd left off. It was easy to get immersed in the narrative again and just slip along with the flow.The book is subtle and lush; the characters are intriguing and unique yet quite believable. This was one of the few non-YA books I got at the ALA convention in New Orleans, and I'm ever so glad I picked it up!"}, {"userName": "Carin", "userReviewDate": "Oct 17, 2016", "userURL": "http://www.goodreads.com/user/show/671457-carin", "userReview": "If you like Scandinavian crime novels, you must read this book. It's a new classic of the genre.Nina is a Red Cross nurse working with abused women, when a friend calls in a panic, begging her to pick up a suitcase at the train station. When she does, Nina is shocked to find inside a small naked boy. He is still alive, but obviously someone wants to hurt him, and Nina doesn't know who she can trust. Particularly when her friend turns up dead, Nina knows she is on the run for their lives.The book takes twists and turns, every chapter ends on a cliffhanger, and it rockets along at an amazing speed. Impossible to put down, you worry so much about just what will happen, and of course how. This is more a thriller than a mystery, as we know from early on who the boy is (although Nina does not—he speaks a foreign language she doesn't recognize.) But we don't know who wants him or why until close to the end, and then there's a fabulous climax with lots of action and it's very satisfying in the end. If you like foreign-set thrillers, this book is for you!"}, {"userName": "Mochizuki", "userReviewDate": "Nov 03, 2012", "userURL": "http://www.goodreads.com/user/show/2435459-mochizuki", "userReview": "I've just finished reading The Boy in the Suitcase and boy what a book, what a thriller, what a story.The characters are very well described and it's pretty easy to understand who is who despite some of the reviews I read here.The action and the atmophere are very well described too and it's full of suspense, twists and turns.But the thing that I liked the most is the fact that many of the actions described in the story seem to be motivated out of love, even the actions that are all but noble. Out of love a father asks for a child to be abducted so that another child can be saved, out of love a mother goes on a journey to the unknown so that she can find and recover her lost child, out of love Nina tries to \"save the world\" even if that means the she keeps losing herself.I loved this book and I would recommend it to anyone who likes thrillers and good crafted stories."}, {"userName": "Gordana", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/22421783-gordana", "userReview": "Predobra!!!! ;)"}, {"userName": "Moonlight Reader", "userReviewDate": "Jun 19, 2016", "userURL": "http://www.goodreads.com/user/show/5664767-moonlight-reader", "userReview": "Read for Battleship, WOBBLE challenge, NBRC group."}, {"userName": "Gail Cooke", "userReviewDate": "Sep 19, 2011", "userURL": "http://www.goodreads.com/user/show/2809512-gail-cooke", "userReview": "This was my introduction to authors Kaaberbol and Friis, and it was a wowser! Their intricate plotting, clean, tight, sometimes visceral prose, and characters about whom we care all combine to form an unforgettable thriller, the first in the Nina Borg trilogy.\tA Red Cross nurse, Nina is an inveterate do-gooder with an unshakable belief that she can make almost anything better, much to the chagrin of her husband. This combined with her role as a wife and mother often presents her with frightening choices. I should also mention that she is a very good friend for when Karin, last seen gives her a key to a public locker in the Copenhagen train station and implores her to take care of the contents she agrees.\tKarin had warned her not to open the suitcase until she left the station. We read, “Nina dragged the suitcase out of the locker. It was heavier than it looked.....not easily carried.” Yet she soldiered on until she reached her Fiat at the car-park. It was there that she opened the suitcase and found the boy, perhaps three-years-old, naked, drugged, but alive.\tShe has no idea where to go or what to do but fears going to the police lest they return the boy to whoever had done this to him. “Dear sweet Jesus,” she thought, “Who would do this to a boy?”\tThe answer to that question takes her on a terrifying chase throughout Denmark as she tries to discover who the boy is and why he was treated so inhumanely. Her fear is heightened when she finds Karin brutally murdered and then knows with certainty that she must not only save the child but herself as well.\tAtmospheric, rich with psychological insights, and one of the most frightening villains to inhabit a page The Boy In The Suitcase is an extraordinary crime novel that captures your mind and your heart.\t= Gail Cooke"}, {"userName": "Ellie", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/2908629-ellie", "userReview": "The Boy in the Suitcase is the first in a new \"Nordic Noir\" thriller/mystery series by Lene Kaaberbøl. The setting is Denmark. One of the reasons I love these \"Nordic Noir\" books is that they smash many of the stereotypes I didn't even realize I held about the ideal state of the Scandinavian countries and their welcoming position to all people-citizens and otherwise.Wherever do I pick up these ideas?Nina Borg is a nurse who works with the displaced, Denmark's unwanted immigrants and poor. Her need to go off and save the world has alienated her husband Morton and her marriage is in serious danger. She is now attempting to keep her \"do gooder\" compulsions close to home, no longer flying off to exotic countries but staying close to her husband and children.There is a feeling that Nina not only needs to save the world but perhaps escape the sometimes overwhelming commitments of being a wife and mother and it is hard not to sympathize with her husband's anger and feelings of abandonment.But what can Nina do when an old friend is viciously murdered and her last plea is to Nina who opens up a suitcase only to discover (as the title says) a boy-a 3 year old baby who has been abducted from his mother in Vilnius.Kaaberbol orchestrates the different and ultimately converging story arcs well and the book is an intense tour of the dark side of Denmark."}, {"userName": "Marla", "userReviewDate": "Nov 19, 2011", "userURL": "http://www.goodreads.com/user/show/4021000-marla", "userReview": "I saw some of the reviews this book was receiving so I decided to the audio version. Boy was I not disappointed. Katherine Kellgren is a phenomenal reader. I can see why she has won awards. She has gone above and beyond with taking voice lessons working on accents. She brings Nina Borg to life along with the other characters. This is a very well written story not only about Nina but about 3-year-old Mikas who is abducted from his mother Sigita Ramoskiene. The story takes place in Denmark and Lithuania. It does bounce around to the different main characters who are not together and there are a few flashbacks. So on the audio book you really have to pay attention until you get to know the characters. There were parts of the story that were very fast paced and a few spots where it slowed down so you could catch your breath. What a horrible story, a little boy, drugged and naked stuffed in a suitcase, being sold for $1 million. I hate thinking that things like this really do happen in real life. I highly recommend this book, especially as an audio book. I’m looking forward to the next installment of Nina Borg the do-gooder who can’t say no to someone who asks for help."}, {"userName": "Shannon (Giraffe Days)", "userReviewDate": "Jan 11, 2012", "userURL": "http://www.goodreads.com/user/show/395599-shannon-giraffe-days", "userReview": "Nina Borg is a Red Cross nurse who works at a clinic by day and by night helps hundreds of illegal immigrants hiding across Denmark. With a history of abruptly leaving her husband Morten and their two young kids for stints in refugee camps in Africa, Nina is passionate, caring and driven to help the unfortunate. When her old friend Karin calls her with an urgent request one day, Nina doesn't say no. Karin gives her a key for a locker at the Copenhagen train station which contains a suitcase. And inside the suitcase is an unconscious, naked three year old boy.Nina's first thought is child trafficking, and she has little faith in the police actually being able to help; still, she goes back to the train station to report it. But while there she witnesses a large man violently attacking the very locker she found the suitcase in - and he notices her, the way she was looking at him, like she knew. But Nina doesn't really believe the man is after her and the boy until she arranges to meet Karin at her family's lake house, and instead finds her brutally murdered.Now on the run with a boy who doesn't speak her language and with no one to help her, Nina must try to figure out the boy's origins in the hopes of reuniting him with his family, before the man finds them and she ends up like Karin.Such a summary as that only tells part of the story, and there's so much more to it than that. The cast of characters, aside from Nina, includes her husband Morten; a wealthy businessman called Jan Marquart who lives in a fortress-like house on the coast with his wife Anne and son Aleksander; the man who abducted the boy, Jučas, and his older girlfriend Barbara; and the boy, Mikas, and his single mother, Sigita Ramoškienė, from Lithuania. The story moves between Nina's side of the story and Sigita's on two different planes of time until they meet at the end, with Jan and Jučas appearing when required. There are other, more minor characters, and as the story progresses we learn more about Nina and her personality, and why her husband sometimes talks to her like she's irresponsible and incompetent. It also gives Sigita's backstory, and truly, it's all put together so beautifully, like a very clever jigsaw puzzle - and I love jigsaw puzzles.I'm not a big crime reader, I only occasionally read novels like this, and I almost never read pop fiction thrillers and murder mysteries - Tess Gerritson, Tana French, Kathy Reichs etc. - I had to read some for a course at uni and I found them very boring and poorly written, so, not for me. But these \"literary\" crime novels, I often enjoy these. There's so much more emphasis on character development, the plots are more interesting and they often speak to social issues, economics and politics. With all of those ingredients present, they're more likely to engage me and get me emotionally invested. Which is exactly what happened here, and why I loved this so much.First of all, now that I have a child of my own, I'm even more deeply affected by stories involved bad things happening to children and mothers than I was before, which is saying a lot. Sigita's story almost made me sick with fear and panic, though it's never reduced to corny melodrama. Sigita keeps her head, and while she struggles to be taken seriously by the police and feels the crush of hopelessness, the threat of panic - her boy could be anywhere, anything could have been done to him - she is also possessed of that unique drive that comes over women when their children are threatened, that single-minded determination. Even just recalling it while I type this, makes those emotions zing through me. She was a strong, well-developed character, young and isolated and too aware that, after long enough, her son won't even remember who she is.In contrast, Nina was a less familiar, more unique character, but one who becomes familiar and understandable. When her first baby, Ida, is only five months old, she suddenly leaves her family for Liberia, only telling Morten when she was already at the airport. To have a woman just abandon her husband and baby like that, it seems so cruel and selfish, but throughout the novel we get the pieces to better understand Nina, who has an almost psychological problem, like a mental illness.Only much later had she succeeded in explaining herself to [Morten], at least to some extent. He had noticed that she was finding it harder to sleep, that she was constantly watching Ida, day and night, that she seemed to be afraid of disasters, real or imagined. He had tried to calm her fears, but facts and rationality didn't seem to have much effect on her conviction that something horrible could happen to the child. ... She led a remarkably efficient one-woman crusade to save the world. It was only her own family who could reduce her to abject helplessness. [pp.169-170]Perhaps because Nina was caring for this little abducted boy, but I never saw her as a bad mother. Just different, and struggling to not let the horrible things that happen in the world completely overwhelm her. She helps the illegal refugees in Denmark as a way of actively doing something, lest her sense of disaster destroy her sanity. It made sense.The interesting thing about Jan Marquart, is that when we first meet him at the very beginning, the hints or clues indicate that maybe his son has been kidnapped, and he's being blackmailed. I'm sure that's deliberate. We only gradually, bit by bit, learn more and rearrange our impression of Jan, until it comes somewhat full circle. I went through several hypotheses and didn't quite hit on the right one, though I was close. Truly, it's very cleverly written, and a remarkable achievement considering this is the first crime novel the duo of Kaaberbøl and Friis have written - one a fantasy author, the other a children's writer. I can never really imagine how it works, writing a book together, and this one is so seamless, you can't tell that there are two authors. And with Kaaberbøl writing the English translations, you know that nothing's really being lost in translation, either. The writing is gripping, quietly suspenseful, emotionally engaging and sometimes violent.Karin is dead, she thought, gripping the steering wheel still harder. She had tried to wipe her hands on a crumbled, jellybean-sticky tissue she had found in the glove compartment, but the blood had had time to dry and lay like a thin rust-colored film over her palm and fingertips.Unbidden, the feel of Karin's skull came back to her. Like one of those big, luxurious, foil-wrapped Easter eggs Morten's parents always bought for Ida and Anton, and which always got dropped on the floor somehow. The shell under the foil would feel flattened and frail, just like Karin's head. She had ben able to feel individual fragments of bone moving under the scalp as she probed. [p.125]The novel presents a very urban, European Denmark, a country hiding its flaws and ineffective police force. Through Nina we get her scepticism, her distrust of the system and the camps provided for orphaned or homeless children. We meet prostitutes and foreign women trapped in abusive relationships. It's nothing unique to Denmark, and a crime novel is never going to paint a pretty picture of a place. It is the individual characters - some of them - who shine through with their own moral integrity and compassion. Same in Lithuania, with Sigita. The ex-Communist bloc country is a mix of modern Europe and bleak poverty; makes you want to learn more. And overall, as someone from an island country which shares no borders with anyone, the politics and social justice issues associated with all the refugees and people trafficking, is something that feels so foreign to me - not because we don't have illegal refugees or, perhaps, people trafficking in Australia, but because, without borders you can just drive across, they're not issues, people, that are an accepted part of everyday life, the social fabric. They're still Big Topics, things to be debated about publicly, discovered, uncovered, and punished (the traffickers, not the refugees, though the politicians don't agree). It's hard to explain, but there is a different way of thinking about your place, depending on the landscape - the political landscape as much as anything else. It just seems so easy, for someone to be abducted and sold in another country, within Europe. It's scary.Probably my one disappointment with this book was the ending. After the climax, the real ending. The tidying-up. I really wanted to know what Nina told the police, especially since she hadn't reported Karin's death and they'd been looking for her, too. I wanted to know how Jan was explained. It just felt like there were some loose ends left hanging. The tidying-up wasn't very tidy, really. Emotionally, yes, sort of, but not plot-wise.I will definitely be reading more Nina Borg stories, but I'm also interested in reading some of Lene Kaaberbøl's fantasy fiction, and Agnete Friis's children's books, if they're available in English. If you want a really solid, original and unpredictable crime novel, I heartily recommend The Boy in the Suitcase."}, {"userName": "Radostina", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/16458714-radostina", "userReview": "I came across this book in a Scandinavian literature list here on Goodreads, and the blurb immediately drew my attention. Having spent some time in Denmark, I still have a soft spot for all things Danish, so this book looked like a treat for me. Turns out, it’s a very good story and quite an enjoyable read. It also tackles some very important phenomena in our society, which should be discussed more often and more openly because in one way or another, they affect the very tissue society is made of.This is a story about a small Lithuanian child being abducted and smuggled into Denmark, a few villains each working towards their own personal idea of happiness and a few good guys (girls, more like it) on whose conscience and help, albeit reluctant, depends the survival of an innocent three-year old kid. So let me start off by saying that in some ways this is a typical crime novel which reads fairly quickly and can be finished even in one sitting as the narration flows easily, and the multitude of perspectives offered by the author provide the reader with plenty of angles to explore the story. In my opinion, this approach serves the story well although I can see it being a bit tricky for other readers. Things started falling into place rather early on in the novel. I could guess, more or less, where the story was headed. On the other hand, the pacing was perhaps a tad slow, even if the action was taking place in a very brief span of time; maybe it was just me, but I expected more of a thrill and urgency coming out of a supposedly fast-paced and action-packed story.However, these drawbacks are rather minor as compared with the overall significance of the novel and the message it conveys. It treats sore subjects that modern society often chooses to turn a blind eye upon. People trafficking is bad enough when it affects young girls and women, but when children are involved, all this becomes particularly appalling. Reading about children being abducted for purposes varying from illegal adoption through sexual exploitation to being used as a source of organ transplants, all this is a sickening and, unfortunately, very much real phenomenon going on even as we speak. For people coming from Eastern Europe, especially after the collapse of the Soviet bloc and Communist regimes, this has been a gruesome yet very common everyday reality, which should be talked about as often as possible in order to raise community's awareness of these destructive social processes. Even if the setting in a wealthy Western European country is contrasting sharply with post-Soviet Lithuania (although I think the author could have picked a better example of a crumbling post-Communist country), the story isn't about political borderlines, or the clash between rich and poor countries. It's all about the nastiness--and also inherent goodness--that lurks in people regardless of their origin or their social status, so the story could have easily been set anywhere else. The Boy in the Suitcase is an angry and determined statement against the complacency of the comfortably rich communities towards the destructive forces set in pace with the sole purpose of satisfying a rotten society's filthy desires. The silent permission for the strong to prey on the weak—even in a country where law and order supposedly reign--as well as the lengths to which morally-degraded, money-driven and conscience-deprived individuals would go are nerve-shattering. The book also left me with the author's strong and reverberating assertiveness that no matter what the motivation, and regardless of one’s personal situation, a heinous crime is a heinous crime--even if prompted by love for one's child (in Jan's case) or the longing for a family (as in the case of Andrius). What I was a bit put off by—the book finished with the beginning of a new story, which kind of undermined its strength for me. Conveyor-belt problem solving, especially when problems of such magnitude are concerned, does not seem realistic and feasible to me. That being said, the story has strong merits that are hard to ignore. On a totally personal note, I also enjoyed the factual references to places and streets I have known. Denmark is indeed a wonderful country and I would gladly keep reading further into its literature. I will seek other works by Ms. Kaaberbøl, as well as those of other Danish authors in the future."}, {"userName": "Anna", "userReviewDate": "Sep 11, 2012", "userURL": "http://www.goodreads.com/user/show/3915017-anna", "userReview": "Nina, the heroine nurse of the story, is asked by a friend of hers to pick a suitcase for her. She discovers a young boy in the suitcase, and instead of acting like a logical person (such as, calling the police for finding the owner of said drugged three year old), she decides to play a detective and find herself where the boy belongs. She discovers early on that there are some really bad guys after the toddler too, so she flees.A great start, but it takes forever to get to real action (like materializing a real body in the story). What's great of Nina is that she's a clearly flawed female protagonist, and she can be passionate in finding her ways and solutions. So while she's running around for her life with an unknown 3 year old foreign boy with her, she ignores her work, and her husband and children. (If the series will continue with more stories, I would not be surprised if in the classic Nordic detective genre stereotypical way, her husband will divorce he in about 2 books). Meanwhile we follow the story as seen by the mother of said three year old, from how she discovers he's gone, to her past and her fight to understand what happened. Interesting characters (yet Nina's escapeism was irritating), and not hard-boiled enough for me. It took quite a while to learn to want to follow the characters, the biggest turnoff for me being the story focusing too much on the boy, and not on action. Well constructed; I'll give a try for some other book by the author if I'll find some day."}], "description": "Nina Borg, a Red Cross nurse, wife, and mother of two, is a compulsive do-gooder who can’t say no when someone asks for help—even when she knows better. When her estranged friend Karin leaves her a key to a public locker in the Copenhagen train station, Nina gets suckered into her most dangerous project yet. Inside the locker is a suitcase, and inside the suitcase is a three-year-old boy: naked and drugged, but alive.Is the boy a victim of child trafficking? Can he be turned over to authorities, or will they only return him to whoever sold him? When Karin is discovered brutally murdered, Nina realizes that her life and the boy’s are in jeopardy, too. In an increasingly desperate trek across Denmark, Nina tries to figure out who the boy is, where he belongs, and who exactly is trying to hunt him down.", "title": "The Boy in the Suitcase\n      \n          (Nina Borg #1)", "url": "http://www.goodreads.com/book/show/10776592-the-boy-in-the-suitcase", "average": 3.6, "cover": "https://images.gr-assets.com/books/1320545877l/10776592.jpg", "reviews": 3038, "authors": [{"url": "https://www.goodreads.com/author/show/3116926.Lene_Kaaberb_l", "name": "Lene Kaaberbøl"}, {"url": "https://www.goodreads.com/author/show/3398035.Agnete_Friis", "name": "Agnete Friis"}], "type": ["Mystery", "Fiction", "Thriller", "Mystery", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/10776592-the-boy-in-the-suitcase", "http://www.goodreads.com/book/show/11749186-the-boy-in-the-suitcase", "http://www.goodreads.com/book/show/31195727-the-boy-in-the-suitcase", "http://www.goodreads.com/book/show/17660955-dje-ak-u-koferu", "http://www.goodreads.com/book/show/13331079-the-boy-in-the-suitcase", "http://www.goodreads.com/book/show/12687509-the-boy-in-the-suitcase", "http://www.goodreads.com/book/show/13034474-the-boy-in-the-suitcase", "http://www.goodreads.com/book/show/590327.The_Shamer_s_Daughter", "http://www.goodreads.com/book/show/590324.The_Serpent_Gift", "http://www.goodreads.com/book/show/590323.The_Shamer_s_Signet", "http://www.goodreads.com/book/show/590325.The_Shamer_s_War", "http://www.goodreads.com/book/show/13414725-invisible-murder", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}