{"ratings": 4534, "userreviews": [{"userName": "Amalia Gavea", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/56789747-amalia-gavea", "userReview": "‘’When I was young, lying in bed [...] I used to believe that Tuscar was a man and the Blackwater Lightship was a woman and they were both sending signals to each other and to other lighthouses, like mating calls.’’\nColm Toibin entered my top-5 squad of contemporary writers with his haunting rendition of the Atreides tragedy House of Names. I wanted to start my research of his work with a number of his earlier novels before I move on to Brooklyn and The Blackwater Lightship came my way. It was one of the best books I’ve read this year and it showcases how simple stories can cause a major impact on the reader when they’re well-written. And Colm Toibin definitely knows his Art…The story is set in Ireland during the mid-90s, in Blackwater, in County Wexford, not very far from Dublin and close to the sea. Helen, a bright mind, the youngest school principal in the country, is happily married to Hugh and has succeeded in finding the balance between her career and the raising of two sons. Everything changes when she receives the news that her younger brother, Declan, is seriously ill, infected with HIV. So, she’s forced to reunite with Lily, her cruel mother, under the roof of Dora, her grandmother. A number of people has to come together for Declan’s sake and this is where the memories and faults of the past return to haunt Helen.It is a simple story, a familiar ordeal during the 80s and the 90s when AIDS was at its peak, but great writers know how to create works of Art out of daily life. Toibin brings to focus the implications of the disease without a hint of melodrama but, most importantly, he centres his story around the complexity of human relationships that grow within a family and never let go. He writes about motherhood and the fragile, delicate balance between the three women of the family and I loved the way he depicted Helen’s fears and her struggle not to become the kind of mother Lily has been to her. He illustrates the dynamics in a problematic family and the implications of a mother’s actions and choices in direct, evocative prose that contains many moments of haunting beauty.There are a number of elements that make this sad story such a beautiful thing to read. The setting is magical, the community by the water, the lighthouse that gives its light in Dora’s house during the evenings, the fact that most of the interactions take place at night. He creates a beautiful metaphor by using the lighthouse that once stood proudly and the name Blackwater to refer to the events of the story. Tuskar, the remaining, lonely lighthouse, dimly sheds its rays in the evening of Declan’s life and creates a haunting, foreboding atmosphere. The bleakness of the landscape is further emphasized by the lyrics of the Irish songs and the fact that Death is everywhere. The shadow of a loved one now long lost and the death that awaits in the doorstep to snatch a younger soul. The stages of grief are beautifully described in a sequence of striking scenes about the aftermath of loss, as are the omens associated with Death in the Irish culture.Toibin transports us to the place and time with his references to politics and religious issues. I appreciated the reference to Mary Robinson -one of my favourite politicians- and the fact that he presents an extremely balanced view of the impact of Religion in the Irish community. Τhe shelter and comfort that it provides during the moments of agony and the restrictions that often come by abiding to Catholic traditions are perfectly depicted throughout the course of the story.And then, we have the characters. Quite an oppressive family for Helen, to be honest, especially the mother. Lily simply refuses to accept what is different and tries to alter everything that doesn’t conform to the’’ family history’’ and her ideas of propriety. At the same time, Lily can do everything she wants just because she thinks she’s entitled to. A truly infuriating woman...Had I been Helen, well, let’s just say that I would have considered myself to be motherless, as cruel as it may sound. No amount of pain is an excuse for her cruelty, bigotry and narrow-mindedness. Helen, Declan and Paul are all wonderful, realistic characters. Declan is such a brave, brave man and Paul is loyal and considerate to the extreme. Larry is absolutely useless but for me, the character who shares the spotlight with Helen is Dora. I ended up appreciating her deeply and I thought she was a much better mother to Helen than Lily ever was. This is the kind of story where the characters take a step back to let the past and the interactions speak for themselves and it works.Through the descriptions of the daily life in a small Irish community, the religious and social expectations and prejudices, the aspirations of the characters and the dynamics within a family, Toibin weaves a story that is beautiful and poignant in its calm, underlying sadness. Above all, it is the way a determined, intelligent woman and a brave man fight against those who wanted to chain them to the ground. And Toibin proves, once again, why he is considered a powerhouse in today’s Literature.*Στους φίλους από Ελλάδα οι οποίοι θα διαβάσουν το παραπάνω κείμενο, οφείλω να πώ μακριά από την μετάφραση του Gutenberg. Είναι φρικτή. Λάθη στα τοπωνύμια, λάθη στην απόδοση των εκφράσεων, λεξιλόγιο πεζοδρομίου. Πραγματικά, αδυνατώ να καταλάβω ποιες λέξεις μετέφραζε η κυρία Δημητριάδου με τον τρόπο που τις απέδιδε στα Ελληνικά...Μάλλον η ‘’μεταφράστρια’’ εμπνεύστηκε από Ελληνικές σειρές επιπέδου...ελληνικού. Δεν περίμενα βέβαια και τίποτα καλύτερο…*My reviews can also be found on https://theopinionatedreaderblog.word..."}, {"userName": "Duane", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "It's the story of an Irish family that is as fractured as it could possibly be, brought reluctantly together by the tragedy of a son/brother dying of Aids. Heartbreaking and devastating, and it will leave you drained at the end.4.5 stars for what may be Toibin's best novel."}, {"userName": "John ", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/13555808-john", "userReview": "Declan, approaching 30, is dying of AIDS in Southern Ireland. His father had died young too, of cancer. He wants to see that part of the coast he remembers as a child when he and his sister Helen stayed with their grandparents, throughout their father's prolonged final illness at hospital in Dublin. It is in these waters that the Blackwater Lightship once shone, a secondary source of light alongside the more powerful Tusker lighthouse.His mettlesome granny, Dora, now widowed, is host in her remote and shabby home to Declan and his entourage – 2 gay friends, his mother Lily (Dora's daughter) and sister Helen. The three women have an uneasy relationship, to say the least and those tensions build as Declan's illness progresses. We gain an understanding of the reasons for this as Declan fights for life, reviving memories of his father's death and its effects on his family - bitterness, recrimination and deep misunderstanding. Laughter and tears will alternate throughout this deeply human situation,particularly in those last days at Granny's, something Toibin excels at portraying. Such are his skills that his words will resonate, I suspect, with most of us. If my own experience is anything to go by it will teach us things about ourselves and those near and far from us. This is why he is one of my very favourite writers."}, {"userName": "Γιώργος Κατσούλας", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/58751120", "userReview": "Τι γίνεται όταν ο Μπεργκμαν συναντά Τον Τσέχωφ?Δράμα μεγατόνων.Μονάχα αυτοί οι μακροσυρτοι μονόλογοι να έλειπαν και θα μιλούσαμε για ένα λιτό αριστούργημα που δημιουργεί μια αποπνικτική ατμόσφαιρα με ελάχιστες μεταφορές και παρομοιώσεις"}, {"userName": "Anna", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/63165929-anna", "userReview": "3,5/5 Μυθιστόρημα εσωτερικού χώρου, που διαπραγματεύεται τις διαπροσωπικές σχέσεις 3 γυναικών, κόρης - μητέρας - γιαγιάς, της Ελεν, της Λιλι και της κυρίας Ντεβερο κατά σειρά. Οι γυναίκες αυτές καλούνται να συνυπάρξουν στον ίδιο χώρο και να διαχειριστούν τις συγκρούσεις τους για χάρη του αδερφού (- γιου- εγγονού), Ντεκλαν, που πεθαίνει από Aids. Με πρώτη ανάγνωση φαίνεται αρκετά επιφανειακό. Ολοκληρώνοντάς το, νόμιζα πως χρειαζόταν να ειπωθεί κάτι ακόμα, πως οι διαλυμένες σχέσεις που παρουσιάζονται είναι άνευ ουσίας. Όταν το ξαναπερασα από τον έλεγχο, είδα πως πράγματι οι συγκρούσεις είχαν κέντρο βάρους, υπήρχαν βαθύτερα, εσωτερικά αίτια, στο θάνατο του πατέρα της Ελεν, που βίωσε στην παιδική ηλικία, και τη λάθος αντιμετώπιση από τη μητέρα της. Με έχασε όμως στο ρόλο - γλάστρα του Ντεκλαν, και στη μη ρεαλιστική αντιμετώπιση της κατάστασης. Δέχονται τόσο μα τόσο ψύχραιμα πως ο νεαρός πεθαίνει, και δυσκολεύονται να χωνέψουν πως είναι ομοφυλόφιλος. Κυλάει πολύ γρήγορα όμως το βιβλίο, και σε ελάχιστα σημεία κουράζει!"}, {"userName": "Jay", "userReviewDate": "Feb 06, 2011", "userURL": "http://www.goodreads.com/user/show/3538579-jay", "userReview": "There are three contemporary authors writing in English whom I find extraordinarily engaging: Cormac McCarthy, Tim Winton and Colm Tóibín . They are all stylistically brilliant and all three weave worlds that address significant issues regarding the human condition. All, also, have received significant recognition for the quality of their production. Among that recognition, McCarthy by Pulitzer; Winton and Tóibín , by Man Booker.Cormac McCarthy’s writing is probably the more unconventional. He is less attentive to traditional grammar, punctuation and style. And the worlds he created are categorically darker, disheartening. Even in the comparatively brighter Border Trilogy (brighter than, say, “The Orchard Keeper”, “No Country for Old Men” or “Blood Meridian”), John Grady Cole and Billy Parham in the final volume are clearly marching into the postapocalyptic future of “The Road”. Hope and redemption dissipate in the ravaged earth.Hope—or at least thoughtful resignation and conditional re redemption—survive in Tim Winton and in Colm Tóibín’s worlds. The futures their people face are not suffocatingly black. It would be difficult to imagine one of McCarthy’s people writing about his life in retrospect as did Bruce Pike in “Breath”: “And though I’ve lived to be an old man with my own share of happiness for all the mess I made….”Tim Winton, compared to McCarthy is a more academic writer—at least in terms of the mechanics of writing. But like McCarthy, his prose is ultimately lyrical. It is clear and expressive—beautifully poetic that never misses a beat. So is Tóibín’s writing poetic. Tóibín’s writing, however, is also more elliptical than that of the other two writers. It moves quietly—stealthfully—page to page, focusing on what appears to be the mundane, on minutiae. In “The Blackwater Lightship”, Tóibín describes, at the beginning of the novel, Helen’s preparations for a party. The preparations seem to be limited to the delivery and the final pick up of chair and tables. But that economy of description ultimately explodes in the reader more than the words would seem to do. Tóibín , with his words, is a bit like Picasso with his brushes during his cubist period. He throws them out on the page, seemingly disordered and unrelated but re-structured to have them recomposed in the reader’s mind, infused with sudden insights and complex visions.The physical environment also plays a different role with each of the three. For Winton, the physical environment is integral to his plots. With the exception of “The Riders”, his novels unfold in Western Australia—in the narrow stretch of land sandwiched between the western sea and the eastern desert. It is a within that littoral that the bulk of Western Australians live. But that said, the waters of the ocean and of the rivers that empty into it are a living presence in Winton’s writings. In “Breath”, the ocean and its waters dominate. But they play a role in his other works as well, linked often to the very souls of his characters.In contrast to Winton, the physical environment for McCarthy and Tóibín are more simply stages on which their stories unfold. McCarthy’s plots play out in specific regions in the United States—in the Appalachians and, starting with Blood Meridian, the American Southwest and Northern Mexico. Tóibín is more varied, with stories set in Argentina, the United States and Europe. But Toíbín and McCarthy’s characters are not entwined inexorably to their environments as are Winton’s. For Tóibín and McCarthy, place helps define the themes but it does not control them.With their differences, the three writers are similar in regard to their voices. For example, Tóibín’s “Blackwater Lightship”, “Brooklyn” and “The Story of the Night” are more about emotion, thought and communication than about action. But the same is also true of McCarthy and Winton’s novels. All three tell engaging and compelling stories. But those stories engage and compel because they embroil the reader in the very themes of life. They all translate into works the same questions Paul Gauguin asked in paint: Where do we come from? What are we? Where are we going?"}, {"userName": "Barry Pierce", "userReviewDate": "Nov 05, 2015", "userURL": "http://www.goodreads.com/user/show/4593541-barry-pierce", "userReview": "In The Story of the Night, Colm Tóibín told the stories of men living with AIDS in New York in the late 80s. In The Blackwater Lightship, he transposes this storyline to Ireland in the late 90s, a vastly different setting. Helen, a school principal, discovers that her brother Declan is in hospital with AIDS. She has to work out how to tell their mother and grandmother about his diagnoses which he's apparently had \"for years\". Published just six years after Ireland's decision to decriminalise homosexuality, I feel that its effect was more profound and radical in the late 90s than it is now in 2015.The Blackwater Lightship is somewhat of a companion to The Heather Blazing. They are both set in the same area with the Redmond's from Blazing turning up again here. Both novels perfectly encapsulate 90s Ireland, the sensibilities and the lavishness. Characters are school principals and lawyers, they live in noisy cities while their parents are held up in crumbing houses in the countryside. The clash of the nouveau riche with old Catholic Ireland play central parts in both novels. The character of the grandmother in The Blackwater Lightship is just fantastic, she binds these two generations together with flawless comical insights. She is the typical Irish grandmother, an embracer, a voice of solace.I do think this is the superior novel to The Heather Blazing, it is a novel about family, whether they be nuclear or non-traditional. It's about who we really go to in our hours of need and who we share our lives with, whether we be stable or crumbling away, into the waves."}, {"userName": "jo", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/9830594-jo", "userReview": "Όταν διάβασα μια κριτική για το «Καραβοφάναρο στο μαύρο νερό» αισθάνθηκα πως το βιβλίο αυτό θα γινόταν από τα αγαπημένα μου για το 2017. Περιέργως το έπιασα με πολύ θετικότητα – κάτι που το δεν το κάνω συχνά – και στην αρχή ήμουν πολύ ενθουσιασμένη, η εισαγωγή στην ιστορία ήταν ελκυστική. Όσο όμως περνούσε η ώρα και οι σελίδες που άφηνα πίσω μου πλήθαιναν αισθανόμουν πως κάτι έλειπε από την ανάγνωση και είχα αρχίσει να γίνομαι πιο νευρική. Όταν πέρασα την μέση του μυθιστορήματος αντιλήφθηκα πως αυτό που με ενοχλούσε ήταν ότι ενώ είχαμε μπροστά μας δυο φανταστικά θέματα - την κακή οικογενειακή σχέση των χαρακτήρων και τον επικείμενο θάνατο ενός χαρακτήρα από AIDS - ο συγγραφέας δεν έκανε πολλά με αυτά. Θα μπορούσε να το είχε δουλέψει τόσο καλύτερα, να εμβαθύνει αρκετά στον ψυχισμό των χαρακτήρων και ειδικά ενός γκέι άντρα που πεθαίνει από AIDS αλλά ο συγγραφέας άφησε την ευκαιρία να χαθεί.Παρόλο που ο Colm Tóibín κινήθηκε σε ασφαλή μονοπάτια η γραφή του ήταν πολύ όμορφη, το βιβλίο το διάβασα στα αγγλικά όποτε ήρθα σε επαφή με το πρωτότυπο κείμενο, και βρήκα τις περιγραφές των τοπίων εξαιρετικές. Μάλιστα, μπήκα στο Google για να κοιτάξω τα μέρη που αναφέρονται στο βιβλίο. Μου άρεσαν και οι διάλογοι ανάμεσα στους χαρακτήρες, βλέπαμε τις σχέσεις τους να αλλάζουν και να ωριμάζουν μπροστά στα μάτια μας. Δεν δέθηκα με κανέναν από τους χαρακτήρες του βιβλίου και δεν μπορούσα να καταλάβω πως γίνεται να μην μιλούν μεταξύ τους μια ολόκληρη δεκαετία για κάτι που εμένα δεν με έπεισε ποτέ για την σοβαρότητα του. Στο τέλος χάρηκα που το διάβασα ακόμα και αν δεν κατάφερα να το αγαπήσω όσο θα ήθελα. Είναι ένα ωραίο βιβλίο, μέχρι εκεί όμως."}, {"userName": "Darlene", "userReviewDate": "Sep 16, 2016", "userURL": "http://www.goodreads.com/user/show/1809697-darlene", "userReview": "In 1993, homosexuality was decriminalized in Ireland; and it is also important to note that at this time, the world was in the midst of the AIDS epidemic. This is the backdrop against which The Blackwater Lightship by Colm Toibin takes place. It was the end of another school year and Helen, a school principal in Dublin, was looking forward to a holiday with her husband and two young children. That holiday, however, would have to wait. Paul, a longtime friend of Helen's brother Declan, arrived on her doorstep and he brought bad news. Declan had sent him to request that Helen come to St. James Hospital. Declan was being treated for one of those opportunistic infections which AIDS patients were often afflicted with. In fact, this infection was the latest of many such infections Declan had battled and his health had seriously deteriorated. Although Helen was shocked, not only by Declan's illness, but also by his sudden 'coming out' to her, she agreed to drive to their granny's seaside home to make the request that Declan and his two longtime friends and caregivers, Paul and Larry, be permitted to spend time there convalescing in familiar surroundings.. because it was clear that Declan was near the end of his life. IT was to be Helen's responsibility to tell both her Granny Dora and her mother Lily about the seriousness of Declan's illness. On the drive to her granny's house, Helen ruminated on her estrangement from her family and it is through these ruminations that you discover that not only were Helen and Declan not particularly close but Helen's granny and her mother had not been invited to her wedding and they had never met her children. The three women in this family were strong, stubborn and opinionated... and possessed very long memories. The slights, harsh words and unreasonable expectations that had been exchanged over the years were never far removed from any of them. Helen had been holding tight to her resentment toward her mother, recalling that the family members' estrangement began when she and Declan were children and they had stayed with their granny and granddad while their father had entered the hospital ostensibly for tests. Helen recalled that she and Declan had stayed at the seaside house for weeks, all the while being reassured that her parents would return home soon... but their father never returned.. and her father's death, the subsequent lack of explanation of his death and the total lack of any comfort from her mother marked, for Helen, the beginning of the disintegration of the relationship between them. I found this book so compelling because it demonstrated so beautifully that no matter how complicated and contentious relationships become between family members... no matter how strained and frayed these bonds may get... there is often the hope and expectation that when a member of this complex unit of people bound together by blood and history, needs assistance and nurturing, that somehow the members find a way to push aside their feelings of resentment and bitterness and rise to the occasion. As this story demonstrated so vividly, this process is never easy or pretty and is almost always quite painful; but Declan was dying and he needed the comfort of his family.Although Declan was never really developed as a character, there was an obvious childlike quality about him.. a trusting and acceptance of the three difficult women in his life that never wavered, which I believe makes him so essential to this story. Declan's illness and his desire to spend his last days at his granny's house is the catalyst that the three women need to once and for all, put aside their resentment and come together because what they share... a love for Declan... is far greater than all the negativity that has kept them apart all of these years. Just as the death of Helen and Declan's father all those years before had brought silence and resentment, Declan's death might be what finally fixes what has been broken in this family. And just as Granny's house, perched so precariously at the edge of the cliff, had weathered the stormy seas all of those years so too would the family weather its own storms. The Blackwater Lightship, to me, was a testament to the power of love and the bonds that may be forged by family."}, {"userName": "Michael", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "An understated account of how a broken family begins to heal itself in the context of the return of a son dying of AIDS. Helen, a teacher in the Dublin area, helps install her beloved brother Declan into the care of her mother and grandmother in a seashore village in southeastern Ireland. The occasion makes her deal with the nearly decade-long estrangement dating from the time when her father got cancer and her mother effectively took him away from her and her brother during his months of illness and left her and Declan in the care of the grandmother. Slowly they begin to resolve the blocks to emotions about the source of the break, aided by the presence of two very different gay friends of Declan's who come to help. The rocky shore, erosion by waves of the cliffs and houses, and a lighthouse provide a great backdrop for reflection and metaphors about life and death and human resilence. The Blackwater Lightship was a lighthouse that is no longer there, while another remains, no longer sharing signals the one that disappeared. I like the conception of nature telling us that we are almost nothing and not needed, leading us to solving the mysteries on our own. Sort of like the Leonard Cohen line: \"We are so small between the stars, so large against the sky.\" That is just my take on the resonances and waves evoked by this spare family tale."}, {"userName": "Baxevanidou Faye", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/21664263-baxevanidou-faye", "userReview": "Το Καραβοφάναρο στο μαύρο νερό λοιπόν Αυτό το βιβλίο με συγκλόνισε και τείνει να γίνει ένα από τα αγαπημένα μου για το 2017 αν όχι το αγαπημένο μου Από πού να ξεκινήσω την κριτική μου δεν ξέρω...... Σίγουρα είναι το καλύτερο του Colm Toibin από αυτά που έχω διαβάσει ως τώρα με δυνατούς γυναικείους χαρακτήρες όπως πάντα Σίγουρα με συγκλόνισε και μάλιστα με έπιασε απροετοίμαστη Δεν ήμουν περίμενα να διαβάσω κάτι τόσο δυνατό Προσοχή όταν λέω δυνατό μην περιμένετε κάτι με δράση Όλη η ιστορία εξελίσσεται σε ένα σπίτι Όμως τελικά νομίζω ότι αυτή είναι η μαγεία του συγκεκριμένου συγγραφέα Πολύ θα πουν ότι είναι επιφανειακό,ότι κυλάει πολύ αργά, ότι δε γίνεται τίποτα Όμως πιστεύω ότι ο στόχος του συγγραφέα δεν ήταν να μιλήσει για το AIDS ούτε για τους gay και γι αυτό δεν εμβαθύνει τόσο πολύ στο θέμα αυτό Πιστεύω ότι περισσότερο ήθελε να εστιάσει στις ενδοοικογενειακές σχέσεις φανερές και υπόγειες Μας παρουσιάζει αριστοτεχνικά της δυσλειτουργικές σχέσεις τριών γενιών γυναικών και πως αυτές αντιμετωπίζουν μια τραγική στιγμή και την απώλεια Είναι φοβερό να βλέπουμε το πόσο διαφορετικά εκλαμβάνει ο κάθε άνθρωπος τις συμπεριφορές των άλλων και αυτό που του συμβαίνει Και οι τρεις γυναίκες έχουν έρθει αντιμέτωπες με την απώλεια και οι τρεις την έχουν αντιμετωπίσει διαφορετικά Και οι τρεις κουβαλούν τις δικές τους πληγές και κατάλοιπα από αυτό Ο Toibin χωρίς εξάρσεις,χωρίς τυμπανοκρουσίες, χωρίς φλυαρία μας αποδίδει την τραγικότητα προσώπων και καταστάσεων καθώς οι σχέσεις των γυναικών αλλάζουν και ωριμάζουν μπροστά στα μάτια μας Αδιαμφισβήτητος μαέστρος στην σκιαγράφηση της γυναικείας ψυχολογίας μόλις εδραίωσε την θέση του ως ένας από τους αγαπημένους μου συγγραφείς Εν ολίγοις ένα εξαιρετικό μυθιστόρημα από έναν Μαιτρ του είδους για τις σχέσεις,την οικογένεια,τον πόνο, την συγχώρεση , και τέλος την λύτρωση“Όταν πέθανε ο πατέρας μου, ο μισός μου κόσμος κατέρρευσε, εγώ όμως δεν το πήρα είδηση. Ήταν λες και μου είχαν τινάξει το μισό μου πρόσωπο στον αέρα, εγώ όμως συνέχιζα να μιλάω και να χαμογελάω, με την ιδέα ότι δε μου είχε συμβεί εμένα αυτό ή ότι με τον καιρό θα επανερχόταν. Όταν πέθανε ο πατέρας μου, η μητέρα μου και η γιαγιά μου με άφησαν μόνη μου. Ξέρω ότι είχαν τα δικά τους προβλήματα, ίσως και να μη μπορούσαν να με βοηθήσουν, άλλωστε μπορεί να είχε γίνει ήδη η ζημιά, αλλά ούτε η μία ούτε η άλλη προσπάθησαν να με παρηγορήσουν ή να μου τονώσουν το ηθικό. Οι δυο αυτές γυναίκες είναι τα κομμάτια του εαυτού μου που έχω θάψει, ναι, αυτό είναι κι οι δυο τους για μένα, γι' αυτό ακόμη θέλω να τις κρατάω σε απόσταση.”ΥΓ1 Στην αρχή η μετάφραση του τίτλου με ξένισε προχωρώντας όμως κατάλαβα πόσο ταιριαστός είναι ο τίτλος στην υπόθεσηΥΓ2 Εξαιρετική μετάφραση της Αθηνάς Δημητριάδου καθώς και το επίμετρο"}, {"userName": "Wealhtheow", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/76129-wealhtheow", "userReview": "Helen lives a predictable, pleasant life, until suddenly a stranger turns up and tells her that her brother is sick--is, in fact, dying of AIDS in a nearby hospital. Declan wants to stay in their grandmother's cottage while he recuperates from his latest hospital stay. His sister, mother, and grandmother are thus thrown together in a small sea-shore cottage, forced into close quarters after a decade of estrangement. Two of his friends come to keep him company and look after his health, causing further moments of awkwardness.Basically, six adults hang around a cottage for a few days, constantly splitting off to have one-on-one conversations with each other about the others, and about the past. Helen resents her mother who resents her own mother, and they all talk and think about it endlessly. Maybe these ruminations on what to do when you don't like or emotionally trust your family would feel more poignant or important if I identified with them more. As it was, it was all just really boring. Helen would walk along the shore, think about how cold the water looked, how strong and enduring the cliffs looked, and then come to some minor realization about her feelings for her mother. \"I resented her for not being around when my father died,\" she realizes wonderingly. Rinse, repeat. Thrilling stuff.My boredom with the complete lack of plot or conflict might have been alleviated if the characters read more believably. But alas, they're written, particularly Declan, Lily, and Dora, with broad strokes mixed with minutia. By the end of the book I knew that Declan liked self-service restaurants as a child, disliked carrots, and feared escalators, but I still had no idea what he did for a living, how he'd made the friends he did, or even his hobbies. It felt like his sole purpose in the story was to suffer and force Helen and their mother to have uncomfortable emotional moments together. He never felt like a person in his own right. Although I felt Tóibín relied too heavily on the sea and the lighthouse as metaphors, without doing any heavy lifting of his own, some of the writing is lovely. But some is just crap. An example: She put the car into gear and drove it slowly to the barrier. 'You need fifty pence. Do you have a fifty-pence piece?' she asked her mother.Her mother searched through her bag and found a purse with loose change. She handed Helen a fifty-pence piece and Helen opened the window and put it in the slot. The barrier lifted.'We should have gone to the other car park,' Helen said. 'You don't have to pay there.'I assume he's trying to say something about the mundane details of survival persisting despite looming tragedy, but dear god is it boring to read."}, {"userName": "Γιώργος", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/22671170", "userReview": "Άλλο ένα πολύ καλό και ποιοτικό βιβλίο, αισθητικά και σε περιεχόμενο, από τις εκδόσεις Gutenberg στην εξαιρετική σειρά Aldina. Γραμμένο το 1999, το \"Καραβοφάναρο στο Μαύρο Νερό\" είναι ένα βιβλίο για τις οικογενειακές σχέσεις, τις διαφορετικές γενιές (γιαγιά-μητέρα-κόρη) και την αντίδρασή τους καθώς και το δέσιμό τους σε μια δύσκολη κατάσταση. Ένα μυθιστόρημα \"δωματίου\" όπως επισημαίνει και η μεταφράστρια, καθώς εκτυλίσσεται σχεδόν εξ ολοκλήρου στην κουζίνα της γιαγιάς Ντόρα Ντέβερο, μα δεν είναι καθόλου βαρετό. Με μια απλή, απέριττη πρόζα και μέσω διαλόγων και αναδρομών ο Τομπίν καταφέρνει να καταδείξει τις σχέσεις των προσώπων, τις αντιπαραθέσεις και τις απόψεις τους, καθώς και τις λεπτές αποχρώσεις στις οποίες λανθάνει ένα διαφορετικό νόημα. Το θέμα στο οποίο ρίχνει φως ο συγγραφέας και με ενδιαφέρει πολύ καθώς το κάνει με εξαιρετικό τρόπο είναι αυτό της \"οργανωμένης σιωπής\" των οικογενειών και των απωθημένων που απορρέουν από αυτήν. Η κόρη Έλεν, την οποία γνωρίζουμε και ως κεντρική ηρωίδα αν και η αφήγηση είναι τριτοπρόσωπη, κρατάει πολλά που θέλει να πει στη μητέρα της πριν μια εικοσαετία από τότε που πέθανε ο πατέρας της από καρκίνο αλλά τα κρατάει μέσα της, διαιωνίζονται και καταλήγουν σε μια σύγκρουση και μια αποξένωση που έχει ως συνέπεια τη διακοπή επικοινωνίας μεταξύ τους για δέκα χρόνια. Όμως η αρρώστια του αδερφού της Ντέκλαν, πάσχει από AIDS και είναι στα πρόθυρα του θανάτου, θα φέρει όλες τις γενιές κοντά και μαζί με δυο (γκέι) φίλους του Ντέκλαν (γκέι κι αυτός) με εντελώς διαφορετικές προσωπικότητες, το σπίτι της γιαγιάς Ντόρα θα γίνει μια ποικιλία προσώπων, γενεών και απόψεων που θα συμπράξουν για να αντιμετωπίσουν την κατάσταση και να επουλώσουν τις πληγές τους. Ένα καθηλωτικό, τρομερό μες στην απλότητά του μυθιστόρημα. (Ο ρόλος του AIDS είναι δευτερεύων και λειτουργεί σαν το εναρκτήριο λάκτισμα για να ξετυλιχθεί το κουβάρι των σχέσεων)."}, {"userName": "Anna", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/41878643-anna", "userReview": "In the house by a cliff of the southern coast of Ireland, a reluctant family comes together around a brother, son and grandson, who is dying of aids. The three women - sister, mother and grandmother find out about Declan's preference and his illness all at once and try to deal with the facts each in her own way. But the closet seems to be filled with many other skeletons besides Declan's homosexuality. There are memories of the past, the relationships and unresolved conflicts between the three women. The family dynamics with the adored son who can do no wrong, and a daughter who is expected to be of service to everyone. Parents, who left their children with grandparents and never came to visit while father was being tested and finally died of cancer. The mother, who wishes that her daughter be different, and the daughter who most of all wants to be accepted for who she is. The grandmother, who played a role of catalyst in many of the past events. The daughter who having over the years built up a defence wall against her mother doesn’t keep in touch so that she can never be hurt again. The situation is breathtakingly real. We follow the characters through a psychologically dence weekend to a conclusion that is sufficiently vague to be just as it is in real life. Nothing is black or white and it is up to the participants to draw the conclusions.It is my second novel by Colm Tóibín. ”The Master” and ”The Blackwater Lightship” could theoretically not be more different, but the authors ability to create complex characters is what they have in common and I can not wait to explore more of his wonderful writing."}, {"userName": "Alex", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/39328440-alex", "userReview": "Fortunately this book is short. However, not short enough. The premises of the book are interesting enough to make one read at least half of it wondering what is going to happen next. But after that everything is just painful. The whole story smells staged and faked - the story, the dialgoues, the monologues, everything is fake in this book. Fake and boring. The story starts announcing some big family drama, and some skeletons in the closet to be discovered, however, the whole drama is described so emotionlessly, with lots of dialogues it makes it totally artificial. There are 5 persons (+ Declan =6) which take turn in soliloquing about their lives and dramas and stuff. BORING !!!! Only Declan throws up and has diarrhea almost on every page. He doesnt speak that much.\"Nora Webster\", another book from Toibin I read, had also some boring element in it, however it succeded in catching my attention. Probably because it had some main story and not so many as \"The Blacwater Lightship\" has - the story of the grandmother with the mother, the mother with the daughter, the grandmother and mother with the daughter, the gay stories, the AIDS stuff, the coping with AIDS and gay-being in the catholic institution and family and so on; ah, the story of Helen and Hugh, their children and the relationship with Helens mother. And this in only 295 pages !!!!"}, {"userName": "Debra", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "3.5 starsHelen is a school principal living in Dublin. She is married with two children. She is preparing to go on Holiday with her family in the beginning of the book. Then she learns that her brother Declan has suffered from AIDS for years without telling her. Declan asks her if she would tell their Mother and Grandmother his diagnosis. Helen, who has been estranged from her Mother and Grandmother for years is put in a position to contact the women but to also deal with past issues especially her father's sudden death during her childhood. The women, in fact, have not been invited to Helen's wedding nor have they met her children. Plus, Declan has no place to stay while he recuperates and he requests to spend his time at his Grandmother's home. This is where their Mother, Lily was raised and where Helen and Declan were raised after their father died and their Mother abandoned them (in their eyes). This makes for interesting family dynamics.The women are forced to come together for Declan's sake. They are joined by Declan's two friends, Paul and Larry, which make for an interesting mix in the home. Everyone must adjust to each other: the past hurts, misunderstandings, Declan's illness, the other men in the home, their own personal issues and each other.Although, Declan has AIDS this book is mainly about family. How do have contact again after not having contact for so long. How do you slide back into a relationship? We see more of the women's lives. I do wish we saw more of Declan's life. But this book was really about family relationships, dynamics and healing. That ending though...I liked this book but I was hoping for better. I loved Brooklyn and was hoping to be as invested in this book as I was in that. I had a hard time connecting to anyone in this book. The characters irritated me with the stubbornness. I do think this is what the Author wanted. He wanted the reader to be as frustrated with these characters as they were with each other. This book was a little slow moving for me at times. At other times I thought this book was brilliant. As always his writing was beautiful but at parts it failed to grab me. See more of my review at www.openbookpost.com"}, {"userName": "Bettie☯", "userReviewDate": "Oct 29, 2014", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "<- my coverDescription: It is Ireland in the early 1990s. Helen, her mother Lily, and her grandmother Dora have come together, after a decade of estrangement, to tend to Helen's beloved brother, Declan, who is dying of AIDS. Under the crumbling roof of Dora's old house, Declan's two friends join the women as each waits for the end. The six of them, from different generations and with different beliefs, are forced to plumb the shoals of their own histories and to come to terms with each other. \"The Blackwater Lightship\" is a beautifully written, deeply resonant story about three generations of an estranged family reuniting to mourn a tragic, untimely death. In spare, luminous prose, Colm Tiibin explores the nature of love and the complex emotions inside a family at war with itself. His fourth novel is about morals and manners, and the clashes of culture and personality. But most of all, it is a novel about the incomparable capacity of stories to heal the deepest wounds.FOR AIDAN DUNNEOpening: Helen woke in the night to the sound of Manus whimpering. She lay still and listened, hoping that he would quieten and turn on his side and sleep, but when his voice became louder and more insistent and she could vaguely make out words, she got out of bed and moved towards the boys' room; she was unsure whether he was dreaming or awake.Instantly accessible - the minute the front page is opened I was whisked into a Dublin night (rain expected) party complete with impromptu singing and dancing after a grand chili con carne supper. TR The MasterCR The Blackwater Lightship4* Nora WebsterLIDA - The Testament of Mary - subject matter does not appeal"}, {"userName": "Betsy McTiernan", "userReviewDate": "May 13, 2013", "userURL": "http://www.goodreads.com/user/show/1118082-betsy-mctiernan", "userReview": "After Brooklyn and Testament of Mary, Toibin is at the top of my list of feminist writers. This novel focuses on a family and friends brought together by impending death. Helen's brother, Declan, is dying of Aids. He decides he wants to spend a few days at his maternal grandmother's house with Helen, his mother and a couple of friends. Helen has been estranged from her mother and grandmother for over a decade, and Declan had never come out to his family. This big secret bursts out of the closet, bringing in its wake old resentments, misunderstandings, and tension. Everyone's hurt; everyone craves love. Only Declan and his friends know how to confront these demons. Though we know from the first that Declan's doomed, we are pulled along by the possiblity that the rest of his family might not be. Toibin's dark Irish humor and crisp prose keep things moving along."}, {"userName": "Lavinia", "userReviewDate": "Apr 17, 2017", "userURL": "http://www.goodreads.com/user/show/1405967-lavinia", "userReview": "Early '90s. Declan is dying and Tóibín masterfully brings together the women in his life (sister, mother, grandmother), forces them to cope with him being gay and having AIDS, throws in a couple of best friends and delivers an absolutely amazing story of hardship, friendship and loss. I love this guy to the moon and back."}, {"userName": "Martha", "userReviewDate": "Apr 06, 2013", "userURL": "http://www.goodreads.com/user/show/1134335-martha", "userReview": "This is is a clear- eyed, beautiful book. Toibin never tries too hard. His characters reveal themselves in conversation that is pitch perfect. The difficult parts of living and dying are not side stepped, but there is humor too because this is about family and all the messiness that entails."}, {"userName": "Eirini Proikaki", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/21180355-eirini-proikaki", "userReview": "To Καραβοφάναρο(ωραία λέξη αυτή) είναι ένα μυθιστόρημα που μιλάει για τις οικογενειακές σχέσεις.Ο επερχόμενος θάνατος απο AIDS του αδερφού της Ντέκλαν ,φέρνει κοντά την Έλεν,την μητέρα της και την γιαγιά της και επιδρα καταλυτικά στη σχέση τους.Οι τρεις γυναίκες έχουν αποξενωθεί και η Έλεν έχει τυπικές σχέσεις με την γιαγιά της και έχει να μιλήσει 10 χρόνια με τη μητέρα της.Τώρα που αναγκαστικά πρέπει να συνυπάρξουν στον ίδιο χώρο,δεν μπορούν να αποφύγουν να αντιμετωπίσουν το παρελθόν τους,να κοντραριστούν και να μιλήσουν επιτέλους για το πώς έφτασαν να απομακρυνθούν έτσι.Το βιβλίο ξεκίνησε λίγο υποτονικά θα έλεγα αλλά όσο προχωράει η ιστορία και ειδικά απο τη στιγμή που βρίσκονται όλοι μαζί στο ίδιο σπίτι, αποκτά ενδιαφέρον.Ωραίοι οι διάλογοι ,ωραία η ατμόσφαιρα και πολύ ωραίες οι περιγραφές του τοπίου.Μου άρεσαν επίσης οι ιστορίες των ομοφυλόφιλων φίλων του Ντέκλαν για την προσωπική τους ζωή.Αυτό που δεν μου άρεσε είναι οτι δεν συμπάθησα κανένα απο τα μέλη της οικογένειας και οτι οι εξηγήσεις για το πώς έφτασαν να ψυχραθούν έτσι δεν ήταν τόσο πειστικές.Περίμενα κάτι παραπάνω,μου φανηκε λίγο υπερβολικό να μην αντέχει ο ένας τον άλλον για αυτούς τους λόγους.Επίσης βρήκα λίγο επιφανειακή την προσέγγιση της αρρώστιας του Ντέκλαν.Αυτά.Ωραίο βιβλίο αλλά δεν με ενθουσίασε."}, {"userName": "Becky", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/1758987-becky", "userReview": "Colm Tóibín never writes an easy story to read & there always seems to be some small element that reaches in & speaks directly to me. Helen is a mom & a wife & a teacher, seems to have a loving marriage. Her husband & 2 sons head out for the start of a vacation & Helen is looking forward to some alone time....a visitor arrives & things change. We see a week or so in the lives of Helen, her mom, her grandmother, her brother & a few other people. In that week we actually get a little glimpse of a lifetime with Helen. An estranged relationship between mother & daughter & the needs of a son & brother hopefully help get this family to somehow maybe have a chance to get together again.Colm's female character's seem to have similar ways about them in the few books of his I have read, rather cold & remote & removed on the outside but carrying a lot of love & hurt inside....very interested to know what his childhood & relationship with his mom was.I am still gathering my thoughts on this one....tough read."}, {"userName": "Yulia", "userReviewDate": "Oct 07, 2009", "userURL": "http://www.goodreads.com/user/show/185835-yulia", "userReview": "This beautiful novel chronicles a week in the lives of its characters as they try to comfort their mutual connection, Declan, a man in his late 20s dying of AIDS and running out of time to see long-standing conflicts be put aside between his sister, mother and grandmother, all of whom are estranged from one other for over a decade because of reasons even they cannot quite articulate or understand. Aided by two friends who've been looking after him long before his family suspected anything was wrong, Declan also forces his family to come to terms with their stubborn refusal to ask for help from one other. Psychologically astute to the ways in which people hide from themselves and others and don't recognize how their best intentions may hurt them and those they love, this novel about living and dying is both beautiful and heart-wrenching, but never sappy. Though the characters are all stubborn in their own ways and the coast itself is veiled in mists, the novel is anything but willfully evasive and challenges our ability to empathize and forgive."}, {"userName": "Carol", "userReviewDate": "Aug 30, 2013", "userURL": "http://www.goodreads.com/user/show/3845138-carol", "userReview": "Not a good idea to finish the last 20 pages of this story at 5:00 AM before work! I'm wrecked and I look like hell. The novel was wondrous - I loved it and I'll review later."}, {"userName": "Trevor", "userReviewDate": "Jan 27, 2013", "userURL": "http://www.goodreads.com/user/show/12234181-trevor", "userReview": "It is very difficult to find fault with a book like this. The writing is beautiful, being elegant, restrained, sparse and poetic all at once. In fact Colm Toibin says more in one of his perfectly formed precise sentences, than most other authors can say in whole paragraphs.This is the story of a family that has grown apart over the years, and that is reluctantly brought back together again by a single event. Is not a new premise for a novel, but in Colm’s writing a fresh light is shone on it and the situation is brought to life again, warts and all.The breakdown in the family relationships is one that most people could relate to, no seismic event occurred, just incidents small and large, which culminated and grew over time, leading to a family being distant, resentful and uncommunicative. The rebuilding of the family relationships, some items being patched up, others being papered over or ignored is moving and realistic and at times painful to read, even if on occasions I wanted to tell them to “get on with it”.In parallel with the main narrative the evocation of the Irish landscape is terrific, and brings to life the countryside, the sea and the climate, and gives a great background and setting for the story.A wonderfully written novel, which I am sure I will be revisiting and discovering more of in future reads."}, {"userName": "Jim Fonseca", "userReviewDate": "Oct 05, 2013", "userURL": "http://www.goodreads.com/user/show/6743601-jim-fonseca", "userReview": "A young man in Ireland is dying of AIDS and he wants to spend his last days in his grandmother's seaside house where he has fond childhood memories. His gay friends visit and more-or-less live-in while they care for him. His female family members hover over the dying man as well: mother, sister and grandmother. The relatives all have \"issues\" with each other and the main character's illness serves to bring the interrelations among the three women to the fore. This story is told mainly by the sister. The Irish author is openly gay and the gay characters are the stars of the novel, winning over the crotchety grandmother, for example, as one man, an architect, designs a new floor plan for her house. The writing is excellent and the novel was short-listed for the Booker Prize. The novel, first published in 1999 is also a \"period piece.\" I've read that \"We have enough novels about gay men dying of AIDS\" and \"gay men do more than die of AIDS,\" but it needed to be written at the time."}, {"userName": "Dolors", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/18383778-dolors", "userReview": "3,5 rounded up to 4"}, {"userName": "Dem", "userReviewDate": "Jun 28, 2011", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "This is a nice easy read but did not find it a page turner. I felt the story was flat in places and I lost interest quite a few times and was glad it was a short read."}, {"userName": "Julie Christine", "userReviewDate": "Jun 18, 2008", "userURL": "http://www.goodreads.com/user/show/1213607-julie-christine", "userReview": "This is a powerful, quiet, beautfully constructed book. Anyone who has mother/daughter issues will be very touched by the characters and their complex stories."}, {"userName": "Caidyn (BW Book Reviews; he/him/his)", "userReviewDate": "Nov 05, 2015", "userURL": "http://www.goodreads.com/user/show/13614926-caidyn-bw-book-reviews-he-him-his", "userReview": "I don’t have any fancy quotes for this, no real insights. All I can say that this was a very rough book for me to read. It was depressing, and if it was any longer, I probably wouldn’t have been able to read it in one sitting like I did. This book was made to be a one-sitting read. So subtle, so quiet. It wasn’t until halfway through I realized that I had to finish this book today, no matter what it did to my emotions.Ireland, to me, is not a conservative country. Then again, I know it’s Catholic and that this year alone they passed so many equality laws -- marriage equality and a transgender rights -- so it’s one of those odd conundrums in my head. Especially when I read in a review of this book that when this book was written, only six years had gone by since the decriminalization of homosexuality. This book was written in 1999. To me, that’s mad. And then you look at what happened in 2015 in Ireland, and it’s even crazier. I’m proud of Ireland, is what I mean.What lies at the heart of The Blackwater Lightship, for me, wasn’t a family story. While, yes, this had great broken family relationships and showing how a tragedy can bring people together, but I’ve read books that showed those connections a lot better than this. Yes, it was a real statement for the time it was written, but that isn’t want made this a great book for me. What made it a great book was the unflinching way Mr. Toibin (and I wish I could do the proper accents on his name, but my computer doesn’t have that option) portrayed the horrific death AIDS provides. That was what got to me the most. I could have cared less about the story and the people, but Declan and how he was dying got to me.If you know nothing about dying from AIDS and what it does, then this book is eye opening. Since I knew how terrible it was, it just highlighted it more for me. Kaposi sarcoma, TB, pneumonia, meningitis, herpes, toxoplasmosis. Basically, when you’re as far as Declan was, if you get a simple cough or a scratch, it will kill you. As they say, it isn’t AIDS that kills you, it’s one of the many opportunistic infections that actually does. No one dies from AIDS, they die from the complications.This is a small but powerful book. Difficult read, whether you come from it as the horrors of AIDS or a broken family coming together in light of this tragedy. I’d call this a tragedy that is peppered with so many moments where I just had to laugh, then it comes in and punches you in the fucking face with sadness."}], "description": "A deeply resonant story about three generations of an estranged family reuniting to mourn an untimely death. It is the early 1990s, and Helen O’Doherty, her mother Lily, and her grandmother Dora, have come together in a crumbling old house along Ireland’s coastal southeast to tend Helen’s adored brother Declan, who is dying of AIDS. With two of Declan’s friends, the six of them are forced to plumb the shoals of their own histories and to come to terms with each other. Written in a spare, powerful prose, this is a moving novel about the capacity of stories to heal the deepest wounds.", "title": "The Blackwater Lightship", "url": "http://www.goodreads.com/book/show/1210348.The_Blackwater_Lightship", "average": 3.85, "cover": "https://images.gr-assets.com/books/1320542952l/1210348.jpg", "reviews": 422, "authors": [{"url": "https://www.goodreads.com/author/show/1351903.Colm_T_ib_n", "name": "Colm Tóibín"}], "type": ["Fiction", "Cultural", "European Literature", "Contemporary", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/1210348.The_Blackwater_Lightship", "http://www.goodreads.com/book/show/965888.The_Blackwater_Lightship", "http://www.goodreads.com/book/show/43702.The_Blackwater_Lightship", "http://www.goodreads.com/book/show/13605864-the-blackwater-lightship", "http://www.goodreads.com/book/show/32793638", "http://www.goodreads.com/book/show/965887.The_Blackwater_Lightship", "http://www.goodreads.com/book/show/965884.The_Blackwater_Lightship", "http://www.goodreads.com/book/show/661275.The_Blackwater_Lightship", "http://www.goodreads.com/book/show/4954833-brooklyn", "http://www.goodreads.com/book/show/21412360-nora-webster", "http://www.goodreads.com/book/show/13547234-the-testament-of-mary", "http://www.goodreads.com/book/show/43691.The_Master", "http://www.goodreads.com/book/show/29344653-house-of-names"]}