{"ratings": 5268, "userreviews": [{"userName": "Leland T-Money Fortier", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/75854664-leland-t-money-fortier", "userReview": "They speak the truth, nail biting is a gateway habit. I used to have a friend who was a nail biter, then he smoked weed, and I'm pretty sure he works at a Vape shop now."}, {"userName": "Muhammad Galal", "userReviewDate": "Aug 12, 2013", "userURL": "http://www.goodreads.com/user/show/11256995-muhammad-galal", "userReview": "فضلت تاكل في ضوافرها كتير جدًا ، أغروها بالفلوس ..... و ربّنا تاب عليها في الآخر من هذه العادّة السيّئة أعرف ناس كانوا بيعضعضوا في ضوافر رجليهم ، وربّنا تاب عليهم برضو :D"}, {"userName": "Eva Leger", "userReviewDate": "Aug 17, 2010", "userURL": "http://www.goodreads.com/user/show/1336770-eva-leger", "userReview": "I am so over the Berenstain Bears books. Thank God Julia never got into these like I know some kids are. We've read them when we've come across them but other than that we tend to pass them by. I can see where this book would be helpful for a kid who bites their nails but man, this family is so annoying. Why don't they have names? Everyone has names. Even some rocks have names for the love of God. Yet members of this family of bears are known by \"brother\" and \"sister\"? Listen, I'm sorry, I was going to review this like I normally do but I can't. I no longer want to think about any of these damn bears. Ever again. And, just so people don't get the wrong idea, I'm rating this two stars because.... hell, I don't even know why. I just don't want to give it one star. But I still hate it. I almost forgot - the stories are far too long - you could cut out half the book - any of the books - and still get the same thing and maybe no fall asleep too."}, {"userName": "Josiah", "userReviewDate": "May 01, 2009", "userURL": "http://www.goodreads.com/user/show/1914201-josiah", "userReview": "This is, in my view, an above-average picture book. The lesson on the effects of habits (both good and bad ones) is presented well without being condescending or too harsh, and the story itself is interesting and funny. I've always liked the books about the Berenstain Bears, and I think that they are second only to the publications of Dr. Suess is how commonly they can be found in pediatric offices throughout the United States. :-)"}, {"userName": "↜ƈɦǟռ☂ɛℓℓɛ↝", "userReviewDate": "Apr 26, 2013", "userURL": "http://www.goodreads.com/user/show/17896457", "userReview": "★★★★The Berenstain Bears and the Bad Habit by Stan and Jan BerenstainSister Bear has a habit, like most young cubs. Some scratch, some suck their thumbs, some play with their hair, but she bites her nails. The bad thing is she doesn't realize it, until it's too late, and starts to hurt. Bad Habits are hard to break, unless you have something, to remind you of them."}, {"userName": "Chelsey", "userReviewDate": "Aug 08, 2008", "userURL": "http://www.goodreads.com/user/show/1300643-chelsey", "userReview": "I actually just have a funny comment about this book. I love the Berenstain bears and this book is just one of them. I read it to my 3 year old that had a bad habit and instead of curing her of her habit, she developed nail biting like sister bear. So after reading this, we actually had two problems. Ack!"}, {"userName": "Brian", "userReviewDate": "Jul 01, 2008", "userURL": "http://www.goodreads.com/user/show/737313-brian", "userReview": "Hey! Money can solve your problems! what a lesson!"}, {"userName": "Danette", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/21533253-danette", "userReview": "Read with Naomi (with her thumb in her mouth)."}, {"userName": "Morgan Carlson", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/63681405-morgan-carlson", "userReview": "This book is about Sister Bear having a bad habit of biting her nails. She ends up biting them so much that her fingers hurt so he turns to Mama Bear for help. She first suggested putting tape around Sister Bear's fingers but the kids at school teased her so that didn't work. Papa Bear suggested that Sister Bear would get a dime at the end of the day if she didn't bite her nails. That didn't work and it discouraged Sister Bear. Finally, Gran suggested that he start out with ten pennies, one for each nail, and she kept all the pennies if she didn't bite any of her nails. She had a few set backs, but Sister Bear finally broke her bad habit.One element of fantasy that's seen in this book is that they are bears that can talk and live normal lives. Second, because they're animals, this book is considered to have fantastic people in the real world. The journey Sister Bear goes on is that of finding a way to break her bad habit. The theme of this book relates to the fantasy theme of love and friendship since it takes the help of other to help her break her habit.This book is very brightly colored to attract the eyes of young readers. The shading is very light, bringing a happy, joyful tone to the book. The illustrations are very cartoon-like, adding to the books humorous, comical aspect. There is a big use of framing, like the frames seen in graphic novels, which are used to display movement and transitions."}, {"userName": "Elise", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/5733323-elise", "userReview": "My extremely sensitive 4 year old cannot handle much drama in books. At one point in the book Papa Bear suggests that a good solution to deal with Sister Bear's nail biting is to \"read her the riot act\" and he started saying what an outrageous, disgraceful habit that was, etc. I skipped over that part to avoid a 30 minute conversation with my daughter over a 7-10 minute book. I think this is a lovely book and I remember reading it when I was a child."}, {"userName": "Paula Scott", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/66085063-paula-scott", "userReview": "Yea it's a cheesy book, but this book presents a great lesson for kids one that should follow them throughout their lives and a lesson parents should expand on and discuss with their children. This book teaches : Habits are self induced,for whatever reason, and they can be both good and bad and we can make or break habits. Kids need to know this because habits = the processes that contribute to the quality of life."}, {"userName": "Kristine Hansen", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/1952643-kristine-hansen", "userReview": "This is another of those Berenstain Bear books which seems aimed more at parents than child. The story tackles the topic of nail-biting, and the solution is creative. I wonder if it would have worked on me back when I used to bite my nails as a kid. Overall, I found the solution creative, the story fun to read and easy to identify with, and even entertaining."}, {"userName": "Raneem", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/10225877-raneem", "userReview": "من كثرة التوتر في المدرسة... تبدا دبدوبة في قضم اظافرها فكيف يمكنها التغلب على هذه العادة السيئة.... الكتاب لطيف جظا و يشرح بطريقة لطيفة معنى العادات و كيف يمكننا التخلص منها ... و لكن لعتراضي الوحيد انهم استخدموا الاموال كمحفذات لتوقف تلك العادة"}, {"userName": "Slow Man", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/6330812-slow-man", "userReview": "I don’t know what to think of that?"}, {"userName": "Zaidee", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/8495229-zaidee", "userReview": "berenstain bears pull through again with tips for breaking habits such as thumb sucking..."}, {"userName": "Alexandria", "userReviewDate": "Apr 29, 2014", "userURL": "http://www.goodreads.com/user/show/30348192-alexandria", "userReview": "Sister repeatedly bites her fingernails and cannot seem to stop herself. Mother and Gram come up with the solution that they will reward her with a dime every day that she does not bite her fingernails. While she is successful at first, after a while she keeps biting her nails, so the reward is changed to 10 pennies so that the sound of them jingling in her pocket remind her to stop biting her fingernails. The experiment works and Sister ends up with almost a dollar. A lot of children have bad habits that they cannot seem to break and parents do not know how to fix this. Children form all types of bad habits, whether it is biting your nails, sucking your thumb or chewing on your hair. This book shows that other children struggle with that as well and it offers a solution of how to fix it."}, {"userName": "Sam Gaume", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/30813870-sam-gaume", "userReview": "The Bad Habit teaches parents and children creative solutions to how to break bad habits. I know I still bite my fingernails and I do not see myself stopping seeing as I am coming up on 20 years of it. The parents in this book come up with the solution to give Sister a small amount of money each day that she does not bite her nails. This is positive reinforcement and is a great method for convincing a child to break a bad habit. Parent’s go-to method is often times negative, such as scolding the child for continuing the habit and while that may work on occasion, I personally believe children are more motivated with a reward in the forefront of their mind. This book should be in most homes and classrooms for young kids, although it might be more beneficial to parents. I almost want my parents to pay me to stop biting my nails because it just might work!"}, {"userName": "Chase Vombaur", "userReviewDate": "Oct 21, 2014", "userURL": "http://www.goodreads.com/user/show/34343054-chase-vombaur", "userReview": "A great story for teaching children about breaking bad habits. I would recommend this book to younger elementary school kids. The books is great learning experience that can be shared with the whole class. The book revolves around a young girl who has a problem biting her nails. Rather then the parents using negative reinforcement they deicide to give her a small amount of money each day she goes without biting her nails. I believe this book is good for parents and children to read. I believe that there is something we can all take from this book. Personally this is my favorite type of children's literature, I love the simple books that teach a moral lesson."}, {"userName": "Asho", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/192123-asho", "userReview": "My husband read this one to our three-year-old a couple of times to try to encourage him to stop his own bad habit (walking on his toes). The solution to the bad habit isn't developmentally appropriate for a three-year-old, but this book got him talking about the word \"habit\" and what it means. He was interested in the whole idea and asked for this book a few times. His one-year-old sister was unimpressed and mostly just menaced around the room while I read this one. I remember really liking the Berenstain Bears as a kid. As an adult, they aren't all that great to read aloud. I may put these aside for a bit and reintroduce them when my kids start reading independently."}, {"userName": "Stef", "userReviewDate": "Nov 22, 2016", "userURL": "http://www.goodreads.com/user/show/33915395-stef", "userReview": "Ugh -- children. They ruined this library copy by pasting stickers over nearly every image that matched the one on the sticker. But that's not the book's fault. I remember this one from when I was a kid -- I can still hear my mom's voice reading some of the lines! As a lifelong nail biter, you'd think I would've taken this book's message more to heart or tried the penny method the Bears employ. Maybe it's not too late for me!"}, {"userName": "Shelli", "userReviewDate": "May 23, 2008", "userURL": "http://www.goodreads.com/user/show/864675-shelli", "userReview": "I like the way Mamma and Papa Bear handled Sister's new nail biting habit in this book. I have been a life time nail biter at this point and can't seem to kick it. Wish my parents had done something like this when I was younger. Maybe it would have helped? I have to do the band-aid thing like Sister first tried, and I like it about as much as Sister did. This book can also give you ideas on how help your children to kick other ticks or bad habits."}, {"userName": "Keith Irwin", "userReviewDate": "Dec 19, 2015", "userURL": "http://www.goodreads.com/user/show/47902839-keith-irwin", "userReview": "As a book about bad habits, this is fairly good. It's a reasonable story which lays out the problem and creative solutions. These solutions often involve trusting the child, which is nice. It was a little odd, though, that they took it as granted that obviously Sister would want to have long pretty fingernails. It seems to me like it reinforces gender stereotypes. On the whole, fairly engaging, and pleasant to read."}, {"userName": "Christian Singer", "userReviewDate": "Dec 16, 2013", "userURL": "http://www.goodreads.com/user/show/17585685-christian-singer", "userReview": "What to do when your child has a bad habit? With a little time and patience and an incentive to quit, the habit might break. When Sister Bear is stressed out by the workload in first grade, she develops the bad habit of biting her nails. Trying to break the habit adds to her stress. Soon, her parents are out of ideas about how to help Sister Bear. That's when her Gran suggests a new idea that has some promise.Parents, if your child has a bad habit, this book might help."}, {"userName": "Zack", "userReviewDate": "Oct 13, 2009", "userURL": "http://www.goodreads.com/user/show/123417-zack", "userReview": "Reading any of these books is like babysitting a half-wit. I would ignore these books if they were only sanctimonious drivel, but they reach beyond that, and they are dangerous to the minds of children. They would teach morals by indoctrination, not discovery. Obedience and paternalism are not values to instill in the minds of children. Oh, and in one of the books, the mother is actually barefoot and pregnant."}, {"userName": "chucklesthescot", "userReviewDate": "Jul 08, 2016", "userURL": "http://www.goodreads.com/user/show/3426724-chucklesthescot", "userReview": "I wanted to read this one as soon as I saw the expressions on the faces of the bears on the cover! I don't really agree with bribing a child with money to stop them biting their nails, especially when it meant Sister was getting money not to do something while poor Brother got nothing at all and he wasn't biting his nails. It doesn't seem very fair to me. It also sets up the expectation of a reward not to do other things the parents don't like. As for Lizzy, some friend she turned out to be!"}, {"userName": "Miss Meghan's Class", "userReviewDate": "Oct 22, 2012", "userURL": "http://www.goodreads.com/user/show/13789208-miss-meghan-s-class", "userReview": "I'm a big fan of The Berenstein Bears because their books are fun to read and you always learn something, in a fun way, that children should be learning. This one is about Sister Bear and her bad habit of biting nails. Not only is it a good story, but it also has a great idea on how to stop nail biting if that's a problem you're having a problem with."}, {"userName": "Shacoria", "userReviewDate": "Jun 25, 2011", "userURL": "http://www.goodreads.com/user/show/4680811-shacoria", "userReview": "This is the 14th Berenstain Bears book that I have read. In this book sister bear has the bad habit of biting her nails. She eventually breaks the habit. I did find it surprising that Lizzy Bruin made fun of sister bear since I thought they were best friends. Brother bear provided a little comedic relief at the end of this story."}, {"userName": "Cori Brown", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/28825852-cori-brown", "userReview": "I love all the Berenstain bear books and the adorable pictures they have. This one is a great book that talks about a bad habit which is nervous nail biting. This is a great book that relates to everyone because maybe people have bad habits, it shows children how to overcome them and it is okay to have a habit."}, {"userName": "TheMcafeeKids", "userReviewDate": "Feb 02, 2013", "userURL": "http://www.goodreads.com/user/show/17074130-themcafeekids", "userReview": "Sister had a bad habit. It was biting her nails. The parents gave her pennies at the beginning of school. She would lose a penny every time she bit her nails. She got to keep her pennies and her nails grew."}, {"userName": "Stacey", "userReviewDate": "Mar 31, 2013", "userURL": "http://www.goodreads.com/user/show/16504786-stacey", "userReview": "This book can be used at any age. It's about sister bear and her nails biting habit. When she gets nervous she bites her nails. Her parents are trying to help her break this habit. Thus is a story to read to students that deal with nervousness."}], "description": "With help from Mama and Papa (who get a little advice from Grizzly Gran), Sister Bear learns to stop her nervous nail biting before it turns into a bad habit.", "title": "The Berenstain Bears and the Bad Habit\n      \n          (The Berenstain Bears)", "url": "http://www.goodreads.com/book/show/728477.The_Berenstain_Bears_and_the_Bad_Habit", "average": 4.1, "cover": "https://images.gr-assets.com/books/1344369078l/728477.jpg", "reviews": 62, "authors": [{"url": "https://www.goodreads.com/author/show/26886.Stan_Berenstain", "name": "Stan Berenstain"}, {"url": "https://www.goodreads.com/author/show/18172.Jan_Berenstain", "name": "Jan Berenstain"}], "type": ["Childrens", "Childrens", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/728477.The_Berenstain_Bears_and_the_Bad_Habit", "http://www.goodreads.com/book/show/18308725", "http://www.goodreads.com/book/show/3024022-the-berenstain-bears-and-the-bad-habit", "http://www.goodreads.com/book/show/900065.The_Berenstain_Bears_and_the_Messy_Room", "http://www.goodreads.com/book/show/1129315.The_Berenstain_Bears_Trouble_at_School", "http://www.goodreads.com/book/show/900070.The_Berenstain_Bears_Go_to_School", "http://www.goodreads.com/book/show/773480.Inside_Outside_Upside_Down", "http://www.goodreads.com/book/show/201138.The_Berenstain_Bears_and_Too_Much_TV"]}