{"ratings": 11929, "userreviews": [{"userName": "Mike Kennedy", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/7352820-mike-kennedy", "userReview": "I was reluctant to pick up this book. James Patterson, in my eyes, has sold out to commercialism as of late. He seems all about publishing as many books as possible to collect royalties. I read two of his series, Michael Bennett and The Private franchises. I do enjoy his book shots, as the short length seems to fit the Storylines better. He doesn't have to combine stories to make it full length. His full length novels that I have read over the past couple of years have been subpar at best. I only continue because I have some strange sense that I must read all of a particular series. I was intrigued by this book because it was based in Chicago, but didn't give it much of second thought. Then I was browsing the new reads at my local library, and I saw it. I picked back up and the little blurb Patterson wrote on the back line caught my eye....\"Best book I have written in a while.\" I decided to give it a shot, and boy am I glad I did. The story is split between the past and the present. Billy Harvey is a Chicago cop who busts a high end prostitution ring with his partner. Shortly there after he is the only survivor in a shootout that claims this partner and assistant district attorney, both of whom he was sleeping with. One problem, he has lost his memory of the events leading up to the shootout. Patterson and his co-author, David Ellis, do a masterful weaving between past and present to tell the story. The storyline is solid, and full of interesting characters. I couldn't make up my mind who was behind it as there were so many options. In the end I was completely off the mark. The ending was excellent and the whole thing was a page turner. Overall an easy five star that any mystery reader will love. I highly recommend picking up this book."}, {"userName": "Susan", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/672625-susan", "userReview": "The Black BookJames PattersonOMG!! You have seen the TV commercial where James Patterson says THE BLACK BOOK is his best book in twenty years right? Well ladies and gentlemen, he isn't lying! Holy cow people!! THE BLACK BOOK blew my mind, totally screwed with my head, and then blew my mind once again! It was that good! All while I was reading, I totally had it figured out only to be wrong over and over again! I love when an author keeps me guessing. THE BLACK BOOK goes back and forth between the past and the present. It's the story of Billy Harvey who is a detective in Chicago. His twin sister, Patti, is also a detective and his dad is the chief of detectives. Billy is a good detective, just as his sister and Dad are but Billy's world is about to change in ways he never imagined. It all happens the night he busts the mayor and a half a dozen other big names in a prostitution sting in a brothel downtown. The woman who runs the brothel, kept a black book with all the details in it. THE BLACK BOOK is now missingNot long after this all goes down, his long time partner Kate, his new girlfriend Amy, and Billy himself are all found shot in a bloody condo that is Amy's. Kate and Amy are dead and soon everyone thinks Billy did it. He got shot in the head and has no memory of what happened. He truly believes someone is setting him up but he isn't sure. He can't remember and he isn't sure of who he can trust. Does a story get any better than this?The twists and turns in the BLACK BOOK are going to keep you up late into the night trying to figure it out. One minute you believe Billy killed his partner and girlfriend and the next you are sitting there shaking your head, wondering what the heck just happened. I had my suspicions, I had it all figured out, or so I thought, and BAM.......wrong again! Once you start reading, trust me, you aren't going to be able to stop! When the black book finally shows up, I was shocked at who had it!"}, {"userName": "Brenda", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/2337007-brenda", "userReview": "Billy Harney, his twin sister Patty and their father were all cops. Dad was Chicago’s Chief of Detectives and had worked his way up over the years – his son and daughter were working their way there. Top, incorruptible cops the three of them – well known, liked and respected in their profession. But when Billy led a huge bust that had top people across Chicago involved – and the little black book was nowhere to be found – Billy’s career was teetering on the edge of ruin.Patty felt agony deep inside the day she rushed to a crime scene and battled her way through the silent detectives and uniforms on site. The vision of her brother bathed in blood alongside two others would stay with her forever – but somehow Billy had a faint pulse. The weeks and months in hospital and rehab didn’t improve Billy’s memory – the two weeks before the shooting had vanished from his mind as though they’d never been. The worst was – Billy was charged with the murder of four people. He needed his memory to return to clear his name – or did he? Who could Billy trust as he gradually, painfully tried to find the truth?The Black Book by James Patterson is a fast-paced thriller which I thoroughly enjoyed. Set in The Past and The Present – prior to the shooting and after the shooting – the gradual release of the lead up to the dramatic events which changed Billy’s life were extremely well done, with a brilliant twist to conclude! Highly recommended."}, {"userName": "Amber Garabrandt", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/5908784-amber-garabrandt", "userReview": "Summary:                 How can you prove your innocence if you can't remember the crime?  Billy Harney is a good cop- as is his father and sister.  It's in the blood.  Shortly after the case of a life time that sees several prominent members of society shamed (or worse if they couldn't strike a deal), Billy is left for dead along side his girlfriend and the prosecuting attorney for the last case, Amy, and his long term partner Kate.  The problem?  Everyone thinks he killed Amy and had some fort of shoot out with Kate; and he doesn't know if they are right.  A two week stretch that includes that fateful night are a complete blank.    How can he pull himself out of this, and who can he trust to help him?        My thoughts:                  While parts of the story seemed a bit rushed, (dare I say sloppy?)  I still loved this book.  The premise was interesting and I loved the characters.  There were some issues with the flow of the book, moving from one time to another, one POV to another... well, it wasn't always as seamless as it could have been.                     I think I am being harder on this book than others, maybe, because of the hype that Patterson/ promoters tried to place on this book- calling it his best work in twenty years.  It was good.... but I expect better from my beloved favorite author and thus am always hardest on his work.  Now there were interesting twists, and it kept me guessing, my interest piqued.  Even the characters I hated... I kind of loved them too.  There was a lot of intrigue here, and some great character dynamics.  I loved the book and it is still a five star for me.                    On the adult content scale, I give it a solid seven.  There is sexual content (some of which is rather explicit), violence, and language.  This is not meant for a younger audience."}, {"userName": "Matthew Hernandez", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/77194136-matthew-hernandez", "userReview": "I loved The Black Book! A complete page turner from start to finish. The back and forth from past to present is expertly done to tell an entertaining, gripping, and thrilling story. I agree with James Patterson that this is his best work to date so far. I will continue to support one of my favorite authors and read all his novels (my favorite being the Alex Cross series)."}, {"userName": "Monnie", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/6277675-monnie", "userReview": "Call me flamboozled. Call me chastised for all the potshots I've taken at Patterson's works of late (on second thought, check that - I meant what I said). Above all, call me happy that I ignored my previous rants and read this book.The title, as one might expect, refers to a missing \"little black book\" that didn't turn up after a raid and thorough search at a house of ill repute at which some of Chicago's finest are customers. Needless to say, the house madam ain't talking - and without it, finding even more high-level patrons (including cops on the take) and others who weren't present during the raid, may never be found.At the epicenter is police detective Billy Harney and his partner, detective Kate Fenton. Billy's sister Patti is a cop as well, their dad, Daniel, was chief of detectives, and dad's friend (and Billy's beloved mentor) heads up Internal Affairs, so clearly copness is a family affair. As the raid is analyzed, Billy insists he had every right to initiate it; but Amy Lentini, the beautiful assistant state's attorney, seems out to prove that it wasn't justifiable (and therefore was illegal), thus putting the kabosh on potential prosecution of everyone captured.In reality, that event took place in Billy's fairly recent past; his present has taken a very different turn that has left him unable and/or unwilling to remember details (including, perhaps, the whereabouts of that little black book). Chapters shift back and forth, with \"past\" chapters peeling away more clues to what really happened. Usually, I'm not fond of this technique - nor did I love it here. But it's actually done very well and helped keep me on the edge of my seat even though I guessed pretty much from the start who was behind everything. In fact, besides an intriguing, fast-moving story, my desire to find out if my guess was right (it was) and learn the how and why was a big part of what kept me going.All in all, it's a totally engrossing book. The Patterson-Ellis collaboration hasn't always produced such stellar efforts - I'm referring specifically to The Murder House and Mistress, to which I gave 4 and 3 stars, respectively - but this one hit the mark. More, please!"}, {"userName": "Suzanne", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/4852457-suzanne", "userReview": "The Black Book is by far is my favorite James Patterson book I have read recently! This story was constantly moving and had some awesome twists and turns. It is a rather quick read but you kind of expect and look forward to getting a quick but entertaining story from a James Patterson book. I actually like that he works with other authors. My quick and simple overall: LOVED IT! It was so interesting and fast-paced."}, {"userName": "Scott", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/24668886-scott", "userReview": "On the back of James Patterson’s new book, The Black Book. is an interesting blurb that reads: “I have some favorites among the novels I’ve written over the years… With each, I had a good feeling when the writing was finished. I believe this book – The Black Book – is the best work I’ve done in twenty years. Hope you enjoy it” – James Patterson. I must say that I read a lot of Patterson’s books and I found this self-promoting promise a bit annoying. For over the past ten years, he’s published a book every other month in one of his several continuing bestselling detective series or stand-alone mysteries. That’s a lot of books! And he’s now saying this new book is one the best he’s ever written. That almost borders on arrogance. Should we just ignore everything else he’s published as unworthy of reading? It seems a bit insulting to the readers…I’ve generally enjoyed reading Patterson’s books, which I get from the library because I don’t find him good enough to buy and keep in my library. He’s mind candy – simple, fast-paced, detective and mystery oriented adventures that can be read in about two to three days and easily left behind. Nice escapism, but nothing super memorable.Anyway, I put the self-promotional blurb to the test as I read the book. I really hate to say this, but guess what? He’s right. This was one of the best books of his (and his list of many co-authors) that I have read in a long time. I enjoyed Cross Justice a lot two years ago, the first Private novel a lot, but this one brought me back to the intense moments of Along Came a Spider and Kiss the Girls. It is a detective story of Billy Harney, who survives a shooting with his girlfriend and partner while investigating corrupt government officials and police officers in Chicago. As expected in a Patterson story, the plot unfolds at a frenetic pace, being told in both current and flashback stages. I must say the characters were interesting and had more depth and personality than usual. The big kicker is that the mystery is well thought out, has multiple layers, and even more important (for those of us who confidently feel that we can figure out the guilty party before he/she is revealed), the outcome is surprising and extremely well-delivered! What a payoff ending!Overall, this book was an absolute joy to read. Patterson is right – it is one of his best books. I just hope that I don’t have to wait another ten years (and twenty books) for him to deliver on his promise of quality again. Enjoy!"}, {"userName": "Dominique", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/3287955-dominique", "userReview": "This book was awesome! The best he's written in a long time. The ending had me totally shocked!!!"}, {"userName": "Sherri Thacker", "userReviewDate": "Dec 24, 2017", "userURL": "http://www.goodreads.com/user/show/36561653-sherri-thacker", "userReview": "James Patterson does it again!! Had me guessing until the very end. Was great!"}, {"userName": "Chloe", "userReviewDate": "Jun 03, 2017", "userURL": "http://www.goodreads.com/user/show/7825836-chloe", "userReview": "Detective Billy Harney uncovers a prostitution ring by accident while following a murder suspect. A lot of powerful ,prominent people are caught in the brothel but the black ledger goes missing and people are looking for it. Meanwhile Billy is caught in a scandal of his own which leave the assistant district attorney and his partner dead.By far one of my favorite James Patterson book after a long time.A fast enjoyable read with lots of twists and turns and a surprise ending that I didn't see coming."}, {"userName": "jv poore", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/5157918-jv-poore", "userReview": "Particularly fine Patterson book, definitely kept me guessing!"}, {"userName": "Nicole", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/16062603-nicole", "userReview": "Hands down ..... this is the best James Patterson book I've read in a long time! Superb!"}, {"userName": "Laura Rash", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/34779639-laura-rash", "userReview": "This certainly reminded me of early JP with its non stop twists & turns. The time alternations kept it unique. A real page turner that I devoured in one day!"}, {"userName": "Wendy", "userReviewDate": "Apr 27, 2017", "userURL": "http://www.goodreads.com/user/show/19889444-wendy", "userReview": "The Black BookI have loved every book that David Ellis has co written with James Patterson and I must say that I believe it is all due to David Ellis's writing. This one was by far the best one of them all. I honestly had no idea who was the crooked cop and it was great to finally read a book and not have already guessed the ending."}, {"userName": "Mahoghani 23", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/22091363-mahoghani-23", "userReview": "I've truly enjoyed this book. It's exciting, full of action, murder, deceit, dirty cops and ambition. This story had me leaning towards the sister committing the crime but it was someone else and they showed no remorse once figured out. Families is the bond that should never be broken but as we see in this society, family can destroy you or make you stronger. Billy Harney found out the hard way about family, friends and life. He finds himself on trial for quadruple murder. The only thing is he was shot in the head and left for dead but survived and can't remember what happen that fateful evening until another traumatic event occurs now the truth hits him like a stick of dynamite and the truth will diminish some and destroy othets."}, {"userName": "Bob", "userReviewDate": "Apr 21, 2017", "userURL": "http://www.goodreads.com/user/show/2820496-bob", "userReview": "1 1/2 Stars -- Has Some Good Elements But, Overall, Meh (At Best)!The Publishers Weekly review of this book was very positive and concludes with the sentence, \"Many readers will agree with Patterson that this is the 'best book (he's) written in 25 years.\" It was this publication's starred review and many of the 5-star reader reviews on Amazon that caused me to read The Black Book -- and thus go back on my promise to myself over the past 12-13 years, which was to not read any more books by Patterson, who years earlier had been one of my favorite authors.Much to my disappointment, my opinion of The Black Book was quite different from what I was hoping it would be. This is because while The Black Book delivered some positive elements I look for in a mystery/thriller, it fell far short in delivering several other key elements I require in a book I'd recommend to others.On the plus side, The Back Book is a very fast-paced, attention-holding, plot-driven thriller that has an above average amount of twists and turns. However, for me, these pluses were far outweighed by the following key negatives: ...Characters that were very so weakly developed that I could never get a good picture in my mind of what any of them physically looked like, nor could I get anything more than a tissue-paper thin understanding of their motivations for their actions. As such, I never came to care one way or the other about any of the characters....Dialog and prose that very often were cliché-ridden and didn't \"ring true.\"...Several of the plot twists and turns intended to provide reader suspense too often seemed contrived and strained credulity, and...Perhaps most disappointing to me is that I was able to figure out the so-called surprise ending of \"who really did it and why\" halfway through the book.Quite obviously, my opinion of The Black Book is much less favorable than the large majority of reader reviews and, thus, runs the risk of generating a lot of \"No/not helpful\" votes. Nonetheless, if my review provides some \"food for thought\" in helping decide if The Black Book is a book for you, I'll feel it's done its job.1 ½ stars rounded up to 2 stars."}, {"userName": "Tim", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/17042835-tim", "userReview": "Finally, I give up trying to find a good story by the Patterson brand. I will take my friend Terence's advice and dispense with Patterson in the foreseeable future. The stories all tend to be variations of the same dull, uninteresting, boring, anticlimactic and...awful.0 of 10 stars"}, {"userName": "Sheila", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/3349264-sheila", "userReview": "Bad cops, bad memory and bad decisions."}, {"userName": "Matt", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "James Patterson has again teamed up with David Ellis, offering a wonderful standalone thriller that keeps readers on the edge of their seats and up late into the night. In a narrative set in the 'past', Billy Harney and Kate Fenton are hardworking members of Homicide in Chicago. While tailing a suspect, Harney makes the decision to raid a brownstone, which opens up a new and troublesome revelation; this is a brothel visited by the city's rich and powerful men. During the raid, a 'little black book' goes missing, with names that could bring even more of the rich and famous to their knees or serve as strong blackmail fodder. All eyes turn to Harney, who must try to clear his name, when it is presumed he pocketed it. As Fenton begins a power struggle with her partner, Harney must find out who is trying to frame him, adamant that he knows nothing of the book. With the case against the defendants caught in the raid fast approaching, Harney works with a hot-shot prosecutor, Amy Lentini, to ensure his testimony is flawless. Her icy exterior soon melts and she turns up the heat with Harney, which only clouds both their judgements. In a parallel narrative, set in the 'present', Harney is found naked, in bed with Lentini, while Detective Fenton lays on the floor. All three have been shot and the two women are dead, with Harney clinging to life and a bullet lodged in his skull. As the story continues, it appears Harney is being blamed for the murder, unable to remember anything from the past as it relates to the lead-up to the shooting or anything he may have learned about the black book. As the reader braces for an ever-evolving rollercoaster ride, the story takes twists and turns with everything centred around a list of names and the people will do anything to hold all the power. A powerful thriller that shows Patterson has the ability to rise to the occasion, with the right author at the helm. Highly recommended to any who enjoy losing themselves in quality writing.I have often said that James Patterson's writing has waned in the past few years, his lustre buried under many mediocre novels. However, when David Ellis comes to partner, their cooperation produces stellar writing and offers the reader a literary treat. While it may be a standalone, the novel offers an array of superior characters, wonderfully crafted to push the narrative forward without getting caught up in the minutiae. Working with the parallel narratives, Patterson and Ellis keep the reader guessing, while forcing a constant mental gear switch as the story develops, layering a revealed past with a present that is just as murky. If the reader can handle this mix, they are in for a punch to the gut during the numerous plot twists, which only adds the the overall flavour of the piece. Dark, but peppered with some dry humour to keep the reader smiling, Patterson and Ellis know the perfect recipe for a fast-paced thriller.Kudos, Messrs. Patterson and Ellis for joining forces again and showing that there is never an end to your abilities. I know I am in for a treat when your names grace the cover and hope to see more of your collaborative efforts soon.Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/"}, {"userName": "Michael Travis", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/61372310-michael-travis", "userReview": "Follows the recipe - Patterson keeps cranking them out. Easy read, but not memorable."}, {"userName": "Michelle Williams", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/15847344-michelle-williams", "userReview": "Really enjoyed it. First Patterson book I've read in awhile. Love when he teams up with David Ellis."}, {"userName": "Sandy Kell", "userReviewDate": "Apr 20, 2017", "userURL": "http://www.goodreads.com/user/show/5428328-sandy-kell", "userReview": "I'm not very familiar with Patterson's books, but I do know that if David Ellis is involved, it's going to be good!"}, {"userName": "Melissa", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/52098850-melissa", "userReview": "One of the best ones he has a written in a long time. I liked that this one kept me guessing and didn't give up too many clues right in the beginning."}, {"userName": "Freda Malone", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/6938113-freda-malone", "userReview": "The Harney twins, Willy and Patti, both 'family generation' cops, are thrown into a conspiracy involving a brothel, highly political officials, and a zealous reporter who just doesn't know when to quit. Bodies are dropping, secrets are slowly being revealed, and everyone is confused. Until it takes a bullet to the head, for Willy to give us this explosive solve that had me on the edge of my seat the entire time. I couldn't put this book down. I had my hunches, I had my theories, I had my suspicions, but very little prepared me for the ending. Twisted, epic and maddening! I loved the ending! I enjoy James Patterson's novels, when he takes the time to write a good one. Some I enjoyed, some I didn't but it wouldn't be intriguing if I didn't at least pick it up. This is a good one. +++"}, {"userName": "Paula James", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/24963242-paula-james", "userReview": "I usually don't read James Patterson but I love the author David Ellis who wrote with him on this book. It is a great book full of suspense and I hope it might be a series!"}, {"userName": "Darlene", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/33604667-darlene", "userReview": "The Black Book written by James Patterson and David Ellis is an excellent book. Who did the most writing in this? My guess is Mr Ellis, but we'll never know. Through the combined writing of the two authors the book is amazing. Who is the corrupt cop? As you read the book your mind goes from one suspect to the next, but the answer doesn't come out until the end. Wow, what a surprise the ending is, never could I have guessed who the bad cop was. I strongly recommend this book for a fast paced, who done it mystery."}, {"userName": "Tony Warren", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/51821636-tony-warren", "userReview": "Really enjoyed this, could hardly put it down, wanted to get to the end to see who dunnit. Lots of twists and red herrings. Excellent book."}, {"userName": "Jeffrey Ward", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/9337957-jeffrey-ward", "userReview": "It starts out very good, but it quickly derails. I do not care for this book, and I do not think it is just because I dislike Chicago. At times, it seems as though the authors are just trying to play to male fantasies. This is not the first book in which Patterson does this, and it did not bother me as much as the book's absurdity.I write \"absurdity\" because there are several instances in which Patterson and Ellis are unsuccessful at getting me to suspend disbelief. Here are eight of them:1) If characters aligned with the brothel are trying to discredit the arresting officers, they could have used Billy and Kate's sexual relationship, which they were barely trying to hide even though they could have gotten in trouble for it. 2) The Quarterback of the Packers does not need to go to brothels. I have seen the women he dates.3) The Chicago Bears winning NFC? Maybe this book should be in the humor section. 4) Billy's miraculous recovery from being shot in the head is just ridiculous. 5) What is so comical about a camel coat? 6) The piece of evidence that becomes available at the end of the book does not make sense and is pretty much a reach. 7) and 8) The identity of one of the villains seems as though it is sort of just thrown in for shock value, and some of the reactions from some of the characters are also unbelievable. I know the last three are vague, but I don't want to spoil anything."}, {"userName": "Loy", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/4848460-loy", "userReview": "I enjoyed this book I picked it up because I really like David Ellis It was worth a read Twists and turns"}], "description": "How can you prove your innocence when you can't remember the crime?Being a cop runs in Billy Harney's family. The son of Chicago's Chief of Detectives whose twin sister, Patty, also followed in their father's footsteps, there's nothing Billy won't give up for the job, including his life.After a brutal shooting, Billy is left for dead alongside his tempestuous former partner and an ambitious assistant district attorney out for blood, But somehow Billy survives. He remembers nothing about the events leading up to the shootout and is charged with double murder.Desperate to clear his name, Billy retraces his steps to get to the bottom of what happened. When he discovers the existence of a little black book that everyone who's anyone in Chicago will stop at nothing to get their hands on, Billy suspects it contains the truth that will either set him free... or confirm his worst fears.", "title": "The Black Book", "url": "http://www.goodreads.com/book/show/30736665-the-black-book", "average": 4.21, "cover": "https://images.gr-assets.com/books/1482954954l/30736665.jpg", "reviews": 1391, "authors": [{"url": "https://www.goodreads.com/author/show/3780.James_Patterson", "name": "James Patterson"}, {"url": "https://www.goodreads.com/author/show/4490971.David_Ellis", "name": "David Ellis"}], "type": ["Mystery", "Fiction", "Thriller", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/30736665-the-black-book", "http://www.goodreads.com/book/show/30736667-the-black-book", "http://www.goodreads.com/book/show/34220449-the-black-book", "http://www.goodreads.com/book/show/30841956-the-black-book", "http://www.goodreads.com/book/show/30848685-the-black-book", "http://www.goodreads.com/book/show/13145.Along_Came_a_Spider", "http://www.goodreads.com/book/show/13148.Kiss_the_Girls", "http://www.goodreads.com/book/show/13137.1st_to_Die", "http://www.goodreads.com/book/show/13152.The_Angel_Experiment", "http://www.goodreads.com/book/show/7494.Suzanne_s_Diary_for_Nicholas", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}