{"ratings": 280, "userreviews": [{"userName": "Chariss Walker", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/1862903-chariss-walker", "userReview": "Fast-paced, enjoyable thriller with a tiny dash of romantic interest. Just the kind I like. There were times I couldn't imagine King getting out of his own way, but the author managed to pull it off quite brilliantly."}, {"userName": "Nancy Silk", "userReviewDate": "Jan 26, 2014", "userURL": "http://www.goodreads.com/user/show/7140636-nancy-silk", "userReview": "\"An Astounding, Revealing Crime Story\"This is an awesome story written by Stephen Douglass who has worked in the petroleum industry in Canada for decades. His story deals with money laundering, fraud, manipulation, with a very driving force of true love. There's something here for everyone. The main character is Mike King, who leaves the school of medicine to explore the world for a year, then returns to major in chemical engineering as inspired by an oil magnet friend of his father. The second character is Karen Taylor, daughter of wealthy parents, who loves Mike King. But while he is on his one year sabbatical, Karen and her friend Patti Archer are on a hijacked Boeing 707 which winds up in a devastating explosion near Damascus. Mike is devastated to think Karen has been killed, goes back to school, and soon marries Barbara Larkin. The third character is Jim Servito who has a brilliant mind, is cynical, and one of the most ruthless characters that Mike and Karen will have to face. He's blackmailed his way to riches and through money laundering, and without remorse, he will strike down anyone who stands in his way.This book reveals the roots of the gasoline wars and shortages of the early 70's. It deals with Mike's failed marriage and also his success of rising from being an employee to having his own oil company. It gives one a first hand, factual look at how big businessmen wheel and deal to increase their profits ... or to prevent losing them.This story would make a powerful movie, if Hollywood had the courage to get it to the silver screen. There's only one actor I envision playing the ruthless Jim Servito ... Al Pacino! This is a stellar story one which you won't be able to put down, and one you will never forget."}, {"userName": "Edward Wolfe", "userReviewDate": "May 13, 2014", "userURL": "http://www.goodreads.com/user/show/18779163-edward-wolfe", "userReview": "Great book that kept me up all night, constantly having to find out what was going to happen - the way Patterson's books used to do. (You know, back when Patterson wrote them himself.)I don't feel that the characters were really fleshed out, and some things were glossed over, and sometimes I was surprised when it would jump forward several years, and despite all of that, it still kicked ass and I can't believe the author made the entire trilogy free. With the first book being that compelling, I'd think that a wiser marketing move would be to make the first one free. If the following books were reasonably priced, I would definitely be buying them to continue the saga. But I have them at no cost. Thanks, Mr. Douglas!The writing was really good and mostly well edited and proofed, which made it a surprise when I'd come to a blatant error. After several errors, I started highlighting them in my Kindle with the thought of letting the author know about them, because he can't realize they're there, and it's a shame they are in such a compelling story.But since the story was so good, they were forgivable. This time! Just kidding.Great book. If you like tales that span many years and feature romance, crime, danger and suspense, you'll like this. (It's also an eye-opener to the oil industry - at least as it was in the 60's and 70s, and that gave the book a flavor somewhat similar to Atlas Shrugged, but without any deep thoughts.)"}, {"userName": "Bob Rector", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/13861559-bob-rector", "userReview": "After reading Steve Douglas’s new thriller The Bridge To Caracas, I promise you’ll never again feel the same about pulling up to a gas pump. And once you start filling your tank, you’ll wonder what you’re filling your tank with. And the thought of that will probably cause your spine to tingle. Thanks Steve.The driving force of this fast-paced story, set in the 60s and 70s, is the cutthroat world of gasoline distribution among indie Canadian and U.S. suppliers primarily for the purpose of undercutting the majors and evading taxes. Hundreds of millions of dollars are at stake and greed and malice rise to the surface like oil on water.Steve Douglas knows of which he writes. His career in the oil industry spanned 30 years working for two of the largest companies in the business before starting his own business. The complicated schemes of the players involved all have the ring of truth.Caught up in this diabolical world are star-crossed lovers Mike King and Karen Taylor. They are headed for the altar but are separated by events neither could have imagined. When the two find each other again, both are married, but are still desperately in love with each other and know they always will. Unfortunately, the man Karen married, Jim Servito, is evil personified.Servito is also the kingpin of the gas underworld and has no qualms about eliminating the competition anyway necessary. He is a character so vile that after reading a passage he’s in, you want to go wash your hands.Mike King is also a small time gas supplier but an honest one. And he’s determined to get Karen back, especially after Servito brutalizes her. What ensues is a battle royale from Canada to South America, with the Feds joining in the fight. Who will come out on top is anybody’s guess. One thing is certain, there will be blood.If you enjoy action packed thrills and adventure with a heavy dose of romance thrown in, this is the book for you. Highly recommended."}, {"userName": "Christoph Fischer", "userReviewDate": "Jul 07, 2013", "userURL": "http://www.goodreads.com/user/show/13998364-christoph-fischer", "userReview": "\"The Bridge To Caracas\" is a clever, fast past and engaging thriller set against the backdrop of the oil and gas industry. It begins with the hijack of a plane in the 1960s and the presumed death of Karen, our protagonist Mike's big love.He moves on to a sales job in the oil industry and marries Barbara instead, a woman he doesn't quite love as much and who may not love him either.The evil opponent to Mike in this saga is Jim Servito who embezzles a lot of money from the industry.This is a great book about love and corruption, it is action packed and rich in plot. It covers several decades and kept my interest throughout. It was not quite as explosive as the write up promised but I would call it a solid and very entertaining read."}, {"userName": "Geraldine Evans", "userReviewDate": "Apr 26, 2014", "userURL": "http://www.goodreads.com/user/show/3305984-geraldine-evans", "userReview": "Great Read!I thoroughly enjoyed this book. It confirmed all I've ever thought about big business and the way they operate. This novel concerns skulduggery in the oil business, crossed lovers and a few shoot-outs. Plenty of action, involving love, money and power and the unimportance of the little people who risk getting crushed beneath the vast behemoth of the oil interests.You'll learn things you might prefer not to know about the end product: and when you consider the same obsession with profit and lack of concern for the consumer probably exists in every other business, it makes one seriously concerned about the end products we all use, consume or work with whether it be food, water, medicine, household products, whatever (Bhopal and Thalidamide, anyone?).The storyline was well worked-out and well researched and had me wondering what I was actually putting in my tank the next time I filled my car with petrol. Pretty worrying.If you're looking for a well-written thriller about big business, particularly the oil business, how they operate and the lengths they'll go to to wipe out any opposition, then this book should fill the bill nicely.Highly recommended. Five stars."}, {"userName": "Michele", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/7136102-michele", "userReview": "This is one of the fastest moving suspense novels I have read in a while. Underneath it all GREED is a powerful motivator which can ultimately grab in it's clutches both criminal minds and seemingly good and honest people. The oil industry with it's billions to be had in profits is where the action takes place. Within this story there are a couple of star-crossed lovers. Although this could conceivably happen-and may have partially according to the authors bio-I truly think that regulating the oil business is a VERY good and worthwhile occupation for governments! Without giving out any more of the plot I will leave you with this thought. After I read the last page I high tailed it back to Amazon and purchased the next two books in this series which I will be reading and reviewing at a later time.The Bridge To Caracas"}, {"userName": "Jeff Dawson", "userReviewDate": "Jul 04, 2013", "userURL": "http://www.goodreads.com/user/show/5163904-jeff-dawson", "userReview": "Good story requiring a good editorNot a bad read, but then again, not a great read. Yep, middle of the road. Before I wrote the review, I went back to see if a new version is available. Not at this time.The premise of the story surrounds the love Karen Taylor and Mike King share. It is abruptly interrupted when Karen becomes a hostage and is reported among the dead. Mike is devastated and moves on with his life. During her captivity he graduates from University and becomes involved in the Oil Industry. The nemesis of the story Jim Servito, by chance, also enters the oil industry—the shady side. Again by chance Jim marries Karen. Game on!The pros:I knew very little of commodity trading and backdoor dealing when it comes to refined products. The author describes in great detail how Servito is able to build a corrupt empire by not paying taxes to either the Canadian or US governments. It is an astounding amount, to the tune of $300 million! Wow! I really appreciate the knowledge Mr. Douglas provides the readers. Well done.The cons:Editing: It needs it. I identified over eighty issues. Missing words, wrong tenses and unnecessary filler. In the beginning Mike and Karen are invited to a dinner where Jackie and John Kennedy will be. It’s one paragraph, maybe two. The point is, I really thought this would be explored a little more and then nothing, including his assassination. Yet, when Karen marries Jim, we are inundated with an entire chapter. The word ‘had’ needs to be fleshed out. At times it is required but many other times it’s a bit jarring.Adverbs: way too many to count. It became maddening at times, especially when describing a conversation. Ex: “cunningly implying he owned the station.” “his larcenous mind not sufficiently stimulated.” Too much description in conversations. Instead of showing, there is way too much telling. Nothing is left for the imagination. Ex: 1)“Karen slowly turned to face Servito, ‘You’re forgiven,’ she said with a large grin. 2) George Taylor stepped to the microphone at the top of the steps leading to the verandah. There are many others.Sentence structure, There are several times where I had to reread a sentence scratching my head. 1) His face turned red when he found one of Mike clearly shown. We need clearly shown why?2) Servito calmly removed Martin’s key form the pocket of jacket.???? Pocket of jacket???Character development was thin at best. I never felt connected with Mike or Karen. The dialog between them was too much over the top. Way too many exclamation points and silly outbursts. Name tags. Lord. Way, way too many! We are reminded each and every time when someone is speaking, even if it’s only two people. Their names are populated through each and every paragraph. This needs a heavy threshing. I believe if the book is put in the hands of a good editor/proofreader, many of the issues can be remedied, propelling it to a four star. Overall, not a bad read."}, {"userName": "Rick Bylina", "userReviewDate": "May 22, 2013", "userURL": "http://www.goodreads.com/user/show/921098-rick-bylina", "userReview": "The theme of good versus evil sits on top of the question, 'What would you do for love?' Stephen Douglass's book, The Bridge to Caracas, is a heavily plotted story within the murky world of the oil and gas industry that he seems familiar with. It takes place in the 1960s through the 1970s, and centers on how Jim Servito steals boatloads of money from the industry and screws everyone who gets in his way.The story has lots of potential, but neither Mike King, the protagonist, nor Karen Taylor, his love interest engaged me. No spoiler here--Karen is kidnapped by terrorist and presumed dead. Mike moves on and marries the wrong woman. Bad enough. It happens. Karen returns--no big shock--and moves on now that Mike is unavailable. What bothered me is that the convenient plot point of Karen's abduction, which sets up the star-crossed lover theme, seems to have had little emotional effect on Karen. I kept waiting for her horrendous life event to impact her current life and the story. It never materializes. And Mike, this really smart guy, blunders his way through traps set up by Servito to make Mike's life miserable without getting a clue. Mike seems at times to only be aided by chance (admittedly some of it in the beginning by shrewd moves), luck, coincidence, and finally, at the climax, assistance from a total stranger to solve his problem. Even when the women he loves is being brutalized by Servito in the middle of the story, he does nothing for months except to have rendezvous sex. What starts out sharp and thrilling, peters out for me. In the end, the events and actions felt more staged and Mike's actions reckless, reactionary, and without thought more so than realistic--often causing heartache and loss for others. This is not to write that this is a bad book. The writing is fine and premise strong. The middle had copyediting issues, but not too severe. It just lacked the character development and story ending dynamics that should have been there considering the promise of the beginning. I occasionally mention books that should be read fast to skip over the weak points. This would be one of them. I can see lovers of action and adventure stories falling for this story. Had the ending been sharper, this novel might have been a \"4.\" As is, it is slightly above average, a strong \"3\"."}, {"userName": "Kerry Reis", "userReviewDate": "Jun 17, 2016", "userURL": "http://www.goodreads.com/user/show/14800459-kerry-reis", "userReview": "In the early 60’s in Toronto, Mike and Karen have bonded into soul mates, but Mike feels that his destiny is not in medicine as his parents have hoped, so Mike drops out of school and leaves Karen and his home on a solitary trip to discover his true career passion. Karen and a friend heads to Europe and finds herself on a hijacked plane. The plane explodes on an airstrip, and word comes back that there are no survivors. Mike discovers his passion in oil and returns to school to get an engineering degree, but he is devastated to discover the news about Karen and winds up finding solace with another woman at school, which leads to marriage. However, the news about Karen was incorrect and after she is freed from her hostage situation a year later, she discovers the news about Mike’s marriage. Meanwhile, Jim has come to Canada to dodge the draft and found a low-paying job pumping gas at a small station, but is soon introduced to a gas tax evasion scheme tied to international transport of fuel between Canada and the US. So, as Mike finds success wheeling and dealing for a major oil company, Jim is finding success in controlling a major fraud and theft gas conspiracy. However, the crossing of Mike and Jim’s paths become more impending when Jim meets Karen and convinces her to be his wife, a decision she comes to regret. This story is built around a major fraud issue that appeared to be strong in the oil industry along the Canadian-US border in the 60’s and 70’s, and the author is very knowledgeable in creating the thrilling and suspenseful actions arising out of this type of criminal conspiracy. However, the combination of events that separate and bring together the main characters often feel artificially forced, creating some inconsistency in some of the characters in order to build up the danger and thrills in the plot."}, {"userName": "P.S. Winn", "userReviewDate": "Jun 05, 2016", "userURL": "http://www.goodreads.com/user/show/23133809-p-s-winn", "userReview": "Very interesting read. The two main characters are Mike King and Jim Servito who are both in the gas and oil industry, they have one other thing in common,Karen Taylor. Karen and Mike knew each other first and probably would have gotten married, but Mike decided to change his life and left in a search to see where life would take him. When he was gone, Karen was in a hijacked plane. When it exploded, all thought she was dead. Karen resurfaces, her life miraculously spared, but Mike is married. Through circumstance, Karen meets a marries Jim Servito. That folks, is just the beginning of this conspiracy thriller that looks into corruption by those in the oil and gas industry while it also is a romance and a great thriller. The author does a great job tying up loose ends and bringing the story to a heart stopping end."}, {"userName": "Douglas Wickard", "userReviewDate": "Sep 02, 2013", "userURL": "http://www.goodreads.com/user/show/1505189-douglas-wickard", "userReview": "I downloaded this book a while ago and just recently got the opportunity to read it. Stephen has a wonderful way in which he develops his characters. I cared. Which for me, as everybody knows is the most important element in creative writing. I felt in this book deeply but I also was NOT lost in the details of a lifelong work history. I LOVED this book. Sincerely yours!"}, {"userName": "Mike Hale", "userReviewDate": "May 20, 2015", "userURL": "http://www.goodreads.com/user/show/16642900-mike-hale", "userReview": "Fluff read with wooden characters and plenty of grammar and spelling mistakes."}, {"userName": "Kareem", "userReviewDate": "Sep 10, 2015", "userURL": "http://www.goodreads.com/user/show/44039738-kareem", "userReview": "I really want to read this. Where can I find it in Dubai?"}, {"userName": "Karena Marie", "userReviewDate": "Nov 21, 2015", "userURL": "http://www.goodreads.com/user/show/16272983-karena-marie", "userReview": "Exciting and fast paced thriller. Very well written. I was glued to the pages right up til the end. Now I shall start Book 2 in the series."}, {"userName": "Theresa", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/15393756-theresa", "userReview": "not bad"}, {"userName": "Ellen", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/75861488-ellen", "userReview": "This book is surprisingly engaging. It’s not the best written literature, and lacks some of the polish of John Grisham and Michael Connelly.Plot summary: Karen and Mike are college sweethearts. Mike drops out of college, and leaves Karen to go find himself. When he returns, he discovers she was hijacked by terrorists and presumed dead. He goes on with his life -finishes college, starts a job in the oil industry, marries. Karen returns - reports of her death were inaccurate- and discovers Mike married and so she marries in a whirlwind romance. Mike and Jim (Karen’s husband) are both ambitious and in the oil business. Mike is honest and hardworking, Jim is ruthless and lawless. When Karen and Mike meet again, they rekindle the romance, but Karen can’t leave her marriage because she is convinced that Jim will kill her or at least take away her son. Vengeful Jim successfully sets up a plot to frame Mike and Karen for his criminal activities.The book goes into a lot of details of business that I know little about - gas and oil distribution, the OPEC oil slowdown, and especially how taxes are collected on oil products in Canada and the US.The author says that although the story is fiction, the basis is real enough and could actually happen.The kindle version of this book was free on Amazon."}, {"userName": "Kam Levers", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/73109936-kam-levers", "userReview": "Oil, greed, love and liesI loved this book, easy to read, great plot. Mike King is a great character and you see him develop from oil tycoon to fugitive in this wonderful read. It's exciting to know there are two more books in this series, which I will be reading over the coming months. Highly recommend if you are a fan of Alex Cross and such books."}, {"userName": "Achour", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/45257907-achour", "userReview": "Wonderful bookVerified Purchase\"The Bridge to Caracas\" is a page-turning book. It is filled with suspense and intrigue from the beginning. I recommend this book for those who appreciate thrillers. It was my first book from Stephen Douglass and I am looking forward to reading all the books of the Trilogy."}, {"userName": "Sandra Velasquez", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/82679471-sandra-velasquez", "userReview": "Kept me going Very interesting, with lots of twist but got a little boring towards the end, overall an easy and enjoyable read."}, {"userName": "Daniel", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/55002160-daniel", "userReview": "infantilemain characters are so dumb they should be left to cross the road on their own; the major plot turns are laghable"}, {"userName": "Gloria Antypowich", "userReviewDate": "Nov 30, 2016", "userURL": "http://www.goodreads.com/user/show/6441146-gloria-antypowich", "userReview": "The Bridge to Caracas totally captured my imagination! There are many aspects of this book, but they all weave together seamlessly to create an exciting thriller; a story of crime, vengeance, and a love triangle.Jim Servito is an American draft dodger who snuck into Canada. He ends up in Toronto, pumping gas for Pop Williams, who has taken a liking to him and lets him sleep in a room at the back of the office. Pop’s is happy to teach Jim the honest rules of the gasoline business.  Jim is looking for an opportunity to move on and make big money. Then one evening he is approached by Jerry Allison, who tells how he can make big money by buying “bootlegged” gas to sell in the pumps. This fated meeting opens the door for Jim. Eventually, he buys Pop Williams gas station. Then he corners Jerry and forces him to tell him the who, where and how of the scheme Bob Bushings runs. He tells Jerry that they will be partners and he makes him take him to Bushings place of business. He knows too much, and Bushings realizes that Jim will ruin him if he doesn’t go along with what he proposes. Jim Servito is now on the road to riches, fueled by greed, corruption, and ruthless greed.Karen Taylor was a stewardess. She met Mike King when she leased an apartment on Toronto’s St. George Street, directly across from Mike’s fraternity house. At the time Mike was studying medicine—he was going to follow in his father's footsteps and become a Doctor. He and Karen have a torrid love affair. Then Mike decides that he doesn’t want to be a doctor. Instead, he is going to travel and figure out what he wants out of life. Karen wants to go with him, but he says this is something he has to do alone.Karen is broken hearted and decides to take a vacation. She and Patti Arthur go to Europe. As they are leaving Athens, their plane is hijacked by terrorists who demand that the pilot fly them to Syria. When the plane landed, Karen and Patti are among 5 hostages that are taken off. The terrorists as they are leaving the site, and it is presumed that all the passengers who had boarded it are dead. Four months after he left, Mike returns to Toronto. He has found a purpose, and he is longing to see Karen. He is stunned when her mother tells him that she is dead. Eventually, Mike moves on. He is introduced to Barbara Larkin by a friend, and they eventually marry and have a daughter, Kerri.Sixteen months after being held as a political prisoner, Karen is released. All she has thought about is getting back together with Mike. He is shocked to discover that she is alive, she is stunned to realize that her dream can never be fulfilled because he is married and has a child.Eventually, fate brings Jim, Mike, and Karen together. Their journey is painful, filled with passion, deceit, corruption, revenge, and murder. It forever changes their lives.I loved this book, and immediately downloaded “The Tainted Trust” to my Kindle. For me, it was non-stop reading of the King Trilogy!!"}, {"userName": "Bruce McLennan", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/31396326-bruce-mclennan", "userReview": "Rags to riches, romance and tragedy, a pounding page turner based on the gasoline industry. I've just finished The bridge to Caracas and thoroughly enjoyed reading it. Stephen Douglass writes brilliantly about an industry that he's made his life blood and shares some of the dirt and some of the success of what was, and still is, a pretty rough business. Gasoline (or Petrol as we know it here in Australia) was a boom and bust industry in the seventies and eighties. Fortunes were made by fair means and foul and fortunes were lost just as quickly. Douglass channels the seventies into this story and the era comes to life. It's something about the attitude and something about the lack of government oversight of the times that gives this page turner its momentum. There's also something in Douglass's writing that brings a Sidney Sheldon feel to the book, again adding to the feel of the 70s."}, {"userName": "R.E. Weber", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/18388322-r-e-weber", "userReview": "The Bridge to Caracas is a romantic thriller set during the 1960’s and 70’s and follows its protagonist, Mike King, as he navigates through the murky world of the oil business while trying to keep the love of his life, Karen, safe from her dangerous husband. It is clear from the outset that the author understands his subject matter very well, and his passion for this world clearly shines through, however you never feel bogged down with excessive detail of the workings of the oil business. Instead, the heart of the book is characterisation, and each protagonist (whether likeable or not) is well defined and three-dimensional . The villain of the peace, Karen’s husband Jim Servito, is a truly vile individual, capable of doing anything to protect his illegal, debauched lifestyle, and every time the book centres on him, you can almost feel your skin crawl – a sign of strong characterisation. And with Mike and Karen, you can’t help rooting for them in their fight to remain safe as they are wrong footed at every turn. The pacing throughout is spot on and the story finishes in a satisfactory (if a little contrived) manner, but with the enticing possibility of future adventures – the book is the first of a trilogy. I have to say that such books are generally not my cup of tea, however it is so well written that I couldn’t help but enjoy it, and I am looking forward to reading book 2 at some point soon. Congratulations to Steve Douglas – you are a talented author."}, {"userName": "Uvi Poznansky", "userReviewDate": "Jun 06, 2014", "userURL": "http://www.goodreads.com/user/show/7715377-uvi-poznansky", "userReview": "Taking in THE BRIDGE TO CARACAS feels like watching an action movie. You will find yourself at the edge of your seat, rooting for the good guy, Mike King, to triumph over the bad guy, Jim Servito, and to end up wining the girl, Karen Taylor. Inspired by a real crime, where scam netted an amount “that makes The New York State Lottery look like a Sunday school collection,” here is a plot-driven story, which opens right into action, with the scene of hijacking a plane. You will find yourself with Karen Taylor being abducted.Having worked for the two largest oil companies in the world (Exxon and royal Dutch Shell) and for the smallest oil companies in the world (his own) Stephen Douglas has a unique familiarity with his subject matter, so you will keep guessing at the borderlines between truth and fiction. He writes what he knows, and he does so with a brisk, cinematic pace that dabs danger with romance.Five stars."}, {"userName": "Jean", "userReviewDate": "Sep 03, 2016", "userURL": "http://www.goodreads.com/user/show/4075903-jean", "userReview": "** a Few Spoilers ** Thrilling and Suspenseful.. This story is set during the 1960's and the 1970's and centers around Jim Servito, is able to build a corrupt empire by not paying taxes, taking advantage of people, and stepping on anyone who gets in his way.It also focuses on Karen Taylor and Mike King's relationship including the love that they share. Karen is kidnapped and pronounced dead. Mike moves on and soon after Karen does too.. Mike is a bit clueless at times, and Karen is numb from her experiences. I was a bit disappointed in Mike. I don't want to give anymore away.Overall this story was a fast read or listen and fully engaging. Mathias Lenssen did really well with the narration. Note:\"This audio book was provided by the author, narrator, or publisher at no cost in exchange for an unbiased review.\""}, {"userName": "Leslie Fisher", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/25801961-leslie-fisher", "userReview": "I really enjoyed this book. Oil and gasoline aren't subjects that come up too often in my reading, so I found this really interesting, especially since I knew practically nothing about the business behind it, and the possible corruption. The book has suspense and a bit of romance, and kept me engaged the whole time. I listened to the Audible audio version and I enjoyed the narration by Mathias Lenssen. I thought he did a good job giving unique voices to the characters without them sounding too forced or over-the-top. I would definitely listen to other books narrated by him. Overall, I really enjoyed this book because it was a little something different, and I am looking forward to the next book in the series."}, {"userName": "Mike", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/4147405-mike", "userReview": "I really want to give this book four or more stars because the author has a real talent for telling a story. Douglass keeps the story moving along and you are never bored but...I did get frustrated at times. The protagonist Mike King obviously had to be damn bright to get where he is but in the latter half of the book, he acts like a complete klutz more often than not. Time after time (and his girlfriend likewise) he rushes into situations where angels would definitely fear to tread and seems to rely on good luck to extricate himself. Very unrealistic, to say the least. In real life, he would be dead many times over. Withal, I will continue reading the trilogy because, as I said, he tells a hell of a story, and \"Hey!\" Maybe he will improve."}, {"userName": "Harry Allagree", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/8488865-harry-allagree", "userReview": "I found the author's writing style breezy, somewhat hurried, at times a bit outlandish...particularly the poolside battle between the antagonists, Servito et al., & the protagonists, Mike & Karen. There are radical shifts of emotions among the characters throughout the book, except, perhaps, for Servito who is consistently a bad-un from the git go, with no sense of value for anything but his own pleasure & money. To his credit, I found that Douglass somehow able to build an interesting thriller around a sometimes sparse plot & characters who seemed to oscillate between being very perceptive & at other times pretty dumb & unaware. It was interesting enough that I read the book pretty quickly."}, {"userName": "Peggy Holloway", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/16441635-peggy-holloway", "userReview": "Loved the story, the plot, the characters and the character development. To me the novel moved slowly in places. If you like to read Jeffrey Archer I think you would love this book. The economic and technical parts of this book were hard for me to follow and I found myself skipping over a lot of it. I worked in the oil industry for many years but as a geophysicist. I had no idea that these things that took place in this book were going on. I was just exploring for oil. Therefore, this book was very educational for me and I love to learn new things while enjoying a novel. I would read anything written by this author. I like his writing style."}], "description": "Librarian Note: Alternate Cover Edition for ASIN: B00DJ5GM14.How was an incredible $325,000,000 theft achieved using The Peace Bridge as a fulcrum?It was a piece of national history. The story had to be told.One of the largest and most audacious gasoline tax evasion scams in Canadian and U.S. history.The perpetrator used The Peace Bridge, spanning The Niagara River, to facilitate his crime, and his private Cessna to transport the enormous fruits of the theft to the “safety” of a Cayman Island bank.The scam netted an amount “that makes The New York State Lottery look like a Sunday school collection.”Cynical and remorselessly ruthless, the thief possesses a brilliant criminal mind, has enormous contempt for the law, police, governments, and the system in which they function. He assumes rules are for fools, and takes sadistic pleasure in breaking them.", "title": "The Bridge To Caracas\n      \n          (The King Trilogy #1)", "url": "http://www.goodreads.com/book/show/22842297-the-bridge-to-caracas", "average": 4.14, "cover": "https://images.gr-assets.com/books/1406728144l/22842297.jpg", "reviews": 36, "authors": [{"url": "https://www.goodreads.com/author/show/1125279.Stephen_Douglass", "name": "Stephen Douglass"}], "type": ["Thriller", "Mystery", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/22842297-the-bridge-to-caracas", "http://www.goodreads.com/book/show/17158441-the-bridge-to-caracas", "http://www.goodreads.com/book/show/19262866-the-bridge-to-caracas", "http://www.goodreads.com/book/show/12679314-the-bridge-to-caracas", "http://www.goodreads.com/book/show/23128064-the-bridge-to-caracas", "http://www.goodreads.com/book/show/30735209-the-bridge-to-caracas", "http://www.goodreads.com/book/show/22842304-kerri-s-war", "http://www.goodreads.com/book/show/22882294-the-tainted-trust", "http://www.goodreads.com/book/show/2542861.The_Draft_Dodger", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}