{"ratings": 269, "userreviews": [{"userName": "* Booksessed * Bec", "userReviewDate": "Jan 29, 2013", "userURL": "http://www.goodreads.com/user/show/5351073-booksessed-bec", "userReview": "Book provided by the publisher.Another enjoyable addition to the series"}, {"userName": "Jean", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/2202399-jean", "userReview": "The third installment of the Black Stiletto series and it continues the story of Judy Cooper as told through her diaries given to her son Martin. Entertaining read."}, {"userName": "Susan", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/6948763-susan", "userReview": "These books are addictive. When I finish one of these books, I am immediately looking around for the next fix; alas, what will suffice until the next in the series is available in audio? Perhaps I will check out the numerous other works by Raymond Benson.Judy, the masked Black Stiletto, is in her early 20s in this book and her character continues to grow. I especially liked that the author showed Judy muddling through life, drinking too much, making poor decisions and getting her ass handed to her in a few fights. This made Judy very real; I want to be her when I grow up. China Town, NYC style, played a healthy role in this story. The Black Stiletto found herself caught up in some Chinese organized crime. Her attempts to do good end up getting not only her injured, but others too. For a while there, I was afraid the Black Stiletto had met her match.Meanwhile, the every day Judy joins John Kennedy’s political campaign, making new friends, and dressing as a Kennedy Girl in uniforms designed by Mrs. Kennedy. Of course, you can’t have Kennedy without the perceived evil blight of Communism. Hence, politics plays a bit of a role in this tale. I felt this aspect was a teensy over-played, but overall, it did not reduce my enjoyment of the book. My only other mild criticism is that Martin Talbot is just on the edge of too whiny in this book. Granted, he is highly stressed and suffering from anxiety attacks, but I found myself wanting more of Judy Cooper and less of Martin.My little sin, concerning these books, is that I like to give myself a day off and play Diablo III while listening to the exploits of the Black Stiletto. In this particular sinful episode, my female barbarian must have been channeling the Black Stiletto. Every time the Stiletto got her ass kicked, my character went down. When Stiletto was victorious, so was my barbarian.Narration: As usual for this series, the narration was spot on for this book. I am glad the two main narrators have been able to carry over through all 3 books. We also had a few Asian, Austrian, and South American accents, which were done well."}, {"userName": "Sue", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/4984387-sue", "userReview": "It was only after I had requested this book from netgalley that I realised it was part of a series. I was worried that I would not be able to follow the plot and that the story would make no sense to me.I was wrong.The Black Stiletto series is about Martin Cooper and how he deals with the revelation his mother was the Black Stiletto - a female vigilante in the 1950's/1960's.This installment sees Martin wrestle with his conscience as he debates whether to tell his girlfriend Maggie about his mother's secret identity.The story is exciting, the characters realistic - although I am not entirely sure Judy as the Black Stiletto is all that convincing, but if you suspend your disbelief you can enjoy the tales.My biggest regret in regards to this book is that I have yet to read the first and second installment; again, it is easy enough to read this book without getting too lost, should you not have read the first two. However, there are characters in this book that felt quite secondary to me, but I knew little about them having not read the earlier books.I would highly recommend reading the first two books and then moving onto this one. The series seems gripping and quite the page turner. Definitely worth your time.Recommended.5 stars *****"}, {"userName": "Rhonda", "userReviewDate": "Apr 01, 2013", "userURL": "http://www.goodreads.com/user/show/955320-rhonda", "userReview": "4 STARSThis is the third Black Stiletto novel. It keeps me rivited until I finshed reading.Judy Cooper is the Black Stiletto's real name. Hardly anyone knows that she is her.Judy volunteered for Kennedy's campagn and finds Russian Spys who want to kill Senator Kennedy.She also gets involved with the chinese tongs in Chinatown. Police still want to arrest her at least most of them. The novel starts with her son Martin and tells what is happening in his life with his mom in the care center, his daughter coping with being attacked in New York. Martin's ex-wife getting remarried. The drama of his life and inbetween his updates he is reading his mom's third diary book.When reading Judy's diary it has the feeling that it is a real diary made in that time and place of the 60's. With all it's problems and good points.The novel does a good job going from Martin's day to day life to Judy's diary and back again.It's a lot of action,chases,fights and choices of good or bad.I will continue to read the Black Stiletto books as they come out.I was given this ebook to read in exchange of honest review from Netgalley.04/02/2013 Publisher: Oceanview Publishing ISBN-10: 1608090728 325 pages"}, {"userName": "Art", "userReviewDate": "May 07, 2015", "userURL": "http://www.goodreads.com/user/show/3792698-art", "userReview": "The Black Stiletto:Stars & Stripes by Raymond Benson is book therein the Black Stiletto series. Benson weaves the story between the titular vigilante in the sixties to her son in the present. The story diligently weaves a well spun story that had me hungry for both sides! Benson sprinkles real historical events in his narrative to give the reader a significant frame of reference. The events of the past weigh heavily on the present that is what makes Benson a master storyteller. The audiobook version is voiced by many different actors doing a plethora of voices. This brings the story even further to life in essence making it a kin to a high level performance. I love how this series has obvious continuation points, but each book is a full complete story. The Black Stiletto: Stars & Stripes is a full five stars!"}, {"userName": "Mike Klein", "userReviewDate": "Oct 30, 2013", "userURL": "http://www.goodreads.com/user/show/3335187-mike-klein", "userReview": "First one of the series that I read. Not my fault the edition is deliberately printed to obscure the fact that it is part of a series. Publishers want to sell books but to sell them under sort of false pretenses makes me a little angry. I got this from a library, but it still bugs me. In any case the story is fairly stand-alone and not bad. It is an intermesh of two stories one told through a diary. The \"modern\" story is just ok, it has some tension that feels artificial. The other story is fine although the whole diary thing breaks down. (For example intricate fight sequences probably wouldn't be described in the kind of detail that the reader ends up with here.) But it was still a fun read. Be good on an airplane ride."}, {"userName": "Kandice", "userReviewDate": "Oct 04, 2013", "userURL": "http://www.goodreads.com/user/show/2617370-kandice", "userReview": "This was an entertaining addition to the series. Judy is a fun and lovable character who goes around trying to right all the injustice in the world. In this installment, she runs afoul of the Asian gangs and the Russian mafia all while trying to save JFK. And while it's sad to see her in present-day times as an elderly woman with memory problems, the ending of this book indicates Judy's spirit lives on - we just need to read the next book to find out how. My only complaint with this book is that it reads a little like a martial arts graphic novel where Judy thinks she's indestructible and takes on guns, snipers, knives, and assassins without ever getting too seriously hurt. While this makes the book totally unrealistic, it's still a lot of fun to read!"}, {"userName": "PopcornReads", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/5725748-popcornreads", "userReview": "Book Review & Giveaway: We’re participating in the Kick Butt Characters Giveaway Hop, and I can’t think of a more appropriate character to include than the heroine of the Black Stiletto series! The Black Stiletto Stars & Stripes is Book #3 in this historical series by Raymond Benson, and mid-20th century super-gal Judy Cooper just keeps getting better. Library Journal compared this series to a mash-up of Gloria Steinem, Ian Fleming and Mario Puzo under Stan Lee’s editorship, and I couldn’t have said it better. No worries; Stars & Stripes can be read as a stand-alone novel quite easily, in case you missed Books #1 and #2. Want to win an advance readers copy? Go to http://popcornreads.com/?p=5634."}, {"userName": "Mark", "userReviewDate": "Apr 09, 2013", "userURL": "http://www.goodreads.com/user/show/2890505-mark", "userReview": "Five stars are awarded not because The Black Stiletto is great literature. Benson has simply created a fun and interesting character that deserves your attention when you want a faster, involving read.What makes Benson's Black Stiletto so fascinating is the contrasting story lines and time periods. Judy Cooper's story as a lone vigilante, masked crime fighter from 50 years ago is told through her diary. The narration is by her only child, now an adult dealing with his mother's Alzheimer disease. Realistic issues contrasted against fantasy. Strong female lead character in a non-romance novel that deals with contemporary issues in a fun, unique way. That's five stars all the way."}, {"userName": "Katarina", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/8130240-katarina", "userReview": "Like the first two in the series, this is action packed, has a great plot, great twists and great writing.The story of the Black Stiletto continues. Judy's health, in the present, continues to decline, to the point where she barely speaks. I thought this heightened the suspense, because Maritin has all these questions, which his mom can't answer, so he has to make his own journey through her story. Gina, Martin's daughter, starts to play a bigger role, and I can see some foreshadowing. A truely great book"}, {"userName": "Meri-Lyn", "userReviewDate": "Oct 05, 2016", "userURL": "http://www.goodreads.com/user/show/36050057-meri-lyn", "userReview": "I enjoyed this one just as much as the first two. I liked the connection to the presidential election of 1960. Since we are currently in presidential debate season now it was very believable. The stories have just enough suspense and good triumphing over evil in their time frame. I'll probably start book 4 very soon."}, {"userName": "Debbie", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/3527423-debbie", "userReview": "Would you like to know more about the author? I have an interview w/Raymond Benson on my blog. Did you know he was the 4th official James Bond author. He was the most interesting author I've interviewed to date, want to see why-http://thereadingfrenzy.blogspot.com/..."}, {"userName": "Ming Siu", "userReviewDate": "Jan 15, 2015", "userURL": "http://www.goodreads.com/user/show/9220371-ming-siu", "userReview": "Maybe the whole depression as character development thing doesn't work for me; I found this more of a chore to get through than the previous instalments. Also, the dragging out of plots now feels a little tired and slow."}, {"userName": "Theresa M Desautels", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/31241431-theresa-m-desautels", "userReview": "An enjoyable and quick readAn enjoyable and quick readit's not earth shaking,but if there's another book to finish it off, will read it. if not, then it is ended well and we can figure out the rest ourselves. so, read the book, and come up with your own ideas."}, {"userName": "David Marshall", "userReviewDate": "Jul 08, 2013", "userURL": "http://www.goodreads.com/user/show/4671848-david-marshall", "userReview": "It's difficult to write about vigilanteism and maintain a fair moral balance but this book does the trick and manages, for the most part, to be fun.http://opionator.wordpress.com/2013/0..."}, {"userName": "Francis T. Villante", "userReviewDate": "Mar 16, 2014", "userURL": "http://www.goodreads.com/user/show/26988794-francis-t-villante", "userReview": "Read this oneit was a fun read , mixes some real history with a little bit of a superhero mixed in,not your normal formula novel. it goes back and forth from the early sixties to the present but it's very clear and not confusing about where you are,"}, {"userName": "Richard Wiltse", "userReviewDate": "Nov 19, 2014", "userURL": "http://www.goodreads.com/user/show/32648155-richard-wiltse", "userReview": "Great series.If you like good cloak an dagger mysteries, you will truly enjoy this one. Can't wait for the next one."}, {"userName": "Joe O'Connor", "userReviewDate": "Oct 11, 2013", "userURL": "http://www.goodreads.com/user/show/2631195-joe-o-connor", "userReview": "Very Good; Continuing character: The Black Stiletto; troubles in Chinatown face the Stiletto while her alter ego joins a group supporting the presidential bid of John Kennedy"}, {"userName": "Denise", "userReviewDate": "May 07, 2015", "userURL": "http://www.goodreads.com/user/show/27258123-denise", "userReview": "Cannot wait to start the next book! So much adventure and fun!"}, {"userName": "David", "userReviewDate": "Dec 12, 2012", "userURL": "http://www.goodreads.com/user/show/5369300-david", "userReview": "A fun series! If you haven't read The Black Stiletto or The Black Stiletto: Black & White, read them first!"}, {"userName": "Ron", "userReviewDate": "Sep 14, 2014", "userURL": "http://www.goodreads.com/user/show/5179054-ron", "userReview": "Somehow I read #4 before this without realizing it. Didn't stop me from enjoying the book but I am a stickler for reading a series in order."}, {"userName": "Christina", "userReviewDate": "Aug 03, 2016", "userURL": "http://www.goodreads.com/user/show/8216094-christina", "userReview": "It's fun to read. The heroine is believable. I looked up some history to relate it to the story. Love this series!"}, {"userName": "Judi Learned", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/14587832-judi-learned", "userReview": "This serious keeps me wanting to read the next immediately."}, {"userName": "S Dizzy", "userReviewDate": "Nov 22, 2014", "userURL": "http://www.goodreads.com/user/show/6722883-s-dizzy", "userReview": "This was a swift and fun read in this series."}, {"userName": "Connie Gudelauski", "userReviewDate": "May 11, 2014", "userURL": "http://www.goodreads.com/user/show/31245162-connie-gudelauski", "userReview": "THRILLINGAnd the suspense of Martin and his life moves along nicely. I really appreciate the end. I read this one in a weekend. Can hardly wait for the next one!"}], "description": "Its 1960. The Black Stiletto, in her civilian persona as Judy Cooper, volunteers to work for John F. Kennedys presidential campaign, only to become involved in a devious behind-the-scenes plot that could change the course of history. Is the mysterious Eastern European man she briefly dated associated with a Cuban/Soviet spy ring? Closer to home, the Stiletto must challenge dangerous tongs in Chinatown after befriending a teenage boy whose father was killed by the gangs. She soon discovers what a differentand very deadlyworld exists in lower Manhattan. In the present, Martin, the Stilettos son, must deal with his mothers worsening Alzheimers symptoms, his own mental health issues, and the dilemma of whether or not to reveal his familys secrets to the new woman in his life. Meanwhile, his daughter, Gina, continues to bring trouble to herself, exhibiting behavior that suggests she is closer in spirit to her grandmother than Martin would like. Every major character, past and present, experiences a turning point in this third chapter of the Black Stiletto series.", "title": "The Black Stiletto: Stars & Stripes: The Third Diary\n      \n          (The Black Stiletto #3)", "url": "http://www.goodreads.com/book/show/17327002-the-black-stiletto", "average": 3.68, "cover": "https://images.gr-assets.com/books/1361151084l/17327002.jpg", "reviews": 27, "authors": [{"url": "https://www.goodreads.com/author/show/18292.Raymond_Benson", "name": "Raymond Benson"}], "type": ["Historical", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/17327002-the-black-stiletto", "http://www.goodreads.com/book/show/16205978-the-black-stiletto", "http://www.goodreads.com/book/show/18709435-the-black-stiletto", "http://www.goodreads.com/book/show/32547.High_Time_to_Kill", "http://www.goodreads.com/book/show/1822547.Zero_Minus_Ten", "http://www.goodreads.com/book/show/3048010-metal-gear-solid", "http://www.goodreads.com/book/show/11395296-the-black-stiletto", "http://www.goodreads.com/book/show/432513.Never_Dream_of_Dying"]}