{"ratings": 176, "userreviews": [{"userName": "Dee Bibb", "userReviewDate": "Jun 17, 2011", "userURL": "http://www.goodreads.com/user/show/5588094-dee-bibb", "userReview": "This book is so good I finished it in one day....I just couldn't put it down! Awesome! Can't wait for the the next book!!!I would like to point out at this time....I don't give 5 stars unless the book is life changing in some way....if I give a book 4 stars....it is pretty awesome.Title: The Bronze and the Brimstone (Verona Trilogy #2)Author: Lory S. KaufmanPublisher: The Fiction StudioThe Bronze and the Brimstone is the second book in the series of the Verona Trilogy by Lory S. Kaufman. This book picks up right where the first book, The Lens and the Looker, ends. Hansum, Shamira, and Lincoln are three teens that are from the 24th century and are trapped in the 14th century Verona, Italy.The teens have experienced and survived many dangerous instances and have been noticed by the rich and powerful of the day by introducing futuristic technology into the past. In the book, Kaufman weaves the teens through many dangerous trials and tribulations and we watch them all grow and mature into responsible adults. Ok…they are still teens, but remember they are in the 14th century and things are much harder then and people grew up a lot faster. This book ends when the Black Death was sweeping across the area. Kaufman gives us a twist at the end of this book that makes us definitely want to read the next one!I thoroughly enjoyed this book and would recommend it to anyone who loves sci-fi, fantasy fiction. But let me say this….it is historical. Both book 1 & 2 are set in Verona Italy in the 14th century. Up to this point there hasn’t been a lot of information given about the 24th century except in the first few little chapters of book 1. However, I’m fine with that. I love historical fiction!BTW…there is a third book (hence trilogy). It is called The Loved and the Lost…and I CANNOT wait to get my hands on a copy!!!!"}, {"userName": "Ron", "userReviewDate": "Aug 13, 2012", "userURL": "http://www.goodreads.com/user/show/1256262-ron", "userReview": "In this second story in the History Camp series, Kaufman starts by filling the reader in on what happened in book one. Fine, except that he forgets to start his story. We have to wade through a chapter-long synopsis wondering if he's ever going to tell us anything new.Not much to tell about the plot. It's basically a one-trick pony, named Pan. That said, Pan shows little creativity and less emotional maturity than his teenage charges. You'd think a microscopic supercomputer trickster could more effectively foil the protagonists plans to kill themselves, or at least help them stay alive. If he can appear as an angel sometimes (given what he knows of the culture) why not always? And something like that ought to work or not, certainly not halfway with amnesia and brain damage.A few minor continuity hiccups between the two books.If things came too easily in The Lens and the Looker, this book compensates. The Black Death levels all playing fields. Kaufman does note the self-sacrifice of many unnamed religious folks as contrasted to the self-serving activity of the one named. Speaking of whom: his quote about God helping those who help themselves, as he probably knew, came from Aesop's fables-- not the Bible.To Kaufman's credit he did foreshadow the return of Arminius (even in the first book after he supposedly died). The story snatches victory from the jaws of defeat--though an appropriately bittersweet one--but did not leave this reader wanting more.A good read."}, {"userName": "Michelle", "userReviewDate": "Jan 17, 2013", "userURL": "http://www.goodreads.com/user/show/3499479-michelle", "userReview": "I will be doing a full review later this week but I have to say, I really liked this book. It kept me interested and I couldn't wait to get a chance to read it each day. There were some points towards the end that overwhelmed me. Too much calamity at once, but even during that part I couldn't put the book down. My full review will be posted on Readersrefuge.blogspot.com at a future date that I will update on here."}, {"userName": "Karielle at Books à la Mode", "userReviewDate": "Jul 10, 2011", "userURL": "http://www.goodreads.com/user/show/1127449-karielle-at-books-la-mode", "userReview": "The Bronze and the Brimstone by Lory S. KaufmanSeries: Verona Trilogy (#2)Release Date: June 7th, 2011Publisher: The Fiction Studio Page Count: 336Source: Received from author, via Pump Up Your Book, for reviewWhat could go wrong in the 14th-century for three time-traveling teens? How about – EVERYTHING!Hansum, Shamira and Lincoln, three teens from the 24th century, are trapped in 14th-century Verona, Italy. They’ve survived many deadly experiences by keeping their wits about them and by introducing futuristic technology into the past. Principal among these inventions is the telescope, which brought them to the attention of the rich and powerful.But standing out can get you into unexpected and dangerous situations. The nobles of Verona now believe Hansum is a savant, a genius inventor, especially after he brings them plans for advanced cannons and black powder. Being the center of attention is great, but the potential for trouble is now exponentially greater because people are watching Hansum’s every move.Meanwhile, artistic genius Shamira has fallen for a Florentine artist with bloody and disastrous consequences. Lincoln, considered an incompetent back home in the 24th-century, has blossomed – at least until he’s shot in the head with an arrow. And Hansum, after secretly marrying his new master’s beautiful daughter, Guilietta, is offered the hand in marriage of lady Beatrice, daughter of the ruler of Verona. To refuse could mean calamity for all the teens.Amazingly, none of this is their biggest challenge. Because a rash illness is spreading across Verona – and it is threatening to consume everyone.Do they have a future in this past?What Stephanie Thinks: If you recall my review for Kaufman's first in the Verona series, The Lens and the Looker, you remember I was highly disappointed with the young adult/fantasy/sci-fi/romance novel. The second book in the series, The Bronze and the Brimstone, is only slightly less displeasing; my reasons for scorning it are almost identical to those of the first book, but I do think this one's plot is more well-developed and exciting.My biggest problem is the contradictions the story poses. There are \"adult\" topics covered that wouldn't seem to appeal to teenagers. I'm not saying teenagers like pure content, but if soap-opera-esque romance is put into a book, it should specifically be romance, not young adult romance. On the other hand, another reason teens won't be able to relate to this book is because of the author's childish way of writing. I can better recomment Kaufman's voice and style to middle grade children, not to young adults. If you look at today's biggest young adult titles, none of them are written in an adult's style. They're written in a young adult's style (hence, the name), by an adult. This is difficult because most adults can't voice a teenager's thoughts. That's why they stick to writing regular fiction, not young adult fiction.Aside from Kaufman's writing style (which I complained about verbatim in my other review), I will say the plot of the sequel actually had me holding on. Unlike the predictable Romeo and Juliet fantasy in the first book, this one actually is original and marginally more enjoyable. I recommend reading this book for fantasy and time travel lovers, but not too enthusiastically.Radical Rating: 6 hearts- Would recommend to people. ♥♥♥♥♥♥"}, {"userName": "Brooke Showalter (Brooke Blogs)", "userReviewDate": "Jun 25, 2014", "userURL": "http://www.goodreads.com/user/show/5840419-brooke-showalter-brooke-blogs", "userReview": "Review originally posted on Brooke Blogs on 06/26/2014.The Verona Trilogy by Lory S. Kaufman really blew me away. I thought the books sounded interesting, but I had no idea the journey I was about to take in reading them. The Lens and the Looker was so fascinating, right from the very beginning. I love the world that Lory built in the 24th Century. As brief as our stay in that time period was, it was really neat to read about. I really liked the concept of the history camps/hard time history camps.When the three teens are kidnapped and transported to 14th Century Verona, Italy, the story takes an exciting new twist. I was completely immersed in the time period. The author does an outstanding job of really making this time period come alive. I felt like I could truly see and hear the sights and sounds of Verona in 1347. It was amazing!I really liked the concept of the story, and the fact that the story was a skillful blend of history and fantasy. I thoroughly enjoyed each book in the trilogy. I’m actually downloading The Lens and the Looker free podcast that is available, because I want to still be a part of this fascinating trilogy. :) It’s neat, too, that you can go to the author’s website and learn more about the back story. If I truly enjoy a book/series, I want to stay with it as long as I can. It was fun for me to be able to go to the site and learn more about it.This trilogy is one that I cannot say enough good things about. These three gorgeous books (seriously, the covers are beautiful!) will have a happy home on my bookshelf, though I know I will pick them up again. I look forward to letting my older daughter read them soon as well.The Verona Trilogy by Lory S. Kaufman transcends ages and genres. It is a series that I feel will stand the test of time. It is one that I can see myself reading over again. I love the blending of a futuristic/post-dystopian society, fantasy, history, love, YA…the trilogy encompasses many facets of literature that I love. If you love these, too, this is a story you will enjoy as much as I do. I love that the first book is just 99 cents! It is worth much more than that. I would read another book by Lory S. Kaufman in a heartbeat!The Verona Trilogy by Lory S. Kaufman gets 5+++++ stars from me.I received a complimentary paperback for review purposes."}, {"userName": "Amber", "userReviewDate": "May 24, 2011", "userURL": "http://www.goodreads.com/user/show/3724181-amber", "userReview": "The Bronze and the Brimstone picks up right where the first book left off. Hansum, Shamira, Lincoln (known to the fourteenth century crowd as Romero, Carmella, and Maruccio), and the della Cappas have just survived a grave ordeal and now everyone is resting and healing before getting back to work. Exhausted from the ordeal, Hansum dreams that he is back home in the twenty-fourth century with his parents and A.I. Charlene, except that Pan the genie is also there as well as Guilietta. He finds this strange but he is also happy that he gets introduce Guilietta to his parents, since they plan to marry. But then Hansum is woken up by Agistino della Cappa, his master, and he is quickly brought back to his new reality.The della Cappa lens and looker business has taken off in the meantime. Anyone with means can buy the “discs for the eyes” but no one is allowed to buy the lookers per an agreement made with the Podesta, Mastino della Scalla. The Podesta and his cousin, the Baron da Pontremoli, have recognized Hansum’s talent for inventions (except he receives all of his information from the A.I. genie, Pan). They decide to recruit him to oversee all of the various operations that involve making the new black powder and accompanying cannons while the others remain at the della Cappas to make the lookers. There is also a hitch when the Podesta hints that he would like Hansum to marry his daughter, Lady Beatrice, when he is already involved with Guilietta.Everyone’s fortunes have been looking up ever since the three teens from the future arrived. But what happens when technologies are introduced hundreds of years in advance? Will their fortunes continue to rise or will they fall?Read the full review here."}, {"userName": "Dawn Vanniman", "userReviewDate": "Nov 02, 2011", "userURL": "http://www.goodreads.com/user/show/5037877-dawn-vanniman", "userReview": "The second book in the Verona Trilogy finds our heroes settled into life in 14th century Verona. The boys work making 'discs for the eyes', while Shamira is a kitchen girl.The historical detail is wonderful - the clothes, everyday living, the deceit and deception!This book deals mainly with Hansum, or as he is known, Romero. It does feature Lincoln and Shamira, but mostly as asides. I hope we see more of them in detail in book 3.Hansum (Romero) has come to the attention of the nobles by 'inventing' lookers (telescopes) with the help of their genie and now has introduced cannons and black powder. It's the age-old time travel questions - How does introducing technology, before it happens naturally, work out? The answer, as always, is IT DOESN'T! Before Hansum knows what's going on, he's living with the nobles and being offered the hand of a beautiful girl. The biggest problem is that he's already secretly married to his old Master's daughter, Guilietta. He can't tell the nobles, he's seen what they do to people that displease them. So he tells them he loves Guilietta and wants to marry her and believes that they are trying to help him achieve that. Meanwhile, Guilietta doesn't feel so great...By the end of the book, the genie is smashed and worthless, Black Death is sweeping through the town and Hansum fears all is lost. As did I. The end is very exciting and I can't wait to read more!If you'd like some fun, go check out www.history-camp.com while waiting for the next book!"}, {"userName": "Rebecca", "userReviewDate": "Oct 28, 2011", "userURL": "http://www.goodreads.com/user/show/2324650-rebecca", "userReview": "I was intrigued by how the first book ended to continue on with this book and I have to say that this wasn't how I had expected it to be. There were quite a few twists and turns in the plot of the book that I really did not see coming.Once again I was questioning the actions of the three protagonists. I don't understand why Hansum insisted on adding future technologies into the past. It just seemed to lead to more trouble and so I just couldn't understand his motivations for doing it.I think that my favourite characters were Guilietta and Shamira. They both seemed pretty cool and I felt I liked their motivations and actions a little more than any of the others. They also felt more genuine to me.I thought the story line of The Bronze and the Brimstone was quite unique and it was very action packed, there was never a dull moment. I thought it was interesting how some things were introduced and resolved sooner than others.The ending sort of surprised me a lot and I now have a lot more questions that I'm hoping will get answered in the third book. I felt that the ending sort of made things more complicated and while most things were resolved in this book the ending kind of opened up a new can of worms.Overall, I thought that The Bronze and the Brimstone was quite an interesting book but I wasn't completely in love with it. I will however, be on the lookout for the next book in the series as I am intrigued."}, {"userName": "Jessica Bierschied", "userReviewDate": "Apr 26, 2011", "userURL": "http://www.goodreads.com/user/show/2280096-jessica-bierschied", "userReview": "THE BRONZE AND THE BRIMSTONE, by Lory Kaufman is the second installment of the Verona Trilogy and it is pure genius! Action and adventure, hard times and excitement continue to follow three teens from the future who are stuck in 14th century Verona, Italy. I don't even know where to begin! I was mesmerized by this novel. Start to finish I could not put this down. I really am in love with the plot of these novels. Nowadays you don't see enough time travel! I began to devour the book and by the end my mouth was gaping open! Guilietta and Hansum...they are just too perfect! I would have liked to see more of Guilietta, and get to know her more in depth but it didn't take away from how much I like her! Especially with Hansum. I really enjoyed going through Hansum's experiences with royalty and being a savant, but at the same time I would have loved to see more of what was going on with Shamira (and Lincoln) back at the della Cappa house. I recommend this series to absolutely everyone! I am dazzled by Kaufman's writing and characters, and I cannot wait for the next installment of this series!"}, {"userName": "Sherri", "userReviewDate": "Aug 06, 2011", "userURL": "http://www.goodreads.com/user/show/5017001-sherri", "userReview": "I finally had the chance to read this book, I couldn't find it and settled for e-reader. I was thrilled to have it as I have read the lens and the looker and liked that one. This book, the second in the trilogy, is very hard to put down! Tons of action, fast paced and fun for the reader. You find Hansum walking a fine line as he plays a mental chess game with the royals so he can keep his head, and the relationship with Guiletta. Personally, I'm hoping that relationship has a happy ending and flourishes! All the characters face several trials and tribulations. I loved this book and would highly recommend it to anyone that seeks adventure and plot twists. The author just keeps getting better and better. I liked the lens and the looker, (the first in the trilogy), but this one was way better yet. I believe you will love it! I'm anxiously awaiting the third book in this trilogy!!"}, {"userName": "William Bentrim", "userReviewDate": "May 31, 2011", "userURL": "http://www.goodreads.com/user/show/2760991-william-bentrim", "userReview": "The Bronze and the Brimstone by Lory S. KaufmanThe trio of pending juvenile find the real past is dramatically different than the sanitized version shown in History Camp. Mr. Kaufman’s has hit the mark again. This book is very entertaining and captivating while showing the gritty realities of previous centuries. This is possibly a very sneaky way of introducing real history. Having taught history I always was dismayed how difficult it was to get kids excited about it. Mr. Kaufman is providing a dose of history disguised as just fun reading. Historic condition being what they were, the author even shows some insight as to why the nobles may have been so despotic in their behavior. That was quite well done. In my opinion, Lory S. Kaufman has got game! I highly recommend the book."}, {"userName": "Jessica", "userReviewDate": "Mar 31, 2014", "userURL": "http://www.goodreads.com/user/show/5655055-jessica", "userReview": "The second book in the Verona Trilogy, start where you left off in the first novel. I loved the first book, but I like this one more. The action, adventure and excitement was anything I could asked for in a book, but add hard times and an unknown future for the three teens. I could put it down, I read it in one sitting. I was just as taking with the amount of detail as the first book, but was a little disappointed that most of the story had to do with Hansum and left little to do with Lincoln and Shamira. Not that it made the story any less, but I just wanted more of them. I love Hansum and Guilietta, when he tell her he loves her, I had tears. The Bronze and the Brimstone is just as great as the first book, a really joy to read. 4 out of 5 stars."}, {"userName": "Sandra", "userReviewDate": "Mar 14, 2014", "userURL": "http://www.goodreads.com/user/show/9548350-sandra", "userReview": "i won this book from facebook giveaway. unfornutly i did'tn read the 1st one & this book seem to follow it. Hansum, Shamira, and Lincoln are three teens that are from the 24th century and are trapped in the 14th century Verona, Italy. Kaufman weaves the teens through many dangerous trials and tribulations and we watch them all grow and mature into responsible adults."}, {"userName": "Sam", "userReviewDate": "Jun 07, 2011", "userURL": "http://www.goodreads.com/user/show/4999947-sam", "userReview": "Great book, follows the story of our favorite young fellows through their adventuers in the past. Overall well written and wonderful romp through time. The ending was very good, I must say that."}, {"userName": "Diana (Offbeat Vagabond)", "userReviewDate": "Apr 05, 2013", "userURL": "http://www.goodreads.com/user/show/4571498-diana-offbeat-vagabond", "userReview": "Original review here: http://offbeatvagabond.blogspot.com/2013/03/indie-book-review-bronze-and-brimstone.htmlThe Bronze and The Brimstone is the second book in the Verona Trilogy. This time around we follow the gang as we see how they are successfully surviving in 14th century Italy. Hansum is seen as a genius inventor and everyone wants to pick his brain for his inventions for war. Shamira and Lincoln are also doing well and thriving. But all the success brings more than they bargain for when they start to see the ugly side of success. Not only does Hansum have to figure out a way to keep the Podesta happy, but he must keep the Master of the house happy. He loves and wants to marry his daughter, Guiletta, but neither the Podest nor the Master will accept. And to make things worse, given the time period and where they are, the Black Plague is soon to be on them. They don’t even know the beginning of horror yet. What an amazing sequel. This was even better than the first book. It was so exciting and quite the rollercoaster. There were definitely a few tears from me. I loved the gang even more this time around. They were so immature in the first book. I love how much they have grown and accepted their situation. They could have easily gone around moping around, wanting everyone to do the work for them. In this book, we mainly follow Hansum aka Romero. I was most satisfied with his progress from the first book. He was just so spoiled. We also still have Pan. He is the chip that helps guide the group and tells them about the inventions that will help them succeed. I am so happy they had Pan. If not for him, I can not imagine how these guys would survive, mainly Hansum. With Hansum’s success, he is beginning to see the ugly side of those he works with and how easily people can turn on you if they don’t get what they want. There were amazing plot twists in this book. The main one at the end I kind of had a feeling about. It just wouldn’t have made sense otherwise if you think about it. But there were many other things that I didn’t see coming. The Podesta is so desperate to get more of Hansum’s genius; he did something absolutely awful in this book that resulted in something even more terrible happening. This was weird for me because Hansum’s reaction to it wasn’t what it should have been. I would have done something. That was just unforgivable and it was all due to his selfishness. I don’t think the Podesta is evil per se, but he looks out for number one and that is it. There is even a story with Father Lorenzo. Oh my goodness, I could rant about him all day. I couldn’t believe him especially in the end. Wow! This book was an exciting read from beginning to end. I was never bored and Kaufman really through a lot of incredible loops at us. Again, there were tears and laughs. I felt quite a connection with the characters. We do get a little more of the side characters in this book, but not nearly enough for me. But I still loved the book. You really won’t believe where this book goes. Highly recommend this read for those looking for a unique kind of science fiction. I love the world set in the past. I actually feel like I am there, Kaufman does such a great job bringing it to life. Definitely check this trilogy out."}, {"userName": "Sensitivemuse", "userReviewDate": "Jul 11, 2011", "userURL": "http://www.goodreads.com/user/show/2434215-sensitivemuse", "userReview": "I was looking forward to reading this one after finishing the first book. I wanted to know what was going to happen to the three. Although it was good, and the ending made me want to scream, I thought the book could have been a bit better. The plot was still well done, and although it focuses a lot more on Hansum again, Shamira has now her own storyline (it’s a short one, unfortunately) and Lincoln still has a small role - I wished he was more into this book, he’s fun to read and adds more life to the book because of his personality. I think, if he was paired up with Hansum from the start, the plot could have taken a different twist, but also would have been a much more enjoyable read.Not to say I didn’t like Hansum, although I’d rather started disliking him towards the second half of the book when he started to turn a 360 and started to act like a jerk. It’s understandable, since all he wants to do is work but also spend his life with Guilietta (which seems to be extremely difficult to do, and you can feel his frustration). However it’s good to see all three characters have maintained their maturity and their character development in this book is very well done and well written. What I enjoyed the most was the rich historical detail this book had. It certainly looked like there was a lot of work put into this so the reader will experience a much more authentic setting and it’s a well done job. From the characters clothing, to what they eat, and to what they use in everyday life is set in fine detail. As mentioned before, this book could have been better. I thought it dragged a bit in certain areas. Although it’s interesting on how the making of gunpowder is made, and how a cannon is constructed, this is where the detail is just so minute it feels like you’re reading a textbook on “Life and Times in Historical Italy” than anything else. It might be interesting to some readers but for those that just want to get to the action, this part of the book is slow and can get dry. To me it felt like there were endless pages on how the construction was done, and I had to put the book down several times to slap myself awake. As much as I love detail and the fine parts, this was just too much for me. Also although the target audience is for young adults there is a level of violence and language that may not be so good for younger readers. Plus there is some content that could be questionable. There was one particular violent moment involving a donkey and I’m still wondering why Hansum needed to do this to prove a point. It’s certainly uncharacteristic of him and I wonder if that was even necessary. The ending of the book was good as it felt like the action was all saved for the last few pages. It was an intense emotional roller coaster. The reader will be stunned, sad, angry, and relieved. All in just a few pages. That those few pages got me to feel this way in less than fifteen minutes it took me to read them is just brilliant. It was absolutely well done.Despite this being dry in some parts, it was well worth the read. Rich in historical detail, with a good mix of action, romance, and drama, I am definitely looking forward to how this series ends. This book could have been better, but the ending makes up for it in so many ways it makes it well worth the read."}, {"userName": "Victor Gentile", "userReviewDate": "Mar 01, 2013", "userURL": "http://www.goodreads.com/user/show/2528881-victor-gentile", "userReview": "Lory S. Kaufman in his new book, “The Bronze And The Brimstone” Book Two in The Verona Trilogy series published by The Fiction Studio takes us into the lives of Hansum, Shamira and Lincoln.From the back cover: What could go wrong in the 14th Century for three time-traveling teens? How about–EVERYTHING!Hansum, Shamira and Lincoln, three teens from the 24th-century, are trapped in 14th-century Verona, Italy. They’ve survived many deadly experiences by keeping their wits about them and by introducing futuristic technology into the past. Principal among these inventions is the telescope, which brought them to the attention to the rich and powerful.But standing out can get you into unexpected and dangerous situations. The nobles of Verona now believe Hansum is a savant, a genius inventor, especially after he brings them plans for advanced cannons and black powder. Being the center of attention is great, but the potential for trouble is now exponentially greater because people are watching Hansum’s every move.Meanwhile, artistic genius Shamira has fallen for a Florentine artist with bloody and disastrous consequences. Lincoln, considered an incompetent back home in the 24th-century, has blossomed – at least until he’s shot in the head with an arrow. And Hansum, after secretly marrying his new master’s beautiful daughter, Guilietta, is offered the hand in marriage of lady Beatrice, daughter of the ruler of Verona. To refuse could mean calamity for all the teens.Amazingly, none of this is their biggest challenge. Because a rash illness is spreading across Verona – and it is threatening to consume everyone.Do they have a future in this past?There is History in “The Bronze And The Brimstone” as we are dealing with 14th Century Verona, Italy. Then there is the science fiction element. Hansum, Shamira and Lincoln were whisked from their 24th Century home and now, to make Verona at least liveable for themselves they are introducing technology and ideas that will not be available for quite some time. They are now altering the timeline and causing all kinds of problems. There is also romance as Shamira is in love, Hansum got married secretly then was offered a marriage deal with the daughter of the ruler of Verona. These three teens are trying to adapt to, not only their new home, but their new time and causing disastrous consequences. Mr. Kaufman has given us another exciting adventure!If you would like to listen to interviews with other authors and professionals please go to www.kingdomhighlights.org where they are available On Demand.To listen to 24 hours non-stop, commercial free Christian music please visit our internet radio station www.kingdomairwaves.orgDisclosure of Material Connection: I received this book free from Pump Up Your Book. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255  : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Heavensent1", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/4899276-heavensent1", "userReview": "The Bronze and the Brimstone is Book Two in the Verona Trilogy and is a YA Science Fiction Fantasy.The tale continues where Shamira, Hansum and Lincoln left off in the first book, The Lens and the Looker (read my review here.) still stuck in 14th century Verona without a clue as to how to return home.Along the way they, with the help of their genie Pan, meet many interesting characters who help guide them to their destiny. During their journey they bring many technological aspects to light, including the telescope and the three have to deal with the political outcome that ensues. The people of Verona have come to view Hansum in a different light and they focus their attentions on him and Hansum must learn who his true friends are. He does deeds that are underhanded and sneaky and his actions almost cost him and his friends their lives. Shamira falls in love with diastrous results and Lincoln begins to become a part of the life of Verona and finds he there are some things he is adept at doing.During their quest, each of them must struggle with themselves and those around them, will they survive the trials set before them or will their desires provide their doom?I thought this was a fitting sequel, again, author Lory S. Kaufman is able to adeptly blend history with fiction fantasy. I loved reading the historical aspects dispersed throughout the pages and thought everything blended well.I thought the turmoils and tragedies the children found themselves in to be gripping and entertaining. I wish the story didn't seem to center so much around Hansum and would've liked to have seen more of Shamira and Lincoln. I thought Hansum's actions when the townsfolk took interest to be fitting for his character.I enjoyed the town intrigue and how each of them interacted with the children and was surprised by a few of the outcomes. The plot twists and turns are enough to keep the average reader guessing and the story ending had a great finish.I would give The Bronze and the Brimstone a three and a half out of five stars. I had some issues with the \"adult\" content found within, it often flowed along juvenile lines and the romantic aspect of the story was disappointing. I also had some problems with dream sequence, it wasn't expressed in a proper manner and I was left wondering what I had just read. However, the history blending with technology is a great read and the series would be suitable for anyone who enjoys the mix."}, {"userName": "Kathleen (Kat) Smith", "userReviewDate": "Feb 27, 2012", "userURL": "http://www.goodreads.com/user/show/4328680-kathleen-kat-smith", "userReview": "For any teens who is an avid fan of both time traveling and history, this is the perfect series for you. The Bronze and The Brimstone is the second book in the series by Lory Kaufman who delighted us with the story of three teens who came from the 24th century and were sent off to a History Camp, which is a realistic location that places people into a world just like the one they would have experienced if they were sent back in time. This time the three teens Hansum, Lincoln, and Shamira have been sent to Verona, Italy back to the 14 century as a means of punishment for acting out in school.What should have been a two week punishment, the teens find themselves stuck in the 14th century for six months, and the only way they have managed to survive is thanks to Hansum smuggling in Pan, which is a virtual figure that can access anything from history, think a virtual computer figure. This is where the story begins with a brief re-telling of the synopsis from The Lens and The Looker. This is the perfect introduction to this book, especially if you haven't read the first one, so it can stand alone as it's own novel. However, once you immerse yourself in this one, you'll definitely want to go back and see where it all began.Thanks to the innovations the teens shared in the 14th century such as the telescope, the cannons and black powder, some of the rich and well-to-do will do whatever it takes to keep themselves at the top of the political ladder of success especially when Hansum and his friends have made them very powerful and wealthy as a means to survive.What makes the series so unique is the attention to detail from the historical eye, and Lory Kaufman does an exceptional job at making the 14th century Verona, Italy especially real for the readers and thus makes the book a real delight. This time the readers are in for a treat when they are reading a great story about time travel and the future and end up with a unique perspective on history as well.I received The Bronze and the Brimstone compliments of Pump Up Your Book Tours for my honest review and think that Lory Kaufman has really hit on something unique. A way to showcase the love of learning with a blend of story-telling that keeps the young reader engaged as they are learning about history. Another 5 out of 5 stars and will be looking forward to future books by Lory Kaufman in the future. He is keeping the love of learning and reading alive in his books."}, {"userName": "Rachel", "userReviewDate": "Jul 05, 2011", "userURL": "http://www.goodreads.com/user/show/2950473-rachel", "userReview": "This book is the sequel to The Lens and the Looker: Book #1 of the Verona Series (History Camp: the Verona Trilogy) and opens with the main character, Hansum, in a dream. This is actually rather confusing, as I don't realize he is dreaming until afterwards, and it seems like a poorly-timed ploy to re-introduce the reader to what has occurred so far in the series.Early in the book, Hansum is separated from his friends, but not before he manages to marry Guillietta in secret. What bugs me about this is how Guillietta's father still treats him like a child, even though he is certainly entitled to be treated as an adult by this time. Hansum exhibits a certain level of maturity that few seem to recognize or respect. Once Hansum is moved to a private estate, his story exchanges with the rest of his friends in alternating sections.The drama that occurs between Shamira and the artist is quite transparent to me. I am not sure if the author intended for the reader to discern the artist's true intentions so easily, but the artist's lack of talent combined with obvious lies and an obsessive interest in the lookers made it apparent what he was really about. I can only feel sorry for Shamira in her first foray into the realm of romance.Hansum does well at creatively avoiding an engagement to Lady Beatrice, but I had to wonder how long he would be successful at this. With Hansum's almost constant protectiveness over the genie, Pan, I also wondered how long he would really be able to keep up the ruse.With a greater focus on the technological advancements that Hansum is introducing, and less of a focus on the relationship-building of the first book in the series, this book was better written and a more enjoyable read for me. The author's evident strengths lie in his knowledge of the technology used in the series and the history of 14th-century Verona, so when those are brought to the forefront, the writing is quite intriguing. I still feel that the author is trying to do too much with this novel and trying to appeal to a too-large audience with everything from romance, history, suspense, political intrigue, and technology, to numerous science fiction themes, but it is better written than the first book in the series."}, {"userName": "Jules", "userReviewDate": "Oct 15, 2011", "userURL": "http://www.goodreads.com/user/show/3898068-jules", "userReview": "My 4 JEWEL review can be found at: One Book Shy of a Full ShelfI had the good fortune to be on the book tour for The Lens and The Looker which is the first book in this Verona Trilogy. You can read my review HERE. I was hooked and was very fortunate that I didn't have to wait for this second book to arrive as I already had it on hand. I pretty much read them back to back. It was very easy to dive right into the past with these three teens.The Bronze and The Brimstone picks up right where we left off in the first book. I did really like how the author briefly reintroduced us to the characters and their situation. It is helpful to remind the familiar reader of the storyline and could very easily pull a person who is just starting the series with this book right into the story. I am still amazed by the obviously extensive amount of research that Lory Kaufman has put into these stories. He is very detailed and thorough. I have learned a lot about Verona and the fourteenth century. I've picked up interesting information on the creation of optical lenses, gunpowder, cannons and much more. The best part is that it was enjoyable and unexpected learning that was not from a dry textbook. The characters are all growing up a bit more and are easing into their life in the Verona of the past. They each adapt to their situations and are learning to roll with the punches a bit more. The relationships they form with the people around them really reflect this move towards maturity for all three of them. While we still deal mostly with Hansum, Lincoln and Shamira are both getting more time to shine in this book. I especially enjoyed reading about Lincoln. He has grown up quickly and taken on quite a bit of responsibility.I highly recommend this story and the entire series. The Lens and the Looker and The Bronze and the Brimstone are both available NOW. Lory tells us he is working on The Loved and The Lost which will wrap up this brilliant trilogy and the story of Hansum, Shamira and Lincoln. Looking forward to this highly anticipated book!"}, {"userName": "Emi", "userReviewDate": "Jul 22, 2011", "userURL": "http://www.goodreads.com/user/show/3884495-emi", "userReview": "As far as sequels go, The Bronze and the Brimstone was a solid A. After a somewhat misleading dream sequence, the story picks up right where The Lens and the Looker left off. Hansum and the gang are still working in the shop, living the good life (or as good as life can get for three teenagers trapped in the past), making lookers for their reigning lord. But when Hansum is asked to move into the palace, he’s thrown into a world governed by political relationships, religious loyalty, and lies. While we don’t learn much more about the gang’s past lives in the future, it was nice to see them mature in the past as they work towards maintaining a comfortable lifestyle with their new family. Again, we see them accomplish this by bringing in new technology—this time, a deadly cannon with the ability to rewrite the history of war.A good chunk of the book is dedicated to experimenting and constructing the cannon. Though it sounds like the reading could get tedious, the plot moves along smoothly, with enough fiction and drama to balance the historic/scientific details. I think the majority of the credit for this can be given to Hansum’s and Gui’s clandestine relationship. Even though I still didn’t see the chemistry between them (they don’t spend a lot of time together, despite the fact that they are *spoiler alert* married), the risk of exposure increased the complexity of the relationships in the plot, and Hansum’s family was forced to constantly act like they were walking on glass.Overall, The Bronze and the Brimstone was a much better sequel than I could have hoped for. It was complex, thrilling, educational, with a cast of characters that just continues to grow on the reader until the very end. My only complaint is that the tagline on the cover of the book (“Can he get back IN TIME to save her?”) is sort of misleading…It feels like more of a spoiler for book three, not what book two is really about.For the full review, and other's like it, please visit my blog, Oktopus Ink! :)http://oktopusink.blogspot.com/2011/0..."}, {"userName": "Tara Lee", "userReviewDate": "Jan 04, 2013", "userURL": "http://www.goodreads.com/user/show/4018179-tara-lee", "userReview": "Normally I don't read books that are in a series one right after the other. Sometimes I find that I get over-saturated with the characters and the story line so I have to take a break and read a couple other books before I come back to the rest of the series. That is NOT the case with the Verona Trilogy. Not in the slightest. The Bronze and the Brimstone by Lory S. Kaufman is an amazing story. I couldn't get enough of it. It's suspenseful and thrilling and completely action-packed. The only thing I disliked was poor Gina (the donkey, not the cannon). Hansum is now the Podesta's man much to his (and Guilietta's) dismay. He's doing a good job keeping his head above water amidst all the nobility that surrounds him, but at the same time he keeps digging himself a deeper hole that he may not be able to get out of. I did find the explanation of creating salt peter and the process of making everything to do with the cannons a bit tedious and hard to stay interested in (much like the process of making the \"discs for the eyes\" in book 1) but if that was the worst thing about this book, I'll take it. Lincoln is no longer a teenage jerk, but a productive member of the medieval Italian society and an important role in the story. And I love the relationship between Shamira and Guilietta. I find it weird that Shamira was ever considered a \"hard case\" and sentenced to History Camp to begin with, but I suppose if she wasn't we would have had an entirely different story on our hands. I was extremely frustrated with the way things were playing out (in a good way though) but the end of the story just brought more twists and turns and loose ends that needed to be resolved in the third book or I'd have thrown the whole series across the room. It was sad but hopeful and I couldn't help but immediately grab book 3 to find out what happened. Again, I would absolutely recommend this novel to anybody. Especially if you're interested in Post-Dystopian fiction (or you've already read book 1). It was a phenomenal read and I just didn't want to put it down."}, {"userName": "M.M. Hudson", "userReviewDate": "Apr 15, 2014", "userURL": "http://www.goodreads.com/user/show/15155456-m-m-hudson", "userReview": "I found myself a bit bogged down in this second book. I think the focus on Hansum was too much as it took up most of the book. I thought it was unfortunate as the other two main characters are just as interesting. Also, since the theme throughout the first book was to work together, this theme was lost in the second.The ongoing romance between Hansum and Guiletta was rather goofy to me considering that this is supposed to be a young teenager. Hormones out of whack indeed! I seriously could not see this young man staying devoted to her with all the money, power, and another beauty being thrown his way. That kind of pressure would break even the strongest of the modern teens today of which he really is.The second book was once again divided into three \"books\" within the book with chapters in each. This just drove me nuts and again, I found this to be quite confusing. I am not sure why the author has chosen to write like this and I find it to be quite distracting.The author did write a good tale considering all that I have said before. I am not sure young adult girls would be all that thrilled with the military coups and glory of war, I know I wasn't. However, young adult boys would probably get into it...maybe.The author was also able to make me feel like I was right there with Hansum. I was able to relate to his feelings, his wants, his needs, his loss, his loneliness, and his utter disappointments. For that I give the author kudos.I was disappointed in the ending for this book and felt it may have been better suited in the third book. It seemed abrupt and misplaced. Since I have not read the third book yet, I will give the author the benefit of the doubt.Again, I can only give 3 stars and hope that the next book is a winner!~Naila MoonDisclosure: I was given this book for my open and honest opinion. The views expressed here are 100 % my own and may differ from yours."}, {"userName": "Michelle", "userReviewDate": "Jun 30, 2014", "userURL": "http://www.goodreads.com/user/show/5800533-michelle", "userReview": "What if you could travel back in time and introduce \"advanced technology to the 14th Century. How would that change history How would that change you?In The Bronze and the Brimstone these are the ideas that are explored in the second book in the Verona Trilogy. Airborne and I read all three of these books and what follows is our review of the books from both our point of views.Me: Overall I liked this book. What do you like best about this book?Airborne: I liked everything about this book. It had a great story, plot and I liked the re introduction of the characters from the first book, The Lens and the Looker.Me: How did you feel about the love story between Hansum ( Romero) and Guilietta? I thought it was distracting from the better storyline of the three main characters.Airborne: I felt like it was a an extensive foreshadowing of something that could turn into a major plot turn. However I may be biased because I have already read all three books so I know how all the stories fit together.Me: How did you feel about the two other time travelers (Linclon and Shamira) not having as large a role in this book as they did in the previous book? I was disappointed that they did not have as large of a part in this book as in the last.Airborne: I felt like Author was pushing away the characters as if they were not as important to the story any more.Me: What else should we talk about to give the flavor of this book?Airborne: It is very easy to visual what you are reading throughout the book.Me: Why do you feel that way?Airborne: because there is so much attention to detail. I also know alot about the time period as we have been studying it at school.Me: Do you recommend this book book for other pre teens to read this summer?I would.Airborne: Absolutely!Well there you have it. If you are looking for great books for your kids to read this summer The Bronze and the Brimstone is a must."}, {"userName": "Patty", "userReviewDate": "Jul 07, 2011", "userURL": "http://www.goodreads.com/user/show/3550357-patty", "userReview": "I reviewed the first book in this series, The Lens and the Looker and enjoyed it very much. I don't read much young adult fiction but this trilogy has a tie in to 1347 Verona, Italy, so that immediately piqued my interest.This second book continues the adventures of the three teenagers, Hansum, Shamira and Lincoln who had been sent to a History Camp to teach them about the lessons of the past so that they could use them in their post apocalyptic world. They felt they didn't need to know anything about the past - they knew it all.Hansum brought a genie with him to History Camp and the children caused so much havoc they were sent to the REAL past by a mysterious being from the future. They had to learn to live like medieval Veronans.The first book set up this second book very nicely as the boys are apprentices for the \"discs for the eyes\" maker, their Master and Shamira is the kitchen girl. They have settled in pretty well but have trouble balancing their future knowledge with their living in the past. They start introducing that knowledge to the delight of their master but it starts getting them noticed by the wrong people.At the same time Hansum, known as Romero has fallen in love with the Master's daughter Guillietta. They marry secretly but this causes even more problems for both of them.Mr. Kaufman has created a wonderful mythology that I was delighted to continue in this second book. The teenagers are learning from some mistakes but creating others and dealing with life in a time that doesn't have easy answers. They are forming relationships with these very real people in the past that make it very, very difficult to decide to return to their real world. The characters are believable - as much as they can be in a fantasy based book - and I very much want to see how it all ends in the third book."}, {"userName": "Michelle ", "userReviewDate": "Feb 06, 2012", "userURL": "http://www.goodreads.com/user/show/4253940-michelle", "userReview": "I really like this series. This book picks up right after the first one left off and it doesn't do too much re-telling. I really liked that. I sometimes get annoyed when series give way too much back story in each of the books. It is a series, people are supposed to read them in order, we don't need to be told again what happened in the last book. The Bronze and the Brimstone did a really good job of just briefly re-introducing the characters and then jumping right back into the story. I really like all the characters in the book, and I especially liked how they seemed to get more comfortable with their situation. I thought they matured a lot in the book. And I really like Hansum and Guilietta. I think they are adorable. I liked that Shamira also had a bigger role in this book, I felt like she kind of got lost amongst the shuffle in the first story and here she got her own part. The attention to detail in this trilogy is astounding! I love reading about history this way, because it really does come alive. Lory does such an amazing job of describing Verona. I think this will be such an excellent way for kids and teens to learn about history in a fun and interesting way. I think this series is good for younger teens, although anyone can enjoy it. I will admit that I thought it was a little slow at parts. Maybe that was just because I found it to be a little repetitive after reading the first book, or maybe because I have been suffering from reading ADD this past week. Even though I caught myself skimming over a few pages, I still really enjoyed the story and cannot wait to find out what is going to happen in the final installment. Be sure to check out my review of the first book, The Lens and the Looker HERE"}, {"userName": "Cheryl Christensen", "userReviewDate": "Nov 03, 2011", "userURL": "http://www.goodreads.com/user/show/2568546-cheryl-christensen", "userReview": "Having just recently read book one of this series, The Lens and the Looker, I was ready to jump right into this book. Again, Hansum and the other teens had me right there in Verona with them. In the first book we came to Verona, 14th century-style, and jumped into peasant life. We met the lens maker who became their master. Then their only way home was removed when their History Camp Counselor was found dead. Hansum secured their family’s future with the “creation” of the telescope.Book two begins with Master Della Cappa and his family of apprentices at the height of their success. Hansum, however, is just beginning his climb up the social ladder as the Podesta della Scalla takes him into his household “for his own protection.”Determined to get the Podesta’s permission to marry the lovely Guiliette, Hansum sets out to make himself indisposable to his leader. Things escalate quickly out of everyone’s control as the story progresses.I enjoyed getting to know my characters better in this book as they came into their stride, accepting more responsibility and working together. I also enjoyed getting to see the refinement of black powder making. The ever amusing Pan was insightful, comical, and full of information. I have to admit, I cried as I read the book. I am far too attached to certain characters and I felt for them as they faced the reality of war, death, betrayal, and the rest of the ugly side of life.I have truly enjoyed this book and recommend the series to young adult readers, whether they are sci-fi, futuristic, historical or romantic buffs. You will find something in this series to enjoy. I look forward to the third book anxiously."}, {"userName": "LAWonder10", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/4300103-lawonder10", "userReview": "The adventures and action continues in this sequel of the Verona Trilogy! Hansum continues to flourish and prosper, always remembering his adopted family - the della Cappa's -, his beloved Guilietta, & his trusted friends - Shamira, Lincoln, and , of course Pan. The Princess Beatrice is a complication. Hansum becomes more confident and less reliant on Pan. Will this self-reliance become his undoing? Will his plan to win the Podesta's acceptance of Guilietta as his betrothed instead of Beatrice?In this sequel of the Verona Trilogy, Hansum's well-thought-out plans explodes into an unexpected \"hitch\". New twists evolve and life takes some bitter-sweet shifts in direction.The reader's interest is captivated throughout the book. However, there is brief profanity and there is a large portion of very graphic violence. definitely not recommended for younger teens.The characters are created and sustained very well. They really \"come to life\". The action and surrounding scenes are very descriptive and vivid. The title is very fitting and the eye-catching book cover becomes very apparent part way through the book.I just cannot give this book a five stars review rating with the intense violence and the occasional use of bad language. I, therefore, continue rating this with a Four Stars rating.*This book was sent too me in exchange for an honest review, of which I have given."}, {"userName": "Theresa", "userReviewDate": "Dec 31, 2011", "userURL": "http://www.goodreads.com/user/show/6756765-theresa", "userReview": "I won this book from Goodreads/First ReadsI won this book on Goodreads/First ReadsThe Bronze and the Brimstoneby: Lory S KaufmanThis is a time travel book that travels back to the 14th century from the 24th century. This is book 2 of the Verona Trilogy.The 3 teens (Hansum, Shamira and Lincoln) travel in time by help from a genie. These are called History Camps. During their quest there are struggles with each other and themselves. They are trapped in the 14th century when the History Camp Counselor is found dead.This book is set up in three parts. Part one is a kind of summery of the first book in the series but is really isn't very long (this was good for me since I started with book 2). Part two is the real body of this book. The author seemed to put a lot of research into the history of the book and really has a great way of making it interesting to read. You get a real sense of what it might be like back then. There are lots of twists and turns to keep things interesting. Part three sums it up for us and ties it up a couple of loose ends.There is alot to look forward to in this book and it covers a wide range such as politics, religion, science, romance, lies and death. This is a great adventure and I applaude author Lory S. Kaufman for his way of blending the past with the future. He really makes it interesting."}], "description": "What could go wrong in the 14th-century  for three time-traveling teens? How about – EVERYTHING!Hansum, Shamira and Lincoln, three teens from the 24th-century, are trapped in 14th-century Verona, Italy. They’ve survived many deadly experiences by keeping their wits about them and by introducing futuristic technology into the past. Principal among these inventions is the telescope, which brought them to the attention to the rich and powerful.But standing out can get you into unexpected and dangerous situations. The nobles of Verona now believe Hansum is a savant, a genius inventor, especially after he brings them plans for advanced cannons and black powder. Being the center of attention is great, but the potential for trouble is now exponentially greater because people are watching Hansum’s every move.Meanwhile, artistic genius Shamira has fallen for a Florentine artist with bloody and disasterous consequences. Lincoln, considered an incompetent back home in the 24th-century, has blossomed – at least until he’s shot in the head with an arrow. And Hansum, after secretly marrying his new master’s beautiful daughter, Guilietta, is offered the hand in marriage of lady Beatrice, daughter of the ruler of Verona. To refuse could mean calamity for all the teens.Amazingly, none of this is their biggest challenge. Because a rash illness is spreading across Verona – and it is threatening to consume everyone. Do they have a future in this past?***To read an excerpt for The Bronze and the BrimstoneClick the following link: http://www.history-camp.com/?page_id=39", "title": "The Bronze and the Brimstone\n      \n          (The Verona Trilogy #2)", "url": "http://www.goodreads.com/book/show/17332517-the-bronze-and-the-brimstone", "average": 3.89, "cover": "https://images.gr-assets.com/books/1360008080l/17332517.jpg", "reviews": 56, "authors": [{"url": "https://www.goodreads.com/author/show/4509645.Lory_S_Kaufman", "name": "Lory S. Kaufman"}], "type": ["Young Adult", "Science Fiction", "Science Fiction", "Fantasy", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/17332517-the-bronze-and-the-brimstone", "http://www.goodreads.com/book/show/11283823-the-bronze-and-the-brimstone", "http://www.goodreads.com/book/show/9904384-the-lens-and-the-looker", "http://www.goodreads.com/book/show/16278139-the-loved-and-the-lost"]}