{"ratings": 366, "userreviews": [{"userName": "Elise (TheBookishActress)", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/52545435-elise-thebookishactress", "userReview": "The Breathless left me... breathless. Because of the annoyed sighing. So this is... how can I put it... an emotional suspense novel that is not very emotional or suspenseful. Or tense. And sort of boring. And there was a love triangle between two guys who were into the lead's dead sister. It was a mess. Let's talk. I think the lack of suspense is partially the writing style - which is somewhat dull and turns otherwise creepy scenes dull and boring - but also just the complete lack of interesting horror. The book mentions dead horse bones and snake skins and whispering names but that... isn't really creepy, on its own. At least not to me. A not-very-creepy book can always be remedied with good characters, but none of the characters here are morally ambiguous - okay, yeah, that's just me - or intriguing. Not to be harsh, but honestly, not a single character in this book is compelling. Most don't even have personalities. I'm not sure I can name a single one of Mae's solid traits. And then there is - yeah, I know - the love triangle. And it is a bad one. Dead sister's ex-boyfriend who probably murdered her vs. a guy who had a crush on her sister. Just to make this clear: both of the guys were into the protagonist's dead sister. Fucking Cage is attracted to Mae because she looks like her dead sister. Listen, I think this is maybe supposed to be some deep message about loss, but in reality, it's fucking creepy. Why did no editor read that and cross it off with the annotation \"what the fuck\"?Besides all the structural issues, there are some general tonal issues; for example, those changing tenses changing tenses are probably supposed to be a literary device, but it honestly just feels sloppy. The author uses present tense for flashbacks and past tense for what's happening right now, and it sounds like a cool idea, but on page, it comes off dissonant and annoying. Dissonant tone and a book that just doesn't seem to fit together is the result. There was also a major issue I had with Magical Creepy Voodoo characters that I read as really badly stereotyped slaves in the 1860s and a full year later, I am exceptionally confused as to what the canon of the book actually is. Perhaps I misread the book, and I've been informed that things may have changed from the arc version? Nonetheless, however, the book:✔ takes place on a Southern plantation✔ has an editor's note focusing a lot on celebrating heritage, but seemed to me to be celebrating... plantation heritage? ✔ has very little diversity✔ made me feel really, really uncomfortableCalling out a book I literally did not finish strikes me as vaguely slimy, and yeah, this could have been totally remedied and subverted in the second half of this book, but it's worth the consideration if you have read this.An all-around badly executed and uncomfortable book. Blog | Goodreads | Twitter | Youtube"}, {"userName": "Katie Nelson", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/2402228-katie-nelson", "userReview": "A page turning, gothic mystery!Mae's sister Ro mysteriously died, and life has been hard for her family ever since. Her father is obsessed with finding Cage, her sister's boyfriend who disappeared the night of her death, but comes back almost a year later with no memory of the events. Ro doesn't want to help, but she desperately needs answers and with the help of Cage, and a little green book full of family secrets, she just might uncover the truth.This book was atmospheric and suspenseful and full of gorgeous writing that made me keep turning pages late into the night. The southern setting felt oppressively hot and dark, but so real. The mystery unfolds skillfully, with a combination of present day and past family secrets, but the real heart of the novel was the strong relationships between the sisters and their fierce love for family. The ending was masterfully done, and as soon as I read it, I went back to the beginning to re-read several parts. It's the kind of book you want to pass to all your friends, just so you can have someone to talk to about the book. I can't wait to see what comes next from this talented author!"}, {"userName": "Candace Robinson", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/33995641-candace-robinson", "userReview": "I normally don't mind a few unanswered questions because I hate when books are tied in pretty pink bows. Buttttt there was some pretty important stuff that had zero answers! I'll get to that later under spoilers! As for characters I absolutely thought Mae and Cage were the perfect POV duo. I loved them both! As for the rest of the characters... I was annoyed and thought Ro was self centered and not sure why everyone was obsessed with her! Lance came off as a creep from page one. Dad—Sonny should have been more of a dad to the twins, yes, his other daughter died, but come on!The writing was great and the atmosphere was perfect. I'm also not sure what people are talking about with the racist stuff because I didn't see it. I mean, I'm getting sick of this crap. Just let the author write what the hell they want! If you don't want to read it, then don't read it! I also did like the ending, butttttt there's a reason why I didn't, which I'll say more about below. Also just want to point out how awesome Mae! And the witchcraft was pretty dang cool, especially with it being all warm to the touch.Spoiler Time! So you may want to stop reading now!What the crap was the deal with Mae's twin trying to look and act like Ro in the scene with Lance? That was never answered. Also what about Mae meeting Cage first?? Did she like him before Ro started dating him? What happened with Hanna after she was brought back? Why was Cage's head hurting all the time? Why did Ro even like hanging out with Lance? Why was there so much build up between Mae and Cage... I felt like he was starting to like her... but then he dies at the end because Mae burns the book, and he wakes in the afterlife with Ro waiting for him. This is the aspect I would have absolutely loved if their romance had really seemed epic. If she had been Mae, I would have been like yessssssssssss, but I was like nooooooo. Also why did he even die when Mae burned the book? I assumed he was born from Lucky who was born before Hanna died and came back to life, so that doesn't make sense."}, {"userName": "Melanie Thompson", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/36685874-melanie-thompson", "userReview": "Mae's life changes when her older sister dies mysteriously. Her father is obsessed with finding the boy he believes to be her killer while Mae and her twin sister live in the shadow of Ro's death. The discovery of a secret family journal sends Mae into a dark series of revelations and life-changing events. This Southern Gothic tale twists and turns and ultimately surprises with a page turning thrill. Magic and mystery imbue the pages with a delicious, heart-pounding suspense. YA readers who like dark stories will enjoy this story."}, {"userName": "Sandra Mather", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/50240950-sandra-mather", "userReview": "This atmospheric Southern tale weaves a mysterious spell where the past lives on and affects the present. The redolence of dark magic hangs as heavily in the air as the fragrance of the coastal waters or the night-blooming jasmine. In the tradition of Anne Rice, this book will enchant you."}, {"userName": "Suzanne", "userReviewDate": "Aug 11, 2016", "userURL": "http://www.goodreads.com/user/show/58564131-suzanne", "userReview": "Obviously I have not read the book yet but I heard about it from those in \"the know\" and I am eager to read it! I like mysteries and this sounds like an intriguing one with several unexpected twists. Looking forward to its release!"}, {"userName": "Eve Recinella (Between The Bookends)", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/921083-eve-recinella-between-the-bookends", "userReview": "[raised by someone after his accident on his motorcycle. I mean the clues all lead in that direction. He pops back up after a year (coincidently right before the time passes for raising someone expires). He has all the signs of someone who has been risen. Then when Mae burned the book, it released him. But who raised him? If he died then were was his body for the entire year? What happened to him? Is my thinking even correct? Was he even raised?? (hide spoiler)]"}, {"userName": "Karen McManus", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/54373475-karen-mcmanus", "userReview": "This is a darkly beautiful book, imbued with echos of the past in its lush Southern setting. Mae Cole is still living in the shadow of her golden sister Ro, almost a year after Ro died. When Ro's former boyfriend knocks on the door of their historic home with no memory of the past year, his return sets off a haunting, magical mystery. I tore through this book, especially as I got toward the end, and I never saw the last few pages coming. Tara Goedjen writes gorgeously and weaves a suspenseful tale of secrets, obsession, and love."}, {"userName": "Brina (5171MilesBooks)", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/36574273-brina-5171milesbooks", "userReview": "3 StarsReviewed on: 5171 Miles Book BlogThe first thing that made me look into this book a little further was the stunning cover. The deep purple colors at the edge merging into black, and the girl in the write dress along with the white, fading writing were haunting and beautiful at the same time. When the description stated that The Breathless was \"for fans of the dark family secrets of We Were Liars\" I was sold.When Roxanne Cole died on the beach, her boyfriend, Cage, was with her. He is also the only one who knows what really happend that night. But before anyone could ask him about it, he took off and hasn't been seen since. Almost a year to the day of her death, Cage returns and knocks on the door of Blue Gate Manor and asks where Ro is. He claims that he has no memory of the past 12 months and no one but Ro's younger sister, Mae, believes him. Then Mae discovers a green book which contains dangerous secret about her family and Ro. If what it says is true, then maybe, just maybe, Ro isn’t lost forever. And maybe there are secrets better left to the dead.The book started off really interesting and set the mood for what was to come in the upcoming chapters. Throughout the story there were actually some really creepy scenes and I was thinking \"Thank goodness it's broad daylight and not the middle of the night!\" I'm a little chicken when it comes to horror movies or creepy stories. Okay, I am a big chicken. Anyways, although some scenes were scary, it's not that those will keep you awake a night, so don't worry about that.Unfortunately, the story was really slow-paced and dragged after a while and I had difficulty picking it up. I also would've loved a little more suspense.What I didn't expect was the dark magic in this story, the dark magic from the deep south. I was positively surprised and it was really interesting to read about. However, in my opinion the story was missing proper explanations regarding the dark magic, which led to confusion on my part. I didn't mind the lack of explanation in the middle of the book too much because I knew everything would be explained in the end. Unfortunately, nothing remotely happened. I still have comprehension questions and I don't like having those after finishing a book. The Breathless has no follow up story, it's a full-length standalone novel and this is why I, as a reader, want every question to be answered by the end of the book.The story is told in a third person narrative and alternates between Cage's and Mae's POV. I also noticed that Tara Goedjen used the first person narrative in a couple of scenes throughout the story. I am still a little confused why she did that, and this is only one of the many questions I still have regarding the story.What I really enjoyed, however, were the flashbacks to the time of Ro's ancestors in the mid-eighteen hundreds. It gave the story an even more haunting feeling.An issue that was brought up by a few readers was the issue of racism. Their reviews stated that a few scenes in this book were racist and shouldn't have been written by the author. I was actually surprised to find those comments in the reviews since I didn't find any scenes racist whatsoever.Tara Goedjen's debut novel is original and has huge potential, but unfortunately, this potential wasn't explored to the fullest. However, The Breathless is still an interesting and solid read.If you want to know what happened to Ro, and what Cage and Mae have planned with the green book, check out The Breathless yourself. It is a horror, gothic YA and releases on October 10th! Pre-order your copy with the links below.**********I'm really confused. I really don't know what I just read... I'll try to gather my thoughts and I'll hopefully come up with a decent review for this."}, {"userName": "Caroline Graham", "userReviewDate": "May 12, 2017", "userURL": "http://www.goodreads.com/user/show/58439674-caroline-graham", "userReview": "The Breathless is a gorgeous, atmospheric mystery that skilfully captures the gothic South. Goedjen’s world is rich, dark and full of intrigue and it is populated with characters that are as strange as they are compelling. The book’s central mystery is the death of Roxanne (Ro) Cole and the wake of grief and suspicion she leaves behind, but the narrative reaches so much deeper than this. It explores the boundaries between life and death, the complicated threads that bind a family together and, through its equal-parts damaged and hopeful characters, what it takes to unearth the past and face the truth. This is a dark, suspenseful narrative that is as smart as it is heartfelt and complex—it’s beautifully written to boot. I loved it!"}, {"userName": "InkedBookDragon", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/68953824-inkedbookdragon", "userReview": "https://inkedbookdragon.blogspot.comThis book completely slipped by me. I am usually pretty on top of book releases. I like to know what books are coming and when they come out. I missed this one and had no idea of its existence until I was sent a copy. I took one look at it and thought that it looked pretty interesting. The cover was eerily beautiful so I figured that I would give the book a try.Wow! How can this be a debut novel? It definitely does not feel like one. The premise was excellent and the execution was near flawless. I was captivated within the first couple pages. The characters were so rich and multilayered. Nothing can put me off of a book quicker than characters that do not evolve at all. We tend to evolve and adapt to the world around us. It is refreshing when I read about characters that truly progress. Stagnant characterizations annoy me so much.This novel was one of those that I had to fight with myself about sleeping because I did not want to stop reading. Creepy yet lovely. Complicated. Full of suspense. Sad yet fun. Romantic and heartbreaking. A truly enchanting read.I received a copy of this book in exchange for an honest review. I am rating this book Four Stars because it did have occasional moments here and there that were predictable. With that being said, it was a true delight to read. I will be recommending it. InkedBookDragon"}, {"userName": "Amanda Searcy", "userReviewDate": "Jun 03, 2017", "userURL": "http://www.goodreads.com/user/show/11485801-amanda-searcy", "userReview": "Keep the lights on! This story is engrossing, suspenseful, and complex. I loved the setting and how it jumps back and forth between time periods. There are secrets at every turn, and a young woman who is trying to figure it all out while dealing with her grief and helping a friend. A one-sitting read and a great mystery! Perfect for fans of Beautiful Creatures!"}, {"userName": "Risa", "userReviewDate": "Aug 23, 2016", "userURL": "http://www.goodreads.com/user/show/46912016-risa", "userReview": "This author has a gift for painting a picture of a scene and inviting the reader right into it. Her descriptions were mesmerizing to say the least, and I could hardly put the book down. I read 2 teen reviews claiming the book is racist but those reviews were based on the ARC copy. In the new October release I saw no grounds for that accusation. The characters that the reviewer claims are black are described on page 30 as having \"the palest skin Grady has ever seen.\" Any hint of racial issues have been completely erased from the story line in the edition I read. The plot twists left me guessing, turning pages back to see what I'd missed, and still wondering at the end. Looking forward to more from this new author. A note, I didn't sleep very well after I started this book. If you're the jumpy type, read it during the day! Waiting for some of my friends to read it so we can discuss some of the plot twists!"}, {"userName": "Rachael", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/24240418-rachael", "userReview": "If I could sum up how I feel about this book in one word it would be: ugggggggggggggghhhhhh. I don't even want to go into all the reasons why I didn't like The Breathless but you know what, I'm going to anyway. I don't know if it's because I'm in a reading slump right now, but a lot of things in this book pissed me off to varying degrees. I'll list them in order of least pissed to most pissed:5. The way it changed tenses so often was weird, and it felt less like a cool unique thing and more like the editor hadn't noticed the mistakes. I noticed it enough for it to turn me off on this book pretty early. 4. It wasn't scary at all. I personally think it's quite difficult to write a high-quality horror novel and this one didn't make the cut. If anyone is reading this and is left wanting more in the scariness factor, I would definitely recommend Of Metal and Wishes by Sarah Fine instead. 3. The characters. Where do I start. \"Her green eyes have a hint of gold, and she is a pretty thing.\"  what who why. The main character was an angsty Mary Sue. I really wanted to feel sad that her sister died, but the book did  nothing  to elicit a sympathetic response from the reader.2. The love triangle was just...really weird. Both of the guys were still obsessed with her dead sister, and I guess they thought if they couldn't have her they would settle for her little sister instead? But the thing that irked me the most about it is that Mae was totally fine with that?! Maybe I just didn't read enough of it but half the time I was annoyed by it and the other half I was like \"girl! love yourself!!\"1. The thing that pissed me off the most in this freaking book is the subtle (and sometimes not so subtle,) racism. I made the mistake of reading the editor's note before I started the book, and learned that this rich white family lives in a family plantation home in the deep South. Not only that, the entire note had a \"heritage not hate\" vibe. That made me want to already not read it, but I decided to give it a go anyway because, hey, maybe that was just the editor. It wasn't.  The Breathless  reminded me of  The Crucible, but not in a good way. There was voodoo and it really rubbed me the wrong way, and the point is there was very little diversity in this book, and the actions of the questionable/problematic protagonists were never addressed or challenged in any way. And it needs to be challenged. I have spent too much of my life unaware of my own privilege to let prejudicial books like this fly under the radar, unchallenged. So, yeah. I would not recommend this book to anyone, really. There are so many better horror books out there with better diversity, better characters, better everything.Should be mentioned that all my opinions are taken from an ARC copy."}, {"userName": "Nia •ShadesOfPaper•", "userReviewDate": "Jun 30, 2017", "userURL": "http://www.goodreads.com/user/show/31186192-nia-shadesofpaper", "userReview": "You can find this review and others on my blog http://www.shades0fpaper.wordpress.com \n“But a single flame is not enough to hold back the world’s darkness. […] Though when a light goes out, it can be raised again. You just need a book that is like a box of matches.”\nOkay, this was a roller coaster of a book. The Breathless was one of my most anticipated books of this year (I know I have a TON of anticipated books), so I was beyond happy when I got an ARC of it and picked it up. I completely forgot about the synopsis by the time I recieved the ARC, I just only knew that it was like a mystery/paranormal book. Now I’m a chicken when it comes to horror. I don’t like it. I get so paranoid it’s not healthy so when I started the story, I was scared, guys. Because it seemed like horror to me.Fortunately, it wasn’t. Or at least it didn’t scare the hell out of me. It was creepy, don’t get me wrong, and there were times when it was a bit scary, but nothing that made me DNFed it. It was more the atmosphere and the setting, I think. So I would say if you’re like me and want to read it but are nervous that maybe this book is going to be to scary, don’t panic, It’s not. It’s more mystery than horror. Which was perfect to me.\n“Neither girl realizes the life is both good and bad, dark and light… the way it has been since the beginning of time. Neither of them can see the shadows swirling around them, hovering close, because shadows are drawn to the light.”\nSaying that I was confused while reading this book was an understatement. I didn’t know what was going on, or what those characters had to do with the story, It had three POVs, two of them set in present time and told by Mae and Cage, Ro’s sister and boyfriend, and the other was set in 1958 and was told by Grady Cole I. So yeah, I was hella confused and didn’t know the connection between those characters or why I was reading from a perspective that wasn’t in the present time. But… I kinda liked being that confused. Because I got to know all the whys.I had mixed feelings about those characters, tho. I really liked that our protagonist, Mae was an artist and loved to draw. I don’t usually read stories about artists, so I didd enjoy it so much and I empathised more with her. I would have loved to see more scenes of Mae creating or drawing, but I guess it’s a personal preference.I’m still not sure what to think about the other characters. I liked the part that happened in the past, because I feel I got to see more about the roots of that family and the problems they had (their lives were a drama show, let me tell you), but Cage was such a weird character I still don’t know if I like him or not. There were certain scenes that occured that made me cringe and not in a good way. They made no sense to me (well, maybe they do now) and it was a turn off to me.\n“She wasn’t a girl who touched or let you touch her. Like an animal that way, like water that slipped through your fingers.”\nI really liked the ending. It was a bit twisted and dark, but still it was a happy one, given the nature of the story. It was different, and a bit unexpected. There was something I would’ve liked to have an answer to, though. It was something not really important or meaningful to the story, but I still would have liked to know the why.Overall I found it quite fast and addicting, maybe because of the mystery fact that the story had. I, of couse predicted a couple of things before they actually happened (I’m not surprised), but still I had a good time and enjoyed the Halloween-y atmosphere and the plot. And all that family drama.Actual ranting: 3.75 ⭐️"}, {"userName": "Claire (bookscoffeeandrepeat)", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/4541562-claire-bookscoffeeandrepeat", "userReview": "Actual Review\nI was curious about this book because of the mixed reviews it’s been getting. The Breathless is a gothic novel told in multiple perspectives. I like the author’s writing even if it was weird. It was written in different tenses. Also, it was as if the POVs were told in 3rd person by an omniscient narrator, not the characters themselves. The constant use of “you” and “we” left me baffled. It seemed like the author wanted a narrator for her book who knew what was going to happen and the reader had to stick around to find out. Another thing I liked is the atmosphere set in the story. The author’s descriptive writing helped create the the “weird and eerie small town” vibe. Even if I like thriller/mystery novels, I wasn’t prepared for this book. To me, I could care less about the characters, hence it was difficult for me to keep reading the story. Simply because the romance was appalling. Once I knew about the romance, it reminded me of the problem I had with The Sky Is Everywhere. Immediately, I thought this book was offensive. It’s offensive (when the context is considered) because of the premise in the story. Like I said, I wasn’t invested in the characters despite the creepy vibes I’m getting from the book. What I dislike in the story is the issue on racism as it was something I did not expect. It reminded me a bit of American Horror Story: Coven and a little bit of The Crucible (emphasizing Tituba’s role). The settings in the book reminded me of the 1800s setting in The Vampire Diaries tv show. Coincidentally, there’s a witch named Pearl in the show.The racism wasn’t explicitly stated but it was sort of implied. I’d rather let the *new* readers judge the book for themselves. I just wasn’t sure what the point was, or if there was actually a point at all to begin with. I just wanted to a fast-paced book that I might enjoy. I like to read horror stories that can feel so eerie at times, but this one is sadly a miss for me.**I received this book from Blogging for Books in exchange for an honest review. AND for this review and more, visit my book blog.xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxI'm still trying to formulate my thoughts on this one. Not sure if I'm going to finish this book. I mean, it was an easy to read BUT it wasn't a favorite.Part I: The writingPart II: The magic systemUhm, full RTC. Leaving this tentative rating & review."}, {"userName": "Rebecca", "userReviewDate": "Jul 15, 2017", "userURL": "http://www.goodreads.com/user/show/3376970-rebecca", "userReview": "Wow!!! Super fun, atmospheric southern gothic -- where has this been all my life?! Make sure to pick this up when it releases in October!"}, {"userName": "Danielle Steenrod", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/22697403-danielle-steenrod", "userReview": "“That was the thing about life–people always assumed there’d be more time. More time to say hello, more time to say I love you. More time to say I’m sorry. Until there wasn’t.”-Tara Goedjen, The BreathlessWhen Mae’s sister Ro dies an unexpected death, her world is thrown upside down. No one knows how she died or who did it, if she was even murdered. The only person that was with Ro at the time of her death was her boyfriend, Cage. What is even more suspicious, is that he took off just after her death and hasn’t been seen for a year. Is he guilty? Did he kill Ro? If not, why did he run?The book is told in rotating point of views between Mae and Cage, with the inclusion of flashbacks. These were my favorite chapters of the book! The flashbacks were of Mae and Ro’s ancestors from the 1800s. I feel these chapters really added to the plot and helped form a cohesive narrative, explaining things that we otherwise wouldn’t understand.Mae stumbles across a journal of her sister Ro’s one day while in Ro’s room. She hopes to learn more about Ro by reading her journal. She gets more than she bargained for when she learns that it is a book of dark magic that has been passed down her family line. She even comes across a spell for resurrecting the dead. Would you bring back your loved one, knowing there is a cost? I really enjoyed this addition of the dark magic to the story. It added to the mysteriousness.I was a bit confused what some of the things in the journal meant. I don’t think everything got completely explained and I still have some questions that didn’t get answered. I wish the book had explained everything just a bit more thoroughly.Overall, I think this was a good read for the Halloween season. This story includes ghosts, mysterious deaths, resurrection rituals, and dark magic. I rate this book 3 out of 5 stars!Thank you to NetGalley, the publisher, and Tara Goedjen for an advanced copy of this book in return for an honest review."}, {"userName": "Charles", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/1014029-charles", "userReview": "The thrills unfurl with delicious languor right from the first page of Tara Goedjen’s debut novel, The Breathless.Tara draws on her teenage years in Alabama to conjure a murder-thriller infused with the miasma and mystery of the Deep South.The tragic and unexplained death of teen Roxanne Cole, discovered on a beach one year ago, still baffles the community and her grieving family.Most assume that her boyfriend, long since vanished, committed the crime.Yet when Cage turns up to Blue Gate Manor looking for her, with no memory of the past 12 months, it sets off a riveting, spellbinding gothic turn of events that stretch across generations.Cage teams up with Ro’s sister Mae to unravel what really happened on that beach – as well as parse the secrets of Roxanne’s little green book.Why was Ro obsessed with something called “the Raising Ritual”? What is her grandfather hiding? And will Mae and Cage discover that the quickest way to get over something is to have something even worse happen?Once you’re engrossed in the mystery you won’t be able to put The Breathless down. Great plot, great characters, great dialogue – Goedjen nails it all.For my money, The Breathless is just as readable for Young Adults as it is for adults at large.Love the cover too!Can’t wait for more for this exciting new writer."}, {"userName": "Jessica Taylor", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/5618768-jessica-taylor", "userReview": "One of the best debut novels I’ve ever read! THE BREATHLESS is a complicated tale exploring sisters, family, and loving those who hurt us the most. The non-linear storytelling kept me flipping pages as both storylines were equally compelling. Set in a crumbling mansion deep in the woods of Alabama, the setting is beautiful and at the same time truly frightening. Mae is a strong character and Cage is a dreamy love interest. The suspense had me reading late into the night - with all the lights on. I love an atmospheric gothic mystery and this gorgeous debut delivers on everything it promises!"}, {"userName": "Jennifer", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/41489278-jennifer", "userReview": "I got an ARC back in the end of April at a book festival. I was instantly excited because I love books that take place in the south and deal with the creepy magical history. This book did not let me down. The setting of Blue Gate was perfect for this kind of story. I loved the storyline and the ending. The only downside was some of it was predictable."}, {"userName": "Shady Cosgrove", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/16942490-shady-cosgrove", "userReview": "I LOVED this book. I'm not usually a young adult reader but the pacing and characterisation was just great. The gothic setting was haunting and with all of the twists and turns I found myself rushing through my day to get back to reading. I'd DEFINITELY recommend this. Read it!"}, {"userName": "Jennifer", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/4854607-jennifer", "userReview": "Received advanced reader copy from publisher via Baker & Taylor book supplierI was set for a creep-me-out read and it never got my skin crawling. The setting was pretty awesome (old, historic mansion in the Deep South surrounded by woods) but the characters never made it past superficial and the rituals that should have scared the you-know-what out of me didn’t even make me blink. An unsurprising ending just settled the book into “ok” territory.Other Goodreads reviewers saw racism in this book that I didn’t see. I saw a frank mention of “slave cabins” but didn’t think twice about it because of the setting. I never saw anything except white characters, some of who did magic (the word “voodoo” was never uttered in the book). It was never stated or inferred that the magic was being done by slaves or blacks. No mention was made of race and I, rightly or wrongly, assumed that all the characters were white. I would say “read it for yourself to see” but I just don’t feel comfortable urging folks to give precious reading time to this book that didn’t even excite me."}, {"userName": "Susan Sherman", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/4299548-susan-sherman", "userReview": "Lock your doors. Turn off your phone. For heaven’s sake don’t start this book late at night. You’ll be up ‘til dawn. Tara Goedjen’s debut novel The Breathless is bound to keep you in that state. It has everything: a crumbling mansion deep in the Alabama woods; a tragic death haunting this family; a mystery itching to be solved; a book of spells; a witch or two, and even an old man in the attic who knows a lot, but can’t speak. In Goedjen’s capable hands we move deftly from Mae Cole, a complicated protagonist struggling to come to terms with her sister’s Roxanne’s death, to Cage Shaw, Roxanne’s boyfriend, accused of her death, to a trek back in time to the dark beginnings of the Cole family and the mystery that haunts their family seat at Blue Gate. With its gothic tone, engaging characters and deft pacing, this debut novel displays a new talent bound to thrill and entertain us for many books to come. I look forward to them all."}, {"userName": "Jen Ryland", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/6497049-jen-ryland", "userReview": "The Breathless is interesting and atmospheric. It's not an in-your-face, page-turning kind of book, but the kind of book that slowly weaves its spell over you.Mae's sister Ro died almost a year ago and everyone thinks that Ro's boyfriend, Cage, killed her. But things aren't that simple. Mae finds a little green book that belonged to her sister and begins to unravel a twisted tale of family secrets that goes back generations.I love all things Gothic and I'd call this Southern Gothic. This book was creepy and atmospheric! You'll need some patience for this one but I think the payoff is ultimately worth it!Read more of my reviews on JenRyland.com or check out my Bookstagram!I received a free advance copy of this book from the publisher for possible review."}, {"userName": "Jessica", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/4844580-jessica", "userReview": "I must say, I have strayed away from YA lately because I can't seem to connect with the characters. When I read the synopsis for this mystery/thriller, though, I was so intrigued and had to take a chance on it. When Ro Cole died, no one knows who did it or why she was murdered. All they know is that her boyfriend, Cage, disappeared the day she died and hasn't been seen since. Everyone speculates that Cage did it, but no one has heard from him in over a year. Until now. Cage wakes up in the hospital with no recollection of the past year. When Cage runs into Mae, Ro's sister, he's adamant that he last saw Ro alive. Mae doesn't want to believe him, but she found a strange green book that makes Ro's death more mysterious than ever. What really happened to Ro that night and will Mae uncover her big sister's secrets, or will she be left with even more questions than before? I've got to say, this book was hard to get into when I first started it. The point of view is third person, but it jumps between different characters in the present and then new characters in the past. It was hard to feel attached to any character and it was really hard to keep track of who was who and what was going on. Once I got into the story, it was a little easier to follow. I only really felt engaged when Cage finally showed up not knowing what had happened over the past year. While this book was marketed as a suspense, the story felt very lackluster while I reading it. I wasn't scared or horrified or thrilled, but I didn't hate the story. I think some of the scenes that were supposed to be scary were just normal scenes to me that didn't do anything. It wasn't a horrible read, but nothing made me react strongly. I think that mostly had to do with how slow the pace of the book was and how long it took for anything remotely \"scary\" to even happen. Overall, this one isn't as thrilling or scary as I hoped it would be. The author's writing style made it hard to connect or care about the characters and the slow pace made the thrilling moments not so thrilling. While this wasn't a bad read, it was hard to find the motivation to pick it up since I wasn't loving it like I wanted to."}, {"userName": "YA Wednesdays", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/45765880-ya-wednesdays", "userReview": "Find the full review on the blog.The Breathless is a non-linear Gothic horror told in multiple points of view, steeped in creepy houses, spirits, love, loss, sisterhood. And...that's the best thing I can say about this book. It just wasn't for me.For the rest of my review, click on this link."}, {"userName": "Dena (Batch of Books)", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/4940696-dena-batch-of-books", "userReview": "I think I loved it? I have some left over questions that didn't get answered which is SO frustrating. Full review to come."}, {"userName": "Shelly King", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/1002455-shelly-king", "userReview": "Don't you just love a book with a dark family secret? I do! This book is full of atmosphere, plot twists, and characters who pull at your heart. This book will keep you on the edge of your seat and wanting more. Read it. Just read it."}, {"userName": "Joel", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/4832951-joel", "userReview": "This was such an enjoyable read. The dark, twisted southern gothic atmosphere is layered with contemporary touches and real people problems - an alcoholic father, a grandfather dealing with a stroke, sisters growing apart. It's also a meditation on grief and loss and the meaning of death. But more than any of that it's just a fun read. The plot was extremely twisty. I'm usually pretty good at predicting the endings of books, but this kept me guessing almost until the last page, and I'm still thinking through some of the twists days later. Highly recommend giving it a read if it even slightly sounds like your cup of tea."}], "description": "No one knows what really happened on the beach where Roxanne Cole’s body was found, but her boyfriend, Cage, took off that night and hasn’t been seen since. Until now. One year—almost to the day—from Ro’s death, when he knocks on the door of Blue Gate Manor and asks where she is.Cage has no memory of the past twelve months. According to him, Ro was alive only the day before. Ro’s sister Mae wouldn’t believe him, except that something’s not right. Nothing’s been right in the house since Ro died.And then Mae finds the little green book. The one hidden in Ro’s room. It’s filled with secrets—dangerous secrets—about her family, and about Ro. And if what it says is true, then maybe, just maybe, Ro isn’t lost forever.And maybe there are secrets better left to the dead.", "title": "The Breathless", "url": "http://www.goodreads.com/book/show/29543144-the-breathless", "average": 3.3, "cover": "https://images.gr-assets.com/books/1485357095l/29543144.jpg", "reviews": 152, "authors": [{"url": "https://www.goodreads.com/author/show/15093146.Tara_Goedjen", "name": "Tara Goedjen"}], "type": ["Young Adult", "Mystery", "Horror", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/29543144-the-breathless", "http://www.goodreads.com/book/show/34568286-the-breathless"]}