{"ratings": 5356, "userreviews": [{"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "Set in the 1930's this book is told from the viewpoint of an elderly man looking back at a time in his life. Harry grew up in East Texas along the Sabine River area. An area where more is picked up at the local store than groceries. \nHarry and his sister Tom find the body of a black woman who had been mutilated and tied up with barbed wire. His father Jacob is the constable/barber/farmer in the town and he takes the body to the black section to have a black doctor have a look to see what happened. This unleashes racial tension in the area because the black people don't want trouble stirred up and some of the white people don't care if a black woman is dead. Then more bodies start turning up. Lansdale brings this to life much better than my piddly review but I wanted to just get the basics across.  Harry was that curious boy who believed and had seen the legendary \"Goat Man\" following he and his sister in those woods.\nHis dad Jacob reminded me of Atticus Finch in \"To Kill a Mockingbird\" He stood up for what he thought was right no matter what. There is a lynching scene in the book that I had nightmares about after reading this last night. (trigger warning for some of you) Then there is Grandma: I want to be her when I grow up.\"I love and miss Grandpa, but I'm glad he's dead.\"\"Don't say that!\" Mama said.\"Was he in a lot of pain?\" Daddy asked.\"No. No. Thank goodness for that. But he took to singin' gospel songs. He'd just burst out in one from time to time, and he couldn't carry a tune in a syrup bucket with a lid on it. It was miserable. And you couldn't shut him up. I figured it was time for him to go just so I wouldn't have to listen to that. I ever start talkin' to myself, or heaven forbid sing a goddamn gospel song-\"This book as a mystery novel would have scored a 2 star from me, but it's more than that because if you spin me a tale involving a coming of age story and throw in some folk lore and you have me entranced. This is what Joe Lansdale does with this book. Just a short time before I had been a happy kid with no worries. I didn't even know it was the Depression, let alone there were murderers outside the magazines I read down at the barbershop, and none of the magazines I read had to do with this kind of thing."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\n“Only the past seems to matter now; only it seems to be alive; only it can support my soul.”\nI finally got around to reading this over the weekend and have been debating ever since about how to write a review. This is one of those books that if too much is given away, then everything might as well be given away. It also has a blurb that is about 112 pages long so go read that if you want way too much information. As for me? I’m going to let the book do most of the talking. This is the story of Harry Collins – a man who is near the end of his life and is recalling a monumental time when he was just a boy . . . \n “I’ve got the memories of then, nearly seventy years ago, and they are as fresh as the moment. It all happened, as I recall, in the years nineteen thirty-three and thirty-four.” \nThis was a time when Harry and his family lived in East Texas, specifically near the Sabine River bottoms . . . \n “The bottoms themselves were beautiful. The trees lush, the leaves heavy with rain, the blackberry vines twisting and tangling, sheltering rabbits and snakes. Even the poison ivy winding around the oak trees seemed beautiful and green and almost something you wanted to touch. But like the poison ivy, looks could be deceptive. Under all the beauty, the bottoms held dark things.” \nThe dark thing Harry and his sister Tom(asina) had always been afraid of was someone known as the “Goat Man,” but when Harry was 11 years old he discovered the true evils of the world in the form of murdered women and the reality of what kind of person would automatically be suspected of such heinous crimes . . . \n “My people, they like chaff, boy. They blow away in the breeze and ain’t no one cares.” \nThe book also delves into the battle of conscience Harry’s father, the constable, had to face throughout the process . . . \n “It’s like I’ve opened this box and I don’t know how to close it.” \nFor months now friends have been trying to get me to read Lansdale. I finally caved and my first selection was a classic B-Horror Movie type of story with The Drive In. I was convinced to read this one next when a certain monkey-wielding book fairy forced it down my throat. I can’t express how happy I am that she did so. I’ve been terrified to read Harper Lee’s “new” release and decided to stand firm and maintain my memory of the original which has kept its place as one of my favorites of all time. Color me shocked when I discovered that the author who is famous for the antics of Hap and Leonard would also be the person to write a coming of age story that was so reminiscent of To Kill A Mockingbird. If you were a fan of Scout and Jem or found Atticus to be as close to a superhero as you would probably ever meet in real life, I can’t recommend The Bottoms enough. This was a real thinker about how little some things have changed, it's written so well you'll think you are in Texas during the Great Depression and it is guaranteed to make you feel allllllll of the feels . . . . \nDon’t trust me? Check out my friend Paul’s review instead ‘cause he wrote a good’un."}, {"userName": "Arah-Lynda", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "Once again I find myself sitting here scratching my head wondering how in the world can this be the first time I have read Joe R. Lansdale.  In truth I think I may have come across a short story or two in one anthology or another, but this is my first novel.  It will not be my last.The story unfolds on a farm, set deep in the woods by the Sabine River in East Texas during the depression era of the 1930’s.   Our narrator is Harry Collins, an eleven year old boy who lives on the farm with his parents, younger sister Tom ( short for Thomasina) and his trusty dog Toby.  They also have a mule, Sally Redback for ploughing and such.   Harry’s father farms his land, owns a barber shop where he cuts hair and is the local constable.  Wearing so many hats was not uncommon in those days and went a long way in helping to make ends meet.   One day while out in the woods with his younger sister, Harry and Tom stumble upon the corpse of a naked, coloured woman.  She had been badly cut upon and was all bloated and tied up in barbed wire.While Harry and his sister are making their way back home in the dark, after having made their grisly discovery, they have the chilling sense that they are  being watched and followed.  Lansdale describes this and the Bottom land of the Sabine River country so effectively it is as though you are  actually there, on high alert with these kids as they swallow their fear and navigate through brambles and bushes enroute to the swinging bridge that will take them across the Sabine River and to a “safe” route home.The bridge was some cables strung across the Sabine from high spots on the banks.  Some long board slats were fastened to the cables by rusty metal clamps and rotting ropes.  I didn’t know who built it or how old it was.  Maybe it had been a pretty good bridge once.  Now a lot of slats were missing and others were rotten and cracked and the cables were fastened to the high banks on either side by rusty metal bars buried deep in the ground.   In places, where the water had washed the bank, you could see part of the bars showing through the dirt.  Enough time and water, the whole bridge would fall into the river.When the wind blew, the bridge swung.  The boards creaked and ached as if in pain.  Little bits of rotten wood came loose and fell into the river below.  Down there was a deep spot and the water ran fast, crashed up against some rocks, fell over a little falls, and into the wide, deep, churning water. . Lansdale is a gifted storyteller.  The Bottoms reads as though Harry were right there in the room with you recounting those days.  More bodies of unfortunate women will be discovered in the days and weeks to come and they will not all be women of colour.  Harry’s Dad, Jacob, being the local constable takes steps to learn more about this first woman.  He cannot count on the white doctor in town to give him an unbiased appraisal of how she met her death or for that matter even care much about such things.  Frustrated Jacob seeks the counsel of a coloured doctor that lives and practices within a settlement of mostly coloured folk not far from his own community.  This does not set well with the white people of his community or the local members of the Klan.  Primarily The Bottoms is considered a mystery but where it really shines is as a coming of age story.  Given the racial divide and the role Harry’s father played I was reminded often of Harper Lee’s classic as well as McCammon’s Boy's Life.  As you approach the end of this book Lansdale pumps up the volume and infuses every word with nail biting tension.  I could not take it in fast enough, my eyes,  independent of will, were racing ahead chasing down each sentence, leaving no time to digest, imploring my fingers to come on already, turn the page and let them loose.  At some point I suddenly gasped for air, unaware that the whole time, I had been holding my breath. Whew! And Woot!.  Highly recommended.  You really will not want to miss this one."}, {"userName": "Paul Nelson", "userReviewDate": "Jan 13, 2016", "userURL": "http://www.goodreads.com/user/show/7553206-paul-nelson", "userReview": "The Bottoms by Joe R. Lansdale The Bottoms by Joe Lansdale is a rousing atmospheric murder mystery with an abundance and it has to said, more than its fair share of tension and thought provoking issue. The Bottoms won the Edgar award in 2000 and is definitely a book that will stay resolutely in your thoughts long after you've finished. The story is an unforgiving coming of age tale for eleven year old Harry Crane set in the 1930's who along with his younger sister discover the tortured body of a dead woman in the Bottoms of small East Texas town, Marvel Creek. 'In that moment, something else changed for me. I realized that a person could truly die. Daddy and Mama could die. I could die. We would all someday die. Something went hollow inside me, shifted, found a place to lie down and be still, if not entirely in comfort.' Harry's father is the town constable and he begins an investigation that delves deeply into the racial divide prevalent in the era, nearly breaking him in the process. Caught smack bang in the middle are the two children who insert themselves into the forefront of proceedings as the murders increase and the town seek justice. The characters virtually leap from the page and sit snugly on your shoulder whispering their intent, leaving an impression of the story permanently etched in your mind. Eliciting disbelief at attitudes, questioning morality and leaving you firmly rooting for a family that face exorbitant trials and tribulations. There's even some of the Lansdale humour littered sparingly within, some anxious store-bought teeth. 'Once in a while be wore store-bought teeth, but they clicked and clacked and slid around when he talked, as if they might have some place to go and were anxious to get there.' The Bottoms is a delightful story that brings back fond memories of classic stories such as To Kill a Mocking and McCammons Boy's Life while still remaining unique and quite gripping in its own way. The characterization and the feelings inspired by this story are simply breathtaking at times, perfectly highlighting how times have changed. I did guess the killers identity from the various suspects tossed into the mix but it didn't detract from a wonderful story that deserves to be appreciated by all."}, {"userName": "Lawyer", "userReviewDate": "Oct 09, 2013", "userURL": "http://www.goodreads.com/user/show/3025547-lawyer", "userReview": "The Bottoms: Joe R. Lansdale's Edgar Award Winning Mystery\nThe Bottoms by Joe R. Lansdale was chosen as a group read for February, 2016, by members of On the Southern Literary Trail. Special thanks to Jane for nominating this novel.\n\nJoe R. LansdaleJust a few weeks ago my neighbor handed me a copy of By Bizarre Hands, the first anthology of short stories by Joe R. Lansdale. My neighbor is a professor of literature. I take his recommendations seriously. It was my first exposure to Landsdale. I was impressed.I finished the anthology a few days before travelling to Texas. I usually travel with a book set in my destination. I chose The Bottoms to take along. While some may question my classifying this novel as a work of Southern Literature, Texas is a mighty big State. It consists of distinct geographic areas, populated by very diverse people. Cross into Texas from Louisiana and you find yourself in East Texas, marked by huge tracts of pines, riversswamps, and the bottoms of the Sabine River.The area is decidedly \"Southern\" as opposed to Cowboy country. It is the land of \"The Big Thicket\" that covers miles of territory which was known as a place in earlier days into which one could go and rarely be found if that was the traveler's intention.\nThe Big ThicketLandale's novel is narrated by Harry Collins, now in his nineties, the resident of a nursing home. Recognizing his mortality, he tells the tale of life with his family in the Great Depression of the 1930s.Thirteen year old Harry was the son of a loving mother and father, and doted on baby sister, Tom, short for Thomasina. Yes, Tom is a tomboy. Harry and his family are better off than most. His father is a farmer, a barber, and most important, the town constable. Both his parents have a strong moral code stressing the value of human life no matter the color of another person's skin.Should the reader think this is sounding familiar, it should. This is Lansdale's move of To Kill a Mockingbird from Alabama to Texas. As Jem and Scout were intent on bringing Boo Radley out of hiding, so Harry and Tom are fascinated with an elusive figure known as \"The Goat Man.\"\"The Goatman\" is a well known Texas folklore legend. Outside of Denton, Texas, stands the old Alton Bridge, built in 1884. A black goat farmer Oscar Washburn lived nearby. In 1938, for reasons unknown, he was dragged from his family home, and lynched by hanging from the Altmon bridge. When the Klan came back to check on the their handiwork, Washburn's body was gone. Through decades, the Goatman has been sighted on the Alton bridge, sometimes as a figure leading herds of goats, sometimes carrying the heads of two goats, and sometimes as a figure half man and half goat.\nThe Goatman's BridgeKnown also as a writer of horror, it comes as no surprise that the Goatman appears as a central figure of interest courtesy of Joe Lansdale. The only change being that the bridge has been transformed into a deteriorating swinging bridge. Come on, it's near Halloween. Just go with it.\nThe Goatman of Texas LoreHarry and Tom are accompanied on their adventures by an unforgettable dog named Toby. Although severely injured, Toby is indestructible and a loyal companion to his kids.While out squirrel hunting, Harry and Tom find the body of a black woman, mutilated, and bound in barbed wire. Their discovery becomes the first of a series of murders. Constable Collins doggedly pursues the killer, although the white population shows no concern. Of what value is a dead black woman who was nothing more than a prostitute?Racism rears its ugly head. Following in the footsteps of Atticus Finch, Collins is determined to solve the murders. His white neighbors dub him a \"nigger lover.\" Things rapidly turn uglier when a white woman becomes a victim of the mysterious killer. The Klan comes out and lynches an innocent black man. Jacob Collins crawls into a bottle when he is unable to prevent the Klan from carrying out hanging Oscar, the man in the wrong place at the wrong time. Poor Mose has lived alone since the disappearance of his wife and brain addled son years ago.The town settles down until another white woman is found dead. This victim is no prostitute, but a respected member of the community, sought after by many suitors. Think \"Miss Maudie.\"Jacob Collins wreaks vengeance on the ring leaders of Mose's killers. He climbs out of the bottle to bring the real killer to light. Harry and Tom begin their longest journey one night, just as Jem and Scout did. Tom is the killer's intended victim. And the Goat Man comes out just as Boo Radley did.The Bottoms is a satisfying read. However, I would have found it more satisfying had it ended with Jacob sitting up in Tom's room, knowing he would still be there the next morning.There are flaws in this book. There are numerous sub-plots setting up other possible suspects that Lansdale's solution is to wrap them up in an extended epilogue by Harry which borders on the tedious. I found Harry's lengthy conclusion less than satisfying. I leave it to the reader to make their own determination.Perhaps this is Joe Lansdale's homage to that masterpiece of Harper Lee, To Kill a Mockingbird. I'll give him the benefit of a doubt. This novel is an expansion of his young adult novella,Mad Dog Summer found in Mad Dog Summer: And Other Stories. Lansdale is currently producing a film of The Bottoms, starring Bill Paxton.Joe R. Lansdale is a prolific writer. The Bottoms captured the 2001 Edgar Award for best mystery. He has won the British Fantasy Award, the American Horror Award and has scooped up nine Bram Stoker Awards, and was voted a World Horror Grand Master. He is the author of the popular Hap and Leonard Series. His latest novel is The Thicket. Lansdale, born in Gladewater, Texas, now lives in Nacogdoches, Texas, where he is the writer in residence at Stephen F. Austin."}, {"userName": "Algernon", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "[9/10]We have no Halloween traditions in Eastern Europe, but since I read so many books published in the US I got into the habit of picking up in October some titles that don't usually migrate to the top of my reading stack. I don't mind horror: it's not my favorite genre, but I have found some real gems in the past. 2014 is the year I tried my very first Joe R Lansdale story, and I have chosen The Bottoms both because I noticed it received some literary prizes and because it is a standalone, not part of a series. My reaction is quite enthusiastic, mostly about Lansdale storytelling talent, equal in my opinion to the likes of Stephen King and Robert McCammon. Speaking of McCammon, The Bottoms has as the main narrator Harry Crane, a young boy who needs to come to terms with death and with racial prejudices, reminding me of Boy's Life. Harry has a little sister, a tomboy named Tom, and she is not the only aspect of the story that pointed me in the direction of the classic To Kill A Mockinbird. There's also the strong father figure, the mysterious neighbour called here the Goat Man, again the racial tensions and the lessons that will last for a lifetime. Lansdale though cannot be accused of imitating these other writers : his story is darker, scarier, and the real monsters are sadly not some supernatural creatures from the swamp, but the people living next door.The setting is as much a part of the story as the humans. East Texas during the times of the Great Depression was a backward place, sparsely populated and almost isolated from the rest of the country, a swampy place of poor soil and tangled forests where the easiest transport was by boat on the river: We lived back in the deep woods near the Sabine River in a three-room white house Daddy had built before we were born. We had a leak in the roof, no electricity, a smoky wood stove, a rickety barn, a sleeping porch with a patched screen, and an outhouse prone to snakes. For Harry Crane and his sister the Bottoms are a place of constant adventure, a hunting ground for squirrels and rabbits, a fertile source of scary stories passed down from generation to generation. There are rumours of a Goat Man who hides in the forest and only comes out at night to steal unwary children, and of a travelling bluesman who made a pact with the Devil in order to be able to charm the audience with the tunes of his guitar. The bottoms themselves were beautiful. The trees lush, the leaves heavy with rain, the blackberry vines twisting and tangling, sheltering rabbits and snakes. Even the poison ivy winding around the oak trees seemed beautiful and green and almost something you wanted to touch.But like poison ivy, looks could be deceptive. Under all that beauty, the bottoms held dark things ... Once, when the two siblings are caught up late in the forest, they came upon the dead body of a woman, horribly mutilated and tied to a tree on the banks of the river. Childhood and innocence are about to be terminated for Harry as his father, the local constable, is unable to make any progress in the investigation. On the contrary, it soon becomes apparent that this was not an isolated case, but the work of a serial killer. The fact that the victims are black prostitutes only serves to underline the deep social division between the white and the black communities, the power that the \"Kluxers\" still had in that period to intimidate, to persecute and ultimately to kill while good people were afraid to speak up. As Miss Maggie, an old coloured friend of Harry, explains: It ain't gonna be. You can rest on that. My people, they like chaff, boy. They blow away in the breeze and ain't no one cares. Whoever done this have to kill a white person if he gonna get the big law on him. Lansdale merit in tackling segregation and hate is in how strongly he makes the issue personal, not some political or philosophical debate, but a choice you have to make at one point or another in life and then to practice what you preach, even if it gets you isolated and attacked by the bigots and the bullies. Harry's education is written not in schoolbooks 9the school is actually closed for lack of teachers), but in the blood of the innocent victims of prejudice and in the even more painful lesson that adults are not infallible, when the father he worships has his own moment of despair and resemnation. Just a short time before I had been a happy kid with no worries. I didn't even know it was the Depression, let alone there were murderers outside of the magazines I read down at the barbershop, and none of the magazines I read had to do with killers who did this kind of thing. And Daddy, though a good man, sincere and true, if briefly distracted, was no Doc Savage. In the same vein, maybe I'm repeating myself, but these things need to be said out loud, today as much as in the 1930's: It's easy to hate, Harry. It's easy to say this and that happens because the colored do or don't do one thing or another, but life isn't that easy, son. Constablin', I've seen some of the worst human beings there is, both white and colored. Color don't have a thing to do with meanness. Or goodness. You remember that. The plot is not a simple murder investigation or a story of racial hatred. If it were, I don't think it would stay long in my memory. What I really got from the book was a sense of the place and of the people living there, of the importance of family and traditions, and of the importance of the strong moral backbone, of the integrity and honesty that will see you through even when you live at the bottom of the social ladder. The adults around Harry are imperfect, even the closest to him have their secrets and their weaknesses and their moments of doubt. There's also a way out: Harry loves to read. It's mostly pulp magazines and cheap comics in the beginning, but the boy will soon discover the pleasures a lending library can bring even into the most backward of places.Regarding the prose of Lansdale, all I can say is that it has a natural flow, a rhythm borrowed from the oral traditions. For local colour it uses a lot of colourful similes that show a streak of healthy peasant humour : My Daddy used to say there were skeeters over there big enough to carry off a man and eat him and wear his shoes. another example, about some rednecks bullies: They had, as Daddy said, the manners of a billy goat. I once heard him say to Cecil, when he thought I was out of earshot, that if you took the Nation family's brains and waded them up together and stuck them up a gnat's butt and shook the gnat, it'd sound like a ball bearing in a boxcar. Lansdale can also write whimsical and poetic passages, when the story requests it, as when the elderly Harry Crane contemplates the changes brought about by several decades of progress to his bottom lands: But the beautiful woods are all gone now, cut down, cemented over with car lots and filling stations, homes and satellite dishes. The river is there, but the swamps it made have been drained. Alligators have gone away or been killed off. The birds are not as plentiful, and there is something sad about seeing them glide over concrete surfaces, casting their tiny shadows. All in all, an excellent choice for Halloween and for fans of crime or Southern literature. I will probably read next the Hap and Leonard books by Joe Lansdale, as I am pretty sure that he can continue to deliver the goods."}, {"userName": "Tom Mathews", "userReviewDate": "Oct 19, 2014", "userURL": "http://www.goodreads.com/user/show/22063432-tom-mathews", "userReview": "Every time I finish a Joe R. Lansdale book I swear that I need to read more of his books. Often life gets in the way, though, and a good deal of time goes by before I pick up another. Having just finished The Bottoms, I am really, really, really determined to make Joe Lansdale one of my best friends. This standalone novel, written in the guise of an old man’s reminiscence, is an exceptional combination of murder mystery and coming-of-age tale set in East Texas during the Great Depression. Harry Collins, 14, lives with his family along the banks of the Sabine River. His father, Jacob, has donned many hats (farmer, barber, town constable) in his struggle to stay afloat during the lean years of the Depression. One day while hunting with his sister, Tom (okay, Thomasina) they find the mutilated body of a black woman tied to a tree near the river. Soon more bodies turn up and the hunt is on for a killer. While Jacob is searching for a human killer, Harry and Tom are convinced that they have already seen the killer, the legendary Goat Man, rumored to stalk the river bottoms in search of prey. Things get complicated quickly when one of the victims turns out to be white and the local Klan gets involved. Although this is an original tale in its own right it also has many undeniable similarities to To Kill a Mockingbird which I found inexplicably entertaining. Ordinarily I would find copycatting Harper Lee presumptuous in the extreme and earn the author a good horsewhipping. Lansdale, however, gets a pass from me because his remarkable character building skills and storytelling ability kept me fully engaged all the way through to its bittersweet ending. On the downside, the whodunit aspects of the story aren’t as challenging as they could be so readers who consider the author’s skill at concealing the killer’s identity important, you may not be too impressed. If you are like me, however, and are just along for the ride, you will likely find it enjoyable. 4.5 stars (rounded up because, well damn it, because I can and I want to!)FYI: On a 5-point scale I assign stars based on my assessment of what the book needs in the way of improvements:*5 Stars – Nothing at all. If it ain’t broke, don’t fix it.*4 Stars – It could stand for a few tweaks here and there but it’s pretty good as it is.*3 Stars – A solid C grade. Some serious rewriting would be needed in order for this book to be considered great or memorable.*2 Stars – This book needs a lot of work. A good start would be to change the plot, the character development, the writing style and the ending. *1 Star - The only thing that would improve this book is a good bonfire."}, {"userName": "J.K. Grice", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/72137025-j-k-grice", "userReview": "I first discovered Joe Lansdale when I found a discounted hardcover copy of THE BOTTOMS at Half Price Books. This excellent book started my love affair with the works of CHAMPION JOE! If you've never read him, give Hisownself a try ;)"}, {"userName": "Lou", "userReviewDate": "May 09, 2010", "userURL": "http://www.goodreads.com/user/show/3699303-lou", "userReview": "The main protagonist Harry Crane takes us back to his youth to the time of the 1930's. He tells of his growing up in the family farm in the Bottoms, of their struggles during the great Depression and the grizzly murdered women that they discover in the Bottoms. He tells of his wonders of his youth and his delight in learning of those around him during his coming of age, of his quest and mystery in search of the identity of The Goat Man. His poor Dog Toby a limp but courageous dog that you'll never forget and his equally brave and lovely sister Tom. That loving kind ma and his grandma really a character to remember his father a stand up righteous kind of guy, a tough law man that wishes to see beyond skin colour. They faces problems with K.K.K members in the search for the murderer. As the story progresses more peoples true colours start to show. The Bottoms be a place you would love and hate to live, mark my words it sure is a place and a story to remember of as long as you live. It pays homage to the great novel To Kill a Mockingbird, has everything that story stood for and leaves the reader with a similar awe. Well deserved of the Edgar Award. This story is just as good as his new novel Edge of Dark Water also taken place during the depression era with equally wonderful and memorable characters.The story is presented before you in easy flowing storytelling way, a poignant tale of human endeavour against odds, yet another Joe Lansdale great story with wonderful prose. A joy to read full of heart and horrors, a fully immersive reading of a great story.Once completing this story you would be in regret due to no longer being in company with these characters just as the main protagonist mentions in his recollections... \"Each time i visit now, close my eyes to go there, i hope when i awake i will no longer be of this world, but one where Mama and Daddy, Tom and Grandma, perhaps even Mose and the Goat Man, and of course good old Toby, will be waiting for me.\"Watch out for a movie adaptation that is going to be released, this would be a really good movie especially starring with Bill Paxton as an actor.\n\"Just a short time before I had been a happy kid with no worries. I didn't even know it was the Depression, let alone there were murderers outside of the magazines I read down at the barbershop, and none f the magazines I read had to do with killers who did this kind of thing. And Daddy, though a good man, sincere and true, if briefly distracted, was no Doc Savage. In the detective magazines the cops and private eyes saw a clue two, they put it together. Cracked the whole case wide open. In real life, there were clues a plenty, but instead of cracking the case open, they just made it all the more confusing.\"\"Daddy was often chastised by certain church-minded folks for keeping pulps handy at the barbershop. But as my Dad always explained about racy covers, it's just a little paint, folks. Nobody's naked.\"\"Another thing different then was you learned about things like dying when you were quite young. It couldn't be helped. You raised and killed chickens and hogs, hunted and fished, so you were constantly up against it. That being the case, I think we respected life more than some do now, and useless suffering was not to be tolerated.\" \nRead my interview with the author @ http://more2read.com/review/interview-with-joe-r-lansdale/"}, {"userName": "Snotchocheez", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "I probably need to file Joe R. Lansdale in the \"Southern Authors I need to keep an eye on\" file (if I may be so bold as to lump someone from East Texas into the \"South\"). I was consistently delighted by my first encounter with his work, the creepy cool 1930's-era Texas Gothic thriller The Bottoms. Much as I found Wiley Cash (another Southern author I've discovered recently) a straightforward, no-nonsense storyteller, Lansdale's style doesn't make room for ornate prose. It's all about establishing setting, creating characters the reader wants to know better, engaging with uncertainties. No flowery gewgaws or cheap devices to be had here: just smart storytelling.I had reported in a status update that this reminded me quite a bit of To Kill a Mockingbird, though it's probably not fair to compare them; there's not too much overlap storywise. Rather, the feelings Lansdale tale left me with were not unlike those that of Harper Lee's beloved fictional (but very real for the day and time) account of racial injustice. Much like Ms. Lee's Jim Crow-era'd Alabama, The Bottoms has as its backdrop the racial divide in Depression Era East Texas. The story is capably recounted in flashback by octogenarian Harry Crane of his life in the Bottoms (a briar-y mucky morass along the Sabine River) of gruesome goings-on back when he and his younger sister Tomasina ('Tom') were kids. One day while exploring the neighboring Bottoms, Harry and Tom encounter a badly decomposed body of a 'colored' woman strung up with baling wire. This news, after reported to their father (constable Jacob Crane), was met with a collective shrug by most of the white populace ('oh, another N----- whore kilt, big deal' was the prevailing attitude). The black folks were naturally more fearful, yet sanguine, throwing around the \"Goat Man\" or \"Travelling Man\" (hobo) lore around to attribute the murder to. The kids (and naturally their constable father) just wanted justice for the killed woman. As a few more brutally murdered corpses start turning up around the Sabine, however, they realize that justice is not going be swift or blind. As allegations by Constable Jacob start flying, the Ku Klux Klan (and its supporters) start meting out justice of its own. As murder mysteries go, this one wasn't all that taut (even idjit me had this figured out by about the midway mark) but you'll probably overlook that in favor of the sweaty sordidness of the wretched tableaux Lansdale's painted for the reader. He puts you right there in the thick of it, bushwhacking through the brambles, sweating as the protagonists sift the Bottoms for the truth. I devoured this quickly, but I'm certain it will stay with me for quite a while. He's got many novels and short stories under his belt before and since this 2000 release; I can't wait to explore them all."}, {"userName": "Britany", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/5550397-britany", "userReview": "East Texas, 1930s, Racial tensions, add in a serial killer and the legend of the \"Goat Man\"...Harry is just a little boy growing up in Texas where racial tensions still run thick. His daddy is the town constable and has done his best to raise his children without racial bias. Harry and his sister Thomasina \"Tom\" are playing around when harry discovers a dead black woman washed up on shore by the river that runs through their town. The woman has been severely beaten, raped, and decidedly murdered. Harry grows up fast overhearing conversations between his daddy and some of the townsfolk. Pretty soon, another woman shows up dead...This book moves fast, and I was flying through the book to find out what happened and who was behind these murders! I couldn't believe how well Lansdale slides between character development and major plot points. He left every chapter with me wanting more, and I could barely put this book down before I finished it.Toby the dog was my favorite. There were many little twists in his tiny life, but he was such a tough little guy and showed true courage. I well up again, just thinking about the little terrier."}, {"userName": "debra", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/7002034-debra", "userReview": "4-5 Read this a long while ago, and I remember really liking it. I would never have guessed that this is the same author that writes Hap and Leonard."}, {"userName": "Camie", "userReviewDate": "Jan 28, 2016", "userURL": "http://www.goodreads.com/user/show/7399266-camie", "userReview": "From his nursing home bed Harry Collins recalls some of the suspenseful events of coming up in post Depression times in the swampy \" bottoms\" of East Texas. This coming of age tale about the summer he and his sister Tom stumble upon the mutilated dead corpse of a black woman and get the entire town caught up in a whirlwind of uncertainty and racial conflict, is a winner of The Edgar and American Mystery Awards. The books blurb cites it as a thriller with echoes of William Faulkner and Harper Lee. I did see a few similarities, as the father in the story Constable Jacob Collins is charged with trying to uphold the law at a time when aiding a black person could result in the KKK burning a cross in your yard, and it's told in a no nonsense form which is similar to some Faulkner's tales. Come to think of it we even have a misunderstood and mysterious Boo Radley type character derived from actual folklore, called The Goatman lurking about. A February selection of my Southern Lit club, I found it a very engaging read !! 5 stars"}, {"userName": "Diane Barnes", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "This was a good read, but I can't go higher than 3 stars with it. I knew who the killer was about halfway through, and also guessed the identity of the Goatman fairly early as well. It was well-written with realistic dialogue for the time (1933) and was a good depiction of the morals and opinions of people in the south for the time as well. But there were too many inconsistencies in the plot, and it seemed to me he was retelling \"To Kill a Mockingbird\" with an East Texas setting. I know Lansdale has a lot of fans, and I enjoyed the book, so I may try another one of his down the road.I should add that the characters of Tom, the little sister, and Grandma were absolutely stellar."}, {"userName": "Kirk Smith", "userReviewDate": "Dec 10, 2013", "userURL": "http://www.goodreads.com/user/show/15749169-kirk-smith", "userReview": "Everything I have read by Joe R. Lansdale has been good. Really good storytelling that easily draws me in. I cared about every character including the families pet hound. The Bottoms was the best of the three I have read. Told from the point of view of a twelve year old boy helping his father, the town constable, to solve the mystery behind a string of brutal murders. Everything you might ever need to know about the piney woods of East Texas."}, {"userName": "Laura", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/7555122-laura", "userReview": "This is my first read by authorJoe R. Lansdale and it won't be my last. It was a good, suspenseful mystery. I had some uneasiness throughout the book and had an idea of \"who done it\" but that didn't take away from the intensity of the novel. The racial tension and the details are at times, a little much, which add to some very uncomfortable moments. I loved the narration told in flashbacks and the supporting characters. A novel I enjoyed from beginning to end, that was very hard to put down. One of the more thorough epilogues I have ever read."}, {"userName": "Karl", "userReviewDate": "Feb 19, 2014", "userURL": "http://www.goodreads.com/user/show/1935255-karl", "userReview": "As seen through the eyes of an eleven year old boy and his nine year old sister between the years of 1933 and 1934 in the small East Texas town of Marvel Creek. Just a boy and his sister going squirrel hunting with their dog Toby. Then they discovered the tortured body of a dead black woman. Enter \"The Goat Man\" stalking the kids.This is copy 309 of 400 signed and numbered."}, {"userName": "Bill", "userReviewDate": "Feb 08, 2008", "userURL": "http://www.goodreads.com/user/show/810550-bill", "userReview": "Joe R. Lansdale is predominantly known as a horror writer, but lookie here: The Bottoms won the Edgar Award (Mystery) for best novel. Now, despite being a mystery, there weren't any big surprises for me, but where the novel truly shines is as the coming of age story of a 13 year-old boy in the early 1930s.I was surprised at what a quick read this was. For some reason I was under the impression that this was a denser read, but in no way was I disappointed at that. I'm a big fan of less is more. Lansdale writes in a very economical fashion, but I was totally drawn in to the sense of place and time in this story. The characters were well developed, and the description and feel of racial tensions are worthy of Harper Lee's classic.The only thing that could have been better was maybe being rocked orblindsided by a revelation at the end, and for this reason only, my rating will fall only a smidgen short of awesome. On second thought, as I write this review, images from the story are still flashing through my mind, and there are feelings that I think will continue to linger for a while yet. I love books that will do that to me. So, 5 stars it is. It's such a fast read, but it'll take a long while to shake the feeling of East Texas in the 1930s. Highly recommended."}, {"userName": "Carmine", "userReviewDate": "Jun 17, 2015", "userURL": "http://www.goodreads.com/user/show/43396096-carmine", "userReview": "Nella merda del Texas Rivisitazione del capolavoro intramontabile di Harper Lee, qui riletto in salsa texana con tutti gli eccessi pulp tipici dell'autore.La visione dell'innocente si disintegra di fronte al vero volto della comunità; la volontà di opporsi al male stemperata nel silenzio omertoso e resa solo una fastidioso capriccio temporaneo da sradicare ed estinguere.Ma vuoi mettere il fascino dell'Uomo Capra, così minaccioso e pericoloso da tenerti lontano dal bosco?"}, {"userName": "Stephen", "userReviewDate": "Aug 22, 2016", "userURL": "http://www.goodreads.com/user/show/4809022-stephen", "userReview": "Been meaning to read this one for ages but had been put off by the title due to British/US language differences - \"The Bottoms\" conjures up an image of toilet humour to a British reader (like the \"Captain Underpants\" books that my kids used to love when they were in primary school) but I soon discovered that it instead refers to the \"Bottoms\" of the swampy river where the story takes place.Absolutely loved this one once I got into it - great characters and really felt that you were in the time and place where it all happened. A combination of 1930s Southern racial issues and Ku Klux Klan and a serial killer thriller. To get 5 stars, you need a great ending too and this certainly had that - couldn't get through it fast enough at the end which was one of the most thrilling ever.As this was my first Joe Lansdale book, I am pretty excited about having discovered a new favourite author with loads of books that I've yet to read as well ! Highly recommended !"}, {"userName": "Carol Storm", "userReviewDate": "May 20, 2011", "userURL": "http://www.goodreads.com/user/show/5032322-carol-storm", "userReview": "Remember, Chilluns, It's Always A Sin To Rip Off A Mocking Bird!All right, I loved BUBBA HOTEP. The movie, not the book. And I did enjoy a couple of Joe R. Lansdale stories that I read in the collection HIGH COTTON. But when he tries to turn all \"lit'rary\" and create a poignant coming of age novel . . . well, that hound dog don't hunt. Everything here is something you've seen before . . . many, many times before. Sensitive boy narrator? Check. Strong but flawed father? Check. Peppery old lady with a heart of gold? Check. Darkies who know their place but are ever so grateful when folks give them just a little bit more? Check. Two stars for good nature descriptions and really knowing the rural South. Other than that . . .If H.P. Lovecraft tried to write IT'S A WONDERFUL LIFE, this is what he might have come up with. Shudder!"}, {"userName": "Glenn Rolfe", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/16739484-glenn-rolfe", "userReview": "After reading a couple of Lansdale's newer books, and hearing how much other writer's loved his work, I decided to check out the novel that seems to get the most hype, THE BOTTOMS. This one had been on my radar for the last couple years. I decided to grab a copy from my local library, and I'm glad I did. While not as perfect as TO KILL A MOCKINGBIRD (Harper Lee), THE BOTTOMS is definitely in the same ballpark of great American literature. An amazing cast of characters are brought to life and tossed into this excellent tale of murder, mystery, and the evil that men do. Based down south back in the 1930's, a young boy, Harry, and his sister Tom, find a brutalized body barbwired to a tree down by the river. Their father, Jacob, the town constable, sets out to try and figure who could have done such a thing. Race plays a major role in the story adding depth and tension to an already poignant piece. More bodies turn up, and the town, led by a Klan loving bastard named Nation, is convinced the killer is black and set there eyes upon an old man living in a shack in the bottoms. There are plenty of twists and turns throughout. Harry's part in all of this makes for a great coming-of-age story, as well. We see plenty of what is so wrong with America (then and now), but Lansdale also reminds us that there is goodness, even in those we think are among the lost.My thoughts:A terrific novel, filled with intrigue and suspense, wonderful descriptive narratives, characters you won't soon forget, and that old life lesson–never judge a book by its cover.I did know who the killer was fairly early on, but that did not take away from my enjoyment of the book. Don't wait as long as I did to pick this one up! I give THE BOTTOMS 5 stars. Definitely a book every writer should read."}, {"userName": "Andy Weston", "userReviewDate": "Aug 29, 2016", "userURL": "http://www.goodreads.com/user/show/313206-andy-weston", "userReview": "Set in East Texas in the years of the depression this is part murder mystery, part coming of age, and part historical novel and surely one of Joe Lansdale's finest, though that will be for debate, I have read several Lansdale and they all have 5 stars from me. The story is narrated by 11 year old Harry Collins from his rest home bed many years later. There are issues of race and the KKK play a role throughout. Life in The Bottoms, a deprived and poor area of East Texas, is described wonderfully by Lansdale, and though the subject matter is often dark his characters have humour and warmth. The strongest part of the novel is the last chapter, the climax, and there is a section following that lets the reader know what went in to happen to the cast - a welcomed feature that is almost read with a tear in the eye. It's probably Lansdale's most famous book to date, and surely not far off a classic of contemporary American literature."}, {"userName": "Estelle", "userReviewDate": "May 11, 2015", "userURL": "http://www.goodreads.com/user/show/17934127-estelle", "userReview": "I really enjoyed this one! The only reason I'm not giving it 5 stars is because it was a bit predictable and I had guessed early on who the killer was.Still, a great southern dark mystery, beautifully written and with some very likeable and memorable characters. This was my first novel by Lansdale, it won't be the last."}, {"userName": "Skip", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/1389748-skip", "userReview": "Dust bowl noir. Set in East Texas during the depression era days when racism was rampant, a dead black woman is found, mutilated, wrapped in wire and hung in a dark piece of swampland, discovered by a young boy and his younger sister. They report their findings to their father, a fair-hearted man, who happens to be the local constable, who wants justice served. The family is the main story, including the mother and grandmother, and the challenges faced to find what turns out to be a serial killer. Lansdale keeps you guessing until the very end, weaving in a childhood bogeyman known as the Goat Man."}, {"userName": "Suzy", "userReviewDate": "Jan 31, 2016", "userURL": "http://www.goodreads.com/user/show/6942006-suzy", "userReview": "This is a coming of age story of almost 12-year-old Harry Crane, told in retrospect by his 80-something self, about the end of his innocence in 1933-34 Depression-era deep East Texas. It is also a murder mystery, a story of a family trying to make ends meet in the small town of Marvel Creek, a morality tale of how to be in the horrific world of the Jim Crow south and a portrait of a very specific place and time in history. Most of Lansdale's writing is described as Southern Gothic and I only had a feeling of what that meant. So off to Wikipedia, which defines it as:Common themes in Southern Gothic literature include deeply flawed, disturbing or eccentric characters who may or may not dabble in hoodoo, ambivalent gender roles, decayed or derelict settings, grotesque situations, and other sinister events relating to or stemming from poverty, alienation, crime, or violence.I've only read this and Lansdale's Edge of Dark Water, but both fit this definition perfectly. Lansdale creates vivid descriptions of the look and smell of the East Texas landscape, builds suspense that keeps you turning pages, writes with wisdom and humor and pays homage to To Kill a Mockingbird and other classics of the genre. I loved the characters and their responses to the events of that year along the Sabine River. I burned through this book in just a few days, finding it hard to put down. I could list a few complaints - maybe too deliberate in his attempt to fit the genre, maybe too much patterned after TKAM, maybe too obvious in making his points - but I won't."}, {"userName": "Ctgt", "userReviewDate": "Jan 19, 2013", "userURL": "http://www.goodreads.com/user/show/3787451-ctgt", "userReview": "4.5 stars. Loved this book. I thought I had read Lansdale before but after looking at his list this is my first. Won't be my last. You know how sometimes an author or book just hits that sweet spot? Was it the setting, '30's back country of Texas? The intertwining of local legend/folklore about the Goat Man? The mystery surrounding the murders of local women? The style of his writing? All of it! Need to read more Lansdale!The world slipped back to about as normal as it would ever be again, though to my eyes it was never as sharp and clear as it had been, and nothing I could do would ever completely bring it back."}, {"userName": "Stephanie Griffin", "userReviewDate": "Apr 29, 2008", "userURL": "http://www.goodreads.com/user/show/514234-stephanie-griffin", "userReview": "THE BOTTOMS, an Edgar-winning mystery, was originally written by Joe R. Lansdale in 2000. I was interested in reading it the n, but never quite got around to it. The book stayed on my 'to-read' list, and on my shelf, year after year. Now I've finally read it and I ask myself, \"What took me so long??\"This is quite simply one of the best suspense stories I have ever read. The suspense was real, the characters compelling, and the story moved right along so that before I knew it, the pages had flown by.The story is told as the reminiscence of an old man who as a boy lived in the deep woods of east Texas in the 1930s. The low-lying woods, with its river full of water moccasins and moss-laced trees, are known as 'the Bottoms'. It's a perfectly eerie place to set a murder mystery.The boy, Harry, and his little sister, Tom, find the mutilated body of a woman tied with barbed wire to a tree next to the river. Their father is the local constable, so Harry tries to taga long as his father looks for clues to the murderer's identity. The murdered woman was black, but her body was found in the predominantly white area. Racism is rampant in these parts, so there is a lot of racial tension. More grisly murders occur and the story gets more complicated.Who is committing the murders? The Goat Man, a devil creature believed to live in the woods? Mose, the black man who lives in a shack by the river? Red, the prejudiced white constable of the next town, a man who also has ties to Harry's father and mother? Or one of the Nation boys, known to torture small creatures? The suspects are many and the clues are few.I was really impressed with Lansdale's portrayal of his characters, especially Harry's father. Not being able to clear up the murders really takes its toll on him. Other characters show real emotion and empathy. This isn't a cozy story, and bad things do happen to good people.The suspense in this book is great. If anyone had tapped me on the shoulder while I was reading this I would have jumped out of my skin! From crossing the rickety 'swinging bridge' over the river, to running through brambles at night with an unknown person or creature following, the outcomes were filled with trepidation.Lansdale has written many other books, although this is the first I've read. Now I want to read more! Does anyone have recommendations on which one I should read next?"}, {"userName": "Tim", "userReviewDate": "Dec 15, 2015", "userURL": "http://www.goodreads.com/user/show/16867480-tim", "userReview": "Joe R. Lansdale is the author of the well known \"Hap and Leonard\" series of novels that have recently been made into a television series, but has also written great books in a storytelling fashion among them are this book \"THE BOTTOMS\" and Edge of Dark Water.Several great reviews of this book have already been written, many of them by Goodreads members I am friends with, so I'll try keep my review of this brief and will only say that it's another great book that takes place in a time gone by in a rural part of Texas, this time being outside of Marble Creek on the Sabine River as told by narrator Harry, an old man later in life who is now in a nursing home.Several murders of young women take place that are the obvious work of the same killer(s), and Harry and younger sister \"Tom\" come upon the first one. Harry's father Jacob is the local constable who is tasked with investing the murders while still working as a farmer on his land.\"THE BOTTOMS\" is a long read that never loses the ability to maintain interest to the point of being unable to set down once started. I have to say the only thing that could have prevented me from giving this 5 stars for me is that I guessed who the killer was, yet that didn't take away from this still being a great book.5 stars."}, {"userName": "Jen", "userReviewDate": "Oct 20, 2014", "userURL": "http://www.goodreads.com/user/show/756462-jen", "userReview": "Bad! Everything that the boy narrator experiences is then repeated & rehashed when he overhears his parents discussing it after lights-out. Why?! What's the point? I, the reader, am a grown-ass person. I understood it the first time. So: this novel coulda been half as long.This book is like a person who says they're not racist, and because they have told you that they're not racist, it's okay for them to then use all the slurs, as in, \"Other people discriminate against n-words, but not me, because I'm not racist.\" Seventy percent of the dialogue is the same few paragraphs about race relations. Every character speaks the same couple of lines at some point in the story. Characters tell stories from their pasts, and then other characters bring up those stories & re-tell them, and then the boy narrator spends some more time thinking about and describing the same thing we've already read three goddamn times.I picked this up based on good reviews from my GR friends. Agree to disagree."}], "description": "The narrator of The Bottoms is Harry Collins, an old man obsessively reflecting on certain key experiences of his childhood. In 1933, the year that forms the centerpiece of the narrative, Harry is 11 years old and living with his mother, father, and younger sister on a farm outside of Marvel Creek, Texas, near the Sabine River bottoms. Harry's world changes forever when he discovers the corpse of a young black woman tied to a tree in the forest near his home. The woman, who is eventually identified as a local prostitute, has been murdered, molested, and sexually mutilated. She is also, as Harry will soon discover, the first in a series of similar corpses, all of them the victims of a new, unprecedented sort of monster: a traveling serial killer.From his privileged position as the son of constable (and farmer and part-time barber) Jacob Collins, Harry watches as the distinctly amateur investigation unfolds. As more bodies -- not all of them \"colored\" -- surface, the mood of the local residents darkens. Racial tensions -- never far from the surface, even in the best of times -- gradually kindle. When circumstantial evidence implicates an ancient, innocent black man named Mose, the Ku Klux Klan mobilizes, initiating a chilling, graphically described lynching that will occupy a permanent place in Harry Collins's memories. With Mose dead and the threat to local white women presumably put to rest, the residents of Marvel Creek resume their normal lives, only to find that the actual killer remains at large and continues to threaten the safety and stability of the town.Lansdale uses this protracted murder investigation to open up a window on an insular, poverty-stricken, racially divided community. With humor, precision, and great narrative economy, he evokes the society of Marvel Creek in all its alternating tawdriness and nobility, offering us a varied, absolutely convincing portrait of a world that has receded into history. At the same time, he offers us a richly detailed re-creation of the vibrant, dangerous physical landscapes that were part of that world and have since been buried under the concrete and cement of the industrialized juggernaut of the late 20th century. In Lansdale's hands, the gritty realities of Depression-era Texas are as authentic -- and memorable -- as anything in recent American fiction.", "title": "The Bottoms", "url": "http://www.goodreads.com/book/show/102113.The_Bottoms", "average": 4.15, "cover": "https://images.gr-assets.com/books/1348765461l/102113.jpg", "reviews": 654, "authors": [{"url": "https://www.goodreads.com/author/show/58971.Joe_R_Lansdale", "name": "Joe R. Lansdale"}], "type": ["Mystery", "Fiction", "Horror", "Mystery", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/102113.The_Bottoms", "http://www.goodreads.com/book/show/11211879-the-bottoms", "http://www.goodreads.com/book/show/8511156-the-bottoms", "http://www.goodreads.com/book/show/2033745.The_Bottoms", "http://www.goodreads.com/book/show/889001.The_Bottoms", "http://www.goodreads.com/book/show/9652288-in-fondo-alla-palude", "http://www.goodreads.com/book/show/3199320-the-bottoms", "http://www.goodreads.com/book/show/102114.Savage_Season", "http://www.goodreads.com/book/show/102119.Mucho_Mojo", "http://www.goodreads.com/book/show/102117.The_Two_Bear_Mambo", "http://www.goodreads.com/book/show/102132.Bad_Chili", "http://www.goodreads.com/book/show/11641612-edge-of-dark-water", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/35005051-the-forgotten-girls", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}