{"ratings": 910, "userreviews": [{"userName": "Bookwraiths", "userReviewDate": "Nov 19, 2012", "userURL": "http://www.goodreads.com/user/show/14716035-bookwraiths", "userReview": "Originally reviewed at Bookwraiths.The Coming of the Horseclans and the series it spawns series by Robert Adams (no relation to yours truly) is a post-apocalyptic, pulp fiction series that doesn’t take itself too seriously. It is about gory battles, psychic animals, a brutal world, and larger-than-life heroes and villains. Or as the author himself put it:The following tale is a fantasy, pure and simple. It is a flight of sheer imagination. It contains  no hidden meanings, and none should be read into it; none of the sociological, economic,  political, religious, or racial “messages” with which far too many modern novels abound are  herein contained. The Coming of the Horseclans is, rather, intended for the enjoyment of any  man or woman who has ever felt a twinge of that atavistic urge to draw a yard of sharp, flashing  steel and with a wild war cry recklessly spur a vicious stallion against impossible odds.The tale is set in a 27th century post-apocalyptic America, where a past nuclear and biological war has completely transformed the world. The protagonist Milo of Morai, a mutant from the 20th century, has survived all these centuries, returning now to the horseclans he helped create to fulfill his own prophecy by leading them to their ancestral homeland. (Well, sort of.) Naturally, the journey is fraught with danger, as the clans cross a near unrecognizable America where decadent city-dwellers, other Immortals, and vicious survival rules the day.What drew me to this series back in the early 1980s was the concept of the story and the amazing, pulp covers. Being a huge lover of sword and sorcery fiction by Robert E. Howard and others at the time, this book seemed like a can’t miss for my reading tastes. I mean, if I loved Conan the Barbarian fighting wizards and monsters across the Hyborean world of the distant past, why wouldn’t a story of a post-apocalyptic world where nomadic warriors (Think Mongolian horde with mutant horses!), telepaths, ancient technology, and Immortals fighting for control of the world not entertain me? It was pulp fiction fun with a modern twist. A can’t miss like I said.Now, to be completely transparent, I didn’t like this novel or the series as much as I wanted to. It was a bit too brutal for my tastes back then. The heroes and villains too violent, too callous, and too prone to rape anyone who didn’t move out of the way quick enough. The plot lines fairly straight forward and predictable. And the writer’s style was adequate but never very refined. So while I did read several books after this one, I soon lost interest and never returned.Even with my lack of love, I still feel this book and the Horseclans series in general is one which should not be forgotten. For its time, it was a thrilling, realistic, pulp fiction story which was short (The longest novel was only 253 pages. The average length of a novel was 202.), violent yet realistic (The author was a Vietnam veteran who understood the horrors of combat and their aftermath.), and mixed science fiction with fantasy into a nice mixture. So I’d encourage lovers of pulp fiction to go out, grab copies of this and the first few books, and see if this adventure series is the entertainment you crave."}, {"userName": "Terence", "userReviewDate": "May 30, 2008", "userURL": "http://www.goodreads.com/user/show/1019174-terence", "userReview": "[Reread – May 2017]: I was an avid follower of Robert Adams’ Horseclans novels when they first came out in the late ‘70s - early ‘80s,[1] though my interest began to flag as I grew older and grew less and less comfortable with Adams’ raging homophobia. That and I was growing away from the simplistic military-sf that the Horseclans novels were a part of. Even so, I came to regret leaving my copies at my mother’s when we cleaned out the house after her death. So I surrendered to nostalgia recently and downloaded the Kindle versions of books #1 and #7, Horseclans Odyssey, the two I remembered as being my favorites.The premise of the series is simple enough. Toward the end of the 20th century, a nuclear and biological holocaust along with some natural disasters destroyed our civilization. Milo Morai is a mutant – an immortal creature with Wolverine-like regenerative powers. He rescues a group of orphans in Los Angeles, taking them east into the Great Plains, where he lays the groundwork for their culture – a mix of Native and Mongolian nomadic traditions that would stand them in good stead in the world’s new circumstances. He also left them a prophecy that a leader would take them back to “Ehlai” at some time. He then left to find a reputed island where other immortals had gathered. Several centuries later, he returns to the Horseclans, who have come to dominate the plains from Canada into Mexico, becomes their War Leader, and begins to lead them back to their fabled homeland (though since LA and its surrounds are still a radioactive wasteland or under water, he fudges the prophecy and points them further eastward). This is where The Coming of the Horseclans opens. The clans are crossing the Appalachians and confronting the medieval-like kingdoms of the former eastern United States. And if that weren’t enough, Adams introduces ghosts from Milo’s past: Far to the south (in erstwhile Florida), a group of scientists plot to seize control of their former country and restore the U.S. to its former glory (“Holy Make America Great Again!, Batman!”). They too are immortal but have achieved this through science – a vile process of transferring their brains from host body to host body down the centuries.You’re going to have to have a strong stomach if you want to read these novels. Adams was a vet and had a keen interest in ancient and medieval warfare, which is clearly evident whenever he writes about battles, weapons, armor, or – and I have to give him credit – the trauma that goes with all the bloody fighting. As an example, Aldora, one of the immortals introduced in this book, is an 11-year-old girl brutally raped by her (Horseclan) captors. She, of course, escapes that hell but she grows up to be a very troubled woman in subsequent books.Beyond any moral qualms you may have when reading these books, the writing is – let’s be honest – competent but not all that good. Adams knows how to tell a story and move things along (usually) but the characters are shallow and predictable and their motivations simplistic. Morality is Manichaean – the “good guys” are honorable, trustworthy, brave, etc., and the “bad guys” are irredeemable (and often gay). If he had incorporated more characters like Aldora or stretched his story-telling talents (see below), the brutal reality of his world would have been more acceptable (tolerable?). As it is, often the writing comes across like a B-movie script where the writers fall back on rape and over-the-top debauchery to identify the bad guys.I don't want to climb too high on this soapbox. If you like the series more than I used to, I’m not going to think you’re morally bankrupt or that your reading taste is suspect. Far from it. I’ve got plenty of books on these shelves that are by no sane measure “good” but that I love (and movies, a shout out to “Zardoz”). This review is purely self-reflection; I’ve come to desire more thoughtfulness and insight even from books I read just for pleasure.My post-apocalyptic reading choices got better, I like to think, even at the time. I discovered A Canticle for Leibowitz and Edgar Pangborn before I left for college. More recently, I’ve enjoyed Riddley Walker and The Country of Ice Cream Star, among other examples. [All mentioned here, I cannot recommend highly enough.][2]I can’t recommend the Horseclans novels now. They were fun when I was 14 but they can’t hold my interest any longer. [Though I’m still going to reread #7 soon. I recall thinking it was a lot like REH’s “Beyond the Black River,” in that it was a departure from the usual Horseclans book and was better because Adams was stretching himself as a writer just as Howard had done in the short story. Hopefully, my memory will be vindicated.]__________________________________[1] For those following the timeline of my life, I would have been 8 when this book was first published, though I probably didn’t get a copy of it until I was around 11 or 12 at the earliest. Most likely, later – around 13 or 14.This was also the time when I was deep into RPGs and the country was going through the last spasms of the Cold War. “Threads,” “The Day After” and “Damnation Alley” were popular films, and my friends and I were into post-apocalypse games like “Gamma World,” “Aftermath!” and “Project Morrow.” My room was littered with maps of a post-WW3 America where half the coasts had sunk beneath the waves, mutants roamed the ruins of our cities, and humans eked out a precarious existence living in barbarous kingdoms.[2] As I was drafting this review, I also remembered Andre Norton’s Daybreak – 2250 A.D.[3] I should mention two things about the e-book edition. One, the proofing is atrocious. Someone must have scanned in a hard copy and given the results only a cursory glance. Two, somewhen they tacked on a second, tedious prologue and inserted a scene mid-book where Aldora befriends a mutated otter. Neither are necessary nor particularly interesting. I feel I’m watching Greedo shoot first.___________________________________I read this series in my callow youth. The first half-dozen or so are decent reading but if got harder and harder for me to get past the excessive homophobia and anti-clericalism."}, {"userName": "Greg (adds 2 TBR list daily) Hersom", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/2738872-greg-adds-2-tbr-list-daily-hersom", "userReview": "Review originally appeared in FantasyLiterature.com:After two centuries, the undying High Lord Milo Morai has returned to the Horseclans to lead them to their prophesied destiny. First they must conquer their enemies and the Witchmen — pre-holocaust scientists who have continued living by transplanting their minds into stolen bodies.I stole most of that synopsis from the back of the book, because I only made it to page sixty-nine, the end of chapter six, and I still hadn’t gotten to the meat of the story.I’ve wanted to get my hands on a copy of The Coming of the Horseclans for a while now. When I was a kid, I remember seeing these books on the grocery store magazine shelves or drugstore spinner racks, and later on at the mall bookstores in the Men’s Adventure section. I was already a fan of Conan and some other lesser-known sword & sorcery heroes, and just the name, “Horseclans,” stirred my blood. Add that to the exciting cover illustrations, which I now know were done by Ken Kelly, and I can’t explain why I never picked one up back then. (Most likely, I was just broke.) So, I really wanted to like this book and follow the rest of the series, which is eighteen books total.However, my nostalgia for old books I hadn’t read didn’t prove strong enough to carry me through. The two prologues — that’s right, two, titled “Prologue I” and “Prologue II” — were sheer torture to read. No lie, I could hear Ben Stein’s monotone voice as I read them. I hoped that once I got to the story, things would pick up, but they didn’t.I found nothing interesting about the hero, Milo Morai. He’s the typical macho character found in way too many cookie-cutter action-adventures. He has it all: good looks, skills (per Napoleon Dynamite, “Girls only want boyfriends who have great skills”), wealth, and brains. He doesn’t seem to be killable, or at least I never got to a point in the story that told of any Achilles’ heel. He knows how to telepathically communicate with horses and cats of the sabre-tooth variety. Women can’t resist him. They don’t even mind much when he enslaves them, which is kinda the Horseclans’ thing.The Horeseclans are basically a post-apocalyptic version of the Huns. They wander the far-future North American plains, raiding the local farmers and doing some trade business with the slaves and the plunder they acquire. Up to the point I stopped reading, they seem to be the dominating bad-asses of their time, which is helped by the fact that their enemies stupidly fall for any strategic trap Milo sets for them. Enemies that are so vile — they sexually abuse and murder young boys — and so idiotic, I can’t imagine why any subordinates would ever indulge them. And don’t even get me started on the unpronounceable languages of all these people.Adams takes the long way around to get to a point. Granted, maybe I would have gotten some clarification eventually if I’d have stuck with it. But I just couldn’t get motivated enough to bother. For a tale that is supposedly rife with combat and barbarian warriors, I was bored. Even the potential of sexy slave women couldn’t rouse my interest. ;)With all due respect to the late Robert Adams, I think these stories are just dated. Perhaps genre fiction of the mid-seventies, especially the adventurous sci-fi/fantasy geared toward a male readership, wasn’t taken as seriously by publishers back then as it is nowadays. The Coming of the Horseclans lacks sophistication and uniqueness when compared to current books of similar genre.Maybe I didn’t give Adams a fair shot. HORSECLANS fans, feel free to set me straight. I sincerely want to know if I just don’t get it."}, {"userName": "Rob", "userReviewDate": "Jan 22, 2012", "userURL": "http://www.goodreads.com/user/show/2217938-rob", "userReview": "I've heard about the Horseclans novels for some time, first in Maureen Birnbaum: Barbarian Swordsperson (a send-up, obviously) and then from other sources. So when I saw quite a beat-up copy at a library sale, I had to pick it up.This first novel is interesting, so far as 'Future Regressed' fantasy novels go. The characters occasionally do more 'telling' than I'd like to appraise this or that listener (and the reader) of this or that bit of history, but I suppose Adams has to get the notes he's built the novel on across to us somehow.There's some homophobia involved, but Adams does have one character claim the vilified characters are practicing a perversion of his race's (Greek) customs. Really, what's being decried is mainly child rape. Interestingly, though, apparently heterosexual rape is okay, so long as the victim is of a proper age.All in all, I don't know how to take Adams yet. On the one hand, he presents his world in a 'this is how things are now' fashion, and, as I know it's to some extent how things have been, it's hard to fault him too much. On the other hand, he does present a character from a more civilized time who doesn't bat an eye, mostly, at what the world has become.So I can't decide whether Adams is some starry-eyed atavist, or a writer who sees himself 'telling it like it is,' if you follow me. I scored quite a few of these at a library sale, though, so I think I'm going to see where he goes."}, {"userName": "S.E. Lindberg", "userReviewDate": "Mar 29, 2012", "userURL": "http://www.goodreads.com/user/show/5966698-s-e-lindberg", "userReview": "Fans of military fantasy with Sword & Sorcery traits will enjoy this (David Gemmell and Karl Wagner were better writers, but fans of theirs would enjoy this opener of the Horseclans series). The premise is ostensibly apocalyptic sci-fi, but really it appears as a gritty epic fantasy (i.e. no bullets or lasers or machines, just barbarian hordes, swords and some mutant-telepathy and immortality mixed in). Cover artist Ken Kelly did a superb job, and arguably was more successful than the author in presenting/creating the world. Truthfully, it is worth tracking these out of print books down just for the cover art. It is an interesting opening book, and since I am compelled to read the next book (Swords of the Horesclans) I rate it 4/5."}, {"userName": "Peter Cook", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/52891090-peter-cook", "userReview": "I found the contents of this book so foul that I have refused to read another single word by this author for the decades since I read it. I would rate it zero stars if the platform allowed it. I have cherished books since the age of six and have tried my best to take care of the physical books I own. If I still had a copy of this book, I would destroy it without hesitation."}, {"userName": "[Name Redacted]", "userReviewDate": "Aug 04, 2015", "userURL": "http://www.goodreads.com/user/show/287915-name-redacted", "userReview": "It lost me at the line about the captive women taken by the hero's warband being \"well-raped.\" NOPE. I can't just give it a single star because it may get better, it may subvert that, it may critique that, but so far it hasn't and I'm done."}, {"userName": "Charles", "userReviewDate": "Jul 18, 2008", "userURL": "http://www.goodreads.com/user/show/1336573-charles", "userReview": "The first in the Horseclans series. I give it four stars mainly for that. It's a good story but probably 3 and a half stars might be a better rating. I'm not a big fan of \"undying\" heroes since it seems relatively easy to be a hero if you don't have to worry about actually getting killed."}, {"userName": "Dalton Wolf", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/17473901-dalton-wolf", "userReview": "Ok, I haven’t read these in 30 years, and I’m getting ready to read them again, so I may change this rating. Others have explained the storyline. I want to talk about why it was great to me, as a young adult, reading this author. This was one of the most influential series to me in my teen days. After Lord of the Rings, The Belgariad, and the Hitchhiker’s series, it still stands among my favorites to this day. Perhaps not for the high quality of the writing so much as what I learned from the author. It has always bothered me when someone says after having read a book, or having given up on one, that \"There are chapters that don't mean anything,\" or \"What was the point of that scene?\" or “The author loves to fill space with unnecessary trivial information,” or \"There were flashbacks that were unnecessary.” I think to myself, do these people understand that they are reading fiction, and not Non-Fiction? This guy (Robert Adams) got it, though, and was instrumental in teaching me the truth at a very young age that fictional stories don’t have to ‘mean’ anything. And every chapter doesn’t have to stay on a single linear track towards the end and make a point. They are not essays. They exist purely for entertainment purposes, not to give meaning to life. Every reader should be reminded to suspend belief and try to enjoy themselves before reading a work of fiction. Yes, I think maybe that should be international law. Not that the Horseclans stories strayed from the storyline a lot. They didn’t. But the Author constantly reminding me to take them with a grain of salt and to just enjoy them, and then by telling such an involved and entertaining story really put weight behind his words. Where a lesser writer might have let the message get lost along the way, his words allowed me to have a greater appreciation for so many other authors I might not have read had I not already learned to open my mind as I opened the pages of a book.Anyway, my point is, these books were just sheer entertainment, a guilty pleasure, and anyone who likes a good juicy sword and sorcery tale (with some technology eventually added because the story is set a few centuries after the fall of our society) should enjoy it and most of the series. I’m thinking especially teen boys would love them the most. I believe I got tired of them around book 10, with the loss of one of my favorite characters, but I still read a few more after that. I think this was my favorite, I hope you make it that far:https://www.goodreads.com/book/show/1... This one was a close second if I recall: https://www.goodreads.com/book/show/5..."}, {"userName": "Al Datum", "userReviewDate": "Apr 21, 2011", "userURL": "http://www.goodreads.com/user/show/5292677-al-datum", "userReview": "The great thing about the Horseclans series is the concept itself. Adam's books (I think there are 17 of them and then a couple where other authors wrote short stories to contribute to his world) are easy reads and are quite fun. The story is simple...a post-apocalyptic landscape that has recovered to varying degrees, but where death is still quite common.In this world roam the Horseclans, large tribes of nomadic people who roam North America in ways similar to how American Indians may once have done. But the Horseclans are different. They are telepathic, able to communicate with animals (especially their horses) and their technology is closer to the medieval period (horses are armored, as are their riders, etc.).The main character of the Horseclans is its leader, Milo Morai, who is an undying man of indeterminate age (we know he was alive at least as far back as World War 2). He is one of only a very few undying people, and because of this he is sought by one of the Horseclans' chief rivals, the Witch Men. The Witch Men are ancient scientists who live on in the bodies of their victims who they use as hosts. They are interested in learning the secret of undying so they can also live forever (without having to steal and use others' bodies).The Horseclans books are filled with warfare on a grand scale, but the interpersonal stories of its characters are not lost in the process. The first book describes how Milo becomes the leader of the Horseclans and leads them on a pilgrimage to establish their own lands.The books are short (and somewhat hard to find in good shape these days), but there is much depth in the few pages of each volume. For those interested in post-apocalyptic literature, this is some of my favorite. Excellent science fantasy that rivals anything else in its genre. Grab a copy at your used bookstore before others beat you to it."}, {"userName": "Jake", "userReviewDate": "Jul 11, 2008", "userURL": "http://www.goodreads.com/user/show/972904-jake", "userReview": "Set in 27th century post-apocalyptic America, the Coming of the Horseclans tells the story of Milo of Morai, an immortal mutant from the 20th century, who has returned to the Horseclans to fulfill a prophecy and return them to their ancestral home. He leads them across a ruined America in battles with decadent city-dwellers, encounters more Undying (immortals like himself), and generally, has interesting adventures. The book is the first in a long series, and ends on a bit of a cliffhanger.This is great, fun, fiction. Deep? Not according to Adam’s own introduction:The following tale is a fantasy, pure and simple. It is a flight of sheer imagination. It contains no hidden meanings, and none should be read into it; none of the sociological, economic, political, religious, or racial “messages” with which far too many modern novels abound are herein contained. The Coming of the Horseclans is, rather, intended for the enjoyment of any man or woman who has ever felt a twinge of that atavistic urge to draw a yard of sharp, flashing steel and with a wild war cry recklessly spur a vicious stallion against impossible odds.And you know what? He’s right. Oh sure, I suppose I could try and analyze the crap out of this thing, and find socio-political meaning in it somewhere…but that would ruin the novel. If you’re going to read this (and I heartily recommend you do, especially if you’re a fan of pulp fiction), read it to enjoy it, not beat it to death with analysis. Enjoy the crazy, gory battles, the psychic cats and horses who aid the Horseclans (Why are they psychic? Who cares?), and the strange and intricate politics of the world. But don’t analyze it. You’ll miss the point."}, {"userName": "Jeff Powers", "userReviewDate": "Mar 14, 2015", "userURL": "http://www.goodreads.com/user/show/28415586-jeff-powers", "userReview": "As an illustrator, I am often drawn to books by their covers. Especially classic painted covers. It was Kelly's work that made me pick up this series in a local charity shop. It was the dirt cheap price that made me pick up 14 volumes of them. Once I finally started in on the first volume, I found the premise intriguing. I am a big fan of post apocalyptic fantasy. From Gemmel's Jon Shadow series, to the classic animated series, Thundarr. I even run an epic fantasy rpg set in a post apocalyptic America. So with a cool premise and interesting setting, why only two stars? Robert Adams writing is passable, and not beyond what can be expected from classic sword and sorcery pulps. His sentences are filled with adjectives and flourish. He relishes in world building. But almost to a fault. Little of the story is spent on exposition outside of battle scenes, and much of the dialogue is spent further fleshing out the world. This wouldn't be a big deal for a first volume in a series, if it really felt Adams was trying to get anywhere. But the biggest problem this and subsequent volumes suffer from is the growing sense that Adams is just a jerk. His opinion of women and homosexuality is far from varied in his characters. Every female character is sexual assaulted, and according to the protagonists, that is okay as long as they aren't children. Misogyny is common in this genre, but for the time these were written, this blatant disregard for any sense of sexual politics is just ridiculous. It is cringe-worthy and as the book progresses, harder and harder to ignore. No amount of psychic battle cats can cover that up."}, {"userName": "Timothy Boyd", "userReviewDate": "Jan 22, 2016", "userURL": "http://www.goodreads.com/user/show/22819383-timothy-boyd", "userReview": "The Horseclans series is probably the best blend of fantasy and SiFi I have ever read. Pretty much something for everyone in these books. Great characters, epic storyline, fantastic writings. My highest recommendation"}, {"userName": "mirba", "userReviewDate": "Jun 09, 2009", "userURL": "http://www.goodreads.com/user/show/2330558-mirba", "userReview": "I'm quite divided in my opinion about this book. I love the telepatby with horses part, but I profoundly hate the male-are-better part of it."}, {"userName": "Brett Thomasson", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/19658976-brett-thomasson", "userReview": "The post-apocalyptic setting of Robert Adams multi-volume Horseclans series is important mainly as a backdrop, but in a much different way. The plains and eastern U.S. after a devastating nuclear war functions like Robert E. Howard's Hyborean Age -- as a backdrop for some down-and-dirty sword-slinging, hacking and slashing action.In the series' first novel, 1975's The Coming of the Horseclans, we meet Milo Morai, a man who has lived for centuries, saw the nuclear holocaust of 1980 and helped its survivors develop a nomadic culture modeled on different plains Indian tribes. Milo is one of the Undying, a group of immortals who can be killed only by suffocation, decapitation or drowning. He had sought others of his kind but not found them, so when the novel begins he is returning to the Horseclan people he founded. They have flourished, communicating telepathically with their mounts and with genetically engineered saber-toothed cats developed before the war. The bulk of the novel recounts how the Horseclans invade the decadent kingdom of the Ehlens (Hellenes), Kenooryos Ehlas. These Greek-speaking people had invaded the U.S. after the war and established themselves on the Eastern seaboard.Throughout the novel -- and the whole series -- Adams stops now and again to lecture about politics, religion and the corrupting effects of civilization. These exposition asides frequently stall the narrative and have the additional effect of making the author appear like a jerk if you happen to hold one of those opinions on the downside of his literary nose.Features such as that lessen the fun of what should be a big ol' sword-and-sorcery romp across the remnants of the old world, and Adams is simply not enough of a stylist like Howard and other earlier writers to overlook the digressions. The tale-spinner's inability to know when to shut up and spin leaves Coming and the rest of the Horseclans series at a solid C+ instead of the B or B+ its elements give it the potential to be. Original available here."}, {"userName": "Ken", "userReviewDate": "Apr 20, 2012", "userURL": "http://www.goodreads.com/user/show/2079274-ken", "userReview": "I originally read this as a teenager and thought it was pretty good. This re read , wenty five to Thirty years later some of the shine as worn off.Milo Morai has returned to North American after a fruitless 200 year search for others like him. He is immortal. He makes his way from Mexico (I think) to what was the United States. He has returned to his people he guided from frightened people after the Apocalypse to a proud group of Nomads called the Horseclans. They have a prophesy that they will have a new homeland and that time is now. They must move through hostile territory. Scientists from before the Apocalypse who have artificially made themselves immortal. Greek invaders (I think) who invaded North America a couple of generations past. Milo also meets others of his kind.I remember the book being better. I reads as three or four novellas tied together. As some other reviewers have pointed out, the bad guys are all pedophiles and gay which is kinda repetitive after a while. Also the book is pretty graphic in terms of violence. Some scenes were cringe worthy. Guess as a teenager it didn't even register. I thought the whole immortal thing was pretty neat and I liked the book and its ideas, it is a product of the time and will continue with the re read this summer."}, {"userName": "Mohammad Ali Abedi", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/22641312-mohammad-ali-abedi", "userReview": "(There are 18 books, and I read until Book 10, Bili the Axe)I read a bunch of these books, and eventually I got bored of it, but man, what a ride. The story is set in a post-apocalypse world. Everything has gone wrong, from nuclear warfare to plagues, so nothing remains from our time. This new world is run by barbarians and swords. In the new world, there are a few changes. Some clans have the ability to mindspeak to a few select animals, such as big cats (which are more like panthers), and a select few have the power of immortality. Such as our main character, the Undying High Lord Milo!Milo starts up as a small clan leader, and eventually his clan starts growing bigger as the novels progress.The series is a manly fantasy story with none of the silly dancing elves stuff. Every few pages, someone gets either killed or raped, and the good guys usually are responsible for both. There isn’t a really strong plot or characters to speak off, but if you have to want to pretend you are a man and raping some villagers and chopping off heads, then it can be fun."}, {"userName": "Lorrie", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/47550128-lorrie", "userReview": "I get so frustrated with books like this. I realize that it was published 40 years ago, but for me that is no excuse. I HATE books where the author tries to be too cute or clever with the naming of the characters. For the love of whatever higher deity you may worship or believe in, name your characters something that is easy to pronounce, where we don't have to think every single damn time we come across it. Oh, and paragraph breaks are your friend. Having dialog that goes on for (and I seriously wish I was exaggerating here) and ENTIRE CHAPTER without a paragraph break OR so much as a break at all. We're talking 10 consecutive screens on my Kobo without a paragraph break. Seriously. Just stop doing stupid shit like that.On top of this, this book doesn't seem to have an actual story. Sure, the plot takes us from point A to point B, but it's more like a recounting of historical events rather than a story with a start, middle and end."}, {"userName": "Devon  Start", "userReviewDate": "Jul 18, 2008", "userURL": "http://www.goodreads.com/user/show/1338928-devon-start", "userReview": "this is another of the books/series i read from my fathers bookshelf when i was a lad.the horseclans takes place in the far future after a serious nuclear war.(is there really any other kind?)the main leader is milo morai an imortal. see some people have been born in our time, and they never die(unles drown or beheaded or burned) milo is one such and he leads his horseclans, a nomadic like people. across the country.(what was the US) its got a fantasy aspect as tehy use swords(except a set of scientists in one of the book that have been stealing bodies and transfering thier minds to them before they die, they use guns)i rather liked them when i was a youngin' cant say i would as an adult"}, {"userName": "Bob", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/5830517-bob", "userReview": "I read this series when I was in high school. I recall it was kind of cheesy but enjoyable. 30 years later it is even cheesier and less enjoyable. It was difficult to get past the first quarter of the book. I finally did though and am glad for it. The story and setting is interesting but the \"slave girl\" motif made it obvious this was written in another time. It actually turned out not to be as bad as I thought once I pushed through. It kind of reminded me of drinking cheap beer that still refreshes on a hot day. Fine wine this book is not. I do not feel motivated to read any of the other books in the series again but haven't completely ruled it out. They could come in handy sometime. After all, on a hot day I don't want to sip on fine wine. There are times and places for frosty cheap beer..."}, {"userName": "SFReader", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/678629-sfreader", "userReview": "Robert Adam (born in 1933 as Franklin Robert Adams) died in 1990. He was in the military and had a very strong interest in history, including medieval warfare and weapons, to the point of even plying a forge to make his own reproductions. His interest is evident in the details of his writing, which, while some readers might find overburdening at times, leaves no doubt as to his authority of the subject. His style is very action oriented and reminds me quite a bit of Robert Howard and his Conan stories. The violence can be pretty graphic at times. The Coming of the Horseclans review at SFReader.com"}, {"userName": "Kevin", "userReviewDate": "Oct 06, 2008", "userURL": "http://www.goodreads.com/user/show/1052380-kevin", "userReview": "Concept --- post nuclear war & plagues, several people who were immortal rally humanity and over a period of hundreds of years, try to rebuild civilization on the back of telepathic humans, horses and genetically engineered saber toothed tigers.Yes, I did just write that. Execution -- spotty at best, especially after the author's trials for tax evasion went south and the books became his rants against the gubbmit, and the later novels are little more than cut & paste of scenes from earlier and flashbacks to WWII. Best of: Conan taught me what \"crimson\" was; Horseclans taught me what \"impalement\" is. LOTS of gratuitous sex and violence, so it was perfect fare for a teenager. In terms of larger than life heroes, its a shame so many people have never heard of Bili the Axe."}, {"userName": "Jim", "userReviewDate": "Dec 19, 2007", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "I've reread this a couple of times over the years. The first few books are pretty good. Nothing superb, but a fun, fast read if you like this kind of thing. It's more of a fantasy, but there is a Science Fiction basis - it's a post apocalyptic (nuclear war) world where a nomadic people are the good guys. Some super msart animals, a few immortals & such dropped in.After about book 6 or 7, I got a little worn out with the series. I've been meaning to go back & read it again, since I didn't have the entire series all at once, but read it out of order, in scattered pieces across the years."}, {"userName": "Celtic", "userReviewDate": "Sep 28, 2015", "userURL": "http://www.goodreads.com/user/show/5381315-celtic", "userReview": "I first read this book so long ago (I think before the apocalypse it predicts for 1980) I could remember only quite liking it at the time. Rereading it I can see why the storyline of 'noble savages fighting corrupt enemies to win their way to the promised land' would have appealed to my teenage self, especially accompanied by a smattering of near immortality, psychic horses and sabre tooth tiger sized 'cats'.What strikes me now is that the overall violence and savagery is the backdrop to (possibly excuse for) appalling misogyny (pretty much every woman who appears is raped), homophobia (the 'degenerate' enemy) and sustained fascist tropes. Sometimes it's best not to go back."}, {"userName": "Neal Schlegel", "userReviewDate": "May 03, 2008", "userURL": "http://www.goodreads.com/user/show/1135644-neal-schlegel", "userReview": "I like this genre of writing post apocalyptic survival some people find it dreary but I find it reassuring in this world of sue happy lawyers political correctness where people hide behind laws and verbally harrass the noble and brave for their views if they were living in anera as early as the 1860's they still would be called out to the field of honor to back up their slanderous accusations but our cowardly world has virtually removed that word from our language. I long for a return to a simpler world where the strength of your sword arm could propel you to nobility in the service of your liege. N"}, {"userName": "Daniel", "userReviewDate": "Jan 18, 2016", "userURL": "http://www.goodreads.com/user/show/3148536-daniel", "userReview": "I read this when it came out and it was like reading something from Robert E. Howard. Kind of post-apocalyptic and yet very feudal and medieval. Great action scenes and riveting characters. Roving the \"Sea of Grass\" and still the writer explained places in America that still were appreciable though these books were in the failed humanity of the far future. What did we do to each other and our land? To sum up this book..... Mad Max, featuring Genghis Kahn, on horses.... in the heartland of the United States. Wow! How good does that sound?Danny"}, {"userName": "Edward Rosenfeld", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/4349169-edward-rosenfeld", "userReview": "I first encountered the Horseclans books when they were first published, yea these many years gone past. Just over the last few days I have made the decision to re-read them, So far I have finished the first three volume's and am well into the fourth. I must say, that they have aged well, and I still think they are an enjoyable read. I recommend them to anyone who like a good adventure and is into the post apocalyptic genre.Happy reading.....Today, 11-26-2016 beginning re-read of this series......"}, {"userName": "Jaq", "userReviewDate": "Jun 04, 2013", "userURL": "http://www.goodreads.com/user/show/18534784-jaq", "userReview": "Okay, it's been more than thirty years since I first ventured forth with these books, and I was hesitant about going back to reread them. Would I still like them? Well I still do, it's a ripping yarn, told through a series of different characters viewpoints. As a parent I did struggle with the trials of the children and young people who survive in this far future. (What is with the female characters too????)I'll now see if I can find the second book and sally forth again across the great plains, with the Cats, Horses and Clansfolk."}, {"userName": "Dave Moore", "userReviewDate": "Sep 12, 2009", "userURL": "http://www.goodreads.com/user/show/2706369-dave-moore", "userReview": "The writing style of the late Mr Adams takes a little 'getting used to', in that he paints his novels with broad strokes rather than fine detail. These, however, are the action/fantasy novels that led me to discover the mastery of Michael Moorcock. F. Robert Adams is the master of alternate history & post-apocalyptic fiction. These stories are worth a read for their brutal, yet strangely noble flavor."}, {"userName": "Bryan457", "userReviewDate": "Nov 05, 2010", "userURL": "http://www.goodreads.com/user/show/252806-bryan457", "userReview": "The first Horseclans book has the undying Milo Morai leading his people to the eastern seaboard. Most of the story takes place at the end of this 20 year trek and centers on the battles that take place, the new undying who are found and introduces the meddling body switching witchmen.Fairly graphic in the gore, rape and torture department.I really like the undying characters, and the telepathic bonds with the cats and horses.Reread 10/30/2011"}], "description": "Prophecy Written in Blood! After two hundred years of seaching for other immortals, the Undying High Lord Milo Morai has returned to the Horseclans to fulfill an ancient prophecy and lead them to their destined homeland by the sea. But in their path wait the armed might of the Ehleenee and an enemy even more treacherous-the Witchmen-pre-Holocaust scientists who have survived the centuries by stealing other men's bodies to house their evil minds and who have in their hidden stronghold the means of destroying all who will not become their willing slaves. Can even Milo save the Horseclans from the bloodthirsty Ehleenee and the malevolent Witchmen who would rip him to shreads to discover his secret of immortality?", "title": "The Coming of the Horseclans\n      \n          (Horseclans #1)", "url": "http://www.goodreads.com/book/show/1807649.The_Coming_of_the_Horseclans", "average": 3.75, "cover": "https://images.gr-assets.com/books/1359323619l/1807649.jpg", "reviews": 63, "authors": [{"url": "https://www.goodreads.com/author/show/7244324.Robert_Adams", "name": "Robert   Adams"}], "type": ["Fantasy", "Science Fiction", "Apocalyptic", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/1807649.The_Coming_of_the_Horseclans", "http://www.goodreads.com/book/show/6115082-the-coming-of-the-horseclans", "http://www.goodreads.com/book/show/3361165-the-coming-of-the-horseclans", "http://www.goodreads.com/book/show/8260686-the-coming-of-the-horseclans", "http://www.goodreads.com/book/show/394979.The_Coming_of_the_Horseclans", "http://www.goodreads.com/book/show/1720907.Swords_of_the_Horseclans", "http://www.goodreads.com/book/show/1807660.Revenge_of_the_Horseclans", "http://www.goodreads.com/book/show/1296012.A_Cat_of_Silvery_Hue", "http://www.goodreads.com/book/show/582700.Bili_the_Axe", "http://www.goodreads.com/book/show/1808209.The_Savage_Mountains", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}