{"ratings": 70, "userreviews": [{"userName": "Tosh", "userReviewDate": "Mar 26, 2008", "userURL": "http://www.goodreads.com/user/show/133661-tosh", "userReview": "Andre Bazin was one of the great fuels that started the French New Wave in cinema. Here he discusses Bunuel among others - and maybe the first (no, the Surrealist writers on cinema were the first!) to comment on the nature of 'cruelty' between audience and filmmakers."}, {"userName": " Salma", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/40227920-salma", "userReview": "\"ينظر الفنان بصورة أكثر بعدًا نحو حقيقة تتجاوز الأخلاق وعلم الاجتماع؛ حقيقةميتافيزيقية؛ قسوة الشرط الإنساني.\"لهيب الجحيم السينمائي أو السينما كوسيلة للكشف ..شتروهايم، دراير، بونويل وغيرهمالكتاب متقدم عن المرحلة اللي أنا فيها..أفلام كتير ماشفتهاش اتفرجت على حاجات منها وانا بقراومبسوطة اني عرفت المخرج الياباني ميزوغوشي :\")"}, {"userName": "Ivan Labayne", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/7591561-ivan-labayne", "userReview": "bunuel dreamt of \"doing nothing,\" dreyer sought to capture \"the ambiguity of death,\" hitchcock wanted to \"achieve the quality of imperfection\" and kurosawa was second to a director i haven't even head of, mizoguchi. hitchcock seemded to pose an interesting \"paradox\" for bazin: it was easy to make an 'artistic' film but the real difficulty lay in making a GOOD COMMERCIAL film. truffaut merely introducing a book by bazin; was godard a good writer at all?"}, {"userName": "Mark", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/76242235-mark", "userReview": "Très inégal. Des passages intéressants."}, {"userName": "Jess", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/7111077-jess", "userReview": "I think I didn't enjoy this as much as I could because there were a good handful of movies discussed I haven't seen, but some really great insightful on classic horror/thriller/gore films."}, {"userName": "Patrick McCoy", "userReviewDate": "Nov 30, 2015", "userURL": "http://www.goodreads.com/user/show/678506-patrick-mccoy", "userReview": "I was intrigued by the title and directors discussed by Andre Bazin in his book The Cinema Of Cruelty: from Bunuel to Hitchcock (1975). It is edited with an introduction by critic and film maker Francious Truffant. Here Bazin gives critical observations on a number of films by the directors listed in the book without resorting too much to story summary or plot. He inspires me to see more of the films by these directors. The title leaves out director Eric von Stromheim, Car Theodor Dreyer, Preston Sturges, and Akira Kurosawa. I didn't know anything about von Stronheim as a director. I only know him from his impressive performance in Jean Renoir's masterpiece The Grand Illusion. So I would be interested in seeing some of his films some time. Dreyer is almost universally respected, but I have to date only seen The Passion of Joan of Arc and Vampyr. I suspect that Ordet would be the next film to see. As for Sturges, I have seen Sullivan's Travels and Unfaithfully Yours. I want to see The Lady Eve and The Palm Beach Story. Undoubtedly, Bunuel is a master of cinema and the one I know probably the least about in this book since I have only seen Belle de Jour The Discrete Charm of the Bourgeoisie . I certainly need to see Los Olviadados. Hitchcock is a director whose reputation I was aware of from a young age, but I still haven't seen so many of his films. As far as I can recall: The Thirty Nine Steps, Rebecca, Suspicion, Strangers On A Train, Dial M For Murder, Rear Window, Vertigo, North By Northwest, Pyscho, and The Birds. So there are still a few left that are worth searching out. I think The Man Who Knew Too Much sounds like a good one to see next. Kurosawa is the director I am most familiar with since it the door into which i began to delve deeper into cinema and Japanese cinema in particular. I have seen all of his films. He focuses on Seven Samurai and Ikiru, while alluding to the cult of Mizoguchi among French critics-Bazin, himself included."}, {"userName": "Sarar", "userReviewDate": "Mar 06, 2015", "userURL": "http://www.goodreads.com/user/show/8641727-sarar", "userReview": "نبذة حول الكتابنبدأ من ايريك فون شتروهايم مروراً بكارل تيودور دراير، لويس بونويل وصولاً الى هيتشكوك و كوروساوا.شتروهايم الذي سمعت به للمرة الأولى من خلال هذا الكتاب كان من طليعيي سينما القسوة، متشدد في واقعيته، أفلامه من أكثر الأفلام التي تتعذر العودة الى مشاهدتها هذه الأيام. هذه الأعمال القصيرة واللامعة باقية في ذاكرة الذين سحرتهم مرحلتها. شتروهايم الذي غير في مفهوم الجنس على الشاشة والعنف المسيطر والطاغي في أفلامه يجعلنا بتلك الأعمال نندفع نحو جحيم السينمادراير \"المظلوم\" بمشاعر التدين التي تطبع اختياره لمواضيعه يعرف الطبيعة اكثر من عالم طبيعي ويعرف الانسان اكثر من عالم في طبائع الإنسان فهو يعتمد على صراحة شخصياتهبونويل بحالته التي هي من أكثر الحالات اثارة للفضول في تاريخ السينما قسوته موضوعية كلياً، إنها صحوة. وجوهه الأكثر إثارة للرعب ذات محيا إنساني وحضور للجمال في أعماله في ما هو فظيع وبحث عن الجوانب الأكثر تطرفاً لدى الأشخاصهيتشكوك سيد الترقب، كل فيلم من أفلامه هو رحلة مدهشةالى اعماق التقنية لكنها نفس دهشتنا مع الألعاب النارية حين نتفرج ونحن نترقب معرفة ما اذا كان هناك المزيد. ليس هناك من هو أكثر تمنكاً منه في التحكم بالمشاهد وفي تقديمه اليه الجرعة المحددة من الاثارة المقررةكوروساوا الغني عن التعريف وفيلمه \"العيش\" بمراسم الدفن الأبدية كل هؤلاء المخرجين لهم وجهة نظر انقلابية واسلوب متميز ونجد وراء أفلامهم الإنسان الأخلاقي"}, {"userName": "Rida Hariri", "userReviewDate": "Apr 16, 2012", "userURL": "http://www.goodreads.com/user/show/6207313-rida-hariri", "userReview": "كتاب جميل جدًا يفيد بالتعرف على عدد من كبار السينمائيين,,قدم له فرنسوا تروفو الذي تتلمذ على يديّ بازان.يتحدث الكتاب عن كل من : فون شتروهايم,دراير,ستورغيس,بونويل,هيتشكوك وأكيرا كوروساوا ومن الواضح أثر تروفو في الكتاب حيث أن القسم الاكبر من المقالات كانت تدور حول هيتشكوك والذي أخذ الحديث عنه مساحة تعادل ثلث الكتاب تقريبًا,بينما جاء الحديث عن دراير مختصرًا رغم أنني كنت اتمنى المزيد من الحديث عنه كونه من المخرجين الذين أثروا في كثيرًا إضافة لكونه مجهولًا من قبل الكثيرين.المديح الكبير لفون شتروهايم سيدفعانني لمزيد من البحث عنه وقد سبق وشاهدته ممثلًا في فيلم بيلي وايلدر جادة الغروب..أيضًا هناك نقطة أعجيتني وهي الصداقة والتقارب في الآراء الذي كان موجود بين بازان ولويس بونويل الأمر الذي أشعر أنه قليلًا ما يحدث بين النقاد و الفنانين."}, {"userName": "Carlos Arsenio Garcia", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/13408854-carlos-arsenio-garcia", "userReview": "I honestly only really got this book for the sections on Hitchcock and Kurosawa but I learned a lot more about the cinema."}], "description": "", "title": "The Cinema of Cruelty: From Buñuel to Hitchcock", "url": "http://www.goodreads.com/book/show/482502.The_Cinema_of_Cruelty", "average": 3.91, "cover": "https://images.gr-assets.com/books/1370252183l/482502.jpg", "reviews": 9, "authors": [{"url": "https://www.goodreads.com/author/show/40962.Andr_Bazin", "name": "André Bazin"}, {"url": "https://www.goodreads.com/author/show/30022.Fran_ois_Truffaut", "name": "François Truffaut"}], "type": ["Culture", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/482502.The_Cinema_of_Cruelty", "http://www.goodreads.com/book/show/13604110", "http://www.goodreads.com/book/show/72410.Le_Cin_ma_De_La_Cruaut_", "http://www.goodreads.com/book/show/72401.What_is_Cinema_", "http://www.goodreads.com/book/show/1202031.What_is_Cinema_", "http://www.goodreads.com/book/show/72407.Qu_est_ce_que_le_cin_ma_", "http://www.goodreads.com/book/show/72403.Orson_Welles", "http://www.goodreads.com/book/show/72400.Jean_Renoir"]}