{"ratings": 65, "userreviews": [{"userName": "Will Byrnes", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "Although I know of no hypothesis that adequately covers the mountainous evidence,” [he] said in closing, “this should not and must not deter us from following the advice of Schroedinger: to be curious, capable of being astonished, and eager to find out.”\nQuiz time. Ok, what is a close encounter of the first kind? Second kind? Third? You might be forgiven for not knowing with much precision the answers to the first two, but I bet you can answer number three. You probably think you have Stephen Spielberg to thank for that particular item. Well, I guess you do. But neither Spielberg nor his writers came up with that structure for describing the levels of possible UFO encounters. In fact, Spielberg was all set to steal the intel until the guy who actually came up with it, hearing about the film project, sent the director a polite letter pointing out the ripoff, one of many. Spielberg had borrowed liberally from the man’s reports on sightings, as laid out in his 1972 book The UFO Experience: A scientific enquiry. The scientist in question was one Josef Allen Hynek. Spielberg brought him in and paid him a pittance to be a “consultant” on the film. Hynek even got a cameo, six whole seconds. If you have never heard of him before, welcome to the club. Josef Allen Hynek - from the author’s site J. Allen Hynek, the child of Czech immigrants, was born in Chicago in 1910. He had two careers, often simultaneously. First, he was a world class, forward looking astrophysicist, who, as a young Turk, had the nerve to point out errors in the data put out by the Mount Wilson Observatory, which did not win him any friends. He helped develop a proximity fuse for the US Navy in World War II. Seeing that scientists could be brought together to address large problems in wartime, he was eager to do the same in peacetime, and made good on that dream, developing technology and organizing teams of amateur scientists around the world to track American satellites in the 1950s. In addition. his view of the possibilities of orbital science were ahead of his time. \n In a television news interview that aired in 1958, Hynek urged the construction of a “National Space Observatory”…claiming that a space based observatory would “pay great and immediate dividends” in new scientific knowledge… “From a space observatory we could see the surface of planets with unimaginable clarity even with a small telescope,” Hynek said. In addition to revolutionizing astronomical observing, Hynek’s proposed telescope could also be trained on Earth itself, making real-time weather data “continuously available to weather forecasters over the world” and leading to “greater knowledge of basic weather causes that would result in more reliable long-range forecasts.” Hynek was, of course, describing the Hubble Space Telescope a mere thirty–two years before its launch, while throwing in a little preview of TIROS-1, the first successful weather satellite, to be launched two years hence, in 1960.\n Then there was his other career. Actually, the two converged. Interest in UFOs increased in the late 1940s and early 1950s, as there were more and more eyes on the skies, and equipment with which to record sightings was more widely available. Who hasn’t heard of Roswell? But you may not have heard of Kenneth Arnold, who, on June 24, 1947, while flying his plane across the Cascades to Yakima, WA, spotted nine objects in the sky, that he judged flew at about 1200 miles per hour. He called this ahead to the Yakima field and was dismissed by the personnel there. But when he continued on to Pendleton, OR, he was interviewed by reporters. One took his description of the craft he had seen and added a bit of flourish. Thus was born the term “flying saucers.”The Thing From Another World runs into a bit of resistancePopular media fanned the flames. In 1951, Howard Hawks produced The Thing from Another World, which stoked popular interest. The April 7, 1952 issue of Life magazine, one of the most popular media outlets in the country, prompted even more interest in the subject with a major article on UFOs, despite the fact that the cover photo on that issue may have generated a lot more interest of a different sort. Image from NICAP.ORGThe appearance of pips (not led by Gladys Knight) over Washington D.C on multiple occasions during the summer of 1952, gave the military pause, particularly as they sent up fighter jets to intercept the intruders, only to have the UFOs zoom away at incredible speeds. One Air Control radar registed speed in excess of 7,000 mph. As someone particularly knowledgeable about studying starlight and other astronomical phenomena, Hynek was brought in when the government finally decided that the increase in UFO sightings needed some looking into. You may have heard of Project Blue Book, but there were other such programs before it. All pretty much dedicated to stifling sighting reports and using scientific analysis to come up with credible explanations (alternate facts?) for what people had seen. Swamp gas, weather balloons, hoaxes and inebriation were popular. And if you are looking to debunk sightings, there are always plenty of other explanations one can come up with. Hynek’s ability to piss people off did not end with his professional faux pas re Mount Wilson. His work as a paid debunker gained him a whole new population of haters. Mark O’Connell - from his siteBut one of the things about being sent to check out a large number of supposed UFO sightings is that sometimes it is not so easy to call “bullshit.” Sometimes the observers are highly trained military personnel, sometimes professional pilots, sometimes law enforcement officerswith no history of mental or substance weirdness, sometimes the clergy, sometimes very observant, sane, persuasive witnesses. It takes a toll after a while. You start to wonder if there might not actually be something out there. And if you are a real scientist, with commitment to the notion that facts are facts, eventually you find yourself more open to the possibilities. The line had been crossed.Parking for aliens only - from the WB archivesWhile he was still brought in by the government to investigate UFO sightings, it could no longer be assumed that his employers would be getting the answers they wanted. He became a prominent, credible public persona for those who believed that UFOs were real, the Neil DeGrasse Tyson of UFOlogy. He even started his own organization, The Center for UFO Studies.Mark O’Connell’s bio takes no position, well overtly anyway, on the real/not-real positions in the UFO debate. But he includes in each chapter a tale of a credible sighting. He also became an accredited UFO investigator and began hosting a site to report on that experience, so he can certainly claim a leaning. He says:\n I didn’t set out to prove anything one way or another, and so I never had to worry about painting myself into a logical corner, or closing my book with a disappointing let-down. I think that, by recounting the history of UFOs through the eyes of Dr. Hynek, who was literally on the scene within hours or days of many of the most spectacular UFO incidents on record, and mirroring Hynek’s open-minded approach to these incidents, I give the reader a new way to experience the UFO phenomenon without feeling silly about it. I try not to persuade the reader one way or another, but to present the facts of the cases, Joe Friday-style, as they were reported by the witnesses, by the Air Force, and by Dr. Hynek, and let the reader draw his or her own conclusions.\nHe does a solid job of detailing Hynek’s life in science, his entry into studying the UFO phenomenon, and his role in the ongoing research. Hynek’s personal life is given cursory consideration. There are many political skirmishes that O’Connell goes into. Some are significant, debunk-crazed bosses burying data, for example. A major public scientist treating his views on UFOs with withering scorn, if not much actual analysis. Some are less interesting, office politics at an organization he was directing later in his life. The level of detail sometimes gets in the way of keeping the narrative moving. Some smaller battles could have been omitted. A strength of the book is that O’Connell gives us a blow-by-blow account of how UFOs became a public concern. He explains how public interest grew and shows how the governmental response was to stifle reasoned consideration of observed events. Hynek passed in 1986, so there is a considerable chunk of time left unexplored here. I do not know what significant facts have been discovered since then, and this book does not report them. But I am sure the truth is out there, somewhere. I Want to Believe - You know this pair – image from Atlas ObscuraOne of the most interesting things about the book and about Hynek, is where his scientific leaning led him, re his consideration of possible sources for UFOs. I will not spoil that here, but it definitely worth checking out. Being a Boomer, it was during my impressionable youth that public awareness of and interest in (fear of?) UFOs emerged. While this or that sighting may have been of something other than an alien presence, the impact the large swath of reports had on me, and many others, was quite real. I confess that I am with Mulder in wanting to believe in UFOs, whatever they might be. It is impressive that a world class scientist dedicated much of his life to studying widely derided UFO reports, and applied his considerable skills to trying to figure out their nature. Learning of Josef Allen Hynek bolsters my hope that clear, broadly accepted answers might emerge in my lifetime. If not in mine, hopefully in yours. In the meantime, in light of the fact that UFOs constitute one of the great mysteries of our time, I cannot urge you strongly enough to  Watch the Skies!. Review Posted – July 7, 2017Published – June 13, 2017=============================EXTRA STUFFLinks to the author’s personal UFO site, High Strangeness UFO and his Google Plus pageOK, here is relevant piece of Hynek’s categorization speech.\n “I divide the close encounter cases into three subdivisions: the close encounter, with little detail; the close encounter with physical effects: and the close encounter in which ‘humanoids’ or occupants are reported,” he told the group. Although the “physical effects” variant was the most appealing to him, he acknowledged that the “humanoid” encounters possessed their own uniquely repellant appeal. “This latter subgroup, of course, has the highest strangeness index and frightens away all but the most hardy investigators. I would be neither a good reporter nor a good scientist were I to deliberately reject data. /there are now on record some 1,500 reports of close encounters, about half of which involve reported craft occupants. Reports of occupants have been with is for years but there are only a few in the Air Force files; generally Project Bluebook personnel summarily, and without investigation, consigned such reports to the ‘psychological’ or crackpot category.\nLink to the full 1951 film, The Thing From Another WorldDecember 16, 20176 - NY Times - Thankfully, governmental interest in the unexplained did not pass with Josef Allen Hynek - Glowing Auras and ‘Black Money’: The Pentagon’s Mysterious U.F.O. Program - by Helene Cooper, Ralph Blumenthal and Leslie Keandec. Also from the NY Times, The Daily offers an audio report on this story"}, {"userName": "Leo Knight", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/22421445-leo-knight", "userReview": "I had only known about J. Allen Hynek from his work on UFOs, and his cameo in \"Close Encounters,\" a term which he coined, by the way. He also had a long and prestigious career as an astronomer and teacher. He was born in 1910, when Halley's Comet was in the sky. Perhaps this was an omen.The book gives a concise history of the UFO phenomenon, from the mystery airship stories of the late 1800s, through the postwar sightings, starting with the Arnold case, on up until Dr. Hynek's death. It also gives a clear view of the frustration Hynek experienced in dealing with the Air Force and other investigative groups. Dr. Hynek tried to remain objective, and open to data. UFOs presented very little of this. Most of the cases might be \"explained away,\" but a small core of cases baffled him. While working with Project Sign, an early Air Force program to investigate UFOs, Hynek felt satisfied that he had managed to explain about 80 percent of the cases. In later years, he focussed instead on the 20 percent that remained unexplained.Hynek also tried not to jump to conclusions, and when he did, he usually regretted it. His declaration that one sighting was the result of \"swamp gas\" became infamous.Parallel with the UFO phenomenon was the Space Race. Hynek worked on several projects to track satellites, which became a matter of national importance after the Soviet launch of Sputnik. Dr. Hynek's unique expertise in optics, photography, and astronomy lent credence to his studies of UFOs.Overall, I really enjoyed this book as a look back at the early days of astronomy, space exploration, and the UFO phenomenon, and how each informed and influenced the others."}, {"userName": "Chris Harris", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/38612248-chris-harris", "userReview": "As the title suggests, this biography of the astronomer J. Allen Hynek focuses primarily on his work with the United States Air Force as part of their investigation into UFOs, Project Blue Book. As such, it's an interesting read. Hynek worked with some extremely colourful personalities during his career and they are portrayed unflinchingly; his Air Force boss, Hector Quintanilla, appears to have been a particularly unpleasant character, dismissing the testimony of one police witness to a sighting so vituperatively that the poor man lost his wife and his career. I had a problem with the way in which the \"landmark\" cases that are presented, though - particularly the Socorro, New Mexico report of an alleged landing by patrolman Lonnie Zamora - which are not just discussed uncritically; most of them are presented as fact. Considering that O'Connell gets more easily verifiable facts wrong (for example he appears to be unaware that the catchphrase \"billions and billions\" associated with Hynek's nemesis Carl Sagan originated from Johnny Carson's parody of the Cosmos television series, not from Sagan himself) it's a struggle to take the book as a credible account. From the late sixties onwards, O'Connell abandons the strict chronology of his account and the later chapters become a confusing mess. This results in some interesting omissions; Hynek's claim late in life that he had never seen a UFO is not challenged, yet Hynek took two photographs of a UFO with a stereoscopic camera during a flight in the 1970s, and the images appear in \"The Edge of Reality,\" which Hynek co-wrote with Jaques Vallee, published in 1975. Did O'Connell even get round to reading one of the books his subject wrote? So it's an interesting read, but it doesn't come close to being the definitive biography of a fascinating man."}, {"userName": "Rob Kristoffersen", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/5929211-rob-kristoffersen", "userReview": "J Allen Hynek is one of the untold heroes of ufology, well at least to the uninitiated in the area of UFO research. But even within the ranks of ufology, few realize his contributions to astronomy as a whole, or his contributions to World War II technology. Among the pages here, the reader is treated to the life story of an amazing man. The one I call my UFO dad.Hynek is most known for creating the Close Encounters scale within ufology, being a metric to gauge a witnesses interaction with UFOs. Most notably, Close Encounters of the Third Kind, the wonderful film, owes itself to Hynek and his consultation work on the film.Before all of that, though, we learn of a man who lead a symmetrical life under the watchful eye of Halley's Comet. Hynek would grow up to contribute to the team that designed the proximity fuse during WWII. He would be the pioneer UFO studies from the ground running, maintaining a long term relationship with the government, while making a journey that would turn him from staunch skeptic into a believer. If you want to know how much of a badass Hynek is, he determined why stars twinkle, he helped design and manage the first satellite tracking stations, paved the way for the Hubbell Space Telescope and so much more.Most brilliant of all is how this book serves a dual purpose, telling the story of Hynek while giving you a nice detailed history of early ufology. Whether you're new to the field or a long time figure, this book is for all those that find the topic of UFOs interesting and worthwhile and even for those of a more skeptical mind. Do not miss out on this brilliant biography of our UFO dad.For a fun look at this book, check out the book club episode of my podcast about The Close Encounters Man!https://audioboom.com/posts/6666877-t..."}, {"userName": "Lea Wiggins", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/27450184-lea-wiggins", "userReview": "I won this amazing book in the Giveaway. I am so glad I did. It was the book I wanted most to win! How cool is that.I grew up hearing and watching a lot of stuff about J Allen Hynek. I have always been fascinated about stars, space, astronomy, even as a child. Of course I am of that generation that watched the news on July 20, 1969, at 20:18 UTC. I found in the course of reading this book that I had some preconceived and biased beliefs about Mr Hynek, that this book was able to correct.I had always believed that Mr Hynek was hired by the government to work with Project Bluebook to deliberately defuse and downplay all UFO sightings. Initially his outlook was very different from what he later came to believe. However he never believed that UFOs were necessarily aliens from other worlds. Mr Hynek was an amazing scientist, and a very interesting man. I came to respect him more than I did before I read the book by Mark O'Connell."}, {"userName": "Michael", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/10955402-michael", "userReview": "Full of interesting and new to me information. Gives a great look t the life and work of J. Allen Hynek. Written in a very informational and entertaining manner. I would recommend to anyone interested in UFO's. I won this book in a GoodReads Giveaway."}, {"userName": "Amber Atchley", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/31098825-amber-atchley", "userReview": "I was lucky enough to win a copy of this compelling book through a goodreads giveaway. I was drawn in from the beginning, and O'connell's writing is superb. Informative, detailed, and humorous in all of the right places.Absolutely loved this book. Highly recommended!"}, {"userName": "Steven", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/67156-steven", "userReview": "Giving up on this one, even though it's interesting. The material's a bit too \"in the weeds\" in terms of early details and I'm losing interest enough to let this go back to the library unfinished. Your mileage may vary, depending on your interests in UFOs et al."}, {"userName": "Xander", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/817012-xander", "userReview": "What I learned from this book: Carl Sagan was a dick."}, {"userName": "Joni Krantz", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/50796923-joni-krantz", "userReview": "I really like this book."}, {"userName": "Kevin", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/12553303-kevin", "userReview": "Great biography of a fascinating figure in 20th century history. Learned a lot about UFO phenomena and their place in scientific and popular thought."}, {"userName": "John", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/54864496-john", "userReview": "Review to come."}, {"userName": "Manuel P. Revuelta", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/30183958-manuel-p-revuelta", "userReview": "Other than Leslie Kean’s book “UFOs” this is the most interesting and academic take on this subject which is so poorly understood. The key take away point is that UFOs need further investigation. Not that this subject is some bizarre wacko conspiracy theory. Fortunately, since this book came out, there had been a considerable amount of interest in the subject. I can’t recommend this book highly enough. Read it and learn."}], "description": "The wildly entertaining and eye-opening biography of J. Allen Hynek, the astronomer who invented the concept of \"Close Encounters\" with alien life, inspired Steven Spielberg’s blockbuster classic science fiction epic film, and made a nation want to believe in UFOs.In June 1947, private pilot Kenneth Arnold looked out his cockpit window and saw a group of nine silvery crescents weaving between the peaks of the Cascade Mountains at an estimated 1,200 miles an hour. The media, the military, and the scientific community—led by J. Allen Hynek, an astronomer hired by the Air Force—debunked this and many other Unidentified Flying Object sightings reported across the country. But after years of denials, Hynek made a shocking pronouncement: UFOs are real.Thirty years after his death, Hynek’s agonizing transformation from skepticism to true believer remains one of the great misunderstood stories of science. In this definitive biography, Mark O'Connell reveals for the first time how Hynek’s work both as a celebrated astronomer and as the U. S. Air Force’s go-to UFO expert for nearly twenty years stretched the boundaries of modern science, laid the groundwork for acceptance of the possibility of UFOs, and was the basis of the hit film Close Encounters of the Third Kind. With unprecedented access to Hynek’s personal and professional files, O’Connell smashes conventional wisdom to reveal the intriguing man and scientist beneath the legend.Tracing Hynek’s career, O'Connell examines Hynek’s often-ignored work as a professional astronomer to create a complete portrait of a groundbreaking enthusiast who became an American cult icon and transformed the way we see our world and our universe.", "title": "The Close Encounters Man: How One Man Made the World Believe in UFOs", "url": "http://www.goodreads.com/book/show/31448994-the-close-encounters-man", "average": 3.85, "cover": "https://images.gr-assets.com/books/1479748936l/31448994.jpg", "reviews": 13, "authors": [{"url": "https://www.goodreads.com/author/show/377967.Mark_O_Connell", "name": "Mark O'Connell"}], "type": ["Biography", "Science", "History", "Nonfiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/31448994-the-close-encounters-man", "http://www.goodreads.com/book/show/31449413-the-close-encounters-man", "http://www.goodreads.com/book/show/34794788-the-close-encounters-man", "http://www.goodreads.com/book/show/30555486-to-be-a-machine", "http://www.goodreads.com/book/show/17279230-epic-fail", "http://www.goodreads.com/book/show/960941.The_Illustrated_Encyclopedia_of_Signs_and_Symbols", "http://www.goodreads.com/book/show/15940133-catching-bullets", "http://www.goodreads.com/book/show/10252125-the-complete-encyclopedia-of-signs-symbols", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}