{"ratings": 204, "userreviews": [{"userName": "Kirsten ", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/833700-kirsten", "userReview": "Tied in the Pick It For Me thread at A Good Thriller for August. I really, really love this series. Not only is it baseball. But it's old-timey baseball. This book starts in the wake of the 1919 Black Sox scandal and Mickey is now a utility baseball player for the Reds (who played the Black Sox in the infamously thrown World Series). This series is wonderful for the real people thrown in. The first commissioner for baseball, references to the trial against Sacco & Vanzetti, Hollywood, World War I veterans, the Negro leagues, etc.The mystery ain't half bad either! Poor Mickey gets involved with murder, blackmail, gambling, and - oh what else? - trying not to get blackballed from baseball. A real treat! Just wish I'd had some Cracker Jacks."}, {"userName": "Bob Hostetler", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/8012176-bob-hostetler", "userReview": "I loved this book. Not only as a Reds fan, but also as a Cincinnati native and a persnickety reader. Soos hit every pitch."}, {"userName": "Andrew", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/9916025-andrew", "userReview": "[things are going so well for Mickey personally. While I share in his neighbors' disapproval of cohabitating before marriage, I'm happy to see Margie back and to see their relationship moving forward. (hide spoiler)]"}, {"userName": "Jeff", "userReviewDate": "Jul 24, 2011", "userURL": "http://www.goodreads.com/user/show/44921-jeff", "userReview": "I had never heard of Troy Soos, or his fictional baseball player, Mickey Rawlings, until my Dad gave me this book that he had read. This book was so much fun, and I can't wait to get my hands on another one. Anyone who knows me knows that I'm a HUGE baseball fan, so finding an adult fiction book that centers around baseball was truly amazing. The Cincinnati Red Stalkings is a mystery set in 1921, as Mickey Rawlings, a utility infielder for the Cincinnati Red Stockings, attempts to solve several mysteries that are really making his life miserable. He lives with an actress named Margie (which is scandalous for 1921, and quite humorous every time he tries to describe their relationship to someone), who winds up solving her own mystery. There are historical facts included in this book, which makes it even more enjoyable. This story centers around events that involved the 1869 Cincinnati Red Stockings Baseball Club, which was the first completely professional nine. The team, led by Harry Wright, went 57-0 in 1869. (True story!) But when Mickey Rawlings is given an old baseball, among some other memorabilia from 1869 that appears mostly worthless, things really start to get interesting. Was a young girl truly murdered in 1869 and buried in Eden Park? Whatever happened to Dick Hurley, the utility infielder for the 1869 team? Is the man who showed up in 1921 claiming to be Dick Hurley really him? And why was Mickey Rawlings apparently set up with a photo showing him shaking hands with a known gambler (who just happened to be handing him an envelope) right in the middle of the Chicago Black Sox trial? This, of course, caused him to be suspended and questioned by Judge Kenesaw Mountain Landis, the first baseball commissioner. Rawlings certainly had his hands full! Baseball and murder mystery! What a great combination! This book is, according to the description on Goodreads, is number 5 in the series, and I know there is at least one more after this one. I'll be looking for all of them."}, {"userName": "Spuddie", "userReviewDate": "Dec 29, 2009", "userURL": "http://www.goodreads.com/user/show/348527-spuddie", "userReview": "This actually refers to the audio book, which for some reason I could not get to come up, despite using the ISBN.This is one of the later books in the Mickey Rawlings \"baseball\" series set in the late 1910's/early 1920's. I needed an audiobook quickly to listen to on a long drive, and this one was there, so I snabbed it--very uncharacteristic for me, who never reads series out of order! Mickey is a utility infielder who's been traded all over the league, currently doing duty with the Cincinnati Red Stockings. He has an interest in baseball history and spends some time with a guy whom the team's owner has hired to set up a baseball museum to help draw in some crowds. When that man turns up dead, Mickey is at first a suspect and then becomes the hunted himself, as he figures the killer must have the idea that Mickey has something that the murdered man passed on to him--but for the life of him, he can't figure out what it might be. Until he does, the mystery is going to remain just that--the police aren't overly interested and seem content to let the murder go off as death in the midst of a robbery. I really enjoyed this book--enough that I went ahead and downloaded the first book to my MP3 player already. Mickey is interesting and I like the secondary characters too. It's interesting hearing about what baseball was like during those long-ago days, a time even before my parents were born. The reader had kind of an odd voice, not your \"classical\" deep, bounding male voice, but it suited Mickey's personality very well and was pleasant enough to listen to. Looking forward to going back to the beginning to hear about how it all started."}, {"userName": "Anne Hawn Smith", "userReviewDate": "May 21, 2011", "userURL": "http://www.goodreads.com/user/show/2393446-anne-hawn-smith", "userReview": "Troy Soos writes a great story for baseball fans, of which I am one. I love the stories about the earlier days of baseball when the salaries weren't so high and players weren't so removed from the fans. This mystery takes place in 1921, the year that the Chicago \"Black Socks\" were supposed to have thrown the world series. I had always heard about it and felt that Shoeless Joe Jackson got a raw deal, but I never understood all the mysteries surrounding the scandal. While that isn't the the major theme in this book, a great deal of information is given, especially about the extreme actions of the Commissioner of Baseball and the feelings of the fans.I also enjoyed the cameo appearances of Eppa Rixey who was from Rixeyville, just up the road from where I lived in Virginia. I had heard about him and saw a plaque dedicated to him, but never had any other information. Troy Soos fleshes out his character and gives some details about a few games he played in.This book centers around the murder of a man who was gathering memorabilia from the earliest players and games. It is how the Baseball Hall of Fame must have started. Unfortunately, this young man was murdered and Mickey Rawlings is determined to find out how and why after his own house is broken into. Mickey was given some of the material that wasn't going to end up in the museum and he figures that the killer did not get the thing he sought when he broke into the museum."}, {"userName": "Christopher Taylor", "userReviewDate": "Jan 20, 2016", "userURL": "http://www.goodreads.com/user/show/31381002-christopher-taylor", "userReview": "This is the second baseball mystery by Troy Soos I've read, and they both were enjoyable. I'm a fan of baseball, history, mysteries, and baseball history, so this is right in my wheelhouse, as it were. Each book is rich with local details of the cities Rawlings lives in and plays for, baseball lore from the time period, and the mysteries are enjoyable. Rawlings is hardly a top sleuth, but he is persistent and lucky, and with some help he digs up the truth.People who love baseball, history, mysteries, and attention to historical detail delivered in an entertaining and easy read will enjoy these books.The only thing I've noticed so far in the books is the main character's Communist friend Karl, who is presented as perhaps eccentric but harmless and usually wise and insightful. Given the history of Socialism and Communism in the 20th century, that's like having a goofy Klansman pal or a Nazi sidekick. Its very offputting and I cannot enjoy the scenes"}, {"userName": "ladywallingford", "userReviewDate": "Jul 12, 2011", "userURL": "http://www.goodreads.com/user/show/3618033-ladywallingford", "userReview": "This book was definitely not my normal reading fare, mainly for two reasons. One, I don't read many fictional mystery novels (but I do enjoy History's mysteries). I honestly don't know why. Two, the book featured baseball. However, even with those two points weighing against it, I didn't hate the novel but at the same time, it felt sort of bland. Nothing really popped out at me all throughout it. Maybe a true baseball fan could appreciate it more. As for me, I doubt I'll be reading any other novels in this series of books."}, {"userName": "Jake", "userReviewDate": "Jan 26, 2013", "userURL": "http://www.goodreads.com/user/show/1401909-jake", "userReview": "I read some Troy Soos novels as a kid. I really enjoyed the concept of an old-time baseball player solving murders in the early days of the league. This one doesn't disappoint, it's well-plotted with a good mystery (that stretches a little too much near the end but still) set amidst the rich backdrop of the game and the era. I look forward to reading more of this series now that I'm older and can appreciate it more."}, {"userName": "Sandy", "userReviewDate": "Apr 20, 2014", "userURL": "http://www.goodreads.com/user/show/185454-sandy", "userReview": "As always, I thoroughly enjoyed the world of Mickey Rawlings. It was interesting to read about what baseball was like during the fallout of the Black Sox scandal.I thought the mystery was rather complicated, it took some work to keep all of the threads straight in my mind while they were being unraveled."}, {"userName": "Tim Owens", "userReviewDate": "Mar 07, 2016", "userURL": "http://www.goodreads.com/user/show/53482461-tim-owens", "userReview": "Mickey Rawlings has settled into the role of utility infielder after 9 years in the majors. His new team the, Reds, is planning a memorabilia exhibit of the 1869 Cincinnati Red Stockings, who went undefeated in a historic coast-to-coast romp. Murder occurs before the exhibition get to first base."}, {"userName": "Donna", "userReviewDate": "Aug 06, 2009", "userURL": "http://www.goodreads.com/user/show/1075163-donna", "userReview": "What fun to read a book placed in Cincinnati about baseball set in the 1920's! Lots of descriptions of placed in the city and history of the team from it's beginning with a mystery entwined in the story. I really like the main character.I have ordered all the other books by this author such as Murder at Fenway Park, Murder at Ebbets Field, etc."}, {"userName": "Peter", "userReviewDate": "Apr 09, 2012", "userURL": "http://www.goodreads.com/user/show/2401966-peter", "userReview": "This was a book that I'd forgotten about for years until I found it sitting on my bookshelf the other day. Soos does an amazing job of bringing 1920s baseball back to life. This is not just an excellent murder mystery, but a great look at Cincinnati and baseball right after the Black Sox Scandal."}, {"userName": "Hunter Johnson", "userReviewDate": "Jan 26, 2011", "userURL": "http://www.goodreads.com/user/show/2262580-hunter-johnson", "userReview": "The Cincinnati Red Stalkings, by Tony Soos. Baseball, local (to me) history, and a murder mystery nicely rolled up. Did you know the 1869 Red Stockings are the only professional baseball team to go undeafeted? Now you do."}, {"userName": "Ben B", "userReviewDate": "May 06, 2011", "userURL": "http://www.goodreads.com/user/show/4894649-ben-b", "userReview": "Entertaining."}, {"userName": "Kenneth Flusche", "userReviewDate": "Sep 11, 2015", "userURL": "http://www.goodreads.com/user/show/6086788-kenneth-flusche", "userReview": "more baseball and prohibition history than mystery but a good page turner to get through a rainy day"}, {"userName": "Chris Schaffer", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/6077620-chris-schaffer", "userReview": "Kind of silly."}, {"userName": "Michael Rhode", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/11305411-michael-rhode", "userReview": "My first book on a Nook. Besides that, I enjoy these mysteries by Soos. There's a lot of good history in them, and he gives you a nice feel for the whole period, as well as baseball history."}], "description": "The lazy days of June 1921 are dark ones for baseball fans as the trial of the Chicago \"Black Sox\" players accused of throwing the 1919 World Series begins. But utility infielder Mickey Rawlings thinks he has something to cheer about -- playing for the team that won that series, the Cincinnati Reds. Until he gets embroiled in a mix of conspiracy, lies, and murder that can end his career...and his life.", "title": "The Cincinnati Red Stalkings\n      \n          (Mickey Rawlings #5)", "url": "https://www.goodreads.com/book/show/1535073.The_Cincinnati_Red_Stalkings", "average": 4.03, "cover": "https://images.gr-assets.com/books/1387746238l/1535073.jpg", "reviews": 19, "authors": [{"url": "https://www.goodreads.com/author/show/249871.Troy_Soos", "name": "Troy Soos"}], "type": ["Mystery", "Sports", "Sports and Games", "Historical", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/1535073.The_Cincinnati_Red_Stalkings", "http://www.goodreads.com/book/show/19656036-the-cincinnati-red-stalkings", "http://www.goodreads.com/book/show/9859113-cincinnati-red-stalkings", "http://www.goodreads.com/book/show/2422322.The_Cincinnati_Red_Stalkings", "http://www.goodreads.com/book/show/444403.Murder_at_Fenway_Park", "http://www.goodreads.com/book/show/1535068.Murder_At_Wrigley_Field", "http://www.goodreads.com/book/show/1535072.Murder_At_Ebbets_Field", "http://www.goodreads.com/book/show/1535069.Hunting_A_Detroit_Tiger", "http://www.goodreads.com/book/show/1718623.Hanging_Curve"]}