{"ratings": 3741, "userreviews": [{"userName": "Kathy Worrell  ツ ", "userReviewDate": "Nov 16, 2016", "userURL": "http://www.goodreads.com/user/show/4994087-kathy-worrell", "userReview": "Yes, I'm giving a Christmas novella 5 stars! Totally unheard of, but true! This is more than a fun, sappy, romance, under the mistletoe story. This is a story of love, loss, and HOPE. I believe that without hope, you have nothing. It's a beautiful love story on so many levels, I cried and cried and cried. If you only read one Christmas novel this year, read this one. (I read it in one evening.)(This story is number 3 in a series, but it reads like a stand alone novel.)"}, {"userName": "Deanne Patterson", "userReviewDate": "Dec 21, 2016", "userURL": "http://www.goodreads.com/user/show/34916386-deanne-patterson", "userReview": "Thanks for the recommendation, Rebecca. Luckily for me I had already checked this out of the library and had it waiting for me to read :)I enjoyed this heartwarming Christmas story!"}, {"userName": "Julianna", "userReviewDate": "Dec 12, 2011", "userURL": "http://www.goodreads.com/user/show/883725-julianna", "userReview": "Reviewed for THC ReviewsI loved the first two books in Donna VanLiere's Christmas Hope series, and now I can add The Christmas Hope to my list of all-time favorite holiday-themed stories. In spite of my Christian background, I often find it difficult to read inspirational fiction, because it too frequently seems trite, vapid and/or preachy to me. Not so with Donna VanLiere's books. She somehow manages to impart an inspiring message full of depth and meaning that utterly warms my heart without making me feel like I'm being beaten over the head with it. In my opinion, she doesn't water down the faith aspect of her stories, but neither is it exactly overt which I think makes the books accessible to people of many different faiths and backgrounds. Ms. VanLiere just has a very gentle way about her writing that really speaks to me. The Christmas Hope is told primarily in first-person from the main protagonist, Patricia's point of view. Patricia is a dedicated social worker who goes above and beyond the call of duty in loving and caring for the kids she helps. She had a rather rough life growing up. When her father left them, it was only through the kindness of strangers that her mother, brother and she survived. Now she seems to be paying it forward to other people through her work, but when the story opens, she has no Christmas spirit left and hasn't celebrated the holiday in four years. Patricia is a little on the OCD side, but I later came to understand that her obsession with tidiness was her way of trying to feel in control after the chaos that has been wreaked on her life by the death of her son. Her marriage is failing, with she and her husband acting like little more than polite strangers which I found quite sad especially after learning about their closeness and the very romantic start to their relationship. Everyone grieves in their own way, but I occasionally had a hard time relating to Patricia's way of dealing (or not, as the case may be). On the surface, she seems to have it all together, but inside she had buried herself so deeply in her grief that she wouldn't let anyone in to share it, not even her husband. Patricia frustrated me a little when she kept saying that she didn't know what to do to stop her marriage from crumbling and her husband from leaving, but her friend and co-worker, Roy, had it right when he said that she did know. It was at those moments that I kept wanting to jump into the story and tell her, \"Just do it! Just hug him or do something, anything, to show him you still care.\" Luckily, a sweet little girl named Emily came along to gently wiggle her way into Patricia's closed-off heart when she least expected it, and a Christmas “miracle” finally brought closure to her deep-seated grief.Patricia's husband, Mark, seemed like a really great guy who was very kind and loving. Since we don't get any scenes from his point of view, I can't be absolutely certain what he was thinking, but I always got the feeling that he didn't really want his marriage to be over. He was just at the end of his rope and didn't know what to do to reach his wife and couldn't stand living in the same house like strangers anymore. Emily inspires Mark every bit as much as she inspires Patricia, and he seemed a little quicker to respond. He saw what Emily needed and was ready to give her that long before Patricia was willing to admit it. He really got into the holiday spirit, buying the perfect gifts for Emily like a regular Santa's helper and excitedly putting up decorations. I just love how when the door opened a crack he eagerly walked through it, more than happy to soak up the love Emily gave and give it in return, as well as being there for Patricia when she was finally ready.Emily was an absolutely adorable little girl who was a ray of sunshine in Patricia and Mark's lives. Even though she's been through a lot, she has a generosity of spirit and a peace about her that is like a gentle rain on this couple's parched souls. In fact, she touches the lives of so many people just by being herself. Emily's youthful wisdom reminds me of the Bible verse, “...and a little child shall lead them,” because she certainly did lead Patricia and Mark out of a very dark time in their lives and into a brighter future.Since the main characters weren't familiar to me when I started The Christmas Hope, I wasn't sure if it had a direct connection to the first two books of the series or not. I was very pleasantly surprised when Nathan and Megan Andrews (The Christmas Blessing) showed up, eagerly awaiting the birth of their first child. Nathan also has another unexpected connection to Patricia which he slowly figures out when she brings another of her “kids” to him for treatment of a heart condition. Nathan is a wonderful doctor who is amazing with children. It's obvious that he's finally found his true calling in life. Another former protagonist, Robert Layton (The Christmas Shoes), also shows up in a brief cameo role.It almost seems like Donna VanLiere has a preoccupation with death especially around Christmastime, but I have to admit that I really like the way she handles this ofttimes difficult topic. As someone who has had trouble with this issue, I can say that she really imparts an inspiring message about death being another step in life. It also wasn't quite as sad for me in The Christmas Hope, because no major characters were dying. In fact, I was surprised to find that this book actually had some lighthearted moments too, with characters gently teasing each other which made me smile. Overall, The Christmas Hope was a heartwarming story that was an inspiration to read, and I'm proud to put it on my keeper shelf to be enjoyed again and again during future holiday seasons. I love Donna VanLiere's way with creating stories in which the characters lives intricately intertwine in wonderful, miraculous and unexpected ways. I can't wait to see what's in store for the next book of the Christmas Hope series."}, {"userName": "Carolina", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/11490251-carolina", "userReview": "This one was definitely more tear jerking than the other ones but it is also more about children, which I have a special place for in my heart. It was beautiful and tragic and a book full of miracles. I also like how the author somehow ties all the characters together. So great!"}, {"userName": "Carole", "userReviewDate": "Dec 17, 2016", "userURL": "http://www.goodreads.com/user/show/7630646-carole", "userReview": "If you're in the middle of a busy Christmas season, and want a short, sweet, touching Christmas story, look no further! It's about loss, hope & love. It brought a tear or two, and touched my heart. The perfect December book!"}, {"userName": "Sarah", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/37074491-sarah", "userReview": "3.5 Stars"}, {"userName": "Loraine", "userReviewDate": "Dec 06, 2012", "userURL": "http://www.goodreads.com/user/show/1922494-loraine", "userReview": "Once again Donna Van Liere has penned a lovely Christmas story. Just as Jesus came into the world to give us second hope, joy and light, Emily and Mia come into Patricia and Mark's lives at Christmas and lead the way to second chances, hope, peace, and light in the darkness restoring the miracle and true spirit of Christmas."}, {"userName": "Betsy", "userReviewDate": "Nov 25, 2012", "userURL": "http://www.goodreads.com/user/show/4718466-betsy", "userReview": "The Christmas Hope is the 3rd book in Donna VanLiere's Christmas Hope series. The story is touching and shows how God can bring hope into your life when you least expect it. Another good story. 3.5 stars"}, {"userName": "Dharshini", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/49591465-dharshini", "userReview": "These Christmas series books are cliche and designed to touch the heart strings, but in good way! Loved it! We all need a feel good pick me up book once in a while."}, {"userName": "Linda Collings", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/10498868-linda-collings", "userReview": "Beautiful!"}, {"userName": "Dawn", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/1383959-dawn", "userReview": "Although I've enjoyed the first two books in the series, so far, this one has been my favorite. It didn't make me cry like the first book (The Christmas Shoes), but I was really invested in what happened to the main characters in this story. Nathan, the young boy from \"The Christmas Shoes\" makes a few appearances during this story. I like how it keeps you updated on his life now as a doctor and I hope he is in the rest of the Christmas Hope series. This book makes you realize that God gives us hope to get us through the dark times. There may be events in your life that will make you not want to continue living, but God just might send you an angel to help you through and see the hope for your future. A beautiful story!"}, {"userName": "Natalie Widener", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/40507614-natalie-widener", "userReview": "A very enjoyable read!"}, {"userName": "Staci", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/11909124-staci", "userReview": "What a heartwarming story! Another well done Christmas story by the author of The Christmas Shoes."}, {"userName": "Kim. E.", "userReviewDate": "Dec 22, 2017", "userURL": "http://www.goodreads.com/user/show/58415524-kim-e", "userReview": "In my prior life as a professional, I was a social worker and later an intensely trained clinician that provided special care to the most vulnerable and endangered in our human population. This book was not only a spirit of hope and love, but of the everyday miracles that come in this field.This series has been the greatest surprise for me throughout this holiday season, and a gift I will hold onto so much longer than a new pair of pajamas or a piece of my favorite pie only served on Christmas Eve.Family is messy, and we all do not live in Norman Rockwell paintings, but this series is the closest I have found. Next year this series will be sitting on my own bookcase, waiting for further discovery."}, {"userName": "Sandra Bašić", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/32538982-sandra-ba-i", "userReview": "\"Dear Mom, You always told me that the best Christmas gift I could ever give was the one I couldn't wrap - the gift of time.\"It is true, indeed. Time spent with persons you love is definitely priceless.I adore Donna's books, because she always brings hope, especially during holidays.\"The word which God has written on the brow of every man is Hope.\" (Victor Hugo)"}, {"userName": "Michelle", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/5964513-michelle", "userReview": "Although it currently July, I decided to get a Christmas book the other day while picking out a book. I really enjoyed this book it was great with making you appreciate the small things and had me thinking the worst when infact I was actually wrong about her Husband Mark. After I was finished reading I thought I must be sick and twisted because there were 2 events that I was wrong about but other wise I really liked it... I left me wishing it wasnt july."}, {"userName": "Camilla", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/19429438-camilla", "userReview": "3.75 stars!"}, {"userName": "Beth", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/3717316-beth", "userReview": "Yep, I cried! Good Xmas story."}, {"userName": "Mom2triplets04", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/6032642-mom2triplets04", "userReview": "New characters in the 3rd book. It really touches your heart when someone puts out their heart to take care of a little child. This book is about death, fostering, adoption, getting over loss of a loved one. Great Christmas read about hope."}, {"userName": "Glenda L", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/1660712-glenda-l", "userReview": "What a beautiful well written story...It is about a little girl who needa s home and a couple who needs a child and a doctor who restores Christmas. I would recommend it to anyone who need uplifting."}, {"userName": "Emily (ofpagesandink)", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/33662665-emily-ofpagesandink", "userReview": "Summary: Patricia and Mark have drifted apart ever since the death of their son Sean. Their Christmases were just like any other day and they moved through life day by day and avoided not only each other, but their friends and family. One day, Patricia's job brings her to this beautiful little five-year-old girl named Emily who's mother had died in a car crash five months before Christmas and needed a place to stay while her foster family went to a funeral. This special little girl gives the couple the key to getting their lives back and living in the moments and not in the days. Review: This book was so cute. I do have some disclaimers for people:-It's religious so if that kind of stuff turns you off to a book, I don't recommend it unless you're Christian or unless that stuff doesn't bother you. -It discusses the loss of loved ones and If you've experienced this type of loss, it may make you sad to read. However, it may also help you through that grief. I loved this book and not because the little girl has the same name as me. It's not a very long book, but the connection between characters happens almost instantly and from the moment this little girl is brought into the story, you just know that she will be important. You really begin to see a transformation in Patricia who goes from lethargic and uninterested, to excited and energetic as the book builds to the climax. It's a very special christmas story and if you're looking for a happy/sad holiday story that isn't too long then look no further than The Christmas Hope by Donna VanLiere."}, {"userName": "Hobby", "userReviewDate": "Dec 28, 2013", "userURL": "http://www.goodreads.com/user/show/2233899-hobby", "userReview": "Books “PENGHARAPAN NATAL”Judul Asli : THE CHRISTMAS HOPE[ book 3 of CHRISTMAS Series ]Copyright © 2005 by Donna VanLiere Cover art by Anne Twomey ; illustration by DaniloPenerbit Elex Media KomputindoAlih Bahasa : Rosida W. SimatupangCetakan I : November 2011 ; 226 hlm ; ISBN 978-602-00-1621-4Rate : 4 of 5“...aku selalu menganggap , ketika menginginkan perhatian kita, Tuhan akan melakukan perkara besar demi membangunkan kita dari tidur lelap dan membawa kita kembali pada-Nya. Ternyata aku keliru. Tuhan tidak pernah berhenti bicara. Kitalah yang sulit mendengar.” [ ~ The Christmas Hope | p. 5 ]Patricia dan Mark Addison pernah menjalani kehidupan yang bahagia dan penuh impian serta harapan. Hingga suatu hari menjelang malam Natal, kebahagiaan tersebut terenggut dengan kematian putra tunggal mereka, Justin, yang mengalami kecelakaan saat pulang menuju rumah dari tempat kuliahnya. Bagi Patricia, harapan apalagi mukjizat adalah sesuatu yang absurb untuk dicerna oleh nalarnya. Ia telah menjalani kehidupan mengerikan di masa kanak-kanak, kala ayahnya melarikan diri akibat melalukan penggelapan di kantornya, meninggalkan hutang serta istri dan anak-anak yang masih kecil.  more about this book, just check my complete revew at here :[ http://lemarihobbybuku.blogspot.com/2... ]"}, {"userName": "Angie", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/4964628-angie", "userReview": "Synopsis: \"Patricia and Mark Addison have long given up the hope of having a meaningful Christmas. But this year, Patricia's job as a social worker will lead her to a very special five-year-old. Against her better judgment, Patricia bends the rules and takes the little girl to her own home. Through the presence of Emily in their house, and her penetrating questions about heaven, the Addisons learn that there is no sorrow so great that faith cannot help you find your way through. And Christmas will once more be a time of joy in their home.\"My Review: I am really glad I continued with this series. At first I thought this book was a companion novel instead of a continuation but the connection became clear as the story moved forward. I really like how this book was connected with the previous two books in the series, it really gives you that sense that we are all connected in someway and those small kindnesses that you think are no big deal might really be a big deal for someone else. It was really a great book for the holidays and really hits home. I found this one to be right up there with the first book, maybe because of the younger characters."}, {"userName": "Sarah", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/11531941-sarah", "userReview": "The third book in this inspiring Christmas Hope series. A real heartfelt tear jerker book! Nathan, from (The Christmas Shoes) is brought back into this book. He ends up giving one of the best gifts of all. Trouble in their marriage, Patricia and Mark are about to split up for good. Heartache, in the past few years, has caused this. Being a social worker, Patricia is caught up in very painful situations of kid placements. Little Emily comes into their life and stirs up painful memories. Can Emily be the force to give the ultimate gift of all? One of the best books I have read in awhile. Prepare to cry!"}, {"userName": "Sharon Forbes", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/1137292-sharon-forbes", "userReview": "This is book #3 in a wonderful series of books!! This book really lives up to its title, as Donna VanLiere really did a wonderful job conveying the true meaning and spirit of hope here. This book introduces us to Patricia and Mark Addison, and tells of how they are able, after a terrible tragedy, to come together again through the love of a sweet little girl, Emily, who herself has suffered much in her young five years. A very good book, I highly recommend this series."}, {"userName": "Melinda", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/1661139-melinda", "userReview": "This is a heartwarming read - I liked how Nathan Andrews, from the other two books, makes a presence in this one as well. So many choice characters, whose struggles, pains and reactions felt real, but set their own trials aside to concentrate on newly-orphaned Emily, and ailing Mia, and by so doing, are able to more appreciate and participate in the Christmas season for the first time in several years."}, {"userName": "Laura", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/7106928-laura", "userReview": "My favorite of the series so far. I really find the character of Patricia to be lovable. I found myself crying in certain points and laughing in certain points. I loved seeing the small glimpse of Nathan in this book and seeing how his life has progressed. I can't wait to read the next book in the series."}, {"userName": "Elizabeth Meadows", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/40096125-elizabeth-meadows", "userReview": "I realized part of the way in , that I had read this before. I loved it just as much the second time. The author does a wonderful job narrating this on audio. Such a heart-warming story for Christmastime."}, {"userName": "Michele", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/46180376-michele", "userReview": "A beautifully moving Christmas story that moved me to tears on more than one occasion while reading this book. It was the kind of book that you did not want to put down once you picked it up, you wanted to stay with these people and see what happened."}, {"userName": "Genna Merrick", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/54471480-genna-merrick", "userReview": "I love how VanLiere ties all of her books together. It's amazing to see how all the characters we've met have continued to move on and interact with each other and that simple acts of kindness and faith can renew hope."}], "description": "Patricia and Mark Addison have long given up the hope of having a meaningful Christmas. But this year, Patricia's job as a social worker will lead her to a very special five-year-old. Against her better judgment, Patricia bends the rules and takes the little girl to her own home. Through the presence of Emily in their house, and her penetrating questions about heaven, the Addisons learn that there is no sorrow so great that faith cannot help you find your way through. And Christmas will once more be a time of joy in their home.", "title": "The Christmas Hope\n      \n          (Christmas Hope #3)", "url": "https://www.goodreads.com/book/show/307143.The_Christmas_Hope", "average": 4.31, "cover": "https://images.gr-assets.com/books/1438486477l/307143.jpg", "reviews": 266, "authors": [{"url": "https://www.goodreads.com/author/show/23722.Donna_VanLiere", "name": "Donna VanLiere"}], "type": ["Holiday", "Fiction", "Holiday"], "outlinks": ["http://www.goodreads.com/book/show/307143.The_Christmas_Hope", "http://www.goodreads.com/book/show/9939594-the-christmas-hope", "http://www.goodreads.com/book/show/11964515-the-christmas-hope", "http://www.goodreads.com/book/show/33227587-the-christmas-hope", "http://www.goodreads.com/book/show/20333821-the-christmas-hope", "http://www.goodreads.com/book/show/42172.The_Christmas_Shoes", "http://www.goodreads.com/book/show/307109.The_Christmas_Blessing", "http://www.goodreads.com/book/show/13033665-the-good-dream", "http://www.goodreads.com/book/show/6649185-the-christmas-secret", "http://www.goodreads.com/book/show/831253.The_Christmas_Promise", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}