{"ratings": 56, "userreviews": [{"userName": "Trish", "userReviewDate": "Dec 30, 2012", "userURL": "http://www.goodreads.com/user/show/5052483-trish", "userReview": "I came across The Commandant by chance. I picked up a copy, that was sitting in a pile of damaged books, as I ate my lunch one day and was intrigued by this fictionalisation of the Moreton Bay Penal Settlement (ie Brisbane) in the 1830s. All I knew of Logan (the Commandant of the title) was from my Year 5 Australian History classes, of which \"he was a cruel, cruel man\" and \"the man who Logan Road is named after\" are the only memories that remain. I was captivated from the first scene, not only by the insight into the social mores of the time, the penal system and race relations of the early days of my local neighbourhood but also the oblique humour that pops up throughout. An unexpected delight."}, {"userName": "Kerry-Lynne", "userReviewDate": "Sep 15, 2012", "userURL": "http://www.goodreads.com/user/show/2999176-kerry-lynne", "userReview": "This is a book about Power, Duty, Humanity, Woman's place in Society and History, the role of the Press in driving or reflecting social change and Mercy.The story is set in Moreton Bay penal settlement around 1830. Our hero, Frances,[just 17 years of age] is visiting her sister Letty who is married to the Commandant,Patrick Logan.Frances brings with her the changing views of society on Punishment, Reform, Duty and Mercy. She is not afraid to question Power or indeed herself. She is sympathetic with reform ideals but confronted by the reality of life in the colony.The story reveals many confrontations. Logan V Frances' 'new ways'. Frances V reality of life in a penal colony. Logan V the new Press in Sydney. The New World V 'Home'.We watch the 'notorious' Logan struggle with the changes in expectations of Society. He is a man of the past, doing what he has always seen to be his duty, and now he is being judged by new standards. He feels confused and somewhat abandoned and Anderson reveals insight into the man behind the job description. First published in 1975, I felt the 'feminist' hero was of her time and also of mine. She is young and fearless and yet self-doubting. The 'winds of change' are ever present in this story and the power of the media is sounding a warning bell to the old order.I also had the feeling that this is the story of 'expats', overseas and feeling alone and isolated, so far from their families and 'Home'. The delay of news and letters crossing, the anticipation and dread of reading those opinions expressed by loved ones [who can have no real understanding of what life is really like in such a posting]; all of these contributing their feelings of apartness.I recommend this book very highly."}, {"userName": "Brona's Books", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/30281718-brona-s-books", "userReview": "4 and half starsThe Commandant is based on Captain Patrick Logan, the man in charge of the Moreton Bay convict settlement on the present day site of Brisbane.Moreton Bay Settlement 1835He was a cruel task master, feared by all the convicts.But the story is told mostly from the point of view of his young (fictional) sister-in-law, Frances, recently arrived from Ireland.In some ways, this story could be seen as a simple drawing room story about two sisters, but of course, the outside world intrudes regularly on their domestic dramas. There is a strong message about the role of women in the early years of colonisation and how they coped with the isolation, the lack of modern amenities and the constant fear of the unknown. Frances is told by one of the other women,'Whatever course you take,' she said, half-shutting her eyes, 'no doubt in ten years or so you will arrive at the state of the most of us - simply of making do with what one has. Surprisingly enough -' she opened surprised eyes - 'it is an art in which one may progress. I thought I knew all about making do with what one had, but now I find I can do more with it than I dreamed.'Anderson's deceptively straightforward plot also hides many viewpoints and tensions.We see the doubt and confusion that the soldiers and their wives feel about Logan's actions. The young doctors, who have to tend the battered backs of the recently whipped convicts, have another story to tell. The threat of a highly publicised court case in Sydney to deal with the rumours of Logan's cruelty bubble away underneath the surface, only to rear up every time a ship arrives with mail. The menace of the convicts, who far outnumber the soldiers, is felt throughout the story. How the convicts view the settlers and how they, in turn, view the convicts is a tension that Anderson plays with deftly. Underlying all this, though, is another viewpoint. The local Aboriginal population are spoken of and seen fleetingly by our main characters. They know they are being watched, rumours and myths are rampant. Yet the reader can also see this little settlement, barely clinging onto the land around the Brisbane River, through the eyes of the Aboriginals, wondering who on earth where these strange people with their stone walls and inappropriate clothing and guns. Full review here - http://bronasbooks.blogspot.com.au/20..."}, {"userName": "Kate", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/1697118-kate", "userReview": "Thoroughly enjoyable. I think I relished it all the more because I happened to read the novel in the location in which the book is set - Brisbane (site of the old Moreton Bay settlement). Jessica Anderson's prose is spare and wonderfully exact capturing a sense of early 19C English colonial propriety; at times her descriptions of place, people, or mood ring with that sense of originality and 'just-rightness' - with just a hint of Austen-esque humour - that make the book such a pleasure to read. At one stage Anderson is describing the breeze off the river and its effect upon the characters and, as I read, that same breeze happened to be blowing into my room. The book's characters are, without exception, wonderfully individualised and provide a potpourri of colonial types convict and free, young and old, military and settler, proper and dissolute, those passing through the outpost and those considering staying in the colonies - not yet Australia - by returning to Sydney and marrying. This may well be the fate of the free-spirited Frances, the young sister of Logan's wife, Letitia. Logan and Letty's two small children Lucy and Robert are perfectly portrayed by Anderson. I really enjoyed their child-like behaviour sketched with such precision.Logan, the Commandant, is less well known as a character in the novel. He remains a distant, brooding, and ultimately lonely figure at the heart of the novel and all around him - including his loving, loyal, but anxious wife - are shown in reaction to his stiff and cold character. Friendless and feared, he is also portrayed by history as a cruel and sadistic man who many think got his just deserts at the hands of aborigines or perhaps, as Anderson hints in the novel, by some runaway convicts who had joined the local tribes and killed him in revenge for his sadistic punishments."}, {"userName": "Philip Lane", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/4877887-philip-lane", "userReview": "This is quite a good story and in some ways reminded me of E.M.Forster as there was a brooding darkness. My main problem I suppose was that it just seemed to fizzle out and I was uncertain about the truth about the protaganist's fate. I couldn't really decide whether The Commandant was merely fulfilling orders or acting as a tinpot tyrant. It is certain that at least his wife is only interested in maintaining his good name regardless of a reality, but it seems that this has mercurial motives as she will get a bigger pension if it is seen that he has acted well. Certainly an interesting topic - maintaining order in a colony populated by convicts. Well written but I just felt a bit left in a fog by the end."}, {"userName": "Text Publishing", "userReviewDate": "May 12, 2015", "userURL": "http://www.goodreads.com/user/show/11635439-text-publishing", "userReview": "‘Quietly astonishing: enthralls, entertains and gratifies on every level.’Helen Garner‘The happiness a consummate novelist bestows upon a reader—the feeling that under no circumstance can you bear not to know what happens next, nor can you bear to come to the end of the tale—this is Jessica Anderson’s great narrative gift. The Commandant was published in England in 1975 when its English publisher put a bodice-ripper jacket on it. Today it can be published in a different way, in a different country, and be seen for the masterpiece it is.’Carmen Callil"}, {"userName": "Luke", "userReviewDate": "May 08, 2017", "userURL": "http://www.goodreads.com/user/show/1575338-luke", "userReview": "Jessica Anderson is someone who I've always meant to read more of but hadn't managed to. Tirra Lirra By The River was loosely covered in my Eng Lit degree, and didn't make much of an impression (probably because of my youthful inattention, frankly) but The Commandant, it turns out, is exceptional. It's one of the titles reissued in Text Publishing's yellow-covered series of classics, and from the introduction I can see how the work might have been considered a bodice-ripper when it came out. Though - the off-screen appearance of shagging, if any, aside - it's a disservice to call it such. It's a meditation on early Australian history, as well as a forerunner of other such historical fiction as Peter Carey's Oscar and Lucinda. It sits well with Patrick White's Voss inasmuch as it takes history for its basis, and then adds to it, using invention as the magnifying glass for fact. The titular character is a real person: Patrick Logan, commandant of the Moreton Bay penal colony. The book, more or less, is a portrait of the man - his hardness, his fierceness, his apparent strangeness - through the lens of the women of his life. Scratch that: it's not just him that's under the microscope: it's the entire way of life the Crown has transplanted to the arse end of the world, and how unsuited to existence here the settlers and convicts are. Logan's wife, Lettie O'Beirne, is given a fictional sister, Frances, who is as unformed and prone to enthusiasm as the colony itself. She comes to Moreton Bay to join her sister, following an intersection with some Jacobite followers, adding a bit of political grounding to her arrival. Her grasp of etiquette is mirrored in the ramshackle, almost horseless way the penal colony is run; there's convicts with behaviours above their station, drunken doctors, and the tension that comes from trying to do too much without enough raw material. At its heart, the book examines whether the colonists and their charges should be there at all. There's a heavy trepidation to any journeys outside the camp, and an oppression within. The bush is unknowable and full of dangers, and everywhere, there's intimations of death. It's a pungent, noisome thing, this life, and Anderson communicates well the dreamlike daze one must have felt to wash up on these shores, so different and distant from 'home'. The important part of this novel, I think - and something that's also key to The Proposition, the Nick Cave-penned film that has a dark view of flogging-led colonial governance - is that everyone in it is flawed in some way. There's the servant whose truculence is undercut with scars on her neck; the wife who sees the problems in her husband and tries to ignore them; officers who try to warn Logan of the effects of his actions but lose nerve at the last minute, and the doctor who has escaped indiscretion through distance and drink. Everyone is broken, and their inability to function as expected cannot help but inform their surrounds. It could be argued the same applies to Australia today. I wholeheartedly enjoyed this. While the broad strokes of Logan's death are known ahead of reading, there's a lot in here for you to discover, particularly if you're interested in the distinctly unheroic story - a little chamfered, for narrative effect - of early Australian life. (One final note: I found it almost impossible to read The Commandant without hearing The Drones' '16 Straws' in my head. It's a song that adapts the convict song 'Moreton Bay' and adds in a bit more Logan spice, including elements that occur in the text. It's worth a listen.)"}], "description": "In the 1830s, the penal settlement of Moreton Bay on the Brisbane River is under the command of Patrick Logan. His administration has been denounced by the liberal press in Sydney, but he scorns such criticism. How can it harm him when he had governed according to the rules?Flogged and brutalised, some convicts escape to the bush and take refuge with the Aborigines.Logan cannot continue to ignore the reaction to his harsh discipline after the arrival of his wife's younger sister, Frances. She cannot accept the brutality of chained and toiling men, punishment parades and the lash, and it is she who precipitates the crisis from which the final drama springs.", "title": "The Commandant", "url": "https://www.goodreads.com/book/show/554023.The_Commandant", "average": 3.63, "cover": "https://images.gr-assets.com/books/1234240718l/554023.jpg", "reviews": 7, "authors": [{"url": "https://www.goodreads.com/author/show/233430.Jessica_Anderson", "name": "Jessica Anderson"}], "type": ["Fiction", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/554023.The_Commandant", "http://www.goodreads.com/book/show/16057579-the-commandant", "http://www.goodreads.com/book/show/1236307.Tirra_Lirra_by_the_River", "http://www.goodreads.com/book/show/1979314.One_Of_The_Wattle_Birds", "http://www.goodreads.com/book/show/4384861-the-impersonators", "http://www.goodreads.com/book/show/2252493.Stories_From_The_Warm_Zone_and_Sydney_Stories", "http://www.goodreads.com/book/show/3079450-taking-shelter"]}