{"ratings": 49606, "userreviews": [{"userName": "Alena", "userReviewDate": "Jun 01, 2012", "userURL": "http://www.goodreads.com/user/show/4456042-alena", "userReview": "I really liked so much of this book (including Elizabeth McGovern's excellent narration), but it just went on so long. I felt like it had several false endings, places where I was finished but then it kept going.Maybe the probelm is just that I didn't expect an epic when I began. The story covers almost 50 years of Cora's life in a great deal of detail. And while I find the 20th century interesting background, I was frustrated at Moriarty's need to touch on so many different \"issues\" -- Prohibition, adoption, gay rights, reproductive rights, suffrage. Add to that, Cora happens to witness or read about dozens of historical events. I began to feel manipulated after a while.What a I loved was the relationship between Cora and Louise Brooks. I am a sucker for an author using a (notice one) true event and creating fiction from there.I would have been much more satisfied had she ended the book after their summer together."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Mar 10, 2012", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "Corsets, yes. Condoms, no. Times are changing in 1922, but repressive attitudes linger. Birth control is for sleazy people. Divorce carries a permanent stigma. Homosexuals are called \"sodomites,\" and face severe consequences if found out. The Volstead Act (Prohibition) is strongly enforced, and abstinence a virtue. Like most people in Wichita, Cora Carlisle adheres to these conventions out of habit, and fear of being ostracized by the community. Along comes sassy little Louise Brooks. Beautiful, talented, ambitious and brazen. She's ready to take on New York City, but she's only fifteen, so Cora is sent along to make sure Louise maintains the proper decorum. The five weeks they spend together in New York help to launch Louise's career as a silent-film sensation. In more subtle and unexpected ways, the trip serves as a catalyst for changes in Cora's attitudes and lifestyle. Cora is \"the chaperone,\" and this is her story. Laura Moriarty writes with quiet elegance about the changes in the roles of women and societal norms. She shows not only the contrast between 36-year-old Cora and 15-year-old Louise, but also the differences between Wichita and New York City in that era. Most interesting (and distressing) to me was seeing the way people had to live a lie in the public eye in order to gain a measure of happiness in private. So many things were frowned upon, and often illegal, that people had to feign moral rectitude while taking great risks behind closed doors and curtains. As far as I know, Cora Carlisle was not a real person, but she serves as an excellent vehicle to carry us through almost 100 years of life. A woman born in the 1880s and living into the 1980s had a lot of adjustments to make as the world changed around her. Cora isn't a particularly exciting person, but the context in which she is placed makes her interesting indeed. The story has some flaws in pacing, crawling along in some places and fast-forwarding in others. Aside from that, it's written with confidence and subtlety by an author who knows the story she wants to tell and is determined to tell it her own way. I'm glad I went along for the ride. Review copy provided by the publisher."}, {"userName": "Sabrina ", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/6867494-sabrina", "userReview": "When one reads the name of Louise Brooks on the jacket of a book, one assumes that the book will be filled with tales of the glamorous silent movie star who went to seed too fast but remained proud and arrogant till her death. The fact that the name of the book is The Chaperone hinted to me that the story might involve Louise Brooks’ influencing her dowdy chaperone and introducing her to the big bad (beautiful) world of New York City. That makes for okay reading. Luckily for me, the book in no way took that turn. Instead it focused on the life of Cora Carlisle, a proper married lady from Wichita, who accompanies Louise on her journey to New York but really goes to find truths, freedom, and a broader mind. That’s not including all the things she didn’t count on finding…On first meeting Cora in the book, one assumes she’s a well-bred woman of society who is happily married, enjoys ladies luncheons and teas, and has a keen eye on the world around her. With Louise being the bubbly, obnoxious, carefree teenager, it was easy to think that Cora would be the stark opposite with a spotless background. As the book progresses, we see Cora’s strengths and, more importantly, her vulnerabilities in marvellous ways. Cora came to Kansas from an orphan house in New York City with no knowledge whatsoever of her real family. Her teenage years were marked by the tragic loss of her adoptive parents and then a wedding to a rich, handsome lawyer. Their marriage, seemingly normal on the outside, had its own hidden tragedies that left me torn and confused for Cora. Moriarty never made her characters all good or all bad, there were two sides to every story and one had to keep reading to find out how they felt. Cora’s whirlwind journey in New York with Louise was only part of the book. The rest is the aftermath, both good and bad, focusing on Cora but with bits of Louise’s shooting success and equally quick and gossip-worthy failures leaking in.The Chaperone is a moral quandary, an ache for freedom and happiness, and a need to conform to the proprieties of society. It uncovers the fact that everyone has deep secrets which drive their actions. It showcases examples of good parenting, absent parenting, and downright horrendous parenting. It portrays the differences in love and how important certain unforeseen relationships can turn out to be. Most importantly, it confronts truth and the necessity of hiding it for one’s own good. Cora’s character was equal parts practical and spontaneous. The fact that she was almost 22 years older than her charge showcases the differences in generational thinking and how both learned from each other, however reluctantly it might have been. The most beautiful part of it all is that the story is embedded in the world of Prohibition, blacks versus whites, the emergence of the Klu Klux Klan, the ‘obscenity’ of birth control, the glamour of Broadway and finally, World War II. Moriarty takes us back into the 20s, 30s, and 40s with ridiculous ease as she weaves a plot that made me loathe to put the book down for as much as a minute."}, {"userName": "Melanie", "userReviewDate": "Jun 07, 2016", "userURL": "http://www.goodreads.com/user/show/3195534-melanie", "userReview": "First off, I am a sucker for historical fiction. I really, really liked this book! Cora Carlisle (the chaperone) is a great character. I felt as though I knew Cora and was completely wrapped up in her life. There was one twist in the story I didn't see coming :-) The author also piqued my interest in reading more about Louise Brooks, who was certainly a woman ahead of her time! I would highly recommend this one. I've already passed my copy to a coworker."}, {"userName": "Cathrine ☯️ ", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/22600410-cathrine", "userReview": "4★I would describe this story as a woman’s journey of self-discovery as she is entering a mid-life crisis at the dawn of the twentieth century. A voyage to discover truths about her beginnings which will change the set course of her life as she knows and expects. It will lead to one focused on greater personal fulfillment and meaning rather than other’s expectations or strictures. Cora is wearing a tight corset during this quest which is mentioned often. It’s uncomfortable constrictions offer a symbolism to all the things about her life that are keeping her confined. Prohibition and widespread lack of sexual information and women’s health mirror the general restrictions and prohibitions women were subject to at the time, especially ones lacking the preferred background pedigree. When she travels to New York as chaperone to a young, rebellious Louise Brooks, her eyes begin to open to the changes coming in society’s mores and challenge her to look beyond her rigidly held beliefs and conventional outlook about what is acceptable and right in her own life. Cora’s dominant character is complete fiction up against the secondary one of the real-life Brooks. The based-on-fact details of Louise's life add contrast and interest to the changing times during the Gilded Age. I really enjoyed the reading experience, and as often happens in a story like this, I stop and think about how fortunate we modern day women are in progressive countries."}, {"userName": "Madeline", "userReviewDate": "Mar 20, 2015", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "[is gay, a plot twist that was blatantly projected from basically the minute the husband was introduced (hide spoiler)]"}, {"userName": "Elyse", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Cora Carlisle is a fictionalized character, as 'The Chaperone', in this story to Louise's Brooks who in real life was a film actress and dancer who starred in 17 silent films and 8 sound films before she retired in 1938. Author Laura Moriaty created a really engaging tale about a journey that Louise Brooks & Cora might have taken together to New York. Louise was only 15 years old when she auditioned for the famous Denishawn Dance Company in 1922 *In read life: Louise did get hired with the company that year as a 15 year old. For the purpose of this story...all girls underage -no matter how mature or precocious they might be we're not allowed to be on their own.Coming from Wichita, Kansas, -- all young performers had a chaperone.Cora Carlisle, was married with twin boys. Her boys were older ( going off to College and no longer needed her in the way young children do). Cora 'told' her husband she was taking this summer job...( instead of consulting with him).... which provides for a little mystery from the start. The Brooks would cover all the expenses. ( a little mystery around this family too). Louise is very self -centered at the start of the book. It's almost no wonder her mother seems happy to send her off - not being the one to take her herself. Louise is bright, talented, precocious, and will try stretch every possible rule. She exemplifies the Jazz Age...(flapper girls with bobbed hair)Cora is matronly, a little predictable, and quietly judges Louise's liberal ways.There is a reason this story is 'mostly' about Cora..and less about Louise.Yet..I did look up information about Louise Brooks...( it's only natural to be curious).When Cora and Louise get to New York...it's Cora that has the biggest growth. She confronts her past. She was in an orphanage as a child, and was one of the orphans sent west on the Orphan Train. She begins to do research into the orphanage where she stayed looking for answers to questions she has. Cora and Louise both have secrets in their closets. Things are not all as they seem to be for either one of these women. The blending of fact and fiction was a perfect dance. This story was enjoyable! I started out listening to the audiobook...(which was good), but I wanted to speed things along...( I couldn't hike all night long)... so I continued reading a copy of the physical book....( which I've owned for years). It's fun 'book shopping' in my own house. I'm finding treasures to read without spending a dime! 4.5"}, {"userName": "Catharine", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/288401-catharine", "userReview": "I can't recommend this book to any of my friends. SPOILER ALERT: There is a bit of a spoiler in the next paragraph.There are a couple of themes going on in this book. The first is knowing oneself. How do we know who we are? Cora, abandoned as a child, felt compelled to find her birth mother because she thought it would help her to feel complete. Louise, raised by two parents, seemed to have the background that Cora envied. The author did a good job exploring the lives and backgrounds of the two characters and how they found that sense of self, or did not find it.The other theme was morality. Set in the 20's, morality was black and white. If something was bad that was it, there were no shades of gray. As Cora went through life, those lines began to blur. She was very judgmental in the beginning of the novel and became more aware and accepting as she matured. It was interesting to see the contrast between her and Louise, who because of life's unfairness, had a distinct lack of morality. The \"real life\" character, Louise, however, had very real consequences for her actions, but Cora, the fictional character, had a better life as she became more accepting of immorality. I read a review on Goodreads earlier. The reviewer mentioned that the historic information was sometimes put in as an aside; she said, \"It was jarring every time\" I agree. The author also covered large blocks of time and often it seemed rushed. The book would have been better if Moriarty hadn't tried to cover a lifetime.On a positive note: Cora's story was very interesting and it really pulled me in. It didn't take me long to read the book."}, {"userName": "Agatha", "userReviewDate": "Jan 14, 2013", "userURL": "http://www.goodreads.com/user/show/4011664-agatha", "userReview": "Yuck. Would not recommend this book at all. I would put this book in the category of “I wasted my time [reading it] so you do not have to.” LOL. This book is loosely historical fiction, but then has modern sensitivities and opinions inserted, like a bait and switch, or a wolf in sheep’s clothing, or any other sort of metaphor or imagery along these lines you may care to use. It purports to be about Louse Brooks (the silent screen star of the 1920s) and her trip to NYC from Kansas City, and how her mother hires a local woman to be her chaperone. The story is told from the point of view of this chaperone. And it goes off on tangents about how chaperone herself was originally from NYC, but was an orphan, sent out on the orphan trains to the Midwest, and was adopted by a farm family outside of Kansas City. So, on this trip back to NYC, she tries to go to the children’s home where she had lived and tries to find information about her birth family. All of this is fine. Until the book turns, and becomes about a) how chaperone lady’s husband is really gay, and has a longstanding affair with a gay friend of his, and chaperone comes to accept this; b) chaperone lady coexists in the home (in Kansas City, after returning from NYC) with husband and gay lover, and her own lover, a man she has met in NYC and brings back with her. ..so all 4 basically live together, happily ever after; c) author inserts plotlines about Margaret Sanger and birth control and how it will revolutionize the lives of the ladies of Kansas City b/c, like chaperone lady, they can have their true relationships now w/o worrying about getting pregnant. WHAT?? This book is CRAY-CRAY-CRAZY! As one reviewer wrote, Cora (chaperone lady) “starts throwing off previously held beliefs about social conventions at an [unbelievably] alarming rate.” Avoid.. . ."}, {"userName": "Crystal Starr Light", "userReviewDate": "Jun 07, 2012", "userURL": "http://www.goodreads.com/user/show/3990525-crystal-starr-light", "userReview": "[Cora brings home her lover (?!) and his child and they become her long-lost brother (?!) and niece (?!). She blackmails her gay husband into agreeing because she is keeping his secret about being gay. (Basically she found out he was gay and then he's like, \"You can't tell because if you do, you'll be destitute\". And he continues to dally around with his lover while paying Cora off with money for dresses.)Cora then embraces alcohol, fashions without corsets, and contraceptives. She sets up a ridiculously named home for pregnant women \"Kindness House\". All her friends and neighbors love her and NO ONE SUSPECTS her \"brother\" is her lover. NO ONE. EVER. Not even when he never leaves her house for his own after he's back on his feet. Because, yeah, they are still boinking on the side on Mondays and Fridays when her lover gets time off because the 30's, 40's and 50's were TOTALLY known for their flexible work hours. (And yet Raymond, Alan's lover, has to leave every night by 10pm, or ALL THE NEIGHBORS WILL KNOW.)Cora also meets up with Louise in the 1950's and shakes some sense into her, causing Louise to head to New York. SHE is basically the impetus for Louise making her modest \"come back\" of sorts.The end felt like it was written by a fangirl. \"Oh and Cora is so modern and enlightened! She also encouraged Louise to be amazing and not give up! And everyone loves her! And she still has lots of sexy sex with her lover under everyone's nose and her husband NEVER SAYS A WORD!\" (hide spoiler)]"}, {"userName": "Maria Clara", "userReviewDate": "Mar 16, 2016", "userURL": "http://www.goodreads.com/user/show/46308842-maria-clara", "userReview": "Realmente este libro a sido toda una sorpresa! En ningún momento creí que fuera a gustarme tanto, ni a sorprenderme como lo ha hecho. Según la sinopsis, acompañamos por un mes a Cora y a Louise Brooks a Nueva York, pero hacemos mucho más que eso: vemos la prohibición del alcohol, los trenes de los niños sin padres que eran repartidos por todo el país como si fueran ganado, la estricta moralidad de los dorados años 20, amores prohibidos y los prejuicios de la homosexualidad y sus penas..."}, {"userName": "Millicent", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/77231862-millicent", "userReview": "I really enjoyed this book. This is the first book I've read by this author. I thought it was really neat how the author put together true facts about the actress Louise Brooks but also added to the story so that it was a mix of fiction and biography. It gives you a sneak peak into how her life was like. It also takes place in the 1920's which I also really liked because I love old Hollywood. The book goes into depth about each characters personality and life. Louise was a headstrong and determined girl with a rebellious streak and I found her character to be inspiring. There were some sad parts in this book but all in all I thought it was a really good read and very descriptive, I would recommend this book to anyone who likes the 1920's or reading about other peoples lives."}, {"userName": "Jane", "userReviewDate": "Jan 17, 2013", "userURL": "http://www.goodreads.com/user/show/2050107-jane", "userReview": "I’m usually wary of novels, set in a period within living memory, that use real people, who lived and breathed, as characters, but there was something about this book that called me. And I’m very glad I did.And, of course this isn’t the story of Louise Brooks, silent movie icon; it is the story of one woman who crossed paths with her in one summer that would change both of their lives.It opens in the early 1920s, the in Wichita, Kansas, where housewife Cora Carlisle has undertaken to act as chaperone to the teenage Louise Brooks, who is heading to summer dance school in New York. At first it seems to be a study in contrasts: Cora is conventional, prim, proper, and always aware of proprieties, while Louise is headstrong, confident and determined to experience everything the world has to offer. But it soon becomes clear that the truth is more complicated than that; that Cora had quite unexpected reasons for wanting to come to New York, and that there was much more to Louise than it had first appeared.Laura Moriarty handles all of this very well. Her words feel right and are so easy to read that I always felt safe in the hands of a very capable storyteller. She brings the period, in both the small town and the big city, to life. And she weaves in so many themes – racial segregation, prohibition, sex and sexuality, family and identity – in a way that seems completely natural and right.But I am wary of saying too much, because I think the developments that moved the story forward and developed the characters are best enjoyed first hand. They sometimes took me by surprise but they always made perfect sense.It was lovely to watch Cora’s journey; so many of her opinions and attitudes changed as she saw more of the world, and as I saw this and as I learned more of her history I grew to like, and admire, her more. She began as an unremarkable small town housewife, but as the story unfolded she became even interesting than her young charge.When the summer in New York drew to a close Cora made an extraordinary decision. The story should maybe have ended there, it would have been a wonderful ending, it would have left so much to think about. But it didn’t.A shorter second act carried the story forward, through the rest of Cora’s life. The contrast between Cora, who defies convention but keeps up appearances, and Louise, who in unconcerned about either, is fascinating but there are problems. The years rush by, there are none of the intriguing questions that underpinned the first act, and thought the story is plausible – and Louise’s real life has clearly been well researched – it is a little more difficult to believe that what went before.It said much that was interesting, and I was fascinated to see the future unfold, but it wasn’t quite as strong as what had gone before. Maybe a simple afterword would have worked better.But I still have to say that The Chaperone is a gem: a wonderfully readable story of two fascinating women with much to say about their lived and their times."}, {"userName": "Noeleen", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/5333773-noeleen", "userReview": "Duh! I'm embarrassed to say that I didn't realise until towards the end of this book that Louise Brooks was a real person. So once I finished reading, I spent another hour or so looking up information on the web about Louise, old photographs, articles and videos. I love when a book directs me towards something new and interesting that I didn't know about before.I found The Chaperone a really good page turner of a story, not a story pre-dominantly about Louise Brooks but about Cora Carlisle, Louise's chaperone for a few weeks in New York. I really loved Cora's story and her character. Her tale and experience was both sad and encouraging. What a strong character she turned out to be, although I did find that at thirty-six she acted and behaved years older than her age, I guess this was a sign of the times. Louise also had a sad story although she never appeared to learn from her experience or redeem herself. I couldn't help but be reminded of some young famous actors and actresses today and how we see them splattered in a bad light, across the pages of magazines, as a result of their behaviour. I guess fame and fortune will always have its price and some will never learn to appreciate the opportunity they have been given, no matter whether it's in the 1920's or in the present day. Whilst Louise's behaviour shocked for the times she lived in, similar behaviour appears to be the norm in today's society and we appear to have grown to just accept it and take it for granted. I wondered just how scandalous Louise's behaviour would actually be considered today.Initially I thought that Cora and Louise were exact opposites of one another but upon reflection, I'm not too sure that this is the case. I think they both had a lot to learn from one another and both perhaps craved each others courage.The Chaperone really tried to deal with so many issues which affected both men and women during this era; societal values, expectations, restrictions, behaviours and morals of the times. What a difficult time it must have been to try and live a lifestyle choice appropriate and suitable to one's own personal preferences, outside the barriers of societal norms. What a difficult time it must have been for a child on the train not knowing where they would end up. This was a well written book with a really good story. I think perhaps the book may have tried to deal with too many issues at once. There was a lot to consider and digest but overall I think Laura Moriarty did a very good job of linking it all together."}, {"userName": "Becky", "userReviewDate": "May 21, 2012", "userURL": "http://www.goodreads.com/user/show/1758987-becky", "userReview": "I have had this book on my shelf for ages, so glad I finally decided to read it.The book tells the story of Cora,( fictionalized) from her childhood on up. As an adult in Wichita, Kansas, she has the opportunity to be a chaperone in NYC, to a 15 year old girl, Louise Brooks, who became a real life silent film star. It is really 2 stories in one, we follow Cora & her life & what is was like for women at this time in history, I enjoyed that very much. It talked about what they had to wear, about birth control, what they were allowed to talk about, etc-very interesting. The 2nd, smaller part of the story was about Louise, she comes & goes throughout the book.Great book, interesting little segment of history(the orphan trains!) & all the changes that happened in that era, exciting times!"}, {"userName": "Kathryn", "userReviewDate": "Nov 03, 2012", "userURL": "http://www.goodreads.com/user/show/2825213-kathryn", "userReview": "I’d had this on my TBR list for a couple of years, and can’t even remember why I added it, but it was an enjoyable read.I’m not sure whether I should admit to not having known who Louise Brooks was - she was a famous film star in the early to mid-20th century, and Laura Moriarty has woven a story around her and the summer she went to New York to attend Denishawn, a famous dance studio, with a chaperone.I did some googling of Louise Brooks while I was reading this. I don’t know whether she definitely had a chaperone at this time (in the book, she was only 15, so I would have assumed she’d need some kind of guardian, if that was her true age), but the story was very cleverly done. Louise was not the main character, but aspects of her real life were included in this fictional account of the main character - Cora Carlisle, the chaperone - who started out as rather prim and proper but became much more forgiving and tolerant as the story progressed. I did, however, feel sorry for her in her role as chaperone to Louise - no doubt I also would have come across as prim and proper when challenged with Louise’s defiance of conventions! I also felt sorry for her when we found out more of her back story.There was an aspect of the story which involved the orphan trains sent out from New York into the Midwest, which has now made me want to read Orphan Train by Christina Baker Kline!"}, {"userName": "JoAnne Pulcino", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/5096613-joanne-pulcino", "userReview": "CHAPERONELaura MoriartyA captivating and thoroughly enchanting novel of two very diverse women and their impact on each other that will affect their lives greatly.In the summer of 1922 the stunningly beautiful fifteen year old Louise Brooks sporting her soon to be famous black bob and blunt bangs wants to leave Wichita, Kansas to study dance at the Denishawn School of Dance. Against her will, her family decides their willful, arrogant daughter cannot go without a chaperone. Cora Carlisle a traditional wife and mother with a haunting agenda of her own in New York, agrees to accompany Louise. The clash of their personalities and different generations makes for a rocky road, but they both profit from their differences. Louise will go on to become a world famous silent film star, a madcap and unrestrained icon of her generation. A surprisingly intriguing story line in the book is the secret lives and deceits that exist in the lives of the characters. Ms. Moriarty’s skill in her treatment of the same lies and deceits is nothing short of masterful.The novel is rich in the history of the changing mores of society at that time. The subjects covered are everything from Prohibition, orphan trains, flappers, the Great Depression and the growing movement for equal rights. That pretty much covers the vastness of this wonderful book."}, {"userName": "Marci", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/1689810-marci", "userReview": "This was supposed to be a triumphant, even inspiring story. I found it neither. It was sad and cautionary to me.I'm not recommending this to my friends unless you really want to have an imaginative glimpse into the summer that rebellious, free-thinking 15-year-old Louise Brooks went to New York. That part was written pretty well and draws you into the life of the \"chaperone,\" Cora Carlisle, the fictional character of the title. The pacing afterwards was extremely uneven to the point of being off-putting. SPOILERSWhat was more off-putting for me was the development of Cora's amorality--she starts out as a pretty conventional woman, and her change to one who not only accepts but participates in what at the time was viewed as immoral behavior with no psychological repercussions struck me as unbelievable, particularly as it apparently developed in an extremely short time. It felt like a propaganda piece for modern tolerance of all forms of behavior, but if Cora could have a fairy tale ending, Louise certainly paid the price for her bad choices, and given that hers is the real, historical character, hers is a cautionary tale that undercuts Cora's with an irony too thick for this book to withstand."}, {"userName": "Carol", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "An interesting historical read about Cora who becomes a chaperone for a fifteen year old Louise Brooks for 5 weeks one summer in NYC where she seeks out and finds the sad truth of her past and finds happiness for her future. The book addresses many difficult issues of the times spanning from 1922 thru the 1970's such as prohibition, homosexual relationships, unwed mother's with unwanted children, segregation, and use and advertising of contraceptives.I must admit that I had no knowledge of silent film star Louise Brooks prior to reading this book, and although the plot seemed to drag a bit in the beginning, I really enjoyed the book on the whole especially the interesting life of character Cora."}, {"userName": "B the BookAddict", "userReviewDate": "Oct 16, 2013", "userURL": "http://www.goodreads.com/user/show/19832827-b-the-bookaddict", "userReview": "The blurb of this novel actually misleads readers, in my opinion. The story merely skims life of the legendary Louise Brooks, 1904-1985, dancer and actress, the woman who popularised bobbed hair. It is instead the story of Cora X, later Cora Kaufman, finally Cora Carlisle, a woman who broke all the rules in her own quiet way and went on to live the life she so richly deserved. A 3.5★ novel."}, {"userName": "Lauren", "userReviewDate": "Nov 26, 2012", "userURL": "http://www.goodreads.com/user/show/4905007-lauren", "userReview": "As a disclaimer I will say I read this whole book on one long plane ride, so that may have made me like it less than I would normally. It was an exciting plot and I was never bored, however some things really bothered me:1) I could not believe the main character at all. For one thing she went through a 180 in her personal beliefs all because of Louise and Mary O'Whatever...both of whom were obnoxious and unenjoyable. I had a REALLY hard time believing her relationship with Joseph. And why did she even go to NYC with Louise in the first place? She has a wealthy husband at her command, she could just ask him to pay for her trip. 2) Louise Brooks did not need to be in this book. She was an interesting side character but I think her name and image were just used to create interest, she didn't carry the story at all. 3) Occasionally the author would switch from her POV to talk about the history of the situation. It felt lecture-y and unnatural. 4) After reading this book I had a very clear view of the authors political views on some women's rights issues. It's not that I don't agree with her, but it was distracting from the story. That being said, I'm not sorry to have read the book and it was a quick, interesting read. I probably won't recommend it."}, {"userName": "Nancy", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/1102403-nancy", "userReview": "I loved this book! The story is compelling and the message is amazing. The biggest part of it is set in the 1920s and 1930s in the Midwest and in New York City. It personified an era of strict morals and a stratified society during a period of change. Through strong female characters, Cora and Louise, each crying out for change in her own way and within her own societal- and self- imposed boundaries for behavior, we see how transitions between eras are not without bumps. By layering my current freedom as a woman upon the way I was brought up during the restrictive and changing morals of the 1950s, 60s, and 70s, and the oppressive society illuminated in this book, it becomes clear that change first comes from within the minds and actions of brave individuals."}, {"userName": "Janice", "userReviewDate": "Jul 10, 2012", "userURL": "http://www.goodreads.com/user/show/2513987-janice", "userReview": "I'm a little confused by this book. I'm not even sure how to write this review and articulate my thoughts about it.While it was interesting to learn about Louise Brooks, the story could have done without her. Cora, chaperones a 15 year old Louise Brooks to New York City to attend the Denishaw Dance School. Cora's real purpose in doing so was to use the time to search out and learn of her parentage. She had been an orphan, shipped on the orphan train to Kansas.The whole story is contrived and a bit convoluted. At times, I was really drawn to it and other times a bit bored, especially in Part Three. I enjoyed it overall, but am confused by it."}, {"userName": "Marcia", "userReviewDate": "Jun 24, 2012", "userURL": "http://www.goodreads.com/user/show/147315-marcia", "userReview": "An outstanding story of an outstanding woman. No, not Louise Brooks, the famous silent-film star, but Cora, her chaperone on a somewhat brief but life changing trip to New York City in 1922. Cora X Kaufmann Carlisle lived well into her 90s, and along the way she changes from saying things correctly to saying the right thing and in doing so, was \"grateful life could be long.\""}, {"userName": "Rose", "userReviewDate": "Mar 16, 2013", "userURL": "http://www.goodreads.com/user/show/2149039-rose", "userReview": "Favorite quote “That's what spending time with the young can do - it's the big payoff for all the pain. The young can exasperate, of course, and frighten, and condescend, and insult, and cut you with their still unrounded edges. But they can also drag you, as you protest and scold and try to pull away, right up to the window of the future, and even push you through.”********spoiler alert******Between 1853 and 1929, more than 250,000 children rode the “Orphan Train” to new lives."}, {"userName": "Lydia Presley", "userReviewDate": "May 31, 2012", "userURL": "http://www.goodreads.com/user/show/50581-lydia-presley", "userReview": "Okay, seriously - when I first heard about The Chaperone it was through Twitter, and it was because I'd just finished listening to Rules of Civility and loved every second of it. Folks, I am not joking - this book was amazing. It completely lived up to the hype of my ranting and raving over Rules of Civility and, not only that, it reminded me of one of my favorite books of all time: Miss Pettigrew Lives for a Day.This is the story of a mature woman, Cora Carlisle, and an adventure that takes her to New York, New York as the chaperone of a young, impulsive Louise Brooks. The story shifts around, from past - detailing the treatment of orphans and the dangers of being alone as a child during the turn of the century - to future, taking us through the later end of Cora's life. And through it all, there is the portrait of Louise Brooks.This book is in my top three for 2012. It's gorgeous (look at that cover), has the perfect name, the perfect \"hook,\" deals with older women while accurately portraying not only the prejudices of the time, but also making an attempt to show how views began to change and how progress startles everyone as it happens. While reading The Chaperone I was reminded of some of my favorite books while growing up, written by Grace Livingston Hill. I had always loved her books because black and white were so easily marked. The good girls wore their skirts at a respectable level, did not go out alone with boys, did not drink anything more scandalous than a soda-pop, never wore make-up, and lived modestly within their means. The bad girls always sported red lipstick, short skirts, bobbed hair, and pushed against the status quo. When I was a teenager, I loved these stories. Now, as a woman with experience behind her, I look for something more like The Chaperone - a book that blurs the line between black and white and, instead of giving us clear-cut molds to fit into, offers up the idea that people change over time, and what was considered right and good one year might not be the same the next. This is a novel I highly recommend - it's not really \"chick-lit,\" and I think men would enjoy the story just as much. It's a fantastic story about the life of a woman who struggles to keep up with the times - and I think that's pretty much a universal message."}, {"userName": "leslye", "userReviewDate": "Jan 30, 2015", "userURL": "http://www.goodreads.com/user/show/3896845-leslye", "userReview": "The Chaperone is a historical novel very much about the changing of moral attitudes in the early-mid 20th century. I enjoy reading about the 1920s era, and that certainly drew me to this book. Cora Carlisle agrees to chaperone the very fiery 15 year old Louise Brooks (an actual star of the silent screen in the 1920s) to New York to hone her craft. It soon becomes clear, however, that Cora has her own reasons for wanting to return to New York.Cora and Louise, who live in small town Kansas, go to the big city, and this trip changes the course of both their lives. Not surprising for young Louise, who we know becomes a huge movie star of the time, but Cora's story is quieter and more interesting. The book really takes off when Cora starts to tell us about her past, so give it a couple of chapters to get started. Once it does, its a fascinating and well written story, and Moriarty does a good job of capturing the spirit of the times. I didn't have great expectations for this book, but I really did enjoy it! The period detail was excellent, and the plot goes in some unexpected directions. A fresh, unusual book which is too original to be called chicklit. Ultimately, a satisfying read."}, {"userName": "Martha☀", "userReviewDate": "Aug 17, 2012", "userURL": "http://www.goodreads.com/user/show/4834343-martha", "userReview": "I felt slightly misled by the synopsis of this novel, thinking that I would get a window into the life of young Louise Brooks. But this turned out to be the life story of Cora Carlisle, Louise's chaperone during a brief stint at dance school in New York. The story line covers all of Cora's life, not just her role as chaperone. Although Louise Brooks is a loose thread which awkwardly resurfaces, this is Cora's story. Initially, I felt disappointed to not learn more about Miss Brooks but soon enough I was hooked on Cora and rooted for her as she made a silk purse from the sow's ear that life had dealt her. Her naivety and conventionality during her youth gave way to modern ideals that suited her needs. Moriarty touches on so many important themes of the time (1920s) - birth control, Ku Klux Klan, prohibition, sufferage, homosexuality, extra-maritial affairs, etc. There seems to be no social convention that Moriarty shies away from. I was left with the feeling that Cora lived in the most amazing time of change - far greater than the kinds of change that we currently feel."}, {"userName": "Brandi D'angelo", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/22139378-brandi-d-angelo", "userReview": "This book was so interesting to me, as it described life in the 1920's and 30's. We forget how prim and proper lifestyles were. It's hard to believe that people could be arrested for having a drink, or for living with a man you weren't married to. I loved how the story followed two women of different ages, one older and more prim and proper, the other one young and \"wild.\" Interestingly, you see changes in Cora, the older one, as she grows, not only in age, but with the times. My favorite quote is, \"Perhaps she'd needed that long to discover that she was more than youth and beauty, more than her mother's ambitions, more than circumstance. Her beloved Schopenhauer was perhaps right: old age did drop the masks.\""}, {"userName": "Katie(babs)", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/179852-katie-babs", "userReview": "The Chaperone isn't a type of book I usually read because I'm not a big fan of women's fiction overall, but when TLC Book Tours on behalf of Laura approached me about The Chaperone and asked me to be a part of the book tour for Laura, I decided to take a chance and stretch my wings, so to speak.The Chaperone begins in 1922 from the POV of thirty-six year old married mother of two, Cora Carlisle. Cora has a wonderful marriage with a loving husband and two wonderful twin boys who are ready to go to college. Cora lives in the Wichita, Kansas and longs for some more excitement in her life. She's then given an opportunity to be a chaperone to the fifteen year old, Louise Brooks who will stay in New York City for a month to try out for a prestigious dance company in the hopes she'll become a big stage star. Since no other woman has come forward to volunteer and Louise's mother can't go, Cora does.Cora has her own reasons for chaperoning Louise. Cora was an orphan brought up by nuns in New York City until she was nine years old and then sent to the mid west to live with a family. She wants to find her birth parents. Her husband gives her his blessing because Cora knows a dark secret he hides, that if it gets out, he'll be destroyed. Cora has this leverage over him because he owes her big time, and without any fuss on his end, off she goes with Louise to the big city. It's quite the adventure for Cora because it takes her out of her comfort zone and Louise is a handful. Louise is spoiled, immature and is a big flirt toward older men, as well as adventurous. Cora can barely stand Louise, but then she figures out why Louise acts the way she does. She comes to pity her because Louise also has some shocking secrets.The first half of The Chaperone kept me turning the page to see if Cora would find her real parents and if Louise would stay out of trouble. The best part of this novel is the time Cora is in New York City. She bones with the handyman at the children's home she grew up at, who she has a romance with that continues until the end of the novel. It's not necessarily adultery per say on Cora's part when you come to understand the dynamics of her marriage, which is a big spoiler. You sympathize with Cora because she's kind and generous and you want her to find happiness wherever she can. I wanted to smack Louise because she's a bad apple, but what has happened to her when she was a child, around the same age Cora left the nuns, gives some understanding to her character.The Chaperone falters big time when Cora returns home to Kansas and the next five decades of her life fly by. We're given somewhat lax information about Louise and her Hollywood life, and by the last few chapters I was bored because it didn't feel like storytelling and more like I was reading a magazine article with facts and information. If the second half had been as amazing as the first, then The Chaperone would have been in my top 10 best books for this year.The sights and sounds of the decade of the roaring 20's was well done and I really enjoyed Laura's writing and her characters, especially Cora who is a strong and well-crafted character. Louise is one you love to hate, but as time goes on and you find out what becomes of her, all you can feel for the girl who wanted to be the next big thing on the stage and screen is extreme sadness.The Chaperone was enjoyable and I'm glad I took a chance on this novel. It was a departure read for me and well worth it."}], "description": "The New York Times bestseller and the USA Today #1 Hot Fiction Pick for the summer, The Chaperone is  a captivating novel about the woman who chaperoned an irreverent Louise Brooks to New York City in 1922 and the summer that would change them both. Only a few years before becoming a famous silent-film star and an icon of her generation, a fifteen-year-old Louise Brooks leaves Wichita, Kansas, to study with the prestigious Denishawn School of Dancing in New York. Much to her annoyance, she is accompanied by a thirty-six-year-old chaperone, who is neither mother nor friend. Cora Carlisle, a complicated but traditional woman with her own reasons for making the trip, has no idea what she’s in for. Young Louise, already stunningly beautiful and sporting her famous black bob with blunt bangs, is known for her arrogance and her lack of respect for convention. Ultimately, the five weeks they spend together will transform their lives forever. For Cora, the city holds the promise of discovery that might answer the question at the core of her being, and even as she does her best to watch over Louise in this strange and bustling place she embarks on a mission of her own. And while what she finds isn’t what she anticipated, she is liberated in a way she could not have imagined. Over the course of Cora’s relationship with Louise, her eyes are opened to the promise of the twentieth century and a new understanding of the possibilities for being fully alive. Drawing on the rich history of the 1920s,’30s, and beyond—from the orphan trains to Prohibition, flappers,  and the onset of the Great Depression to the burgeoning movement for equal rights and new opportunities for women—Laura Moriarty’s The Chaperone illustrates how rapidly everything, from fashion and hemlines to values and attitudes, was changing at this time and what a vast difference it all made for Louise Brooks, Cora Carlisle, and others like them.", "title": "The Chaperone", "url": "http://www.goodreads.com/book/show/13056159-the-chaperone", "average": 3.85, "cover": "https://images.gr-assets.com/books/1442892878l/13056159.jpg", "reviews": 5329, "authors": [{"url": "https://www.goodreads.com/author/show/133995.Laura_Moriarty", "name": "Laura Moriarty"}], "type": ["Historical", "Fiction", "Historical", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/13056159-the-chaperone", "http://www.goodreads.com/book/show/14580845-the-chaperone", "http://www.goodreads.com/book/show/16043753-the-chaperone", "http://www.goodreads.com/book/show/21956175-una-acompa-ante-en-nueva-york", "http://www.goodreads.com/book/show/14769746-the-chaperone", "http://www.goodreads.com/book/show/15775049-the-chaperone", "http://www.goodreads.com/book/show/229201.The_Center_of_Everything", "http://www.goodreads.com/book/show/566850.The_Rest_of_Her_Life", "http://www.goodreads.com/book/show/4994116-while-i-m-falling", "http://www.goodreads.com/book/show/35068798-american-heart", "http://www.goodreads.com/book/show/38748862-what-the-world-is-reading-summer-2013"]}