{"ratings": 11368, "userreviews": [{"userName": "Paul Bryant", "userReviewDate": "Jun 08, 2014", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "This was exactly the novel I didn’t want to read, but at least it’s official now – NO MORE IAN MCEWAN BOOKS FOR ME, EVER. I would like to tell you how stupid this novel is, but Maciek beat me to it – see his great review herehttps://www.goodreads.com/review/show...So let me tell you about the boring sentences you have to accept into your life if you read this book. Here’s one:Now, in the late afternoon, although the sun was still high, the eastern sky had lost its vivid purple and, fading by degrees through nursery blue to diluted milk, effected, across the precise line of the horizon, the most delicate of transactions with the pale grey of the sea.This is, I take it, what people mean when they harp on about the Ian McEwan prose style. It looks, to me, as if, Mr McEwan, has broken in to James Ellroy’s office, and, stolen all James’ commas. Never have, I seen, so many clauses, and commas, in one short, novel. For me the effect is akin to reading through a stocking mask, the kind that robbers used before they all switched to balaclavas. Especially when our prose stylist is continually, dementedly, describing the weather, the streets of Venice, or the furniture in the rooms. Ah how he loves furniture. Cutlery too. You can tell this is pretentious I mean literary because although it’s set in Venice the V word is never mentioned. By now I have realised what Ian McEwan’s USP is. What he does is he describes in tedious detail a couple of ordinary novocained middle class English types in an ordinary situation and just when you’re dozing off he has a page of lurid violence. Sometimes the lurid violence comes at the beginning, sometimes in the middle, and here at the end. Here’s another McEwanbite for you. I think this is the way dead people would write, if they could :In the evening they decided they were suffering from lack of exercise and made plans to catch the boat across the lagoon the next day to the popular strip of land whose beaches faced the open sea. This led them to talk at length and euphorically, for they had just smoked another joint, about swimming, their preferred strokes, the relative merits of rivers, lakes, swimming-pools and seas, and the precise nature of the attraction water had for people : was it the buried memory of ancient sea ancestors? Talk of memory caused Mary to frown again. The conversation became desultory after that, and they went to bed earlier than usual, a little before midnight.Notice “the popular strip of land whose beaches faced the open sea” – he can’t give it its name, which would be the natural thing to do, because for some reason of high literature, he has decided not to say that the city with its canals and no traffic is Venice. So he has to use this forced circumlocution.This novel means nothing. It portentously gestures towards some kind of statement critical of men who think that women really like to be beaten up and by extension how feminism is destroying life as we know it but the denouement capsizes any attempt to make sense of the plot.This novel promotes yet another version of the concept that (some) victims actively participate in their own destruction. Why do they do this? Well, who knows, not Ian McEwan, that’s for sure. They just do. Too much novocaine maybe. I am promoting the idea that readers can do without Ian McEwan."}, {"userName": "Lisa", "userReviewDate": "Dec 20, 2016", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "Introduction:As I have taught teenagers the art of writing an essay, and they have taught me the art of detecting a shortcut, I will apply it here (the shortcut, that is), for honestly, the deeply hidden teenager in me tells me that I should not, under any circumstances, waste too much time writing a review of this book. To search for a reasonable plot, characterisation, or purpose (except for cheap voyeurism and violence) is quite futile. I should, however, mark it as read and forgettable before I forget it again. So here is the review, with quotes and all:(Teacher’s note and feedback: \"Do not speak of yourself and your experience in the introduction, remain neutral!\" Student’s reaction: “I am not neutral!”)Main Body: (Teacher’s note and feedback: \"Do not call the main body of your essay main body, come up with something more telling!\" Student’s change: “The Novel”) For my essay, I will use two significant quotes from the novel and paraphrase them to match my reading experience. (Teacher’s note: \"Try to find a more subtle transition from introduction to main part!\" Student’s question: \"Why? And how?\")Quote 1 from the text:“She sleepwalked from moment to moment, and whole months slipped by without memory, without bearing the faintest imprint of her conscious will. ” Paraphrase to explain reader’s experience:“She sleepwalked from page to page, and whole chapters slipped by without memory, without bearing the faintest imprint of her conscious will. ” (Teacher’s note: \"Can you explain that more in detail, please?\" Student: \"No, I have forgotten the rest!\")Second reference from the text, as required in the rubric:“What tended to happen, to Colin and Mary at least, was that subjects were not explored so much as defensively reiterated, or forced into elaborate irrelevancies, and suffused with irritability.” Paraphrase:“What tended to happen, reading McEwan at least, was that subjects were not explored so much as defensively reiterated, or forced into elaborate irrelevancies, and suffused with irritability.” Conclusion:I think this student has studied Ian McEwan enough to make the decision to give it up entirely for the time being, and to explore other realms of literature from now on. There is not much to hope for! His novels are a mixed bag, some are tolerably good, others are interesting at least, and some are just plain forgettable. The last two or three I read were of the forgettable kind, and there is just too much good stuff to read out there to repeatedly engage in “reiterations of elaborate irrelevancies”. Ten or eleven of Ian McEwan’s novels are more than enough!Note from student to teacher: \"I fulfilled the rubric, so you will have to give me the marks. And it is okay to present your own opinion in the conclusion. You said so yourself!\"Note from teacher: \"Be careful to consistently use formal language. Grade and individual, detailed feedback will be returned after Christmas break!\"Student: \"Oh, come on!\"Teacher: \"I am a human being as well, and need my weekends!\"Student: \"Unreliable statement, lacking evidence!\"Teacher: \"These kids nowadays leave me speechless… but they are more entertaining than the novel I just read! I wonder if my Student Alter Ego even read it?\"Student: \"No, Teacher Alter Ego, I did not. For if I had, I would have told you that it is not for students: gratuitous violence, unmotivated, random story lines, superficially shocking…\"Teacher Alter Ego: \"Fair enough, is would not have been possible to make a proper characterisation or plot analysis either, as the protagonists are completely unrealistic: who would follow a stranger to his house and listen to his stupid life story and then return despite clear indications that he is brutal and manipulative…\"Student Alter Ego: \"My point precisely. I stopped listening to him and went home before it got creepy!\"Teacher Alter Ego: \"Good, then we don’t have to add spoilers. How are we going to rate it?\"SAE: \"The book I haven’t read, you mean?\"TAE: \"But I have, unfortunately, - side effect of the profession. So?\"SAE: \"Give it 2 stars, then. It is not as bad as The Alchemist or The Da Vinci Code.\"TAE: \"Good point. 2 stars. But no recommendation.\""}, {"userName": "Maciek", "userReviewDate": "Feb 04, 2011", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "This was the first novel by Ian McEwan that I've read ages ago. I got a copy from a supermarket sale and read it in a day, wondering all the time how someone could write down so many nasty things and get away with it. Cut me some slack, I was 10.So, as I sat to rediscover this classic, I hoped to feel at least a fraction of the weird pleasure this novel brought me back then. The thing is short - 120 pages long - and you can easily breeze through it in two hours.I have to say that this might be McEwan's darkest book, but it's also his most nonsensical, beating even the infamous On Chesil Beach. NOTHING in this book makes any sort of sense whatsoever, and the plot can be best described as \"two morons go on a holiday where they meet two crazy people who do horrible things to them for no apparent reason\". McEwan can write and the best thing about this novel is his prose, but unfortunately he proves that he can write about nothing in particular and not only get away with it but also win accolades for his fiction.Amazingly impropable plot developments (the couple goes to the beach when the sky is completely overcast, and is even described as being black...the bars are closed at 9PM in a big city(!) and when the couple find a bar, the waiter refuses to serve them water(!!)) combined with amazingly stupid and inconsistent character actions (the man our couple meets is a thug with a gold chain, who shares on the spot the story how his father abused his siters and how they took revenge of thim, which included a lot of feces and turkish rugs - AND THEY GO AWAY WITH THIS DUDE TO HIS HOUSE, it's true check for yourself!) combined with a lot of calculated, creepy stuff thrown in for further shock value (the man tells the girl that he'd like to bind her to a machine that would constnatly penetrate her body, even after her death - and she tells him that she'd like to cut his limbs off and keep him for sex - AND THESE PEOPLE HAVE CHILDREN, thank God this is fiction!) combined with a lot of schtooping and booze (the two lovers eat practically nothing, sleep in the streets(!), drink gallons of alcohol and when they get back to a hotel they make sweet and passionate love for like FOUR DAYS - what was McEwan thinking?).All of this is written in McEwan's cool, detached prose, with not a smile in sight, which leads me to the interpretation that he was writing this as a satire of some sorts, a black comedy, a spoof, daring the reader to laugh out loud. But the back blurb speaks about \"an elegant and miniature gothic...smooth and classy\", and McEwan himself stares at me with his confident, serious look from the author portrait, which means that both he and the readers actually took this stuff seriously. How they could is beyond me. Is everyone stupid? Maybe the paragraph where the man reveals the fact that he feels an emptiness between his scrotum and anus was to be taken as \"the power of evil\"? Or when they find themselves naked in the house of the guy they've meet (the feces guy) and accept his dinner proposition is to be taken as \"erotic menace\"? I don't known. Stupidier things happened to people, but nowhere you'll find a cumulation of them more embarassingly put together than in The Comfort of Strangers."}, {"userName": "Agnieszka", "userReviewDate": "Nov 02, 2009", "userURL": "http://www.goodreads.com/user/show/2446508-agnieszka", "userReview": "I normally don't write negative reviews. But this novel far too long bothered me so I need to get out it of my system. I hope it helps.Definitely the worst McEwan’s novel I’ve read by now. It’s creepy and stupid. I mean protagonists are stupid and some creepy things happen to them. Probably because they are stupid. Colin and Mary go for a holiday to take some rest, escape ennui and maybe rekindle withered desire. Since I’m generous today I imagine for them Venice, though I don't remember if the name of the city was even mentioned. Anyway, on the spot they’re wandering, drinking a lot, making love. Typical holiday stuff. During their tours through the city, they're constantly losing their way what probably had to herald impending disaster, they meet a mysterious man, Robert, who offers them his services as a guide . Charismatic and persuasive stranger ( is he really that one or maybe our dorks, to crown it all, are blind ones? ) invites them to his residence where they will meet his physically disabled wife, Caroline. And instead of take to their heels, one could see there was something wrong coming a mile off, our lovers accept invitation. It's hard to perceive every stranger as a pervert or psychopath with an axe but a bit common sense didn’t do harm to anyone yet. But, well if stupidity had wings these two would fly as (turtle)doves. The comfort of strangers  is one of the earliest McEwan’s works but we already can discern here typical to his writing obsessions that would become his hallmark. Dash of macabre, menace, quirk, meanness and surreal aura; though, to his credit, in his later works these ingredients are much better balanced. This one was promoted as mixture of thriller and study of dark sides of human psyche. Well, unfortunately to me it was unreliable, repulsive and unimaginable display of stupidity and cruelty. I found it calculating, with the aim of shocking a reader ( well done, Mr McEwan ) and depressing as fuck. But written as usual with impeccable, somewhat impersonal and cold prose. Thus two stars."}, {"userName": "Glenn Sumi", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/28854579-glenn-sumi", "userReview": "Yikes. Did I just read that? Or did I dream it?\n- thoughts just after finishing The Comfort Of Strangers3.5 rounded up to 4. After reading three Ian McEwan novels, each one different but all rather elegant and civilized, I thought I’d try one of his early books, written back when he had the nickname “Ian Macabre.”The Comfort Of Strangers (1981) is a chilling psychological thriller about Colin and Mary, an attractive, if rather self-absorbed, unmarried couple who are vacationing in an unnamed city that has all the old-world markers of Venice. One night, while looking for a restaurant, they get lost in the narrow, labyrinthine alleys and run into Robert, a gruff older man who grasps them a little too tightly and leads them to a bar. After a long night at the bar (which it turns out Robert owns) and a surreal early morning spent wandering around in a daze, they once again run into the man. Coincidence? Creepy? Whatever. Robert appears friendly and invites them to his spacious home, which he shares with his nervous wife, Caroline, who’s got a mysterious disability. I won’t reveal what happens next, but I will say that you’ll be reading between the lines, questioning the older couple’s motives and the younger couple’s naivete. A weird whiff of sexual and erotic menace hovers over much of the second half of the book; at one point the tourists wake up naked in a strange bed and Colin’s forced to either wear a woman’s nightie or a towel. This book threw me off-balance. Several times, especially from the midway point onwards, it felt like the narrative ground beneath me was shifting. It didn’t help that Colin and Mary seemed to have no one they could talk to. It made me wonder whether this was an allegory about relationships and alienation. And you might want to consider the title of another famous novella set in this same city. (Hint: it’s written by a Nobel-winning German author.)I’m not convinced this was the best use of McEwan’s talents. (Of course he would go on to much greater acclaim a few years later.) But there are a couple of sequences - including a long, extended story that Robert tells about his father, and the horrific climax, which we’ve been dreading for chapters - that are simply transfixing. I’ve only been to Venice once, but if I ever return, this sinister book will be rattling around in my head if I ever find myself lost and trying to get back to my hotel. Mio dio I hope that never happens."}, {"userName": "❀Julie", "userReviewDate": "Jan 19, 2016", "userURL": "http://www.goodreads.com/user/show/7425446-julie", "userReview": "I seem to be in the minority based on the ratings, but something about this story grabbed me right from the start.  There is irony in the title as the story brings anything but comfort, which may actually be why I liked it.  The characters are rather strange and unlikable, their relationships are strained, and the story reaffirms everything you were taught as a child about not talking to strangers.  An English couple’s holiday takes on an eerie twist when they find themselves lured in by a stranger after becoming lost.  What follows is twisted and disturbing, but had me completely mesmerized, and having read some of Ian McEwan’s other books I knew he had a tendency to take the story into some bizarre territory.  The ending was very creepy but I think it was the sinister tone and slowly built tension that will stay with me.  Four stars for the thrill of the suspense and not being able to put it down.  Thanks to my local used bookstore for recommending this book!"}, {"userName": "Matteo Fumagalli", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/41077867-matteo-fumagalli", "userReview": "HOLIDAY IN HELL.Videorecensione: https://youtu.be/KCY6XVofaMQUna vacanza all'inferno, quella che fanno Colin e Mary, innamoratissimi ma con la passione sessuale non più accesa come un tempo. Un continuo girovagare in una città marittima disorganizzata e senza indicazioni (È Venezia? Il lettore se ne accorge, ma è come se gli stessi personaggi non lo sappiano affatto), un non-luogo torrido, incredibilmente desolante e privo di coordinate come la psiche umana (o di coppia?). Un romanzo psicologico/psicopatico (bellissimo, per giunta) sullo svelamento del sottobosco ferino, violento, nascosto dentro di noi."}, {"userName": "Shovelmonkey1", "userReviewDate": "Sep 05, 2011", "userURL": "http://www.goodreads.com/user/show/3926982-shovelmonkey1", "userReview": "We're all going on a (pause) summer holiday. No more working for a week or two....Or permanently because we make poor choices about accepting cordial invites from complete strangers. What is it about a glass of two of Prosecco on a warm summers afternoon that makes people so trusting of random strangers when they're on holiday? Perhaps we find some of our holiday locations so idealistic and romantic that it's like a fairy tale and so we'll merrily gad about, without a care in the world, believing that no harm can befall us. Yeah right pay attention people. Murder on the orient express? Amity Island in Jaws? Cabin Fever? The Beach? Any of these things ringing a bell? Whether you're enjoying some quiet time by the ocean, on a cruise or simply enjoying the back woods in butt-fuck nowhere with your drunken jock friends, beware YOU ARE NEVER FAR FROM A PSYCHO!Ian McEwan likes to play on these kinds of fears and lets face it, with psychos aplenty roaming the highways and byways of our fair planet he is planting these little worry seeds in pretty fertile ground. The Comfort of Strangers is a warning to all overtly trusting day-trippers, euro-hounds and lovers of the city break.At first I didn't have much interest in the two primary characters but by Chapter 4 I was, despite myself, really enjoying this book. Initially Mary and Colin seem smug and dull. They come across as vain and their relationship appeared to be based on neediness rather than love, like two whiny puppies pawing at each other for affection and attention. However the way they interface with their holiday environment (in a nameless place but descriptions suggest Venice) is how many people have experienced a foreign city. McEwan does an excellent job of capturing the tiredness, even despair you can sometimes feel when lost in a foreign place. That exact moment when a holiday ceases to be fun and becomes more like an endurance test. Enter the new friends; welcoming and there to lend a guiding hand. Or are they? As usual McEwan provides a twist in the tale. It's his literary raison d'etre after all. Better than On Chesil Beach but not as good as the Cement Garden."}, {"userName": "Julie Christine", "userReviewDate": "Mar 16, 2015", "userURL": "http://www.goodreads.com/user/show/1213607-julie-christine", "userReview": "Creepy and spare, this will not be among my favorite of McEwan's remarkable oeuvre. And yet. The Comfort of Strangers was published nearly thirty-five years ago and there is a timelessness about its tone and the shadowy, shuddery story. Perhaps because its setting-Venice (unnamed, but sketched down to the detail of aroma of decay and filtered sunlight)-has not changed. McEwan carefully withheld markers of politics and pop culture, as if somehow knowing the story's potential to live past its Last-Days-of-Disco era. It's fascinating to read this early novel, McEwan's second, to see the same elegant, structured prose, but absent of the warmth and humanity he's achieved in later works. The Comfort of Strangers is like a highly-stylized, black-and-white neo-noir, where the actors say profound things that make little sense. But it's still pretty cool."}, {"userName": "Amaranta", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/34720769-amaranta", "userReview": "Colin e Mary sono una coppia di turisti in vacanza. Sono indolenti, vivono le loro giornate fra le lenzuola fresche di un hotel, uscendo la sera a cena, bevendo e fumando qualcosa. Non sappiamo dove sono. Una città che dalla descrizione sembrerebbe Venezia. E ci trascinano nelle loro giornate senza senso, in discussioni silenziose in un tempo immobile, in un’abitudine ai loro corpi che è normalità, piacere, delicatezza e conforto. Ognuno si prende cura dell’altro come sa. La certezza dell’esserci li mantiene in equilibrio, un equilibrio che sembra instabile, nonostante la stasi del libro. Sono fermi e inquieti allo stesso tempo. Forse per questo si affidano ad una coppia conosciuta per caso. Le parole sono scelte con cura, nulla è in più o in meno, asciutte, tragiche, creano una tensione nell’immobilità che allerta i sensi del lettore fino alla fine, forse solo un po’ frettolosa, ma a rifletterci non avrebbe potuto essere diversa. Una lettura ottima, come nella migliore tradizione di McEwan."}, {"userName": "Rebecca Foster", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "This is the earliest McEwan work I’ve read (1981). I could see the seeds of his classic themes: obsession, sexual and otherwise; and the slow building of suspense and awareness until an inevitable short burst of violence. Mary and Colin are a vacationing couple in Venice. One evening they’ve spent so long in bed that by the time they get out all the local restaurants have shut, but a bar-owner takes pity and gives them sustenance, then a place to rest and wash when they get lost and fail to locate their hotel. Soon neighborly solicitude turns into a creepy level of attention. McEwan has the knack for presenting situations that are just odd enough to stand out but not odd enough to provoke an instant recoil, so along with the characters we keep thinking all will turn out benignly. This reminded me of Death in Venice and The Talented Mr. Ripley."}, {"userName": "Fabian", "userReviewDate": "Sep 04, 2014", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "\"The Comfort of Strangers\" is a the unfortunate combination of McEwan's two worst books (which were published decades later, obviously): \"Saturday\" and \"On Chesil Beach.\" It has that PVoAA (Powerful Voice of Authentic Authority), or that I've-published-stuff-now-I-will-see-places-with-the-eyes-of-a-wealthy-man tone. Ya know, the rich who think they're above even common violence (made, obviously, more \"horrific\" by their occurrence to a man of abundant means, gag). It also has that cringe-worthy vanillaness, exemplified rather well in \"On Chesil Beach.\" There are also two lovers in this one; and, like on \"Chesil Beach\", you couldn't give a rat's ass about either one of 'em.McEwan's description, impeccable obviously, quickly becomes a banal thing (and before you pooh-pooh it, think also that at a scant 127 pages, the dude shoulda, minimal, CAPTIVATED us). It's as if McEwan lost track of his plot (we get, we get it: the randomness of events that occur to the average [and I must emphasize AVERAGE] tourist, means basically a looser script, a venture toward a certain plotlessness...) and lashing out in strong but overdoingit strokes, his belting-out of description description DESCRIPTION establishes an ambiance that hinders the main characters themselves. Our dislike is a quick but lasting thing. (Like, imagine for a sec. that Virgil was a dullard in the \"Inferno\"-- Dante's enterprise would've collapsed! There are certain entities that take our hands to take us places, and I believe it is intolerable to make them dunces, dullards, or pure-Fillers.)Like, who cares? shall be the overwhelming and haunted thought reoccuring in your brain throughout as you try to figure out why this book is anywhere near the Great Works at all. (Is it? It's on the 1001 list, so yes.) Overwhelming, I guess, in the sense that apathy is overwhelmingly sad, futile, and UN-ARTISTIC.With \"The Comfort of Strangers\" we begin to form the ugly side of the poetics of this gifted British author. When his books are interested in things, the narrative becomes Vile; when there is no interest for Emotion or Depths in said objects (hell, even the vase in \"Atonement\" is a murky symbol of past bourgeoisie lifestyles colliding/breaking with the harsh pullings of war... but it remains a murkyish symbol nonetheless) the quality of novel really does suffer.\"Comfort\" is all about the brutal nature of strangeness-- yes, people: bad stuff happens. Even if you do have the privilege of traveling throughout European cities and dark avenues for an entire month... even then, bad stuff can happen to you."}, {"userName": "Sandra", "userReviewDate": "Aug 21, 2015", "userURL": "http://www.goodreads.com/user/show/11916501-sandra", "userReview": "Un romanzo enigmatico e inquietante, che parte lento e sonnolento, nel descrivere la relazione tra Colin e Mary, una coppia che non si parla più eppure ciascuno conosce l’altro almeno come sé stesso, per la lunga e abitudinaria convivenza, in vacanza in una città innominata, dominata dall’acqua –un’acqua stagnante ed immobile come le esistenze dei due protagonisti-. Il racconto prosegue in un’atmosfera onirica, come nel mondo ovattato del sogno fatto di silenzi e di gesti lenti e sguardi muti.Un incontro con un singolare personaggio di cui sappiamo solo il nome, Robert, smuove le acque intorno a Colin e Mary, che cominciano ad annaspare nell’acqua trasformata in mare increspato dalle onde, da affrontare con estrema attenzione perché può travolgere e annegare tutto ciò che incontra. La morte aleggia sinistra come il vento che dà forza al moto marino, in un crescendo di tensione ed ansia che McEwan dosa in modo sapiente, grazie a piccoli particolari, a gesti apparentemente insignificanti, a sguardi misteriosi, a frasi spezzate, in un gioco macabro tra Colin e Mary, da un lato, e Robert con sua moglie Caroline dall’altro. Fino all’epilogo orribile, che sconvolge, anche se annunciato, perché le acque calme della coscienza sono sopraffatte dal tremendo uragano delle pulsioni umane che esplodono con violenza.McEwan è uno scrittore abilissimo, riesce a tenere incollati al libro pur non desiderando altro che gettarlo via, per il disagio e l’inquietudine che ne permeano ogni riga. E poi come scrive bene, con uno stile corposo e fluido che dà vita ad una lettura in ci si gusta ogni frase ed ogni parola."}, {"userName": "Pantelis", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/59132978-pantelis", "userReview": "To read in tandem with Paul Bowles' \"Up above the world\"..."}, {"userName": "Steven", "userReviewDate": "Apr 27, 2008", "userURL": "http://www.goodreads.com/user/show/130981-steven", "userReview": "Wonderful and quick piece from McEwan that so captivated me that I was able to finish it in less than one day. Of all of McEwan’s works that I have read thus far, the common theme is the impending feeling of dread that something pretty bad will happen (or at least come close to happening), and no book made me more nervous than this one.The novel concerns an English couple, named Colin and Mary, who are vacationing in a city which is never mentioned, though one that sounds an awful lot like Venice, Italy. Mary and Colin have been together for quite awhile and “often forget that they are two separate people” and their lovemaking often climaxes or is interrupted by sleep. Still, despite the familiarity between the two, it seems like they still love one another very much. Mary is a divorced mother of two and sounds like she is pretty hot and Colin is also apparently quite the catch.They are having a decent time on vacation, though you sense that things are just a little too touristy and a little too hot and they are looking forward to going home soon. One evening, they linger too long at the hotel and get lost while looking for a place to eat and are befriended by a local named Robert. Robert takes them to a bar and shares a bit of his rather odd life story. He later comes to their rescue and brings them to his house where they meet his wife, Caroline. As a reader, you are definitely weirded out by the Robert/Caroline relationship, especially when it is clear that there is some physical abuse going on. Robert is also quite a bit of a misogynist and makes all sorts of crazy pronouncements on the role of men and women in the world.Anyway, it becomes increasingly clear that Robert and Caroline are even creepier than it might initially appear and they have formulated a really unhealthy attachment to Colin. Mary and Colin eventually happen upon Robert and Caroline again and you know that things are definitely going to get worse. Caroline shares with Mary that the physical abuse is necessary for sexual enjoyment between her and Robert and drugs Mary with some tea. (How very English.) Bad things happen, which McEwan in his mastery is intentionally vague about.A few things I found really great about the novel were as follows:•\tMcEwan does an incredible job of describing that feeling that you can occasionally have during a vacation or when you are traveling when you have just sort of had enough, and you are tired of getting lost and the maps are confusing, and you don’t know where to eat and you just kind of want to go home.•\tSo much sexual depravity in the book. Obviously you have the Robert and Caroline situation in which sexual gratification comes through physical abuse and you also a pretty weird dynamic with the two good guys, Colin and Mary. After a renewed sexual attachment, Mary notes that she would like to chop off Colin’s arms and legs and leave just a torso for her and her friend’s enjoyment. Colin wants to build a machine where Mary is pleasured until her death. Yeah, pretty wild stuff there.•\tGreat use of that ominous feeling throughout the book. The moment you meet Robert, you know something bad is going to happen and you cannot stop reading until you find out what it is.•\tGreat use of being intentionally vague in the use of background information on the characters. We know they do all of these things, but we are really never given enough background to fully know why, especially with Mary and Colin."}, {"userName": "Mala", "userReviewDate": "May 30, 2012", "userURL": "http://www.goodreads.com/user/show/5960716-mala", "userReview": "Review of 'The Comfort of Strangers' by Ian McEwan.Recommended for: Travel phobiacs,Armchair travellers,McEwan fansTravel advisory by Ian McEwan:Do not travel.Do not travel to Venice(& Amsterdam as well).Do not go to Venice in summer as the soporific  heat dulls the senses & makes you behave like an airhead.Must have heavy lunch so in case you miss your dinner,you won't go looking for a hotdog stall outside a bar through dark & deserted alleyways.Better take your children along so you won't find time & privacy for lovemaking & stuff so you won't fall asleep & miss your dinner & go looking for that above mentioned hotdog stall.Do not talk to/follow strangers: esp. when that stranger happens to be wearing a clingy semi-transperant shirt,slashed down to the waist & is always touching you & your partner while talking.Am i sounding facetious? I'm not sure.The comfort of Strangers plays upon the inherent fears & apprehensions of an average traveller: The fear of an unknown place/culture/language,the fear of getting lost but most of all the pressure to\"enjoy a holiday\".Tourism remains one of the mainstays of any economy but let's be truthful,travelling is stressful (unless it's an all expense paid vacation) & with increasing restrictions on airtravel,the packing & unpacking,the bloodpressure sure shoots up.Ironically the lead characters here are Europeans,in an European city & still fail to find their moorings! Tellingly the best part of their holiday is spent,cooped up inside their hotel room,rediscovering their lost passion for each-other:\"The thing about a successful holiday is that it makes you want to go home.\"Indeed going away would've been better than the fate that awaited them.It's a twisted little tale where the guilty party is first presented in such a sympathetic light that you don't initially root for the wronged couple,snickering that these dumbos deserve it but as the penultimate & final chapters play out,you realise,horrified,that these are\"ordinary people\" like us.Robert is one of those psychopathic characters in literature that are fascinating & chilling at the same time: a product of a cold & cruel household,he is a damaged person,possibly a victim of incest (the \"bad dreams\" of his childhood) & a repressed homosexual (the hint is that his horrible father is also one).I'm reminded of Blanche duBois from 'A Streetcar Named Desire',who,while being led away to be institutionalised,says that she has always depended on the kindness of strangers. Poor Blanche,bereft of all the vestige of her once genteel Southern past,still can't bring herself to use the loaded word 'comfort' & settles for'kindness'Now that Goodreads is all agog with reviews upon reviews on books like Fifty Shades of Grey & others of its ilk,with everybody jumping on the bandwagon with pretend reviews & parodies,books like The Comfort of Strangers are reminders that some one's twisted fantasies become another's horrific nightmare.Think about that."}, {"userName": "Mark", "userReviewDate": "Feb 27, 2012", "userURL": "http://www.goodreads.com/user/show/2569035-mark", "userReview": "Well thank the Lord for bulk buying, that's all I can say. A few weeks ago I bought three Ian McEwan volumes. Two books of his short stories and this very short novel or maybe it is a novella. Anyway whatever it is, it was wonderful. Having just finished 'First Love,Last Rites'(FLLR) and been nauseated by the whole sickness of the themes I was very wary of reading anything else by him but as i had bought the three books and as i have always lived by that creed of when you fall off a bike get right back on it again or you might lose your nerve I reclambered on the McEwan cycle. Am really pleased I did.This is a really unsettling and chilling story of obsession and blindness. It is not book which expunges the grossness of 'FLLR' for it still very much is dealing with the dark and hideous side of sexuality flipped over into weirdness but it leads you along in a horribly powerless state. The two main characters, Colin and Mary, living in an oddly unclear relationship are holidaying together in the unnamed but clearly recognizable Venice. Their time is spent ambling, getting lost, getting frustrated and then rejuvenating themselves in initially indolent and unthinking love making but then, after encountering the oddly sinister Robert and his wife Caroline, their love-making becomes something of power and wonder to them both.The story is of their seeming hypnotic fascination, rather like rabbits in headlights, with the aforesaid Robert. Like a clever piece of camerawork McEwan keeps drawing your attention to hands and arms which grip or lead or hold for unnecessarily lengthening times. He doesn't draw out the significance but it punctuates the narrative like a mantra and I found myself beginning to cringe and squirm.The story starts understated and the boredom of the lovers at the beginning infects the reader but in just the same way their gradual discoveries and realizations also affect. Mary's nightmare and the affect of her understanding its cause are brilliantly thrown at the reader. From that moment, for me, the story gathered a horrible inevitability and I began expect horror and looked for it everywhere. It hung over the story and weighed it down. I did not know what to expect but something was coming. McEwan brilliantly unsettled and unnerved me and all done with beautiful language but very little explicit scene painting."}, {"userName": "Solistas", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/42053546-solistas", "userReview": "\"Δεν ήταν πια ένα μεγάλο πάθος. Οι χαρές τους βρίσκονταν στην αβίαστη συντροφικότητα, την οικειότητα των συνηθειών και των τρόπων, το σίγουρο, ακριβές ταίριαγμα μελών κ σωμάτων, τόσο άνετο, όσο η εφαρμογή ενός εκμαγείου στο καλούπι του. Ήταν γενναιόδωροι κ νωχελικοί, δεν ζητούσαν ιδιαίτερα πράγματα κ έκαναν πολύ λίγο θόρυβο. Έκαναν έρωτα χωρίς ξεκάθαρη αρχή ή τέλος, που συχνά κατέληγε ή διακοπτόταν απ'τον ύπνο. Ήταν έτοιμοι να αρνηθούν με αγανάκτηση πως έπλητταν\".Η υπέροχη παράγραφος παραπάνω περιγράφει ότι χρειάζεται να ξέρει κανείς για την Μαίρη κ τον Κόλιν, το ζευγάρι που πρωταγωνιστεί σε αυτό το ιδιαίτερα ατμοσφαιρικό βιβλίο του McEwan. Οι δύο τους παραθερίζουν σε έναν ειδυλλιακό τόπο (ο οποίος δεν κατανομάζεται ποτέ, άσχετα αν ο εκδότης/μεταφραστής επέλεξε να βάλει στον τίτλο την τοποθεσία όπου προφανώς διαδραματίζεται το βιβλίο) περνώντας τις μέρες τους νωχελικά. Πολλές ώρες στο κρεββάτι, μετά στο μπαλκόνι κ το βράδυ μια βόλτα αναζήτησης ενός ωραίου εστιατορίου. Σε μια τέτοια βόλτα θα συναντήσουν τον Ρόμπερτ έναν περίεργο τύπο που θα τους πάει σε ένα μπαρ, όπου θα τους διηγηθεί πως γνώρισε τη γυναίκα του.Το βιβλίο έχει μια επιβλητική ατμόσφαιρα με έναν ιδιαίτερο τρόμο που φαίνεται να κρύβεται πίσω από κάθε κίνηση του Ρόμπερτ. Ο McEwan είναι χωρίς αμφιβολία ένας εξαιρετικά ταλαντούχος συγγραφέας που μέσα σε ελάχιστες σελίδες τραβάει μέσα σε αυτή την κατά κάποιο τρόπο άρρωστη ιστορία τον αναγνώστη. Θα μπορούσα να πω πως οι Ξένοι στη Βενετία μοιάζουν με αποπαίδι του Bataille με τον Murakami (όχι του Χαρούκι, του άλλου) αλλά δεν είμαι σίγουρος ότι αυτό δεν συμβαίνει μόνο στο μυαλό μου. Αυτό εδώ ήταν μόλις το δεύτερο βιβλίο του McEwan που διαβάζω (έχω ένα κακό αναγνωστικό κουσούρι, αν το πρώτο βιβλίο που διαβάζω από κάποιο συγγραφέα με ενθουσιάσει καθυστερώ πάρα πολύ να πιάσω το επόμενο. Δεν ξέρω γιατί, το έχω κάνει με πολλούς π.χ. Ισιγκούρο, Σαραμάγκου, Ντελίλο). Ήταν ταυτόχρονα τελείως διαφορετικό απ'το Στην Ακτή κ παρόμοιο θεματικά. Μου αρέσει πως διαχειρίζεται τις εμμονές του ο McEwan κ μέσα στο '18 ευελπιστώ να πιάσω κ τα υπόλοιπα βιβλία του, για αρχή τα πρώτα που κυκλοφόρησε μιας κ τα έχω ήδη στη βιβλιοθήκη3.5*"}, {"userName": "Angeline", "userReviewDate": "Nov 26, 2008", "userURL": "http://www.goodreads.com/user/show/1704204-angeline", "userReview": "As always, Ian McEwan tells this tale with remarkable descriptions, ensuring that the readers see everyone and everything in the novel the way he himself has pictured it. \"The Comfort of Strangers\", like \"The Cement Garden\", is a very quick read. However, it fails to captivate its audience. Pretty much nothing happens up until more than half of the book, which almost made me stop reading it out of complete boredom. His characters are lackluster and some parts of the story are pretty vague. McEwan tries to re-stir interest into the reader through the Mary-waving-from-the-sea bit, but fails miserably. And there was really nothing memorable in the book aside from the part where Caroline finally retells her past with Robert. Furthermore, McEwan - with all his colorful descriptions in the entire novel - leaves the best bits out near the end that I had so longed to read about, leaving the denouement completely anti-climactic and the entire book practically a waste of time. Give this a miss."}, {"userName": "Suni", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/19672760-suni", "userReview": "Dio mio.Allora, con calma: un romanzo che divide, che ad alcuni è piaciuto e ad altri ha fatto schifo, senza tante vie di mezzo.A me ha fatto effetto, diciamo. Piacere è un'altra cosa, ma poche altre letture mi hanno turbata e affascinata e contemporaneamente creato repulsione quanto questa opera \"giovanile\" di McEwan.Da quando si capisce che dietro alle cortesie da parte della coppia autoctona verso i due turisti c'è qualcosa di losco e torbido ho fatto fatica a proseguire. Le ultime pagine non riuscivo quasi a leggerle. Era questo l'intento, o uno degli intenti, dell'autore? Dubito che la risposta sia negativa.E che stile, che atmosfere, che cappa infernale di afa e senso di morte su questa Venezia mai chiamata per nome eppure inconfondibile."}, {"userName": "Mizuki", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/16842102-mizuki", "userReview": "[the evil couple eventually chose the man as their victim and sex object instead of his female partner (hide spoiler)]"}, {"userName": "Kathy", "userReviewDate": "Feb 04, 2012", "userURL": "http://www.goodreads.com/user/show/4111201-kathy", "userReview": "I'm sorry, Ian McEwan, but I don't believe you.There is nothing about this book that convinces me that any of these people could exist in the real world. I cannot work out how Mary and Colin could be encountered anywhere but in a bad novel. I cannot work out why they - apparently boring, middle class nonentities - would take up with someone who is so obviously a criminal from the first moment that they meet him. I also cannot work out why they would agree to stay at his house and then, after he reveals himself to be an aggressive, violent bully, I cannot believe that they would actually go back the next day for another visit! In short, there is nothing psychologically convincing about this book. Furthermore, I am thoroughly irritated by the lists of objects that pass for a descriptive evocation of Venice. I also find McEwan's reluctance to name any part of Venice to be the most ridiculous affectation. (Does McEwan even name Venice itself? Possibly not.) For example: 'they decided they were suffering from lack of exercise and made plans to catch the boat across the lagoon the next day to the popular strip of land whose beaches faced the open sea'. The last ten words of this sentence can be substituted by four letters: Lido. McEwan's repeated insertion of long descriptive clauses instead of proper names seems more like the kind of pointless exercise that might be set on a creative writing course than what I want to read in a novel.The only redeeming feature of this book is that McEwan is good at setting up situations that seem really creepy and that make you feel that something awful is about to happen. (For example, the Lido scene - there you are, I wrote it... Lido. It wasn't hard, Ian. Try it.)Unfortunately, the basic narrative of this novel is so implausible that, when the nasty thing does happen, my only reaction is that I have been expecting something much more interesting and much less obvious.PS I'm not an Ian McEwan hater - really. I enjoyed Amsterdam and Saturday and I have Atonement on my list of books to read, but I'm afraid that this one just exasperated me beyond my limit of tolerance. I'm putting it down to the fact that this was an early work and he got better."}, {"userName": "Paolo", "userReviewDate": "Jan 15, 2015", "userURL": "http://www.goodreads.com/user/show/21988731-paolo", "userReview": "In base a cosa si danno le stellette ?I criteri cambiano nel tempo con ripensamenti anche radicali. Ed il fattore - tempo ha un'incidenza determinante.Per questo libro (del 1981) il fattore - tempo è impietoso: è datato ed invecchiatissimo.I due protagonisti sono due \"giovani adulti\" radical - chic: si capisce che fanno gli artisti, lei è attrice in un \"collettivo teatrale femminile\" ed ha un paio di uscite tipicamente vetero - femministe, ma non è che abbiano granché da fare. Tuttavia (all'epoca la \"classe media\" era numerosa e florida, contava su patrimoni accumulati che consentivano una lunga permanenza nella condizione di adolescenziale nullafacenza) si permettono una lunga vacanza in una città mediterranea, che si capisce benissimo essere Venezia. Venezia che viene descritta con occhio indifferente e superficiale, che è quello dei protagonisti che praticamente trascorrono la lunga (ed immagino costosa) vacanza in camera da letto: lui fuma spinelli, lei fa yoga ed ogni tanto scopano e si confidano fantasie erotiche. Cosa che potevano benissimo fare anche vicino a casa in un albergo ad ore. Quelle rare volte che escono si perdono, anche con la cartina (vero, a Venezia ci si perde sempre e comunque), incrociano gli indigeni, la cui descrizione è tipica dello snobismo anglosassone applicato alla latinità, per cui i tratti somatici di camerieri e \"battellieri\" sembrano piuttosto quelli di un'orchestrina mariachi (\"baffetti neri e sottili e capelli neri pettinati all'indietro\"), per poi venire irretiti in una morbosa situazione da una strana coppia e veder in qualche modo soddisfatta la loro esigenza di trasgressione.Ecco, i protagonisti non sono in grado di suscitare empatia ed emozioni a distanza di anni: sono due esponenti di un certo tipo di umanità (alquanto futile ed inconsistente) legata ad un preciso periodo storico (fine anni 70, inizio anni 80), in cui cose trasgressive o rivoluzionarie si erano banalizzate in trastullo per benestanti annoiati. Di quel periodo resta ben poco di memorabile e la vicenda di Colin e Mary narrata da McEwan mi sembra debba condividerne la sorte."}, {"userName": "Simona", "userReviewDate": "Jan 20, 2014", "userURL": "http://www.goodreads.com/user/show/6222130-simona", "userReview": "McEwan si rivela bravissimo a descrivere, raccontare, indagare l'animo umano. Come già avvenuto in \"Chesil beach\", in cui ha analizzato le insicurezze di una coppia neosposata, anche qui affronta il non detto, la mancanza di dialogo, la difficoltà di comunicare di una coppia. Una coppia come Colin e Mary, i protagonisti di questo breve libricino, che incedono a piccoli passi nella vita e nel loro rapporto che è scandito da una quotidianità fatta di rituali e procedure, di giorni uguali agli altri, di sguardi schivi. A spezzare la monotonia, la quotidianità ci pensa una nuova figura, oserei dire sinistra, che aleggia su di loro, che in qualche modo rompe gli argini. Una figura, un essere misterioso che sembra manovrare le fila delle loro vite come un burattinaio facendoli sprofondare in un abisso e dando al romanzo quel tocco noir che lascia annichiliti e che sconvolge, come un perfetto thriller orchestrato sapientemente da McEwan."}, {"userName": "Aprile", "userReviewDate": "Jun 17, 2012", "userURL": "http://www.goodreads.com/user/show/8294931-aprile", "userReview": "Lettura veloce, incalzante che trasmette gradualmente la curiosità e l'angoscia del finale. La riuscita è decisamente migliore rispetto a \"Chesil Beach\". A questo punto, mi cimenterò con qualcos'altro di McEwan, anche se sono ancora un po' scettica."}, {"userName": "John", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/1478144-john", "userReview": "Two lovers no longer in their first flush of youth, Mary and Colin, are on holiday in a city that seems very much like Venice, hoping to rekindle the passion that has ebbed from their relationship; Mary's occasional worries about how her kids are getting along with their father hardly help the cause.One night, while lost among the city's twisting streets, they encounter the enigmatic Robert. Soon he and his wife, the near-crippled Caroline, have more or less taken over the English couple's lives. Finding themselves enmeshed in a web of power games and perverse sexuality, Mary and Colin can seem to find no means of escape. On the plus side, their love life has suddenly begun to sparkle.While reading this short novel I found myself frequently reminded of Don't Look Now -- the 1973 Nicolas Roeg movie rather than the Daphne du Maurier novella. The plots aren't the same, but there's the same ambience of sexual corruption and inevitable death. McEwan's tale is a far subtler one than the movie's, and to be honest I'm -- for once! -- not so sure that's a good thing. There's a murderous climax to The Comfort of Strangers, all right, but, because of the low-key nature of what's gone before and the allusive nature of the climax's depiction, the affect is chilly rather than blooded. This, too, affects the poignancy that the final, post-climax pages might have had; while reading them, I couldn't help but recall the far stronger emotional punch of the final minutes of Don't Look Now.There's one section of the novel that isn't low-key. Not long after Mary and Colin have met Robert, he tells them at some length a story of his childhood -- of the punishment his sisters meted out to him because he was such an insufferable little bastard, always getting them into trouble with their disciplinarian father, the apple of whose eye the boy smugly was. It's an entertaining and very scatological tale . . . but it has nothing to do with the main thrust of the novel.For a writer so widely admired as a stylist, McEwan is occasionally guilty here of some quite surprisingly sloppy writing. \"Respectfully, Colin stood a few feet off and regarded the objects which suggested a memory game played at children's parties\" (p71), for example. I assume McEwan was aiming for something like \"regarded the objects in a way suggestive of a memory game\", but that's not what he gave us. There were several other such wince-inducing moments. Again, there's all too often the pretentious notion that it's posh writing -- yer literature -- to run on paragraphs that shouldn't have been run on. I think this is a product of the observation that literary writers tend to use longer paragraphs than popular ones. But there's a big difference between, so to speak, thinking in longer paragraphs and just stringing together several shorter ones to create a solid block of type.And McEwan really ought to learn how to use commas.Come to that, the publisher of the reprint edition that I read (Anchor/Doubleday, 2002) should be looking to its laurels too. Although this is supposedly a quality paperback, with cover price to match, the text has been reproduced by good ol' cheapola photo-offset, presumably in order to save the few hundred bucks it'd have cost to OCR the text and proofread the result. Even the small, POD presses generally have a bit more professional pride than this. One consequence of Anchor's cheeseparing is that there are several words missing at the bottom right of page 55. Hey, who needs to spend that extra hour checking the layouts for stuff like this?I have a sort of love/hate relationship with McEwan's writing. I loathe the first part of Atonement, for example, for its turgid, dreary self-regard, its constant, creaking strain for Good Writing at the expense of genuinely alive prose; yet I love the second half of the novel, which is very me-ish in its portrayal of constantly shifting realities. Amsterdam I can take or leave, but in general find less well written than various tales by genre authors with similar themes. And so on.The same is true, in microcosm, for The Company of Strangers. As you'll have noticed, I have lots of reservations about it and yet, overall, I really quite enjoyed the experience of reading the book. Despite everything, McEwan does succeed in pulling you into his tale. Other writers might have done it better (the aforementioned du Maurier is one who springs to mind), but the fact is that it's McEwan who's done it here. If the book were twice or three times the length, I imagine the irritations would finally have come to outweigh the pleasures. As it is, at ~120 pages, The Comfort of Strangers satisfies the moment."}, {"userName": "Barbara", "userReviewDate": "Jan 11, 2010", "userURL": "http://www.goodreads.com/user/show/1883816-barbara", "userReview": "This little book was not a favorite McEwan book for me. Although it had lyrical strengths, it was psychologically cold. I could not help but wonder where the story was going. I will not summarize the plot here, merely comment on the contents.Years ago, my husband and I went to Israel. Our knowledge of the language was meager, mostly the usual pleasantries and words of prayer. We were not part of a tour group, preferring to make our way around the country by public transportation and of course, on foot. The first Friday in Jerusalem, we failed to realize that on the Sabbath, everything ground to a halt- no busses, no restaurants and no grocery stores. We thus headed out into this strange city with dark, winding streets, irregular lighting and no knowledge of where we were going. Our hunger and fatigue from much walking led us to the Arab quarter and a dimly lighted cafe. Despite our inability to converse in Hebrew, we were soon welcomed by a group of young people who invited us to sit with them. My ability to converse in my rusty French served me well!So now I have reached the point of my tale. One would reasonably question the actions of the main characters in this novel, Colin and Mary. Wandering hungry through unknown streets they came upon a stranger who offered them assistance. Were they wise to join him, especially after displaying suspicious behavior? Much of their behavior, or their lack of motivation and inaction, caused me to fail to sympathize with these characters. And why did they continue their contacts with the mysterious people whom they met?McEwan has presented the reader with a dark, almost gothic novel, replete with scenes of sexuality and violence. He has crafted his narrative well, with crispness and tension. As previously noted, the actions of the characters evoked many questions which have caused me to continue to ponder over this book."}, {"userName": "Julie", "userReviewDate": "May 24, 2010", "userURL": "http://www.goodreads.com/user/show/3771119-julie", "userReview": "This is by far McEwan’s darkest book and he sets the mood perfectly. Mary and Colin are on holiday, experiencing some unexplained dissatisfaction with each other until a seemingly random encounter with Robert. Robert introduces the couple to his wife Caroline, and right away it is obvious something more sinister is at play. McEwan has written about the impact of strangers once in “Enduring Love,” but Robert and Caroline are more calculating than the obsessive Jed. The conclusion is more shocking then “The Cement Garden.” Robert and Caroline’s exploitation of Mary and Colin reminded me a bit of “Beast” by Joyce Carol Oates, another novella dealing with similar themes. To go even further, when picturing Robert and Caroline, I almost visualized Minnie and Roman, the deceptive neighbors from “Rosemary’s Baby.” That may be a little extreme, but there’s still some depravity there that is quite unnerving. McEwan’s writing is so atmospheric, but it’s what he doesn’t clearly portray to the reader that gives it the extra sense of tension that drives this book."}, {"userName": "Jonfaith", "userReviewDate": "May 18, 2010", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "What tended to happen, to Colin and Mary at least, was that subjects were not explored so much as defensively reiterated, or forced into elaborate irrelevancies, and suffused with irritability.This slim weapon is a foggy retreat into the nuptual neuroses during the holiday abroad. All baggage isn't declared at Customs. The soul is a mule through Passport Control. Regret and doubt are the rogue's liquidity, the same for the spouse. Lifting Blanche's best line will ultimately avail with kinky proposals and a nightlight stilleto. Beware."}, {"userName": "Stephanie Sun", "userReviewDate": "Oct 14, 2014", "userURL": "http://www.goodreads.com/user/show/118030-stephanie-sun", "userReview": "\"'I woke up and realized something.. If I'd realized it in the daytime I wouldn't have been so frightened by it.'\"Halfway through this book, I spoiled the ending for myself and then almost gave up on it. It was only because I realized that the \"strangers\" of the title, Robert and Caroline, reminded me of the baroque doms and subs of The Bloody Chamber, and that that book had been published two years before this one and was certainly a waking hours influence on McEwan that I eventually continued.I, in the end, read this book more as an allegory about self-destructive and self-annihilating behavior of any kind, rather than an articulate or coherent thesis about the relationship between sex and violence.When we meet Colin and Mary, a \"very ordinary\" English couple, they are rudderless. They are on vacation together in Venice (his choice, as Mary is quick to remind him when things turn especially dull), and have quickly come to despise each other. After three days in this romantic location, everything—the beautiful landmarks, the crowded streets and restaurants, the sex, naps, maid service, and joints on the balcony, her yoga—is routine and bland.They end up falling madly in love with each other again, although the price, as this is a McEwan novel, is steeper than any sane person would knowingly pay. Colin and Mary don't know the price of their few days of passion and happiness, or at least the combination of a somewhat pathological restlessness, the disorientation from being abroad, and just some deep-seated denial that anything truly horrible could really happen combine in them to form a kind of innocence about it.The subtle shifting in their relationship throughout the book is documented with enviable precision by McEwan. The book has many truly beautiful moments, and some of the stuff of greatness. (Sorry for the back-handed compliment!)I did think that Caroline's character did not quite gel together. It was difficult, even at the end, to tell if certain inconsistencies in her stories and behavior were the result of some deliberate ambiguity on McEwan's part or just poor writing."}], "description": "\"Haunting and compelling.\" --The Times As their holiday unfolds, Colin and Maria are locked into their own intimacy. They groom themselves meticulously, as though there waits someone who cares deeply about how they appear. Then they meet a man with a disturbing story to tell and become drawn into a fantasy of violence and obsession.", "title": "The Comfort of Strangers", "url": "https://www.goodreads.com/book/show/6872.The_Comfort_of_Strangers", "average": 3.44, "cover": "https://images.gr-assets.com/books/1388197584l/6872.jpg", "reviews": 993, "authors": [{"url": "https://www.goodreads.com/author/show/2408.Ian_McEwan", "name": "Ian McEwan"}], "type": ["Fiction", "European Literature", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/6872.The_Comfort_of_Strangers", "http://www.goodreads.com/book/show/246543.The_Comfort_of_Strangers", "http://www.goodreads.com/book/show/11935587-the-comfort-of-strangers", "http://www.goodreads.com/book/show/1366101.The_Comfort_of_Strangers", "http://www.goodreads.com/book/show/3904415-cortesie-per-gli-ospiti", "http://www.goodreads.com/book/show/964899.The_Comfort_of_Strangers", "http://www.goodreads.com/book/show/24844578-cortesie-per-gli-ospiti", "http://www.goodreads.com/book/show/23250906", "http://www.goodreads.com/book/show/14740914-cortesie-per-gli-ospiti", "http://www.goodreads.com/book/show/1366096.The_Comfort_of_Strangers", "http://www.goodreads.com/book/show/6867.Atonement", "http://www.goodreads.com/book/show/5015.Saturday", "http://www.goodreads.com/book/show/815309.On_Chesil_Beach", "http://www.goodreads.com/book/show/21965107-the-children-act", "http://www.goodreads.com/book/show/13562049-sweet-tooth", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}