{"ratings": 2208648, "userreviews": [{"userName": "Varsha", "userReviewDate": "Apr 27, 2010", "userURL": "http://www.goodreads.com/user/show/3647485-varsha", "userReview": "My intention of writing a review for this book is to tell all the negative reviewers to SHUT UP! I am all for everyone's right to express their opinion but I read a few of the '1 star' reviews and I was shocked to read what a few people had to say about this book. Before making an opinion I suggest people to keep a few things in mind:1. This is someone's DIARY not a book meant to entertain people. If you think it was boring then answer me, how many interesting things can you possibly do locked up in a place for 3 years??2. For those who comment on the writing-This is a 14year old's diary!! She didn't write it with the intention of winning the pulitzer.3.For those who commented on her ideologies or how nazism is portrayed. Hello!! She was 14!!! And maybe..just maybe its justified to think the way she does considering she LIVED it unlike so many of us who get to sit back on our comfortable sofas and critically analyze every XYZ thing in the world.I believe no one has the right to 'review' much less criticize a written document of a 14 year old's life who made it through the worst of circumstances and through difficulties we cannot even imagine to live through.Its a pity some people think the way they do.EDIT 27th Sept, 2013:I never imagined I would garner so many likes for this review. This only means that a lot of people are emotional about this book and take negative reviews as a personal insult. I wrote this review in a very emotionally charged mind frame. A year later, now that I am older, wiser and more mature, I realise I could have used fewer exclamation marks. :P"}, {"userName": "Nilesh Kashyap", "userReviewDate": "Oct 22, 2011", "userURL": "http://www.goodreads.com/user/show/6361703-nilesh-kashyap", "userReview": "Why do we write reviews?You have a lot of reasons I guess.But for this review there is only one. I am writing this for my conscience. Ever since I have rated this book, I always end up asking myself that, have I rated it with something it deserved or was it just out of sympathy (some call it pity vote)?Reading other reviews (although most people just rate it and proceed) posed me with many other questions and also gave me idea of what people generally think about her and her diary.So I’m going to start with-DO WE DESERVE to review or even rate this book diary?Yes it is a diary not a book. And aren’t diary meant to be something personal? Yes they are, but it was Anne's wish to get her diary published and she even went on to fictionalize the diary by changing names.When I started this book I knew how it would end and who doesn’t! I had the least of the expectation, knowing that she was 13 years old but she just surprised me by the outlook she carried of life. She thought and wrote over few such things that didn’t occur to my mind until I read it but have applied throughout my life. She at times made me laugh, at times made me feel sad. If she felt something, her writing definitely made me experience it and thus she overcame my expectation by large margin.I have read in lot of review that her thoughts were way ahead of her age. Of course they were, difficult conditions make you mature and responsible, but there were also other people living under the same roof and in same condition, the suffering had even effect on them. I remember the letter exchange between two sisters, at that point after reading Margot’s letter, for the first time I realised Anne was still child among them.Some say she could visualize herself and her thoughts and actions from different perspective and thus realise her fault.The thing with diary is that it is a lopsided view of the events. She would write her thoughts and what she wrote of others were her interpretation of them.....I have it in my mind but can’t put it in words and why should I! Does it matter what kind of girl was she? 'NO’ from me. Last thing that occur to me is that many people found it uninteresting and tiresome.I liked it, it couldn’t get any better. I mean they were in hiding for their life in a same house for two years without even opening the window; they were not solving murder mystery. I remember that when I was halfway through the book, I would every now and then turn to the last diary entry and count the days that remained. I felt very sad and depressed and it would have been the last thing to occur to me that it was uninteresting; I was just taken by her wish to see the outside world again, feel the fresh wind and to go to school, but... This is not a book to enjoy much; we read it to gain the insight of hardships that people had to go through during this holocaust. Through this book she give us best view of the worst of the world. No one has ever benefitted from war; all it gives is pain and misery.All this being said there is nothing to review the book, but accept it as written account of the vices of the war.The worst question that seemed to have been slapped across my face was: Would this book have meant the same if Anne had survived the holocaust and lived to become old? Would it have been famous as it is now?Well she didn’t survived and with her ended answer to this question and no one can bring her back."}, {"userName": "Brenda", "userReviewDate": "Jan 19, 2008", "userURL": "http://www.goodreads.com/user/show/347646-brenda", "userReview": "I confess to feeling slightly voyeuristic while reading this. It was constantly in the back of my mind that this was no ordinary novel, or even a true-to-life account. This was someone’s diary. Every page written in confidence, each word revealing the thoughts closest to the heart of this young girl. As a journal-keeper myself, I sometimes find myself wondering, “What if someone else were to read this?” which causes me to wonder how much to filter my words. But then, isn’t the purpose of a diary or journal just the opposite? To record one’s honest and unfiltered thoughts? While reading Anne Frank – The Diary of a Young Girl I do not get the sense that there is any such ‘filtering’ going on. From the ages of 12-15 Anne lived an extraordinary life, and quickly grew far beyond her years in her understanding and handling of a horrendous situation.There are surprises in this book. No matter how broad or limited your understanding of the world events that threw Anne and her family into a life in hiding, I had – before reading this – held the general assumption that, “Well, it was wartime. They were in hiding for their lives. They must have been miserable all the time. Who could possibly find anything good or redeeming in the confines of such a life?” In hindsight, of course, I have had to reconsider. I found bits of beauty, kindness, and even humour popping up in the most unexpected places. And why shouldn’t I? Aren’t our lives much the same? Oh – we’re not dodging bombs and trying to sleep to the sound of gunfire (at least not in Canada). But we, each of us, are often faced with some sort of tragedy or travesty. Sometimes we may have an entire ‘bad year’, or longer. And yet, doesn’t the buoyancy of the human spirit always shine through? It is really tough work to be miserable 24 hours a day. No matter how difficult or challenged our day-to-day life, we all have those little pockets of joy that arise, and sometimes it is those tiny occurrences that make the rest of it bearable.On a personal level, I found myself comparing Anne’s childhood to that of my parents. After all, she was only a year younger than my Mom and Dad. I think back to stories they’ve told from their teen years, and it boggles the mind to think that at the exact moment my Dad and his brothers were tipping a cow, Anne was in hiding on the other side of the world. At a time when my mother was discovering make-up, Anne was realizing that life would never again be so youthful, so joyous and carefree as before the war. A generation was losing its innocence, but in very different ways.I would recommend Anne Frank – The Diary of a Young Girl to absolutely everyone, for I believe that it holds some truth or enlightenment for everyone. I do not own this copy – it was borrowed from my daughter’s school library. She will be reading it next. She is 10. And you can bet that before long I will purchase my own copy, for I will be reading it again someday soon."}, {"userName": "★ Jess ", "userReviewDate": "Jan 14, 2010", "userURL": "http://www.goodreads.com/user/show/2683062-jess", "userReview": "Honestly, I just can't do it. I can't bring myself to finish the book. Ive tried three times already, and each time I have been forced to put it aside. Books and film about the Holocaust are fascinating, but not this one. Unfortunately, I was not engaged and found I couldn't care less. I'll have to try it again in a few years. On the up side, I firmly believe that Anne Frank, had she survived the war, would have grown up to be a marvelous, best selling writer. At the age of 13 her words are better than that of many modern day, famous authors."}, {"userName": "Maureen", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/13427823-maureen", "userReview": "If only Anne Frank's diary was the figment of someone's imagination. If it meant that this spirited, intelligent and articulate girl hadn't died along with so many others in Belsen concentration camp, and that the holocaust had never happened, that would be a wonderful thing, but it did happen, and that makes the reading of this diary even more heartbreaking.For a 13 year old girl, Anne was so articulate - the way she expresses her thoughts and feelings about herself and others is remarkable. She's able to analyse herself in a particularly honest way, her abilities, failures, weaknesses.As Jews in Nazi occupied Holland, Anne and her parents and sister Margot, had to flee their home in Amsterdam to escape capture. From 1942 - 1944 they occupy rooms in an old office building, which they call 'The Secret Annexe'. Anne's diary details daily life within the confines of their safe house. They share the rooms with another couple and their teenage son and also with a former dentist. As can be expected, there were many disagreements, living in such close proximity to others, and even within their own families. Just a few of the office staff knew about The Secret Annexe, and these are the people who kept them supplied with food, but given the fact that everything was rationed due to the war, things became a bit fraught at times. The alternative however, didn't bear thinking about.In August 1944, Anne's diary suddenly becomes silent. No more words will be written in its pages. Someone had betrayed them to the Nazis and they were arrested and transported to various concentration camps. The diary was left behind and was found by the office cleaner. After being interned in two concentration camps, Anne and her sister Margot were finally sent to Bergen-Belsen where they both died - Anne was just 15 years old. Only Otto Frank (the girls' father) survived, and the diary was returned to him.This is one of those books where a silence descends on finishing it. How do you write a review? How do you do it justice? I honestly don't know. All I can think is, what a great contribution Anne would have made to an ugly world if she'd lived, her ambition was to be a writer, and yet, even in death, she HAS made a contribution by allowing us to share those two years in hiding with her, and giving us a chance to see what a beautiful soul she was. Feel so sad right now."}, {"userName": "Alejandro", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/665584-alejandro", "userReview": "Maybe the first thing that most people would get shocked is that I rate with only 3 stars one of the best selling books of the 20th century (and now 21st century too) and even more, a book about the Holocaust.First thing that I learned about this book is honesty.Anne Frank teaches us all about honesty, about telling what you really think, and so I am doing the same.For starters, I wonder how many people really, I mean REALLY read the book, because to rate with 5 stars a famous book that everybody tells you that it's a book that all people should read, and then they got in this commnunity for readers and maybe they feel the compromise to make the rest to think that you really read the book.If not the case, hey, I don't see why anyone can be offended by this comment, and it's true, I don't see either anyone who will complain, since to me it would be only a defense mechanism behind their own guilt of really not reading the book but making the rest that they did. I didn't think about this scenario but commenting about other thing with a reader friend, that thought stuck in my mind.I invested so much time in that because, one has to be honest, the book is tedious since it's not really a novel, it's a collection of diary writings without a coherent line of constructing a story, even you need editors' further notes to know what happened to the people in the Secret Annex since obviously, Anne was unable to tell the final events.So, since it's so tedious, I wouldn't be surprised that some reader tried to read it but at the end they just rated with 5 stars to denote that they are \"cultured\" readers that they appreciate the book as one of the most important books of the 20th century.Between the passages, you learn a lot of things. The first thing that surprised me it's how this diary collection that it was written in the 40's, in Holland, by a teenage girl, almost anybody can relate to the comments and you don't feel them as outdated.Sometimes if you read an \"old\" book, you sensed the outdated of the prose, selection of words, etc... but here I didn't feel it. This diary could be easily being written in present time and I don't think that it would change at all. I think that it was one of its strengths since I am sure that it will be as relevant for many more time.Other thing that surprised me a lot was how much Anne Frank (and by association, the rest of the group in the Secret Annex) were informed about the events in the war, I know, they had a radio, but from stuff that I had read about WWII, there were certain elements of the information that people weren't aware.I mean, at many moments, they denote a certainty that Jewish people were murdered in the extermination camps, of course if you call them \"extermination camps\", of course you know that people got killed there, but that's a term used by me, now, they called them labor camps, and so far I read, Jewish people really thought that they will receive \"baths\" when they were really gassed or burned to death, and it's kinda logical thing since if they were so certained about their deaths, there would be riots on the ghettos to flee in mass and they wouldn't march without protest to the gas chambers and the ovens. Even, Allied forces used espionage methods to know from Nazi prisoners what was happening to the Jewish people on the camps.Anyway, also, there are elements like the assasination attempt to Hitler that they were aware that it was made by their own generals. I don't think that kind of stuff would be informed so easily since it was a clear fact of how divided was the opinions of the high ranking staff of the Third Reich.I am not saying that the diary is not authentic as some dumb people commented that the Holocaust didn't happen.The Holocaust happened.It was real and we never forget that to avoid that it would happen again. I am just commenting that surprised me how well they were informed about key sensitive info of war events taking in account that they were a bunch of people living hidden for like 3 years in an isolated annex of a building. I know, they got visits by the people that helped them but even so. I am not questioning its authenticity, just expressing my surprise when I read it. There were other things here and there that I was surprised by the use of terms like \"diet: low fat\", geez! I didn't know that in the 1940's they used terms like that in the 1980's were like the rush of \"healthy food\", but again, I supposed it's the effect that stuff that we think are new, they are just recycled and labeled as \"new\".I am amazed that this book is banned in some schools, okay, there are comments relating to sex and sexual preferences, but so what? If a teenage girl from the 1940's can think about stuff like that while she was isolated with a war outside, don't you think that teenagers of today can think just the same? I think that books like this one can help them to know that they are not alone, that they are not weird for thinking things like that, that was normal in the 1940s and it's normal now too.I was amazed that the group tried to \"live normal\", I mean, kids making school work and so. I think that in such extraordinary circumstances, they needed to do extraordinary things like to make circles and to talk in group and hearing all about topics. I mean, they were like trapped and living together, really too close in the sense of physical space and yet, nobody cares about what Anne thinks or what she has to offer? Geez! Sure, they need to be really still and in silence, usually at day, but they should like making a \"tribe\", I don't know, I am babbling, but to try to live like regular families was evidently wrong for the sanity of their interrelationships.What didn't surprised me were behaviors like trying to hide food or keeping money from the group. In times where the group work were essential to survive, the human selfishness risen as a second nature.Resumming, I just want to explain that my rating is based on my \"entertaining\" experience while reading the book and the format of the book itself.And this didn't have to do with my respect for the subject of the Holocaust and its terrible events."}, {"userName": "Hannah Greendale", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/43377498-hannah-greendale", "userReview": "Click here to watch a video review of this book on my channel, From Beginning to Bookend.\nOne cannot fathom what other marvelous books the world might have known had this talented, perceptive girl been permitted the life she was due. \"We don't want our belongings to be seized by the Germans, but we certainly don't want to fall into their clutches ourselves. So we shall disappear of our own accord and not wait until they come and fetch us.\"\"But, Daddy, when would it be?\" He spoke so seriously that I grew very anxious. \"Don't worry about it, we shall arrange everything. Make the most of your carefree young life while you can.\" That was all. Oh, may the fulfillment of these somber words remain far distant yet!Fifteen months later . . .The atmosphere is so oppressive, and sleepy and as heavy as lead. You don't hear a single bird singing outside, and a deadly close silence hangs everywhere, catching hold of me as if it will drag me down deep into an underworld."}, {"userName": "Whitney (First Impressions Reviews)", "userReviewDate": "Apr 05, 2009", "userURL": "http://www.goodreads.com/user/show/2189910-whitney-first-impressions-reviews", "userReview": "For her 13th birthday Anne Frank received a diary she dubbed Kitty. Shortly after her birthday with the fear that her older sister, Margo may be taken by the Nazis the Franks disappear into the night and go into hiding. It is through Kitty that Anne records her thoughts and daily life living behind a bookcase in the secret annex.When I was younger I went through a \"holocaust\" phase before moving on to Harriet Tubman and slavery. The funny thing is that Anne Frank's Diary was not the first Holocaust book I read, I think that was The Devil's Advocate. Anyway,I soon became fascinated by the Secret Annex and the secluded life she lived for two years. Unfortunately she and the other occupants of the Annex were betrayed and sent to concentration camps with only her father Otto Frank surviving. The tragic thing (not to minimize the inhumanity of it all) is that Anne died mere weeks before liberation. Anne's dream was to have her diary published after the war and after liberation her father saw that happen, making Kitty a time capsule to an unfathomable past. View all my reviews on my blog She is too fond of books"}, {"userName": "Duane", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "It happened. That thing, the reason I have put off reading this, happened. My heart broke. And I knew it would. Sure, I had heard of Anne Frank, I knew who she was, what she did, what happened. She is a historic figure, and a tragic one certainly. But I didn't make the really personal connection until I read her words, this diary. Her words bring her to life again. What a precocious young girl, so smart, so full of life; a life with so much promise, so much hope. She thinks, even writes, very much like a young girl would today. I think that's why so many young people feel a connection with her still. It's not a great work of literature. It can be tedious at times, even repetitive. But it's an important contribution to history. It tells a story that needs to be told again and again, not forgotten. Yes, Anne's words do give her life, and they will break your heart. But more importantly they resonate across time and around the world, and I expect they always will."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Het Achterhuis: Dagboekbrieven 12 juni 1942 - 1 augustus 1944 = The Diary of a Young Girl, Anne Frank The Diary of a Young Girl, also known as The Diary of Anne Frank, is a book of the writings from the Dutch language diary kept by Anne Frank while she was in hiding for two years with her family during the Nazi occupation of the Netherlands. The family was apprehended in 1944, and Anne Frank died of typhus in the Bergen-Belsen concentration camp in 1945. The diary was retrieved by Miep Gies, who gave it to Anne's father, Otto Frank, the family's only known survivor, just after the war was over. The diary has since been published in more than 60 languages.تاریخ نخستین خوانش: روز دوازدهم ماه اکتبر سال 2001 میلادیعنوان: آن فرانک - خاطرات یک دختر جوان؛ نویسنده: آن فرانک؛ مترجم: رویا طلوع؛ در 327 ص؛ ای.بوکخاطرات «آن فرانک» یادداشتهای روزانه ی یک دختر نوجوان یهودی ست که در تابستان سال 1942 میلادی در بحبوحه ی جنگ جهانگیر دوم، در وحشت از نازی‌ها، مجبور شد همراه با اعضای خانواده‌ اش، در شهر آمستردام به زندگی مخفی روی آورد. به مدت دو سال «آن» و پدر و خواهرش، با چهار یهودی دیگر، در آن مخفیگاه به سر بردند. «آن» خاطراتش را در دفترچه‌ ای یادداشت می‌کرد. سرانجام نازی‌ها همه‌ ی آن‌ها را دستگیر، و روانه ی اردوگاه‌ های مرگ کردند. از آن هشت نفر، تنها پدر «آن فرانک»، جان سالم به در برد، و در پایان جنگ، خاطرات دخترش را منتشر کرد. ا. شربیانی"}, {"userName": "Charlotte May", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/14002983-charlotte-may", "userReview": "There really isn’t anything I can add that many other reviews haven’t already done. It’s a five star read because it is important, because it is real and because the holocaust is something we should never forget."}, {"userName": "Jason Koivu", "userReviewDate": "Nov 22, 2008", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "Ya gotta hand it to this teen girl who was writing about her life with such clarity and eloquence when her life was hanging by a thread.I've read reviews of The Diary of a Young Girl that complained about how Frank ignored the bigger picture of the war and that her subject matter was trite, whiny and insular. What else could it be, this diary of a teen secreted away in the compact environs of an attic with the same people for years learning little-to-no outside information?From the standpoint of a detached, pure read, the fact that the diary includes a love interest is a blessing. But even without it, it's a wonderful and at times intense read. There were numerous times when the family was nearly caught during which my heart would race uncontrollably and my breath would catch. Knowing what happens to all of them after the diary ends packs the kind of punch you get in fiction...only it's not."}, {"userName": "Monica Edinger", "userReviewDate": "Feb 17, 2008", "userURL": "http://www.goodreads.com/user/show/221952-monica-edinger", "userReview": "I'm the daughter of German Jews. My mother's family came from Berlin and my father's from Frankfurt. Yes, the same Frankfurt as the Franks. They were a very old German family --- there is still an Edinger Institut at the University begun by my great grandfather, and Edinger Strasse, and other vestiges of my family's existence there. Moreover I still have relatives in Germany, those who came from lines where people had converted. Anyway, my father (whose father did not leave Germany and was eventually deported and killed) became an academic specialist in German politics and I spent several years of my childhood in Germany. One year was 7th grade. Before we left my father's mother gave me Anne Frank's diary and a diary. Later, upon visiting the Anne Frank House in Amsterdam and seeing her original diary, I realized that mine was just like hers. I mean, just like. Clearly my grandmother had given me one she had bought in Frankfurt and Anne's must have also been from Frankfurt, bought around the same time. They are identical other than a difference in coloringBut the diary was what woke me up to the Holocaust as well as to what it was to be a teenager. Anne's voice still echoes in my mind these many years later."}, {"userName": "Inge", "userReviewDate": "May 13, 2016", "userURL": "http://www.goodreads.com/user/show/6278820-inge", "userReview": "I thought I knew the story of Anne Frank.I knew the story of how she went into hiding with her family for a few years and wrote everything down in a journal. I knew of the fact that she was captured right at the end of the war, when hope was high and peace was nigh, only to die of typhus a mere few weeks before her concentration camp would be liberated. All of this, I knew, I’d been told many a time in history class.As it turns out, Anne’s story goes so much deeper than that; I’d only grazed the bare surface. Anne’s story is a revelation, and I was surprised by how much I could relate to her. Anne was and sounded very young at the beginning of her diary, but over time she grows so intelligent and self-evaluating and she was so very wise way beyond her years at the mere age of fifteen. I marvelled at how snarky she was; I loved that she wanted to be a writer as well; I related far too strongly with her at times.\n\"This week I've been reading a lot and doing little work. That's the way things ought to be.\"\nI have agoraphobia, and when I was at my worst, I could barely leave the house for two minutes. On top of that, I was living in this tiny dorm in Antwerp, and oftentimes I thought I would go mad; felt like I could run up the walls. So I recognised a lot of myself in Anne’s anxiety and depression at being cooped up like a bird in a cage. I could feel her fear seeping through the pages, could feel the monotony addling her brain, found my own thoughts echoed in her words. I definitely needed to take breaks while reading, because sometimes it became far too real.\n\"Ordinary people don't know how much books can mean to someone who's cooped up.\"\nAt one point in the book, Anne wishes to live on, even beyond her death. How she would laugh if only she knew that her diary had been read by so many people, that the Achterhuis/Secret Annexe in Amsterdam gets a million visits a year, that she’s practically the most famous child of the twentieth century.I am so incredibly moved that words can hardly express what I’m feeling. It’s a deep and powerful feeling, an emotional one, and I think that Anne will remain with me for a long time to come."}, {"userName": "James", "userReviewDate": "Sep 05, 2016", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "Book Review\n\n4 out of 5 stars to The Diary of a Young Girl, written during the 1940s by Anne Frank. Many are first exposed to this modern-day classic during their middle or high school years, as a way to read a different type of literature from that of an ordinary novel. In this diary, young Anne express her thoughts (both positive and negative) over a two-year period during which her family and friends are in hiding during World War II and the Holocaust. For most of us, this is one of the few ways we can actually read or hear the words from someone who was actually there and went through this, especially if you don't know anyone who was alive during this time period in the 1930s and 1940s in Germany and the surrounding areas. I read this in my 9th grade English course, and I remember disliking it a lot. Not because of the way it was written or published, but due to the topic. I dislike anything about that time in history. But I later re-read it and had a different level of appreciation for the value a book of this type can bring. Unlike The Book Thief, it's raw and natural in its words. But where I love The Book Thief because of its story, I found this one a bit harder to digest. It's not this extraordinary novel by any means, at least to me, but given how it came about, what happened to her and the way she expresses everything, it is definitely a great book. Everyone should read some passages from it at some point in their life.\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by."}, {"userName": "Whitney Atkinson", "userReviewDate": "May 13, 2013", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "I really wish I had a different translation of this book because this one lacks a lot of the personality and ease compared to the audiobook version I partially listened to. But this book should definitely be one of the books you read before you die because it is so tragic and enlightening. Nothing makes me angrier and sadder than seeing someone with so much potential and excitement rave about their passion for life, and in the end, never made it to accomplish their dreams, or see their work published. (this is also why This Star Won't Go Out made me sob.) Anne surprised me with how real and relatable she is, and she really seems to grow into her writing style and throughout the book you can note a change in her maturity and the way she describes and reflects on things. Had this book been easier to get through it would have been 5 stars, but some parts just dragged for me."}, {"userName": "David", "userReviewDate": "Jun 30, 2008", "userURL": "http://www.goodreads.com/user/show/1287856-david", "userReview": "While her story is sad, the naked Emperor cult around this book is unmerited.The key quotation about people being basically good at heart is absurd in the light of the story, and from a theological perspective, just plain wrong."}, {"userName": "Pollopicu", "userReviewDate": "Nov 25, 2009", "userURL": "http://www.goodreads.com/user/show/2345961-pollopicu", "userReview": "I'm really surprised by the number of people who thought this book was boring. I could understand how an adult man might find the musings of a young girl rather dull, but how can people in general not find this journal utterly fascinating? Here is a teenage girl who up until the end wrote with the same emotional consistency as when she began. Whoever thinks this books is boring is because they simply fail to realize, or even imagine the conditions in which this diary was written under. To think how this young girls personal life continued beyond the details of the war is rather remarkable. What would anyone else have written about in their diary as young boy or girl in the same predicament as the Franks? Anne is surprisingly strong and mature for her age, impressively intelligent, and although there was a World War going on, her own particular world never abated. Her personal life was just as important, if not necessary in order for her to survive the day to day living conditions at the Annex.Yes, there were brief moments of panic, but she had to live life, even if her living space was limited. She carried on as if being in hiding was a mere temporary inconvenience. She wasn't going to let that rob of her of her right to claim her passage into womanhood..her God given right to experience puberty, moodiness, emotions, and even love. Here I thought I was about to read the semi-interesting scribbles of a blooming young lady, with ambiguous references to the war. But there is nothing cryptic about her diary. She shoots straight from the hip in this incredibly and shockingly honest account of what life was like for her and her family living in hiding during the WW. It's not what I expected at all. I expected something rather tame, but it's far from it. This young girl was very interesting and quite special. You can't read this journal and think it's just an ordinary diary of a young girl, because it's not. Anne's diary is a representation of how other Jewish families lived and coped during the Nazi war. That's a pretty powerful thing. Many people don't realize how fortunate we are (thanks to Anne Frank, her Father Otto Frank and Miep Gies) to have some insight on how it must have been for the Jews to coexist this way. Because of Anne, we have an idea of how it was like to live under floorboards, in between walls, and behind bookshelves. This diary humanizes and brings back to life the Jewish people who mysteriously disappeared but who had not yet died. I love this diary and I'm so grateful to have read it.It must have been extremely difficult for her father Otto Frank to read his daughters diary after her death."}, {"userName": "Antonio", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/21081005-antonio", "userReview": "Hice lo impensable, una atrocidad, una perversión, yo, un hombre en sus veintes, he leído el diario privado de una niña de 13 años, sin su permiso espero la sociedad encuentre la forma de perdonarme, y no tener que enfrentarme a una turba enardecida. El diario de Ana Frank es uno de los libros más leídos alrededor del mundo, uno de los que posee más fama, siempre se escucha mencionarlo cuando se habla de clásicos, o cuando se habla de la segunda guerra mundial, sin embargo, a mi parecer es más lo que se habla de él, que lo que hay en su interior, o dicho de otra forma mis expectativas, como suele sucederme, eran mucho mas altas para esta historia.La historia es sumamente monótona, son ocho personas encerradas, ocultas, debido a su religión judía y a todo el conflicto Nazi. Ana nos ira relatando su vida en lo que ella llama “la casa de atrás” la relación que tiene con cada uno de los integrantes de la casa, las discusiones repetitivas, los temores de ser encontrados, lo agradecidos que están por tener gente que los ayude en estos momentos, los libros que lee, y la esperanza del futuro sin guerra, así una y otra vez, una y otra vez, una y otra vez, solo se percibe el cambio de que, poco a poco Ana va madurando. Nunca sabré hasta qué punto su diario fue modificado por las editoriales o incluso por el padre de Ana, aun así, definitivamente Ana fue una persona con pensamientos muy profundos para su edad, muy autocritica, a veces realista, a veces optimista, y claro con momentos de suma inocencia, se nota que es una persona real quien nos está relatando todo lo que acontece; ahora ¿debería ser leído? ¿Debería ser tan trascendental? A mi parecer… No, o por lo menos, no le encuentro sentido a que sea de lectura obligatoria en varios países, creo que hay historias más impresionantes y crudas de la guerra. Creo que solo lo recomendaría, y espero no sonar machista (oh ahora si me van a matar) a chicas en edades escolares (mmm quizás por eso sea de lectura obligatoria en algunos países) porque como literatura juvenil de tiempos de guerra no está mal, y digo chicas porque pueden conectar más con Ana. ¡Ahora a huir de la turba enardecida!"}, {"userName": "Reader", "userReviewDate": "Jan 19, 2009", "userURL": "http://www.goodreads.com/user/show/1928892-reader", "userReview": "If only every teenager would read and embrace this story, I wonder if it would change the instant-gratification, me-me-me society that has evolved over the last 50 years? Of course, this novel is a staple in any Holocaust lesson planning. In a world in which so few teenagers (or adults, for that matter) seem to stop and give thanks for what they have (instead chirping about what they want or complaining about what they don't have), Anne Frank faced the most unfair of cruelties with a certain strength and grace that crushes nearly any \"problem\" kids or adults face. Many Holocaust books or movies make you think, \"Why?! Why did this happen?!\" This story makes me think, \"How? How did Anne Frank find the strength to keep her head and record her thoughts during such an unbelievably difficult time?\" In a world desperate for heroes and tired (though indelibly enamored by) spoiled athletes, stories like this are once-in-a-lifetime. Hats off to Anne Frank. She had dreams of becoming famous and, although it was for reasons she never would have imagined, at least that part of her dream became true. I appreciate how this story makes my students of all learning levels and backgrounds rethink what they thought they knew about sacrifices and challenges, and even gets some students thinking about how they can use their lives to make a positive difference for others."}, {"userName": "Alex", "userReviewDate": "Dec 03, 2012", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "The problem with Diary of a Young Girl is that it's the diary of a young girl, and young girls, as you may remember from when you were one, or spent all your time trying to make out with one, are awful. It's like 300 pages straight of \"No one understands me!\" I guess the reason this made it on to so many high school curricula is that young people might relate to it, and clearly some of them do, because they wrote pissed-off comments below this review - but this doesn't depict the horrors of the Holocaust. Night does that. This depicts the boredom of being locked in an attic for two years. And Frank is very bright, but not bright enough to make great reading out of a young girl's diary.Thumbs up for the hot girl on girl action (which you may have missed if you didn't read the unexpurgated version - I'm not kidding about this, Anne Frank totally made out with a chick), but in the pantheon of literature about being locked in an attic, Flowers in the Attic is still the gold standard."}, {"userName": "Nandakishore Varma", "userReviewDate": "Oct 05, 2011", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "Actually I wasn't going to review this book at all, since I read it way back in the seventies, and if I remember correctly, did not finish it.But yesterday, just for the heck of it, I went through some one-star reviews. Two things I noticed immediately - most people disliked the book because it was boring, and Anne had a sanctimonious attitude. They were of the opinion that the book became a classic only because of historical reasons. Looking at it dispassionately, I have to agree.I was even more interested in the negative comments on those reviews. Most people were angry at the reviewer because they had the temerity to criticise Anne, A HOLOCAUST VICTIM, for God's sake! Whatever be the quality of her writing, the consensus was that the author was a saint and therefore above any kind of criticism. This viewpoint seems to me rather silly - anything published for general consumption is open to both positive and negative reviews.The second most common comment was that this was the diary of a teenaged girl, and never meant to be read for its literary merits - and I do agree with this. Those who criticise based on the quality of the writing is missing the mark, I feel. As with any diary, its primary merit is as a first-hand account of an important period in history.I read it when I was roughly Anne's age. I could visualise for myself the claustrophobic nature of their apartment, and I wondered at a regime which forced a certain section of its citizens to hide themselves in fear of death. This was my first serious exposure to Holocaust literature: and it built in me a passion for history and a lifelong antagonism to fascism of any kind.This was an important book in my life."}, {"userName": "Alex Farrand", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/37663070-alex-farrand", "userReview": "This review will have spoilers. I think majority of the populous knows what happened to Anne Frank and her family, but if you do not please skip my review. I had this book for years. I actually have two copies, but I never read either one of them, and I had them since middle school. It wasn't required in any of my classes. I am starting to think my middle, and high school had major problems. We barely read any classics. It sounds really sad. In Michigan we have a Holocaust museum, called the Holocaust Memorial Center. I remember how much that place affected me when we had a field trip, so I know reading Anne's diary would do the same. I just didn't know how bad.Anne Frank is a young Jewish girl living in Holland, during WW2. Her diary is written during the time her and her family went into hiding in the \"Secret Annex\" for 2 years. Her diary is not only about the War, but her growing up in the most unideal situation. Her two year story is a different side of a terrible situation. She may have been luckier than most, but still her words are incredible, intelligent, and wholesome. The diary included her deepest thoughts, her worries, and the hardships of the annex. I knew the end from the beginning. I knew it was going to be sad, and I would want to flip tables. My heart, and my shoulders felt so heavy by the end. Anne had her whole life in front of her, and it was cut short. She could of done anything her heart desired. Every entry closer to the end, I would hope that it would end that she left the annex at the end of the war, but sadly it was ended abruptly. Every time she mentioned any bright side of the day, my heart ached knowing. I just wanted to stop the situation. Why cannot I time travel?! I would of jump into that time period, and tuck this family away. Maybe I should have closed the diary, and allowed her to live forever, but her story needed to be told. She, nay the whole Jewish community were innocent victims. Her family, and friends shouldn't of went into hiding. No one should of died. It is revolting, and her words need to live forever, so that this would never happen again. The most amazing thing about reading her diary was the transformation of a young girl to a young woman. She started thinking about bigger ideas, and concepts during those two years. It was magnificent to see. In the beginning, I felt like she didn't really understand what was happening to her community. She understood it was bad, but her young mind couldn't fully comprehend the madness behind it. After the first year something changed in young Anne, and she finally faced the reality of the situation. She kept her hopes up for the most part, but she knew the truth of situation. It was just astonishing to witness how much one can change in a short period of time. This made me even sadder about her fate. The one thing I can say I am happy about is that Anne got her wish. \"I want to go on living even after my death.\" Her diary will live forever. Anne Frank will always be in my thoughts. I will insist my daughter to read her story. Anne is apart of history, along with the millions of Jews, Polish, and any one else who was in the terrible War. All their stories should be heard. I recommend everyone to read this just once. Happy reading. Read my blog here: www.dancingbetweenthecovers.com"}, {"userName": "Mia (Parentheses Enthusiast)", "userReviewDate": "Jan 27, 2016", "userURL": "http://www.goodreads.com/user/show/23106940-mia-parentheses-enthusiast", "userReview": "I am basically a terrible person.This isn't a review- I'm not going to go into my reasons for giving this book 2 stars. That would not do anybody any good. I will simply say that I feel extremely guilty rating the book this low, but I hope people understand that it doesn't reflect my view of the Holocaust as a whole, or my views of Anne Frank as a person. I have the utmost respect for both.The girlfriend of my great-grandfather* lost her mother and her daughter in the Holocaust. Her daughter had a hairpin, a beautiful golden thing with topaz and pearls, and it was passed down to me. I never got to meet my great-grandfather nor Fanny (his girlfriend), but she put the pin in a box and gave it to my mother with these words written on it. (I was still a baby, and neither of them would live past my second birthday.) That pin is a lot like this book. Whenever I look at it, nestled in my jewellery box, I feel the weight of generations of guilt pressing down on me. Its owner is long gone, and yet I feel the strangest thing- simultaneously connected and disconnected. I am in possession of something that unnamed girl loved, just as reading Anne's diary, and there's an eerie sense of abandonment in the object being left behind but their owners having perished long before their time.Granted, I'm Jewish, but I can't help but feel that simply by being alive and knowing of the Holocaust and of genocides in general, I am doing them a disservice. In the wake of tragedies like this, there is nothing to say, there are no words, so I'm not going to waste this review talking about the merits and downfalls of this book. It is not mine to critique- this is the diary of a real girl who really did live, and so pointing out its flaws is a vain pursuit, in that it is so inextricable from its owner, just like that topaz hairpin.There is a time and a place for criticising memoirs without criticising their authors, but now is not the time nor the place. Suffice it to say that I feel like an awful person for rating this so low, but I will not budge on it. One of my core principles is that I judge books in and of themselves, and how they stand on their own- it is impossible to do so here, with the text so linked to the history.I don't know what to do with The Diary of Anne Frank or that hairpin. They remind me to never forget the tragedy, but how could I anyway? I don't own them, and I never can- they're relics, relics that do not and cannot ever belong to anybody but their original owners, and so I suppose I'll always feel like I'm keeping watch over the prized possessions of two girls who are never coming back to retrieve them.*He was a baker who became an army dentist when the bakers' union went on strike in the Great Depression. Quite an interesting fellow."}, {"userName": "Chris Horsefield", "userReviewDate": "Jul 26, 2016", "userURL": "http://www.goodreads.com/user/show/14058695-chris-horsefield", "userReview": "This book was fascinating. I was a little surprised that there wasn't more about the atrocities that were happening around them instead of all the turmoil in the household. However, I realize that she was just a very young girl. And, I was surprised about how sexually aware she was. Until she and her family went into hiding, she hadn't had a lot of worldly awareness so she wrote about what was happening around her, and that was everything that went on in that household with those people. It would be hard to imagine how I or any other person would react under the same circumstances. I tried to imagine what it would be like to have to be totally quiet...not to be able to even move around at all for several hours or not be able to use the bathroom when you needed to. I thought what would happen if you had a cold, and were coughing. How could you control it? After she would write about her feelings when certain things were going on inside, she would put a small notation about what was happening in the world outside. They would get news from the outside from those who were hiding them. Another thing that surprised me was the gifts they would give each other on their birthdays. I would have thought that those things would have been rationed and not be available. I guess if you had the money, and apparently they had quite a lot, the regular Germans could still buy \"things\". Everything I have previously read about that time period indicated that even the \"non-Jewish\" German people had very little. She talks about being able to make jam from strawberries that were delivered to the warehouse. That would take lots of sugar. Apparently, the factory that they lived above was the factory that her father was a partner in, and they made pectin there. So maybe, the delivery of sugar wasn't suspicious. Or maybe that was what made them vulnerable. However, someone had to have turned them in or they would never have found them behind the bookcase in the annex.I felt sad that her relationship with her mother was so bad. I think, had she live, that relationship might have been repaired with time as it appeared to be mostly misunderstandings combined with her adolescence. Also, her relationship with her sister wasn't good either. Her relationship with the other family was understandable considering the close quarters they shared. It has occurred to me that the Jewish people are a very gentle kind of people therefore enabling them to live under those circumstances for two years. I think it would be almost impossible for most people to live like that. I can't understand why anyone would turn them in to the Gestapo knowing they would be going to their death. Most of their German Christian and Catholic friends were wonderful people who actually put their lives on the line to protect these two families. I have never heard who turned them in.They almost made it. Anne lives on just as she wished. I would highly recommend this book to anyone who is interested in reliving the past with Anne, her family, and friends."}, {"userName": "LENA TRAK", "userReviewDate": "Jan 28, 2016", "userURL": "http://www.goodreads.com/user/show/51989964-lena-trak", "userReview": "Anne Frank- The diary of a young girl! (SPOILERS)Amazing! This was one of the few times I felt so close to a book hero.. There's definitey a spot in my top-50 for this one!I always get sentimental when I read about all these sinister things Nazis did to inmates at concentration camps, but this was something completely different. There are no scenes describing the tortures those people suffered. In this book we a get a taste of the life of those who were the fortunate ones and they were clever enough to go into hiding and continue their lives, seemingly safe until the end of the war. Yet, page after page, entry after entry we become aware of the fear, the terror those people experienced even when they managed to evade the enemy. I could almost hear my hear pounding every time I read about the bangs and noises they heard thinking they had eventually been caught. I clenched my teeth whenever Anne described the nightmarish hours they spent silent in the dark listening to bombs destroying the last drops of hope they had left.So this book doesn't describe the Nazi atrocities. What you actually gain is a deep insight into a young girl's psyche through the pages of a poorly-written (albeit fascinating) diary, which was kept while Anne and her family remained hidden in a house for 2 years, in their effort to escape Nazis. After reading the first 20 entries the reader immediately begins to realize that Anne has an extraordinary personality. During her first year in the annex, we see her struggling with the adults, as she is constantly being criticized for her insolent behavior. She experiences extreme loneliness and a desperate need for love and affection. I was pleased to find that she remained remarkably forthright throughout the whole narrative. As her story unfolds we see a child growing, gradually becoming a woman, which was another pleasant surprise. Towards the end of the book her entries become more lucid, more introspective and full of self-criticism which shows that Anne has changed, she is more mature and far more self-aware. Unfortunately, this is where you begin to realize the end is close. Addressing fellow readers: I understand and agree with most of your comments. Yes, Anne was too young, too frivolous, her writing was deeply flawed, but please remember that this is a child we are talking about. A child who spent the most fruitful stage of her life confined to the walls of a house in order to survive. A child who had to relinquish her dreams of freedom, of feeling the sun on her skin, of completing her studies, of becoming a journalist...in order to stay ALIVE. This was not a novel written for recreational reasons. It was a person's diary...Their private thoughts. Enjoy it because sadly we were not given the chance to read any more of her stories. I just wish she had been given the chances we are given. She would have become an excellent writer. Her optimism taught me a life lesson and I think this is the main reason why this book will stay forever in my heart. An excellent read!"}, {"userName": "HRH", "userReviewDate": "Sep 03, 2007", "userURL": "http://www.goodreads.com/user/show/202682-hrh", "userReview": "I first read this book in the eighth grade. Our junior high school simultaneously did a preformance of the play. I remember that I enjoyed both the book and the play. I think I liked the love story aspect most of all -- what 13 year-old wouldn't? But I don't think I really \"got\" the book.For her 13th birthday the German-born Anne Frank received a diary which she named Kitty. About a month after her birthday, her older sister, Margot, at the time just 16 years old, was \"called up.\" For some time Otto Frank, Anne's father, had been preparing a hiding place for his family in a part of his business warehouse. With Margot's letter, the family left within 24 hours, strewing everything about and leaving a note with an address in Maastrich (hometown of musician Andre Reiu) to throw off officials. The family -- Anne's parents and her sister -- shared the secret hiding place with family friends and business partners, the Van Daan's, as Anne calls them though their real name was Van Pels, and the couple's 16 year-old son Peter. A couple months later a dentist, Mr. Dussel (really Pfeffer), joined the group and actually shared a room with Anne. Anne writes of the 25 months in hiding before being discovered in August 1944. Anne Frank died of typhus at Bergen-Belsen in early 1945, just months before the camp's liberation. Anne is an incredible writer. She uses conversation to describe anecdotes, involving body positions, voice tone, etc. just like a novel. She is also intensely thoughtful. She had insight and wisdom beyond her years. Check out this excerpt written only three weeks before the families were betrayed. \"It’s a wonder I haven’t abandoned all my ideals, they seem so absurd and impractical. Yet I cling to them because I still believe, in spite of everything, that people are truly good at heart. It’s utterly impossible for me to build my life on a foundation of chaos, suffering and death. I see the world being slowly transformed into a wilderness, I hear the approaching thunder that, one day, will destroy us too, I feel the suffering of millions. And yet, when I look up at the sky, I somehow feel that everything will change for the better, that this cruelty too shall end, that peace and tranquility will return once more\" - July 15, 1944I think she may have gone to her diary most often when she was depressed (there are several very mournful entries) and a few times when she was overjoyed (as in when she got her first kiss). She flutuates often between opinions -- I hate my mother, I love my mother and I am hopeful, I am hopeless. I can relate to her changeability. She tells hilarious stories describing the events and worries of the secret annex -- especially entertaining is Mrs. Van Daan. Anne's attention to detail is so helpful in understanding the position of those in hiding. It makes me want to do better in keeping my own personal history. Each character is described so well and maintains his or her character, in a way type-cast in specific way. It would be interesting to hear how those 25 months passed from everyone else's perspective.This book is so well written it is crazy and it is simultaneously entertaining and wise."}, {"userName": "Jodi Lu", "userReviewDate": "Aug 18, 2007", "userURL": "http://www.goodreads.com/user/show/289695-jodi-lu", "userReview": "come ON, how can anyone give ANNE FRANK a rating other than \"it was amazing\"??? some of these reviews cracked me up. it's certainly not my favorite book, but i definitely won't say it's a pity vote either. although i'll say this: i was recently at her house and was SHOCKED that it's HUGE. i mean, the diary makes it sound like they're living in a matchbox when even the hideaway part is two stories and far bigger than anywhere i've ever lived--FRANKly (HA!) i don't know how it took anyone that long after the house was seized to realize that some floors were missing when you entered it... stupid nazis... once my good friend told my other good friend's young girlfriend that she looked astonishingly like anne frank. the girl freaked out and made a huge, public scene about how horrifying that was but everyone saw it, the resemblance i mean, a little bit anyway. but on the topic of seizure, the girl was shortly afterwards committed for attempted suicide. which wasn't a surprise and i'm fairly certain was wholly unrelated to the comment. much like the qualitative relationship of half of my reviews to their books...sorry."}, {"userName": "Carlos", "userReviewDate": "May 21, 2015", "userURL": "http://www.goodreads.com/user/show/43073965-carlos", "userReview": "En mi humilde opinión, es un poco extraño calificar este libro como literatura. Mientras lo leía, era como leer un diario, nada más. Lo que vivió ella fue terrible, a pesar de que siempre dentro de todo lo malo -la guerra- siempre hubo una pequeña luz de alegría en su vida -Peter-. Lo peor de todo, es que estoy casi convencido que lo que escribió Ana fue algo común en muchas niñas y niños, adultos y adultas de la época, aunque suene frío, este es sólo un caso más de los muchos que hubo.La historia conmueve, por cierto, y es muy fácil entrar en el mundo de Ana mirado desde su perspectiva infantil/pre-adolescente. Era una niña muy inteligente, estaba al tanto de todo lo que pasaba con respecto a la guerra a pesar de su edad, y también se daba cuenta de las conversaciones de adultos que se llevaban a cabo en \"El Anexo\".Respecto a la veracidad de éste, hay unos que dicen que es un invento, yo no lo creo así, y si así fuera, quizás inventaron que una tal Ana Frank escribió un diario, pero de seguro esta misma historia le pasó a más de alguno.Hay un museo de Ana Frank en Amsterdam el cual tuve la oportunidad de visitar, así que creo y quiero creer que este diario efectivamente existió, quizás sólo le cambiaron unas que otras oraciones.¿Vale la pena leerlo? Absolutamente, es un libro/diario muy fácil de entender y seguir. Libro \"liviano\"."}, {"userName": "Madeline", "userReviewDate": "Dec 07, 2007", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "The thing that amazes me the most about this book is what an amazingly talented writer Anne was. Seriously, she started her diary when she was thirteen, and her writing is better than some famous modern authors I could name. *coughStephanie Meyercough* Anne was already writing like a sensitive, intelligent adult by the time she was fifteen. If she had lived, and continued writing, there is no doubt in my mind that she would now be considered one of the best authors of her time."}], "description": "For almost fifty years, Anne Frank's diary has moved millions with its testament to the human spirit's indestructibility, but readers have never seen the full text of this beloved book--until now. This new translation, performed by Winona Ryder, restores nearly one third of Anne's entries excised by her father in previous editions, revealing her burgeoning sexuality, her stormy relationship with her mother, and more.", "title": "The Diary of a Young Girl", "url": "https://www.goodreads.com/book/show/1813878.The_Diary_of_a_Young_Girl", "average": 4.11, "cover": "https://images.gr-assets.com/books/1320474559l/1813878.jpg", "reviews": 22791, "authors": [{"url": "https://www.goodreads.com/author/show/3720.Anne_Frank", "name": "Anne Frank"}, {"url": "https://www.goodreads.com/author/show/254700.Otto_Frank", "name": "Otto Frank"}, {"url": "https://www.goodreads.com/author/show/181311.Mirjam_Pressler", "name": "Mirjam Pressler"}, {"url": "https://www.goodreads.com/author/show/432799.Susan_Massotty", "name": "Susan Massotty"}], "type": ["Nonfiction", "Classics", "History", "Biography", "Autobiography"], "outlinks": ["http://www.goodreads.com/book/show/1813878.The_Diary_of_a_Young_Girl", "http://www.goodreads.com/book/show/48855.The_Diary_of_a_Young_Girl", "http://www.goodreads.com/book/show/831776.The_Diary_of_a_Young_Girl", "http://www.goodreads.com/book/show/18282846", "http://www.goodreads.com/book/show/9266856-the-diary-of-a-young-girl", "http://www.goodreads.com/book/show/500095.The_Diary_of_a_Young_Girl", "http://www.goodreads.com/book/show/8723588-diario", "http://www.goodreads.com/book/show/5507.The_Diary_of_Anne_Frank", "http://www.goodreads.com/book/show/531879.Anne_Frank", "http://www.goodreads.com/book/show/17285359-diario-de-ana-frank", "http://www.goodreads.com/book/show/58728.Anne_Frank_s_Tales_from_the_Secret_Annex", "http://www.goodreads.com/book/show/795699.The_Works_of_Anne_Frank", "http://www.goodreads.com/book/show/15805778-de-dagboeken-van-anne-frank", "http://www.goodreads.com/book/show/5511.The_Diary_of_Anne_Frank", "http://www.goodreads.com/book/show/563829.The_Secret_Annexe"]}