{"ratings": 1872, "userreviews": [{"userName": "Paromjit", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "This is the tenth in the series featuring Dr Ruth Galloway, the forensic archaeologist set in Norfolk. Ruth has been experiencing an emotionally stressful time when her hopes of cementing a relationship with DI Harry Nelson are dashed with his wife, Michelle, becoming pregnant. It is the summer holidays, and Ruth is contacted by Professor Angelo Morelli asking her for her expertise in a excavated skeleton in Italy. Angelo is a famous TV archaeologist, and is an ex-lover of Ruth's from her past. This bolsters Ruth's ego which is badly in need of a boost, and with her best friend, Shona, Louis, and her daughter, Kate, sets off for a break in the sun, with Angelo providing them with accommodation in the beautiful Liri valley, at the fictional village of Castello di Angeli. Nelson is disturbed to hear that Mickey Webb, a man responsible for the death of his wife and two children in a fire, has been set free after seeing the light and becoming a committed a Christian, who married again whilst in prison. Webb uttered threats promising retribution when Nelson arrested and charged him, suspicious events have the police keeping an eye on him. This latest addition in the series focuses less on the two crime storylines in Norfolk and Italy, instead giving us a welcome insights into the returning and familiar characters and their relationships.Nelson is out of sorts when he finds out that Ruth and Kate have gone to Italy without informing him, although hearing about an earthquake has him boarding a flight with Cathbad in tow, to ascertain that Ruth and Kate are okay. Ruth is greeted by unwelcome graffiti on the apartment walls, and a wolf's skull left by the door. The local community has a strong history of the partisans and the resistance fighters fighting the Nazis. Ruth finds herself caught up in the media interest in Angelo's skeleton which appears to have been subject to a deviant burial, given the stone in the mouth. Nelson's departure has an insecure Michelle pondering on the quandry she finds herself with her uncertainty as to who is the father of her unborn child and contemplating getting involved with Tim who loves her unconditionally. Ruth once again comes across a murder, that of the old priest, Don Tomaso, who had wanted to share some information with her. Ruth finds herself in danger, that extends to her precious daughter, Kate, Shona and her son, Louis. Meanwhile, in Norfolk a scary scenario unfolds with deadly consequences that has a fearful Nelson wracked with guilt racing back to his lawful family in England.It is always a pleasure to catch up with this wonderful cast of characters that have wormed their way into my heart. I was particularly pleased to experience a little more time in the company of Cathbad, who has had a miniscule part in recent books. Ruth remains entangled and subject to her emotional need for Nelson, a married man who remains loyal to Michelle and his two daughters. He is ripped apart though by his feelings for Ruth and his daughter, Kate, fuelling ongoing trauma in his life, destined to continue for some time yet. I enjoyed the Italian location and the intrigue and the continuing passions that are inflamed by the past. All in all, this was a terrific read, highly entertaining and wonderful to once again be immersed with this great cast of characters that Griffiths continues to develop in a compelling manner. I can't wait for the next book! Many thanks to Quercus for an ARC."}, {"userName": "Diane S ☔", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "In the last several months I have read an inordinate amount of novels set in Italy. Was surprised to find in this book, which is set in England, that I would once again be traveling to Italy, in particular Castello degli Angeli. A town slowly dying, all it's young people moving to Rome for employment opportunities. It is also a town with a long memory, memories and tragedies from the second World War.Ruth is called to Italy when an old friend finds bones and needs a bone expert. Wanting to get away from home, due to the emotional turmoil caused by the ever changing situation with Nelson. She takes Kate, and Shonna and Louis travels with them. Things will develop in Italy, unexpected situations, but things will also happen back home.I enjoy this very character oriented series, the mix of characters, including a druid. It is interesting, I always learn something new pertaining to archeology and past civilizations. The personal developments and changing relationships are also enjoyable, though I admit to wanting to shake Nelson in more than one situation. For some reason, with this series, I feel as if I am actually a character in the story, rather than a reader watching from afar. ARC from Edelweiss."}, {"userName": "Linda", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "There are serious dangers in waking the spirits of the dead.Dr. Ruth Galloway, UK bone specialist in archaeology, seems to know this quite often and usually up front and personal. Ruth has been contacted by an old colleague, Angelo Morelli, to examine some unusual bones found in an excavation site in the Liri Valley in Italy. Dead men usually tell no tales, but this one speaks volumes from the confines of his grave. Buried face down is demeaning at best, but this poor soul has also had a stone lodged in his mouth where his tongue should have been.....the silence of an ancient statement.The August Italian sun beckons for one last holiday before Ruth's daughter, Kate, returns to school. Wishing for company on this trek, Ruth invites her friend, Shona, and her son, Louis, to join them. What appears to be a routine dig turns into far more than what Ruth bargained for. The historical vibes of the village have been laced with the impact of Fascists, Nazis, and resistance fighters during World War II. It is evident in the older generations who speak of an occupied Italy where the deep footprint is still embedded there.The lulling breezes of the Italian countryside will soon reverse and take on a mighty windstorm. Ruth comes upon the body of the local elderly priest in the darkness of the village church. Who would ever harm this gentle soul and, more importantly, why?Elly Griffiths creates quite the multi-leveled scenario here with lightning strikes both in Italy and in the UK simultaneously. Be assured. I have only read a few of her books and I was still able to follow the backstories going on in the lives of these characters. And there's quite a bit of eyebrow-raising with sparking relationships and who is connecting with whom. That in itself will draw you into this storyline. Oh, the games people play.The Dark Angel emerges you into the pools of great storytelling from the onset. Just as things begin to sort out towards the end, Griffiths throws in a totally unexpected event that will play havoc in the future of many of these characters. Have mercy! She can't write fast enough for the next one to get here while we anxiously tread water. Yowzers!I received a copy of The Dark Angel through NetGalley for an honest review. My thanks to Houghton Mifflin Harcourt (Quercus) for the opportunity."}, {"userName": "Sandy *The world could end while I was reading and I would never notice*", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/30817744-sandy-the-world-could-end-while-i-was-reading-and-i-would-never-notice", "userReview": "EXCERPT: Giving your son to God sounds sinister somehow. Ruth once found the body of an Iron Age girl who had been tied down and left on the marshes to die, an offering to some faceless, nameless diety. She thinks of Isaac carrying the wood on which he is going to be sacrificed by his father, a story which pops up quite often in her parent's church, where it seems to be held up as an example of good parenting. THE BLURB: Dr Ruth Galloway is flattered when she receives a letter from Italian archaeologist Dr Angelo Morelli, asking for her help. He's discovered a group of bones in a tiny hilltop village but doesn't know what to make of them. It's years since Ruth has had a holiday, and even a working holiday to Italy is very welcome!So Ruth travels to Fontana Liri, accompanied by her daughter Kate and friend Shona. In the town she finds a medieval shrine and a dark secret involving the war years and the Resistance. To her amazement she also finds Harry Nelson, who is enduring a terrible holiday at a resort nearby. But there is no time to overcome their mutual shock - the ancient bones spark a modern murder, and Ruth must discover what secrets there are in Fontana Liri that someone would kill to protect.MY THOUGHTS: I completely understand why the Ruth Galloway series is, and I quote, 'My favourite current crime series' - Val McDermid.Elly Griffiths writes in a quietly sinister fashion that keeps me glued to the page. Her characters are delightful, but all too human, all capable of deceit, guilt, indecision and bad judgment. It was lovely to catch up again with Cathcart (known as Michael in his pre-druid life) and his very perceptive pronouncements. He is a very deep character, and one of my favorites. My favorite passage from the book is this- 'As he speaks, he turns to the tombstone, white and stark among the older graves, like a false tooth in a mouthful of decaying molars.' Wandering through graveyards is a pastime of mine. I make up stories about the inhabitants, and wonder about their lives. However, I doubt that I will be able to do so in the future without thinking of the 'decaying molars'.The setting for this book moves from Norfolk to the Liri Valley region in Italy, a rather beautiful and historic area. I soaked up the atmosphere, and swear I gained a kilo from all the delicious sounding pasta they ate. Although the village of Castello degli Angeli where Ruth is staying is completely fictional, other places they mentioned and visited are real, and I journeyed along with them, enjoying the sights if not the food, courtesy of Google Earth. The plot is not particularly fast-paced, but the book loses nothing because of this. In fact it is, in this instance, a redeeming quality. That is not to say that there is no action, because there is plenty. The Dark Angel by Elly Griffiths is an extremely satisfying read. I award it ☆☆☆☆1/2 simply exquisite stars.Thank you to Quercus Books via Netgalley for providing a digital copy of The Dark Angel by Elly Griffiths for review. All opinions expressed in this review are entirely my own personal opinions. Please refer to my Goodreads.com profile page or the 'about' page on sandysbookaday.wordpress.com for an explanation of my rating system. This review and others are also published on my blog sandysbookaday.wordpress.com https://sandysbookaday.wordpress.com/..."}, {"userName": "Malia", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/5953660-malia", "userReview": "I want to start by saying this in one of my favorite series and the characters dear to me, because they have always come across as very real. The mystery aspect of the plot in the Ruth Galloway books is not their strong point, but I don't really care, I read them for my love of the characters. As for The Dark Angel, I really enjoyed a solid two thirds of the book and really sped through, though I had intended to pace myself and make it last. But then something happened, and though I won't say anything to spoil it, this really upset and disappointed me, because I not only felt it was unnecessary, but also a bit of a cop-out. Anyone who has read this book will know what I am referring to and I would love to know what you think! All in all, I still really like Ruth and would be happy to know her in real life, but the way the book ended was so disappointing I just cannot give it the five stars I had felt sure I would initially. Even four feels a bit of a stretch, but I have my loyalties. When you wait a whole year for the next installment in a beloved series and the book really lets you down, it almost feels personal. I am sure you know what I mean. It's been a few days since I finished this book, but had I written this review immediately after I turned the final page, I do not doubt it would have been downgraded to three stars, which makes me quite sad:-/Find more reviews and bookish fun at http://www.princessandpen.com"}, {"userName": "Sandy", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/24770184-sandy", "userReview": "3.5 starsWhen I started reading this, I couldn’t help but think about how far these characters have come. There’s a personal story arc that has evolved at a snappy pace from the beginning & it shows no sign of slowing down here. As the book opens, we find Ruth in a bit of a funk. Nothing like going to a wedding to make you reflect on your life as a singe mom. Especially when the father of your daughter is there with his pregnant wife. So when the chance to check out old bones in Italy comes along, Ruth packs up Kate & runs away. Angelo Morelli is a charismatic Italian archeologist with a problem. Someone is messing with his dig site & his head. He need some publicity to bolster interest & funding so calls old friend Dr. Ruth Galloway. In short order Ruth arrives in the beautiful small town of Castello degli Angeli with Kate, best friend Shona & her son. But from the start, it’s clear not everyone is happy about her visit.There are several plot lines that emerge from the Italian side of the story. A mysterious immigrant named Samir, the local cleric anxious to talk to Ruth & a mystery from WWll involving Angelo’s grandfather. Back in King’s Lynn, Nelson gets news a convicted killer has been released. He’s responsible for putting the guy away & remembers his threat to get even. Probably not a good time to dash off to Italy.A large part of the book, much more than previous ones, is devoted to the entangled love lives of Ruth, Nelson, Michelle & Tim. At times, it felt like the author is getting ready to tie up some long standing story arcs in the next instalment & uses this book to clear her plate. The ending certainly takes care of one aspect…..lordie, I did NOT see that coming. The result (for me) was the plot lines dealing with mystery & archeology were underserved. I desperately wanted to know more about Angelo’s grandfather time in the resistance & learn Samir’s history as I found him an intriguing character. These are glossed over & the whole Italian side of the story kind of fizzles down to a neatly tied up resolution. There’s a lot more going on back in Norfolk but Ruth & Nelson are absent for all of it. We also spend significant time listening in on the inner thoughts of our 4 star-crossed lovers as each considers their situation. So…not my favourite in the series. I love Ruth. In many ways she is an every-woman whom you can relate to & I enjoy that the focus has always been on her strength & intelligence instead of her appearance. This is book #10 & I think the author in that tricky spot where she needs to fish or cut bait re: the long running love triangle (or square). So personally, I’m going to consider this one a small bump in the road & look forward to catching up with the gang in #11."}, {"userName": "Miss M", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/7892438-miss-m", "userReview": "More soap opera than crime solving this time around, but there's nothing wrong with that. Occasionally."}, {"userName": "Kristy", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/126296-kristy", "userReview": "Ruth is dealing with a lot on the personal front, including the fact that Nelson's wife, Michelle, is pregnant. Ruth and Nelson's daughter, Kate, is six now, and while Michelle knows about Kate, Nelson's older daughters do not. Nelson was very close to leaving Michelle for Ruth, before he found out his wife was pregnant again. So when Ruth is invited to Italy to assist a former friend, Angelo Morelli, in looking at some bones, she is actually a bit excited at the thought of a holiday/work trip. It will give her and Kate a chance to get away. They embark on the trip along with Ruth's friend Shona and her son, Louis. Once there, Ruth realizes how entrenched the people of the Italian village are in the past--including what happened during World War II. Further, Angelo is convinced someone is trying to kill him. Before she knows it, Ruth is immersed in a modern-day murder mystery: something she can't seem to avoid, no matter where she travels. It's no secret that I love Ruth and Elly Griffiths' series of novels featuring our intelligent, plucky heroine. Despite the fact that I know absolutely nothing about bones, I identify with her (e.g., stepping on a plane with Kate for the first time and feeling nervous flying with her daughter, whose safety \"overrides everything else\"). Ruth's wit, sarcasm, and sense of humor are always absolutely spot-on, and it's wonderful being back with her and her circle of pals, especially the grumpy yet protective Nelson. The Nelson/Ruth dynamic is its typically complicated yet oddly sweet self, and there's a surprising amount of progress or information regarding the characters' personal lives in this novel. As mentioned, these books are always just lovely and humorous. The narration style is impeccable and works flawlessly. Each character is so perfectly \"them,\" and I enjoyed that we heard from a lot of characters this time around, even Nelson's elder daughter. Oh, and yes, there's also a great mystery plot thrown in, involving an Italian town, some bones (of course), and a variety of deeply buried secrets. Griffiths introduced us to some new characters with the new locale, and I found the mystery to be interesting and engaging. It was front and center enough to keep us interested, but refreshing to get a little more movement on the characters' personal lives, too.Overall, another winner from Griffiths. As always, I cannot wait for the next Ruth novel (especially because there is some serious unresolved business by the end of this one!). I think of Ruth, Harry, Kate, and the entire cast as dear friends by now. You can read this as a stand-alone, but as always, I recommend reading the whole series, because it's just so darn good. 4.5 stars. A huge thanks to the publisher and Edelweiss for a copy of this novel in return for an unbiased review; it is available in the U.S. everywhere as of 05/15/2018. Blog ~ Twitter ~ Facebook ~ Google+ ~ Instagram"}, {"userName": "Steven", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/11855472-steven", "userReview": "Thanks to Netgalley and the publishers for providing me with an advanced copy in exchange for an honest review!Ruth, still reeling from the events of the end of the last book, is living day to day, trying to hang out. An old friend calls her up and invites her to help with some bones in Italy, so she packs up Kate, Shona, and Louis and heads to Italy... where of course, murder happens. Meanwhile, back in Norfolk, one of Nelson's cadre of historical arrests is released, and stuff happens at home as well.I enjoyed watching Ruth getting to explore the little Italian town, be on vacation, and get to meet some new characters. The relationships from prior books all develop a little more, and we get some depth added to at least one character who previously had very little page time. And while some of the events at the end were expected (because of well-written build up throughout the course of the novel), one big thing was completely unexpected, at least to me.Yet again, a Ruth Galloway novel that doesn't disappoint - it's like Elly Griffiths knows what she's doing! ;) Thank goodness she does. And thank goodness the publishers keep coming back for more. I know I'm ready for the next one!"}, {"userName": "Raven", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/5973984-raven", "userReview": "I will say from the outset that over the course of the Ruth Galloway books, I have had an up and down relationship with them, but feel almost a sense of guilt if I decide not to pick up the next in the series. The Dark Angel reaches the landmark of ten books, featuring the everywoman character of Galloway, who set apart by her sheer ordinariness, intelligence,  frequent crisis of confidence, and somewhat unbelievably tangled personal relationships, has accrued a significant following of readers in her wake.I will be honest, and say that this book didn’t really fill me with any sense of satisfaction. As the whole love triangle, now love square, rumbles on unabated, I felt that Griffiths focussing on the machinations of this neglected to provide any sort of interesting plot, despite despatching both Ruth and her on/off/on/off/on/off lover policeman Harry to the steamy surrounds of Italy. The central ‘mystery’ that Ruth finds herself embroiled was all a wee dull, and I didn’t really care who was being killed and for what reason. Also I think that Griffiths has slightly shot herself in the foot, by despatching a character one book too early, as the continuing existence of this person could easily have let them survive a bit longer to spice things up a bit. In fact, the way they were despatched was a bit ludicrous too. Also it felt a bit one-out, one-in as the closing sentence of the book heralds the reappearance of a figure from Ruth’s past, who may or may not add a bit of energy to the series.On a more positive note, I always appreciate Ruth’s witty asides, and her day to day battles with weight, appearance, and desperately seeking to not say the wrong thing at the wrong time. I love her groundedness, and her professional demeanour, along with the insight into archaeology that arise from the books. I will read the next one, and undoubtedly the next, but unfortunately The Dark Angel didn’t quite hit the spot for me this time."}, {"userName": "Cindy Burnett", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "Ruth Galloway is one of my favorite detectives, and I love this series by Elly Griffiths because it is unique, clever, and smartly written. The Dark Angel, the 10th installment, takes Ruth with her friend Shona and their children in tow to Italy to investigate a group of bones found by an Italian archaeologist in Fontana Liri. While investigating the ancient bones, Ruth is pulled into a modern murder that eventually unveils a secret kept since World War 2. Griffiths’ descriptions of Fontana Liri are spectacular; I felt like I was there. The Dark Angel is a solid addition to the series and well worth reading. My one complaint is that I wish that Ruth’s personal life would settle a bit more than it has so far. I received this book to read and review; all opinions are my own."}, {"userName": "Ellen", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/5779782-ellen", "userReview": "The Dark Angel by Elly Griffiths (Ruth Galloway, #10)Another excellent entry in the Ruth Galloway series by this gifted author.Ruth receives an urgent message from a friend in Italy. a friend whom she has not seen in years. Angelo Morelli needs an archaeologist of Ruth's standing to identify bones which he has uncovered in his native town in Italy. Ruth prepares Kate as well as Shone along with Louis(shone Phil's son) for the journey overseas.DCI Nelson is notified of the release of murderer Mickey Webb. Nelson had played a huge part in getting this monster put away...he had hoped for a life sentence. The last words after Webb's sentencing were that he would get even with Nelson no matter how long it took him.The writing was smoothly written as the author brought the reader from Italy covering Ruth's journey back to England to cover Nelson's family. This story did not end the way I thought it would end. The ending actually took me by surprise. Excelent story-excellent series-highly recommended."}, {"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "If there were an award for the most annoying characters in a book series (that you keep reading, despite the fact) would I award it to Ruth Galloway & DCI Harry Nelson. Sorry, to everyone that loves the series, but Ruth inner monologue about how fat she is and how religion sucks, etc. just rubs me the wrong way. Nelson's thoughts aren't much better. So, when you look at it do they fit very well together. To bad that Nelson is married and his wife is pregnant, although the father of the baby could be Nelson or Michelle's lover. Yeah, it's like a soap opera. The personal stuff is probably why I keep reading the books, it's so melodramatic.I found The Dark Angel to be OK. To set most of the story in Italy was a nice move and I came to enjoy most of the book, yes, there were too much ranting inner monologues, but part of me has gotten used to it and I have started to look forward to seeing how many times Ruth can think that she is fat or that all the other women are so beautiful. As for the case, I have to admit that I was wrong about the ending, I had my mind set on a different conclusion on the storyline in Italy. I quite like the fact that I was wrong, kudos to the author.Back in England is a man released from prison that swore to get revenge on DCI Nelson, but the man in question has found God, or so he claims. Nelson isn't sure, and he's worried the man would do something to him or any of the other's involved with the case. But, then he learns that an earthquake has occurred in Italy where Ruth and his daughter are staying and he leaves his pregnant wife and daughter behind to go to Italy. Leaving them all alone...The Dark Angel is better than the previous book. I told myself that I would give this series one more chance and I'm actually glad that I read the book, and yes I will read the next. Especially since the book ended with a cliffhanger...I want to thank Houghton Mifflin Harcourt for providing me with a free copy through Edelweiss for an honest review!"}, {"userName": "Sue", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "The latest Ruth Galloway novel takes her on a business/holiday away from King's Lynn and Norfolk to sunny, hot Italy. She, her friend Shona and their children, Kate and Louis, are traveling because Ruth has been invited by a long-ago colleague to assist with the identification of some bones. He does have ulterior motives: Galloway is well known and these bones are to be televised! But much of the time will be vacation before her oncoming semester.Meanwhile, at home, in a separate plot line, a man is released on parole from prison after 10 years. His crime: directing the arson that killed his wife and children. Among the involved officers: Harry Nelson. Nelson's boss alerts him to be watchful as they have difficulty believing this man truly has found religion and reformed. Additionally, Nelson's wife is very much pregnant. And Ruth's mother has died, simultaneous with the end of the last book, The Chalk Pit leaving Ruth's father living alone in London.. So there is much happening with our regulars.Now I have provided the set up....I won't give away much plot. Needless to say there is a lot about to happen. As always, Griffiths' writing kept me glued to the story, moving from one development to the next. In Italy, there are major secrets that Ruth begins to suspect but which impact people in the small town where she stays. A town that still holds strong grudges dating to WWII. In King's Lynn the regulars are all on board, as we want them to be. There are some events toward the end that left me wondering a bit. But I do trust Griffiths and admire the characters that she writes. I'm very much looking forward to the next book in the series. I recommend this novel as I have recommended every other book in the series.A copy of this book was provided by the publisher through NetGalley in return for an honest review."}, {"userName": "Roman Clodia", "userReviewDate": "Dec 12, 2017", "userURL": "http://www.goodreads.com/user/show/56111743-roman-clodia", "userReview": "For long-time fans of the delightful Ruth Galloway (newbies should start at the beginning of the series), this takes Ruth out of her usual setting and places her in Italy. With some plot manipulation, Griffiths gets Nelson there, too, and we have two rather thin crime plots unravelling, one at home and one in Italy. As ever, plot is shown to be Griffiths' weakness - but Ruth is such a great character, and the narrative voice so slyly funny that I can forgive a lot. Here the long-term characters don't have much to do, and we tip into overheated soap-opera in places. 3.5 stars for one of the weaker entries in a favourite series - hopefully Ruth and friends will be back to their witty best next time.Thanks to Quercus for ARCs via Amazon Vine and NetGalley"}, {"userName": "Marialyce", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "3.5 \"entertaining\" starsDr Ruth Galloway is quite the talented forensic anthropologist. She is well known so that when she receives an invite from a man Dr Angelo Morelli she jumps at the chance to take a look at a group of bones recently unearthed in a village outside of Rome. Ruth has not had any type of vacation in many a years so she, her daughter, her best friend and her child head off to Italy for some investigating and fun in the sun. When Ruth and her entourage land, she is confronted with a mystery and also a secret concerning the Resistance that will eventually lead to murder. While she is in Costello degi Angeli, who should arrive but her lover, Nelson, the father of Kate, accompanied by a druid named Cathbad. Back home in England Nelson's wife who is expecting a child (perhaps by her lover or maybe maybe Nelson), and his family come up against a person intent on doing damage to both Nelson and his family. It is harrowing time for the family and during this fracas, a policeman is killed. Interestingly this policeman might just be the father of the new baby. It is all very civilized this interchange of wives, lovers etc. It does come together nicely as the story unravels and the murderers and mystery are revealed. From what I have read, this is the tenth book in this series. This is the first one I have read and perhaps that put me at a disadvantage to the characters and their interactions. All in all it was an interesting book and one I am sure mystery lovers would greatly enjoy.This book came to me courtesy of my local library, a place I am most grateful to have making wonderful books available to me."}, {"userName": "Susan Johnson", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/5172713-susan-johnson", "userReview": "4.5 starsI love the Ruth Galloway series and eagerly look forward to the next book. I try to read slowly to make it last longer but I can never do it. I have to keep turning the pages and this is no exception. I was a little nervous because Ruth goes off to help out on an archaeology study in Italy. She is going to vacation too so takes Shona, Kate, and Louis (Shona's son) with her. I get nervous when authors send their characters to Italy especially after Elizabeth George sent Barbara Havers there and it was just awful.Ruth behaves oddly in Italy too. She spends little time on the project, goes swimming a lot and seems quite aimless. It's hard to picture her out of Norfolk and maybe that's why she seems to be drifting. There's an earthquake in a town 20 miles away and Nelson flies out with Cathbad to check on them. I think how wonderful it would be to live in Europe where you can fly to Italy the next day. Their is a murder and Ruth and Nelson are dragged into the investigation.Meanwhile back in Norfolk, a horrible criminal is released from prison. How a man convicted of arranging the murder of his wife and children is released is beyond me. He has vowed to get vengeance on Nelson. Weird things start happening and you wonder if it's the criminal. Meanwhile Michelle is getting reacquainted with an old friend while Nelson is in Italy. The love triangle heats up.Then the book takes an unexpected twist that will echo for books to come. I can't wait to see where it goes next. The author is unafraid to take chances and I am excited for the next book."}, {"userName": "Melanie", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/4843124-melanie", "userReview": "Really annoyed me, the series has been going downhill for me for a while but this one was really not a mystery more the Ruth and Nelson melodrama. I think this might be the last one I read in this series."}, {"userName": "❀⊱Rory⊰❀", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/25852225-rory", "userReview": "Review to follow."}, {"userName": "LJ", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/250195-lj", "userReview": "First Sentence: ‘This grave has lain undisturbed for over two thousand years.’Archeologist Ruth Galloway and her daughter are invited to Italy by fellow archaeologist, and television host, Angelo Morelli to help identify bones found in a hillside town. Fontana Liri was Angelo’s ancestral home and where his grandfather played an important part during the resistance movement of WWII. But if the war is over, why are threats, and attempts being made on Angelo’s life? In England, DI Harry Nelson learns of the impending release of Micky Webb, a man he put in prison. Is Micky now threatening Harry, his family, and pregnant wife? Still, a natural disaster sends Harry to Italy to ensure the safety of his former lover, Ruth, and the daughter they produced together. Author’s notes can provide such fascinating information. One should always take the time to read them.There is an interesting juxtaposition of the focus on religion and Catholicism, and relationships involving infidelity. And infidelity does play a major role in this book, and series. In fact, it basically dominates the plot of the book. Griffiths runs the separate storylines of Ruth and Nelson in parallel and it works. One is never confused as to which plot thread is being addressed. The story of Samer, the Syrian refugee is sad and typical of that which the Syrian people, many of whom are Catholics, are experiencing. The information about the history of the area in Italy is interesting. The information regarding the positions in which people are buried in the church’s cemetery is even more so. It also provides an interesting perspective on some Italians’ views toward the Roman evacuations--”There are too many Roman sites in Italy,’ says Angelo. ‘There are only two metro lines in Rome because whenever they start digging, they come up against another damn amphitheater. The Romans are everywhere.’”Ruth is a very real, very human character. In spite of her intelligence and capabilities, she is almost painfully self-critical and self-deprecating. Cathbad is a character one can’t help but like. He’s a Druid who—“…views the rules as guidance only, and guidance for other people at that.”There are a couple of wonderful literary references to make one smile—“Stop it, she tells herself, you’re not Miss Marple, this has nothing to do with you.”—and one which is very Sherlock Holmes—”Nelson tries to cast his mind back. He remembers bloody Tim talking about something he called a memory house. Apparently, you have to go in and search through the rooms until you find the hidden memory.” She also makes mention of reading Ian Rankin.The disposition of the corpses, both in England and in Italy provides one another piece of historical information. It’s one of those great “Who knew?” moments. There is suspense, both in Italy and in England, and both are well done and include some good twists.“The Dark Angel” is not Griffith’s best book by far. One could say the focus of the book was primarily on relationships and infidelity, with a small percent on the mysteries, and a tiny percent on archeology. Yes, there is a powerful cliff-hanger ending, but it may not be enough to ensure one will continue with the series. THE DARK ANGEL (Pol Proc-Ruth Galloway/Harry Nelson-Italy/England-Contemp) - Okay\tGriffiths, Elly – 10th in series\tHoughton Mifflin Harcourt – May 2018"}, {"userName": "Barbara", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/798978-barbara", "userReview": "Ruth Galloway is one of my favorite crime novel characters. She is an academic specializing in ancient bones. A colleague and old friend invites her to Italy to look at some old bones, and Ruth, desperate for a holiday, takes off for 2 weeks in Italy with her 6year-old daughter Kate and friend Shona, and her four year old son.I would have rated this higher but the crime doesn't occur until well past half the book. I also am not fond of overly long books and felt this could have been a bit shorter. Eventually there is a murder and it is not obvious who the culprit could be. Ruth's personal life continues to be complicated, and as always, the end of the book leaves some questions unanswered, meaning I can't wait to read the next installment."}, {"userName": "Kathy ", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/971945-kathy", "userReview": "The Ruth Galloway series by Elly Griffiths is celebrating its 10th Year Anniversary this year with the publication of The Dark Angel. Do not expect it to be a light-hearted celebratory tale. This book is Elly Griffiths at her most devilish best. It’s light and dark and all shades in-between. I love it and hate it and love it again and want to read it all a second time.At this point in the series, it’s impossible to review a book in it without spoilers from previous books, so do yourself a favor and don’t read this review if you’re just starting the series, and for goodness sake, you will want to read them from the beginning anyway. They’re too good to skip any.So, the big bombshell in the book before this one, The Chalk Pit, was that Michelle, DCI Harry Nelson’s wife, is pregnant at age 46. With Nelson’s pull towards Ruth Galloway, the star of this series and forensic archeologist, and trouble in his marriage, the pregnancy is a stunner to all. And, then there’s the matter of Michelle’s lover, Tim, who used to be on Nelson’s serious crime team. Oh, what a tangled web indeed. But, with such great crime stories contained in the Ruth Galloway series, isn’t the romantic storyline just a minor part. NO! Well, I may be a little over involved with these fictional characters.The storyline in this thrilling new book take us to Italy’s Liri Valley when Ruth is asked by a fellow archeologist Angelo Morelli to come to Italy and help him identify some bones he has uncovered. He is hoping that Ruth’s expertise will help lure back a television filming of the event. For Ruth, who is still reeling from the news of Michelle’s pregnancy, it is an opportunity to take a much-needed vacation while still working. So, she and her six-year-old daughter Kate, Ruth’s friend Shonna, and Shonna’s four-year-old son Louis take off for a couple of weeks of relaxation and fun. But, all is not fun and games for Ruth as she discovers that the small hill towns of Italy have long memories that affect their attitudes toward everything, including archeological digs. For the rest of my review, please visit my reading blog at http://www.readingroom-readmore.com/2..."}, {"userName": "Richard", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/4501926-richard", "userReview": "I think if Elly Griffiths chose to write a cookery book it would be a #1 best seller.In The Dark Angel she has maintained the high standard readers of the Ruth Galloway series have come to expect and love.Packed full of familiar characters the story is homely but never sentimental, action filled but interspersed with chunks of humour and lighter touches.The star of this 10th novel is the main location, Italy. You can feel the heat, smell the lemons and see dusk falling in the Liri valley.How the author manages to get the main players to relocate to Italy is genius in itself but to then create two compelling plots at home and abroad is quite brilliant. Of course we are not on a jolly, there are Roman bones to involve Ruth in archeology and another TV appearance.There are many references to angels, death, liminal spaces and the hereafter. Great fun to read.How Nelson can be wronged and still lose face is part of the ongoing saga; especially with Tim back on the scene.It is also about family, loyalty and reputation and will appear to all who like a gentle novel as well as fans of the crime mystery,A cat and a dog also have supporting roles.Who would have thought that Cathbad spoke Italian. There is a summery of the main characters at the end of the book to assist new fans with some little known facts as well as a potted history.Elly Griffiths goes from strength and now writes with an ease and captures the knack of telling good stories."}, {"userName": "Cathy Ryan", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/7796704-cathy-ryan", "userReview": "4.5*Forensic archaeologist Dr Ruth Galloway leaves Norfolk behind for the hilltop town of Castello degli Angeli in sunny Italy when she receives a phone call from an old colleague and one time lover, Angelo Morelli. Bones have been discovered at a dig in the Liri Valley. They could possibly be Roman, but there are some inconsistencies and Ruth’s expertise is called for. Ruth is feeling an unusual need for a holiday after events lately, and the realisation that DCI Harry Nelson’s wife’s surprise pregnancy has spelled the end of her newly burgeoning hopes, despite the fact there are doubts about the paternity of Michelle’s baby. So, together with her daughter Kate, best friend Shona and Shona’s son Louis, Ruth travels to Italy.Back in Norfolk Nelson is called to a building site when human bones are uncovered. Asking for Ruth to attend the scene, he’s more than put out to discover Ruth has taken Kate to Italy without mentioning it to him. More unwelcome news involves someone he helped convict and send to prison ten years ago, has been released early. When he was sentenced, Mickey Webb threatened to get even with Nelson but now seems to have found Jesus and become a new man. Not that Nelson believes that for a moment. More worrying however, is the news of an earthquake in Italy.Worries about Ruth and Kate increase when the phone goes unanswered, and he and Cathbad, Ruth’s friend and the partner of one of Nelson’s team, book a flight to Italy.The storylines initially run concurrently, with a marked contrast between Italy and Norfolk . Events are escalating in both places and, despite the sunshine and holiday atmosphere, the seemingly idyllic Italian town has its darker undercurrents and the past rears its ugly head in the form of a nasty murder. Ruth is uncomfortable staying in the apartment Angelo has made available for their use as it becomes obvious someone doesn’t want them there. The repercussions of Italy’s role in the second world war and how it affected the descendants of those who were involved in certain roles added an interesting historical thread to the story. I love the way Elly Griffiths writes about her characters–the insight, self-deprecating humour and their complicated relationships. This really is a quite a large part of the storylines, especially this one, with the murder/mysteries sometimes taking second place. Engaging and realistic, the characters are well developed, and the mix of archaeology, history and crime make this a very readable and enjoyable series. Nelson is torn between his feelings for Ruth and wanting to do right by his wife. Ruth understands and respects him for that while at the same time feeling down about the whole situation. The return of DS Tim Heathfield complicates matters even more, and leads to a shocking twist at the end, which is bound to have consequences for all involved. Can’t wait to find out what happens next."}, {"userName": "Laura", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/10281457-laura", "userReview": "The Ruth Galloway series is like returning to an old friend. I'm always excited for a new release and I know it's going to be a great read. The Dark Angel reinforced this feeling!I love the combination of archaeology and crime that runs at the core of this series, and The Dark Angel is no different. What is different, however, is that this book is not set mainly in Norfolk, as many of the previous novels are, but instead a lot of the narrative takes Ruth (and Kate) away to Italy! Though I love reading about Norfolk locations (some real, some made up) it's actually quite refreshing to have the action relocated to sunny, exotic Italy - Fontana Liri, to be exact - and to meet some different characters as well as the favourites we've grown to know and love. In fact, I almost wish we saw a bit more of the old favourites in this book, but as I said it's always nice to have a change! Ruth is a great character, as always, and still so solid, sharp and, ultimately, very believable; I never think she is overly dramatic about things and I feel like I can identify with her thoughts and feelings as she's often so normal, despite not being normal - ie. brilliant - at her job. I also liked reading more about Nelson and his strong views; I do like him despite definitely not agreeing with everything he says or does. He's not a perfect love interest and sometimes he's quite annoying!Something I always think about this series is that it's never rushed. Take Ruth and Nelson's relationship (or non-relationship, really), for example - they've been faffing around each other for years and years, and although there have been moments where you think '\nThis is it! They're finally going to get together\n', we've yet to see it properly happen- and this no doubt reflects 'real life' a bit more. There aren't always happy endings or people abandoning their partners to run away into the sunset with other people. I won't give anything away about The Dark Angel, but could it finally be time for Ruth and Nelson? That's always something I wonder before I pick up a new book in this series - it keeps me guessing!There's exciting/ tense elements to the narrative which keep it interesting and it's easy to read; Elly Griffiths has such an enjoyable way of writing. I always expect an intriguing and well written read story, which I definitely got in this novel, along with plenty of interesting archaeological details. A great read which only adds to this brilliant series![Rating: 4.5/5]Many thanks to the Quercus Books for providing a copy of this novel on which I chose to write an honest and unbiased review."}, {"userName": "Anna Elliott", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/964734-anna-elliott", "userReview": "I think I may have said before that this is one of my favourite series. Well, I was wrong, this is absolutely my favourite and without any shadow of a doubt. Whilst there are other series that I am enjoying reading, none of them are even coming close to knocking this one off its perch.For my full review please visit my blog at: https://leftontheshelfbookblog.blogsp..."}, {"userName": "Latkins", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/27603384-latkins", "userReview": "I can't believe that this is the 10th book in the series featuring Dr Ruth Galloway, as it doesn't seem that long ago since the first one came out. Once you get into this series, it's very addictive. In this one, Ruth goes to Italy on the request of an old flame, a TV archeologist who wants her help with a skeleton he's dug up. She takes her daughter Kate with her, and her friend Shona and her son Louis. But there's soon more to investigate than bones in the little Italian town she stays in, as first their are threats and then there's a murder. Meanwhile, Nelson is in Norfolk contemplating his wife Michelle's pregnancy and wondering if the baby's his... I really love these books, more for the familiar cast of characters and their continuing stories than for the murder mystery element, which, although entertaining, takes a bit of a back burner in this novel. I really recommend this series but it's best to start from the beginning."}, {"userName": "Zoe Hartgen", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/30439490-zoe-hartgen", "userReview": "While it as nice to see Ruth and Nelson out of their comfort zone, I don't think this book has been one of the best in the series. I didn't feel it was as gritty, or as exciting as the previous books. This book just didn't have the same oomph as the first 9. Probably because it's different to what the others are like but I didn't really like it. I didn't feel the suspense or the mystery that was supposed to be there, and I'm a little disappointed. I really hope this isn't the beginning of the end for Ruth. Written as well as the others though and that's what counts. I didn't really like the storyline, both in Italy and England so that's my only issue with it."}, {"userName": "Chris Conley", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/7209420-chris-conley", "userReview": "Ruth finds herself in the weirdest situations. This one is a corker. She is such a complex character and these books are full of twists and intersections."}, {"userName": "Cynthia", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/1802440-cynthia", "userReview": "I look forward all year to the latest Ruth Galloway adventure. This time she heads to a quiet sea side town in Italy to help a colleague identify the bones they’ve found on a dig they’re featuring on the friend’s Time Team like program. That part of the journey turns into a bit of a farce but, as can always be expected, things in the town turn deadly launching Ruth and her Bestfriend Shona into an investigation that, you guessed it, lures Nelson to join them.Griffiths books are so much fun and page turners but Dark Angel is one of her more exciting ones with its focus on Italy and this town that is still playing out some of the drama of World War II and the complicated role Italy played between the resistance fighters and the citizens who supported the Fascists. It’s complicated and sometimes deadly. So is Ruth’s and Nelson’s relationship together and with their extended families. Both the plot and the subplot will hold your attention.Thank you to the publisher for providing an ARC."}], "description": "FROM THE SUNDAY TIMES BESTSELLING AUTHOR, THE 10TH DR RUTH GALLOWAY MYSTERY - CELEBRATING 10 YEARS OF RUTH\n\n'My favourite current crime series' Val McDermid\nDr Ruth Galloway is flattered when she receives a letter from Italian archaeologist Dr Angelo Morelli, asking for her help. He's discovered a group of bones in a tiny hilltop village but doesn't know what to make of them. It's years since Ruth has had a holiday, and even a working holiday to Italy is very welcome!So Ruth travels to Fontana Liri, accompanied by her daughter Kate and friend Shona. In the town she finds a medieval shrine and a dark secret involving the war years and the Resistance. To her amazement she also finds Harry Nelson, who is enduring a terrible holiday at a resort nearby. But there is no time to overcome their mutual shock - the ancient bones spark a modern murder, and Ruth must discover what secrets there are in Fontana Liri that someone would kill to protect", "title": "The Dark Angel: Ruth Galloway 10\n      \n          (Ruth Galloway #10)", "url": "http://www.goodreads.com/book/show/34872283-the-dark-angel", "average": 4.19, "cover": "https://images.gr-assets.com/books/1492444685l/34872283.jpg", "reviews": 328, "authors": [{"url": "https://www.goodreads.com/author/show/2541526.Elly_Griffiths", "name": "Elly Griffiths"}], "type": ["Mystery", "Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/34872283-the-dark-angel", "http://www.goodreads.com/book/show/34830283-the-dark-angel", "http://www.goodreads.com/book/show/35721170-the-dark-angel", "http://www.goodreads.com/book/show/6688087-the-crossing-places", "http://www.goodreads.com/book/show/6268632-the-janus-stone", "http://www.goodreads.com/book/show/9130129-the-house-at-sea-s-end", "http://www.goodreads.com/book/show/15814458-a-dying-fall", "http://www.goodreads.com/book/show/12624533-a-room-full-of-bones"]}