{"ratings": 23328, "userreviews": [{"userName": "Matt", "userReviewDate": "Jul 24, 2009", "userURL": "http://www.goodreads.com/user/show/2557099-matt", "userReview": "Daniel Silva is very good writer, and Gabriel Allon is a captivating character with a complex mind. However, the author seems to have run out of ideas because Gabriel is doing the exact same things that he's done time and time again. There is very little originality in The Defector. The plot has a boiler-plate predictability that should make the author blush. Unless Silva can create a new arena for his enigmatic protagonist (or at least develop a major departure in the storyline) I think it's time for Gabriel Allon to come in from the cold."}, {"userName": "Dana Moison", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/45188714-dana-moison", "userReview": "As much as I LOVE thrillers, I was never really into espionage novels. Once I read on the back-cover words such as “Russian intelligence” or “Terrorism”, I’d lose interest.And then I stumbled upon “The Kill Artist” by Daniel Silva. It wasn’t love at first sight, but it was love alright. My aunt from NY came for a visit and told me I should read this book, so I said to myself, what the heck, and gave it a chance.By the end of the book, I’ve already fallen in love with Gabriel Allon, the Israeli spy who’s an artist in every fiber of his being, restoring marvelous artworks in his spare time. Gabriel’s character is fascinating, luring, tragic and I’m never tired of reading about him. I found myself reading more and more of Daniel Silva’s books (unfortunately, not always by the correct order).Silva has a fantastic ability to invent complex, thrilling and unbelievably realistic plots. Add to that a set of interesting characters, witty dialogues with plenty of punchlines, a brilliant analyzing ability of international political events (a testament of Silva’s former career at CNN) and just great writing, and you’ll get a brilliant espionage thriller!And of course, you can’t ignore the in-depth research the author had done in favor of this book (and a few of his previous books, which also transpire in the Russian scene). As an author who’s conducting her own research for her next book, I was outstandingly impressed. We’re talking about a lot of hard work “behind the scenes”, that contribute tremendously to the quality of the book. This time, Gabriel is caught in another confrontation with the oligarch and the fearsome arms dealer, Ivan Kharkov. Apparently, there is an unresolved issue standing between them. I won’t write another word, because I don’t want to cause any spoilers, but trust me – the story is fantastic! I highly recommend this book, as well as Silva’s other novels, just start reading and discover your inner spy ;)"}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "May 01, 2009", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "I generally reserve my highest ratings for more literary works, but I had to give this the full five stars to set it apart from other popular suspense/thriller books. This is the best one yet in the Gabriel Allon series. Exciting, fast-paced international action. Silva has really outdone himself with this one. If this turned out to be the last one ever in the series, I would be content. The amount of research done and the descriptions of the places really make this story shine. I strongly recommend reading Moscow Rules before reading this one, so you can get the full effect of the ongoing story and not be lost."}, {"userName": "Elizabeth", "userReviewDate": "Aug 03, 2009", "userURL": "http://www.goodreads.com/user/show/1857329-elizabeth", "userReview": "The Defector by Daniel Silva (pp. 480)The latest installment of Daniel Silva’s thriller series starring Gabriel Allon, a conflicted Isreali spy is a near sequel to last year’s Moscow Rules. After finding a somewhat normal life with his new wife, Allon gets thrown back into the mix when the man he rescued in the previous book is kidnapped by a Russian arms dealer. After nine books using the same main character, Silva shows that he IS master of the genre. When other series are ready to kill off the main character out of lack of direction and boredom, Allon is more interesting than ever. And in a near sequel, you might expect a rehash of lukewarm ideas. Silva throws into gratifying twists and suspense and provides the rare closure a reader wants at the end of a face paced, multi-continent mission.There’s not much that Silva doesn’t do perfectly in this book. He tackles the tired notion of Russian military as the protagonist and breathes relevant life into any otherwise dated stereotype of the genre. He has almost a screenwriter’s touch with dialogue. He trusts the reader to follow long bits of conversation between multiple characters without weighing down the page with “he said”, “she said quickly” and “he quipped”. And while reading the previous Silva books may help the reader with pacing and better understanding of characters, Silva has done an excellent job of injecting the right amount of backstory to also satisfy new readers. Silva gives the reader everything they would expect from a spy thriller and does it perfectly. Given the quality of the content and the richness of the characters it is a surprise how Silva’s series hasn’t been made into movies. Clancy needs a solid successor and Silva is more fun than Bourne and could probably kick Jack Bauer’s ass.The Defector may be Silva’s best and strongest work yet."}, {"userName": "Andrei", "userReviewDate": "Jan 28, 2011", "userURL": "http://www.goodreads.com/user/show/4891272-andrei", "userReview": "There is no any sophistication of real spy novel in this particular book and in \"Moscow Rules\". Before these two, I read \"The Secret Servant\" and what still OK with it for long flights but starting from \"Moscow Rules\"... Probably 99 of 100 reviewers who put 4 or 5 stars on this page have never seen Moscow apart from the TV screen. I'm sure from reading your reviews that same percentage never dared to dig deeper to understand what really happens in Russia beyond what they've been fed by CNN and likewise. But OK - let's forgive it as this Silva' duology is just an entertainment beach reading which should not pretend to be a serious stuff.The problem is that Silva with the great aplomb postures his plot as the serious stuff! Fellow readers strolling through the book may get a feeling that what he is depicting is really a portrait of todays' Russia; that the President may cover arms dealer who bribes him personally, that KGB is listening to any hotel room in Moscow and puts surveillance on every incoming foreigner (where would they get a budget from?). By the way, Allon is staying in Rits-Carlton on Tverskaya (that's where President Obama was staying on his State visit) for several days - the cheapest room is 1.000 USD per night - you may just check on internet - (where would Israelis have the budget from to give him such allowance?). But staying in this hotel his highly trained team of assassins is using dreadful Russian built Ladas - the four of them - instead of BMW-540 or likewise more common on Moscow streets. Such professional discuise may be compared to scenario when four pink Cadillac convertibles of 1956 would run highly covert operation on Pensilvaniya Avenue. The one who ever landed in Sheremetyevo knows that these cars are more rare then the said Caddy convertibles in DC, still Silva again uses the poor thing as a taxi to pick Allon in the airport. Details, sophistication and plausibility are what make good spy novel. I bought these three last Silva' books after reading reviews, also on this site, in search of a writer which may prolong the line of elegant spy novel. I read all three and I know I didn't find it. Instead, I found pretty stupid violence, unreasonably wrong and horrid depiction of Russia (and not only Russia), offending arrogancy, complete misunderstanding and sometimes bare hatred. \"Kill them all!\" - says the pretty wife of protagonist. And the hero does, whoever they are - the driver, the woman, the bodyguard, dozens of them. And for what reason?Please try to find a better reading then this pulp fiction."}, {"userName": "Karen", "userReviewDate": "Jul 14, 2010", "userURL": "http://www.goodreads.com/user/show/2307775-karen", "userReview": "First off, this is five stars based on it being part of a series, and based on the fact I just finished it and am still feeling the adrenaline. If you haven't read the others it won't make sense, but if you have read this one NOW!Holy crap I can't even catch my breath. I love Gabriel, but I never knew what he was capable of, or that I would question whether he was doing the right thing. Vengeance is clearly neither black or white. I basically see this as part two of Moscow Rules and while that was a bit of a disappointment, this never relents or even slows down and feels like a proper end to that story. I read the last 300 pages this afternoon and my stomach is still in knots. Although I have to mention that this one is much more violent than the others."}, {"userName": "Ivana Books Are Magic", "userReviewDate": "Dec 09, 2016", "userURL": "http://www.goodreads.com/user/show/56173179-ivana-books-are-magic", "userReview": "I can't believe this novel has had so many five star reviews on goodreads. I find it worrying to be frank. If Daniel Silva is a good writer, please tell me what is a bad writer? Because to me this is a wonderful example of bad and sloppy writing. I mean as a trivial literature it might just do- if only it wasn't so hopelessly overdone. If only it wasn’t so filled with racial hate. If only it didn’t feature such a stereotypical protagonist. If only it wasn’t a thriller completely devoid of suspense. No, even as trivial literature it is a disaster. To make it any good, you would have to rewrite it.Here we have Gabriel Allon, the protagonist. Everywhere he goes women throw themselves on him. It is not certain why, I suppose it is just a James Bond cliché the author decided to run with. Our protagonist is supposed to be under lots of stress and aging prematurely, there is no mention of any special gift of his or anything of the sort that makes him so attractive to the opposite gender, yet when he arrives in some small Italian town, every woman is besotted by him. Have you ever seen an Italian woman throwing herself at somebody? No, you didn’t. Because it never happens. Never. Besides, aren’t man who work in military intelligence those that know how to keep a low profile? Apparently not. Never mind, this is not a book about spies anyway. What it really is a book about how Western politicians are the only hope of this world, all that is keeping things from falling apart is their constant work. The rest of the world doesn’t matter at all because we all know the democracy doesn’t exist anywhere else (I’m being sarcastic in case you can’t tell). Perhaps the popularity of this book has something to do with the fact that people like to be told they’re special or fortunate because they happen to live in the West. Yes, our protagonist is basically an archangel of some sort, because we all know that in the West there is no corruption, only pure and beautiful democracy. To make it a bit more politically correct, the author decided to make the protagonist an Israeli. I can’t say he did a very good job, but well….I get it, it’s no Shakespeare, but even taking it as what it is- a cheesy spy novel, this is quite bad. I don’t mean it in ‘James Bond’ over the top and ridiculous but kind of cute bad. So, bad that it is good? NO!!!! No, this is just bad. The protagonist is supposed to be portrayed as an angel but he ends up as boring. There is no thriller in this thriller. The story is quite predictable. Yes, there are some shifts and turns, but nothing truly original. You know that nothing is going to happen to Gabriel- nothing serious, he might get hurt but this writer is not going to kill his gold goose. You know Gabriel is going to save the day. Where is the point of this novel again? What are its dynamics- where is the story? At no point is Gabriel conflicted or confused (or anyone else for that point). Everything is so clear that even a retarded amoeba could understand it from the start. All the bad guys are obviously the Russians (obviously), so there is nothing morally ambiguous (to Gabriel) in whatever he does- whatever happens he is the hero. Basically, it is page after page at how awesome Gabriel is. His enemies? Total scum. Gabriel works for the God (the West) and everyone else deserves to die and bares no importance (how boring – and not to mention HOW racist is that?). All the characters are not just black and white, they’re not only two dimensional, they’re ridiculously oversimplified. If anything, all the characters are one dimensional caricatures (if there is such a thing). If the plot is obvious, if the characters are badly developed and if there is no suspense, then what makes this novel good? I have no idea, but he has five stars rating on goodreads.Please don’t leave a comment under this post explaining how I missed something. Please don’t say that Daniel Silva has journalist experience and knows what he is talking about. The fact that he worked as a journalist and managed to write something that is such an obvious propaganda and so filled with hate towards one specific nation and country (i.e. Russia) is worrying. I’m honestly disturbed by the fact that so few reviewers have pointed out the obvious racism of this novel. Please don’t say that this is only one novel in a series and that I need to read others before I make up my mind. I won’t read anything else by this author- ever. Not just because Daniel Silva suffers from an acute case of xenophobia but because he is a bad writer. Period. If you like this novel, well great for you, but don’t tell me I’m missing out on something. I’m not. I read it once and I even attempted to reread it. I concluded that it is a complete and utter rubbish."}, {"userName": "Sheila", "userReviewDate": "Mar 21, 2013", "userURL": "http://www.goodreads.com/user/show/5986207-sheila", "userReview": "Personally I feel Daniel Silva is great writer. I have given 5 stars as story was a page turner and full of suspense till the very end was not sure if he was going to kill Ivan. I have read few books and Gabriel Allon is my ideal captivating character with a complex mind. The author seems to have run out of ideas as Gabriel is doing the exact same things that he's done every time in the series I have read so far. At this point I have still not decided if the author should change anything in respect to the Gabriel Allon character. I will read other series and make up my mind in the future. I am addicted to spy narratives.I don't like writing about the story as already so many reviews have already given part of the story."}, {"userName": "Fred", "userReviewDate": "Jul 28, 2009", "userURL": "http://www.goodreads.com/user/show/733969-fred", "userReview": "Audiobook on the Indiana road trip. It's a decent story if you've read the others in the series. Otherwise, too much back story and not enough new plot.These days, Gabriel Allon spends more time reminiscing about his past adventures than jumping into new ones."}, {"userName": "Rui Fernandes", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/71896939-rui-fernandes", "userReview": "Segundo livro que leio do autor e para fechar a \"serie\" da russia dos horrores e de terrivel Ivan Kharkov.Salta a vista por diversas vezes a repetiçao de informacao do anterior livro da serie do genero de CTRL-C CTRL-V visto ter lido os livros de forma seguida e num curto espaço de tempo.A dada altura parece que estava a ler o livro anterior outra vez.Ainda assim gostei bastante deste livro onde o suspense se mantém ate final e onde disparou a nivel de açao e violencia,algo que na minha opiniao faltou no anterior.Para o fim estava guardado as vidas das 4 personagens Gabriel, Chiara,Mikhail e Grigori que me prendeu ao livro e facilmente se virão paginas atras de paginas.Valeu bem a pena."}, {"userName": "Jerome", "userReviewDate": "Jun 25, 2012", "userURL": "http://www.goodreads.com/user/show/7672919-jerome", "userReview": "Repetitive and lacks a cohesive story.1. The abduction of the female Israeli secret service agent, resulting from an uncharacteristic lapse in Israeli security, wouldn't have happened even in fiction the way it did. A poorly executed plot feature, though essential for the bigger storyline. It simply wasn't a very creative plot feature.2. The long drawn-out (and so pitifully predicable) conversation at the remote Russian dacha with the bad guy, Ivan, who uncharacteristically allows the \"literary distraction,\" thus giving the good guys time to come to the rescue. I'm so over these \"troops-riding-in-at-the-last-minute\" shticks! Surely, Silva is more creative than this. He got the players into the jam with abandon; let's see him get them out without phoniness!Plot:The weakest aspect of this book. SPOILER ALERT! The entire premise of the book is based on the major western powers going to endless lengths and risking a diplomatic disaster (in the midst of a G-8 summit no less) in order to help an Israeli agent recover his wife. Oh, and a Russian defector (hence the title) which the author clearly implies in the earliest chapters had become irrelevant anyway. Seriously? Apparently, if you're a famous Israeli agent, yes that is how vital to the world your wife's rescue would be. Stop reading here if you don't want a spoiler but you will guess anyway as you read that Allon will eventually kill the Russian arms dealer. How does he do it? Well, the oligarch loves St. Tropez and Allon's team finds out he will attend a riotous party in a St. Tropez restaurant. While the oligarch is at the party he gets a phone call and steps outside the restaurant because there is too much noise inside. There on the street sitting on a motorcycle is our hero with his Glock. Bang, bang, and Russia's most evil man is dead. Supermensh then drives off. Piece of cake. At one point in the novel the head of Israel's secret agents tells the Russian ambassador that his people better watch out because if the Israelis get mad enough they will kill all of Russia's KGB agents (now with a new acronym). Wow! Characters:The hero and his posse are as pure as driven snow. No flaws, no moral ambiguity, no inner conflict. They do not err, they do not hesitate.And of course the villain and his collaborators (all Russian) are greedy, heartless, morally-bankrupt rambling idiots who cannot think two steps ahead.Picture Wile E Coyote and Road Runner minus the humor.Style:The one saving grace and the reason for the 2 stars. The action is at least crisp and explicit."}, {"userName": "Nathan", "userReviewDate": "Nov 16, 2011", "userURL": "http://www.goodreads.com/user/show/549698-nathan", "userReview": "Isn't it astonishing how you don't know variation in a genre is possible until you discover that variation? For example, until I read this book I hadn't ever considered the possibility of writing a thriller with an infallible hero. And lo, here Silva has done it. Well, well, well.Do you know why I hadn't ever considered a perfect hero? Because it makes for a CRAP story. This novel is about 30% awed praise for the almighty and magnificent Israeli special agents and their special agency and the unique tenacity of character that Israel embodies, 30% reverential description of the buff and rebellious hero's incredible perfection of character and action, and 40% gunfire. It is, quite simply, tedious shit because there is no tension.How can there be tension when the hero is perfect, the hero's employer is on the side of right? Even when the hero is, so very very briefly, in danger near the end of the book, you KNOW there's no way this is going to end with the hero's body found in a shallow grave. Other thriller writers make us feel tension by having the hero misread a situation, misjudge a character, make the wrong decision, get menaced, be forced to go against his friends or employer, or otherwise make it hard for him You never get the sense that Silva's protagonist is breaking a sweat.I took a chance on this one, and lost. I won't be reading more by this author."}, {"userName": "Linda", "userReviewDate": "Jan 08, 2010", "userURL": "http://www.goodreads.com/user/show/1050198-linda", "userReview": "Gabriel Allon is one of the thriller genre’s most charismatic characters. He’s something of an oxymoron: the soft hearted, intellectual, humanist, cold blooded assassin. Author Silva has also surrounded Allon with other appealing characters, and the political backgrounds are always compelling. This is what keeps me reading the series. As many other reviewers have noted, Silva’s plots have grown predictable. The Defector is the sequel to Moscow Rules, but, except for the change in the identity of the female victim, there’s little to differentiate the novels. I do not mean to imply that The Defector is subpar. Silva writes with simple eloquence and is a master at conveying emotion and motivation, and, as I’ve noted, characterization. For readers who haven’t followed the series, it’s a first rate novel. But long term fans of Gabriel’s career are in need of new direction. He remarried after years of grief following the bomb attack on his family. Will he now dare to have a child with Chiara, and if so, how will that change his life? Here’s hoping we’ll soon find out."}, {"userName": "Kelly", "userReviewDate": "Oct 07, 2009", "userURL": "http://www.goodreads.com/user/show/133725-kelly", "userReview": "I read every Daniel Silva book that comes out. It is a little like TV for me. However, even given that I don't read Silva for its breathtaking prose this was a disappointment. This book, relative to many of his others, was quite weak. I am not sure how much longer he can keep up the Gabriel Allon books. With that said, I'll buy his next book on the first day it's out and read it quickly. I just hope it's better next time."}, {"userName": "Michelle Wilson", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/27111313-michelle-wilson", "userReview": "Why do we love an assassin? Because Daniel Silva makes him lovable. In this particular story Gabriel goes to great length to find the ' bad' guy. He finds him after a very exciting trip and does kill him. Silva denies many incidents he puts in the book as fiction. Very well, very reassuring fiction...the Brits, the Americans and the Israelis all cooperating to keep the word safe. I like it."}, {"userName": "Jack Getz", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/24161109-jack-getz", "userReview": "It’s a Silva book. Enough said! Great!"}, {"userName": "Richard", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/6185442-richard", "userReview": "Brilliant, Fast-paced. Couldn't put it down. 5 stars!"}, {"userName": "Samantha", "userReviewDate": "Mar 01, 2010", "userURL": "http://www.goodreads.com/user/show/96664-samantha", "userReview": "At the end of Silva's book Moscow Rules, former Russian FSB (think post-Soviet KGB) officer Grigori Bulganov saved Gabriel Allon's life. In turn, Gabriel helped Grigori defect. And made him a promise: that he wouldn't let Grigori be buried in an unmarked grave, the worst possible fate for a Russian.At the beginning of Silva's book The Defector, Grigori, now living openly in London, never makes it to his championship chess match. CCTV footage shows him getting into a black car. Then he disappears. British intelligence thinks he simply redefected. But Gabriel knows better. Wanting to keep his promise, he decides to try to get Grigori back. To do so, he has to retrace Grigori's last steps before he disappeared. His investigation further convinces him that Grigori did not redefect. Instead, he was kidnapped, a victim of a highly professional scheme that gave Grigori no choice but to get in that car.And Gabriel's convinced he knows who's behind it: Ivan Kharkov, the Russian arms dealer who was Gabriel's nemesis in Moscow Rules. Grigori had helped Gabriel escape Ivan's clutches and now Ivan is taking revenge.But there's another twist: Ivan has also kidnapped Chiara, Gabriel's wife, in retaliation for Gabriel helping Ivan's wife and children escape Russia along with Grigori.It's an eye for an eye, according to Ivan. And according to Gabriel, someone's going to pay. In fact, everyone who had anything to do with the kidnapping is going to pay.This is a riveting read. Fast-paced and intriguing, it's also Silva's bloodiest. Gabriel, filled with rage over his wife's kidnapping, wastes no time in taking his own revenge. He and his team track down the most elusive pieces in the game and get them to talk using the most horrific methods. But even though it's brutal, when you look at it from Gabriel's view, it's understandable. His Office career has cost him dearly over the years and he's not going to sit by and lose someone else he loves. He basically does what many of us wish we could do to those who hurt us and those we love. The difference is, he has the skills and means to do it. And he does it with brutal efficiency.As usual for Silva, the story is intricate and tightly-woven. The 'usual suspects' of Gabriel's team are present and play their respective parts perfectly. We also get to see a different side to the Old Man, Ari Shamron, who, though technically retired, still controls the Office with an iron fist and an equally iron will. He loves Gabriel like a son, and in the end, it's this love that finally causes him to do the one thing Gabriel has been wanting him to do for years: let Gabriel go.A fantastic read that I had a hard time putting down. If you're a Silva fan, you've probably already read this. If you're not, you should. But start at the beginning with The Kill Artist. That's when it all started. And it hasn't let up since."}, {"userName": "Gautam Patel", "userReviewDate": "Oct 29, 2009", "userURL": "http://www.goodreads.com/user/show/1443227-gautam-patel", "userReview": "Excellent thriller in the Gabriel Allon series. These are not the kind of books you read back-to-back. For one thing, they're pretty intense, and very violent. They can also be, as someone else remarked, somewhat repetitive because they run to a defined pattern. Read at wide intervals, that familiarity of terrain is precisely what makes them welcome: you know roughly what you're going to get; you just don't know when or how. Silva's writing is tight, lucid and clear. There's hardly a surplus word anywhere. The writing never draws attention to itself and scrupulously avoids all pretentiousness. It focuses on the characters -- and that can be quite disturbing.For there is a darkness at the heart of these books, and a difficult morality to what his characters do. In most thrillers, the good guys never do anything outright cruel. They're usually the victims and they always triumph. In Silva's book, the triumphs are always slightly tainted. The heroic protagonists often engage in acts of the most unspeakable cruelty (the only saving grace being, perhaps, that they derive no pleasure from it, and their acts always end quickly). In Silva's reckoning, what separates the good from the bad is that the latter take pleasure in inflicting pain; the former do not. But the actual infliction of pain on another human being is never wholly condemned.The books all center around the black-ops section of the Israeli secret service, but while there are frequent references to Israeli's justifications for its actions, these aren't really the forces that impel the action or the plot. There isn't a trace of anti-Semitism in any of the many villainous characters who murder their way through these pages. It's pure espionage. Moscow Rules, as they call it. It's impossible not to be sucked in by a Daniel Silva Gabriel Allon thriller."}, {"userName": "Ivana", "userReviewDate": "Jun 07, 2012", "userURL": "http://www.goodreads.com/user/show/6323079-ivana", "userReview": "I've never been a fan of the spy genre. Sure, as a child I've watched the collection of Bond movies (my father use to rent them), but honestly I never got the people's fascination with spies. I guess spying reminds me too much on politics.That being said, I actually enjoyed this book more then I expected. The story is not completely predictable. There is a patter but there is no need to say that, it is to be expected in this genre. Gabriel is a bit like James Bond (fortunately not to much), women trow themselves at him no matter where he goes....Yes, women are immiately attracted to prematurely ageing (because of all the stress) short guy because.....However, I have to say that most of the characters were o.k, not as stereotyped as I would expect.What I did not like was the xenophobia. The light motive is that only thing that is worth something in Russia is the women. Isn't that kind of offensive? Naturally, all Russian women in the novel are beautiful...actually this stereotype is not far from the truth, on average they really are.... Nevertheless, not all Russian men are cold blooded murders...and as for the villain- my namesake Ivan- obsessed with Stalin- what a cliché!And yes we get it…Putin is bad! And if you missed the endless emphasis on that in the novel, the author makes sure you get it in the article at the end of the novel…and expect in Russia democration really exists in every part of the world (especially in the west). Moreover, the chief of western countries are real angels….Yeah, right.Anyway, a good story, interesting plot, a lot of stereotyping and that's about it."}, {"userName": "Amanda", "userReviewDate": "Mar 12, 2009", "userURL": "http://www.goodreads.com/user/show/1101848-amanda", "userReview": "Daniel Silva is one of my favorite authors and I have read everything by him. In this book he continues his series about a paintings conservator who happens to also be an assassin/agent for the Israeli government. Always action packed with twists at every turn this book was done in typical Silva style. The only downfall I could point out would be the predictable pattern that the majority of his latest books have developed. Allon goes back to work, the situation is desperate, they form a brilliant and complicated plan, that plan is working, then that plan is not working, things go down hill fast. In this novel however the cycle is now broken. This time it is not Allon who pulls it all together and you get to see a side of him that you don't see in the other novels and for once life doesn't go back to normal at the end. What makes the books entertaining are the worlds that he depicts. With real events, places, and situations he weaves his fictitious characters with ease. With the intrigue of Russia as a setting how can you go wrong. This book picks up exactly where Moscow Rules leaves off and has you turning pages at a furious pace. Although by the end you think the series is over I have heard that the author is already working on his next Gabriel Allon book and I can't wait, who wouldn't want to read about a painting restorer/government agent/assassin/spy?"}, {"userName": "emma", "userReviewDate": "Jan 13, 2014", "userURL": "http://www.goodreads.com/user/show/5967293-emma", "userReview": "I'm really conflicted on this book, because I thoroughly enjoyed it, but a couple of points made me drop it from a 4 to a 3: 1) The romanticising of Israel's security organisation. I realise fiction is not politics, but this was close to the bone enough for me to come across as fictionalised propaganda. 2) The good guys/bad guys divide - I'm by no means a Russophile, but the sinister portrayal of all things Russian is ridiculously akin to a pot/kettle situation.3) The wife's \"Kill them all\" bit at the end. I was willing to stretch my imagination to accepting that the global powers that be would pour all their resources into rescuing an agent's wife (or give a shite to begin with), but believing that they'd then head back out to exact personal revenge on her behalf was beyond my (usually impressive) imaginative skills."}, {"userName": "NancyG", "userReviewDate": "Sep 30, 2009", "userURL": "http://www.goodreads.com/user/show/840166-nancyg", "userReview": "This is, I believe, the 9th book in a series with protagonist Gabriel Allon, who is a Jewish assasin/operative of the Israeli version of the CIA who repairs paintings for the Vatican when he's not on assignment to kill someone. Really, who could make up a character like that but it totally works! These books need to be read in order as Allon's co-workers and family are an important part of each story. You certainly need to read Moscow Rules first as the books have the same main villan, Ivan Kharkow, a large Russian arms dealer. I like the characters and the books are well written. I'd recommend them to anyone who likes international intrigue books that aren't so complicated you need a score card to keep all of the players straight. No need with Silva."}, {"userName": "Denise", "userReviewDate": "Jan 18, 2016", "userURL": "http://www.goodreads.com/user/show/4171368-denise", "userReview": "Gabriel continues to grow as a spy and a person. This picks up from Moscow Rules when Grigori is kidnapped from London. The action never slows. The team is back in place, including Sarah, Graham, and Adrian. The book takes a twist I didn't see coming. I'm glad Gabriel got to visit with Elena. She and the children were an integral part of the story. I don't want to spoil anything, but the timing couldn't be cut any closer in Russia. The end of the story at Ari's place had me blinking away tears (as did an earlier scene that would giveaway what happened). I'm curious to see how Gabriel recovers from this one. It hit particularly close to home. Oh, and one thing Silva does well is tie up all the plot lines. Kudos!"}, {"userName": "Nitish", "userReviewDate": "Sep 13, 2014", "userURL": "http://www.goodreads.com/user/show/15101547-nitish", "userReview": "I never read any of the Daniel Silva books until I landed onto The Defector and I don't even remember how, but after reading it I'm in complete awe with the way he has managed the whole story. Woven so beautifully, even little things which are lying somewhere in the background appears to be of great importance and believe you me indeed they are. I was really intrigued the way Daniel Silva has crafted the character of Gabriel Allon, and not to forget the introduction of 'Ivan Kharkov'. However, by the end of the book the writing feel rushed. Maybe Daniel Silva felt the pangs of 450+ pages. Possible...Bottom line, a good book to invest in."}, {"userName": "Clark Zlotchew", "userReviewDate": "Aug 28, 2011", "userURL": "http://www.goodreads.com/user/show/5650240-clark-zlotchew", "userReview": "The Defector This, like all Silva's novels I've read, this espionage/thriller grabs you by the literary lapels and doesn't let go for an instant. It pulls you through page after thrilling page of intrigue and violent action and finally releases you, panting from your long but swift journey, on page 497. This novel is part of the popular Gabriel Alon series. It takes place in Russia, London and Switzerland. Warning: Do not start to read this at bedtime; you won't want to put it down in time to get some sleep."}, {"userName": "Judy", "userReviewDate": "Aug 27, 2010", "userURL": "http://www.goodreads.com/user/show/1397813-judy", "userReview": "Perhaps if I had started this series from the beginning, I would have been more interested in this. There were numerous references to past books and had I read them it might have made a difference. But I didn't. And, as such, it was boring. Very boring. Just your typical spy thriller. Had I been more invested in the characters it would probably have made a difference. I'm sure (I hope) the author established the characters well in the first few books and then stopped bothering. This is what I get for reading a book in the middle of a series. Will try not to do that again."}, {"userName": "Shannon Brennan", "userReviewDate": "Sep 07, 2009", "userURL": "http://www.goodreads.com/user/show/2668661-shannon-brennan", "userReview": "This was the first Gabriel Allon book I have read and probably the last. It wasn't a bad story, but it wasn't the greatest either. The plot was lacking and very predictable. I had trouble keeping some of the Russian characters names straight. I am very surprised that it made the NY Times Best Sellers list."}, {"userName": "Frank", "userReviewDate": "Sep 24, 2010", "userURL": "http://www.goodreads.com/user/show/1709579-frank", "userReview": "I wish I had read this right after Moscow Rules....it took awhile to remember the characters. This was well written and cleverly exciting. I guess a good measure of a book is whether there is regret when the book is finished. By that measure, it was a very good book."}, {"userName": "Youndyc", "userReviewDate": "Nov 07, 2009", "userURL": "http://www.goodreads.com/user/show/2074925-youndyc", "userReview": "Just finished the latest in the Gabriel Allon series. It read like an action movie - fast and with plenty of hits, though not explosions. I know that Silva has gotten formulaic, but this was a very good example of the formula."}], "description": "Six months after the dramatic conclusion of Moscow Rules, Gabriel has returned to the tan hills of Umbria to resume his honeymoon with his new wife, Chiara, and restore a seventeenth-century altarpiece for the Vatican. But his idyllic world is once again thrown into turmoil with shocking news from London. The defector and former Russian intelligence officer Grigori Bulganov, who saved Gabriel’s life in Moscow, has vanished without a trace. British intelligence is sure he was a double agent all along, but Gabriel knows better. He also knows he made a promise.Do you know what we do with traitors, Gabriel? Many things have changed in Russia since the fall of Communism. But the punishment for betrayal remains the same. Promise me one thing, Gabriel. Promise me I won't end up in an unmarked grave.In the days to come, Gabriel and his team of operatives will find themselves in a deadly duel of nerve and wits with one of the world's most ruthless men: the murderous Russian oligarch and arms dealer Ivan Kharkov. It will take him from a quiet mews in London, to the shores of Lake Como, to the glittering streets of Geneva and Zurich, and, finally, to a heart-stopping climax in the snowbound birch forests of Russia. Faced with the prospect of losing the one thing he holds most dear, Gabriel will be tested in ways he never imagined possible. And his life will never be the same.", "title": "The Defector\n      \n          (Gabriel Allon #9)", "url": "http://www.goodreads.com/book/show/5739373-the-defector", "average": 4.29, "cover": "https://images.gr-assets.com/books/1442626527l/5739373.jpg", "reviews": 832, "authors": [{"url": "https://www.goodreads.com/author/show/29085.Daniel_Silva", "name": "Daniel Silva"}], "type": ["Thriller", "Fiction", "Mystery", "Spy Thriller"], "outlinks": ["http://www.goodreads.com/book/show/5739373-the-defector", "http://www.goodreads.com/book/show/7361496-the-defector", "http://www.goodreads.com/book/show/11261018-prebjeg", "http://www.goodreads.com/book/show/9627612-o-desertor", "http://www.goodreads.com/book/show/6573786-the-defector", "http://www.goodreads.com/book/show/9901219-the-defector", "http://www.goodreads.com/book/show/7975800-the-defector", "http://www.goodreads.com/book/show/93794.The_Kill_Artist", "http://www.goodreads.com/book/show/7096123-the-rembrandt-affair", "http://www.goodreads.com/book/show/9975779-portrait-of-a-spy", "http://www.goodreads.com/book/show/93795.The_English_Assassin", "http://www.goodreads.com/book/show/93793.The_Messenger", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/35005051-the-forgotten-girls", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}