{"ratings": 28840, "userreviews": [{"userName": "Michael", "userReviewDate": "Dec 25, 2011", "userURL": "http://www.goodreads.com/user/show/1036930-michael", "userReview": "Considering I recently reviewed GODS OF THE JUNGLE PLANET, it's really unfortunate that THIS is the worst book I've read in a long time. Real review is under construction, below this line. It ain't finished.+ + +I'm sure some of you who made the decision to read The Forest of Hands and Teeth will decide to go ahead and read the rest of the series. DON'T. No, really: you've seen all there is to see. If book one was an iMac, this sucker right here is an early model of Windows Vista. In fact, my goal in writing this review is to rescue you from having to read this book at all. Instead, I shall rewrite an abbreviated--and less emo--version of the book. Once you've read this review, you will know everything needed to skip over this book completely and just read book 3. . . which I've heard is slightly better than this one, although I won't be reading it to find out for sure. Act 1Scene 1: Old abandoned amusement parkProtagonista: Gee, guys, I'm not so sure it's a good idea to climb over the fence and go into the amusement park, since zombies are likely all over the place out there.Female Bee Eff Eff: Oh, don't be such a wuss! It's going to be lots and lots of fun! What possible bad things could happen by wandering around an abandoned amusement park that may or may not be populated with zombies! God, girl, live a little!Friend's Hot N Sexy Brother: (Looks at her with eyes that radiate warmth, and with pecs of chiseled marble, and other Edward Cullen-like descriptions) Yes, Protagonista. . . . I want you to come. To the amusement park. Protagonista: (aside) I wish I were able to just have fun like other people my age, and not worry about the swarms of pesky zombies that are moaning and groaning around the fences around my village. Maybe just this once, I'll just go and have fun without being such a wet blanket. After all, what bad things could possibly happen?(Everybody climbs over the fence and into the abandoned amusement park.)Female Friend: Isn't this fun? We're outside the safety of our village! Weee!Zombie: AAAAARRRGHGHGH!Random Red-Shirt: Arrgh, I've been bitten! Ack, now I'm a zombie, too! Aaaaaarrrrgh!Everybody else who is non-zombie: AAAAHH! Hot N Sexy Brother: (attacks the zombies) Oh, shoot! Looks like I've been bitten, too! Doesn't that just take the cake!Protagonista: I'm petrified with fear, and overwhelmed by swarms of internal dialogue! I don't know what to do!Hot/sexy: Run, and know that even though I never said anything about it until we were in this zombie-infested amusement park, I've loved you for my whole life, and you mean everything to me!Protagonista: Thanks a lot for telling me now, douchebag! But seriously, I love you too! (Runs back to the fence)Everybody else: We're stunned immobile! This is all so sudden and surprising! We just wanted to be out in zombie-infested territory and have some kicks! Who would've thought something like a zombie attack might happen?Scene II: Protagonista's Momma's LighthouseMomma: Basically, all of your friends were found roaming around outside of the safe zone last night. You wouldn't happen to know anything about that, would you?Protagonista: Gee, mom, I'm shocked. So, is that the kind of thing you, like, get in trouble for doing? Momma: Yes, sweetie. The ones that aren't already zombified are being deported. Sent to Gary, Indiana. Protagonista: (Stunned) Not Gary, Indiana! Why? Momma: Because the stupid thing they did could've gotten everyone in this entire village DEAD. So, we're a bit miffed about the whole thing.Protagonista: It's so unfair! Aside: and I feel immense internal guilt for running away last night, when I could've maybe helped out by staying outside of the fence and screaming while I watched my friends get eaten by zombies.Momma: By the way, I'm not your real mom. I found you when you were a tiny little tot, wandering around out in the wilderness, so I rescued you and took you in, and then raised you. But, we aren't related by blood. I've just taken care of you since you were a toddler.Protagonista: You're not my real mother, and you didn't tell me before now? I hate you! You're an evil, bad person!Momma: Are you taking your medicine, sweetie?Protagonista: (Runs away crying)Scene III: At the Holding Cell for Stupid TeenagersProtagonista: (Looks at her friends who aren't zombified. Is wrought with guilt.) Bee Eff Eff: Oh, Protagonista! Have you seen Hot n Sexy? Is he okay? He must be okay!Protagonista: I know, right? Life would be so unfair otherwise. I. . . uhh, I haven't seen him. He must. . . still be out in the zombie infested territory.Bee Eff Eff: You have to go and find him! He's my brother, and I love him, and before I get deported to Gary, I need to know if he's alright!Protagonista: So, you're willing to sentence me to nearly certain death, just in case he's hanging around outside of the protected zone and ISN'T a zombie?Bee Eff Eff: Yes.Protagonista: I'm on it. Scene IV: Out in the dangerous territories. A rundown old hut.Protag: Hotsex!H/S: Protag!Protag: Are you okay? Did you get bitten?H/S: Doi! See this wound on my arm that looks like teeth marks? Yes, I got bitten. And I could change at any time. That's why I'm out here beyond the safety of the village. Protag: But I cannot leave you! Can we have some steamy, passionate sex before you turn?(Just kidding. That didn't happen. . . as Carrie Ryan understands, teenagers consider kissing on the lips to be the extent of sexual recreation.)H/S: Will you hold my hand, Protagonista? Protag: (Getting hot and bothered) Sure!At this point, we skip ahead to the beginning of Act 2 where the real conflict begins: which of multiple hot boys Protagonista will choose to hold hands with. ACT 2Scene 1: Outside the safety of the village after having rescued BFFProtag: Hi, Hot n Sexy! I'm so glad you're immune to zombie attacks, because otherwise, you'd be trying to eat my brains!H/S: I know, right? I'm pretty glad about that, too! (Protag leans in to kiss him. H/S moves away, looking emotionally torn apart inside)H/S: Alas, we cannot. I may infect you with the zombie disease that's still in my blood. . . and anyway, I'm not like you anymore, Protag. I'm all alone in a hard and unforgiving world.Protag: Can we hold hands?H/S: No. That's how STDs happen. (Runs off into the woods in a state of emotional turmoil.)(Bald and Sexy enters the scene.)B/S: is everything alright, Protagonista? You look distraught. (His pectorals start flexing and unflexing as animal magnetism radiates from his being. The sheen on his bald head is quite arousing.)Protag: ASIDE: I can't decide whether I want to go with the boy I loved through most of my life who is now part-zombie, or if I want to go with the sexy boy who has rescued me from zombie attacks on multiple occasions, and who doesn't run away from me. Although he is involved in some strange zombie-related cult. Or, perhaps I'm most interested in the forbidden love I could share with my BFF. . . she's looking quite comely as well.(Just kidding. This world is purely hetero. These kids don't even experiment.)To be continued. . ."}, {"userName": "Kat Kennedy", "userReviewDate": "Dec 15, 2010", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "Gabry, the main character of this story, is lacking in the crazy-ass psycho department that her mother so nicely managed during her debut in The Forest of Hands and Teeth.This story is about self-discovery. With Zombies.Which actually makes a lot of sense.In what I can only assume is stupidity gone rampant amongst teens, Gabry is convinced to go out past their safe border and into a closed and derelict theme park.It isn't a spoiler when I tell you that things quickly turn to shit because, really, you can do the maths.A group of stupid teens + possible zombie infested theme park = things quickly turning to shit.Very simple maths and the authors of the horror genre have taken such delight in viciously murdering poorly behaving teenagers that this is nothing new.After this incident, Gabry's life falls apart piece by piece until the only thing that can fix it is a zombie adventure!I pity anyone caught in a zombie uprising with me. I consider that sign fair warning that if there are zombies around, I am not above using your soft, gooey flesh to slow them down and aid my escape!Which was rather disappointing because, in the first novel, people seemed to share this philosophy.Yet this group of zombie victims are unfortunately kind, brave and willing to face a zombie horde to protect those that they love. It's annoying. It makes for a surprisingly goreless zombie novel.Not ONCE does a zombie baby get tossed out a third story window.What are you doing to us Ryan? How am I supposed to ENJOY a novel when I'm pitying the damn antagonist and its mindless horde?Well, actually, I still managed to really enjoy this novel but still...More brains, Ryan!"}, {"userName": "Penny", "userReviewDate": "Feb 22, 2010", "userURL": "http://www.goodreads.com/user/show/679025-penny", "userReview": "I'm torn with the rating I gave this book. It deserves more than three stars but I wouldn't say I 'really liked it'. So, even though I like this book more than I like it's companion, The Forest of Hands and Teeth, I gave it the same amount of stars. Quick review: In The Forest of Hands and Teeth we were introduced to Mary, a not entirely likable teenage girl living in a remote village reminiscent of the village in M. Night Shyamalan's 'The Village'. Mary's village is fenced off from the surrounding forest which is full of zombies (referred to as the unconsecrated). Mary desires, more than anything, to venture outside the fenced-in village to find her way to the ocean, even though she's been told her whole life the ocean no longer exists. At the end of The Forest of Hands and Teeth Mary receives her heart's desire: she sees the ocean, and that is where her story ends. The Dead-Tossed Waves is told by Mary's teenage daughter, Gabry. This is Gabry's story. Gabry (Gabrielle) is quite unlike her mother. Raised in Vista, the seaside city Mary discovered at the end of The Forest of Hands and Teeth, she has no desire to venture outside the city walls where the Mudo--unconsecrated!--dwell. In the first chapter Gabry is invited by her best friend's cute older brother, Catcher, to sneak past the barriers to the abandoned amusement park, which, while still technically fenced in, is forbidden since those fences are no longer maintained or guarded. It is only the lure of Catcher, his flirtatious promise to protect her, that finally gets Gabry to do what she fears most: leave the relative safety of Vista.It is in the amusement park, as Gabry receives her first kiss, that things go horribly wrong (who'd have guessed??? I kid, I kid). A Breaker--an über-mudo, if you will--attacks the group Gabry is with. Long story short: their little adventure outside the city walls does not end well.Because of the commotion caused by the attack they know it is only a matter of time before the city militia arrives. So Catcher insists Gabry flee the scene because those caught outside the city walls will be punished severely. Before she leaves, Gabry tries to round-up Cira, Catcher's sister, to go back with her, but is unsuccessful.Gabry returns to the city by herself, a decision with which struggles throughout the rest of this novel. She's riddled with guilt that she was unable to stop everyone from going to the amusement park in the first place. Gabry hates that, unlike Cira and the rest of her friends, she wasn't caught.Because she's the only one who wasn't caught she's obligated to search for Catcher, at Cira's request. The only problem is, Catcher may have been bitten by a mudo. What's worse, he's hiding somewhere outside the city walls. So Gabry ventures outside the walls once again, attacked by more mudo, and saved by a young man, named Elias, who is clearly not from her village. And this is when the adventure really begins. Overall, this is a pretty good book. I think it's much better than The Forest of Hands and Teeth, mainly because I don't mind the protagonist; she's not selfish like her mother was at her age. Also I think The Dead-Tossed Waves is written better than The Forest of Hands and Teeth. Before I go on, I need to mention that I'm not a fan of the love triangle in this book. It's not that I don't luuuurve me a good love triangle, because I do. It's just the fact that Carrie Ryan already did the whole love triangle thing, and not very well might I add (IMHO, Mary was undeserving of such attention so the love-triangle in The Forest of Hands and Teeth felt forced. And in the end it turns out the triangle was completely unnecessary). I feel Carrie Ryan should have gone a different direction this time around--not everybody has two equally good-looking guys vying for their attention. I feel Carrie Ryan, along with a lot of authors these days, are relying on the love triangle a little too much. I think Carrie Ryan cheated herself, her story, and the readers, by focusing too much attention on the love story.Example: Gabry spends too much time being torn up over the whole Catcher or Elias question. Especially when, as far as I'm concerned, her preference is obvious. I wish Gabry had made a decision early on, sparing everyone involved (including the readers), and spent more time thinking about more important things. Such as the many interesting ethical questions raised by various characters in this book (What is the difference between existing and surviving? Is there a difference? How are the infected (mudo/unconsecrated) different from the non-infected? When a body Returns, is part of their former self--their soul--still there, just trapped inside?). There are other things I didn't necessarily like but I can't bring them up without giving away too much. Basically, what I'm trying to say is, while I do quite like this book (and I'm planning to read the next one) I'm left feeling a little disappointed. Carrie Ryan could have done so much more with this storyline, the deeper elements are present but not explored. Which is why I couldn't give this book four stars. (I do want to give Carrie Ryan props for writing zombie books targeted specifically at females. If it weren't for her I wouldn't have picked up a zombie book, ever. Which, in retrospect, would have been quite unfortunate as it is a genre I quite enjoy.) Side note: Also, I think Carrie Ryan could have should have released The Dead-Tossed Waves first and eventually released The Forest of Hands and Teeth as a prequel. Why? Because The Forest of Hands and Teeth does not actually add to this story, seeing as Gabry spends the majority of this novel (mostly) ignorant of her mother's past. Sure, we the readers are able to make the connections, but that just takes away from the reading experience--we already know what Gabry doesn't. It's sort of infuriating. Plus, the way in which this book ends I'm assuming the next book, The Dark and Hollow Places, will start where this one leaves off; Gabry still telling her story. Which is just another reason why it doesn't make sense that The Forest of Hands and Teeth was released first."}, {"userName": "Kiki", "userReviewDate": "Aug 12, 2011", "userURL": "http://www.goodreads.com/user/show/4074594-kiki", "userReview": ""}, {"userName": "Morgan F", "userReviewDate": "Mar 23, 2010", "userURL": "http://www.goodreads.com/user/show/2941288-morgan-f", "userReview": "Four or five? FOUR OR FIVE? FOUR OR FIVE? Let's see how I'm feeling by the end of the review. Okay, this book kinda takes place where the last one left off. Give or take twenty to thirty years. Instead of the lovely Mary, the narrator this time is Mary's daughter, Gabry. Now, I understand most of you are like \"OMG, who's the father?\" I know I was. But I can't say for threat of being flagged as a spoiler. Anyway, Gabry has a very different upbringing from her mother. She lives in a lighthouse on the outskirts of a little town called Vista. She has a best friend and a crush on her best friend's brother. But most of all, she grows up safe and secure, without all that moaning in the background. But then, of course, it all goes wrong......dun dun DUN. Gabry and her friends take a little midnight hike over the Barrier and zombie hell breaks loose. The night ends with death, betrayals, and with half of her generation gone or imprisoned, life will never be the same for poor, sweet Gabry. I have to say, this was a hell of a sequel. I thought it was actually much better than The Forest of Hands and Teeth aaaaaand all my questions were answered (well, about 88%). There were even some guest appearances and moments when I felt smarter than the narrator because I knew what something was and she didn't. What more can I gall ask for?The writing was very much the same. It was beautiful in places, mostly sad, but hope shined through. I managed to read this in a period of 24 hours, which is no small feat when you have school and homework and yada yada yada. My point is that it's compelling and unputdownable (which is officially a word). The world that Ryan sets up is just incredible, honestly. I find it completely convincing. It's mysterious and dark and scary. Just normal life with fewer good parts....and it has zombies. I found Gabry more likable than her predecessor, but I don't feel fair comparing the two because they have totally different personalities. Once again, the weakest part for me was the love triangle. I'm sick of those things. I always choose the wrong guy, then have a grudge against the author for having different taste in men. But this time I think I routing for the right guy.....I think. I have to wait and see if he dies first. Even though Gabry bounced back and forth between the two contestants, she never seemed ho-ish. Just confused. But once again I could never tell if the couple was kissing. Does that make me weird, or does anyone else have that problem with these books? I don't know, there would be pages of getting close and comfy with one of her man-friends then they would get pissed or something, storm off, and Gabry would try to relive their \"almost-kiss\". And I would be like \"Man, I though for SURE they were lipsmacking that time!\"Overall, I really liked this book. And if you want this book to be a stand-alone, go ahead. This book could do well without it's predecessor, although it's cliffhanger ending may be too much for someone with poor will power (aka me). I recommend this book to everyone, except those who like fairy-tale endings, \"perfect\" narrators, or can't handle flesh-eating corpses. I've decided to go with five stars."}, {"userName": "⋟Kimari⋞", "userReviewDate": "Sep 20, 2010", "userURL": "http://www.goodreads.com/user/show/3555205-kimari", "userReview": "[At the end Gabry uses Catcher to escape, knowing he will protect her despite her declaration of love to another, because he adores her. (hide spoiler)]"}, {"userName": "Becky", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "[So, her barely-barely-barely insinuated that he might like her as more than a friend and rubbed lips together one effing time \"boyfriend\" gets infected. So this girl, who has been RAISED in a world infested by zombies, taught that they are brain eating monsters and that they should be killed on sight if the one doing the seeing doesn't wanna get ate, this girl who saw one friend get attacked and had the thought \"She's already dead.\", then proceeds to hold out hope that boyfriend'll be fine, and then risks herself TWICE in the half of the book that I read to go see him and cuddle with his almost-zombie self, and will do anything to save him. But then, when she finds that there are people revere zombies as part of their Resurrection Religion, and fears that they might take her cherished zombie boyfriend in as an object of worship, or worse a renegade worshiper (who is a boy, and therefore the 3rd in this love triangle of What the fuck?!) might kill him, OH SNAP! Not cool. Because... he's DIFFERENT. LOVE will win out and he won't become a mindless zombie and try to eat her face when she tries to kiss him. Oh no, not CATCHER, the love of her life. Fuck. For real? There is a Stupid girl + Boy + Almost-Zombie love triangle. And it's not even FUNNY. If it was funny, I wouldn't be spewing ragehate all over this book right now. But it's not funny. It's stupid. And irritating and annoying and all the other ings you can supply that insinuate I don't like this. (hide spoiler)]"}, {"userName": "Arlene", "userReviewDate": "May 29, 2009", "userURL": "http://www.goodreads.com/user/show/1746727-arlene", "userReview": "Dead Tossed Waves is a great example where the sequel outshines the first installment… by far! I had no intention of reading this book as The Forrest of Hands and Teeth was a disappointment for me at least. But after reading continuous rave reviews and trusting my fellow avid readers that this book was a hit, I gave it a try and it was well worth it IMHO. I really enjoyed this story so much more than the first book, as I feel Carrie Ryan truly displayed growth in her writing abilities, as evidence by the captivating plot she devised, the flawed yet appealing characters she developed, and the intriguing setting she used as a backdrop. It all blended very well and kept me riveted the entire time.I liked all of the characters that made up this adventure including Gabry, Catcher, Cira, and Elias, who I felt were strong, complex players in this story that kept the action going at a steady pace. It was interesting to learn about the Soulers and the additional back-story of the Return. The action was continuous, but I never felt it was too drawn out. Overall, this book delivered in areas I felt The Forrest of Hands and Teeth didn't.I'm removing one star for some insignificant details that really didn't distract me too much, but I wish could have either been eliminated, downplayed or explained. One, I would have liked to see Gabry not go back and forth so much between her feelings for Catcher and Elias, but considering the gamut of emotions and struggle for survival, I guess I can understand the confusion that naturally set in. I'm still curious as to what caused the virus and where it started. We did receive more back-story, but I still have some questions. My other question is why did Catcher get bit in the first place if the Mudos didn't sense his presence since he was immune to the virus? That confused me a bit, but not enough to detract from what was happening in the book.Other than that, though, it was a great story! I definitely won't hesitate to read other books by this author in the future."}, {"userName": "Shanon", "userReviewDate": "Nov 08, 2009", "userURL": "http://www.goodreads.com/user/show/1795513-shanon", "userReview": "I had some real issues with The Forest of Hands and Teeth mostly revolving around my extreme dislike of the main character. Usually disliking a main character is a deal-breaker for me and it is lucky for me to even finish the book let alone read a sequel. Luckily, the world building in The Forest of Hands and Teeth was amazing. I wanted to learn more about how civilization came to such a state, what was going on with the secretive sisterhood and everything else I could about the world Carrie Ryan created. I was hooked by the world and not the characters.Dead Tossed Waves is about Mary’s daughter, Gabry. I found her to be much more likable than Mary, though not necessarily a lovable character. She came across as whiny at times and I would be sorely tempted to reach through my book and slap her if it was only possible. There is much more information about the zombies (aka: Mudo) as well as the fate of Mary’s home village, Gabry’s history and the sisterhood. I am even more intrigued by this world. I will be eagerly awaiting the next book in this series."}, {"userName": "Bethany", "userReviewDate": "Apr 27, 2010", "userURL": "http://www.goodreads.com/user/show/3305448-bethany", "userReview": "Wow. You never think that a sequel will equal its predecessor, but Carrie Ryan has managed to do it...and I even liked it better. The Forest of Hands and Teeth blew me away with its creative setting and premise and with its strong female lead, but when I got hold of The Dead-Tossed Waves I could NOT put it down. Told from the point of view of Mary's daughter, Gabry, its about a girl who is forced to step outside of her \"safe\" world and learn what courage is. In contrast to her mother, Mary, Gabry is timid and cautious about the world around her. Watching her grow, develop, and rise to the challenges that she met with throughout her story was amazing. And the love triangle with her initial first love, Catcher, and her mysterious rescuer (gosh, I just love a good rescue), Elias, was beautifully written. Great example of how to write a love triangle without making your reader hate someone...I can honestly say I love both Catcher AND Elias (although...I'm rooting for Elias. I can't lie.) Absolutely cannot wait for book three. AND...having met Ms. Carrie Ryan in person, I can honestly say that she is as cool as her books."}, {"userName": "Nikoleta", "userReviewDate": "Sep 15, 2015", "userURL": "http://www.goodreads.com/user/show/13362307-nikoleta", "userReview": "Καταπληκτικό! Δεν είναι απλώς το ότι έχει δράση και γρήγορη πλοκή, αλλά έχει και πολύ μυστήριο, το οποίο ξετυλίγει μια απίθανη ιστορία. Ο τρόπος με τον οποίο αυτό το μυστήριο περιπλέκει τα πάντα, όσα συνδέονται, το παρελθόν και το παρόν. Και φυσικά είναι και τα τόσα συναισθήματα. Η ανασφάλεια, ο φόβος, οι τύψεις, η ανάγκη και η ελπίδα. Είναι ο τρόπος που όλα αυτά τα αφηγείται η Ryan…Άμα αυτή η σειρά σας περνάει απαρατήρητη και αδιάφορη προτείνω να το ξανασκεφτείτε και φυσικά να την ξεκινήσετε. Αξίζει!"}, {"userName": "Yiota Misiou", "userReviewDate": "May 10, 2016", "userURL": "http://www.goodreads.com/user/show/16785842-yiota-misiou", "userReview": "\" Ίσως όμως είναι η ώρα να καταλάβουμε ότι δεν χρειάζεται να ζούμε μέσα στα όρια που έχουμε θέσει εμείς οι ίδιοι. Ίσως πρέπει να σπρώξουμε αυτά τα όρια. Να διεκδικήσουμε μέρος αυτού που χάθηκε. Και να φτιάξουμε έναν καινούριο κόσμο. \""}, {"userName": "Y", "userReviewDate": "Sep 03, 2011", "userURL": "http://www.goodreads.com/user/show/3390962-y", "userReview": "FINAL EDIT: Everything after the line below this is pretty much my \"play-by-play\" rantings as I listened to the book. What's right here is the condensed version of my thoughts, having finally finished it.The Dead-Tossed Waves is the sequel to The Forest of Hands and Teeth, a book I found decently entertaining, mainly due to its world-building. Picking up where the first book left off, TD-TW scratches most of the world-building, having already been largely established, for vast, vast amounts of internal monologuing.Ryan attempts to make our heroine, Gabry, a sympathetic character by making her quite flawed. Unfortunately, she decides to do so by having Gabry leap head-first over the Victoria Falls of character flaws: she's nothing BUT flaws. There are virtually no likable qualities to the girl, and this affront is further compounded by the fact that no one calls her out on her wishy-washy cowardliness; in fact, they tend to go out of their way all to support her. Gabry spends a fair amount of the book pining over one boy, then when it turns out he can't be with her if he wants her safe, she pities herself utterly and completely and quickly switches camps to be with the other romantic interest option. Later, she also forces a self-sacrificing boy to deal with one of his greatest fears in order to save herself. This girl is as selfish as she is dull. Frankly, Catcher's entire ordeal is far more interesting and sympathetic. The book should've been about him.We're forced to sit through similar situations over and over again, including events that are echoing what already occurred in the first volume. This could've been done well, but considering things are repeated far too often already, it just feels like overkill.Speaking of repetitions, the book needs serious editing. Some words are used far too often, \"scream\" being one of them. Okay, we know you're surrounded by zombies and frightened, but nobody, particularly in this day and age, especially female readers, appreciates a heroine who spends all her time exercising her vocal cords in such a manner. It's not just literally; it shows up metaphorically too: apparently someone's freckles scream against her pale skin. Yeah. Near the end, someone \"finds/loses purchase\" three times in one chapter. Why can't they simply \"lose footing\" once in a while?Also, would you like to see how much padding can be done to a book by having numerous, numerous inactions instead of characters actually, oh, I don't know, doing things? Well, here is that book, and you're my guest to count how many times within it Gabry \"wants to do/not do something, but she doesn't/can't\". I'll bet you it isn't used fewer than 30 times.The book is a mess that could've been a little better with copious amounts of editing, better fleshed-out and more sympathetic characters, and more original ideas instead of constant repetition._______Listening now, though the narrator's voice is grating on my nerves. I know they want to go with someone who actually sounds like a teenage girl, but she sounds far too serious \"OHMIGOD TEENAGE DRAMARAMA ANGST\". The narrator for the first book wasn't too great at emoting, but she sounded like a young woman without being overly obnoxious about it.EDIT 1: So far this is boring the hell out of me. At first it seems like it's going to be a prequel, but then it becomes obvious this takes place maybe a couple of decades after the first book. Since a lot of the details of the world were already established in the first book, there's very little of that here other than to show how this community is slightly different from that of Mary's in the first book. That also means that the book is mainly focusing on the characters and the situations instead of the worldbuilding I enjoyed in the first book.I'm not that far into it yet, a little shy of 20% complete. And like the first book, the characters are just as dull here, since instead of bothering to take much time to flesh them out, it's been mainly just Gabry's whining. Oh, I guess Gabry gets some fleshing out. While Mary was just kind of there, we at least get to be constantly hammered by how much of a whiny, selfish coward Gabry is. Not that that's necessarily a bad thing, because how that character overcomes all these negative traits to become a better person is usually something to look forward to, but looking at some other reviews here....doesn't look like that's at all what Gabry does. Anyway, you kind of feel like the whole zombie thing is kind of a joke of no real importance anymore (hey, it's just the status quo now) when the revelation of adopted!baby has such an earth-shattering effect on the main character. I mean, sure. I'm not adopted, so I can't say anything with my own experiences, but I'm sure reactions for actual adoptees has run the full gamut of emotions. However...just from what little we've seen so far, Gabry feels like too much of a wet rag of a character to have such a violent reaction to it. \"It was selfish of you!\"? \"I don't think I can ever forgive you!\"? Where was all this passion and conviction when you should've been telling your friends not to be idiots and go wandering into an infested zone? How about showing some actual outrage to their sentencing, instead of just going \"Oh noez, how awful! I feel so guilty, but I won't actually do anything about it!\" inside of your head over and over again?I guess Ryan just wanted to give Gabry something more to feel sorry about herself for...but really? Adoption drama in a zombie apocalypse setting? I feel that there were other options that could have been taken here. Original though it may be (I don't really know; I don't consume a whole lot of zombie fiction), it just feels like yet another thing to minimize the impact of the whole zombie setting.The first book felt like it had promise that it just wasn't quite able to live up to, but this one feels like it's dull and drudging along from the very start. I'll finish it out anyway, but I'll admit that I'll be very surprised if I end up being pleasantly surprised.EDIT 2: All Gabry ever does is pity herself or be angry with other people when they tell her things she doesn't want to hear. And she complains about the same things over, and over, and over, and OVER, and over, and over, and \nOVER\n again. Her entire personality is built on her cowardice and her blaming others and her internal monologueing which, again, is NEVER ABOUT ANYTHING NEW. She just repeats her same boring problems over and over again, especially how the adoption revelation has CHANGED EVERYTHING ABOUT HER, EVERYTHING SHE EVER KNEW, EVERYTHING IS A \nLIE\n NOW OMG EXISTENTIAL ANGSSSSSSSTTTT. Apparently she REALLY looked up to Mary, although we really haven't seen anything to indicate that (before she learned the truth, she was busy being a typical teenager, embarrassed because her mother isn't \"normal like everyone else\") until after the reveal, and now everything that she thought was similar about themselves is ALL A LIE because blood is the ONLY THING that ever affects someone; has nothing to do with how they're raised, no siree bob, but since we're getting all these \"I thought we had similar this or that and I drew strength from that BUT NOW IT'S A LIE\" after the fact, with no indications that Gabry honestly thought that when she believed Mary was her real mother, it all sounds fake to my ears, like now she's just looking for crap to continue to fuel her angst. Maybe she really hates herself, her cowardice, and was hoping that Mary was an image of something she could strive for (which she totally still can, just saying), but considering how she's now blaming Mary for anything, wondering about her \"poor, REAL mother\" whose child (starving and wandering around alone in the forest) never came back to her, I don't really know if that sounds like someone with a lot of self-loathing. You'd think she'd spend more time blaming, oh say, herself, instead of everyone ELSE.Then, as soon as Mary decides to go back into the forest, Gabry is \"OMG, you're abandoning me?\" (This is right after Mary tells her to come with her.) I don't know; this girl is just so needy, but so selfish and self-pitying, it's like she has no emotional maturity at all. Things are always happening \"too fast\" for Gabry to apparently understand anything. Okay, well, it's not like everything that's happened has occurred within five minutes or so; you've had plenty of time to think things through and sort things out. ...No, please, PLEASE try to sort things out. It'd give the readers something new to read other than your same complaints over and over again. Also, she's always thinking of things she wants to say or do to console anyone else: \"I want to tell him it's okay...but I can't.\" \"I want to tell her I forgive her...but I CAN'T.\" AGAIN. Over and over. Over, and over, and over, and OVER, and over, and over, and \nOVER\n again. AGAIN. I want to but I can't. Make it a drinking game. Try it. You'll be piss-ass drunk.Okay, so Ryan has created this world full of zombies that she really likes, so much so that she's written a trilogy and (afaik) at least two short stories also contained within this universe. That's not a bad thing, this world-building and expanding upon it. The problem is that while new tidbits of the world are exposed every now and then, her characters and her dialog are not up to par. The characters never do anything NEW; we're subjected to same crap every few pages and the same, ridiculously boring dialogs again and again because....I don't know why. It feels like she doesn't care to put in as much effort for her characters as she does the setting. Driving the same crap through over and over again (kind of like what I'm doing here!) isn't making things seem more \"desperate\" or showing \"how important this feeling/thought/action/non-action is to this character by having them do NOTHING ELSE\", it's making it all extremely tedious. Stop it.In the very beginning, I thought Gabry was one of the few teens with an iota of sense, since she was the only one who actually thought GOING OUTSIDE THE ZOMBIE BARRIER was a BAD IDEA, but now she's all insisting that she come back for Catcher, zombies be damned, Catcher turning be damned. And all because of TWU WUV? Ugh, again, like with Mary and Travis, Catcher is very, very dull. He has virtually no personality outside of \"decent guy\" and \"crush on Gabry\". Their love has apparently been budding for a while now, but again none of that is actually shown and it's all just \"I LOVE LOVE LOVE HIM\". I feel zero chemistry between them, they simply feel like every single obligatory crammed-in fictional couple ever. Why does she love him so much? I don't know! Why does he love her so much? Even more of a mystery, since I find the girl completely unlikeable myself! Either way, very little has been done to convince me that Gabry is so completely willing to throw common sense to the wind in order to help Catcher. The fact that she's too cowardly to face her punishment with the rest of the teens and is only helping so \"they won't tell\" is the only believable reason I've seen so far. Virtually nothing has been shown to me for me to think Gabry and Catcher have such a strong bond; it's requiring more suspension of disbelief than the whole zombie apocalypse is.All in all, my BIGGEST problem with the book is that it's everyday teenage angst set in a world with zombies that takes itself UTTERLY SERIOUSLY. It doesn't have to be a \"zombie-comedy\" or anything, but it wouldn't kill the book to have at least a couple laugh-out-loud situations (unintentional LOL situations, like laughing at how people this dumb managed to survive this long doesn't count), or at least one character who makes wry comments now and then. As it is, absolutely no one (so far) has a smidge of a sense of humor; everyone is too busy being SERIOUS SERIOUS ANGST SERIOUS.Conversely, the overtly serious internal monologues of Gabry (the majority of the book thus far) tend to be too overblown (and nonstop) with absolutely no sublety that I don't feel any emotion whatsoever (well, besides extreme aggravation) toward any of these characters or their situations. I'm not feeling any heartstrings being tugged here, sorry to say. EDIT 3: Things become more interesting once reaching the midway point, but as usual everything seems to be \"in a blur\" for Gabry, and she does almost nothing by thinking; everything is fueled by emotion. The word \"scream\" is used far too often in this book. I know this is about zombies, but most of the time it's used in places that have nothing to do with zombies closing in on Gabry. We have a female lead who screams all the time and runs not on brains but feelings. Great.\"I want to ______, but...\" has seriously not let up for one second. It's honestly starting to piss me off how often it pops up. This is bad writing and even worse editing. I don't care what you WANT to do. How about actually DOING them sometimes? So far Gabry's main personality point is still that she's amazingly wishy-washy. (Yet she has no problems beating up Elias and taking out her rage on him half the time.)EDIT 4: Gabry has eased up a little on being incredibly annoying, though that's probably due to Elias, Catcher, and Cira being with her, and so at least some of the book is devoted to conversations with them and what they have to say on things (never anything terribly interesting, but...) so we aren't constantly being bombarded with Gabry's inner monologues about how awful everything is right now.It pisses me off that she's still insistent on rarely ever using her intellect for anything, only focusing on the emotional side of her problems. Ooh, so she figured out the code of Roman numerals her mother left behind; her mother already did that in the first book. Can't we have something new? How about pausing and using that noggin for something else sometimes? \"Why won't Catcher kiss me? Do you hate me? :(\" \"Uh, I've got strains of ZOMBIE! in my bloodstream now?\" \"Ohhhhhhh...\"All these books written largely for adolescent girls nowadays, almost 100% written by women themselves, and all the female leads are too busy being emotional about everything and In Love (almost always in the form of a triangle), because Being In Love is always the most important thing to a woman, right? I'm not saying that there should never be any romance in stories, ever (I probably wouldn't mind too much myself, but that's just me), but why does it have to seem like such a crime for a female protag to actually have strong aspirations beyond that boy she's been crushing on for all this time? Why not write a book about a girl who wants to join the Recruiters and the difficulties she has to go through for that? How about, instead of a couple of teenagers who only dream about going to the Dark City (only for things to take an ugly turn), they actually do set out for it and uncover certain truths about this world they live in? Why not a book from Cira's point of view? She seems slightly more interesting than Gabry. As it is, Gabry's main focus is all about Catcher, occasionally switching to Elias, and the only reason she ever does ANYTHING is because other situations currently occurring are forcing her from one place to another. She keeps talking about how she wants to be more like her mother, but she rarely ever does anything in this vein, mostly taking time out to talk to herself about how things aren't fair, or how everything is futile, or how she's too frightened, or something equally boring.Finally, my arch nemesis, \"I want to, but I can't/don't\" is still around in full force. I've accepted that it's immortal, and I almost have the sick urge to listen to the book a second time in order to keep a count on how many times that phrase is used.EDIT 5: *facepalm edition* \"It's not fair; I want to fall into despair like Cira; why do I have to be the only one that's strong in the group; it's not a position I'm used to or know how to handle?\"I don't even know what to say to that. Just Gabry being selfish as usual, though with some particularly bizarre delusions of grandeur (\"why do I have to be the only one that's strong?\" Since when?)She says this because Cira's busy having a mental breakdown (hi, we already saw something like this in Cass in the previous book. And again, it's a woman that this is happening to) and Gabry insists on going back to Vista, because apparently that's the \"strong\" thing to do, since Cira is sick, physically and mentally and they can't take care of her out in the forest. This is completely without regard with what'll likely happen to them all if they return, considering they instigated a zombie breach (albeit by harmless zombies) and set free all the teens that their rather tyrannical little community decided to punish harshly, on top of the fact that Gabry is known to have killed a man while she was there. So, they take Cira back and get her cured, then what? The recruiters will use Catcher as a slave and likely hold Cira as hostage for the rest of her life so that he'll continue to do their bidding (yeah, I totally cannot see how this might cause Cira to attempt suicide again or anything), Elias is an outsider so who knows what they'll do to him, and why in the hell will they spare a murderer, much less the daughter of someone the council didn't seem to particularly trust all that much to begin with? Oh yeah, this all sounds like a GREAT idea, and because Elias and Catcher aren't agreeing with her idea, they're being \"too weak\" now? She thinks she'll actually be doing Cira a favor? There you go folks; the result of when Gabry tries to think. EDIT 6: WHY is the writing so contradictory? \"I want to show him he's not a monster\", then, maybe a page later \"He's like a horrifying monster\". Seriously, did this script ever actually get looked at by an editor?Also: \"It's not that Catcher can't be with me, it's that he doesn't want to be with me.\" Getting close to the end and we're STILL dealing with this selfish bullshit from Gabry? HE DOESN'T WANT TO TAKE A CHANCE AND INFECT YOU, FFS. GET IT THROUGH YOUR HEAD. Funny enough, everything actually already IS about her, yet she always twists the situation in her head so that she can get max self-pity points. You had some kind of goddamned epiphany a few chapters previous to this, WHY ARE YOU STILL SHOWING NO CHARACTER GROWTH?EDIT 7: Almost done. And now we're reusing ideas (again). This whole \"you must go on, leave me, etc.\" situation was already done...more than once, actually, in the very beginning, and with Cira. Including the laughable way Elias gets himself hurt, this is yet more pointless melodrama that we have to sit through for anything to MOVE FORWARD in this damn story. Also, can Gabry ever say anything that ISN'T whiny once in a while? PLEEEEEAAAASE? Frankly, out of everything that's happened in this book, I think CATCHER is the one who's consistently gotten the short end of the stick, and yet it's THE GABRY SHOW where she moans nonstop (and we're the lucky ones who get to listen to it) and blames everything on herself (as if her simple nonactions are really that important in the grand scale of the universe), yet everyone goes out of their way to worry about her or make sure she's taken care of with never a reprimand or someone telling her it's time for her to fucking grow up. Obviously I'm just not sensitive enough to give a damn about her problems, but honestly, I would've chucked her over the fence to the zombies near the beginning of the book."}, {"userName": "Rhiannon Frater", "userReviewDate": "Mar 17, 2010", "userURL": "http://www.goodreads.com/user/show/1805401-rhiannon-frater", "userReview": "I had mixed feelings upon finishing the Forest of Hands and Teeth. I loved the world building, the mythos and the plot, but had trouble liking the protagonist. But I did enjoy the book overall and had no hesitation ordering the second novel in the series.The second book features Mary's daughter, Gabry. Gabry is definitely a more sympathetic character than her mother and I enjoyed her journey a lot more than that of her mother. I was able to connect with the character and empathize with her pathos in a way I never could with Mary.The world of the dead is fleshed out even more than in the first book and it is an intriguing world at that! There are good action scenes, excellent character development and spectacular world-building. I am thoroughly intrigued by the world the author has created. I enjoyed this book a lot more than the first one. The weaknesses of the first one are absent in the second.Since both books are written in first person and from the perspective of a teenage girl, I'm not sure this book is for everyone. As an adult woman, I often had to think back to my own teenage years and the emotions and uncertainty that haunted them in order to connect with Gabry.I definitely think the books add to the zombie genre and I look forward to her next novel."}, {"userName": "Sarah MacLean", "userReviewDate": "Jun 18, 2009", "userURL": "http://www.goodreads.com/user/show/216457-sarah-maclean", "userReview": "The Dead-Tossed Waves is even more compelling than the Forest of Hands & Teeth. I cannot WAIT for book three!"}, {"userName": "Yasmary", "userReviewDate": "Mar 22, 2010", "userURL": "http://www.goodreads.com/user/show/2699386-yasmary", "userReview": "So the book is about running, like the first one. And like the first one, Gabry (Mary's daughter), is also stuck between two men. Unlike Mary though, she finally makes up her mind. The problem is that it takes the whole book to get there, and up until the last 50 pages, the book was so slow it was unbearable. There's too much talking about how the world goes too fast, and things changed too fast, and how she wants to go back. She is completely incapable to see reality in front of her. She has no backbone, no guts, and spends the whole time whining. It felt like nothing was actually happening. The characters needed so much growing up to do. Elias & Catcher make sense, they had real motives and reasons for what they did. Gabry on the other hand didn't. All I felt was fear and panic. Which after about 20 pages, I grew to hate.Also, why is everyone so afraid of The Recruiters? Is it really that badly to work for what could be the military? They *are* after all making the world better for you. What I did like, was the world created. The idea that so much knowledge has been lost, and how to move forward from that. The idea of hiding a village in the forest where nobody would find it. The premise is so cool. The characters, not so much. Unlike the first book, where you could sense the desperation, the not knowing if they're the last ones to survive, if they're going to make it; the need to push and find something else... this book left me wanting they stayed put, and grew some balls and accepted the reality of the world they lived in."}, {"userName": "Teresa Cantrell", "userReviewDate": "Aug 26, 2016", "userURL": "http://www.goodreads.com/user/show/40032099-teresa-cantrell", "userReview": "So I started this before I went to bed last night and of course stayed up ALL night to finish it. I wound up sitting in my bed going through half a roll of TP! Now I have a wonderful headache and feel like I have a hangover this morning because my ass is way to old for that. My kids are appreciating my grumpiness too:) I don't even know how to rate it. It just about took me out and I'm not even sure why? I must be having some woman issues or some shit. All I can say is DANG"}, {"userName": "Donalyn", "userReviewDate": "May 31, 2009", "userURL": "http://www.goodreads.com/user/show/829035-donalyn", "userReview": "Gabry, Mary's daughter, fears life and love. She seems to blame herself for everything that happens, including the poor choices of the other characters. I have not read so much whining and self-loathing since Bella Swan. This companion to The Forest of Hands and Teeth didn't advance the story of life after the Return and left little hope for the characters' futures.Still, Carrie Ryan's writing is beautiful with moments of tenderness, longing, and tragedy."}, {"userName": "Michael", "userReviewDate": "May 09, 2010", "userURL": "http://www.goodreads.com/user/show/862743-michael", "userReview": "Pretty much a letdown. I really enjoyed the companion novel, \"The Forest of Hands and Teeth,\" and I figured that this story would add to the world created in that book. Unfortunately, it didn't; and I even feel like the original story's effect is diminished because of this books incessant attempt at playing it safe. Not only did this book not add to the post-Return mythos, it didn't add anything to the pre-Return storyline either. There is a lot of mystery left to explore at the end of the first book regarding the causes of the Return, and this book does nothing to shed any light on those tantalizing details that are missing.Instead, we are thrust into the same exact world as before, forced to follow a nearly identical plot structure to \"The Forest of Hands and Teeth,\" minus the tension of the unknown. Now that we know that other factions exist in this world (and in fact, there are large cities with an overarching governing body), the tension of the novel is erased. We know that there are survivors. We know that these characters aren't stranded, alone, in a post-apocalyptic wasteland. Now, armed with the knowledge that there are militaries and cities and thousands of people still alive, our characters look like pathetic, idiotic people who can't get organized enough to kill off the shambling masses of Unconsecrated. I guess, in the future, a coordinated effort to exterminate the Unconsecrated is too far-fetched. Or maybe it's just a technicality that Ryan chose to leave out of her narrative because explaining it away would have been too inconvenient. Our protagonist is Gabry, the daughter of Mary (the main character of the original novel). Mary, in a plot device that completely undermines her entire dramatic character arc from the first novel, leaves Gabry to go back where she feels she belongs: the forest. Gabry, meanwhile, decides to go into the forest because she ventured beyond the city gates one night with friends, got caught, and now her friends are being forced into army servitude. The forest, in her mind, is her friends only escape from army recruitment.What follows is nearly identical to the first story, just told in reverse. Yes, there is another love triangle. Yes, Unconsecrated show up and people die. Yes, they make it back to the Mary's original hometown from the original book. But what's the point? The book really doesn't seem like it has much to say; which is a shame, because \"The Forest of Hands and Teeth\" truly felt like it did. It's not even really that interesting. Beyond some semi-exciting zombie attack scenes, there is really nothing to differentiate this book from the original. This is, in my opinion, a pale imitation of Ryan's first book. It is, ultimately, inconsequential and unnecessary."}, {"userName": "Farren", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/29738019-farren", "userReview": "1.5 starsI hated this book. It was just plain awful. I hardly enjoyed the first one, but all the reviews I read said the sequel was way better. It is. If you enjoy reading the same plot structure, another lame love triangle, and a main character who is even more whiny and selfish than the first one, that is.The beginning was promising, and I even posted in my status update how much more I was liking it than the first book. They sneak into an abandoned amusement park, which was a stupid plan that made no sense, but of course I was thinking and since that's one of the best video games ever I got prematurely excited. I feel so duped.Here's the good: Right in the beginning we learn what exactly causes a person to return as a \"breaker\" zombie. In The Forest of Hands and Teeth they were just like man that is one fast zombie in the strange red vest, and would you just look at that shade of red?! I'm shook!Okay that's it for the good. So here's the bad:Everything.J/k. Well not really, so I'll be a little more specific.*SPOILERS AHEAD BUT WHO CARES BECAUSE THIS BOOK IS JUST LIKE THE FIRST ONE ANYWAY*Gabry. Omg this girl could not be any worse. Possibly the worst main character I've ever read, as a matter of fact. When the book begins she is nothing but a scared little girl, never wanting to venture outside of their safe community, which some (me) may think is okay because that's the smart thing to do. But she does it anyway because her best friend and a cute boy told her to, which means that she isn't smart, just afraid and dumb. When she sees a breaker heading towards her loud ass friends she decides not to warn them, lest she draw attention her way instead. After the attack that she didn't prevent, she runs home, crawls into bed, and pretends she was never there to begin with (leaving her crush behind with a zombie bite) because she doesn't want to get in trouble. She basically proceeds to whine and wallow in endless guilt over absolutely everything for the rest of the book. Except for the one thing she should feel terribly guilty over, some may say the worst sin one can commit, but hey, what do I know? She's incredibly selfish and lashes out every time she hears something that she doesn't want to hear, and even physically assaults Elias multiple times in the book. She mentions the marks she leaves on him frequently, but I guess he doesn't mind and it's okay, because he is also wracked with guilt that will not subside and must \"deserve\" it. Gabry does all these reckless things and puts herself and others in danger, stomps off like a child whenever she's angry, and constantly contradicts herself. I'd like to throw her in the fire from the first book.As annoying as Gabry was, Cira was equally as bad. She berates Gabry for playing it safe and convinces her to live a little and go play around in Funland. After the shit hits the fan, she then berates Gabry for lying about her part in it, and tells her that since she didn't get caught it's her responsibility to go back and find her cutie patootie brother. Because going out there as a large group worked out so well for them right? It's totally okay to send your best friend back ALONE this time to look for your probably already dead brother. Rather than being forced into service with the Recruiters (you know, the people with the weapons who have the best chance of survival out of everyone) she decides live just isn't worth living anymore. She wallows in despair as much as Gabry wallows in guilt, which makes them the most intolerable female duo in literature, as well as making all women look weak and irrational.The guys are not important enough on their own to discuss, so I'll just talk about the horrid love triangle. Omg I love Catcher so much, and he just kissed me so now he's my boyfriend and we're in loooooove.Ooh this guy Elias is so cute and helpful. I'll keep him on the back burner until bf #1 dies.Wow Catcher, you're not dead. Guess we can be together after all.I love how cute and smart Elias looks while he explains everything to me repeatedly because I'm so stupid *sigh*Catcher, let's resume the kissing. No? Good thing I have another boyfriend then!Elias, let's be together forever and ever. Oh no, your leg!I can't make it without you, Catcher, don't leave me. Who else will help me get back to Elias?!Somehow still not as annoying as Mary's love triangle though. Also, does Carrie Ryan know that legs aren't the only body parts that can be injured?Now I need to mention the immunity. Immunity is so rare that the Recruiters won't tell anyone about it, because they don't want them to get hopeful and keep their loved ones around if they become infected. That part I get. What I don't get is why the villagers don't kill people before they turn to remove the risk of them biting people once they're zombies. If no one believes there is a chance they'll live through it then it's the only logical option. When you watch The Walking Dead they don't wait until they all come back as zombies to kill them because it's too stupid to take that risk for nothing! Why would Gabry want to keep returning to someone who is infected so that she can take care of it after instead of before? And with no weapons at that! She keeps saying over and over again how she was taught there is absolutely no chance of surviving a bite. While I'm on the subject, why the eff is no one armed in this series except for the Recruiters??? What do they plan to do in case of a breach? Why do they rely on one woman to kill the zombies that wash up on the beach all by herself? It's like they want to die or something! Don't even get me started on this zombie worshiping cult either. It made no sense to me.Mary was just as self-involved as ever. In the first book she risked everyone's lives just to get the ocean like an absolute moron. In this book she tells Gabry that she isn't her real mother and that she is leaving the ocean to go find the people she left behind some three decades ago. WTF Mary. The only way I'd read the last book is if she dies a horrible, gruesome death.I listened to this on audio, and the narration was loads better than the first book. Despite the fact that the narrator pronounced \"forest\" as \"farest\" and it bugged the hell out of me.... I have Daughter of Deep Silence but I don't think I can force myself to read Carrie Ryan's work again. I'm beyond done with the poor writing, never-ending, self-pitying internal dialogue, major plot holes, and characters that possess zero good qualities. If the characters are even half as bad in her other novels I know I'd DNF them anyway. I'm still flabbergasted that The Forest of Hands and Teeth got a movie deal. I am confident that it will bomb, so this train wreck will never make it to screen."}, {"userName": "Maree", "userReviewDate": "Jan 12, 2012", "userURL": "http://www.goodreads.com/user/show/5001811-maree", "userReview": "[Why does the girl character always have to decide who it is she wants, just to have him snatched away from her at the last minute? In this last book, seconds after Gabry decides she wants Elias, he falls off a cliff. Dramatic, absolutely, but a lot less believable now that it's happened twice in the same series. (hide spoiler)]"}, {"userName": "Laura Lulu", "userReviewDate": "Jun 27, 2009", "userURL": "http://www.goodreads.com/user/show/1648704-laura-lulu", "userReview": "Oh, Carrie Ryan, you break my heart. At times while reading it, I wanted to give it 5 stars. At others, I wanted to throw it across the room and give it 1 star. Well, I never give 1 star, but you get the idea. But damn, she writes a good book. I just have to remind myself that \"5 stars\" doesn't necessarily have to equal \"happy\". I also have to remind myself that just because a character occassionally might act like a bitch, a crybaby, a scaredy cat, or an idiot, it doesn't mean she's not a good character. It just means she's real. I act like all those things at one time or another, and I'm a pretty good character--if I do say so myself.I liked this one more than I liked the first in the trilogy, and I want the third book right now, not a year from now. Ugh."}, {"userName": "Stacey", "userReviewDate": "May 06, 2011", "userURL": "http://www.goodreads.com/user/show/1020736-stacey", "userReview": "If anything, The Dead-Tossed Waves is as much about what it is to be a teenaged girl, as it is about the walking dead. Sure, there's no shortage of creepy corpses, and we know everything has gone to hell-on-earth, and the zombies are winning. But it isn't the mudo that kept me up past one o'clock in the morning finishing the story, it was Gabry's emotion. Reading this, not only could I remember what it was like to be 16 and in love, I could almost feel it. Remember that? When nothing else could ever be so important as being madly in love with a boy, and replaying that moment over and over when you sat so close, and almost kissed? I'm glad those days are over, and glad I'll never go back, but wow do I ever remember! The Dead-Tossed Waves is as much young adult romance novel as horror. As a zombie novel, the setting is unique because it's generations past the apocalyptic crisis. It's POST post - so far past that the youngest generations (many of them) don't even believe the “legends” of airplanes, cities, and science. These parts of the story are interesting, but the real “action” is the angst and excitement of teenaged love. A glance or brush of the hand can be as devastating or life-affirming as an encounter with the undead. With 16 well before the half-way point in my life, I can't help but read the story with an almost jaded eye of the adult telling the child “oh honey, there are bigger things than kissing that boy.” But then I remember the boy I never kissed, and the boy I did, and I know that was the most important thing in all of my existence in that moment, and the house could have fallen down around me without my notice. Ryan makes an interesting choice for a series; instead of following a single storyline through books #1 and #2, she chooses a different character, separating her stories by many years. All indications are that the third book is the same. This is a bit disconcerting, since both The Forest of Hands and Teeth, and The Dead-Tossed Waves end with cliffhangers. The Forest's cliffhanger is obliquely resolved with a few references in Dead-Tossed. I'm going to guess that The Dark and Hollow Places (Book #3,) will do something similar with Dead-Tossed's ending. All of that being said, in general, I prefer my characters to have a bit more self-awareness than the main character, Gabry. These books are not heavy on character development, and although they are written in a style that suggests it's all about the individuals, everyone in this story is a character sketch. Very few of them have more than roughly drawn backstories or motivations. And even Gabry's teenaged disquiets and euphorias really exclude all other development of her character. In fact, there are more things in these stories that should have caused me to hate them, than there are to compel me to read them – and yet, 1am passed me by without blinking. I suppose the biggest redeeming quality, for me, is that I love the way Ryan writes. I love the cadence of her words, her descriptions, her pacing... I suspect that I could read a story about the itsy-bitsy spider climbing his spout, and if it were written by her, I'd get sucked in, even if it went on for 100 pages. 3 stars because, as a story, it's a only a wee bit more than okay, but an extra star for making me embrace the okay-ness."}, {"userName": "Sesana", "userReviewDate": "Mar 25, 2011", "userURL": "http://www.goodreads.com/user/show/5172893-sesana", "userReview": "[though there are some creepy undertones when you find out that she's the twin of the girl he calls his sister (hide spoiler)]"}, {"userName": "Vaso", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/15818014-vaso", "userReview": "Το 2ο βιβλίο της σειράς κατά την άποψή μου, είναι πολύ καλύτερο από το πρώτο. Έχει έντονη δράση, γρήγορη πλοκή, νέους χαρακτήρες και τα απρόοπτα δεν λείπουν καθόλου. Η Carrie Ryan έχει φτιάξει έναν πολύ σκοτεινό κόσμο και μου αρέσει που δεν αναλώνεται στο να εξηγήσει πώς συνέβη. Προτιμά να αναφερθεί στις καταστροφικές συνέπειες της μόλυνσης. Τα νέα πρόσωπα κρύβουν μυστήριο και λίγο πριν το τέλος μαθαίνουμε τον τρόπο που συνδέονται όλα. Πραγματικά, δεν μπορούσα να το αφήσω απ’ τα χέρια μου."}, {"userName": "Emily May", "userReviewDate": "Feb 10, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "Really disappointed with this one, I'm deciding to drop the series and not bother with the next book."}, {"userName": "Ceilidh", "userReviewDate": "Dec 19, 2010", "userURL": "http://www.goodreads.com/user/show/3229028-ceilidh", "userReview": "‘The Dead Tossed Waves’ seriously surprised me. While I still had similar problems that I had with the first book, Ryan’s wonderful prose kept me gripped throughout. She has a serious gift for creating fear out of the small moments and that which we find to be so normal, like the ocean (water zombies FTW!) The feeling of claustrophobia, even in the wide open spaces that Gabry lives in, is constant, and Ryan does a fantastic job of crafting a secret filled, constraining society in a situation where one would think such a thing isn’t even possible. We also get answers to questions posed in the first book which is always a good thing. The mythos of the zombies, known here as the Mudo, is fleshed out further, no pun intended, and we get a wider view of how the world has been affected by the epidemic. There are some very interesting twists in this tale that I won’t spoil for you. But the love triangle problem looms in the distance and I just can’t ignore it. I was seriously bugged by Mary’s love-sick moping in ‘The Forest of Hands and Teeth’ because it seemed like a ridiculous priority to have when one’s life is at stake and it just dragged the plot down and sadly the exact thing happens here. While I like the protagonist in this book more than I did with Mary, it still feels highly unnecessary and uninteresting. Like her mother, Gabry suffers from some real moments of head-desk inducing stupidity. The adult Mary also gets a couple moments to display her unchanging personality from the first book. I’m disappointed that Ryan decided to repeat this plot element from the first book since it was evidently the weakest part of the story and weighed down the rest of it so much. I’d love to see her try this story without the love element in it. She manages to pose some very intriguing philosophical questions – what does it truly mean to be alive? When you are undead are you still you? – in an interesting way that keeps the plot moving, as well as some genuinely eerie moments, mixing together themes of religion, power and responsibility, and they’re all so much more interesting than the teenage romance, although I give credit to Gabry for being so much less selfish than her mother, even if she does spend a lot of time comparing herself to her. I’d love to see a story set in this world around the time of the Return. It would probably be as depressing as hell but Ryan could definitely pull it off. I will definitely be picking up the final book in Ryan’s trilogy, ‘The Dark and Hollow Places.’ Soap opera moments and unnecessary love triangle aside, I love Ryan’s prose and the world she has created. ‘The Dead Tossed Waves’ builds upon its predecessor and even beats it on several levels and I was highly satisfied with it. Ryan’s a great storyteller and I hope she sticks with the stuff she’s great at and makes the final book in her trilogy everything it deserves to be. 3.5 stars."}, {"userName": "Carolina", "userReviewDate": "Apr 14, 2012", "userURL": "http://www.goodreads.com/user/show/6676516-carolina", "userReview": "OMG! I'm so happy this was my 100-read book :') And like this book more that the first one but ot was really FRUSTRATING. Sometimes i really wanted to kick Gabry and tell her \"HEY CAN YOU SEE WHAT ARE YOU DOING? YOU ARE BRAVE, LIKE YOUR MOTHER, hell, YOUR REALLY ARE!!\" Spanish review also here :) http://librosjuveniles55.blogspot.mx/...LO MAS IMPORTANTE:El libro empieza con un habiente rapido,las cosas al principio suceden con mucha rapidez que apenas te dan tiempo para asimilar las cosas...pero despues de los primeros capitulos la historia se calma y te da tiempo para pensar. Como es de adivinar este libro no es de comedia ni de color ROSA, no, para nada, Mary en poco tiempo se queda sola y solo tiene a su alrededor a las mujeres de la hermandad, de las cuales no confia nada ya que esconden oscuros, muuy oscuros secretos.Un dia normal el pueblo de Mary es atacado y ella, su familia y unos cuantos amigos son obligados a huir. Perro ellos tienen miedo ya que no tienen a ningun lado al que ir, ya que como ellos fueron educados, como siempre les dijeron, su aldea era la unica restante, ellos eran los unicos seres humanos que habitaban la tierra, ellos eran la salvacion de la humanidad,pero ahora que su aldea habia sido invadida por los No-Consagrados ( tambien conocidos como zombies) fueron forzados a escapar sin tener lugar alguno al que ir.O al menos eso creian.Triangulo Amoroso? bueno como ya habia comentado el libro no es de color rosa y la parte amorosa menos lo es, no se puede esperar mucho de un libro que tiene un amor posapocaliptico, Mary definitivamente hace muchas malas deciciones y eso afecta a los demas. Una o dos lagrimas se salieron de mis ojos, pobre Mary, pobre, sufrio tanto. El libro en si me gusto mucho mas que nada porque AMO A LOS ZOMBIES!! y porque tiene una buena historia y tambien interesante, les dejaria un link de descarga pero no lo tengo :( lo busque por dias pero nunca lo encontre al final lo compre en ingles, no es un ingles muy complicado la verdad asi que deberian leerlo."}, {"userName": "~Tina~", "userReviewDate": "Jun 18, 2010", "userURL": "http://www.goodreads.com/user/show/2594672-tina", "userReview": "4.5 StarsIn all honestly, I had no intentions what so ever for reading this book. I didn't really care for the first one,  The Forest of Hands and Teeth, and while I think the writing was fantastic, I found the tone of that book to be absolutely miserable, depressing and painful.So, when I found this at my library, I got curious and looked up reviews and realized that this isn't Mary's story, and that it was about her daughter, Gabry. That got me mighty curious and I'm so glad I took this chance, cause The Dead-Tossed Waves is an excellent read!Very rarely do I see sequels or companions in this case, better then the first, so I'm actually very shocked at how much I enjoyed this book. Seriously, this was much, much better! The writing flows beautiful and has such an intense mix of sadness and hope to the plot that it's hard to stop reading, so I devoured this in one sitting.It's fast paced and the plot thickens up as we meet new characters, find there roles and hear there stories. I loved to hate Daniel, I was just as tossed up between Catcher and Elias as Gabry was, and I even found Mary redeemable from the first one.This book still lines with a lot of misery and pain, which is my reason for a lack of half a star, but it had sweet touches of romance that was seriously lacking in the first one.All in all I'm thrilled that I gave this a chance, I found this experience shockingly much more pleasant then I thought I would.Action packed, highly entertaining and creepy enough to get right under your skin!For anyone who didn't like the first should give this one a definitely go! I'm looking forward to reading the next installment into this world.A Must Read!"}, {"userName": "Alex", "userReviewDate": "Jun 08, 2010", "userURL": "http://www.goodreads.com/user/show/164794-alex", "userReview": "Warning.... Spoilers and CursingMan, this book pissed me off. The first book, was a complex story of a girl who did not understand the world around her, and as she struggled to find her place in the world, frakking zombies appeared everywhere. It was awesome!This second story follows Gabry, the daughter of the Mary from the first book, and her struggles to find herself and love, and zombies of course. However, there was a similar love triangle, and Gabry herself, is completely annoying. I get that she is going through some serious teen angst, but every time she comes to a sense of understand, something happens and she is right back where she started. And how can she struggle to kill a mudo, but have relatively no guilt/concern about killing a real person? The author also repeats a lot of narrative devices which seems sophomoric. The story line is solid, tracing your roots back to understand your self. There are new groups introduced who have questionable intentions (The Recruiters, The Soullers); and there is also a philosophical discussion of what is life about, how if life is living, do the mudo have any kind of life or real purpose? But I was really routing for the zombies to finish the girl off from the first chapter."}], "description": "Gabry lives a quiet life, secure in her town next to the sea and behind the Barrier. She's content to let her friends dream of the Dark City up the coast--home is all she's ever known and all she needs for happiness. But life after the Return is never safe.Gabry's mother thought she left her secrets behind in the Forest of Hands and Teeth, but like the dead in their world, secrets don't stay buried. And now, Gabry's world is crumbling. In one reckless moment, half of Gabry's generation is dead, the other half imprisoned. Now Gabry knows only one thing: if she has any hope of a future, she must face the forest of her mother's past.", "title": "The Dead-Tossed Waves\n      \n          (The Forest of Hands and Teeth #2)", "url": "https://www.goodreads.com/book/show/6366971-the-dead-tossed-waves", "average": 3.91, "cover": "https://images.gr-assets.com/books/1347444849l/6366971.jpg", "reviews": 2675, "authors": [{"url": "https://www.goodreads.com/author/show/1443712.Carrie_Ryan", "name": "Carrie Ryan"}], "type": ["Young Adult", "Science Fiction", "Horror", "Horror", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/6366971-the-dead-tossed-waves", "http://www.goodreads.com/book/show/6555517-the-dead-tossed-waves", "http://www.goodreads.com/book/show/7825640-the-dead-tossed-waves", "http://www.goodreads.com/book/show/12134994", "http://www.goodreads.com/book/show/6599301-the-dead-tossed-waves", "http://www.goodreads.com/book/show/7804115-the-dead-tossed-waves", "http://www.goodreads.com/book/show/3432478-the-forest-of-hands-and-teeth", "http://www.goodreads.com/book/show/8535273-the-dark-and-hollow-places", "http://www.goodreads.com/book/show/13533758-foretold", "http://www.goodreads.com/book/show/23281652-daughter-of-deep-silence", "http://www.goodreads.com/book/show/13356177-divide-and-conquer"]}