{"ratings": 69002, "userreviews": [{"userName": "Best_beloved", "userReviewDate": "Oct 02, 2008", "userURL": "http://www.goodreads.com/user/show/116151-best-beloved", "userReview": "My Problem that I Know Will Not Actual Bother Everyone:\tOkay, the main ‘hero’ is an immortal warrior who is partially controlled by demon of Violence. Yes, Violence, which the heroine, Ashlyn, is dating. He spends the first 50 pages (give or take) chanting kill, murder, slice, hurt, killkillkill to himself. He acknowledges that while he tries to fight the demon, he does fail - on a nearly nightly bases. Now, I’m aware that in this genre love conquers all and that relationships and people in romance novels are not expected to be 100% realistic. I know this. But. If your best friend, Sally, comes to you and says that she met this really great guy who is loving and caring and good to her, but he tells her that he holds the demon of Violence in his body, not joking, you would think one of three things 1). He is crazy, 2) He has a demon of Violence in his body, or 3) this is a lovely metaphor of his behavior after three beers. In any case, wouldn’t you tell Sally to run, not walk, to the nearest exit? I had a really hard time overlooking the mass murder aspect of their relationship. My bad.The Other Problems with the Book:The Hero(s). The hero and his friends are the ultimate ‘bad boys.’ They are immortal warriors each containing a demon. Maddox, the warrior of this book, has the demon of Violence and is only partly in control of it. And why does he have this demon? Because he and his friends were so pissed off that the job of guarding the box of demons was given to Pandora, a girl, that they stole the box and opened it and so released Violence, Wrath, Death, Disease, Disaster, Pain, Misery, Lies, Secrets, Doubt, and Promiscuity into the world. Yeah. Very heroic. Maddox also has the distinction of being the one who killed Pandora, while he was Violence. The Villains. So, when demons were first placed in these immortal warriors, the demons pretty much wrecked havoc slaying and killing the population for many, many, many years until the warriors figured how to imperfectly control them. In the mean time, those pesky human who were being butchered trained up fighters to kill the demons/warriors. Yes, we’re the bad guys.The Mythology. I think the author could have picked better demons. For example, Violence and Wrath. Both guys are all about the killing. Violence has whole mindless rage going on while Wrath kills people according to their crime (rapists have their penis removed, etc). Shouldn’t Wrath be Hammurabi or Vengeance? Or is that not evil enough? Because I don’t think Promiscuity, Lies, or Secrets are that evil either. I mean, Secrets? Really?Pandora's Box. So the bad guys, the humans, learned that if they can find Pandora’s box and hold it next to the demon ridden immortal warriors, the demons will be sucked back into the box. The side effect will be the death of the warriors, but as Maddox spent some time complaining that there’s no way to kill himself because he just heals back that shouldn’t be a problem, right? Wrong. Needless to say, the immortal warriors are not so keen to die when it comes down to it. Now, if I hosted, let’s say Misery (we can all agree that misery is bad), and have done things in the past thousand years that make the rest of the world miserable, I would say ‘sucks to be me’ and embrace the box. But it gets better, because in the book’s reality, if I get sucked into the box – all Misery in the whole world would disappear. All of it. No more Misery. Even if it wasn’t originally my fault, even if I was an innocent bystander, if I were hosting Misery and killing the demon and myself I was ridding the world of all Misery for ever and ever, I would kind of consider it my duty to let myself be sucked into the box. And I am a selfish, selfish person. Necessary Evil. Which leads us to another little question of what would happen if only Death and Lies got sucked into the box? I’ll even throw in Disease as well. Death, Lies, and Disease are in the box and out of the world. Which means no more telling Aunt Jenny you love the fruitcake and the orange sweater she gave you for your birthday. Lies help grease the social wheel. Just a fact. Which leaves us with the problem of Death and age. You don’t get eternal youth, you just don’t get to die. You can still be injured and hurt and age, but no Death. It’s probably a good thing that the immortal warriors are not going into the box.Plot and Character. There are two issues that immediately spring to mind. So, those horrible, nasty humans managed to off one of the immortal warriors several hundreds of years ago which caused the immortal group of warriors to split into two factions. One faction wanted to kill the people who were responsible for the warrior’s death, burn down the city and the kill the rest of the population. The other wanted to kill all the people who were responsible for the warrior’s death and hide themselves away from the world. Now, Promiscuity (suck it up sex positive people, it’s a sin) needs to sleep with at least, at least, two women a day and they can’t be the same woman. No repeats. As a ‘hero’ he decides to hide himself away from the world, except for his many, many trips a day into town for sex. Does this make sense? Shouldn’t he be walking the world getting laid? Even if he strikes out on his own rather than hanging out with either faction, sleeping his way through Europe? Based on the first book, on average, he has a thousand different women a year. In an isolated area? Up in the mountains? Does he order them from the internet? My second problem is that when Ashlyn, the female lead, learns that Maddox is being punish because he murdered Pandora by stabbing her six times in the stomach her response is “We all make mistakes.” Well, yes, yes, we do. I, myself, killed someone in a mindless rage just this morning. Seriously? Because you could reasonable forgive him. You could. It was a long time ago, he has been punished, he really wasn’t himself when he killed her, she loves him. But I want to see that reasoning. I want her to actually think about it. Which leaves the minor problems of introducing a literal god in the machine to break the curse, having to life bond Ashlyn and Maddox because he is immortal and she’s human, and pull out all the stops to convince the reader that the human hunters are the bad guys."}, {"userName": "Candace", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/16384209-candace", "userReview": "As the first full-length book in this series, this book did a good job of making me want more. Aside from the love story between Maddox and Ashlyn, which was fantastic by the way, there was a lot of plot and character development. No doubt, this will serve to make future books more entertaining. It was a wholly enjoyable read.Ashlyn and Maddox seemingly meet by chance. He thinks that she's bait for hunters. She is curious about the house of immortal beings. The townspeople speculate are angels and Ashlyn needs a miracle.Maddox is cursed, along with his friends, for opening Pandora's box. As punishment, the demon Violence lives within him. He is in a constant battle with the demon over his body and mind. As if that weren't bad enough, he must be \"killed\" every night, as he killed Pandora.Ashlyn has lived with her own curse, of sorts. She has heard voices for as long as she can remember. Standing in any given location, she can hear every conversation that ever took place there. She just wants to make the voices be quiet. She figures that if anyone could help her, it would be an angel.When Maddox and Ashlyn cross paths, they are instantly drawn to one another. They may not trust each other, but there is no denying the attraction between them. Fierce possessive and protective instincts overtake them. Of course, there is plenty of danger and action to keep things moving along. Somebody is still sending the hunters after Maddox and his friends. The attacks are getting bolder and more dangerous. There is also a change in immortal leadership, which is wreaking havoc on Maddox and his friends' lives.Overall, I thought this was a nice, entertaining story. I really enjoyed the backstory and all of the secondary characters. I look forward to reading each of their stories as I get further into this series. In many ways, this book was reminiscent of the 'Immortals After Dark' series that I finally got around to reading a little while back. However, that isn't a bad thing, since I loved that series.The only negative thing I have to say about the audiobook is that it had this really irritating music that played at a few points. Mainly, the music started during major transitions in the story. At one point, I thought Ashlyn was finally going to have sex with Maddox and the music started up. It was really cheesy and had me laughing like a loon."}, {"userName": "Blacky *Romance Addict*", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/8310179-blacky-romance-addict", "userReview": "[with a man who possessed a demon inside him after only one day. I would be just a tad bit scared or I don't know. Something. If it was at least the second day or something. But the first? Dunno. (hide spoiler)]"}, {"userName": "new_user", "userReviewDate": "Oct 22, 2008", "userURL": "http://www.goodreads.com/user/show/1365355-new-user", "userReview": "*sigh* What can I say? The Darkest Night wasn't very dark. I wanted to like this book because it came so highly recommended from friends, but I've read Showalter's writing before and I was skeptical.Well, my first impression was unfortunately right. Showalter's writing style is still very light and sugary, only it's even more out of place in such a dark setting (i.e. constant violence).Her heroes are supposed to be Greek immortals, exalted and admired guardians of the gods until their hubris leads the immortals to quarrel with Zeus & co. In their pride, the immortals open Pandora's forbidden Box. They loose the worst demons on mankind: Violence, Disease, Pain, Misery, everything that plagues the world. As punishment, the immortals are forced to house these demons -and their terrible desires- in their own bodies. It's many years until they learn to control these demons, and in the meantime, the carnage they inflict on the world is terrible.This sounds like the formula for a wonderfully dramatic, angst-ridden read, but there was no drama. Main character Maddox mentions many times that he hates \"what he is,\" keeper of a malicious demon. I'm convinced he feels angst, but we rarely ever see examples of the terror he houses inside him. I see little evidence for his guilt, his \"great dilemma,\" besides a few fistfights with his bros (the one point of depth in the novel). Why is it so terrible? It's only at the end that someone, a villain, shows evidence of the terrors inflicted by these men, and it's never explained or even verified that the horrors were actually committed by them. His demon sees little development, and the protagonist hardly sees more. He is never really developed beyond the loathing he has for his demon and his sin, aside from a note on woodcarving, and after he meets Ashlyn he becomes subintelligent. It's love at first sight, and he must protect her because she's \"his.\" There wasn't much else to explain his sudden, overwhelming need for this woman. It was very much like reading  The Life and Times of the Caveman at points. He's literally had centuries with no company other than his own and five other private men. At least Ward's men had their hobbies. I really wish he would have had some interests or some intelligent, clever, or any observations at all to make other than his inexplicable attachment to the heroine-- who also mysteriously falls in love with him, though he has no apparent attraction for her other than that he solves that little problem of the voices in her head. Oh, and his muscles. Showalter wants to make sure we're aware that these heroes have muscles, numerous times. They're all very muscley cavemen.But to their credit, the other men seemed to have more personality than Maddox. Promiscuity and his charm, Death and his considered, calm intelligence, Aeron and his austerity, Disease and his humor. I'm not really sure about Pain. I do hope they don't become simple like Maddox does, when they find their women. The existence of these men is never really explained, however. They're immortal guards, but since the story's origins have some basis in Greek myth, I expected to be able identify them as demi-gods or some other familiar staple of Greek legend, but they're never really identified. A lot in this book is unexplained, actually, such as how the most feared demons in the Underworld can apparently be \"tamed\" by women. The book really could have benefited with some detail, some development of the Hunters, the Lords, even the world (where angels apparently also exist). The bedroom scenes were a little saccharine for me, but some readers will enjoy them. I found it a little strange that the dialogue was abbreviated in every scene, however. \"Love you. So good. Need you.\" They never managed a full sentence between them, and this style does get annoying when used in every single sex scene. The plot was good, at least.So, in essence, this is still Showalter, still sugary Harlequin romance with paranormal trappings. Don't look for another J.R. Ward here, but if you're due for a quick romance, give it a try."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Nov 03, 2008", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "Well, I finally started the much lauded Lords of the Underworld series. I was happy with this book. However, it does have some issues with it that I felt detracted from it as a stellar read. I felt like there was a roughness in some of the writing. I have a theory about this. I think that the publishers really put a lot of pressure on the paranormal writers to put out a series quickly. This takes time away from the authors that they need to polish each book so that it can be at its best. I felt like scenes jumped around a lot, and some things got left out, so I had to go back and reread scenes. It also felt like a set-up book. The mythology was a little more vague that I wanted it to be. It refers to the Greek gods as \"The Greeks\" and the Titans as \"The Titans.\" Who are they? I wanted to know more about them. I was left with big questions unanswered. Perhaps this will be revealed as the book progresses. I just wanted to see some of this information get integrated into this book. There were some things I didn't like about the setup, like the Hunters. I'm not sure that they are formidable enough enemies. Maybe this series will come to show that there is a more dangerous menace for the Lords.Okay, you are probably asking why this is a four star book, having said all this? I'll talk about that after I get the issues off my chest. Don't get me wrong. I love these paranormal series, but I wish that as much energy went into the first book, so that the quality is consistent. It's really hard when you try to recommend books to people, but you have to say, \"But don't give up if you don't care for the first book.\" I hate when that happens, because then that person thinks, \"Hmm. What's up with her taste in books?\" Not that I think that, mind you. But you worry your friend will think that.Okay, let's talk about the positives with this book. I loved the concept of these warriors who have been cursed by being inhabited by ancient demons that were released from Pandora's Box. Yes, the Pandora's Box of Greek Mythology. Pretty darn awesome premise. And the execution is very good so far, minus the issues I expressed above. The characters were interesting and I wanted to learn more about them. Each warrior stands out from the other. I already feel emotionally engaged with the Lords, and I want to see that happy resolution for each of them. I think Gena Showalter's imagination is really apparent in the characters she creates, and the storylines. She's really funny, too. I like the way the Lords interacted. What can I say? I'm a big fan of the group of guys who live together and fight together. They're friends, most of the time, but sometimes they can be antagonistic with each other. But at the end of the day, they would die for each other.Ashlyn was adorable. Not just that. She was pretty courageous. Some might consider her too sweet, but I like sweet heroines. I thought she was a perfect match for tortured Maddox. I like how drawn she was to him from the beginning. He made the voices stop, but she was very attracted to him, and almost was the pursuer in this book. Maddox was a good hero. You liked him and felt for him. I think how he suffered was pretty awful. I don't think the dark elements are as dark as they can be in a paranormal romance, but I can't quibble about that. I know there are darker series that I can read for that. And at the end of the day, I love the sweetness of Gena Showalter's stories. I really want to smile when I finish reading them. I loved the end of this book. It was so satisfying that I read the last page again.The steam factor is higher than her prior books. And she did well with that. The love scenes are hot and explosive, but they are loving. The best combination. You want the couple to be together. I loved all their scenes together and the way their attraction unfolds. There were parts that made me sigh, and other parts that made me want to fan myself because the scenes were hot.This is a good book that will give you some enjoyable hours of entertainment, and you'll definitely want to keep reading the series. And if you're kind of iffy about this one, don't give up on this series, or the author (Grin)."}, {"userName": "Laura", "userReviewDate": "Nov 08, 2012", "userURL": "http://www.goodreads.com/user/show/8429172-laura", "userReview": "|3.8 keeper of awesomeness stars|It is so good when things turn out positively.I was a bit afraid of finding out I didn’t like this series after reading The Darkest Touch but with re-reading this first book? I feel like I’m back on it.The Lords of The Underworld series is so addicting and so much fun and with an interesting premise, it’s no wonder why how these books have made it this far.I find the mix between Greek mythology, urban legends and paranormal creatures pretty great and with this compelling characters, you just want to learn more and more about them.In this first story we fall in love with Maddox, keeper of the demon of Violence and Ashlyn, a young girl working for a paranormal researcher institute with an interesting gift. It’s a bit of insta-love but more like insta-lust and it’s a very decent start of a series. We also meet Maddox’s brothers in arms: Torin, Lucien, Reyes and Paris who are the keepers of Disease, Death, Pain and Promiscuity respectively. Also we learned about their backstory and their curses.Overall I think this a good paranormal romance book and I will be re-reading the rest of the series because why not."}, {"userName": "Μaria Vrisanaki ", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/33193128-aria-vrisanaki", "userReview": "[κυριαρχούν (hide spoiler)]"}, {"userName": "Kellie Maddox-Ward", "userReviewDate": "Feb 28, 2012", "userURL": "http://www.goodreads.com/user/show/7309666-kellie-maddox-ward", "userReview": "THE BACK STORY\nLong ago twelve immortals warriors made by Zeus, became jealous of Pandora she was chosen to guard a box. Inside that box housed some of the most dangerous demons ever known. The Immortals made a horrible mistake of killing Pandora and opening the box. As punishment for the evil they have unleashed each warrior was sentenced to carry one of those demons for all eternity. They are - Violence, Pain, Death, Disease, Disaster, Misery, Doubt, Promiscuity, Defeat, Lies, Secrets, and Wrath. Angry with the Gods the Lords wreaked havoc killing anything and everything allowing their demons to take over. They are then banished to Earth. A group of humans rose above the bloodshed and called themselves The Hunters. Hell bent on punishing the Lords for every wrong that has ever been caused. After killing Baden keeper of Distrust, they realize that they cannot kill a Lord without unleashing the demon into the world. Both sides learn that they need four godly artifacts to find Pandora’s box to entrap the demons again. Time is now running out with the Titans have taken the throne, the Hunters are growing and one by one the Lords are learning to trust others besides themselves to help win the war. Who will find them first. Lords. Gods. Or Hunters. Name – MaddoxHair color – Jet black Eyes – Violet – But glow red when angry Demon – Violence Tattoo – left shoulder wrapping around back Things to know – Maddox was the one to kill Pandora, as a punishment every night he has to die by Reyes hand and then Lucien takes him to hell to be punished. He awakens the next morning to do it all again. One of the best fighters out of the Lords. Name – Ashlyn DarrowThings to know- American orphan who has been brought up by World Institute of Parapyschology aka the government., aka The Hunters. Has the ability to stand in one spot and hear every conversation that has ever occurred there. \nTHE LOVE STORY\n We are introduced to the Lords that live in their Castle in Budapest.  Maddox – Violence, Lucien – Death, Reyes – Pain Aeron – Wrath,  Torin – Disease, Paris -  Promiscuity.Ashlyn has heard of the “Angels” that live in the castle on the top of the hill in Budapest. She is hoping that they can help her stop hearing the voices in her head. When she gets to the woods near the castle she is going half mad with all the voices talking to her when all of a sudden they just stop. Confused she looks around and finds a man. A man covered in blood. She doesn’t care he has made them stop somehow. She wants to stay with him and find out more. Maddox has just killed the first hunters in 100’s of years, They were near the castle. The girl brought them… she didn't know they were following her. but he still wants her. It’s nearing midnight and he will die then, so he takes the girl back to fortress, he will have to explain her presence with his friends. What transpires is obviously them falling in love, Maddox never has been in love before. Ashlyn losing her virginity, and most importantly/stupidly Ashlyn making the ULTIMATE sacrifice for her man.\nSECONDARY STORY\nWhile Ashlyn and Maddox are falling madly in love. We are told about the war with the Hunters and the other Lords who do not live in the castle and haven’t spoken to these Lords in 1000’s of years. Enter –  Sabin - Doubt,  Gideon  - Lies,  Amun  - Secrets,  Strider  - Defeat,  Kane - Disaster, and  Cameo  (The only girl Lord)- Misery. Together they learn about the godly artifacts needed to help free their demons. We also meet new character Anya – The minor Goddess of Anarchy. Also the Titans have overthrown the Greeks and taken back the throne. Now that Cronus is King again he has a task for the Lords. Starting with Aeron aka Wrath. Cronus has told Aeron that he must kill an innocent family of 4 women. He doesn't want to do it,Cronus tells him if he does not he will be punished as Wrath will take over and eventually cave to the bloodlust. The Lords decide to bring the women to the Budapest fortress until they can decide how they are going to stop Aeron from going mad while Wrath takes over and how to defy Cronus. One of the women has a shitload of spunk! And also has an admirer! Reyes \nMY HONEST OPINION\nI did really like this story. I really did. I can TOTALLY understand why people are comparing it to the BDB and IAD and well pretty much every other paranormal romance out there. But this series holds its own! I mean we all love to read about scary Alpha-bad boy-tortured heroes-who are fucking amazing in bed \nso that’s why they keep writing about them!\n I do need to say that I have now read the whole series and the writing does get stronger and better as it goes on so please don’t give up! At time I found this book could be a bit cheesy and mushy. But it was a great introduction into the series. Yes there was a lot of people to cover and a lot of mythology to try and remember but I thought it was good. (As mentioned before I have read the whole series now and when you need to remember something important ie who’s demon belongs to who or about the mythology it is explained again so that you know what you need to! – I write these reviews after I read each one and then came back and added things like this!  I couldn’t wait to start the next book! It’s too hard to choose a favorite Lord yet… will keep u posted and I really really really like Anya! \n FAV QUOTES/CHUCKLES/CONVO'S\n*****************************************“You are mine, woman, and I am yours. Until you, my life was desolate. I existed, but I didn't truly live. Now I live, even in my death.”*****************************************“Sometimes what we want isn't what we need.”*****************************************“I tried to tell you. You said you didn't care, remember?\"A muscle ticked below his eye. \"You should have told me anyway.\"\"While you had barbells within your reach? Please. I'm Disease, not Stupid.”*****************************************“What's this about?\"\"Finally. Interest,\" was the only response.\"If this is one of your tricks...\" Like the time Torin had ordered hundreds of blow-up dolls and placed them throughout the fortress, all because Paris had foolishly complained about the lack of female companionship in town. The plastic \"ladies\" had stared our from every corner, their wide eyes and let-me-suck-you mouths taunting everyone who passed them.Things like that happened when Torin was bored.”*****************************************“Knock him out, Paris!''Sure. Want me to spew diamonds from my ass while i'm at it?”*****************************************“I don’t even know what to say.” Aeron.“I do. Fuck.” Paris.*****************************************“Once I learned, I went online and ordered every romance novel I could find. They're fairy tales for grown-ups.”*****************************************“I'll take the cemetery,\" Kane said. He didn't sound excited. Rather, he sounded resigned. \"The club might collapse if I go.”*****************************************“Pale hair fell in waves to his shoulders, framing a face mortal females considered a sensual feast. They didn't know the man was actually a devil in angel's skin. They should have, though. He practically glowed with irreverence, and there was an unholy gleam in his green eyes that proclaimed he would laugh in your face while cutting out your heat. Or laugh in your face while you cut out his heart.”*****************************************“Who is she, why is she still here and when can I see her naked? Paris asked with an eyebrow wiggle”*****************************************“He would have been handsome—in a serial-killer kind of way—if not for those tattoos.”*****************************************“Bomb', Reyes said, not bothering to look up.'One of ours?' Maddox insisted...'Hardly. I know better than to blow myself up,' Reyes sighed.”*****************************************“Back off, asshole. I haven't had a woman today, so I'm in no mood for this kind of bullshit. ”*****************************************“Aren’t all fairy tales based in fact? You yourself are supposed to be nothing more than a myth.Pandora’s box is a story parents read to their children at night,” she countered. “That means life itself is afairy tale. Like the characters, we all live and love and search for a happily-ever-after.”*****************************************“I've traveled all over the world for the Institute, but I never dreamed I'd meet someone like you.\"\"Strong?\"A chuckle escaped her. \"Yes.\"\"Handsome?\"\"Of course.\"\"Sharp of wit and skilled with a sword?\"\"Absolutely.\" An other chuckle. \"But I mean a man… friend… guy. Oh, I don't know what to call you!\"He savored her amusement—and her earnest words. \"Just call me yours. That is all I want to be.\""}, {"userName": "xrysa", "userReviewDate": "Jun 13, 2012", "userURL": "http://www.goodreads.com/user/show/9016476-xrysa", "userReview": "[He was a Hunter?? (hide spoiler)]"}, {"userName": "Sophia Triad", "userReviewDate": "Dec 20, 2015", "userURL": "http://www.goodreads.com/user/show/44642860-sophia-triad", "userReview": "Maddox: Demon of violenceButterfly: upper left shoulder, wrapping around to his backHis curse: He is stabbed every night only to be brought back to life the next day and then the next night he has to die again.Ashlyn Darrow: She works for the World Institute of Parapsychology.Supernatural ability: She hears voices about things that they happened in the past.In ancient time, Maddox is the warrior that killed Pandora and then the box that included all the vicious demons disappeared and all the demons possessed the responsible warriors who opened it. The demons have been imprinted on the warriors’ bodies with BUTTERRLY tattoos. All of them have been cursed for thousands of years to suffer.\nEvery night death came, slowly, painfully, and every morning Maddox awoke in bed, knowing he’d have to die again later.\nAshlyn is a very confused girl. Totally reliant on the World Institute of Parapsychology and totally tired of hearing voices, she is sent to Budapest to meet the “men” who are rumored to have supernatural abilities. She needs help; the Lords think that she is bait from their worst enemies. And maybe she is. Before they come to a conclusion, lonely Maddox already wants her and already protects her. Their age difference does not really matter. Ashlyn is twenty-four years, while Maddox is a few thousands.\n“Why? What’s she to you?”“Mine,” was the only answer he had. “She’s mine.”\nLords of the Underworld is one of my favorite PNR series. I have already reread most of the books a few times. The world building is fascinated. Its mythology that tangles mainly ancient Greek myths, myths from other countries, stories from the bible and the writer’s imagination is excellent.I also love the dark humor of the novels.The Darkest Night introduces the story of Maddox and Ashlyn which will only grow stronger in the next books as well as some details of the stories of the rest of the Lords who are waiting patiently their own book and their own love story and salvation."}, {"userName": "Kitty (I solemnly swear that I am up to no good)", "userReviewDate": "Jul 14, 2013", "userURL": "http://www.goodreads.com/user/show/16734001-kitty-i-solemnly-swear-that-i-am-up-to-no-good", "userReview": "\"\"I need to prepare you.\" He was about to see her underwear-another embarrassing topic. They were plain white cotton. Granny gear, she's once heard a man say. She never wore sexy clothing, even underclothing, while on the job. It wasn't practical. \"I do own sexy underwear, I promise, but i'm not wearing it right now.\"\"WTFUCK??! Get a grip sister...I mean seriously when in the throws of passion who cares what pants you are wearing just take them off. Have a little confidence for goodness sake. But ladies, this car crash seduction only gets better worse:\"His gaze locked on the cotton panties. She fought the urge to cover them, wishing again that he could see her in something sexy. \"I know men like to role-play,\" she told him, nervously trying to fill the silence. How many times had she heard them brag about it to her friends? \"At home I have a cop outfit, a harem girl costume and a playboy bunny teddy.\" Not that she had ever gotten to use out of them. But she loved owning them, just in case.\" AAAAAAAHHHHH Why is she such a virgin, push over, fanny, annoying blaaaaaaah??? Now I can see that some people may read these quotes out of context and think I am overreacting but you have no idea how sick I am of these sorts of books...the formula is infuriating, all you need is:The malcontent, virgin in her mid-twenties; She is unerringly beautiful and charming, intelligent, probably with a brilliant degree but somehow she has never met a man who she wanted to bed in the quarter of a century she has existed. OH and the funny, ironic thing is that no doubt she believes she is a strong willed, feminist and you can bet she is full of feist...however when it really comes down to the nity gritty all our MC wants is a man to domineer her like the good little wifey she is. BOKE.The alpha male; He may seem tough, angry, chauvinistic and rude but in reality the only reason he acts like such a sexist pig is because of some deep and unsettling pain from his past. He has lived his life whoring and fighting like the best of them and never expected or wanted to fall in love until he meets her, then everything changes and he becomes deeply possessive and creepy. The plot line; is irrelevant, a device to keep the romance interesting. The worst, worst thing about this book is how well it started. I actually really though this book was interesting at the start...I loved the story of Pandora's box and the curse. It was original and dark, with so much potential but then it all just spiraled out of control as the romance took over like a stalky, horrible parasite."}, {"userName": "Tina", "userReviewDate": "Jul 09, 2008", "userURL": "http://www.goodreads.com/user/show/627337-tina", "userReview": "I must preface this by saying that I only made it to page 200, so i probably shouldn't be reviewing this book. However, the fact that I couldn't really be bothered to make it past page 200 makes this worthy of explaining why.I picked up this book, first because I got a rec for it and second because the cover art is so darned striking. And I was really stoked by someone doing something a little different within the paranormal genre. I admit, I am always on the look out for paranormal that don't involve vamps.The idea of these Greek warriors being responsible for the Demons released in Pandora's Box and being punished for it in such a neat way, seemed so fresh and new and interesting.The problem I had with this book is that the author didn't make even this cool premise seem fresh and new and interesting. So much of the book was set up with a lot of exposition and a trying-too-hard feel to get me interested in the camaraderie/interactions between all these men that live together. I wasn't interested, on the contrary, I was intensely bored. The writing was fraught with romance novel cliches. I finally gave up after one female character had raised her chin for the umpteenth time in two chapters.Too bad. I wanted to like this but I just don't."}, {"userName": "Michelle ", "userReviewDate": "Aug 30, 2015", "userURL": "http://www.goodreads.com/user/show/23450274-michelle", "userReview": "3.5-4 Cursed Stars!I think I've found a new PNR series that I might love. I'm excited! This was Ashlyn and Maddox's story. But it was stocked full with all the other warriors. A perfect set up for more to come. Ashlyn hears voices. Lots of voices. Every where she goes if people have been there she hears their conversation. She wants the voices to stop. She's on the hunt for the men with special abilities that she's heard about to see if maybe they can help her quiet the noise. Maddox is a warrior and is cursed with the demon spirit violence. He's also cursed with death and being sent to hell every night at midnight.When Ashlyn is in the fortress looking for the mens home her and Maddox come face to face. Maddox doesn't have much time because midnight is closing in. He's not sure if Ashlyn is bait for the hunters or not. Was she sent to the fortress to lure him and his brothers by the hunters? Should he kill her? Should he just leave her in the woods to freeze? Ashlyn is confused because the voices have stopped. She never wants to leave Maddox because of this. When Maddox decides to leave her there and try to make it home before death comes to him Ashlyn has no choice but to chase after him. She gets hurt. Maddox can't leave her. He breaks all the rules by carrying her back to his home. Maddox immediately makes the men swear to not harm her and to not touch her while he is in hell. The men can't understand what's gotten into Maddox to make him bring a woman into their home. Their home filled with all these demon spirits. Wrath, violence, death, pain, disease and promiscuity. Ashlyn doesn't care about any of these men she only wants to be close to Maddox. She will do anything to stay close to him. She will goes as far as to try to protect Maddox from death and pain. While the men try and figure out if Ashlyn has been sent as bait other problems start popping up. The Gods summons Wrath. This leads to woman getting kidnapped. Hunters are getting close. Lost warriors showing back up. Bombs going off. The list is endless. I loved that Ashlyn felt the need to protect Maddox. I also loved that violence seemed to calm inside Maddox when she was around. Maddox never being around a human woman for very long for fear of killing them was a nice surprise. He made me laugh several times. The ending choked me up and then had me yelling YAY!!!Why not a 5 star?I'm sad to say that I skimmed some. There was a lot of Ashlyn's thoughts that seemed to drag on and on. The sex between them was also skim worthy. So yes I skimmed some. lol But it's not going to stop me from moving forward with the rest of the series. I need to know what's going to happen. Of course I also want the other warriors story too. I hope I can make myself read in order and not skip. lmaoI can't wait to get to Anya's and Lucien's story next. Death and a Goddess. Oh yea! It's going to be so good!"}, {"userName": " Lady Jayne *~*The Beach Bandida*~*", "userReviewDate": "May 23, 2010", "userURL": "http://www.goodreads.com/user/show/1453659-lady-jayne-the-beach-bandida", "userReview": "(4 Stars)Ooohhh!!! Yummily sexy cover! That was my first reaction. ^_^ Seriously. Love the covers in this series.The Darkest Night, the first book of the Lords of the Underworld series, is my first Gena Showalter book. I really liked it but wasn’t completely captured by it. I haven’t been hooked yet like I am with J.R. Ward’s Black Dagger Brotherhood. I’m putting it out there – I just LOOOVVEEE those Brothers!!! Okay? Bias, outted. Though, to be fair, I wasn’t completely addicted to the BDB until book 2 of that series. In reading the first LOTU book, I couldn’t help but feel some of the descriptions of the Lords were too much like the Brothers, ie. a scarred one, an irresistibly handsome one, one with mismatched eyes, one with purple eyes, a long-haired one, one with multi-toned hair etc. And well, some of their “flaws” were also similar to the Brothers. Though as I kept reading, I did eventually see these characters as characters all their own, and I am intrigued to keep reading the series and to get to know the Lords better.The Premise:  Interesting. The Lords of the Underworld were once warriors for the Greek Gods. When Pandora, a woman, was given the task of guarding the box that caged the most dangerous of demons (too difficult to contain in hell), these warriors were compelled by their pride and arrogance to open the box and unleash the demons. The point was to prove that they could then capture the demons again, and thus, beat their chests as the truly worthy warriors. Pretty stupid of them, I say! Especially when “Pandora’s Box” went missing. These immortal warriors were then cursed to be the “keepers” of a demon each within their bodies, to suffer for eternity for the folly of their pride. So, tortured heroes galore to be expected in this series! This is the draw for me. I’m a sucker for tortured heroes. *grins*The Hero: Maddox, the Keeper of Violence. He bears more than the curse of trying to keep the demon of Violence in-check; he is also cursed to suffer a painful death every night. Why? Read the book. ^_^ I really felt for him and he was pretty sexy.The Heroine: Ashlyn Darrow, a human who bears her own burdens, which is what leads her to the fortress of the Lords. She’s tough and caring. I liked her. The Romance: Bit too syrupy, at times (P.S. though at other times, quite caveman-like). In fact, one declaration had me feeling like it was a lukewarm \"rip-off\" of Zsadist’s infamous sigh-and-swoon-worthy declaration. I don't know why. However, despite this, I was caught up in this couple’s sudden inexplicable draw to each other and I did feel that they “completed” each other. Steam-Factor: Pretty hot and good build-up, but not as steamy as Ward’s BDB series or Kresley Cole’s IAD series.That being said, I was drawn to keep reading and really did enjoy this book. I just don’t feel quite as connected to the Lords (yet?) as I am to the Brothers or the IAD series characters. There is definitely potential and I look forward to reading the other books in the series. I am intrigued to read Torin’s, Keeper of Disease’s story, as the thought that he can never touch anyone just breaks my heart, and the fact that he tries to deal with it by finding humour in things, just endeared him to me – When is his book??? I am also interested in Lucien’s, Reyes’ and Paris’ stories. Paris reminded me of Rhage from the BDB - Loved his comic relief.\nMaddox...\nCOPYRIGHT DISCLAIMER: I do not hold the copyright to any of the images used in this review. They are posted to add visuals to the review and for fun. If any of these images are yours and you would like me to remove them, please let me know, and I will do so as soon as possible. If I can identify the copyright, I will do so."}, {"userName": "SamJ ★Needs a HEA★", "userReviewDate": "Mar 27, 2014", "userURL": "http://www.goodreads.com/user/show/3258936-samj-needs-a-hea", "userReview": "[Yes (hide spoiler)]"}, {"userName": "Ⓐlleskelle - teamSøren♗ ⊲I like big b00ks⊳", "userReviewDate": "Nov 11, 2013", "userURL": "http://www.goodreads.com/user/show/18387313-lleskelle---teams-ren-i-like-big-b00ks", "userReview": "⭐️⭐️⭐️⭐️⭐️ 4.5 STARS  ⭐️⭐️⭐️⭐️⭐️"}, {"userName": "Dija", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/2857113-dija", "userReview": "What I expected:1. A too-sexy-to-be-true hero.2. A too-feminine-to-be-anything-but-Barbie heroine.3. Lust at first sight that magically transforms into true love barely 50 pages into the book.What I got:1. Lots of laugh-out-loud moments. 2. Swoon-worthy heroes. 3. A thoroughly enjoyable read.Yes, the girl's a virgin. Yes, the guy's an immortal who has existed since before time yet still hasn't ever fallen in love. But no, the girl's not a wimpy, gullible, brainless idiot. And no, the guy actually does have a personality beyond his dick. Color me surprised."}, {"userName": "Gary", "userReviewDate": "Jun 22, 2015", "userURL": "http://www.goodreads.com/user/show/43194437-gary", "userReview": "wow what a first book five out of five and i can see me reading all the series very fast"}, {"userName": "Exina", "userReviewDate": "Dec 30, 2011", "userURL": "http://www.goodreads.com/user/show/5309539-exina", "userReview": "July 12, 2013\n\n\n\"We’ll wait there and let the Hunters come to us.” “That’s it? That is your plan?” “Well, that and kill them.” The fragrance of roses became stronger as Lucien’s eyes glittered menacingly. “It’s a good plan.” \n\nPretty good opening book of the ’Lords of the Underworld’ series.Smartly built alternative mythology, gradually measured tension and multiplying conflict. Maddox is the least significant Lord for me, so the first book being his is really smart, because his personality doesn’t outshine the story and the characters of the other Lords. The Darkest Night successfully keys up the readers towards the rest of the characters and the series. He is the Keeper of Violence, not a surprise that he has violent urges to destroy, kill, maim, punch the wall, etc. Furthermore he is suffering a horrible extra curse every day. His protective instincts revive toward Ashlyn, so he also can be tender and caring. \n\nMine, mine, mine. She was more important than breathing, more necessary than food or water or shelter. In a thousand lifetimes of war and violence and rage, she gave him kindness. Serenity. Compassion. Trust.\n\nAshlyn’s character is more intriguing to me, I liked her very much. Sweet and insanely brave. Her ability of hearing every bygone conversation in a place, and understand it in every language is exceptional. The love story\n\nWith Ashlyn, Violence was not truly violent. Instead, the spirit was made into something beautiful. Dark, yes. Always dark. But sensually so. Not evil, but needy. Not destructive, but possessive. Two days ago, he would not have thought such a thing was possible. \n\nThe basis of the affection is that they mutually calm each other: Ashlyn tames Maddox’s demon, and Maddox dissipate the voices Ashlyn hears. But they fall for each other too fast, and it doesn’t turn out that how Maddox’s presence can stop the voices. Secondary charactersThe Lords’ characters are so tempting that they surely make you continue reading the series. The reunion with the other group of warriors centuries after they had departed hopefully generates some further conflicts. Both Lucien and Anya’s and Reyes and Danika’s story is nicely prepared.\n\n“I don’t understand how he can be this fierce over one woman,” he faintly heard Lucien say.\n\n\nha ha... yet!\n\n\n“No woman should have to barter her body to escape a prison,” she said, angry at herself. The image of Reyes swam before her eyes again, and she found herself adding, “But I’ll think about it.”\n\n\n- Danika\nThe Darkest Night, as an opening book of the Lords of the Underworld series, is an appealing but not flawless story.Originally posted on my blog on July 13, 2013.My favorite quotes."}, {"userName": "Eleni Ouzouni", "userReviewDate": "Sep 11, 2015", "userURL": "http://www.goodreads.com/user/show/24520173-eleni-ouzouni", "userReview": "“Sometimes what we want isn't what we need.”Στο παρελθόν, μου είχαν προτείνει πολλοί να ξεκινήσω κάποια από τις σειρές της Gena Showalter. Ποτέ όμως δεν έτυχε να πιάσω κάποια στα χέρια μου. Πριν λίγες μέρες καθώς χάζευα στις διακοπές μου σε διάφορα μικρά βιβλιοπωλεία το μάτι μου έπεσε κατευθείαν στο όμορφο εξώφυλλο του πρώτου βιβλίου της σειράς \"Άρχοντες του Κάτω Κόσμου\" μαζί με την πολύ προσιτή τιμή δεν μπόρεσα να αντισταθώ και να μην το αγοράσω. Η Άγρια νύχτα είναι το πρώτο μέρος μιας μακράς σειράς που επικεντρώνεται σε δύο κεντρικούς ήρωες. Τον Maddox που κατέχει μέσα του τον δαίμονα της βίας. Ζει σε ένα κάστρο στην Βουδαπέστη μαζί μια μεγάλη ομάδα πολεμιστών ενώ σπάνια αφήνει τα τοίχοι του αφού χάνει συχνά τον έλεγχο του εαυτό του δημιουργώντας τεράστιες καταστροφές ανθρώπινες και υλικές. Αυτό μέχρι την ημέρα που πιάνει μια νεαρή κοπέλα να προσπαθεί να μπει κρυφά στο κάστρο του. Την Ashlyn η οποία μπορεί να ακούσει φωνές και συνομιλίες ανθρώπων που βρίσκονταν σε κάθε μέρος που αυτήν στέκεται. Δεν μπορεί να αντέξει αυτήν την συνεχή φλυαρία που υπάρχει μέσα στο κεφάλι της, έτσι όταν μέσα από το ερευνητικό Ινστιτούτο όπου εργάζεται ταξιδεύει στην Βουδαπέστη θα ακούσει τους ντόπιους να μιλάνε για κάποια ξεχωριστά πλάσματα άλλοι τους θεωρούν Αγγέλους και άλλοι δαίμονες τότε σκοπός της θα γίνει η αναζήτηση τους με την ελπίδα να την βοηθήσουν. Η πρώτη γνωριμία της Ashlyn και του Maddox ήταν μια πολύ όμορφα γραμμένη σκηνή. Ο τρόπος που αυτός καταφέρνει να κατασιγάσει τις φωνές και αυτήν να ηρεμήσει το θηρίο μέσα του ήταν καταπληκτικός. Είναι δύσκολο να μην πέσει την αγάπη με τον Maddox. Αν και η περιγραφή του αρχικά είναι σχεδόν βάρβαρη, ο τρόπος που ανοίχτηκε στην Ashlyn και η πίστη του στους φίλους του(και ας ήθελε στο μισό βιβλίο να τους σκοτώσει :P) ήταν μαγική. Αλλά αυτήν που λάτρεψα πραγματικά ήταν Ashlyn. Μια πραγματική ηρωίδα! Χωρίς να κλαίγεται όλοι την ώρα, να γίνεται πρόστυχη ή μικροπρεπής. Ήταν δυναμική και ευαίσθητη ταυτόχρονα. Και ο τρόπος που \"σώσει\" τον Maddox στο τέλος ήταν τόσο βαθιά ανιδιοτελής! Η ιστορία μας έχει πολλά ανοιχτά μέτωπα. Οι άρχοντες του κάτω κόσμου πρέπει να αντιμετωπίσουν τους Κυνηγούς μια φατρία ανθρώπων που έχει δημιουργηθεί εδώ και χιλιάδες χρόνια από την ημέρα που οι Άρχοντες συνδέθηκαν με τους δαίμονες και έφεραν το θάνατο στην γη. Τώρα βρίσκονται ξανά στην Βουδαπέστη πιο έτοιμοι από ποτέ. Επίσης πρέπει να ασχοληθούν με την νέα ηγεσία τους Τιτάνες που έριξαν από το θρόνο τους Έλληνες Θεούς. Ένα όμορφο μπλέξιμο ελληνικών μύθων, καταιγιστικής αγωνίας και ερωτισμού όλα μαζί! Το λάτρεψα πραγματικά! Μ'αρέσει που σε κάθε βιβλίο θα διαβάζουμε και μια διαφορετική ιστορία αλλά θα ακολουθούμε το ίδιο story που ανοίχτηκε στο \"The Darkest Night\". Αν είστε φαν των paranormal romance σίγουρα πρέπει να του ρίξετε μια ματιά. P.S Ανυπομονώ για τις ιστορίες των Torin και Lucien! “You are mine, woman, and I am yours. Until you, my life was desolate. I existed, but I didn't truly live. Now I live, even in my death.”"}, {"userName": "Seda", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/59959710-seda", "userReview": "Hayal kırıklığım buradan Budapeşte’ye yol olur. Kitabı uzun zamandır okumak istiyordum, aramadığım sahaf kalmadı. Resmen ülkenin diğer ucundan buldum aldım. Ama sonu kocaman bir hayal kırıklığı oldu.Yorum yaparken ve puan verirken ‘Zevkler tartışılmaz’ın arkasına sığınıyorum. 😃 Kitabı sevmeyi çok istedim ama okudukça nefret ettim. Bir kere konu yoktu kitapta, başından sonuna okuduğum tek şey Maddox’ın nasıl tahrik olduğu ve Ashlyn’i yatağa atma isteğiydi. Her türlü fantastik ve anormal düşünceye açığım ama saniyede hayatının kadınını bulması, ayakkabısını çıkarırken bile tahrik olması, dün tanıştığı kadın için dünyayı yakıp yıkmak istemesi vs. bana çok saçma geldi.İmkansız aşka da inanırım, ilk görüşte aşık olmaya da. Ama bunun, bana iyi anlatılması, hissettirilmesi lazım. Burada içlerinde kaynayan tutkunun altı bomboştu. Bazı çıtır çerez kitaplar vardır, çok fazla duygu barındırmaz ya da açıklama yapılmaz. Sadece karakterlerin cinsel çekimlerini okuruz. İşte bu kitap onlardan daha beterdi benim için. Son 100 sayfaya kadar dünya yansa tek derdi yatağa girmek olan bir Maddox vardı. Birbirlerinin gözlerine baktıkça kıyafetlerini çıkarmak isteyen bir çift yetmezmiş gibi, bir de Reyes ve Danika çıktı. “Aman tanrım ne kadar tehlikeli bir adam. Keşke beni soysa?!” “Bana yaklaşmayı, dokunmayı aklından geçirme. Keşke o büyük elleriyle beni okşasa?!” Danika’nın iç sesini okurken çelişkilerinden yoruldum yeminle.Bir de bu kadar tutkunun?! ve gerilimin olduğu yerde keşke icraat da olsaydı. ‘İstiyorum, yapacağım, az kaldı, biraz sonra’ diye diye kitap bitti. Cidden boğuldum okurken. ‘Yeter artık ne yapacaksanız yapın da ben rahatlayayım’ diyecektim.Bir ara ben mi yanlış açıdan bakıyorum dedim ama sonra daha da üstüme gelmeye başladı konu. Ben herkesin bomboş, erotik roman dediği Karanlığın 50 Tonu’nda ağlamış insanım, bu kitapta da tutku ve tahrik olmak dışında bir duygu olsaydı kesin yakalardım diye düşünüyorum.Kitabı beğenenlerden özür diliyorum ama hayatımda bu kadar zorlanarak bitirdiğim kitap sayısı azdır gerçekten. Sadece kitabı yarım bırakmama takıntım yüzünden son sayfayı gördüm. Seriye asla devam etmeyeceğim zira kitap okuma alışkanlığım tehlikeye girebilir.Bütün bunlara rağmen 1 vermiyorum, çünkü konunun altında yatan mitolojik hikaye güzel işlenseymiş, sadece cinselliğe odaklanmasaymış, çok güzel bir kurgu çıkarmış. Pandora’nın kutusu, iblisler, tanrılar, ölümsüz savaşçılar aşık olacağım bir kitap konusu olabilirmiş. Ama olamamış malesef."}, {"userName": "Buggy", "userReviewDate": "Jan 09, 2010", "userURL": "http://www.goodreads.com/user/show/3099666-buggy", "userReview": "Opening line: \" Every night death came, slowly, painfully, and every morning Maddox awoke in bed, knowing he'd have to die again later.As a fan of paranormal romance and in particular JR Ward's Black Dagger Brotherhood my searches for what to read next kept taking me to this series. That's not to say the two are comparable, because they aren't but if you like continuing story arcs with multiple character POV's, hot, sexy love scenes, the occasional bloody fight and tortured yet strong alpha males who become kittens once they meet their prospective mates then you might like this too. The premise for Gena Showalter's world is quite elaborate. Centuries ago a group of immortal warriors released the demons from Pandora's Box. (Yes the Pandora's Box) As punishment the Greek gods cursed the warriors, forcing each to act as host to one of the demons, sort of like a duo personality. Maddox, this books hero is the keeper of violence and because he was unable to control his demon in the beginning and killed Pandora. (Yes the Pandora) Maddox was additionally cursed to die each night at the hands of his fellow warriors, burning in the pits of hell until morning (which can`t be fun) The Lords of the underworld now live in a secluded castle in Budapest, each struggling to coexist with their own personal demon. The other warriors possess things like disease, wrath, death, pain, doubt, promiscuity, lies, and disaster, all of whom getting their own book as the series progresses. Our heroine here is Ashlyn Darrow. She works for the World institute of Parapsychology and has come to Budapest with her team to investigate the warriors. Poor Ashlyn has a curse of her, born with the ability to hear any conversation that has ever taken place in the location where she is standing. These voices in her head have ruined her life and she'd do anything for a moment's silence. Maddox finds Ashlyn in the woods outside the castle and even though he thinks she's `bait' sent by the `hunters' (bad guys) he is instantly drawn to her. For Ashlyn it's a miracle, because even though she finds this violent and bloody (he's just killed some hunters) man terrifying the voices have stopped. Now she can't bear to be separated from him and Maddox can't help himself either (they never can) carrying her back to the castle and into his chambers. Of course he's going to have to explain himself to the other men, if he can leave Ashlyn's side long enough and what happens at midnight when his friends have to kill him? That's sure to put a damper on the ole love life. The premise for this series is original and exciting and I will definitely be continuing on. Despite the fact at times I was overwhelmed by Greek Mythology and couldn't keep track of who was who and cursed with which demon. I also had trouble with Ashlyn and found her to be written too young and virginal to ever handle a man like Maddox (maybe I was just jealous though?)"}, {"userName": "AH", "userReviewDate": "Jun 05, 2010", "userURL": "http://www.goodreads.com/user/show/3255548-ah", "userReview": "I must admit that when I first started reading this novel, I absolutely hated it. I just could not get into this book. So I put it down, as cutie would say, in the time out corner for a few days.I then decided to start over. After all, this book is highly rated by Goodreads reviewers. Everyone seems to love it. Well – I am glad I gave this book a second chance. Once I got over my initial confusion, I really could not put the book down. The Darkest Night is the story of a group of warrior/brothers who live together outside Budapest. They are each possessed by a different demon. They are benevolent towards the townspeople and are referred to as angels by the locals. The warriors are hunted by a group of Hunters who are identified by a small tattoo on their wrists. There is so much that I loved about this book. I enjoyed how the brothers interacted with each other. They genuinely did care about each others’ well being, yet could attack each other just as easily due to the demons they housed. I liked how the author took elements of Greek mythology and wove those elements into her story. Ashlyn’s character was so sweet and innocent. She is also tormented, hearing voices of past conversations no matter where she is. When she meets Maddox, she is instantly attracted to him, and to the sudden silence around her. Maddox is also attracted, but remains suspicious. Their relationship is beautiful, hot, and steamy. The love scenes are beautiful, but a little odd as the two characters often speak like cavemen – in one word sentences. Actually, Maddox kind of reminds me a little of a caveman, in his possessiveness over Ashlyn. I can’t wait to read the next book. Lucien and Anya’s story sounds interesting!"}, {"userName": "Kay", "userReviewDate": "Feb 22, 2010", "userURL": "http://www.goodreads.com/user/show/2545195-kay", "userReview": "This was such a boring read, it is kind of ridiculous.The Darkest Night is supposed to be a PNR book a-la-J.R. Ward - while there are many similarities, Showalter ultimately does not deliver. The book is filled with tortured fallen angels, forced to host a demon within them. But apart from being tortured, they are utterly indistinguishable. This is the case for the entire book - we are introduced to so many characters and none of them seemed to have a personality! The heroine, Ashlyn, was a complete bore - and what little character she did have made me roll my eyes. She's psychic, and Maddox is the only one who can calm the voices. She's a virgin, but addicted to pornography. Ooh. Aaah - BLEH.The cover sure is lovely, though, and the writing itself was pretty ok. It could well be that the books miraculously get better later on. But I'm afraid I won't be sticking around to find out.Bottom line? A book filled with PNR tropes and zero emotional pulls. Skip it."}, {"userName": "Viri", "userReviewDate": "Aug 03, 2016", "userURL": "http://www.goodreads.com/user/show/31499137-viri", "userReview": "Como si no fuera suficiente: Aquí está la reseña en el blog, espero que no se decepcionen demasiado.http://www.virivillarreal.com/2016/08...ESTOY TREMENDAMENTE DECEPCIONADAY ya sé que voy a ser el negrito en el arroz pero siento que es mi deber hacia la comunidad lectora (mentira solo quiero explayarme) decir lo malo que es este libro. Porque por si fuera poco... Después de estar siendo avasallados con libros paranormales +18 de este estilo, vienen y hacen una serie/saga lo que sea con más de 10 libros... ¡Es que es incomprensible!Dejando claro este punto, voy a decir las cosas que NO ME GUSTARON DE \"La noche más oscura\"Primero que nada lo peor fueron los protagonistas.El \"Héroe\" es un ser inmortal poseído por uno de los demonios antes ocultos en la caja de Pandora, este demonio fue maldito y está condenado a tratar de luchar contra la violencia que habita en él y como si no fuera suficiente, al pobre lo condenaron también a morir cada noche y quemarse en el infierno. Para mí, Madoxx fue el intento de un personaje que quedó a medias, de esos que tanto me gustan pero sin llegar nunca a tejer un fondo (y personaje) profundo dentro de la historia.¿Pasado tortuoso? Check¿Estar maldito? Check¿Rodearte de amigos iguales de torturados que tú? Check ¿Haber tomado muy malas decisiones en el pasado? Check ¿Tener un nombre cool y estar cañon? Check ¿Encontrar a la chica de tus sueños y lograr que ella te libere de todo mal? Check El problema es que aunque todo estuvo, no causa impacto. No importa que el prota este traumado, que sufriera por toda su vida, que sea inmortal y que camine por la soledad. NO IMPORTA porque la autora simplemente no lo toma en cuenta, me daba la impresión de que se hizo una lista con todo lo que debía tener el personaje principal y solo lo menciona \"por encimita\"La otra cosa... Es la protagonista femenina. ¿Pero es que esta chica era tonta o qué? O sea, no le basta con que la secuestraran, Nooooo ella va libremente a él y se enamora \"Perdidamente\", ¿adivinen en cuanto tiempo? ¡EN SOLO UN DÍA! Oh, sí, es que eso es lo más normal del mundo dadas las circunstancias, porque ya no hablo ni siquiera de amor a primera vista. NOOOO, estoy va más allá de todo razonamiento, les pondré un ejemplo... Imaginemos algo, tú mejor amiga conoce a un tipo que está cañón nooooo... Lo que le sigue a eso, ah bueno, pues lo conoce, el tipo le dice que tiene un demonio dentro al cual no puede controlar y solo piensa en MATAR, (del tipo no pienso en nada más, solo en eso) pero que de cualquier forma la desea tanto que se muere de ansias de estar con ella, ¡en ese instante! Uno pensaría que: o tu amiga se pegó en la cabeza y quedó un poco mal o de plano se ha vuelto loca... Bueno señores y señoras. ¡Nada de eso pasa aquí! Porque la chica no se vuelve loca, ni se ha pegado en la cabeza, solo ha sufrido un caso grave y duro de ese insta-love que tan poco me gusta. Y por si fuera poco, ella se la pasa rogando por sus caricias y pasando de tímida (no rompo un plato) a devora hombres (baby hazme tuya ahora) bueno, bueno con nuestra prota ¿no?Ahora bien, no conformes con toda la bipolaridad de nuestra prota, la autora va y la pone en unas escenas increíbles y no en el buen modo. Había momentos que no podía dejar de rodar los ojos y pensar: ¡Oh, vamos! ¿en serio ella ha hecho eso? pfff...La siguiente cosa que estuvo mal fue la narraciónY no es que no esté acostumbrada al estilo de la autora porque ya la había leído anteriormente y me había dejado un muy buen sabor de boca, es que al principio aparte de ser una lectura lenta y sin sentido (solo era el ansía loca de Madoxx de matar, en plan de MATAR, MATAR, TENGO QUE MATAR, O SUFRIR, O DESCARGAR LA VIOLENCIA QUE LLEVO DENTRO, O MATAR Y MATAR Y MATAR etc,) siempre me dio la sensación de que nada importante pasó, la narración en algunas ocasiones se pasaba de simple al grado de que llegué a pensar que Gena no era la autora pues su estilo es más bien ágil y simple pero en una buena forma.Las escenas de sexo +18Fueron francamente decepcionantes, más bien sosas y sin chiste, no es que me encanten los libros plagados de sexo, (más bien al contrario) pero la verdad sigo sin saber que pasó aquí, digo, si ponen de esas escenas no deberían ponerle la etiqueta de erótico +18 que tiene... Mucha gente puede salir engañada Hahah.EL FINALEsto es lo más en serio que voy a decir en mi reseña, ¿puede haber un final más soso e incomprensible? Bueno pues yo lo dudo, porque como si todo el desastre del libro no fuera suficiente la autora se saca un final de cuento de hadas que no pega nada con el libro. JA, me dio más risa que nada.Ahora viene lo (menos peor) ¿? jajajaYa por último solo voy a decir una cosa, el libro no es malo, simplemente está mal trazado, sin personajes inolvidables, carente de escenas conmovedoras y del punto emocional que siempre se espera en este tipo de libros, aunque con uno que otro posible protagonista aspirante a algo mejor que LA NOCHE MÁS OSCURA. ¿Porque le puse dos y no una estrella si no me ha gustado? Bueno pues eso es muy fácil de decir...Por haber logrado engancharme de los siguientes protagonistas.Para mí, esta historia fue más bien introductoria, porque en ningún momento me dio la sensación de ser \"EL LIBRO\" Debo decir que amo las series/sagas *en serio no se que sean, siempre me confundo* de este tipo, donde narran un protagonista diferente por libro, y admito que ya me muero por saber qué pasa con Torin, lastima que este me dejara un sabor de boca más bien amargo. Así que no se aún si continuaré la saga.En conclusión: Si lo que quieres es un libro del estilo de \"La hermandad de la daga negra\" \"saga vanir\" o mis amados \"Dark Hunters\" (que ni en sueños son como este libro) este es solo el preludio para una saga que tiene buenas pintas, no es un libro tan bueno, pero sirve genial como introducción a este mundo lleno de demonios, dioses, titanes y muchas cosas más."}, {"userName": "Kübra Yağmur", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/36997724-k-bra-ya-mur", "userReview": "TÜM İBLİSLERİ KENDİME İSTİYORUM, yeni gelenlerden birkaçı hariç tabii. -.-Kitabın 50. sayfasına bile ulaşmadan yaşadığım rahatlamayı sizlere anlatamam. Beklenti bu kadar yüksek olunca hayal kırıklığına uğramaktan korkuyordum ama... Ama MADDOX diye bir İblis var bu kitapta.Pandora'nın kutusu açılınca payına Şiddet İblisi düşmesi bir yana ikinci laneti olan iki savaşçıdan biri.Sanki Şiddet baş edilmesi kolay bir şeymiş gibi...Yahu adam Ölüm'le lanetlenmiş. Her gece ölüyor. Ama öyle böyle değil. Ölürken beni de öldürüyor. O ölüm sahnesini ilk okuduğumda ne hale geldim, nasıl kıvrandım bir bilseniz.Ashlyn'i de sevdim, PNR'de sevdiğim kadın tiplemelerinden. Kırılgan, her şeyden habersiz adam bir dokundun mu... anladınız siz. :D Ve fedakâr. Sevdiceği için kendinden vazgeçen bir kadın.Kitabın sonlarını da zaten diken üstünde okudum. Maddox'ın kucağındaki Ashlyn ile ileri geri sallanırken haykırışları, karşılığında her şeyden vazgeçmeye bu kadar gönüllü oluşu... Ah-ah!Böyle adamlarda anca Allah'ın Budapeşte'sinde, kimsenin gitmeye cesaret etmediği bir araziye kurulmuş kalesinde yaşıyor olabilirler. Bu durumda en kısa sürede ıssız kalelere gezi düzenlememiz lazım kızlarrrr.Çünkü bir Paris, bir Torin istiyorummmmm.Sonraki kitap Lucien'a ait. Azıcık ucundan bakmış olabilirim ama asıl akşam başlayacağım. O herifte çok seksi bir şey ama, diyim size."}, {"userName": "Anzu The Great Destroyer", "userReviewDate": "Oct 14, 2010", "userURL": "http://www.goodreads.com/user/show/2278800-anzu-the-great-destroyer", "userReview": "The Darkest Night is a fun introduction to a new series (for me at least) that goes around demons, crazy people, violence, hot drooly (yes, I mean it as drool-y - it should be a word, it’s awesome) sex and extreme redecorating. But we all love crazy people don’t we? And violence. And sex. And hotties. Beats the hell out of watching Animal Planet. Even though the book was a great read I found many problems regarding it. It stars with the typical PNR problem: the ease with which they hooked up. I’d like some more obstacles please! Then there’s the true love conquers all problem. They’ve known each other for a few days so true love is out of the question. What is it then? Lust? Desperation? Drugs? Noodles? You tell me.I didn’t like Ashlyn because she is too dependent. First Macintosh* (lol) whatever his name and then Maddox. Plus she was always taking things too lightly. First Maddox has sex with her and then locks her up because he has stuff to do. What’s her reaction? She gets a wee bit angry and then says to herself \"Meh, still want him, he’s hot\". Not cool. And after being his captive she still falls for him. While this is a classic move for most romance novels, I have to admit that I don’t agree with it. You simply don’t fall for the assh*le who’s keeping you prisoner unless you’re into BDSM or something. Plus he’s a demon and he’s violent and creepy. He may be hot but still, come on! Exaggerated much?Maddox is… special. Even though he has a wall punching problem, tends to destroy most things around him and is a serial killer, he’s pretty cool. I mean how often do you find a guy who knows how to repair stuff? And he’s hot. I mean duh! It’s PNR we’re talking about! Duh! And he like has powers and stuff. And he like kills people. And has a tattoo. I mean awesome, dude!I’ve always wanted to be in the mind of a psychopath, there’s a certain depth to life in there. Let’s take some examples, shall we?First there’s a typical “problem” between a husband and his wife.Then there are some kids thrown along the way.And finally the moments when you just sit back and relax.(I could do this all day!) Yep. A pretty high chance of all this happening to the person marrying this guy.Probably Maddox is like this because of sexual frustration. Once he gets laid properly his demon goes back to sleep.Anyboob, the final score is 3.5 or 3.25 or 3.19999999999999. But that’s beside the point. The Darkest Night is a nice intro to what seems like a good series but it lacked action. As you know the action-eating monster living inside me needs to be fed so it wasn’t totally happy with the situation. Just one location and few to none proper action scenes don’t make a fun story. These warriors have potential so put ‘em to good use! Aaaaaaaaand it was a bit cheesy. That’s it!~The End~P.S. A wise man once said: ”A butterfly tattoo on a guy can never be fierce. It can only be gay!”-------------------------------------------* Macintosh - a series of PCs designed, developed, and marketed by Apple1st read: 5th - 7th Nov 20112nd read: Jan 2016"}, {"userName": "Miss Kim", "userReviewDate": "Oct 21, 2008", "userURL": "http://www.goodreads.com/user/show/925549-miss-kim", "userReview": "3.5 out of 5The Lords of the Underworld are ancient Greek Warriors that were involved in opening Pandora’s Box centuries ago. This caused a load of awful demons to posses each of the Lords. This is Maddox’s story. He is possessed the by the demon, Violence.Ashlyn struck me as TSTL right off the bat. She is wandering through the forest in the damn winter at night. Alone. What the hell? She has a terrible secret that she think the ‘angels’ will be able to help her with. The townspeople all believe that Lords are angels, but are still afraid of them. She hears others thoughts in her head constantly. Living, dead, other-worldly—it doesn’t matter. It’s enough to drive you insane.Maddox catches her in the woods and takes her home. Even after falling for Maddox, she still doesn’t impress me. She keeps putting herself in danger, whether it’s with her mouth or contemplating leaving the damn fortress. Alone. Again.I liked this book enough to keep reading, but I don’t think it was that great. I kept waiting for something to start happening. It picked up near the end, but then it was like the author needed to come up with a way for them to be together for eternity, so this other character barges into the story from nowhere and *poof* helps them out. I’ve got the other two Lords books. I am hoping the story improves as they go on. I would recommend it to any paranormal romance fan."}, {"userName": "Emily May", "userReviewDate": "Mar 15, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "Plot: 3 starsCharacters: 3.5 starsWriting: 3.5 starsSexiness: 4.5 starsEnding: 3.5 starsOverall: 3.6 stars"}, {"userName": "bella ϟ  [ bella farren ]", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/23223005-bella-bella-farren", "userReview": "4 / 5 stars\n“Now I live, even in my death.”\nThis book. THIS BOOK. Greek mythology, cursed warriors, the deadly sins and soul mates. What more could a girl ask for in life? Sometimes you just need some ridiculous, over the top PNR to take your mind off the real world. And this book hit the spot. Reading this book was an unusual experience—part of myself was floating above and watching on in shock as I enjoyed this. The other half? It gave zero flying fucks. Maddox was a immortal greek warrior who had been cursed to share his body with the demon Violence, forever unable to have complete control over his emotions or actions. He had lived centuries in turmoil with only the company of his warrior brothers, all cursed with a different demon as punishment for their past actions. When Maddox stumbles across an innocent human stuck in the cross hairs of an ancient old war between the demon warriors and their hunters, he feels a pull towards her like nothing else. Ashlyn Darrow had been tormented by her ability to hear every conversation that had ever taken place, just by standing where they had been spoken. She had been labelled a freak and never had a moment of peace, so she decides to search out the mysterious men who live at the top of the hill, hoping they can help."}], "description": "His powers - Inhuman...His passion - Beyond immortal...\nAll her life, Ashlyn Darrow has been tormented by voices from the past. To end the nightmare, she has come to Budapest seeking help from men rumored to have supernatural abilities, not knowing she'll be swept into the arms of Maddox, their most dangerous member -- a man trapped in a hell of his own.Neither can resist the instant hunger than calms their torments... and ignites an irresistible passion. But every heated touch and burning kiss will edge them closer to destruction -- and a soul-shattering test of love...Though they carry an eternal curse, the Lords of the Underworld are irresistibly seductive -- and unimaginably powerful...\nDon’t miss this incredible new paranormal series from Gena Showalter!", "title": "The Darkest Night\n      \n          (Lords of the Underworld #1)", "url": "http://www.goodreads.com/book/show/476543.The_Darkest_Night", "average": 4.09, "cover": "https://images.gr-assets.com/books/1322237965l/476543.jpg", "reviews": 3062, "authors": [{"url": "https://www.goodreads.com/author/show/48192.Gena_Showalter", "name": "Gena Showalter"}], "type": ["Romance", "Fantasy", "Romance", "Fantasy", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/476543.The_Darkest_Night", "http://www.goodreads.com/book/show/12681678-the-darkest-night", "http://www.goodreads.com/book/show/22370526", "http://www.goodreads.com/book/show/8144934-the-darkest-night", "http://www.goodreads.com/book/show/17205156-en-karanl-k-gece", "http://www.goodreads.com/book/show/9785129-la-noche-m-s-oscura", "http://www.goodreads.com/book/show/2498983.The_Darkest_Kiss", "http://www.goodreads.com/book/show/2712967-the-darkest-pleasure", "http://www.goodreads.com/book/show/5509920-the-darkest-whisper", "http://www.goodreads.com/book/show/6758331-the-darkest-passion", "http://www.goodreads.com/book/show/11300302-alice-in-zombieland"]}