{"ratings": 32371, "userreviews": [{"userName": "karen", "userReviewDate": "Jan 18, 2010", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "it has come to this. last week, while waiting for more books to come up to shelve, i was idly wondering if this book had come out in paperback yet. it had. so i ran downstairs, pushing folks out of the way on the escalator and making a beeline for teen fiction where i whooped and grabbed a copy. ashamed of my excitement, i made my way back upstairs, trying to figure out how the mighty had fallen. (and by mighty, i mean only those vehemently opposed to adults who read teen fiction). now, i am only opposed to adults who read teen fiction exclusively. come find me in a year or two and see what is happening then.but i thought this book would be worth a read. it is the second part of the series that describes what happens when an asteroid scootches the moon a little closer to us. tsunamis, volcanoes, panic, volcanic ash covering the sun, cold, starvation, more panic, crop death. the first one i thought was only eh. it was narrated by a kind of whiny white girl in pennsylvania suburbia. this one was supposed to have been narrated by a puerto rican teenager living in new york city! splendid, i thought - that's where i live! let's see what will happen here - maybe i can get some more end-of-world- pointers, just in case. the problem is, these two characters are interchangeable. it's true, he will occasionally blurt out a spanish phrase in the middle of his speeches. but just cuz you know a little spanish, doesn't make you authentic (pingüino). just because dave chappelle wears whiteface he doesn't then become \"white\", just hilarious. and that's this book's problem. there are times when it is hilarious. for example: the main character, a hard-working, catholic-school-attending, second-in-his-class, doing-homework-after-the-apocalypse kind of kid- this kid doesn't know how to make macaroni because of the traditional gender roles of his ethnicity?? \"it goes in a pot??\" something about his complete helplessness doesn't ring true. and mon dieu, don't get me started on the catholic thing. if i entered a church now, i would probably go up in flames, but i was indeed raised roman catholic.and i know catholics make for passive and somewhat wimpy heroes (although i saw book of eli yesterday, and that - while not being overall a great movie- had some serious badassery in it) and i totally understand the moral burden of catholicism, but this is survival, son... jesus would want you to have some canned goods. in the apocalypse, breaking into apartments from which the owners have fled is not stealing, it is persevering. you can only turn the other cheek and do unto others for so long, at some point you have to eat.and i see these catholic school kids in the store after school lets out daily. and i assume we get the nerdiest of that population because who else would come to a bookstore to hang out, manga or no manga... but if we are getting the nerdiest of the batch, the kids in this book are not among them. the kids in this book do not exist in the parochial schools of new york. maybe rhode island - somewhere more sheltered and polite. maybe.this is what kills me - the book is called \"wrenchingly plausible\" but it is in no way authentic-seeming, either in voice or occurrences. there are some scenes of mob-mentality, but it all seems like gentle-mall violence, not nyfc. and yes it is teen fiction, but so is hunger games, and that is masterful in its control of violence. and they don't seem too resourceful anyway. after reading three of the brian boks by gary paulsen, i understand teen ingenuity. even though it is fiction, it has the ring of truth - his thought processes and trial-and-errors make sense. this kid doesn't seem like any urban 17-year-old i have come across in my workaday life (including the ones i shoved to get to this book), and his younger sisters are worse than useless.THIS IS WHERE I MAY BE SPOILING SOMETHING IF YOU PLAN ON READING THIS BOOK SO BEWARE AND DO NOT CROSS THIS BARRIER.i don't care how religious you are, you do not shake the hand of the man who offers to pimp out your sister and say \"no hard feelings\". dude! jesus would totally not be into that. he would allow you a little resentment. maybe a kick or two. as long as you repent...also - unrelated to child-prostitution - the same \"out\" was used as was used in the first book, for one character, to be sent somewhere \"better\" for a time, if i am remembering correctly. boo-urns for repetition.but i know that when the third book comes out, i will be pushing teen readers out of the way with a vengeance. and if the moon gets any closer, i will be breaking into your apartments to get at your canned beets. count on it. so stock up.final word: eh."}, {"userName": "Claire", "userReviewDate": "Jan 26, 2008", "userURL": "http://www.goodreads.com/user/show/836167-claire", "userReview": "If I thought Life As We Knew It made me want to create the world's greatest emergency preparedness kit, it was nothing compared to The Dead and the Gone. This book scared the living daylights out of me. After begging a friend for the ARC, I had to put it down instead of reading it straight through in order to avoid nightmares. Premise of both books: meteor hits moon, natural-disaster apocalypse ensues in the form of a collapsed infrastructure, food shortages, epidemics, etc. Life As We Knew It took place in a suburban Pennsylvania town much like the one I grew up in. TD&TG took place in New York City, a city much like the one I live in now. I don't know if it was the urban setting feeling a little too familiar, but this book freaked me out even more than the first one. Let's just establish this right now: if I were ever to have to experience an apocalypse, I probably wouldn't make it. Luckily, Susan Beth Pfeffer focuses on characters much tougher and more resourceful than I am. Alex is a smart, hardworking, low-income, high-achieving junior in high school whose dad has just flown to Puerto Rico for his grandmother's funeral. Disaster hits, and when the power goes out and the city starts to panic, Alex is at home with full responsibility for his two younger sisters. I was most interested and impressed by the elements of this story that weren't mentioned in the first one: Alex's story is shaped by his cultural surroundings, especially power and privilege (or lack thereof) and religion. The gritty details of how he has to survive keep the plot moving, but never overshadow his moral and emotional struggle. I think LAWKI set the stage and told an engrossing, nail-biting story; TD&TG couldn't surprise readers with the premise's twists and turns, but used that to its advantage by offering a deeper and more complex web of responses and relationships. I'm investing in a hand-crank radio RIGHT NOW."}, {"userName": "Juli", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/38617426-juli", "userReview": "The Last Survivors series continues with Book 2 -- The Dead and The Gone. An asteroid strikes the moon, knocking it closer to Earth. Devastating climate changes and natural disasters immediately strike, ending modern society and starting humanity's downward spiral towards possible extinction. Alex Morales lives in New York City with his family. One day they are a happy, large Puerto Rican family....and the next Alex finds himself trying to survive with his two younger sisters. Alone. In a city filled with death and chaos. Can they survive, or will they join millions of others in death?While the actual disaster scenario is pretty much scientifically impossible, this series does realistically portray the impact of a large scale extinction level disaster. Alex and his sisters have to grow up quickly when they find themselves without parents in a city almost completely shut down in an instant. Alex has to learn to scavenge from dead bodies and vacant apartments in order to have food, medicine and basic necessities. Thousands of people are searching for missing loved ones, even searching through unidentified corpses laid out in Yankee Stadium. Dead bodies pile up, leading to illness. Starvation causes acts of violence. The city rapidly disintegrates into a very dangerous place. Alex and his sisters lean on their Catholic faith and the last remnants of hope, as the world falls apart around them. The Last Survivors series is written for YA readers, so there is no graphic violence, sex or bad language. The subject matter, however, is very dark and I wouldn't recommend the series for kids under 13. It might be a bit too much for younger children. As an adult, the series is very thought provoking, making me wonder how my town and my own family would react to a similar large scale disaster. In modern society, we rely heavily on technology for communication, basic necessities and safety....what if all that was removed in an instant? What if life as as we know it was suddenly, and permanently, very different? Where would I turn for hope when things seem hopeless? Just like book 1, this book is in diary form. The story is very well-written and interesting, yet disturbing. Excellent series so far!Susan Beth Pfeffer is the author of several YA books. Check out her blog: http://susanbethpfeffer.blogspot.com/"}, {"userName": "Arlene", "userReviewDate": "Sep 25, 2009", "userURL": "http://www.goodreads.com/user/show/1746727-arlene", "userReview": "I can’t seem to understand why I torture myself with apocalyptic novels such as The Dead and the Gone, because I’m always left with a sense of gloom and despair long after turning the final pages. I read the companion novel Life As We Knew It, and swore I’d stay away from this book because it scared the beejeezuz out of me. Well I saw it on my library shelf just glaring me in the face and daring to be read, so I picked it up like a dummy; and now I want to go to the store and stock up on food, medicine and water in case the world comes to an end sometime soon. Ugh! This book is so scary and surreal, and I really regret reading it. To think this could happen is a real downer.In this novel, the moon is hit by an asteroid causing it to shift from its axis and position itself closer to the earth. This causes disastrous effects such as tsunamis, hurricanes, earthquakes, volcanic eruptions, etc; and all because the gravitational pull from the moon to the earth has been altered. The story is told from Alex’s perspective and through his eyes we read about the suffering people endure because of the cold, hunger and grief that result from this event. Nothing uplifting or fulfilling about this book. Just one big disappointment and loss after another.Overall, I couldn’t enjoy this book. It was depressing and the religious themes wrapped around the storyline really irked me. In addition, there were aspects that l felt were left unresolved including the fate of three repeating characters. And in the end, I felt like the book just abruptly ended. Maybe that was the purpose of this novel; to challenge my religious beliefs and faith and leave me with a sense of foreboding. Grrr! Not something I feel comfortable recommending, and if you do, make sure you have a healthy dose of pick-me-up at the ready."}, {"userName": "beloved books by Tine", "userReviewDate": "Mar 09, 2017", "userURL": "http://www.goodreads.com/user/show/29150557-beloved-books-by-tine", "userReview": "wow.Hier gibt es noch eine Reihenrezensionhttp://lovelybooksbytine.blogspot.de/..."}, {"userName": "Buggy", "userReviewDate": "Jun 29, 2012", "userURL": "http://www.goodreads.com/user/show/3099666-buggy", "userReview": "Opening Line: “At the moment when life as he had known it changed forever, Alex Morales was behind the counter at Joey’s Pizza, slicing a spinach pesto pie into roughly eight equal pieces.”Oh this was good, probably just as good as Life As We Knew It but the shock factor from that 1st book kind of knocks this one down a notch. This is a companion book to LAWKI, that’s right the same exact events from a different perspective. Here instead of reading from the diary of a girl in rural Pennsylvania we get the POV of a 17 year old boy in New York City as he also deals with the aftermath of an asteroid hitting the moon and knocking it out of its orbit. The same apocalyptic events follow; Tsunamis claim the coasts, volcanoes erupt, ash fills the sky, arctic winter sets in followed by food shortages, killer flues and starvation.THE DEAD & THE GONE is equally as realistic and bone chilling as the first book, maybe even more so and also just as fascinating and unlookawayable. Even knowing the turn of events I was going to face this book still managed to shock me and mess with my head. Yup, the OCD is back too, stockpiling food and supplies just in case.Family again plays a key role within this story as does religion, courage and personal sacrifice and there are couple of scenes in that regard that are going to stick with me for a long time. Like when Alex enters Yankee Stadium in the (hopes?) of identifying the body of his missing mother. This scene is terrifying; right from the militant aspect of him boarding the bus to get to the stadium through to the sounds Susan Beth Pfeffer describes inside. I can still hear the wailing, the buzz. And then there’s “body shopping” with his friend Kevin -amazing what becomes normal in an apocalyptic world. I can’t honestly say I was pleased with the ending, it just sort of well, ends without any resolutions or even a feeling of this is a good place to stop for a cliff hanger. I kept turning the page looking for more. Huh did I miss something? Other than that a fantastic, absorbing read.17 year old Alex Morales is a junior in high school when cataclysmic events alter his life forever. Within hours of the asteroid hitting the moon his home of New York becomes an unfamiliar city. Panic sets in as the power and phones go out and Alex quickly realizes that with his father in Puerto Rico attending a funeral and his mother unreachable at her job at a hospital in Queens he is in charge of the care and safety of his two younger sisters. With news of subway floodings and worldwide tsunamis he also has no way of knowing if his parents are dead or alive. Waiting to hear of their fate just added another level of suspense to this story.As summer turns to arctic winter the rich and influential abandon the city, leaving the poor to fend for themselves. Disease and starvation threatens those left behind, food becomes scarce, money no longer has any value and the barter system takes over, what can he trade to feed his sisters for another week? How many tins of food can he get for this watch, this coat, these shoes, this bottle of vodka. How much is this 10,000 dollar winning lottery ticket worth? (A tin of pineapple as it turns out) When his pretty and spirited 12 year old sister becomes something of value Alex has to find a way to get them out of New York at any cost. 318jb4.5"}, {"userName": "Colleen Venable", "userReviewDate": "Feb 18, 2008", "userURL": "http://www.goodreads.com/user/show/61222-colleen-venable", "userReview": "I'm so confused by these books! All the way through I complained and whined, the characters painfully unbelievable and about as dimensional as pancakes, but that said I could not stop reading. If I was making a single copy I brought the book to the copy machine. If I was in the elevator going up one floor, I threw my faces into these pages. I casually snuck paragraphs in between work e-mails, one eye on the ink one on the boss door. Pfeffer is an amazing concept writer, and the concept is what pulls you through this book. The characters are bland, and I'm somewhat amazed and disturbed at how emotionally unaffected it left me. How could so many people die in a book and I didn't even consider shedding a tear? I cry at car commercials. This sequel felt like a checklist of things Pfeffer left out of the first book a) glowingly positive representation of religion b) a city setting c) a male main character with sisters. Check, Check, Check felt way too premeditated. Still, an interesting read and a wonderful conversation starter and a promoter of the power of pineapple."}, {"userName": "Trish", "userReviewDate": "Oct 10, 2014", "userURL": "http://www.goodreads.com/user/show/3461034-trish", "userReview": "It was really hard work to finish this book! I have loved the first volume but in this it felt like even the author couldn't really get into character. :-/Naturally, it didn't help that the characters had medieval worldviews including their opinion about what was \"women's work\" and what was the definition and job of a man! Moreover, the religious fanaticism (I have no other word for it) was excrutiatingly painful. I've read books about religious people before and although I myself am an atheist, it was fine. But this (especially Bri) was too much, almost unbearable and slowed me down a lot. Adding to that, I struggled with the quite unrealistic character of Alex - a seventeen-year-old teenager from a poor Puerto Rican family who is an excellent student, goes to an all-boys catholic school and wants to become the president of the United Stated but has almost no knowledge of volcanoes, earthquakes, the moon and such because prayers are more important (I didn't mind all that much that he was out of his depth often since I think even adults would be if we're honest/realistic).I almost feared the book would be this bad after being warned by some people, but I wanted to see for myself and I wanted to know about Alex' background since he seems to become important in the next book of the series (which actually is volume 2, this was sort of an intermediary story). Well, unfortunately it was almost an entire waste of time. :-("}, {"userName": "Flannery", "userReviewDate": "Mar 07, 2010", "userURL": "http://www.goodreads.com/user/show/652877-flannery", "userReview": "[EVERYONE IS FREAKING GONE OR DEAD LIKE THE TITLE SAYS, BREAK DOWN THE WALLS OF THE DOZENS OF APARTMENTS AND STEAL THEIR SH&T Alex and his sisters are starving to death (literally) and there was probably tons of food and supplies in the other apartments. People in the convoys could only take a bag of stuff--there would be lots left over.The world is going to sh*t? There would be major looting and shooting. I know this a young adult book but Pfeffer isn't afraid to bring in harsh subjects (selling a young girl into basically sex slavery, anyone?)so it surprised me that she left out such an element. I think it would be human nature to rip buildings apart and strip them of everything. It is basic survival. (hide spoiler)]"}, {"userName": "Ashley", "userReviewDate": "Jan 10, 2009", "userURL": "http://www.goodreads.com/user/show/1427042-ashley", "userReview": "The Dead and the Gone  is a strange move for an author and likely a disappointment for readers of Pfeffer’s Life as We Knew It. Described as a “companion novel” to Life as We Knew It, The Dead and the Gone provides no extension of the earlier novel; instead, we see (again) the crises of tsunamis, earthquakes, volcanic eruption, famine, and epidemic disease caused by the moon being knocked out of its orbit. This book covers roughly the same span of time and addresses many of the same issues—both end-of-the-world problem-solving and the ethical compromises and personal growth required to stay alive. Even the rare “high points” of the protag’s difficult existence-—and the near brush with a flu death—-are similar.The book is reasonably well-written, but I can’t help thinking that Pfeffer has simply written the same book twice instead of taking on new territory. Replication aside, the portrayal of a Puerto Rican family emphasizes certain stereotypes of the Hispanic family (rigid gender roles, intense Catholicism, etc.) ad nauseum. Six months into the crisis, the male protagonist can’t figure out how macaroni is prepared: “You use a pot for that, right?” This is supposed to show how much he depends on his sisters, how their work in the home is just as valuable to their survival. But really?"}, {"userName": "Adrienne", "userReviewDate": "Oct 20, 2011", "userURL": "http://www.goodreads.com/user/show/5410164-adrienne", "userReview": "Ok so I was wrong about the whole trilogy thing. What happens in these books, which is actually a cool idea, is the first book is about Miranda in Pennsylvania, and the second book is about Alex in New York, a completely different cast of characters dealing with the same end-of-the-world catastrophe. But I hated this one. First off, I was infuriated by the gender roles and sexism in this book. Alex automatically delegates all cooking and cleaning to his sisters, while he always does the \"manly\" work. At least, he seems to think he's the toughest of them. Toward the end, he even goes so far as to think that it doesn't matter what others will think of how his sisters have managed in this crisis, because since they're \"just girls\" they aren't expected to do anything anyway. He orders his sisters around, even though one is 15 and one is 12 going on 13, definitely able to think for themselves a little bit, or be in charge of their own person. After reading the first book, where the Evans family clearly loved each other and worked as an equal team for survival, this family seems hierarchical and even degrading. Also, even though the dated entry format was kept up, the book is written in 3rd person, so it's unclear who or if anyone is doing the journaling, and so I wonder what the point of continuing the format this way was. Also, it was saturated in Catholicism and God, which I'm not fond of reading just because that's not my view. Especially after reading the first book, which painted a pretty horrible picture of Christianity and God in a time of crisis, it was odd to see the same author set a completely different tone about religion in this book. This all being said, I'm still interested to read the 3rd book because in it, Miranda is again the narrator, but the book deals with what happens when her father, stepmother, half sibling, and Alex (from book 2) shows up at her door, and they get together somehow, although it seems that the relationship doesn't work out. Honestly, I hope not. I don't want to condemn Miranda to being a housewife and being considered \"just a girl.\" Also, I know I'm taking these books too seriously, but I still can't believe that after our strong feminine hero in book one, the male hero of book two is not such a great model."}, {"userName": "Jenn \"Awww Yeaaahhh\"", "userReviewDate": "Mar 12, 2010", "userURL": "http://www.goodreads.com/user/show/580431-jenn-awww-yeaaahhh", "userReview": "This book is a companion piece to Life As We Knew It, and we get to see the same exact events (an asteroid knocks the moon closer to Earth which causes every kind of natural disaster) from a different perspective, this time from a Hispanic boy instead of a white girl, in NYC instead of a small Pennsylvanian town. Their experiences are different enough so that you're not constantly comparing the two even though you have an idea of what's going on. One of the things I liked best about LAWKI was that the science seemed well researched and realistic. Since Pfeffer couldn't wow me with scientific speculations this time around, I had to focus more on the human element, and that fell a bit short when compared to it's predecessor. Seventeen year-old Alex Morales is Puerto Rican, Catholic, smart, serious and an overachiever. His parents are missing and presumed dead almost immediately, and he alone is left to care for his two younger teenaged sisters, Brianna and Julie. I like that he's resourceful and will do whatever it takes to feed his family, including jumping some ethical hurdles despite his strict religious beliefs. The rich and influential are able to get out of town, but the poor are left to fend for themselves and the Catholic church plays a powerful role in their survival, representing the moral center. (This strong moral belief comes into play in the third book.) But the church can't pull bread and fish out of thin air, so there are a lot of desperate, starving and sick people in the city. And this is where I stopped believing a little bit. Yes, Alex resorts to some morally questionable activities, but I just think that in a big, bad city things would get worse. A lot worse. Even if it wasn't Alex, there would be a lot of other people doing really bad things. Instead, people are calmly waiting in the free food line (save for the one riot we saw), law enforcement isn't an issue, and it's safe to walk the street as long as you have your big brother around. If you don't, a can of pineapples will suffice. Also, there is some ethnic stereotyping (apparently Hispanic males can't cook mararoni, even a potential future President of the United States, but they sure can yell at their little sister!) and one far-fetched plot point I didn't like, which is why wouldn't Alex, as super (his dad) of the building, have keys to the rest of the apartments?? Unlikely.Besides all that, the story is still compelling and scary and bleak and hopeful, and if you liked the first one, you'll probably like this one as well."}, {"userName": "Lisa Vegan", "userReviewDate": "Jun 06, 2008", "userURL": "http://www.goodreads.com/user/show/83445-lisa-vegan", "userReview": "I enjoyed this book almost as much as the author’s companion book Life As We Knew It, which was a pleasant surprise as I did not expect to like it as much. It’s riveting.The two books together make for very interesting reading as both detail what happens to different families during a natural disaster that causes the moon to move much closer to earth, causing cataclysmic changes. This book differs in that it’s not told in diary form by a suburban middle class teenage girl but in third person from the vantage point of a working class Catholic teenage boy in New York City. Her characters are ones I really cared about and her stories are so vivid and realistic.This one was even grimmer than the other book.It also had a somewhat open ending. I’d like to know what happens in the future to each of the families and it would also be interesting to have a book from the point of view of brand new characters as well. This author is remarkable and I wish these books had been out when I was a young adult. She’s got a real knack of writing for those who are 12 & up.The books also had a sobering effect on me; this one solidified my belief that I would not be one of the survivors, given my level of internal strength and especially considering that I’d be lacking extra support from the outside that these characters had. It’s a very thought provoking read. And even though I knew her formula somewhat from reading the other book, the suspense was enormous."}, {"userName": "Justine", "userReviewDate": "Apr 06, 2015", "userURL": "http://www.goodreads.com/user/show/7617291-justine", "userReview": "Toujours aussi bon !! Je vais devoir attendre jeudi après-midi pour lire le tome 3 T_T"}, {"userName": "Regina", "userReviewDate": "Nov 30, 2011", "userURL": "http://www.goodreads.com/user/show/3104032-regina", "userReview": "[Alex’s father is the super to the building they are living in, yet Alex doesn’t have access to the keys to the other apartments to search for loot? The electricity is intermittent yet when it comes on they still ride the elevator? Isn’t that just begging for death? Alex’s sister is asthmatic, yet he moves them to the twelfth floor in a building without electricity? Why didn’t Alex explore the apartment buildings nearby that were obviously empty and abandoned? Why didn’t he look for car keys and attempt to take abandoned cars parked in garages? I think actions like this are what someone in a similar situation would have done. (hide spoiler)]"}, {"userName": "Megan", "userReviewDate": "Sep 08, 2010", "userURL": "http://www.goodreads.com/user/show/1233686-megan", "userReview": "The Dead and the Gone pretty much sums up this entire book. Everyone in NYC is either dead, gone or soon will be. Asteroid hits moon, earth goes through nasty changes, everyone dies, the end. But wait, you ask… what of the hard core survivalists? I’m sure they are out there somewhere, but they are certainly not in Susan Beth Pfeffer’s second book of her Last Survivors series. This is a shame, because this YA novel started off so good. In The Dead and the Gone we follow the story of Alex Morales, a Puerto Rican teenager living in NYC. Although it will take you awhile to figure this out, everything you need to know about this kid can be learned from his last name. Morales: \"Son of Moral,\" a given name meaning \"right and proper.\" (per some random website about genealogy and surnames. What, internet research isn’t real research? =)) Anyway…. This kid has morals. And the strength of the Catholic Church. And a whole lot of problems that could have been avoided if only he wasn’t so stupid opposed to looting breaking and entering. At some point while reading this book, I glanced at the back and noticed a blurb that said, “for ages twelve and up” and really, that is the real problem here. Pfeffer is writing for a very young audience, not the current older teen/young adult audience that is often aimed at these days. For all of the complex issues and situations presented in The Dead and the Gone, tough conversations are completed neatly and quickly, difficult situations are easily gotten out of, angsty things are not angstly dwelled upon. Rather than an age suggestion, this book sould have been given an “Apocalypse PG13” warning. The first book in this series, Life As We Knew It was, despite its flaws, fantastic. So, I raised the bar a little for this one because the second should always be better than the first, right? Unfortunately, it wasn’t. It was just more of the same. Asteroid, starvation, flu so strong it causes delusions. Been there, done that. What makes this one worse is that Alex is presented as a poor kid who has to make his own fate in order to be successful. But he makes a lot of idiotic decisions and passes up fantastic opportunities because of pride and Catholicism. I’m a sucker, so I’ll read the third and final installment of this series. But I don’t recommend these books for adult readers of YA, unless of course you are looking for some serious fluffy brain candy ;)Update 12/11/11 Having read, and been severely disappointed by author Susan Beth Pfeffer's Blood Wounds, I actually will not be continuing this series. I have learned that while this author is great at creating fucked up situations, her character development is nil. I'm moving on."}, {"userName": "Yulia K", "userReviewDate": "Jan 31, 2016", "userURL": "http://www.goodreads.com/user/show/42860897-yulia-k", "userReview": "More like 4,5* but closer to 4. I felt like something was missing. Maybe because is the sequel many things were just thrown in there. Overall I really liked it but it was one of the saddest books I've read. The characters all have to grow up so fast and this time there wasn't a mother to tell them what to do and do all the planning. But they survived.And New York ... I love this city and I knew exactly where all the streets from the book are. It was kinda weird to see this city in position like that. An as always I was holding on to the thought that there will be still hope in the end. That's what those books are about. :)"}, {"userName": "Jianne", "userReviewDate": "Nov 23, 2011", "userURL": "http://www.goodreads.com/user/show/4712378-jianne", "userReview": "The Dead and the Gone has not made it up to my expectations especially after loving Life As We Knew It. I'll talk more about the problems that I found in the book rather than the ones I liked (which were fewer actually)Alex Morales is a seventeen-year-old Puerto Rican New Yorker whose parents disappear in the aftermath of the tidal waves, must must now care for his two younger sisters, Julie and Brianna even when hope seems all gone.The novel explores on how a young man takes on unimaginable responsibilities. Do I agree with that? Yes and No. Well, first of all Alex is not really going to be your ideal elder brother, I'm sorry but that's what I think. Why? The most important of them all of that he doesn't treat his sister equally. He prefers Brianna over Julie, though I understand why. Julie really is annoying. But c'mon, it's nearly the end of the world and he still has to choose favorites. I just feel that if he had to choose whom to save of course he'd prefer one over the other, right? And it's just really pissing me off. Being the eldest can be such a responsibility in times like this especially but show your sisters that can look up to you and really trust that you won't let anything happen to them. But that's not what I see. I have an elder brother too though I'm the middle child and the only girl, my brother treats me and my younger brother equally so not complaints.Another factor is that the love-hate relationship between Alex and Julie. First he'll shout at her then he'll say sorry, then he'll hurt her then say sorry then she'll get mad at him then she'll say she's sorry and the cycle goes on you know. And it's just really annoying because I know in times like this you really feel like you're going to give up and two sisters depending on you true but like a said, a responsible brother would know how to act besides they're all in this together, that's why he has a sister all his burden he can share it with them he doesn't have to carry it alone now will he?I just feel that there is really no hope in this book, it's more devastating and desperate than the first book. And that idea of body shopping, I don't think that in that actual situation that's really gonna happen, people are desperate for food they won't just give it away. Money is not a problem here anymore. It's just food, shelter, medicine and survival.I just really can't connect with the characters. At all. The beginning is fine then it just dropped because of the characters not the plot entirely. Brianna's annoying, Julie's annoying and Alex's annoying. And all the other characters as well. Nothing really much to like about now is there?And I don't like the third person narrative here, I guess it would've been easier to connect with Alex's character if it was first person narrative. And Julie and Brianna's name doesn't match with the Alex, Luis, Carlos and Isabelle's name which seems more Puerto Rican.Alex, Luis and Carlos. Wow. Reminds me of the Funetes brothers much, from Perfect Chemistry well, I realized how much I miss them!Anyway, The Dead and the Gone really is dead. There's almost no happy moments really. It's too depressing and despair is all in the book. Three stars really because it's not really that bad, depressing and all I can take that, the plot's fine it's really just the characters really.And comparing it to other books that I've rated three stars, they're pretty much on the same track."}, {"userName": "Josie", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/21250-josie", "userReview": "Ugh, this should have been a DNF, but I didn't want to skip this and go onto #3 in the series just in case there was some context I missed out on, or characters from this book that show up later. But god, it was awful. The third person POV just didn't work -- there was literally NO EMOTION the whole way through -- and the storyline (asteroid hits the moon, world thrown into chaos) was pretty much identical to Life As We Knew It. What was the point of going from the beginning again? As a reader, I already knew what was coming, but for some reason Alex was ridiculously uninformed. Random characters kept popping up to say things like \"Have you heard about the tsunamis/volcanoes/epidemics/etc?\" WHY YES, I BELIEVE I READ ABOUT THAT IN BOOK #1.Also, Alex is possibly THE MOST chauvinistic character I've come across. I kept thinking how much he didn't deserve to live. He thinks it's perfectly okay to hit his younger sisters, because he's the man of the house now! And that's how he's going to keep them in line!At one point Alex throws a paddy because his shirts are dirty. Yep, in a post-apocalyptic world he worries about looking nice. So he whines to Julie that she should do a better job washing them (without electricity, and oh by the way she is TWELVE YEARS OLD) and when she says, um hey I have an idea wash your own freaking shirts he grabs her and threatens to withhold food from her. What a great brother!And later, when Julie is all \"you do realise I do all the cooking and cleaning, right?\" Alex's chivalrous response is \"but I thought you liked cooking and cleaning, and how hard is it anyway?\" UM DID YOU MISS THE BIT WHERE THERE IS NO ELECTRICITY? IT IS HARD, OKAY.There's a great line near the end when Alex thinks about \"how often he'd felt burdened by his sisters.\" Oh, you mean the sisters who do your laundry, your cooking, and your cleaning -- those sisters? What a burden they've been! ARGHHHH."}, {"userName": "Dave S.", "userReviewDate": "Jun 13, 2008", "userURL": "http://www.goodreads.com/user/show/687033-dave-s", "userReview": "Life as we Knew It was an amazing novel, and this was an amazing a terrible completely got that me convinced that Susan Beth Pfeffer was an amazing author a terrible author, At first, Pfeffer paints a realistic and exquisite picture of a latino family, which slowly starts to tear apart after a near-apocalyptic disaster. At first, the book is completely believable, as are the characters, but slowly, the characters become far to unrealistic. Too religious, too understanding, too oblivious, etc. And soon enough, it becomes near unreadable. Will the fifteen year old girl start acting her age and stop being called Brush? NO! Will Alex stop stealing from the dead even though he thinks it is sinful? No! Will Kevin stop reading Playboy? No! And (spoilers...) Will they all survive? NO! There. I just saved you from reading a terrible crapload of a book. And quite frankly, I don't care. As much as I tried to like this book, I just couldn't. And I later realized it was terrible."}, {"userName": "Kimberly", "userReviewDate": "Aug 31, 2016", "userURL": "http://www.goodreads.com/user/show/30144492-kimberly", "userReview": "I was sucked in to this story like a whirlwind. I loved it! I thought this book was better than the first one, \"Life as We Knew It\"... This second book in the series takes place in New York City and involves a Puerto Rican family. The moon is knocked off its axis as in the first book and terrible things start to happen to the earth. Its up to the oldest kid in the family to be the \"man\" of the house now. Mom and dad have not been heard from and no idea if and when they will return when the disaster hits. So, 17 year old Alex has to take care of his 2 younger sisters. What they go through was nothing short of epic. Survival of the fittest. The book is fast paced and never has a dull moment. I look forward to book 3."}, {"userName": "Sioape Likio", "userReviewDate": "Sep 04, 2015", "userURL": "http://www.goodreads.com/user/show/46403506-sioape-likio", "userReview": "This book was good but It would be better if it had gunshots. The gun wasn't even useful in the story , and I'm glad Kevin died. N.Y is bad luck. I like how Alex took care of his sisters and bri has a strong faith."}, {"userName": "Nancy", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/14386326-nancy", "userReview": "The second in the series, we meet Alex and his sisters in NYC, who are coping after the apocalypse. After many unrealistic adventures, they make it out of the city and into the countryside. What are the odds that they will meet Miranda's family?"}, {"userName": "Brenda Ayala", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/9873129-brenda-ayala", "userReview": "So I think I read a different book than all the other reviewers on here, because I was eternally irritated and pissed off at our protagonist. Alex is misogynistic, a bully to his sisters, and a little bit of an idiot despite supposedly being one of the best in his class.Who doesn’t know how to boil water!?He has a problem using keys to get into abandoned apartments and going into his parents room, but no qualms about going through dead bodies’ pockets? He refuses to communicate with his sisters and let them know what’s going on, then hits them when they question him? Fuck you, guy.Father Mulroney was an idiot. “Yes kids, please study Latin while you starve.”Suffice to say at this point that I did not like it and all the characters annoyed me."}, {"userName": "Jenny", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/3022242-jenny", "userReview": "This sequel was just as good as the first book! I really love this series. The format and the writing just make the whole thing feel so real! Its a very scary book. At the same time, you just fall in love with these characters. Definitely recommend this one if you are a lover of Post Apocalyptic."}, {"userName": "Amber", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/234533-amber", "userReview": "[Side Note: One thing in the book that drove me crazy in this book was the use of elevators. With the power being so unreliable and almost never working, they would still use the elevators in their building when the power was on. Weren’t they ever afraid of getting trapped without food or water? Then Alex’s sister dies in this exact way in the elevator and they still continued to use it. How dumb can you be? (hide spoiler)]"}, {"userName": "Sheena  at Hot Eats and Cool Reads", "userReviewDate": "Nov 10, 2010", "userURL": "http://www.goodreads.com/user/show/2718510-sheena-at-hot-eats-and-cool-reads", "userReview": "http://www.hoteatsandcoolreads.com/20...I love when you read a series, and the second book is just as good as the first. This book follows Alex, a teen who lives in New York City, when the Asteroid hits the moon. His struggle is much different than Miranda's, from the first book in the series, Life as We Knew It. Alex's parents disappear in the madness and he is responsible to take care of his two younger sisters. Imagine being so hungry and desperate, that you need to steal valuables from dead bodies to survive. This is Alex's new life. What these characters have to go through is unimaginable. This book is a page turner and I could not put it down. I highly recommend this series to anyone who loves apocalyptic books. Don't let the \"Young Adult\" label fool you. These books are for everyone who enjoys a great read!"}, {"userName": "Hayden", "userReviewDate": "Apr 12, 2008", "userURL": "http://www.goodreads.com/user/show/92056-hayden", "userReview": "If I had read this one first, I might have liked it better than  Life As We Knew It. As it was, I was already hip to the premise: asteroid hits moon, knocking it into a closer orbit of earth and unleashing massive worldwide environmental devastation.But unlike the first book, which was set in the burbs, this one is set in NYC, and told from the point of view of a Puerto Rican kid trying to look out for his two younger sisters in the absence (and likely deaths) of his parents and older brother. I liked the characters, and of course I always love a good apocalypse.I also liked the way this book handled faith--the characters are Catholic, and their faith is just a given. Unlike most teen books that deal with faith, it's neither about finding God nor about a spiritual crisis. It's just part of the fabric of their lives."}, {"userName": "Jess", "userReviewDate": "May 27, 2008", "userURL": "http://www.goodreads.com/user/show/271355-jess", "userReview": "This companion to Life as We Knew It is much darker - perhaps because, even though this is set in a different place, the reader knows a little bit about what will happen. And, unlike the narrator in LAWKT, who is allowed to enjoy herself a little before things go downhill (and they always go down hill when the moon is pushed closer to the earth), Alex is thrown immediately into the horror of what has happened. This has the same tension as the first one, or perhaps more, and was just as difficult to put down once I'd start. Recommended to teens (or adults) looking for a gripping story of survival. Warning: a few gruesome scenes, plus reading the story may lead to hoarding of canned goods."}, {"userName": "Kimberly Russell", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/5818430-kimberly-russell", "userReview": "This is part two in the series. It's the same event, the moon shifting closer to Earth and throwing everything out of whack but this one takes place in New York. I liked this one better for a lot of reasons. In part one the main character is a tiny bit annoying and in this the protagonists is smart and strong willed and I was really rooting for him the whole time. I didn't feel as panicked when I read this one, I just kept holding my breath when unfortunate things kept happening.I can’t wait to read part three."}], "description": "Susan Beth Pfeffer’s Life as We Knew It enthralled and devastated readers with its brutal but hopeful look at an apocalyptic event--an asteroid hitting the moon, setting off a tailspin of horrific climate changes. Now this harrowing companion novel examines the same events as they unfold in New York City, revealed through the eyes of seventeen-year-old Puerto Rican Alex Morales. When Alex's parents disappear in the aftermath of tidal waves, he must care for his two younger sisters, even as Manhattan becomes a deadly wasteland, and food and aid dwindle.With haunting themes of family, faith, personal change, and courage, this powerful new novel explores how a young man takes on unimaginable responsibilities.", "title": "The Dead and the Gone\n      \n          (Last Survivors #2)", "url": "http://www.goodreads.com/book/show/2169506.The_Dead_and_the_Gone", "average": 3.84, "cover": "https://images.gr-assets.com/books/1266309782l/2169506.jpg", "reviews": 3096, "authors": [{"url": "https://www.goodreads.com/author/show/1318.Susan_Beth_Pfeffer", "name": "Susan Beth Pfeffer"}], "type": ["Young Adult", "Science Fiction", "Science Fiction", "Apocalyptic", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/2169506.The_Dead_and_the_Gone", "http://www.goodreads.com/book/show/10518197-die-verlorenen-von-new-york", "http://www.goodreads.com/book/show/7024174-the-dead-and-the-gone", "http://www.goodreads.com/book/show/8203319-the-dead-and-the-gone", "http://www.goodreads.com/book/show/11849201-l-exil", "http://www.goodreads.com/book/show/9478415-the-dead-and-the-gone", "http://www.goodreads.com/book/show/213753.Life_As_We_Knew_It", "http://www.goodreads.com/book/show/6393972-this-world-we-live-in", "http://www.goodreads.com/book/show/17165913-the-shade-of-the-moon", "http://www.goodreads.com/book/show/8440028-blood-wounds", "http://www.goodreads.com/book/show/458480.The_Year_Without_Michael", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}