{"ratings": 636, "userreviews": [{"userName": "James Barker", "userReviewDate": "Feb 05, 2013", "userURL": "http://www.goodreads.com/user/show/9049915-james-barker", "userReview": "Bristling with the threat of violence from the outset, the opening chapter is one of the most disturbing and claustrophobic I have read. The father in the book is a bitter man, his moods uneven and extreme, and as a consequence his children live in fear of him and punish him the only way they can- by shutting him out of their lives as much as possible. His feeling of isolation is something that compounds the misery within the farmhouse walls; it begets isolation in each of his kids, although the book concerns itself chiefly with the son's perspective. A prominent theme is the difficult relationship between father and son, and there is certainly a feeling that Mahoney (the father) is clinging to the strength of youth, and the power over his son, when it is slipping away. His son is strengthening as he himself is becoming older and tired. It is a power struggle that blights many father and son relationships at the time when sons become young men.Beyond that, there is another struggle that McGahern is eager to recount: sanctity and its promise of eternal life battles the quick, hot promise of release from sexual need. One of the reasons this book was banned in Ireland is the author's suggestion that the line between sanctity and sex is blurred. Priests are meant to abandon life for life-in-death but in The Dark it is inferred that they are involved in sexual abuse. There is also the implication that Mahoney himself is abusing his son.The journey within the book does include some resolution, an element of peace and forgiveness between the son and father. But the mid-twentieth century Ireland detailed in the book is a dark place rife with poverty and abuse, where the taint of childhood can never be absolved. A nervous child becomes an adult who lacks confidence in himself and his abilities. Darkness begets darkness."}, {"userName": "Gearóid", "userReviewDate": "Nov 09, 2013", "userURL": "http://www.goodreads.com/user/show/8676809-gear-id", "userReview": "This is probably the most intense and sad book I ever read.From the very first page you are drawn into a really nastyand uncomfortable scene which really sets the mood in a veryhard and upsetting way.At this point you realise the title of the book is just perfect.This book is not an easy book to read as it mostly tells ofthe relationship between a tough,hard and abusive father andhis adolescent son.But it is absolutely brilliant!!!!!I have never read anything so powerful that left you with a lumpin your throat in numerous scenes.At times you feel sad for the children living in the rain of terrorwith there father but you also feel sad for the father who justfinds it difficult to be in any way happy.It was just brilliantly written and i really think McGahern is one of theGreat Irish writers."}, {"userName": "Conor Mcvarnock", "userReviewDate": "Sep 29, 2014", "userURL": "http://www.goodreads.com/user/show/6948668-conor-mcvarnock", "userReview": "I began reading The Dark for banned book week as it had been banned in Ireland and it is easy to see why the book made them uneasy. It is a bleak window into the world of the Irish adolescent male in the middle of the century in rural Ireland, its a story about a young man who in spite of the many things he has going for him, ends up crushed under the wheel of the society that bore him. It deals frankly with many controversial subjects, adolescent sexuality, parental abuse (it contains possibly the earliest depiction of sexual abuse by a parent in Irish literature), and ranks along side Kavanagh's The Great Hunger as a masterful depiction of the psychological damage Irish society and the Catholic church wrought on the human population that must have been dynamite when it was first published back in the 60s.It captures the longing and frustration of the un-named protagonist and centres on his complex relationship with his father. The father is a very real depiction of an abusive parent, apparently based on McGaherns own father. It captures the double-bind relationship very well, the push-pull of the love/hate dichotomy between father and eldest son. One also gets a sense of the inner turmoil, conflicts and contradictions within the father himself and how these visit themselves on the protagonist. Women are largely absent from the narrative and mostly appear as idealised reflections of the narrators longing and fevered imaginings. The sole exception to this is the sister, Joan and the few flecks of light in the book are in the scenes between brother and sister.Its written in a powerful, unrelenting style, mostly in the second person which gives it an immediacy and intimacy. It does sometimes break into the close third person, which alienates and disorientates the reader and reflects the protagonists own alienation with himself. Its a neat trick well played. The authors use of language is stark though some of the descriptions of places and scenes verge on the poetic, albeit a dark terse poetry.Recommended for any readers of serious literature."}, {"userName": "Marcello S", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/38785158-marcello-s", "userReview": "A metà la mia aspettativa era che si trasformasse in un horror col padre che ammazza tutti e li fa morire proprio male. E come molte aspettative ha fatto quella fine là. Niente da fare. [56/100]"}, {"userName": "Kusaimamekirai", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/33921897-kusaimamekirai", "userReview": "John McGahern is one of those wonderful writers who while somewhat appreciated in their time, (his excellent novel “Against Women” was shortlisted for the Booker Prize) never achieved the fame they deserved.  “The Dark” is my second McGahern novel after “Amongst Women” and as the title aptly puts it, is very dark indeed. Much like in “Against Women”, one of the focal points of the novel is an overbearing, tyrannical, and abusive father, raising children on his own. In “Against Women the father figure was verbally and physically abusive, while here the father certainly is those things but there also lies a very unpleasant undercurrent of sexual abuse as well. The reader never knows the full extent of what happens between father and son but being as how the novel is told from the point of view of the oldest son, we have a pretty good idea and it is deeply unsettling. Layered on top of this is this abuse of his sister at the hands of an employer and the uncertain intentions of a local priest.  With all of this, it’s perhaps unsurprising that this novel was banned in Ireland soon after its release in 1965. And yet it would be a mistake to fixate only on the dark sexual and religious undertones here. At heart, this novel is really about a teenage boy struggling to escape from his father and his rural upbringing. It’s about his mental anguish as to whether to join the priesthood, go to University, or just disappear to England as so many young and lost Irishmen were doing at the time. Told from shifting perspectives (always told from the boy’s point of view but the narration often switches between “he” and “you” and “I”) the reader keenly feels the uncertainties and pressures of youth and the struggle to find your way in an often hostile world."}, {"userName": "Natalie", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/15843653-natalie", "userReview": "Like reading an Irish Yates"}, {"userName": "Doug", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/25667717-doug", "userReview": "I'd never heard of McGahern, or this book, until it was favorably mentioned in my favorite book of the year (so far), John Boyne's brilliant 'The Heart's Invisible Furies' - and the fact it had been banned seemed immediately intriguing (presumably for a few iterations of the F-word, and the suggestion of father/son sexual abuse). In truth, the book is a fairly straightforward account of a young boy's maturing into young adulthood amongst the typical constraints of a rural Irish Catholic upbringing. Although there is nothing particularly noteworthy about such, the writing is terrific, and the book moves quickly towards its emotionally satisfying, although somewhat bleak, conclusion."}, {"userName": "Elaine", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/27213617-elaine", "userReview": "It's not a reading experience for everybody, but if you attempt it, it is eminently worthwhile and utterly unforgettable. This was quick, and riveting, and hard, and beautiful. Story of a boy becoming a man, as the oldest in a family held together by an angry and hurting widowed father. Who loves. But in a way that seems so backwards and thwarted to me. Very spare, and well told. With grace and sadness throughout."}, {"userName": "Disha Bose O'Shea", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/20683895-disha-bose-o-shea", "userReview": "I was introduced to this book when we read its first page at a workshop, and it had me hooked. From the first words, McGahern was able to mirror the dark, claustrophobic and oppressed world of 1960’s rural Ireland. The story begins with a father forcing his son to strip for allegedly cursing, bend over a chair and await thrashing, while his siblings watch in terror. It’s a coming-of-age novel, a bildungsroman in its traditional sense but unlike one that you might have read before. The book was banned upon release, forcing McGahern to quit his teaching job and flee to England, for daring to write about the truths of his society. About the hypocrisy of the Irish Catholic church, the violent physical and sexual abuse, incest and the hopeless yearning for freedom.The book is well written, undoubtedly the work of a master storyteller and a skilled writer. McGahern is able to switch with ease between first, second and third person perspectives within the Chapters, which pleasantly will not throw the reader off. I implore you to get your hands on this book. Why you should read it:Because it is an important book, no matter which country you belong toIt is a difficult book to read, only for its subject, but one is rewarded with a haunting portrayal of reality Why you shouldn’t read it:If you might be left squeamish by some graphic scenes of violence or sexual abuseIf you’re looking for an easy light read"}, {"userName": "A. Mary", "userReviewDate": "Feb 03, 2012", "userURL": "http://www.goodreads.com/user/show/7567055-a-mary", "userReview": "In this novel, McGahern shows a motherless family ruled by a violent narcissist. There is no counter to his demands, and the children are almost completely cowed. Mahoney's relationship with his son is disturbing, and the boy's development is a terrible slog. He studies to the exclusion of all else except his ordinary adolescent lusts, and is torn between his desire for a sensual life and his possible vocation in the priesthood. Everything is done with the goal of ending his dependence on his father, but near the end of the novel, this is complicated by the fact that the boy has very little experience with decision making. In some ways, this is the story of many adolescents, in terms of fear and guilt and shame, but it has the addition of harsh situations that most don't face. The book was banned in Ireland, and McGahern lost his job as a teacher."}, {"userName": "Carlos", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/7211477-carlos", "userReview": "En esta bildungsroman poco al uso, McGahern expone con una crudeza explícita pero encubierta por la perspectiva de la narrativa, la evolución del maltrato hasta el perdón. Mención aparte merece la acusación nada encubierta de connivencia y voyeurismo de la Iglesia Católica, dejando claro que la connivencia con los casos de abuso infantil no han sido algo anecdótico. Será cosa del perdón.Impresionante la utilización de las perspectivas del narrador, que cambia de persona y posición, e incluso desaparece, en distintos momentos de la historia con propósitos dramáticos. Y por impresionante quiero decir impresionante.Le falta para la quinta estrella un poco de claridad en el tramo final, que está desvaído por el peso de un primer capítulo devastador en factura e historia."}, {"userName": "Booklovinglady", "userReviewDate": "Jul 25, 2014", "userURL": "http://www.goodreads.com/user/show/5986596-booklovinglady", "userReview": "For a review in Dutch, see message 111 of the Summer Challenge 2014 of the Netherlands & Flanders group."}, {"userName": "Kerry", "userReviewDate": "Jun 10, 2007", "userURL": "http://www.goodreads.com/user/show/124904-kerry", "userReview": "Finally finished this. Not amazing, but enjoyable and very Mcgahern."}, {"userName": "Nadalkaz", "userReviewDate": "Sep 16, 2008", "userURL": "http://www.goodreads.com/user/show/1510358-nadalkaz", "userReview": "Disturbing and extremely claustrophobic this isn't a comfortable read but it's brilliantly written with a shifting narrative structure that feels completely uncontrived."}, {"userName": "George", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/10168276-george", "userReview": "4.5 stars. A coming of age story about a young man with six siblings, growing up on a small farm in country Ireland. His widower father is quite a brutal, harsh, hard working man who loses his temper frequently. The children live in fear of the sudden eruption of their father's temper. The writing style is plain, concise and well constructed. This is my fourth McGahern novel and whilst my favourite is Amongst Women, this, his second novel, is quite a powerful, realistic novel that reads like a memoir and is loosely based on McGahern's own upbringing. This short story, 191 pages, is highly recommended."}, {"userName": "Mikayla", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/5447158-mikayla", "userReview": "I picked this up at a used bookstore during one of my travels. I was excited to read something Irish, but was disappointed when I found myself sitting in a pile of pages about a boy feeling bad about himself for masturbating, fucking his priest's mattress, daydreaming about raping a girl at church, and studying for an exam (he talks about studying for 70% of the book and we get to see him take the exams and the after effects for a remaining 25% and the final 5% he says \"fuck it, it was all for naught!\")."}, {"userName": "Chris Miller", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/20764251-chris-miller", "userReview": "[ The ending messed me up a little. (hide spoiler)]"}, {"userName": "Anji", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/70120231-anji", "userReview": "My interpretation of the book is that the title refers to Catholic guilt. Interesting father and son relationship and fascinating to see how the boy develops as he grows up. The bit where he agonizes over going to the dance is really beautiful and painful."}, {"userName": "Zeusthedog", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/12452141-zeusthedog", "userReview": "Crescita e formazione nell'Irlanda rurale povera. Ben scritto."}, {"userName": "Claudia Putnam", "userReviewDate": "Nov 30, 2013", "userURL": "http://www.goodreads.com/user/show/4162791-claudia-putnam", "userReview": "It KILLS me not to be able to give this 5 stars. I thought until about halfway through that I'd be giving it 5. But then it started to get sloppy. The writing, I mean. I felt an editor should have intervened. Weren't these the glory days of editing still, when editors were making writers the men and women they were? Well. It's a good thing McGahern was so talented on his own. One of the interesting things about this book, as others have said, is the way he shifts POV from 3rd to 1st to 2nd, while always staying with the one main character. Mostly that works well. He doesn't trouble to keep it even--one chapter of each, say, or two. But sometimes I did feel that he left it too long with one or the other, and I couldn't see why, and maybe in one or two chapters he even switched midway, and again that seemed unnecessary and messy. Again I yearned for the absent editor. Overall though, are these Irish guys born knowing how to do this kind of thing? And another thing I admired: the way he keeps the story so close--he shows rather than tells nearly throughout. It's very stark and bare. Most of the Europeans prattle on and on with summary, but he keeps you under the skin rather than inside the head. Biggest reason for the ding--all the children who appear out of nowhere halfway through the book. In the first part of the book, there is the main character, the eldest son, and his two sisters. That's it. The sisters share a room, and he shares a bed with his father. No mention of any other kids. This boy lost his mother when he was I think 8. The father has not remarried and abuses at least the son when he is \"in need of love.\" (Another of the book's strengths, and this is no small matter, is that things like physical abuse, alcoholism, what is probably bipolar, and incest--all covered by now in so many novels and memoirs, can be so well handled here that they have all the darkness and power of fresh revelation). Then the boy goes to high school. He spends a week away with a priest (and some say was abused by him as well, but it seemed quite clear to me that although the boy feared this would happen, it did not), picks up his sister (who HAD endured some sort of sexual torment) and returns home. In that time, the children in the home have multiplied to untold numbers. They also seem to be quite young. The math does not work out if his father stopped producing children after the boy was 8, the boy was the eldest, and the boy is now 18. I thought the mother died of cancer, which would imply no babies in the year of her death, but for the sake of argument, let's say the youngest kid is 10. It doesn't work with the types of toys and chaos described in the second half of the book, or with the way the room layouts were described in the first half. Anyway, these kids just appear like something in a Monty Python movie and it drove me so nuts and I nearly took off 2 stars.I can't decide how I feel about the ending. On the one hand he'd been so determined. On the other, there is all that weight dragging. Not only the father, but all the dark, all the history, class, the inertia of Ireland. What is to be done? What is to be dreamed of? He had something he wanted to leave, but never, really, was there a dream drawing him on. How far do you get when it is only the dark you are trying to escape? We in America often romanticize Ireland, but what is it we imagine? WHEN is it we imagine? This book was banned in 1965, just as Ulysses was banned in 1918. What was it banned for? Oh, for mentioning that priests-to-be masturbated a lot. And that fathers beat their kids in Ireland, and maybe abused them, and that shopgirls who were sent to live with the families they worked for might be at the mercies of the fathers there, and that when you asked the priest or your own father for help with that, you were told it was best to leave it be. If one stops to think about it, then, the Church was just a part of it, just a corner, of a whole system. A paralyzed country, where no one could move--there are no jobs, it doesn't matter for the most part how well you do in school. Only two children from the county will go on to University, apparently an improvement over days gone by. One or two might make priest, which apart from the sex is a good life (it's the life his father wants for him, and it's possible his father was grooming him sexually for it), maybe one will teach. Otherwise, it's back to the hardscrabble farm, or, for the girls, the shops. Or menial work in England. This is 1950 something, 1960. And the best you can hope for is the IRA wins and you have a MORE Catholic state. Grand. This is bleak, more bleak than Alice Munro. And THAT'S what got him banned. Revealing how devastatingly hopeless life in that society was. I doubt it was *really* the sex."}, {"userName": "Paul Clayton", "userReviewDate": "Jun 09, 2011", "userURL": "http://www.goodreads.com/user/show/3783933-paul-clayton", "userReview": "I finished the acclaimed Irish novel, The Dark, by John McGahern, while on a vacation to Waikiki, Hawaii. And, yes, ‘tis (dark). The book begins with an enraged father forcing his young son to strip, then bend over a chair to await the sting of the belt, while his younger siblings watch in terror. It goes on a few chapters later to show the boy and father in bed together. Family members sharing a bed was not uncommon in the early part of the last century (nor is it today in economically-challenged countries. But on this night, the father was in a ‘loving’ mood. Later the book concludes with father and son sharing a bed in a rooming house when the father visits after the son has grown up and gone away to college. How can this be anything, but dark? That said, it’s a worthy read, compelling and illustrative of certain truths, one being that love, or something strangely resemblant, can and does exist between two people in an abusive relationship. Truth number two: while the previously-mentioned truth was probably common in olden times before people were exposed to the liberating influences of modern Freudian Psychology and its therapies, it is rare today, probably only existing in social backwaters and old cultures.I found myself unable to leave The Dark’s tortured pages while in sunny Hawaii (I only had the final two chapters left to read). I’m not a sadist or a masochist, but the book is finely written and realistic, exposing the realities of some families’ lives that are often repressed, denied, or allowed to scar over. And there is the author’s Catholicism and my own (albeit, lapsed), and all its attendant guilt and fear. The ultimate authority figure in 1960’s Ireland (excepting God and the Pope), the priest, also abuses the POV character in an almost surreal scene bringing to life the power imbalance between cowed believers and venerated God-go betweens. The Dark so effectively depicted such things that it was banned in Catholic Ireland when it was published in 1965. I, for one, was never abused by the Catholic priests where I went to school, nor did I know of anyone who was. But, sadly, nowadays, tales of clerical abuse are so common they scarcely cause a yawn.Finally I had ‘closure’ with the book. Yes, closure, because that’s one of the payoffs of good literature, especially good ‘dark’ literature. After pulling you into someone’s, or several someone’s’ lives and all their problems, we need resolution; we need a denouement. We get something like that here.Why do we torture ourselves with this foolish human compulsion to hold onto the familiar if it’s less than perfect, or even dark. Why does The Dark’s young male protagonist respectfully listen to and honor his father, a man who bullied him for all twenty years of his life? Perhaps it’s because, along with the growing sense of our own immortality as we grow older, there’s a growing awareness of the fragility of our footprint, not the carbon one, but the real one, and the transitory aspect of our relationships. It’s all about legacy and influence. What remains of us after we’re gone? The ancients were obviously concerned about this, the wealthiest among them leaving behind the awe-inspiring pyramids and other mega structures. They knew that not much remains of a man or woman and his or her endeavors a hundred or so years after their passing. The things that remain the longest are the feelings and memories we leave behind in others who truly knew us and loved us. And, of course, in exceptional works of literarture. But these will fade in time as well. And McGahern’s The Dark illustrates this sad fact very well."}, {"userName": "Bill Keefe", "userReviewDate": "Aug 13, 2010", "userURL": "http://www.goodreads.com/user/show/963692-bill-keefe", "userReview": "\"Yet the surface of it was that I had cycled past them hundreds of evenings without paying the slightest attention. I knew them only now when they were lost, I'd loved them without knowing, and only learned of the love in the leaving.\"My third McGahern book, moving back in time with the writing, this being one of his earlier works. Insights like the one above slip easily into his writing, making you pause and think not only how in life you find this to be true but also in the reading of a book...though books you can re-read.This book had things that bothered me, though. The incidents that got the book banned, parental abuse and sexual abuse by a clergy member are riveting, the young man's fear palpable, but they pass quickly and the protagonist's journey continues with the knowing but not the sense of a pattern of abuse. It's not that McGahern's casual about it but it's hard to believe that the life went on without the insistence of this crime, particularly the father's. Also, the father's transition with age from being a criminally violent buffoon to simply a buffoon passes too easily for me. But McGahern knows this character well from his own childhood so perhaps I'm asking too much.I struggled with the ending, too, at first because I didn't understand why the novel didn't neatly tie up with the passing of youth and the initiation of the unknown journey to University and beyond (thanks Buzz!). But moreso when I came to see the last series of events not as an unnecessary appendage but as a major theme: the feeling of reaching too far, is it real?, and how and when that moment of decision is shaped by where - and who - we come from. To me, the weight of this theme, appearing, at least obviously, so very near the end, threw the book out of balance. Made it stumble. It wouldn't have been the same book, it wouldn't have been as good a book (thinking about how important this theme is, I suspect that without it, McGahern wouldn't have written this book!) but it sneaked up on me, so it was disturbing.I'm not sure these insights signify that I'm becoming a better reader of McGahern or simply that as I read more of his work, I am less surprised by the beauty of his writing, freeing up space to become more critical.I do know that I love reading his words...and, unlike the opening quote, I am fully aware of this the entire length of the journey."}, {"userName": "Robert Beveridge", "userReviewDate": "Jan 23, 2008", "userURL": "http://www.goodreads.com/user/show/766524-robert-beveridge", "userReview": "John McGahern, The Dark (Panther, 1965)John McGahern would seem to be another of those authors whose talent is lionized in his native land, but who never quite had Americans get the hang of his work (q.v. Margaret Laurence). The Dark, McGahern's second novel, is a fascinating portrait of adolescence that deserves far, far wider appreciation than it seems to have ever received.McGahern's homeland of Ireland may have something to do with that. The Dark was banned not long after its release for its rather cavalier treatments of both sex and religion, and so a novel published almost forty years ago has actually had something less than that to make a name for itself. Someday, Oprah will discover this book and feature it in her book club, and well, McGahern will have it made.Oprah couldn't not love this book. It's dysfunction central. The home depicted here won't be found in the bucolic emerald landscapes on sees in movies of the time. Here, we have the poor Depression-era Ireland, where the family burns peat and straw because it can't afford coal, instead. The nameless protagonist's mother is dead, presumably in childbirth. The father is both verbally and sexually abusive to his (uncounted, in the novel) children; explicitly to his son, implicitly to his daughters (though whether there is anything to this forms the crux of a scene much later on in the novel). There is much here to lay the groundwork for the main character of this novel to hate his father, but McGahern isn't going to take the easy way out, building a complex love/hate relationship between the main character and his father, complicated by both their feelings for Joan, the oldest daughter.The book has rightly been compared to Joyce's Portrait of the Artist, though McGahern's prose is far clearer and less florid, almost minimal. His characters are beautifully drawn, real in every sense of the word, and it is impossible not to at least empathize with them. McGahern takes on the daunting task of telling a story with one main character and many different points of view, while keeping all those points of view sympathetic, as if he were telling the story from everyone's perspectives simultaneously. He pulls it off with great flair.This is an uncomfortable book, to be sure, but it is a very good one, perhaps even a great one. Certainly one of the finer coming-of-age novels I've run across. ****"}, {"userName": "Gillik", "userReviewDate": "Aug 30, 2014", "userURL": "http://www.goodreads.com/user/show/8636137-gillik", "userReview": "When I first finished this book I was incredibly unsatisfied - ok, so the boy grows up and dithers about his life a while and ultimately makes the easiest of the available choices and the end. So what? It was only after some reflection that I realized that 'so what' - that dithering - is exactly the point. After a lifetime of abuse (physical, emotional, sexual) what you are left with is a smart but terrified adult, someone too self-conscious to go to a dance or have faith in his well-deserved chance at university. Even a trip to the movies is overwhelming. He's trapped no matter what decision he makes.Mahoney is a real wretch of a character who I suppose really does think he loves his children. He's desperate for their affection the more he ages, and over the course of the novel it becomes clear the boy is desperate to give him that affection, for all that his understandable rage acts as a cover.I found it interesting that only one of his several children is named (Joan). It adds to the claustrophobia of the family. And if the boy is trapped mentally then Joan is trapped physically - school isn't an option for her, so her only choices seem to be living under Mahoney's thumb or working for (and being abused by) another family as a servant. Slim pickings.I'm still not totally settled with the whole effect - would have liked the story to be longer, maybe - but it's a marvel that this was published when it was. And the ending is deceptively unsettling: it ends as it began, really, with the main character sharing a bed with his abuser. Abuse is cyclicle. One wonders what kind of father the boy will make. Also, stylistically I loved the unusual choices, the rapid jump from first to second to third person, never naming the boy, etc. Keeps you off-center, keeps you on your guard."}, {"userName": "Danny Daley", "userReviewDate": "Mar 14, 2016", "userURL": "http://www.goodreads.com/user/show/37175639-danny-daley", "userReview": "The Dark is one of the most emotionally complex and deeply affecting novels I've ever read. In a very short but economical space McGahern masterfully handles the themes of religion, sexuality, education, and most importantly, the relationship between a father and son. None of these themes is treated with anything but the greatest care and sophistication, none of them handled simply or in a one sided manner, all of them rung through with nuance and extreme detail. As the protagonist, the young Mahoney faced life a moment and event at a time, I found myself ripped by the decisions he must make, and the circumstances which complicated those decisions. The major themes are beautifully interwoven like a quality thread, so that, rather than disjointed or isolated, they hold tightly to present the totality of a single story with many complex aspects to it.The prose, as per usual with McGahern, is perfectly crafted. At times, the story moves along at a steep pace, at others, the novel is infused with deeply lyrical paragraphs full of affecting imagery. This novel, just McGahern's second, is a huge leap forward from his first novel published just two years earlier. When The Dark was initially released in 1965, it was banned in Ireland and widely denounced for its vivid portrayal of the protagonists struggle with repressed desires, but these portrayals work in a powerful way to embed a greater understanding of young Mahoney's struggles with his faith, his vocation, and his relationship with his father. The novel is now an Irish classic, and for good reason."}, {"userName": "Frank", "userReviewDate": "May 06, 2010", "userURL": "http://www.goodreads.com/user/show/2442580-frank", "userReview": "The Dark certainly lives up to its title. An unnamed boy is the only son of the widower Mahoney who ekes out a subsistance living on a small farm of land in the County Leitrim of 1950s Ireland. One can only speculate that the father's rage and hair-trigger temper spring from frustration and misdirected grief over the loss of his wife. But this is the son's story, though hardly your typical bildungsroman: McGahern's protagonist is tortured by his sexuality and the uniquely Irish-Catholic guilt it engenders, tortured by the repressive yet somehow secure teachings of his religion, tortured by his father's ignorance, posturing and rage, but most of all tortured by his own insecurity and indecision. Indeed security and insecurity are the overriding themes of the novel. Though the boy applies himself relentlessly to his studies and eventually wins a coveted scholarship to university, he tosses it all away when his grades also earn him a pat position as a drudge in the Electricity Supply Board. Even on the foot of a great personal acheivement, his insecurity bring him down afterall; down to a position more fitting with his own self-image. It's powerful stuff and little wonder that the book was banned in Ireland when first published in 1965. I wish I could have liked it more; it is a brave book but the characters are so unlikeable, I can't rate it any higher."}, {"userName": "Richard Needham", "userReviewDate": "Aug 30, 2010", "userURL": "http://www.goodreads.com/user/show/1373219-richard-needham", "userReview": "This is a coming-of-age story, starting out with a monster of a widowed father disciplining his son (a chilling first chapter), and ending with some reconciliation. Getting from the beginning to the end is fairly short in number of pages but long in torturous developments centered around the father, the protagonist’s sexual arousal (directed mostly inward), confession and contrition, followed by more sin, and competition for a scholarship to Galway University. It is wonderfully written and very searing in parts. A scene with father and son in haying season is beautifully and powerfully told (reminiscent of the autumn moonlit/harvest/love scene in The Rainbow, and incidentally both books were banned for a time). The occasional use of the second person point of view to convey inner, secret feelings is also well done, as here when there are thoughts of becoming a priest: ‘You couldn’t carry the responsibility of a decision. You’d drift and drift. You’d just dream of the ecstasy of destruction on a woman’s mouth. You were sitting on a green bench in the morning, was that not enough. The sun was blazing clear as glass. Your hands were damp with sweat . A ceaseless hum was droning into the heat. You could take off your coat and tie.’ Very fine writing, I think."}, {"userName": "Trisha", "userReviewDate": "Apr 29, 2011", "userURL": "http://www.goodreads.com/user/show/1300121-trisha", "userReview": "This book was aptly titled! It was dark indeed, at times oppressively so. I had a hard time sticking with it and probably would have abandoned it entirely except for the fact that it was set in Ireland - one of my favorite places to go in a book. In this case most of the action took place in a rural Irish village sometime in the middle of the 20th century (I think!)and centered around the plight of a young boy and the decisions he was trying to make about his future. It was especially complicated for him because of his troubling relationship with his widowed,abusive father and his conflicted feelings about whether or not to become a priest or continue his schooling in pursuit of a university scholarship. What kept me reading had less to do with the plot or the characters or the setting. Rather, it was McGahern's interesting way of switching the narrative voice from the third person to the second person to the first person. I'm guessing it had to do with mood and the thematic elements that were interwoven throughout the novel, however I have to admit I wasn't interested enough to pay close enough attention in order to get the full effect."}, {"userName": "Konstantin", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/22773855-konstantin", "userReview": "[rating = A+]One of my: Best Books of the Year (for 2014)A boy struggles through life, as most do; but through an angry, abusive father and his own wayward journey along the precipitous ledge of adolescent. Taking care of his sister, deciding on being a priest or not, many turns and many consequences. A very sad little novel where father and son grow together. At one point the son exclaims that he, the father, is older and unable to do the work he used to, which shocks the poor son. Through the stress of getting a scholarship and leaving that cursed farm, he may triumph. shortly after though the book ends with him on a new road, a new road all alone. Written in an interesting style of \"you\" taking the place of \"I\", one finds that the narrator is trying to distance himself or trying to relate to other human beings. Short chapters with bits of thought and action lead to an overall monumental blow against the struggles of the common man. Though at times life is fun, there is always that buzz of uncertainty and hatred."}, {"userName": "Ryan Williams", "userReviewDate": "Nov 18, 2012", "userURL": "http://www.goodreads.com/user/show/14431683-ryan-williams", "userReview": "The least of McGahern's novels, and the shortest. McGahern felt embarrassed by it ('written too quickly'), and was amused rather than outraged when the Irish Censor Board banned it. Less amusing was the Church's response, which promptly forced McGahern out of his job. When McGahern protested officials were unsympathetic. The book alone might have been forgiven, but after marrying a woman in a registry office; worse, a foreign woman...The novel is interesting on a purely technical level. It's largely dialogue with the connective tissue kept to a minimum. Yet how it builds suspense, how deftly it takes you into its claustrophobic little world! The steely, non-intrusive style compliments the subject matter well. Mere outrage wouldn't have kept the pace."}], "description": "The Dark, widely acclaimed, yet infamously banned, is John McGahern’s sensitive, perceptive, and beautifully written portrayal of a young man’s coming-of-age in rural Ireland. Imaginative and introverted, the boy is successful in school, but bitterly confused by the guilt-inducing questions he endures from the priests who should be his venerated guides. His relationship with his bullying, bigoted, widowed father is similarly conflicted — touched with both deep love and carefully suppressed hatred. When he must leave home to further his education, their relationship is drawn to an emotional climax that teaches both father and son some of the most intricate truths about manhood.", "title": "The Dark", "url": "http://www.goodreads.com/book/show/430368.The_Dark", "average": 3.9, "cover": "https://images.gr-assets.com/books/1309212196l/430368.jpg", "reviews": 62, "authors": [{"url": "https://www.goodreads.com/author/show/45497.John_McGahern", "name": "John McGahern"}], "type": ["Fiction", "European Literature", "Cultural", "Literature", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/430368.The_Dark", "http://www.goodreads.com/book/show/2588622-the-dark", "http://www.goodreads.com/book/show/29343438-the-dark", "http://www.goodreads.com/book/show/304209.Amongst_Women", "http://www.goodreads.com/book/show/79930.That_They_May_Face_The_Rising_Sun", "http://www.goodreads.com/book/show/430365.All_Will_Be_Well", "http://www.goodreads.com/book/show/684202.The_Barracks", "http://www.goodreads.com/book/show/388317.The_Pornographer"]}