{"ratings": 527, "userreviews": [{"userName": "Andy Plonka", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/749242-andy-plonka", "userReview": "This is an earlier Gunther that I missed when it was new. Probably at the time the Russian mob angle was fresher, but Mayor has good writing skills and the story hangs together well."}, {"userName": "Maddy", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/1298544-maddy", "userReview": "PROTAGONIST: Lieut. Joe GuntherSETTING: Brattleboro, VermontSERIES: #9 of 25RATING: 4.0WHY: When a dead man with foreign dental work is found in a pond, it's hard to figure how he ended up in that situation. Lieutenant Joe Gunther eventually finds ties to the Russian political system. Soon he's fighting a personal battle--while at the scene of a jewelry store incident, he is found with a brooch in his pocket. He's suspended and faces a world of legal troubles. I was really engaged in the book until a rather far-fetched plot thread with warring Russian mobs took over. Joe showed quite a different side of himself; usually calm and collected, he shows a lot of emotion and a surprising ability to work outside the law."}, {"userName": "Dennis Fischman", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/1342011-dennis-fischman", "userReview": "This story starts in the familiar Joe Gunther territory and figuratively ends up in the Wild West, with an excursion into John LeCarre land in between. I didn't find the Russian faction fight on Vermont soil plausible, and shootouts don't interest me. The relationships, as usual, intrigue me: both those within the department and the ongoing love story between Joe Gunther and Gail Zigman. But I hate the author for putting her through yet one more book where she feels violated because of the repercussions of Joe's work. Find some other way to move their relationship along!"}, {"userName": "Kay", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/712954-kay", "userReview": "Early in this book I was really taken with the writing and story line but by half way through it became a mish mash of Russian names CIA characters who were never clear and a plot that made no sense. I found it difficult to believe that the main character, Joe Guenther, who has won so many awards for his police work in Vermont would immediately be believed to be turned to the dark side as stealing a precious piece of jewelry with only a few of his own team taking his side. Conversely the clarification, after a conflict between Russian gangs on a hilltop, seemed so over the top that was hard to believe too. I always start out liking an Archer Mayor book but always feel lost or bored by the mid-point."}, {"userName": "Jill", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/21835218-jill", "userReview": "This one disappointed me. It was not the writing as that was just as masterful as always, nor the usual cast of characters; Joe, Gail,Willie Kunkle, and Sammie. They are all as interesting as in previous books but now they are really tested as to their loyalty to Joe. Joe is set up in this one and it is seemingly a problem that WILL land him in jail. He has to break laws and to figure that his career in law enforcement will indeed be over. But the Russian connection is just too far fetched and complex to me and I frankly lost interest in anything but Joe's redemption."}, {"userName": "Anna", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/31802850-anna", "userReview": "The serene landscape of Vermont is once again disturbed when a dead man is found in a quarry. Joe Gunther and his team are challenged when the case they work on draws a wider circle this time reaching to Washington.Mayor leads his characters on a somewhat predictable journey. Thankfully, the characters make the journey interesting and worth pursuing to the end that again comes with a loud bang. I enjoyed it. Somewhat."}, {"userName": "B.R. Stateham", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/5135837-b-r-stateham", "userReview": "Another Joe Gunther novel. Lots of action, but strangely, not so compelling. Kind of a superficial walk through. I won't give away the plot, but let me say it involves spies. Joe Gunther works in the Vermont Bureau of Investigation and he embroils himself with a bunch of old spies.I dunno. It wasn't a bad read. But it didn't tickle my fancy, either."}, {"userName": "Sheldon", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/63639161-sheldon", "userReview": "Joe Gunther may work in Vermont but he is big time. Here wrapped up in a tangle of aged spies, Joe and his crew work hard to save themselves and solve the mystery. The audio reader does a masterful job. The author is skilled. I enjoyed. I hope you do too."}, {"userName": "Tom", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/4791331-tom", "userReview": "Interesting tale; complete with left over Cold War Russian involvement."}, {"userName": "Jandblock", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/3010694-jandblock", "userReview": "A little far-fetched and unbelievable but entertaining and overall a good addition to the series."}, {"userName": "Catherine Woodman", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/5912889-catherine-woodman", "userReview": "Kind of a big stretch for a plot."}, {"userName": "Julie Byrne", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/38658433-julie-byrne", "userReview": "Meh."}, {"userName": "Phil", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/2325564-phil", "userReview": "Joe Gunther stories always a good read."}, {"userName": "Linda Scott", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/59438693-linda-scott", "userReview": "Confusing"}, {"userName": "Jim", "userReviewDate": "Dec 23, 2016", "userURL": "http://www.goodreads.com/user/show/11721067-jim", "userReview": "Mayor ventures away from his standard police procedural/investigative story into the world of international spies and intrigue. In my opinion he didn't do a great job with the genre change. I found the Russian spy story behind all this to be a bit confusing and messy.That being said, I do like these characters and hope he gets them back to their old ways in the future. I did find it interesting to be reading something that was written before GPS became a standard part of our phones and is presented as a cutting edge technology."}, {"userName": "Abbey", "userReviewDate": "May 16, 2011", "userURL": "http://www.goodreads.com/user/show/4437424-abbey", "userReview": "1998, #9 Lt. Joe Gunther, Brattleboro VT; police procedural/spy thriller. A dead body in an abandoned quarry leads Joe and his crew on a convoluted journey into the cold war past, the current Russian Mob, and a generally interesting exploration of lying and truth-telling, friendship and shared experiences. Rather a bit too much “spy vs. spy” for my taste, and the climax is far too close to “Die Hard” for my comfort, but the plotting is very good. the pacing excellent, and the characterizations are superb, hence the very highest rating - it was a fun read. We get to learn a great deal more about just what makes the important people in the series “tick”: Joe, his lover Gail, Willy and Sammie his closest friends on the force - some of it is wrenching, and all of it’s interesting. I would not recommend this as your first Mayor to read of this series unless you really love convoluted spy tales, as it’s not representative of the extremely good police procedural writing Mayor can, and does, do in the earlier books."}, {"userName": "Gmaharriet", "userReviewDate": "Jun 20, 2015", "userURL": "http://www.goodreads.com/user/show/33296992-gmaharriet", "userReview": "This was #9 in Archer Mayor's Lt Joe Gunther series, and I've been enjoying all of them. I like the way he writes and most of the stories seem earthy and realistic; however, this one was much too far out there to be believable. It's a fun read, but it sent my suspension of disbelief into overdrive.I still enjoyed it, but (without giving too much away) when they had at least 10 vehicles crashing on purpose in a small college town, and everybody walks away only a little sore, I just had to walk away for a bit, before coming back and finishing it. There's more that I couldn't accept as realistic in this tale.Three stars are the fewest I've given to a book in this series. I hope #10 goes back to its usual small town realism."}, {"userName": "Ed", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/11566365-ed", "userReview": "#9 in the Joe Gunther series. This is the series that defines law enforcement in Vermont. Of course, one might say it is the only series about law enforcement in Vermont. However, the series is so well written, that if transplanted to NY, CA, or IA I believe author Mayor would evoke the essence of those locales and the character of Joe Gunther would still shine.Joe Gunther is called on when a body is found in an isolated quarry. The road to the solution of the crime leads to the Russian Mafia, the CIA, and Joe's being framed for a jewel theft. Kunkle and Sammie prove to be stout allies."}, {"userName": "Marti", "userReviewDate": "May 12, 2013", "userURL": "http://www.goodreads.com/user/show/2060998-marti", "userReview": "I have read several other Joe Gunther books, and enjoyed them. This one was all right--maybe not as good as the other two. In the first section Joe goes to Washington, DC and gets shot at when he goes to the Vietnam Memorial. He discovers a body in a quarry back home, and things continue from there. He is implicated falsely in a robbery when a piece from the jewelry store is found in his jacket pocket. The Russians are involved in the story, as he attempts to prove his innocence."}, {"userName": "John Thurlbeck", "userReviewDate": "Nov 10, 2016", "userURL": "http://www.goodreads.com/user/show/19699139-john-thurlbeck", "userReview": "I like the Archer Mayor novels because his characterisation is so real, down to earth and full of the foibles we all have as human beings. The plots stand alone, although thematically he weaves in strands on on-going interest, such as Gunther's deteriorating personal relationship, which adds elements of pathos to his prose.I'm a big fan, and highly recommend his series!"}, {"userName": "Lynne Thomas", "userReviewDate": "Feb 07, 2012", "userURL": "http://www.goodreads.com/user/show/5074906-lynne-thomas", "userReview": "Though not even close to the best of Mayor's series on \"Joe Gunther\", it was still a good read. Mayor's knowledge of Vermont and his grasp on human follies & strengths makes reading his work a joy. On to book...10!"}, {"userName": "Patrick", "userReviewDate": "Sep 14, 2007", "userURL": "http://www.goodreads.com/user/show/326263-patrick", "userReview": "Feh.I see I read this before, and I don't see a review. Disregard it, if it's there, and avoid this tedious installment of the Joe Gunther series, which has 78 double crosses and endless layers of crap before there's a big shootout and blah blah blah. Ol' Archer really mailed this one in."}, {"userName": "Jack", "userReviewDate": "Jun 03, 2012", "userURL": "http://www.goodreads.com/user/show/8453860-jack", "userReview": "Probably the best yet. The more I read this series the more I enjoy his style of writing. But, as with most series, it is best if a reader starts with the first book and reads forward. Even though characters and background is explained, it helps to know the characters from the beginning."}, {"userName": "Nancy H", "userReviewDate": "Nov 08, 2014", "userURL": "http://www.goodreads.com/user/show/1555231-nancy-h", "userReview": "This is a good mystery in the Joe Gunther series. It is at times confusing, but that just contributes to a plot that involves Russian Mafia, former KGB, CIA, former CIA, and current law enforcement personnel. It is quite a ride!"}, {"userName": "Anne", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/1596114-anne", "userReview": "I really wanted to like this, especially after reading and loving The Surrogate Thief. Somehow I got bogged down in this one though. The \"bad guys\" just didn't resonate for me and I didn't really connect with Joe Gunther in this one either. I'm going to give another of his a try, though."}, {"userName": "Enrico Tassinari", "userReviewDate": "May 23, 2016", "userURL": "http://www.goodreads.com/user/show/19910849-enrico-tassinari", "userReview": "This is a solid procedural with some hints of spy/mystery up two third of the novel. Then things turn south and suddendly you're in the middle of the transcription of an action movie. I consider this just a brick in the nice wall of Gunther serie but foremost I consider it a good chance loss."}, {"userName": "Paulina", "userReviewDate": "May 04, 2014", "userURL": "http://www.goodreads.com/user/show/9208035-paulina", "userReview": "Good enough. I didn't like it as much as some of the prior books. The ex-spy angle just didn't feel realistic to me. Lots of plot twists that ultimately didn't engage my interest. But generally like the series so I will give this a ho-hum pass."}, {"userName": "Randy", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/9658279-randy", "userReview": "Good, but maybe getting harder to believe....."}, {"userName": "Steve Clark", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/5942983-steve-clark", "userReview": "Not one Mayor's better books. The whole Russian spies and mafia battling it out in rural Vermont was a bit much to swallow."}, {"userName": "Peggy", "userReviewDate": "Jun 09, 2016", "userURL": "http://www.goodreads.com/user/show/51844149-peggy", "userReview": "Disappointing. Started well with some interesting information about the Korean War monument. The story rapidly disintegrated into Gunther's near hysteria and a plot that was overly contrived."}], "description": "When a local quarry yields up a garroted body with bad dental work and toes tattooed in Cyrillic, Joe Gunther figures it for a Russian mafia killing, rare as that might be in Vermont. But it's so very… tidy. So very… professional. Then the CIA calls, inviting Gunther down to Washington for some friendly “assistance” with his case. Suddenly he‘s caught up a shadowy game of cross and double-cross—manipulated by cynical cold warriors who seem not to have gotten the memo—and Gunther soon realizes that he's a pawn that both sides are willing to sacrifice.", "title": "The Disposable Man\n      \n          (Joe Gunther #9)", "url": "http://www.goodreads.com/book/show/18875195-the-disposable-man", "average": 3.87, "cover": "https://images.gr-assets.com/books/1394741168l/18875195.jpg", "reviews": 43, "authors": [{"url": "https://www.goodreads.com/author/show/52067.Archer_Mayor", "name": "Archer Mayor"}], "type": ["Mystery", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/18875195-the-disposable-man", "http://www.goodreads.com/book/show/157093.The_Disposable_Man", "http://www.goodreads.com/book/show/1308323.The_Disposable_Man", "http://www.goodreads.com/book/show/18885833-open-season", "http://www.goodreads.com/book/show/13520119-borderlines", "http://www.goodreads.com/book/show/19051124-scent-of-evil", "http://www.goodreads.com/book/show/18592442-the-skeleton-s-knee", "http://www.goodreads.com/book/show/17286813-three-can-keep-a-secret"]}