{"ratings": 331, "userreviews": [{"userName": "Krista", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "Andrea and I were thirteen and beginning to outgrow this daylight world of lessons and games and sing-alongs. We were sick of having our days parsed into hour-long blocks, sick of being led from one activity to the next. We were hungry for feral time. That's why we loved the dark.\nThe Dark and Other Love Stories is a skilled collection of short fiction, and while these stories do cover a variety of themes, “love” in its many forms makes frequent appearances. My favourites were those stories, like the titular one, that feature girls on the cusp of adolescence: that confusing time of desire and fear; bonding with your girlfriends while teasing the boys; wanting older guys to notice you but not actually wanting them to touch you. Author Deborah Willis repeatedly provoked nods of recognition from me –yes, it was, it is, just like that – and I can't ask for much more from a book.In The Dark, two girls who become fast friends at summer camp decide to start sneaking out at night; walking through the midnight forest to where they can spy on the aged trail horses who become transformed into something magical by moonlight:\nWe approached the horses quietly, with the single-mindedness of lovers. It was as though Andrea and I had created them, as though they were our secret, a gift we'd given each other. They had a quiet kind of bravery, a grace I've rarely seen since. The only thing that comes close is the dignity of some old women – the ones who remember being beautiful, the ones who know they still are.\nWhen a camp counselor busts the girls and they decide to start skinny dipping in the lake at night instead, the sudden appearance of two men in a rowboat challenges their bravado. I believed every minute of this story and the flip from joy to menace was really well executed. In The Passage Bird, when a fourteen-year-old's family suffers a tragedy, she begins spending time with the Hawk Man; an old friend of her father's who keeps birds of prey. Conflating concern with desire, the girl offers herself to the older man:\nShe wanted him to say it. To expose his hunger so she could hate and pity and love him for it. She wanted him to grip her hand the way the hawk had.\nAnd in a later story featuring teenage girls, Welcome to Paradise, two friends combat an endless summer of suburban boredom by breaking into neighbourhood houses and flirting with the pizza delivery guys at the local plaza. When events occur that threaten to push the two from girlhood into adulthood, it's all too much for one of them:I wanted to tell her what had happened with Cody, how it was nothing like Cosmo had promised. I wanted her to wipe my eyes with her sleeve and say, it's okay, and then it would be. I wanted us to sit at the bottom of a pool that would never be filled. To go to paradise and never get caught. To live together in another country, in our own house, a house with gold walls and a tiger guarding the door. At one point, the Hawk Man explains that a “passage bird” is one caught from the wild, and that not all wild things can make the transition to domesticity. This theme comes up repeatedly – from the ex-Olympian, now drug dealer, who applies for a reality-show/space mission in Girlfriend on Mars, to a Holocaust-survivor who becomes a recluse in the woods of British Columbia in Last One to Leave, to a drunken father who can't quite get himself together for the sake of his young son in I Am Optimus Prime – and is made more literal as another young father, Eddie, tries to tame a crow while getting his own life together in Todd:\nShe shuddered in his hand. Then made a low, tuneless sound, like she was asking a question. And he tried not to cry, tried not to keen. Tried to quiet himself so she could listen for an answer, so she could find her way. He touched the bird's broken wing-feathers, settled her against his chest, and hoped this would calm her. Hoped she'd forgive him. Hoped she was listening to tectonic shifts, or meteors, or the hush of rain before it falls. \nI liked that the next story, Flight, which features another teenage girl trying to spread her wings, revisits Eddie (and we see that he seems to be doing better, even if he can't tame a girl any better than he can tame a crow). The last two stories are perhaps the most traditional love stories, with The Ark recounting a match born in childhood (but which isn't the happy tale that it at first appears):\nI held out both hands to him, knowing we would build our own ark in this world. But he didn't catch me. He moved calmly away, one step higher. And I lost my balance, fell down the stairs, fell so fast that my brain didn't keep up. My brain didn't keep up for years. It still reached for him, still felt relief, still believed in this story: that this was love, that it would save me. \nAnd the final entry, Steve and Lauren: Three Love Stories, is told in three parts; each of which features something weirdly off-kilter. In The Hole, the newly married pair refuses to acknowledge the black abyss that's growing in their living room. In The Watch, Steve becomes attracted to a woman at work; someone who causes his watch to stop every time she comes near. And in The Nap, Steve and Lauren fall asleep as young lovers and wake up fifty years later, trying to decide if theirs had been a happy match based on the scant clues they can find:\nLife seemed so solid once, but now it had melted like Dali’s watch and slipped through their fingers. They read over their tax returns, looked at the photos, and decided they’d lived a good life, without tragedy or scandal. Did this make them a success? Had it been the goal? Was it enough?\n Each story in this collection captures something real, told in fine sentences, and for the most part, touched me (I caught my breath more than once). I liked the variety of Canadian settings – from suburban Calgary to the wild B.C. Coast – and really identified with the depictions of teenage girls. A worthwhile read."}, {"userName": "Erin", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "I received this short story collection as an ARC from NetGalley in exchange for an honest review. As per usual, I will discuss each story featured in this collection separately. The Dark 1 starTwo adolescent girls at summer camp and there's a big event, but it's murky. I couldn't keep hold of this narrator at all. Her voice was jarring? condescending? manipulative? It just didn't jive with me and I had to read the ending a few times. \"Girlfriend on Mars\" 3 stars  Vancouver pot dealers, Amber and Kevin are living a happily ever after (well, in Kevin's view), when Amber announces that she's been selected to compete for a chance to travel to Mars. I felt the concept of the story worked well because of the last 17 years of reality television series. Passage Bird 3 stars Girls that turn into birds. Somehow it worked! Hard Currency 5 stars  My favorite of the collection because of humorous lines like these onesI was born here in 1963. I've returned now because I'm writing a memoir about the past. I remember the past too, says the man, switching to thick accented English. But I don't wake people up to tell them about it See, Alexis is a forty-eight year old man that suffers (greatly) from the impression that he's the greatest Russian- American novelist that has been largely ignored by the country of his birth. The irony is that as his story unravels, the reader can see that Alexis isn't really so honest when it comes to his personal story. Last One to Leave 4 stars An ambitious young BC woman working at a rural newspaper and the Ukrainian immigrant who survives WWII and heads to Canada. A little bit of a tugs at the heart type of storyline, but not because it's overly emotional. Rather, I felt connection to the story because it was an understated love. Speaks well of the time period!I am Optimus Prime 3 starsFather and Son storyline that explores how we become a legacy of our parents and not always in positive ways. Welcome to Paradise 3 starsSimilar to The Dark, as the story featured two female friends who get into serious problems, but I felt this story was executed better.Todd 1 starBird story...yawn!Flight 1 star Bird story...yawn!The Ark 2.5 stars Childhood conflict between two students ends up being a relationship down the aisle. Steve and Lauren ...three love stories 3.5 starsThree short snippets that highlight some major moments in one couples 50 year relationship.  Although I liked a few of the stories in the collection, I am left feeling a bit underwhelmed if I look at the entire book as a whole. This is one of those times when I cannot feel the magic! Not a book that I would have picked up in a store."}, {"userName": "Lolly K Dandeneau", "userReviewDate": "Dec 19, 2016", "userURL": "http://www.goodreads.com/user/show/1412404-lolly-k-dandeneau", "userReview": "via my blog https://bookstalkerblog.wordpress.com/“We were hungry for feral time. That’s why we loved the dark.”There is something feral about girls on the cusp of womanhood, what better place than camp to explore the dark things the world wants to protect them from. One friend always seems to be the one who pushes the limits more, the one who should end up as a face on a milk carton if what the grown ups warn is true. There is a pulsing hunger for danger and a paralyzing fear of it. The Dark is not so much in the young girls hunger and desires but in the world itself. Nothing happens, everything happens. Each story continues in this vein, people stepping out of ordinary acceptable behavior like in Optimus Prime when a father struggles with 12 steps and gives his son a Halloween night law abiding parents wouldn’t. In my personal favorite The Arc, “I lived in fog, a beautiful fog like in paintings of winter. Memories passed by like clouds on the other side of a window” there is nothing beautiful about Leanna’s suffering, but the strangeness of the turns her life takes pulled me in. Love and hate are the same emotion sometimes, and both can be our salvation or damnation.The mind and body don’t always heal, sometimes you just live through the fog. I felt for Leanna as much as I feel for a character in a long novel. She is every woman who has placed her faith in the wrong person, because at some point in life- most of us do. Life drags her along confused, broken and trapped in an endless fog unable to answer “Why is God so mean sometimes?”This is a dark and strange collection. Some moments are small, but life altering. I can’t wait to read more by Willis.Publication Date: February 14, 2017W.W. Norton & Company"}, {"userName": "Diana", "userReviewDate": "Dec 04, 2016", "userURL": "http://www.goodreads.com/user/show/4657361-diana", "userReview": "I don't usually lean toward short stories when I'm looking for something to read, but I was thrilled to win a copy of The Dark and Other Love Stories through Goodreads Giveaways.This collection turned out to be one of the most emotional and compelling books I've read in quite a while. Willis' stories focus on characters experiencing, losing, or reminiscing about love--the love between friends, the love between a grandparent/parent and child, and the romantic love that grows into something tangible and secure. These are stories about the connections humans make in a quest to lead meaningful lives.There is another fascinating theme that resonates throughout this collection: the notion that even when humans feel trapped, if they can just get out into the wild, they'll find what they need. The \"wild\" is something different for all of her characters: For Andrea and Jess in \"The Dark,\" it's escaping their summer camp cabin to explore the world in the darkness; for Havryil in \"Last One to Leave,\" it's escaping into the forest; for for Amber in \"Girlfriend on Mars,\" it's leaving the planet. Those who try to bring the wilderness indoors--like Kevin's marijuana plants in \"Girlfriend on Mars\" or Eddie's raven in \"Todd\"--are ultimately disappointed.Some of these stories--especially \"Last One to Leave,\" \"Todd,\" and \"I Am Optimus Prime,\" left me in sloppy tears. Read these stories one at a time, and give yourself an opportunity to process them. They will echo in your thoughts long after you've finished the book."}, {"userName": "Sarah", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/13483290-sarah", "userReview": "Recommended for: Readers who like weird stories.The Dark and Other Love Stories is a riveting collection of 13 strange, sensual, and compelling explorations of different facets of the dark, love, and friendship. I’ve been blown away by the many different contemporary short story collections by women that have been published recently, and Deborah Willis did not disappoint!A girlfriend decides to sign up to go to Mars and doesn’t tell her boyfriend. A man feeds and cares for a crow as if it was his pet. Two girls sneak out in the middle of the night while at camp, but simply to watch the horses. A woman finds a hole in her living room that apparently only she can see. The love Willis explores expands age, romance, family ties, and species, reflected in the various stories the author conveys in sharp, beautiful prose. I found both humor and aching emotion within the pages and was delighted by both the realism and bit of fantasy as Willis describes the power and depth of love and darkness. In conclusion, The Dark and Other Love Stories is weird, raw, and haunting, and I would not hesitate to recommend this book to any reader of contemporary short fiction. Many thanks to the publisher for the review copy from the publisher via NetGalley in exchange for an honest review."}, {"userName": "Carla", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/7965254-carla", "userReview": "More short stories from Deborah Willis. These aren't romance stories, but love in so many other ways like best friends, parent/child, and yes, sometimes couples. Some are rather \"out of the box\", and some I thought very good. I'm giving this book 3 stars as I think her writing is better than the last book I read of hers, which I only rated 2 stars. Some stories are distinctly Canadian, with that flavour, but I found I was wanting more."}, {"userName": "Y", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/26247448-y", "userReview": "The characters in the thirteen stories that comprise The Dark and Other Love Stories exist on the edge of danger, where landscapes melt into dreamscapes and every house is haunted. A drug dealer’s girlfriend signs up for the first manned mission to Mars. A girl falls in love with a man who wants to turn her into a bird. A teenage girl and her best friend test their relationship by breaking into suburban houses. A wife finds a gaping hole in the floor of the home she shares with her husband, a hole that only she can see.I absolutely adored this book. Willis writes with spectacular power and precision, where every word means something and every line is important to the overall story. The entire collection feels so inextricably tied up in itself; all the stories are about love in such unique ways, but they all fit together so well.Willis has a lot of unique talents that come through very well, so I'll focus on two: exposition and characters.The exposition in her stories is almost always snuck in among the other bits and pieces of plot, almost like a second reel of film playing behind the first. Everything is so seamlessly bound up that you don't even notice the switches between past and present, but every paragraph reveals a new piece of the story.Her characters are all well-formed and well-developed. It's clear that Willis writes for and about her characters first, plot second. Everyone interacts in such breathlessly physical ways; it feels like you're following behind real people with a camera. I absolutely loved the descriptions of every character; it was so clear that Willis cared for and loved them all. There's nothing better than a writer who loves their work.My primary two critiques, in contrast, are rather small. Firstly, I think there were certain stories that, without spoiling anything, veered into the slightly amoral. It's hard to explain this without spoiling anything or sounding like a prude, but an example: a young girl moves in with an older man, who openly admits he has feelings for her he should not have. A young boy torments a girl in his class, who later (for reasons fairly unrealistic) falls in love with him... etc. It's complicated, and difficult, and I don't want to immediately toss out the possibility that Willis was giving a nuanced and complex look at these tropes, so I suppose I will give her some of the benefit of the doubt.Similarly, I think there were a lot of sad marriages. This is a very weird thing to find in short story collections, but it keeps popping up, and in a collection about love it was even more blatant. (White, straight) married couples lie to each other, keep secrets, cheat, get divorced, argue... It feels a little bit repetitively edgy sometimes. And I say edgy because there is probably not a better word, which is unfortunate.Overall: I really, really liked these stories. It felt like the little things that came up were more to do with specific stories, rather than the collection as a whole, and the themes and subjects brought up in the book generally get handled in a fantastically interesting way, with just enough ambiguity so as to let the reader decide for themself. The opening story, The Dark, introduces this seamlessly with the different kinds of love... is the main character in love with her friend? With the horses? With the concept of rebellion? Things shift and change and turn around on you, and that sort of rocky-ground writing was incredibly addictive to read."}, {"userName": "Allison", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/4375195-allison", "userReview": "I was on the fence for most this collection of what to rate them. They were good, true, but nothing particularly jumped out at me that would push them over the threshold of three stars. It wasn’t until I read “The Ark” that there was a spark. With this spark, I started to reevaluate the whole set and realized something: these stories were more than just about love in various forms. It wasn’t always about the love that two people show openly to other people, but it was about the love that they keep buried deep, the love that they don’t really talk about. Like the dark, there is something just below the surface. The reader can’t always trust the narrator completely, and that adds another layer to the story. Did Kevin’s girlfriend really go to Mars, or was he high and imagining the whole thing? Was there really a hole in Steve and Lauren’s living room, or was that a representation of their marriage and life together?The overarching theme of this collection is that the dark obscures the truth, and as a result, we (the readers) are left floundering with an incomplete sense of the narrative. Love itself is also dark and mysterious, but it is also revealing when we bring it to the light.Willis’ prose was beautiful and often had an almost ethereal feel to it. One of my favorite quotes was from “The Ark.”\nI lived in a fog, a beautiful fog like in paintings of winter, of ocean. Memories passed by like clouds on the other side of a window.\nI really enjoyed each of the stories published in this collection. The cover was beautiful and further conveyed the theme nicely. Four stars.Thank you to NetGalley and W. W. Norton & Company for an advanced copy of this eBook in exchange for an honest review."}, {"userName": "Laura Frey (Reading in Bed)", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/5115230-laura-frey-reading-in-bed", "userReview": "The best contemporary short story collection I've read in a long time, possibly ever. One story was a bit of a clunker, but I think I was put off by the plot, most people wouldn't be."}, {"userName": "LibraryCin", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/12860715-librarycin", "userReview": "3.5 starsThis is a book of short stories. Some of the stories include two girls/friends at camp who would sneak out of their bunk at night; two girls/friends who would break into neighbourhood houses when no one was home; a little boy who’s father lived with him and his mother when he was 9 – they had a memorable Halloween; a man who survived a concentration camp as a child moves to Canada and rarely speaks, while a girl of 18 moves away from home to work for a small town newspaper; a man shares his new apartment with a crow… and more.Usually, a book of short stories will get a 3 star rating from me: I like some of the stories, I don’t like some, and some are ok, so the book, as a whole, averages out to about 3 stars (ok). In this one, however, I can say that I liked almost all of the stories, so it’s getting a 3.5 rating. So, one of the better collections I’ve read."}, {"userName": "Bookish", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/65906724-bookish", "userReview": "I just started reading The Dark and Other Love Stories by Deborah Willis. It’s a book of short stories, and a Loan Stars top pick! I’m a story and a half into it, and am finding the prose beautifully lush. The title story, “The Dark” is about two girls at summer camp, in their 13th year, when we all start to tread the line between being girls and being women. And the second story, “Girlfriend on Mars” is about a former gymnast, turned pot-dealer, who is competing to win a spot on the first expedition to Mars, told from the point of view of her boyfriend who will be left behind. This book is reminding me just how much I love the short story format! —Kristina (https://www.bookish.com/articles/frid...)"}, {"userName": "William Koon", "userReviewDate": "Apr 13, 2017", "userURL": "http://www.goodreads.com/user/show/12385035-william-koon", "userReview": "Her first couple of stories built to something and then disappeared in the last two pages, which was a shame because “Girlfriend on Mars” had great potential. I began the collection with a yawn and ended up somewhat taken with the last three “storyettes,” “Steve and Lauren.” Nothing in the book really soars, although some parts are distinctly enjoyable. Willis, as suspected, is an academic creative writing teacher. Although her writing is all over the place –that place is Canada—she is not the future incarnation of another Canadian short story writer. But as Merle Hagard sang, “It Ain’t Love, But It Ain’t Bad.“"}, {"userName": "Jaleenajo", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/20926141-jaleenajo", "userReview": "So, unfortunately this one ended up being a bit of a disappointment for me. It's not a bad book by any means, but I think that the title being \"The Dark and Other Love Stories\" makes you think that you're getting, well, dark love stories. And I wouldn't classify these stories as dark so much as sad. They left me feeling sad and kind of disappointed, for the most part. I wasn't that impressed by the writing and I was hoping for deeper meanings that just weren't there. To be fair, the short stories I read are mainly magical realism, whereas this collection is realistic fiction, so the style isn't what I'm used to.I will say that I really loved the story \"Girlfriend on Mars,\" which for me was by far the strongest story of the bunch. Most of the others just didn't nearly measure up."}, {"userName": "Jenn", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/7375684-jenn", "userReview": "I loved this. Last One to Leave left me weepy at work and I'm still thinking about several of the other stories. Reading stories set in Vancouver and on the island was unexpectedly delightful. So glad I randomly picked this up at the library!"}, {"userName": "Angela", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/27409177-angela", "userReview": "I loved every single story in this collection. Would definitely recommend to everyone."}, {"userName": "Gisela", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/13665070-gisela", "userReview": "These stories all managed to draw me in immediately and they held my attention throughout. I thought the author showed incredible insight in terms of her characters and the situations in which they found themselves, and her writing skill is very impressive as well. An excellent short story collection."}, {"userName": "Shelly Donaghey", "userReviewDate": "Nov 29, 2016", "userURL": "http://www.goodreads.com/user/show/25128050-shelly-donaghey", "userReview": "THE DARK AND OTHER LOVE STORIES by Deborah Willis is a collection of small tales about little people who manage to live big lives. Each story is a superbly crafted gem of unusual love, and each in it's own way is a little sad. Ms. Willis manages to evoke an entire world by writing small details of the lives of the two main characters as they mesh into one. You can take every story here and think of it as your favorite, and you'd be right, but mine is Last One To Leave. It is so bittersweet it made my teeth hurt, but it explained a lot of what had happened in one of my own relationships. And that is the power of the well-crafted short story. It is like a slice of delicious pie, redolent of the history of the ingredients, just sweet enough to have you wanting more, and fully satisfying of and by itself. That this book contains such a wonderful sampling of Ms. Willis's abilities is a wonderful thing that should not be missed. And it is a great inducement to read her other work. I won this book through GoodReads."}, {"userName": "Megan", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/15887646-megan", "userReview": "I received an ARC of this book through a Goodreads giveaway.Such a well-written book of short stories. The complexities of love of all kinds. A truly fascinating read, each story distinct and unique, I almost wish each were it's own novel. The writing is sharp and intense, giving each story its own voice.Personally, I think Girlfriend on Mars and Todd will stick with me for a while, though, I can imagine I'll re-read it in its entirety in the future."}, {"userName": "Zoë Danielle", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/3624753-zo-danielle", "userReview": "After adoring her first collection when it was released in 2010, I was really looking forward to The Dark and Other Love Stories by Deborah Willis. While I also enjoyed these stories, they have a quiet elegance and emotion to them, I found them less consistently magical than the previous collection. Still, Willis' take on love in its many forms are often beautiful and subtle at the same time, in particular those that deal with coming-of-age, which, while not always feeling realistic, have a dark and surreal beauty to them.In the title story, The Dark, two girls at summer camp sneak away at night, while in Welcome to Paradise, two teenage best friends start breaking into houses during a boring summer. There are some weird stories, like Girlfriend on Mars about a guy whose girlfriend applies for a reality show where she will be sent to Mars, but they still manage to work. There was some repetition in theme: best female friends doing things they aren't supposed to, a teenage girl with an uncomfortable relationship with an older male, but the stories felt different enough. It is also always special to read stories set in Canada. I didn't care as much for the historical fiction, like Last One to Leave, about a woman who works at a rural newspaper and a Ukrainian immigrant, or most of the stories with older men, like Hard Currency, about a novelist who revisits his homeland of Russia, and Steve and Lauren: Three Love Stories, three short stories that tie together to tell important moments in the relationship of a relationship. I think the issue with these stories is that despite the lovely writing, I really do not care about the characters, and they weren't dark and mysterious enough to intrigue me either. That said, throughout The Dark and Other Love Stories, Willis' writing is thoughtful and beautiful, the words feel sharp and carefully placed, so although this collection was uneven for me, I am still glad that I read it."}, {"userName": "Rachel", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/16240448-rachel", "userReview": "A page turner from the very first story written with a fine rhythm that manages to capture the setting and emotions of each short tale. Willis writes about the connections humans make their a quest to lead meaningful lives with a focus on reminiscing, experiencing or losing love. Her characters all exist on the edge of danger and the wild unknown whether it be the darkness of a lake at night, the deepness of a forest, or even another planet. Willis has written collection full of longing and dark humour that reveals the depth and emotion of her characters lives. These stories will linger in your thoughts long after you have finished reading them.Like most short story collections there were ones I adored, and ones I did not like so much. My favourite stories were The Dark, Girlfriend on Mars, Passage Bird, and Welcome to Paradise--They all captured that feeling of frustration and longing in young women and their first loves and sexual awakenings. But, it was The Last One to Leave that stuck with me. I had to put the book down for the day after reading this short story to allow myself the space to fully absorb this tale of survival and acceptance of love in places that lay on the outside of the normal.At first I thought I hated Todd, but it was my distaste for the main characters folly that caused an emotional response. That is a sign of strong writing when you have such a intense response to a character. I did not like what the character did, but the writing was incredibleAll the other stories were well written, but did not impact me like the ones I mentioned above.If you enjoy speculative short fiction that deals with honest human emotion and folly I recommend this collection. Keep in mind that all short story collections will have a story you may not enjoy, but you should always push through and finish the entire collection. You may come out the other side and be surprised."}, {"userName": "Sarah Marie", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/19830974-sarah-marie", "userReview": "[ please enlighten me about what I'm missing: to me it seemed like the \"Hawk Man\" was either a pedophile or murderer. Either way a massive creep  (hide spoiler)]"}, {"userName": "Hope", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/38623583-hope", "userReview": "I don't know why I don't read more short stories. And I'm not entirely sure why I picked this book up to begin with. I guess I wanted something quick to read. I'm glad I did though. The stories were lush and emotional without being overly flowery, as some love stories tend to be. Willis's descriptions seem to flow from the relationships and the language that comes is secondary to the stories we read about. I felt like a voyeur into these very private moments, but very lucky to be able to see so many different types of love so intricately displayed. While the stories were short, the author was able to perfectly pack a whole life and breadth of emotion into them. I never felt as if they were lacking in length. A very quick and breathtaking read to serve as a reminder that love is vast in its forms."}, {"userName": "Danielle Urban", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/29092975-danielle-urban", "userReview": "The Dark and Other Love Stories by Deborah Willis is a compelling read. Each story inside contains its own set of emotions and powerful tug. Luring me deeper into its core. The characters are believable and well-developed. The stories are easy to read. Every page brings a new sense of excitement. Never knowing what the next tale will contain. Deep, engaging, and well-told. Deborah Willis is definitely talented. It shows in each piece. The Dark and Other Love Stories is a collection of fictional worlds for readers to explore. Meanings that will not be forgotten. The human heart, soul, and mind are brought up in each tale. So sad but rich...I loved reading every single story. Overall, I highly recommend it to others."}, {"userName": "Sonaksha", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/24399344-sonaksha", "userReview": "An uncannily beautiful collection of weird short stories. Every story in this collection gave me the feeling of lurking, or wandering some dark tiny lanes, seeing things I shouldn't have seen. But there's something so wonderful about the strangeness of these stories. I definitely liked some and really disliked some, as is the case with most short story collections. I didn't read this in one go because I couldn't. There's only so much of that eerie creepy feeling I can take at once. So I had bite sized portions of this, one story or perhaps two at a time. I think that's what gave me the chance to appreciate the characters and craft in some of these stories. A few stories, characters and events also left me haunted. Surely not forgetting this anytime soon."}, {"userName": "Sara Diane", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/456345-sara-diane", "userReview": "I got this from NetGalley to preview.I love short stories, and the description on this collection sounded promising. Sadly, the stories didn't live up to the hype. Each and every story ended in a dud...a rocket that never exploded. It was hard to keep connected to the characters, their voices did not ring true or clear for me. I felt like the author was trying to explore these ideas of love and really coming up empty. A rather disappointing read, especially since I couldn't stop after three stories (when I realized I wasn't enjoying them at all)."}, {"userName": "Katherine Pederson", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/69445980-katherine-pederson", "userReview": "I loved this book! The author captured the sense of place perfectly. I am from Calgary and felt I knew exactly what house was described in a certain scene in \"Welcome to Paradise\". Each story was different, with all sorts of characters that were well fleshed out. \"Steve and Lauren\" was a delight! The writing isn't complicated nor does it meander...it's a collection of inventive and wonderfully told stories."}, {"userName": "Lindy", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/35538316-lindy", "userReview": "Not anywhere near as magical, creepy, or just plain weird as the book's description would have you believe. The author is very fond of having young precocious women serving as inspiration for deadbeat dudes in the process of spiraling their way out of society. Despite this, I did enjoy the story \"Girlfriend on Mars.\""}, {"userName": "Aaron Shepard", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/21507402-aaron-shepard", "userReview": "I love Deborah's writing - the prose is deceptively light, the dialogue clever and the pace almost breezy, it's executed so smoothly. But underneath, there's so much heart and complexity: it sneaks up on you. This is one book on my shelf I'll keep coming back to."}, {"userName": "Marie Braz", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/26639939-marie-braz", "userReview": "The writing is excellent, and it’s amazing how the author is able to write from the perspectives of so many different people (male, female, young and old). The stories were too dark for me so they were not enjoyable thus the 3 stars."}, {"userName": "Leah", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/1022265-leah", "userReview": "This punchy little collection of off-beat stories provided an enjoyabler escape. It's always fun to read collection set in places I recognize, in this case, the Lower Mainland (Vancouver BC and the surrounding region)."}], "description": "“The emotional range and depth of [Willis’s stories], the clarity and deftness are astonishing.”—Alice MunroThe characters in the thirteen stories that comprise The Dark and Other Love Stories exist on the edge of danger, where landscapes melt into dreamscapes and every house is haunted. A drug dealer’s girlfriend signs up for the first manned mission to Mars. A girl falls in love with a man who wants to turn her into a bird. A teenage girl and her best friend test their relationship by breaking into suburban houses. A wife finds a gaping hole in the floor of the home she shares with her husband, a hole that only she can see.Full of longing and strange humor, these subtle, complex stories about the love between a man and his pet crow, an alcoholic and his AA sponsor, a mute migrant and a newspaper reporter—show how love ties us to each other and to the world.", "title": "The Dark and Other Love Stories", "url": "https://www.goodreads.com/book/show/24876664.The_Dark_and_Other_Love_Stories", "average": 3.77, "cover": "https://images.gr-assets.com/books/1485944353l/24876664.jpg", "reviews": 73, "authors": [{"url": "https://www.goodreads.com/author/show/7126301.Deborah_Willis", "name": "Deborah  Willis"}], "type": ["Short Stories", "Fiction", "Contemporary", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/24876664-the-dark-and-other-love-stories", "http://www.goodreads.com/book/show/30231764-the-dark-and-other-love-stories", "http://www.goodreads.com/book/show/31830616-the-dark-and-other-love-stories", "http://www.goodreads.com/book/show/8311248-vanishing-and-other-stories", "http://www.goodreads.com/book/show/25715160-the-dark"]}