{"ratings": 2231, "userreviews": [{"userName": "Emily May", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "There was a lock on the door. Two, in fact. They were long, thick bolts, top and bottom.But they were on the outside.\nThis book was so creepy. In a great way. I'm really glad I finally broke down and read a Ruth Ware book.My sister is a huge Ruth Ware fan so I, of course, in true sibling fashion, had to decide I hated her on principal and avoid all her previous books. Okay, I'm joking, but that dirty wench spoiled most of the endings to the others so I have had to bag an arc to be able to read this spoiler-free. And I loved it! Such a delicious, hard-to-put-down mystery.What's not to love about old dark secrets, even older darker houses, and mysterious family legacies?In The Death of Mrs. Westaway, Hal reads tarot cards on Brighton pier and struggles daily to pay the bills and find food to keep her going. This has been her life since the death of her mother a few years earlier. So when she receives a letter bequeathing a large inheritance to her, she decides to accept, even though she knows it must be a mistake.Hal travels down to the English coast and meets her \"family\". She is taken to the huge, cold and gloomy Trepassen house-- a place that holds a thousand secrets within its walls. It soon becomes clear to Hal that something is not quite right, that she may indeed have a history entwined with the Westaways, and that someone in Trepassen house is determined to keep the past hidden, whatever it costs.Ware builds up to her reveals so well. She had me on a hook the entire time I was reading, pacing the novel just right, gradually pulling back the curtain (and years) on the mystery. She remembers that the whys of mysteries are so much more important than the whos (because, come on, there's only so many people it can be, right?). There's just this overwhelming feeling of wrongness that permeates the novel, and it makes for a very compelling read. Though this is not a supernatural story, the author plays with your mind just enough to have you questioning your own sense of reality and logic. I love the ghostly The Woman in Black vibe, the creepy old housekeeper, and the isolated setting. The cards tell you nothing you don’t already know. It was her mother’s voice, steady in her ear. They have no power, remember that. They can’t reveal any secrets or dictate the future. All they can do is show you what you already know.I especially love how the tarot aspect plays into everything, showing symbolism in everyday objects such as the four cups on the table. As Hal's mother noted, the cards are not magic or psychic, but they do have a way of pointing you in a certain direction, making you notice things you'd ignored before. It was very effective.Blog | Facebook | Twitter | Instagram | Youtube"}, {"userName": "Chelsea Humphrey", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "\"Centered around slow building suspense and tension you could cut with a knife, gothic thriller THE DEATH OF MRS. WESTAWAY is Ms. Ware's most ambitious and entertaining novel to date.\"All hail Queen Ruth Ware! It's no secret that lady authors have been taking over the psychological thriller scene in the past decade (GiRl PoWeR), but there are a handful that seem to come to the forefront when planning out what we want to read over the summer months. Ms. Ware has been a highly coveted name in recent years and for good reason; whether you have read her books from the beginning or are just jumping into her scene, you'll note that she writes a gripping novel with memorable characters and breathtaking atmosphere. While all of her novels would be shelved clearly under the psych thriller persona, this one shined more brightly than the rest, at least in my opinion, due to it's departure into the gothic suspense territory.I'm a huge fan of stories where the atmosphere is as formidable a character as the people who are making the action happen. The Death Of Mrs. Westaway was the perfect example of such a tale, and the oppressive setting ramps up the unsettled feeling in the reader from the very first page. I almost felt that this book gave off some serious Agatha Christie vibes, but with a modern flair. The slow burning mystery portion of the novel was fantastic; it's not so much about the \"who\" but the \"why\" and the \"how\" in this case. The unraveling of what's really going on had a very traditionalist feel to it, and I wholly embraced the slight changes in the story that brought us to a climax that was both intense and gripping.Do you like playing detective, perhaps finding clues along the journey of your reading experience? Then you'll most certainly LOVE The Death Of Mrs. Westaway. The devil is in the details, and that phrase couldn't ring more true than it does in this particular story. I had such a blast trying to solve the mystery in all it's parts and found, while a slow burn through and through, I couldn't put it down due to the story's compulsive nature. Dark, unsettling, and full of unexpected twists, Ms. Ware has created one of the \"it\" stories of 2018. Highly recommended!*Many thanks to the publisher for providing my review copy."}, {"userName": "Meredith", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/30978160-meredith", "userReview": "NEVER BELIEVE YOUR OWN LIES. \n\n\nThe Death of Mrs. Westaway is a cleverly crafted atmospheric mystery fueled by deceit. Since I was not a fan of The Lying Game, I was hesitant to read this, but I am so glad I did!\n\n Struggling tarot card reader, Hal, aka Harriet Westaway, finds herself in a moral quandary when she receives a letter naming her as a beneficiary in her grandmother’s will. She believes a mistake has been made as her grandparents died long before she was born. Even though she knows that what she is doing is wrong, she is so desperate for money that she decides to travel to the funeral and play the role of the rightful heir. Hal travels to eerie Trepassen House, her “late grandmother’s” crumbling estate. She thinks that she is only going to inherit some money, but she soon learns that she has been left much more. At the estate, she meets her “uncles” and uses her keen observation skills to learn more about the creepy family that inhabited Trepassen. When Hal realizes that she has a legit family connection to these Westaways, she begins to dig for more information which leads her into grave danger.The mystery surrounding Hal’s past kept me intrigued, but it was really Hal’s character that kept me turning pages.  Her character is what I loved most about this book. Hal has spent most of her life observing vs. being the center of attention, which has enabled her to master reading people. She can use this skill to deceive, but she has a generous nature. At the same time, she is also fighting to survive and must take what she can. She is often referred to be as being mousy or weak, but her character exemplifies the notion that those who observe are more powerful than those who need to be the center of attention.Trepassen House also plays a large role. The thickly woven atmosphere surrounding the house transported me. Even though the events take place in the current moment, I felt like I had gone back in time while reading this as it is reminiscent of classic mysteries.The tarot card readings and the constant presence of magpies also contributed to this feeling.This is not a book focused on fast-paced action, but rather on slowly unveiling the nuances surrounding the mystery.  Subtle clues are planted throughout, but all does not come together until the end. This is a mystery with many layers; I found it to be intriguing, intelligent, and entertaining. I was satisfied with how things played out. The Death of Mrs. Westaway is one of my favorite reads of 2018! I recommend for those who enjoy slow-burn classic mysteries.  I received a copy of this book from NetGalley and Gallery Books in exchange for an honest review."}, {"userName": "Mackenzie - Traveling Sister", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/57632045-mackenzie---traveling-sister", "userReview": "It's publication day! Rush to your nearest bookseller or library for this one :)This book had me completely hooked from page one! I have to give this 5 glowing stars 🌟🌟🌟🌟🌟 for Ruth Ware—who if I’m being honest never disappoints me! This book was positively haunting!!! It was spooky yet meaningful, with lovely prose and compelling plot twists. I cannot recommend it enough!I finished this book last night. It was one of those books that I stayed up late on a work night to finish, because I was so invested in the story. Hal’s dilemma had me completely immersed in the book. I think most readers will find themselves wondering what they would do if they were in Hal’s position! One thing that Ruth Ware does so well in this book (and in her previous work) is to write about characters that are cut off from society in some way. Sometimes this is done through a setting or an experience, and other times it is done through their social predicament. Hal fell into the latter category, with a dash of the first. What I love about the way Ruth Ware isolates characters is how it makes you forget the noise of the rest of the world. It’s easy to put yourself in their shoes, because she writes in a way that their problem is so isolated, that it shines right off of the page. Hal’s predicament felt like it became my predicament! Hal’s strength, worries, and ideas felt like my own. I was able to fully empathize with her, and root for her along the way. \nThe promenade was empty, and the woman had disappeared into the darkness as if made from rain herself.\nHal is alone in the world. Imagine being a young woman, raised by a single mother and with no other family, and then your mother passes away in a horrible accident. Hal has no money, no family, and no friends. All she has left from her mother is her Tarot Booth on the Promenade—named Madame Margarida, after her mother—and the strength to survive instilled in her since childhood. But what Hal also has is a debt that is hard to repay. Surviving comes at a cost, and Hal has run out of options. And then one day, a letter arrives…\nDon’t fall into the trap of believing your own lies.\nThe letter informs Hal that she is set to receive some inheritance from the late Mrs. Westaway, her grandmother. The letter is addressed to Hal by name, and yet Hal knows it cannot be true. You see, Hal knows her grandparents all died long ago on her mother’s side, and the letter references Mrs. Westaway being her maternal grandmother. Still, with debt piling up higher and no chance to repay it, Hal wonders if her career of reading others and telling them what they need to hear might be just the thing to help her play the game long enough to earn a bit of inheritance.As Hal begins her journey to Trespassen House, she finds herself in over her head. It’s one thing to imagine taking a bit of money from those with plenty, but it’s another to place yourself in the center of someone else’s grief. The other Westaways are real people. And yet, there are many secrets in the home. Hal finds herself wondering if she isn’t the only person hiding something. And what will be the cost if those secrets come out?\nI can feel it—my secret—burning me up from the inside.\nI have to gush for a moment about the settings in this book. Ruth Ware uses such descriptive language, and this book takes place in some truly fantastic settings. From the spooky, abandoned promenade, to the bare apartment, to the dark mansion—I fell in love with the locations described in this book! I could imagine the settings so vivdly, as though I was there myself. I also loved the opening chapters on Hal’s work in the Tarot booth, and the people and settings she interacts with. I won’t spoil them, but they jumped off of the page for me.The duality in Hal was also a high point for me. Hal is physically meek, but she has an inner strength. The way Hal has learned to play weaker than she is, and then her shows of surprising resilience and bravery were so wonderful. Hal is an easy character to admire and to root for. Hal is someone who has been cast aside in every way, but she has never allowed it to diminish her. Hal is caring but self-preserving. Hal is honest but deceptive. Hal is calculating but impulsive.Many readers will enjoy this book, and I recommend it highly.I am so grateful to NetGalley, to Ruth Ware, and to Gallery/Scout Press for the opportunity to read an advanced copy of this book in exchange for an honest review.See my review (and more!) here: http://novelbutnice.blogspot.com/2018..."}, {"userName": "Paromjit", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "Ruth Ware writes an eerie, atmospheric and dark twisted murder mystery in the style of the golden age of crime classics with elements of the gothic. 21 year old Harriet 'Hal' Westaway lost her mother in a hit and run car accident, and took up the mantle of becoming a tarot reader at the Brighton Pier. Alone in the world, she is in dire financial straits, owing money to unscrupulous loan sharks, and facing a bleak and unpromising future. Out of the blue, she receives a letter that tells her of an inheritance left to her by grandmother, Hester Mary Westaway, which she knows is an error, as both of her grandparents have been dead for a while. Her predicament and circumstances drive her to fraudulently pursue the inheritance, as she attends the funeral and travels to Cornwall to the huge and dilapidated Trepassen House, surrounded ominously by magpies. It doesn't take her long to become aware that something is terribly wrong. This is a story of a dysfunctional family, sibling conflicts and rivalry, intrigue, legacies and buried secrets from the past.Placed in the attic room, Hal faces hostility from all quarters, apart from Ezra. The elderly, menacing and strange Mrs Warren, the housekeeper appears to have own secrets as well as knowing secrets of others. Hal embarks on a search for the truth aided by her trusty tarot cards, as she wonders what her mother's involvement with the family is. As the past threatens to reveal itself, Hal has to draw on her inner resources as danger swirls around her. Hal is a flawed character, who you can forgive her deceptions, given the precarious nature of her finances. She is brave and courageous in the face of the dark Trepassen House and all the secrets held within its walls. Ware gives us a well plotted tale with rich evocative descriptions. This is a creepy, absorbing and entertaining read which I thoroughly enjoyed with its echoes of Rebecca, Agatha Christie and more. Many thanks to Random House Vintage for an ARC."}, {"userName": "Dorie", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/16912659-dorie", "userReview": "*****NOW AVAILABLE*****After “The Lying Game” which was a little disappointing to me, I was thoroughly thrilled and engrossed in this new book. Ms. Ware has again written a twisty, dark, atmospheric thriller, this time throwing family, inheritance and sibling rivalry into the brew.Hal Westaway is still reeling from the death of her mother three months previously. She had to forgo her plans to attend college in order to take up her mother’s tarot reading kiosk on the pier in order to pay the bills. Still she fell short and she make an enormous mistake, borrowing money from someone who was beginning to put pressure on her to pay back the loan with lots of interest and even more threats, bodily threats!While dealing with all of this and what her next step will be she gets a letter that she is heir to a substantial inheritance from her grandmother, Mrs. Westaway. Hal never knew that she had a grandmother and really thinks that there is a mix up but as she is pinned against the wall with the threat from her loan shark, she makes the decision to go to the funeral and see what the inheritance is all about. She is hoping for a few thousand pounds to help her get cleared of debt and start fresh.Once at Trepassen house, a falling down, once gorgeous estate, she discoveres that her inheritance is much more than just some money and her “uncles” are none too happy about it, with the exception of Ezra who seems to take her under his wing. The house lends a lot of creepiness to the story, including the terrible attic room which Hal is now sleeping in, with it’s bolts on the outside of the door and it’s message scratched into the window.Most of the family, however, embraces her as the daughter of their long lost sister and seem ready to accept her into the fold. Once the will is read, however, Hal is not so sure she wants any part of this, thinking she has perhaps dug herself into a really dark hole. Then she decides she will “take this step by step...with the slow, measured pace of a reading. She had to turn each card as it came, consider it, find it’s place in the story . . . . . only the next card was not a card at all, it was a photograph. the photograph . . . .”There are lots of characters quite well developed including the cranky, constantly lurking, Mrs. Warren, who has been the housekeeper since the uncles were children. She seems to know all of the secrets but seems to be biding her time, does she have a secret of her own? Mystery/thriller fans are going to love this new book, I did! The only thing that brought it down to a 4 was the fact that I figured out who the “bad guy” was and most of the mystery long before it was revealed. Still the ending is a great one and I loved every minute of this novel.Many thanks to the publisher and Edelweiss for an ARC of this book."}, {"userName": "Emily (Books with Emily Fox)", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/58160628-emily-books-with-emily-fox", "userReview": "(3.5) The gothic ambience in the Trespassen house was perfect for all the family secrets.You'll spend the whole book trying to figure if/how the main character is related to everyone and who's lying!A great read! I received an ARC from the publisher via NetGalley in exchange for an honest review."}, {"userName": "Dennis", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/67496521-dennis", "userReview": "First and foremost, I'm happy to say that RUTH WARE IS BACK! I've been a fan of Ruth Ware since Day 1. In a Dark, Dark Wood was such a good debut light-mystery novel and The Woman in Cabin 10 was one of my favorite mystery novels of all time. After my disappointment with The Lying Game, I still was hopeful for \nThe Death of Mrs. Westaway\n. Ruth Ware went back to her roots with \nThe Death of Mrs. Westaway\n and created a robust, multifaceted, and fascinating story. Seriously guys, I read this 360+ page book in one sitting! Harriet (Hal) Westaway is a young twenty-something year old tarot card reader in Brighton, England. She is struggling to pay the bills; barely making rent while her business is providing dismal financial stability. With loan sharks out to enforce their illegal and exploitative payment plans, Hal is looking for a light at the end of the tunnel. Her mother died years ago, and she has no family to lean on—she is utterly alone. As Hal checks her mail, she receives notice that her grandmother, Hester Mary Westaway, has recently passed away and has left Hal an inheritance of some kind. Hal believes this to be a clerical error of some kind because her grandparents have been dead for years. Desperate, Hal decides that she can fraudulently try and claim this inheritance as her own—she's been conning innocent people for years as a tarot card reader and this will just be another gig for her. When Hal arrives to the Westaway family home, she quickly finds herself immersed in a rich family history that quickly starts to crumble. Something is wrong with this family, but Hal just can't seem to grasp what is so concerning. In a world of family dynamics, betrayal, and greed; \nThe Death of Mrs. Westaway\n delivers a realistic mystery crime-fiction novel that will keep you hooked from page one. I know it's lame to compare author's works to each other, but in order to show the reasoning behind my five-star rating for \nThe Death of Mrs. Westaway\n, I'm going to have to tell you how this story differs from Ware's other works. At its core, The Death of Mrs. Westaway provides a lot more atmospheric undertones than anything she's ever produced. Its gothic atmosphere provides a higher level of suspense that I have yet to see in anything else. This story is a lot more dense than In a Dark, Dark Wood and The Woman in Cabin 10; you can really see the progress Ruth Ware has made in her writing and she continually fine tunes it in this story. For about a good 30% of the book, we have the characterization of Hal set perfectly. At first, I immediately felt that this was going to be a slow burn novel, but I was wrong because everything comes full circle. We see Hal's desperation come to life and her willingness to deceive to survive. Hal is not the typical alcoholic unreliable narrator that we have come to grow tired of in every suspense novel that has been published since 2015. Hal is entertaining and honestly refreshing. When we meet the secondary characters, they are all unique and interesting in their own way. Each character in \nThe Death of Mrs. Westaway\n is fully developed and multi-dimensional. After reading the synopsis, throw everything you think about Ruth Ware novels out the window. \nThe Death of Mrs. Westaway\n will keep you guessing until the very end (seriously, I thought the story was winding down and was completely thrown off by the end). Thank you Scout Press/Gallery Books for my advanced copy in exchange for an honest review. The Death of Mrs. Westaway will be released May 29, 2018.One for sorrowTwo for joyThree for a girlFour for a boyFive for silverSix for goldSeven for a secretNever to be told."}, {"userName": "Tucker", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/39633342-tucker", "userReview": "3.5 stars.The cover of “The Death of Mrs. Westaway” is perfect to draw the reader into Ruth Ware’s new book. The gothic sense of creepiness from the cover is further enhanced by the evocative descriptions of the crumbling old mansion Mrs. Westaway lived in. And then there are the characters - what brilliantly conceived characters!Hal, who believes she has no living relatives receives a letter informing her that she has received a bequeath from her Grandmother. Curious and in desperate financial conditions she meets with the Grandmother's sons and is soon entangled in an elaborate web as she tries to discover what possible connection she could have to them. As successive layers of the web are unspun I found myself just as baffled as Hal about those connections. With a slow revelation of secrets, a constant sense of menace, and expert pacing it’s not surprising that Ware is compared to Agatha Christie. Ware has written a book that draws readers in and never lets them go."}, {"userName": "Jamie Rosenblit", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/2364302-jamie-rosenblit", "userReview": "Family secrets, fortune telling and intrigue set at a gothic mansion - the set up was perfect. From the beginning, Hal receives a letter telling her about the inheritance she is entitled to, confused as she has no family, but scared because she has gotten herself into debt with some shady characters, she pursues the letter. Immediately, something is off - but what exactly is it? The mystery unfolds in such an intriguing way, I was instantly hooked and curious to know what was happening here. I really enjoyed the way the story played out and this was my favorite Ruth Ware to date. I liked The Woman in Cabin 10 but didn't think it was the masterpiece some other people did and I did not finish The Lying Game so I wasn't sure how this one would be for me - and I was thoroughly impressed. 5 stars from this bookworm!Thank you to Gallery, Threshold and Pocket Books for an advanced copy. All opinions are my own."}, {"userName": "Emma", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/28602001-emma", "userReview": "This is one of those books that relies on conversations not had, coincidences, misunderstandings or misexplainations, and a serious dose of people seemingly deliberately taking the least likely option necessitated by the evidence. If, while reading, I have to whisper 'are you serious?' to myself repeatedly as I follow the main character's journey, it is not a good thing. The author seems to have thought out a story then said to herself, how can I make this needlessly messy so it looks cleverer? Whole sections are entirely unnecessary and the book doesn't know whether it's trying to be gothic horror, Agatha Christie style whodunnit, or psychological thriller, ending up doing none of them well.Still, it seems to be only me who thinks this way so *shrugs shoulders and walks away*....ARC via Netgalley"}, {"userName": "Abby (Crime by the Book)", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/45237578-abby-crime-by-the-book", "userReview": "Find my full review here: http://crimebythebook.com/blog/2018/2...LOVED. THIS. BOOK!! I’m a huge fan of Ruth Ware’s work, and this was most definitely my favorite book of hers yet. It’s a brilliant plot with tinges of gothic suspense & a quasi-locked room mystery. Love, love, love!!!"}, {"userName": "Pauline", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/57991562-pauline", "userReview": "The Death of Mrs Westaway by Ruth Ware was so good that I could no put it down and read it in one day. Hal who is living hand to mouth and has no family receives a letter telling her that her grandmother has died. The lawyer has enclosed the details of the funeral arrangements and the reading of the will. Hal does not believe that the letter has been sent to the right person but decides to go anyway as this may be a way out of her financial situation. This book is very creepy and parts sent shivers down my spine as Hal tries to work out what her relationship to this family really is.I would like to thank NetGalley and Random House UK, Vintage Publishing for my e-copy in exchange for an honest review."}, {"userName": "Reading.Between.Wines", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/5990485-reading-between-wines", "userReview": "⭐️⭐️⭐️⭐️ / 5 You guys, I am so torn about my feelings! I liked The Death of Mrs. Westaway a whole lot more than The Lying Game, but I didn't love it like I loved The Woman in Cabin 10. It was a bit repetitive (like describing how one man is doughy around the middle constantly), and Hal, the main character, said sorry so much that it started driving me crazy. However, The Death of Mrs. Westaway did make me laugh out loud more than once, and I really enjoyed the diary entries that are interspersed throughout.The Death of Mrs. Westaway is about a girl named Hal who is down on her luck (to say the least). Her mom passed away, she owes a loan shark money, plus the tarot reading business she took over when her mom died is barely bringing enough money in to pay the bills, let alone pay off her loan. So when she gets a letter from a lawyer about being named in a dead woman's will who is supposedly her grandma (even though she knows she isn't), Hal jumps at the chance for some free money. Using what little she has, Hal hops a train and heads out to the estate. From there so much suspense ensues that this book was incredibly action packed. I never got bored with The Death of Mrs. Westaway and the ending was like BAM, so crazy and I didn't see it coming. There was mystery and suspense from the first page which a lot of people are going to love. It also has an old-timey feel even though the latest the book goes back is the mid-90s. I honestly felt like I was reading something based in the 40s or 50s then someone would mention a phone and I'd be like whaaaat? I loved the old timey feel though, and it really made this book stand out for me.Final Thought: Even though this book didn't quite live up to what I was hoping it would be, I still really enjoyed it. I think a ton of people are going to enjoy this new creation from Ruth Ware. It is just so different from her other books, but in a good way. Ware is definitely one of my favorite authors, and I cannot wait to see what she comes up with next. The Death of Mrs. Westaway in 3-ish words: Imaginative, Delightful & Deceptive"}, {"userName": "Zoe", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/18237582-zoe", "userReview": "Ominous, atmospheric, and darkly mysterious!The Death of Mrs. Westaway is a gothic, character-driven thriller that takes us into the life of Hal, a young woman recently orphaned and struggling to make ends meet as a tarot reader when she receives an unexpected bequest that will unearth tragic memories, powerful emotions, and long-buried skeletons that will change more than one life forever.The writing is polished and taut. The characterization is well done with a cast of characters that are complex, troubled, and resourceful. The setting, Trepassen House, is a character itself with its dereliction, isolation, abundance of magpies, and multitude of secrets. And the plot is well crafted and builds subtly to create tension and suspicion as it unravels all the deceptions, lies, personalities, and relationships within it. Overall, The Death of Mrs. Westaway is another gripping, eerie, intelligent page-turner by Ware with a classical crime style that is guaranteed to mystify, surprise, and keep you guessing until the very last page.Thank you to Simon & Schuster Canada for providing me with a copy in exchange for an honest review.All my reviews can be found on my blog at https://whatsbetterthanbooks.com"}, {"userName": "Marialyce", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "4.5 fascinating Gothic starsYou can find my reviews here: https://yayareadslotsofbooks.wordpres...This was my first Ruth Ware book. I know, where have I been? .....and boy I was not in the least disappointed. Put together a somewhat mistaken identity, a young girl on the run from a dangerous creditor of the broken teeth, broken bone variety, a strange family, a missing sister, a Gothic mansion, an old, scary, nasty housekeeper, and the death of the matriarch and you have the makings of this wonderful thriller. Harriet, Hal Westerway receives a letter that will, she thinks, surely save her life. She is destitute, a reader of Tarot cards in a local midway, and in so need of some good news. It arrives in the form of a notice that she might possibly be a beneficiary of her late grandmother's fortune. Harriet knows her past and knows that this woman, Mrs Westerway, could not possibly be her grandmother, but being desperate, Hal decides to travel to the Cornwall mansion, meet the family and carry on the deception. However, things do get strange as Hal becomes interested in finding out what happened to her supposedly missing aunt who left the Westerway mansion many years prior and was never heard from again.Hal meets her supposed family and they seem to take her into their family circle, something she longs to be a part of. However, there is mystery afoot and as Hal gets in deeper and deeper into the lives of the Westerway family, she learns the truth. It could be a dangerous find for Hal and one in which her life could be lost. In a truly wonderful thriller fashion, Ms Ware takes the reader on a ride through the Westerway past and creates a book that is addictive, hooking the reader in from the get go to the final scene. “Some books are to be tasted, others to be swallowed, and some few are to be chewed and digested.” (Francis Bacon) You will probably do all the things Mr Bacon suggested with this wonderfully written book. This book was brought to me by my local library and my thanks and gratitude are always there for the awesome job they do."}, {"userName": "Shannon", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/60039400-shannon", "userReview": "I was very fortunate to receive an ARC of The Death of Mrs. Westaway thanks to @ I had been in a MAJOR book slump but I knew this book was coming and it was all I wanted to read! Of course it came late but it was oh so worth it!I loved it! Hal Westaway, aka Harriet, is a struggling tarot card reader. She took over her mother’s job once her mom passed away. Hal can barely afford rent or other bills that are due. She has scary loan sharks out for her after borrowing $500. So when she receives a letter stating her grandmother, Mrs. Westaway, left Hal an inheritance she sees an opportunity that would be helpful. The problem is this Mrs. Westaway cant be Hal’s grandmother. Her own grandmother has long passed and she has no other family. Hal decides to pursue the letter anyway.Once she meets the family of Mrs. Westaway, Hal starts questioning everything. Family secrets, gothic atmosphere, lies, ooo so good! This was such a fun read! I could not put it down! Get excited y’all!!! 4.5 Stars"}, {"userName": "Bam", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "*4+ stars.Twenty-one year old Harriet ‘Hal’ Westaway is desperately trying to hold her life together. Three years before, her mother was killed by a hit-and-run driver and Hal took over her tarot reading kiosk on the pier in Brighton to support herself. But during a hard financial stretch, Hal went to a loan shark for help and now she is being threatened with bodily harm over non-repayment of the ever-increasing amount. So when a letter from a lawyer appears in her mail, Hal expects another threat..but instead, it informs her that her grandmother Hester Westaway has died and she is in line for a sizable inheritance. Oh happy day!The problem? Hal’s maternal grandparents died before she was born and she never knew her father—she was supposedly the result of a one-night stand and Westaway is her mother’s maiden name. So obviously some mistake has been made, a case of mistaken identity. But she so desperately needs the money…could she pull off the deception that she is indeed the long-lost granddaughter?? She convinces herself she can, packs a pathetic suitcase, and scrapes enough money together to take the train to Cornwall for the funeral. As she gets her first view of Trepassen House, dark and forbidding, she notices magpies circling the house:One for sorrowTwo for joyThree for a girlFour for a boyFive for silver Six for goldSeven for a secretNever to be toldRuth Ware has created a rather gothic tale of dark, hidden secrets with a likable character in Hal and an interesting cast of supporting characters. The tension builds deliciously and just when the reader thinks she's figured it all out, the story twists again. Interspersed with Hal's story are journal entries written by a young woman living in the attic room at Trepassen House in 1994...a woman who gets increasingly desperate as she realizes she is pregnant. Someone who may have been the one who scratched 'HELP ME' in the pane of the room's barred window...Grandmother Hester had written a French phrase which translates to something like \"After me, the flood.\" Was she hoping or predicting that all their family secrets would be revealed after her death? And what will the truth unleash if it is revealed?Another winner from Ruth Ware! Put this on your summer reading list! Thank you to NetGalley, the publisher and author for providing me with an arc of this new suspense thriller for an honest review."}, {"userName": "Tammy", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/50603889-tammy", "userReview": "Make no mistake, Mrs. Westaway does die but mistakes are made. Harriet (Hal) Westaway, a tarot card reader on the pier in Brighton, is seriously strapped for cash. Hal receives a letter indicating that, as the granddaughter of Mrs. Westaway, she is a beneficiary of her will. But, there has to be a mistake. Hal never knew Mrs. Westaway and her deceased mother’s name is not the name cited in the letter. She decides to commit fraud and attend the funeral as well as the reading of the will. Hal finds herself trying to hoodwink a dysfunctional family at an enormous, crumbling estate. The irascible housekeeper, straight out of Rebecca, seems to know more than she’s revealing. If you like Ruth Ware it wouldn’t be a mistake to read this book."}, {"userName": "Ova Incekaraoglu", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/5316099-ova-incekaraoglu", "userReview": "I love the bleakness in Ware's novels. I love her independent female protagonists, they don't need a man to rely on, or solve their problems, a lot different than the usual damsel in distress. The Death of Mrs Westaway was an exceptionally well-written book. We follow the story of Hal, crushed by her mother's sudden death she's trying to make a living inheriting her Tarot reading business on Brighton pier, until a letter changes her life forever. She's been pulled into an inheritance drama, which takes her to miles away from Brighton to misty Cornwall where a grand mansion full of magpies, lies, secrets and the reality about her mum's past awaits her...The story was bleak and the gothic atmosphere was as magical as Cornwall's foggy mornings. Blending Tarot reading into this story was genius. I loved the ending and definitely didn't see the 'main' surprise coming. Ruth Ware doesn't disappoint. I've read all her books since In a Dark Dark Wood and looking forward for the next one out. A 5 star mystery / thriller with quality writing, solid characters and flawless plot line.Thanks to NetGalley and Random House UK for an advanced reader copy in exchange for an honest review."}, {"userName": "Cindy Burnett", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "The Death of Mrs. Westaway is the first Ruth Ware book that I have read. The gothic elements of the book appealed to me (and the magnificent cover), and I was not disappointed. The book is full of dark and twisty story lines and a mysterious and creepy family home, and I thoroughly enjoyed following Hal’s progression as she attempts to uncover the sinister goings-on at the Westaway family home. The Death of Mrs. Westaway is a clever, highly atmospheric book with creepy undertones that made me want to keep my light on at night after I finished the book."}, {"userName": "Erin Clemence", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/16907451-erin-clemence", "userReview": "Thanks to NetGalley and the publisher for a free, electronic ARC of this novel received in exchange for an honest review. \n Ruth Ware is back with her third novel, “The Death of Mrs. Westaway”. In this novel, Harriet (Hal) is struggling to make ends meet after the tragic and unexpected death of her mother. Hal is making her meagre living as a fortune teller, following in her mother’s footsteps even though she does not believe in what she practices. When she receives a letter stating that her grandmother has passed and she needs to attend the reading of the will, Hal sees the obvious miscommunication as an oppourtunity for deception and a quick way to profit. However, when Hal makes the trek to the gloomy manor and meets the Westaways, she realizes that she may have more in common with them than she thinks, and perhaps her mother was the one keeping secrets all along. I thoroughly enjoyed “The Woman in Cabin 10” however, Ware’s proceeding novels (including this one) have been mediocre at best. This novel is trite, one of many tales of old English manors, family secrets and unclaimed fortunes. Hal herself is a likable enough character, but it was difficult to keep track of the other characters in the novel (it did not help that many of the characters had similar names, such as Maud and Maggie, Ezra and Edward and even Harding and Hal herself) and it was very easy to get lost in the noise. The story started off slow and held my attention only by a loose thread. I was expecting suspense, mystery and intrigue, and instead got a family drama, interspersed with some action. The plot itself was entertaining enough to keep me engaged, but it was not at all unique or engrossing. When the ending came, it too was lackluster and disappointing, as well as predictable. With “Cabin 10”, it was easy to determine that Ware has writing talent, however her other novels (and this one in particular) feel forced. Ware seems to be struggling to find the passion and creativity she once had with “Cabin 10”, and although “Westaway” doesn’t quite hold up to its expectations, I have faith that Ware will find her way back to the mystery/suspense genre and blow us away once again."}, {"userName": "Chandra Claypool (wherethereadergrows)", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/9722719-chandra-claypool-wherethereadergrows", "userReview": "The thing with Ruth Ware, is that she builds this perfect atmosphere for the set she's trying to create. In A Dark, Dark Wood, we had that hen party drama that, let's face it, is always fun to read. In The Woman in Cabin 10, we have the ship and tense feeling of someone going overboard at any given moment and then in The Lying Game we get back to a group of women and all the drama that can entail. With The Death of Mrs. Westaway, now we have a setting in an old worn down house where a family that's basically all estranged with each other congregate over the will of their matriarch... who certainly doesn't seem loved by any.Hal thinks there's a case of mistaken identity when she gets a letter about an inheritance she may have from the late Mrs. Westaway. The longer she is around the family and the further she digs in to their history, the more she gets a sense of unease that even her tarot cards can't help figure out. I do love the way Ware writes. It's easy to follow, it flows and she will always be an auto-buy author for me. While I did enjoy this story, I wasn't ever shocked with any of the news and didn't quite get that \"thriller\" feel. Honestly, I think my favorite scene is when she does a reading for Kitty as somehow that's when I felt most connected to Hal. I was engaged in the story but I never felt that HOOK... that need to know.. that OH MY GOD WHAT'S HAPPENING?! That's not to say that isn't a good story. It absolutely IS. The atmosphere is fantastic. However, I did feel that some parts dragged, but honestly - what type of family reunion doesn't - am I right? 😉All in all, another top notch story from the amazing Ruth Ware. This didn't quite work for me as well as some of her other books but it certainly doesn't take her off my top women thriller writer's list either. I just can't see that ever happening. Perfect for lovers of that gothic suspenseful read around an old house full of secrets.Thanks so much to the Publisher for this copy!"}, {"userName": "Book of Secrets", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/3453249-book-of-secrets", "userReview": "4.5 Stars → Ooo...lots of Gothic goodness. Review coming soon!"}, {"userName": "Umut Rados", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/24816039-umut-rados", "userReview": "For full review, please visit my blog: https://umutreviews.wordpress.com/201...A mystery with no domestic violence, no child abuse, no graphic violence, sexual assault, no wives looking out of the window! Finally, a thriller that doesn't make you feel bad with the content. I loved Ruth Ware's new book to bits. It was very atmospheric, that you feel in the middle of the setting. She engaged me from the beginning till the end. It was not only the mystery I was following, but I was enjoying her beautiful writing as well.I also liked the fact that it was also a feminist book with many strong women characters in it, our protagonist being one of them. The book hooks you from the beginning and gives you tips all through the way and you wreck your brain to find out the mystery. It’s very cleverly set up and there are no loose ends. So, she tied up everything well in the end.I really can’t fault this book, I enjoyed it a lot. It’s definitely one of my favourite thriller recommendations of the year.Thanks to NetGalley and Random House UK for providing me a free copy in exchange for an honest review."}, {"userName": "Amy", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/14045562-amy", "userReview": "4.5/5Ware’s debut, In A Dark, Dark Wood was one of my favorite reads of 2015 and then The Woman in Cabin 10 was another solid read for me, although I wasn’t as obsessed with it as IADDW. When The Lying Game was released last summer I grabbed a copy but I still haven’t read it. I saw SO many mixed reviews that I just skipped it for now, but all of that to say, as soon as I read the blurb of this one I was excited! It sounded like it would have some of the same elements that I enjoyed in IADDW and it definitely did, and while Ware’s debut remains my favorite of her books, this is definitely a close second.Ware has an amazing talent for writing in an atmospheric way that really pulls the reader into the worlds she creates. When Hal enters the world of the Westaway family there was such a dark intensity, such a strong feeling of menace and danger lurking in the family home, it was creepy and strangely intoxicating. Hal is a tarot card reader and this added a mystical tone as well that when combined with the setting created that perfect storm of scary and fascinating.Ware is really such a talented writer, her skill is even more apparent when I realized that some parts of this dragged a little for me but I was still entirely hooked. That doesn’t happen often, if things begin to drag I’m usually forcing myself to read, and the wait was most certainly worth it this time, when all was revealed I was shocked and totally satisfied! I also really enjoyed Hal as a character which makes it even better, I’ve had issues with Ware’s previous protagonists and this time I was behind Hal one hundred percent.The Death of Mrs Westaway in three words: Ominous, Unsettling and Creepy."}, {"userName": "Jennifer", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "Ruth Ware has definitely proven her talent with The Death of Mrs. Westaway. Thoroughly developed characters, complex family dynamics, a gothic setting with plenty of engaging foreboding, and a mystery worthy of seasoned readers...it was excellent. I love Ruth Ware's storytelling and The Death of Mrs. Westaway is not to be missed. Check it out!My favorite quote:\"There is no higher meaning. Some things things happen for no reason. Fate is cruel, and arbitrary. Touching wood, lucky charms, none of it will help you see the car you never saw coming, or avoid the tumor you didn't realize you had. Quite the opposite, in fact. For in that moment that you turn your head to look for the second magpie, in the hope of changing your fortune from sorrow to joy – that's when you take your attention away from the things you can change, the crossing light, the speeding car, the moment you should have turned back.\""}, {"userName": "Janelle", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/20742472-janelle", "userReview": "Many thanks to Gallery Books for my free copy of THE DEATH OF MRS. WESTAWAY by Ruth Ware - all opinions are my own.My favorite Ruth Ware novel to date is an extraordinary, atmospheric, slow burning, suspenseful, and haunting mystery that completely consumed me from beginning to end. Think Agatha Christie with a modern twist!Hal is in her early twenties, alone in the world with no family, a tarot card reader struggling to pay the bills. One day she receives a letter that states her grandmother passed away and it names her as the beneficiary for the inheritance. Hal thinks this is a mistake because her grandparents died long ago, but since she is desperate for money she decides to play the part as the rightful heir. When she arrives at the estate, however, she realizes there is a history with this family and notices something is not quite right.The character of Hal is masterfully written and I love her as a tarot card reader. Also, there is nothing better than when the eerie, mystical atmosphere plays a formidable character in the story. The descriptions of the house, the surroundings, and the characters were so vivid, I could picture every detail in my mind. THE DEATH OF MRS. WESTAWAY has such a brilliant, compelling, and spellbinding plot - Ware has a way of drawing you in where the outside world no longer exists. And she really knows how to build up her reveals because I literally did not know what was going to happen until the very last page. Ruth Ware is an incredibly talented writer with impeccable style and this book deserves all the stars!"}, {"userName": "bran (brandonthebookaddict)", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/13699205-bran-brandonthebookaddict", "userReview": "I really liked this one....review to come :)"}, {"userName": "Adah Udechukwu", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/23283720-adah-udechukwu", "userReview": "The Death of Mrs. Westaway was an intriguing read with its twist and turns."}], "description": "On a day that begins like any other, Hal receives a mysterious letter bequeathing her a substantial inheritance. She realizes very quickly that the letter was sent to the wrong person—but also that the cold-reading skills she’s honed as a tarot card reader might help her claim the money.Soon, Hal finds herself at the funeral of the deceased…where it dawns on her that there is something very, very wrong about this strange situation and the inheritance at the centre of it.", "title": "The Death of Mrs. Westaway", "url": "http://www.goodreads.com/book/show/36373481-the-death-of-mrs-westaway", "average": 4.06, "cover": "https://images.gr-assets.com/books/1518710953l/36373481.jpg", "reviews": 685, "authors": [{"url": "https://www.goodreads.com/author/show/9013543.Ruth_Ware", "name": "Ruth Ware"}], "type": ["Mystery", "Thriller", "Thriller", "Fiction", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/36373481-the-death-of-mrs-westaway", "http://www.goodreads.com/book/show/37755125-the-death-of-mrs-westaway", "http://www.goodreads.com/book/show/36237273-the-death-of-mrs-westaway", "http://www.goodreads.com/book/show/37115351-the-death-of-mrs-westaway", "http://www.goodreads.com/book/show/28187230-the-woman-in-cabin-10", "http://www.goodreads.com/book/show/27834600-in-a-dark-dark-wood", "http://www.goodreads.com/book/show/32895291-the-lying-game", "http://www.goodreads.com/book/show/37640637-huis-te-koop", "http://www.goodreads.com/book/show/40242199-new-ruth-ware-thriller"]}