{"ratings": 1523, "userreviews": [{"userName": "Cat", "userReviewDate": "Jun 28, 2014", "userURL": "http://www.goodreads.com/user/show/9728092-cat", "userReview": "I have been wanting to read Joanne Harris's first book for a very long time. Now I got the chance and I'm afraid it wasn't the best experience ever.I found the story a bit confusing towards the end, and that was a disappointment because the whole action was all jumbled. I got the idea of what happened, but I am afraid that I may have lost something in the confusion of narrators' voices. I couldn't understand if it was Daniel's voice or the omniscient narrator's voice from Alice's parts that was being used.This messy ending ruined the story for me. I won't say that I was finding it a great story, but it was dark and entertaining enough to keep me going. Then, that end, confusing as it was, made this story a complete letdown.On the positive side, however, it was a relief to read a story in which vampires are vicious, cruel, with a lust for blood. Fortunately, there are no vampires falling in love with a human being in this book."}, {"userName": "Blair", "userReviewDate": "Apr 03, 2014", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "Split between the 1940s and a modern narrative (1980s/90s?), The Evil Seed tells of the havoc wreaked in the lives of two sets of characters by a beautiful and ruthless 'nightwalker'. (Basically a vampire, although this kind doesn't conform to many of the popular myths, eg being unable to venture out in daylight.) In 1948, Cambridge scholar Daniel Holmes rescues a girl called Rosemary from drowning; he falls madly in love, only for her to start a relationship with his best friend. His story, charting a gradual descent into obsession and madness, is written as a journal. In the modern narrative, also set in Cambridge, an artist named Alice is disconcerted when her ex-boyfriend Joe asks her to offer a spare room to his strange new girlfriend, the ethereal Ginny. The Evil Seed was Joanne Harris's first novel, reissued after her success with Chocolat etc, and the author's foreword suggests she is now somewhat embarrassed by it. It's easy to see why: it is frequently amateurish and the style doesn't seem to have much in common with her later work (although, only having read two other books by Harris, I'm not an expert). Many of the events stretch the limits of plausibility, to say the least - I'm not talking about the vampire stuff, but things like Joe expecting Alice to let Ginny stay in her house (who would ever do this?!), and Joe seeming completely unfazed at the idea that Ginny might be a heroin addict, as if such a thing is no big deal. The characters' emotions are all over the place and they often contradict themselves several times during the course of a few pages.That said, I still enjoyed this. It's atmospheric, compelling and fun, and although I would have preferred a more subtle approach (it definitely descends into horror towards the end), there's enough gothic intrigue to keep it genuinely interesting. I don't think I can really say that I would recommend it, but I never wanted to give up on it, and I don't regret reading it either. I wanted it to distract me from certain things I don't want to think about at the moment, and it did its job rather well."}, {"userName": "Annalisa", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/16578404-annalisa", "userReview": "Joanne Harris considera questo libro un po' come il suo figlio negletto, e lo scrive in una nota introduttiva.Io non la vedo così. Io l'ho apprezzato tanto, per me come romanzo gotico moderno funziona, eccome.\nOgnuno ha un lato oscuro del proprio carattere, e nell'oscurità c'è un'attrazione irrevocabile\ndice l'autrice in un'intervista.Ed è questo che mi avvince in questo ed in altri romanzi, l'incedere di questa atmosfera scespiriana di ineluttabilità, del male potente, più forte del bene purtroppo, e dell'impossibilità di fronteggiarlo e della nostra debolezza di fronte ad esso.Secondo me, oltre agli artisti preraffaelliti e al classico tema gotico del vampirismo la scrittrice ha di certto risentito l'influenza di un'altro romanzo che è tra i miei preferiti Ghost Story di Peter Straub."}, {"userName": "Emma", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/26734926-emma", "userReview": "[ Even after he turned into a vampire, he remained pathetic.  (hide spoiler)]"}, {"userName": "Oria", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/3735209-oria", "userReview": "\"Something inside me remembers…\"I loved this book, but then it was hard not to, as it has many of the elements I like: mystery, obsession, death, vampires, an old diary, complicated relationships, a great title and a gorgeous cover. I’ve been known to buy books based on less than the above mentioned things. But this, I must admit, having spent a day reading most of it, was such a great story I was sad to see it end. From the start I was captivated by Alice, who makes her living from art. There is a scene where the author describes Alice at work, painting a scene of ethereal beauty, so immersed in her work she forgets herself or the time and I thought, how very much like Joanne Harris she is, because I was so engrossed in this book I wasn’t able to put it down and I was surprised to see hours had passed and I hadn’t moved from my chair on the balcony under the mango tree, because this book had me under a spell. There’s a dreamy quality to the writing, a Gothic thread running through the whole story, and it turns and twists bringing new elements to the surface. The story is told from the point of view of two narrators, Daniel Holmes, whose tale begins after the Second World War, and Alice, who bring the story into present day. I liked how their experiences were like two halves that joined together made it complete. Their stories have a central point – Rosemary, the young girl of ethereal beauty who brings destruction and death wherever she is. There were times when I wondered if Rosemary wasn’t a victim herself, condemned never to rest, bringing tragedy to all the men who loved her, and they, in return, not being able to let go of her, commit the sin that will bring about a new cycle of destruction. And so it goes, a wheel within a wheel, unbroken in time, because to truly break it would mean forgetting and they can’t do that, no one who has known her can. I have another book by Joanne Harris, Blueeyedboy, bought years ago on a whim because I had always wanted to read something by the author of Chocolat, a movie I loved even if I haven’t read the book. I’m now glad that I started with this because it only made me want to read more of her work. I was surprised to see quite a few negative reviews on goodreads, people complaining of this and that, how certain elements are not believable. Oh well, if you can’t suspend your disbelief (remember, this is a vampire novel), then maybe this is not the book for you.I’m glad this is the kind of novel where vampires are old (in age only, of course), cruel and beautiful and at the same time as vulnerable as they are ferocious in their hunger. I wish there was a sequel. I wish I knew who Rosemary truly was and where she was born and how she came to be such a destructive force over such a long time. But even if I will never know her whole story, I can still love the book because like all good stories, it’s made of shadow and light and the shadow is intriguing enough that whatever comes into the light is enough to make it unforgettable.I will remember…"}, {"userName": "Steven Naude", "userReviewDate": "Mar 05, 2013", "userURL": "http://www.goodreads.com/user/show/10376117-steven-naude", "userReview": "Joanne Harris can take the story of the hare and the tortoise as her raw material and use this to construct a majestic novel. In this case it is a potentially very lame theme of vampirism. But in her hands it becomes a three-generation saga with mystery, intrigue and perfectly formed characters - no werewolves, no glistening skin and no crap. In fact the characters and plot are the focus, not the cliché’s about vampires. There is blood and gore but it is not gratuitous. As with all her work the plot twists and turns into corners where you cannot imagine a solution, but somehow (and credibly) she adds a simple new twist and we are back on track. She is a master story teller and this is the fourth of her books that I have enjoyed. I like the way she thinks almost as much as her unequalled use of descriptive language - surely unique in this genre. Both narrators are outstanding and I would highly recommend this set."}, {"userName": "Paula", "userReviewDate": "May 12, 2010", "userURL": "http://www.goodreads.com/user/show/3720054-paula", "userReview": "My friend gave me 'The Evil Seed' as a gift. 'The Evil Seed' was her debut novel and due to popular demand was re~published (this also happened with her second novel, 'Sleep, Pale Sister', which I have also read and enjoyed). I really enjoyed reading 'The Evil Seed', the story was excellent, two stories are told interwined throughout the book, the story of Robert, Daniel and Rosemary and the story of Alice, Joe and Ginny, are Ginny and Rosemary the same woman? well you will have to read and find out. As in 'Sleep, Pale Sister' I notice that the female characters were alot more stronger than the male characters, I do not know if this occurs in Joanne Harris's other books (I will need to find out), I found it refreshing to read such strong female characters, the male characters are dependable, which for me created a good balance.A truly scary gothic book, I loved the setting (Cambridge), I truly believe 'The Evil Seed' would make an excellent film."}, {"userName": "Alice", "userReviewDate": "Nov 27, 2008", "userURL": "http://www.goodreads.com/user/show/1632342-alice", "userReview": "I wouldn't normally read books about vampires and I was disappointed by this book. I read it because I have enjoyed other books written by Joanne Harris. The clumpy story line and voice of the book made it hard to want to pick up and read. I could tell that it was Harris' first book and she had not yet found her 'voice' that she has in later books. It took me a long time to finish."}, {"userName": "Carina Rosa", "userReviewDate": "Aug 01, 2015", "userURL": "http://www.goodreads.com/user/show/16080174-carina-rosa", "userReview": "Não terminado."}, {"userName": "Mariana", "userReviewDate": "Jul 01, 2013", "userURL": "http://www.goodreads.com/user/show/17958688-mariana", "userReview": "Okay, let's see... I liked this book however I didn't liked that much. The things that I really loved in this one were the atmosphere and the scenerio and also how Joanne Harris used vampires. It wasn't a cheesy vampire's story, thank god (I wouldn't probably handle it to be honest). Towards Rosemary/Ginny I have these hate and \"love\" feelings, you see, she manipulated people and made them love her at the point that they would risk their lives to protect her, it was her plan of course. Like this I kind of liked her because she had power, she knew how to play and survive. However, the way she pretended to be innocent and made others sound like they were wrong made me kind of hating her. I really liked Daniel, he loved her but he would be able to kill her to end his suffering, I think. Joe and Robert were just blind. One thing is right for sure: love can blind us. Somehow I liked very much Rafe, don't ask me why. Perhaps he made me think of Dorian Gray, they aren't alike but Rafe made me remember Dorian and that amused me.It wasn't my first book of Joanne Harris but I can say that her writing style developed very well. The dark atmospheres are a common thing in her other books and it makes me really happy; I love how she describes it. And I think this is all I have to say... If I remember anything else I'll probably just add it later on. [As usually my ability to review is just fantastic.. not really but, oh well, it's better than nothing]"}, {"userName": "Mariazita", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/5368409-mariazita", "userReview": "Este é o primeiro livro da autora, e está bem patente o principio de uma maravilhosa escritora, que escreve livros de uma maneira muito peculiar , entre o sonho e a realidade, entre o presente e o passado entre o real e a pura magia, é assim que eu vejo as histórias de Joanne Harris.Considero que a primeira vez que lemos Joanne Harris estranhamos a sua maneira de escrever mas ao longo da leitura vamos ficando encantadas pela sua escrita peculiar, para mim foi assim, estranhei e depois fiquei viciada.Este primeiro livro foi interessante de ler e constatar a evolução da escritora, aqui estão as primeiras sementes da sua futura escrita, se este fosse o primeiro livro que tivesse lido da autora de certeza que iria ler os outros , pois adorei esta estranha história sobre vampiros, original e muito bem escrita.Gostei."}, {"userName": "Chris", "userReviewDate": "Feb 09, 2015", "userURL": "http://www.goodreads.com/user/show/1605591-chris", "userReview": "So this was Harris' debut novel that was out of print until people clamoured and they released it. Harris herself seems rather on point about the work in her introduction. I normally love Harris, but not this one.Mortal Love by Elizabeth Hand is somewhat similar and far better. (and no, I don't think there was any plagarism or what not. The sprig of idea is simiilar, and plots are far different)."}, {"userName": "Maria", "userReviewDate": "Jan 02, 2012", "userURL": "http://www.goodreads.com/user/show/7278451-maria", "userReview": "Um daqueles livros que nem sei muito bem como classificar. Gosto de livros sobre o fantástico mas achei este um pouco confuso, sempre a saltar entre 2 momentos no tempo mas que baralhava um bocado por não ser muito claro esse salto, só depois de lermos algumas linhas. Não foi uma leitura que me tivese prendido mas também não dei por mal emprego o tempo que perdi a le-lo. Mas nota-se que não é de todo o género de livro para o qual esta autora esteja vocacionada"}, {"userName": "Aimee", "userReviewDate": "Sep 29, 2009", "userURL": "http://www.goodreads.com/user/show/2759722-aimee", "userReview": "Having finished this book, to quote W.B. Yeats: my wretched dragon is perplexed.Word of warning; this will only be a MINI book review, rather than a full book review, because I think the writing in this novel reflects something that is only 'halfway there'.The Evil Seed is an often confusing. sometimes numbing and other times flamboyantly lovely read - a strange hybrid of Samuel Taylor Coleridge's \"Lesbian Vampire\" poem 'Christabel', and the videoclip of Guns n Roses 'November Rain', with a sprinkling of The Secret History and a couple of Interview with the Vampire remarks. Unfortunately, the originality, creativity and unique books of all such mediums referred to in the previous sentence are lost in the inexperience of Harris' first attempt at writing.The novel intrudes on the mind of uni student and artist Alice at a vulnerable time - she is reminiscing about her former romantic relationship with Joe, but suddenly she finds herself having to house the new girl he is besotted with: Ginny. Ginny is like the hottest Kate Bush you ever did see, and perfects the look of 'Little Girl Lost'. But her friends are kinda weird - it takes three invitations for them to step across a door threshold into your house, and they only like to come over at night, if at all possible.At first, Alice believes that jealousy is the culprit responsible for her ill feelings towards Ginny, but when she finds an old diary of a gentleman's run in with a Kate Bush vampire, Alice begins to suspect that the truth about Ginny may be very sinister indeed...Joanne Harris, the author of such mini masterpieces as Chocolat, wrote this book when she was a fresh, impressionable 23 year old. She admits herself that she struggled with the idea that the book should be republished, once she became famous and everything. And I have to be frank and say I understand her concerns. I could see glimpses of the glorious, but overall I felt that lingering university student angst, that 90s love for gothica in its darkest and most grunge-like form and a sense of an author that hadn't quite found her voice just yet.This book is, overall, romantic and lusty and bloody. The vampires (though they are never referred to as this, only 'Nightwalkers') are of the monstrous, ravaging type. They can hypnotise and manipulate people into doing whatever they please, and they appear to live only for hunger and fear.At times the writing screamed for simplicity, and instead was overwritten, but I enjoyed the Byronic character of Daniel (diary guy), though the modern-day Alice lesser so. This was a little too dark, musty and derivative to be a great read, but I still consider it to be a good read, particularly if you like books like Wuthering Heights, or Anne Rice's Vampire Chronicles and require a quick fix of packet blood. Yeah, I know it's not as good as the live stuff. But hey, even vampires can't have home-cooked gourmet every night. And as far as takeaways go this stuff aint devoid of your daily dose o' vitamins. Just take care with the bony bits.3 stars."}, {"userName": "Debora M | Nasreen", "userReviewDate": "May 08, 2011", "userURL": "http://www.goodreads.com/user/show/4247371-debora-m-nasreen", "userReview": "“Il seme del male” è il primo libro che leggo di questa autrice perciò, sinceramente, non sono in grado di fare un confronto stilistico con altri suoi libri. Infatti, questo libro, ha una storia ben particolare che la stessa Harris ci narra nelle prime pagine raccontandoci di come questo suo ultimo lavoro sia, in realtà, il primo che scrisse venti anni fa.“Il seme del male” è un libro sui vampiri particolarmente versatile che sinceramente rende particolarmente difficoltosa un sua netta classificazione. È un libro fantasy per adulti, senza dubbio, ma possiamo vederlo anche come un romanzo noir o, meglio ancora, gotico. Per quanto mi riguarda ho letto solamente un’altra serie new gothic e, relativamente a questo romanzo, ho trovato alcuni puntoi di contatto fra lo stile fascinoso ma un po’ vago della Harris e quello di Libba Bray l’autrice della Triologia di Gemma Doyle. Come ho già detto non posso valutare lo stile attuale della scrittrice ma rimedierò, senza dubbio.Tornando al romanzo, come ho già detto quello che mi ha particolarmente colpito è la semplicità della trama. I colpi di scena sono minimi e in alcuni tratti perfino scontati. Diciamo che nessuno di noi impiegherà molto nell’individuare l’analogia fra Rosemary e Ginny e di come, alla fine, Alice sarà colei che dovrà tentare di sconfiggere questa creatura. Sì, creatura perché la parola vampiro non verrà mai scritta in tutto il romanzo lasciando il lettore a trarre le proprie conclusioni grazie all’abilità della Harris.Grazie al doppio punto di vista fornitoci durante tutta la durata del libro possiamo viaggiare e seguire questa creatura negli anni settanta e poi nel presente, con Ginny, Joe e Alice nel novecento. Possiamo conoscere, anche se in minima parte, il suo passato, vivere il suo presente ed immaginare il suo futuro.È una vampira nel senso stretto del termine che affascina e cattura gli uomini e li rende psicologicamente e fisicamente suoi schiavi con metodologia e indolenza. Anno dopo anno, vittima dopo vittima Rosemary, Mary o Ginny cattura l’interessa ed il cuore di un uomo che rende suo, fino alla morte.In alcuni punti si percepisce chiaramente che il romanzo è stato ritoccato successivamente, come se l’autrice ripresolo in mano, decidesse di dare alcune brevi ed incisive pennellate per raddrizzare qualche mancanza giovanile. Il tutto, purtroppo, rallenta un po’ la scorrevolezza del romanzo rendendolo un po’ artificioso e prolisso. Un vero peccato.Come ho già detto la trama di per sé non è niente di eclatante ma nonostante ciò godibile e intrigante che lascia, alla fine, un senso di torbido e inconcluso perché, come ogni volta \nqualcosa in Rosemary ricorda e non vuole dimenticare."}, {"userName": "Filipe Miguel", "userReviewDate": "Oct 26, 2012", "userURL": "http://www.goodreads.com/user/show/5855795-filipe-miguel", "userReview": "Publicado em 1989, Maligna, Evil Seed no original, foi o primeiro romance oficialmente lançado por Joanne Harris. À data com 25 anos, Harris apresentou um romance pseudo-gótico com cenário a condizer, passado em Cambridge, Inglaterra, cheio de oportunidade, mas ainda com poucos dos traços que actualmente se lhe atribuem.Cambridge, Cambridgeshire, United KingdomCambridge, local de passagem por excelência, devido à orla estudantil, com vida nocturna, cultura e arquitectura perfeitas, é o cenário ideal para Harris expôr o sobrenatural e todo o gore da sua imaginação.Podemos facilmente considerar que o livro tenha duas partes, se bem que o intervalo entre ambas não se apresente marcadamente definido. Algures entre o primeiro acto, da exploração, da ambientação, da ausência do substantivo que anseamos ler, e o segundo, da confirmação, da descoberta e do confronto, temos um período de transição onde, talvez, as ideias mais originais são apresentadas.Não querendo desvendar muito do universo que Joanne Harris criou, mas sim dar-lhe o devido crédito, há uma mão-cheia de conceitos esmiuçados que ganham uma nova dimensão através da sua caneta. Por exemplo, o conceito de gado e de oportunidade.Marca: Joanne HarrisAs grandes valências da obra acabam por ser a sua obscura primeira parte e o período que imediatamente lhe sucede, a apresentação de alguns (não muitos!) conceitos à luz da imaginação da autora e a escrita que, apesar de confusa de tempos a tempos, não deixa de ter a marca Joanne Harris.Por outro lado, nota-se alguma superficialidade de Harris nos seus temas fetiche, muito provavelmente porque à data ainda não eram fetiche. Os tópicos relativos aos problemas de identidade e magia quotidiana estão presentes, mas em momento algum a paixão pela comida, pelos cheiros, a superstição, a fé ou as relações familiares, traços incontornáveis de obras posteriores (Chocolate, Xeque-ao-Rei, Vinho Mágico, A Praia Roubada), emergem verdadeiramente.É uma obra moderadamente interessante, mais ainda se for encarada como o primeiro romance da autora, que apenas foi reeditada por insistência dos seus seguidores.\"A semente está em todo o lado, dormente, como uma árvore venenosa no pomar, as suas raízes esquartejando a terra e propagando-se como larvas no espíritos dos homens. A semente maligna pode estar dormente cem anos, antes de acordar, sacudindo a neve do Inverno do seu rosto (...). Os sacerdotes antigos sabiam como repelir a semente da noite; queimavam-na e enterravam-na em pedra e cal, mas ela continuava a viver em memórias, em contos, em canções.\"Nota: 3.0/5.0"}, {"userName": "Alexis Drake", "userReviewDate": "Dec 19, 2014", "userURL": "http://www.goodreads.com/user/show/33114788-alexis-drake", "userReview": "“Prego di essere salvato, ma sento solo l’ululato del pozzo sotto di me, le mie parole come latino morto sulla bocca inaridita, il crocefisso che si trasforma in sangue sulle labbra. Oggi Dio non è a casa. Lui si accompagna a Rosemary.”E’ possibile scrivere un libro sui vampiri senza nominarli esplicitamente neanche una volta?Sì, è possibile, e ci è riuscita piuttosto bene Joanne Harris, autrice famosa per Chocolat.Non è stata affatto una lettura malvagia, anche se verso la fine si è fatta un po’ fumosa e noiosa.La prima cosa che salta all’occhio è senz’altro la copertina, con questo volto femminile in stile preraffaellita.La seconda cosa sono i capitoli e come sono strutturati, è una cosa piuttosto singolare: si dividono semplicemente in Uno e Due. Nei capitoli Uno la storia è narrata in prima persona da Daniel Holmes, coinvolto nella torbida relazione tra una bellissima ragazza che sembra uscita da un quadro di Rossetti, Rosemary, salvata dall’annegamento, e Robert, il suo amico, e l’ambientazione è quella degli anni 40 del novecento.I capitoli Due invece sono narrati in terza persona e seguono un periodo della vita di Alice, coinvolta suo malgrado in fatti inquietanti dal suo ex Joe, e dalla nuova fiamma di lei, una ragazza con una chioma infuocata di nome Virginia, detta Ginny. Le storie proseguono parallele, salvo poi intrecciarsi nel capitolo finale.I capitoli migliori, secondo me, sono quelli con Alice. Sono scritti meglio, sono più scorrevoli e la storia attira maggiormente.La cosa che ho maggiormente apprezzato è stato il ritrovare una scrittura adulta e più matura dopo tutti gli young adult che ho letto in gennaio.Questo romanzo è scritto bene, è evocativo, finalmente ci sono dei vampiri cattivi, dei vampiri bellissimi che rovinano le vite delle persone, che le trascinano con loro in una spirale di amore e morte, di maledizione e vita eterna.Non è mai volgare, è sanguinolento ma mai disgustoso.Evoca bene le atmosfere di Cambridge, scelta come location sia perché frequentata dall’autrice, sia perché è una città universitaria, ottima per trovare vittime per i vampiri, grazie al ricambio di studenti e turisti.Se dobbiamo inquadrarlo come genere, direi che è un thriller con atmosfere gotico- romantico- preraffellita."}, {"userName": "Artemisia", "userReviewDate": "Jan 22, 2012", "userURL": "http://www.goodreads.com/user/show/4248796-artemisia", "userReview": "Di base, io ho un grosso problema con la Harris: quando si tratta di giudicare i suoi libri divento penosamente parziale e tendo ad essere fin troppo comprensiva con difetti che ad altri scrittori non perdonerei mai e poi mai. Quindi, avvisàti.The Evil Seed è il primo romanzo scritto (1989) e, al momento, l'ultimo pubblicato: si sviluppa su due periodi temporali, ma i luoghi sono gli stessi, gli stessi i protagonisti, identici i ruoli ricoperti duranti gli anni. La figura attorno a cui ruota tutto il romanzo è assolutamente una sola e il dare importanza a questo o a quell'altro personaggio è solo un modo della Harris di trarci in inganno; Rosemary, il rosmarino, per ricordare e non dimenticare. Rosemary è un'entità assoluta di male, che ci parla di un male relativo, fatto di scelte, di decisioni, di desiderio, Rosemary è una divinità innocente (vestita di bianco, l'archetipo preraffaelita, i capelli lunghi, l'apparizione sotto il biancospino) che ha nelle sue mani le volontà di tutti i suoi uomini e dalla volontà stessa è composta ogni fibra del suo essere. Volontà e desiderio: qualcosa in me ricorda e non vuol dimenticare. E in lei rivive la citazione shakesperiana della rimembranza in Amleto.Ma le pecche ci sono, purtroppo: il libro nella seconda parte tende a scadere, il finale viene risolto abbastanza frettolosamente, ci sono passaggi verbali che mi convincono poco e scelte lessicali a volte ripetivive - ma questo potrebbe essere un problema della traduzione. In conclusione: un'idea splendida, un libro abbastanza maturo nonostante sia stato il suo esordio: si trovano tutti gli elementi che verranno poi sviluppati successivamente dalla Harris quali alcune ambientazioni cimiteriali (Grantchester, Highgate, Montmartre), le fiere di paese, i luna park, gli zingari, il destino come una ruota che gira ed il libro intero è una base per il testo che uscirà poi nel 1993 tradotto in Italia con il titolo Il fante di cuore e la dama di picche, uno studio sicuramente molto appassionato dell'arte preraffaelita, e un dialogo, ancora una volta, con il male, con i finali non lieti, con sentieri oscuri impercorribili a cui la Harris accenna, ma di cui mai non parla."}, {"userName": "Elke", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/1105232-elke", "userReview": "I am so glad I finally finished this book after it dragged on endlessly, making me skip across the pages and for the first time testing my learned fast reading skills on a work of fiction...While I may have loved the gothic aura and slow creeping suspense of the story several years ago, today I just found it mostly boring. Sure, the author knows how to weave a tale, with captivating, though not necessarily likable, characters and a clever plot. However, the voice of the book did not call out to me as it would have in earlier times. Maybe I'm just feeling anxious about wasting my time with unnecessary decorum, maybe it was just the wrong time to pick up this title, but what choice did I have!? The book was picked through the discovery bookshelf challenge ;) At least I managed to free some space on my bookshelf for which I'm grateful. Also, I don't have to guess any longer about the wonders awaiting between the beautiful covers of this book - curiosity sated, review posted, and now to move on to another challenge."}, {"userName": "Joana Marta", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/12525315-joana-marta", "userReview": "[I found Joe a stupid guy btw, asking poor Alice to give a bed to Ginny for a while (honestly, if it was me I would tell him just to disappear, this part I thought it was a bit unrealistic, just a girl that likes to be hurt would accept something like this..) (hide spoiler)]"}, {"userName": "Юля Білоус", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/18509377", "userReview": "досить непогана книжка, хоча залишилося враження, що авторка її не допрацювала, що це якби чорновий варіант книжки... що написала не все, що хотіла. Особисто мені хотілося більш прописаних головних героїв, особливо Розмарі-Джинні, її внутрішнього світу, так би сказати і взагалі більшої деталізації подій. Книжку почала читати дуже давно і думала, що вже не дочитаю, але от тільки пару днів тому випадково до неї повернулася і все - два дні дочитувала, не могла відірватися. Сюжетні лінії не всі доведені до кінця, але, десь так з майже-половини книжка все одно затягує і її хочеться дочитати. Попри все, з кожною прочитаною книжкою авторства Гарріс дивуюся, якою різною вона може бути, адже де Шоколад з домашньою магією, коханням, затишком і смаколиками, а де Небесная подруга з не то вампірами, не то зомбі, не то просто з безсмертини каннібалами..."}, {"userName": "Elisabete", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/12461314-elisabete", "userReview": "This is the only Joanne Harris book I've read (so far). I picked it up at the discount pile and now I know why it was there. Still at that moment I was intrigued by a book about vampires from a writer that's since chosen a completly different route. With a female villain that seemed like an actual villain instead of another soapy story, this book looked like it had that going for it. But in the end, what a letdown! Clumsy story, changing from one narrator to the other (yes there's two of them), it comes to a point that you really have to be very focused on the story to know who's who. This wouldn't be a problem if the story was compelling enough to allow that focus. A struggle to finish with a unsatisfying ending."}, {"userName": "dr deborah zeraschi", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/61334160-dr-deborah-zeraschi", "userReview": "Dark and gothicHaving read many of Joanne Harris' novels I expected the poetic descriptive force of the narrative but was surprised by its darkness. A wonderful Gothic novel. The inter twining narratives are strong and distinctive.Although slightly verbose at times I believe that this a characteristic of the genre."}, {"userName": "Daniela D", "userReviewDate": "Jul 28, 2013", "userURL": "http://www.goodreads.com/user/show/20859326-daniela-d", "userReview": "It was like... meh. It took a long time to get to the point and when I say long time I mean like, 200 pages. The fourth part of the book I actually liked, there was a lot going on, lots of action. But the rest of it was a waste of a tree."}, {"userName": "Ink", "userReviewDate": "Sep 24, 2016", "userURL": "http://www.goodreads.com/user/show/31074733-ink", "userReview": "In un certo senso ha la sua morale: se un vostro ex si fa risentire, mandatelo a quel paese ed avrete salva la vita"}, {"userName": "Justine Knight", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/20572802-justine-knight", "userReview": "Have thoroughly read Harris's other later works so was looking forward to her debut novel, and although it is a different style I enjoyed it and good see raw talent there that has blossomed."}, {"userName": "Stefani", "userReviewDate": "Sep 25, 2015", "userURL": "http://www.goodreads.com/user/show/9593877-stefani", "userReview": "her writing is nice but I can't do vampires...nope cant do"}, {"userName": "Beatrice", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/29819886-beatrice", "userReview": "Un libro che funziona poco più che a metà.Il seme del male è il primo romanzo della Harris (sebbene sia stato pubblicato in seguito), e per questo motivo all'apparenza sembrerebbe quello un po' più immaturo, ma l'idea è originale e il suo stile è riconoscibile ed è facile farsi trasportare dalle sue parole incantatrici. La vicenda parte intrigante, così come è interessante la struttura del romanzo stesso. Due punti di vista, paralleli ma dal percorso molto simile, si alternano: all'uno corrisponde Daniel Holmes, un uomo curioso ed ossessionato da una donna bella e irraggiungibile, dai capelli rosso fuoco e un alone di mistero che la circonda come una nube. Al due c'è, invece, Alice, la quale si trova improvvisamente coinvolta in eventi assurdi e quasi oscuri.Le premesse sono buone, e la storia prosegue scorrevole almeno fino a poco dopo la metà, quando la vicenda comincia a farsi più confusa, i fatti si susseguono ma resta una sensazione di insoluto, come se ci fosse della nebbia ad offuscare la visuale.Punto di forza della Harris è la sua capacità nel creare atmosfere sempre suggestive e quasi magiche, a prescindere dalla storia che vuole raccontare. In questo caso è riuscita a sostenere un'idea di partenza molto solida e nel complesso buona, raccontando di vampiri senza averli mai nemmeno nominati per quello che sono. A fine lettura non c'è nessun lieto fine; quello che resta è l'amara consapevolezza dell'ineluttabilità del male, male che impregna ogni cosa ed è difficile da estirpare."}, {"userName": "Deepika", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/35027475-deepika", "userReview": "I got this book from a buy-books-by-weight fair and I have never been disappointed earlier..This is light read. Though it involves vampires, the story is well written and wants you to keep reading. The book is divided into two eras, actually three, but the earliest is just referenced. The chapters are divided into 'One' and 'Two', each talking about the past followed by the current, which I found troubling at the beginning but eventually got used to. I found the end confusing, but then again that was the only disappointing part.So, if you want to read a light book , then you can read this one for how it has been written and the suspense. But then again, this is the first book by the author, so full points for that!"}, {"userName": "Ceecee", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/60964126-ceecee", "userReview": "Joanne Harris is one of my favourite authors and her books never fail to delight and intrigue me. This one I think is her first novel but it doesn't show in my opinion! She is a natural writer - one of those gifted people who can spin magic with words and effortlessly depict people and place. The setting for this novel is Cambridge which sprang to life and reminded me what a truly beautiful city it is. This book contains two intersecting stories - one set in the late forties and one set today. The central characters are Rosemary/Ginny with their strange companions Elaine, Rafe, Java and Zach and their victims in one way or another Danny, Joe, Alice and Inspector Turner. It's an intriguing supernatural story of vampire like creatures - ' We're the masters Danny ... The chosen ones. The lords of Creation. The predators'. They feed on people literally and metaphorically, taking their loves and lives making some into their victims and turning others into monsters like Danny. As others have commented the ending is strange and oddly unsatisfactory! Daniel, Alice and Inspector Turner tried to destroy them and it seems they did so is it memory that recalls them? One assumes so. Overall, despite the ending I did enjoy it as it is so well written and different."}], "description": "Something inside me remembers…It’s never easy to face the fact that a man you once loved passionately has found the girl of his dreams, as Alice discovers when Joe introduces her to his new girlfriend Ginny. Jealous, Alice is repelled by Ginny – an ethereal beauty with a sinister group of friends.Then Alice finds an old diary hidden away in Ginny’s room and reads about Daniel Holmes and his friend Robert and the mysterious woman who bewitched them both – Rosemary Virginia Ashley, buried in Grantchester churchyard half a century ago – buried but far from forgotten.As the stories intertwine, past and present are merged into one; Alice comes to realize that her instinctive hatred of Joe’s new girlfriend may not just be due to jealousy as she’s plunged into a nightmare world of obsession, revenge, seduction – and blood.", "title": "The Evil Seed", "url": "http://www.goodreads.com/book/show/450203.The_Evil_Seed", "average": 2.96, "cover": "https://images.gr-assets.com/books/1375876947l/450203.jpg", "reviews": 167, "authors": [{"url": "https://www.goodreads.com/author/show/9432.Joanne_Harris", "name": "Joanne Harris"}], "type": ["Horror", "Fiction", "Fantasy", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/450203.The_Evil_Seed", "http://www.goodreads.com/book/show/17426034-the-evil-seed", "http://www.goodreads.com/book/show/3676765-the-evil-seed", "http://www.goodreads.com/book/show/9717532-il-seme-del-male", "http://www.goodreads.com/book/show/11383768-the-evil-seed", "http://www.goodreads.com/book/show/12784766-maligna", "http://www.goodreads.com/book/show/24441315", "http://www.goodreads.com/book/show/9702961-il-seme-del-male", "http://www.goodreads.com/book/show/28667345-il-seme-del-male", "http://www.goodreads.com/book/show/47401.Chocolat", "http://www.goodreads.com/book/show/15096.Five_Quarters_of_the_Orange", "http://www.goodreads.com/book/show/15101.Blackberry_Wine", "http://www.goodreads.com/book/show/15102.Gentlemen_and_Players", "http://www.goodreads.com/book/show/2227371.The_Girl_with_No_Shadow", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}