{"ratings": 29053, "userreviews": [{"userName": "Jamal", "userReviewDate": "Jul 16, 2008", "userURL": "http://www.goodreads.com/user/show/875145-jamal", "userReview": "Three weeks ago I held a yard sale. To pass the time I picked up this book I'd never seen from a box of books none of which I'd ever read and none of which I remember buying.Of the many surreal happenings of that day one of the most strange was when, immediately after reading the first page, a well-groomed homeless man or a poorly groomed homed man rode past on a bike. He looked over and upon seeing The Eight lurched off his bike stumbled to my gate and, grasping it with all the force and desperation of a kindergartener being left by mommy, bellowed, \"That book! Man! That book, man, is the biggest fucking mind trip it's the best book you'll ever read. That woman [the author] used to be an executive at Bank of America until those Southern fuckers came in and they fired EVERY woman in the company. God damn mother fuckers! But man, she's beautiful too man, like a triple threat. And let tell you something...\" and here he became quiet and conspiratorial, \"....it'll never NEVER be made into a movie. I won't tell you why. 2/3 into the book BAM! [he yelled] it's a fucking bomb on your brain! She just fucking drops that bomb on your brain and it'll NEVER be a fucking movie!\"How could I do anything but read this book after such an endorsement?It's pretty typical of the genre. A collection of mostly tropes -- the mysterious and reclusive genius somehow at the heart of the mystery; the one no-one including his co-commiserators can trust has a hidden agenda that has to do directly with the heroine? No way! After he takes a personal interest in her, we find out he's tall, handsome, devilishly charismatic, seductive and, wait, can't be completely trusted? Didn't see that one coming! -- including the drunken socialite, the clueless petty bourgeoisie, the quirky but lovable math/ computer whiz, the evil and menacing foreign intelligence agent, the surprisingly Western and enlightened foreign man incredibly open, and the revelation that the Other is actually more welcoming than We...to name a few. Anyway, this collection are interwoven into a story that touches on Charlemagne, OPEC, Chess, the French Revolution and the rise of Napoleon among other things and which is mostly entertaining if much too long.The double narrative serves an obvious purpose but makes the book cumbersome and unnecessarily obtuse. When one story line enthralls, Neville switches to the other forcing the reader to reinvest; a tiring exercise. It's an unfortunate thing really, because both narratives on their own are interesting and could have been fun, if forgettable adventure books on their own. Should have been. Very much should have been.2/3 of the way through, the heroines of both narratives go to Algeria and meet tall, dark, handsome and capable men who save them from vile agents of the bad guys. There's also an Erich Von Daniken moment which is probably what the lurcher was talking about. It was a mind bomb about as much as the turn in the new Indiana Jones movie.I am ambivalent about this book. I'd be more enthusiastic if it had been about one story or even one more so than the other."}, {"userName": "James", "userReviewDate": "Jan 02, 2016", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "4 stars to Katherine Neville's The Eight. I stumbled upon this one by hearing about book #2's release and had to start first from the beginning. I'm so glad I did.Characters are well developed. Plot is intricate. Suspense is on target. Story-telling and narration are rich. I want a third book in the series!It's all about a chess match. In theory. But in reality. Russian history. Clever moves and alliances. Family connections. Politics. Strong motivation. Good, thought provoking suspense."}, {"userName": "Maria Clara", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/46308842-maria-clara", "userReview": "Sinceramente, me ha encantado!"}, {"userName": "Robert Beveridge", "userReviewDate": "Jan 23, 2008", "userURL": "http://www.goodreads.com/user/show/766524-robert-beveridge", "userReview": "Katherine Neville, The Eight (Ballantine, 1988)This novel has achieved almost cult status in some circles, and many people consider it one of the best adventure novels ever written. It's a useful way to separate folks you know into two categories: those who are more interested in plot, and those who are more interested in writing.The plot is pretty darn good, when it comes right down to it. The novel takes place in two parallel times, the first being 1972 and the second the years during and after the French Revolution. Both plot lines center around the search for a mystical chess set and attempts to discover the human counterparts to various pieces (the hero and villain in each time line are the Black and White Queens, respectively; very nice little twist, that). The board, once complete, will supposedly impart unlimited power to he who possesses it, and thus leaders from Marat and Catherine the Great to Muammar Khaddafi run throughout the book, looking to get their hands on it. The pace is quick, the action almost nonstop (the present-day time line is quicker-paced and much more compelling, but the past ain't all that bad).The writing, on the other hand, is almost painful in places. Neville descends in to the realm of cliché at least once per chapter, at times more than once per page. Clumsy attempts at foreshadowing (you know the type: \"but I never thought, when I woke up in the morning, that this day would change my life forever!\") are more commonplace here than in a whole shelf of novels by Bulwer-Lytton. It's possible that Ms. Neville took the nineteenth-century definition of \"romance novel\" a tad too seriously for being a twentieth-century writer. And this is certainly an unique experience in that regard; a classic nineteenth-century romance novel written, all too often, like a Harlequin circa 1985.All in all, it is a fun little book requiring great suspension of disbelief. I'd have given it another star if part of my suspension of disbelief didn't have to be in the author's writing ability."}, {"userName": "Deborah Harkness", "userReviewDate": "Aug 17, 2010", "userURL": "http://www.goodreads.com/user/show/4070528-deborah-harkness", "userReview": "This book was the first of its kind: a historical thriller/whodunnit/magical story that was published in 1988. In a way, all the similar books that have come after (Dan Brown, Kostova's The Historian) are following in Neville's footsteps. If you read it now, it may seem flat in comparison with these later works, which have taken a genre that in many ways Neville created and taken it to new levels. However, I'm giving it this rating because I still remember back more than two decades to my first encounter with the book and the sleepless nights that followed as I rushed to finish it!"}, {"userName": "Diana", "userReviewDate": "Dec 31, 2008", "userURL": "http://www.goodreads.com/user/show/1381305-diana", "userReview": "I was told by several people whose books tastes I generally respect that I would love this book - sadly, that wasn't the case. I found it tiresome, hard to follow, and the writing was almost impossible to slog through in several places. The characters were never fully developed, I never got invested in any of the characters, and I found the book too plot-driven to an irritating degree - with too many historical elements \"dropped in\" (almost like name dropping) in order to tie the events to historical situations.The only part of the book that I found remotely interesting and attention-holding was the very first chapter. It's a book that has reached something like cult status, but I found the plot hard to follow, lots of twists and turns that only confused me, and a very unsatisfying ending. I finished it only because I hate to leave a book unfinished if I've committed to reading it.It just doesn't live up to its hype for me."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Mar 19, 2014", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "FLASH! Definition of the word \"thriller\" changes. Now the word \"thriller\" can be deemed to include slow moving, overly convoluted stories that wander from point to point with little actual plot covered!Yes we have another story here in the vein of The Da Vinci Code. (I have been informed that this book was written in '88. I had originally said it was \"apparently inspired by said Da Vinci Code\". My error. That said, it doesn't make the book any better.) Taking place in both the past and the future with \"countless\" number based clues, cues and proofs. That's right the number.....8! FIGURES HEAVILY in the story, duh,duh,duh.Beginning back in the time of Charlemagne (or....does it go further back?) our story revolves around an ornate chess set that is imbued (or possibly endowed) with some great and (possibly) evil power.So...a cunning abbess In order to break up the threat sends off some nuns each of them carrying a single piece of the chess set, well except she also sends two novices off who haven't taken their vows yet. They go to the big city and become nude models... an interesting career choice, you know for would-be nuns.Anyway we are also tracking things in the \"present\" as \"powers\" seek to find said chess set.So with all this, plots, counter plots, conspiracies going on, how can this be one of the most boring, slow moving, stultifying books I've picked up in weeks? I don't know. But it manages.Can't recommend this one."}, {"userName": "LauraKaarina", "userReviewDate": "Jun 07, 2008", "userURL": "http://www.goodreads.com/user/show/1204806-laurakaarina", "userReview": "The two more recent books that most closely resemble The Eight are The Da Vinci Code and Kate Mosse's The Labyrinth, but I found The Eight a more enjoyable read than either of them. The novel is utterly audacious in its (ab)use of historical characters, completely, joyfully implausible in its plotting, and I'm not certain whether the language of Romantic page-turners the author makes frequent use of (\"dear reader, little did I know that in two hours' time I would be running for my life trying to escape a KGB killer\") is ironic or not. However, I found the book hugely enjoyable as it is - I don't know anything about chess, the basic conceit of the book, but any novel in which Jean-Jacques Rousseau figures as one of the bad guys, J.S. Bach as one of the good guys, and female solidarity is an important theme has a good chance of winning my heart."}, {"userName": "Vladimir", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/13926017-vladimir", "userReview": "Iskreno, ne znam koju bih ocenu dao sad da je pročitam al te godine, kada mi je dopala šaka, knjiga me je toliko raspametila tako da sam joj se vraćao još dva puta. Pa stoga pet zvezdica.Za Ketrin Nevil možemo slobodno reći da je preteča Den Brauna, a njena priča o tajanstvenoj šahovskoj garnituri Karla Velikog zaista je bila \"iskustvo\" kojeg se još uvek sećam."}, {"userName": "LJ", "userReviewDate": "Dec 19, 2007", "userURL": "http://www.goodreads.com/user/show/250195-lj", "userReview": "The Eight - ExKathleen NevilleThe Montglane Service, an ornate, jeweled chess set given to Charlemagne by the Moors, is said to hold a code which when deciphered will bring great power. Nations and individuals have schemed to possess all the pieces. As the set is dispersed during the French Revolution, a young novice risks her life to safeguard it. Alternating with her story are the present-day efforts of a U.S. computer expert and a Russian chess master to assemble the set and solve its mystery. Studying the code involves musical notation, chess strategy, Fibonacci numbers, and mysticism. I loved this book and have re-read it a couple times. Fans seem to gravitate either to the story in the past or the contemporary story. I'm on the contemporary side. I loved the character Cat and Cat's romance, albeit a small part of the story, with the Russian, and her friend Lily with the Rolls, and the poodle. Overall, it was a captivating adventure and a great read."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "FLASH! Definition of the word \"thriller\" changes. Now the word \"thriller\" can be deemed to include slow moving, overly convoluted stories that wander from point to point with little actual plot covered!Yes we have another story here in the vein of The Da Vinci Code. (I have been informed that this book was written in '88. I had originally said it was \"apparently inspired by said Da Vinci Code\". My error. That said, it doesn't make the book any better.) Taking place in both the past and the future with \"countless\" number based clues, cues and proofs. That's right the number.....8! FIGURES HEAVILY in the story, duh,duh,duh.Beginning back in the time of Charlemagne (or....does it go further back?) our story revolves around an ornate chess set that is imbued (or possibly endowed) with some great and (possibly) evil power.So...a cunning abbess sends off some nuns each of them carrying a single piece of the chess set (well she sends two novices off who haven't taken their vows yet and they go to the big city and become nude models... an interesting career choice, you know for would-be nuns).We are also tracking things in the \"present\" as \"powers\" seek to find said chess set.So with all this, plots, counter plots, conspiracies going on, how can this be one of the most boring, slow moving, stultifying books I've picked up in weeks? I don't know. But it manages.Can't recommend this one."}, {"userName": "Keith", "userReviewDate": "Jun 02, 2007", "userURL": "http://www.goodreads.com/user/show/47197-keith", "userReview": "\"The Eight\" reads like a student attempting to wow her professor by using as many similies as she can (irony intended). I think Neville chose the name \"The Eight,\" because there are roughly eight sentences per chapter that don't contain a forced, awkward similie.At least that was true for the first 90% of the novel, which was almost Dickensien in its detail. For the last 10%, it is writen more like a short story, with months of time being skiped and important, climactic scenes being rushed into one or two pages. Neither pacing was appropriate, and the juxstaposition of the two was jarring.Too many characters and clumsy, pointless chess metaphors riddled the narrative. It took me months to finish this book. I'm really not sure why I kept reading it. I suppose the much-hyped secret that would be revealed at the end kept me going; an ending that ultimately failed to satisfy, as it has been done before."}, {"userName": "Ray", "userReviewDate": "Jan 13, 2009", "userURL": "http://www.goodreads.com/user/show/760700-ray", "userReview": "Sometimes you read a book and find yourself wishing it'll never end. If you want that, this is a book for you. I thought it'd never end, and I don't mean that in a good way. The book has been compared to the DaVinci Code, but I think that's an unfortunate comparison. The story alternates between the 1970's and the late 1700's, both periods linked by the individuals quest for lost ancient knowledge. To me, the action and dangers are contrived, as is the object of the search. If you can get caught up in pure fantasy, and not get too concerned about logic or believability, you may enjoy this book, but if you want something more believable, as I do, it's hard to stay engaged in this long book."}, {"userName": "Marijan", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/6928596-marijan", "userReview": "Malo me smeta besmisleni misticizam ali mi se autoričin stil pisanja jako sviđa. zato slabija četvorka."}, {"userName": "Andy", "userReviewDate": "Apr 20, 2009", "userURL": "http://www.goodreads.com/user/show/149340-andy", "userReview": "The absolute worst. Intolerable. The kind of endless, deluded, humorless, self-satisfied, tone-deaf, utterly witless manuscript that I'm sure publishers find in the mail all the time but must NEVER EVER PUBLISH. Picked it up hoping for approximately the literary equivalent of \"National Treasure,\" instead got the literary equivalent of diarrhea. That this is beloved by anyone anywhere, and that it ever elicited the press quotes inside the front cover, absolutely boggles my mind. There is NO dimension of this that meets any standard of entertainment; not even as \"just a big stupid mess but who cares\" is this acceptable. It is far worse and more painful than that.Solely recommended for those who do not plan to pay much attention to the story, or the characters, or god help you the words on the page - and just choose their reading based on a checklist of genre elements. Apparently there are many such people. Ugh. Even they should just get off on the back cover and move on.That all said - yes, I did read this to completion. Because I am insane. Do not do this. You might think you are suffering through the prose for the story, but you are not. You are suffering through both the prose and the story, and plenty more besides. Most of all you are suffering the author herself, whose literary company I have grown to loathe and resent. May this bilious review rid me of her forever. Amen."}, {"userName": "Zoran", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/28184855-zoran", "userReview": "Da nije nekih malih preterivanja u \"sadašnjosti\", bila bi čista petica. Odlična knjiga. Nisam imao vremena za čitanje, ali sam zato dve trećine knjige progutao za dan (i jednu noć do 4.30). Jednostavno, jedna od onih knjiga koje vam ne dozvoljavaju da ih ispustite iz ruku."}, {"userName": "Jeannette Nikolova", "userReviewDate": "Aug 21, 2015", "userURL": "http://www.goodreads.com/user/show/2574284-jeannette-nikolova", "userReview": "Read on the WondrousBooks blog.\nLong story short: I got this book from NetGalley and I was unbelievably excited about it. In the end, it took me entirely too many weeks to finish it and now I have to send it to the \"mediocre at best\" shelf.Now let me elaborate.The story of The Eight seemed very compelling: a mysterious chess set, a game that has been going on for ages, two female characters going on the same quest, set apart by 200 years of chasing, a giant battle of good and evil including history's biggest names.However, what we had was:The Writing\nSilly and childish. The characters have the tendency of becoming pale, very pale, deadly pale etc. in every five sentences. There's a lot of name-throwing, even though all of the big names have little actual impact on the story. What I hated the most about the book was the cheap drama technique, stolen right from Indian/Mexican soap operas. Every chapter ends with something so dramatic it's utterly laughable. It sort of looks like this:\nThree bunnies who were friends were taking a stroll in the forest. One of the bunnies decided to pick flowers. The other two were discussing the nice weather. A birdie was soaring the sky. A bee saw the bunnies from afar and decided to join them on the walk, only it was flying, naturally. Suddenly a dark cloud appeared. The three bunnies got worried because they didn't have an umbrella. While they were thinking about what to do and how to escape the possible storm, one of the bunnies turned and told the other two: \"I'm actually your father.\" The bee, shocked, replied: \"It's not possible because I'm actually their fraternal aunt.\"\n\n\nFive days later the three bunnies were taking another stroll. The weather was a bit chilly.\nIn the book there was no regard, whatsoever, about the time-frame. The events were happening in the course of so many years, but the narrative continued as if nothing has important or of any value has happened in the missing time. I specifically mean Mireille's story. Can anyone really explain to me how these characters were so mobile in an age when the steam boat was barely a thing? Because the characters were crossing seas and oceans, traveling from America to Russia like it was the 21st century. Nine months pregnant Mireille was traveling between Algeria and France, crossing seas and deserts, climbing steep mountains like it was a walk down the street. Even in the \"present\", which was actually 1973, the characters were almost teleporting from one destination to another.This, of course, brings us toThe Characters\nWho were so unbelievable that even the author started joking with them at some point, in my opinion. I mean, come on... Really, 18th century underage French nun-to-be-but-not-really who speaks fluent English, learns Arabic, Russian and God knows what else, travels half the globe and manages to give birth to two children before turning 30? A man who supposedly rules France behind the curtains, who is a described as terrifying and evil, and then all of a sudden turns out to be a spineless plaything in the hands of Mireille and is on team Good. Or how about Cat, the first female to become a computer expert, and that, before turning 25, not to mention that alongside her unbelievable expertise, she is also fluent in a couple of languages and knows everything, from music, to computers, to physics, to mythology.And of course, all of these characters also happen to be chosen to play the game, but how and through what criteria and how did they even get noticed? Figure that out for yourselves. And if there is something that can be considered a plausible explanation about some of the chess prodigies, there certainly isn't one about Cat, who seems to come from nowhere. I don't even thing there was much in the way of a back-story about her.Insta-love\nI didn't expect it and it made me even more annoyed with the book. I'm not going to elaborate, because it's too spoiler-y, but there's insta-love, folks. And a very lame one at that.What I did like about the story, though, wasThe Plot\nIn the hands of a better writer, this book could have been amazing. The idea about the chess set is very original. The other thing which I really liked was the information of many topics, which flowed through the narrative. The mix of fictional and real personages and histories was deeply appreciated, especially in comparison to everything else in the book. If the famous people which are randomly mentioned just to shock the reader, had any actual role in the book, it might have been much more interesting. But as a whole, I can't ignore the fact that from informational point of view, I learned some things and I enjoyed it.The Weird Part\nAt the end of the book, there was a detailed biography of the writer. I guess that could be considered somewhat normal, even though I don't think I've seen it done for anyone but proven authors and ones who have died a long time ago at that.But putting a gallery of headshots of the author in the book... Well, that's plain strange. Not to be rude, but what do old modeling pictures of a book's author have to do with the book itself? If I'm interested, I can Google the author. I don't really see a need for that self-promotion to be shoved down the reader's throat. Huh?"}, {"userName": "Ben", "userReviewDate": "Jul 06, 2008", "userURL": "http://www.goodreads.com/user/show/89099-ben", "userReview": "I read this book for the first time in 1992 when I was fourteen. I just finished rereading it. I dug up my copy when I moved to NYC 2 years ago and had been curious to pick it up again since then - partly because I had vague recollections of a couple of hot sex scenes, but largely because over a decade after I originally read it, there was a complete cultural explosion centering around another book featuring ancient secrets playing out amid high-paced modern day intrigue, namely The Da Vinci Code. Since I myself basically hated The Da Vinci Code and resented all the attention it got, I found myself wondering if The Eight hadn't deserved some of that attention.Well, it did. The books are actually quite similar in a number of important ways. Not only are they both about modern-day murder mysteries leading to quests for ancient relics of great power, but they both involve a good deal of decoding of multi-layered messages and creating of mythic narratives connecting different eras by playing a little fast and loose with history. This review is really a side-by-side comparison of the two books.The Eight is a high-paced mystery/adventure, but it is not quite as effective a page-turner as The Da Vinci Code since it lacks the latter's dastardly manner of ending every chapter on a cliff-hanger and then switching to a different story line, leaving you (me) with no choice but to read on and be introduced to a new cliff-hanger before getting satisfaction in the old one. I consider this a virtue of The Eight by comparison, since at the end of The Da Vinci Code I basically just felt like my curiosity had been taken advantage of. However, it's also a function of the fact that The Eight regularly goes into a bit too much detail. This is the one meritocratic reason I can think of why The Eight never got the attention of its successor.Other than that, every weakness of The Eight - hackneyed exposition, a romantic subplot not really justified by the main story, a tendency to overhype its revelations, an inevitably unsatisfying denouement after all the intricate build-up, and a lingering impression that the author is engaging in a bit of wish-fulfillment - is an equal if not deeper weakness in The Da Vinci Code. Meanwhile, The Eight has a good deal to recommend it:First of all, it's quite intellectually ambitious, much more so than TDVC. In fact it's a veritable nerdfest. The action takes place both in the late 18th century and the 1970s, in locations ranging from the USA to France, England, Algeria, and Russia. The narrative manages to tie together not only a number of players in the French Revolution - Talleyrand, Robespierre, Marat, and a young Napoleon - but a vast number of other 18th century notables, political and intellectual: Catherine the Great, Benjamin Franklin, the mathematicians Euler and Fourier, the poets Wordsworth and Blake, the philosophers Voltaire and Rousseau, and the chess player Andre Philidor, among others. The history of which the narrative makes referential use has a much wider scope still. But it doesn't stop with history: math, science, and music are involved as well. Meanwhile somehow everything gets connected to the game of chess, metaphorically or literally. (Actually, from a literary point of view, much of this, especially the math and the science, is actually kind of troublesome - c.f. \"hackneyed exposition\", above - but you gotta give author Katherine Neville credit for what she's trying to create.)Secondly, The Eight's 2 female leads (one in the 18th century and one in the 70s) both completely drive the plot, exercizing substantial smarts, resourcefulness and determination in addition to considerable hotness. This is 2008 and this shouldn't really be anything to get excited about. However, since in The Da Vinci Code, which purports to be a sort of feminist book since it's supposedly all about uncovering the Church's repression of the divine feminine, there is only one important female character (Sophie Neveau) and she, although ostensibly a cryptographer, doesn't do or figure out almost anything important in the course of the plot, I found myself reading The Eight with a feeling that it was sort of an antidote to TDVC's fake feminism.Overall, I don't think I can really claim The Eight is a \"good book\". I certainly didn't find it satisfying. (And see the list of its sins shared with TDVC in paragraph 4 above.) But now that The Da Vinci Code has legitimated the genre of hamhanded ancient-secret codebreaker thrillers, I find myself wanting to fight for The Eight's place at this table."}, {"userName": "Sheila", "userReviewDate": "Sep 22, 2016", "userURL": "http://www.goodreads.com/user/show/6810645-sheila", "userReview": "4 stars--I really liked it.There are some warnings I feel I should give about this book before recommending it to people:1. It's about a magic chess set. Yes, literally. 2. The writing is solid, but not great. (There are some dated elements of racism and fat shaming, but these are mild.)3. The historical facts are shaky.Despite all these things, though, I really liked this book. It was a nonstop adventure, with lots of action--the perfect summer read. There is both a modern and a historical narrative, and both are riveting (though historical accuracy takes second place to the story. This didn't bother me since I was invested in the story).There's lots of mysticism, political maneuvering, and international intrigue in this book. Two sections in particular--describing \"the Terror\" in France, and a car chase through the desert--were really harrowing, and I devoured these sections. If you like historical mysteries and adventure novels, this one was fun. It's a long book, but it never felt long to me. Nothing deep or world changing--just fun. This book is often compared to Dan Brown, which I think is fair--though this book was written in 1988 and features female leads.I received this review copy from the publisher on NetGalley. Thanks for the opportunity to read and review; I appreciate it!"}, {"userName": "Beatriz", "userReviewDate": "Sep 03, 2015", "userURL": "http://www.goodreads.com/user/show/46560610-beatriz", "userReview": "Esta novela se merece sus 5 estrellas por tres razones: En primer lugar es un libro completamente adictivo, no se puede dejar de leer, en mi caso esperaba con ansia tener un momento para continuar la lectura; la intriga, el misterio y los acontecimientos están tan bien hilvanados que atrapan desde el primer momento. En segundo lugar este libro tiene un mérito que no es tan común como uno desearía, y es que deja mucho más que el sabor de una buena lectura, también alimenta nuestra cultura. La autora logra mezclar magistralmente importantísimos pasajes de nuestra historia universal con los acontecimientos que envuelven a los personajes de la novela. Debo reconocer que en varias ocasiones detuve la lectura para verificar ciertos hechos y así entender mejor el desarrollo del libro. Por último y en tercer lugar, algo que siempre se agradece... un buen desenlace. A veces avanzaba la lectura con un poco de cautela, temiendo que tanta expectativa respecto del misterio principal terminara en algo con sabor a nada. Afortunadamente no fue así, y el final está a la altura de todo el resto de la historia; claro, eso sí, al final, final... así que no desesperen."}, {"userName": "Vir", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/19380470-vir", "userReview": "Old book too. Please don't mind me. Keep reading your things."}, {"userName": "Simone Sinna", "userReviewDate": "Apr 09, 2012", "userURL": "http://www.goodreads.com/user/show/7166641-simone-sinna", "userReview": "Along with Shantaram, reviewed previously, this is a book that spoke to me. Grabbed me and wound its magic around me, seeping into my soul. I have probably read it at least ten times and several sections more than that.Is it literary genius? No. Is it well written and engrossing? Yes. Fast paced, can’t be put down? Yes. Is it perfect? No. The concept is so good though it had me wanting to rewrite and re-imagine parts of it, trying to think of ways of making the chess game metaphor stronger.In brief – and it’s a longish book – the story is in two halves, woven together throughout. There is a current time section where the protagonist is a sassy 23 year old female computer whizz who from the first page I just totally became, entering into her world as though it was mine (I should add I am technologically challenged in real life). Reading about the author she has clearly borrowed a lot from her own life for this character. Including some of the less likely things the character does (like working in Algiers) which KN actually did.The other section is historical, weaving just about everyone in history from Charlemange to Napoleon into the narrative. Farfetched? At times, but it’s too interesting to spend too much time agonising over. Part of the beauty of the book is it takes you to a different place and you really don’t want to leave.I read years after first reading this book that Katherine Neville had written it in a tree-house on the Californian coast. She described the house – think mansion wrapped around a huge tree trunk and on a cliff with miles of ocean before you – and it made me think how important where you write can be. I know ‘Power of One’ author Bryce Courtney ties himself to a chair for hours in the evening to write, but me, put me in that tree-house and I think I could write a best seller too...She has written, years later, a sequel, The Fire. Same voice but this time it’s the daughter of the original heroine. We get a glimpse of the mother and I longed somewhat nostalgically to see ore of her, but the pace picks up and you’re away again. Both books you need a week free with a glass of wine and a fire – or a view of the Californian coast ¬– and it will be as if you’ve been to all the exotic places and times without having to pay for the airfare (or time travel)."}, {"userName": "Stacy Green", "userReviewDate": "Apr 30, 2013", "userURL": "http://www.goodreads.com/user/show/5500554-stacy-green", "userReview": "I would give this book more than 5 stars if I could. The plot Katherine Neville created with The Eight is incredible, intertwined with history and myth and science. Her characters are wonderful, and she does a great job of keeping us wondering until the end who is really on the \"good\" side. As a writer, I am truly stunned by the intricacy of this plot. Anyone who enjoyed The Da Vinci Code should enjoy The Eight, and it is a better book, in my opinion. A must read, especially for writers learning craft!"}, {"userName": "Jess The Bookworm", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/32042916-jess-the-bookworm", "userReview": "This book had such a great plot, but it was just so badly executed. It follows Cat Velis, a computer expert in the 70s who, as punishment for not getting involved in something underhanded at work, gets put on an assignment to Algeria. Before she leaves she attends a New Year's party, where she meets a fortune teller who gives her a cryptic riddle involving her date of birth and \"the eight\". Cat finds out that the riddle is linked to Charlemagne's legendary chess set, the Montglane service. This chess set is supposed to hold a powerful formula that will change the world. The story then switches to the 1700s in France, where it follows Mireille, a convent girl who is suddenly tasked with having to hide the chess pieces all over the world to avoid the formula being used, as its consequences would be too great.I enjoyed the book's story line involving chess, mathematics, physics and history. It wove in people like Catherine the Great, Newton, Blake, and many many other important people in history. I just felt that it wasn't written particularly well. Even though it was a long book, it felt quite shallow, especially around character development. Perhaps it would have been better as a series, because sometimes a lot of important information was just dumped on me very quickly. I think that in the hands of a more skilled writer, this story line would be truly epic.I also don't know what was wrong with my copy, as the beginning of the book was filled with the most annoying typos, such as \"botel\" instead of \"hotel\", and using capital \"I\" instead of lower case \"l\", sometimes having an \"I\" and and \"l\" right next to each other in the same word. The issues were only in the beginning of the book fortunately, but it almost put me off completely. Whoever edited and published the edition that I have were complete morons."}, {"userName": "Tracey", "userReviewDate": "Apr 15, 2016", "userURL": "http://www.goodreads.com/user/show/841949-tracey", "userReview": "I read The Eight a long time ago, and loved it. It's happened before with Open Road books on Netgalley – I like to request books I know and give a bit of a boost to their reissue. It's also nice to know that I'm going to like a book going in rather than taking the gamble a Netgalley book usually is. Unfortunately, this time it didn't work so well. The first half or so was a wild ride, smart and fun and fascinating, and I kept thinking this is what The DaVinci Code so very much wanted to be. But somehow somewhere in there I started to flinch every time I clicked a page over and saw a new chapter set in the 18th century. The 1970's portion still had me – but the tale of Mireille and her pantheon of the greats of France and America of the 1780's just kind of left me cold this time around. It was such a parade of 18th century notables… Even Ben Franklin and Alexander Hamilton got a mention. (Yes, I too now hear \"Alexander Hamilton\" sung to a certain tune.) And the digressions within the jumps backward (\"There’s a tale that goes with it\", said someone, and I whimpered quietly) were painful. It wasn't the writing – that was always solid and clear. Characterization was kind of magnificent; I mean, in one line Neville said more about Lily than most writers would be capable of in a full chapter (\"Lily was the Josephine Baker of chess. She had everything but the ocelot and the bananas.\") The only character who got somewhat short shrift was the 20th century first-person narrator, Cat; she didn't seem quite so well-rounded. It was just that the story did not simply have a beginning, middle, and end in a straight line. It more resembles a Celtic knot, or one of those flourishes one of those 18th century notables might have made under their signature to (if I recall correctly) discourage forgery. Maybe it's because I don't often have the solid blocks of time to devote to a book that I did when I first read this, but it made me tired. And it was just a bit frustrating that, with guns blazing all around them and bodies dropping right and left, Cat and Lily keep on trucking by themselves. \"I still think we should go to the police. After all, we have two bullet holes to prove our point.\" \"Never,\" cried Lily in agitation, \"will I admit that I’m not up to solving this mystery on my own. Strategy is my middle name.\"Argh.It's all very dated, of course - or rather period, I suppose. This came long before 9/11, so the zipping about among countries was easier, and security at events and in buildings was much lighter. And a cell phone here and there would have made a huge difference in the more modern plot. But I have to say, something I usually complain about, the Dread Recap, is skillfully avoided in this book. Katherine Neville is good at keeping the reader afloat in a vast and sometimes choppy sea of plot. I'm not much of a chess player; I won a game once, but I'm pretty sure my opponent wasn't paying attention. But the trappings, the history of chess is wonderful to read about, and, happily, The Eight does not depend on a reader's prowess to work. And it does work. It really is everything the DaVinci Code longed and miserably failed to be. Quote I want to see turned into a painting: On the fourth of April in the year 782, a wondrous festival was held at the Oriental Palace at Aachen to honor the fortieth birthday of the great King Charlemagne. He had called forth all the nobles of his empire. The central court with its mosaic dome and tiered circular staircases and balconies was filled with imported palms and festooned with flower garlands. Harps and lutes were played in the large halls amid gold and silver lanterns. The courtiers, decked in purple, crimson, and gold, moved through a fairyland of jugglers, jesters, and puppet shows. Wild bears, lions, giraffes, and cages of doves were brought into the courtyard. All was merriment for weeks in anticipation of the king’s birthday. It needs a Pre-Raphaelite painter, I think.I have to say I took great geeky pleasure in the etymologies peppered through the book, from the obvious (how did I forget \"Vermont\"?) to the huh! (The Rooks, or Castles, were called Rukhkh, the Arabic word for \"chariot\") and the \"aha!\" (\"Islam\" comes from the same root as \"shalom\"). (One more: \"Venice was founded by the Phoenicians—whence we derive our name\".) And the chapter heading quotes (there's a name for those, isn't there?) were terrific. (\"Skeletons of mice are often to be found in coconuts, for it is easier to get in, slim and greedy, than to get out, appeased but fat.\" —Chess Is My Life: Viktor Korchnoi (Russian GM); \"Tactics is knowing what to do when there is something to do. Strategy is knowing what to do when there is nothing to do.\" —Savielly Tartakover (Polish GM))Note of worthless trivia: my high school French teacher christened me Mireille for her class. I hated it because no one (including me) could pronounce that \"R\". So this was kind of weird. Something which was probably intended as comic relief, but which made me uncomfortable and then began to make me a little angry, was the way Lily's little dog Carioca was handled throughout. That poor little fuzzball was thrown, dropped, kicked, dunked, squashed, and lord knows what all else. I really hated it. The usual disclaimer: I received this book via Netgalley for review. Thank you!"}, {"userName": "Jennie ", "userReviewDate": "Jun 29, 2014", "userURL": "http://www.goodreads.com/user/show/28100741-jennie", "userReview": "4 Good Good Good Stars (προς 5) . Επιτέλους! Το τελείωσα! Μετά από ένα μήνα διαβάσματος! Τι να πω για αυτό το βιβλίο??Τα λόγια είναι περιττά! Πολύ καλό! Συγκλονιστικό! Δύσκολο να το αφήσω στο τέλος. Το λάτρεψα με λίγα λόγια. Όμως θα μου πεις αφού το λάτρεψες γιατί 4 αστέρια. Λοιπόν, ας αρχίσω την λεπτομερειακή μου κριτική για αυτό το βιβλίο:Θετικά:+ Πολύ καλή πλοκή/ιστορία Πολύ ωραίες σκηνές. Με σασπένς και πολύ πολύ δράση. Μου άρεσε πολύ η κύρια ηρωίδα. Ένας από τους αγαπημένους μου χαρακτήρες αυτού του βιβλίου. Και οι άλλοι χαρακτήρες όμως καλοί ήταν.+ Μου άρεσε ιδιαίτερα το ότι η συγγραφέας μόλις άρχιζε κάθε κεφάλαιο ανέφερε και κάποια quotes (δεν ξέρω πως αλλιώς να τα αναφέρω) που είτε αναφέρονται στη ζωή, είτε στο σκάκι, είτε σε κάποιες θεωρίες, είτε προέρχονται από παραμύθια και μύθους. Κάποια από αυτά με μπέρδεψαν λίγο. Και κάποια έγιναν τα αγαπημένα μου.+Ευτυχώς υπήρχε και λίγο ρομάντζο/έρωτας αλλιώς δεν θα έβγαινε έτσι σκέτο. Ούτε άρλεκιν ούτε να αναφέρετε μόνο στους πρωταγωνιστές και το τι έκαναν σε σχέση με το μυστήριο αυτό σκάκι.Αρνητικά:-Πολλές σελίδες! (767!) Αυτός ήταν ολόκληρος τόμος! Ούτε εγκυκλοπαίδεια να διάβαζα! Το τράβηξε πολύ σαν ιστορία. Αφού σε ένα σημείο και μετά έλεγα να το παρατήσω λόγω των πολλών σελίδων. Ευτυχώς όμως δεν το έκανα. Αναρωτιέμαι πόση έμπνευση είχε αυτή η συγγραφέας και έγραψε τοοοοοοσα πολλά. -Πολύ λεπτομέρεια σε κάποια σημεία. Και προσπαθούσα να συγκεντρωθώ πολύ για να τις πιάσω όλες, έτσι ώστε να μην χάσω τον ειρμό της ιστορίας.Παρατηρήσεις: Μου άρεσε πολύ το πώς συνέδεσε τους χαρακτήρες μεταξύ τους. Και αυτούς όπου έζησαν στην πραγματικότητα αλλά και αυτούς που είναι φανταστικοί(δημιουργήθηκαν για τις ανάγκες του βιβλίου). Το καλό είναι ότι έμαθα και λίγα παραπάνω πράγματα για το σκάκι. Από εκεί που δεν ήξερα σχεδόν τίποτα για αυτό και το πώς παίζεται (όπως και η κύρια ηρωίδα δηλαδή) κάτι έμαθα. Πάντως ένα έχω να πω. Θα μπορούσε να γίνει σειρά στην τηλεόραση ή ακόμα καλύτερα ταινία. Θα ήμουν από τις πρώτες που θα πήγαινε να την δει. Τέλος πάντων ήταν ένα καταπληκτικό βιβλίο. Το συνιστώ σε όσους τους αρέσει η περιπέτεια και η δράση και τα βαθιά μυστήρια. Τώρα ανυπομονώ να διαβάσω και το δεύτερο βιβλίο. Εύχομαι να είναι τόσο καλό όσο το πρώτο. Και ακόμα καλύτερο…"}, {"userName": "Norah Una Sumner", "userReviewDate": "Apr 08, 2015", "userURL": "http://www.goodreads.com/user/show/28782884-norah-una-sumner", "userReview": "I don't even know what to say about his book.It had so much potential but failed to deliver it the right way.There are two female leads-Mireille,who lives in the 18th century,and is actually a really cool character,and Catherine Velis,who lives in the 70s,and is a really irritating character.I just didn't like her,my biggest problem with her is that she's a freaking know-it-all-''Oh I don't know anything about Algeria but I know that...'' or ''Oh I don't know anything about chess but I know that...''.Girl,you either know something or you know nothing,so shut the hell up.The story didn't get any better,it just got more and more confusing.I don't see the necessity of putting so many (HISTORICAL) people in the story-Napoleon,Voltaire,Katherine the Great etc,etc.The only character that I reaaally liked is Charles Maurice de Talleyrand,he's the only person I got attached to during this book.The ending got me like:Mom why did you recommend this to me?WHY?"}, {"userName": "Sarah Sammis", "userReviewDate": "Sep 09, 2007", "userURL": "http://www.goodreads.com/user/show/122647-sarah-sammis", "userReview": "I've had The Eight on the TBR shelf next to my bed for two or three years. I got it right around the time I had just finished reading The Da Vinci Code and the blurb on the back compared it to Brown's book and the Bookcrosser who gave me the book had liked the intricacies of the plot.This 600 page mystery involves a formula for an elixir of life, a rare chess set and some Cold War era espionage. The story jumps between the close of the 18th century and \"modern day\" 1972. To make the chess themes stick the book has 64 characters (one per square) and whole bunch of boring detail taking so seriously that I was alternating between bored and bemused and the pretentiousness of this book.I'll concede that Neville is probably a better writer than Brown but Brown seems to have more fun with his books. Dan Brown writes long winded shaggy dog stories that draw on subjects I'm interested in (art history and technology) to tell implausible but entertaining adventure stories. The Eight didn't capture me in the same way."}, {"userName": "Linda", "userReviewDate": "Mar 02, 2014", "userURL": "http://www.goodreads.com/user/show/3849889-linda", "userReview": "In 1972, Catherine Velis, a computer expert, is given a special assignment in Algeria, and when an antique dealer hears about it he approaches her with a request. Even before her departure, strange things starts to happen and she realizes that she is part of something she doesn't understand. Everything seems to be connected to an ancient quest.People from different parts of the world search for an ancient, moorish chess service given to Charlemagne and hidden in Montglane Abbey. The Montglane service is more a than a chessboard with pieces of gold and jewellery. It contains an immense power that can explain the history of the world, and make the owner of it the most powerful man on earth. In a parallell story, the French Revolution is approaching. Danger is coming to Monglane in France and the novice nuns Mireille and Valentine from the Montglane Abbey have to disperse some of the chess pieces and hide them. They can't trust anyone and have to choose wisely when forming the necessary alliances. The dangerous game involves people like Robespierre, Talleyrand, Newton, Napoleon, Voltaire and Catherine the Great.In 1972, Catherine enters the game. Together with a mysterious friend, a daughter of a friend and a Russian chess master Catherine encounters many dangers in the search of the chess service. She realizes that of the people searching for it, many are professional chess players. They are all pieces in the game and a pawn is easy to get swept off the board.The Eight is an adventure that is thrilling as well as intelligent. Neville plays with numbers and information in an extraordinary way, mixing true events with fiction. Even though some of the things seem a little far-fetched and too colorful – everyone seems to be a player in the game and the number eight figures everywhere - it's easy to overlook them. The mixture of chess, ancient secrets, fascinating places and interesting characters makes The Eight an entertaining read."}, {"userName": "Gail", "userReviewDate": "Jan 10, 2009", "userURL": "http://www.goodreads.com/user/show/1162934-gail", "userReview": "I was given this novel to read, as a similar level of enjoyment as The DaVinci Code.I'm here to say, not even close.It has all the hallmarks that lead to an enjoyable read for me - historical figures, layered storylines, small details that add to great importance as the story develops, and zzzzzz.....Let me state that I enjoy playing chess. However, reading about it is something of a completely different nature. Figures, playing methodologies, inside references, et al just made my eyes glaze over.I never cared about the characters, as much as I wanted to, and felt that that pacing dragged.The Eight may be filled with promise, but not for me. I couldn't even bring myself to finish it."}], "description": "Computer expert Cat Velis is heading for a job to Algeria. Before she goes, a mysterious fortune teller warns her of danger, and an antique dealer asks her to search for pieces to a valuable chess set that has been missing for years...In the South of France in 1790 two convent girls hide valuable pieces of a chess set all over the world, because the game that can be played with them is too powerful....", "title": "The Eight\n      \n          (The Eight #1)", "url": "http://www.goodreads.com/book/show/113310.The_Eight", "average": 3.92, "cover": "https://images.gr-assets.com/books/1388263286l/113310.jpg", "reviews": 2358, "authors": [{"url": "https://www.goodreads.com/author/show/7172.Katherine_Neville", "name": "Katherine Neville"}], "type": ["Fiction", "Mystery", "Historical", "Thriller", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/113310.The_Eight", "http://www.goodreads.com/book/show/1560293.El_ocho", "http://www.goodreads.com/book/show/251217.The_Eight", "http://www.goodreads.com/book/show/9812865-the-eight", "http://www.goodreads.com/book/show/17380007-osmica", "http://www.goodreads.com/book/show/1560292.The_Eight", "http://www.goodreads.com/book/show/25710408-the-eight", "http://www.goodreads.com/book/show/5166620-el-ocho", "http://www.goodreads.com/book/show/572103.The_Eight", "http://www.goodreads.com/book/show/25757537-the-eight", "http://www.goodreads.com/book/show/2848984-the-fire", "http://www.goodreads.com/book/show/58892.The_Magic_Circle", "http://www.goodreads.com/book/show/876882.A_Calculated_Risk", "http://www.goodreads.com/book/show/22754695-el-ocho", "http://www.goodreads.com/book/show/22754699-el-ocho", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}