{"ratings": 54875, "userreviews": [{"userName": "Lauren Van Buskirk", "userReviewDate": "Feb 06, 2008", "userURL": "http://www.goodreads.com/user/show/881365-lauren-van-buskirk", "userReview": "I ran into my friend Dan at the club last week, and he was drunk. So we talked Camus. We didn’t discuss Camus’s theories, or the fact that he avoided riding in cars and then DIED IN A CAR CRASH. We just talked about Camus in relation to Dan’s life and in relation to mine. The only really interesting thing about anything to me is how it affects me. That’s the honest truth. Dan and I agreed that an interest in Existentialism is kind of a stage in your life – like when you liked Pearl Jam or lived in a little house that had a name and seven other people living in it. We then agreed that a re-exploration of all things Existential is usually preceded by your significant other telling you to get bent. Later Dan taught me how to cure a salmon, and we decided to co-host a dinner party in the second week of April. I doubt we would have come to this conclusion without having read The Fall."}, {"userName": "Helen Ροζουλί Εωσφόρος   Vernus Portitor Arcanus Ταμετούρο   Αμούν Arnum", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/20643658-helen-vernus-portitor-arcanus-arnum", "userReview": "*************************************************** Μ•Ο•Ν•Α•Δ•Ι•Κ•Ο Ηλεκτροφόρα καλώδια στην καρδιά. Ηλεκτροσόκ κυριολεκτικό,κάθε φορά που ο αφηγητής σου απευθύνει το λόγο. Σε δείχνει. Σε χαρακτηρίζει. ΜΙΛΑΕΙ ΓΙΑ ΣΕΝΑ... ΓΙΑ ΕΜΕΝΑ..ΤΡΟΜΑΚΤΙΚΟ. Ταυτίζεσαι και όταν τελειώνει κοιτάς το ταβάνι. Κοιτάς το πάτωμα.Ξανακοιτάς το ταβάνι, οπουδήποτε πιο ψηλά απο το υπόγειο ή το υπέργειο μπουντρούμι σου. Ανοίγεις τα κλειστά παράθυρα κι ας είναι νύχτα...Βγαίνεις κάπου έξω για να κοιτάξεις ψηλά,όσο πιο ψηλά μπορείς,φτάνει να αποφύγεις την ΠΤΩΣΗ. Τσουλήθρα σε ξυράφια αυτό το βιβλίο που καταλήγει σε μια πισίνα γεμάτη οινόπνευμα. Αντέχεις; Η Πτώση σε αφορά. Σίγουρα κάποτε αδιαφόρησες για την Πτώση κάποιου. Άρα αντέχεις.Την αλήθεια. Μπορείς να δεις το οδοιπορικό της ματαιοδοξίας και της ανούσιας φαινομενικότητας που οδηγεί με μαθηματική ακρίβεια στην Πτώση. Η μετάνοια και η εξομολόγηση ενός ανθρώπου. Ενός δικαστή-μετανοητή. Η δική μου εξομολόγηση. Η εξομολόγηση όλων μας. Όλων των λίγο- πολύ βολεμένων. Με στρωμένη ζωή,με προβλήματα,με απόψεις,με κριτικό πνεύμα στην κατάκριση της κοινωνίας και με ιδέες φιλελεύθερες και εμπεριστατωμένες. Όλων των προβληματισμένων που έχουν ωραίες απόψεις, κοσμική ζωή,φίλους,γνωστούς,οικογένεια, μόρφωση,εργασία και μικρή ή μεγάλη εξουσία. Όλων όσων έχουν \"κουσούρια\". Όσων είναι εγωιστές,φιλάνθρωποι,φιλόζωοι,νάρκισσοι, ατομιστές. Όσων αγαπούν μόνο απο συμφέρον και είναι ανίκανοι να το καταλάβουν, που λένε πάντα την ψεύτικη αλήθεια για να είναι αρεστοί και αποδεκτοί. Που παραδέχονται αξίες και ιδανικά μόνο για να μην κατακριθούν απο άλλους άμεμπτους ψεύτες. Που συμπαραστέκονται απο χαιρέκακη ανωτερότητα όχι απο συμπόνοια. Που κοιτούν χαμηλότερα για να αισθανθούν ψηλότερα. Δειλοί. Άβουλοι. Παραιτημένοι. Απελπισμένοι. Αμαρτωλοί. Ήσυχοι. Απλοί. Ονειροπόλοι. Καλοί. Κακοί. Με μια λέξη άνθρωποι ή κατηγορίες ανθρώπων και ανθρώπων. Για όλους αυτούς, για όλους εμάς,φτάνει μια στιγμή που μας δείχνει τον καθρέφτη της πραγματικής μας μορφής και υπόστασης. Αν δεν ανήκετε σε καμία απο τις παραπάνω κατηγορίες, κρίμα. Δεν χρειάζεται να διαβάσετε αυτό το βιβλίο. Είναι αμείλικτο,τοξικό και κοφτερό. Ίσως καλύτερα να μην το διαβάσετε. Είναι παγίδα. Αν πιαστείς κανείς δεν θα μπορέσει να σε βγάλει. Πρέπει να βγεις ολομόναχος, αν τα καταφέρεις. Συγκλονιστικά και τρομακτικά φιλοσοφεί ο Καμύ. Αρπάζει απο τα μαλλιά τον σύγχρονο άνθρωπο που τον συναρμολογεί η νέα τάξη πραγμάτων,η θρησκεία, ο πολιτισμός,τα διάφορα συστήματα εξέλιξης και η ανούσια ελευθερία. Τον αρπάζει απο το δουλοπρεπές\"φαίνεσθαι\" και τον σέρνει στον γολγοθά του \"είναι\". Προσπαθεί να μαντέψει πως θα ήταν αν έσπαγε ο κρίκος μιας παγκόσμιας αλυσίδας αδιαφορίας και επίπλαστης ευτυχίας που μας δένει όλους και οδηγεί στην Πτώση. Πως θα ήταν αν αντιλαμβανόμασταν πως ανήκουμε σε μια κοινωνία που κρίνει-κατακρίνει και επικρίνει αισχρά και αυτοί που την αποτελούν είναι ακόμη χειρότεροι ή εξίσου αισχροί υποκριτές. Τώρα ξέρουμε. Είμαστε προειδοποιημένοι. Καλή ανάγνωση. Πολλούς ασπασμούς!Εισέρχεστε με απαραίτητη τη συνειδησιακή συναίνεση προς την επερχόμενη Πτώση. Εγώ υποκλίνομαι ταπεινά. Αρχίζω να κοιτάω ψηλά...με δική μου ευθύνη!"}, {"userName": "Glenn Russell", "userReviewDate": "Dec 09, 2014", "userURL": "http://www.goodreads.com/user/show/23385697-glenn-russell", "userReview": "“One plays at being immortal and after a few weeks one doesn't even know whether or not one can hang on till the next day.”― Albert Camus, The Fall“A single sentence will suffice for modern man: he fornicated and read the newspapers.” So pronounces Jean-Baptiste Clamence, narrator of Albert Camus’s short novel during the first evening of a monologue he delivers to a stranger over drinks at a shabby Amsterdam watering hole. Then, during the course of several evenings, the narrator continues his musings uninterrupted; yes, that’s right, completely uninterrupted, since his interlocutor says not a word. At one point Clamence states, “Alcohol and women provided me, I admit, the only solace of which I was worthy.” Clamence, judge-penitent as he calls himself, speaks thusly because he has passed judgment upon himself and his life. His verdict: guilty on all counts.And my personal reaction to Clamence’s monologue? Let me start with a quote from Carl Jung: “I have frequently seen people become neurotic when they content themselves with inadequate or wrong answers to the questions of life. They seek position, marriage, reputation, outward success of money, and remain unhappy and neurotic even when they have attained what they were seeking. Such people are usually confined within too narrow a spiritual horizon.” Camus gives us a searing portrayal of a modern man who is the embodiment of spiritual poverty – morose, alienated, isolated, empty. I would think Greco-Roman philosophers like Cicero, Seneca, Epictetus, or Marcus Aurelius would challenge Clamence in his clams to know life: “I never had to learn how to live. In that regard, I already knew everything at birth.”. Likewise, the wisdom masters from the enlightenment tradition –- such as Nagarjuna, Bodhidharma and Milarepa -- would have little patience listening to a monologue delivered by a smellfungus and know-it-all black bile stinker.I completed my reading of the novel, a slow, careful reading as is deserving of Camus. The Fall is indeed a masterpiece of concision and insight into the plight of modern human experience. Here is a quote from the Wikipedia review: “Clamence, through his confession, sits in permanent judgment of himself and others, spending his time persuading those around him of their own unconditional guilt.” Would you be persuaded?"}, {"userName": "Riku Sayuj", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/1651956-riku-sayuj", "userReview": "The Anti-ChristWhy does the Judge-penitent address you directly, as if he has found a kindred soul in you?In this world responsibility is infinite and that is why The Fall is inevitable - even for a Christ. But back then Christ made a mistake — he saw (was) the nausea of the world, he saw (was) the complete guilt of each man (and his own) and he decided to redeem man (himself) by setting a supreme example. He sacrificed himself because he found himself guilty. It was only an example, a call to action -- to make men recognize and alter their way of life. He wanted man to see the depravity of his own existence by this one magnificent act. But his sacrifice was merely self-elevating, it could not elevate man. For man cannot be elevated before being shown the depths he roils in currently. And man cannot see faults where he looks to see heroes. He cannot see himself in Christ. Man cannot see man in the Ideal.No, the faults had to be shown through an anti-hero. That is why the prophesy of an anti-christ was our true hope. That is why Christ had to return as the Anti-Christ. The Anti-Christ has to be closer to man, he has to be able to whisper to him as if he was just another man. He has to be able to make man see himself by looking at him. To make you see yourself as you really are by seeing in him yourself — yourself after The Fall. That is why the Judge-penitent addresses you directly. He has found a kindred soul in you.The Judge-PenitentYou are personally guilty for every fault that exists in the world. And The Fall is to not acknowledge your guilt — to withdraw from the world into aestheticism (recall Kierkegaard’s A in Either/Or) and make your life’s central concern one of making yourself feel good about yourself and thus about the world.By the time Jean-Baptiste’s confession is over, you should realize that in fact the Judge-penitent is you. The story was yours. It is time to begin your own confession. It is time to stop being Kierkegaard’s A, and to be the B. To polarize yourself. Time to take responsibility and stare into the abyss.Of course you might let someone else take The Fall for you, but from then on you would have to worship him. You would have to worship the guilty. You would have to worship the Judge-Penitent. But in this modern religion, to worship is to laugh at The Fallen.That is the true role of the modern Christ. To take The Fall for you, so that he becomes the mirror in which you see the horror of your life.The FallThis necessary and continuous fall is the theme of the novel. It is one unforgiving, vertiginous descent. It is not a story of gradual discovery and ascent as in Sartre’s Nausea. In Nausea you see the picture that you should be painting of yourself. In The Fall you see the anti-thesis that you should use as your anti-model, as the one point which gives meaning to your picture by not being painted.Here you are made to continuously disagree with a person who goes more and more towards that abyss. You are made to define yourself in your disagreement, to define yourself as a negation. And by doing that you are the one who discovers the nausea of such an existence, even as the narrator finds ingenious and pathetic ways to avoid it. And you are the one who moves away from the abyss.You are the hero of the story, or at least the would-be hero — the one who is going to have the transformation that will change your world. The polarization is external to the novel.Jean-Baptiste is one of the most powerful anti-heroes of literature, but you never root for his redemption. Instead you root for him to fall and fall — to Fall as horribly and as deep into the abyss as possible. Because that is the only way to root for yourself. Because the more he falls, the more you can see of what consists the abyss, and the further away you get from it. His Fall will save you. Mon cher, he is your personal Christ."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Apr 28, 2008", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "La Chute = The Fall, Albert CamusThe Fall (French: La Chute) is a philosophical novel by Albert Camus. First published in 1956, it is his last complete work of fiction. Set in Amsterdam, The Fall consists of a series of dramatic monologues by the self-proclaimed \"judge-penitent\" Jean-Baptiste Clamence, as he reflects upon his life to a stranger. In what amounts to a confession, Clamence tells of his success as a wealthy Parisian defense lawyer who was highly respected by his colleagues; his crisis, and his ultimate \"fall\" from grace, was meant to invoke, in secular terms, The Fall of Man in the Garden of Eden. The Fall explores themes of innocence, imprisonment, non-existence, and truth. In a eulogy to Albert Camus, existentialist philosopher Jean-Paul Sartre described the novel as \"perhaps the most beautiful and the least understood\" of Camus' books.تاریخ نخستین خوانش: یکی از روزها در سال 1975 میلادیعنوان: سقوط؛ نوشته آلبر کامو؛ مترجم: ا. بهروز؛ تهران، قائم مقام، مطبوعاتی خرد، چاپ نخست 1340؛ در 120 صعنوان: سقوط؛ نوشته آلبر کامو؛ مترجم: علی صدوقی؛ تهران، قائم مقام، چاپ دوم 1345؛ در 107 صعنوان: سقوط؛ نوشته آلبر کامو؛ مترجم: شورانگیز فرخ؛ تهران، امیرکبیر، فرانکلین، چاپ دوم 1352؛ در 189 ص؛ تهران، نیلوفر ؛ چاپ چهارم 1377، در 167 ص؛ چاپ نهم 1393؛ عنوان: سقوط؛ نوشته آلبر کامو؛ مترجم: امیر لاهوتی؛ تهران، جامی، 1388؛ در 144 ص؛ شابک: 9789642575572؛ عنوان: سقوط؛ نوشته آلبر کامو؛ مترجم: آناهیتا تدین؛ تهران، روزگار، 1392؛ در 120 ص؛ شابک: 9789643741808؛ ادبیات فرانسه کتاب نخستین بار در سال 1956 منتشر شدرمانی ست فلسفی، که از زبان ژان باتیست کلمانس (یحیای تعمید دهنده ی ندا کننده) که وکیل بوده، و اینک خود را «قاضی توبه‌ کار» می‌خواند، به صورت مونولوگ اول شخص روایت می‌شود. او داستان زندگی‌ خویش را برای غریبه‌ ای اعتراف می‌کند. ژان پل سارتر فیلسوف اگزیستانسیالیست، این رمان را «زیباترین و فهم‌ ناشده‌ ترین» کتاب کامو می‌خواند. ا. شربیانی"}, {"userName": "mark monday", "userReviewDate": "Nov 08, 2015", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "you know this person, we all know this person, this particular kind of person. a real do-gooder, a person of the people, doling out the goodwill and the spare change and the spare arm to help that blind person across the street. you know the satisfaction they get from looking humble, acting humble, being anything but humble at the heart of them. reveling in their goodness; reveling in their superiority. selflessness disguising selfishness. this person loves 'em and leaves 'em too, except \"love\" is too strong, too emotional a word to describe the shallow physical connection that leaves out any potential for a genuine connection. this person looks at other people like they would look at a collection of amusing bugs. this person sees a person needing help but if it costs them something, anything, even just a bit of delay on their way to something super important, then they are going to pass that person by. this person doesn't actually like people all that much; this person despises them, more than a little. you know this person because you have been this person! for at least a moment or a minute, maybe even longer, maybe it was something you had to get past. you know this person because this person is a part of you, unless you are some fairytale wonderland cartoon character who isn't capable of such things, of even thinking such things, and if that's the case - then fuck off! no, scratch that, don't fuck off; if you've never been this person, not even for a second, then message me because I wanna marry you. I've never been with a perfect person before.you know this author, mark, or at least you thought you did. Camus! the very name brings up so many thoughts and ideas and college memories, so many references. it's an intimidating name because Camus is an intimidating author. at least I thought he was. but not the Camus who wrote this excoriating and brilliant little novella. The Fall is pure enjoyment. Camus gets into the head of his douchebag protagonist and makes you really understand him. and even better, he makes the experience so much more than a chilly intellectual exercise. Camus is funny. he's more than clever, he has a genuine although dark sense of humor - wounding but never callow wit. but more important than either the depth of his characterization or his darkly sparkling wit is the fact that Camus is a man with reservoirs of empathy. The Fall isn't just a hit job on some hypocritical asshole. Camus understands his character, intimately; he understands him by recognizing that his character is a trait within human nature. the deepest wounds come from the people who are armed with empathy - they know exactly where and how to hurt you. Camus holds up a mirror for his readers to gaze upon themselves. personally, I wasn't too big a fan of what I saw; I don't like that side of me. I hate confronting my own hypocrisies. but I sure did love the mirror itself! it was beautifully built, a real work of art.8 of 16 in Sixteen Short Novels."}, {"userName": "Manny", "userReviewDate": "Sep 19, 2016", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": "I used to be, as they say, a person of some consequence, but now I spend most of my time on Goodreads. What? Oh, I worked for an American organization which provided experts for hire. At significantly elevated rates, it goes without saying. Reliable expertise carries a high market value, that was our business model. Let me tell you about one job I performed. A Spanish government agency wished to discontinue funding of a software project, why I don't know. Some internal feud, perhaps. They required an unimpeachable opinion to quote, so I had been brought in as an external evaluator. I was politely told in advance that my evaluation was expected to be negative. My contact assured me that he would keep the meeting as short as possible, in the interests of everyone concerned. I went in and shook hands with the representative of the project. I could see he had been up all night trying to improve his system's performance. I allowed him to show me the app for a few minutes. The contact man looked at me. In a neutral tone, and, in English, I explained that the project was not using the currently fashionable architecture or evaluation methodology; it was hard not to feel that this raised serious doubts. The contact man translated. \"But he doesn't even know Spanish,\" the victim said helplessly; the contact man replied; a minute later, we were shaking hands again and leaving. The next day, my boss told me the client had been pleased with my performance.After I discovered Goodreads, I began to feel that software projects were insufficiently challenging. Instead of giving bland opinions on code, I could use my own words to judge the accumulated output of the world's writers, from Homer to the present day. The response was also more interesting. A curt and eloquent dismissal of Joyce or Dostoyevsky would produce satisfying howls of protest from the soi-disant intellectuals, and a comment thread that could yield a whole morning of amusement. But after a while, this too palled. I found that there are only a limited number of ways to disturb a highbrow reader's sense of literary appropriateness; I began to move my reading steadily downmarket, to vulgar and poorly executed novels which readers actually seemed to care about. Soon I had touched bottom and found the rich stratum of authors with accounts on the site. People claim, without much conviction, that they care deeply about To the Lighthouse; they may believe in all honesty that they care about Harry Potter and the Deathly Hallows. But there is no doubt at all that they care about their own books. It was extraordinary easy to manipulate these authors' vanity, first raising up their hopes with an appreciative comment and then hitting them with a bluntly insulting one-star review. If they dared object - I was surprised to see how many did - it was then the work of an hour to assemble dozens or even hundreds of other reviewers, who would mock and scorn them as \"badly behaved authors\", adding their own insulting reviews. I know, one can hardly call my career a glorious one; but no doubt you have similar crimes on your conscience.Every author, I learned, longs to find the ideal reader who will read them as they know they should be read, who will understand all the things they wished to say but could not express. They search for the ideal reader, but all they find are critics. I think there has only been one ideal reader, two thousand years ago. He looked past the surface of the book and saw the true book inside, the book so deeply hidden that even the author could not see it. Naturally the critics found him intolerable and put him to death. Later, people felt that they had to write a book about the ideal reader. It is a confused and poorly structured book, full of inconsistencies and non-sequiturs. It is still the best book yet written. I could continue, but it is nearly midnight. I do not think I will tell you any more about my life. Instead, I suggest we walk across the bridge into the Vieille Ville, past the art galleries and antiquarian bookshops. Another one closed down just last week. I want to see them before it is too late."}, {"userName": "Gaurav", "userReviewDate": "Mar 12, 2012", "userURL": "http://www.goodreads.com/user/show/8148922-gaurav", "userReview": "The FallAlbert Camus\nI saw only superiority on myself, which explained my benevolence and peace of mind. \nYou are sitting in a bar in Amsterdam- the Mexico City- just after world war, when you chance an encounter with a ordinary being, a simple man popping up on the stage of your life. Jean-Baptiste Clamence comes across to you an ordinary citizen who tells you he used to be a lawyer but he’s now a judge-penitent. A strange kind of emotion provoked in your consciousness due to the announcement about his profession. You don’t know what that means- judge-penitent, but he promises he’ll explain it to you. He narrates in the first person, explaining that you are both from Paris, you’re both in your forties, and you’re both men. Jean- Baptiste Clemence takes you on a journey where he put his real being across you after peeling off layers after layers of his inauthentic personas he has put up to comfort himself against the incising eyes of The Others, however only to warp his being by new ones. You are taken aback by a sudden terror realizing that the man you meet then is actually like you, it’s your own being, in fact he represents all humanity, the universal condition- hollowness of human existence. Welcome to the world of Camus. \nI wanted to break up the mannequin that I presented to the world wherever I went, and lay open to scrutiny what was in its belly. \nThe narrator claims that he once lived a good, self-satisfied life, believing himself a model citizen. \n However. I was on the right side, and that was enough to ease my conscience. A sense of legality, the satisfaction of being right and the joy of self-esteem: these, my dear sir, are powerful incentives to keep us on our feet and moving forward. \n Clamence, in his position as judge-penitent, embodies the human necessity to judge, and need to condemn. The innate desire of human beings to judge acts as the very source of false morality. He creates a sort of illusion around himself based on the self-appeasing traits, however the spell, created by these ‘traits’, shattered to nothingness during one night when is walking by Seine, observes a that woman flings herself from the river bank and to certain death. He is standing right there listening on the cries of the woman but he couldn’t move to help her. Her fall triggers Clamence’s own. In another incident, Clamence finds that he is trapped behind a motorcycle which has stalled ahead of him and is unable to proceed once the light changes to green as a result. Other cars behind him start honking their horns, and Clamence politely asks the man several times if he would please move his motorcycle off the road so that others can drive around him; however, with each repetition of the request, the motorcyclist becomes increasingly agitated and threatens Clamence with physical violence. , Clamence, utterly humiliated, merely returns to his car and drives away. Later, he runs through his mind \"a hundred times\" what he thinks he should have done — namely strike his interlocutor, then chase after the motorcyclist and run him off the road.  After having been struck in public without reacting, it was no longer possible for me to cherish that fine picture of myself. If I had been the friend of truth and intelligence I claimed to be, what would that episode have mattered to me? It was already forgotten by those who had witnessed it. For Clamence, the collision of his true self with his inflated self-image, and the final realization of his own hypocrisy becomes painfully obvious. Awakened to the reality of both his own, and the whole of humanity’s guilt, Clamence retreats from his settled life build around seemingly false self-placating characteristics and chooses rather to spend his days recounting his story in the hope that others will be awakened as he has been, and in so being alleviate the burden he himself carries. Clamence takes to this misanthropic life with ease, declaring himself a “judge-penitent”, both condemned and condemning.The face of morality represented by Clamence, actually turns out to be an illusion of morality, a morality doesn’t build around integrity instead around false notions of righteousness. However, the narrative props up an underlining truth that the false veneer which Clamence wraps around his being takes birth out of necessity to live a seemingly virtuous life- in the eyes of The Other. But it leads to an inauthentic, hollow existence which permeates from the straightforward narrative of the book but shows you hypocrisy of your existence itself. And your whole existence shudders with inexplicable terror while reflecting upon the hollowness of your very being. The self-loathing aroused from it makes you realize that your whole existence is a catalogue of guilt, hypocrisy and alienation as the morality, you build your life upon, ripped apart on the encounter with harsh realities of existence. The fall which Clamence experiences is not just his fall, it’s the fall of whole humanity as your whole history of existence is built around such false, self- assuaging norms, otherwise hollow in its core. \n A single sentence will suffice for modern man: he fornicated and read the papers.\n While acknowledging that isolation is the only way to begin to free oneself of the expectations of others and avoid Sartre’s Bad Faith, Clamence preaches slavery – the abdication of freedom – as the only way to be happy. As Sartre used to say – we are condemned to free. It is one of his many diabolic. \nI'm well aware of the fact one cannot do without being dominating or being served. Every man needs slaves just as he needs fresh air. Giving orders is like breathing, you must agree? \n In a world of only relative morality, authority, Clamence seems to suggest, is the only root to objective truth. But if you question it on the ontological level, you find that this assertion is undercut by Clamence’s own attempt to elevate himself to the position of judge, wherein you find a logical inconsistency as humanity attempts to judge itself without transcendent being. \nThe main thing is to able to let oneself do anything, while from time to time loudly declaring one’s own unworthiness. I allow myself everything, once again and this time without laughing. I haven’t changed my way of life: I still love myself and I still use other people. It’s just that confessing my sins permits me to start again with a lighter heart and to gratify myself twice, firstly enjoying my nature, and then a delicious repentance.\n And you find that world of Clemence is no different that of Mersault, for he faces the problems of anonymity and indifference in modern life, only to expose the absurd nature of life wherein human beings tend to find meaning of life and totally unable to find any. As a character, Clamence epitomises the selfishness that stands between man and authentic experience, and true morality for community not just self. Only a novice would say that Clamence is Camus’s own voice- naively tracing the biographical elements in the books, however, the character of Clemence represents the reflection of a modern man living in post war. The nihilistic feeling he feels on encountering the absurdness of life urge him to take the easy way out- to fall back, only on new false notions. His inability to live between the evil and the righteousness- in the absurd state of life- creates a false morality. Clamence experiences Kierkegaard’s Dread. By choosing to embrace a life of judgement, he becomes a fallen prophet.The narrator would take you through the ‘bourgeois hell’ of Amsterdam by his monologue about guilt, hypocrisy and alienation. He ensnares us in his world of mirrors and deceptions, conveying the universality of his message while at the same time offering enough precision of detail for us to be aware of references to explicit events and personalities even we do not know what and who these are. Sartre once called it’ the finest and the least well-understood’ of Camus’s works. The observation by Sartre was bang on since the multi-layered text of this highly allusive book creates a chilling atmosphere behind its simple language and straightforward narrative. Though the divergence of Sartre’s and Camus’s thinking has become evident much earlier but Sartre’s review of The Rebel made it one of most celibrated literary battles of 20th century. One would assume, perhaps appropriately, that the novel was written, at least in parts, to express Camus’s feelings about the quarrel with Left (as Sartre had been champion of Marxism) however the novel appears to have references to ideas of Sartrean Existentialism. In Being and Nothingness, Sartre had posited a world in which human individuals are totally free, but in a constant struggle to defend their freedom against the encroachment of others who will attempt to dominate, limit and constrain them. These attempts can take the form of open oppression or more subtly, of love and affection, emotions that Sartrean Existentialist are imbued with bad faith- bad faith of the kind that Clemence seems to be describing when he talks about his discovery that \n‘modesty helped me to shine, humility to triumph and virtue to oppress’.\n Observed with judgment and enslavement, Clamence is an Existentialist, too, in the anguish that comes with his understanding of the human condition and its absurdity. One may find Clamence to be satirical portrait of Sartre, something seems undeniable given the circumstances in which the novel was written, some may even hind that Clamence as a portrait of Camus himself as even some of the reviewers reverberate the same. Perhaps he has traits of both. The confession of the ‘judge-penitent’ may be in reality an accusation. In that case, it leads right back to Existentialism, it could be traced out in Camus’s notebook which reads: ‘Existentialism. What they accuse themselves, one can be sure that it is always in order to condemn others. Judge- penitents.’ \nI didn’t know that freedom is not a reward or a decoration that you toast in champagne. Nor is it a gift, a box of delicacies which will make your mouth water. Oh no! On the contrary, it’s hard gift and a long-distance run, all alone, very exhausting. No champagne, no friends raising their glasses and looking affectionately at you. Alone in a dreary room, alone in the dock before yourself and before the judgement of others. At the end of every freedom there is a sentence, which is why freedom is too heavy to bear, especially when you have a temperature or you are grieving or you lose nobody.I am the end and the beginning, I announce the law. In short, I am a judge-penitent.\nIt's one of those books which require you to actively ponder upon what the author has to say beneath its straightforward narrative. And you'd be amazed to see its profound effect on multiple readings. If you're willing to stretch yourself beside the conventional demands of a book, Camus's universe is for you. \n\n5/5"}, {"userName": "Samadrita", "userReviewDate": "Dec 07, 2012", "userURL": "http://www.goodreads.com/user/show/13266158-samadrita", "userReview": "Do you want to have the very foundations on the basis of which your whole outlook towards life has been shaped, questioned?Do you want to see the lines between so-called good and evil, right and wrong, the moral and immoral blurred to the extent you could not distinguish one from the other?Do you want to erase that cherished and precious point of reference, against which you have compared, weighed all your actions, thoughts and feelings so far?If the answer to the above 3 questions is yes, then go ahead and read Albert Camus. You may end up falling in love with his work, his notions on moral ambiguity and grudgingly marveling at his genius.Did I love this book? Yes.Did I understand every aspect of it? Yes and No. Might take me a few more reads.Did I love the prose? Oh hell yes.Do I know whether to label this book as a kind of doctrine on nihilism or existentialism or a curious combination of both? Oh hell no."}, {"userName": "Foad", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/25683251-foad", "userReview": "تابلوی نقاشی \"قضات پاکدامن\"، نام یکی از تابلوهای مجموعه نقاشی مذهبی است که در محراب کلیسای گنت در بلژیک قرار داشت.این اثر هنری به همراه بخش های دیگر این مجموعه، در سال ۱۹۳۴، به سرقت رفت. سارق طی چند نامه، درخواست مبلغ کلانی برای بازگرداندن تابلو کرد، ولی درخواست توسط اسقف اعظم کلیسای گنت رد شد. پلیس هیچ وقت نتوانست سارق را بیابد.مدت ها بعد، شخصی به نام \"آرسِن گودرتیر\"، در بستر مرگ به وکیل خود گفت: او تنها کسی است که می داند \"قضات پاکدامن\" کجاست، و این راز را با خود به گور خواهد برد.در یکی از کشوهای او، کپی نامه های اخاذی ای که به اسقف فرستاده شده بود را یافتند و همچنین یادداشتی به این مضمون که: تابلو در جایی مخفی است که بدون جلب توجه عمومی، نمی توانند بیرونش بیاورند.گروهی حدس زدند که تابلو باید در خود کلیسا باشد، و با پرتوی ایکس، سرتاسر کلیسا را گشتند. فرضیه های دیگری هم مطرح شد، ولی هیچ یک به نتیجه نرسید.این ها، همه در حالی بود که این تابلو، در یک میخانه در هلند، بالای سر مست ها و اوباش عربده جو آویزان بود.پ ن: بخشی از کتاب، راوی می گوید که این تابلو در حقیقت دست او بوده و او داده آن را در یک میخانه آویزان کنند، ولی توضیح چندانی راجع به ماجرای سرقت تابلو نمی دهد. این بود که رفتم و از ویکی پدیای انگلیسی، چند و چون ماجرای سرقت را درآوردم."}, {"userName": "Steven  Godin", "userReviewDate": "Apr 04, 2016", "userURL": "http://www.goodreads.com/user/show/26706841-steven-godin", "userReview": "The philosophical and psychological study of a man suffering inner turmoil and a crisis of existence, the man in question is one Jean Baptiste Clemance, a Parisian lawyer who while spending time in an Amsterdam bar starts to tell a moving, slightly disturbing story of self-pity and guilt to a complete stranger, only the feeling here was that a mirror was between them and felt more like a confession to himself rather than anyone else. This is Classic Camus and has all the trademarks you would come to expect. Deeply thought provoking, chilling, great narrative and with some memorable lines, my only issue was it's length at under a hundred pages, I craved for more."}, {"userName": "Mohammed  Ali", "userReviewDate": "Jun 09, 2016", "userURL": "http://www.goodreads.com/user/show/48402276-mohammed-ali", "userReview": "قراءتي الثانية لهذه الرواية يمكن أن تختصر هذه الرواية في خمس كلمات فقط : العبث , التحدي , التمرد , اللامبالاة و اللاجدوى .على أنغام الفنان , الكاتب , الملحن و المغني البلجيكي الشهير ( جاك بريل ) و أغنيته المشهورة جدا \" في ميتاء أمستردام \" Jacques Brel - Le Port d'Amsterdam \" تبدأ أحداث هي الرواية المونولوج لأن بطلنا واحد يقوم بالحوار و الوصف و الحركة..تبدأ من قلب حانة مطلة على ميناء أمستردام تسمى \" حانة المكسيك \" و يا لغرابة هذا الإسم .إن غياب التفكيرٍ العميقٍ لمعنى الحياة هو الشكل الآخر لرتابة الحياة، بالتالي نعود نسأل ما جدوى من المعاناة آنذاك...؟ بالتأكيد ما من جدوى....!يقول كامو: \"..ان شعور بالعبث ياتي حينما يشعر الانسان ان الحياة بدون هدف، وانها مجرد روتين يومي .. وأعمال متكررة.. الأشياء ذاتها .. والمواعيد.. وأيام العطل .. وأيام العمل.. والأعياد.. وأشياء كثيرة تسير وِفقَ إيقاع واحد...، بذلك تولد شعورا بالعداء للعالم الذي نشعر تجاهه بلاغتراب ، وأن الزمن الذي يقودنا لمضاعفة جهودنا هو عدونا الأول، وأن حقيقة الموت تكشف لنا عبثية الحياة، والعقل بطريقته الخاصة يقول لنا أن هذا العالم عبثيلقد تنفس ألبير كامو عبر هذه الرواية بعمق..حيث جعل كل سطر من سطورها بمثابة الشاهد على فلسفته و نذكر منها بعض الأمثلة و التي يمكن إعتبارها تعريفات كاموية لبعض الأمور الحياتية القضاة : \nhebergeur d imageالثراء : \ndes photosالسعادة :\ndes photosالعبودية :\nhébergeur d image gratuitالحكماء :\nhebergeur gratuitالنساء :\nheberger une imageالموت و الحب :\nheberger une imageالإزدواجية :\nhebergement d image"}, {"userName": "Soheil", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/75570253-soheil", "userReview": "با \"بيگانه\"اش بيگانه بودم و ارتباط چندانى مابين ما برقرار نشد،طوريكه در خواندن اين كتاب شك داشتم؛و چه شك بى موردى!كلمه به كلمه اين كتاب رو با ذره ذره ى وجودم حس كردم.قبل از خواندن اين كتاب،فصل \"مرگ\" از \"رواندرمانى اگزيستانسيال\" از يالوم را خواندم و حقيقتا كه در راه فهم كتاب،كمك بزرگى بود.يالوم در كتابش ميگويد كه انسان ها به طور ناخودآگاه دو دفاع روانى را در مواجهه با اضطراب مرگ به كار ميگيرند:١-باور به استثنا بودن:كه مدام به انسان القا ميشود كه اتفاقات ناگوار فقط براى ديگران اتفاق ميفتد و او از مرگ،مصون است.در نتيجه در مسير موفقيت و شهرت و خودكفايى خود را گم ميكند تا اينكه اتفاقى،با چهره ى واقعى مرگ مواجه ميشود و اضطراب از ناخودآگاه به بيرون رخنه ميكند.٢-باور به نجات دهنده اى غايى:انسان امنيت خود را در وجودى برتر و فناناپذير(پدر و مادر،خدا،دوستان و اطرافيان ...) مى يابد و با تمام وجود سعى در حفظ و جلب رضايت آنان(به هر طريق) دارد؛تا اينكه آنها را از دست ميدهد يا اعتقاد به فنا ناپذيرىِ آنها در وجودش تضعيف ميشود؛آنجاست كه فرد سعى ميكند با رفتار هايى-بعضا افراطى- توجه اطرافيانش را به خود جلب كند و كارى كند كه دوستش داشته باشند تا از مرگ درامان بماند.بسيارى از مواقع،دو دفاع به شكل تركيبى به كار ميرود.بنده نه به طور مطلق كتاب يالوم را قبول دارم و نه اصلا اطلاعات چندانى از روانكاوى دارم،اما به نظرم رسيد كه كامو،تركيب دو دفاع در اعمال \"كلمنس\" رو به زيبايى به تصوير كشيده است.فردى كه دوتا يكى پله هاى موفقيت و شهرت را ميپيمايد و در عين حال با كمك هاى داوطلبانه و افراطى سعى در جلب توجه اطرافيانش دارد؛اما اين كار تا جايى ادامه مى يابد كه از جلب توجه اطرافيان مطمئن شود و پس از آن منتظر توجه بقيه به خودش ميماند.يالوم ميگويد وقتى اضطراب بيش از حد بر فرد فشار مى آورد،فرد سعى ميكند با روش هايى ،اين اضطراب را فرونشاند.متداول ترين روش،روابط آشفته وار جنسى و عاطفيست؛من در نسخه ترجمه اثرى از روابط جنسى نديدم(كه طبيعيست!) اما كلمنس پيوسته در روابط عاطفى متعددى با زنان هست.فرم روايت داستان،تك گويى يك شخصيت است(و چه تك گويىِ پُر و پيمان و جذابى!).شخصيت ديگرى نيز كلمنس را همراهى ميكند و با \"آقاى عزيز،دوست من\" يا ازين دست اسامى خطاب ميشود.مواردى كه در \"بيگانه\" وجود داشت،مثل مرگ،مردم دورو و نادان،دگرگونى زندگى در مواجهه با مرگ و... در اينجا نيز ديده ميشود؛نكته جالب،گوشه كنايه ها و تشابهات و استعارات فراوان و گوناگونيست كه \"كلمنس\" به سمت ذهن مخاطب شليك ميكند،طوريكه در اواخر داستان تبديل به رگبار ميشود و در هر جمله ى كلمنس اشاره يا مفهومى قايم ميشود.حقيقتا خيلى سعى كردم ٥ ستاره ندم به كتاب ،ولى واقعا عيب و ايرادى در اين اثر بى نظير پيدا نكردم.\"بايد براى پيروز شدن،مثل كوپرنيك استدلال ها را معكوس كرد.حالا كه نميشود ديگران را بدون داورى كردن درباره ى خود محكوم كرد،بايد ابتدا خود را از پاى دراورد تا حق داورى كردن درباره ى ديگران را بدست آورد.\""}, {"userName": "Samra Yusuf", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/56939723-samra-yusuf", "userReview": "So what do we talk about, when we talk about living? The very foundations on the basis of which our whole outlook towards life has been shaped? I’ve heard people claiming to spend their lives with a code of conduct, a sort of philosophy of their own to lead a life.” I love doing this,” “I like being there”, “this is wrong”, “I shouldn’t have said that”, and countless other incongruous statements.From where comes this venerated point of reference to judge our actions, where lies the line that discerns good from evil, moral from immoral, right from wrong…..if there is any!Camus, unlike the other existentialists, never takes religion as hostile, the very title is an obvious reference to the Biblical story of Adam and Eve; our narrator has come as a sinner to us, he has sinned, or so he thinks, and for the consequences, he has fallen from happy fields, into place where there is no light, but darkness visible, he talks and talks to us, confessing sin after sin over the course of several long evenings, why does at this point of his life, has he thought to grant words to those unspeakable actions, or inactions he has done, why indeed he thinks, there lies redemption in confessesions?Clamence,is the victim of judgment, his innerself prods him to outlook life beyond the self-centered existentiality, he has done deeds of good, but has never savored the feeling of being good, he has helped the penurious, but with no empathy, he has enjoyed being fabled, with a certain aloofness, he has taken pleasure in women, but never loved any!And now he comes to us, as a sinner, craves to be heard and redeemed, he is exhausted of being a mere spectator in stage of life, he seeks hope in reclamation, but there is no hope in regions of sorrow, doleful shades, where peace and rest can never dwell, hope never comes that comes to all, but torture without end! In the light of this work of genius and brevity, I am left bewildered and convinced all the same, was Camus tired of those existential refrains, he preached so dearly in his works, because in later, while criticizing this school of philosophy, and addressing Sartre what he said, is of importance gravely! \"far from leading to a decent solution of the problem of freedom versus authority, [existentialism can only lead] to servitude”A little conclusive, isn’t it??"}, {"userName": "Anna", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/18202588-anna", "userReview": "Μονόλογος - παραλήρημα - εξομολόγηση μιας ζωής απόλυτα πετυχημένης και ευτυχισμένης φαινομενικά, αλλά απόλυτα άδειας εσωτερικά. Ένας ύμνος πάνω στη ματαιότητα της επαγγελματικής επιτυχίας, της ηθικής και του φαίνεσθαι. Και μια γερή κλωτσιά στα αμαρτήματα του καθημερινού ανθρώπου. Πρωταγωνιστής ένας πετυχημένος δικηγόρος που κάνει απολογισμό της ζωής του σε έναν άγνωστο... στη θέση του θα μπορούσε να είναι ο καθένας μας... Και αλήθεια.. δεν έχετε σκεφτεί ποτέ να πιάσετε έναν άγνωστο, εν είδει ψυχαναλυτή και να του πείτε όλα τα αμαρτήματα και τα ανομήματά σας?"}, {"userName": "Jake", "userReviewDate": "Mar 14, 2008", "userURL": "http://www.goodreads.com/user/show/993709-jake", "userReview": "As with most Camus, this book is, in the course of a hundred or so pages, an entire decade of therapy. If you don't feel worse—yet oddly optimistic—about yourself and people in general after this book, you're either inhuman, or you're the exact person this book was meant for. Someone once extolled this book as \"an examination of modern conscience,\" and it was through this lens that I first began this work. That's accurate, I suppose, to a point, but to leave interpretation at that would be to rob this book of the most vital, living, breathing readings.On the surface, the book presents as a dialogue (presented as a monologue—how's that for queer?), a \"confession\" of one man to another over the course of five days. Each day the narrator, Jean-Baptise Clemence, tells more of the story of his life as a lawyer, his (existential!) crisis with life in general, and the resolution he's come to now, so many years later.I think my prior study of Existentialism helped understand this book, and thence a healthy portion of my enjoyment, but a deep knowledge of Camus is not necessary."}, {"userName": "Maria Espadinha", "userReviewDate": "Apr 21, 2017", "userURL": "http://www.goodreads.com/user/show/20749430-maria-espadinha", "userReview": "Consciência -- Um Passaporte Para O InfernoSerá que até os nossos atos de bondade para com os outros, derivam dum narcisismo desmedido?!Sempre que damos uma esmola, ajudamos um cego a atravessar a rua, etc, etc, ... será que o fazemos porque tais atitudes são cotadas positivamente pelas avaliações dos outros, que nos recompensam rotulando-nos como \"pessoas de bem\"!?...Será o altruísmo uma forma de egoísmo hipócrita?!Um Narcisismo mascarado?!Com a Queda, Camus põe em causa a natureza humana, condenando-a a um julgamento estéril -- existe uma Consciência auto-punitiva inoperante, que se limita a condenar o irremediável.É um Ciclo Eterno de Pecado e Auto-Julgamento, onde a Mudança não tem Lugar!Somos irremediavelmente Maus -- seres em Queda contínua, com uma Consciência massacrante, um instrumento de tortura que tem como função única apontar-nos cada erro.Que descrença na Humanidade -- não só não presta, como não há volta a dar :("}, {"userName": "Muhammad Arqum", "userReviewDate": "Nov 04, 2013", "userURL": "http://www.goodreads.com/user/show/12328646-muhammad-arqum", "userReview": "How foolish I was to assume this would be a quick little read. I could not have been more wrong. I physically feel exhausted. How did Camus write this? The fall is as dense as they come, bitter, excruciating. Forces you to cogitate. The ideas are so repugnant and yet they keep gnawing inside your head. The words are like evil dark matter that establishes its authority right from the start and stays there dictating, vandalizing your property. I cannot believe I am giving this a 5 star rating. I don't know, perhaps it's a glimpse into a godless mind, a wretched heart drenched in hedonism, directionless and tired. It's unfortunate that people have to go through such misery.Also, it shows mirror to all of us, aren't we all hypocrites in one way or another? Writing this would have taken its toll on Camus, I am not ready to believe otherwise. The last few pages are going to stay with me, like headless serpents. I don't know, I feel blessed to be a believer, and also I'm shaken by this \"quick little read\"."}, {"userName": "هَنَـــاءْ", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/60416061", "userReview": "‏\"دراسة ذكية لا يمكن مقوامتها للضمير المعاصر.\"\n-نيويورك تايمز/رواية السقطة.‏\n\n\"تعرف ما هو السحر: أن تحصل على الجواب بنعم من دون أن تسأل أسئلة واضحة\"\n__________فلسفة عبثية تنبثق من الحاجة للمعنى والوضوح في عالم يعج بالغموض والتشتت.يقف ألبير ببطله على قمة الصراع بين الأنا والنحن، يحارب نفسه تارة، ويقذف بها تارة أخرى إلى منصة الإتهام، أو يتملص من تهمة أن يكون هو المتهم.\n\"نحن مخلوقات إستثنائية. كلنا نريد أن نحكم على شيء. كل واحد منا يصر على براءته مهما كله ذلك ولو توجبعليه أن يتهم الجنس البشري بأسره والسماء أيضاً\"‏\n__________من من البشر يعرف إلى أي مدى ستسحقه أفكاره تحت مقصلة التعذيب، والنزعات الفردية فيما يقول ويفعل!.\n\"مغطى بالرماد، أمزق شعري، وجهي تعلوه الخدوش وبعينين حادتين أقف أمام الإنسانية جمعاء ملخصاً عاري من دون أن أفقد التركيز في التأثير الذي أخلقه وأقول \"أنا أحقر الأحقرين\" وبعدها وبصورة تدريجية أنتقل من الـ \"أنا\" إلى الـ \"نحن\"“\nمن يتجرأ أن يعرف إلى أي درجة ستسحبه أنانيته، وغفلته عن دوافعه الحقيقية في لحظات اللاوضوح واللاحقيقة!.___________بعض من التعويم في السرد، وكثير من القلق، وجرعة من الاستمرارية تقف حائلاً بين التوقف والنضوب.\n\"الإنسان يلعب دور الإنسان الفاني وبعد بضع أسابيع لا يعرف إن كان بإمكانه الإستمرار إلى اليوم التالي\"\nامتداد زمني، وضياع بما تعنيه الكلمة، وذلك الشيء الذي يلامس روحك على نحوٍ غامض وغريب.___________قد تكمن المطبات الفكرية، في النصوص الذي تستوقفك كثيراً لدرجة أنك تتجاوزها وفي نفسك شيء من الحيرة، مع السرعة في الاستدراك أنك تجاوزت ما لو قضيت ساعة في تأمله لن ترتوي من قعر العمق.هُنا كامو، بحيرته، ووجوديته، وصرخاته المكبوته، وفلسفته المزدوجة.\n\"سأقيس السنوات التي تفصلني عن نهايتي. سأبحث عن أمثلة لأناس في مثل سني والذين قد ماتوا. ولقد عذبتنيالفكرة أنني لن أملك وقتا كافيا لأنجز مهمتي\"\nخواء إنساني بريشة قاتمة، ترسم لوحة سوداء .. فاقعٌ سوادها مشوبة بطيوف الهم الإنساني.يتحرر المرء من القيود، في الوقت الذي يطوق نفسه بسلاسل منها .. وأرسانٍ أخرى .. ممتدة إلى آخر العمر.يسقط من أعالي خيالاته السامقة، إلى أقصى منحدر ليهرب من تلك الروح التي تستوطنه وتهزه هزاً عنيفاً...ولكن .. أين المفر ؟!نظن بجهل أننا خارج منصة الإدانة، ولا أحد يحمل ذنباً يستقوي ضميره، ولكن في لحظة ضعف نتعرى إلى أقسى صورة .. والتي هي أبعد من كل الظنون المحتملة.طور عدمي، سخرية على حدود المأساة، تشويش، تداخل، أصوات من الداخل، ... الهائل.\n\"لتكون سعيدا فإنه من الضروري أن لا تهتم كثيرا بالآخرين\"\n‏\n___________\"الأنا\"تجد هذا الضمير وعلى طول الرواية .. طافح بكثافة التوهان، والبحث، والتفكك ..كل شيء له صلة بروح تقاوم مشكلاتها، وأزمة الذوبان في واقع يعجز عن التحليل، والتجزءة.متى يرتاح الجسد ..وهو لا يدري من أي سقطة خرج، وفي أي سقطة تاه فيها ..ولعل في السقطات ما يقع فيها دون أن يشعر ..ويحاول أن يخرج ببراءة رغم الخدوش، والرضوض، والبراهين ..‏\"لن يقتنع الآخرون بحججك، بإخلاصك، بحقيقة معاناتك إلا بموتك\"‏ولعلنا بعد تورية التراب ... نرتاح !"}, {"userName": "Sarah", "userReviewDate": "May 03, 2017", "userURL": "http://www.goodreads.com/user/show/49360584-sarah", "userReview": "“People hasten to judge in order not to be judged themselves.” “Freedom is not a reward or a decoration that you toast in champagne. On the contrary, it's hard graft and a long-distance run, all alone, very exhausting. Alone in a dreary room, alone in the dock before the judges, and alone to make up your mind, before yourself and before the judgment of others. At the end of every freedom there is a sentence, which is why freedom is too heavy to bear.”“Your success and happiness are forgiven you only if you generously consent to share them. But to be happy it is essential not to be too concerned with others. Consequently, there is no escape. Happy and judged, or absolved and wretched.” “Friendship is less simple. It is long and hard to obtain but when one has it there's no getting rid of it; one simply has to cope with it. Don't think for a minute that your friends will telephone you every evening, as they ought to, in order to find out if this doesn't happen to be the evening when you are deciding to commit suicide, or simply whether you don't need company, whether you are not in the mood to go out. No, don't worry, they'll ring up the evening you are not alone, when life is beautiful. As for suicide, they would be more likely to push you to it, by virtue of what you owe to yourself, according to them. May heaven protect us, cher Monsieur, from being set upon a pedestal by our friends!” “He had been bored, that's all, bored like most people. Hence he had made himself out of whole cloth a life full of complications and drama. Something must happen - and that explains most human commitments. Something must happen, even loveless slavery, even war or death. Hurray then for funerals!” “Have you noticed that death alone awakens our feelings? How we love the friends who have just left us? How we admire those of our teachers who have ceased to speak, their mouths filled with earth! Then the expression of admiration springs forth naturally, that admiration they were perhaps expecting from us all their lives. But do you know why we are always more just and more generous toward the dead? The reason is simple. With them there is no obligation. They leave us free and we can take our time, fit the testimonial between a cocktail party and a nice little mistress, in our spare time, in short.”"}, {"userName": "Roula", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/9197239-roula", "userReview": "Το τριτο μυθιστορημα του καμυ που και αυτο διαβαζεται απνευστι.ειναι αξιοθαυμαστο στα βιβλια οταν ο συγγραφεας καταφερνει να αποδωσει τα συναισθηματα των ηρωων οπως τα εχει παρατηρησει στους χαρακτηρες των αλλων, ειναι ομως εκπληκτικο το να περιγραφει συναισθηματα και τις πιο σκοτεινες σκεψεις οπως τις εχει βιωσει ο ιδιος και ο Καμυ πηγαινει τοσο βαθια στα πιο σκοτεινα μονοπατια της ανθρωπινης ψυχης που δε γινεται να μην περιγραφει πραγματα που ο ιδιος εχει σκεφτει και βιωσει.και αυτο θελει κοτσια.σιγουρα σε ολες αυτες τις σκεψεις θα βρεις και δικες σου.σιγουρα αυτο θα σε σοκαρει.σιγουρα ο Σαρτρ ειχε δικιο που αποκαλεσε την πτωση το καλυτερο εργο του Καμυ , αλλα και το πιο δυσκολο να κατανοησει κανεις.Προσωπικα με ικανοποιησε το ιδιο με τον ξενο και θα επιστρεψω σε αυτο σε καποια χρονια για να κατανοησω πραγματα που δε βγαινουν στην πρωτη ή τη δευτερη αναγνωση.ανυπομονω γιαυτο."}, {"userName": "Χαρά Ζ.", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/46885471", "userReview": "**The fall**My dear Camus, i love you."}, {"userName": "Luís C.", "userReviewDate": "Nov 09, 2014", "userURL": "http://www.goodreads.com/user/show/34132356-lu-s-c", "userReview": "The Fall by Albert Camus is the monologue of a breathless individual whose phrases follow each other in a frantic rhythm, giving himself up to an attentive interlocutor. The confessions of a man gnawed by the guilt of not having reacted to the suicide of a young woman who has been thrown from a bridge.This guilt will awaken his human conscience..Jean Baptiste Clamence, a vain and self-centered bourgeois, a renowned advocate, whom his good calculated actions distinguish, will abandon his rich Parisian life, his work following the suicide of a young woman. He then decides to reverse his role by positioning himself on the bench of the accused in order to judge himself without duplicity.He therefore exiled himself to Holland, a cold, hostile rocky country which he described as the gates of Hell.Clamence wants to repent of his sins, he becomes an observer, contemplates human ignominy, but he suffers, gets drunk and rubs shoulders with unfamiliar places. He takes a position as a penitentiary judge in a bar in Mexico City where he publicly confesses himself and accuses himself of the faults of humanity in order to send them back to his interlocutors hoping that they themselves will become aware of their mistakes.Thus, like a prophet in full redemption, he grants himself the right to judge men (the more I accuse myself and the more I have the right to judge you), his target the bourgeoisie!But his guilt pursues him bitterly, confession and redemption can not always offer forgiveness..In a cold, icy tone, written with great eloquence, Albert Camus strikes us with piercing words, criticizes selfish humanity, without forgetting, however, that he is well aware of being part of it.\"The fall\" causes a disturbing discomfort in the reader and leads us to ask ourselves certain existential questions.To read or study at least by curiosity."}, {"userName": "Eirini D", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/58976110-eirini-d", "userReview": "Ένα βιβλίο που ο καθένας μπορεί να βρει τον εαυτό του, μέσα στις σελίδες του, και να θέσει διάφορα ερωτήματα για το τι σημαίνει τελικά να είσαι καλός, να είσαι δηλαδή γενναιόδωρος, πονόψυχος, να θυσιάζεσαι για τους άλλους και ό,τι άλλο μπορεί να μας χαρακτηρίσει αυτό που λέμε, καλός άνθρωπος. Μήπως τελικά όλα ξεκινάνε και τελειώνουν στον εαυτό μας; Μήπως όλα περιστρέφονται γύρω από το εγώ μας και την ικανοποίησή του; Μα είναι γνωστό πως όταν δίνεις στους άλλους, ο πρώτος που παίρνει χαρά είσαι εσύ ο ίδιος. Κάτι κρύβεται λοιπόν μέσα σε αυτήν την διαπίστωση και ίσως να είναι η παραδοχή ότι οι καλές μας πράξεις δεν είναι τόσο αθώες, όσο θέλουν να δείχνουν. Ποιοί πραγματικά είμαστε και πώς θα φερόμασταν, χωρίς κοινό να μας παρακολουθεί και να μας επευφημεί;Ένα βιβλίο που οι αλήθειες διαδέχονται η μια την άλλη και πονάνε, γιατί φτάνουν βαθιά μέσα στην ουσία των πράξεων μας και αποκαλύπτουν τα πραγματικά κίνητρά τους.Ένα βιβλίο που πρέπει να διαβαστεί απ' όλους."}, {"userName": "Jeremy", "userReviewDate": "Jun 29, 2013", "userURL": "http://www.goodreads.com/user/show/5859690-jeremy", "userReview": "In any case, I only like confessions nowadays, and the authors of confessions write chiefly in order not to confess, saying nothing of what they know. When they pretend to be owning up, that’s the moment to beware: they’re putting make-up on the corpse.As far as his prose-fiction output goes, Camus is most well-known for three works: The Stranger The Plague and this one, The Fall. The first two have definitive places amongst cycles of his work within his oeuvre and the development of his ideas: the Absurd and Revolt respectively. But the The Fall does not. It wasn’t even part of the planned third cycle—Love—that was never completed due to Camus’ accidental death. It was a short story that grew into a novella, and was published separately to the other short stories that were put together as Exile and the Kingdom.Let me firstly say that, of the three theatrical versions of Camus’ work that I have witnessed, it is Drew Tingwell’s performance as Jean-Baptiste Clamence, in Michael Cronin’s adapted-for-the-stage version of this book, that has most occupied a Camus protagonist for me during my rereading of his work this year. I could visualize him delivering some of the key lines, like:But let me introduce myself: Jean-Baptiste Clamence, at your service. Delighted to meet you. You must be in business? More or less? Excellent reply. Judicious too: we’re only more or less in anything.Maybe because it is so suitable for a one-man-show? I mean, as a novel, it is a one man show… Anyway, he seems to occupy Clamence for me now in a way that the actors who played Meursault and Rieux do not. This novella is a confession, and a confession about the nature of confessions and what they mean. How they work for us. Why they’re necessary. What makes someone guilty, what makes someone innocent, in a specific and a general sense. Clamence adopts the role of Judge-penitent, a role he does not explain completely until the very end of the story. We, the reader, the nameless companion in the bar and streets and houses of Amsterdam, occupy the role of hearing the confession of this fallen man. And he pokes us along at a pretty brisk rate, often teasing us with information that is still-to-come.We follow his progression as a lawyer defending those who need to be, but always on ‘the right side’. He is beyond reproach, and he enjoys this position immensely… To be above, looking down. But an event occurs, mirroring, very gently, an event that occurred in Camus’ life, that causes a breakdown in the character of Clamence, a questioning of himself, a sense of guilt that was always there, that should always have been there, but he had resisted. And he feels the judgement of all around him. He regularly hears phantom laughter that comes from nowhere.Later, talking about Jesus, he finds room to condemn Him as guilty, even before he’s born. No lamb, He…And then he went away forever, leaving them to judge and condemn, with a pardon on their lips and a sentence in their hearts.In some ways, as Robin Buss’s introduction touches on nicely, Camus is responding to the Paris intellectuals who froze him out over his inconsistent politics … inconsistent in the sense that Camus wasn’t ever happy to accept any manifesto as unquestionable blueprint for Life. This novella is his response, an appropriately literary response that assaults his ‘enemies’, while at the same time does not absolve himself.Bistro atheistsAnd while this is an interesting historical and biographical point, Camus reaches much further. You can easily cast contemporary roles for the ‘bistro atheists’ he talks about.They’re free, so they have to get by as best they can; and since, most of all, they don’t want any freedom, or sentences, they pray to have their knuckles rapped, they invent dreadful rules and they rush to build pyres to replace churchesCamus is an atheist, but, he cannot so easily jettison the depth of moral consideration and conviction of Christian theology … not when he mistrusts the purposes and ‘paydays’ of what is offered in replacement, and Clamence expresses some of that, but always with apology.In short, you see, the main idea is not to be free any longer, but to repent and obey a greater knave than you are.If Meursault is the Outsider, then Clamence is the Insider. The Outsider ascends to death on innocence, the Insider falls to life in guilt.Aren’t we all the same, continually talking, addressing no-one, constantly raising the same questions, even though we know the answers before we start?Clamence is the man for our times. He is our Janus, the kind we worship. He would be a celebrity now, not a lawyer, but an actor playing a lawyer on a major HBO big-budget series, the kind people talk about at water coolers and on Facebook pages. And the charitable works he would perform! You would see all on his Twitterfeed. Our age would have sustained him far longer than the 50s could…Some mornings, I would conduct my trial to the very end and reach the conclusion that what I excelled in above all was contempt. The very people I most often helped were those I most despised."}, {"userName": "Nickolas the Kid", "userReviewDate": "Feb 24, 2014", "userURL": "http://www.goodreads.com/user/show/28908169-nickolas-the-kid", "userReview": "Τι να πρωτοπώ για αυτό το βιβλίο... Είναι απλά ένα ΑΡΙΣΤΟΥΡΓΗΜΑ που εγώ προσωπικά θεωρώ πως αξίζει όλοι οι άνθρωποι να το διαβάσουν μια φορά στην ζωή τους!Ο Κλαμάνς είναι ο ήρωας που κατέχει την αλήθεια, την αλήθεια που κανένας δεν είναι έτοιμος να δεχτεί ούτε να αντέξει...Ο μονόλογος του είναι ο μονόλογος ενός μέσου αστού, ενός καθημερινού ανθρώπου. Ίσως μια εξομολόγηση...Όμως είναι γεμάτος κοφτερά \"ξυράφια\" που κόβουν πάνω σε θέματα όπως η εξουσία, η θρησκεία, η μισαλλοδοξία, ο έρωτας κλπ κλπ... Ο λογοτεχνικός λόγος του Καμύ είναι σχεδόν δοκιμιακού χαρακτήρα και παρόλο που είναι η τρίτη φορά που το διαβάζω, μπορώ να πω πως είναι ένα δια βίου ανάγνωσμα....Ολόκληρη η κριτική στην Λέσχη του Βιβλίου: http://www.xn--ixauk7au.gr/forum/show..."}, {"userName": "Eva", "userReviewDate": "Nov 10, 2016", "userURL": "http://www.goodreads.com/user/show/44623637-eva", "userReview": "When Camus won the Nobel prize for literature in 1957 he was up against Nikos Kazantzakis. All I have to say is that at least Kazantzakis lost to a really worthy opponent. Camus is fast becoming one of my favorite writers. I don't think I have ever come across another author who is able to dissect emotions with the precision of a surgeon. It is truly incredible how analytical his mind is and a real talent how he can project that to his work with a sense of humor, at times cynicism and always humility. What I like about reading his books is that they make me feel like an amateur in life. And in that sense I am back in my childhood and the innocence that longs to be corrupted."}, {"userName": "Pantelis", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/59132978-pantelis", "userReview": "Ok, regardless of whether there is a Judging God or not, I would jump in the river to save the drowning woman. For me, the crucial philosophical question is: who would jump next, to save the drowning woman and her saviour?"}, {"userName": "Sura  ✿", "userReviewDate": "Dec 05, 2016", "userURL": "http://www.goodreads.com/user/show/11383902-sura", "userReview": "\" نحن جميعاً قضايا استثنائية \"النجمة الخامسة لخاتمة الرواية .*القراءة الخامسة عشر مع IGRs"}, {"userName": "Fernando", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/7665532-fernando", "userReview": "¿Qué clase de libro es “La caída”? No es una novela, ni un cuento. No tiene las características de un ensayo. ¿Hay manera de clasificarla dentro de la “normalidad” de los textos literarios? Quién sabe…Cuando uno se dispone a leer este libro, ya desde las primeras páginas cree encontrarse con un monólogo, pero tampoco es eso. Es más bien un soliloquio extraído de una conversación que el narrador, que utiliza un nombre inventado, Jean-Baptiste Clamence, sostiene con otra persona en un bar de la ciudad de Amsterdam, llamado México-city.A lo largo de sus páginas, uno va leyendo, a modo confesional cómo ha sido la vida de este abogado devenido en juez penitente y que a modo de descargo, utiliza esta conversación para establecer su posición, haciendo hincapié en distintos eventos tanto de su vida pasada como de sus días actuales.Hay ciertas palabras que quedan flotando en la mente del lector, como “vanidad”, “amor”, “egoísmo”, ”cinismo”, “confesión”, “costumbre”, “mentir”…Pareciera como que nos encontramos con un narrador inconformista al que la vida no le ha ido nada mal, pero que, fiel al autor que le escribe el guion, se aferra a un existencialismo marcado por la aburguesamiento a causa de esa vida fácil, mientras recuerda la manera en que conoció a distintas personas de todas las clases para poner en práctica su particular forma de ser.Creo, sin lugar a dudas, que podría asociar “La caída” a otros dos libros escritos de una forma muy similar; me refiero en primer lugar a “Memorias del subsuelo”, de Fiódor Dostoievski (aunque en este caso el narrador no tiene nombre y su escrito es ácido, recalcitrante y de un tinte subversivo muy marcado, que utiliza para despotricar contra el sistema, contra el mundo y contra todos), y por el otro lado, aunque aún no haya leído el libro, pero guiándome por algunas notas de contratapa, con el libro “El innombrable”, de Samuel Beckett.Aquellos lectores que hayan leído tanto este libro como el de Beckett, por favor corrijanme si estoy acertado o no en esta comparación que he utilizado para el libro de Camus.Y con respecto a Albert Camus, qué más puedo decir que no sean palabras de admiración y afecto que he sabido tener para este gran autor. Todos sus libros tienen un sello único, muy difícil de asociar a otros escritores. Es un autor muy original a la hora de escribir y podemos comprobarlo al leer obras tan disímiles como sus novelas “La peste” y “El extranjero”, su obra de teatro “Los Poseídos” (inspirada en su novela preferida de Fiódor Dostoievski, “Los Demonios”, a quien admiraba muchísimo) y al ensayo sobre el absurdo “La piedra de Sísifo”, con marcadas referencias a distintos personajes y escritores famosos.Pero todo esto lo escribe con maestría y con la impronta de su genio único, algo que hizo que yo lo considere cada vez más como a uno de mis escritores preferidos. ¡Qué alegría me genera leer la obra de Albert Camus!"}], "description": "Jean-Baptiste Clamence, a successful Parisian barrister, has come to recognize the deep-seated hypocrisy of his existence. His epigrammatic and, above all, discomforting monologue gradually saps, then undermines, the reader's own complacency.", "title": "The Fall", "url": "http://www.goodreads.com/book/show/11991.The_Fall", "average": 4.06, "cover": "https://images.gr-assets.com/books/1467904855l/11991.jpg", "reviews": 2178, "authors": [{"url": "https://www.goodreads.com/author/show/957894.Albert_Camus", "name": "Albert Camus"}, {"url": "https://www.goodreads.com/author/show/2435.Justin_O_Brien", "name": "Justin O'Brien"}], "type": ["Philosophy", "Classics", "Cultural", "Literature", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/11991.The_Fall", "http://www.goodreads.com/book/show/16156964", "http://www.goodreads.com/book/show/440009._", "http://www.goodreads.com/book/show/41307.La_chute", "http://www.goodreads.com/book/show/219972.The_Fall", "http://www.goodreads.com/book/show/8912173-the-fall", "http://www.goodreads.com/book/show/10285869", "http://www.goodreads.com/book/show/36167005", "http://www.goodreads.com/book/show/15722347-a-queda", "http://www.goodreads.com/book/show/12617155", "http://www.goodreads.com/book/show/23521675-la-chute", "http://www.goodreads.com/book/show/774027.La_Chute", "http://www.goodreads.com/book/show/8681993-la-ca-da", "http://www.goodreads.com/book/show/49552.The_Stranger", "http://www.goodreads.com/book/show/11989.The_Plague", "http://www.goodreads.com/book/show/11987.The_Myth_of_Sisyphus_and_Other_Essays", "http://www.goodreads.com/book/show/91950.The_Myth_of_Sisyphus", "http://www.goodreads.com/book/show/11990.The_Rebel"]}