{"ratings": 35460, "userreviews": [{"userName": "Kemper", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "Well, that was a spoonful of nonsense.It had a promising start with the outbreak of a disease known as Dragonscale which first manifests as dark marks on the skin. Getting a free tribal tattoo might not sound that bad, but the real problem is that eventually infected people burst into flames and burn to death. The damage caused by walking blowtorches and the fear of being infected have society teetering on the brink of collapse.Harper is a young nurse who discovers that she has contracted Dragonscale and she’s pregnant. If that isn’t bad enough her jerk-face husband Jakob goes coocoo for Coco-Puffs and thinks they should just kill themselves. During a desperate moment Harper finds help in the form of a mysterious guy dressed as a fireman who leads her to a hidden community of infected people who have found a way to survive the disease. Unfortunately, discord within that group proves as dangerous as the vigilante Cremation Squads that have started murdering the infected.It’s a strong premise, but unfortunately there’s a number of factors that drag it down. First and foremost is that it’s way too long. Hill can’t seem to commit to one main story, and he keeps adding on to it like a late-night TV commercial promising, “But that’s not all!” This causes a lot of drift with a long swath of the book not even touching on what’s going on in the outside world and forgetting what should be major characters for long periods of time. It’s also like one of those action movies that never seems to know when to end that goes on 20 minutes past the point where it should have wrapped things up.I also wasn’t a fan of Harper, and since this whole story is built on the idea of a plucky heroine trying to survive a civilization ending plague then I needed to have at least have some respect for her. Unfortunately, she comes across as twit who never seems to wise up until something terrible happens. Which it does. Repeatedly. I lost count of the number of times where she is shocked by the bad intentions of someone and says things like, “You can’t!” It’s the apocalype, lady. They can, and they will. Her infatuation with Mary Poppins, and Hill’s constant use of it and its songs are also way overdone. In fact, there’s just too much goddamn music in this book overall with constant quoting of lyrics and talking about various musicians. It's a crutch Hill leans on far too often. Plus, it’s all Jurassic Rock with a smattering of ‘80s pop in there with even an old VJ from MTV having a role to play. It’s 2016, Joe Hill. I don’t need your main character, who is supposedly in her early twenties, lecturing me on what the preference for the Rolling Stones or the Beatles says about a person. Another piece that flies off this jalopy of a book once it gets up to speed is the nature of the disease itself. There’s a lot of effort spent to convince us that there is a rational scientific reason that people would turn into Zippos, and I can suspend disbelief enough to go with that concept. But when more and more is added to the point where we’re into ideas like people being able to generate and control fire without their clothes burning and even more weirdness then you don’t need Neal deGrasse Tyson to call bullshit on it. Just as he couldn’t seem to commit to one story or another Hill can’t seem to decide if he wanted a more grounded concept with some science behind it or if he wanted to jump full-on into the supernatural pool.Hill also opted to run home to Daddy in this because the entire book is absolutely rotten with Easter eggs of Stephen King’s work. A few references can be fun, but when Hill essentially ‘borrows’ a character from The Stand including a cute little name trick to underline it then it’s crossed the line. (Harold Cross? For a character who is essentially Harold Lauder? That's weak.*) After a while it started to seem desperate, as if Hill knew things weren’t going well and hoped he might use fan familiarity of his father's books to invoke some of his magic. Hill also seems to have inherited his father’s trait of having a bunch of characters claim that they’re are critically short of time only to have them waste most of it with idle chit-chat and banter that is supposed to be funny and make you like the characters. It’s not, and it doesn’t.So at this point Hill is 2 for 4 with me, and after this I’m going to need a really good reason to pick up his next one.* And I didn't think about this until I read Edward Lorn's review where he pointed out that there's also a deaf character named Nick. Come on, Joe Hill. You're better than that."}, {"userName": "Will Byrnes", "userReviewDate": "Mar 02, 2016", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "The people in charge can always justify doing terrible things in the name of the greater good. A slaughter here, a little torture there. It becomes moral to do things that would be immoral if an ordinary individual did ‘em.\nThey have been trying to take us down for quite a while. Some may enjoy the end of the world (EotW) arriving in the form of an incoming asteroid. Hey, it worked for the dinosaurs. Alien invasion is always popular. Very big in the 50s, whether by maleficent alien civilizations or maybe a nice juicy mobile plant of the triffid variety. Viruses have been pretty big the last few decades, global pandemics, whether of alien or Terran origin. Zombie apocalypse is all the rage today, whether the zombies are animated by a force of nature or not. How an author takes us from the pre-disaster here through the horrors to there, wherever or whenever there may be, is the fun. But many of these entertainments carry a stowaway. EotW tales exist not only to titillate, and elevate our blood pressure, but to deliver a core of perspective along with the fun. The collapse of civilization is a favorite mechanism for writers looking at the core of human nature. Imaginative tales go to extremes to point out things about the here and now. Joe Hill - from USA Today Joe Hill has come up with a truly ingenious mechanism for bringing about his apocalyptic vision. Draco incendia trychophyton is a spore with some unusual properties. (smoothly rolling off the tongue not being one of them) The skin of people who have been exposed to it erupts in what looks like burger meat that has been way, way overcooked, interspersed with lines of gold. The affliction comes to be called “Dragonscale,” or ‘scale for short. It gets worse. Not long after initial exposure, most of the afflicted spontaneously combust. The spore spreads like wildfire, and soon the entire world is ablaze. This Freightliner snow plow could be better called a Frightliner for its use hereHarper Grayson, a school nurse, is practically perfect in every way. She is both kind and firm with her young patients, an admirable combination she employs when dealing with adults as well. Her hero is, of course, Mary Poppins. Throughout the 747 pages of this book (the page count may vary with the edition), there are many references to P.L. Travers’ magical nanny, too many to list here. But you should know that Harper totes her belongings in a carpet bag, once had a dog named Bert, and in the imagined film of the story of her life, she wants to be played by Julie Andrews. In an interview for his last book, Hill said\n I was thinking about Lon Chaney who had line about, “There’s nothing funny about a clown at midnight.” I think that’s part of the horror writer’s job: to create unsettling juxtapositions. You find something that seems harmless and innocent, and pair it with aspects that are disturbing. Christmas is a joyous occasion, it’s a time of pleasure and family, but there’s something about Christmas songs in the middle of the summer that’s not quite right.- from Nightmare Magazine interviewThe juxtaposition of Harper’s Disney-ish aspect, which stops just short of animated bluebirds chirping away on her shoulders, adds a nice dollop of sweet to the sour of the apocalyptic landscape. Harper and her husband, Jakob, have talked about ending their lives themselves rather than burning to death like the Dragonscale sufferers. But when she discovers that she is pregnant, the appearance of tell-tale black-and-gold on her skin presents not a death sentence, but a challenge. She has seen ‘scaled mothers deliver uninfected babies, and hopes she can too. Jakob has other plans. The Fireman of the title is John Rookwood. Harper first encounters him when he insists on crashing the very long line outside the hospital where she is working, (after the school has been shut down) carrying a boy with a severe illness. Later, as vigilante groups spring up to exterminate the infected, so-called Cremation Squads, he leads her to a place of safety. John’s talents extend beyond being handy with a halligan, being kind and protective toward children, and looking steamy in a yellow slicker. He can control his dragonscale, and do some pretty interesting things with it. You wouldn’t want to make his blood boil. John still carries a torch, though, for his old flame. It may not be a roque mallet, but John’s halligan comes in pretty handyThe Fireman can be read on at least two levels. On the surface, this is a can’t-put-it-down amazing scifi/horror adventure, a barn-burner of a read, exciting, fun, and very, very scary. It will keep you flipping the pages so fast you might generate sparks. (I recommend reading with a glass or bottle of non-alcoholic liquid near to hand) Harper is a wonderful character. I mean, really, a young nurse, pregnant, fleeing dark forces, while trying to figure out how dragonscale works and how it might be controlled, a woman who is the epitome of cheerful and positive, in a very bleak time, just hoping to live long enough to deliver her baby into the hands of people who can care for him or her. Add a damaged hero in John, an ally who can help her find a haven, if one really exists, but who comes with a bucket brigade of baggage. Good guys, bad guys and plenty in-between, a lot of action and a wealth of creativity. All that said, there is something more going on here. This is not just some cozy catastrophe in which a group of survivors carve out a manageable modus vivendi in the shadow of global horror. Hill is not only looking to give his readers a good scare. He wants to offer something more substantive. The Fireman delivers what the best speculative fiction provides, a look at contemporary reality through the lens of fantasy. John brings Harper to a place where others with ‘scale have come together, for group support and defense. The place is called Camp Wyndham. And for those to whom the name is unfamiliar, it might help to know that John Wyndham was the author of a 1957 novel, The Midwich Cuckoos. You might know it better as the film Village of the Damned. The lovely kids in this tale, of dubious parentage, are possessed of a group consciousness. Members of the Camp Wyndham community, all with ‘scale, have found that under certain circumstances the spore allows them to join into a joyous group rapture they call The Bright. This entails a loss of self, which not everyone is all that thrilled about, somewhere between the ecstatic experience of a full-bore revival meeting and a hive mind. Hill also references Jack Finney’s book, made into multiple film versions, The Invasion of the Body Snatchers\nCarol said, “Sometimes when I’m in The Bright, I would swear I feel my [late] sister standing right next to me, close enough so I could lay my head on her shoulder, like I used to. When we shine, they all come back to us, you know. The light we make together shows everything that was ever lost to the darkness.Harper clamped down on a shudder. When they spoke of The Bright, they had all the uncomplicated happiness of pod people.\n When we lose ourselves in a group-think situation, morality goes out the window. Why have a head at all if you only use it to ditto someone else’s psychotic rage? The relevance to our world is blazingly clear, whether the group be political or religious. There be dragons there. And there is a very real question of whether cooler heads will prevail.There is consideration as well of how people reach out to help those in pain or in danger. Maybe like the way Chris Christie locked up a nurse returning to the USA after she had been helping Ebola victims in Africa. In addition to seeing the ‘scalers as infected, see them as unwanted immigrants, as a despised class. See them as Syrian refugees fleeing civil war. See them as Costa Rican children fleeing north to keep from being forcibly drafted into drug gangs. Even a Trump-sized wall cannot keep out a global pandemic. Fear can usually be counted on to drown out most kinder impulses, often with the assistance of small arms. We get a taste of this here, as Cremation Squads do for spore victims what the SS did for Jews and others, or what, I am sure, many Tea-Baggers and militia groups would love to do to progressives, immigrants, members of the LGBT community, and ethnic and religious minorities here in the USA. Erstwhile residents of Auschwitz might recognize how some of the constabulary treat their prisoners in Hill’s dark landscape. All the nastiness is done with the eager support and encouragement, even participation, of a particularly sociopathic hate radio jock, broadcasting on a radio station with appropriate call letters. Hill tips his hat to luminary writers who have written about despotism and apocalypse. In addition to John Wyndham, noted above, a boat is named for Margaret Atwood, author of The Handmaid’s Tale and the MaddAddam series. Nobel laureate Alexander Solzhenitsyn, author of The Gulag Archipelago gets a mention, as does Cormac McCarthy, for The Road. There are almost certainly more of these.Over his entire oeuvre, Hill has demonstrated considerable glee in referencing the popular culture in which he was raised. MTV VJ Martha Quinn gets a lot of ink. Song, TV and movie references abound. But his largest source of material here is Disney. The Mary Poppins references in support of Harper’s character are legion. But there are plenty of others, including Toy Story, and a somewhat more oblique reference to Pinocchio. A ref to a classic Coke commercial also resonates, creepily. He even references his own work a bit. I spotted one link to NOS4A2, but I bet there are plenty more. I did not check the DNA of character names against the Stephen-King-Joe-Hill-character-database (there probably is one) of names used in their books, but generally, Joe has taken to tossing in refs to his dad’s work. These are always fun to spot. The writing of one particular character here is very reminiscent of Jack Torrance’s magnum opus in The Shining. Not so much the form, but the impact, and the revelation it contains about that character. As with the haunted Torrance, this guy blames others for all his problems. And shining is referenced as well, although of a sort different from that possessed by Danny at the Overlook, when the Camp Wyndham folks link up in The Bright. Hill has even said of The Fireman “it’s my version of The Stand, soaked in gasoline and set on fire.” So what comes next? Fire is often used as a cleansing image, in nature and religion. Burning the earth, as Maine, and the world, is scorched, may allow new growth, in the same way that new growth arrived in the years after Mount St Helen’s blew. Is that a factor here? Cleaning via fire so something new can grow? I won’t burn the ending for you, but it did suggest that Hill will be adding some logs to the flames of this story in future volumes. No inside intel, just a guess. I am tempted to suggest that readers of The Fireman will feel the burn, but that might imply that Hill has indicated a preference in the Democratic primary for Bernie Sanders. He has not. But I can say that The Fireman is certain to be both one of the hottest books of the year, and one of the coolest.Review posted March 25, 2016Publication date – May 7, 2016=============================EXTRA STUFFIn the epigraph to the novel. Hill includes three diverse quotes, one from Springsteen, one from Mary Poppins, and one from Fahrenheit 451. All were sources of inspiration. It should come as no surprise that before settling on the final title, the original name for Bradbury’s classic was “The Fireman.”Links to the author’s personal, Tumblr and FB pagesYou can read an excerpt from the book on Entertainment WeeklyInterviews-----  Joe Hill Calls Bullshit On The Crazy Artist Cliché on Buzzfeed – by Haley Campbell----- Pouring Gasoline On the Fire With Horror Author Joe Hill on Writers Bone – by Sean Tuohy-----Interview: Joe Hill (Part 1) by The Geeks Guide to the Galaxy for Nightmare: Horror and Dark FantasyReviews of other Joe Hill Books-----NOS4A2-----20th Century Ghosts-----Heart-Shaped BoxDecember 6, 2016 - The Fireman is voted the GoodReads Choice award winner for Best Horror book of 2016"}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "Did you read about the bacterium that thrives in volcanoes, right on the edge of boiling rock? That's us. Humanity is a germ that thrives on the very edge of catastrophe.It shows up on your skin looking like a form of stripes. Beautiful black and gold markings. Dragonscale aka Draco Incendia Trychophyton is a contagion in which the person will end up being burned alive. There is no cure.\nHarper is a nurse who has been working in a hospital day and night as a volunteer, trying to help anyone with the Dragonscale. One night a fireman brings in a young deaf boy, both of them are infected but the boy later disappears. Harper had stepped forward to help the two of them and the fireman told her that if she ever needed help with a fire that he hoped to help her.The hospital that Harper is working at later burns. Everything is burning. Too many people combusting and it can't be stopped. She goes home to her wanna-be author husband. They get the freaky deaky going and Harper becomes infected and then realizes she is also pregnant. (This isn't really spoilery) Jakob, her husband wants to just go ahead and end things before Harper burns and is convinced that he is also infected with Dragonscale.Harper does have a spine despite her Mary Poppins infatuation and tells him to screw off.\nJakob tries to help out Harper with her problems anyways. Jakob is an asshole.Harper is alone, pregnant and has a psycho trying to kill her and her unborn child. Enter in The Fireman.\nwhew..it just got hot up in this review.....The fireman takes Harper to a camp where people infected with Dragonscale have learned a few tricks to dealing with the condition. They aren't burning. They are flourishing. The fireman is a totally different thing/person/who the hell knows all to himself.I'm going to admit. I think this book could have lost some pages, because it is a big old chunk, it does tend to run on in some spots. Then in some spots I was glued to the pages and lost sleep. All through the book though I was entertained. Hill told a story and I thought he did a damn fine job of it.I LOVE this type of story and I've seen people comparing it to Joe Hill's dad's book \"The Stand\"...I just didn't see that. I saw a story all in it's own. Why does everyone continue to insist on comparing the two authors? I think Joe Hill has earned his frigging stripes. Stop it.There were some touches that reminded me of stories I've heard before, but I ate it all up like candy. It didn't seem like he was trying to copy dear old dad. \nThere is a bit of humor mixed in with the terror. Little tidbits of other books I've loved. (Joe Hill is a total Harry Potter fan) and I think I have to take back my early hate of Joe Hill. (I didn't like anything he wrote up until NOS4A2)\"Do you think Keith Richards is still alive?\" he asked.\"Sure. Nothing can kill him. He'll outlast us all.\"\nBooksource: Edelweiss in exchange for review.\nNot many reviews are up for this book at the time of my posting. I couldn't wait once I got my greedy hands on this one and neither could Mallory Hearts Reviews because we know what is the good stuff. :D"}, {"userName": "Anne", "userReviewDate": "Aug 30, 2016", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "2.5 starsEhhhhhhh.Boy, that ending petered out like a squeaky fart, didn't it?I mean, the beginning was good. I got sucked in by the whole Dragonscale/apocalypse thing. The middle was goodish, but it meandered around too much. Then the last part leading up to the ending had a bit of the nail biter going for it, but the actual ending?WTF, dude? Where's my payoff for reading this enormous fucker?!In the interest of transparency, I should mention that I'm the kind of reader that gets butthurt by endings I don't understand, like, or agree with. So. There's that.Ok, for everyone who loved this book, I hope you don't think I'm belittling Hill, or your taste. I really loved  Locke & Key, but this is the only other thing I've read of his, and (while I think he's probably a good writer) I'm not really sure what the hell just happened here. For such a promising start, I really felt like he shit the bed by the last page.Ok. Maybe that's not a fair assessment of this book, but I did feel disappointed when it was over. So. Yeah. I didn't get the hype. At. All.Also, fuck all the Mary Poppins references. It's not that awesome of a movie, and I have very little respect for a grown woman who imagines herself to be a budding Ms. Poppins.In the end, I'd say it's just not my type of book. It's not horrible, but I can't see myself recommending it, either.Psst...if you're hoping for this kind of Fireman, you're going to be sorely disappointed.Not that I thought this was about a sexy fireman. Nope.*cough*But, seriously. I wouldn't have complained."}, {"userName": "Edward Lorn", "userReviewDate": "Apr 17, 2015", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "[Yo! How's it going? Great book, huh? I enjoyed it, anyways. So, how much referencing did Hill do? Lemme count the ways:1. Deaf character named Nick is obvious reference to Nick Andros from The Stand. See also: Asshole/traitor character named Harold Cross/Harold Lauder of The Stand and the pregnant Harper Francis \"Frannie\" Grayson/the pregnant Francis \"Frannie\" Goldsmith from The Stand. 2. Twice, Hill writes that a character \"forgot the face of their father\", which is a reference to King's Dark Tower series.3. Hill describes those with Drangonscale as \"shining\", which could be a loose reference to his father's book The Shining. Also, in the dedication to The Shining, King says, \"This is for Joe Hill King, who shines on.\" In The Fireman, Hill says in his dedication, \"For Ethan John King, who burns bright.\"4. A character named Mindy shouts \"My life for...\", which is a reference to Trashcan Man in The Stand who was wont to say, \"My life for you!\" Although Mindy does not say \"you\", she uses actual character names.5. There's a face in the fire ala Sirius Black in the Harry Potter books. Other Potter plot points are: female dictator-type character who is unbending and ruthless; much teen angst from Allie; a secret society that might as well be called the Order of the Phoenix because The Fireman creates an actual fucking phoenix with his powers; a wizard (in this case a burner) coming into their own and learning how to use their powers; and so on. This book really is Harry Potter and the Order of the Phoenix just with a brand new paint job. Sad part is, I never would have noticed if Hill hadn't said, \"J.K. Rowling, whose stories showed me how to write this one\" in the dedication page. 6. A reference to Tom Gordon from The Girl Who Loved Tom Gordon. I know Tom Gordon is/was a real baseball player, but think about all the baseball players in the world. Don't you find it funny that Hill chose to use him of all people?7. Nozz-a-la soda is a nod to King's Dark Tower series, which puts Hill's book on the path of the beam.9. Flaming hand of God saves the day. I don't care if in Hill's book Nick makes the hand, this is an obvious nod to how King ends The Stand.8. John Rookwood's fire truck falls into a collapsed overpass much like Stu Redman of The Stand falls into one in King's book. Both men break their leg and are unable to go forward of their own power. John does continue the journey, but must be dragged, whereas Stu is left behind. This entire ending was also reminiscent of Roland's battle with infection in The Drawing of the Three. 9. CHRISTMASLAND!!! Finally, Hill references his own work!To wrap up, if you guys didn't read the credits at the end of the book, you really, really should. The story continues there, where we find out the real ending. This has been fun. Thanks for joining me.  (hide spoiler)]"}, {"userName": "Carol", "userReviewDate": "May 21, 2016", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "3.5 StarsThe world was suddenly catching fire........such a promising beginning........such a wonderfully threatening title and book-cover, but........THE FIREMAN just wasn't what I was expecting or at least hoping for. Without giving any part of this \"entertaining\" story away; yes, it was indeed entertaining....entertaining, but often predictable and a bit ludicrous here and there, but still very entertaining!After the excellent beginning, the story travels a different path that I won't divulge here except to say I wanted to experience more of the whole world's post-apocalyptic existence, and I wanted THE FIREMAN himself to be, well, more than he was.......Overall, I enjoyed it, snickered at the many King-isms along the way, and really didn't mind the 747 pages, but truth be told, sadly, it just didn't light my fire.Thank you Orion Publishing Group and NetGalley for the ARC!"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Jan 24, 2016", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "...THE FIREMAN IS COMING.\nI gave the book 4 stars because there is a part that lagged for me, but it's still awesome! I'm assuming everyone knows there is a disease going around and if you catch the spore your skin becomes dragonscale. And then later on you burst into flame! Yay! NOT! One of the main characters in the book is Harper and she is a very nice nurse. She sings to kids and people at the hospital and she's just a very nice person. She has an arse of a husband named Jakob and I loathed him. I was hoping someone would just set him on fire! The Fireman himself doesn't make too many appearances in the book, but when he does he's always helping someone and bringing them back to the camp. Which turned into some kind of psycho cult place after the leader was sick. The Fireman stayed away from the camp until he was needed and there are reasons that he didn't come help when things went bad. I won't tell you, spoilers and all. The people at the came have found a way to control burning in a blaze of glory. It's called the Bright and you need to read the book to learn more about that as well. I think it is totally cool. BUT, there is something else they can do, well some of them can do that is really cool. There are certain benefits of having the disease and I would like to be on the winning side! There are a lot of characters in the book that I really loved and some I didn't of course. I loved little Nick, he's a deaf boy at the camp who becomes close friends with Harper. Renee, The Fireman, Allie, some really cool peeps. At one point though someone is stealing special things from each person. I was really mad when I found out the story behind that issue. Overall, the book is really good and I'm glad it's part of my collection :-) Enjoy! ♥PS ~ Read all of the stuff at the back of the book because there is some extra book included :-)MY BLOG: Melissa Martin's Reading List"}, {"userName": "Jeffrey Keeten", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”...Her left arm was sheet music. Delicate black lines spooled around and around her forearm, bars as thin as the strands of a spiderweb, with what looked like golden notes scattered across them. She found herself pulling her sleeve back to look at it every few minutes. By the end of the following week, she was sketched in Dragonscale from wrist to shoulder. When she got over feeling winded and sick, she had to admit to herself that it was curiously beautiful.”\nWhen Harper Grayson comes down with Dragonscale, A.K.A. Draco Incendia Trychophyton, it is a death sentence. The contagion spreads quickly through the body, wrapping its tendrils around the skin, leaving behind these beautiful shimmering scales that eventually start to smoke until they reach a certain maturity or the person comes under a large amount of stress. They then spontaneously combust, experience cellular combustion, develop contagion points, and disease vectors are produced. We can be as scientific as we want to be, but the end result is the infected turn to ash. This disease is highly contagious. When one person lights up, it can cause a chain reaction where anyone with dragonscale in the area joins the inferno. When the crisis hit, Harper volunteers at the local hospital wanting to help anyway she can. She is careful, wears a hazmat suit, but the problem is there is a lot of conflicting information on how the contagion is spread. Almost simultaneously with learning she has dragonscale, she discovers she is pregnant. Joy crushed by the certainty of death. The disease moves so fast in most people that it wouldn’t be the right time to start reading War & Peace or Infinite Jest. You might want to think more in terms of The Bridge Over San Luis Rey.Her condescending, but loving, husband Jakob is furious. He becomes fixated on them ending their lives now even though he doesn’t have the contagion. There is much more to be learned about Jakob, so as you read the book, be sure to keep a baseball bat hidden down the back of your leg because you are probably going to need it. ”Harper supposed it did not pay to be too impressed with a man just because he could ride a unicycle.” A good rule of thumb for every woman to keep in mind. :-) People are dying so fast in such numbers few are not directly affected. Those who live lose as much or more than those who die. Too many people are gone too quickly. ”We are taught to think of personality as a singular, private possession. All the ideas and beliefs and attitudes that make you you--we are raised to believe them to be a set of files stored in the lockbox of the brain. Most people have no idea how much of themselves they store off-site. Your personality is not just a matter of what you know about yourself, but what others know about you. You are one person with your mother, and another with your lover, and yet another with your child. Those other people create you--finish you--as much as you create you. When you’re gone, the ones you’ve left behind get to keep the same part of you they always had.”You may still have that part of the people you have lost, but it is like having a garden without water or having a flower in the window that the sun never reaches. Without seeing that person, revitalizing that connection, eventually it will wither and die. With the help of a man referred to as the Fireman, Harper finds her way to a small community of followers who have figured out how to control the disease. ”Cortisol kicks off spontaneous combustion. But oxytocin--the social-networking hormone--puts the Dragonscale at ease.” In other words, stress releases cortisol which inflames the disease, but oxytocin, produced by say singing together, turns the disease into a benign light show.I’d be humming the Sound of Music 24/7. On the outside of the community is a radio personality who calls himself the Marlboro Man. He has assembled a crew of executioners who travel around looking for the infected so they can eradicate them. There are always those people who are kept in check by society, but once civilization starts to crumble, their true nature emerges, and we discover that what they really like to do is kill people. The fear of the infection is just an excuse for them to drop the pretenses surrounding their own warped and blackened soul and be who they have always wanted to be...a killer. Things go well at the community of the infected for a while, but as always seems to happen with human beings, eventually a power struggle breaks out. The camp breaks into factions. The one man who can actually control the dragonfire and use it as a weapon, the Fireman, is the man they all respect/fear. He lives with the community, but on an island away from the rest of them. He has his own demons he is wrestling with, and fire is just one of them. As the world goes up in flames and the sanctuary community starts to come apart, the only beacon of hope is Martha Quinn’s voice, a blast from MTV of the 1980s, broadcasting over the radio about a sanctuary on an island off the coast of New England. To get there will become an odyssey as arduous as navigating the terrain from Cormac McCarthy’s The Road. \nThe author Joe HillI am a huge fan of post-apocalyptic books. It is a part of me I’m still exploring to determine exactly why I find them uplifting. Is there a twisted part of my psyche that wants the civilised world to end? Am I as crazy as the Cotton Mather followers of the early 18th century? Am I so bored with my existence that I feel a good end of world scenario would shake me out of my doldrums? I don’t think I suffer from any of those things, but self-delusion is always a good possibility. I think what is more likely is that I like seeing humanity when their backs are against the wall, their ass is stuck in the darkest, deepest crack, and absolute annihilation of the human species is on the verge of becoming a reality, and we find a way to survive. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Susanne Strong", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/4514828-susanne-strong", "userReview": "5 Stars.An absolutely stellar novel by Joe Hill! Vastly different than all of his other books & superbly well written! I didn't want it to end. REVISED: 6.12.17.I listened to the audiobook version in two days last week (which is now available on Hoopla) even though I've already read the book. I couldn't help myself - the incredible Kate Mulgrew narrated it and she also narrated Joe Hill's NOS4A2. She made that book sound even scarier than it already was - thus listening to The Fireman was kind of irresistible. The audiobook version of The Fireman and \"Dragonscale\" was much more horrific, more real. When I was listening, I could see it happening all around me. Like in a Science Fiction novel.. one I couldn't run away from and oddly enough, given the premise, didn't want to. Draco Incendia Trychophyton, aka, Dragonscale, or the 'Scale. It's kind of like a superbug that everyone catches because it's highly contagious and it's discovered by interesting black and gold markings on one's skin, causing those who are afflicted to burst into flames. It's caused by a spore that floats through the air via ash, and once everyone catches it, they spontaneously combust into flames, The premise is totally wicked. And scary as hell.The Fireman, is in my opinion the most sophisticated novel Joe Hill has written to date. The main characters are extremely well developed and well written: Nurse Harper Willowes is a fierce, strong willed, standout heroine. Allie is one heck of an incredibly tough teen who doesn't take any sh&t from anyone. The Fireman, John Rookwood's, ability to control the fire burning from within is truly amazing but all of his human flaws, that is what makes him a man. And Nick - the little boy who lost his mom and shut down against almost everyone - and then in the face of the gravest danger, does what he has to do to take care of the only family he has left. That's powerful stuff! And then there's Jakob, Nurse Willowes, husband. He's becomes obsessed; with trying not to contract Dragonscale, and trying to murder his wife because she is a carrier of the disease and is also pregnant. In my opinion, this novel flows in a way that none of his other books have yet to achieve. And even with that, I can't say that this is my favorite Joe Hill novel, though I liked it a lot. I gave it 5 stars for his writing style being much improved and for the truly interesting idea of a spore that is highly contagious causing people who come into contact with it, to incinerate. It's ingenious and the characters in the storyline are pretty interesting too. Harper, John, Renae, Allie, Nick, Father Storey, Jakob: These people: They are this story. And it is well worth the read!For me, Joe Hill's NOS4A2, was my favorite book of the last few years, no question. Vic McQueen was the best heroine ever. Every part of that book was a wild ride. But not every part was smooth and beautifully well written. NOS4A2 was a bumpy ride. And it was a ride you didn't want to get off. With five stars for the amazing characters, crazy heart stopping moments and lots of tears."}, {"userName": "Emily (Books with Emily Fox)", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/58160628-emily-books-with-emily-fox", "userReview": "A very interesting take on post-apocalyptic! Would recommend!"}, {"userName": "Evans Light", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/7008067-evans-light", "userReview": "If you dislike unpopular opinions, then please don't read this review.I'm breaking from the pack on this one.I didn't want to, trust me. But here we are:\nThe book I've been eagerly awaiting since I finished his five-star NOS4A2, only it wasn't.Joe Hill's THE FIREMAN.Rambling, corn-pone, cartoonish.Unlikable characters, interminable dialogue, zero forward momentum.Besides for a mild dislike of the second half of HORNS (which was basically a retelling of the first half), I'm a huge fan of Joe Hill's work prior to this book. 20th CENTURY GHOSTS is one of my all-time favorite collections, and NOS4A2 is a Top-10 novel for me.But THE FIREMAN has left this reader's love affair singed, if not in total ashes.Bear in mind, this review is coming from someone who hasn't been able to find his way to the end of a Stephen King novel since TOMMYKNOCKERS (UNDER THE DOME being the sole exception, and that just barely), so I'm likely an outlier in opinion on this one. I like my fiction lean and mean, and this book was neither. If you're a fan of Stephen King's output from the last couple of decades, then by all means ignore this review and go enjoy THE FIREMAN. This book is for you. It very much emulates the modern King's unhurried storytelling style (although the down-home voice is somewhat less successfully replicated).It's a shame though, at least to this reader, because the premise of this book was certainly intriguing enough and \"Book One\" (the first 113 pages) delivered on that promise with sleek, gripping prose.Then it appears as though the editor fell asleep on the job or quit altogether, because the story literally ground to a halt, caught in a morass of endless inane character backstories conveyed in some of the corniest cheeseball dialogue I've seen this century. There is some damn fine prose laced throughout this slog of a story, to be sure; like his dad, Joe Hill can write like nobody's business, but Joe Hill deserves an editor with an iron fist and bleeding scalpel-shaped red pen.The unrelenting parade of forced references littered throughout struck me as cloying, not clever, and only served to remind me of the fact that the entertainment value of little Easter egg games diminishes rapidly while literally hundreds of pages are grinding by with nothing more happening than people acting cute while the world burns. Bored to the breaking point, I stoically pushed through to the end after concluding \"Book Five\" (page 388) hoping to find something of interest, yet my frantic search left me empty-handed.Some serious editing could have turned this book into an exceptional 350 page novel, rather than the 750 page mess it ended up being. Here's to hoping Joe Hill doesn't follow closely in his father's footstep of releasing increasingly muddled doorstop novels, but I'm guessing that ship has already sailed. He's got bigger ambitions than being a horror writer, I suppose, and the success of this book is likely to propel him much further in that direction.Godspeed, Joe. Hope to see you around these parts again someday."}, {"userName": "Bradley", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "This was an honestly fascinating ride of a novel. I wasn't entirely certain what to expect because of some reviews, but I'm certainly happy I got to read it. I was also a bit more satisfied with the ending than I thought I would be.So what's the big deal with Hill's big novel? Is it really an origin story for a handful of firestarters among a whole world's spontaneous combustion? A survival tale against the hate and fear riddled remnants of \"clean\" humanity? One of those ever-decreasing remnants of post-apocalyptic SF that's actually designed for adults?Yeah, it's all of those, and more. I really enjoyed having an 26 year old MC nurse who's pregnant and learning how to live with or become a human flamethrower.It's just not that common.Comic books aside, of course, but this novel is not a comic book origin story at all. It's a survival fiction and it's also a pretty tight commentary on sheeple and social media and popular pundits. It's also pretty heartwarming and horrifying and an oddly powerful and persuasive argument for finding peace in our hearts. :)I liked that bit the most. It kinda rocked.Everything is going to hell, but the only way through it is by peace. Um... With benefits. :)I had a really good time with this one. Thank goodness I gave it a shot. :) Maybe it's better because I lowered my expectations, but whatever, it's good. :) Loved the pyrotechnics. :)"}, {"userName": "Char", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "4.5 stars!Dragonscale! It's a disease, a plague really, that etches one's skin with what looks like black hieroglyphics. Unfortunately, at some point the hieroglyphs light up and burst into flame and when they do, it's all over for you. If you happen to be standing next to anything flammable, it all over for that, (or them), too. The world as we know it falls apart due to the 'scale, and people react much as you think they would. Picture how Donald Trump would react to people bursting into flame and how he would deal with those infected, in an effort to quell the disease.That's exactly what happens here. Hatred and fear of infection takes over and leads to even more deaths-most of which were unnecessary.I'm a big fan of Joe Hill and when I heard about this book, I went about making it my life's mission to get an advance copy and I'm so glad I did. The Fireman is, in my opinion, his best book yet. The characters are the most developed we've seen from him so far, which makes it difficult to witness the trials Hill puts them through.Mr. Hill excels at writing extremely strong women and Harper is no exception. She is a nurse who willingly helps treat those with the 'scale, while many in the medical field, and her own husband, want to run headlong in the opposite direction. Turns out Harper's husband is nothing like what she thought he was, and when she, herself, becomes infected, he makes it out to be her fault, and his true self is finally revealed. Fighting the disease, fighting her husband, trying to fight against the spread of the 'scale, Harper is a true hero and she owns this story. Populated with other strong characters, both good and bad, this story reflects an imagination with a broad scope and a penchant for suffering. Although, at times Hill's prose rambles, I never found myself bored or losing interest; only becoming more agitated, worried and excited about what was going to come next. Would Harper make it through this? What about the plucky survivors, both good and evil? What about her horrible husband? You'll have to read this book to find out!The Fireman was an epic tale, populated with characters you love and hate, highlighting what's both good and bad in society today. Somehow, though, I came out of the experience with a sense of hope and also a sense of excitement regarding what Joe Hill will do next. Highly recommended for fans of post- apocalyptic tales and fans of Joe Hill!*Thanks to the publisher and Edelweiss for providing a free e-ARC of The Fireman in exchange for an honest review. This is it!*"}, {"userName": "Matt", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "Joe Hill made quite the 'spark' with this novel, which garnered a significant following in 2016, culminating in winning one of the Goodreads awards for its genre. With curiosity piqued and a gap in my reading requirements, I chose to dive in while trying to steer clear of the ripples and spoilers that others have left around me. Harper Grayson is a school nurse with little of interest going on in her life, though the world is coming apart at the proverbial seams. People from every corner of the earth are developing what the medical profession has labelled draco incendia trychophyton, known in the vernacular as 'dragonscale'. It appears on the skin as a grey scaly rash and can progressively envelop more of the carrier's body, changing colour at times as well. Dragonscale is highly contagious, though no one seems sure how it passes from one human to another. What everyone has come to see is that carriers can show signs of billowing smoke from their hands and feet, like a small collection of dry kindling. As the carrier's illness develops, spontaneous combustion is also possible, though the general public has been given little knowledge of the events and this leaves them to turn against the infected. Carriers are pariahs and try to hide their plight, fearful of 'cremation crews', tasked to seeking to kill those who carry the condition before it can spread further. One such crew is headed by the Marlboro Man, who encapsulates the rugged cowboy and keeper of the peace while slaying the sick as quickly as he can locate them. Harper soon realises that she has been infected, which places an irreparable wedge between her and husband, Jakob. Even after he finds out Harper is expecting their first child, Jakob tries to banish her and does all he can to push added levels of isolation. Harper rages back and soon encounters a fireman-cum-pyromancer, John Rookwood, who has a small following of infected individuals. They lead her to an abandoned and secluded camp where other carriers are living. This camp, a collective of sorts, struggles with the daily worries around being hunted by 'cremation crews' and the inner struggle of any group seeking self-sustenance. Fractures within the group develop and soon Harper witnesses a mutiny, all while she tries to learn more about draco incendia trychophyton. Rookwood remains distanced from the group, though he and Harper share a strong connection and his insights are supported by a previous collective member who was murdered for his attempts to push back against the societal ostracism. While she learns how to tame the progress of dragonscale in a melodious manner, Harper has major hurdles ahead if she wants to survive, while the world is bent on killing those who differ too greatly. Hill does a fascinating job of developing this story on many levels and lures the reader in, be they interested in the story, the metaphors, or the microcosm found within the narrative. Well worth the hype it has received and should be high on the list of readers who need a little horror and entertainment any time of year.Hill has writing pulsing through his veins, with both parents highly acclaimed authors in their own rights. He does not try to grab hold of their coattails to be effective, carving out a niche all his own and remains highly successful in this venture. His writing does have some parallels to that of his father, perhaps in the oddities in which he places his characters, but there is a definite uniqueness in the flow and the tangents presented to the captivated reader. The invested reader will see this novel as being something other than a collection of sick individuals who are in hiding, finding parallels with the proverbial leper colony in which people are thrown when the general public is not aware or given sufficient information on which to base an educated decision. The struggles are not unique or off the wall, though Hill effectively creates a character base to lure the reader into significant sympathy. Additionally, Hill touches on the in-fighting of any isolated community as group and personal politics cloud the larger struggle, that of survival. Hill's ever-advancing narrative and swath of different characters provides the greatest Petri dish for effective political meltdown. Again, one might see this as a great microcosm of the larger human struggle for success, where those who are too alike tend to clash and forget the thread that ties them all together. I know I used to bemoan English teachers who asked students to look below the story to find these themes, but they seem so apparent and Hill develops these struggles so effortlessly that the reader cannot help but peer through the smoke and blazing to notice them. Hill does not shy away from generalities, perhaps painting the English as a potty-mouth group who curse so uniquely that North Americans could tear out a page from their verbal playbook. However, it has moments of humour, alongside a protagonist whose unusual obsession with Julie Andrews and her depiction of Mary Poppins keeps readers constantly shaking their heads. If this novel is anything like the other work that Hill has produced, I will be sure to rush forward to dive headlong into those, though my reading list is growing daily.Kudos, Mr. Hill for a wonderful way to start my 2017 reading journey. You offered a light at the end of the tunnel, though tossed in enough smoke and mirrors to keep me guessing.Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/"}, {"userName": "Arah-Lynda", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "By Jove, reading this was as much fun as a laundry basket full of curious kittens. It is a virtual treasure trove of pop culture references, a tip of the hat if you will to J.K. Rowling, George R.R. Martin and of course his father, plus many, many more, not the least of which is Mary Poppins. Be careful where you step as you will find yourself tripping over them during the course of your reading experience. Such fun!Okay so first the premise:A plague of sorts is sweeping across the civilized world. Its proper scientific name is Draco Incendia Trychophyton but it is more commonly referred to as Dragonscale. It is highly contagious, marking its victims with black and gold scroll like marks across their bodies before they eventually burst into flames and are devoured by fire. Once infected there does not appear to be a cure and no one is entirely sure how it is spread from one person to another causing wide spread panic and the inhumane treatment of those showing signs of infection.Harper Grayson, our protagonist, is a nurse working at a local hospital when she first meets The Fireman and assists him, against the odds and hospital protocol, in getting timely medical care to a young boy in his care suffering from abdominal distress. Shortly after finishing her stint at the hospital she learns that she is expecting. On the heels of this happy news Harper sees the tell tale marks of the Dragonscale upon her own body. Her husband is convinced that Harper brought this plague upon herself and no doubt him as well, as a result of her work at the hospital. He is incensed and things do not go well between them. Now Harper is running for her life and that of her unborn child. But The Fireman does not soon forget past kindnesses and steps in to rescue her from her murderous husband. The Fireman it would seem can control the fire burning beneath his Dragonscale and use it as a weapon against those that wish him and others harm. He delivers Harper safely to a backwoods summer camp called Camp Wynward, where the residents have found a ritual that keeps the flames of spontaneous combustion at bay. But the world around them is in chaos and there are Cremation Squads out there determined to stop this fiery spore by eliminating all those infected. You had a hold on meRight from the startA grip so tight I couldn't tear it apartMy nerves all jumpin' Actin' like a foolWell your kisses they burn But your heart stays coolThe BossIf you are a young aspiring writer and your father just happens to be Stephen King, well let’s just say those are some mighty big boots to fill. Joe Hill tackles this challenge head on and make no mistake he is getting better and better. If you are looking for an entertaining summer read that demands little, beyond suspension of belief, and delivers a few chuckles along the way, then by all means pick up this high octane thriller."}, {"userName": "Maciek", "userReviewDate": "Sep 04, 2016", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "Joe Hill's last novel, NOS4A2 was an engaging horror romp which lasted for more than seven hundred pages, but maintained to keep both tension and interest in the reader to the very end. In comparison, Hill's latest novel is completely unlike its predecessor, with whom it only shares its enormous length. To put it simply - The Fireman is an overly long, convoluted, uninteresting and ultimately very disappointing effort.At its heart, The Fireman is a post-apocalyptic novel, with a premise that has by now been done hundreds of times: the majority of humanity is inflicted by a ravaging disease, leaving only a small group of survivors trying to scrape by. This time humanity is afflicted by a disease which becomes known as Dragonscale - its symptoms include dark marks on the skin, which spread across the body and eventually cause the individual to literally erupt into flames and burn to death. Dragonscale spreads rapidly, and soon consumes millions of people - as well as the environment, causing uncontrollable forest fires and so on. Although the demise of humanity is not a new theme, you have to give it to The Fireman - it is probably the world's first novel about human extinction by spontaneous combustion.The problem with the book is that not much else about it is new, or even particularly interesting. As we read the The Fireman, we get the sense of crossing through familiar territory - one which has been done many times before, and much better so. Since every post-apocalyptic story requires a bunch of survivors, we find ourselves in a tight spot. Consider this - how does one escape a disease which literally consumes human bodies and turns them to ash? Easily - by learning how to not be unharmed by it. And not only that - it turns out that you can learn how to control the disease and use it to your advantage.That's right. The disease kills most of humanity, but luckily for a selected number of people - who happen to be the characters which the book focuses on - it can also provide handy superpowers. Joe Hill said at a panel that his book would be \"less like Matheson, and more like Crichton\" and cited Crichton's first novel, The Andromeda Strain as an example. The only link with Michael Crichton that I can find in this book is Joe Hill's attempt at quasi-scientific explanation of Dragonscale and how it affects human bodies - something which he later totally throws out of the window by essentially allowing several characters to overcome its malicious effect by their own feelings, as apparently this is all what it takes (and somehow we have to believe these same characters never thought about broadcasting their solution to the problem to the entire world, but then again if they did we would not have a book to read and review).As I mentioned, people in this book not only escape death by learning to coexist with a disease that should burn them to death, but also learn how to control it and use it to their advantage. This means that later in the book characters in the book are able to generate fire literally from their fingertips, control and shape it - throw fireballs and whatnot, or in case of one character create creatures made of fire. This is why the supposed inspiration by Michael Crichton was so puzzling - Crichton was a writer interested in science and technology, famed for his research and the ability to plausibly convey and explain his theories, and would not employ a purely fantastical cop-out as a solution to them. What made his books interesting was not his prose style , or the depth of his characters- he was a passable writer at best, and his characters are forgettable cardboard cutouts - or even in most cases the story itself, which usually consisted of little more than a bunch of frenetic action sequences. What made Crichton's novels so interesting were the ideas within them, which usually focused on mankind's technological progress and the way it affects our life and society. Usually, Crichton would have his characters engage in long discussions about the nature of what they were experiencing - its moral, ethical and scientific implications - and these formed the most interesting part of the book; it is especially evident in books such as Sphere, which is probably his best novel.This is precisely what The Fireman lacks - any kind of complexity, something to chew on, somethink would give readers a lot to think about. This is a novel which does not give any answers except the most obvious ones, and does not ask any questions. Its characters are very forgettable and barely, and there is no real reason to care about any of them. Even the eponymous character, en English guy who wears a fireman's suit and is henceforth nicknamed \"The Fireman\" is little more than a convenient plot device to rescue our protagonists in their moments of trouble - he rarely makes an appearance throughout most of the book until the very end, and spends most of his time hiding away in a remote cabin. Interactions between these characters are boring and simply unimaginative, including what is probably a most ham-fisted romantic relationship written in recent fiction. Poorly designed characters who do not grow as people hurt the book twice, as they make it hard for us to care about the story, since it is difficult to care for what these uninteresting people experience. Because why should we?Not that the story itself is complex and interesting; it really is not, and the vast majority of it reminds me of a very (pardon the pun) watered down version of The Stand. It is darkly ironic that Joe Hill began writing under a pseudonym because he wanted to escape his father's shadow, yet in this book he falls completely under it. The Fireman features all of the classic Stephen King tropes - the constant foreshadowing at the end of the chapter (in the vein of \"it was a good plan, until everything blew up\", \"he never saw her again), many references to popular culture, endless references to music that the author likes (which sound completely unbelievable when put into minds of the characters many years younger - how many 26 year olds think about the difference between The Rolling Stones and the Beatles?), a crazed sociopath ex-husband/lover, crazy religious woman leader who seems to find her way here from The Mist...there is even an unsympathetic character named Harold who is almost a carbon copy of his namesake from The Stand, not to mention a mute character named Nick who is the epitome of innocence and good, just like the mute Nick from The Stand. All this can be explained as a homage or an Easter egg, of course, but if the book features little else than homages and Easter eggs, what is left? Not much.Yes, despite all this, The Fireman is the longest of all of Joe Hill's novels so far, and perhaps his most disappointing ones. Its length is in no way justified, and feels padded to the bone; I do not think I exaggerate when I say that you could skip entire chapters and not miss out on much, if anything. It reads well and fast, since Joe Hill is a good and able writer, but there is little point in reading most of it. There is nothing enlightening or innovative in this book; neither the story or the characters are deep enough to become memorable and worth revisiting. For a novel focused on the element of fire, it inexplicably lacks the spark to keep the flame going; and it eventually goes out, quietly and without much smoke. I have given the book two stars only because of my sympathy for its author, and because it is not completely terrible - but it definitely is uninspired, unimaginative, uninteresting and definitely unworthy of your time."}, {"userName": "Paul O'Neill", "userReviewDate": "Oct 23, 2015", "userURL": "http://www.goodreads.com/user/show/17331573-paul-o-neill", "userReview": "Awesome book. I expect no less from one of my favourite authorsWhilst entirely different to his other works, this still hits the mark. Less of his trademark horror (although he does a good job of creating terror and suspense when required) but not quite the stereotypical post-apocalyptic story we've all become used to. The conditions that cause this story to unfold are all very well thought out. Harper, our main character, has to be up there with one of the best characters I've read (I was going to qualify that as one of the best female characters I've ever read but I think she's one of the best overall, male, female, dragons, robot, all). Hill's writing style is perfect in my view. Very easy to digest, never any long waffling exposition or needless information. The story flows very nicely and chapter size is perfect. Highly recommended for all Hill fans. I did, however, have a couple of very minor gripes with it. Not nearly enough to knock it down a star but two things that irritated me (I'm nitpicking but thought they are worth calling out as it would be interesting to find out if anyone feels the same). 1 - Comparisons to the Stand were always going to happen. His dad wrote my favourite book. Whilst I think it's cool that Hill gave minor nods to his dad's works in NOS4R2 (and maybe others I can't remember), he did it a bit too much here. In the Fireman we have:A deaf person called NickA person called Harold Cross - who keeps a diaryA FrannieA pregnancyAnd probably a few others I can't quite rememberIt's not a huge problem, I just didn't want to be reminded of the greatest post apocalyptic book of all time whilst reading a post apocalyptic book. 2 - This one is a bigger problem and one I want to get your thought on, as King does it in a few of his novels and I'm sure there are others. I refer to a spoiler sentence right at the end of a chapter. As in:but that was the last time he was seen alivebut when they returned, everything will have changed foreverEtc.Anybody else get really annoyed by this? You're going to kill someone in the next chapter so let me feel the shock of it happening as it happens in the story. Don't take the impact away from me in a sentence. To be fair, the Fireman isn't nearly as bad for this. It does it a few times but it still irks me. Minor moans aside, you should read this and Hill remains on my automatic buy list."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "[ - the community survives and thrives even with Dragonscale when they are united, but sometimes they are united for the wrong purpose... I did find myself thinking about the similarities in politics and religion in our current society. (hide spoiler)]"}, {"userName": "Chris ", "userReviewDate": "Dec 22, 2016", "userURL": "http://www.goodreads.com/user/show/1956959-chris", "userReview": "So I've read all of Joe Hill's books (other than some rare stories and some of the comics), and of course when The Fireman came out I had to get a copy immediately. It did take me a few months to get to it. I didn't know what it was about, except that it had something to do with a fireman. But I trust Joe Hill and he hasn't let me down yet.So right away we were seeing that something was very wrong. The apocalypse was nigh, as we learned pretty early on that some dreaded disease was sweeping across America and Canada. Something called Dragonscale, which caused scaly marks to form on the skin. Sometimes they would smoke, and the victims would quite frequently burst into spontaneous infernos.The pacing of this book is a comfortable, slow burn. It's really easy to sink in and become attached to the characters and their situations. It reminds me in several places of Stephen King's The Stand, though focused on a smaller group of point of view characters. I often suspected that these similarities were intentional as homage to King's book (and other works), as well as to other apocalyptic themed authors and stories. I've found that it's very difficult to write a review for a book like this, one that packs so much heat in just over 700 pages. I don't want to give away any spoilers, so it's hard to go into the story that much. I will say that I love the main character, Harper, as she adapts to the changes in her life and the world she's forced to survive in. That being said, her story and that of the supporting characters, is highly recommended. As the winter sinks in, it might even help warm things up for a bit..."}, {"userName": "Emma", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "Joe Hill, what have you gone and done?! I have been waiting a long time for your new book to be published and then you went and made it so good that I couldn't put it down and now I've finished it! That was quite a trip.Joe Hill has total mastery of this story. His writing is witty and his cultural referencing is spot on. There are many references to Harry Potter (he must be a child of the generation who grew up reading those volumes) and to his dad's works, John Grisham and of course Mary Poppins.'Just because you've read John Grisham, it doesn't make you a Supreme Court Justice'.Hill has created a cast of flawed and fascinating individuals and managed to come up with a main character, Harper, who was perfectly balanced : while often compared to and quoting Mary Poppins and Julie Andrews, she still managed to avoid being a Mary Poppins character.And as a study of people and the psychology of human kind, we see the Lord of the Flies-esque take on how we behave under peer group pressure and how we thrive on approval, whatever the cost. 'Law is whoever is holding the nightstick' some one observes at one point.Hill has a great way of ending most chapters that leads you right on to the next one and the next. until you end up finishing it too soon and having a long old wait for the next book by this author. Which is where I came in with this review and a good place to finish!"}, {"userName": "Jay", "userReviewDate": "Feb 17, 2016", "userURL": "http://www.goodreads.com/user/show/10633920-jay", "userReview": "[WHYYYYYY DID HE HAVE TO DIIIIIEEEEEEEEE? WHY. WHY. WHY. WHY. WHY. I actually shed a tear or two. WHHHHHYYYYYYYYYY  (hide spoiler)]"}, {"userName": "Will M.", "userReviewDate": "Jan 11, 2016", "userURL": "http://www.goodreads.com/user/show/20408288-will-m", "userReview": "I just realized that it took me almost a month to finish this novel. I read the whole ASOIF series in a span of about 25 days, meaning about 5 days each for a 1000+ page novel. This novel is only 700+ pages long but I didn't finish it soon enough. I can blame my busy schedule or my occasional lack of interest to read, but honestly, the novel has a lot of weak spots.I read NOS4R2 by the same author and I didn't like the book that much. When I read about this book though, I was completely stoked and bought the novel as soon as I saw it at my local bookstore. I read it the same day that I bought it, but sadly it didn't take me that fast to finish it. While I enjoyed this a lot more than NOS4R2, I'm still honestly a bit disappointed. Hill still hasn't wow-ed me, but hopefully the third novel would be the charm. The novel has a lot of fillers and it could've been 200 pages shorter. The first 1/3 of the novel really had me at the edge of my seat, but then the middle slacked off. Then the middle started to become interesting, then it started to slack off again. Then it became interesting again not until about 75% in the novel. The novel is highly inconsistent, and sadly that really affected my reading mood.While the plot is inconsistent as hell, thankfully the characters made up for that huge flaw. I really liked almost all of them. I hated Allie at first, but I learned to like her in the end. Harper is your typical neutral protagonist who tries to be a hero, but doesn't really qualify to be one. John is honestly both the strong and weak point when it comes to the characters. While he is interesting and plays a huge role in the novel, he is as inconsistent as the plot. The antagonists are also interesting, especially Jakob. Carol on the other hand really annoyed me. I wanted her gone a few paragraphs in. The Sci-Fi aspect of the novel really stood out in my opinion. I understood most of the things that Hill incorporated because I studied mycology just a few months ago. I know that this new fungal species that Hill created is clearly fictional, it still entertained me. The apocalyptic aspect of the novel resembles some novels I've read before, but overall for me it can be considered original. It's not one of those annoying sci-fi/apocalypse that are really predictable and laughable.I was really confused as to whether this novel deserves a 3 or 4 star rating, but I had already established that it clearly deserves a 3.5 rating. This is one of the reason why Goodreads really needs to add the half star option. I opted to rate this novel 4 stars because while there are a bunch of bad parts, the entire novel is really interesting and commendable. The characters would leave you yearning for more, and honestly the ending did not satisfy my curiosity. A bunch of short stories might help with my curiosity, but it seems like Hill wanted this to be a standalone. I'm not particularly happy with the ending because it has a lot of loopholes that Hill didn't really fix. I think maybe he opted for an open-ended novel, but I'm not happy with it.If you're a Sci-Fi fan and really likes novels that heavily depend on the premise and the characters to make it interesting, then this is for you. I myself forgave the author for the boring parts, and I'm sure that you guys can too. I know it seems that a 4 star rating is too high for a novel that I didn't really enjoy, I'm honestly still recommending this. It's too long, but still fun overall."}, {"userName": "Emma", "userReviewDate": "Mar 30, 2016", "userURL": "http://www.goodreads.com/user/show/28602001-emma", "userReview": "It took me two attempts to read this. That Hill can write is a given. But this book doesn't have any heart. It's not enough of anything to make it memorable. I found myself greeting the ever more depressing and dangerous paths of the plot with little more than a shrug. At the final denouement, I honestly couldn't care less who lived or died. Perhaps because there was little surprise in it, the format of the book was well trodden. Definite points for the creation of Dragonscale, now that was a fun change to the usual dystopian fare. I can see why people will love it, but it's far from my favourite of his books. It was too long, too derivative, and too unremarkable outside the one main hook. Still, I felt the same way about The Passage, which everybody else seemed to love, so what the hell do I know? In any case, thanks to Orion/Gollancz and Netgalley for this copy in exchange for an honest review."}, {"userName": "Zoeytron", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "[The character name of Harold Cross must certainly be a big old tip o' the hat to Harold Lauder and Nadine Cross in The Stand. Loved it! (hide spoiler)]"}, {"userName": "Phrynne", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "Now this is what I call a GOOD book. In fact it is a brilliant book especially if, like me, you have a liking for dystopian stories. You could say that it is yet another story in which the world is being ravaged by a plague of some kind, which is killing people off in their millions. That is exactly what happens but the \"plague\" in this case is fresh from Joe Hill's vivid imagination and it is totally original and very cleverly done.The fireman of the title is a wonderful character - an ordinary man with super powers who does what he can to save his little bit of the world or at least some of the people in it. I loved Harper and Nick and Allie and even Sarah who only really has one scene but it is an amazing oneThe book is long but I never felt that it faltered. It is a great story with masses of action and pages which practically turn themselves. Loved it."}, {"userName": "Nikoleta", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/13362307-nikoleta", "userReview": "Δεν το περίμενα να μου αρέσει τόσο αλλά το κατάφερε! Ενδιαφέρουσα υπόθεση, αναπάντεχα γυρίσματα στην πλοκή, καλοφτιαγμένοι χαρακτήρες και ωραία αφήγηση!Η πρώτη μου επαφή με τον Hill δεν θα μπορούσε να είναι καλύτερη!"}, {"userName": "Stepheny", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/7091879-stepheny", "userReview": "Holy fuck I finished it. Let’s talk about the Fireman, shall we? It all started with an email from Cemetery Dance Publications. It went a little something like this- Hey, Stepheny! How are you? We have this WONDERFUL deal! We know how much you love spending money on books and we are here to help you do just that! There’s this author, maybe you’ve heard of him? His name is Joe Hill! I think to myself- Go on….It continues. Well! Joe has this new book coming out. You enjoyed Heart Shaped Box. You LOVED Horns. You really liked N0S4A2. We just KNOW this will be his absolute best book yet! The Fireman is going to be the hottest book on the market and we are offering YOU an autographed copy for only $25! *craps pants*BUT wait, there’s more! For only $10 more we will offer you the beautiful slipcover too! And we will ship it all in one for you!!Me- how could I possibly pass that up?! Obviously I couldn’t. I ended up with a kindle copy because the special slipcase meant delayed shipment of the actual book. And when I started it, I was hooked. But what started out with a bang quickly died.I loved the idea behind the “plague” that hits: Dragonscale. It causes these beautiful golden markings to appear all over the affected’s body. Unfortunately, those cause you to burn up. Literally. Your body sets on fire. But no one really knows why. They don’t know if it is because you get emotionally worked up causing these markings to ignite. Or if it a time-related process. Or age. Or any other factor. The unknown causes chaos. The most fun aspect of all of this is that it sends EVERYONE into a frenzied panic. We have people killing themselves when they find out they have it. We have people killing each other for having it. We have people killing each other for NOT having it. One of my favorite parts of plague-related books is watching society come completely unhinged. People freaking the fuck out and everyone killing each other is just downright fun! It’s also the reality of the world and how people work.Unfortunately this was about the only aspect of the book I DID like. The characters felt one-dimensional and I felt like Joe forced too much of the storyline. The beginning was fantastic. It’s when Harper gets to the refugee camp that things start to get lame…not just a little lame, but a LOT lame. There was potential here for it to be great, but instead it was dragged out, overdone and really cheesy. I pretty much checked out for the middle of this book…At least 300 pages of nonsense that was irrelevant to the overall storyline. Had all of this either been done better or cut out it would have been a masterpiece. The ending, was pretty damn good though, I must say. The fate of the refugee camp proved as irrelevant as the rest of its storyline. But if we fast forward to the outcome of our little band of heroes we have struck gold. It was fast-paced, intense, gripping and so well-written I wondered what the fuck happened to Joe Hill in the middle of this book. I LOVED the ending. Loved it. One thing that I’ve always believed as a writer is that the story tells itself. When you’re struggling with a storyline it is because you are trying too hard to sway it one way or the other when it wants to go in a completely different direction. I think that’s what happened with Joe. In the middle it was like he lost touch with the story that was trying to be told. He was forcing it too much and the story suffered because of it. Overall I was very disappointed in this book. And what makes me even sadder is knowing I have an autographed copy of it! Granted, I spent $35 on it, so not a HUGE loss, but I’d rather have an autographed copy of Horns. Joe, I’ll be keeping your father in my basement until you get it right."}, {"userName": "Carol", "userReviewDate": "Jun 07, 2016", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "Conflicted…The Hook - Back in 2007 I read Heart-Shaped Box after learning Joe Hill was the son of the infamous Stephen King. I was pleasantly surprised that I really liked it and more surprised that Hill seemed to have talent. Being a fan of most stories involving fire and hearing all the buzz regarding Hill’s The Fireman it seemed just the right time to give Joe another shot. The Line -  \"So much of what was best in life went unnoticed in the moments you had it.\"The Sinker – Let me repeat that. Conflicted. Although I loved the premise of The Fireman in the end it just did not live up to the expectations I had set for myself. Don’t get me wrong. The writing is good, the characters are interesting studies and well drawn. Even at 700+ pages I was able to whiz through this in just a few days. What didn’t work for me were the inconsistent personalities of said characters. In the beginning the protagonist, Harper, a nurse, is working her tail off in a hospital trying to save victims/patients who have exhibited symptoms of skin disease catchingly called Dragonscale. Though Harper is young, she exhibits a seasoned maturity and dedication to helping the ill. She’s married to Jakob who at least initially seems the perfect husband. When the facility Harper works in goes up in flames, a direct outcome of the sick patients, its Jakob who’s her rock and comes to meet her to assure she is all right. Neither of them has been infected with Dragonscale at this point. Both seemingly very adult-like say and do things in the future that tested credibility for me. At one point a character mentions that they have potty mouths. I wish I had highlighted that passage. There are lots of potty mouths on these pages. This might be all right for the younger characters, those that you’d expect to have a problem with childish vulgarities but the adults seemed like they’d be beyond this, especially in light of the severity of their circumstances. Especially Harper. Some of the things she says seemed so out of place it just downright rankled me. In addition some of the puns were just plain awful. I was able to keep one-step a head meaning there were few surprises equals predictable. References to A Spoon Full of Sugar didn’t quite help The Fireman go down and Harper’s turn from an intelligent, smart woman to Mary Poppins and then some mean, swearing bitch seemed out of character, even as choices dwindle. One review likens the downfall of the suffering group as morality going south. Maybe? Suffice it say that The Fireman will not be my favorite Joe Hill read but I won’t give up on him just yet. I enjoyed the building of its plague like apocalyptic structure, the use of fire throughout, the plotting of the struggle to survive and how the book ended. Let me add my own sick pun.The Fireman did not set my world on fire."}, {"userName": "Matthew", "userReviewDate": "Oct 21, 2015", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "[except maybe during the final showdown with Jacob when the spirit of his dead wife joined in the battle  (hide spoiler)]"}, {"userName": "Erin", "userReviewDate": "Jun 20, 2016", "userURL": "http://www.goodreads.com/user/show/32799998-erin", "userReview": "First of all I want to start by saying that the title The Fireman is misleading. I was expecting a book about a mysterious fireman in the mist of a epidemic, but no the fireman wasn't mysterious at all. With that part out of the way this book is why I wouldn't want to survive the apocalypse. The Fireman was about the breakdown of civilization in the aftermath of a global plague. It took me sometime to get into but once it got me it didn't let go. Once I got over the fact it wasn't the type of book I thought it was I really liked it. Who should read it is anyone who likes books about plagues apocalypses or lovers of Joe Hill books."}], "description": "From the award-winning, New York Times bestselling author of NOS4A2 and Heart-Shaped Box comes a chilling novel about a worldwide pandemic of spontaneous combustion that threatens to reduce civilization to ashes and a band of improbable heroes who battle to save it, led by one powerful and enigmatic man known as the Fireman.The fireman is coming. Stay cool.No one knows exactly when it began or where it originated. A terrifying new plague is spreading like wildfire across the country, striking cities one by one: Boston, Detroit, Seattle. The doctors call it Draco Incendia Trychophyton. To everyone else it’s Dragonscale, a highly contagious, deadly spore that marks its hosts with beautiful black and gold marks across their bodies—before causing them to burst into flames. Millions are infected; blazes erupt everywhere. There is no antidote. No one is safe.Harper Grayson, a compassionate, dedicated nurse as pragmatic as Mary Poppins, treated hundreds of infected patients before her hospital burned to the ground. Now she’s discovered the telltale gold-flecked marks on her skin. When the outbreak first began, she and her husband, Jakob, had made a pact: they would take matters into their own hands if they became infected. To Jakob’s dismay, Harper wants to live—at least until the fetus she is carrying comes to term. At the hospital, she witnessed infected mothers give birth to healthy babies and believes hers will be fine too. . . if she can live long enough to deliver the child.Convinced that his do-gooding wife has made him sick, Jakob becomes unhinged, and eventually abandons her as their placid New England community collapses in terror. The chaos gives rise to ruthless Cremation Squads—armed, self-appointed posses roaming the streets and woods to exterminate those who they believe carry the spore. But Harper isn’t as alone as she fears: a mysterious and compelling stranger she briefly met at the hospital, a man in a dirty yellow fire fighter’s jacket, carrying a hooked iron bar, straddles the abyss between insanity and death. Known as The Fireman, he strolls the ruins of New Hampshire, a madman afflicted with Dragonscale who has learned to control the fire within himself, using it as a shield to protect the hunted . . . and as a weapon to avenge the wronged.In the desperate season to come, as the world burns out of control, Harper must learn the Fireman’s secrets before her life—and that of her unborn child—goes up in smoke.", "title": "The Fireman", "url": "http://www.goodreads.com/book/show/29875363-the-fireman", "average": 3.9, "cover": "https://images.gr-assets.com/books/1478683499l/29875363.jpg", "reviews": 5582, "authors": [{"url": "https://www.goodreads.com/author/show/88506.Joe_Hill", "name": "Joe Hill"}], "type": ["Horror", "Fiction", "Science Fiction", "Fantasy", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/29875363-the-fireman", "http://www.goodreads.com/book/show/25816688-the-fireman", "http://www.goodreads.com/book/show/20927079-the-fireman", "http://www.goodreads.com/book/show/26222107-the-fireman", "http://www.goodreads.com/book/show/26029517-the-fireman", "http://www.goodreads.com/book/show/25994058-the-fireman", "http://www.goodreads.com/book/show/29100336-the-fireman", "http://www.goodreads.com/book/show/34454175", "http://www.goodreads.com/book/show/26029560-the-fireman", "http://www.goodreads.com/book/show/6587879-horns", "http://www.goodreads.com/book/show/153025.Heart_Shaped_Box", "http://www.goodreads.com/book/show/15729539-nos4a2", "http://www.goodreads.com/book/show/3217221-locke-key-vol-1", "http://www.goodreads.com/book/show/6120349-locke-key-vol-2", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}