{"ratings": 21250, "userreviews": [{"userName": "Sonky", "userReviewDate": "Aug 24, 2007", "userURL": "http://www.goodreads.com/user/show/217017-sonky", "userReview": "This book is a disgusting example of Orientalism in action in the educational system of the United States during the 20th Century. The cover alone should warn you of the prejudicial and stereotyped contents.I love this book dearly."}, {"userName": "Morgan Hale", "userReviewDate": "Mar 13, 2012", "userURL": "http://www.goodreads.com/user/show/4797970-morgan-hale", "userReview": "This book was given to my uncle, when he was a kid, and then passed on to me. I absolutely loved it. I remember reading it time and time again and was actually surprised when I saw so many complaints about it.The first complaint is about racism, specifically the charge that the book is suggesting all Chinese people look the same. Now, I've read it as a child and I've read it as an adult, and I was never given that impression. The only characters the book says look alike are the five brothers. I always just assumed they were quintuplets, so of course they looked the same. If you changed the ethnicity from Chinese to Australian, this book would not give you the impression that all Australians look the same. While I understand this to be a culturally sensitive point, I think, in this case, more is being read into the story than was intended.The second complaint is about appropriateness for children. As an adult, I can say that this book had no adverse effects on me. I'm college educated, married, employed, have no history of drug or alcohol abuse, and no fixation on death. Despite the fact that a death does occur in this story and there's multiple representations of attempted executions, I turned out better than fine (as did my uncle, who read it before me). There's no reason to believe that kids today won't handle these issues just as well. If it makes your kid ask questions, fine. Answer them. That's what a parent does. For my part, I didn't have any questions about death or ethics when I read it as a kid. I just thought it was a funny story and I tried to figure out which of the brother's powers I would most like to have.If you can handle all that, then I'd definitely recommend this book.I do have a question, though, for those more knowledgable about it than I am. My edition of the book has the same image shown on this site, but the cover is red instead of white. Does anybody know why this is? Is it merely an older version? I haven't seen any images of a red cover anywhere else."}, {"userName": "E", "userReviewDate": "Jan 09, 2008", "userURL": "http://www.goodreads.com/user/show/472694-e", "userReview": "It's a classic, but it was way too upsetting for me when I read it in kindergarten and I never liked it after that. (The death of a child and four attempts at execution? I know the Grimms' fairy tales aren't much better, but sheesh... ) Like many, I'm also not too keen on the illustrations. It is SUCH an old racist stereotype to portray all Chinese as looking the same. The pictures - true products of their time - don't help kill that misconception. Of course it's absurd to think that every kid will automatically become racist from reading this, but it's also naive to think such images unchecked have no influence. When an eight year-old kid in my classroom pulled his eyes into a slant and sang, \"I'm a ching-chong-Chineseman!\" while his Vietnamese classmate sitting two seats away from him turned red, I know he didn't come up with that stereotype on his own.I don't think the book should be banned, but I don't think it should be read unsurpervised either. People like my father are very sentimental about the book since they have fond childhood memories of reading it - just as many progressive people have fond memories of Little Black Sambo and Topsy. Nevertheless, if it's going to be read to young children, I think it absolutely fair to alter the illustrations in modern publications to be less overtly caricaturing, as seen in the reproduction of Little Black Sambo into Little Babaji. The original versions can and should be preserved for children old enough to have a discussion about our bleak history of racism."}, {"userName": "Jon williams", "userReviewDate": "Jul 11, 2007", "userURL": "http://www.goodreads.com/user/show/144925-jon-williams", "userReview": "This was my favorite book in kindergarten. It may even be the book responsible for motivating me to become a reader. I loved the story and I love reading it to my kids now."}, {"userName": "Stephen", "userReviewDate": "Jul 28, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "3.0 stars. I remember reading this as a kid and liking it because it was unlike most of the other stories I was reading. A fun little Children's book."}, {"userName": "Rachel", "userReviewDate": "Nov 05, 2012", "userURL": "http://www.goodreads.com/user/show/2439479-rachel", "userReview": "According to my mom, when I was very young, I used to come into the bathroom every single night while she was trying to take a bath and tell her the story of The Five Chinese Brothers. Evidently, I was quite annoying. But not only do I not remember doing this, I also didn't remember the story at all. Even though as an adult I've reread most of my childhood favorites, this is one I never sought out, probably because I've been hearing for years that it's a little racist. Then today, I discovered a Little Free Library (which incidentally is a bizarre and wonderful concept and everyone needs to get one in their neighborhood) a couple of blocks from my house. I looked inside and there was a copy of The Five Chinese Brothers! I might have squealed a little.So I brought it home and read it and I still do not remember this book at all. I didn't find it racist, although I suppose if someone wanted to make something out of, \"once upon a time there were Five Chinese Brothers and they all looked exactly alike,\" one could, but I don't, so let's not. It's a pretty dark story though. The first brother takes a kid fishing and the kid gets killed, so the first brother is sentenced to death, but because each brother has a physical oddity that makes him immune to a particular method of execution (and because they all look alike), each time the town changes the method, a different brother stands in. So my two thoughts on this book are, first, that it's a lot of attempted killing for a kid's book, although no worse than Hansel and Gretel or the Wicked Witch of the West, so I'm sure if you let your kids read it, they won't end up warped. And second, it's only about 500 words long, so I really didn't need to bring it home; I could have just stood on the sidewalk and read it."}, {"userName": "Jon(athan) Nakapalau", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/58774673-jon-athan-nakapalau", "userReview": "Every team is a group...but every group is not a team - the five Chinese brothers work as a team and accomplish more than a group could. Great book for a child just starting to participate in team sports."}, {"userName": "Shiela Chan", "userReviewDate": "Oct 10, 2012", "userURL": "http://www.goodreads.com/user/show/5716589-shiela-chan", "userReview": "(In the Phils) Remember when Nido powdered milk gave away stuff when you purchase the huge can? There was a time when the freebies were collection of short stories in little pamphlets. I was estatic! Literally begged my mom to keep buying milk to get my little hands on 'em (even if I'm lactose intolerant - stomach discomforts for the price of imagination). And I didn't regret it even once. This story is one of my beloved fairy tales.It starts like this. There were 5 chinese brothers and they look exactly alike. One had the power to swallow an ocean. I'll stop right here... This statement blew my little mind! I can still remember how I felt at that time when I read this.Books that withstand the test of time, retain that indescribable giddy sensation you felt when you immersed into its world are those that unquestionably deserves to be rated 5 stars. (at least for me)"}, {"userName": "Stef", "userReviewDate": "May 11, 2014", "userURL": "http://www.goodreads.com/user/show/31286508-stef", "userReview": "This book was first published in 1938 by an American author and is based on a well-known Chinese folk-tale. It tells the story of five identical brothers, each of whom has a specific and unusual ability. One can hold the sea in his mouth, one has an iron neck, one can stretch his legs, one can survive fire and one can hold his breath forever. These abilities are all put to the test when one of the brothers is sentenced to death for the accidental drowning of a small boy who died because he failed to keep a promise he made. Each of the brothers survives a different form of execution and are eventually pardoned. The illustrations have been considered controversial in contributing to a stereotyped view of the Chinese. Similarly, the story has been criticised for being macabre - the forms of execution include beheading, suffocation, drowning and being burned alive! However, the story has a clear moral to it and is fundamentally concerned with loyalty, trust and keeping one's word. The illustrations have a cartoon like quality to them and a simplicity that reinforces the moral of the story. The story is vividly told and the narrative is enhanced by the illustations which effectively tell the story in pictures. This is an unusual book which was out of print for a number of years and may be too much for sensitive readers but the story is compelling and stays in the imagination. It would be suitable for children aged from four upwards."}, {"userName": "R.", "userReviewDate": "Dec 04, 2007", "userURL": "http://www.goodreads.com/user/show/184928-r", "userReview": "The freakiest illustration was the brother who swallowed the ocean. And why didn't he just breathe through his nostrils instead of killing the little boy? In the same league of cruel Oriental childrens stories as the, ah, filmstrip Rikki Tikki Tembo No Sarembo Chari Bari Ruchi Pip Berry Pembo.Speaking of which, back when SNL was good (the Charles Rocket years) there was a oneshot character named Filmstrip Man who spoke in that...that style. Beep.Kah-lick."}, {"userName": "Sincerae", "userReviewDate": "Feb 07, 2014", "userURL": "http://www.goodreads.com/user/show/6017923-sincerae", "userReview": "I read this book in Colliers Junior Classics when I was child. Today such a book would probably be considered politically incorrect for the postmodern classroom. I enjoyed it when I read it in my childhood and thought it had great adventure and humor. However, I don't know what my impressions would be of it today. I wonder how Chinese people would perceive it. That would be more my concern."}, {"userName": "Rebecca", "userReviewDate": "Sep 02, 2007", "userURL": "http://www.goodreads.com/user/show/333714-rebecca", "userReview": "Absolutely one of my favorite books as a kid. I took it out from the library over and over again. When I was a teenager and my brother was 4 or 5, I started taking it out again to read to him. An entertaining story of 5 brothers and their special abilities, and how they used them to help each other."}, {"userName": "Amy", "userReviewDate": "Dec 30, 2012", "userURL": "http://www.goodreads.com/user/show/4756327-amy", "userReview": "3.5 stars. I read The Five Chinese Brothers to my niece and nephew last night. It's a book that my husband read as a child, and so I thought I'd give it a try on the kids. The story is violent, I won't lie. A kid drowns and The First Chinese Brother in this story is held responsible for the kid's death. He's arrested, tried, and ancient Chinese justice is meted out to this brother (i.e., he's sentenced to death, and the method in which that sentence is to be carried out is grisly). Hijinks ensue, and basically children are treated to a story in which the five Chinese Brothers thwart four grusome attempts to carry out the death sentence. Yeah, it's lovely bedtime fare.BUT, although violent, and kind of repetitious, the story is good. My niece especially thought this book was great--she kind of liked the shock value, and she liked trying to figure out how the brothers were going to get around this punishment. My nepehw was drawn in to the story and he certainly listened, but when we finished reading it he was, \"still trying to decide\" if he liked the story or not. It's probably a little much for little kids--we just balanced this out by reading Dragons Love Tacos again. The illustrations aren't all that attractive, but the kids didn't really seem put off by them. I think that they kind of liked the fact that this story was not warm and fuzzy, and I think that made the story all that more interesting and intriguing for them. Still, it's not one that I'll probably read to them again any time soon, and certainly not before bed.UPDATE: After discussing this book with my friend Brandy, I realize that I don't think this book warrants a 3.5 star rating! The violence was intense, the illustrations were unattractive on multiple levels, the story could be interpreted as having racist undertones, and it centers on the brothers evading justice. Thank you for talking to me about this book, Brandy! It really helped me do a better job of evaluating this book!"}, {"userName": "Jennifer", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/20825315-jennifer", "userReview": "It is absolutely no secret I am pretty obsessed with China, I just got back from Beijing and I can't help but want to read anything set in China. This is an older book and you know kinda disturbing as it is a children's book. It is pretty much five brother's trying to avoid an execution. Dark stuff right?Yeah I loved every page. Not sure what that says about me. The story is fantastic and I do think it is a great book kids should read though as it teaches about Team work and the importance of listening to people so you don't get killed seriously. Most rules exist for reason and kids need to listen anyway I digress. I enjoyed this very quick children's book and I think it is certainly worth reading as it does teach a lot of basic lessons I do think some kids are lacking. If I ever have a kid I will be ok with he/she/whatever gender they choose reading this."}, {"userName": "Chris Torok", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/40693174-chris-torok", "userReview": "The people who complain about the \"intense violence\" must be either very naive and easily influenced by a children's book or just plain stupid. Violence should not be the highlight of the story. Stories are not about face value. You should learn something from the book as it is useful as a tool. As for racial undertones. I don't think that word means what you think it means. Declaring that 5 brothers look the same, regardless of ethnicity, does not declare racism. That is just absurd. Even saying that 5 Chinese people look the same is not racist. In no way, shape or form does that say that one race is better than another. The only way it can be construed as racist if by bringing ones own prejudices to the book. Then you become the racist, not the illustrator. Great book. Loved it. I will definitely read it to my children."}, {"userName": "Beverly", "userReviewDate": "Oct 03, 2013", "userURL": "http://www.goodreads.com/user/show/2696011-beverly", "userReview": "If I am not mistaken, I remember first seeing this book on the Captain Kangaroo show. His show was great for advocating reading to children. While dated (and some claim stereotypical), it is still a good story about overcoming overwhelming odds through trickery and deceit. But the first brother wasn't really guilty of the crime he was to be executed for anyway."}, {"userName": "Shanna", "userReviewDate": "Oct 12, 2007", "userURL": "http://www.goodreads.com/user/show/409992-shanna", "userReview": "The Five Chinese Brothers, is a trickster tale where one brother gets in some trouble and the rest of them use their special abilities to help him get out of it. A good book for problem-solving lessons. I used this one to go along with math trail blazers unit on graphing."}, {"userName": "Robin", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/5223435-robin", "userReview": "One of the best read-aloud stories for primary students, despite its racist reputation. a great lead-in to discussions about responsibility and justice. May also be used with middle schoolers to discuss prejudice and racism in literature, as well as banned books."}, {"userName": "Laura", "userReviewDate": "Oct 29, 2013", "userURL": "http://www.goodreads.com/user/show/11283068-laura", "userReview": "I love this book, I don't care what anyone says about it."}, {"userName": "Toni", "userReviewDate": "Sep 25, 2011", "userURL": "http://www.goodreads.com/user/show/3163512-toni", "userReview": "The actual story begins with the first Chinese brother going out to fish, he brings with him a young boy from town who has begged repeatedly to go out with him. Before the fishing begins the first Chinese brother reminds the boy that he must obey his hand signals and return to shore when he calls him back. He then proceeds to bend over and draw the entire ocean into his mouth, revealing the ocean floor. The young boy runs about happily collecting stones and other treasures. He sees but chooses to ignore the Chinese brother frantically calling him back to the safety of the shore until the ocean waters burst from his mouth and the little boy disappears. When he returns to town alone, the first Chinese brother is arrested, tried, convicted and sentenced to death for his unnamed but presumed crime of murder. Before his execution by beheading is to be carried out, the first Chinese brother asks permission to go home to say goodbye to his mother, which the judge grants. The second Chinese brother, with the iron neck, returns in his place and the executioner is unable to carry out the beheading. And so continues the story with each brother taking the place of the previous until the judge finally declares after four failed attempts at execution that he must be an innocent man. I remember loving this story as a child, but as an adult, not so much. The Five Chinese Brothers is definitely not for everyone. There are a few who may truly be offended by the depiction of the Chinese characters, who all look identical. The illustrations of the chinese in the novel are all in black, white and yellow. This keys in on a cultural stereotype that all chinese look alike, and that their skin is yellow in color."}, {"userName": "Miya Yin", "userReviewDate": "Sep 20, 2016", "userURL": "http://www.goodreads.com/user/show/59185194-miya-yin", "userReview": "Basing on a well-known Chinese folktale, the story talks about five Chinese brothers who look exactly alike and each of them has a special and different ability. The first brother can swallow the sea. The second brother has an iron neck. The third can stretch his legs. The Fourth cannot be burned. And the fifth can hold his breath indefinitely. Unfortunately, the first brother is sentenced to death due to an accident in which a young boy is drowned in the sea for failing to keep a promise. And one by one the other four brothers pretend to be the first brother, using their specific abilities to survive four executions. Surprising by the four times of survival, the judge finally believes in the first brother’s innocence and set him free.The story and the illustration are quite interesting and humorous for a young child to read. And since the story is based on Chinese folktale and is illustrated with Chinese-style images, it can be seen as an example of multicultural literature. The biggest problem of this book, however, is that it somehow caters to the outsiders’ oriental expectation of China, making the images somehow stereotypical. For example, the scary descriptions of executions in China such as beheading, suffocating, drowning and being burnt alive are quite stereotypical. So do the images of Chinese people with similar complexion, dress and braid. But despite of those stereotypical images, I still find the themes of this book deep and encouraging. It teaches children about loyalty, about the importance of keeping your own promise, and about the family ties, which are all important Chinese values."}, {"userName": "Monique", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/1072826-monique", "userReview": "A cute briefly illustrated but detailed little book about five brothers who each have different talents:—First brother who could swallow the sea;Second brother who had an iron neck;Third Brother who could stretch and stretch his legs; Fourth Brother who could not be burned;And Fifth Brother who could hold his breath indefinitely....this story goes into telling a tale of First Brother showing off his talents to a mischievous little boy—as he held the sea forewarning the boy to return when he needed him to the boy ran off, First Brother expelled the sea and the little boy drowns. In using the talents of all five brothers and a little deception the brothers avoided punishment and saved themselves. I suppose Lesson #1 is to stick together and work as a team to achieve results though it is a little sad because the little boy did drown after all, but Lesson #2 could be that the little boy should have listened..which brings Lesson #3 of modesty as First Brother could have restrained from showing off his secret talent knowing that it was exceptional and could inspire fateful curiosity and jealousies."}, {"userName": "Kiera Burnett", "userReviewDate": "Aug 26, 2014", "userURL": "http://www.goodreads.com/user/show/34349487-kiera-burnett", "userReview": "Summary and Critique: One man has the unique ability to swallow the entire sea so that he may gather fish to sell at the market. One day, a little boy goes out with the man. The boy disobeys the man and when he can no longer hold the water, he lets it out, drowning the boy. The townspeople try to punish the man by killing him in multiple ways, but each attempt proves unsuccessful as each of the methods match a talent of the brothers. One concern with this story is that it discusses capital punishment. This is bound to raise concerns with some parents.Classroom use:I would incorporate this book into a folklore unit. It would be interesting to do a unit on folklore from around the world, asking students to pick a country and read one of their ancient stories.Genre: FolkloreFormat: Picture BookReading level: Grades 3-4Theme: Trickery, ObedienceTopic: Five brothers with special talentsGender, race/ethnicity, socioeconomic status: Because this book originates in Chinese folklore, the characters in the book are all Asian. However, this book does not reflect on the associated culture or socioeconomic status."}, {"userName": "Renee Clark", "userReviewDate": "Mar 26, 2015", "userURL": "http://www.goodreads.com/user/show/39214956-renee-clark", "userReview": "I choose this book because I recognized the name from when I was a child and wanted to re-read it now that I'm older. This book is about five Chinese brothers who all have a different ability. These are not your typical abilities, but one's that are shocking! I like how this connects to people in real life because everyone is unique in their own ways, although, the abilities of the five Chinese brothers aren't realistic. Yellow, black, and white are the only colors used in the illustrations of this story. Although the cover isn't very colorful I think the illustration is intriguing because it is five boys that look identical. Although the illustrations aren't very intricate, I like them because they balance out nicely with the text. The text in itself is amusing so I'm glad the illustrations don't overdo it. I think this book would be good for kindergarten aged students. But, it could be considered a little bit \"violent\" to some people. Some good theme's in this book that could be discussed are justice, responsibility, and how you can use your differences to benefit/help one another."}, {"userName": "Mandina", "userReviewDate": "Jul 14, 2015", "userURL": "http://www.goodreads.com/user/show/5671878-mandina", "userReview": "Oh I am so glad I found this book again! I would often tell my friends about this story, remembering it from when I was a child, and thinking it was such a fun and great story. I am very happy to say that, now at age 21, I still think it a fun story! It saddens me that this book is under attack for its lack of \"political correctness\" or its \"offensiveness.\" As a child, and now, that wasn't what the story was. I never thought about the racial issues or the depictions of the people in the drawings. I was too busy wondering what the next brother would have to encounter and what the next punishment would be and if the brothers would ever get off the hook. It let me experience a quick trip into a world of infinite possibilities."}, {"userName": "Margaret Chind", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/226769-margaret-chind", "userReview": "AppleBlossom read this one aloud to me from the 1988 Childcraft book. We noted the 1984 Childcraft had different illustrations. I remember this story from my own childhood. Not incredible, but interesting. Makes me want to go read The Story about Post Ping and another fable... something about a fisherman's wife... ---Excerpts and/or reprints included in Stories And Fables."}, {"userName": "ABC", "userReviewDate": "Sep 24, 2011", "userURL": "http://www.goodreads.com/user/show/431775-abc", "userReview": "This story just does not make a very good children`s book. First, a child dies. Then, as punishment, the first brother is sentenced to be executed and the storyline is how he manages to escape being killed.It is pretty to difficult to explain words like \"execution\" \"drown\" \"smother\" \"burn\" in a bedtime story!"}, {"userName": "Asha Seth", "userReviewDate": "Jan 02, 2012", "userURL": "http://www.goodreads.com/user/show/5040094-asha-seth", "userReview": "Who hasn't read this tale of the five Chinese brothers with extra-ordinary powers? Now, we prefer, X-Men and Spider-Man and similar other super-heroes, but in childhood days listening to even the silliest tales like The Five Chinese Brothers used to be so exciting to acquaint with."}, {"userName": "Laura", "userReviewDate": "Feb 06, 2012", "userURL": "http://www.goodreads.com/user/show/1853090-laura", "userReview": "As others have commented, nobody would mistake this for a children's book written or published since 1960. But my boys really like it. Maybe they find its frank account of mortality thrilling?"}, {"userName": "Kate", "userReviewDate": "Aug 23, 2007", "userURL": "http://www.goodreads.com/user/show/195737-kate", "userReview": "Most people who have read this book, I think, have been profoundly disturbed by at least one of the brothers. For me it was the sea-swallower."}], "description": "The classic picture-story about five clever brothers, each with a different extraordinary ability, has been in print for over 50 years. \"An original nonsense tale told with...spirit and gusto.\" -- The Horn Book", "title": "The Five Chinese Brothers", "url": "http://www.goodreads.com/book/show/65217.The_Five_Chinese_Brothers", "average": 4.18, "cover": "https://images.gr-assets.com/books/1432233658l/65217.jpg", "reviews": 359, "authors": [{"url": "https://www.goodreads.com/author/show/36812.Claire_Huchet_Bishop", "name": "Claire Huchet Bishop"}, {"url": "https://www.goodreads.com/author/show/45902.Kurt_Wiese", "name": "Kurt Wiese"}], "type": ["Childrens", "Childrens", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/65217.The_Five_Chinese_Brothers", "http://www.goodreads.com/book/show/818978.Five_Chinese_Brothers", "http://www.goodreads.com/book/show/1069576.Twenty_and_Ten", "http://www.goodreads.com/book/show/245104.All_Alone", "http://www.goodreads.com/book/show/599980.The_Man_Who_Lost_His_Head", "http://www.goodreads.com/book/show/257947.Pancakes_Paris", "http://www.goodreads.com/book/show/2131494.Twenty_Two_Bears", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}