{"ratings": 19290, "userreviews": [{"userName": "Oriana", "userReviewDate": "Jul 28, 2014", "userURL": "http://www.goodreads.com/user/show/30800-oriana", "userReview": "Oh my god this book is so totally weird and wonderful.Reading this is kind of like watching an insane person dance. There's all these bizarre jerks and twists and feints that are completely implausible until they happen, and you open your mouth to protest but Miranda just says shh shh shh, it's going to be fine and somehow it is. Despite being, plotwise, so bonkersly unlike anything you have ever thought of before, I don't mean to suggest that it's absurdist or surreal or Naked Lunch–ian or anything like that. It's normal people doing things that are only a beat or two off of normal; you just have to go with it, and then before you know it it has become perfectly reasonable and you're on to the next thing. And in fact it is also an absolute astonishment of meticulous construction, one you don't even ever see coming. All the pieces fits so bizarrely & perfectly together—click, click, click, like they're magnetized. I realize this is very vague and obfuscating but the book isn't coming out for like six months and I don't want to be a spoilery asshole. So here is a teaser list of things you will find in this book; I know it won't make much sense probably but oh well: role-playing therapists, appallingly selfish shirking of parental and grandparental duties, self-defense as fitness, globus hystericus, sexual-preference fluidity, May–December romances, a sort of two-person female Fight Club, a bucket of snails, simultaneous baby reincarnation, chromotherapy, the most awkward sex ever and also the most compellingly, disturbingly sexy masturbation fantasies.Sorry, that's all you get. I loved this so so so much and you will too. Good luck with the wait. : )"}, {"userName": "christa", "userReviewDate": "Jan 20, 2015", "userURL": "http://www.goodreads.com/user/show/40816-christa", "userReview": "Typically when I don’t like a buzz book I delight in mocking word choices and flimsy chapters or the thin line separating the novel’s plot and the author’s bio. The book becomes a contender for worst-of-the-year and I quietly, okay not-so quietly, dare someone, anyone to write something worse. When I don’t like a book by Miranda July, my second inclination is to assume that there must be something wrong with me. I adore Miranda July The Artist and all the weird shit that brews behind those slightly alarmed-looking eyes. I was with her that time she did that social experiment involving the Penny Saver and I was with her when she made the movie that included a talking cat. I downloaded her app (until I needed the storage space) and I subscribed to the Email Project. But sometimes I’ll just be walking along and I’ll think of the short story from her collection “No One Belongs Here More Than You” that starred a woman who taught land-based swimming lessons in her living room and I’ll kind of shake my head because that one still doesn’t make sense and even kind of bugs me. In July's \"The First Bad Man,\" Cheryl is a socially awkward 40-something who works at a non-profit that has recently rebranded its self-defense how-tos as fitness videos. She quietly pines over a 60-something board member who is always saying asshole-y things to her, which she assumes is done in an ironic way. She’s honed her home life to a smoothly-run operation built around the optimization of her every movement. She understands that if things get lax, if dishes pile up, it’s the fast track to depression which ends with peeing in mason jars. Phillip, the board member, seems to be returning her affections, but really he is just warming her up to confess that he has fallen in love with an underaged girl but that he hasn’t yet consummated the relationship and he won’t -- unless Cheryl gives the okay. As he waits for her to decide if it’s okay, he sends her status updates on the sexual side of things: The girl has been rubbed through the jeans. She’s held his stiff member. That sort of thing. Meanwhile, Cheryl ends up sharing her home with Clee -- her bosses’ big blonde daughter who is supposed to be looking for work in Los Angeles. Things are a bit contemptuous on the Clee-to-Cheryl front, and eventually the former is waging physical attacks on the latter -- which Cheryl combats by turning these go-rounds into reenactments of the Open Palm video series. Then it starts to get pant-y between them -- though Clee’s foot odor is a bit of a bonerkiller. Through all of this is a situation with a therapist who plays a receptionist as a twice yearly bit of role playing, and Cheryl is drawn to certain babies who speak to her on a cellular level. And there are the regular texts from Phillip, which she uses in her super rich fantasy life. At first I was ambivalent. I’d moved past caressing the cover and dug in deep to find that … well, it wasn’t screaming to me every time I set it aside. Then I actively hated it for a while. This ugly period faded and I had a sort of-kind of renewed interest that morphed into something along the lines of This is a Book with Words in it That I am Reading For Now. The End.In the meantime, everybody is loving this book. Lena Dunham posted a photo of herself holding a copy and she credited July with being “fresh.” New York Times likes it, though the reviewer sounds like she’s trying to convince herself along with Book Review readers, Boston Globe, AV Club, etc. To not like this book feels like an inadvertent admission of a character flaw. The opposite of a humble brag. It’s not July; It’s me. Writing about this book and talking about it with other readers has made me question my own judgement. It sounds funny. You’re right Lena, it does sound fresh! There are great lines, there are interesting ideas about relationships and the characters are truly unique. It is, I believe, even pretty funny. The problem: It’s not fun to read. The characters’ actions are nonsensical. The plot twists aren’t compelling. When a character gobbles at her placenta like it’s leftover spaghetti I rolled my eyes so hard I almost pulled a forehead vein. I’ve defended July against this in the past, but this time it’s true: Quirky for quirky sake. The worst kind of quirky. I just didn't like it."}, {"userName": "Jen", "userReviewDate": "Jan 15, 2015", "userURL": "http://www.goodreads.com/user/show/27709782-jen", "userReview": "The first BAD book by Miranda July...not sure as it is the first and last I'll read by her. Bizarre is a good way to describe it. The main character Cheryl - mid 40's - faces anxiety with disturbing sexual fantasies. She suffers from OCD and is mentally unstable. She is unlikable and the story is just plain weird. Three quarters through and no improvement. It's a hands down loser. Throwing this one in the abandoned pile."}, {"userName": "lp", "userReviewDate": "Nov 16, 2014", "userURL": "http://www.goodreads.com/user/show/442333-lp", "userReview": "WOW! I have never turned on a book so quickly in my entire life. When I started it I was in LOVE with its unique, odd hilariousness. But then shit got REAL weird. Fantasy sex stuff that wasn't interesting or funny at all. Just as I'd be about to give up, July would go back to her normal funniness about something totally mundane (the Japanese \"customs\" of her bosses, the therapist) and I'd remember how enjoyable she is when she's just developing characters. In the end, I was really touched by the characters. My response was surprisingly emotional. People say they wish goodreads had half-stars. I wish goodreads had a \"?\" you could put after the stars. As in. I liked it—QUESTION MARK? Three stars?????PS this is the last time I get psyched about a book 10% in."}, {"userName": "Barry Pierce", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/4593541-barry-pierce", "userReview": "\"I've been meaning to buy that one myself,\"\"Yeah I saw Lena Dunham gave it a good review so I had to pick it up!\"-The interaction between the lady behind the counter in Waterstone's and I when I bought this book.The First Bad Man is a novel that has been hyped for months. Literally every single of those \"Reads to Look Out For in 2015\" lists has had this one near the top. I must admit that this is my first experience with July's writing. I know she has some short stories floating around somewhere so I'll catch them eventually. So, is The First Bad Man deserving of the hype? Yes. Or no actually. No, yes. Hmm. Maybe? Let's see. We are presented with Cheryl Glickman, our protaginist. A woman who Dave Eggers called, 'one of the most original, most confounding and strangely sympathetic characters in recent fiction.' I have a feeling that Eggers has been diagnosed with a severe case of hyperbole here. In many ways, Cheryl reminded me of a highly neurotic version of the protaginist of Jenny Offill's brilliant short novel Dept. of Speculation, one of the best novels of last year. I've seen many review of this novel describing Cheryl as \"quirky\". God I hate that word. I refuse to ever use it. Cheryl is highly individual, eccentric, and idiosyncratic. She's Frances Ha and Annie Hall. She gets dumped with her boss' daughter, ninteen-year-old Clee, and this is where the novel tries to begin. Not only does Cheryl, a woman in her early forties, have to deal with a teenager claiming squatter's rights on her sofa, she is also kind of obsessed with Phillip, a man who is twenty years her senior. However, Phillip has other, Nabokovian, plans. The first half of this novel middles along. It mainly concerns Cheryl's life and those around her. Nothing much happens. I might even go so far as to say the first half is boring. Well it isn't boring per se. To use Art Historical terms, the first half is Northern Renaissance and the second half is Rococo. The novel comes alive in the second half due to an event which inverts everything on its head. Suddenly you begin caring about the characters. You see their human side. It was in the second half that I really began enjoying this odd, odd novel. The plot is like that of the seminal classic Weird Science. At first it's great, partying with mid-1980s Kelly LeBrock but then you've got to deal with real issues. Like Bill Paxton being turned into a gigantic talking pile of shit.This novel is definitely weird. It's different. There isn't a single sane character in there. It's like an episode of Kath & Kim but also not like that at all. Margaret Atwood meets Woody Allen in this novel but not in the way you want. So, can we answer the question now? Is The First Bad Man worth the hype? I say, yes. Yes because it is unlike any other novel I've read. Yes because it makes you laugh at the most inappropriate of things. Yes because of the phrase \"mutual soaping\". Yes because it is a realistic portrayal of life, no matter how zany. Yes. It is worth the hype."}, {"userName": "Katie Parker", "userReviewDate": "Jan 05, 2015", "userURL": "http://www.goodreads.com/user/show/1731180-katie-parker", "userReview": "Miranda July, you wonderfully weird creature. This book is probably one of the craziest things I've ever read, but it works, absolutely and completely. She crafts sentences that make you think the world was missing something until they were written. She finds genuine humor in the sadness, and poignancy in the mundane.\"I wondered how many other women had sat on this toilet and stared at this floor. Each of them the center of their own world, all of them yearning for someone to put their love into so they could see their love, see that they had it.\"\"If you were wise enough to know that this life would consist mostly of letting go of things you wanted, then why not get good at the letting go, rather than the trying to have?\"And, of course, it wouldn't be the same if I wasn't scarred for life by a piece of her work. (Has anyone else seen \"Me and You and Everyone We Know\"? Then you know what I'm talking about.) I really hope none of my fellow bus riders were reading over my shoulder during the odd, explicit sex parts. As uncomfortable as they often were to read, though, they were so often bookended by incredible passages that pulled me right back into the story.In summary, it was amazing, though not without its cringeworthy moments. But they aren't cringeworthy because they are bad; they are cringeworthy because people are weird and flawed and real, and it's rare to see that in such a transparent way."}, {"userName": "Will Walton", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/28919261-will-walton", "userReview": "I read the final pages twice silently, once aloud. Am currently considering getting them tattoed on my body. It's rare (or, at least, I feel like it's rare) for books as blunt and as bold as 'The First Bad Man' to leave you beaming from ear to ear. I don't care that there's weird sex all throughout; I'm gifting this book to my parents."}, {"userName": "Paul Bryant", "userReviewDate": "Jan 20, 2015", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "If you take a chisel and gently chip off the elaborate encrustation of florid psychology that at times sends this novel moonwalking towards the field of dreams that is bizarro fiction but really only up to its multihued verges and peeking across, then what I think you get is the plot of the 1966 Swingin’ London film Georgy Girl blended with the lunatic character swerves and switcheroos from any Iris Murdoch novel garnished with the sweet suburban Miss Lonely atmosphere of Miranda July’s own gorgeous movie Me and You and Everyone we Know.  Or : if A M Homes and Miranda July went to a party dressed as each other no one would notice. Lorrie Moore, though, she’d be fuming (they’re wearing her dress but it looks sexier on them!), but you can’t copyright being really funny and sad about American suburbia. There’s a Bad Sex in Fiction award given yearly by the (British) Guardian newspaper. Miranda July will not win. All the sex in this novel is bad, but it's deliberately very bad, wince-inducing, and there’s quite a lot of it. I will spare you the details but do not read most of this book while eating cereals, they may well go up your nose. So as I was sayingHey there, 42 year old Cheryl GlickmanSwingin' down the street so fancy-freeNobody you meet could ever see the loneliness there - inside youHey there, 42 year old Cheryl GlickmanWhy do all the boys just pass you by?Could it be you just don't try or is it the clothes you wear?Don't be so scared of changing and rearranging yourselfIt's time for jumping down from the shelfSo she jumps or actually she’s kind of violently pushed by a strapping 21 year old blonde bombshell called Clee and …. Well, all the other reviews will tell you what happens then, or you could let MJ tell you herself. When I pick a novel to read I don’t want to know much about it except it’s supposed to be good. It seems people have been dancing naked in the streets to celebrate the wonderful loveliness of this novel. Well, I wouldn’t go that far. I’d doff my overcoat and loosen my tie and say “yeah, pretty good” a few times. It was nice. It was in favour of people and it has an understanding that there are those who in the midst of a teeming planet live lonely lives. I kind of sort of maybe-ish well yes okay recommend this. If you don’t mind a lot of detailed bad sex and even more where the characters are thinking about the bad sex they want to have or have had. 3.5 stars."}, {"userName": "Kevin", "userReviewDate": "Jan 05, 2015", "userURL": "http://www.goodreads.com/user/show/142320-kevin", "userReview": "In her debut novel, The First Bad Man, Miranda July presents the story of a lonely 40-something woman named Cheryl Glickman. Cheryl looks at the world in her own hopeful and peculiar way. She fantasizes about an older man who is busy seducing a teenage girl, she tries to make psychic connections to a long-lost baby named Kubelko Bondy, and she has therapy sessions with a woman who is not really a therapist and is actually having an affair with the therapist Cheryl should be seeing. When Cheryl lets her bosses’ daughter, a young surly woman named Clee, move in with her, she takes on a person that she initially fears, but eventually loves and feels protective over. Without giving too much away, I’ll say that what happens between Cheryl and Clee makes The First Bad Man one of the strangest and most surprising novels of the year. The way Miranda July writes about the inner-life and longing of her characters is a thrill to read. It’s like she has a special kind of X-ray vision, where she can see the way her characters really think and act, and even when they’re weird or inappropriate, she still presents them to us unashamedly. And among their character flaws and their need to be loved, we, as readers, see ourselves."}, {"userName": "Michelle (tinyturtle88)", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/6927590-michelle-tinyturtle88", "userReview": "i...i dont know...this was either brilliant or odd. or both. i need time to process"}, {"userName": "Matthew", "userReviewDate": "Dec 03, 2014", "userURL": "http://www.goodreads.com/user/show/34908645-matthew", "userReview": "Waited for weeks to get it at the library. Checked it out first day. Forgot it at The Mill. Remember leaving it on the bar. Enjoy the free discard, Mill person. I am the 2nd bad man."}, {"userName": "Anita Pomerantz", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/714583-anita-pomerantz", "userReview": "I feel the need to give prospective readers of this book a quiz.Do you like HBO's Girls? YES NODo you think you would like HBO's Girls on steroids? YES NODo you generally appreciate black humor? YES NODo you like performance art? YES NOWhat if that performance art came in the form of a book? YES NOScore each Yes with 1 point. Make sure you score at least a 4 before proceeding.Seriously, this book is simultaneously whacked out, hysterical, disgusting, and oddly moving.Initially I thought the book was spoofing 50 Shades of Grade.And then I thought it wasn't spoofing, but was actual porn.Fortunately, that was just for one chapter.The first half of the book and the last half are very different. The first half screams \"look at me, look at me, I'm cool, I'm hip, I'm a performance artist writing a book.\" It also is very, very funny. It's entirely black humor. If you think it is serious, then you really won't like the book. I NEVER laugh out loud at books. Not books written by comedians, but there are some scenes in this one that definitely had me chuckling.The second half is much more of a traditional novel and is more sweet and touching.It's the combination of the two that probably convinced Amazon to recommend this as one of the best books of January. Trust me, you will think the editors lost their mind if you don't actually finish the whole book.The book revolves around a woman, Cheryl, in her forties who is narcissistic and really hasn't grown up. She also is a little nutty in some of her belief systems . . .just a little on the fringe. Clee, the 20-something daughter of Cheryl's bosses, needs a place to live and moves in with Cheryl. The book revolves around the two women, but there are a number of sub plots that somehow in the end do actually connect together. They all made me feel a little dirty while reading them to be a little honest. But on some level, this train wreck of a first half barrels down the track to a touching second half, and I find myself reflecting back on the whole thing as a fun, very fresh, read.I'm recommending this to exactly no one unless you pass the quiz above. Really. Whatever you do, do NOT bring this book up as a suggested title for your face to face book club."}, {"userName": "Courtney", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/2117126-courtney", "userReview": "Miranda July has such beautiful insights that resonate with one's sometimes secret inner thoughts. Like when she writes that she sits perfectly still while someone is talking about her because she \"loves to be described\". Or how she looks at babies to see if she has a secret connection with them that's stronger than that with their mother. These are the little things that can pass through the mind without a second thought, but here she brings them to a whole new level. The characters have free reign to act on and explore all their deep impulses--they have let go completely of normal social rules. Things definitely get weird, as they would if anyone let their innermost, darkest parts of themselves guide their everyday lives.July's writing is so unique. There is no one who has her voice, though there are a lot of imitators out there. I loved this book for its small moments and beautiful turns of phrase. That being said, the plot line and extremes of the story turned me off a bit. It just got too dark and strange for a book where the writing is quirky and funny. I'll always read whatever Miranda July puts out, but for me, short stories are her most pure and honest form."}, {"userName": "Snotchocheez", "userReviewDate": "Mar 12, 2015", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "Auteurs like the evidently multi-talented Miranda July generally don't receive much attention 'round these here parts, so I was thrilled that our little library got a copy of this...yet the curious generic black cover, the riotous blaze of colors on the inside front and back covers, and Ms. July's stay-away-from-me-and-my-book photo all seem to non-verbally yet overtly communicate THIS IS ART! in a way that makes me scoff dubiously. Shouldn't have scoffed. She's got herself a new fan here in Alabama. The First Bad Man has just about everything one could ask for in a refreshingly weird, quirky-cool novel: girl-fights, bizarre sex, snails, Ojai, Japanese office etiquette, gender confusion, etc. etc. At its heart though, stripping away the strange, is just a lonely OCD lady trying desperately to find love, in the most unlikely manner possible.Ms. July's debut (!) novel (and her supah freakay protag Cheryl Glickman) are certain to stay in my brain a good long while. Can't wait to read more from her. (I'm teetering toward 5-star land on this one, but mah pea-brain didn't quite grasp the ending; If anyone can clue me in, please do. I'd really like to bump this one up!)"}, {"userName": "Sian", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/4981595-sian", "userReview": "I'll admit, I am kind of Miranda July's target audience, and perhaps my glowing review won't be particularly surprising. Other than her film The Future (like, I'm sure it's brilliant, but if I wanted to be super sad about cats I'd just go to my local pet shop) I've been into everything else she's ever done and this probably isn't a super impartial review so take this with a gain of salt of whatever.This book somehow perfectly captures all the sad ugliness that exists in a mediocre life, specifically the mediocre life of a woman. The illogical magic that means when you finally forget someone or delete their number, they text you. The pathetic desperation of knowing you and a man have travelled through lifetimes together….while he's busy telling you about someone else. How easily it becomes to become stuck inside your mind, inside patterns. As the reader, I understood Cheryl's body as something ugly - not because it was or wasn't, but because of the way Cheryl moved through life inside it. The First Bad Man is hyperreality, but still reality. Some parts were desperately uncomfortable to read but mostly because they reminded me of an ugliness inside myself. Cheryl was pathetic, but not over-exaggeratedly so, and the way her mind worked was breathtakingly familiar to me. The way so many babies become Kubelko Bondy. The way that sex - masturbation - becomes ritualised, inaccessible, too big to control. An aggressive maternalism that repulses and juxtaposes itself. I feel like I'm seeing more and more of these ugly, internal, hyperreal, powerful//powerless women in literature of late and I for one think it's about f*cking time.I kinda feel like those who don't get it probably aren't women trapped inside their own minds, with that pathetic, desperate ugliness inside of them. Good for them, I guess! Those who are should pick it up and find themselves."}, {"userName": "Lolly K Dandeneau", "userReviewDate": "Oct 15, 2014", "userURL": "http://www.goodreads.com/user/show/1412404-lolly-k-dandeneau", "userReview": "My brain is scrambled. This is the weirdest story I have read in years. The characters are all off their rocker, or maybe we are all just as strange deep down inside. Cheryl is a bit disturbed and her hunger for Philip and the connections she sees with him are outlandish, so starts the novel as it spins madly into the strange and unusual. When her bosses need a place for their daughter Clee to live and chose her, her tight ship of a life will sink. Clee is a brutish knockout, in more ways than one. She will bring 'life' to Cheryl's dull existence and a love that she never knew she could have. There are so many moments of humor, outrageous behavior, obscene acts gathered in this story that may be overwhelming for light readers. I was able to get my hands on an arc, and was not disappointed- it really is that unique and beyond quirky."}, {"userName": "R.", "userReviewDate": "Mar 14, 2015", "userURL": "http://www.goodreads.com/user/show/184928-r", "userReview": "Well, I finished it and...huh. I will say that July is a talented writer but...the characters. Each and every character (up to and including the preemie baby) was just simply creepy, got under my skin (a tip of the hat to July, I guess). I'm OK with creepy in a book (Lolita), but this was just overboard and, yes, very obnoxious (\"Look at my wacky cast of dysfunctional characters! Don't you see yourself and everyone you know in their quirks and calamities?\" July seems to be shouting...and puts the exclamation mark on the whole thing with Bowie's \"Kooks\" as incantation, anthem.)Everything was going along swimmingly, hopefully, in the read until Cheryl (following a revelatory session with her creepy therapist) decided she was in a female Fight Club with Clee - and it went downhill from there. I was, like, really? It would have been interesting to read a feminist Fight Club short story, but July must've, I dunno, gotten pregnant at some point in the writing and wanted to share her homebirthing experience with the reader, share her observations of maternity, motherhood, or whatever. I wanted more for Cheryl other than her life's plan being dictated by the poor choices of a psychotic houseguest (I never really got why the parents didn't just give Clee money to live on her own...I wanted to strangle Carl and Suzanne in every appearance...sic some of Marcellus Wallace's crew on Philip). Too bad July didn't. Want more for Cheryl, that is. P.S. I can't believe George Saunders blurbed this novel. Eggers, yes, because a byline is a byline. Homes, yes, because her book (May We All Be Forgiven) is turning out to be just as creepy. But Saunders? Dude. Prediction: This will probably be turned into an \"independent\" movie (or FX TV series) starring Kristen Schaal in a few years time."}, {"userName": "Carina", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/27131708-carina", "userReview": "On a scale of 1 to 5, I'd rate it yellow. Or helicopter. It's likely perverse. It's probably clever. I'm a little too shell shocked to really be of any use with this review. If you do decide to read it, tell someone where you'll be and what time you'll be home."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Sep 08, 2015", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "This book is bizarre. I was talking about it with a librarian who had read this and her short stories, and he said something that I'm going to put here and possibly misquote. Quirky characters and strange situations are more tolerable in short stories, because they are in and out, you can marvel at them but not have to live with them; in a novel it can cause agony to the reader as you dive deeper into strange people making confusing decisions. Agreed, agreed. I would probably like July's short stories, and plan to read No One Belongs Here More Than You at some point. I'm not sure I would recommend this book to anyone.On the plus side, I laughed a lot while listening to the audio. Miranda July reads her own novel in a perfect tone, with a practical straightforward voice that makes Cheryl come across the way she probably does in the world of the novel - a boring almost middle-aged woman on the outside and CRAZY on the inside. We are treated to an almost constant internal dialogue, of magical babies with the presence of Kubelko Bondy, of sexual fantasies that are anything but enticing, of the tolerance of horrible people that seem to surround her - inept therapists with imaginary specialties, bosses that are a flavor of \"enlightened\" plus an incredible variety of selfish that seemed actually pretty familiar to me, a man trying to get her approval to have sex with a teenager, and a teenager who lives in her house while physically abusing her and disrespecting her space. I'm not sure about your internal dialogue. There are certainly thoughts I have in my head that I wouldn't want shared, but Cheryl's internal life surpasses the absurd. I notice a few people on my friends list abandoned the book, some were affronted by the sex, some couldn't take the forced quirky, but I wanted to make it to the end to see what happens."}, {"userName": "Danger", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/5184971-danger", "userReview": "I am a big fan of Miranda July’s films (I loved You & Me & Everyone We Know) but I never dove into her fiction before. This book managed to evoke an ocean’s worth of heartache out of me, as what July manages to do is create characters that are so alien (and alienated) yet so emotionally real and resonant, it’s almost impossible to not empathize with them. And the truths she CONSTANTLY unveils, one after another like machine gun fire, are sometimes funny and sometimes sad, but they are always profound. THAT SAID, the story does suffer a little bit in the second half, meandering a little too much for my tastes, and as the idiosyncratic main character starts to grow as a person, the oddness of this novel starts to level out. THAT ALSO SAID, it wraps itself up quite nicely in the end, and left me satisfied. This is less of a novel and more of an experience; one that you’ll undoubtedly walk away from a better person. Good stuff."}, {"userName": "Tfitoby", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/5454475-tfitoby", "userReview": "Miranda July has produced a novel that is so Miranda July only fans of Miranda July could love it. Yes, it's got her character quirks, yes it's got some potentially inappropriate relationships, yes there are some quite bizarre moments and naturally there are some magical ways of seeing the world, especially the world experienced by Cheryl Glickman. But then almost out of nowhere she flips a switch and Cheryl starts to come of age in a pretty straight forward narrative of self discovery. Except it feels like it has evolved naturally from the strange little narrative you've already experienced, you'll believe a man really can make the sun rise with the tapping of a coin on a lamppost or a middle aged white woman can be soul mates with a pre teen black boy.There were times when I was reading it as a response to 50 Shades of Grey, such is the honest and realistic representation of the exploration of female identity and sexuality that runs throughout but it is the way July explores her own feelings surrounding becoming a mother for the first time that makes the novel so interesting and moving to read. She seems to have such an interesting and unique way of representing the way she interacts with the world around her, it's inspired and influenced other artists who most of the time (including her husbands second film) just seem to appear like Miranda July-lite. She's a marmite artist and this is a marmite novel, it's love or hate and there's no real room for in between, unless perhaps you just \"don't get it\"."}, {"userName": "Anndra Dunn", "userReviewDate": "Apr 08, 2015", "userURL": "http://www.goodreads.com/user/show/5814292-anndra-dunn", "userReview": "This is a book about Quirkily Insane and unlikeable caricatures doing Quirkily Insane and unlikeable things. Unfortunately the book wants you to root for its protagonist and this just isn't going to happen.This was an exhausting read, maintaining a constant low-level unpleasantness. The authorial voice is arch and swithers between trying to present aspects of depression as slyly humorous - such as the protagonist explaining her system for managing her life, all going back to only having one set of dishes so that dirty dishes can't pile up and create a vicious cycle of depression - or attempting to evoke pathos, but the former is weak and the latter is plainly artificial given the contempt Miranda July shows for flaws of her absurd characters. Social dysfunction and anxiety is placed in the same category as a belief in crystal healing or eating kale with every meal. I couldn't help but compare it to something like Ali Smith's There But For The, which far more successfully combines absurdities and farce with genuine humanity.Don't read this book."}, {"userName": "Po Po", "userReviewDate": "Jul 16, 2014", "userURL": "http://www.goodreads.com/user/show/11138071-po-po", "userReview": "I don't know whether to laugh or cry or scream at the top of my lungs as I ride a rainbow across the sky.Sometimes a book just has \"it\" -- the connection that makes you feel as if the book is written especially for you. It's one of those unputdownable books that puts the rest of the world on hold. Of course there are quirky and endearing characters. And kinky shit (this IS written by the lady who came up with pooping back and forth forever.) But there's so much more. It's an exploration of humanity at its most fundamental level: wanting to love and wanting to be loved. It's a humbling journey of self-discovery and sexuality and loneliness and yearning and desperation and obsession and sweetness and motherhood.It's a bold declaration that none of us are \"normal\" -- we are all deeply and truly flawed in one way or another -- but we are all lucky enough to exist in this beautiful and messed up world together in this infinitesimal moment in time.* * *+ \"Rainbows are in their own class of spectacularity, every single one of them impressive, never a bleak rainbow, never with just some of the colors. Always all the colors and always in the right order.\"+ \"It must happen all the time, a fleeting passion overwhelms someone's true course and there's nothing to be done about it.\""}, {"userName": "Steven  Godin", "userReviewDate": "Mar 22, 2016", "userURL": "http://www.goodreads.com/user/show/26706841-steven-godin", "userReview": "I must have been possessed by a bizarre ,self-loathing middle age women who has some pretty messed up sexual fantasies to get through this!, my God what on earth was going on here!, funny at times yes but in an oddball, screwed up way, and if Cheryl Glickman was not irritating enough what about Clee!, I guess half of me couldn't help but feel something for her, while the other half wanted to chuck her out the fucking window!. The first third was somewhat normal before sliding down a slippery slope drenched with a huge, orgasmic, creamy mess!, finally entering into a more tender and often quite sad affair. But I still respect Miranda July, because at least this did something that not many books have done before, it really got under my skin, and credits due to have the balls (or should that be labia!) to write something so sexually outrageous. Crazy or genius?, either way at least you cannot argue she stands out from the crowd."}, {"userName": "Tyler Goodson", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/7540065-tyler-goodson", "userReview": "Cheryl is a forty year old woman living alone until, suddenly, she isn't. Clee is the girl half her age who is the reason Cheryl doesn't live alone anymore. What happens when these two collide might shock, and will definitely amaze, as July shepherds us through the astoundingly weird to the stunningly humane. Sometimes I stopped reading to talk to myself out loud about how good this book is. It is really, really good, and it contains every kind of love. Cheryl thinks her story might not be a Great American Love Story for Our Time, but in Miranda July's hands that is just what it is."}, {"userName": "Julie Ehlers", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/2120450-julie-ehlers", "userReview": "[having a baby is the key to happiness (hide spoiler)]"}, {"userName": "Jen", "userReviewDate": "Feb 12, 2015", "userURL": "http://www.goodreads.com/user/show/1177730-jen", "userReview": "This book just wasn't my cup of tea. I've read other works by Miranda July that I've thoroughly enjoyed, but this one just didn't do anything for me. It made me sad, and I definitely don't need to be any sadder this winter. I thought the concept was interesting but it was just too weird for me. I know that this will be an unpopular opinion, nonetheless it is my opinion and I will stand by it."}, {"userName": "Rebecca Foster", "userReviewDate": "Sep 11, 2015", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "I had barely heard of the author (an indie filmmaker and visual artist) and knew nothing about the book before starting it – which is probably for the best given that a simple synopsis makes it sound even weirder than it really is and would likely have turned me off. That black-and-white cover doesn’t really give you any clues, either, though when you open it up you get the riotously colored modern art swirls of the endpapers. You could think of the design as emblematic of the book itself: unpromising from the outside but reasonably rewarding once you get into it.Cheryl Glickman is a neurotic 43-year-old manager at Open Palm, a Los Angeles area women’s self-defense organization that now mostly runs fitness classes. Her obsessive personality comes through with her devotion to “the system,” a strict minimalism that involves as few possessions as possible, plus reusing everything to save time and increase efficiency, and her crush on Phillip Bettelheim, an odious colleague 22 years her senior.The book opens with two key events: Phil recommends she undergo chromotherapy for the globus in her throat; and her bosses con her into hosting their 21-year-old daughter, Clee, who seems to do nothing but lie around watching TV. The color therapy morphs into more general therapy with Ruth-Anne, while the unwanted houseguest changes Cheryl’s life forever, though not at all in the way one might expect.“What was the name of the situation I was in? What category was this?” Cheryl wonders to herself. Clee messes with her system and starts mocking and even physically abusing Cheryl. Instead of kicking her out, though, Cheryl codifies their fights into reenactments of some of Open Palm’s 1990s self-defense videos (the title phrase comes from one of these scenarios).And then things get sexual. First Phil starts texting about his infatuation with a 16-year-old, asking permission to make a move. Next Cheryl starts an intense masturbation campaign, imagining Clee in various pornographic situations. Sometimes Cheryl pretends she is Phil diddling Clee. To take her mind off things, Ruth-Anne suggests that Cheryl sing. She chooses a David Bowie song.(Still with me?)Cheryl has conflicted feelings about Clee. She likes the physical closeness of their combative relationship. At the same time, she’s disgusted by Clee’s laziness and smelly feet. Still, she’s fixated. “Her cowlike vacuousness didn’t really bother me anymore. Or it didn’t matter—her personality was just a little piece of parsley decorating warm tawny haunches.”Eventually Cheryl wakes up to the reality that she is “a middle-aged woman who couldn’t keep her hands off herself.” The first half of the book is about fantasy and fabrication. “Real comes and goes and isn’t very interesting,” as Ruth-Anne says. In the second, though, things swiftly turn concrete when Clee realizes she’s pregnant. Cheryl takes on an advisory and later a supportive role; “I’d been her enemy, then her mother, then her girlfriend. That was three lifetimes right there.”Does Clee love Cheryl? Does Cheryl love Clee? It’s hard to say; “maybe that was the point of love: not to think.” Regardless, all of a sudden, Cheryl finds herself a mother. “[Clee] was the worst possible person to do this with—that was evident now, but what could I do?” July herself had a new baby at the time of writing this novel, which accounts for how authentic the Jack sections feel. It’s a bit of an aimless story, but watching Cheryl’s development is certainly interesting. I could have done without most of the Phil stuff, but it turns out he’s important to the plot.If I had to compare July’s style to anyone else’s, it would be Douglas Coupland. At times Cheryl was also a bit like Don Tillman in The Rosie Effect, what with her matter-of-fact recounting of Jack’s fetal development. Blend the voyeuristic raunchiness of The Heart Goes Last with the uncomfortable physical reality of After Birth, two novels I’ve previously reviewed on this blog, and you get an idea of the dynamic at work here.I can’t say I entirely enjoyed the book; I don’t always appreciate quirky-for-quirkiness’-sake. However, my utter lack of expectations was a good thing, and I thought July did a solid job of making her somewhat unpleasant characters sympathetic by making them go through one of life’s central challenges: parenthood. She also comes up with some delightfully off-the-wall sentences, as in my favorite passage, in which Cheryl vocalizes her thoughts to baby Jack:“You are a sweet potato.” This sounded literal, as if I was letting him know he was a root vegetable, a tuber. “You’re a baby,” I added, just in case there was any confusion on that last point.(Originally published with images at my blog, Bookish Beck.)"}, {"userName": "Alex", "userReviewDate": "May 01, 2016", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "[Anyway, the coexistence doesn't really work. Real Woman is left holding the baby while Dumb Sex shambles off. (hide spoiler)]"}, {"userName": "Krista", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "“I'm the first man,” she said.“The one in denim?”“The first bad man.”It was the way she was standing when she said it – her feet planted wide, her big hands waiting in the air. Just like a bad man, the kind that comes to a sleepy town and makes all kinds of trouble before galloping off again. She wasn't the first bad man ever but the first I'd ever met who had long blond hair and pink velour pants. She snapped her gum impatiently.\nThis was my first reaction upon finishing The First Bad Man, and it bears repeating: “I smiled and winced through the whole thing and then ended it in tears.” It would be patronising and dismissive to call this book merely “quirky” or “kinky” (but it is both), and Miranda July – award-winning filmmaker, short-story-writer, performance artist, and first-time novelist – is presumably too busy and too thoughtful to waste her time writing a book that can be dismissed that easily. I don't think July wrote a shocking book for shock's sake, or reached for the ludicrous just to be funny (but it is both shocking and terribly funny), but in a way that reminded me somewhat of the classic-of-the-absurd A Confederacy of Dunces, she created a character so outside the bounds of reality that she opened a window upon the hearts of all of us; Cheryl Glickman is the exception that proves the rules for this messy human project. This wasn't a passive reading experience – I had physical reactions, smiling and wincing, on every page – and I can't help but admire any book that pulls that out of me. Let's meet Cheryl Glickman:I drove to the doctor's office as if I was starring in a movie Phillip was watching – windows down, hair blowing, just one hand on the wheel. When I stopped at red lights, I kept my eyes mysteriously forward. Who is she? people might have been wondering. Who is that middle-aged woman in the blue Honda?Who is she? Cheryl is a frumpy forty-three-year-old single woman (her best physical features are her shell-like ears, so she tends to enter rooms ear-first) who lives alone (with a bizarre system of housekeeping rules meant to stave off decrepitude), who remote-manages a women's self-defense centre (Open Palm) that has transitioned into selling self-defense-as-fitness DVDs, and who has a vivid and long-running sexual fantasy involving a sixty-five-year-old board member, Phillip; a wrinkled, balding jerk who thinks it's funny to grab Cheryl by her chunky necklace and lead her around the office (but as this is the only action Cheryl gets, she's willing to laugh along as though Phillip is just making fun of the kind of jerk who might actually do something like that unironically). As the novel begins, two situations arise that rattle Cheryl's smooth-edged equilibrium: Phillip has fallen in love with a sixteen-year-old, and through a series of crude texts (he describes his “stiff member” and how he wants to “cream” on the girl's “jugs”), he asks Cheryl's blessing before bedding the girl; and Cheryl's bosses ask her to allow their twenty-one-year-old daughter, Clee, to temporarily move in with her. Cheryl is so passive and uncomplaining that she neither balks at Phillip as he downgrades her from potential partner to asexual arbiter, nor at Clee as she refuses to follow the household rules, looming large and beautiful, stinking of foot rot. Cheryl unintentionally begins therapy at this time, and for the first time ever, has someone to talk to. Putting aside the fact that the therapist invites Cheryl to pee in empty Chinese food takeout containers behind a ripped paper screen in the corner of her office if she needs to use the facilities, Cheryl finds the experience enlightening; and especially when Dr. Tibbetts shares the fact the she and the colour therapist she shares the office with like to engage in “adult games” involving fantasy and role-playing. Cheryl is able to use this idea of game-playing to reinterpret (and gain power in) her relationships with both Phillip and Clee. When Clee becomes physically abusive, Cheryl reacts with the popping and butterflying of Open Palm's old self-defense videos, and once Clee recognises the moves and the scenarios that Cheryl starts intentionally setting up, she responds in kind and the pair begin wrestling around the house like a cross between Fight Club and Cato jumping out of the shadows at Inspector Clouseau. It's creepy enough to have Clee reciting “Yum yum yum” from the bushes as Cheryl approaches to unlock the front door, but what the young woman doesn't know is that on the inside, Cheryl is imagining that she has a “stiff member” that can't wait to “cream” on Clee's “jugs”. And while the game-playing does allow Cheryl to overcome her lifelong impotence, her therapist recognises that Cheryl has begun to dehumanise everyone around her; turning them into pawns for her fantasies. And then things happen and things change and Cheryl finds love in an unexpected place.\nSometimes I looked at her sleeping face, the living flesh of it, and was overwhelmed by how precarious it was to love a living thing. She could die simply from lack of water. It hardly seemed safer than falling in love with a plant. \nI liked that we don't learn anything about Cheryl's childhood that might explain the why of her strange existence – other than the time that she intensely bonded with a visiting infant when she was nine; an event that caused Cheryl to seek out a psychic connection with every baby she sees for the rest of her life – and meeting her in middle age, it was touching to watch as Cheryl transforms from someone with a wholly fantasy-based life to one who has a physical presence in the world. The ending was earned but not predictable, and as I opened with, I was in tears by the time I closed the book's covers. Loved it."}], "description": "From the acclaimed filmmaker, artist, and bestselling author of No One Belongs Here More Than You, a spectacular debut novel that is so heartbreaking, so dirty, so tender, so funny--so Miranda July--readers will be blown away. Here is Cheryl, a tightly-wound, vulnerable woman who lives alone, with a perpetual lump in her throat. She is haunted by a baby boy she met when she was six, who sometimes recurs as other people's babies. Cheryl is also obsessed with Phillip, a philandering board member at the women's self-defense non-profit where she works. She believes they've been making love for many lifetimes, though they have yet to consummate in this one. When Cheryl's bosses ask if their twenty-one-year-old daughter Clee can move into her house for a little while, Cheryl's eccentrically-ordered world explodes. And yet it is Clee--the selfish, cruel blond bombshell--who bullies Cheryl into reality and, unexpectedly, provides her the love of a lifetime. Tender, gripping, slyly hilarious, infused with raging sexual fantasies and fierce maternal love, Miranda July's first novel confirms her as a spectacularly original, iconic and important voice today, and a writer for all time. The First Bad Man is dazzling, disorienting, and unforgettable.", "title": "The First Bad Man", "url": "http://www.goodreads.com/book/show/21412400-the-first-bad-man", "average": 3.59, "cover": "https://images.gr-assets.com/books/1421037741l/21412400.jpg", "reviews": 2604, "authors": [{"url": "https://www.goodreads.com/author/show/65678.Miranda_July", "name": "Miranda July"}], "type": ["Fiction", "Contemporary", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/21412400-the-first-bad-man", "http://www.goodreads.com/book/show/24980019-the-first-bad-man", "http://www.goodreads.com/book/show/22125168-the-first-bad-man", "http://www.goodreads.com/book/show/24718528-the-first-bad-man", "http://www.goodreads.com/book/show/22609074-the-first-bad-man", "http://www.goodreads.com/book/show/28401128-the-first-bad-man", "http://www.goodreads.com/book/show/113429.No_One_Belongs_Here_More_Than_You", "http://www.goodreads.com/book/show/11266880-it-chooses-you", "http://www.goodreads.com/book/show/18458789-roy-spivey", "http://www.goodreads.com/book/show/113430.The_Boy_from_Lam_Kien", "http://www.goodreads.com/book/show/36139791-the-metal-bowl"]}