{"ratings": 8773, "userreviews": [{"userName": "Melankalia", "userReviewDate": "Oct 12, 2011", "userURL": "http://www.goodreads.com/user/show/5058978-melankalia", "userReview": "I cannot understand what everyone sees in this book. I was expecting \"Thelma & Louise\" plus zombies, and that's...sorta...where it started, but it just got worse and worse as it went along. To begin with, the (somewhat) interesting action scenes did not in any way make up for having to hear about everyone's feelings every three seconds. About halfway through the book, I felt like I'd gone from \"Thelma & Louise\" + zombies, to \"The View\" + zombies. I think if it had been written in first person that aspect might not have been as awful, but that's not saying much. And don't even get me started on the paragraphs that try to cram in what all of the characters are doing/feeling.\"Katie felt wetness flowing down her own face as she pulled Jenni into an embrace. Jason threw his arms around both of them while Jack barked for attention. Katie kissed both Jenni and Jason on the cheek firmly, then hugged them again. It felt delicious to be alive and with them once more.\" Seriously? We don't need to know what everyone is doing after each tiny bit of action. Honestly, I swear we don't. Also, note to authors: Having your character \"feel delicious\" when they've just survived nearly being eaten by zombies is, at best, really lame. The other thing that bothered me was how often observations were made when the writing should've been more background. \"The first obstacle was in plain view. The library had a set of glass double doors with a small foyer between them. Trapped in the entryway was an old man, dead, hungry, and beating on the interior door. It was kind of funny that he still clung to his library book.\"Now, if these were someone's thoughts, I would've had no problem with them. But this is only one example of the many descriptive paragraphs between dialog, where there is no clear point of view as to who is making the observation.In conclusion, if you can manage to ignore all the touchy feely stuff this still makes for a fairly uninteresting zombie book with subpar writing. At least that's my opinion on it."}, {"userName": "Giselle", "userReviewDate": "Apr 15, 2011", "userURL": "http://www.goodreads.com/user/show/4800103-giselle", "userReview": "Zombie stories are my guilty pleasure. They're exciting, full of action, gory, but they terrify me to bits. Surviving a zombie apocalypse is no easy feat. So, as expected, I read this with my heart pounding from start to finish, knowing that these people are most likely doomed no matter what, because zombies always win… always. It was such a rush!!An incredibly frightening zombie story- The First Days, as the title conveys, starts at the very beginning of a zombie apocalypse. People are getting bitten, then turn on others to feed. No one knows what's happening, but after Jenni sees her family succumb to this horror, she flees. This is not easy for her. Being a mother myself, that beginning is incredibly heartbreaking. I just kept imagining being in her shoes, seeing my children turn into monsters in front of my eyes. Uncomprehending. The tangible emotions in this story is a big part of why it's such a chilling read. It makes it extremely realistic. The setting, the pace, the reactions; it's all how I imagine it would happen if the zombocalypse were to start today. It really makes you think.We meet a lot of different types of personalities during this story. The panicked, the determined, the optimist, and the destroyed. Rhiannon greatly portrays how society would react to such terror. Our protagonists are two strong females who go through remarkable depths to help each other, as well as strangers they meet down the road. These women are incredibly intelligent. They don't let their emotions turn them incompetent- which is the only way you're able to survive in this new world. I grew immensely fond of both of them. I even felt like I knew them; they were so real. We also have a band of eccentric supporting characters who make their way into these women's lives. Each one adds a little bit of charm, even humor, to this otherwise somber story. I didn't care much for the added romance in the novel at first, though. It felt a tad artificial, mostly due to its hastiness. However, I realized afterwards that people in such situations would have a tendency to develop feelings at an accelerated pace, hence making theirs probable. It also does give a nice breather from the constant anxiety and panic, so it was never seen as a negative point.Zombie movies are all about horror and gore, but The First Days is so much more. You will grow to know and care for these people. You will see how, in a zombie world, new rules have to apply, hard choices have to be made, you can't take ANYTHING for granted, and no one is safe, ever. It will strip you to the core!--For more of my reviews, visit my blog at \nXpresso Reads"}, {"userName": "Rhiannon Frater", "userReviewDate": "Dec 15, 2008", "userURL": "http://www.goodreads.com/user/show/1805401-rhiannon-frater", "userReview": "I wrote this novel, so I've read it more times than I care to count. I think I almost have it memorized. :)"}, {"userName": "Stacia (the 2010 club)", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/4013351-stacia-the-2010-club", "userReview": "[It doesn't overwhelm the story at the start but there's a strong presence of love drama near the end. If you can't take it, bow out now. Your journey ends here. (hide spoiler)]"}, {"userName": "a", "userReviewDate": "May 02, 2012", "userURL": "http://www.goodreads.com/user/show/4488138-a", "userReview": "Could it be? Is this really a zombie novel with two bad ass heroines kicking butt and taking names? Oh. No. It isn't.I'll give Frater credit where credit is due: this story starts off like a really awesome slap in the face. We're introduced to Jenni, who is staring at the tiny baby fingers of her toddler son reaching under a crack in her door. Why? Because her abusive and zombified husband is having him for a snack. Her other son has been bitten by her husband, too, and is trying to claw out of the house via the window to take a chunk out of mommy. Jenni is only saved when Lesbian Katie (more on this in a minute) rolls up and gets her into the truck before she becomes zombie lunchmeat. Then, I'm afraid, begins the agonizing spiral into What The Shit Is This Land.Here are the problems with this book:- Characterization:Jenni, you suck. After Jenni is rescued and she and Katie find a place to hole up for a while, she offers herself up to Lesbian Katie. I get it in a way. Coming from an abusive household, one might safely assume that Jenni has been brainwashed into thinking that she's nothing but a puppet for the needs of other people. Since Katie is the one that rescued her, it might be logical for Jenni to assume that sex is the price for safety and protection, making it really easy to not see this situation for what it is, which is just the first in a long line of scenarios in which Jenni thinks with her netherparts instead of her brain. Jenni's all-consuming goal of getting laid is so overwhelming for her that she forgets that she has a stepson that she needs to rescue (which, if I'm being honest, feels like just an impetus for Frater to insert a fancy action sequence into her story because her stepson is basically pointless after his rescue) and that she's lost her two sons less than a week prior. In short: abort, abort, abort.Katie, you don't suck as much as Jenni. You're Diet Suck. I have dubbed Katie Lesbian Katie because ninety percent of the narrative about her is about her sexuality. In fact, the parts about her read less like a zombie novel and more like shitty dialogue in a Lifetime movie about gay acceptance. No, really, it gets so bad that Lesbian Katie goes out of her way to have a completely inappropriate and, frankly, pointless conversation about her sexuality with Jenni's adolescent stepson. She entrusted a fifteen year old the secret of her bisexuality; the whole bit felt more like an unnecessary scene for Frater to explain Katie's blossoming attraction with a man, when, if it had been kept out of the book, the story would not have been lacking.Also, Frater's dudes sound like ladies. You know how annoying Bella Swan was in Twilight mooning over Edward? That was basically every male character in this book.- Story:One thing that Frater did really well was make sure that there was a lot of action. I liked that part about her writing because with the limited wriggle room available with zombie lore, stories can become dull or repetitive, which makes interpersonal relationships between characters necessary. Here is the problem. Much of the story focused on a stupid love quadrangle - Jenni loves cock (Travis', first), Travis loves Lesbian Katie, Juan loves Jenni, Katie wants to mourn her undead wife in peace - which was given far more importance than it should have. I was much more intrigued with the politics of the little community that Jenni and Katie found themselves in instead of a dumb game of elementary school Love Connection.- General issues:Every single character says, \"Gawd\" instead of \"God\". So it was pages of, \"Oh my Gawd,\" and \"Gawd, that's terrible,\" from every single character. I realize that this was a stylistic choice by Frater, but it made me want to punch puppies when every single character started to sound like an unintelligent Scarlett O'Hara.It was super cute when Juan gave Jenni the nickname Loca. It stopped being cute around the four hundredth time he went out of his way to call her Loca. It made me wonder if Frater has ever had a conversation with a real person because every single sentence was peppered with her name, unnecessarily. Things he actually said: \"You're loca, Loca.\" Shut up. The only redeeming quality about Juan is that I couldn't unsee him as Kevin Alejandro in my head:Execution of the story in general was pretty bad. I had comprehension problems with the way Frater described things, but I didn't expect so much when I realized this book was a self-published deal. And it's no wonder. Gawd."}, {"userName": "Buggy", "userReviewDate": "Jul 03, 2011", "userURL": "http://www.goodreads.com/user/show/3099666-buggy", "userReview": "On the heels of my Walking Dead obsession, THE FIRST DAYS fit the bill perfectly and I would recommend it to anyone who’s a fan of the zombie genre. From the very first page I was hooked, I mean how could you not be both intrigued and freaked out by passages like this … “Tiny fingers. So small. So very, very small. The fingers pressed under the front door of her home were so very small. She couldn’t stop staring at those baby fingers straining frantically to reach her as she stood shivering on the porch.”  Jeez, and it only gets better too. Fast paced, scary and gore filled, Rhiannon Frater has created an imaginative and haunting new world here and I wasn't ever entirely sure where she was going to go with it. She never lets the pace up either; every chapter has some form of chaos, action or horror involved. Probably because this was first written as an online serial (later self published and now released by Tor books) There’s also hints of humour (mostly in the absurd) romance, and a multitude of new and interesting Zombie personalities. Old granny zombie comes to mind, still clutching her very much alive cat as it tries to claw its way free from her arms. Both the main characters are unique and interesting. Jenni is pretty screwed up and had a tendency to be all over the place (huh?) but I still found it refreshing to read about a zombie apocalypse from the female perspective. (Think Thelma and Louise meet George A Romero) All the secondary characters they contact along the way (living and dead) leave lasting impressions too and I can’t wait to continue on with this trilogy.The story begins with those tiny fingers; they belong to Jennie’s baby who, along with her young son has just been eaten by her abusive husband. All three have risen, transformed forever into ravenous zombies. Just as her husband manages to break through the living room window a truck pulls up, the female driver yelling at her to get in. The driver is Katie, a former prosecutor who has just lost her wife but somehow in the mayhem managed to secure a truck, a weapon and a dog. The two form an instant bond and hit the road, trying to get out of the infested city. With no real plan Jenni suddenly remembers that she has a stepson away at camp so they head out to rescue him. Throughout this read our characters kept having revelations; like sexual orientation or how many members are in the family. This was somewhat annoying but at least it kept me guessing. Before long Katie and Jenni discover the joys of watching zombie heads explode, how the rules (established in the movies) don’t necessarily apply and to what means their world has changed forever. They eventually meet other survivors; a husband and wife team holed up in a gun store and a large group of refugees building a walled fort in a small Texas town -where the girls decide to settle. Here we meet Travis and Juan, the love interests and leaders who set about establishing a new safe community while the dead scratch endlessly at the outside walls and the survivors slowly begin to turn on each other. Cheers 287jb4"}, {"userName": "Kim", "userReviewDate": "Feb 17, 2011", "userURL": "http://www.goodreads.com/user/show/1594906-kim", "userReview": "I absolutely loved this book. Love, love love it.In less than a day, the world dies, when it gets taken over by zombies. Yes, zombies. The idea alone made me laugh as well. Until I read this book. My smile faded pretty quickly.This is the story of two different women, who come from different worlds, who somehow manage to from a bond that runs deeper than blood. Together, they are stronger, smarter, and better. I feel about as fiercely protective of Katie and Jenni as they do of each other, despite their many flaws (god, I love flaws).I've been on the edge of my seat for this entire book, a constant roller coaster of emotions. I felt scared, anxious, nervous, relieved, happy, thrilled, angry, sad, everything. This book exhausted me emotionally and I can honestly say there isn't a single dull moment within these pages. Not one!This is not for the fainthearted. Heads get blown of, intestines are used as accessories, rotting flesh, walking undead,... Full on zombie shit. The author does not gloss over it and it fits the story perfectly.The characters felt very real. They react the way humans are supposed to, by making selfish decisions, as well as very brave ones. Relationships get built fast, but in a way that can only happen in exceptionally extreme situations.What surprised me the most was a scene near the end of this book. The zombies crave the flesh of the living, and will stop at nothing to get it. They are mindless killing machines, who try to get to their goal, whatever the cost. And still, that idea is less horrible, less horrifying, and less disgusting than what a few surviving humans did. It made me sick to my stomach, and that's saying something, if you've been up to your elbows in intestines. I won't say more about it, because I want you to experience this yourself. I recommend this book to everybody. Yes, it's gory, yes there are some pretty disgusting things going on here, but this is a really good story. Please, just read this."}, {"userName": "Carol. ", "userReviewDate": "Apr 15, 2012", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "At the heart of it, aren't most zombie books/movies the same? The crisis starts and the challenge becomes dodging flesh eaters while reuniting and rediscovering humanity. One of the things I love about the apocalypse is that everyone is prey. Division of sexes, ages, races, sexualities all become so arbitrary when it's human versus undead. What do people do then? Further divide or overcome difference?This book? Cherry Twizzlers all the way, baby. You know, you eat one and it's cherry goodness, so maybe you have another because you're hungry and are working a 12 hour shift. Kind of satisfying to chomp on. And before you know it, you've eaten half a bag of licorice and suddenly feel vaguely ill, still hungry and wondering why on earth you ate all that licorice?For a nice overview, check Andrea's review: http://www.goodreads.com/review/show/... She's right, characterization is rather awful. There's numerous logical problems and there's a large helping of zombie tropes. Word choice was simple and at the proverbial sixth-grade level of adult eduction material. There was a terribly awkward four-way love/sex interest. And yet. And yet I still couldn't put it down, except when I had to take a break because I was getting too apprehensive about the hordes of zombies chasing our heroines. I guess if you include zombies, a married lesbian and a German shepherd puppy, I can forgive a lot."}, {"userName": "Ashley - The Bookish Brunette", "userReviewDate": "Apr 30, 2011", "userURL": "http://www.goodreads.com/user/show/4407857-ashley---the-bookish-brunette", "userReview": "OH. MY. GOD. Where do I start? From the very FIRST paragraph- I was hooked!Jenni- with an 'i' is standing on her front porch staring at \"tiny fingers\" trying to claw their way out from underneath the front door. Her terror IS MY terror from the very beginning, as she recounts the events of her family being transformed into flesh eating zombies before her very eyes.Her abusive husband had come home the night before claiming that a homeless man had bitten him, slept on the couch and Jenni was awakened by the terrifying screams of her 3 year old son being eaten by his father. (Literally- I am almost trembling just remembering it.)As Jenni is standing, paralyzed with fear and shock on her porch as her 12 year old 'now ZOMBIE' son is about to break through the window- Katie, a stranger in a beat-up white pick-up truck flies into her yard yelling for her to get in the truck.Jenni barely makes it into the truck as her once precious son, whose last act was unknowingly sacrificing himself to his zombie father in his mother's place.Amidst the chaos that has now claimed the United States, there are few places of sanctuary for the 'living'. After Katie and Jenni risk their lives and save Jenni's step-son, they make their way to Ashley Oaks (Um WIN... Fab choice in names!)In Ashley Oaks... comes Travis (the name 'Travis' says it all doesn't it?) The picture of perfection- but which woman will he fall for? Killing zombies, going on rescue missions... in the midst of a Zombie Apocalypse is there even a chance for romance? There is nowhere to go. There is no escape. The zombies are everywhere. The First Days is terrifyingly realistic and vividly horrifying, this book is feverish and electrifying- AMAZING in every sense of the word."}, {"userName": "Jenni Arndt", "userReviewDate": "Mar 10, 2012", "userURL": "http://www.goodreads.com/user/show/6971133-jenni-arndt", "userReview": "You can read all of my reviews at Alluring Reads.I bought the first days after reading many glowing reviews on GoodReads, I went into it with pretty high expectations. I wouldn't say I was let down per se, but my expectations definitely were not met with this one. The First Days by Rhiannon Frater is about two women essentially banding together to face an unexpected zombie apocolypse. It chronicles their journey to save Jenni's stepson and get to a safe haven in a small Texas town. The book started off with a bang! The opening scene was gut wrenching and heartbreaking all in one and it got me super excited for what was to come.Lets start off with what I liked about this book. I liked the zombie scenes, I liked the girls kicking some ass and not taking any names. There's something about two bad ass chicks warding off hordes of zombies that is just so cool, and those parts of the book were great (I really wish there was more.) Now for what I didn't like. There was way too many filler emotional scenes for my taste. If I had to read about what someone was feeling in that exact moment one more time I was ready to snap. I understand it's a zombie apocolypse and people are going through some stuff and don't know how to deal with it, but I wanted more action and little less emotion. I also despised Jenni, and I mean I loathed her. One day she is witnessing the most horrific thing a mother could ever witness and 24 hours later she has turned into a 14 year old schoolgirl flirting with the first man she sees. Yes, I know she had it rough in her marriage, but something like that sticks with you, for a few days AT LEAST. I found her dialogue and actions to be irritating as all hell. Another aspect that I don't understand is why Katies real sexuality was kept a secret for the first half of the book, why was that necessary? For me the connections in this book felt way too forced and everyone came onto eachother way too strong for me to find it believable.That being said, the action scenes were pretty sweet, but definitely few and far between. I don't think I'll be recommending this one to anyone looking for an Alluring Read."}, {"userName": "Karla", "userReviewDate": "Sep 17, 2012", "userURL": "http://www.goodreads.com/user/show/3024056-karla", "userReview": "4 Disturbing Intriguing Stars!\n\"So small. So very, very small.The tiny fingers clawed desperately under the edge of the door.Straining fingers. Straining to reach her.\"Benjamin, please stop,\" she whispered.\" \nThis was disgustingly good! Two women, Jenni and Katie, find each other among the chaos of the walking dead, both have lost everything dear to them. This is the story their survival, finding others who live, and creating a new life in the face of death! Great read anytime, but with Halloween right around the corner...well just sayin'! Very well written, descriptive to the point that I was nearly gagging, but then after a while it became amusing and exciting. I was clutching Kip so tight and wanted to kill the zombies myself...pop some heads! On to book 2...with an ending of \"The worst was yet to come…\" lordy, lordy I can't imagine it could get much more horrific, but I guess it does and I NEED to find out what happens, although I am a little scared for my zombie hunting friends!Thanks Sunny for the rec, not only are you a connoisseur in all things monster porn, you know your apocalyptic fiction too!!"}, {"userName": "Bonnie", "userReviewDate": "Jun 03, 2011", "userURL": "http://www.goodreads.com/user/show/5136858-bonnie", "userReview": "Interested in more of my reviews? Visit my blog!No one… except for Rhiannon Frater. Her vision of a Zombie Apocalypse was far more gruesome, gory, slightly funny and violently delightful. The CharactersKatie is an ex-prosecutor (in pre-zombie days) who was married to the love of her life, Lydia. When Katie drove back home to get Lydia, well… Lydia was in the front yard chewing on the mailman. So, Lydia didn’t make it past the first day so Katie flees and seeks shelter somewhere and ends up running into Jenni.Jenni (with an i, and don't you forget it) is a stay at home mom who was in an abusive relationship and mighty unhappy with life in general. When she wakes up the morning the zombies first rose, she discovered her husband shoving chunks of her baby’s flesh into his mouth. Not exactly an ideal situation to wake up to first thing in the morning! There’s also a moment involving tiny fingers that will make several appearances throughout the book. I’ll let you discover that for yourself.Jenni kinda drove me nuts. She was so odd sometimes, being a completely freaked out whiny chick one minute and then laughing maniacally and stabbing zombies in the head the next minute. And ironically, Maja and Wendy both claim that Jenni reminds her of me, minus the craziness. Suuuurrrreeee, guys.Katie was odd too and I think the writing focused entirely way too much on her ‘lesbianism’, not that I’m against it, it’s just the town and the people had wayyyy too big of an issue with it and it kind of started to wear on me after a point.Insta-Love and Love TrianglesBut of course some insta-love and the occasional love triangle needs to be tossed in, why not? Insta-love pretty much makes my eye all twitchy so when this situation developed I was quite irritated. Not only was their insta-love but a love triangle to boot. I? Was not a happy camper. So we have Jenni who falls madly in love with Travis (instantly) and OF COURSE Travis loves Katie (instantly). *yawn* Where’s a zombie when ya need one? But once Jenni realizes that Travis loves Katie she (instantly) falls for Juan and they end up hooking up in a janitor’s closet. Hmm… need I say more? I think not.The WritingSo I didn’t realize this until I was towards the end of the book that this was actually a self-published novel (there is a newer published version that's super shiny and new for those of you who are interested), which I can see in retrospect. It’s definitely one of the better self-published novels that I’ve read and I did really enjoy it. The action scenes were spot on intense, scary, and extremely ghastly. Once the book began focusing on the living and everyone was settling down building up walls and doing all kinds of normal stuff… the book went a little downhill for me. The interactions between the characters weren’t all that natural and it came out sounding stiff and unbelievable at times. I began hoping that a zombie would show up and eat someone.The first half of the book (or so) was a solid 4 stars for me but the second half really lost some steam so I’m settling on a solid 3 star rating. The ending wasn’t exactly a clean wrap-up so I feel like I stopped at the end of the chapter, rather than the end of a book. Will I be continuing the series? Most likely."}, {"userName": "Amanda", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/11430190-amanda", "userReview": "Amateurish, badly written and repetitive. Premise: My kids got eaten and turned in to zombies but he has such a nice ass, she giggled to herself."}, {"userName": "Karen", "userReviewDate": "Jan 21, 2012", "userURL": "http://www.goodreads.com/user/show/5927906-karen", "userReview": "I really wanted to like this book. The imagery is striking, but the writing left a lot to be desired. It felt barely edited, and the quality of the writing kept pulling me out of the story. I couldn't stay interested because from the beginning, small details kept confusing me. The whole part with the baby fingers under the door was so convoluted. We kept jumping from the husband to the other kid to the baby and how she felt about the house and random mentions of blood and it felt way overdone. This attempt at dramatic exposition fell flat. Instead of drawing me in, I felt uninterested and really unimpressed. Pros: Like I said, liked the imagery. In particular, Katie chased by zombies down the highway between vehicles full of people who have no idea what's going on and Jenni standing on her porch watching her family claw at the doors and windows. I really wish it had been written better and with a lot less of the wooden dialogue and inner monologue. I might have enjoyed it then."}, {"userName": "Ian", "userReviewDate": "May 15, 2013", "userURL": "http://www.goodreads.com/user/show/6703235-ian", "userReview": "This book reminds me of so many movies. It’s Thelma & Louise meets Mr & Mrs Smith meets Pulp Fiction meets The Killer meets The Day of the Triffids. It’s something of a Bullet Ballet with two very cool heroines killing zombies in just about every way imaginable. Everything from bull bars to shovels and of course bullets. There is so much carnage in this book that it becomes cartoonish which is pretty much par for the course with zombies. It’s over the top, up in your face, and pretty damned funny."}, {"userName": "Carolyn  Storer", "userReviewDate": "Apr 19, 2011", "userURL": "http://www.goodreads.com/user/show/2449271-carolyn-storer", "userReview": "\"The First Days\" is the first book in a new zombie series by Rhiannon Frater. Originally self-published all three books in the series are now being released by Tor US in fairly quick succession. As soon as I heard about this series I knew I had to read it, and squealed with delight when Tor offered me the first book to review - well, you know how much a love the zombies ;)\"The First Days\" is an action-packed, character-driven novel and was immensely enjoyable and fun to read. I had difficulty putting it down. The writing also seemed to get better and better as the book progressed.From literally the first page, Frater pulled me in and never let go. I went on an epic journey with two amazing women and it was scary, funny and exhilarating.What I loved about Frater's writing was her ability to give her characters life. Her portrayal of Jenni, an abused an beaten wife who watches her husband eat her children alive and Katie, a lesbian lawyer who is nearly eaten by her wife, is just superb. I really cared about these two women.The plot is fab too. It's not original in the sense that there are zombies and people are fighting to stay alive, as this has been done before, but the author does manage to give it a breath of fresh air by having two females as her protagonists.Jenni's transformation from a downtrodden victim of marital abuse to that of a gun-toting zombie-killing machine was moving as well as, at times, hilarious. However, although Jenni is definitely unhinged this is shown to the reader through her actions and dialogue - it isn't spelled out to us. We garner all the information we need from the characters themselves and I loved this, it made them more real.Life for Jenni was already tragic before the zombie apocalypse but now it's just downright catastrophic, it's almost laughable. And laugh she does, especially when she's splitting a zombies head in two with a bullet.Katie's character is great too, and if I had to choose she is the one I connected with the most. She's down to earth, strong and independent. She keeps things together and seems a lot more sane than Jenni.Katie and Jenni have a lot of scars emotionally and physically and both are traumatised. But they can certainly look after themselves and they both realise they are stronger than they thought, especially Jenni, but I think a lot of her strength is coming from a little craziness and I'm interested to see if she changes in subsequent books, or if this is just how she is now.The only aspect I didn't like about Katie's character was the sudden change in her sexual orientation - it gets a bit of a shake up half way through the novel and I didn't know about it. I felt as though I had been kept in the dark along with the other characters and I didn't like it. There was no need to keep this aspect of Katie's story secret from the reader and I must admit I felt a bit duped - as I'm sure Katie's friends will when they find out.The other small niggle I had was as the story moved forward it did become a little too focused on Katie and as this started out as a female duo, I missed Jenni.However, these are very small annoyances, ultimately \"The First Days\" had me thrilled, excited, sad and happy as I read the ups and downs of these peoples lives. Characters come and go throughout the novel, but they always leave a lasting memory.Katie and Jenni fight their way through hordes of flesh eating zombies with a dog and Jenni's step son. They eventually find a group of people who are rebuilding their world, even if it's a smaller and more insular one, by fortifying their town. It's a huge effort but most pitch in.Although, as with life, there are the stupid ones, the ignorant ones and the thugs who want to rebel against change and what is happening or don't want to believe that they are now living with the walking dead who want to eat them alive. Some think that all the undead need is a little medical attention *idiots*. This attitude bugs me no end and I always relish when one of them gets eaten, just so I can be smug and say \"see, not medical attention\" ;)VERDICT:\"The First Days\" is just SO good. It's a really fab addition to the zombie genre and I can't wait to follow Katie and Jenni's story with 'Fighting to Survive' and then 'Seige' - if you love strong characters, exciting plot and of course zombies then I'm sure you will love this."}, {"userName": "Jess", "userReviewDate": "Jul 16, 2013", "userURL": "http://www.goodreads.com/user/show/19902521-jess", "userReview": "As a woman with a taste for apocalypse stories, I went into this novel with high hopes. After the first two chapters, I knew I should stop reading but I finished anyway. What spurred me on was the potential this book had - two female protagonists who survive and flourish during a zombie apocalypse? Count me in!Unfortunately, the quality of the prose was severely lacking. Frater often repeats herself and falls into the age-old trap of telling, not showing when it comes to emotion and character development. There are often lengthy asides into a character's thoughts and feelings that are boring and derail the action while failing to advance their development or flesh out their characterization. While Katie had some consistency throughout the novel, Jenni had no clearly defined characterization and behaves in whatever way suits the author's needs in the scene.As for the action, it lacked the true tension between survival and certain death. Some moments were certainly fraught with danger, but overall, things always seemed to work out too conveniently for the ladies. Accepting the impending apocalypse early with enough time to escape the city, befriending a gun store owner and his sniper wife, finding a city with a fully constructed fort right as they run out of gas -- their serendipitous luck leaves much of the action flat and unexciting.The novel also deals peripherally with queerness in Katie, a bisexual woman who choses to pass as gay. Slurs are often thrown her way, and she is threatened with corrective rape more than once. A romantic relationship with Jenni, whom she shares a close friendship with, is played off as a joke. There are some people of color who play minor roles, but their representation relies heavily on stereotypes.With bland characters, bland action, no plot-driven narrative, and poor writing, I will neither be recommending or rereading this book."}, {"userName": "Leea", "userReviewDate": "Jun 07, 2012", "userURL": "http://www.goodreads.com/user/show/2181877-leea", "userReview": "[this changes when she meets and has a connection with Travis. Katie tells Jason, Jenni's stepson that she's bisexual not just a lesbian. I sort of felt that this was a cop-out. That I lost some respect for the integrity of the character, plus I was looking forward to seeing a lesbian written in an positive light.  (hide spoiler)]"}, {"userName": "Brainycat", "userReviewDate": "Jun 01, 2010", "userURL": "http://www.goodreads.com/user/show/3807871-brainycat", "userReview": "I bought the trilogy based on recommendations I found on another forum. I made it 64% of the way through before giving up. It really wants to be a great story, but it gets bogged down by over explanations. The character development reminded me of Robert Jordan - give each character Their One Trait, then never pass up a chance to cut'n'paste The One Trait into the narrative, even if it breaks the flow of the story.The action is thin and predictable, but I kept reading through it expecting the characters to become interesting. Unfortunately, I never felt emotionally invested in the characters, and by a third of the way through I decided I was going to give it another third to become interesting. Not only did it not get interesting, it started reading like a young adult romance. Not my thing, though if the sales figures for Twilight are any indication I must be in the minority.The writing style is very expository. It felt a little droll; like reading an objective recollection rather than fighting side by side with our heroines while society collapses around them. The author 'tells' more than 'shows', which is fine but I like a more vivid, descriptive style in my horror. Obviously, a lot of people like this book so please give it a try. I found it VERY reasonably priced at kobo. Readers like me, who enjoy vivid violence, gore and sex and uniquely quirky characterization will be disappointed. However, if you like your romance and horror \"PG\" I expect you would like this a lot."}, {"userName": "Eva Leger", "userReviewDate": "Mar 24, 2009", "userURL": "http://www.goodreads.com/user/show/1336770-eva-leger", "userReview": "I'm almost at a loss as to what to say here because I know next to nothing about zombies or this type of book. I picked this up for two reasons and two reasons only. One was because the reading challenge I'm doing this spring has a task where I needed to read a sci-fi book. I asked my friend Felicia what she would recommend and she sent me this book. I figured that at worst I would be able to plow through it and at best it would be milding entertaining. I've always been way more of a non-fiction person because it seemed to be more worthwhile in a way, like I was always learning something, that the reading wasn't just frivolous fun. Well, this was an immense amount of fun although I wouldn't call it frivolous at all! I loved it! I can't wait to read the sequel and then the third installment! I was and still am amazed at how Frater was able to make everything, not just some parts, everything, realistic as hell. It scared me. And I mean, it scared me bad. I'm not by nature a jumpy person but this book really got me thinking the whole 'what-if' scenario all throughout. I'm thrilled that I found a new genre to read and I will always remember this book as being the first great zombie book I read! The characters were out of this world (literally), if I had to pick a favorite I don't know where I would start. I like Juan a lot....and Nerit- she's awesome as hell. Katie and Jennie, the two main characters in the first one make the best team and Frater has their personalites matching perfectly without making them the 'same'.The plot line and situations they had to go through were absolutely riveting. I found myself wanting to page through a little bit to \"just see what happened\" numerous times although I made myself wait and the end result was even more delicious. I would recommend this to anyone who is looking for a new genre to get into, anyone who enjoys different types of fiction, anyone who likes horror stories and/or liked being scared, damn near anyone in general really. To not read this would be missing out...seriously. At least give it a shot. Like I told Felicia- I would have laughed in the face of anyone if someone would have told me I'd like this kind of story. Even up until a week ago I'd have laughed my ass off. Hopefully the second is just as good as this one because I can't wait to find out what happens next. The ending of this was just right- she left it so the reader is wanting more but also so you're surprisingly \"full\" too."}, {"userName": "Steph", "userReviewDate": "Dec 23, 2009", "userURL": "http://www.goodreads.com/user/show/2142019-steph", "userReview": "As the World Dies: The First Days is a fantastically scary zombie read that has you cheering the strong survivors until the end in a \"world {that} had slid sideways into hell.\" The story begins with Jenni, ...a strange, strange girl in a strange, strange world\", muttering to herself while watching \"those tiny fingers ... pressed under the door ... tips of tiny fingers raw and skinless\". We quickly come to realize that those tiny fingers belong to her now undead son. Somehow she manages to flee the house and is rescued by Katie, a prosecutor who was rescued by a priest, but is now alone, except for a brave zombie warning dog, Jack. Together they set off to find a safe place to settle and wrap their minds around what's happened. Along the way, the meet some amazing people, all doing what they can to survive. They quickly realize that bite = death and they become the executioners. They are \"the funeral of the world ... the mourning survivors picking up the pieces and finding a way to move on...\" through their guilt of doing what must be done to survive. Jenni, once almost catatonic, has come to almost love her new role as, nicknamed by Katie, \"a deadly Tinkerbell of death\", killing the zombies that remind her of all that she's lost.In the end, Frater writes, \"The worst is yet to come ...\" and I can't wait to read on and find out how the newly formed community deals with the horrors (not just zombies) that remain in this \"new world\"."}, {"userName": "S.K. Munt", "userReviewDate": "Aug 11, 2015", "userURL": "http://www.goodreads.com/user/show/15406032-s-k-munt", "userReview": "5 Zombie StarsThis was just a straight-up good Zombie book, and has basically everything I look for in a Zombie adventure: Lots of time in cars on the highway, lots of foraging, the building of forts and the banding together of people. It's nicely paced- so it goes minute by minute and day by day without skipping large sections of time, the zombies are how zombies ought to be with nothing fancy thrown into the mix, and the writer's got the goods as far as world building goes and paints (what one can only presume) is a fairly realistic account of how things would play out when the shit virus hits the fan.The characters are the best aspect of the book for me. I like the shifting, third-person POV, because it's defined clearly, and the characters whose POV you do get to experience things through are incredibly likeable, albeit, they can get on the whiny side- lots of survivor guilt, guilt over killing humans before they can turn, guilt for the people they couldn't protect… etc etc, but that begin said, still a huge improvement over the uber-male zombie books when no one gives a f%$# about anyone.For all intents and purposes, I think Katie is supposed to be the main character, but it's Jenny who I think really adds some spark to what could have been an otherwise generic story.She's a bit crazy and has a lot of issues, but though her mind doesn't work well- I like the way it works :)It took a while for me to realise that this series was going to be told from a primarily female POV, and was also written by one, and though my husband is a huge fan of this series, he has grumbled occasionally, that the she-power is a little much. While I don't agree that anything the women do can be considered extra-ordinary or uber-feminazi, I will admit that the male characters tend to come down on the 'soft' side of things. (Travis and his gun issues, for instance- WTF?) Nothing wrong with that, because naturally there would be men who would struggle to hold their S$%# together during a Zombie apocalypse too, so I'm not going to blame the two female leads for dwarfing men with their strength. It would take a lot of guts and killer instincts to survive an ordeal like this- and we're reading a story from a Survivors side of things, right? If not, there would be three paragraphs and then a lot of demonic growling…What's wrong with it? Not much. Travis can get on my nerves sometimes (I really like strong men- which is possible without them having to come off as Rambo and Travis can be a bit spineless, so Juan's my favourite) and I had some issues with how quickly Katie rebounded. Okay, you like men and women too, so by all means- have at this new dish now that your wife is dead, but while she was humming and hawing about it being too soon for her to be considering jumping into someone else's arms- I tended to agree and couldn't believe that she was even contemplating it yet. I think maybe two weeks had lapsed between death of a wife, and want of another partner? That's okay in Jenny's 'battered wife' case and would even make sense if Katie's wife was still alive, and Katie's feelings were merely splitting (proving them to be not so strong in the first place)… but the emphasis on her desire for Travis struck me as highly inappropriate for a grieving widow, and didn't make sense given how much time Katie spends grieving, moping, sulking… etc etc over her darling Lydia. As much as I like the emerging relationship, I wish that the writer had left the notion of her having any feelings for Travis- at all- until at least the second novel, and then maybe a month down the line. In the same vein- I don't think that Jenny has mourned the loss of her children nearly enough, and the fact that she forgot her step-son for even ten minutes horrified me. I have a step-daughter and I can tell you that worry for her would be at the top of my priority list despite how much I was grieving or in shock over the loss of my biological children. it sort of made her look like a shitty mother, and I'm wondering if maybe that was the author's intentions. No one's perfect, after all, and Jenny has clearly been in need of a mental tidy for awhile, but I hope this issue is touched on again. In the very least, I'd like to see her go into shock once or twice when encountering a zombie child. I mean, my kids are alive, and I still can't stomach zombie kids in movies. But i digress- these are only minor criticisms in an otherwise awesome story. I'm already onto book two, so it';s a page turner, no doubt, and would like to commend Rhiannon Frater for pulling off an incredibly suspenseful and often nail-biting series, without having to go all game Of thrones or Walking Dead, and kill off all of the important or favoured characters to add to the shock value!"}, {"userName": "David - proud Gleeman in Branwen's adventuring party", "userReviewDate": "Dec 26, 2012", "userURL": "http://www.goodreads.com/user/show/10923016-david---proud-gleeman-in-branwen-s-adventuring-party", "userReview": "Full review to come when I have time to write it, but for now, here's...DAVE'S FINAL JUDGMENT - \nTHE DEFENSE\n - Some of the more shocking and brutal moments will please hard-core horror fans - Author doesn't play it safe and takes many risks while telling her story - The action almost never slows down - The events remains interesting, even when the story really doesn't work, which brings us to...\nTHE PROSECUTION\n - Frequent convenient plot devices may strain the reader's eyes by causing them to roll so much - Lead character Jenny is very annoying - Overall plot is rather simplistic, during which multiple questions are raised with very few of them being answered - Did I mention Jenny was annoying? - Some parts contradict others, giving the impression the author was making this up as she went along  - Seriously, why is Jenny even in this???\nTHE VERDICT\nA passable (but just barely) horror story. Readers intrigued by the rarity of a zombie-survival story being told entirely from a woman's point of view will have some fun with this, even though the author never fully capitalizes on the concept."}, {"userName": "Carol (StarAngel's Reviews) Allen", "userReviewDate": "Aug 16, 2014", "userURL": "http://www.goodreads.com/user/show/6294320-carol-starangel-s-reviews-allen", "userReview": "Ahhh...so I'm jumping back in to the Zombie books again - and what a way to start with this one! It delivered but didn't WOW - it has all the normal cliches of a zombie apocalypse but with an added bonus. Our heroine is introduced as a lesbian and is fighting her inner turmoil over her lost wife and the chance to have a new relationship with Travis. I loved the characters but got really pissed off at some of the townspeople and their narrow mindness over the LGBT lifestyle. It's weird but I found myself connecting more with Jenni than Katie....to me Katie just seemed a bit to serious.Good book overall and can't wait to see what happens next!!"}, {"userName": "Mauoijenn ~ *Mouthy Jenn* ~", "userReviewDate": "Oct 02, 2011", "userURL": "http://www.goodreads.com/user/show/2569271-mauoijenn-mouthy-jenn", "userReview": "I forced myself to finish this as about a little more than half way through I was ready to give up. So not my kind of zombie novel."}, {"userName": "DoodlePanda", "userReviewDate": "Jun 25, 2014", "userURL": "http://www.goodreads.com/user/show/29050708-doodlepanda", "userReview": "[ Her entire family turned into zombies and tried to eat her the day before  and she takes one look at Travis and turns into some fangirling teenager? Just seems strange to me.  (hide spoiler)]"}, {"userName": "Shanon", "userReviewDate": "Jul 18, 2009", "userURL": "http://www.goodreads.com/user/show/1795513-shanon", "userReview": "I have never been afraid of zombies - but I am now! This book is so intense that I ended up with a cramp in my hand because I was holding on to the book so tightly. GOODNESS!Action packed and fast paced. Readers should be warned that it is fairly graphic in it's descriptions. I found the first chapter to be the most difficult to get through so if you can make it through it then you have no worries about being able to handle the rest.Loved the characters and I'm really worried that some of my favorites will be victims in future books. I will be reading the next book as soon as my hand cramp is all healed up ;)"}, {"userName": "Trudi", "userReviewDate": "May 07, 2011", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "[I won’t ever forget those tiny little fingers reaching under the door – so ghoulish! Children are usually exempt from zombie stories, but Frater dares to go there and she does it very effectively. While I will probably forget most of this book, I will never forget that scene. (hide spoiler)]"}, {"userName": "Wendy F", "userReviewDate": "Jan 08, 2013", "userURL": "http://www.goodreads.com/user/show/4019599-wendy-f", "userReview": "[Katie conveniently isn't a 'lesbian' because then you wouldn't have a love story between her and Travis (hide spoiler)]"}, {"userName": "Tanja Berg", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/5935491-tanja-berg", "userReview": "This didn't do anything to me. It's probably more of a 2.4* because of it did not get on my nerves. I didn't like it either. Just another zombie apocalypse and a handful of lucky human beings who realize what is going on (or saved by someone) before they're ripped apart themselves. Katie who's been saved by a vet, saves Jenni in turn. Together they make a run for it in a truck and end up in a small, fortified town. They both get the hots for the same guy, Travis. The clinch: Katie says she's lesbian eventhough she's bisexual. Zombies try to get in. People screw up. Other than, nothing much of interest happens. The characters are cardboard and about as interesting as a carton of milk. I'll have forgotten I ever read this in a few days."}], "description": "Katie is driving to work one beautiful day when a dead man jumps into her car and tries to eat her.  That same morning, Jenni opens a bedroom door to find her husband devouring their toddler son. Fate puts Jenni and Katie—total strangers—together in a pickup, fleeing the suddenly zombie-filled streets of the Texas city in which they live. Before the sun has set, they have become more than just friends and allies—they are bonded as tightly as any two people who have been to war together. During their cross-Texas odyssey to find and rescue Jenni’s oldest son, Jenni discovers the joy of watching a zombie’s head explode when she shoots its brains out. Katie learns that she’s a terrific tactician—and a pretty good shot. A chance encounter puts them on the road to an isolated, fortified town, besieged by zombies, where fewer than one hundred people cling to the shreds of civilization. It looks like the end of the world. But Katie and Jenni and many others will do whatever they have to to stay alive. Run, fight, pick each other up when they stumble, fall in love…anything is possible at the end of the world.", "title": "The First Days\n      \n          (As the World Dies #1)", "url": "http://www.goodreads.com/book/show/13538746-the-first-days", "average": 3.78, "cover": "https://images.gr-assets.com/books/1335926911l/13538746.jpg", "reviews": 1069, "authors": [{"url": "https://www.goodreads.com/author/show/2310121.Rhiannon_Frater", "name": "Rhiannon Frater"}], "type": ["Horror", "Horror", "Apocalyptic", "Fiction", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/13538746-the-first-days", "http://www.goodreads.com/book/show/9648068-the-first-days", "http://www.goodreads.com/book/show/5364009-the-first-days", "http://www.goodreads.com/book/show/11516884-the-first-days", "http://www.goodreads.com/book/show/11036536-the-first-days", "http://www.goodreads.com/book/show/6350211-fighting-to-survive", "http://www.goodreads.com/book/show/6718719-siege", "http://www.goodreads.com/book/show/12295280-as-the-world-dies", "http://www.goodreads.com/book/show/13581917-the-last-bastion-of-the-living", "http://www.goodreads.com/book/show/5966254-pretty-when-she-dies"]}