{"ratings": 7465, "userreviews": [{"userName": "Diane S ☔", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "4+. Powerful and emotionally raw, I have never read anything quite like this before. Pedophiles and the harm they cause, the lasting effects on their victims, whether in family or without, the subject makes this a difficult book to read. As a law student the author comes across a case involving the death of a six year old and the offender, at the time on death row, a young man named Ricky. Although she doesn't believe in the death penalty she is shocked to find how much she wants this man to die. It triggers memories of the abuse within her own family and she sets out to understand​, both Ricky's case and her own family and what lived within the confines of supposed love.This story is so personal, we feel as if we are travelling with her as she makes her discoveries, witness her pain and anguish, feel with her as she tries to understand. The secrets held in her own family, passed down through generations, and her attempt to understand what makes someone sexually prey on others. The subject matter maybe a trigger for some, it is quite vividly presented, often looked at through the eyes of the child she was, absolutely devastating and heartbreaking. I do believe stories like these need to be told, not just as a catharis for the teller but as a way to bring these things out in the open, start a dialogue so others are not afraid to speak. Narrative nonfiction, mixed with a memoir and even some fiction writing, but it is done skillfully and honestly."}, {"userName": "Mike Scalise", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/52317228-mike-scalise", "userReview": "If you are a fan of true crime, this book is excellent. If you are a fan of memoir, this book is excellent. If you are a fan of legal thrillers, this book is excellent. If you are a fan of beautiful language, this book is excellent. If you are a fan of page-turners, this book is excellent. If you are a fan of boundlessly empathetic storytelling and brilliant questions about the meaning of acceptance, this book is excellent. If you are a fan of a scene in which one character manages, maybe, to have sex while in a body cast, this book is excellent. If you are a fan of all of these things together, you have to read this book. It is excellent."}, {"userName": "Elyse", "userReviewDate": "Jun 09, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "\"The Fact of a body: A Murder and a Memoir\".....the title of this book becomes an 'acute awareness' of what this book is about - -the deeper we are pulled into this debut: This book is about a real murder that happened in the year 1992. A six year old child, Jeremy Guillory, was molested and murdered by Ricky Langley. This book is also a Memoir. We get a very personal -intimate -' private-as-private-is', up and close 'factual' and 'emotional' account from what author Alexandria Marzano-Lesnevich shares with us about her life. While the 'facts' are being spelled out to us -- a crime investigation over a 10 year period - and 'specifics' about why, what, when, and how things were for Alexandria Mariano-Lesnevich....become much more than 'facts' to us. Reading this book SHAKES YOU - It RATTLES our insides. One of the most powerful-moments for me -- written beautiful- was 'very' personal. The author had just shared about 'coming out'. She was gay. She was in bed with her partner - in the beginnings of sex. Sex was going terrific- until it wasn't. Alexandria was going under, into a memory. I MUST HAVE READ THIS SECTION 4 or 5 times....a couple of pages.....I've HAD SIMILAR EXPERIENCES......( I'm not talking about sex - I'm not gay and I've never been molested)..... I'm talking about a memory taking you under: - it's a 'strong- stronger than strong' feeling. I haven't had that experience in years..... but I've never read ANYONE describe the experience like Alexandria Marzano-Lesnevich did in this book: \"Where does the mind go in these moments, while the body trembles? For me it is a white-hot slipstream blank-out, the nothingness I have no time and nowhere and no one. It use to be a feeling, a single concentrated excruciating feeling: .........\"I'm NOT GOING TO SHARE ALEXANDRIA'S SPECIFIC MEMORY IN THIS REVIEW..... it's too personal....But......here is another 'part' of this past memory. An overwhelming memory can come on strong taking power away from whatever present moment a person finds themselves in: .....\"But as the years have blotted the origin out - I am grateful- they have a blotted the sensations, too, as though the film reel of the memory has been played so many times it has gone torn and blotched\". It's very hard to put this book down - it's raw - it pulls on your heartstrings - but after I finished reading it - I went back to the beginning and had questions about this excerpt: \"As such, this is a book about what happened, yes, but it is also about what we do with what happened. It is about a murder, it is about my family, it is about other families whose lives were touched by the murder. But more than that, much more than that, it is about how we understand our lives, the past, and each other. To do this, we all make stories.\" \"We all make stories\"......hm??? So what stories were made up in this book? I don't know. It's this line .... \"we all make stories\"... that left me with an 'after-thought' about this book. I was definitely 'sucked in' from beginning to end....but I started to wonder if perhaps parts of this book were possibly overstated. I have no way of knowing but doubt began to enter my mind. I still was turning the pages heavily though! Very unique fusion style of story blending 4 stars"}, {"userName": "Brina", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "Fact of the Body: A Murder and a Memoir is one of the books chosen for the nonfiction book club on goodreads this summer. I enjoy reading mysteries, true crime, and memoirs so I found the concept of this book to be intriguing. In a book that is a mixture of true narrative and personal recollections, Fact of the Body is an intricate web of emotions that come to a nexus when investigating a horrible crime from multiple angles. Alexandria Marzano-Lesnevich had overcome long odds and made it into Harvard law school. After her first year there, she gained an internship at the law offices of Stafford Clive near Lake Charles, Louisiana. The office was the lead defense counsel of convicted pedophile Ricky Langley who had gained a second trial ten years after his first had landed him on death row. Accused of killing and molesting a six year old, Langley's counsel fought to keep him from the death penalty, either with a conviction of life in prison or by reasons of insanity. Marzano-Lesnevich had chosen to enter the law not just because both of her parents were lawyers, but because she was morally opposed to the death penalty; until she became exposed to the Langley case and churned up ghastly images from her childhood. As a surviving twin in a set of triplets, Marzano-Lesnevich barely made it out of infancy. Then the unthinkable happened-- her grandfather molested both her and her two younger sisters. While the images aren't gruesome they are tough to get through, especially for a parent of girls. Scarred emotionally and physically for life, she could never forget the baggage from her past, while her parents and sisters chose to cover up what had happened and move on. It is not my place to question the parenting skills here, but Marzano-Lesnevich's family appears dysfunctional at best, and she became a loner, and later in life could relate to a convicted pedophile like Ricky Langley. Langley himself was the product of a fractured family, his parents and surviving siblings overcoming a horrendous car crash which killed two siblings and left his mother severely disabled. Yet they survived as best as they could, living with family in Iowa, Louisiana. Ricky was a miracle baby but was either abused or ignored as a child. One could almost feel sorry for him that is until he admired to molesting children simply for enjoyment from the time he was nine years old. That Marzano-Lesnevich could relate to him on any level was tough to swallow, and the sections about Langley and the crimes he committed were both repetitive and heinous. As a result, I read fast not because I was excited to find out whodunit but because by the two-thirds point I was ready for some of these gruesome memories to be over. Alexandria Marzano-Lesnevich has created a multi-layered, complicated premise for a book combining memoir and fact. Weaving two different instances of child molestation with entirely different outcomes, she attempts for the reader to sympathize with both the offender and the victim. While this might have worked for me when she described her own story, I had little sympathy for Ricky Langley, as tough as his childhood might have been. Fact of the Body might be ushering in a new eclectic genre of book but the fusing of stories here did not work for me, especially with the sometimes gruesome images. I imagine that if this was not a group read I would not have read it. A compelling story nonetheless, I rate Fact of the Body 3.5 stars."}, {"userName": "Susan", "userReviewDate": "Apr 24, 2017", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "It is hard to categorise this book – partly, it is the disturbing story of a murder, but it is much more than that. Part memoir, written almost as a novel, this is a painful, thoughtful account of a crime and how it affected those involved , but also how it changed the life of author Alexandria Marzano-Lesnevich. The author is the daughter of a lawyer and, as long as she can remember, she recalls being fascinated by the law. At the age of twenty five, she went to New Orleans to fight the death penalty, by interning with a law firm that represented people accused of murder. The author believed her views and opinions were set in stone, but then she meets Ricky Langley, who is facing the death penalty for the murder of six year old Jeremy Guillory. Jeremy was the son of a single mother, Lorilei; who was pregnant with her second child when Jeremy went missing. Marzano-Lesnevich entwines the story of Lorilei and Jeremy, with that of Ricky Langley and with that of her own life. I have no wish to give spoilers in this review and you need to read this book in order to discover the links between those involved. However, this is a book about how the past impacts the present. About how families have secrets and how life is not as clear cut as we imagine it to be. There are grey areas which, unlike in a novel, are not easily wrapped up, completed, finished or put away. We carry our life experiences with us and they colour our opinions, shape our present and influence our future. This is a beautifully written, very moving book, in which every person touched by events are dealt with sympathetically and with respect. I am glad that I read it. I received a copy of this book from the publisher, via NetGalley, for review."}, {"userName": "Emma", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/28602001-emma", "userReview": "Blending the best facets of history and historical fiction writing, this memoir of both the factual and imagined past bring alive the murder of a young boy, Jeremy Guillory, by a confessed pedophile, alongside the author's own sexual abuse by her grandfather. It's not easy reading but it's exceptionally well written. Despite having an opposition to capital punishment that was fundamental to her decision to study law, her introduction to this death penalty case while working as intern led Marzano-Lesnevich to a difficult decision, that she actually wanted this particular man to die. Her personal experience and her obsession with this case interweave as a journey towards understanding.Above all, the book addresses the complexities inherent in evaluating our own histories and those of others. Truth is a slippery concept, our memories change, stories are modified, facts are chosen for the narrative we wish to present or to hide things we wish to forget. As the author says, where we start the story can affect how we feel about the ending. Ricky Langley admits to killing Jeremy, but does it matter if he didn't mean to? What if he was abused as a child himself? What if he abused Jeremy before killing him? What if he repeatedly asked for help, to be put away or killed before he harmed a child, and never received any help? What if he was psychotic at the time? Do these things change how we feel about his crime? In the law courts each side presents the best version for their case, it's the jury's job to decide which is more true. This book asks us whether this things matter and whether someone should die for the crimes they've committed. It asks whether all the extra bits matter. It demands a personal response: what would we do? What do we think? Fittingly, I had a layered and uncertain response to the complexity the author presents. Ricky Langley's crimes made me feel sick, I can only imagine the pain and confusion of Jeremy's experience. His death necessitates a just punishment. And yet, it would never have happened if Langley hadn't been brushed off by multiple authorities when he asked for help. I think Langley knew what he was doing was wrong, I think he would never have stopped unless someone stopped him, and I think someone should have done it before a child was horrifically murdered. Does he deserve to die for that? Maybe. I don't disagree with the death penalty on principle but I wouldn't want to be part of it myself, and that's more than hypocritical enough to be a problem. I leave the book with more questions than answers, about myself as much as anything else. While she has constructed her own narrative for the purposes of the book, Marzano-Lesnevich has tried to be as open as possible about the multitude of stories and sources that form the story as well as the limits of memory. In imagining the bits in-between she has given the reader a clearer 'what might have been' than lists of facts could achieve. It has an ancient precedent, Thucydides sought evidence for his work but also used imagined speeches in his History of the Peloponnesian War, filling them with 'what was called for by each situation'. It allows us to think of the life and emotion involved, arguably as important as bare bones detail. It certainly leaves a lasting impression, and makes this one of the most thought provoking books i've read in a long time. ARC via Netgalley."}, {"userName": "Colin", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/59203070-colin", "userReview": "As I was nearing the conclusion of this book, I dreaded the prospect of reviewing it. As is obvious to anyone who has read the book, its subject matter and the author's personal experiences make it difficult to criticize. So before going further, I would like to make clear that my dislike of the book is not rooted in the author's personal memoir or her meditations on how her childhood traumas shaped her. I truly hope that this book was cathartic for her and enabled her to find peace. If it did that then it more then justified its own existence. Nevertheless, I as a reader I did not enjoy it. Now this in and of itself would not automatically preclude a good review. There are plenty of books that were painful to read but I nevertheless recommend because of the ideas contained within. Unfortunately, my dislike of this book went beyond mere lack of enjoyment and when I finished, I could not help but feel that the book felt shallow to me.This seems really harsh, so allow me to attempt an explanation. Tragedy is really hard to write about. And personal tragedy is sometimes impossible to write about. Here, the author attempts to write about both--one personal, one she encounters as a law school student--and connect the two. This could have resulted in a symbiosis that lead to greater insight into both, but here it just didn't. I work in criminal justice and have unfortunately encountered a lot crimes perpetrated against children. As such, I have repeatedly encounter a phenomena that I sensed here. People who encounter these events want these events to make sense. They want meaning. They want poetry. They want to look at child molesters and find some deeper reason or explanation for such horrors. Unfortunately, that is not reality. When it comes to people and acts like that, its turtles all the way down.This is the nagging problem that made me respond so negatively to the book. The author reminded me of so many people that always seem to cluster around these tragedies looking to transpose meaning on an event that is either meaningless or containing a meaning that is far beyond human comprehension. In my more cynical moments, I call it tourism. This is probably unfair, but it is also the reason the book rang so hollow to me.The author is a victim of a terrible tragedy and deserves understanding for that, but it does not indemnify her from my belief that she took someone else's tragedy and used it for her own ends and desires. She inserts the thoughts and feelings of the participants of this tragedy without ever really knowing them and reconstructs these emotions through, by her own admission, her imagination. This does not appear to be the exhaustive product of countless interviews, but rather her assumption about these people and how they felt. It just seems wrong to me.This may not make a lot of sense, but its how I feel. There are good books written about these sorts of issues, but this one didn't make it. The author is impaired by her own lens of experience, and, as a result, I never felt like she was able to penetrate the matter in a way that rang true. In the end, all the author seems to conclude that no person is the sum of a single attribute or action. While this is certainly an absolute truth, this conclusion is like the book to me: something that seems a lot deeper than it actually is."}, {"userName": "Svetlana", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/68791366-svetlana", "userReview": "This was not a 4 star for me but rather 3.75 **So.. this took me a while to read. What I really enjoyed reading about was the murder that was committed and the disputable reasons behind WHY it was committed. This book also hugely focuses on paedophilia and I believe this is an important read because it raises awareness. One wonders, who can you truly trust? There were times when I had to put my kindle down and contemplate what I had just read, because I couldn't wrap my head around it. Other times I would tear up at the horrific things Ricky Langley (the murderer) had done and the things the author herself went through. It was heart breaking. Our actions, however small, can have a monumental impact on another person's life. It can shape a person entirely. It's like a chain of events - when a number of actions and their effects are linked together, they result in a particular outcome. I didn't give it a higher rating because I felt like the author waffled quite a bit. She went on and on with her descriptions and I'd start losing interest. Nonetheless, I recommend this book."}, {"userName": "Liz Barnsley", "userReviewDate": "Mar 16, 2017", "userURL": "http://www.goodreads.com/user/show/16471876-liz-barnsley", "userReview": "The Fact of a Body was less a non fiction narrative and more a work of art – I don’t think I have been sucked into a book in the way this one sucked me in for a good long while. Alexandria Marzano-Lesnevich writes with such a beautiful, haunting quality that gets over so many layers of emotional depth whilst still keeping it factual and real, that you can one moment be feeling like you are watching events unfold in real time and the next sobbing like a baby at one small sentence that says everything.At the heart of it all is not only this killer, Ricky Langley, but also the author herself as she delves into her own mind and her own history in an attempt to understand that which cannot be understood. She takes you along on a journey of discovery, one of unpalatable realities, poignant self realisation and historical influence, it is at turns heart breaking, utterly riveting and melancholy, get ready to be hooked, unable to look away.The Fact of a Body often reads like a literary thriller, I found myself remembering with a jolt that these were real people living real lives – the author shows the mundane routine of living, alongside the telling events that informed eventual acts, alongside the things that cannot be explained no matter how much we may wish for a reason. Throughout the whole of the telling there are moments of quiet, occasional times you step away from the read and absorb what you have just learned – the historical detail, the absolute compassion with which the author allows the “characters” in this drama to live and breathe on the page is just stunning in its intensity. And we must not forget she is one of them – and does not hide from her own horrors simply lays them bare before us.This is a tangled, beautiful, intelligently told true story that will surprise you, an unravelling of human nature, a truly incredible look at the power of memory, the influences of life experience and that which we hide from ourselves – as well as that it is a truly compelling and absolutely gripping crime story and family memoir.I really cannot recommend this highly enough."}, {"userName": "Barbara", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "WARNING: This review contains information that's mentioned in many discussions of the book, but some readers might consider the revelations spoilers. So - If minor spoilers bother you - stop reading now.\"The Fact of a Body\" melds the true crime story of child molester/murderer Ricky Langley with Alexandria Marzano-Lesnevich's tale of being sexually abused as a child.In 1992, Louisiana resident Ricky Langley killed his six-year-old neighbor, Jeremy Guillory, and - after being convicted by a jury - was sentenced to death. During his retrial a decade later Langley was defended by Clive Stafford Smith, a staunch opponent of capital punishment whose law firm specializes in death penalty cases. This time Langley got life in prison. (Note: Ricky had yet a third trial, years later, and was once again sentenced to life.) After Langley's second trial, in 2003, Harvard law student Alexandria Marzano-Lesnevich - who opposes the death penalty - became a summer intern at Clive Stafford Smith's law firm in New Orleans. During her orientation, the intern was shown Langley's taped confession from 1992, in which the murderer - a diminutive man with coke bottle glasses and jug ears - graphically described the crime.....and talked about molesting children: \"Sometimes I, you know, rub my penis on them.\" Marzano-Lesnevich's mind immediately snapped back to her childhood. She recalled how, from the time she was 3-years-old, her grandfather - when babysitting - would steal into her bedroom. He'd tug up her nightgown, pull down her panties, undo his fly.....and then her mind would go someplace else as she stared at her yellow lampshade. While Marzano-Lesnevich was watching Langley's tape, she wanted the child molester to die. After completing law school Marzano-Lesnevich decided not to practice law. Instead, she became a writer, and elected to tell Ricky Langley's story.....and her own. To make sense of Ricky's life and behavior the author thoroughly researched his history - going all the way back to the courtship and marriage of his parents, Bessie and Alcide. The writer learned that Ricky was conceived while Bessie was in a full body cast after a horrific car crash - an accident that killed two of the Langleys small children. Bessie was drinking heavily and taking a cornucopia of drugs while expecting Ricky - and was advised to terminate the pregnancy. Bessie refused, and gave birth to a boy who had problems all his life. Marzano-Lesnevich narrates the story of Ricky's life. As a child he lived with a semi-invalid mother (her leg was amputated), a hard-drinking father, and four siblings. The Langsley's could never make ends meet and had to move in with Bessie's sister and brother-in-law, devout Pentecostals with a strict spartan lifestyle: no music, no television, no booze (theoretically), and lots of talk about God. Ricky was an odd friendless child who admits that he started molesting younger kids when he was nine-years-old. Ricky claims that he always knew something was wrong with him, and - as a young adult - tried to get help on several occasions, to no avail. Unable to control his compulsions, Ricky even attempted suicide. Finally, at the age of 26, the misfit became a murderer. The summary above is the 'nutshell' version. In the book, Marzano-Lesnevich provides (what feels like) a week by week account of Ricky's life, with admittedly fictionalized components, including: descriptions of what people were wearing; what they were doing; what they might be thinking; what they were looking at; conversations they had; what they were drinking; whether sweat was rolling down their faces; and so on. The author also includes a detailed description of young Jeremy's murder, the extensive search for the missing boy, the police finding his body, and - finally - Ricky's arrest and trials.Alexandria Marzano-Lesnevich's personal story is interwoven with Ricky's tale. The author talks about growing up in New Jersey with two lawyer parents and two siblings - one a twin brother. The family was upwardly mobile, had a nice home, and went on yearly vacations to Nantucket or more exotic destinations. Young Alexandria's parents had an active social life and - when they went out - would ask the children's maternal grandparents to watch the kids. And that's when grandpa would molest Alexandria or her sister Nicola.Grandpa would take out his false teeth, make a scary face, and tell Alexandria he was a witch who would 'get her' if she told on him - which terrified the child into silence. Even so - when Alexandria was about 8-years-old - her parents found out about the abuse when Nicola talked about 'sitting on Grandpa's lap.'The parents learned the truth, BUT NOTHING HAPPENED. The heads of the family didn't call the police, didn't confront the predator, and didn't discuss the situation with the children. Instead, Alexandria's folks pretended nothing had happened. The grandparents still visited frequently, though grandpa was never again left alone with the children. The molestation - and subsequent silence - scarred Marzano-Lesnevich for life and had a devastating effect on her relationship with her entire family - especially her parents and grandparents. When Marzano-Lesnevich got older, the memories of abuse also made it difficult for her to sustain romantic relationships or to be intimate with her partners. Again this is the 'nutshell version.' In the book the author describes her childhood, and much of her young adulthood, in great detail, including the emotional (and physical) damage she suffered - and still endures. It's clear (to me) that Marzano-Lesnevich's mother and father mishandled the situation and compounded the damage caused by the sexual abuse. It's hard to fathom exactly what her parents were thinking, but this kind of 'secret keeping' is probably common within families. After all, to reveal the truth would destroy the grandparents lives. What would your parents have done in this situation? What would you do? (This would make a great topic for book club discussions.) \"The Fact of a Body\" has garnered many stellar reviews and has been heralded as the 'must read' of the summer. That said, I'm not as big a fan as many other people. First, I didn't see a real connection between Ricky's story and Marzano-Lesnevich's story. It's true that Ricky abused children and Alexandria was molested, but the situations aren't analogous.....and the author's attempt to segue between the separate crimes doesn't work (for me). It feels like two separate books have been stuck together, somewhat like an old Reader's Digest anthology. Moreover, the fictionalized details of the narratives - especially Ricky's - seem to serve little purpose, and detract from their versimilitude. That said, I admire Marzano-Lesnevich's extensive research into Ricky's life and crimes. The author spent years preparing to write this book: she read thousands of pages of documents; listened to numerous taped recordings; interviewed people who knew Ricky; traveled to the killer's homes, jobs, and haunts; and even visited the convict in prison.My final thoughts: the book tells two compelling true crime stories and I'd recommend it to readers who enjoy that genre. You can follow my reviews at https://reviewsbybarbsaffer.blogspot...."}, {"userName": "Jeanette", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "This is one of the best books I've ever read that cores a murder case which resulted in a death penalty conviction. It's one of the very few which although in the end tone seems to support a strong movement toward making death penalty executions a thing of the past; STILL- it fully reveals the other side of needing and SO wanting that person to be \"not alive\" for the torture and horror that they initiated, and which STILL echoes throughout numberless lives' \"after effects\". And especially for those who HEAR the murderer admit they could and will do it again if not contained.It's a non-fiction memoir and dual bio book that will NOT be recommended for every reader out there, regardless of your age or condition. It just isn't. It's as hard as it gets to read some of this for this kind of \"eyes\" and cognition of perversions. Not in the foulness of the language, but in the core of the perversion habit itself and how it echoes in the physical and mental souls of the victims throughout their lives. Many good people, much more innocent, maybe more sheltered, and vast numbers too fragile or emotional- may not be able to connote Alexandria's own experiences on a horror scale, let alone the murderer's or the victims'. Yes, the victims are plural. Not only Jeremy, the murdered 6 year old tow head. But the dozens of people in Iowa, Louisiana. And all of those of the past too that Alexandria notes in familial fashion for her own background of locations and ancestry. Those past families that added to, abetted, and didn't \"see\". Having done case study work for a degree to counsel- and having also done dispatch in a women's shelter, in which domestic abuse is the main course every single day! STILL! And I use that word- STILL- again! Still, this tale hits the crux of abuse to children in degree more than I heard- as much as it also sees a particular murder in all of its layers to a point that is seldom reached in print. And never within \"intake\" documents or bureaucratic pages of police procedural, either.Do I like how Alexandria relates her own case and memory? Sometimes not. But it IS hers and she tells it more harshly in parts and with more specific detail than I would wont to read or hear. So that, quite apart from the murder particulars, is something that should be warned about in this review. This is NOT for the cozy mystery or chick lit reader fare of dysfunction material. Not for those who are offended or sickened by an animal or child neglect episode or some such other retort of profanity squabble related to it. Because this describes and surrounds a human void AND an entire child sexual abuse family pattern of 3 to 4 generations (maybe more?). In real life, as it was. As it covers living people's emotional self-identity now too. And also the system of association (some would say \"the village') which has here (and often in my own individual case patterns it was quite like this- THAT exact collective \"we think\" mentality/ mores) than enables a certain cultural/ habitual \"eyes\" pattern. A context which has more than a strong occasion to \"not see\" or \"self explain\" with considerable rationalization for a quizzical self sensibility when things seem \"off\" or \"funny\". Because the everyday looks \"normal\". And as result? Emotional feelings and love connections of other bonds then overpower for and in a group, extended family or entire surrounds neighborhood- which then holds a tilted scale of skewed moral compass to the truth of what is going on. Blindness in cognition and in actions for something that is too difficult to accept as a connection to the more visible \"kind\" or \"nice\" member or bonded beloved of a \"friend\" group.It's written in a layered style that is so onion like that I find it hard to describe. You are in dozens of time periods and for at least 4 family groups in all these exact eras and childhoods. And for most of the copy, I would say nearly a third of the copy- you are within child's \"eyes\". It is usually Alexandria's memory but at times it can also be others who are now adults or ancestors or descendants. Time is entirely fluid. As Alexandria notes again and again- there is no specific \"time\" that is \"now\" for her. She is all of the \"body\" (her body in which she lives) of before and the after effect of the future too- all combined at once. She is never completely present tense. She is now a writer. And I can't tell you much about her as a young lawyer approaching a career in defending murderers against a death penalty without giving you major spoilers. So I will just say that the read itself may seem hard, confusing, and for some possibly incomprehensible. Because it surrounds humans in conditions that are what I would describe as having/owning vast voids in their entire make up. In both the physical/mental, and psychological make ups. More than having a disease or DSM5 condition or dysfunction. It is what it is only. And what it is, it will ever be. And it's forever embedded too within learned layers of protective disguise for being what it is and wants; there is little of themselves (people of void and failures embraced) that exists apart from it. If you are the person who believes that all humans are redeemable by their very natures or that justice can be approximated in a much larger society? You may be compelled by this read and interested- but I wonder if you would be able to grasp some of its base \"conclusions\". Or if you will just question them as Alexandria's progression does? Alexandria made the correct decision about her life's work in the long run. She is an excellent writer. And beyond honest and approaching hero brave core. Unlike her sister, or the murder victim's Mother, she is really able to look directly into the light of the real actions committed. In her case, it is probably a very good thing she can.This is one of those non-fiction books in which you are THERE with Alexandria. So watch out for scars. And keep your own eyes open for all the details, connotations of giggles, \"joking\" or any of the stranger or loved one fall out you notice in patterns. Not just in this book, but in your own life, as well. Some of us have been so lucky in that our birth family, or wider community, or our societal \"troop\" of our upbringing- was majority offensive blabbermouths. This I do know. Mine was dozens and dozens of people who had common moral compass plus immense aversion to quiet and mannerly or any custom habit of secretive and insular social interchange. That Grandmother who heard that creak of the stairs! Save us all from such positions of dependability on others or from such wonderful 5 or 6 decade length marriages. Please!It's TWO life stories. But it also is far more. Lastly, I have to say this as a disclaimer. I believe in the death penalty for two reasons and neither of them are revenge. But the first and strongest is that it ends the course towards MORE victims. It is the only one that does."}, {"userName": "Imi", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/3126915-imi", "userReview": "\"[B]ut over time is starts to feel appropriate, somehow, that I can't find the house. The feeling is like chasing a memory that slips from your mind just as soon as you start to grasp it. Sure, it's dangerous to read metaphor into life; sure, it smacks of a desire to read meaning into cold fact, but doesn't all of this?\"\nThis book made me feel so terribly uncomfortable right from the start. And by uncomfortable I don't just mean in terms of the subject content, which, yes, is disturbing and harrowing to read, and rightly so, but I mean I was uncomfortable with how Marzano-Lesnevich chose to present the so-called facts. If The Fact of a Body had purely been a memoir focused on the author's horrific experiences in childhood, I would have been just as disturbed, but not as uncomfortable. Instead, Marzano-Lesnevich writes about two different families, two different \"stories\"; firstly, her own family's story of the author as a victim to sexual abuse as a child, and, secondly, an unrelated story about a convicted paedophile and murderer, Ricky Langley. This is narrative non-fiction and Marzano-Lesnevich has tried to create a comparison between the two real life crimes. This fictionalising of real-life people and events (the author writes as if she imagine the internal thoughts, emotions and motives of real life people) is where I have a huge problem. Like I said before, if this had been just a memoir, I could perhaps have accepted this narrative style, although I still think some of her family members may have taken an issue with her writing in this way. Some parts of the \"memoir\" section of the book were really strong, where I felt huge sympathy for the author and her struggle to come to terms with what had been done to her, and her desperation for her family to acknowledge the crime. However, I really did not like the fact that Marzano-Lesnevich uses the same narrative style while trying to find \"meanings\" and comparisons in other people's lives, namely, Ricky Langley's and his victim's family's. I'd agree with her own words that \"it's dangerous to read metaphor into life\", and I'd go as far as to argue that here it feels exploitative. Maybe I am being hypocritical. I've been thinking about it for a couple of days, and it's true that, for example, I've watched \"true\" crime TV series where an event based on people's real lives has been fictionalised and presented on screen as fact. Is that any less exploitative? Maybe not, but I'm just explaining why I felt so uncomfortable with how this particular book dealt with people's lives while being marketed as non-fiction and \"fact\". It's tough being so critical about a book that is clearly really personal to the author, and I hope, at least, writing this out has helped her somewhat, but I can't lie about my mixed feelings about it and I am not sure I would have read it at all had I known what I was getting myself into."}, {"userName": "Sarah", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/18894476-sarah", "userReview": "The Fact of a Body: begins way before Alexandria starts working at a law firm. Her parents were both lawyers and she has always wanted to be one. She begins a summer job in Louisiana to help defend men accused of murder. She is staunchly against the anti-death penalty and thinks her position is clear. But as she is doing research, the moment she sees Ricky Langley's face on the screen, she is overcome with the feeling of wanting him to die.This book is powerful and emotionally raw. I have never read anything like this. Pedophiles and the harm they cause, the lasting effects on the victims, whether in the family or without, makes this a difficult book to read. As a law student, the author comes across a case that triggers memories within her own family and what lives within the confines of supposed love. She seeks answers.As we travel with her and witness her discoveries, we also witness her pain and anguish as she tries to understand. The secrets held in her own family, passed down through generations, and her attempt to understand what makes someone sexually prey on others. Th subject matter may be a trigger for some. I trudged through this book, even though it was very well written. It's devastating and heartbreaking, but it is done skillfully and honestlyI do believe stories like this need to be told, not just as a catharsis for the teller but as a way to bring things like this out in the open.I understand that the author was looking for answers and sometimes you just don't get them from the people you need them from.I don't understand why a parent or parents would not \"do the right thing\" in a lot of these circumstances. It can be doneWhy would you not want to protect your child from hurt that lasts a lifetime ? This was by far the most difficult review I have ever written."}, {"userName": "Book Riot Community", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/33447134-book-riot-community", "userReview": "I mention this on the podcast several months ago, but I just want to reiterate how amazing this book is. Marzano-Lesnevich went to Louisiana to help work with prisoners on death row, and instead found herself questioning her opposition to the death penalty when she came across a particularly heinous crime. Her investigation into the case led to reopened memories of her own childhood trauma and forced her to face some painful truths. (This book is fascinating and beautifully written, but please be aware that there are some really brutal, possibly triggering things discussed in it as well.)Backlist bump: No bump, just advice to mark down After the Eclipse: A Mother’s Murder, a Daughter’s Search by Sarah Perry now, because WOW.Tune in to our weekly podcast dedicated to all things new books, All The Books: http://bookriot.com/listen/shows/allt..."}, {"userName": "Julie Christine", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/1213607-julie-christine", "userReview": "In a braided narrative that weaves true crime with memoir, Alexandria Marzano-Lesnevich untangles the notion of proximate cause and the reality of personal perspective, and exposing the law as a mutable animal, born of bias and propelled by coincidence.Marzano-Lesnevich was a young Harvard law student in 2003, interning for a Louisiana firm that specialized in defending death penalty clients, when she encountered Ricky Langley, convicted of the murder of six-year-old Jeremy Guillory a decade earlier. While viewing a videotaped interview with Langley, who may or may not have sexually abused Jeremy before killing him, the author was overcome by a single thought: she wanted Langley to die for his crime. Her visceral reaction to a convicted child killer, one whom her law firm was fighting to keep off death row, led to an internal journey which resulted in The Fact of a Body. Marzano-Lesnevich and her sisters endured years of sexual abuse by her grandfather, a fact that was eventually known by her parents, yet never openly acknowledged. The abuse stopped, but the grandfather was not held accountable, his crimes against his granddaughters left a festering wound within the family. I was fascinated by the author's rendering of the Guillory murder and Langley's journey from childhood to death row. A legal mind and a creative vision melded together to create a story, much of it imagined. The author assumed characters' voices and perspectives, blurring the lines of fact and fiction to tell a riveting story. It is the central premise and irony of this book: proximate cause is ultimately what the law determines as the first domino to fall in any given situation. It is what all storytellers do-determining where a story begins and crafting a plot that seems inevitable. Because so much of Langley's story was reconstructed, fictionalized, it was hard for me to accept much beyond the face value of the story, and this diminished the emotional tie to Marzano-Lesnevich's own narrative—the connection felt strained and overwrought at times. But again, this brings the reader back to the author's underlying thesis: what is the law but the crafting of stories to make a point, to win or defend against accusations in the absence of irrefutable proof. In examining and exposing her own trauma, Marzano-Lesnevich is victim, jury and judge of a case that will forever be unresolved in the court of her and her family's hearts. The murder of Jeremy Guillory also remains an unfinished story, the truth dying with a child whose voice was silenced by a killer with a story of his own."}, {"userName": "Purple Country Girl (Sandy)", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/4150505-purple-country-girl-sandy", "userReview": "I received a copy of The Fact of a Body from the publisher, Flatiron Books.Honestly, The Fact of a Body is not the type of book I usually read and I probably would never have considered it if I hadn’t been sent a copy by the publisher. I don’t like reading about pedophiles or about any type of abuse or violence against children. I’m not really into true crime and I rarely read memoirs, especially those dealing with abuse. The book is a combination of all this and more - part memoir, part true crime, part legal thriller. There is also a bit of fiction as the author recreates moments from the past where there is no record of what happened and where she was not present.The main focus of the book is the author, Alexandria Marzano-Lesnevich, and a convicted child murderer and pedophile named Ricky Langley. Alexandria grew up the child of two lawyers and became a lawyer herself. She is adamantly anti-death penalty and when she starts an internship in Louisiana at a law firm that specializes in death penalty cases, she is shown Langley's video-taped confession. When she sees this man confess to doing horrible things to children, she flashes back to her traumatic childhood and she knows that she wants this pedophile and murderer to die. Her beliefs are turned upside down and she decides to delve into the case files and into this man’s childhood. In doing so, Marzano-Lesnevich’s past comes into play and it definitely affects the way she looks at Ricky Langley.In looking into Ricky’s past, the book takes a bit of an almost historical fiction tone as Marzano-Lesnevich has to fill in missing pieces and create dialogue and inner thoughts for Ricky and the people in his life. While what she creates is believable, I found it a bit odd in a memoir/true crime book. I understand her reasons for using this method to tell Ricky’s story but something about it bothered me. It’s an extremely personal story for Marzano-Lesnevich as she recounts the trauma of her youth and the lack of supportive parents. I was angry a lot when reading the sections about her childhood. I was repulsed by Ricky at pretty much every turn. Overall, I was really uncomfortable reading The Fact of a Body. It's definitely a powerful book and Marzano-Lesnevich does a great job of bringing these two stories to life, even if they are both incredibly disturbing. While I didn’t always agree with the fictionalizing of some of the events and people and I didn’t always feel the two stories truly connected, I think The Fact of a Body is a well-written piece of true crime and a very personal and brave memoir."}, {"userName": "Jessica Woodbury", "userReviewDate": "Dec 06, 2016", "userURL": "http://www.goodreads.com/user/show/4271946-jessica-woodbury", "userReview": "Writing true crime nonfiction is a delicate task. I don't think most authors in the genre treat it delicately enough. I used to be a public defender, so I don't tend to romanticize crimes or criminals, to me they are regular people, not all that different from anyone else. Victims are just people, too. But in true crime sometimes it feels like it is not about real people and instead it's about characters and stories. I have trouble reading that kind of book because I cannot forget that these are real people and I tend to cringe and feel uncomfortable as their whole lives are spilled out for public consumption.So I was a little skeptical when Flatiron Books sent me The Fact of a Body. But in Marzano-Lesnevich's combination memoir/true crime, every single person is handled with such delicacy and respect that reading about them feels more like an act of connection and communion than bystander gawking. I read another combination memoir/true crime a few months ago whose title is not worth mentioning. It was such a failure that I wasn't sure what a successful version would look like. But Marzano-Lesnevich has done it. As an intern at a capital murder defense firm, M-L encounters the case of Ricky Langley on her first day. She becomes obsessed with the case, and it seems an unlikely obsession: Langley has killed (and likely molested) a 6-year-old boy. In the book, M-L slowly begins to share stories of her own life, transporting us to what appears to be a happy family with her parents and 3 siblings. It is not spoiling much to reveal that M-L was molested as a child, it is the only real explanation for her particular obsession with Ricky and the boy he killed, Jeremy. But M-L doesn't tell us this for ages, trusting that we'll get lost in the details of Ricky's crime and his own difficult life before we see the uniting thread.Once we encounter the details of the crime committed against M-L, the book takes on a new level of importance and much of what has been shared with us begins to fall into place. Why it's so important for M-L to recreate the stories of everyone involved in the crime, reimagining them and building them for us to discover. And it explains the care with which she does so. She is looking for herself, of course, looking for the stories from her own life and the lives around her echoed. For the most part, the author's recreations feel real and emotionally true. And if they fail occasionally, we never lose sight of the author herself and the understanding of what this story is and why she is telling it to us. This is a devastatingly honest memoir, it's rare a writer opens themselves and their history up to a reader this way. Readers who think they may not be able to read the story of a child murder or molestation should definitely skip it. The author does not overlook details or try to take a rosy picture and these crimes are central to the narrative. As the parent of a boy around the same age as Ricky Langley's victim there were several moments where it hit me in the gut, even though I have read my fair share of police reports and don't get easily rattled."}, {"userName": "Emily", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/49847688-emily", "userReview": "I'm leaving this unrated because while it was in many ways a beautiful book, it's also the most upsetting book I've ever read.Obviously, content warnings abound. This book contains child molestation, sexual assault, murder, abuse, among other things.Because Marzano-Lesnevich contrasts the child molester and murderer with events in her own life, there is an intimacy throughout the story. I've read true crime before, I've seen true crime documentaries, but because this book's structure it felt so much more personal, and therefor so much more horrifying. Marzano-Lesnevich writing feels quiet. It's this quiet that left me feeling so devastated. I'm not sure if I would recommend this. It's beautiful, but it has left me unsettled in a way that no other book has."}, {"userName": "Eve", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/1283951-eve", "userReview": "\"No one story is simple. No one story is complete.\" –Alexandria Marzano-LesnevichWow. This book really put me through the ringer. I wish that I had realized that the whole of this book would be difficult to read. In most true crime books I've read thus far, the gritty part is found at the beginning, and the details in catching the culprit take up the rest of the reading. Not so in this case, which is a true crime work wrapped about a memoir. I am so happy about how this \"project\" turned out for Marzano. You can tell that it served to help her work through her childhood trauma. My only quibble was what I felt could have been better editing. I kept finding so many errors throughout...and I wasn't reading an ARC. What a disservice to the author. That being said, you should probably read this."}, {"userName": "Matthew Quann", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/22699228-matthew-quann", "userReview": "I finished The Fact of a Body audiobook late last week, but I've been putting off writing the review for a whole weekend. This book was difficult for many reasons, but largely because of the disturbing topics with which it deals. A trigger warning then: this is a nonfiction novel that deals with sexual assault, murder, and pedophilia in overwhelming detail. This is not to say that it is not well-written, or that it does not provide a challenging examination of abuse; however, it does not deliver the Serial-like mystery its synopsis suggests.Alexandria Marzano-Lesnevich has written a book that is so raw that I was only able to listen to it at first in 30-minute bursts. Anything longer seemed to drag down my mood with its heavy subject matter. The book is follows two stories: that of the author and the murder trials of known pedophile Ricky Langley. In addition to the harrowing nature of Langley's crimes, Marzano-Lesnevich also details the abuse she suffered at the hands of her grandfather.Though the two narratives seem at odds with one another, Marzano-Lesnevich describes her aims later on in the book. Roughly, can Marzano-Lesnevich understand her own familial trauma through the lens of Ricky Langley and the peculiarities of his case? It is here that the book failed to come together into something that I wanted to come back to on a daily basis. In addition to the dissection of multiple incidences of pedophilia and the awful fallout that comes of them, there's the sense that the author will never be able to find the answers for which she searches. Trying to wrangle and weave all of two histories into an emotionally comprehensible whole is an ordeal on its own, but by tackling such intense subject matter, the story is further complicated.It's my opinion that this is partly the author's intent: life is messy and doesn't give you proper answers, so why should narrative nonfiction that is true to life be any different? In theory, I agree with this approach, but practically, it made me feel a bit like I was a fly on the wall of someone's therapy sessions. Additionally, I was a bit put-off by some of the liberties the author takes in order to put a more poetic spin on some of the players' perspectives. This will bug some of you less than me, but it is my belief that nonfiction should rarely decide to dip its toe into interpretation of a person's inner monologue. One can't help but feel churlish in writing a review that takes aim at what is such a personal outpouring of emotion, thought, and belief. For some readers, I can see this being a book that will challenge and further the discourse for survivors of sexual abuse. I'm glad for the insight it has provided me, but I would be lying to say it was an enjoyable listening experience. It wasn't for me, but it might be for you. Finally, I commend Marzano-Lesnevich's courage and candour in the writing of this book, and I hope that she has found some solace from its writing."}, {"userName": "Wendy", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/1418580-wendy", "userReview": "I cannot imagine writing a non-fiction/memoir especially when the author has to step out of her comfort zone in order to do so. Not an easy read but I appreciate the amount of research and time that went into this book. The subject covered was depressing and disheartening.Not only was it a difficult read because of the murder involved but also Alexandria's memoir described a sad and difficult childhood. Both stories do support each other.I felt the stories to be scattered which made presenting the information disjointed. However, I found this book to be well-researched and one that I would recommend."}, {"userName": "l a i n e y", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/10752235-l-a-i-n-e-y", "userReview": "If you're one of those lucky people who still have solid faith in this thing called 'family institution', I caution you before picking this one up - the disillusionment may never be undone."}, {"userName": "Judy Collins", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "The Best Books of 2017Alexandria Marzano-Lesnevich weaves an emotional, gripping— beautifully and intelligently written debut; a haunting work of art— THE FACT OF A BODY  A Murder and a Memoir.  A cross-genre,  an extraordinary mix of literary, memoir, true-crime, legal, mystery, suspense, and historical in one powerful story—traveling between a murder case and the author’s own personal childhood tragic abuse.  A story that demands to be told. When the two begin to mesh together, the author begins her journey for answers.  A tale of two crimes.  In 1992 Louisiana, Rick Langley (26 yrs. old) brutally murdered a (6 yr. old) boy, Jeremy Guillory. This was not the first time his name was in the news. A pedophile, he had served time in Georgia for molesting a girl. In 2003, Alexandria Marzano-Lesnevich  (Harvard Law), was working an intern at a law firm. The firm was defending Langley in his death-penalty appeal. No stranger to the law, both her parents are prominent New Jersey lawyers. For some reason, she feels a strong pull to this case. She becomes obsessed with learning more about this case, yet it seems to bring out strong emotions about her own life. A shameful secret buried by her family.  Her family was opposed to the death penalty, but yet she wants him to die. She must define, and make sense of this strong feeling. In this harrowing,  raw, and emotional journey, the author pieces together the story of murder, and her own personal story. Courageously she steps out of the darkness and silence, with the accounting of her own sexual abuse as a child by her grandfather. The story begins. A grandfather  who made his way up the steps and into their room. The two sisters. She recalls when she told her parents, they did nothing. Love and hurt. How to be safe. Did the grandmother know? They did not want to embarrass or shame the family, damper careers, or hurt the grandmother. They only attempted to keep the grandfather away and move forward as though nothing happened. The case triggered  deeply buried ugly evil and damaging secrets. The unpleasant truths.  At the same time, she begins to dig further into the scars while attempting to understand Langley and her own abuser (her grandfather). What caused them to be monsters? Whom to blame? A journey of self-discovery for over ten years.  Leaving the law behind to begin her intense work. There is a story to be told. To be uncovered. A message. Heartbreaking, moving, and gripping. The darkness of sexual abuse. The blackness of her own family. In the process, there are even more family secrets which are unraveled. The astounding and shocking conclusion.  Her family buried the abuse. The painful emotional scars turned into depression and eating disorders. Shame. Probing questions. How will the events from the past affect her relationships in the future? How many times  has this occurred in other families? Is it passed down through generations? At what point could have the abuse ceased? When the person reaches out for help. The abuser and the victim. Through generations, what breaks the patterns? By hiding the abuse, what is gained? What is lost? Can mercy be shown? Forgiveness or acceptance? “Is what happens in a family the problem of the family, or the problem of the one harmed by it”? There is a cost.  Thought-provoking,  the author’s writing is spellbinding. A highly-skilled writer, meticulously researched; hard to believe this is a debut. A cautionary tale. Guard your children. Marzano-Lesnevich  became a lawyer because she believed that the law simplified and made sense of stories; however, are they too complicated to be contained? Can the abuser be a victim as well?I purchased the audiobook for my personal collection, narrated by the author. Her performance was outstanding. Raw and emotional. Exposed. The author having to relive five years of pain. How do you get past the hate? Even though I had read the book back in May when it came out and rated it 5 stars, I was sidetracked with my dad’s illness in NC, as his POA; hiring in-home health care nurses, later Hospice, a car accident, his death, funeral, remaining out of town for a few months; preparing his house to sell, being the executor of his estate, probate, and closing. Later, back home in South Florida, dealing with Hurricane Irma, damages, power outages, and loss of internet. Therefore, book reviews during May-Sept did not get written or posted. When choosing my Best 30 Books of 2017,  (which is a difficult task), realized I had not written my review when linking the book. Immediately this week, have gone back to the audiobook and listened once again to THE FACT OF A BODY.  I highly recommend the audiobook and the second time around experience, was even more powerful than the first. The emotions are real.  A desperate need to understand. Did her parent’s sacrifice their daughter’s welfare for the sake of family stability? Unspeakable crimes. What about Langley? Can the past be left behind? Do we protect the abuser or the victim? A cry for help goes unnoticed. In Ricky,  the author writes her own story. What about Lorelei, Jeremy’s mother? The man who murdered her son? Should he be put to death or spared? The questions and what ifs? Where does the sickness begin? For me,  the author’s personal tragic story is more moving, intimate, and personal than Langleys. Her bravery is commendable and admirable with the difficult subject matter. Vivid descriptions which will remain with you after the book ends. Cannot even imagine having to be around a grandfather which remains in your life, after the unspeakable acts. Mercy. Forgiveness.  Is this humanly possible? An encouragement for others to come forward, which is a timely subject in our cruel world today. An example how we carry our life experiences with us. They influence our opinions and feelings while shaping both our present and future. Award-winning writing and gracefully rendered. Told with sensitivity and compassion,  THE FACT OF A BODY  will leave a lasting impression. Each reader will be left with their own individual thoughts of victim and abuser— where the lines are often blurred.  JDCMustReadBooks"}, {"userName": "Canadian Reader", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/2103966-canadian-reader", "userReview": "This is a memoir driven by obsession: the author's obsession with her parents' silence about her and her sister's childhood sexual abuse by a close family member, as well as her intense fixation on a 1992 criminal case in which a twenty-six-year-old pedophile murdered a six-year-old boy. Marzano-Lesnevich’s personal story—the memoir part—I could accept. It’s the murder part of the book that I had trouble with. The author appears to want the reader to consider the perpetrator sympathetically; the child victim of the crime essentially disappears under the weight of detail about the murderer--much of it apparently imagined and presented in a \"novelistic” manner. This book is grim and oppressive reading; I also thought it was far too long, unnecessarily repetitive, and, at times, a bit too forcedly poetic. I initially rated the book a three, but that rating did not sit well with me. On thinking it over, I really had to rate it lower.The author states that in her mind people remain “persons” no matter what they do. I am less certain. Canadians are well acquainted with the case of 1990s school-girl killers, Karla Homolka and Paul Bernardo, who committed heinous sexual crimes against 3 young teens (one of them Karla's sister) that they recorded on video. Bernardo has dangerous offender status and remains incarcerated for life. In spite of her active role in the crimes, Bernardo’s ex-wife served only 12 years in a federal penitentiary-- because of a plea bargain. Since her release from prison, Homolka has married and had children. Some say she is a changed person. I’m doubtful. A more recent case in Ontario, Canada involved a third-grade child, Victoria Stafford, who was lured from her school at lunch by a young woman and her boyfriend. They sexually assaulted her, murdered her, and then dumped her body in a wooded area miles from where she was abducted.When animals turn violent, they are “humanely euthanized”. However, it is considered inhumane and barbaric to euthanize psychopathic, compulsive, sexually violent humans. Humans are, it is thought, above animals. But are they? According to Marzano-Lesnevich’s book, before Ricky Langley was born, doctors wanted to abort the fetus. His mother had been in a body cast for months after a car accident that killed two of her children. She was impregnated while in this cast. Ricky had been exposed  in utero to innumerable x-rays and a multitude of likely neurotoxic drugs. His mother had also abused alcohol. I cannot help but think how much better it would have been for all if this child had never been born.In light of the Canadian criminal cases I’ve cited above, I was not well-disposed to going over and over the details of a crime the author of this book was plainly obsessed with. The Fact of a Body is competently written. It is also sensational. The author's decision to meld the story of her own abuse by a pedophilic relative with a criminal case that she took certain liberties with—embroidering and fictionalizing aspects of it for psychological and dramatic effect--is questionable. Strangely, although she concludes her book by describing her arrival at Angola--the prison where Ricky Langley is incarcerated--only her greeting of him is described. She tells nothing about how her meeting with him went. A cop out. She also sheds little light on how her understanding of the death penalty may have evolved as a result of her personal investigation into his crime. (In childhood, she says, she was vehemently opposed to capital punishment, yet when she first learned of Ricky Langley’s crime, she did not want him to live.) All we know at the end is that she finds his being sentenced to life imprisonment for second-degree murder an “elegant” solution that somehow addresses the complexity of the situation.Marzano-Lesnevich, who trained as a lawyer but decided against going into practice (it would have been interesting to know why), says she \"fell in love with law\" years before because it allowed the making of a story, “a neat narrative of events,” that “finds a beginning, and therefore cause.” “But,” she says, “I didn't understand then that the law doesn't find the beginning any more than it finds the truth. It creates a story. That story has a beginning. That story simplifies, and we call it truth.” I would say this is a fair bit of fancy intellectualizing. Many of us are under no illusion that the law is linked with or leads to the truth. It's an intellectual game in which attorneys have been known to quibble over the meaning of the word “is”.What is clear is that Jeremy Guillory, a six-year-old child, died because he was strangled--asphyxiated. Ricky Langley could lead the police to the child’s body and explain exactly how the child died. Ricky’s semen was found on the boy’s shirt. That is the truth. What to do with the humans who do these things, many of them remorseless, simply unable to be rehabilitated, statistically certain to re-offend, is the bigger question. Is warehousing them for life the answer?"}, {"userName": "Mel", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/7182738-mel", "userReview": "I feel that first I need to qualify my rating and my response by saying that for many years I worked in both the field of psychology and law, specifically with sex offenders and victims -- both sides of a devastating crime. Marzano-Lesnevich does a fine job of laying bare her own childhood abuse and her adult feelings recalling that past when she is called upon to assist in the defense of a pedophile who murdered his victim. This is an ambitious memoir/novel, looking at an actual crime that was prosecuted in the public eye weighted against the author's personal story. During the process, the lawyer's pursuit of facts collides with her own abuse and becomes a compelling need to look beyond facts. From her life-long search for \"Why?\" she eloquently and profoundly points out that how you begin the story, the casual chain, decides the meaning of the story. But does it change the facts? This is very dicey territory, emotionally charged, dealing with a wide range of physical and psychological issues specific to each individual -- not to an entire group you can lump into generalities. Children that are sexual abused can experience long-lasting psychological damage. They are thrown into a war that they will fight the rest of their life. Imagine the weight the victim of abuse might take upon themselves when they discover their abuser was once the victim. Where and How you begin the story.... Does it begin with the crash, the death of a triplet, the abuse of a little boy that would grow up and molest; the boy who feared and tried to fight his urges? This is the point, when our hearts and brains slam against each other in total conflict...\"hate the crime, love the sinner...\" HOW? Beyond solution, this is where we look to the law to make what sense, if any, what justice, what precautions, what reparations and realize our best efforts are often grossly lacking.It's expected that the reader will have compassion for the child victims -- both the young Alexandria, who now stands before the reader as an interning lawyer, and 6-year-old Jeremy, that was murdered. By the end, will you be prepared to possibly look at that repulsive old *Grandpa* that terrorized his granddaughters and see him as the defenseless little boy being brutally molested himself?  The Fact of a Body: A Murder and a Memoir is not just a memoir, it's a piece of the author. Ambitious, somber, heartbreaking, brave. I respect the courage it must have taken for this author to tell her story. Her self-examination is painful to read. The times she struggles to love the grandfather that cared for her then betrayed her are gut-wrenching. Hearing that little girl try to make sense of such betrayal will affect the reader, so I have to urge some caution: this may not be the book for you to read OR Marzano-Lesnevich's courage and triumph might be a source of support and encouragement.What comes across is a very intellectual novel, almost a given with the author's scholastic achievements. Between the words, I felt Marzano-Lesnevich intellectualizing, sometimes struggling to stay in her head with a story that was experienced on a cellular level. The book is strongest when the moments let the reader feel, rather than having the author micro-manage our emotions with an avalanche of descriptors. When your mind has to read about the buzz in a chest, a tingle in the spine, the shine of a light...you lose control of your own response. I think had Marzano-Lesnevich trusted her readers a little more, reading could have been experienced-- as much as possible with such matters. The erudition became a buffer, sometimes a hindrance. But, I completely admire her talent and choices and share only my impressions without judgment.So much of Marzano-Lesnevich's memoir is emotionally experienced during multiple lives at multiple times that it can be difficult to stay with the author. She is a child, a victim, a lover, a lawyer, a detective, an observer in different lives, and though she transitions well between these roles, you need to stay very clear headed -- hard to do when you are experiencing so much of her journey with your heart. Beautifully written, graciously told, difficult subject matter."}, {"userName": "Renee (itsbooktalk.com)", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/3128281-renee-itsbooktalk-com", "userReview": "You can find all my reviews at www.itsbooktalk.comI've read several true crime books in the last couple years and they all seem to have one thing in common for me...they've brought me to tears and infiltrated my thoughts in such a way that I couldn't stop thinking about the people in the stories. This true crime/memoir has been no different. I like to read while on the elliptical and there was a point in my reading where I just had to take a break from this story and switch to a different one. The author's writing was beautiful and lyrical in a way that I was so fully engaged with the story that when the brutal details of little Jeremy's murder and then the author's own heartbreaking story came front and center, it really hit me in a way I wasn't expecting...hence the needed break. Once composed, I dived back in because while at times brutal to read, this story is also fascinating, haunting, and illuminating. The author doesn't just haphazardly toss out details of Jeremy's murder and Ricky Langley's life and then switch to her own story. Rather, she weaves the narrative by alternating timelines involving Rickey's past and her own. While at times the shift between the two was abrupt and sometimes felt that it occurred mid-thought, overall this narrative technique worked very well to tell two separate stories. Let me back up for a minute and tell you what I mean by illuminating and fascinating. I found the author's discussion of the law in terms of the intricacies of what it means to seek truth and justice, the breakdown of the system (Ricky Langley had 3 trials!), and the inherent problems associated with having shades of gray in a legal system that's set up to be black and white. In addition, the author examines the very real breakdown of the family and criminal justice system in such a brilliant, \"what if\" way that, days later, I'm still thinking about...what if Ricky had a different type of childhood...what if that person at the hospital would've believed Ricky when he walked in and said he needed help...what if we had harsher sentences for sex offenders like Ricky...what if the author's own childhood was different...what if her childhood wasn't shrouded in secrets...what if children's voices were better heard in their own family as well as our justice system?? Of course, we'll never know the answers to these \"what ifs\" and that's what's so haunting. This isn't an easy read by any means and I would guess some readers may not be able to read about the graphic details of murder and abuse. BUT, this is an important story and one that I'm sure many may see themselves in and will benefit from Alexandria Marzano-Lesnevich's honesty."}, {"userName": "The Pfaeffle Journal (Diane)", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/288944-the-pfaeffle-journal-diane", "userReview": "The Fact of a Body is billed as a murder and a memoir, at first glance I thought it was about someone who had personally experienced at murder within the family. But the book took a deceive turn. Alexandria Marzano-Lesnevich was a freshly minted lawyer when her law firm her assigned her to a death penalty case of a convicted pedophile and child murderer, Ricky Langley. Marzano-Lesnevich whom until the time was a stanch anti-death penalty supporter, immediately after watching a video tape of the convicted murderer wants him to die. The book then takes on a strange but interesting twist, Marzano-Lesnevich begins to intertwine her childhood with that of the murderer. As she researches the case she is forced to reconcile her own childhood, giving up practicing law to write. As a child she was molested by her Grandfather, once her parents were made aware of this, they stopped having her grandparents stay in the house. Alexandria and her sister were told not to speak of this, her parents never directly addressed the issue. The book moves between her own troubled childhood and that of Ricky Langley, how society refused to acknowledge the problem the both faced one as the abused and the other as an abuser.The book is well written and engaging. The subject matter is very timely as we now have a political candidate running for office in the United States Senate that has been accused of molesting a fourteen year old girl. He is calling her a liar and is continuing to gain support in the Alabama election which is unconscionable. \nThis review was originally posted on The Pfaeffle Journal"}, {"userName": "Rana", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/11102791-rana", "userReview": "I think that the idea of trigger warnings are often overused but this book must come with one. If you struggle with child sex abuse or PTSD, please be careful with this book. This is an amazing book but one that I would hesitate to just blindly recommend. This is graphic but not often explicit, and certainly not gratuitous descriptions of abuse. The trigger warning really comes into play because the pacing is so spot on, the atmosphere is what made this so emotional, not so much the actual words. There were points where I physically cringed, that I literally had to close the book and move it away from my body. All that being said, holy fuck. This is the best and most beautiful book ever. Ostensibly a true crime, this is really a story about memory and the way that stories are told and change. There is never only one way to tell a story; the truth is who is telling the story, who the story is being told to, where you start the story, what you want the story to mean. One of the most realistic portrayals of abuse and the lasting trauma associated with it. Also one of the most empathetic portrayals of a child sex abuser ever. And the fact that these two came from the same writer? Damn."}, {"userName": "Lea", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/3397530-lea", "userReview": "I honestly don't know how to review this book. I wanted to like it so much, but found the writing somewhat disjointed and clunky. This is an incredibly powerful story, and obviously intensely personal for the author -- it's hard to be critical when you're discussing someone's traumatic experiences; it just seems cruel. Marzano-Lesnevich raises a lot of questions about family ties (both positive and negative) and what we as a society expect from our justice system, reform or revenge. There are no clear answers here. I can't say I liked this book, though I'm glad to have read it. Seeing as I'm in the minority with my review, there are a lot of people out there who would obviously like it more than I did -- I think it's worth giving a try."}, {"userName": "Carlos", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/1701553-carlos", "userReview": "3 1/2 stars. I reserve my review on this one . It has triggers. Read it and draw your own conclusions."}], "description": "Before Alexandria Marzano-Lesnevich begins a summer job at a law firm in Louisiana, working to help defend men accused of murder, she thinks her position is clear. The child of two lawyers, she is staunchly anti-death penalty. But the moment convicted murderer Ricky Langley’s face flashes on the screen as she reviews old tapes―the moment she hears him speak of his crimes―she is overcome with the feeling of wanting him to die. Shocked by her reaction, she digs deeper and deeper into the case. Despite their vastly different circumstances, something in his story is unsettlingly, uncannily familiar.Crime, even the darkest and most unsayable acts, can happen to any one of us. As Alexandria pores over the facts of the murder, she finds herself thrust into the complicated narrative of Ricky’s childhood. And by examining the details of Ricky’s case, she is forced to face her own story, to unearth long-buried family secrets, and reckon with a past that colors her view of Ricky's crime.But another surprise awaits: She wasn’t the only one who saw her life in Ricky’s.An intellectual and emotional thriller that is also a different kind of murder mystery, The Fact Of a Body is a book not only about how the story of one crime was constructed―but about how we grapple with our own personal histories. Along the way it tackles questions about the nature of forgiveness, and if a single narrative can ever really contain something as definitive as the truth. This groundbreaking, heart-stopping work, ten years in the making, shows how the law is more personal than we would like to believe―and the truth more complicated, and powerful, than we could ever imagine.", "title": "The Fact of a Body: A Murder and a Memoir", "url": "http://www.goodreads.com/book/show/32076678-the-fact-of-a-body", "average": 3.85, "cover": "https://images.gr-assets.com/books/1496316115l/32076678.jpg", "reviews": 1411, "authors": [{"url": "https://www.goodreads.com/author/show/15819381.Alexandria_Marzano_Lesnevich", "name": "Alexandria Marzano-Lesnevich"}], "type": ["Nonfiction", "Crime", "Autobiography", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/32076678-the-fact-of-a-body", "http://www.goodreads.com/book/show/34398622-the-fact-of-a-body", "http://www.goodreads.com/book/show/34229882-the-fact-of-a-body", "http://www.goodreads.com/book/show/32816543-the-fact-of-a-body", "http://www.goodreads.com/book/show/39837311-the-fact-of-a-body", "http://www.goodreads.com/book/show/29372989-waveform"]}