{"ratings": 201950, "userreviews": [{"userName": "Celeste Ng", "userReviewDate": "Jul 07, 2007", "userURL": "http://www.goodreads.com/user/show/80835-celeste-ng", "userReview": "It's difficult for me to explain how much I hate this book, and even harder to explain why. I don't think it's just because I hated the main character so much, and in this case at least, I don't think it's because of the weirdness that arises from a Westerner writing about a colonized country.I do know that *part* of my intense dislike for this book comes from how it is viewed by other people (usually non-Chinese). Read the reviews and you'll see one word come up over and over again: \"portrait.\" Says one reviewer, \"In addition to lovely, rich writing, the novel provided much-needed Chinese history, class and culture lessons.\" Am I the only person whose hackles go up when someone refers refers to a novel like a textbook? Of course there is some historical fact in The Good Earth, and in other novels, but I have a serious problem with people conflating (and equating) fiction and history. While there's some truth in the book's portrayal, it perpetuates a lot of stereotypes about the Chinese. What's more, this book has shaped a lot of people's perceptions of China and the Chinese, not necessarily for the better. I know this happens with other cultures--but often to a greater extent with The Good Earth. Do we read Anna Karenina and feel that we now know everything about Russia? Does anyone read Midnight's Children as a straight-up account of Indian history? Yet for some reason, for a lot of people The Good Earth is *it*, the one lesson in Chinese culture and history that they will read in their lives. They end up thinking, \"This is how China IS,\" not \"This is a portrayal of how one part of China was at one point in time.\" Of course, most of the above complaint about this book has to do with the reactions of the people reading it, not with the book itself. But I think there's something in how the book is pitched, and in the narrative itself, that invites that. As a story of love, partnership, and sacrifice in a marriage and family--this book does well. But it's not THE portrait of China that many readers unfortunately make it out to be. For more thoughts on this, see my post at the Huffington Post:http://www.huffingtonpost.com/celeste..."}, {"userName": "Jr Bacdayan", "userReviewDate": "Sep 15, 2013", "userURL": "http://www.goodreads.com/user/show/16587936-jr-bacdayan", "userReview": "There is a gush of red, marvelous, and mysterious blood running through my veins. I am part Chinese. A race that has given me these small eyes and this yellowish complexion. A race that I have associated with frugality, hard work, mass production, internet restrictions, and Jackie Chan. China, I've only been there once as a tourist when I was a bit younger. And as much as I'd like to think that I am familiar with the Chinese culture, I have to admit that my knowledge about that is limited and my views about them a bit stereotypical. My Grandma, the real Chinese in the family, still brings Moon Cakes during the Chinese New Year and we do maintain fireworks when celebrating. We also drink herbal tea at home and have this uncanny favoritism for Chinese restaurants during family get-togethers. Aside from that, you could say that I'm really much more familiar with Filipino and Western cultures. So when I picked up this book, I didn't know what to expect. My only assurances were that it won the Pulitzer Prize and the author is a Nobel Prize winner. The Good Earth by Pearl S. Buck is a beautiful and sweeping story of farmer Wang Lu and his wife O-lan. The Land, the man, and their bond. This beautiful tale left me thirsty and craving for knowledge about this race that resides within me yet has not fully manifested itself. This may sound fancy but I have to say what I feel. This book made me fall in love with China, the Chinese culture, my Chinese roots.“And roots, if they are to bear fruits, must be kept well in the soil of the land.” The beauty of this sweeping tale can be understood by hearing its voice, its message. It whispers an earnest plea of the oldest kind, it whispers \"Remember the land.\" The land which has provided for your father, your father's father, and countless generations before him. In this age of technology, internet, GMOs and fast foods, we forget the land. We ignore the Good Earth that has sustained the lives of everyone before us, and lives of this generation. \"If you sell the land it is the end. And his two sons held him, one on either side, each holding his arm, and he held in his hand the warm loose earth. And they soothed him and they said over and over, the elder son and the second son,Rest assured, our father, rest assured. The land is not to be sold.But over the old man's head they looked at each other and smiled.\" This book, written in the year 1931, exposes a problem that has continually been growing worse as each generation progresses. Each son telling his father \"the land will not be sold\" but inwardly smiling at this statement he knows to be untrue. Each son, each daughter, each generation, saying we will save this good earth. But for every tree he plants, he cuts down two more. For every bottle she recycles, she throws out two more. For every plot turned into a garden, there are two plots turned into garbage dumps. Each man, woman, son, daughter thinking about their self, their success apart from the land. They forget that their success lies with the land. They forget the Earth that has been good to them. “Wang Lung sat smoking, thinking of the silver as it had lain upon the table. It had come out of the earth, this silver, out of the earth that he ploughed and turned and spent himself upon. He took his life from the earth; drop by drop by his sweat he wrung food from it and from the food, silver.\"This book touches a lot of other social issues like Feminism, Slavery, Concubinage, Civil Wars, etc. I will not discuss much of these issues and will only say in passing that a different culture enabled them to see nothing wrong with things we in modern times would consider abhorrent and terrifying. Things like selling daughters, feet-binding, polygamy aren't limited to China as these practices can also be found in other Asian countries. But I marvel at how Mrs. Buck was able to make it feel natural despite all these cultural differences. She effected a normalcy on these weird practices that I didn't once think that I was unfamiliar with them. This speaks of her grace and her skill as a writer. She writes with a natural grace and an earnest plea. I am engrossed by her writing, her message, her book. The Good Earth is a timeless, moving story that depicts the sweeping changes that have occurred not only in the lives of the Chinese people during the last century, but also of everyone who has walked a part of this good earth. She traces the whole cycle of life: its terrors, its passions, its ambitions, its rewards. Her beloved and brilliant novel is a universal tale of the destiny of mankind. \"Out of the Land we came and into it we must go.\""}, {"userName": "Lyn", "userReviewDate": "Jul 18, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "This is almost spiritual in it's beauty and simplicity. First published by Pearl Buck in 1931, this later won the Pulitzer Prize and had a significant affect on Buck’s winning the Nobel Prize for literature in 1938.The author displayed her genius ability to observe and relate the cultural and day-to-day lives of Chinese peasants at the turn of the century. This American Christian missionary told the story of a rural Chinese man and perceptively embraced vast cultural differences, while at the same time telling a story that is universal in its relevance.A wonderful book, should be on a short list of books that should be read in a lifetime."}, {"userName": "Books Ring Mah Bell", "userReviewDate": "Sep 12, 2007", "userURL": "http://www.goodreads.com/user/show/372363-books-ring-mah-bell", "userReview": "THIS BOOK IS ABOUT THE EARTH AND IT IS GOOD."}, {"userName": "k.wing", "userReviewDate": "Mar 10, 2009", "userURL": "http://www.goodreads.com/user/show/74350-k-wing", "userReview": "I really, really wish I hadn't google-searched 'foot binding' after reading this book. In the tradition of a beloved college professor, I give The Good Earth a subtitle which reveals more of the moral stuff which fills it. Ahem. :The Good Earth: Mo' Money, Mo' Problems. The Good Earth is packed with cautionary tales of wealth and idleness, tradition and progression, and lust. Wow, the character studies one could do in this book! Just things I noticed:- The very thing Wang Lung detested, O-lan's unbound feet, actually helped him produce his wealth because she could help him with the land, and do all of the labor in the house. Women with bound feet could move very little because it was excruciating to walk. - With wealth came idleness and a detachment from the land. The antagonists of the story in the end were Wang Lung's own rich, idle sons. There was very rarely ever 'peace' in Wang Lung's house from the time he became rich to the end of the book. And in the times of peace, we see that Wang Lung blatantly ignored the problems and troubles in his house. Ignorance is bliss when you live with the likes of Lotus. Can I get a holla-back? ;)"}, {"userName": "Kemper", "userReviewDate": "Feb 22, 2011", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "Treasure of the Rubbermaids 6: Made in ChinaThe on-going discoveries of priceless books and comics found in a stack of Rubbermaid containers previously stored and forgotten at my parent’s house and untouched for almost 20 years. Thanks to my father dumping them back on me, I now spend my spare time unearthing lost treasures from their plastic depths.I bitch about having to mow my lawn, but when I’m done, I usually sit on my deck and have a few ice cold beers. Then I take a hot shower and get in my car to go to the grocery store where I buy a cart full of food without giving it a second thought. Chinese farmer Wang Lung (I wanted to type Wang Chung there. Damn you ‘80s!) spends all day doing back breaking labor in his own fields and there’s still barely enough food to keep from starving. His big reward is a cup of hot water in the morning with maybe a few tea leaves in it on special occasions, and he sponges himself off with hot water every couple of months whether he needs it or not. So maybe I shouldn’t complain about walking around behind a power mower for an hour or two a week during the summer?The book begins on Wang Lung’s wedding day. His bride, O-Lan, is a slave in the great house of his town, and they’ve never met. He splurges by taking a bath, buying her a couple of peaches, and getting a little pork and meat for their wedding feast which O-Lan prepares. For a honeymoon, they go work in the fields together. This whole section made me laugh thinking about the women on those reality wedding shows like Bridezillas.Wang Lung and O-Lan make a good couple. They’re both hard working and she soon bears him sons which is kind of important to the Chinese. (And she returns to the fields right after giving birth with no assistance. O-Lan is a dream client for an HMO.) Together their family will go through bad times including droughts and famine, but O-Lan’s steady nature and Wang Lung’s farming skills eventually bring them prosperity.The one thing that sets Wang Lung apart from other farmers is his constant desire to acquire new land. Part of this is pride, but Wang Lung realizes that owning good farm land is the key to providing the necessary cushion to keep from starving during bad years. Plus, he genuinely loves working his crops and bringing them to harvest. His fierce love of the land is the one constant in his life, but he obviously never went through a real estate crash. (Diversify, Wang Lung! Diversify!)This book works on a lot of levels. As a depiction of a culture that little was known about when it was published, it’s fantastic. I liked how Buck never comments or judges on things that are kind of horrifying like selling girls for slaves or binding their feet, but treats them as just the way things are to all the characters. She just let the facts speak for themselves. It’s also works as a family drama with trials and tribulations worthy of a soap opera. You could also read it as a plain old rags-to-riches success story. Despite being set in a time and place so alien to me, the characters still seem very real and relatable despite the cultural differences. Wang Lung doesn’t seem that different from any modern American farmer I’ve known. I think it must be universal that farmers everywhere like to gather and shoot the shit whether it’s at a Chinese tea house or a diner in Kansas.And when a successful Wang Lung experiences a mid-life crisis and falls for a younger woman, you realize that it’s no different from any modern guy divorcing the wife who stood by him for years. It’s just that the sports car hasn’t been invented yet so Wang Lung can’t go buy one.This is one of those classics that has an easily readable style and a compelling story that still seems fresh even though it was published over 70 years ago."}, {"userName": "Henry Avila", "userReviewDate": "Nov 27, 2012", "userURL": "http://www.goodreads.com/user/show/5431458-henry-avila", "userReview": "Wang Lung on his wedding day gets up at dawn as usual, a poor Chinese farmer's son, who lives with his widowed old father, but is a very hardworking, strong, and ambitious young man, they occupy, a three room house made of dirt bricks, with a straw thatched roof. After getting his ill father hot water, feeding the ox and doing the rest of the chores, Wang for the second time in the year, takes a bath secretly, with the precious water , ashamed to waste it, for such an unnecessary thing, hiding from his father this dishonorable deed. Putting on his best clothes, going for a long walk later, to the Great House of Hwang, the guard at the gate mocks him, demands a bribe for entrance, everywhere laughs are heard, as the farmer travels through the large luxurious estate, with so many beautiful houses. Amazingly looking objects, the bridegroom sees, never knowing of their existence, meeting O-Lan, his bride, for the first time, she is a tall plain looking woman, an unwanted slave, in the great house, beaten everyday, for no apparent reason, maybe to keep strict discipline there. O-Lan was sold by her poor family at ten, and has worked as a slave ever since, she is about twenty years old... Talking to the Old Mistress of the house, scared of her Eminence, is the awed farmer, all had been arranged by his father, bringing the bride back home, no real wedding ceremony, the old one is happy that he will be a grandfather, hopefully soon, grandsons, the only ones that count in China, in the late 19th Century. The small wedding feast, just five guests, including his lazy uncle, younger brother of his father, his son (the cousin also indolent) and three neighbors, Wang and his woman are both virgins on their wedding night. O-Lan is also hard working, a fine cook, always taking care of the house, the old man , in the fields with her husband, giving birth alone, to many sons (daughters also), and then the same day going back to help with the plowing. Silently, without complaints, a perfect wife, if only she wasn't so bad looking Wang thinks... After good harvests, buying land from the faltering House of Hwang, a famine occurs, people are starving to death, the uncle , his wife and son, are always asking for food and money, from Wang, when there is none, Wang has to decide stay and maybe die or go south , with his family, to a city where food is in abundance and abandon his land , that he loves, maybe forever, his modest dreams crushed, the desperate struggles, the backbreaking work, the scorching Sun beating down, the freezing mornings, cold to the bone, done for nothing ? Spellbinding story of a destitute peasant family, climbing literally from rags to riches and encountering difficulties as the new Twentieth Century arrives. Can they survive the changing, callous world?"}, {"userName": "Peter Tieryas", "userReviewDate": "Oct 08, 2013", "userURL": "http://www.goodreads.com/user/show/6848238-peter-tieryas", "userReview": "I found this to be an incredibly moving and humanistic story, full of anger, tragedy, joy, and the elements that make for a great novel. It's a story any person in any country can relate to. The writing is beautiful and reads like a parable more than straight documentation or history, which was her intent, and a tribute to many of the old Chinese tales I've read (now reading it at an older age, I see a lot of references and tributes to other Chinese works I had not known of before). That is also part of its allure and I don't know if I could have appreciated it as much if I had not read it when I was younger first. =)"}, {"userName": "Lucy", "userReviewDate": "Aug 24, 2007", "userURL": "http://www.goodreads.com/user/show/307208-lucy", "userReview": "Written by Pearl S. Buck, an American citizen who spent most of her childhood and much of her adult life in China, in 1931. It was awarded the Pulitzer Prize in 1932. I've heard much about it, mostly about a moment in the story when a woman gives birth and then goes back to work in the fields the same day, and have wanted to read it for quite some time.I think it's always intimidating to read a classic. They are usually reserved for English classes or intellectuals and I worry that my understanding won't be up to snuff. Here goes:The story begins on Wang Lung's wedding day. He is a peasant farmer, in China, who goes to the house of a wealthy farmer to pick up the bride his father has arranged for him to have: a plain, unattractive slave whose feet have never been bound and appear hideous to him. Large feet notwithstanding, he quickly learns to admire his hard-working and frugal wife. With their hard work and savings, Wang climbs up the economic ladder by being able to buy additional land to farm on. It's ALL about the land, in Wang's opinion. Land is forever. Land cannot be taken away.Sure enough, what I heard about birthing and returning to work in the fields the same day was true. O-Lan, Wang's wife, is this incredibly docile, unassuming woman. She's the kind of woman that made me feel like a slacker for sitting around reading a book. Or taking a few weeks off of going to church after having a baby. I longed for more O-Lan, but that wasn't what this book was about. There were moments when I saw her pain, when I understood that in this culture, no one really loved O-Lan, despite her humility and service. Not her parents, who probably considered having a girl a burden and sold her as a slave when she was very young, not her owners, not her husband, and eventually, not even her own children. Wang appreciated her but all his appreciation did was allow him to feel ashamed when he brought a concubine to the home.The beauty of the book, to me, was the irony that Buck skillfully weaves throughout the story. The rise and fall of the House of Hwang, where O-Lan was a slave, parallels Wang Lung's own story. It's the whole Nephite Pride Cycle! In fact, Buck's style of writing felt a bit like reading the scriptures. It was written dispassionately, even when writing about the character's passion. I also appreciated the Epic nature of the story. There is something to be learned from the successes and the tragedies.As much as I liked it, and I liked it very much, I wasn't completely smitten. I read some of the original reviews which led to the Pulitzer Award, and most of them focus on the groundbreaking honest look into China. Apparently, up until that time, China, or the Orient, was poorly understood and most of the stories about it were romanticized and mystifying. Buck wrote about the China she saw, the day to day work and customs, the glory of sons to their families and the disregard to their daughters. While many parts of the story transcends time, parts of it felt obsolete and simple. Kind of like the first of anything. An original...yes. Groundbreaking...definitely. But then other books follow suit and readers have a choice of style and characters. I've read several books before that tell the chilling tale of peasant life in China. Balzac and the Little Chinese Seamstress and Snow Flower and the Secret Fan each detail the beauty, simplicity, horror and hardship of pre and post revolutionary China. Perhaps that exposure kept me from truly loving this story. Or maybe my expectations were too high.No doubt, some of you who did read this in a class and had the opportunity to dissect it with an instructor, see what I am missing. If so...please share.Until being convinced otherwise, my opinion is that this is a great book. Definitely a classic. But not one of my favorites."}, {"userName": "Rebbie", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/6582211-rebbie", "userReview": "It's not easy to explain how someone feels when they read a book that feels like it's a part of them, as if it will weave itself into the fabric of a soul and walk with someone through their life.I save 5 stars for books that move me this deeply. Perhaps that's a bit unfair to all the other awesome books out there that might deserve it, but oh well. That's what 4 star ratings are for; besides, there has to be a way to acknowledge a book that is an all-time favorite and give it the respect it deserves for being so special. Oh, if only all writers could write as well as Pearl S. Buck! Whether you love or hate this novel (some people feel very strongly about it either way), you can't deny that the author has major talent.She writes with such descriptive fluidity, and maintains a current of understated humility, where she doesn't let herself get in the way of the story. I'm sorry, but too many people try to show off their skills and it's distracting. Just give us the story already, and let us see for ourselves.No doubt you already know what this amazing book is about, so there's no need to rehash it since it's been said on here a thousand times. I just wanted to use this review to say how much I love her writing ability, and can't wait to read the other 2 books in the trilogy."}, {"userName": "سالم النقبي", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/66605788", "userReview": "شخص بلا أرض، شخص بلا جذورمن الروايات التى شعرت بكم هائل من المشاعر و انا أقرأها، بداية من التعاطف مع ذلك الفلاح البائس في صراعه مع حياة قاسية ،صراع مرير يبدو بلا نهاية مع ظروف أقوى من قدرته البسيطة على مقاومتها، مروراً برحلته الشاقة للحفاظ على أرضه بعد أن أبتسم له القدر أخيراً لينتقل من الفاقة إلى عالم الثراء دون أن يفقد جذوره كفلاح يعرف قيمة الأرض و يقدسهاوصف الكاتبة كان أكثر من رائع و بخاصة في الفصول الأولى من الكتاب و الذى ذكرني برائعة عبدالرحمن الشرقاوي\"الأرض\" و يبدو أن معاناة البشر مع الارض واحدة مهما أختلف المكان، النهاية أيضاً رغم قسوتها كانت مميزة و معبرة، البطل\"وانغ\" يتخلى عن زوجته\"اولان\" بعد أن طرق الثراء بابه متناسياً رحلتها الشاقة معه، ليتخلى أولاده عن الأرض التى طالما أفني حياته في خدمتها، ليطغى بريق المال على أى أنتماء للأرض في نهاية حزينة للعمل لكنها واقعية و مميزةكتاب رائع و أستحقت عنه الكاتبة الفوز بجائزة نوبل عن جدارة"}, {"userName": "بسمة الجارحي", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/70186285", "userReview": "ملحمة روائية رائعة ذكرتنى برواية عبدالرحمن الشرقاوى \" الأرض \"و كأن معاناة الفلاح واحدة فى كل مكانرائعة و تستحق القراءة"}, {"userName": "Jeana", "userReviewDate": "Apr 16, 2008", "userURL": "http://www.goodreads.com/user/show/849321-jeana", "userReview": "This book is a hard one to rate. I found the book difficult to read emotionally, but knew all the while that it was brilliant. It was sad to see how Wang Lung's obsession with land ruined his potential for happiness. And it seemed that with more money came more difficult problems. The cycle of the rich House of Hwang turning into the farmer's house-with all its disgusting rich-people habits--was the most brilliant part of all. And it began with him buying that bit of land even before all the real problems began. I guess I should have realized this was a problem for him when he chose to use his meagre earnings to buy more land than save to feed his little family.I really despised Wang Lung, while I loved O-lan. How could he not have loved her for what she had given to him, so humbly and silently? Couldn't he find her beauty despite her physical appearance? After O-lan died, I seriously wanted Wang Lung to suffer. I was hoping his house would be robbed like the rich houses that were pillaged by robbers \"when the rich get too rich.\"I found it ironic, however, at the end when Wang Lung's biggest comforts came in the form of daughters (those daughters that were so useless they called them \"slaves\" and merely shrugged when they were born)--with his \"little fool\" as he called her and Peach Blossom, who was like a daughter to him. While his sons caused him nothing but trouble. There is so much to mention here, I feel like I should have taken notes. But I feel that this is definitely a book worth reading, although it was hard. But the lesson here was learned: lusting after money/land will only bring hardship."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jul 27, 2013", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Good Earth (House of Earth #1), Pearl S. BuckThe Good Earth is a novel by Pearl S. Buck published in 1931 and awarded the Pulitzer Prize for the Novel in 1932. The best-selling novel in the United States in both 1931 and 1932 was an influential factor in Buck's winning the Nobel Prize for Literature in 1938. It is the first book in a trilogy that includes Sons (1932) and A House Divided (1935). The story begins on Wang Lung's wedding day and follows the rise and fall of his fortunes. The House of Hwang, a family of wealthy landowners, lives in the nearby town, where Wang Lung's future wife, O-Lan, lives as a slave. However, the House of Hwang slowly declines due to opium use, frequent spending, and uncontrolled borrowing. Meanwhile, Wang Lung, through his own hard work and the skill of his wife, O-Lan, slowly earns enough money to buy land from the Hwang family, piece by piece. O-Lan delivers three sons and three daughters; the first daughter becomes mentally handicapped as a result of severe malnutrition brought on by famine. Her father greatly pities her and calls her \"Poor Fool,\" a name by which she is addressed throughout her life. O-Lan kills her second daughter at birth to spare her the misery of growing up in such hard times, and to give the remaining family a better chance to survive. During the devastating famine and drought, the family must flee to a large city in the south to find work. Wang Lung's malevolent uncle offers to buy his possessions and land, but for significantly less than their value. The family sells everything except the land and the house. Wang Lung then faces the long journey south, contemplating how the family will survive walking, when he discovers that the \"firewagon\" (the Chinese word for the newly built train) takes people south for a fee. In the city, O-Lan and the children beg while Wang Lung pulls a rickshaw. Wang Lung's father begs but does not earn any money, and sits looking at the city instead. They find themselves aliens among their more metropolitan countrymen who look different and speak in a fast accent. They no longer starve, due to the one-cent charitable meals of congee, but still live in abject poverty. Wang Lung longs to return to his land. When armies approach the city he can only work at night hauling merchandise out of fear of being conscripted. One time, his son brings home stolen meat. Furious, Wang Lung throws the meat on the ground, not wanting his sons to grow up as thieves. O-Lan, however, calmly picks up the meat and cooks it. When a food riot erupts, Wang Lung is swept up in a mob that is looting a rich man's house and corners the man himself, who fears for his life and gives Wang Lung all his money in order to buy his safety. Meanwhile, his wife finds jewels in a hiding place in another house, hiding them between her breasts.Wang Lung uses this money to bring the family home, buy a new ox and farm tools, and hire servants to work the land for him. In time, the youngest children are born, a twin son and daughter. When he discovers the jewels O-Lan looted from the house in the southern city, Wang Lung buys the House of Hwang's remaining land. He is eventually able to send his first two sons to school (also apprenticing the second one as a merchant) and retains the third one on the land. As Wang Lung becomes more prosperous, he buys a concubine named Lotus. O-Lan endures the betrayal of her husband when he takes the only jewels she had asked to keep for herself, the two pearls, so that he can make them into earrings to present to Lotus. O-Lan's morale suffers and she eventually dies, but not before witnessing her first son's wedding. Wang Lung finally appreciates her place in his life, as he mourns her passing.Lung and his family move into town and rent the old House of Hwang. Wang Lung, now an old man, wants peace, but there are always disputes, especially between his first and second sons, and particularly their wives. Wang Lung's third son runs away to become a soldier. At the end of the novel, Wang Lung overhears his sons planning to sell the land and tries to dissuade them. They say that they will do as he wishes, but smile knowingly at each other.عنوانها: خاک خوب؛ زمین خوب؛ نویسنده: پرل س. باک؛ تاریخ نخستین خوانش: دوم ماه ژوئن سال 1976 میلادیعنوان: زمین خوب؛ نویسنده: پرل باک؛ مترجم: فریدون بدره ای لرستانی؛ تهران، مرجان، 1336، در 364 ص؛ چاپ دیگر: 1368؛ در 413 ص؛ شابک: 9649049339؛ چاپ دیگر 1380؛ مموضوع: داستانهای نویسندگان امریکایی قرن 20 معنوان: خاک خوب؛ نویسنده: پرل باک؛ مترجم: غفور آلبا؛ پاپ اول 1340؛ چاپ دیگر: تهران، امیرکبیر، 1347، در 343 ص؛ چاپ دوم: 1347؛ سوم 1350؛ چاپ دیگر: تهران، ناهید، 1371؛ در 343 ص؛ موضوع: داستانهای نویسندگان امریکایی قرن 20 معنوان: خاک خوب؛ نویسنده: پرل باک؛ مترجم: داریوش شاهین؛ تهران، جاویدان، 1362، در 533 ص؛ چاپ ششم: 1379؛ هفتم و هشتم 1390؛ چاپ یازدهم 1385؛ موضوع: داستانهای نویسندگان امریکایی قرن 20 مخاک خوب، کتاب نخست از رمانی سه گانه است که برای نخستین بار در سال 1930 میلادی انتشار یافت، و به دنبال آن، «پسران» در سال (1932 میلادی) و «خانواده پراکنده» در سال (1935 میلادی) منتشر شدند. در «خاک خوب»، زندگی «وانگ لونگ»، دهقان فقیر شهرستان «آن هوئی» روایت می‌شود. نویسنده باورهای دهقانان متوسط چینی که با فقر و گرسنگی و جنگهای داخلی پیش از انقلاب درگیر بودند را با دقتی واقع‌بینانه توصیف میکند. اما، از ورای شخصیت «وانگ لونگ» است، که روحیه چینی سربرمی‌آورد. «وانگ لونگ» به زمین پای‌بند است، زیرا زمین: «خون و گوشت هر کس است». «وانگ لونگ» نیز، با استفاده از آشفتگی آن روزها خود مالکی بزرگ می‌شود. با این حال، «خاک خوب»، تنها صعود یک دهقان نیست که در ایام کهولت به «گل گلابی» دلفریب، دل می‌بازد، و موجب ناخشنودی پسرانش می‌شود. بلکه این اثر، با اینکه یک رمان است، نوشته ی مستند ارزشمندی نیز هست، درباره ی دورانی که «وانگ لونگ» هنوز فقیر بود. دورانی که خود او فریاد برداشته بود: «دیگر چه! پس این وضع هرگز عوض نخواهد شد؟» و به او پاسخ داده بودند: «چرا، رفیق روزی عوض خواهد شد. وقتی که ثروتمندها زیادی ثروتمندند، امکاناتی وجود دارد. و وقتی که فقیرها زیادی فقیرند، امکاناتی وجود دارد.» پسرانش وانگ ارشد، وانگ دوم و وانگ سوم که پرقدرت و ملقب به «ببر» است و او یکی از آخرین سرلشکران ماجراجوی رژیم قدیم خواهد شد. پس از مرگ پدر، زمینها را تقسیم میکنند. اما «ببر» برادرانش را از سر باز میکند. زمین برای او اهمیتی ندارد: او چیزی جز پول نمی‌خواهد، تا ارتشی در حد جاه طلبیهایش ایجاد کند. او که «سالار جنگ» شده، پیروزیها را پشت سر می‌گذارد. اگر پسرش «یوآن» به دنیا بیاید، خوشبختی‌اش کامل خواهد شد. آرزو دارد از پسرش یک «سرلشکر کوچک» بسازد. اما پسر جوان، که بسیار هوشمند و متنفر از کشتار است، خود را به دست اندیشه‌های نو می‌سپارد. تضاد شدید میان کهنه پرستی «ببر»، و تحول‌طلبی پسر بسیار محبوبش، قدرتی دراماتیک به کتاب دوم می‌بخشد. «یوآن» سنتهای خانوادگی را می‌گسلد، و از نفوذ وانگ سوم می‌گریزد. با این حال، چون مبارزی سمج نیست، عضویت خود در انجمن مخفی را مدتها به تعویق می‌اندازد. سرانجام، به اصرار یکی از پسرعموها، تصمیم خود را عملی می‌کند به امید آنکه «رنجهای ملت فقیر» که او شاهد طغیان آن بوده، پایان گیرد. «یوآن»، کمی پس از آنکه جانب انقلاب را می‌گیرد، دستگیر می‌شود، و تنها در برابر باجی کلان، که بستگانش می‌پردازند، از مرگ نجات می‌یابد. همین که آزاد می‌شود، به خارج از کشور می‌رود، تا آموزش خود را کامل کند، و با تمدن غرب آشنا شود. کتاب با تولد عشقی ساده میان «یوآن» و «می‌لینگ»، یک دانشجوی چینی، پایان می‌گیرد. و نهایتاً سالار پیر جنگ به دست دهقانان شورشی کشته می‌شود. ا. شربیانی"}, {"userName": "Heather", "userReviewDate": "Aug 01, 2008", "userURL": "http://www.goodreads.com/user/show/975464-heather", "userReview": "When the earth suffers, women suffer-- when women suffer the earth suffers. I think this is what Buck captured so beautifully in her book. She is a brilliant feminist writer!Through her character O-lan, Buck makes the argument that all of man's (in the story Wang-lung)increase and prosperity comes because of his reliance on the \"good earth\", which refers not only to his land but also to his good woman. Without his woman he would have had none of the prosperity he enjoys! The tragedy is that he doesn't appreciate what he has and the woman suffers. My heart just ached for O-lan and she reminded me that so many woman in the world live similar lives. So many women bring forth fruit, raise it and cultivate it, in silence. They are trampled on, destroyed and unappreciated.Life would cease to exist without the earth, just as life would cease to exist without women."}, {"userName": "Adrienne", "userReviewDate": "Jan 26, 2008", "userURL": "http://www.goodreads.com/user/show/836553-adrienne", "userReview": "I couldn't put this book down. It was very informative about pre-revolutionary Chinese culture. But even more than that, it was an interesting emotional journey. In the beginning, Wang Lung's character seems so simple and kinda static, albeit respectable. But as the novel progresses, his character becomes more and more complex, more and more human. It was hard for me to really define my opinion of him when it was all over. It wasn't as simple as just hating him because there was also a part of him that was good, even in the end. That's what makes him human. I think that feeling is the result of the peek Buck gives us into Wang Lung's mind during difficult decisions.I think we all wanted to get more of O-lan. Obviously we all sympathize with her and, despite her unlikeability to pretty much everyone in the novel, she is extremely likeable and respectable to us as modern western readers. But I think the fact that we DON'T get to be more involved with her has meaning in itself. She was considered insignificant despite the fact that all of her contributions are arguably the most significant. As readers we were only allowed to see the surface of O-lan's character, just as everyone in her society saw--it's all they cared to see and really, it's all they believed there was. I think it's very clever writing on Buck's part."}, {"userName": "منال الحسيني", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/70964582", "userReview": "رغم الطول النسبي للرواية، لكني لم أستطع أن أتركها إلا بعد الأنتهاء منهارائعة و تستحق الخمس نجوم"}, {"userName": "peiman-mir5 rezakhani", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/42133960-peiman-mir5-rezakhani", "userReview": "‎دوستانِ گرانقدر، نویسندهٔ این کتاب <پرل بک>، دورانِ کودکی خویش را در چین گذراند و در همانجا نیز درس خواند.. او عاشقِ سرزمینِ چین است و چین را قلب و روحِ خود میداند... وی توانست فرهنگ و زندگیِ مردمانِ چین را به آمریکاییان و اروپائیان شناسانده و با داستانهایش فرهنگهای این مردمان را به یکدیگر پیوند بزند و در این راه جایزهٔ نوبل را نیز کسب نمود--------------------------------------------‎در این داستان، <وانگ لونگ> دهقانی است که خود را از زمین میداند و تمامِ زندگی خویش را فدایِ زمین کرده است و عشق دیوانه واری نسبت به زمین دارد ... او حاضر است آب را از فرزندانش دریغ کند، ولی همان آب را به زمین بدهد‎همسرِ او <اُو-لان> نام دارد و از آنجایی که پیش از ازدواج با وانگ لونگ کنیز و بردهٔ خانوادهٔ بزرگ و زمیندار <هوانگ> بوده است، بنابراین به زندگی در هر شرایطی با وانگ لونگ، شاد و خرسند است‎هوانگِ پیر، رئیس خاندانِ بزرگِ هوانگ، زندگی و دارایی اش به خطر می افتد، چراکه فساد و اعتیاد به تریاک، این خاندان را به بیچارگی میکشاند‎وانگ لونگ از این فرصت استفاده کرده و بخشی از زمین هایِ خاندانِ هوانگ را خریداری میکند تا در راهِ پیشرفت، گام بزرگی بردارد... ولی از شانسِ بدِ او، جنگ و انقلاب و شورش و خشکسالی، به یکباره خسارت هایِ زیادی به او و خانواده اش وارد میکند.... آنها پس از تحملِ بدبختی هایِ فراوان، سرانجام در راهِ زمینداری و کشاورزی، به خوشبختی دست پیدا میکنند‎پس از گذشتِ زمان، وانگ لونگ پیر میشود و زمینهایش را برای فرزندانش به ارث میگذارد... ولی فرزندانش همچون پدرشان نسبت به زمین عشق و تعصب نداشته و تصمیم میگیرند تا زمینها را به فروش برسانند****************‎شمارهٔ بعدیِ این رمان، با عنوانِ \"پسران خاندانِ وانگ\" از آنجایی آغاز میشود که پسرانِ این خانواده: وانگِ بزرگ، وانگ دوم و وانگ سوم یا همان ببر، زمینها را بین یکدیگر تقسیم کرده و داستان به زندگی آنها و نواده هایِ وانگ لونگ، میپردازد--------------------------------------------‎امیدوارم این ریویو در جهتِ شناختِ این کتاب، کافی و مفید بوده باشه‎<پیروز باشید و ایرانی>"}, {"userName": "دعاء ممدوح", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/69856508", "userReview": "من الكتب التي يبقى اثرها طويلاً في الذهن و الروح بعد الانتهاء من قراءتها، و رغم طول الرواية إلا أني لم أشعر بالملل أطلاقاً في أي جزء منهارائعة و تستحق الخمس نجوم"}, {"userName": "Joshua", "userReviewDate": "Jan 11, 2008", "userURL": "http://www.goodreads.com/user/show/763288-joshua", "userReview": "This is a very unsentimental look at life in rural, pre-revolutionary China. Though she is American, Pearl Buck maintains an objective stance regarding Chinese cultural practices from the time, including foot-binding and the enslavement of women. Yet one encounters the unspoken torment of countless generations of women. The wife O-Lan is particularly well-drawn; in her rough-hewn features and ox-like devotion to the earth, the reader intimately feels her tragic solitude. In Chinese society, she knows that she is \"too ugly to be loved,\" and her husband seems to love Lotus, the live-in waif-prostitute, more than her-- despite her thankless contributions to the family's health and home. The scenes of famine and desperation strike epic chords of Steinbeck and Rohinton Mistry, the great author of \"A Fine Balance,\" about Indian untouchables. As in all great novels, the setting of jade-green rice fields and gilded wheat becomes a living character with its own destiny and course--at times cruel; other times, benevolent."}, {"userName": "Mostafa Galal", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/68885710-mostafa-galal", "userReview": "من الروايات القليلة التي تترك اثراً في نفس القارئ من الصعب أن ينسى، و رغم النهاية الحزينة للرواية إلا أنها نهاية واقعية جداً أضافت مزيد من الثراء إلى العمل"}, {"userName": "Paul", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/4643325-paul", "userReview": "What to make of so famous a book; Pulitzer Prize winner and Buck went on to win the Nobel Prize, the first American woman to do so. There are study guides galore and Oprah revived interest in the book when she selected it for one of her book club reads. The plot is well known and is set in the early part of the twentieth century in agrarian China. It is a family saga and is the first of a trilogy. It tells the story of peasant farmer Wang Lung from day until his death, covering about 50 years. It tells of famine and hardship and of the rise of Wang Lung to be a wealthy man, all his wealth springing from the land and the soil. The plotlines encompasses many of the evils/problems in Chinese society: famine/plenty, opium, foot binding, the taking of concubines, infanticide (of daughters), but also the daily routines of agrarian life with its ups and downs. Buck was the daughter of missionaries and spent many years in China and was a keen observer of life. For many readers this was/has been an introduction to China, its people and culture and the endless notes provided by study guides illustrate this well. Celeste Ng makes a very good point about this:“I hate The Good Earth because, all too often, it’s presented not as a work of fiction but as a lesson on Chinese culture. Too many people read it and sincerely believe they gain some special insight into being Chinese. In one quick step, they know China, like Neo in The Matrix knows Kung Fu. Since its publication, the book has regularly been assigned in high schools as much for its alleged window into Chinese culture as for its literary value.”This raises the issue of whether a novel or work of fiction can ever be a guide or compendium of a country’s culture. Would we go to Zola to find out about nineteenth century France, Dickens for England, Faulkner for the modern US; I could go on. They might be illustrative, but not comprehensive or a cultural guide, a quite narrow perspective even for perceptive observers like Dickens or Zola. So why would Buck’s novel be treated like that? Even Buck points out there is much more to China than she portrays:“And when on another day he heard a young man speaking — for this city was full of young men speaking — and he said at his street corner that the people of China must unite and must educate themselves in these times, it did not occur to Wang Lung that anyone was speaking to him.”No book encapsulates an entire culture and it is typical of a western imperialist (or even post imperialist) mentality to begin to consider it can. The novel does clearly illuminate the position of women in Chinese society at that time. The focus on land and soil and personal progress tapped into middle class American values at the time it was written, helping to make it very popular and there is an interesting contrast with the role of Chinese immigrants in America at the time. There is, of course much more to be said, but reading Buck does necessitate an awareness of the society around her at the time. I did enjoy the novel and the character building is very good. It did remind me a little of Gone with the Wind (is that heresy?)"}, {"userName": "Chrissie", "userReviewDate": "Jul 21, 2015", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "I noticed right away when I began the book that Pearl S. Buck's writing style was special. The language is simple and clear, but at the same time emotive. There isn't a wasted word. There is a quietness in the lines that fills you with emotion. You watch a traditional, hard-working family, one very much tied to the soil, struggling to make something of themselves. The historical details are diffuse; I would guess that the story is set in the first decades of the 1900s. The book was published in 1931 and the time period covered probably ends in the thirties, when the central character Wang Lung is in his 70s. The book is in fact the first of a trilogy. The author, Pearl S. Buck, won the Nobel Prize for Literature in 1938. So what is the story about? A young Chinese couple, Wang Lung and O-lan, begin with nothing. The marriage was arranged and they knew nothing of each other. This book follows their lives and their children. Grandchildren are born but their lives are for the next books of the trilogy. For me, the story reads as an allegorical tale about the ups and downs of life. It is about how we change as we pass from childhood to adulthood and finally old age. It is also about the value of land. It cannot be stolen, as gold or silver or gems can be stolen. It gives sustenance, and it gives pleasure. Working the land gives a purpose to life and immense satisfaction. The traditions and customs of China are beautifully drawn - clothing and food, marriages and birth and death, yearly celebrations, sexual discrimination. Customs are drawn so you see how the Chinese people feel about their own traditions. How do they see concubines and foot-binding and beauty. And ugliness. Book learning and war and famine. The role and status of the elderly, the position of the eldest son, the daughters, the retarded. What was it like to grow up in China in the early 1900s as one of the multitude? And what is success? The reader recognizes that which is common to all people and that which is specific to life in China.When I began listening I wasn't thrilled with the narration by George Guidall, but it grew on me. I ended up really liking it. The lines are read slowly and movingly. Nice long pauses. Time to ponder. Time to shed a tear before the story continues. I came to care deeply for Wang Lung and O-lan, but not for any of the other characters. This is why I hesitate to continue with the trilogy. This was a good story, movingly told, by an author that has a unique way of saying things simply, quietly and powerfully. The story itself isn't exceptional, but how it is told is."}, {"userName": "Michael Finocchiaro", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "Pearl S Buck lived in China on several occasions and thus her story of Wang Lung feels real. The book is a sort of bildungsroman in which we see the life of Wang Lung from his mariage to the young slave O-Lan to his success and passing on of his legacy to his snickering sons. There is plenty of drama here and there are times that you want to slap Wang Lung for being an ass, but the story is very entertaining and one can easily see the talent of Buck in her writing. I wonder if the other two books in The Good Earth Trilogy following this one are as poignant (and occasionally frustrating). The one thing is that there is no real spiritual development of the characters - they remain pretty much the same and making the same errors time and time again. Perhaps that is what makes them so human. Nevertheless, I would have liked to see at least a smidgeon of growth or learning from them. The language used does have a sort of biblical lyricism and, again, I don't know if this is typical of all of Buck's work or just this novel."}, {"userName": "Magrat Ajostiernos", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/7018524-magrat-ajostiernos", "userReview": "Aunque me ha gustado mucho 'La buena tierra', he sufrido más que disfrutado con su lectura. Los personajes que aparecen en este libro son (practicamente todos) odiosos, mezquinos, crueles y egoístas, por lo que pasé casi toda la lectura enfadada.A pesar de todo, es un libro que se ha quedado conmigo, esta autora tiene una manera muy sencilla de narrar pero que consigue que te lleguen sus palabras... Será difícil olvidar esa descripción de la pobreza más extrema, de la ingnoracia, la situación de la mujer como esclavas y la penosa vida de los campesinos..."}, {"userName": "Michael", "userReviewDate": "Jul 01, 2015", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "Nice touches on the struggles and resilience required of rural families in early 20th century China, but overall all this saga was too much of a morality tale for me. We follow a poor farmer, Wang Lung, as he is steered by his elderly father to buy a slave for a wife, O-Lan. She is a quiet saint and applies her hard work to help them make a success of their farm and delivery several children by herself. The following schematic plot summary can benefit the potential reader with an idea of the book’s content (and some may find spoilerish). Hard times from drought leads Wang to take his growing family to a large city to avoid starvation. They eke out a living through their begging and his work driving a rickshaw. Eventually, a windfall brings him back, where greed for land and financial security becomes an obsession. That drive helps them sustain the economic hardships from floods, but his growing wealth begins to corrupt him and lead him to neglect his loyal wife in favor of a prostitute. In the process of this tale, the book illustrates the temptations and just rewards for most of the sins in the Old Testament. Despite Buck coming from a missionary family, there are no obvious elements of a Christian theme or religion in general. And despite casting the wealthy class in a poor light, I detect no signs of this story being some socialist paen of the virtues of the proletariat. Instead, it seems a straightforward honoring of the virtues of respect and nurturing of the land that feeds us. Wang can be a pig when he gets some wealth, but like good wine he improves with age. I didn’t get the same level of uplift from emotional connection to the land like I get from Willa Cather or the depth of empathetic rendering of the struggles of the downtrodden like Steinbeck pulls off."}, {"userName": "Becky", "userReviewDate": "Mar 01, 2011", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "I probably would never have picked this book up had it not been chosen by a friend for a group read. Honestly, I don't go for Chinese lit very much, but I agreed to read this one, even though I was prepared to be bored at least. But I downloaded the audio version, read by Anthony Heald, and listened to the book while doing some much needed organizational stuff, and it was surprisingly good. I enjoyed the reading so much that I would sometimes stop doing stuff to just listen. I think that had I read this on my own though, I don't think I'd have enjoyed it as much. There are times when a reader can add a whole lot to the story, and this was one of them. I actually do have an e-copy of the book, and I read along at some parts, and I think that listening to it was a fuller experience for me. Heald just seemed to GET these characters in a way I probably wouldn't have. He almost seemed to channel them so that his reading was borderline dramatization. It wasn't over the top - it was just perfect. I don't know how much of this accurately represents Chinese culture. I don't know much about it myself, and so I took it all with a grain of salt. I don't particularly care for the attitudes towards women that are generally depicted in Chinese lit, so I don't read very much of it. But even if none of the cultural references are accurate, this was still an engaging and interesting story full of very human characters. At times, I didn't know whether to root for or against the main character, Wang Lung. I initially loved his character, and then as he progressed through life and different situational hardships and prosperity, I found myself mentally crossing my fingers while watching him with a wary eye. I wanted to like him, but sometimes the things he chose to do made that very, very hard. At one point, I was so disappointed in him, that I was shaking with anger at the sheer gall the man had, especially after everything, everything that had happened. That man had some cojones on him, I'll give him that. I think that my favorite character in the story was O-lan. My heart broke for her. We never really get to know her fully, seeing things through Wang Lung's eyes, and he's not particularly perceptive when it comes to O-lan, or kind when he is, but I loved her. She never gave an inch of her dignity, no matter what her hardship, and she had so many. I was in awe of her, all while my heart hurt for the lack of gratitude she received for everything she gave. She deserved much better. I found this to be an interesting story about a man's life and the things that he was able to achieve with that life, at the cost of so much, and the fleetingness of it all. I think that's what saddens me the most thinking about this book: we can't take any of it with us. I did enjoy this one, and I think the story will stay with me for a while, if nothing else."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Feb 23, 2011", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "The first time I read this book I was thirteen years old. All I remembered about it was that it was about a Chinese farmer and I liked it. This second time through I could see how so much went past me when I read it as a youth with no life experience. Now, as a grown-up, I was able to appreciate the depth of the characters' feelings and the storytelling gifts of Pearl Buck. The book was first published in 1931, but it's written in what could almost be termed a classical style. The great beauty of the tale as a whole is in Wang Lung's unwavering connection with his land---the \"good earth.\" I love the meaning of the name Lung, which signifies \"one whose wealth is from the earth.\" It's so much more lyrical and representative than \"farmer.\""}, {"userName": "Lubinka Dimitrova", "userReviewDate": "Aug 30, 2016", "userURL": "http://www.goodreads.com/user/show/3035194-lubinka-dimitrova", "userReview": "Ι never imagined that a simple portrayal of a Chinese farmer's everyday life could be so riveting. Pearl Buck's writing is magical, hypnotic, utterly engrossing. I virtually devoured the book in two days. Amazingly enough, I, who live worlds (and ages) apart from the book's setting, could totally relate to this story about the cyclical nature of life, the passions and desires that motivate a human being, pain, suffering, ambition, agony, pride and all sorts of human emotions. It's the third book that I read this year, while thinking that I shouldn't have waited so long to give it a chance."}, {"userName": "Joselito Honestly and Brilliantly", "userReviewDate": "Nov 21, 2015", "userURL": "http://www.goodreads.com/user/show/2190636-joselito-honestly-and-brilliantly", "userReview": "How must you live your life?This is a novel with a plot replete with startling developments and a female character—the farmer’s wife O-lan—who stood out heroically even though she had spoken maybe less than a dozen words in the entire novel. One should live life treating what is unsaid as just as important as what has been said."}], "description": "This tells the poignant tale of a Chinese farmer and his family in old agrarian China. The humble Wang Lung glories in the soil he works, nurturing the land as it nurtures him and his family. Nearby, the nobles of the House of Hwang consider themselves above the land and its workers; but they will soon meet their own downfall.Hard times come upon Wang Lung and his family when flood and drought force them to seek work in the city. The working people riot, breaking into the homes of the rich and forcing them to flee. When Wang Lung shows mercy to one noble and is rewarded, he begins to rise in the world, even as the House of Hwang falls.", "title": "The Good Earth\n      \n          (House of Earth #1)", "url": "http://www.goodreads.com/book/show/1078.The_Good_Earth", "average": 3.97, "cover": "https://images.gr-assets.com/books/1312497600l/1078.jpg", "reviews": 8743, "authors": [{"url": "https://www.goodreads.com/author/show/704.Pearl_S_Buck", "name": "Pearl S. Buck"}], "type": ["Classics", "Fiction", "Historical", "Cultural", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/1078.The_Good_Earth", "http://www.goodreads.com/book/show/5210.The_Good_Earth", "http://www.goodreads.com/book/show/1206058.The_Good_Earth", "http://www.goodreads.com/book/show/5948969", "http://www.goodreads.com/book/show/16124990", "http://www.goodreads.com/book/show/1495709._", "http://www.goodreads.com/book/show/17162865-the-good-earth", "http://www.goodreads.com/book/show/914958.La_buena_tierra", "http://www.goodreads.com/book/show/209279.Pavilion_of_Women", "http://www.goodreads.com/book/show/93521.Imperial_Woman", "http://www.goodreads.com/book/show/93515.Peony", "http://www.goodreads.com/book/show/14647.Sons", "http://www.goodreads.com/book/show/14648.East_Wind", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}