{"ratings": 36851, "userreviews": [{"userName": "Katerina", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/5014021-katerina", "userReview": "The best in the series so far! I won't write a proper review now because I have to read The Crimson Crown ASAP, perhaps I'll review them together! Just do yourself a favor and read Seven Realms guys!"}, {"userName": "Mikee Andrea (ReadWithMikee)", "userReviewDate": "Apr 17, 2016", "userURL": "http://www.goodreads.com/user/show/44137919-mikee-andrea-readwithmikee", "userReview": "❝She’d been born for this—and raised to it. She’d fought for it, and at times she’d thought she might die for it. She had a long history of tragedy and triumph behind her, and a lifetime of hard work ahead of her. It was time to get started.❞\n\nRating: ★ ★ ★ ¾Though I still enjoyed The Gray Wolf Throne, I felt that it suffered the \"middle book syndrome\". The pacing of the story was consistently a bit slow throughout the whole book, and it definitely wasn't as great as The Exiled Queen. A lot happened but at the same time it didn't. Well, nothing that was too exciting or worth talking about.The two things I did love within this installment was Raisa's character development and the increase in interaction between our two main characters, Han and Raisa.In the beginning of the series, Raisa was nothing special to me. She was a lovestruck princess forbiddingly pining over her childhood friend turned Corporal. She was lost in the group of the many average, mediocre heroines I've read about that weren't really worthy of remembering. But come The Exiled Queen, Raisa really started to turn around. The snoozefest of a romance between Amon and Raisa also finally started to die down. Then when we get to The Gray Wolf Throne, Raisa completely surprised me. She has turned out to be quite the badass queen! Her character has evolved so much since The Demon King and has proved to be the rightful heroine that she should've been from the very beginning.Oh and can we take a second to appreciate how great Han's character just is since The Demon King? He just gets better and better with each installment. Han always has me swooning in ever scene he's in and he doesn't even have to try.Since the beginning, I've been desperately hoping for more Han and Raisa scenes. We get little to no interaction in The Demon King. We get a whole lot more chapters in The Exiled Queen but they were still separated for the first half of the book. Finally, we get to see them interacting for majority of The Gray Wolf Throne, and I couldn't be more happier. My shipping heart was dancing and doing flips and tumbles from the amount of Han/Raisa interaction we got in this book. I NEED MORE.Overall, The Gray Wolf Throne was probably my least favorite of the series so far. It just suffered a bit of middle book syndrome and nothing exciting happened besides a few chapters here and there. I still enjoyed reading the book and I could tell that we are in for a wild ride in The Crimson Crown. Hopefully the finale will be much more exciting than The Gray Wolf Throne."}, {"userName": "Anne", "userReviewDate": "Apr 27, 2012", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "Re-read 2016Oh My God...why aren't more people reading these books?!Even better the second time around! I'm so glad I decided to pick these books up again. I guess it was just a fear that they wouldn't be as good as I remembered them that kept me from cracking 'em open sooner, so I'm happy to report (unlike some of my previous favorites) this series still stands up to the test of time.So, yeah.I WAS RIGHT BIOCHES!Original review: 2012This is my new favorite series. Without a doubt, I will be first in line to get The Crimson Crown when it comes out later this year. Each book has progressively gotten better and better, and this time around I found myself walking around with the book in my hand waiting for an opportunity to start reading it again. I'm not going to even attempt to re-cap the plot, because there is just no way I would do it justice. I will say that all of the characters, major and minor, are well fleshed-out and fully formed. Very few of them are totally good or fully evil, either. Seriously, this does not read like a typical YA novel. Cinda Williams Chima has really impressed me with these books, but this one in particular was just incredible.Honestly, I can't see how she doesn't have a bigger following than she does.I would highly recommend this entire series to anyone who enjoys a great story."}, {"userName": "Brittney ~ Reverie and Ink", "userReviewDate": "Jun 28, 2016", "userURL": "http://www.goodreads.com/user/show/50044222-brittney-reverie-and-ink", "userReview": "4.5 Stars. Can we just sit here for a moment and appreciate the level of detail and artistry put into this series? This series has rattled its way into my favorites list. It is nothing short of epic.This book picks up exactly where book 2 left off. Raisa is running for her life, and you guessed it... Han is racing after Raisa. Pretty much the entire first quarter of this book feels like a race. Even my heart was pounding. This book felt much more action packed than the previous two - without the slowwww first half. I don't want to spoil much more of the plot.. but I just want to express my love for not only the characters, not only the AMAZING world building, but the level of depth in the politics between the countries, clans, and wizard houses. I do what to quickly touch on my feelings for the characters because.. ugh. I just have to. Han His character development, determination, loyalty... UGH. I love everything about him.Raisa She's grown up. She acts so much older than her age... and I can't help but absolutely adore her to pieces. Talk about a woman worthy of being queen. Amon Talk about sacrificial. I...ugh. I can't. Too raw.Micah Despite all his seemingly selfish actions... I just can't help but feel like there is a good guy in there somewhere. So whatever... I love him. Still. After everything.For those of you racing through this series like me- expect a pleasant surprise of jam packed action and SERIOUS feels in this book.My Blog ~ Instagram ~ Twitter ~ Etsy"}, {"userName": "Alienor ✘ French Frowner ✘", "userReviewDate": "Jul 29, 2014", "userURL": "http://www.goodreads.com/user/show/31461418-alienor-french-frowner", "userReview": "[I fell in love with Han in book 1, but really, even if it wasn't the case, I would not be able to resist now. The loyalty, the understanding, the respect, the freaking adorableness - I love EVERYTHING in this ship. EVERYTHING. (hide spoiler)]"}, {"userName": "❄️Nani❄️", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/68538597-nani", "userReview": "4.75⭐️This series is too fucking fantastic. I can’t... this is just too much! I rarely RARELY ever read a book where I don’t come out the other end complaining about one thing or another. However much I love the book there’s always something that I’m let down by. This is, by no means, the case here. By far, it is not! Where do I begin? And why am I not giving this 5 starts? I loved everything! The plot. The world. The political intricacies. My adorable, incredible characters. EVERYTHING!"}, {"userName": "C.G. Drews", "userReviewDate": "Jul 22, 2016", "userURL": "http://www.goodreads.com/user/show/11375137-c-g-drews", "userReview": "This series is so criminally underrated, I tell you. IT IS SO FREAKISHLY GOOD. I just want to hug it. The world-building is on point and the characters are stabbily adorable, plus there's sass, and the occasional smushing of my feels. A COMBINATION OF GLORY. Although, to be painfully honest: I felt like the pacing was off in this instalment. It didn't ruin the book for me, but I did feel a bit befuddled. But I'll get to that.First I have to gush.NO NO WAIT. First I have to confess I've been procrastinating this series because (A) the books are just getting huger, and (B) I don't want it to end!! So it's been AGES since I read The Exiled Queen and I'd forgotten a lot of things. #mybad The book did a bit of recapping though, which was endlessly handy. Thank you bless you god save the queen.This 3rd book heavily features: TRAVEL. I admit that's not my favourite. The first 100-pages were tedious with people just TRAVELLING AROUND ON HORSEBACK. I mean, they got shot at. So that at least is fun. Everyone would like to kill Raisa. She's now on the warpath to get her throne back.I am on the warpath to get her and Han back together.Obviously Han would have to find out EVENTUALLY who Raisa really is. He took it...super badly. Their relationship took a curving dive in this book and broke my heart. But there is still kissing. Even though they are 1000% the most forbidden of forbidden romances. Every time they come head to head it's like \"Will they kiss? Will they stab each other? Who can know?\" <-- My favourite kind of romance.But with all the politics, travel, and meetings featured....it did lack a bit of the SPARK the other two books had. Hans POV is relegated to the background a little. My heart breaks over that, omg. I love Raisa, but I love Hans more. Also there was no real climax. Like...how???? I kept waiting for something to happen, but it was like 10-pages to the end and I realised we weren't going to get a high stakes climax or cliffhanger. So yay I guess for no cliffhanger?? BUT I REALLY WANTED A CLIFFHANGER. I wanted the screaming fangirling flails I had in the last two books: I did not get them with this bizarre pacing.But whatever. THERE WERE SO MANY OTHER GOOD THINGS THAT I DIE OVER LOVING:• Han's sass and smooth street talking slang and rougish devilry. Seriously, he is such a devil in this book AND he becomes a very much better dressed one. Since he's embracing his wizard side fully now and working for the crown, he dresses like it. LIKE CAN I MARRY THIS BOOK?? HAN. (I have a small crush.)• Also he is so in love with Raisa it's adorable. He's absolutely pretending not to and he absolutely is.• Raisa's ability to live through, like, EVERYTHING, is very admirable. If you're waiting for her to get shot, stabbed, poisoned, attacked, punched, etc. = this book is for you.• I still don't call it a love-triangle! But Raisa has, well, I mean, I'm pretty sure she has feelings for Amon, but it's not angsty or overly romantic. I think she truly sees him as a friend, but the idea of him marrying means he's no longer SOLELY hers. Which is why she gets knotted about it. Hence I still maintain it's not a triangle.• Someone needs to stuff Micah in a jar and then toss him into the sea.• I really like Fiona Bayer! I think she needs to be in the book more. Preferably more than Micah.• Please someone knock off Micah.• Han needs to stop being so devilishly charming omg.• I also love love love how detailed and intense the world building is! THE WORLD IS SO HUGE and this fantasy world just leaps off the page as one of the best I've ever read.• The wolves are speaking!!• THE MAGIC IS AWESOME.• I AM IN LOVE WITH THIS SERIES SO MUCH.Although my only two real complaints (apart from the weird pacing) and that really should be illegal complains are (A) the book I've bought is freaking heavy. It actually HURTS to read for long periods. What did they print it on??? STONE???? and (B) there is not enough food in this book. I demand more than porridge, dude.ALL IN ALL: Another glorious instalment. Except I only have one book left and I'm really not ready for this. This has got to be one of the most epic and amazingly constructed fantasy series of my life, and I adore the mix of rougish charming devils, wizards, plot twists, matriarchies, forbidden love, native clan culture, and streetlords and thieves. This series has pretty much stolen me. I'm so okay with that."}, {"userName": "Caitlin", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/57334157-caitlin", "userReview": "[Alger Waterlow aka the demon king (hide spoiler)]"}, {"userName": "Maureen", "userReviewDate": "Jun 04, 2016", "userURL": "http://www.goodreads.com/user/show/10762033-maureen", "userReview": "Another that may be more like a 4.5/5 starsStarts off heartbreaking, but faded toward the end for me. I kept waiting for something bad to happen but I know it's coming next book! Still loving these characters. I just love Raisa so freAKING MUCH GUYS. Team Raisa forever.I mean everyone else is okay but RAISA."}, {"userName": "Stacia (the 2010 club)", "userReviewDate": "Jun 07, 2013", "userURL": "http://www.goodreads.com/user/show/4013351-stacia-the-2010-club", "userReview": "\"Nearly all my life I've taken what I wanted, when I wanted it, with no thought for the future, since I wasn't likely to have one. Do you know how hard this is for me? Do you?\"\n\n4.5 stars Dear lord...the feels, the feels! The goodness train keeps rolling. Lives are at stake. Love is at stake. There's danger, magic and intrigue aplenty!There are no dragons though. Ah well. I still don't know what to say about fantasy books or how to sell them. If you don't read fantasy, you're really missing out (boo to the real world all of the time!), especially when gems like Seven Realms come along. This series explains many of the reasons why I like fantasy, especially when it's done right.In fact, I don't even know if I can find one thing to complain about. Well...maybe one thing. The first 20% was ridiculously slow and I thought I'd stumbled into first book syndrome for a minute. I'll just chalk it up to the author laying groundwork for what was to come because when stuff started happening - hoo boy. Yes, I said it. HOO BOY. Raisa's braver than I am. I would have stayed in hiding. After all, there were lots of boogeymen lurking in the shadows. I don't know if I would be able to sleep if I were her. What's that? Arrows flying at my head? Yeah...I'll pass. Thanks.Everyone says the final book (number 4) is phenomenal and the best of the series, which means I'm super excited to read it. Unfortunately, I have to wait until July to use it for a challenge. *angry face*Until that time comes, I'll leave you with a Han moment...\n\n'She's tough for a blueblood,' he'd thought a lifetime ago. 'Maybe tough enough to be with me.' He hadn't considered that he might not be tough enough to be with her.\n\nLove. Love. Love. Why does fantasy turn me into an incoherent child who forgets how to review? I guess we'll never know because I have yet to figure out how to do this.*exits stage right**realizes she went the wrong way and turns around to exit on the proper side*"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Aug 28, 2015", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "AT SOME POINT, I \"WILL\" TAKE BACK MY THRONE!I loved this book, I love this series! It just keeps getting better! Yay! I know the last book is going to be awesome too, although I dread what might happen! So Raisa is out on her own waiting for when it's safe to come back home. One of the jerks is killing people left and right, she has assassins looking to kill her and other people so she needs to stay in hiding. She is worried about Han and Amon. One day someone does come and finds her at an inn. I'm not going to say who because it doesn't end well for them and it was really sad :( Raisa can see images of wolves who are the queens who came before her. Sometimes, they give her messages but it's always right before something bad happens and they can't tell her everything. It's one of those... just tell me times!!!! She is in the woods at one point in time and she is talking to a wolf and I just love it, if you have been reading the series you will understand this quote from the book:•••••••Raisa stared at her. \"Who are you?\" she whispered.\"I am Hanalea ana'Maria, who shattered the world.\"\"But...\" As Raisa groped for words. Hanalea bowed her head and turned away. She broke into a lope, ears back, tail streaming behind her, disappearing into the shadows under the trees.••••••••••There are many characters in this book that were in the other books. Some don't make it and some who deserve not to make it ... didn't :)I love Han and I was really sad when he was upset finding out who Raisa really was.. but... he got over it :) We shall have to see where that will lead or not lead in the next book! The entrance Raisa and Han made into the kingdom was so freaking classic! I loved it. I wish I could give out spoiler but I just can't, just know I got chills when they and some of the warriors arrived and the look on the jerks faces that wanted her dead!!!!!!!!!!!!! And some of the hell Raisa gave to some people is just magnificent! I had a few choice other words for that moment, but I won't share those here. LOL! But let me leave you with some parting words from the book:•••••••••••••••Jemson lifted the ornate Gray Wolf crown from its velvet cushion, raising it high. \"By the authority vested in me as Speaker of the Cathedral Temple of the City of Light, I crown you, Raisa ana'Marianna, Queen of the Fells, thirty-third in the new line.\"And he settled the crown on her head.On the dais, the Gray Wolf queens bowed their heads in acknowledgement of their new sister queen, and dissipated like vapors.~FIN~"}, {"userName": "Cait • A Page with a View", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "These books just keeps getting better!!! It's definitely one of my favorite YA fantasy series at this point. You know those books that you get so into that you actually start shaking the book in frustration or laughing out loud? This is one of them :)There really is no way to recap all of the amazing adventures and twists that happened in this story. And at this point I know my ship isn't going to sail... it's basically a ghost ship and I knowwww I need to focus on the rest of the story and give it up. This book really is about Raisa -- SHE BECOMES SO BADASS and I love everything.I adore all of the characters so much but am a bit disappointed that so many scenes were summarized in a passive tone that made it hard to connect with the events. I still don't have a very strong sense of Micah... and Amon was less visible than most secondary characters. I honestly would read 200 more pages if it meant I could see some more dialogue and/or reactions!But this series is amazing and one of my top recommendations for sure!"}, {"userName": "Jessica", "userReviewDate": "Jan 08, 2015", "userURL": "http://www.goodreads.com/user/show/12842423-jessica", "userReview": "Wow. This book was awesome. I read all 517pages in just 2 days... In a way, I was sad for Han and Raisa to have to leave Oden's Ford... but I knew they would have to go back eventually. I really liked all of the character development since the start of this series.. I think it was done very well and it was very believable! I just love Han! It's so strange to see him fitting in so well living in the palace though... Well, of course he's still making enemies. I love that the first half of this book, is all of our favorite characters trying to get Raisa back home safely. I was a little surprised that nothing really bad happened when she showed up for her mother's memorial though. I know she got shot after, but she was wearing armor so it turned out okay. I'm just surprised the Bayars haven't done more. I kept thinking that she WOULDN'T get crowned by the end of the book and that we would have to wait until the 4th. I feel like she's learned so much and is going to be an amazing Queen!I'm really excited to see what happens with her and Han, what happens with Crow, what (hopefully terrible) fate Lord Bayer will end up with... I'm also curious as to who is really killing all of the wizards in the streets and taking their amulets? Can't wait to finish this series!"}, {"userName": "Chelsea ❤Peril Please❤ ", "userReviewDate": "Mar 18, 2016", "userURL": "http://www.goodreads.com/user/show/8422853-chelsea-peril-please", "userReview": "I have lost everything. Then he corrected himself. Every time I think I've lost everything, I find there's still something else to lose.\n\nHere's the thing: I adore this series. I adore Han. I adore Raisa. I adore Amon and Dancer and Cat. I adore the subtle action and almost too perfect to be true romance. I adore the writing, the humor, the wit, and the friendships...but most of all, I adore how it makes me feel. As a reader, I've evolved in ways I never imagined possible. At one time, I would read a book and just be excited about the smallest things. Intense feels were not hard to come by a couple years ago. But now, at this stage of my reading life, I have pinpointed those small things that made me smile a little larger, obsess a little harder, lose my breath in the most shocking way...and I have almost, in a weird way, became a professional of finding what makes me tick. And, to be clear, if it isn't obvious yet: This series is what makes me tick.\nHe could protect himself-and if he failed, well, he'd been ready to pay the personal price for failure all his life. But how could he keep Raisa alive when so many enemies seemed bent on killing her? How could he become powerful enough to make a claim on her-to make her take him seriously as a suitor? How could he convince her to see him as a peer-someone who could partner with her in every way?\nIt's not only the writing or forbidden romance or peril to come. It's not always about a well-written story. I know I always say that's what makes me choose to read or not to read, but it's so much more than that. I mean, come on, if something can make me a crazy obsessive loon for a week (or the rest of my life, for that matter) then it surely is worth overlooking a few flaws, here and there. I mean-that's life. Everyone is flawed, believe it or not. Yeah, sure, I'd love to read the perfect book at the perfect time with every little thing happening just as I'd want it to all the time. But then I think-Chelsea, that's so GD short-sighted. You are compartmentalizing. You aren't opening up your mind and letting new things touch you in new ways. So, fantasy is my way of letting go, letting an author take me somewhere I could never fathom on my own..but this series is damn close to everything I could ever want in a story. Eerie when you just let things go and they are everything you could want.\nShe didn't know how long he'd been there staring at her, but it seemed to take him by surprise when she looked up and caught him. His usual street face was gone. In its place was a wistful vulnerability, a kind of feverish and hopeless desire. Magret had said he had a hungry look about him. Was that what she'd meant? And what exactly was he hungry for?\nIt's no secret that the male lead in this story is the underlying factor as to why I am pushing through this series so quickly. I'll admit it: This young thief, ex-streetlord, wizard, etc. has stolen a piece of my heart. And the craziest thing is, he's not even reached his full potential yet. I mean, book one is my favorite so far, and he barely even shined (apparently)! I don't know-there is just something appealing about being pulled in when you didn't expect to be. The unexpected gives you so much more than knowing every little thing that might happen. So, when my tummy did a little flip flop when we first met Han in the beginning.....I knew I was going to be a forever fan of this series.\nHe threw his head back, the column of his throat jumping as he swallowed. Drawing a deep shuddering breath, he looked down at her again. \"Nearly all my life I've taken what I wanted, when I wanted it, with no thought for the future, since I wasn't likely to have one,\" Han said. \"Do you know how hard this is for me? Do you?\" \nI didn't say much about the book because I don't feel like I should. For those that have read the series (Cough, Snake, cough) you already know what happens, so why recap? And for those who haven't, you won't be reading my review, most likely, anyway. So, who cares? My problem is exactly what I said below: I am forever cast out of this world by real life and demands that come at me daily from all sides of the annoying spectrum-Work, home-life (well, this isn't annoying, but reading Chelsea has no such qualms in saying so), and various activities I'd rather not have to deal with. They exist even as I do, suspended in a moment of time where I continually have to close the book and come back to reality. I can't wait to finish the final book this weekend...but waiting until then JUST might kill me. Sigh. For more of my reviews, please visit:\n\n \n \n \n \n*********************Ahhhh I'm finally into that territory where my stomach is in ceaseless knots and my heart is consistently going into overdrive. The butterflies are abundant as love, loss, betrayal, and heartbreak grip at our two main characters, Han and Raisa, making me a happy happy Chelsea. I am already on book four and I am so mad I have to be at work while Raisa and Han exist in another world, going about their lives, living in a perilous existence I can't be a part of while I sit here stranded in reality.I hope to write a better review for this-quotes and all-hopefully tonight. But who cares, anyway...it will just be rambling fangirling anyway. lol. RTC."}, {"userName": "Choko", "userReviewDate": "Nov 27, 2015", "userURL": "http://www.goodreads.com/user/show/27962805-choko", "userReview": "*** 4.75 *** A buddy read with the biggest Fantasy enthusiast at BB&B!!!I am the luckiest Fantasy reader in the world!!! Why??? Because since the beginning of the year I have been blessed with being introduced to some of the most amazingly talented authors and have had the privilege to read those already exceptional artists most exceptional contributions to my favorite genre!!! The book fairies have decided to be good to me this year, maybe feeling sorry for my none existent Real Life, and have made it possible for me not only to be able to afford said treasures, but with the help of my good friends on GR I get to widen my horizons and have buddies to discuss them with in buddy reads sent from the Stars for our pleasure!!! :-)Another book in this series, another almost full 5 star rating!!! I am already in love with the world, characters, and magic in the series, and I keep on walking into their steps in order to see how are \"we\" going to untangle the whole clusterfuck of a situation we have here... I think I plan on stalking Han, Raise, Dancer and Cat until the author decides to stop torturing us, or no one is left standing... I just hope we get a good outcome at the end - will be satisfied with that, if a Happily Ever After is not possible...So, this volume was full of action, hope, tears, and quite a few good and bad guys found their end..... Raise is growing, Han is starting to actually think, and Dancer is coming to terms with his origins despite the dark feelings all harbour about them... Raisa's grandma is driving me mad, the radical stands of the tribes and wizards insight me to unspeakable violence, and budding love is in the air... But overall things are still quite Grimm....I recommend this series (to read in order), to all classic, epic fantasy lovers of all ages!!! It is worth the time and it has become a favorite of mine!!!Now I wish you all Happy Reading and may you be blessed with many good books!!!"}, {"userName": "Sab H.  (YA Bliss)", "userReviewDate": "Oct 04, 2010", "userURL": "http://www.goodreads.com/user/show/2401865-sab-h-ya-bliss", "userReview": "Rich, sexy, layered, enchanting, riveting and enthralling. I don't know how much more I can say about this series that wont be repetitive from my first two reviews. What I can say for sure is that rarely has any author achieved such excellence in high fantasy for young adults. Actually YA high fantasy is rare, and rich fantabulous world-building with three-dimentional fully-developed characters is even more rare. So this book and the rest of the series are truly a gem in their kind.Cinda Chima is one heck of an author. She just makes this story better with surprises and twists everywhere. The writing always blows my mind and the fact that she manages to have astonishing writing, magical storytelling and a gripping plot in every single book is beyond amazing. Every character is unique. I love Han like a crazy person. Every scene is so powerful, so full of images, that it's hard to remember you are not there with them.I stated when I first read this back in March that feel unqualified to write this review, because I feel so stubbornly biased. My passionate yearning for this book and my bleeding love for the story has made it so I cannot possibly find any wrongs in it. And that is true and will be true for the last book as well. So instead of raving some more I will tell you that if you want excellence you should read this. If you like Game of Thrones or books (or Tv shows) of the kind, you should read this. If you enjoy romances and royalty, you should read this. And if you don't read this, man, you'll be missing SO MUCH."}, {"userName": "Ann", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/13682027-ann", "userReview": "“I have lost everything, Han thought. Then he corrected himself. Every time I think I’ve lost everything, I find there’s still something else to lose.”HOLY SHIT THAT WAS BLOODY EPIC. Let just say that this freaking book was everything I wanted in life and I couldn't be more happy about it!! I'm so in love with the story and this characters, I think I could literally read a million books about their adventures and I'd never get enough of them!Now I'm super excited to read the last book, even though I don't think I'm emotionally ready! *THE FEELS MAN* Honestly, this has become one of my all time favorite series ever and I HIGHLY recommend that guys read it because it's absolutely FANTASTIC!❤️5/5★★★★★"}, {"userName": "Kisses A", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/41833669-kisses-a", "userReview": "Edit I am almost finished with this series and I am heartbroken: ( I want more books!!!So some of the images coming to my head while reading. FRTC4.75* it is by far the best book so far! I did not like book 2 as much but this one really got down to business ( at some point I even had to fan myself)EditCrow reminds me of Feelings and moods going into this book..."}, {"userName": "Melissa (Ever So Mela)", "userReviewDate": "Jul 12, 2016", "userURL": "http://www.goodreads.com/user/show/28640648-melissa-ever-so-mela", "userReview": "I have definitely learned to like these books ^.^ On to the last one! RTC"}, {"userName": "Amren's Wife Taylor", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/38570248-amren-s-wife-taylor", "userReview": "4.5 stars. This was absolutely fantastic. I’ll keep this super short and relatively low spoilers because not many seem to have read these novels and I’m itching to get on to the last book already. Oh the first half of this series was great, but it just upped its game monumentally in this third novel. I can officially say that I would recommend this series. All of you reading this review I’m telling you right now read these books. I am so glad I powered through book one and went on to read the rest, especially after finishing The Gray Wolf Throne. These books are so underrated, but my high fantasy heart loves them. Honestly the Seven Realms is one of the best examples of world building I’ve ever come across. It’s so unbelievably thorough, Cinda Williams Chima deserves so much more credit for weaving something like this if not everything else. I’m a sucker for high fantasy and this was so satisfying. I am extremely invested in these characters. I would go to war for Raisa ana’Marianna myself. She’s not without her faults of course, but she is absolutely brilliant. I love how strong willed she is, but yet so self-sacrificing at the same time. And of course Han. He’s been through a lot as well and he just keeps on fighting. I’m really getting tired of everyone assuming the worst of him. I just love these two protagonists with all my heart, but I love them together even more. The mutual pining and jealousy is both the best and worst thing. Honestly if they don’t end up together, what was the point of it all? Maybe I shouldn’t say that, this is a fantastic story regardless, but still. We’ll see."}, {"userName": "Molly Mortensen", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/20862217-molly-mortensen", "userReview": "[Edon Bryne, Mac Gillan, Queen Marianna, Geoff Montaigne, Trey Archer (hide spoiler)]"}, {"userName": "Cece ❀Rants, Raves &Reviews❀", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/66199133-cece-rants-raves-reviews", "userReview": "I became so obsessed and enthralled with this book that i totally forgot to mark any quotes. I just inhaled this book then spent an entire day thinking about it, it was just such an amazing journey. This is one of the few books that had freaking hilarious chapter titles! This is an underappreciated quality, that added so much to the bookPicking over old BonesThe price of deceptionThe Games BeginAre just a few to spark your interest. And now a sneak peek at how my queen is doing:\n“Somehow, Raisa managed to get through dinner without throwing up on the new king of Arden or anyone else. She accomplished that by eating very little”\nShe's had better days to be perfect frank, but i believe in her! Moving on next book, letsss goooo!!!!"}, {"userName": "Ash Wednesday", "userReviewDate": "Mar 07, 2014", "userURL": "http://www.goodreads.com/user/show/10484016-ash-wednesday", "userReview": "[I’m mad nervous about Amon’s future in this series. I’m eyeing Fiona Bayar and Elena Demonai warily. What does Fiona know about that amulet that she wanted to tell Han about before?  (hide spoiler)]"}, {"userName": "Kristi", "userReviewDate": "Dec 04, 2010", "userURL": "http://www.goodreads.com/user/show/1310688-kristi", "userReview": "I think I'm just going to copy and paste my review of The Exiled Queen and use it for The Gray Wolf too! Okay, not really.... but it would work!This series simple continues to get better and better as it goes along. I desperately need book four PRONTO! I'm glad I was able to start The Gray Wolf Throne so soon after reading The Exiled Queen. The characters and the story line were fresh in my mind, and I believe that always makes for a better reading experience. Needless to say, it doesn't always work out that way for me, but I feel a more instant connection with the characters when it does happen. I will sorely miss this characters as I wait for book four. I feel as though they've became my best friends. I've watched Raisa grow from a somewhat spoiled and entitled girl to a smart and selfless queen. I've watched Han transform from a thief into a powerful wizard. I can always use a little more Han! I love these characters, and I love this story.This series amazes me... the intricacies of this word, I am seriously awed when I'm reading. Just the imagery and the imagination that Chima possesses. It's one of those \"wow\" moments. Everything in these series just comes together and works to beautifully. As I said in my review of The Exiled Queen... it's addicting!I'll say it again... one of my most favorite fantasy series ever! And one of the best books I've read all year!"}, {"userName": "Donna", "userReviewDate": "Aug 10, 2011", "userURL": "http://www.goodreads.com/user/show/2465264-donna", "userReview": "Holy crap. Absolutely fantastic. Crap, crap, crap. Why crap? Because after THE DEMON KING and THE EXILED QUEEN, what do I have left to say?The world is still as utterly fantastic as it's always been. Richly colored and full of life, Chima hasn't let it slip by as a sacrifice to the greater plot. It still plays its role magnificently, hanging out just on the edge of the background and foreground, being its own character but knowing when not to be overwhelming.I'm all for Han and Raisa but there was a piece of me that rooted for Raisa and Amon too, despite how implausible (even more so than her and Han) the relationship was. It did end up going down the route it was destined to go down (as intoned in the second book, the Byrnes are not about to break the line any time soon, 1,000 years of history supports that). Even though it went where it was supposed to go, I couldn't help but feel a little bit sad. For as long as it was pushed off, the harsh reality could be ignored. No more and it was a bit of a hard pill to swallow. But they both swallowed it because they had to.The mounting tension between Raisa and Han is just phenomenal. When he finds out just who Raisa is, it's heartbreaking. You want to tear through the pages and slap some sense into him but it's Han. He's far too steadfast for something like that. But they're forced together anyway (in a more professional manner) so any ill will Han does have towards Raisa he's forced to swallow it back for the greater good.But Han's resilient. He knows full well he's being used but he flips the situation to his advantage. He finds all of the holes that would end up benefiting him while performing his duties and he takes them. He makes sure that he plugs those holes with his desires first and foremost. You can't help but be impressed by someone like that. He holds his own against the bluebloods and he deserves some respect for that.Raisa is still infinitely awesome. After multiple attempts on her life she continues to land on her feet. Like Han, she's fully aware that she's being used by everyone around her, not to mention being underestimated constantly (bad on those doing it) but she's had enough political upbringing to view things from all sides. She doesn't make hasty decisions and knows strategy like no seventeen-year-old does. I don't feel like I'm reading about someone so young but about someone even older than me for how she holds herself. I love her more and more with every book.And the ending? Cruel to the point of barbarism. If I'm not mistaken there's one more book in the series yet to come out. How long do I have to wait for that one???If you haven't started reading this series yet, you really need to get on it. It's such a relatable, engaging high fantasy novel that I think even someone that isn't the biggest fan of fantasy will get pulled right into it. Sure there's magic and wizards and a whole new world but it's about the people, first and foremost. And the people are just so dynamic and intriguing that you won't want to take your eyes off of them. THE GRAY WOLF THRONE is a fantastic piece of the SEVEN REALMS puzzle. This series just keeps getting better and better. I'm going to have to create a sixth bite rating for the next one."}, {"userName": "Lainey", "userReviewDate": "Nov 18, 2012", "userURL": "http://www.goodreads.com/user/show/1047767-lainey", "userReview": "I was just so ready for this to be the book that rises above the average quality (for me) of the first two because things are finally moving forward and Raisa is actively fighting to claim her throne...but I just can't...things still bother me about this series. My biggest gripe is why the lack of fully realized female characters??? Just because Raisa is one of the two protagonists in this book doesn't mean it is alright to basically dismiss the other girls in the novel as trivial, frilly, silly, etc. Let us run down the list of female characters of Raisa's age and how they are portrayed: (1) Mellony - \"frilly and lightweight\" as per Amon's assessment. We're supposed to think she's silly for falling for Micah when we know Micah is only after the throne and is really in love with Raisa. (2) Cat Tyburn - so close to a great female character but is demoted to Raisa's maid and basically gets ordered around by Han. (3) Fiona Bayar - smart and ambitious and is probably up to something nefarious (we don't know yet) but still powerless and flirts with Han a lot when we know he's also in love with Raisa. (4) Night Bird - capable warrior but still in love with Nightwalker who is also in love with Raisa (sensing a pattern here?). (5) Annamaya Dubai - she doesn't even get a single line and is now doomed to marry Amon WHO IS ALSO IN LOVE WITH RAISA (just stop it already!).(6) Melissa Hakkam - she counts even though she's basically only in the story so she can be portrayed as being flirty and silly and so not \"what a strong woman should be\".(7) Talia - yes, she's here and she's still great but her only substantial scene is when she gets severely injured defending Raisa.This whole issue really gets to me because while this series portrays a great friendship between Dancer and Han, why can't the author do the same for female friendships? Why can't we have a female character who Raisa treats and respects as her equal (not socially of course because she's the queen but you know, personally)? Instead we get other girls who either work for her or who she sees as silly butterflies and therefore not worth her time. Just really, how hard is it to write about supportive loving female friendships? And oh yes, there was a scene where Raisa complains that there aren't more women in her council. That was totally great at first but then nothing comes from it. Maybe it gets addressed in the next book but I'm beginning to think that line was thrown there \"to cover the bases\" without any intention of following through on it.And another thing, why must strong women always be portrayed as warrior women who can fight with swords and arrows? Why is embroidery or art seen as trivial pursuits suitable only for those with nothing better to do with their lives? Someone's character should not be judged on whether they like shoes and silks as opposed to swords and daggers. Liking pretty things like gowns does not mean someone is shallow and trivial, it just signifies an appreciation of beauty.I probably need to stop reading books about princesses for a while."}, {"userName": "Nicklein Mae", "userReviewDate": "Dec 16, 2017", "userURL": "http://www.goodreads.com/user/show/6058998-nicklein-mae", "userReview": "Character development is strong with this one. Sorry I had to because The Last Jediiiiiiiiiiiii.Anyway, as I was saying, the author was busy doing major character development left and right in this installment. It was such a blast seeing the characters grow right before my eyes. I’m so proud of them. *sniffs*I highlighted some of my favorite quotes and I might just squeeze them in here later. My eyes are too tired right now. I am so excited to read TCC because I spoiled myself and peeked at the quotes section here in gr. I thought why the hell not there’s no harm in doing that. And I’m glad I did because I finished this in less than 24 hours which never would have happened if I wasn’t inspired af.I’m shaking with excitement.All that longing will finally come to an end. Hopefully. Plus the epilogue of this book intrigued me as well. Hmmmm... seems like someone *cough lord please-just-drop-dead bayar cough* was setting my baby Han up. Not good. I’m angry.I was actually planning to give myself time to clear up my head a little bit and soak in all the feels before reading TCC but who am I kidding. The whole idea was laughable seeing as I’m halfway through TCC as of this moment. Sorry not sorry."}, {"userName": "Zoe Wilson (yerabooknerdzoe) ", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/43321228-zoe-wilson-yerabooknerdzoe", "userReview": "I'm so curious to see where this series is going. I have many thoughts! I need to finish this series soon so I can do an in-depth discussion. The characters are bothering me less and less as they grow as people, and each book has gotten better than the last. This is quickly becoming one of my favourites!"}, {"userName": "Azbaqiyah", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/38427441-azbaqiyah", "userReview": "\"I continue to believe in miracles. But I know miracles come for those who work really hard.\"Raisa Ana'MariannaPlot - So much anger, sadness, frustation in this book and yet I love it ♥♥♥Character - Crow succed to capture my heart just like he do with Hanalea. I wish Chima would do a books about him.World Building - I need to tell you again I'm loving Seven Realms!Writing Style - Amazing...simply amazing...Stars - 5 ★."}, {"userName": "Victor Almeida", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/21994677-victor-almeida", "userReview": "*4.5*AAAAAAAAAA essa série é perfeita, maravilhosa! Eu amei esse livro, assim como os outros, mas acho que foi o mais sem acontecimentos até agora, e consequentemente o mais fraco. São basicamente 400 páginas de tramas políticas e formulação de planos, com pouca ação e prática das teorias que os personagens formulam. Claramente um livro de preparação pro último da série (que espero que seja cheio de eventos e não me decepcione)."}], "description": "Han Alister thought he had already lost everyone he loved. But when he finds his friend Rebecca Morley near death in the Spirit Mountains, Han knows that nothing matters more than saving her. The costs of his efforts are steep, but nothing can prepare him for what he soon discovers: the beautiful, mysterious girl he knew as Rebecca is none other than Raisa ana’Marianna, heir to the Queendom of the Fells. Han is hurt and betrayed. He knows he has no future with a blueblood. And, as far as he’s concerned, the princess’s family as good as killed his own mother and sister. But if Han is to fulfill his end of an old bargain, he must do everything in his power to see Raisa crowned queen. Meanwhile, some people will stop at nothing to prevent Raisa from ascending. With each attempt on her life, she wonders how long it will be before her enemies succeed. Her heart tells her that the thief-turned-wizard Han Alister can be trusted. She wants to believe it—he’s saved her life more than once. But with danger coming at her from every direction, Raisa can only rely on her wits and her iron-hard will to survive—and even that might not be enough.The Gray Wolf Throne is an epic tale of fierce loyalty, unbearable sacrifice, and the heartless hand of fate.", "title": "The Gray Wolf Throne\n      \n          (Seven Realms #3)", "url": "http://www.goodreads.com/book/show/9409469-the-gray-wolf-throne", "average": 4.39, "cover": "https://images.gr-assets.com/books/1312142235l/9409469.jpg", "reviews": 1836, "authors": [{"url": "https://www.goodreads.com/author/show/125308.Cinda_Williams_Chima", "name": "Cinda Williams Chima"}], "type": ["Fantasy", "Young Adult", "Fantasy", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/9409469-the-gray-wolf-throne", "http://www.goodreads.com/book/show/12973281-the-gray-wolf-throne", "http://www.goodreads.com/book/show/25539406-o-trono-lobo-gris", "http://www.goodreads.com/book/show/6342491-the-demon-king", "http://www.goodreads.com/book/show/213647.The_Warrior_Heir", "http://www.goodreads.com/book/show/7801229-the-exiled-queen", "http://www.goodreads.com/book/show/500743.The_Wizard_Heir", "http://www.goodreads.com/book/show/8069828-the-crimson-crown", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}