{"ratings": 29945, "userreviews": [{"userName": "Bibi", "userReviewDate": "Sep 24, 2016", "userURL": "http://www.goodreads.com/user/show/33411728-bibi", "userReview": "Had I not read this book, I would never have believed Baldacci capable of supplanting Wish You Well as the most uninteresting-not to mention trite and arduous-book of his career. This was painful. Pace yourself by taking multiple breaks."}, {"userName": "Alex is The Romance Fox", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/6663962-alex-is-the-romance-fox", "userReview": "The Guilty, 4th book in David Baldacci’s Will Robie Series, continues with the life of a government assassin that finds himself at a crossroad in his life. Will Robie’s past is having an emotional effect on his job and he will have to face it head-on before he can move forward with his life.His last assignment, where he killed an innocent bystander has resulted in him questioning his capabilities and adding to his problems is that he’s been informed that his father, a former marine, who he hasn’t seen since leaving home at 18, has been arrested for murder in his hometown.Deciding to confront his demons from his past, he thinks back about his parent’s marriage, the love he left behind as he travels to his hometown, the small town of Cantrell, Mississippi. He’s amazed to discover that his father was the town’s judge and had become very wealthy since he had last seen him. He also finds that his father had remarried and fathered a son and his half-brother. His father’s attitude towards Will’s offering to help him is just as he expected. Rejection and coldness but Will is not going to give up. He needs to do this for his father if he’s ever able to overcome the past in his life.The author creates a small town with believable characters and all their daily life intrigues. Where everyone knows everyone’s business and how Will’s sudden appearance gets everyone involved in what is happening in the small place.Jessica Reel makes an appearance again….so happy about that!!! Love this character. Not only because of that…but she actually “pops” up and saves Will’s life once again!!! The character development is absolutely amazing including secondary characters.This is a very complex plot filled with the most unexpected revelations. Nothing that I was expecting. And even when everything is revealed and when it feels a bit unbelievable….the actual villain ….wow, I never expected that….it somehow seems real….is that a bit weird or not!!!David Baldacci is such a great storyteller. I just kept turning the pages and wanting to find out more.A great series and looking forward to the next Will Robie book!"}, {"userName": "Wendy", "userReviewDate": "Nov 25, 2015", "userURL": "http://www.goodreads.com/user/show/19889444-wendy", "userReview": "The GuiltyI love all of David Baldacci's series but this one is by far my favorite. The stories are always fast paced and enjoyable. I'm always waiting for the next book to be published."}, {"userName": "Rob1109", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/36504835-rob1109", "userReview": "This is a review I never imagine posting. It actually pains me to write this about someone who had once been one of my favorite authors. There was a time when David Baldacci was my second favorite author. He slowly dropped from #2 but remained in my top 5. Then he dropped somewhere between 6 and 10. Now? Now I sadly can state I’m close to giving up on him completely. His novels have become formulaic. Characters interchangeable. It almost feels like he uses the same template—and then just inserts whichever character. (Am I the only one who feels there no difference between King and Sean Maxwell and Will Robie?) I will say that, for some reason, I never got into ‘The Camel Club’ series. That was okay, though because I loved John Puller as well as King and Maxwell and Robie and Reel. His standalones were…good. But even those always felt like it could have been one in a series. Lately, the only novels of his I’ve enjoyed are the John Puller books. “The Forgotten,” which was the first Baldacci book I ever read, as well as ‘Zero Day’ and ‘The Escape’ were great novels.However, the last several non-Puller books I came across were really struggles to get through. First Family (K & M) was a big disappointment. The president’s family was so unbelievable the book was almost laughable. But I suffered through it cause…well, it’s Baldacci. I read ‘Split Second,’ the first K & M book. I finished it mostly due to the fact it was interesting to see how K&M started out. The story, the plot and the writing was a bit of a struggle. But I read it cause…well, it’s Baldacci. “The Innocent” was the first Will Robie novel. I found it awful, especially Robie’s sidekick who was 13 going on 35. It was not believable and read like a comic book…but I struggled through it because…well, it’s Baldacci. This evening I started reading ‘The Guilty.’ I was very excited to delve into his brand new novel. Well, I cant believe I’m writing this about a Baldacci novel but for the first time in my life, I simply could NOT finish it. Just an awful terrible book.The book started out great. The first 25 pages had me pulled in. Then—it turned to cr*p. I wont reveal a spoiler but I will say Will goes down to the sticks on Mississippi to investigate a murder. Now, I understand authors need to write dialogue to reflect the way people speak. The book needs to ‘ring true.’ But this was too much, too over the top. I’ve never been a fan of or have enjoyed southern writers such as Faulkner or Tennessee Williams. And that’s what this book became. After only 60 pages I gave up.Mayb’ it’s me, y’all but this here done book? Nosirree, it jus’ didn’ do nuthin’ fors me and I’ze jus’ foun’ it too har’ to read. I reckon I hadta read ev’ry sentence a coupla times to understan’ what they was talkin’ ‘bout there. See what I did there? That’s how this book read. I even flipped ahead to page 125, 150, 200 just to see if Robie would ever be conversing with people who don’t have thick southern accents. But even as I flipped forwards, I done seen more and mores words done there cut off and that’s when, by God, I reckon’ it was time fors me to given up on this here book. I’ve come to the sad realization that if you’ve read one Baldacci book, you’ve read them all. Why do so many characters have ‘daddy issues’, be it Michelle Maxwell, John Puller and now Will Robie?Why does every protagonist have deep-seeded self-doubt and always ALWAYS have mixed emotions about what they do?Will Robie comes from a small town in the swamps of Mississippi. Michelle Maxwell comes from a small town in Tennessee. Will Robie has issues with his father. Michelle Maxwell has issues with her father. John Puller has issues with father. Be it King or now Robie, they work for the government but always want to get out. They spend the novel believing this will be their last case. And sure enough, at the end, they agree to come back for one more.Why does every male lead (Maxwell, Robie, Oliver Stone) always appear as the principled straight man while all around him are sneaky. His books, sadly, have become so clichéd and so predictable and the writing almost so simplistic, they are preposterous. Sure enough, in one scene in ‘The Guilty’ Robie, distraught and mulling over getting out (as all Baldacci characters always do), is walking through the streets of Washington DC in the rain. Just him and his thoughts. Alone. All alone. Then, wouldn’t you know it but who comes out of the bushes all quiet and sneaky as if in a Hollywood spoof, but Robie’s boss—the msysterious shadow “Blue Man.” In a clichéd conversation, Robie asks, “How did you know I’d be here?” to which Blue Man replies, something like “I know the way you think.’ With that, Blue Man hands Robie the stereotypical manila folder, then retreats stealthily into the dense shrubbery seemingly swallowed by the darkness of Washington. Sheeesh!Just an awful book. This year Mr. Baldacci wrote 3 novels. 3 novels in 11 months. I really wish he’d writer slower but better. His books have become boringly predictable, his characters are all carbon copies of one another and his storylines have become mundane and uninteresting."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Sep 14, 2015", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "You know I recently finished 2 \"thrillers\" that I rated fairly low mainly because they devolved from their \"thriller roots\" into stories about the personal lives of the protagonists.Here Mr. Baldacci did the same thing...and drew me in so thoroughly that it kept me awake nights following the book and not wanting to put it down.We've gotten to know Robie (along with his co-protagonist Jessica) by now and I guess that may make the difference. I mean if a TV series starts out and establishes itself and it's characters (ala N.C.I.S, C.S.I. etc) before we get our first \"very special episode\" (you know where they kill a main character or the love interest of a main character or whatever) then it usually works. That is opposed to on the second episode bring events from the main character's background up to dominate things (ala Shark [do you remember Shark? If you don't it's probably because they killed it by dragging the personal stuff in too soon]).BUT, whatever the reason here it worked. Will goes on a standard job (and this isn't a spoiler as it's how the book opens) where he does a necessary \"touch\" or \"hit\" on an enemy of the U.S. It's a standard hit escept they didn't tell Will that there was a child present and the child would jump into the arms of the target just as Will fired...After that Will has trouble...well trouble being Will. Add to that the fact his estranged father's being charged with murder back in the \"old home town\" from which he \"escaped\" when he was 18 and you have the set up.This book in spite of the fact it could have gone the other way with angst and long drawn out info dumps as Will (and later Jessica) set out to solve the mystery, it doesn't go that way and I'm going the full 5 stars. I like it, it drew me in, it held my interest...And I recommend it."}, {"userName": "Skip", "userReviewDate": "Dec 15, 2015", "userURL": "http://www.goodreads.com/user/show/1389748-skip", "userReview": "The newest Will Robie novel was a little disappointing, at least for me. In killing a target, the bullet accidentally kills the target's daughter that was not supposed to be there, and he loses his edge. While home on rest leave, the Blue Man tells Will that his estranged father has been arrested for murder. Will returns to his Gulf Coast hometown of Cantrell, Mississippi where he is mostly unwelcome despite his leading his high school football team to a state championship. He then works to solve a murder, in the context of accumulating dead bodies. Will is not really a detective, and there are much better authors for Southern pulp mysteries, like Greg Iles and John Hart. I did like the ending though, which I did not see coming."}, {"userName": "Suzanne", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/4852457-suzanne", "userReview": "This was by far my favorite Will Robie book in the series! I absolutely loved reading about Will’s family, hometown, and past. And the last few chapters were ridiculously crazy! It is great seeing how deep Jessica and his partnership gets from book to book. I actually really find them entertaining together and I’m glad it is continuing in the series. With Blue Man showing up at the end, it really just brings the whole working dynamic they all have together. I am thoroughly looking forward to reading End Game right after I read the Fallen (Amos Decker recent book). My quick and simple overall: By far my favorite in the Will Robie series. The personal aspect to Will’s character just added so much to this story, along with a hell of an intriguing plot and crimes."}, {"userName": "Sean Peters", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/14058345-sean-peters", "userReview": "The Guilty is another tremendous entry in the best-selling thrillermaster’s increasingly impressive resume and the fourth instalment in the David Baldacci's Will Robie and with the added great character Reel.Robie, a black ops CIA sniper, accidentally shoots a child while assassinating a corrupt foreign leader overseas. When he freezes on his next op, unable to pull the trigger, Robie’s handler pulls him out of the field and gives him an opportunity to get his head right. Meanwhile, Robie’s father has been arrested for murder in the small Gulf Coast town of Cantrell, Mississippi, a place Will left immediately after high school and never looked back.Now forced to confront his painful past – much of which stems from his strained relationship with his father – Robie's returns to Cantrell in an effort to resolve the wounds of his past and get his professional mojo back. But the Cantrell he returns to is vastly different than the one he’d left. His father, once a second-rate lawyer, is now the county judge and living in a massive mansion with his new wife and child, a shift that drew the elder Robie more than his share of enemies in the town. The man he is accused of killing, a shifty lowlife character named Sherman Clancy, saw his once-dismal financial fortunes skyrocket and then plummet back to earth for mysterious reasons in the years between Will’s departure and Clancy’s murder. A new preacher has also arrived in town, with his three rebellious and savvy daughters seemingly neck-deep in the mystery that entangles Robie’s father.While most of the characters are well-balanced, the relationship that truly stand out among the most noteworthy is the rapport between Robie and Reel, with the professional and personal trust and respect that the two share for one another – having risked it all for each other several times before – feeling believable and compelling, not to mention being the source of a fair amount of witty banter/humour. The tense dynamic between Robie and his father is palpable as well, and their shifting relationship – and how they both deal with the wounds of the past – To me the highlights being the relationship between Robie and his father very touching moments.The mystery itself is a massive adventure and journey full of dead ends and surprising turns, with new reveals doled out at regular intervals as the story builds to its shocking conclusion, a spectacular double-twist climax that will leave even the most jaded thriller readers impressed. A thoroughly satisfying thriller but for Baldacci also a strong mystery that I have not quite read from this author, this adds to Robie and how his characters unfolds in this book.A clear four star for me... A match against his John Puller books, just love both characters."}, {"userName": "Monnie", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/6277675-monnie", "userReview": "Will Robie is a paid assassin, working for the U.S. government in extreme secrecy throughout the darkest and most dangerous places in the world. He is highly successful, disciplined and never misses his target. That is, until one fateful day when he chokes.His secretive boss, Blue Man, puts him on leave; and because there's some evidence that his sudden change is rooted to unreserved issues from his childhood, he heads back to his old home in rural Cantrell, Mississippi to confront the people and places he left 20 years earlier.After he left home - and his lawyer father, Dan Robie - Will never went back and never had further contact with his father, who abused his son both physically and mentally. He soon learns that his father - who's since been elected the town judge - is in jail after being charged with murder. Is he guilty? Will doesn't want to believe it, but his contrarian father isn't talking and refuses any help from his son. Even though he's not even remotely close to his father, Will refuses to turn his back and leave (especially since his father now has a wife about Will's age and a young son - Will's much younger brother). As he begins to investigate, as he meets characters ranging fron seedy and dangerous, and a very different side of his old stomping grounds begins to emerge. Murders just keep piling up, and trying to track down the killers puts Will's own life - and that of his good friend and fellow assassin, Jessica Reel, who's sent to help him - in great danger.Reading about the usually unemotional Will as he tries to sort out his feelings in what is for him a very different setting makes for an interesting story. Beyond that, though, the rest of the plot stretches the imagination almost to the breaking point (and almost to the point of my assigning the book 3 stars rather than 4). The ending, too, was somewhat disappointing; some loose ends were left hanging - as might be expected - while others were tied up much too easily given the complexity of the situations. I enjoyed this book, but honestly, I'm hoping Will gets his mojo back in time for the next installment."}, {"userName": "Marla", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/4021000-marla", "userReview": "I like the Will Robie series. This is another great installment to the series. You could probably read it as a stand alone but I think you need to start with book 1. This time Will's Dad is accused of murder and for the first time in 22 years Will is headed home to see if he can find out what is going on. He hasn't talked to his Dad since leaving after graduating from High School. Lots of things go wrong in the small Mississippi town and there is more going on than what you think. Lots of fast action and twists and turns. It's why David Baldacci is one of my favorite mystery writers."}, {"userName": "Jean", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/23100707-jean", "userReview": "When I got this book, I thought it was a murder mystery novel. When I started reading it I was reading about a CIA sniper. My curiosity kept me reading and it did turn into a murder mystery.The book is well written. The plot and subplots twisted about. The story is primarily dialogue driven. The characters are interesting and continue to develop during the story. I must say the ending was a complete surprise to me. If you enjoy a good mystery this book is for you.I read this as a hard-back book. It is 420 pages. Published Grand Central Publishing in 2015."}, {"userName": "Katie", "userReviewDate": "Aug 11, 2015", "userURL": "http://www.goodreads.com/user/show/18171481-katie", "userReview": "David Baldacci has again delivered a great read. I was so fortunate to receive an advance reader's copy through Goodreads giveaway.I have read and enjoyed the other novels in the Will Robie series but felt this one gave the clearest insight into Robie's character. In many respects, it seems that finding a killer to be an honorable individual you could admire is counter intuitive. But Will Robie is indeed a admirable man.There is action and twists galore. Baldacci always entertains and his books are not the same one rehashed. He is one of my favorite authors and I do not hesitate to recommend this novel to anyone who enjoys the thriller genre."}, {"userName": "Tiffany Reisz", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/4612196-tiffany-reisz", "userReview": "3.5 Loved spending lots of time in Will's pov but the book, which started out as a typical suspense novel, sort of devolved into a deranged Gothic monstrosity that had way too many characters and was overly complicated. I mean, I like deranged Gothic monstrosities but they have to be well-done, you know.And Will STILL didn't get laid. God help that poor man. Blue balls the size of grapefruits."}, {"userName": "Mike French", "userReviewDate": "Nov 06, 2015", "userURL": "http://www.goodreads.com/user/show/6761276-mike-french", "userReview": "Another 5 star novel in the Will Robbie series. Best to start at #1 if you have read any yet!"}, {"userName": "Matt", "userReviewDate": "May 10, 2015", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "In the latest novel in the Will Robie series, Baldacci takes an interesting approach with the cold-hearted assassin. After a mission goes awry, Robie begins to realise that he may have lost his edge. News that his father has been arrested and is awaiting trial for murder gives Robie the out he needs, sending him back to Cantrell, Mississippi. Robie has been away from his hometown for more than two decades, where some things have changed, but much remains just as stagnant as when he left. When Dan Robie refuses to see his son, Robie begins poking around to piece the accusations together. The elder Robie, a respected judge in the area, is suspected of killing a man who recently was exonerated of the murder of a local girl. Retribution fuels the motive, though Robie is sure there is more to the story. The deeper he digs, the more Robie wonders about people from his past, some of whom are still in the area, while others have left only vapours of their presence. Just as Robie peels back layers of the earlier murder, he discovers that there is an undertow that is pulling the entire community in a specific direction, but that crimes in the area have been covered-up and the whispers remain faint. When his partner, Jessica Reel, arrives to assist, Robie leads them into many dark corners to reveal truths that no one wishes aired, but which could be the only way to save Dan Robie from life in prison. With an explosive storyline and wonderfully gripping banter, Baldacci delivers a wonderful novel whose action builds as the chapters progress.As with most of his work, Baldacci delivers another wonderful story. He pieces the plot together effectively and uses a number of interesting characters to flesh it out. Using dialogue peppered with local idiosyncrasies allows the reader to feel as though they are there in rural Mississippi alongside Will Robie, which adds to the realistic feel. With a handful of twists and curves central to the story, Baldacci keeps the reader wondering while also expecting something exciting with every chapter. Using Robie in a more investigative manner also plays out well, which gives him dimension and opens doors for future novels, should Baldacci wish to explore them. There is also much backstory delivered in this novel, as the reader is able to better understand how Robie got involved in a life as far away from Mississippi as possible, as well as the parallels his life followed when compared to his father. As is always the wonder with an author who has multiple series on the go, will Robie and some of the others join together, or create a successful crossover opportunity? Only time will tell, though nothing is out of the realm of possibility when David Baldacci is at the helm.Kudos, Mr. Baldacci for another successful novel. I am eager to continue my appreciation of your work as I wade through my pile of books.Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/"}, {"userName": "Chrissy", "userReviewDate": "Dec 11, 2015", "userURL": "http://www.goodreads.com/user/show/4990198-chrissy", "userReview": "Pretty awful as it turns out. The story kept me going even while being all over the place so it gets 1 added star for that. Strings of stories that made no sense that he pulls together at the very end into a simply horrific overdone ending. To make a thriller you have to highlight some of the world's proclivities but he felt compelled to use multiple awful things and I think it was unnecessary (such as the serial killer angle--this served NO purpose whatsoever). And he doesn't introduce them for 300 pages so what was the point? It was also terribly obvious who the bad guy was. I think Baldacci has officially jumped the shark for me like Patricia Cornwell did years ago; I wasn't sure about it after Memory Man which was positively awful but this comes close. Makes me sad--I really enjoyed so many of his other books. Finally, I was kind of bummed that the person that voices the males/Robie has changed for this one. I hate when that happens!"}, {"userName": "❆ Crystal ❆", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/19080180-crystal", "userReview": "Wow... this just didn't seem like a David Baldacci novel. Nor did it seem like a Will Robie series. It really just missed the mark. Bummer. I hope he'll write more in the series and back to the magic of Will Robie the expert."}, {"userName": "Mahoghani 23", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/22091363-mahoghani-23", "userReview": "Will Robie has to clear the issues in his head before he can continue his mission for the government. Then Blueman informs him that Will's father has been arrested for murder and Will returns to Cantrell, MS to clear his thoughts and see what's going on with his father and try to rectify his relationship with his dad.The case against Dan Robie is flimsy but there are extenuating circumstances that places him at the scene of the crime. When Will gets in trouble, his partner, Jessica Reel joins him and Cantrell is never the same. For this to be a small town of 2,000 or more and everybody knows everyone's business, there has been so much killing that the real killer comes as a surprise to all. A very poignant, action-packed page turner. A typical thrilling encounter that will keep you guessing as to whose the killer may be."}, {"userName": "Donna", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "This author is in my top 5 of favorite authors in this genre. I have enjoyed most of his books, especially this series. I love Will Robie and Jessica Reel. They are personable good guys which I'm a total sucker for. I liked the humor in this one. It had me laughing out loud, which is frowned upon when I'm at work, but I couldn't help it. I also liked the dialogue in this one. The author does that well, as well as so many other things, like a great plot. This had some great twists. I thought I had it all worked out, but there was an extra layer I had not anticipated, which was great. This was a fun read."}, {"userName": "Sandra", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/25936805-sandra", "userReview": "Actually more like a 3.5*, but Baldacci is Baldacci. So rounding up. Cause that man sure can write...Will Robie goes back to his hometown, confronting his past and his father who has been accused of murder.It was the twist ending, which I didn't see coming, but sort of had suspicions from the beginning, that made me squirm a little bit. A little bit of stretching my believe that the murderer had gone through so much trouble to make a point.Oh well, on to the next book in the series."}, {"userName": "Una Tiers", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/7810515-una-tiers", "userReview": "The ease of the dialogue was enticing until I noticed all the characters spoke in the same fashion, with exception of the stereotypes. Many of the conversations are without plot or character meaning. Trying to twist and turn the plot, the author made the last quarter hard to read."}, {"userName": "N.N. Light", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/23234551-n-n-light", "userReview": "Another gem by David Baldacci! This one really stuck with me, even after I finished reading. Highly recommend! My Rating: 5 stars"}, {"userName": "Linda Tucker", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/17475644-linda-tucker", "userReview": "I can't believe this book was written by David Baldacci. I have long been an admirer of his work and have enjoyed his books. This one was way below his usual level of writing....this one seemed like a book written because he needed quick money. By the time I was halfway through the book, I wanted to kill all the characters myself! Just put them out of their misery......"}, {"userName": "Chris Ferris", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/51992338-chris-ferris", "userReview": "About on par with a Scooby Doo mystery. I figured out the killer by page 50 and am ashamed to admit I finished the book. The plot was beyond ridiculous. The first three in the series were at least fast paced, entertaining reads. This was garbage start to finish."}, {"userName": "Hapzydeco", "userReviewDate": "Nov 29, 2015", "userURL": "http://www.goodreads.com/user/show/2842947-hapzydeco", "userReview": "Starts off well; ends on a low note. Too many abusive subplots. Look forward to the return of the real Will Robie."}, {"userName": "Judy Collins", "userReviewDate": "Dec 04, 2015", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "Top 50 Books of 2015 Best Audiobook (tie), Best of the Will Robie Series , Best Double-Twist Climax.Award-winning David Baldacci returns following Memory Man, with his second winner of 2015. The GUILTY, my favorite in the Will Robie series since  The Innocent  (Will Robie, #1).  An enthralling suspense thriller, Will Robie #4,  Audio narrated by Kyf Brewer (Loved the change--outstanding performance, and oh so sexy) --With talented as always, Orlagh Cassidy (pitch perfect Southern dialect and wide range of voices);  a multi-layered conspiracy tale, ultimately one of redemption. Fans of John Grisham and Greg Iles  will enjoy visiting the southern state of Mississippi, with small-town politics, conspiracies, racism, murder, and an unjust legal system. (I kept thinking the two Mississippi authors, would join in) and possibly, William Faulkner’s ghost. \"You can’t go forward unless you deal with your past.\"Robie returns  to his childhood home in Mississippi, where he finds the past waiting to catch up with him. Slowly, Baldacii, peels back the layers, as we learn why Robie left Mississippi years ago; to become the person he is today--some great history. If you are a Will Robie fan, you know he is the best at what he does. A stone-cold hitman- highly skilled assassin, Robie is the man the U.S. government calls on to eliminate the worst of the worst. A sniper; he is sharp, and extremely disciplined. He has learned to keep his emotions at bay. Presently, he is second guessing himself; a tragedy, an innocent child. Is his losing his edge? A critical assignment—he cannot pull the trigger. He freezes.We soon learn Robie has another side.Robie is called back to his southern roots, to Cantrell, Mississippi—a place he has not visited since high school. A past with a high school sweetheart, his life, and his dad, in his rear view mirror. He soon learns his poor dad (back when), Dan which was not so nice when he was a boy, has turned into a wealthy judge. What happened to this man who basically used his legal skills for barter arrangements….when did he turn into a success? A mansion, wealth, a young wife, and a baby step-brother. Man, his father has been busy. Only a few of the many surprises. His father, Dan Robie,  has been arrested and charged with murder. Dan was a local attorney and highly respected in the community-after landing a big case and winning. Now a town judge; however, someone has framed him. The town says he is guilty. Dan says he is innocent. However, he does not even have an attorney. Why is he not trying to save himself? He has been accused of killing Sherman Clancy. In addition, a backstory of an old high school fling, and other interesting tidbits. To recover what he has lost, Robie must confront his painful past---a past he has tried to forget over the last twenty years. Needless to say, things are tense between father and son. Dan has his own demons, as does Robie. As Robie digs deeper in the events leading up the arrest, he thinks his dad may be innocent, and is drawn further into the investigation. He now is an outsider. What he does not count on is a scheme much bigger and dangerous, than he ever expected in the small southern town.While trying to save this father, Robie has to face his own past. Father and son may have more in common than they think.Engrossing!  A cleverly written dark web of deceit and secrets. Fans will devour the Reel and Robie team! What a ride.. I enjoyed seeing a more vulnerable human emotional side of Robie, adding to the overall experience with a nice balance. Baldacci’s novels always have an emotional component which keeps me coming back as one of my top thriller authors. Baldacci keeps  the intensity and suspense high—An evil game of revenge, where every character has a tragic past. Action-packed mystery psycho-crime thriller, with twists and turns and surprises which will keep your head spinning--and an evil killer, using both father and son.The last scene  was intense—readers will be holding their breath. The best witty one-liner – when the southern cop asked Robie. \"If he knew how to kill or defend himself?\" These southern cops have no clue who they are dealing with. Robie keeps his current role a mystery. For the first time an author has two books on my Top 40 Best Books of 2015. Memory Man  (Amos Decker), and The Guilty  (Will Robie). Not only were they top books, they also were tied for the best audiobook! (always, a Pre-order). The two books have a common thread . . . Redemption.Great News  for Robie fans: Q & A from David: \"Are you planning another Will Robie adventure?\"\"The Guilty deals with some elements of Will’s past but it doesn’t deal with all of them. Now that you’ve confronted your past, it raises fresh elements going forward. Future books about Will Robie and Jessica Reel are going to revisit elements that rise out of the dust like a phoenix.\"  Can't Wait!Speaking of Faulkner: “You cannot swim for new horizons until you have courage to lose sight of the shore.” ― William Faulkner JDCMustReadBooks"}, {"userName": "Jodi", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/54163151-jodi", "userReview": "Horrendous- boring. Love Reel/Robbie books but don't know how the same person who wrote the Hit and the Target wrote this. Extremely disappointing."}, {"userName": "kartik narayanan", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/4070035-kartik-narayanan", "userReview": "This series just keeps getting better and better. 'The Guilty' takes both the plot as well as Will Robie into uncharted territory. The pacing is excellent, the atmosphere great and as always every character is memorable. The ending was predictable though but that does not take away anything from the overall experience though. The closest parallel I can find for this book is True Detective season 1. Yup, you heard that right.Great book and I had a blast reading it.If you liked this review, you can find more on my goodreads profile as well as my blog Digital Amrit"}, {"userName": "Tim", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/17042835-tim", "userReview": "A tough story that deals with difficult life subjects. While interesting, I found the brutality and wasted deaths unfulfilling. As for believable, I won't even go there. 5 of 10 stars"}, {"userName": "Kimba Tichenor", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/18772957-kimba-tichenor", "userReview": "I found the first two books of this series quite strong. In particular, I liked that those who opposed the American government did so for often complex and understandable reasons. In short, the villains had depth and the line between the \"good guys\" and \"the bad guys\" was not clearly drawn. However, like the third book in the series, this fourth book is not as strong as the first two. In the first two, the focus was on international politics and clandestine operations. On these themes, Baldacci proved adept at creating a complex web of events and characters. But books 3 and 4 of the series turn to the personal lives of the two main characters -- Jessica Reel and Will Robie. And while Baldacci handled international intrigue adroitly, he seems much less comfortable with constructing family relationships and the resulting dramas. As a result, he overplays his hand, adding to0 many twists and turns, not to mention dead bodies. The villains become one-dimensional and the body count becomes so high that the believability factor is largely lost."}], "description": "Will Robie is the government's most professional, disciplined, and lethal assassin. He infiltrates the most hostile countries in the world, defeats our enemies' advanced security measures, and eliminates threats before they ever reach our shores. But now, his skills have left him. Sent overseas on a critical assignment, he fails, unable to pull the trigger. Absent his talents, Robie is a man without a mission, and without a purpose.To recover what he has lost, Robie must confront what he has tried to forget for over twenty years: his own past.THE GUILTYWill Robie escaped his small Gulf Coast hometown of Cantrell, Mississippi, after high school, severing all personal ties, and never looked back. Not once. Not until the unimaginable occurs. His father, Dan Robie, has been arrested and charged with murder.Father and son haven't spoken or seen each other since the day Robie left town. In that time, Dan Robie--a local attorney and pillar of the community--has been elected town judge. Despite this, most of Cantrell is aligned against Dan. His guilt is assumed.To make matters worse, Dan has refused to do anything to defend himself. When Robie tries to help, his father responds only with anger and defiance. Could Dan really be guilty? With the equally formidable Jessica Reel at his side, Robie ignores his father's wishes and begins his own desperate investigation into the case. But Robie is now a stranger to his hometown, an outsider, a man who has forsaken his past and his family. His attempts to save his father are met with distrust and skepticism . . . and violence.Unlike the missions Robie undertook in the service of his country, where his target was clearly defined, digging into his father's case only reveals more questions. Robie is drawn into the hidden underside of Cantrell, where he must face the unexpected and possibly deadly consequences of the long-ago choices made by father and son. And this time, there may be no escape for either of them.", "title": "The Guilty\n      \n          (Will Robie #4)", "url": "http://www.goodreads.com/book/show/25066991-the-guilty", "average": 4.13, "cover": "https://images.gr-assets.com/books/1435632658l/25066991.jpg", "reviews": 2104, "authors": [{"url": "https://www.goodreads.com/author/show/9291.David_Baldacci", "name": "David Baldacci"}], "type": ["Thriller", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/25066991-the-guilty", "http://www.goodreads.com/book/show/25089523-the-guilty", "http://www.goodreads.com/book/show/25067011-the-guilty", "http://www.goodreads.com/book/show/26522863-the-guilty", "http://www.goodreads.com/book/show/15159.Absolute_Power", "http://www.goodreads.com/book/show/15158.The_Camel_Club", "http://www.goodreads.com/book/show/12849385-the-innocent", "http://www.goodreads.com/book/show/23153154-memory-man", "http://www.goodreads.com/book/show/11007587-zero-day"]}