{"ratings": 58, "userreviews": [{"userName": "Mattilda", "userReviewDate": "Mar 24, 2009", "userURL": "http://www.goodreads.com/user/show/1150397-mattilda", "userReview": "A satire of the novel form that ends up being a scathing critique of colonialism, Americanism, manifest destiny, and the creative process. A lot of wordplay and hilarity and theft of various texts and brilliant phrases here and there like \"If it is not flamboyance, it becomes deformity: if it is not hard to becomes crime.\" It's short, but certainly a struggle to read, as it's supposed to be."}, {"userName": "Mark ", "userReviewDate": "Dec 24, 2017", "userURL": "http://www.goodreads.com/user/show/291189-mark", "userReview": "Funny story - I went on vacation and quickly finished the book I had brought with me. I needed to read something, and this slim volume had been tucked away in my bag waiting for just such an emergency. Despite its quarter-page size and only 125 pages it took me awhile to get through. It's basically a long poem formatted into sentences, paragraphs, and chapters. Although collectively the narrative makes absolutely no sense, there are moments of sheer brilliance. There are few connections between the different beautiful images and ideas. In the end, it completely goes off the rails - it gets easier to understand but the subject matters seem utterly random. There is some \"American\" stuff in here too: cars and contemporary cultural references and brief contemplation of the concept of America. As the title suggests, it is a tongue-in-cheek response to the question of the great American novel; as such it is occasionally sardonic, perhaps with too much condescension. There is occasional mild racism as well. It had its moments for sure, but I was proud of myself for even finishing it and eager to move on."}, {"userName": "Ben Loory", "userReviewDate": "Nov 05, 2008", "userURL": "http://www.goodreads.com/user/show/171197-ben-loory", "userReview": "If there is progress then there is a novel. Without progress there is nothing. Everything exists from the beginning. I existed in the beginning. I was a slobbering infant. Today I saw nameless grasses-- I tapped the earth with my knuckle. It sounded hollow. It was dry as rubber. Eons of drought. No rain for fifteen days. No rain. It has never rained. It will never rain. Heat and no wind all day long better say hot September. The year has progressed. Up one street down another. It is still September. Down one street, up another. Still September. Yesterday was the twenty-second. Today is the twenty-first. Impossible. Not if it was last year. But then it wouldn’t be yesterday. A year is not as yesterday in his eyes. Besides last year it rained in the early part of the month. That makes a difference. It rained on the white goldenrod. Today being misplaced as against last year makes it seem better to have white-- Such is progress. Yet if there is to be a novel one must begin somewhere."}, {"userName": "Luke", "userReviewDate": "Aug 26, 2010", "userURL": "http://www.goodreads.com/user/show/1280213-luke", "userReview": "This was the coolest/strangest/shortest book I've read in a while"}, {"userName": "Eldonfoil TH*E Whatever Champion", "userReviewDate": "Jun 11, 2014", "userURL": "http://www.goodreads.com/user/show/2422096-eldonfoil-th-e-whatever-champion", "userReview": "When and where, you never know.And tomorrow night is Grim Reaper, for the back to back."}], "description": "First published in 1923 in Paris in an edition of three hundred copies, this satiric novel by the great American poet is \"a satire on the novel form in which a little -(female) Ford car falls more or less in love with a Mack truck.\" For the most part, however, this work is a serious attempt to write a novel with the recognition that such a work is impossible to write within established conventions. Although long available from New Directions, this edition, by presenting it alone, puts the work into new focus, and reveals its importance in Williams’ career.", "title": "The Great American Novel", "url": "http://www.goodreads.com/book/show/146485.The_Great_American_Novel", "average": 3.53, "cover": "https://images.gr-assets.com/books/1316942910l/146485.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/15435.William_Carlos_Williams", "name": "William Carlos Williams"}], "type": ["Fiction"], "outlinks": ["http://www.goodreads.com/book/show/146485.The_Great_American_Novel", "http://www.goodreads.com/book/show/65336.Selected_Poems", "http://www.goodreads.com/book/show/72155.The_Collected_Poems_Vol_1", "http://www.goodreads.com/book/show/90661.The_Collected_Poems_Vol_2", "http://www.goodreads.com/book/show/763426.Paterson", "http://www.goodreads.com/book/show/90664.Pictures_from_Brueghel_and_Other_Poems"]}