{"ratings": 98278, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Sep 05, 2015", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”It’s always the wrong people who have the guilty conscience. Those who are really responsible for suffering in the world couldn’t care less. It’s the ones fighting for good who are consumed by remorse.”David Lagercrantz, a novelist and journalist, was asked to assume responsibility for the continuation of a trilogy of novels that frankly took the publishing industry by storm. The books left readers stunned with the marvelous insanity of the writing. More importantly Stieg Larsson created a character who is forever immortalized as one of the greatest anti-heroes to ever step out of the pages of a book. Lisbeth SalanderIt doesn’t surprise me that Lagercrantz is a little afraid of her. Who isn’t? His fear might be reflected in the fact that she is a shadowy figure in the book until about halfway through when she answers a call from Mikael Blomkvist. ”Shut up and listen,” she said.Ahhh, yes, that’s my girl. She doesn’t look like much, just an androgynous girl? with piercings, tattoos, and strange hair. She is undersized, but bristles with attitude. The outward appearance is not just for show...it is bone deep. She is blessed/cursed with a photographic memory. She doesn’t have the patience or sympathy for stupidity. She has no time for social niceties. If you were her “friend,” you would see her only when she wanted to be seen. If you are involved with her sexually, you will find that you are not really “involved” with her at all. But the sex...well...is by all accounts...fantastic.If you are someone who gets aroused by beating up women or children, you better pray to all that is holy that Salander doesn’t find out who you are because you will find yourself with her boot on your throat wondering how this diminutive creature incapacitated you so quickly. You’ll want to hurt her, but she is capable of not only hurting you physically, but also taking your whole identity away from you. Because...she is also a hacker. A vengeful hacker, but also a prideful hacker. When she gets the chance to hack the National Security Agency in Washington, D.C., she goes through their system like buttered bread. All hell breaks loose. Lagercrantz might have underestimated just how much America would overreact to such a breach of security. In reality, Sweden might have found themselves invaded by Marines, tanks, and Apache helicopters as the Americans turned over every stone looking for someone with the hacker handle WASP. For the first part of the book, Lagercrantz puts Mikael Blomkvist center stage. It would make sense that he identifies with him since they share a similar profession. Not that I mind spending time with Mikael Blomkvist, if he were a real person, would give me hope for journalism. He is a person obsessed with the truth. Other journalists either revere him or hate him. He is a target for those that loath him. ”Your uncompromising attitude makes people feel pathetic. Your very existence reminds them just how much they’ve sold out, and the more you’re acclaimed, the punier they themselves appear. When it’s like that the only way they can fight back is by dragging you down.”Millennium, the magazine he founded, is in trouble. They had to sell out a portion of their ownership to keep the publication afloat, but now those same corporate people who bought them to add some integrity to their own list of titles suddenly want to compromise the integrity of Millennium by adding more human interest material. For me, now that I’m one of the owners of the publication I work for, the trials and tribulations of a magazine to keep up subscription levels hit home. Any softening of the economy turns subscription renewals into luxuries, not to mention all the competition from free publications online that also erode print subscriptions. So Blomkvist is in a funk; more is going wrong than is going right. He is spending most of his time, even the time he is supposed to be sleeping, reading Elizabeth George novels one after another. I can relate to that for there is nothing like escaping into the pages of a good book when life becomes TOO BORING, TOO DEPRESSING, TOO REAL.A call from Frans Balder finally gets Mikael reinvigorated. Balder is a leading expert on Artificial General Intelligence or ”Something with the intelligence of a human being, but the speed and precision of a computer.” The plot explodes. It doesn’t take long for Salander and Blomkvist to realize they are working the same problem from different ends of the stick. With her behind the scenes, beyond the law approach to finding out the truth and his unflinching, uncompromising need to expose hypocrisy, the duo form a team that scares everyone from criminal elements, to large corporations, to governments. Sometimes it is difficult to tell the difference between those elements. There is techno jargon, but Lagercrantz does a great job of explaining everything. He also does a fantastic job talking about autism and savant tendencies in socially compromised children. I thought it was cool that an autistic child becomes an important plotting device. Lagercrantz did not have access to the notes left by Stieg Larsson for continuing the story. This probably was more of a blessing than a curse. Larsson’s, long time girlfriend ( that term seems so out dating and doesn’t quite explain the situation), has been in a legal battle to obtain ownership or rights to Larsson’s unpublished works. It seems the Swedes, so advanced in so many ways, might be lagging behind in the common law aspect of inheritance. I believe that Lagercrantz by using the first three novels as his only source documentation kept himself from being hampered by Larsson in making this novel his own creation. I read this book in two days. I thought the plot was great. I thought the writing was very good, even if it did lack some of the flair that was such a Larsson trademark. It is hard to wear a dead man’s suit, but I have to say Lagercrantz, even if the jacket was too big in the shoulders or too short in the arms, still managed to make me believe that even as he left the funeral he was leading me back to a new beginning and creating a new life for characters that were relegated to retirement much too early. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Esra", "userReviewDate": "Mar 31, 2015", "userURL": "http://www.goodreads.com/user/show/3552721-esra", "userReview": "Look! I respect for the exertion, but ... man!\nThis is not the lisbeth as we know. It's the lighter version of her. very light. She is just a babysitter for august, some brat hacker who hacks american government. \nBut I enjoyed to read it anyway. I'll always read lisbeth's stories no matter what. I love her , I2ll always support the effort :DLagercrantz sanki kendi lisbeth'ini yeniden yaratmış gibiydi. Bizim tanıdığımız lisbeth'den geriye pek birşey kalmamıştı. arada bir insanlara fırlattığı o korkutucu bakışlar ve hackerlıkta olan ustalığı dışında. Kitap sanki sıradan bir suç romanı gibiydi ama ondan bile eksikti. Serinin doğasında olan seks, şiddet azaltılmış ve yokedilmişti. Hatta kitapta lisbeth sanki yan rol gibiydi. Asıl konu balder ve buluşu, oğlunun zekası ile yapabildikleri, lisbeth'in kötü kız kardeşinin ortaya çıkışı ve yine görüşürüz kaltak diye çıkıp gidişi. millennium'un yeniden dirilişi falandı. Lisbeth arada gelip giden günü kurtaran karakterdi. Yinede emeğe saygı , okuması akıcı can sıkmayan , su gbi hafif bir polisiye olmuş ama lisbeth mirasına yakıştıramadım açıkçası. Ben yinede yıldızı rahmetlinin hatrına ve salander'ime kıyamadığımdan veriyorum.http://readerchronicles.blogspot.com...."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Re/Read on Audio! MY BLOG: Melissa Martin's Reading ListI thought this book was wonderful! I have missed Lisbeth and Blomkvist for so long. I think the new author did a great job carrying on Stieg Larsson's series. Lisbeth is one of the coolest women out there. I love her character, I love how smart she is, oh if I could be as smart as her. I do hate her past, but I am glad that she is a character that was written to rise above all of the horrible things that happened to her. In this new book there is another scandal of sorts going on within a huge community of people. A lot of things going on in the hacker community, people stealing other people's work, killings, blackmail, a little boy with Autism, evilness and goodness. And of course Lisbeth is right in the middle of it all and she does her job as hard core as she always does. In the beginning of the book the author does have Blomkvist thinking back on things that happened in the other three books, nothing real extensive but I thought it was a nice little add to the book. I was very much intrigued and on the edge of my seat between the interactions with the little boy (August) and Lisbeth. She was so good with him and she did things that needed to be done and in her own wonderful way. I wanted to get up and cheer her on! I can't really say anything because there is no way I'm giving out any kind of spoiler for this book! The ending was good and set up to possibly have more books, I hope there will be. I personally loved the book, as I have mentioned. I know there are people that hate it or love it because it is Stieg's original characters. But for myself.. I think the family did a good job in choosing this man to start a continuation of what is a wonderful character."}, {"userName": "Brandon", "userReviewDate": "Sep 06, 2015", "userURL": "http://www.goodreads.com/user/show/3214163-brandon", "userReview": "The whole story behind the creation and release of The Girl in the Spider’s Web is actually somewhat disgusting. Series’ creator Stieg Larsson unexpectedly died from a heart attack in 2004, a year before the first novel in the Millennium trilogy was to be published. In the years that followed, the books enjoyed tremendous, widespread success as Larsson’s characters would grow a rabid fan base. Unfortunately for readers, the series would end after the publication of the third and final novel. Or would it?Despite having written a will years prior to his untimely death, it was not witnessed and having not married his long-time partner, his estate wound up in the hands of his estranged father and brother. Despite his partner claiming that Stieg would not want his work continued by another author, Larsson’s family hired David Lagercrantz, a Swedish journalist and crime writer in his own right, to pick up where Larsson left off.On one hand, it’s gross. This new novel appears as nothing more than an attempt to capitalize on the success of Steig’s work by his alienated family. However on the other hand, the duo of Blomkvist and Salander probably do have a lot left in the tank as well as an audience eager to gobble down new stories. The only question being, is Lagercrantz the right choice to take on these iconic characters or is The Girl in the Spider’s Web nothing more than glorified fan fiction?While I certainly wouldn’t label it fan fiction, I also wouldn’t put it on the same level as Larsson’s work (although, I did enjoy it more than Hornet’s Nest). Lagercrantz can appear to write a solid crime novel, but he’s missing that meandering style of writing that made the original trilogy special. I mean, come on – Blomkvist only made three sandwiches! I expected more from him.My biggest issue is in the lack of Lisbeth. It isn’t until after the first 100 pages that she’s really woven into the storyline and even then, she’s mostly used sporadically. While she’s integral to the central plot, she’s mostly spoken of by peripheral characters rather than having her own voice. The same issue arose when I was reading The Girl Who Played With Fire, where Lisbeth is “off-screen” for a good chunk of the story, but there ain’t no way I’m going to compare the explosiveness of her actions in that novel to this one, they’re not even in the same league.The incredible success of this novel in terms of sales (two hundred thousand copies moved in the first week alone) and positive critical reception should surely lead to a follow-up, although nothing is currently planned, however money is a powerful motivator."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Sep 01, 2015", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "Despite concerns over whether Stieg Larsson's wishes were being honored by the publication of this book (based on reading \"There Are Things I Want You to Know\" about Stieg Larsson and Me), I decided to go ahead and try it. I loved the character of Lisbeth Salander and thought if it was done well, it might be worth it. You don't encounter many characters like her.Unfortunately, I was supremely disappointed, so much so that I can't face going back to the book after making it halfway through the audio. First of all, these are not the same characters of Lisbeth and Mikael that I know from the trilogy. Lisbeth seems to have reverted to one of two modes - sloppy hacker or hungover boxer - no depth, no motivation, nothing interesting. It could be that we reached the end of her story in the trilogy. Mikael is unmotivated too, can't stand to be at work and arriving late to the scene of an important crime that finally happens midway through the book. The author spends TOO much time describing things that don't matter - an hour (I listened to the audio) on the current status of Millennium, the news publication that Mikael has worked on; the storms, frequent descriptions; and Mikael's white fur coat. He hasn't bothered to explore the characters themselves. He touches on the subjects of autism and the singularity in halfhearted ways that the characters and the reader end up feeling less than inspired. (And really? Artificial intelligence? It isn't written about intelligently enough to feel like high stakes. This is set in the present day. If I wanted a thrilling read about AI and the singularity I would look for it in science fiction, where it is handled with interesting variations and frightening possibilities, NOT in a Swedish crime novel. It makes no sense.)I would be happy if someone came along who convinced me that this book turned a huge corner and I should have kept reading... but I doubt that will happen."}, {"userName": "Elyse", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "The Millennium Series Book 5 came out this month....so I finally finished Book 4....which has been on my shelf since 2015. I started and stopped a couple of times....It’s not a book that immediately grabs your attention... but once it gets going — it’s a full speed fast spinning ride. Hacker girl, Lisbeth, inscrutable, who is scheming follows her own timetable. She is chasing a web of spies, cyber criminals, and governments around the world. Blomkvist happens to be doing the same thing - and ( of course ) needs Lisbeth’s help.I’m not sure what the mixed reviews are about ( the fuss?) with book 5...but in book 4..........”The Girl in the Spider’s Web”.....Lisbeth Salander and Mikael Blomkvist still have that robustness toughness team vitality— often at arms length ( agony for me - as I love it when they are in the same room)—but by the end of this novel, I easily accepted that Steig Larson’s characters are in good hands with author David Lagercrantz. A little dialogue sample of what I love when Lisbeth and Blomkvist are together: “Are you angry with me?” he said “Quite” “Why is that?” “Salander took a step forward, her face shining and pale, and he remembered her gunshot wound”.  “Because I come to visit, and there’s no one at home,” she said. He walked towards her”.  “That’s a bit of a scandal, isn’t it?”, he said “I’d say so.” “What if I ask you in now?” “Then I suppose I’ll have to accept”.  “In that case, welcome”, he said, and for the first time in ages a broad smile spread across his face”. “A star fell outside in the night sky”.It was a joy to be back in Lisbeth-land!!!"}, {"userName": "Beatriz", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/46560610-beatriz", "userReview": "Reto #9 PopSugar 2017: Un thriller de espionaje\nComencé el libro con muchos reparos porque no sabía si este nuevo autor lograría mantener la impronta de los personajes y, debo reconocer que lo ha hecho muy, pero que muy bien. Sin ningún problema pude evocar esos momentos, hace muchos años, cuando la historia de Lisbeth, su padre y todo el aparataje de espionaje y corrupción me tenía agarrada de un puño.Sentí el estilo de Lagercrantz bastante más fluido, a pesar que el contexto en que se desarrolla la acción podía preverse muy árido: espionaje industrial, informática, matemáticas avanzadas, mecánica cuántica, inteligencia artificial… pero aun así, todo en su justa medida, logrando una trama buenísima y muy ágil. Me gustó mucho la forma en que evoluciona la historia para, acercándonos al final, todo cerrara perfectamente y sin cabos sueltos, aunque deja más que dado el puntapié para seguir con el hilo argumental de esta entrega en el próximo libro.Porque ahí reside otra sorpresa: siempre pensé que en el tercer libro había quedado resuelto el pasado de Lisbeth y que en la trama de éste sólo intervendrían nuestros conocidos personajes para dejar al descubierto algún hecho criminal o de corrupción, e incluso así parece hasta bien avanzada la historia, pero poco a poco se descubre que todo está nuevamente relacionado con el pasado de Lisbeth y debo decir que lo encontré un gran acierto.En fin, ahora estoy muy expectante del quinto libro, el que no haré esperar como hice con éste. Lo recomiendo mucho, aunque debo reconocer que Lisbeth y Mikael son mi debilidad y, sólo quizá, de no ser por ellos, me hubiera quedado en las 4 estrellas."}, {"userName": "Hayat", "userReviewDate": "May 11, 2015", "userURL": "http://www.goodreads.com/user/show/6116230-hayat", "userReview": "Update: read in August 2015 but decided to update in January 2016  I read the The Millennium Trilogy in anticipation of The Girl in the Spider's Web and as soon as it was out I began reading it with a lot of excitement and a little apprehension, just in case the new author doesn't live up to or come close to the writing talents of Stieg Larsson.Well, clearly David Lagercrantz is no Stieg Larsson and everything I loved about The Millennium Trilogy was missing here. The plot was slow and tedious, Lisbeth Salander was absent from a good portion of the book and when she turned up her character was different and not as well thought out or intriguing. Lisbeth is my favourite character, the driving force of the series and the reason I love the trilogy so much but in The Girl in the Spider's Web she lost that unique element that made her Lisbeth Salander. Her narrative was different, her actions didn't make sense and there were lots of little things that didn't add up about her reactions. She was a caricature of her former self. I found myself Skimming due to boredom until things picked up near the end but by then I was ready for it to end. I actually got the audiobook too but nothing changed. I'm a huge fan of The Millennium Trilogy and I've read it several times but this book didn't feel like a continuation of Stieg Larsson's trilogy. Everything was out of sync. I guess this shows that you can't rope in another writer to continue a deceased authors work. You can't replicate the original authors style, experience, knowledge and all the complexities that went into developing and writing The Millennium Trilogy. I'll probably reread this book sometime in the future just to see if my opinion of it changes but I doubt it will. Still, I'm willing to give it a second chance just to be fair to David Lagercrantz and in appreciation of the effort it took to write The Girl in the Spider's Web.****Before publication in May 2015.****OMG!!! I just found out my favourite series The Millennium Trilogy by Stieg Larssonis is being continued by a new author!!! I'm so happy and so bloody scared it is all going to go wrong! I both hate and love this!!Oh who am I kidding! I need The Girl in the Spider’s Web right now!! September is too faraway."}, {"userName": "Lyn", "userReviewDate": "Nov 28, 2015", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "Stieg Larrson is dead, alas.David Lagercrantz was granted a blessing and a curse. A blessing in the sense that he gets to write another Lisbeth and Mikael novel, a series with a worldwide following that will certainly sell and most definitely get a lot of attention.A curse because he takes the stage after a phenomenal opening act, a lamentable position. Rumor has it that Larrson’s partner was far from pleased about his selection by the literary executor as the writer to take over. Readers who dislike the book, and some will be relentlessly critical, will blame this new author. Those who just don’t like the book have an easy excuse.Lagercrantz’ unenviable task, or golden opportunity, is to craft a new novel that stays true to the vision of Larrson the creator, revisits two of the most compelling characters in modern fiction, spins a crisp, intelligent thriller that will draw in fans and capture the attention of new readers, and does so with a fresh voice, paying homage to Larrson’s talent while putting ink on a work that is his.For the most part, he succeeds admirably.The Girl in the Spider's Web, the 2015 novel that takes up where the The Girl Who Kicked the Hornet's Nest (2007) left off, brings back Sweden’s most famous journalist and the world’s most iconic hacker for another thrilling adventure of exposed crime and wrongs righted. Though it lacks the edgy chill of Larrson’s methodical delivery, Spider’s Web moves forward with verve and style."}, {"userName": "Skip", "userReviewDate": "Aug 04, 2015", "userURL": "http://www.goodreads.com/user/show/1389748-skip", "userReview": "Just as true Deadheads do not appreciate Trey Anastasio playing Jerry Garcia's lead guitar or singing his songs, David Lagercrantz is not Stieg Larsson. He has a different writing style, but Lisbeth Salander remains one of the most innovative and iconic characters in modern fiction: an antisocial goth female hacker, fighting with all her substantial might against injustice, both perceived or actual. The novel gets off to a rather slow start, with a Swedish professor abandoning his quest for self learning artificial intelligence to take custody of his autistic son, August. All is not well at Millenium magazine and Mikael Blomkvist is under attack from many sides. The professor contacts Blomkvist as he is advised of threats to his life, setting off a series of escalating events, forcing Lisbeth to intervene with her usual forceful assistance. She rescues August and somehow manages to connect with him, continuing the breakthrough made by his father. There is substantial action in the second half of the novel, as matters escalate and an old adversary re-emerges from the darkness. More please.----------------9/17/2015 Addendum: I won a Goodreads giveaway for this book -- hooray!! Since it has not arrived yet, it did not affect this review."}, {"userName": "James", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "3 stars to David Lagercrantz's The Girl in the Spider's Web, the fourth book in the \"Millenium\" thriller series, written by a new author given the original, Steig Larsson, passed away several years ago. While the book carries on with great characters and a similar style, it wasn't as satisfying as the originals. But who can resist Blomkvist and Lisbeth -- you can't NOT read it!\nStory\nAs readers come to know of this series of books, the plots are incredibly complex, intense and twisty. From a basic point of view, several hackers have started infiltrating the NSA after learning about a conspiracy between different groups to buy and sell secrets about each other's companies. The government is involved, trying to keep it running and trying to stop it, as well as several public companies involved in building new technology that ultimately will be the destruction of mankind should machines be able to build machines and think as sentient beingsPushing that all to the side, the plot is about a professor who takes back his autistic son from his ex-wife and her new husband (who is abusing the young boy). When some members of the conspiracy group ultimately realize that the professor is the technologist who has the AI programs they are all after, and he's potentially going to rat out the truth of what's been happening to Blomkvist, someone orders a hit and the professor is killed minutes before telling his story. His young son witnesses the execution and the hunt begins. Lisbeth is involved in the hacking group and works through a secret computer program to help Blomkvist save the boy and ends up realizing she's very close to the person at the head of the conspiracy. As they sort through the puzzle, family ties come back to haunt each of them and the struggle to keep the balance of the war just slightly in their own favor pushes forward.\nStrengths\n1. Lisbeth and Blomkvist are as good as ever. They jump off the pages and yearn to be loved and hated at the same time. They annoy you, but you know they are good people. 2. It's definitely a page-turner that captures your attention about 20% in when you realize how many different players are in the game to capture the technology and to double-cross one another. It stays strong and keeps you guessing throughout the whole story. And then the head of the conspiracy is revealed about 50% through, you have a whole new level of connections that keep your mind working over-time.\nSuggestions\nThe summary of the story is strong, but the details get too technical and too convoluted. I work in technology, so it wasn't that I didn't understand what they were talking about... it was that so much of it was theory and advanced mathematical formulas, it got tedious to pay attention to that level of detail. There's only so much I can swallow when it comes to prime numbers and the Fibonacci sequence and how many multipliers are needed to deviate from the quantum... what??????? stick to the drama and leave the minutia out when you're trying to keep the sanctity of an author whose first successful novel was a genealogical mystery!\nFinal Thoughts\nI enjoyed the book. I wanted to keep reading it. I'd like to see another one by this author. But... in order to move it up from a 3 to 4, it needs more substance. Hacking is a great topic. NSA double-crossing it a cool idea. The family ties (no spoilers here) was an amazing story line. But something felt like it was missing in how it truly all came together. I'm hoping it was left open so it can be explored in the next book -- not all to different from the original three in the series -- but it needs to be more tightly weaved. That said, kudos to Lagercrantz for successfully taking on the series and trying to continue the original creation. He's done well enough for me to continue reading but still to keep my critical eye."}, {"userName": "Shannelle Lamour :)", "userReviewDate": "Aug 27, 2015", "userURL": "http://www.goodreads.com/user/show/42075915-shannelle-lamour", "userReview": "I'm sorry but no... I was super excited to read this to the point that I may have built it up in my head, and when it failed to deliver it made it that much more dissapointing. Lisbeths character in the first three books was so fluid that she became such a believable person with all her quirks, silence, and way of behaving that were always so consistent. but in this book I caught myself at least fifteen plus times thinking 'Salander would never have said that'. It at times made for a frustrating read as I was constantly comparing the trilogy against this fourth book and always coming to the conclusion that its nothing like the first three. given the new author that's not surprising. its just extremely, dare I say it again, dissapointing. I loved Steig's writing style. His plot progression was great. I had to put this book down repeatedly due to being overwhelmed with information packed in a few sentences that would have by Steig been strategically placed through a few pages. It took me countless tries to finish this book. No offense to David, but maybe I should of left the story finished at book three. It felt like characters personalities were changed to adapt this new author. Some may argue that's to be expected considering Steig and David are two different people and will think different ways, but when trying to carry on a already stellar trilogy, I would have thought that enough research would have gone into it for Lisbeth and Blomkvist to be the same people they were throughout the first three books. Like I said, disappointing."}, {"userName": "Brenda", "userReviewDate": "May 11, 2015", "userURL": "http://www.goodreads.com/user/show/5240149-brenda", "userReview": "I initially was going to give this 4 stars, but decided 3 more accurately represented my feelings. I found the first third of the book tedious and I almost gave up. Like all newspapers, Millenium is in trouble and purchased by a larger company. Mikael Blomkvist is unhappy and unmotivated. There were a lot of new characters introduced, and a refresher list of previous characters was provided in the beginning. The agencies and groups involved tended to get tangled, and it was difficult to remember who worked for who. Eventually, the story got interesting because Lisbeth Salander became more prominent. A weird web of intrigue involving police, the NSA, Swedish Intelligence, and assorted hackers was revealed along with the motivations of individuals involved. This was an acceptable effort by David Lagercrantz, but I would have liked more Salander right from the beginning."}, {"userName": "Maria Elmvang", "userReviewDate": "May 11, 2015", "userURL": "http://www.goodreads.com/user/show/168347-maria-elmvang", "userReview": "Considering that David Lagercrantz was hired by Larsson's estate, and that Eva Gabrielsson (Larsson's partner both in life and in writing) is against this continuation of the series, I'm going to stay away from it. Definitely a money-grab and nothing else.Link to Eva's opinion in English.Link to Eva's opinion in Danish."}, {"userName": "Matthew", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "Not bad, but kind of confusing. It was like a whole bunch of complicated cyber-hacking sounding plot lines were thrown in a blender and the mush that came out was put into print. The author tried too hard to carry on after Larsen.I think the reason I still liked it a bit was that I know the characters from the previous books. If this was my first time with Blomkvist and Salander, I think I would have been very puzzled."}, {"userName": "Erika", "userReviewDate": "Mar 31, 2015", "userURL": "http://www.goodreads.com/user/show/5666413-erika", "userReview": "So, I haven't been able to read as much as I'd like, I've been struggling with motivation, and time, and stuff, so picking up this book and attempting to go through it might not have been the best idea.This book is sloooow. It drags too much, there are many descriptions of unimportant things, and I just couldn't force myself to finish it. __________________When I first heard about this book I was upset because they are only continuing the series for obvious money reasons, and there is no way the new author is going to be able to make the story and the characters fulfill what Stieg Larson had in mind.But now I'm fucking curious because this is the closest I'm going to get to ever continuing the series.Hope it's not disappointing."}, {"userName": "Estefani", "userReviewDate": "Apr 01, 2015", "userURL": "http://www.goodreads.com/user/show/24569331-estefani", "userReview": "2.5 StarsThis should never have happened. Despite some of the things I enjoyed, it didn’t do any good for Millennium and for the other things it stands for.If there was something that set apart these novels from everything else I’ve read, was how real these characters felt. And I’m not saying it lightly. This fourth book was a shallow understanding of what Lisbeth and Mikael once were. For a reader it’s very easy to recognize when your favorite characters just aren’t there. And you might be thinking: But it was a different author! I know that. But I was hopeful.This book represented two problems for me: 1.Trouble continuing with the primordial nature of the initial trilogy. 2. The writing.The excessive use of exclamation marks was ridiculous. I don’t want my mystery crime novel to have overly enthused dialogues.“You’re going to freeze that beautiful bum of yours!”“Ricky!” he said. Are you alright?”“Goodwill! Have they gone mad?”“Don’t say that! Ever!”“I’ll be in touch. Take care!”“Wait, Ed. Did I hear you say she?” “You’d better believe it. Our hacker’s a she!\"This novel took a huge time jump. Stieg started this in early 2000s. When social media didn’t exist as we know it today. That got me wondering how long it’s been since book 3, it was never clarified. A friend pointed it out and said four years had passed between book 3 and 4. I somehow missed it. But back to the social media, it bothered me a bit when Lisbeth used Instagram to track someone down. I don’t know, it just doesn’t seem like something Lisbeth would do.This novel was filled with things these characters would never do. Mikael is in a delicate situation involving the Russian mafia, but somehow thought it was completely normal when a strange woman randomly greeted him in the middle of the night with her not-so-subtle and clearly suspicious advances. Mikael and Lisbeth’s behavior throughout the novel seemed unnatural.Aside from all of this, it wasn’t a bad book, but for Millennium standards it definitely didn’t deliver. The plot was very entertaining actually, I enjoyed the read, but sadly this is something that should have ended in book three. It’s a bit unsettling to think that this isn’t the story that was originally planned for book 4.If you love Millennium and haven’t read “There Are Things I Want You to Know” about Stieg Larsson and Me by Eva Gabrielsson, please do. It’s very insightful, I picked it up right after I finished this one, and we get to know what Stieg stood and fought for and how he used his writing to condemn everything that was wrong in Swedish society.Because of that book we understand how he started Millennium as a support for all his work as a Journalist to denounce injustice.Millennium has a soul, has essence. It cannot be interpreted."}, {"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "Nov 15, 2014", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "I went into reading this book with the thought that it has a snowballs chance in hell to be as good as Stieg Larsson's books. I mean they are something of the best I have ever read when it comes to Swedish books (Actually when I think about it that doesn't say that much since every damn person in Sweden seems to think that they are the new Stieg Larsson or Liza Marklund or whatever). What I want to say is that even though I have been looking forward to reading the book have I also had back in my mind some doubts about the book. It feels a bit like Stieg Larsson father and brother just want more cash and voilà let's find an author to write a fourth novel so we can bath in money. So I'm glad that I just borrowed the book from the library and not bought it so now they didn't get that much money from me reading the book.I found it the first 150-200 pages just OK. Honestly, I thought it was much easier to read than the trilogy, less intrigue, and more action. And, I can say that about the book now that I have finished it. It felt much more action-filled than the trilogy and with less graphic violence (which isn't that bad). Now it's been a couple of years since I read the trilogy, but I doubt it took me two days to read a book as it did with this one. And, even though math and hacking aren't my things did this book feel when it came to the case less complicated, but it was still a good book. I was a bit annoyed about the incompetence of the Swedish police and some other character in the book. But I liked finding out more about Lisbeth Salander and stuff I had forgotten came back while I read the book. And, the ending was good. Not a cliffhanger, but more an opportunity for a sequel. I think the turning point in the book for me was when Lisbeth got more involved in the story. That's when I felt that this is a book that is hard to put down.I liked the book, I can't deny it. I had a smile on my face at the ending and I enjoyed the story. It was much more of a fast read than the original books, but frankly, that doesn't bother me much. It was a worthy sequel and I hope to read more books by David Lagercrantz.4.5 stars"}, {"userName": "Aditi", "userReviewDate": "Aug 10, 2015", "userURL": "http://www.goodreads.com/user/show/16069171-aditi", "userReview": "“What she had realized was that love was that moment when your heart was about to burst.”  ---- Stieg LarssonThe journalist and the female hacker are back with a bang!David Lagercrantz, a Swedish author, takes up the authority to continue with the legendary Millennium series of the international bestselling Swedish crime writer, Stieg Larsson. And Lagercrantz has proved that Lisbeth Salander cannot be dead, by projecting her with an immense power and energy in the latest installment of Millennium series, The Girl in the Spider's Web. Synopsis: In this adrenaline-charged thriller, genius-hacker Lisbeth Salander and journalist Mikael Blomkvist face a dangerous new threat and must again join forces.Late one night, Blomkvist receives a phone call from a trusted source claiming to have information vital to the United States. The source has been in contact with a young female super hacker—a hacker resembling someone Blomkvist knows all too well. The implications are staggering.Blomkvist, in desperate need of a scoop for Millennium, turns to Lisbeth for help. She, as usual, has her own agenda. The story is twisted and puzzling like a spider's web, although a spider's web is very neat, yet it has the power to confuse it's prey and will finally lead into the death trap. Lisbeth fell in that trap when she smartly hacked in the NSA's database for her own personal agenda. Whereas Blomkvist is fighting for his magazine Millennium which has been sold out to corporate biggies due to a financial crunch, (blame it on Harriet Vanger!), but right at the moment when Mikael was sulking with a dry spell of no major stories, he receives a strange call from a source about information which includes USA and can be a major story about a genius professor and also about a female hacker, and thus the story begins with a full force that is bound to pull the readers into Lagercrantz's own personal spider's web.Lagercrantz's writing style is brilliant and fantastic and the way he explains each and everything with such intricate details is amazing. The story builds up with a steady pace in the first half and as the mystery gets twisted and turned into the deep dark word of hidden agenda to overpower, it hits the fast addictive pace. The book is not an edgy one, but it is so mystifying which will keep the readers hooked onto the core and heart of the mystery to follow it till the very end. The narrative is equally engaging and underlined with Blomkvist's sarcasm at times.The characters are brought to life with the same touch and with the same intuitive power to leave the readers in awe with their fight for justice as well as truth. The primary characters aside, the supporting characters especially a mother, a chief, and many other such characters impacted the story like anything.The author has maintained same bad-ass-girl demeanor for Lisbeth who speaks sharp, with less words and with same old social awkwardness and with her same old zeal to fight for revenge all by herself, and with that same old skill. Her non-nonsense narrative will once gain make the readers fall for this anti-hero of the story. Mikael, too, is kept very similar to his old self despite of the bring lifestyle that he led, but the best part is that the author have focused a great deal of the story around Mikael and through his lens, which is intellectual as well as funny, the story is like a roller coaster that is never intended to come down to the ground. And when these two characters are seen fighting for the same cause from the two opposite ends, and this portrayal is done with utmost sagacity. Well, David might not have achieved that Larsson's trademark style of mastery yet he brought, the once dead, incredible characters, to life with his own elegance, thus opening the doors with a promise that Salander-Blomkvist duo will return again and again with new captivating and intriguing mysteries.Verdict:  A tremendously addictive as well as phenomenal plot that brings alive two of the most loved fictitious characters of crime fiction. Courtesy:  I received this book from Hachette India, for a blog tour."}, {"userName": "Kristina", "userReviewDate": "Jul 08, 2015", "userURL": "http://www.goodreads.com/user/show/4272284-kristina", "userReview": "[Marvel Comics Connection. Are you fucking kidding me? Wasp, Salander’s hacker name, is a superhero in Marvel Comics. So, that’s why she acts like a superhero? Because she actually is one? And (I love this) the bad guys are part of a gang called the Spider Society—also in Marvel Comics. Guess who their enemies are? Guess. Guess. Okay. The “Sisterhood of the Wasp.” Wow. Could this be any stupider? It’s all about Marvel Comics. Wanna bet the author is a big ole comic book nerd? (hide spoiler)]"}, {"userName": "Paul", "userReviewDate": "Jun 16, 2016", "userURL": "http://www.goodreads.com/user/show/36511432-paul", "userReview": "Lagercrantz, couldn't quite get it right. It always felt like a watered down version Of Stieg Larsson, never felt like \"A Lisbeth Salander\" novel. Maybe her cousin."}, {"userName": "Gally", "userReviewDate": "Apr 01, 2015", "userURL": "http://www.goodreads.com/user/show/8305697-gally", "userReview": "04.01.15 --LISBETH'S BACK.I flipped my SHIT when I saw this. My dream of having more Lisbeth has come true. I hope this is where we finally meet her twin.Sept 2015 --2/5 stars ~0.5/1 for plot0.5/1 for characters and character development0.5/1 for writing style/translation0.5/1 for pace0/1 for world-buildingMy feelings about this continuation of Stieg Larsson's beloved Millennium series are unexpectedly conflicted. This has nothing to do with the supposed battle lines that have been drawn between Larsson's long-time partner, who was against the continuation of the series, and Larsson's father and brother, who own the rights to the series and wanted it continued. I enjoyed bits of GitSW, but overall, I'd honestly have to say I'm disappointed with how it turned out.This is an informal review so I'm just going to list my thoughts...Plot:I wish I knew if this were an accurate adaptation of the plans and/or manuscript Larsson had for his fourth novel. The main plot continues Lisbeth's battle with the remnants of Zala's international criminal network and an important character that's only briefly mentioned on the previous three books, and I liked those two elements because they tie together nicely with what's already been established in the series, but how the plot unfolds feels like a horrible attempt to bank on current popular topics such as the NSA, artificial intelligence, autism awareness, and comic books.Characters and development:Lisbeth is possibly my all-time favorite character, and in this interpretation, she conducts some out-of-character behavior that diminishes her essence. Some of her risky actions are explained later as part of a larger agenda she was trying to accomplish, but for a genius who always thinks before she acts and stays out of other people's business because she's basically allergic to people, she sticks her neck out too much and makes obvious mistakes, like not wearing her disguise when she goes out for dangerous tasks and going back to her apartment a couple times where anyone who wants to track her would obviously check first. The other characters felt mostly the same as they did in the previous novels, but the character that develops most is an autistic child.Writing/Pace:Not a ground-breaking style here, and neither was Larsson's by any means, but it's an easy translation to read that, if I recall, is similar to the previous books. My main complaint is that the timeline jumps around too much. For example, one moment you're reading about Lisbeth hearing a scream, then suddenly you're reading about a killer and the story backtracks a few pages until the same scream happens from his point of view. That totally ruins the pace of an otherwise average-pace 400-page thriller.World-building:This was by far the worst aspect of the book for me. For a series that's supposed to take place in our current world, the author somehow conceived a world where the American government acts like the Chinese government and conducts corporate espionage. Many technological \"facts\" are wrong. The conspiracy-saturated drivel about the NSA are wrong. He clearly didn't do sufficient research.So...... now the question is, if it exists, would I buy a fifth Millennium novel? The answer is yes IF it has a better, more believable story, or a different author who can write a better, more believable story. Lisbeth and Blomkvist are still two amazing characters who don't deserve to be silenced, and I'm not convinced David Lagercrantz is the best agent for their voices."}, {"userName": "Beatrice Masaluñga", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/4590441-beatrice-masalu-ga", "userReview": "My all-time favorite badass heroine returns in the fourth installment of Millennium  series. I'm so pumped David Lagercrantz continues Stieg Larsson's legacy because we get more Lisbeth and Mikael but I'm skeptical too since there will be changes. I'm hopeful these changes are good and fortunately it is. Lisbeth Salander is a legit badass feminist. She's independent, tough and loyal woman. She may be antisocial and doesn't easily trust people unless you earned it. She has a photographic memory and is a professional hacker. She hates misogynists and ensures they'll be punished in the most hurtful way. She may look fragile but no one should underestimate her capabilities. If anyone pulls a hit on her or her love ones, she'll get a bigger weapon and inflict twice the damage. That's how she kickbutt and that's evident on the first three books in the series especially on the rivalry between her and her father. In this fourth book, a new chapter begins and a new enemy has been introduced. I'll try to make it as spoiler-free as possible. The story becomes more complex as it deals with various issues. It all started with the researcher and computer genius, Frans Balder. He invented a program, found out that some rat stole his invention and sold it to the wrong people. From U.S., he returns to Sweden and takes care of his son August Balder, who has been neglected by her mother, Hanna Balder and abused by her live-in partner, Lasse Westman. Frans received a couple of death threats and became paranoid. He discovered later on that his son is a savant. He has a photographic memory with an artistic skill and is great with numbers. There's only one investigative journalist he trusted to write an article / exposé and he immediately contacted Mikael Blomkvist. Before he can spill the beans, it was too late. He was murdered and August was the only witness.Many things happened after Frans Balder's death: Millenium Magazine on crisis, hunting the suspects, protecting August from threats etc. Lisbeth and Mikael teamed up again to solve the crime. We get to see more of Lisbeth's expertise on hacking and deciphering codes. The plot was impressive and well detailed. Before I fell in love with this series, I truly had a hard time getting into it due to Stieg Larsson's writing style. I fell asleep and on the verge of giving up, yet I didn't. It's easier to get into David Lagercrantz's writing style compared to Stieg Larsson's. On the other hand, I miss the challenge. Don't get me wrong, Lisbeth Salander is still a badass chick but I can't help noticing she's tamer and more considerate. That NEVER happens. She beats wife beaters and child beaters in a bloody pulp even lit them with fire without having second thoughts. Overall, I really like it despite my issues. I hope the next one is better with more action and I want to see a more fiery Lisbeth Salander. I'm looking forward where the story is heading and I'm curious with Lisbeth's new rival. Thanos vs. Wasp ;)"}, {"userName": "Filipe Miguel", "userReviewDate": "Oct 03, 2015", "userURL": "http://www.goodreads.com/user/show/5855795-filipe-miguel", "userReview": "Stieg Larsson... voltou!Dificilmente um apreciador de Stieg Larsson irá sentir-se desiludido com este \"A Rapariga Apanhada na Teia de Aranha\", mais que não seja pelo outrora improvável regresso da dupla Blomqvist-Salander.Lagercrantz tem o mérito de replicar quase na integra a fórmula de Larsson, ao ponto de ser dificil distinguir onde se desvanece a escrita de um e começa a de outro. David, que no curriculo pouco mais tinha que a biografia de um dos melhores desportistas suecos de todos os tempos, surpreende pela forma como usufrui das palavras, as conjuga em frases, e a proximidade e conhecimento das personagens.Com inicio morno, ao bom estilo Larssiano, mas a puxar, quiçá demasiado, a toques conspirativos à-lá-Dan Brown, não deixa de ser surpreendente a forma como toda essa conspiração passa para segundo plano, para centrar-se no ponto forte que Stieg nos trouxe com a trilogia original. Aí, a partir desse momento, aí mesmo, Lagercrantz brilha intensamente.Evito entrar em pormenores, para mais facilmente fazer juz a este, por mim aplaudido, regresso da dupla fetiche de Larsson. Lagercrantz tem o enorme mérito de seguir a linha criativa de Stieg Larsson, nunca abandonando o passado. Correndo o risco de ser surpreendido numa próxima iteração e arriscando ser injusto por tão condigno retorno, aguardarei pelo próximo capítulo desconfiado, apesar de não ter qualquer razão para isso.Tiro o meu chapéu a David Lagercrantz por esta bonita homenagem em forma de sequela. Mais próximo que a escrita de Larsson, só o próprio Stieg Larsson.\"-Estás zangada comigo?- Bastante.- Porquê, minha amiga?Lisbeth deu um passo em frente no corredor com um rosto pálido, mas cheio de brilho. (...)- Porque vim fazer uma visita e não está ninguém em casa.\"PS - Lagercrantz merece cinco estrelas por tudo o que esta obra representa e pela colagem impressionante à fórmula original, mas guarda-las-ei para um futuro número 5 por respeito a Stieg, mesmo que esta opção abra algum remorso relativamente ao que atingiu LagercrantzNota: 4.5/5.0"}, {"userName": "Bradley", "userReviewDate": "Sep 03, 2015", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "This is good clean fun, with none of the major problems I was prepared to pour upon it. While it isn't based on any of the notes that the deceased author left behind, only the characters and the situations, I still love the characters. Our favorite hacker-girl is still kick-ass and running huge circles of Sci-Fi all over the more traditional mystery scene. To note: Wet get lots of references to technological singularities, emergent AIs, MMORPGS, darknet, and even an ill-conceived MCU geekspew.Technological fantasy is rampant, and it's pretty damn awesome when mixed with more avenging of women and children. I'm telling you, it's all mindless fun. It doesn't break new ground from the original fantastic trilogy, except with Lizbeth's twin sister, but that's okay because it's a STANDARD PLOT DEVICE for mysteries.The journalism schtick is pretty convincing, too, but I'd expect that from an actual journalist who picked up the pen to write this.It isn't bad, people! It sucks you in and has a pretty damn satisfying kick the NSA in the nuts conclusion. Great palate cleanser, too. Clears my mental plate clean for some real SF or Fantasy that's niggling me. :)"}, {"userName": "Gary", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/15055195-gary", "userReview": "I read the 3 Stieg Larsson books back to back sometime ago and loved them and felt so disappointed that the 10 book Millenium series had been cut short by the death of the author. So when I heard that the series was to be continued by David Lagercrantz I was both excited and intrigued to see how successful he would be. Overall I would say that he does a good job picking up the pieces and continuing with the series which must have been no easy task.I thought that the story was very slow paced probably due to the author having to re-introduce characters and explain what was now going on within their lives. I never mind slow paced books as long as they are well written and that was the case with this one.The book continues with the 2 major characters of the series Lisbeth Salander and journalist Mikael Blomkvist and together they battle to keep an autistic boy alive. The book was so much better when Lisbeth was involved and that is hopefully something that will be addressed in the next book as well as picking up the pace a little.I wanted to give it 4 stars as it was like getting to know an old friend again but decided to stick with a strong 3 rating due to the slow plot. I did enjoy it though and as the story gathered pace it got better and better and shows great promise for the rest of the series."}, {"userName": "BAM The Bibliomaniac ", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/6595648-bam-the-bibliomaniac", "userReview": "HOT MESSeverything and the kitchen sink is thrown into this plot leaving the reader scratching her headI felt like the author kept thinking of things to write about until he got to the last chapter and said,\"uh-oh now I have to link this hodgepodge\". Honestly I was right there with the author until he started talking comic books and began adding characters. Fans of the original series, just skip this 2017 Reading Challenge: espionage thriller"}, {"userName": "Barbara", "userReviewDate": "Nov 25, 2015", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "Frans Balder, a brilliant Swedish computer scientist, created a revolutionary artificial intelligence (AI) program when he worked at the Solifon company in the United States. He then suddenly quit his job, took his program, and returned to Sweden. Balder proceeded to remove his autistic 8-year-old son August from the abusive home of his ex-wife and her boyfriend and holed up at home with the boy. It seems that Balder had discovered a conspiracy involving Solifon, the National Security Agency (NSA), and Russian mobsters - and now feared for his life and his program. Meanwhile, Mikael Blomkvist - famous investigative journalist for the magazine Millenium - is having problems. The magazine has been bought by a conglomerate that wants to remove Mikael from the editorial board and 'lighten' the magazine's features. Mikael could use a juicy story to buck up his career. This seems to be on the horizon when Frans Balder contacts Mikael to tell him he has a big, important story to tell.Before Balder can meet with Blomkvist the computer scientist is murdered in front of his son August, who can't speak and doesn't seem to connect with what's going on around him. It turns out, though, that August is an artistic savant who might be able to draw a picture of the murderer. This makes him a target for the bad guys who, of course, don't want to be identified.While all this is going on Lisbeth Salander - computer hacker extraordinaire - has been infiltrating computers around the world, including those of the NSA. Thus, she's discovered top secret information that's connected to the conspiracy Balder uncovered. Some of the NSA files, though, are super-encrypted and Lisbeth can't figure out the mathematical keys needed to open them. As the story unfolds, Lisbeth rescues August from an assassination attempt and - while hiding the child - learns that he's also a math savant. Lisbeth uses the boy's math skills to try to crack the super-encrypted NSA files she's uncovered. The basic premise of the story is that criminals are hunting August while Blomkvist tries to uncover the conspiracy Balder was going to reveal. Meanwhile, Lisbeth does her thing. She protects August, beats up men who abuse children and women, and infuriates people whose computers she's hacked. Lisbeth also must (once again) deal with a demented family member - this time her murderous fraternal twin sister Camilla. (Readers familiar with the trilogy know that Lisbeth is cursed with one of the worst families in the world.)I'm a big fan of the Millenium Trilogy and was looking forward to this addition to the series. Sadly, in my opinion this book isn't as good as the previous ones. My main problems with the book:There are intimations in the story that Frans Balder's AI program could potentially allow computers to take over the world and dispense with humans. I thought this thread might be important to the story but it went essentially nowhere. To 'round out' the Camilla character the author resorts to a long expository chapter. In this section Hoger Palmgren (Lisbeth's former guardian) tells Mikael about Camilla - her history and relationship with her family - in great detail. This is an indelicate and tedious technique to familiarize the reader with a character. In addition, Camilla seems more like a comic book woman than a real person. She's so over-the-top gorgeous and manipulative that everyone seems to lose their senses around her. Because of this, the behavior of other characters around Camilla is simply not believable.The conspiracy at the center of the story is too twisty and confusing. It's not until the very end of the book that I more or less understood what it was about - and then it didn't make much sense and I didn't believe it.Though I wasn't satisfied with the story, I admire David Lagercrantz for taking on a difficult task. It's hard to add books to a popular series after the death of the original author. If Lagercrantz writes another Millenium book I'd probably read it to see if he's able to get the correct 'vibe'. All in all, I'd recommend this book to fans of the series, but warn them to temper their expectations. You can follow my reviews at http://reviewsbybarbsaffer.blogspot.com/"}, {"userName": "Matt", "userReviewDate": "Jun 07, 2015", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "In this long-anticipated release, Lagercrantz adds his own flavour to Lisbeth Salander and Mikhael Blomkvist. After leaving a prestigious job at a computer firm in California, Frans Balder is back in Sweden and looking to regain custody of his son. A messy divorce left him with little choice but to flee, but Balder wants to care for August and leave his California dreams in the rearview mirror. As the reader soon learns, August is an autistic savant, proficient in both drawing and the calculation of complex numbers, two traits rarely seen in combination amongst savants. While alerted to numerous security issues surrounding his past work, Balder ignores them, choosing instead to focus on his time with August. Meanwhile, Mikael Blomkvist has come to realise that his prized magazine, Millennium, is on the verge of collapse and is looking for the next big story. When approached by Balder to discuss some of the issues he's faced and his work on Artificial Intelligence, Blomkvist takes some interest and agrees to meet. However, before Blomkvist can meet with Balder, a hitman kills Balder, but left August as a mute witness. August is sent back to his mother, who can no longer handle her son and ships him off to an institution. As Blomkvist digs a little deeper, he realises that August may be the key to solving the mystery and calls on his past acquaintance, Lisbeth Salander, to help. Salander agrees to take August to a safe house in the hopes of discovering the secret behind the murder. She is able to discern that August's abilities go far beyond his drawings, which offer clues to the murder, but he can help her as she cracks into the NSA's secure servers for her own interests. Salander discovers that Balder may have been targeted by a Russian gang, calling themselves the Spider Society, whose membership includes a key figure from her past. Hindered by his inability to speak, can August help reveal the person who killed his father and can Salander utilise August's abilities to crack a highly-encripted code the NSA has on its most top secret documents? Layered with multiple other storylines, some of whom mesh with the aforementioned summary, Lagercrantz does his best to continue the narrative where Stieg Larsson left it at his untimely death.I have read a number of series continuations after the death of a celebrated author (Robert Ludlum, Margaret Truman, and Vince Flynn, to name a few) and it is always the attentive reader who seeks to place this 'new' author under the microscope to determine their mettle. In Lagercrantz's case, the shoes to fill are enormous and the expectations are likely insurmountable. While it has been a while since I read the previous three novels, I did sense a disconnect in this book, especially as it relates to Lisbeth Salander. While Lagercrantz attempts to weave another layer of horrific backstory into the young woman's life, depicting her witnessing the repeated rapes her mother faced at the hands of a drunken father and her twin sister's sadistic desire to side with their father, the impact is not the same. Salander is a complex character and one who is well-known and respected both in the Scandinavian crime writing community and around the world. While the story flowed well and Lagercrantz injected a few well-researched storylines, the flow of the series is lost on the numerous plots the reader must follow. For this reason, I found it harder to tackle this book and end on a high note. With at least two other Lagercrantz novels in the works, I am uncertain if the series will find its strength again, or if, like the doomed Jason Bourne series, it will die at the hands of an author who has bitten off more than he can chew. Stay tuned for the verdict.Kudos, Herr Lagercrantz for your attempt. I will give you the benefit of the doubt on this occasion, though I remain leery of your taking on this project, especially when unpublished manuscripts remain in existence.Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/"}, {"userName": "Britany", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/5550397-britany", "userReview": "As always with author re-writes, I'm hesitant to pick them up.David Lagercrantz does a phenomonal job picking up the story and running with it. It was great to be among old book friends Mikael Blomkvist and Lisbeth Salander. This time a scientist has coveted information and is murdered. His savant son is left alive but barely, until Lisbeth interferes and comes to his rescue. Many different storylines going on here, and greatly appreciated the notes at the beginning about the characters from previous books (can we get all books in a series to do this?? Pretty please!) It moved quickly and the audio version had a lot to offer in terms of character voices. I was most looking forward to Lisbeth & Mikael's reunion and their interactions in this novel were less than I had hoped for, but ultimately this is a satisfying read within the Millennium series and I will pick up the next one."}], "description": "She is the girl with the dragon tattoo—a genius hacker and uncompromising misfit. He is a crusading journalist whose championing of the truth often brings him to the brink of prosecution.Late one night, Blomkvist receives a phone call from a source claiming to have information vital to the United States. The source has been in contact with a young female superhacker—a hacker resembling someone Blomkvist knows all too well. The implications are staggering. Blomkvist, in desperate need of a scoop for Millennium, turns to Salander for help. She, as usual, has her own agenda. The secret they are both chasing is at the center of a tangled web of spies, cybercriminals, and governments around the world, and someone is prepared to kill to protect it . . . The duo who captivated millions of readers in The Girl with the Dragon Tattoo, The Girl Who Played with Fire, and The Girl Who Kicked the Hornet’s Nest join forces again in this adrenaline-charged, uniquely of-the-moment thriller.", "title": "The Girl in the Spider's Web\n      \n          (Millennium #4)", "url": "https://www.goodreads.com/book/show/25074850.The_Girl_in_the_Spider_s_Web__Millennium___4_", "average": 3.75, "cover": "https://images.gr-assets.com/books/1427843648l/25074850.jpg", "reviews": 10990, "authors": [{"url": "https://www.goodreads.com/author/show/242659.David_Lagercrantz", "name": "David Lagercrantz"}, {"url": "https://www.goodreads.com/author/show/706255.Stieg_Larsson", "name": "Stieg Larsson"}, {"url": "https://www.goodreads.com/author/show/3105358.George_Goulding", "name": "George Goulding"}], "type": ["Fiction", "Mystery", "Thriller", "Mystery", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/25074850-the-girl-in-the-spider-s-web", "http://www.goodreads.com/book/show/25600912-lo-que-no-te-mata-te-hace-m-s-fuerte", "http://www.goodreads.com/book/show/25196214-the-girl-in-the-spider-s-web", "http://www.goodreads.com/book/show/19542151-det-som-inte-d-dar-oss", "http://www.goodreads.com/book/show/24789156-the-girl-in-the-spider-s-web", "http://www.goodreads.com/book/show/26021090-a-rapariga-apanhada-na-teia-de-aranha", "http://www.goodreads.com/book/show/32599492-the-girl-who-takes-an-eye-for-an-eye", "http://www.goodreads.com/book/show/13037816-jag-r-zlatan", "http://www.goodreads.com/book/show/27071487-fall-of-man-in-wilmslow", "http://www.goodreads.com/book/show/38799538-the-girl-who-takes-an-eye-for-an-eye", "http://www.goodreads.com/book/show/9737803-ett-svenskt-geni", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}