{"ratings": 257, "userreviews": [{"userName": "Tristan Goding", "userReviewDate": "Oct 23, 2015", "userURL": "http://www.goodreads.com/user/show/37574258-tristan-goding", "userReview": "Quite optimistic in its writing and in its exploration of gay culture from the 1940s onward, but the end result feels too pretty as a result. I'm awfully picky when it comes to gay literature. I think it's important that an LGBTQ themed-book be as honest and direct about the gay experience as it possibly can. This book mostly focuses on the progressiveness of the gay rights movement and the way our community eventually shaped itself. It's been a triumphant battle, I'm not going to deny that. The way we have liberated ourselves from all of society's derogatory glances should tell you just how strong a group of people we are. However, this book feels far too one-sided to me. For starters, it seems to mostly be focused on the \"gay white male\" experience and doesn't really try to reach out beyond that. To me, that's a shame. Many minority groups have had a hand in shaping gay culture and this book mostly glosses over them. Those of you who are interested in getting a better understanding of how lesbianism and feminism have affected one another will not get much out of this book. This book does not go into significant detail about a lot of the dark parts of the culture. We never read about the people who caused damage to the gay right's movement as often as we read about the people who helped push it. The AIDS crisis is not explored at any length. I don't know, to me this book felt as though it was written with an agenda in mind. Nothing wrong with that, but it needed to be more honest."}, {"userName": "Laurie", "userReviewDate": "Jun 29, 2011", "userURL": "http://www.goodreads.com/user/show/1050800-laurie", "userReview": "Kaiser has written a history of gay life in America from WW 2 to 1996 that is sure to grip the reader. Focusing on New York City, he moves through each decade with a combination of a dispassionate history of events and interviews with people who were actually there and lived through it. This technique humanizes the book, making it far more approachable than the average history book. And it’s a very lively book, full of reminiscences, headlines, ground breaking events and gossip. Different eras emphasize different aspects of the gay experience: in WW 2 we have gays in battle (amazingly well tolerated for the time- so much for gays breaking down military cohesiveness); in different eras it’s the literary set, the theater (the groundbreaking premier of ‘The Boys in the Band’, for instance), Stonewall, the bars and bathhouses, the beginning of the AIDS epidemic and the horrifying number of deaths that followed. I enjoyed this approach; it gives the reader a rounded view of gay history. My only complaint is that lesbians barely make an appearance in the book.Originally written in 1997, Kaiser wrote a new afterword in 2007 with a brief update. I found it fitting that I was reading that update while listening to the news about the NY vote on gay marriage."}, {"userName": "Elisa Rolle", "userReviewDate": "Nov 13, 2011", "userURL": "http://www.goodreads.com/user/show/2156728-elisa-rolle", "userReview": "It’s almost funny to read how Otis Bigelow (famous to be the most handsome man of the ’40s in New York City, and coveted by millionaires and artists) reported as being gay “was an upscale thing to be”, but at the same time the author reports as just “across town from Park Avenue swells who entertained him so lavishly in their duplex apartments, a completely different kind of gay life was thriving in Times Square”. This was and is New York City, and as in the ’40s, also now there is a melting pot of cultures, and each culture wants to reclaim their identity. Otis Bigelow was not wrong as they were not wrong the obvious fairies of Times Square, they were simply navigating in different circles.The “hidden in plain sight” approach was apparently pretty common in the ’40s, and so we learn from the memory of a fund boy from New England who wants to remain anonymous as he went to school with John Fitzgerald Kenney, and between the two, the outcast was Kennedy; but there is also the inside news of how JFK’s roommate, Lemoyne Billings, was gay and how he remained family friend even after the president election.And from the words of many gay men who was there and lived that ’40s atmosphere the general opinion is that, you could be gay since you simply didn’t flaunt it. One of them cite a certain Mrs. Patrick Campbell who said “My dear, I don’t care what people do as long as they don’t do it in the street and frighten the horses”. That is basically what Otis Bigelow and those other anonymous voices implied, you were free to be gay as far as you were gay inside “private” locations.And maybe that is the reason why, in a period when civil rights were starting to be a common agenda of many politicians, it was not the same when those rights regarded LGBT people. You were free inside your private home, btw if you were wealthy enough to have that safe home, but you were also captive of your own golden cage.There is a long session devoted to the gays in the military during the WWII. A nice introduction probably explains how the “Don’t Ask Don’t Tell” was introduced, but mostly it’s about those men who remained (or went back) into the closet, not for the fear of being discovered, but to avoid to be refused the chance to protect their country as soldiers.In the post-war stories, the one I liked the most is the friendship between Paul Cadmus and E.M. Forster, and how Cadmus was aware of Forster’s novel Maurice, a novel the author refused to publish until after his death to not damage his policeman “friend” (who was married).The ’50s is a period of euphoria but apparently it also started the period when being gay was dangerous, and so it should be hidden; if in the ’40 you could be gay inside private walls, in the ’50s even that freedom was a danger, and the walls of a room became the more confined space of a closet. As for many others, gays became the target of a witch hunt. Maybe for this reason, late in the ’50s the main tendency was to “blend” and you see gays people getting married, with or without the knowledge of the wife.The ’60s see a surge of consciences, in all the level of society, and so also among gays and lesbians. New York saw not only the first religious congregation for gays, but also Columbia University became one of the first colleges to give formal recognition to a gay students organization. Homosexuality exited from the closet and arrived in television, with a ground-breaking documentary, The Homosexuals.The bridge between the ’60 and the ’70 is Stonewall, and so from that moment on there will be always a pre and post-Stonewall gay and lesbian movement and culture: “although millions would remain in the closet, within a year after Stonewall, thousands of men and women would find the courage to declare themselves for the first time”. Not only, being gay, or at least bisexual, was almost “fashionable”, and in many media, television, cinema, publishing, the gay characters not only started to make their appearance, they were also, sometime, positively accepted by the mainstream public. And also Forster’s Maurice came out of the closet. The ’70 see the sexual revolution, a sexual revolution that happened also within the LGBT community.The ’80 and the beginning of the ’90 is the Dark Ages of the LGBT community, the AIDS plague killed so many, that almost completely deprived the world of an entire generation. There is visibly a jump, if you browse the net for notably LGBT characters, those born in the ’50 and ’60 are almost all among the victims. As reported “New York had far more AIDS cases than any other city in America”. One man stated “I know 450 people that died of AIDS that I can count. Thirty to 40 of my close friends that I had made from 1967 to today died from this disease”. It’s painful to read this part of the books, even more painful if you compare it to the energy that you had just felt in the stories of those men of the ’50 and ’60 and ’70, men who were eager to claim their homosexuality.Maybe due to the imperative of being more mainstream to protect their rights among the massacre that was the AIDS catastrophe, the ’90 see the LGBT community enters politics and starting to put their weight on who has to represent them.It was a long ride to arrive to the end of this book, but it was a very enlightening ride. Charles Kaiser managed to always bring alive the men he is talking about, with their dreams, fears, love and betrayals. It’s a wonderful essay that you read like a novel, with the easiness of a collection of short stories, only that the characters in those short stories are real life men and women.http://www.amazon.com/dp/0802143172/?..."}, {"userName": "ProgressiveBookClub", "userReviewDate": "May 05, 2009", "userURL": "http://www.goodreads.com/user/show/2220261-progressivebookclub", "userReview": "A New York Times Notable Book of the Year and winner of a Lambda Literary Award, The Gay Metropolis is a landmark saga of struggle and triumph that was instantly recognized as the most authoritative and substantial work of its kind. Filled with astounding anecdotes and searing tales of heartbreak and transformation, it provides a decade-by-decade account of the rise and acceptance of gay life and identity since the 1940s.From the making of \"West Side Story,\" the modern Romeo and Juliet tale written and staged by four gay men, to the catastrophic era of AIDS, Charles Kaiser recounts the true history of the gay movement with many never-before-told stories. Filled with dazzling characters — including Leonard Bernstein, Montgomery Clift, Alfred Hitchcock and John F. Kennedy, among many others — this is a vital telling of American history, exciting and uplifting.To learn more, visit The Progressive Book Club: http://www.progressivebookclub.com/pb..."}, {"userName": "Tom", "userReviewDate": "Feb 13, 2009", "userURL": "http://www.goodreads.com/user/show/1837116-tom", "userReview": "A lively account of the U.S. gay subculture as it began to acquire a sense of community in New York City and other large cities after World War 2, and then, in the 60s, to move out of the closet and claim political rights. The title is misleading -- this book is about much more than the Big Apple, although much of its anecodotal material comes from there. I especially liked the chapter on \"The Forties\" -- I hadn't realized how the mass mobilization of World War 2 brought together gay guys (and to some extent lesbians) and allowed them to form their own little sub-groups within their units. The detailed recounting of the Stonewall Riots also was interesting, and is especially relevant in 2009, the 40th anniveresary year. Some might find the book too gossipy, but I thought it was useful to find out how pioneers of the gay movement evolved as individuals over the decades."}, {"userName": "Brandon Leighton", "userReviewDate": "Jun 15, 2012", "userURL": "http://www.goodreads.com/user/show/5042294-brandon-leighton", "userReview": "This book offers a fascinating history of the gay \"experience\" from the 40s to the 90s. I thought at times, though, that the serious was replaced by the salacious. But I guess the gritty/dirty details make any book interesting, right? But in all seriousness, you have to give credit to the early pioneers of the gay movement who were only able to experience their identities in secret. We've come a long way! Full Disclosure: I didn't read the book all the way through. I skipped around, much like one might do with a reference book/textbook. :)"}, {"userName": "Jordan Kinsey", "userReviewDate": "Aug 02, 2011", "userURL": "http://www.goodreads.com/user/show/5947487-jordan-kinsey", "userReview": "A fascinating book. I haven't spent enough time reading gay history as I should. Kaiser's depiction of the sexual \"revolution\" of the 1970's, followed by the decimation of the AIDS epidemic in the 1980's is especially poignant. He does an amazing job of devoting equal time to the \"big picture\" political stories, juxtaposed with the intimate stories of real people and real lives. The latter really helped me understand the terror and sadness of the AIDS epidemic."}, {"userName": "Tori", "userReviewDate": "Apr 23, 2015", "userURL": "http://www.goodreads.com/user/show/19193773-tori", "userReview": "WAY too focused on the white male gay experience to really be a good, all-encompassing kind of ~gay history~ text. that said, i learned a lot about the movement and how different actions and social/political attitudes changed through the latter half of the 20th century. and the sections devoted to the aids crisis were really, really well done. very appropriately visceral."}, {"userName": "Sarah Watts", "userReviewDate": "Mar 02, 2009", "userURL": "http://www.goodreads.com/user/show/2059280-sarah-watts", "userReview": "This book was absolutely amazing! Even now I tend to think of American gay culture as a \"modern\" phenomenon, something that only entered the cultural consciousness after the Sonewall Riots of 1969. It's fascinating to read about how sex and love among men functioned pre-sexual revolution. I love historical nonfiction and this book is certainly one of my favorites."}, {"userName": "Chris", "userReviewDate": "Oct 06, 2012", "userURL": "http://www.goodreads.com/user/show/2268905-chris", "userReview": "Gossipy, sexual, culturally sensitive, committed and engaged, political, accurate—Kaiser has written a thoroughly informative and entertaining history. Highly, highly recommended for everyone to see how we got here, and to realize how easy it would be to lose it all again."}, {"userName": "Dan", "userReviewDate": "Feb 21, 2008", "userURL": "http://www.goodreads.com/user/show/926397-dan", "userReview": "The account of the early days of the AIDS crisis are nothing short of chilling."}, {"userName": "Erin Bomboy", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/62796824-erin-bomboy", "userReview": "The Gay Metropolis covers queer history from the end of WWII through the '90s, hitting the high notes of Stonewall, Studio 54, and AIDS. It also delves into issues with which and people with whom I was unfamiliar (I was previously unaware of the New York Times' homophobia). I read it out of order, but this did nothing to dim the sparkle and optimism of author Charles Kaiser's prose.As with all histories of this breadth, it's limited in its very nature. Only the broad strokes are covered. The AIDS epidemic, in particular, is brief, and queer people of color only make the occasional appearance. I took off a star for the appalling editing. A cursory proofread would have caught the numerous and obvious typos (the number one used instead of the letter t is just one such mistake) that litter this otherwise fine book."}, {"userName": "David Allen White", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/15367307-david-allen-white", "userReview": "Fascinating book about gay life in New York City (mostly) from World War II to the end of the 20th century. Thoroughly researched. I lived in New York for a while in the 1970s and knew some of the people mentioned in this book. It really brought back memories. However, I notice in the acknowledgements that there is a David White listed. I think that must be a different David White, because as far as I know, I never met this author or contributed anything to this book, unless he read something that I wrote for some other publication."}, {"userName": "Kristan", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/690535-kristan", "userReview": "I thought this book was really interesting and entertaining. I do wish that it focused more on lesbians, bisexuals, trans people and people of color. It was mostly about white gay men with money. Super interesting but could've been more inclusive."}, {"userName": "Julia Prater", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/4407086-julia-prater", "userReview": "Fascinating history of the struggle for justice and equality for gay Americans from WWII through the 90's. Sorry too many leaders in the struggle weren't still with us to see the amazing progress of the 21st century. Praying the current climate and administration won't set back that progress."}, {"userName": "Joe", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/7301523-joe", "userReview": "Interesting, if a little gossipy."}, {"userName": "Silvio Curtis", "userReviewDate": "May 23, 2013", "userURL": "http://www.goodreads.com/user/show/1852180-silvio-curtis", "userReview": "More or less does what I hoped it would, which is give the standard story of the USA gay rights movement, World War II to 1996, which I'll need in order to put more detailed or controversial versions in perspective. On the other hand, it could have been better focused and organized. A good deal of it was a sort of celebrity gossip, less judgmental than what you get in the media but just as trivial. For instance, I didn't think all the details of how West Side Story was created were relevant to learning what it was like to be an ordinary gay man in the US at that time and how it was changing. Also, the parts about lesbians were nowhere near enough to make the book a complete overview of the homosexual rights struggle, and yet didn't seem particularly relevant to gay men's history. The best parts were the excerpts from newspapers and documentaries, which seemed very good at showing what messages about gay people were coming through the media. The section on the outbreak of the AIDS epidemic was also eye-opening, probably more because of my own ignorance than because it was handled especially well."}, {"userName": "Andrey", "userReviewDate": "Jul 09, 2016", "userURL": "http://www.goodreads.com/user/show/42095389-andrey", "userReview": "It was just eye-opening to me, as I think it must be to any non-US citizen whose awareness of culture and history of America is only superficial. The story is about the fight for gay rights, from the very first sparks of it, and it also covers general changes in morals and attitudes pretty well. The book gave me a good idea of how gay people of US have acheived recognition, and finally have had their rights protected by law, and what's very interesting, how American society made that victory possible.The book seems a bit too much about the rich and powerful in some places, and it is quite New York-centric. It is really about significant people, with not much stories of lives of ordinary citizens. I liked that perspective though, as the book is concise and informative, and it puts the spotlight on all the most important actors. The spirit of each decade is conveyed pretty well, too.The book made me feel a little bitter, because of my realizing that for countries with no strong democratic tradition and freedom of speech – there is not much hope that the gay problem is going to be solved anytime soon."}, {"userName": "Lisa", "userReviewDate": "Jul 27, 2016", "userURL": "http://www.goodreads.com/user/show/8357496-lisa", "userReview": "This was a fun but fact filled history of the LGBTQ Community especially in and around NY. I really enjoyed it and reading the afterwards reminded me how much progress we have made so quickly. Some facts are mind blowing like into was not until 2003 that the Supreme Court found anti-sodomy laws unconstitutional. But I also loved that there is a line in the afterwards written in 2007 \"In twenty-five years about thirty states will have either marriage or complete civil unions'. In reality it only took 8 for marriage to be legal nation wide. It is hard to see the movement of history while living it but while the LGBTQ community still has many struggles it has made amazing progress in the time given."}, {"userName": "Katie", "userReviewDate": "May 27, 2015", "userURL": "http://www.goodreads.com/user/show/34565378-katie", "userReview": "I really had high hopes for this book, but it turned out to be kind of a slog. It's less a narrative and more an oral history, focused around gay men living in New York City from the 50s on. That focus means that sometimes the book feels like listening to your gay uncle tell you boring stories about all the hook ups he had back in the day, and other things get missed - Harvey Milk is hardly mentioned at all, for example. The writing felt really disjointed in some places for the same reason. That said, one thing that delighted me, reading this the summer that gay marriage was legalized: this was written in the 90s, and the author and his interview subjects were so convinced that gay people had Made It and were so optimism and proud. Oh friends, you have no idea how much is yet to come!"}, {"userName": "Andrew Mercier", "userReviewDate": "Dec 10, 2012", "userURL": "http://www.goodreads.com/user/show/9932704-andrew-mercier", "userReview": "I thoroughly enjoyed this book as it satisfied my love for New York City history as well as teaching me a lot of new things about gay history in the United States. It's easy to think that gay culture only started happening in the 80s but it's important that all people, gay and straight, know the trials and tribulations of what was once one of \"America's most hated\" minorities. I highly recommend it for any LGBT person as well as anyone with a desire to know history from a number of different standpoints."}, {"userName": "Richard Jespers", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/36243553-richard-jespers", "userReview": "Gossipy yet historically accurate—filling in dates and times of some events (like Stonewall) and otherwise unknown events in U.S. gay history since WWII. The lover in Forster’s Maurice is based on Forster’s lover, a married policeman. Patrick Dennis, author of Auntie Mame, “ran off with a Mexican boy.” Died in Mexico City. In 1979, two boys escorted each other to the younger one’s senior prom sponsored by a Sioux Falls, South Dakota, high school. 1979!"}, {"userName": "Ie", "userReviewDate": "Dec 06, 2012", "userURL": "http://www.goodreads.com/user/show/2895763-ie", "userReview": "Read it to supplement a recent obsession with The Amazing Adventures of Kavalier and Clay. There were a lot of scandalous bits about already dead people, but significantly less analysis, which probably wasn't the point anyway. If you like that approach, my copy is yours."}, {"userName": "Tyler", "userReviewDate": "Jul 08, 2011", "userURL": "http://www.goodreads.com/user/show/112282-tyler", "userReview": "I didn't want this to end! My only quibble was that Kaiser seemed a bit soft on Ed Koch (no mention of the allegations of his sexuality, which is somewhat surprising), but it does not come as a surprise that Koch himself provided a blurb on the back cover."}, {"userName": "jessicamax stein", "userReviewDate": "Jul 15, 2008", "userURL": "http://www.goodreads.com/user/show/1065415-jessicamax-stein", "userReview": "gossipy and lacking narrative... but fun."}, {"userName": "Joey Gamble", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/9121760-joey-gamble", "userReview": "This book presents voluminous research in a style that is...lacking."}, {"userName": "Geary Brewer", "userReviewDate": "Jun 09, 2009", "userURL": "http://www.goodreads.com/user/show/927066-geary-brewer", "userReview": "A companion read to Chauncey's work. Together they provide a good view of the east coast cuultural trends from the late 19th century to the mid-20th century."}], "description": "This “fascinating and fabulous oral history”(Vanity Fair), “both serious and gossipy”(New York Times), chronicles gay life in New York City-and americanca-since 1945. “Irresistible” (Out). Black-and-white photographs.", "title": "The Gay Metropolis: The Landmark History of Gay Life in America since World War II", "url": "http://www.goodreads.com/book/show/1634156.The_Gay_Metropolis", "average": 4.0, "cover": "https://images.gr-assets.com/books/1266852231l/1634156.jpg", "reviews": 29, "authors": [{"url": "https://www.goodreads.com/author/show/118978.Charles_Kaiser", "name": "Charles Kaiser"}], "type": ["History", "Nonfiction", "Lgbt", "Glbt", "Glbt"], "outlinks": ["http://www.goodreads.com/book/show/1634156.The_Gay_Metropolis", "http://www.goodreads.com/book/show/4281484-the-gay-metropolis", "http://www.goodreads.com/book/show/1307845.The_Gay_Metropolis", "http://www.goodreads.com/book/show/11691151-the-gay-metropolis", "http://www.goodreads.com/book/show/7089438-the-gay-metropolis", "http://www.goodreads.com/book/show/19176609-the-gay-metropolis", "http://www.goodreads.com/book/show/23395771-the-cost-of-courage", "http://www.goodreads.com/book/show/203878.1968_in_America", "http://www.goodreads.com/book/show/39691022-1968-in-america", "http://www.goodreads.com/book/show/37585681-1968-in-america", "http://www.goodreads.com/book/show/13542729-on-being-different"]}