{"ratings": 1511, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Jan 29, 2014", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”Overhead, an enemy plane had been dragging, drumming slowly round in the pool of night, drawing up bursts of gunfire--nosing, pausing, turning, fascinated to the point for its intent. The barrage banged, coughed, retched; in here the lights in the mirrors rocked. Now down a shaft of anticipating silence the bomb swung whistling. With the shock of detonation, still to be heard, four walls of in here yawped in then bellied out; bottles danced on glass; a distortion ran through the view. The detonation dulled off into the cataracting roar of a split building:direct hit,somewhere else.”\nThis novel is set against the backdrop of the very tail end of the London Blitz. There are still explosions, but the inhabitants of London have more pressing concerns dealing with the rubble that has steadily accumulated. Stella Rodney, like most women with husbands in the war, has been displaced to a smaller apartment. None of the possessions that fills the rooms are hers. Her husband Victor, after leaving her for a nurse, promptly paid for his sins with a glorious/inglorious death in the war. His family think that the reason the marriage dissolved was that Stella was a tart, and she is unsure of how best to disabuse them of that idea. Stella is still a lovely woman. ”She had one of those charming faces which, according to the angle from which you see them, look either melancholy or impertinent. Her eyes were grey; her trick of narrowing them made her seem to reflect, the greater part of the time, in the dusk of her second thoughts. With that mood, that touch of arriere pensee, went an uncertain, speaking set of the lips. Her complexion, naturally pale, fine, soft, appeared through a pale, fine, soft bloom of make-up. She was young-looking--most because of the impression she gave of still being on happy sensuous terms with life. Nature had kindly given her one white dash, lock or wing in otherwise tawny hair…”She is in love with Robert Kelway, a man with a limp from a war wound at Dunkirk. ”His experiences and hers became harder and harder to tell apart; everything gathered behind them into a common memory--though singly each of them might, must, exist, decide, act, all things done alone came to be no more than simulacra of behavior: they waited to live again till they were together, then took living up from where they had left it off.”Robert has a nebulous job with the war effort that has him gone for days at a time. His personality morphs as the novel progresses. He seems so strong; and yet, he has unresolvable issues with his dead father, and bitterness about the circumstances that led to his wounding at Dunkirk. ”I never knew you before you were a wounded man.”“In one way that would have been impossible--I was born wounded; my father’s son. Dunkirk was waiting there in us--what a race! A class without a middle, a race without a country. Unwhole. Never earthed in--and there are thousands of thousands of us, and we’re still breeding--breeding what? You may ask: I ask. Not only nothing to hold, nothing to touch. No source of anything in anything.”Stella may have some worries in regards to Robert, but she has some real problems with another Robert referred to by his last name Harrison. (Okay there are only a handful of characters in this novel, why do authors insist on using a similar or in this case the same name. Bowen resolves it by referring to Harrison by his last name.) Harrison works in counter-intelligence, and is convinced that Robert is working for the Germans. He is an odd fellow as those shadowy characters always seem to be. ”...one of his eyes either was or behaved as being just perceptibly higher than the other. This lag or inequality in his vision gave her the feeling of being looked at twice--being viewed then checked over again in the same moment. His forehead stayed in the hiding, his eyebrows deep in the shadow, of his pulled-down hat; his nose was bony; he wore a close-clipped little that-was-that moustache. The set of his lips--from between which he had with less than civil reluctance withdrawn a cigarette--bespoke the intention of adding nothing should he happen to speak again. This was a face with a gate behind it--a face that, in this photographic half-light, looked indoor and weathered at the same time; a face, if not without meaning, totally and forbiddingly without mood.”Harrison is willing to make a deal if Stella will leave Robert and become his girlfriend. If she complies he will turn a blind eye to Robert’s transgressions. She is unconvinced of Robert’s guilt, but at the same time she has doubts about his loyalty to his country. She is also attracted to Harrison which lends even more confusion to her already jangled feelings about both men. There are some interesting sub-characters in this novel. Stella’s son Roderick who is in the service not because of any loyalty to the cause, but simply because that is what young men of his generation did. He has recently inherited an estate from his father’s family. He takes some time off from the war to tidy up the affairs of his inheritance. ”Dark ate the outlines of the house and drank from the broken distances of the valley. The air had been night itself, re-imprinted by every one of his movements upon his face and hands--and still, now that he was indoors and gone to bed, impregnating every part of the body it had not sensibly touched. He could not sleep during this memory of the air.”This whole novel feels dipped in shadows. The descriptions of the terrain of London and the surrounding areas certainly had me thinking of how noirish this book would look on film. Stella is dramatic, elegant, and trapped in circumstances that feels like only something tragic can free her from the bonds of two men. Harrison and Stella are both characters who could have stepped out of any Raymond Chandler or Dashiell Hammett novel. Louie Lewis, the opposite of Stella, in so many ways. She sleeps with men to feel closer to her husband who is away fighting in the war. That is so sweet… I’m not sure the husband will see it quite that way. I really enjoyed Bowen’s description of Louie.”Everything ungirt, artless, ardent, urgent about Louie was to the fore: all over herself she gave the impression of twisted stockings.”Louie is somehow connected to Harrison and isn’t about to go quietly into the night. She wouldn’t know how. Bowen has an unusual writing style that continually caught me by surprise. The words sometimes came at me in machine gun flashes. At other times her sentences were almost languid like Stella’s droopy eyelids. This is the first Elizabeth Bowen I’ve read and certainly not my last. Categorize this book as noir espionage with a splash of blitz. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Lisa", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "\"They were the creatures of history, whose coming together was of a nature possible in no other day - the day was inherent in the nature.\" This novel reads like a riddle. What am I? Am I a spy thriller? Am I historical fiction? Am I a love story? A character study? An experimental mix of all those things? As a plot, I suspected I wouldn't like it, and I was wrong. A two-faced spy in wartime London, working for the enemy - Nazi Germany? How could I possibly find anything likable in his character, feel with him when his lover despairs of him? Well, I could. As Elizabeth Bowen puts it in the beginning, the characters in her story are \"impossible\" from a literary standpoint - for they ought to be credible above all. They are not. They engage in their own ideas of the universe, and from their individual perspective, they make sense.And as a reader, I follow the changing rules of the fiction and the history of the time: and I find myself smiling at the cunning of the locked-away \"mad\" people, at the naive \"trust\" of spies, at the unlikely allegiance one feels with the random \"minor\" characters who walk London's streets with just the same amount of life and passion as the major players of the show. Being pregnant when your husband has been away in the war for years is a plot in itself, and the solutions to the problem may vary. Sometimes chance plays into your hands - while at other times, it plays against you. If it plays, that is.A story dominated by private beliefs and worries, it nonetheless uses the impressive backdrop of world war news to structure the plot and put the characters' issues into perspective:\"The headlines got that over for you in half a second, deciding for you every event's importance by the size of the print.\"Occasionally, the characters find themselves to be newsworthy - thus seeing themselves in touch with the bigger picture of which they are part, and to which they wear matching behaviours and attitudes, whether they like it or not. In the artistic composition of wartime London life, each shade has its own place in the slowly evolving painting, and each situation adds to the contrast and nuance of the whole.So what is it, then? This enigmatic, yet so outspoken and modern novel? What is it? \"Eloquently, she answered nothing whatever, not even looking up.\"The eloquent silence in the novel came in response to the eternal question:\"You love me?\"To which the reader answers:\"Yes.\""}, {"userName": "Violet wells", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/4196681-violet-wells", "userReview": "\"Out of mists of morning charred by the smoke from ruins each day rose to a height of unmisty glitter; between the last of sunset and first note of the siren the darkening glassy tenseness of evening was drawn fine. From the moment of waking you tasted the sweet autumn not less because of an acridity on the tongue and nostrils; and as the singed dust settled and smoke diluted you felt more and more called upon to observe the daytime as a pure and curious holiday from fear.\"Ostensibly The Heat of the Day is a spy novel, a wartime noir. In the first chapter Stella, the heroine, is told by a shady individual called Harrison that her lover, Robert, is selling secrets to the enemy. Harrison offers to withhold this information from his superiors if Stella agrees to become his lover. To begin with Stella is dubious. If what Robert does is performing an act for her then the implication is that his love too is part of the act. A surface cracks. The habitat of love in which Stella has lived comes to resemble the broken exposed bombed buildings littering London’s landscape. Bowen is brilliant at relating these inward crisis moments to the external world. Every description of place contains psychological insights into her characters. When, later, Stella visits Robert’s home she is horrified by the suffocating deceit of decorum she encounters in his mother and sister, a decorum that has already humiliated and unmanned Robert’s father. Robert calls his mother Muttikins. Enough said! The rot starts at home. Stella herself is involved in a deceit. She had deceived her son about his father. Contrary to popular belief it was not she who betrayed him but the other way round. When her husband died after betraying Stella for his nurse Stella decides to court the fiction that she was the femme fatale, perhaps for reasons of glamourising her self-image. Betrayal and deceit are ubiquitous tensions in this novel. The theme of deceit is taken up by another character, the orphaned and disingenuous Louie who is betraying her absent enlisted husband with a succession of casual affairs with men. She does this, paradoxically, to bring her husband closer. On a deeper level The Heat of the day is a novel about dispossession. About the precarious nature of any habitat, whether it’s a physical habitat like home or an emotional habitat like love. The novel begins in September 1942 when London is being bombed every night. Bowen evokes a landscape in which homes can vanish overnight. “Habit, of which passion must be wary, may all the same be the sweetest part of love.” Habit, dependent on habitat, is a vanishing luxury in this novel. Much of the novel takes place in homes. We have Stella’s flat which is borrowed, we have Robert’s family’s home which is for sale. We have the crumbling house in Ireland that Stella’s son inherits. We have the flat where Louie lives and from where her husband is poignantly absent. And we have the nursing home where cousin Nettie lives. Stella sees homes exposed as she rides the train: “It was striking how listlessly, shiftlessly and frankly life in these houses exposed itself to the eyes in the passing or halting trains.”Home it’s a precarious structure, both physically and emotionally. Bowen’s sentences in this novel are as rutted and rubbled as London’s wartime streets. Often cataracted with double and sometimes triple negatives – as if speech itself is hampered, battling against a relentless hostile tide. She plays with idioms too, grotesquely altering them – as if the lynchpins of civilised life are being hacked away. There’s a deliberate forsaking of fluidity in her prose. The last sentence implies the war is the swansong of an era of western civilisation, not an era Bowen seems to approve of. Bowen actually wrote this novel during the war and, unlike WW2 novels written later, isn’t trying to impress with the depth of her research. It’s a consideration she is able to ignore because the world she is describing is outside her window. The odd thing is, because we’re so familiar with the way London during the blitz has been portrayed (stagemanaged?) by popular media, Bowen’s depiction can at times be bizzarely less convincing.It should be pointed out that this is not a work of realism. Robert’s adherence to the Nazis is barely credible as a concrete possibility. Many have wondered, with justification, if Bowen should have had him siding with the Russians. Bowen after all was familiar with Burgess and the Cambridge spies. However this implausible detail doesn’t detract from the novel’s psychological power. It’s not her best novel – I’d award that plaudit to Death of the Heart – but is well worth reading."}, {"userName": "Roman Clodia", "userReviewDate": "Jun 25, 2016", "userURL": "http://www.goodreads.com/user/show/56111743-roman-clodia", "userReview": "This is a brittle, opaque story of a strange kind of `love triangle' set in the dark glamour of war-time London. The (melo)dramatic plot is contained and constrained within a quiet, very restrained sense of telling so that the narrative seems to be in tension with itself.There is a muted intensity to all personal interactions, and this is the kind of book where we need to pay attention to every word spoken, to every tiny gesture made, to almost decode the currents between people.If you come to this book expecting either a war-time romance, or a spy story then you will inevitably be disappointed. So much of this book is obscure, based around things not said, actions not taken, deeds which don't happen, and the book is haunted by ghosts: not just the dead, but the bombed churches which cannot ring their bells, and the dead souls of the living.London is familiar and yet also alien, and many of the characters are portrayed in a similar way. So this is an odd book in lots of ways which keeps us feeling somehow just a little off-kilter - but it builds up into a strange, almost dreamy, mysterious and peculiarly haunting read."}, {"userName": "Susan", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "Published in 1948, this is famous as Elizabeth Bowen’s ‘war novel.’ Written during the war, Bowen does not need to get her historical details correct, as she is living them. As such, this is truly representative of London in wartime; unsettled, damaged, dangerous. When Stella Rodney travels to Ireland to visit the country house her son, Roderick, has been left by Cousin Francis, she delights in the lights spilling from the windows. You do feel the darkness of the city – whether the characters are using a torch to find their car, parked outside a station, stumbling around the city streets, or constantly dealing with the blackout, this is very much wartime London.During the war, Bowen herself was having an affair with Charles Ritchie, a Canadian diplomat. In the same way as London is dark and dangerous, it also suddenly opens up unknown, exciting possibilities. While the main character, Stella, is embroiled in an affair with Robert, a young woman, Louie, also feels suddenly single, with her husband fighting abroad. It is as though ‘real life,’ has stopped and opportunities present themselves which, normally, would be impossible. Stability is crumbling, along with the buildings, and loneliness rejected for a chance of anonymous romance, as lives are transformed.In this world of instability comes Harrison; an unsettling presence into Stella’s life. He first appears at the funeral of Cousin Francis, but later re-emerges to cast doubts about Robert, who he accuses of being a spy. It would be wrong, though, to suggest this is a spy novel. Rather than a fast moving thriller, Stella, like so many people who are confronted with news they do not wish to hear about, literally does nothing about it at first. She thinks, she wonders, she ponders, but she fends off Robert’s blackmail threats and prevaricates – unable to totally reject her lover.There is humour, in Robert’s bizarre family and the widow of Cousin Francis, who is visited by Roderick. However, with Bowen, plots – such as they are – unfold slowly. She is an author that you will either love, or find a little slow. Personally, I have always loved her writing. This is not my favourite, but it is beautifully representative of her writing and her life. If you are interested in the lives of authors in wartime London, you might enjoy, “The Love Charm of Bombs,” by Laura Feigel, which looks at Elizabeth Bowen, Graham Greene, Rose Macaulay, Hilde Spiel and Henry Yorke (writing as Henry Green), who lived in London during WWII."}, {"userName": "Roger Brunyate", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/42294189-roger-brunyate", "userReview": "TotalityI first read and reviewed Elizabeth Bowen's novel of the Second World War in 2007, and did not especially like it. A few days ago, however, I finished The Love-charm of Bombs, Lara Feigel's study of five novelists in the London Blitz, and was struck by how all her best quotations seemed to come from Bowen. Looking back at the novel now, I see that Feigel might as well not have bothered writing her book; the first eight pages of Bowen's fifth chapter says more about war, death, and love than a hundred in the Feigel. It is not just her physical descriptions of bomb-torn London that are superb (From the moment of waking you tasted the sweet autumn not less because of an acridity on the tongue and nostrils), but her psychology, whether talking about the dead:\nMost of all the dead, from mortuaries, from under cataracts of rubble, made their anonymous presence—not as today's dead but as yesterday's living—felt through London. Uncounted, they continued to move in shoals through the city day, pervading everything to be seen or heard or felt with their torn-off senses, drawing on this tomorrow they had expected—for death cannot be so sudden as all that.\n—or the living:\nThe very temper of pleasures lay in their chanciness, in the canvaslike impermanence of their settings, in their being off-time—to and fro between bars and grills, clubs and each other's places moved the little shoal through the noisy nights. Faces came and went. There was a diffused gallantry in the atmosphere, an unmarriedness: it came to be rumored that everybody in London was in love.\nStella Rodney, Bowen's protagonist, a divorced woman approaching 40, is certainly in love, and has been for the past two years. She met Robert Kelway, a veteran of Dunkirk now working at the War Office, at the beginning of the bombing in 1940; it is now 1942. I was struck, though, by how long Bowen takes to introduce us to Kelway. Like Graham Greene would do in his own great wartime romance novel, The End of the Affair, published three years after Bowen's in 1951, she begins when the relationship is already under threat: Stella gets a visit from a mysterious man called Harrison who tells her that Robert is a spy, but appears to be willing to trade Stella's love for his silence. It is not just a matter of structure: Harrison is a quintessential Greene character, and the topic of spy and counterspy is Greene's bread and butter—but it sits uneasily on Bowen's table.At my first reading, I was greatly influenced by the quotation from The Atlantic Monthly printed prominently on the gorgeous front cover: \"Imagine a Graham Greene thriller projected through the sensibility of Virginia Woolf.\" I found myself concentrating on the first part of this comparison, largely due to the apparent similarity of subject-matter, But the thriller aspect of Bowen's novel simply does not work: the many episodes featuring other characters dilute the tension, and the climax is more psychological than physical. This time, inspired by a new respect for Bowen gained from reading the Feigel, I came to the novel with the assumption that Bowen knew exactly what she was doing; if she did not succeed in writing a Graham Greene thriller, it was simply because she had no intention of doing so. The Virginia Woolf comparison, though, is a good one; in this light, the book shines triumphantly.It can't only have been the London setting that made me think of Mrs Dalloway, although Bowen's descriptions of that city are eminently worthy of Woolf. The opening chapter, for example, describing an open-air concert in Regent's Park is enthralling in its eye for detail and ear for the cadence of the English language. Bowen can do this equally well with an underground after-hours club, or the back yards of houses seen from a crawling train, and she makes a point of including lower- or lower-middle class characters (though not with equal success). The impression I take away is exactly the same as with Mrs Dalloway—of the totality of life: of all the lives being led at the same time in this wartime city; of an individual's life being defined not merely by its peak moments but through childhood, family, friends, and future; even the private country that lovers inhabit in their togetherness is both out of the world and in it. They were not alone, nor had they been from the start, from the start of love, writes Bowen when Stella and Robert sit down to a late supper; their time sat in the third place at their table. Near the end of the novel, Stella thinks back on their love, in a passage that makes me think of Woolf or the ending of James Joyce's story \"The Dead,\" and that is the very essence of totality:\nShe had trodden every inch of the country with him, not perhaps least when she was alone. Of that country, she did not know how much was place, how much was time. She thought of leaves of autumn crisply being swept up, that crystal ruined London morning when she had woken to his face; she saw street after street facing into evening after evening, the sheen of spring light running on the water towards the bridges on which one stood, the vulnerable eyes of Louie stupidly carrying sky about in them, the raw earth lip of Cousin Francis's grave and the pink-stamened flowers of that day alight on the chestnuts in May gloom, the asphalt pathway near Roderick's camp thrust up and cracked by the swell of ground, mapped by seeded grass…."}, {"userName": "Bruce", "userReviewDate": "Sep 28, 2010", "userURL": "http://www.goodreads.com/user/show/1207684-bruce", "userReview": "Bowen plunges us into the midst of intrigue, suspicion, awkward and uncomfortable relationships and conversations, furtiveness, as she reveals London in 1942, people dislocated by the war, mystery abounding, suggestions of espionage and the tensions of unwelcome demands and divided loyalties. Her descriptions of place and ambiance are acute, and her psychological insights and portrayals are subtle, emotions washing across personalities like ripples over water, nuanced and fascinating.By the end of the first third of the book, Stella and Robert are coming into focus, more as persons in the present than as people with histories. Harrison remains enigmatic, ominous, a figure of unease. Life in England during the war, both in London and in the countryside, becomes clearer, and the issue of class is always apparent. And then there is Louie Lewis who enters the story only occasionally. Who is she, and what is her role? Is she simply a banal counterpoint to the rest of the story? She does in fact precipitate a change in the relationship between Stella and Harrison. Most of all, perhaps, it is her very inarticulateness that highlights the fundamental barriers that language creates between people, even the most articulate. Always there is a gap, a chasm across which language falls and fails. Always we are left alone, trapped by and within ourselves and the stories we tell ourselves. And yet, in a curious way, Louie is important, for it is she who brackets the entire novel, which opens and closes with her.Is this less a story of espionage than it is a story that uses this as a background for the exploration of the subtleties and currents of human interactions and relationships? Harrison, shadowing and cryptic as ever, assumes more importance as the story develops, but he remains always enigmatic. Bowen writes beautifully. Over and over again, one finds oneself reading and reading her crystalline prose:“Habit, of which passion must be wary, may all the same be the sweetest part of love.”“There is no such thing as being alone together. Daylight moves round the wall; night rings the changes of its intensity; everything is on its way to somewhere else - there is the presence of movement, the third presence, however still, however unheeding in their trance two may try to stay. Unceasingly something is at its work. Even, each beat of the other beloved heart is one beat nearer the destination, unknowable, towards which that heart is beating its way; under what compulsion, what? - to love is therefore to be unescapably conscious of the question. To have turned away from everything to one face is to find oneself face to face with everything.”“Art is the only thing can go on mattering once it has stopped hurting.”"}, {"userName": "Diane ", "userReviewDate": "Dec 20, 2010", "userURL": "http://www.goodreads.com/user/show/143168-diane", "userReview": "This book had the potential to be a 4 star read for me, yet I found the writing SO laborious and detailed, that I was wavering between 2 and 3 stars. To be totally honest, 2 stars won out.That said, the premise of the story is wonderful on many layers. We have love, loss, intense wartime drama set in London in the 1940's, mystery, intrigue, espionage, and about a dozen very interesting and different characters. The beginning pages grabbed me immediately as the author wrote of an outdoor concert with a Viennese orchestra playing. We first meet a mysterious character, Harrison, and a fun-loving woman named Louie. Harrison is very preoccupied as he's set to meet another woman, Stella, to tell her that her lover, Robert, is selling secrets to the enemy. From there, the book delves primarily into the lives of Stella; her son, Roderick; Robert; and Louie, but Harrison's past remains a mystery. Throughout the entire book, I was never sure of anyone's integrity or certain how the book would finally end. Even when something had taken place, I was never sure that it really happened. For that, I give it high marks for mystery and intrigue. But, unfortunately, the dense writing made it fall very short of the mark for me.The books that I read give my thoughts on the writing style some credence, IMO. I'm very glad I got through it, and give thanks to one of my GR friends, Susan, for that since we did it as a joint read. If the book got into the hands of a really good editor, I'm sure I would have enjoyed it much more."}, {"userName": "Cecily", "userReviewDate": "May 30, 2008", "userURL": "http://www.goodreads.com/user/show/1199525-cecily", "userReview": "Wartime London, hints of espionage and with lots of references to spirits and ghosts, albeit most often in a metaphorical sense. Buildings are also very significant: Stella's flat (which she changes when her life changes), Wistaria Lodge (odd care home), Mount Morris (Irish inheritance), Holme Dene (Robert's family home - to sell or not). Quite episodic: some chapters and characters quite separate from the main narrative, but Bowen's wonderful use of language shines though."}, {"userName": "Joselito Honestly and Brilliantly", "userReviewDate": "Aug 26, 2012", "userURL": "http://www.goodreads.com/user/show/2190636-joselito-honestly-and-brilliantly", "userReview": "I haven't read that book which says in its very title that men are from Mars and women are from Venus. From somewhere, however, I had learned its basic premise: that the differences between men and women are so vast that it would seem that they are creatures from different planets.I am a married man and it is not infrequent that my wife would, say, raise a howl of violent exasperation about something I did which I find completely normal and ordinary. On the other hand, I never cease to wonder how she, after talking with or meeting someone, would have an inexplicable change of mood for something which, on the surface of the previous conversation or meeting, simply doesn't deserve any such reaction. If the premise is true that men and women are from different planets, I imagine women with antennae like cockroaches, going hither and thither as they interact with people, picking up hidden signals which men simply have no way of perceiving. Then her mood will be dictated by these hidden signals and this could be a problem when she's with her man because the latter is not equipped with a similar set of antennae capable of picking up such invisible waves. Or maybe forget about cockroaches. Think of men and women as two sets of armies, one equipped with a powerful radar system and the other does not have any. So while the women (with the radar) are already panicking because enemy planes, as seen from their radar, are coming, the others (the men) are still asleep in their barracks, hearing nothing unusual, their lookouts seeing nothing but the clear, glorious, early morning sky.\"The Heat of the Day\" was written by one such antennaed creature from Venus with her radar in full blast (is it relevant to say here, as mentioned in the brief introductory bio of the book itself, that she outlived her husband by 21 years? Is this strange sensitivity of women, and the difficulty of coping with this, the reason why there are more widows than widowers?). A love story in the backdrop of world war two London, complete with mystery, espionage and a love triangle, the reader (especially, I imagine, those like me from Mars) would be distracted from following the plot by massive introspective digressions which seemingly come from nowhere and everywhere, as well as those highflown dialogues which make it sound as if the characters are communicating wordlessly through their minds, like aliens from outer space, and not verbalizing them through their mouths.Like this scene (among the many examples I can give!) where the principal female protagonist named Stella(Victor's widow, now Robert's lover, has a son--Roderick--in the British army) had just been brought to a bar by a friend who now leaves. She then turns briefly away to wave goodbye to her friend. THAT brief act of turning away and waving goodbye to her departing friend was enough for Elizabeth Bowen to go into this:\"That gesture of good-bye, so perfunctory, was a finalness not to appear till later. It comprehended the room and everybody, everything in it which had up to now counted as her life: it was an unconscious announcement of the departure she was about to take--a first and last wave, across widening water, from a liner. Remembered, her fleeting sketch of a gesture came to look prophetic; for ever she was to see, photographed as though it had been someone else's, her hand up. The bracelet slipping down and sleeve falling back, against a dissolving background of lights and faces, were vestiges, and the last, of her solidity.\"I don't know if this has a sequel, but in this book I do not remember Stella having such a dramatic departure from a liner across widening water. Now, in this other scene, Stella is with the other guy, Harrison, inside her apartment. She tells him to get her a glass of milk. Harrison briefly leaves the room and goes to the other room where the milk is. Elizabeth Bowen then ambushes her reader with this:\"Left like this in the room with the empty chairs, she took the opportunity to breathe. Harrison became nothing more than a person she had for the moment succeeded in getting rid of. She looked from the armchair proper to Robert to the armchair commandeered by Harrison, but found herself thinking of neither of these--of, rather, Victor, her vanished husband. Why Victor of now? One could only suppose that the apparently forgotten beginning of any story was unforgettable; perpetually one was subject to the sense of there having had to be a beginning SOMEWHERE. Like the lost first sheet of a letter or missing first pages of a book, the beginning kept on suggesting what must have been its nature. One never was out of reach of the power of what had been written first. Call it what you liked, call it a miscarried love, it imparted, or was always ready and liable to impart, the nature of an alternative, attempted recovery or enforced second start to whatever followed. The beginning, in which was conceived the end, could not but continue to shape the middle part of the story, so that none of the realizations along that course were what had been expected, quite whole, quite final. That first path, taken to be a false start--who was to know, after all, where it might not have led? She saw, for an instant, Roderick's father's face, its look suspended and non-committal. In this room, in which love in the person of Robert had been so living, this former face had not shown itself till tonight--now, she was penetrated not only by as it were first awareness of Victor's death but by worse, by the knowledge of his having been corrupted before death by undoings and denials of all love. She had had it in her to have been an honest woman and borne more children; she had been capable of more virtue than the succeeding years had left her able to show. Her young marriage had not been an experiment; it is the young who cannot afford to experiment--everything is at stake. The time of her marriage had been a time after war; her own desire to find herself in some embrace from life had been universal, at work in the world, the time whose creature she was. For a deception, she could no more blame the world than one can blame any fellow-sufferer: in these last twenty of its and her own years she had to watch in it what she felt in her--a clear-sightedly helpless progress towards disaster. The fateful course of her fatalistic century seemed more and more her own: together had she and it arrived at the testing extremities of their noonday. Neither had lived before...\"Now, how many minutes would transpire before someone would finish thinking of these or--to the reader--reading them AND comprehending what they say? Certainly longer than the few seconds it'll take for Harrison to get the milk in the adjoining room. Yet it was only after all the above that Harrison reappeared with the glass of milk and even this reappearance reminded Stella, this time, of \"her own extremity (that) was in this being bargained for.\"Force me to read novels like this for six months and by the end of that time I imagine I'll be ready to die by my own hand. Let's see now how Elizabeth Bowen imagines her characters talking. Here is the scene where Robert, Stella's lover, finally admits to her that he's working/spying for the enemy (the Germans). I'm rewriting the dialogue like that in a play to highlight the exchanges and so you can judge for yourself if people in planet earth really talk like this in real life and in real time:Stella: \"...Were you never frightened?\"Robert: \"Of getting caught?\"Stella: \"I meant, of what you've been doing?\"Robert: \" I?--no, the opposite: it utterly undid fear. It bred my father out of me, gave me a new heredity. I went slow at first--it was stupefying to be beginning to know what confidence could be. To know what I knew, to keep my knowing unknown, unknown all the time to be acting on it--I tell you, everything fell into place around me. Something of my own?--No, no, much better than that: any neurotic can make himself his corner. The way out?--no, better than that: the way on! You think, in me this was simply wanting to get my hand on the controls?\"Stella: \" I don't think I think.\"Robert: \"Well, it's not; it's not a question of that. Who wants to monkey about? To feel control is enough. It's a very much bigger thing to be under orders.\"Stella: \"We are all under orders; what is there new in that?\"Robert: \"Yes, can you wonder they love war. But I don't mean orders, I mean order.\"Stella: \"So you are with the enemy.\"Robert: \"Naturally they're the enemy; they're facing us with what has got to be the conclusion. They won't last, but it will.\"Stella: \"I can't believe you.\"Robert: \"You could.\"Stella: \"It's not just that they're the enemy, but they're horrible--specious, unthinkable, grotesque.\"Robert: \"Oh, THEY--evidently! But you judge it by them. And in birth, remember, anything is grotesque.\"Stella: \"They're afraid, too.\"Robert: \"Of course: they have started something. You may not like it, but it's the beginning of a day. A day on our scale.\"And her is Stella asking Robert why he had sided with the enemy and the latter giving his reasons:Stella: \"What is it you are, then, a revolutionary? No, counter-revolutionary? You think revolutions are coming down in the world? Once, they used to seem an advance, each time--you think NOT that, any more, now? After each, first the loss of what had been gained, then the loss of more? So that now revolution coming could only be the greatest convulsion so far, with the least meaning of all? Yet nobody can rid themselves of the idea that SOMETHING'S coming. What is this present state of the world, then--a false pregnancy?Robert: \"No.\"Stella: \"No, I see you couldn't think that, or you wouldn't have...You know, Robert, for anybody DOING anything so definite, you talk vaguely. Wildness and images. That may have been my bringing my feeling in. But to me it's as though there still were something you'd never formulated.\"Robert: \"This is the first time I've ever talked.\"Stella: \"Never talked to the others--the others you're in this with?\"Robert: \"You imagine we meet to swap ideas?\"Stella: \"But then in that case, all the more you've thought.\"Robert: \"All the more I've thought. More and more the outcome of thinking because you never can talk is never to talk. The thing isolating you isolates itself. It sets up a tension you hope may somehow break itself, but that you can't break. You don't know where thought began; it goes round in circles. TALK has got to begin--where? How am I to know how to talk, after so much thought? Any first time, is one much good? Unformulated--what was?\"Stella: \"I don't know. Or perhaps, missing?\"Robert: \"How am I to know what's missing in my own thought? I'm committed to it. What did you want, then--brass tacks?\"Stella: \"Though they are always something. You are out for the enemy to win because you think they have something? What?\"Robert: \"They have something. This war's just too much bloody quibbling about some thing that's predecided itself. Either side's winning would stop the war; only their side's winning would stop the quibbling. I want to cackle cut--Well, what have I still not said?\"Stella: \"I still don't know. Never mind.\"And neither do I know yet. I say, too: Never mind! Only after I've stopped reading that these characters stopped their quibbling!"}, {"userName": "Charlotte", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/77915-charlotte", "userReview": "An exhausting psychological thriller. I think I still love Elizabeth Bowen; I did love the descriptions in this book, again, but I wish I had liked Stella a little bit more? Scenes with Ernestine and Muttikins hilariously sad. Think I need a break after 3 Bowens more or less in a row, but I'll go back."}, {"userName": "Margaret", "userReviewDate": "Dec 14, 2009", "userURL": "http://www.goodreads.com/user/show/162759-margaret", "userReview": "I found this a difficult but engrossing book. I read in snatched dribs and drabs throughout the day, and it was so hard to dip into and then out of the book that I ended up reading it only at night, when I could sink deeply into it. The story of a love affair in London during World War II, Bowen's narrative is full of slow, contemplative passages rich with sensuous, vivid detail about the world about us, touching on all the senses, like this passage from the first chapter:\"In this state, drugged by the rainy dusk, she almost always returned with sensual closeness to seaside childhood; once more she felt her heels in the pudding-softness of the hot tarred esplanade or her bare arm up to the elbow in rain-wet tamarisk. She smelt the shingle and heard it being sucked by the sea.\"It's gorgeous stuff, but definitely a challenge to get into, though deeply rewarding. I particularly loved the description in Chapter Five of wartime London (especially as the setting is what caused me to want to read the book). Don't expect an easy read, but do expect a compelling one, if you can take the time to submerge yourself."}, {"userName": "Chris", "userReviewDate": "Dec 21, 2009", "userURL": "http://www.goodreads.com/user/show/1605591-chris", "userReview": "I haven't read anything by Bowen before, and I picked this up for two reasons. The first is that I read some criticism by A.S. Byattabout it, and the second, someone put it in the free book pile at work. (I love those piles).I'm not sure how I feel about this book. I can see why Byatt enjoyed it. Bowen is very similar to Byatt and Iris Murdoch in style. Her prose is deep; you have to penetrate it. You need scuba gear in away. This makes the prose rewarding.But the book is also maddening because for the longest time the two stories are not very connected. Louie who the reader meets first disappers for a long amount of time. Additionally because the prose is deep, the reader must dig. This is not a bad thing. It is good when writers challenge thier readers."}, {"userName": "Nicole", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/25128624-nicole", "userReview": "This is my second Elizabeth Bowen, and I really find myself liking her books very much.In this one, the thing I found most striking and successful was the way certain minor characters were portrayed. You find you know quite a lot about them, especially their faults and oddities, not through direct descritpion, but through their own words, and even this very quickly and economically. I'm thinking of Louie's friend Connie, of cousin Nettie, and particularly Richard's mother and sister. There is one exchange about whether or not to sell the house which tells you everything you need to know about their failings as people, and Richard's family life growing up; more, really, than the actual description of Richard's family life growning up.More people should read her."}, {"userName": "Justin Evans", "userReviewDate": "Sep 13, 2009", "userURL": "http://www.goodreads.com/user/show/2184529-justin-evans", "userReview": "One of the best books I've read this year, hands down. It's beautifully structured, and gorgeously written- not an easy read by any means, but not quite a Jamesian labyrinth either. I can't really describe it, but the book is wise, and every other good adjective you can think of. \"There was nobody to admire: there *was* no alternative. No unextinguished watch-light remained, after all, burning in any window, however far away. In hopes of what, then, was one led on, led on? How long, looking back on it, it had lasted - that dogged, timid, unfaithfully-followed hope!\" This is probably the perfect antidote to all the flag-waving and hurrahing and so on that surrounds the second world war, and maybe even our own petty little political squabbles."}, {"userName": "Mark", "userReviewDate": "Nov 07, 2013", "userURL": "http://www.goodreads.com/user/show/3174843-mark", "userReview": "I think the posts on this book are the best I have read since I joined 'goodreads' and for me Chapter Five remains the best prose I have read as an evocation of that dangerous time of fractured lives, random love and smouldering passion amongst the ruins of London at the time of the Blitz. Tense, suffocating and foreboding, now I have a vivid sense of the very essence of my Mother who indeed lived and loved, and mourned, in war torn London.Readers are drawn to the central theme but the lovers remain other worldly and difficult to fathom. The writing is dense and turgid at times, and some of the tangential threads are tedious to follow, but when she writes about the immediacy of life in wartime London, the vibrancy of the bombed out streets strewn with rubble and the dislocated lives of people eking out their daily existence in restaurants and cafes knowing that another night of fear awaits, she recaptures the random nature of survival. Her writing is evocative of a dangerously exciting frisson where life was in the balance and people were infused with an urgency which removed inhibitions, brought down barriers, and moved boundaries redefining what was acceptable in a time of laissez faire.In the context of its time, it was certainly a shocking novel. But I have re-read the book, in conjunction with the excellent chapters on Elizabeth Bowen in Lara Fiegel’s ‘The Love Charm of Bombs’ where the biographical details show that by time of the publication of “Heat of the Day” in 1949 the author had lived in what we might call ‘an open marriage’ - twenty five years of passionless marriage never consummated with her husband, and when she took her first lover, aged 34, she was still a virgin ! Why did I find this relevant ? Because I think the novel is, partly, written to exonerate those women who found wartime separation from husbands and boyfriends, too difficult to endure and so took lovers to ease their loneliness. Louie and Stella, and later Connie, all seem very ‘modern’ in their manner and behaviour enjoying free and easy sexual relationships, showing what life was like for women suddenly abandoned and alone in London during wartime.It is a novel that explores the disconnect between people once war had slackened the controls governing the ways that men and women behaved towards one another, in public and private. Louie’s husband writes from India asks his young bride “if she was being a good girl” knowing that she is a flighty sort and unlikely to rein in her natural friendly nature, speaking to strangers, as she does in Regents Park in 1942, as the opening scene in the novel. Bowen is laying down a marker regarding the break up of marriages and shows how easily misinformed and scandalous versions of events quickly became accepted truths. It takes Colonel Pole, meeting Stella for the first time at the family funeral, to appreciate that she is blameless and not the wronged woman, not the ‘femme fatale’ that Victor’s grieving family had decided upon. Then later, Louie in reading the story of the inquest of Robert Kelway in the press, discovers that her new acquaintance, Stella, was ‘not virtuous.’ Louie muses, possibly seeking justifyication for new own behaviour, “ Virtue became less possible now it was shown impossible by Stella.”Chapter Five remains the best prose I have read as an evocation of that dangerous time of fractured lives and random love amongst the ruins, and now I have a more vivid sense of the very essence of my Mother who indeed lived and loved in war torn London."}, {"userName": "J A", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/11961967-j-a", "userReview": "A difficult novel in scope and style, but infinitely intelligent: part spy novel, part thriller, part failed romance -- although primarily a noir. The opening chapters are appropriately uncomfortable and stifling, as agent Harrison makes clear to Stella that her partner Robert has been involved in double dealings with the enemy, and that therefore all that remains is for them to work out a solution. From there, the novel expands to include flashbacks, other subplots and an expansive family context. Although sometimes it feels slightly bloated by descriptions and philosophical musings, it culminates in a highly satisfying ending."}, {"userName": "Bettie☯", "userReviewDate": "Oct 29, 2011", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Bettie's Books"}, {"userName": "Ali", "userReviewDate": "Feb 26, 2012", "userURL": "http://www.goodreads.com/user/show/804942-ali", "userReview": "This is the first Elizabeth Bowen I have read for many many years. I have a memory of having read ‘The Death of the Heart’ and recently decided I may have read A House in Paris – as I realised after seeing another review that the novel sounded very familiar to me. However I have no actual memory of actually reading either book.I wasn’t sure how I would get along with this book as I know some people consider Elizabeth Bowen to be hard work. I certainly don’t think she is easy – and this book was no quick read – but it was certainly worth the effort.Set in 1942 The Heat of the day primarily concerns Stella, her lover Robert and the shadowy Harrison. Harrison informs Stella that Robert is a spy – a traitor to his country. Harrison will keep Robert’s betrayal to himself if Stella becomes his lover and rids herself of Robert. However there is much more to the story than that. At the start of the novel we see Harrison attending an outdoor concert in a park on a Sunday afternoon – he is forced into conversation by Louie a woman who is instantly interested in Harrison – despite being a married woman – Harrison contemplating a meeting with Stella is not interested in her. Later we meet Louie again, and Connie her friend and neighbour. Robert Kelway a few years younger than Stella has an eccentric family in the country, living in a house that has been on the market for years - Robert and his sister call their mother Muttikins. Meanwhile Roderick, Stella’s 22 year old son has inherited a house in Ireland where Stella when newly married had spent some time but where neither has been since. As the war heats up, Stella’s world begins to slowly crumble around her – she has no idea whether to believe Harrison, she is in love with Robert – but Harrison says he could hurt the people who she loves. I thought the writing of this novel is simply superb – the sentence construction is often complex but the resulting prose is brilliant and was often a complete joy to read. This isn’t a heavily plot driven novel, Harrison is a creepy kind of character – subtly drawn and horribly compelling, yet for me he wasn’t a completely malevolent character, showing maybe that people are not necessarily all bad or all good – but much more complex than that. His threats too, are quite subtle –much is implied. Each character is well drawn – their motivations are understood instantly. I will be looking to read more Elizabeth Bowen, maybe acquire and re-read the book(s) I think I read before but can’t remember."}, {"userName": "Peggy", "userReviewDate": "Nov 22, 2012", "userURL": "http://www.goodreads.com/user/show/2272233-peggy", "userReview": "Like most of the reviewers here, I found the book densely written and perplexing. The characters are as complex and believable as any in literature. We don't know enough about them to fully grasp their motivations, even after they try to explain themselves through dialogue with another character. Neither the reader nor the other character in such a scene will get it, though.My favorite characters, Stella and Robert, play at the edges of each other and exist in superficial relationship, perfect for a war-time romance, in which anything can happen to anybody on any day. But when all artifice is stripped away and the lovers know the truth of each other, and some terrible choice must be made, then there is real feeling and passion. That moment seemed to me to be the center of the book.As for the aftermath of the decision made, Bowen spares us all sentiment and predictability. There's nothing familiar to use as a toe hold for understanding these characters. We face puzzles over and over again.Stella as a character is intelligent and loyal. Her adult identity was forged from a lie, one that could be considered to have stained her character and prevented her from having security and respectability. It makes sense that she would find nothing so off-putting about having a lover who is hiding great secrets.The book deserves to be read twice in order to pick up all its clues and understand it better. The only problem with that is that it was not an enjoyable read. Taking a second go at it might be gratifying, but one I'm inclined to pass, because there is so much more reading that awaits. Instead, I'm going to look for secondary sources about it in order to make better sense of what I just read."}, {"userName": "Gail", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/9247117-gail", "userReview": "This is a book very much of it's time and as such I found the language dense and at times difficult to penetrate. Bowen painted a picture of a tense, war time London where everyone mistrusted everyone else. The conversations were fractured and oblique and I found the characters difficult to invest emotionally in. Some of her descriptive prose at times was quite beautiful and touching but at other times I struggled to understand what was happening and if anything was true. It has left me with lots of questions but this isn't necessarily a bad thing!"}, {"userName": "Nicole", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/10369370-nicole", "userReview": "Irish author Elizabeth Bowen is the best writer you’ve never heard of. Her writing is mind-blowing. There is not a word out of place, and the layers of meaning are as densely packed as poetry. This is one of those books you want to flip over and reread as soon as you finish it - there is so much there, it’s impossible to absorb it all in one go; I felt like I got maybe 80%. I do feel like “The Heat of the Day” might’ve been a title foisted on her by her publishers. It should be called something more like “The Unbearable Heaviness of Being”, as it grapples - primarily through internal monologues rendered in Bowen’s unique cadence - with a fundamental question of human existence: how to be. Set amid the Second World War in London, it is on the surface a spy novel. But it is so much more than that. Truly unforgettable. Her books (written in the 20s, 30s, and 40s) are practically out of print. Go out and buy them right now. All of them."}, {"userName": "John", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/5916879-john", "userReview": "Challenging read, but insightful, with some absolutely amazing prose. The story and characters lingered with me."}, {"userName": "Sy", "userReviewDate": "Sep 15, 2014", "userURL": "http://www.goodreads.com/user/show/7792806-sy", "userReview": "A little strange to grasp in the beginning due to Bowen's writing style (double negatives all over) but once you're in you're in. Had to speed read the last few chapters for the week (we were given two weeks to read it for class but essays and editing took over my life) but I loved it. I had started the book back in November, but I gave up as I had to read a lot of other titles for lectures. It's a brilliant story that makes you question war, politics and relationships. It also makes you question which characters you should trust and which ones you shouldn't. As far as history is concerned, its focus is on the lives of particular characters set during WWII. Themes are also challenged in this book, which reflect the mindset of society at the time - women do the things men can? Whoa! Truly amazing. I haven't read other Bowen books as of yet, but I intend to."}, {"userName": "Jesi", "userReviewDate": "Apr 06, 2015", "userURL": "http://www.goodreads.com/user/show/219845-jesi", "userReview": "I feel like I have personally triumphed over this book. Oh Bowen, when you are good, you are so very good, but when you are bad, you are awful."}, {"userName": "Kelly", "userReviewDate": "Nov 10, 2013", "userURL": "http://www.goodreads.com/user/show/94602-kelly", "userReview": "This was my third Elizabeth Bowen venture and I quite enjoyed it. You can read my review of this one here: http://agiddything.booklikes.com/post..."}, {"userName": "Susan", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/267156-susan", "userReview": "The affairs of two women, Stella and Louie, parallel and sometimes intersect each other in WWII London. The author excels in portraying a wartime atmosphere of doubt, uncertainty and conflicted loyalties, but the realistic atmosphere and characters didn’t mesh well with the spy thriller elements of the plot. Louie’s story was apparently intended as a counterpoint to Stella’s, but the character was not as well developed and doesn’t appear consistently so I only realized her importance at the end. For this reader, the story dragged at times, but the book came alive with every entrance of a minor character, Roderick, Stella’s son, with his young enthusiasm, naïveté and flashes of wisdom."}, {"userName": "Lisa", "userReviewDate": "Dec 27, 2010", "userURL": "http://www.goodreads.com/user/show/1758411-lisa", "userReview": "There are six novels by Elizabeth Bowen listed in the 2006 edition of 1001 Books You Must Read Before You Die. a distinction awarded to no other woman writer of the 20th century except for Iris Murdoch and Virginia Woolf (and not too many men either). Bowen’s listed novels are, in order of publication•The Last September (1929);•To the North (1932); •The House in Paris (1935);•The Heat of the Day (1949);•A World of Love (1955); and•Eva Trout (1968) (This one was nominated for the Booker in 1970, but it baffled me when I read it in 2005 which put me off Bowen a bit. I see now that 1001 Books calls it ‘elusive’ and ‘adrift from the shores of fictional realism’ so perhaps I was not alone).But even though it is written in a modernist style, The Heat of the Day is only too realistic. It is Elizabeth Bowen’s most celebrated novel and it’s brilliant. As the introduction by Roy Foster tells us, it was written even as the bombs were still falling in 1944 with completed chapters sent out of London for safe-keeping. The sense of impending catastrophe includes fearing on top of everything else that the hard-won pages of a novel might not survive the next torrent of bombs. My parents lived through that insecurity, my father having been bombed out of his London home when he was a child. Amongst all the losses – of friends, colleagues and loved ones; of family homes, cherished institutions and historic buildings; and of irreplaceable cultural artefacts – a half-finished novel might not seem so important to some, and yet if these chapters had been lost to the doodlebugs of 1944, (after the Allied Landings), a great novel would have been lost…The Heat of the Day begins with an image that is arresting for those of us reading it decades later. It is of an outdoor concert in wartime London in September 1942 when war had made them idolize day and summer; night and autumn were enemies. The worst of the Blitz is over by 1942, but the Blackout is still in force and the war is far from over even though turning points of the war occur during the two years of the novel. The audience at the concert are stoic, but for many to be sitting packed among other people was better than walking about alone. The novel is imbued with this sense of life on the edge; of mourning for the lost, of evil just 22km away across the channel in France, and of the ever-present likelihood of imminent death or loss of loved ones. Even in 1942 the air the characters breathe is dusty with the aftermath of the Blitz.The concert in the park is also notable for something else. It is attended by ‘all sorts’, not the rarefied crowds one might expect at a Covent Garden concert. Among the exiled foreigners – refugees and Czech soldiers, some of whom were so intimate with the music you could feel them anticipate every note – there are shabby Londoners. Factory-worker Louie Lewis is there in her imitation camel-hair coat, her work-roughened hands and her never-depilated bare legs. Her presence at this concert signals a further shift in the cultural and social superiority of the English upper class, and her subsequent naïve reaction to meeting, and being impressed by the ‘refined’ Stella Rodney is challenged by events later on in the novel.To read the rest of my review please visit http://anzlitlovers.com/2016/03/12/th..."}, {"userName": "Emmkay", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/7135572-emmkay", "userReview": "They had met one another, at first not very often, throughout that heady autumn of the first London air raids. Never had any season been more felt; one bought the poetic sense of it with the sense of death.\n…But they were not alone, nor had they been from the start, from the start of love. Their time sat in the third place at their table. They were creatures of history, whose coming together was of a nature possible in no other day - the day was inherent in the nature. Which must have been always true of lovers, if it had taken till now to be seen. The relation of people to one another is subject to the relation of each to time, to what is happening. If this has not always been felt - and as to that who is to know? - it has begun to be felt, irrevocably. Several years ago now I read Laura Feigel’s The Love-charm of Bombs: Restless Lives in the Second World War, and found it extraordinary. In part, Feigel writes of Elizabeth Bowen and her experience of London during the Blitz. I had read some Bowen in my teens - I think. The Death of the Heart - but it was a bit too dense and unsettled for me at the time. The Heat of the Day is her novel of the Blitz, and after reading Feigel I wanted to seek it out. The plot is a slight one, and readers searching for an exciting or romantic story will be disappointed, because propelling the plot forward isn’t Bowen’s focus. At the outset of the story, the protagonist isvisited by a man, who tries to blackmail her by telling her that her lover is spying for the enemy. There is also woman who inserts herself into the plot at various points, an awkward young woman who picks up men to stave off her loneliness as her husband is away at war. Reading Bowen’s dense, thickety prose requires work - it’s filled with circumlocutions and people not saying, or even thinking, what they mean. In that sense, the density suits its purpose, I think. This is a highly atmospheric novel, and Bowen conveys beautifully the tenseness and claustrophobia in wartime London, combined with the throwing off of constraints (particularly sexual ones - but yet the language and thought processes hadn’t caught up, hence the circumlocution). There are also some great comic scenes."}, {"userName": "Christine", "userReviewDate": "Jul 17, 2014", "userURL": "http://www.goodreads.com/user/show/5624286-christine", "userReview": "[Stella discovers that her lover, Robert, who works for British Intelligence, is suspected of selling classified information to the enemy. Harrison, the man who has tracked Robert down, wants Stella herself as the price for his silence. Caught between these two men, not sure whom to believe, Stella finds her world crumbling as she learns how little we can truly know of those around us.First published in 1949, The Heat of the Day was Bowen's most successful novel. In it she draws heavily on her affair with Charles Ritchie, a Canadian diplomat, to whom the book is dedicated. The tortuous nature of their affair is reflected in the doubts and uncertainties of Stella's relationship with Robert. Robert and Stella share the same ages (and age difference) as Bowen and Ritchie.Bowen's preoccupation with the cracks below the surface and the psychology of hurt and betrayal is echoed in Harold Pinter's work. Pinter's style and Bowen's dialogue find a perfect marriage in this adaptation. (hide spoiler)]"}], "description": "In The Heat of the Day, Elizabeth Bowen brilliantly recreates the tense and dangerous atmosphere of London during the bombing raids of World War II.Many people have fled the city, and those who stayed behind find themselves thrown together in an odd intimacy born of crisis. Stella Rodney is one of those who chose to stay. But for her, the sense of impending catastrophe becomes acutely personal when she discovers that her lover, Robert, is suspected of selling secrets to the enemy, and that the man who is following him wants Stella herself as the price of his silence. Caught between these two men, not sure whom to believe, Stella finds her world crumbling as she learns how little we can truly know of those around us.", "title": "The Heat of the Day", "url": "http://www.goodreads.com/book/show/195987.The_Heat_of_the_Day", "average": 3.46, "cover": "https://images.gr-assets.com/books/1403187737l/195987.jpg", "reviews": 168, "authors": [{"url": "https://www.goodreads.com/author/show/52578.Elizabeth_Bowen", "name": "Elizabeth Bowen"}], "type": ["Fiction", "Classics", "Historical", "War"], "outlinks": ["http://www.goodreads.com/book/show/195987.The_Heat_of_the_Day", "http://www.goodreads.com/book/show/1280767.The_Heat_Of_The_Day", "http://www.goodreads.com/book/show/25686356-the-heat-of-the-day", "http://www.goodreads.com/book/show/2205806.The_Heat_Of_The_Day", "http://www.goodreads.com/book/show/2381870.The_Heat_of_the_Day", "http://www.goodreads.com/book/show/2049608.The_Heat_of_the_Day", "http://www.goodreads.com/book/show/91494.The_Death_of_the_Heart", "http://www.goodreads.com/book/show/195990.The_Last_September", "http://www.goodreads.com/book/show/195993.The_House_in_Paris", "http://www.goodreads.com/book/show/536510.Eva_Trout", "http://www.goodreads.com/book/show/195988.To_the_North"]}