{"ratings": 854, "userreviews": [{"userName": "Brina", "userReviewDate": "Jun 14, 2016", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "One of my reading themes this year is reading quality middle grade kids books. Two Doors Down by Sharon Robinson is the fictionalized account of the friendship between her father Jackie and nine-year-old Stephen Satlow. We go back in time to 1948 Brooklyn where all the kids drank egg creams, played stickball, built model airplanes, and idolized their favorite players on the Brooklyn Dodgers. Stephen Satlow is enjoying one of these normal childhoods, although because his father works 6 1/2 days a week, he tends to have trouble behaving in school, even getting suspended for ten days. His dream is to go to the Dodgers home opener, but he has to earn his parents' trust by behaving. His behavior and dreams take a turn for the better when the Robinsons move two doors down from the Satlows' home.The second half of this book builds Stephen's friendship with Jackie Robinson. Sharon writes quality messages for kids touching upon issues as how to fight back without fighting, team work, respecting one's parents and teachers, religious tolerance and prejudices, and how to be a quality person. She touches on issues from 1948 as the formation of the nation of Israel and subsequent war and the integration of the US Armed Forces. Jackie Robinson was at the forefront of these issues and along with the Satlows conveyed a positive message to Stephen about how to treat all people with respect. I finished this book in an hour and my almost nine-year-old daughter finished in the course of a day. We both really enjoyed the story. It is a great book for middle/upper grade elementary students and can be used in social studies classes in teaching pre civil rights. It is also a quality book to lead into baseball season in conjunction with the movie \"42.\" A moving portrayal of 1940s Brooklyn, I rate Two Doors Down 4.5 stars."}, {"userName": "Amanda", "userReviewDate": "Apr 16, 2016", "userURL": "http://www.goodreads.com/user/show/2110482-amanda", "userReview": "I had higher expectations for this book. There is no plot, just kind of some stuff that sort-of-ish maybe happened in real life. I thought maybe there would be some struggle to accept Jackie Robinson because of his race, but no conflict, no choices made. Which is fine, great for these people being so accepting, but makes for a boring book. All of the \"life-lessons\" are handed out by a lecturing adult, the child doesn't actually learn things for himself. There really isn't even enough historical detail to really learn about this period of history. I learned more from 5 minutes of a PBS documentary about Jackie Robinson I caught recently. The only part that was really worth reading was chapters 9 and 10 about the Christmas tree, but it wasn't worth trudging through the rest of the book to get there. Maybe this book would have been better as a short story? And the set up of the book bothered me. In the first chapter, Steve is a young adult whose father has just died. He goes through a box of things his father saved from his childhood and it brings up memories of meeting Jackie Robinson. He is not remembering his recently deceased dad, but Jackie Robinson. Huh? Maybe for the right kid at the right time in his/her life this book could have an impact. But for me this book was a total \"meh.\""}, {"userName": "Julie", "userReviewDate": "Apr 21, 2016", "userURL": "http://www.goodreads.com/user/show/2079573-julie", "userReview": "While the adult in me was frustrated by the lack of plot (as another reviewer noted), I know kids (mostly boys, about age 7 to 10) will like this quick, based-in-real-life read. The author, Sharon Robinson, is the daughter of baseball great Jackie Robinson, and the book is based on the true friendship that her parents built with the Satlow family in the late 1940's. The afterward and acknowledgements are particularly touching: \"Were you able to picture becoming friends with your hero? I wish that for all of you!\"This book gives a glimpse into a time where the stadiums were fairly small and intimate, and the cost to go to a game was not as exorbitant as it is today. I nearly cried when young Steve came face-to-face with Jackie Robinson. It was a simpler time, without multi-million dollar contracts, private planes and billions of dollars worth of marketing. Of course, there were problems, not the least of which was the battle against racial prejudice, which the book does address. The Robinson family (in the book, at least) seems to handle it with a fair amount of concern and frustration but also with grace. Do our kids have heroes anymore? I hope so. This book might be a nice way to open a conversation about it."}, {"userName": "Montserrat L", "userReviewDate": "Sep 13, 2016", "userURL": "http://www.goodreads.com/user/show/59603828-montserrat-l", "userReview": "THE HERO TWO DOORS DOWNI have read this book and it is really good I love it.It is about a boy and a baseball legend that are friends, the boy is living in a place and then they move and they tell him that Jackie Robinson (his inspiration ) is living two doors down and they are friends and if you like this book you will like MY LIFE NEXT DOOR.I recommend this book because is really good and it made me feel like you are exited for the kid... Or the kid basically.It is similar to the one I told you because is like you love both but one is about love. The other one is about baseball...but is like the same... Maybe...I think so.Well this is the story in a shorter way. It is that the guy, Stephen is a loooooover of baseball player, Jackie Robinson. He knows aaaall about him,his birthday, his wife, his son, his touchdowns... Wait that is football but anyway.So like I was saying the boy is living in a place but he changes so he is in an apartment and then Jack or Jackie changes, two down of Steve!And they are friends.This is a true story!Even I can't believe it."}, {"userName": "Kristin", "userReviewDate": "Apr 01, 2016", "userURL": "http://www.goodreads.com/user/show/4797333-kristin", "userReview": "Great story poorly executed. I was excited because my students read a Jackie Robinson book in tri 3 but I can only recommend this with reservations. It has a very \"after school special\" feel. The characters sound nothing like any person I know in their speech patterns. I will cautiously put it in my library and say, \"You can enjoy reading this, but please don't write this way.\"This seems to be a theme with sports books. Every young athlete I read about (it seems) is all \"Golly gee, I only want to do what is right and be friends with every single person in the world, even my enemies on the other team.\""}, {"userName": "Seth", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/74925284-seth", "userReview": "1948 was a great year for many people, but it was especially great for the young Steven Satlow. Written by Sharon Robinson, The Hero Two Doors Down is about a boy who has an iconic neighbor. In this sports fiction book Steven gets to see his favorite player every day, Jackie Robinson. The book takes place in Brooklyn, New York. Every boy's dream is to meet their favorite player, and Steven gets to do that every day.  There were three main characters in the book: Steven, Steven”s father, and Jackie Robinson. Steven”s family, along with the other familie”s were not pleased when they heard that a black family was moving into their neighborhood. It was 1948 and most families were segregated like that, especially in an prominent white area in Brooklyn, New York. When Steven finds out that his neighbor two doors down is Jackie Robinson he is stoked beyond measure. Jackie Robinson was the best player for his favorite team, the Brooklyn Dodgers. Steven and his father read baseball magazines and listen to almost every game on the radio. Steve always dreams of going to games, but his father is very busy with work. Jackie is generous enough to let Steven and his dad come to opening day! It truly is a dream come true for Steven.  I give this book a three out of five stars. I usually give any baseball book a five, but even though it was a good read, at times it got very boring. It was a short book too. Fast moving read. I like more of a slow paste, longer book with lots of detail. The author told a good short story, I enjoyed the interactions between Jackie and Steve. Jackie was a good buddy to Steve. All in all it was a good read."}, {"userName": "Reading is my Escape", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/9411489-reading-is-my-escape", "userReview": "I read this book to the students in my Sunshine State Club. It's the story of a boy (Stephen) living two doors down from his hero, Jackie Robinson in Brooklyn in the year 1948. The book was written by Sharon Robinson (Jackie's daughter) and is based on \"the true story of a friendship between a boy and a baseball legend.\"The kids loved the book and it was fun to discuss what it was like to live in the 1940's. It's hard for them to imagine life without a cell phone, let alone life where you can only hear baseball on the radio, instead of watching on tv. We learned about Jackie Robinson and his courage and integrity. We learned about egg creams, transistor radios, and stoopball. And we learned about what it was like to live in a Jewish neighborhood in Brooklyn in 1948. It was also fun to talk to the kids about who their heroes are and what it would feel like to be friends with them.This book is great for elementary students, especially sports fans."}, {"userName": "Ryan Johnston", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/71330849-ryan-johnston", "userReview": "What I liked about this book is that it was about baseball and I love baseball. This book showed how bad and mean people were to different races a long time ago. Jackie Robinson was a hero to many and all he wanted to do was play baseball and he wouldn't let anything stop him. I also liked that Jackie made friends with a boy on his street and that would be really cool. He was a good role model for Steve and because of that he made better choices then the usual ones that got him into trouble."}, {"userName": "Alice", "userReviewDate": "Feb 01, 2016", "userURL": "http://www.goodreads.com/user/show/3905385-alice", "userReview": "This powerful story based on real events brings the legend of Jackie Robinson right into a Brooklyn neighborhood, just two houses away from Steve, a Dodgers fan. When a black family moves into their Jewish neighborhood, the neighbors aren't sure how they feel. No strangers to prejudice, the Jewish families decide to welcome the new comers, who will be renting their upstairs apartment to none other than Jackie Robinson! Through the friendship the develops between Jackie and Steve's families, it becomes apparent that Jackie is a steadying influence on the neighborhood kids. and when his family eventually moves away into a home of their own, Steve still has a friend in the Robinsons."}, {"userName": "Aaron Sauceda", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/58921580-aaron-sauceda", "userReview": "This book is really, REAlly, REALLY good. (I'm not even gonna bother typing the title of the story.) The relationship between Stephen Satlow and Jackie Robinson is probably the best friendship between a baseball legend and a normal 8-9 year old boy. I loved the fact that Stephen's family welcomes the Robinson's into their until then all-Jewish neighborhood. Jackie gives Stephen all kinds of gifts, like his baseball mitt, or his very first Christmas tree. A recommend this book to anyone who likes baseball or to basically anyone who just likes good books."}, {"userName": "Alexa Lepe", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/58951200-alexa-lepe", "userReview": "The Hero Two Doors Down by Sharon Robinson is an amazing book. This book is really interesting because the book is written by Sharon Robinson which is Jackie Robinson's daughter. I really liked this book because it is based on a true story of a little boy who knew Jackie Robinson and his family. If you like baseball this is the book for you. I would personally give this book five stars. I recommend this book to all ages. It is kid friendly."}, {"userName": "Bailey S", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/49160490-bailey-s", "userReview": "AMAZING!!!!!!!!!!!!!!! I WISH IT HAD AN OPTION TO GIVE MORE THAN 5 STARS"}, {"userName": "Mrs. Hornick", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/69999668-mrs-hornick", "userReview": "The story, The Hero Two Doors Down, by Sharon Robinson, is about a boy named Steve, who loves the Dodgers. He especially loves Jackie Robinson. Jackie is colored, and people from other teams are really disappointed that he’s on the Dodgers. He is hoping to make a change in the world by showing to people that it doesn’t matter your color, as long as you believe, you can accomplish anything. Segregation plays a huge role in this book, because of the problem of colored people not being treated as fairly as whites were treated. This problem causes Steve to want to help Jackie. He helps him by signing a petition for the Robinson’s to move into their neighborhood. Steve has done some bad things in school, such as pushing his teachers, which results to larger consequences. These result in punishment such as doing chores and even in school suspensions. Throughout the book, Steve is getting in trouble by teachers in school, which to him, makes him worried about what will happen, but when the big bomb drops, Steve’s life has crashed. Once Steve finds out his punishment, he feels like his life is over. Something to cheer him up happens and it involves his favorite player Jackie Robinson. Steve’s love for Jackie is huge, but when Steve’s punishment of an in school suspension occurs, it interferes with his love for Jackie. It interferes by Steve not being able to talk with his friends about Jackie since he has a suspension.  The story The Hero Two Doors Down, by Sharon Robinson, would be a good book for kids that are interested in knowing what life was like in America during the early 1930’s when segregation was still a huge part of American life. It would also be a very good read for sports fans because Steve loves sports, and Baseball especially plays a huge in his life. Overall, this story would be a great read for any kids that are trouble makers because of Steve’s misbehavior and they would be able to relate to him. People should pick up this book because of how much unfairness there is going on and how some people might be able to relate to some of the characters."}, {"userName": "Rachel", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/3219666-rachel", "userReview": "Book 13/15 for 2017-2018 EBoB: I did not care for this book at all. To begin with, the story opens with the protagonist, Steven, looking back on old baseball memorabilia upon his father's death, and mentioning their rocky relationship. The book then transforms into a flashback of the time when Jackie Robinson moved onto Steven's street, and how he learned so many lessons from Jackie and they became lifelong friends. The relationship between Steven and his father never appeared strained, even though, in the book's opening, that's how it was described.However, even more than the confusing focus of the story, given how it began, what I really didn't like about it is that there was zero conflict. Everyone got along, for the most part, every life lesson was immediately learned, nothing was challenged, everything was rosy. Aside from Steven's quick temper, which got him into trouble at school, I felt as if nothing happened. In fact, it was so devoid of true action, that when something DID happen, it seemed forced and out of the blue, almost as if it had been thrown in there because of a need for conflict rather than as actual plot development. I actually enjoyed the author's notes, during which she explained which parts of the book were based on true events, and with which parts she had taken license, more than the book itself. Overall, to be blunt, the book was just too slow-moving and boring to hold my attention."}, {"userName": "HW6thgrade", "userReviewDate": "Dec 22, 2017", "userURL": "http://www.goodreads.com/user/show/74432258-hw6thgrade", "userReview": "Throughout this novel readers learn so much about what being a good friend is like. Steve and Jackie’s relationship continues to grow throughout the story! When reading this book, you will see how strong Jackie and Steve’s friendship grows and how they stick together when times get tough or even frustrating. Throughout this book Steve and Jackie face many problems dealing with prejudice and standing up for your rights. Jackie and Steve continue to grow as friends because they stick together when things get hard. Overall this story teaches a strong lesson of friendship and what it is like to be a great friend. This is an amazing read for kids in fourth grade and up. Throughout the story characters develop a strong bond and learn many lessons of friendship. Both boys and girls would enjoy this novel because they will be able to connect and relate to certain parts of the book. Friendship plays a huge part in this book. All through the book, characters learn what it is like to be a great friend and to always stay true to what you know is right. In this novel, both main characters face prejudice and have to stand up for themselves and what they know is right. Overall, many fourth grade students and up will enjoy this novel and learn many lessons on what it is like to be a great friend."}, {"userName": "Kristen", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/21548465-kristen", "userReview": "First of all, this is a really cool story based on a true one: Jackie Robinson really did make friends with a young boy named Steven when he, his wife, and son moved into a predominately Jewish neighborhood during the early years of his career. Written by Jackie's daughter, Sharon, the book shows some really amazing interactions between the two unlikely friends and has a couple of really touching moments. I think upper-elementary and reluctant readers who enjoy baseball stories will really like this one.On the other hand, there are a lot of facts packed into what is essentially a short narrative--most of them in character dialogue that just doesn't feel realistic or interesting. While I like learning about things while I read, I also like to feel as if it's not interrupting the story. Especially since, as a Dodgers fan, the Jackie Robinson story is one of my all-time favorite sports stories. However...I do like that the story focuses on life after Jackie integrated Major League Baseball and that it addresses his personal life as much as his professional life."}, {"userName": "Jann", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/25122530-jann", "userReview": "Baseball fans will appreciate this fictionalized memoir written by Jackie Robinson's daughter, about Steven Satlow, Jackie Robinson's neighbor in Brooklyn in 1948. Steven and his dad were big Dodgers fans and were thrilled that such a famous and superb player befriended them. The two families became good friends, and Steven learned about more than baseball from the great player, he also learned about self-control and patience. One memorable day, Jackie Robinson even invited Steven's entire 4th grade class to a game. The idea of the story is wonderful, but there is little action, and it feels a bit disjointed."}, {"userName": "Mandy", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/11023911-mandy", "userReview": "A story about a boy and his incredible friendship with baseball legend Jackie Robinson. I think students would enjoy reading this somewhat true account of Steven satlow becoming friends with his famous neighbor. Isn't this something that we have all dreamt about at some point in our lives? As a teacher, I loved the deeper message of friendship across cultural and racial divides. I think this story would be a good starting point to talk about what was happening in our country at this moment in history."}, {"userName": "Stacy Stoker", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/33575886-stacy-stoker", "userReview": "This book was ok, but not really well written. As a teacher, I teach my kids to \"show, not tell\" when they are writing a story, but this book did a lot of telling without bringing me into the story. There were opportunities for the author to do that, but she missed them. The chapters at the end about sharing their religions were the best. I think this could have been a meaningful story, but it missed the mark. I also didn't like the introduction being about the death of Steve's father, but then the memories mainly being about how important Jackie Robinson was to him."}, {"userName": "Mrs. Hassig", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/11932650-mrs-hassig", "userReview": "I didn't realize until the epilogue that the author Sharon Robinson was Jackie's daughter!! I'm pretty clueless but I was so excited and I know my students (many have seen \"42\") would love to read this book! What an amazing human being and athlete Jackie Robinson was. The story succeeds in describing what a true \"hero\" looks like and acts like. So many of my students can't tell you who their heros are? But here is was a man that everyone could look up to! The world needs more people like Jackie today."}, {"userName": "AMY", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/46746637-amy", "userReview": "202 pages. This is a great story based on real events in Jackie Robinson's life. A Jewish family lives two doors down and a young boy becomes friends with Jackie and his family. It is a heartwarming story and provides interesting crossroads when Jackie gives his neighbors a Christmas tree, not knowing they are Jewish and do not celebrate the holiday. I think this book would help kids better understand how people of different races and religions can get along and become lifelong friends. Highly recommended. Gr. 3-5."}, {"userName": "Christina", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/2028452-christina", "userReview": "I feel like at least half of my dislike from this book came from the narrator of the audiobook. However, this book could have really benefitted from \"show, don't tell\". Too many times the author goes into detailed explanations of things like being a Riveter in WWII or UNICEF. While it's understandable that the reader may not be familiar with these things, the explanations are done in a way that seems academic instead of a natural flow to the novel.I think this whole narrative would have been better as a straight biography or memoir than as a piece of fiction."}, {"userName": "Mary", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/8381744-mary", "userReview": "This is more a \"lesson\" book than a story book. It is a tale about a young boy who became friends with Jackie Robinson the the Robinson family moved onto his street for a year. There are lessons about racism, anger management, courtesy, helping those who are less fortunate, religious differences and love. All of these lessons are given gently and without sounding preachy. I needed a light book after reading \"The Nightingale\". This fit the bill."}, {"userName": "Brandy", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/58416376-brandy", "userReview": "My 5th graders chose this book for our April Lunch Bunch. Not being a fan of baseball, I was not terribly excited. However, they chose and they chose well! Sharon Robinson immediately sucked me into the book with the prologue. There was so much drama and emotion that I felt I had to keep reading. I adore the story of Stephen and his hero Jackie Robinson. Not to mention the story of his relationship with his father. I am so glad my students \"made\" me read this book!"}, {"userName": "April Suter", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/4685969-april-suter", "userReview": "A must read for all elementary and middle school students...and those who love baseball. This wonderfully written story by Jackie's daughter shares how it was like for her parents to move to a Jewish neighborhood through the eyes of a baseball-loving Dodger fan neighbor boy. The story reveals how families deal with discrimination and how to think of others first. I can not say enough about it is a book to treasure."}, {"userName": "Jack Bailey", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/75007120-jack-bailey", "userReview": "This was a very amazing book I really liked it. I think that it being a true story made me like it more because I new this friendship actually happened. My favorite parts were when the boy finally meets jackie for the first time. I also liked how the boy and jackie.jr become friends . I would recommend this book to anybody because it is very iteresting but also because it was not to hard but also besause it was not to easy."}, {"userName": "Carrie Carlson", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/27358108-carrie-carlson", "userReview": "It just didn’t flow for me. I didn’t like the way it started, with his dad’s death, because I don’t think middle grade readers will be able to connect with that. Then, the dialog seems overly staged and detailed for his age. It just never stuck me as very realistic even though I know it is based on a true story."}, {"userName": "Chelsea", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/43520804-chelsea", "userReview": "I wanted to use this book as a read aloud in my classroom; but I'm not sure there is enough plot to make this book interesting to a group of 8 year olds. Not a lot happened and the dialogue seemed forced and unrealistic. That being said, as a Dodgers fan giving this book anything less than 4 stars would be a sin. I mean...it's about Jackie Robinson. Enough said."}, {"userName": "Sarah Hayes", "userReviewDate": "Oct 28, 2017", "userURL": "http://www.goodreads.com/user/show/71585278-sarah-hayes", "userReview": "This book was really good because it shows a great friendship between two people, Jackie Robinson and a boy named Steve. In the story there is a boy who loves the Dodgers so much, but has never been to the stadium before. But when a new family arrives into his neighborhood, Steve is anxious to find out who it is. So, I recommend this book to anybody who like books about friendship."}, {"userName": "Jan Stanford", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/33705143-jan-stanford", "userReview": "I’m not sure I would have finished this book if it wasn’t short. I love baseball and had high expectations. Instead I found it boring and just reading about stuff happening in a kid’s life. No real excitement or conflict for an interesting plot. Also, it felt too much like a soap box instead of a book with social issues. Too bad."}], "description": "Stephen Satlow is an eight-year-old boy living in Brooklyn, New York, which means he only cares about one thing-the Dodgers. Steve and his father spend hours reading the sports pages and listening to games on the radio. Aside from an occasional run-in with his teacher, life is pretty simple for Steve. But then Steve hears a rumor that an African American family is moving to his all-Jewish neighborhood. It's 1948 and some of his neighbors are against it. Steve knows this is wrong. His hero, Jackie Robinson, broke the color barrier in baseball the year before. Then it happens--Steve's new neighbor is none other than Jackie Robinson! Steve is beyond excited about living two doors down from the Robinson family. He can't wait to meet Jackie. This is going to be the best baseball season yet! How many kids ever get to become friends with their hero?", "title": "The Hero Two Doors Down: Based on the True Story of Friendship Between a Boy and a Baseball Legend", "url": "http://www.goodreads.com/book/show/25786953-the-hero-two-doors-down", "average": 3.83, "cover": "https://images.gr-assets.com/books/1436842812l/25786953.jpg", "reviews": 141, "authors": [{"url": "https://www.goodreads.com/author/show/376105.Sharon_Robinson", "name": "Sharon Robinson"}], "type": ["Historical", "Sports and Games", "Childrens", "Sports", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/25786953-the-hero-two-doors-down", "http://www.goodreads.com/book/show/30826786-the-hero-two-doors-down", "http://www.goodreads.com/book/show/6536681-testing-the-ice", "http://www.goodreads.com/book/show/881713.Promises_to_Keep", "http://www.goodreads.com/book/show/19546482-under-the-same-sun", "http://www.goodreads.com/book/show/1055974.Jackie_s_Nine", "http://www.goodreads.com/book/show/1953051.Slam_Dunk_"]}