{"ratings": 139, "userreviews": [{"userName": "karen", "userReviewDate": "Jun 13, 2014", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "another brilliantly-written and unapologetically brutal addition to the grit lit category.this one covers about seventy years of circumstances, it starts out bleak without ever letting up, and its second movement ends with one of the most infuckingsanely blood-drenched scenes i have ever read. you know who you are.this is a book that unflinchingly explores the mythos of the west: the violence and the loneliness, the stoicism and the self-imposed exile, the comfort of work and the weight of the personal code. it's about lives endured instead of lived, in a time when men were men and women were... not well off. it's about a terrible snowstorm in 1918 washington, during which a chain of events is set into motion that will have unimaginably explosive consequences further down the road than any of its participants dare even conceive. it's about the separate trajectories of two dangerous men, their lives overlapping and echoing at crucial intervals, destined to meet under violent circumstances, and the women and children in the path of their inevitable showdown. it's about a lot of suffering, a lot of blood. and it reads like this:The air had cooled and stringy clouds rose from the dogs' mouths, together gathering into a fog that made them look like demons in a moor. Some barked and others howled; still more nipped one another in their anxiety. The cooking meat stirred their stomachs and they leaped to break the ridgeline, stout horses and good hemp rope knotted on a pair of saddle horns all that held them.Some below glanced at the animals but dismissed them. Animals were drawn to a meal that didn't require the effort of killing. They would all be scavengers if circumstances permitted. People differed little, Matt realized; most would eat a beef steak or chicken leg, skinned and plucked and cut and papered and piled into their freezers or root cellars rather than kill and butcher for themselves. For a man civility seemed the ladder out of the melee; otherwise, like his animal brethren, a man only survives. Straight up killers seemed more moral, though. They turned lives into food knowing the flesh their teeth ground and their tongues savored and their gullets swallowed breathed an hour or a day or a minute before. The recognized their own existence was constructed upon slaughter, and the debt they owed their victims could never be repaid, simply owed. It seemed to Matt, though the meals arrived on porcelain and cooked, the scene below was no less savage.it's my favorite kind of book, perfectly executed. get on this one, country-noir friends o'mine."}, {"userName": "Tuck", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/565487-tuck", "userReview": "kick ass eastern washington grit lit or how far will you go to keep your dream alive? all the way?"}, {"userName": "Tony", "userReviewDate": "Mar 18, 2016", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "THE HOUR OF LEAD. (2014). Bruce Holbert. ***.This was the author’s second novel; his first, “Lonesome Animals,” was named the Best Book of 2012 by The Seattle Times. As is my usual practice, I read this one first. It is not likely to be named as a Best Book of the Year, although the writing is strong and lyrical. It is a story set in Eastern Washington state about a family who doesn’t have much luck. The protagonist is Matt Lawson, whom we meet as a young boy along with his twin brother, Luke. One winter, both brothers were out in a horrific snow storm and became separated. Luke was ultimately found, but had not survived the storm. Their father was also a victim of the storm, but his body was not found until much later. While searching for his father, Matt hooks up with a young girl – a neighbor, Wendy Worden. You soon assume that this joint search effort will lead to something greater, but it really doesn’t. After a little while, Matt soon discovers that he has potentially missed something, and begins to shower Wendy with small gifts, but makes no real move to get closer to her. It’s a strange relationship. The author then throws in a gap of sixteen years, while giving Matt a chance to grow up and become a vigorous cowboy. He turns into one of the strangest cowhands you have ever known. He doesn’t seem to have any normal emotions, but goes after problems in a Neanderthal way. I could muster no liking for Matt. Wendy ultimately appears again, but by this time she has become someone different. Many of the scenes in this novel are primitive in nature. You expect that Matt will have to take on responsibility on his own after losing his father and brother, but he does so with a total lack of emotion as situations arise that should normally evoke some actions of feeling. I could not connect with any of the author’s characters, and the plot wandered around a lot. I do plan to go back and read his first novel, just to see what all of the praise was about. The author does write in a poetic style, but that can’t overcome a cock-a-mamie plot structure or flat characters."}, {"userName": "Roberta Emerson", "userReviewDate": "May 30, 2015", "userURL": "http://www.goodreads.com/user/show/8552725-roberta-emerson", "userReview": "Initially excited to read a book set where I grew up, taking place 100 years ago, the forced attempt at lyrical prose was off putting. Then at about page 60, there was a page and a half of beautiful writing. The story was alternately engaging and confusing. But this rating is primarily due to the incredible amount of senseless violence throughout, at times thoroughly revolting. Not recommended."}, {"userName": "Mrtruscott", "userReviewDate": "May 29, 2016", "userURL": "http://www.goodreads.com/user/show/12528871-mrtruscott", "userReview": "Amazing writer. Set in Eastern Washington; hard to describe - not a \"Western,\" almost....well, it reminded me (which is dangerous ground, my memory) of the old Clint Eastwood movie, \"The Beguiled.\" Take the roof off of any house, and you will find stories about people like those in this affecting and finely wrought novel. Still thinking about it."}, {"userName": "Monica", "userReviewDate": "Aug 20, 2015", "userURL": "http://www.goodreads.com/user/show/839326-monica", "userReview": "The truth is this review is an emphatic 2 and an emphatic 5. Too bad it becomes an average 3. Excellent writing and sense of place. It's set where I grew up and loved that. The view of people is horrific, so much violence and hate; everyone is twisted. Read it if you're tough."}, {"userName": "Željko Obrenović", "userReviewDate": "Oct 28, 2016", "userURL": "http://www.goodreads.com/user/show/32495444-eljko-obrenovi", "userReview": "Američka porodica s početka 20. veka pa kroz sedam decenija."}, {"userName": "Sheri", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/5926272-sheri", "userReview": "You think winter is kicking your butt? Try the first chapter of this book & then try to complain. From that wild beginning, I found the characters interesting and the plot surprising. Only one thing late in the book didn't feel \"right\" given what the author has told us about his characters and lives. And, in a real treat for me, the events in the book largely take place in rural Washington State, within 150 miles of where I live, and where I've been in my travels. Made the story even more fascinating."}, {"userName": "sabrina osborne", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/61307880-sabrina-osborne", "userReview": "A lovely novelStrange and powerful. The characters were very vivid. The writing style unique. It was quite a story, haunting and poignant."}, {"userName": "April", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/8257023-april", "userReview": "I like the spare and poignant beauty of Holbert's novels. He captures the complexity of the human condition--our hopes, fears, our propensity to both love and violence, and the intersection of the two. His characters do inexplicable things, and leave me to realize it is useless to wonder why people do what they do.Despite that, I do wonder why the main character does what he does at the end. It seemed incongruous to me, so I couldn't give it 5 stars."}, {"userName": "Scott Underwood", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/40426429-scott-underwood", "userReview": "DNF. Got about 50 pages in and realized I did not care about these characters and I did not appreciate the over-effort to paint pictures. What's that they say about good musicians? It's not the notes they play, it's the ones they don't. Too many notes that didn't need to be played here.--*Update*--The day after I put this down with a DNF I picked it up again. From about page 70 or so it started to feel like a story and then became one. One that interested me, though I still am confused by some of the dialogue and descriptors. Some paragraphs just down right confuse me. In the end, I was geared up for a very bad something.....something unexpected, like the author's first novel, but better heads prevailed, though I'm stymied as to what the gold, flat, metal thing was. Can somebody help me out here?"}, {"userName": "Peter Donahue", "userReviewDate": "Feb 07, 2016", "userURL": "http://www.goodreads.com/user/show/42357797-peter-donahue", "userReview": "Eastern Washington is Bruce Holbert's Yoknapatawpha. He mythologizes the region with Faulknerian fervor--Saturday night/Sunday morning elocution, semi-mute characters with a penchant for gore, Gothic preoccupation with pain and dark humor, and a recognition, in Eudora Welty's words, that setting is \"the crossroads of circumstance . . . by confining character, it defines it.” Comparisons with Cormac McCarthy abound. I would add William Goyen and the more westerning works of Brian Evenson. What I didn't expect in THE HOUR OF LEAD--Who would after LONESOME ANIMALS?--were the moments of sentimentality that now and then relieve the characters of their existential blightedness. Both novels belong on every required reading list of Northwest literature."}, {"userName": "Dale", "userReviewDate": "Oct 09, 2015", "userURL": "http://www.goodreads.com/user/show/4498938-dale", "userReview": "a much better read (less violent, more intrigue) than the previous book read by this author (see 2015/#30); this story is divided into “parts” and at the end of one section I leaned back in my chair, hands clasped overhead and smiled: it’s that kind of book. Somewhat hard to keep track of all the characters but it’s that old love found/lost and found again set in a western setting that is very well written; 2014 hardback via Madison County Public Library, Berea, 304 pgs.; 5 out of 5 stars;"}, {"userName": "Alex Krembs", "userReviewDate": "Aug 26, 2015", "userURL": "http://www.goodreads.com/user/show/14189073-alex-krembs", "userReview": "I love books based in Eastern Washington. This historical fiction places itself at the construction site of the Grand Coulée dam. Story telling skills are good. Lyricism is sharp - but I get the sense those sentences placed after the story writing completed. They are eloquent but not so much the root of the story but perhaps the flowers."}, {"userName": "Jane Dugger", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/1246248-jane-dugger", "userReview": "I wasn't too sure I liked this book after reading the first part but it turned into a page-turner. Fantastic writing!!!! This would be a great book for discussion. Be advised it is a bit graphic."}, {"userName": "James", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/15751114-james", "userReview": "brilliant... much like his first novel, butcompletely its own too... i admire the talent it takes to make the characters and events and the past seem to real and now... Holbert has amazing talent and i hope he continues to write and publish..."}, {"userName": "April ", "userReviewDate": "Sep 04, 2015", "userURL": "http://www.goodreads.com/user/show/11341280-april", "userReview": "Rounding up to 4 stars even though the first half of the book was a little slow for me, definitely some unexpected twists. (I literally thought, \"I didn't just read that\".../skims again/...\"Okay, I guess I did read that right the first time. Wow.\")"}, {"userName": "Robert", "userReviewDate": "Apr 07, 2015", "userURL": "http://www.goodreads.com/user/show/15078967-robert", "userReview": "Fairly interesting story, but pretty dark at times. The story is set in Eastern WA farm country which added interest for me: Colfax, Lacrosse, Brewster are part of the story as is the building of the Grand Coulee dam."}, {"userName": "Ray", "userReviewDate": "Jul 16, 2014", "userURL": "http://www.goodreads.com/user/show/5054648-ray", "userReview": "A land where women are as tough as the men but, guns and weather trump all. A brutal, poetic love story. A slow ride at first then a full gallop near the end."}, {"userName": "Trish", "userReviewDate": "Jul 06, 2015", "userURL": "http://www.goodreads.com/user/show/19963833-trish", "userReview": "Excellent book. Great voice."}, {"userName": "Aalap Chikhalikar", "userReviewDate": "Nov 19, 2014", "userURL": "http://www.goodreads.com/user/show/13116573-aalap-chikhalikar", "userReview": "Excellent writing, I've found the American Coetzee where every sentence packs a punch."}, {"userName": "Karin", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/2043870-karin", "userReview": "So much shock value in this book - and most of it is weird and gross. The actual story is ok."}, {"userName": "Patrick Schultheis", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/7127608-patrick-schultheis", "userReview": "I really liked it. Solid characters, well written. Plot meandered occasionally but finished strong"}, {"userName": "Steven O'Brien", "userReviewDate": "Jul 23, 2014", "userURL": "http://www.goodreads.com/user/show/1689743-steven-o-brien", "userReview": "Needlessly savage. Characters with ambiguous motivations. Tries to bridge dime store grit lit with Cormac McCarthy prose. Unsuccessfully."}, {"userName": "Edroy Parker", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/41801948-edroy-parker", "userReview": "Historical novel set in eastern Washington; enjoyed this."}, {"userName": "Linda", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/7816252-linda", "userReview": "This was a good read! I live in Washington state where this story takes place, so was drawn to it already."}, {"userName": "Suzy", "userReviewDate": "Jan 09, 2015", "userURL": "http://www.goodreads.com/user/show/19807371-suzy", "userReview": "BJ #15, Book #1320"}], "description": "Lonesome Animals was named as a Best Book of 2012 by both The Seattle Times and Slate, a literary debut sparking with beautiful language set against the rugged landscape of 1920s Washington state. Holbert returns with The Hour of Lead, an epic family novel and coming of age story that is once again imbibed with the mythology of the west.After losing both his twin and his father in a brutal, unexpected snowstorm, Matt Lawson must take over the family ranch. As his mother disappears into grief, Matt learns the hardest lesson the west has to teach: he is on his own. The necessity of work stabilizes young Matt against the pitfalls of first love with Wendy, the daughter of a local grocer, and their ragged end will sent Matt on a journey across the county, leaving Wendy to tend the ranch with local schoolteacher Linda Jefferson and her unwieldy son Lucky. It will take decades for Matt to learn his way back home, and that long journey will have great impact on all of those around him.Invoking the same beautiful landscape and language of his critically-acclaimed debut, The Hour of Lead is a wider, more expansive novel, less violent but just as affecting, another important contribution to the literature of the west.", "title": "The Hour of Lead", "url": "https://www.goodreads.com/book/show/18668218-the-hour-of-lead", "average": 3.6, "cover": "https://images.gr-assets.com/books/1385522449l/18668218.jpg", "reviews": 28, "authors": [{"url": "https://www.goodreads.com/author/show/3318033.Bruce_Holbert", "name": "Bruce Holbert"}], "type": ["Westerns", "Fiction", "Historical", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/18668218-the-hour-of-lead", "http://www.goodreads.com/book/show/23281511-the-hour-of-lead", "http://www.goodreads.com/book/show/22675964-the-hour-of-lead", "http://www.goodreads.com/book/show/13074464-lonesome-animals", "http://www.goodreads.com/book/show/35259576-whiskey", "http://www.goodreads.com/book/show/26196390-thank-you-teacher", "http://www.goodreads.com/book/show/7568007-signed-your-student"]}