{"ratings": 11306, "userreviews": [{"userName": "Naja Faysal", "userReviewDate": "Jan 21, 2010", "userURL": "http://www.goodreads.com/user/show/52498172-naja-faysal", "userReview": "As I scribble through the comments on this book, I couldn't find any Arab person who've read it and commented on it.. and that in itself tells you something. Being an Arab myself, I felt extremely sad about the misery of our race in the last century. Facing our brutal facts as Arabs is the only way to hope for a change and a better future. Although my country wasn't as devastated as Palestine, but I think we had our take of religious wars and sacred illusions where religion mixed with politics and corrupted the entire nation. This book, and although it is very harsh to read, is a true representation of the story of what happened at that time. It also gives a great description of the Arab character. Although now its quite different, some villages and rural areas are still stuck in the stagnation of the past century. It is highly recommended for all my Arab friends and for those who are interested in the historian and cultural knowledge of the middle east in the last century."}, {"userName": "Tea Jovanović", "userReviewDate": "Mar 21, 2013", "userURL": "http://www.goodreads.com/user/show/3103000-tea-jovanovi", "userReview": "nastavak romana Exodus"}, {"userName": "Dan", "userReviewDate": "Jan 28, 2008", "userURL": "http://www.goodreads.com/user/show/276109-dan", "userReview": "On a purely aesthetic level, I enjoyed this book. Judging it purely as a novel, I'd rate it higher; I like Uris's writing style and the plot drew me in. But as a work of historical fiction, it scores lower for me. Without knowing enough about the Arab-Israeli conflict to be able to specifically dispute any of the historical analysis implied by the story, I came away feeling that the it couldn't be anything other than biased. As I recall it, the Jews come off as nobler people, entirely wronged and victimized whereas the Arabs are depicted as having a fundamental racial or social flaw which is the root of all conflict in the region. Even though the major characters are all presented sympathetically, they can't overcome the fundamental problem that all Arabs are craven (at best) or evil. I was frustrated with the treatment and came away with a bad feeling about the book."}, {"userName": "Gary", "userReviewDate": "Jun 05, 2016", "userURL": "http://www.goodreads.com/user/show/51196399-gary", "userReview": "This book reveals the complete truth about the Middle East and the hatred and destructive evil that Israel and the Jewish people are up against.No it is not racist or prejudiced.It simply tells things as they are without regard to political correctness Of course Arabists and their like will hate it,therefore. In fact it shows the character Ismail in a very favourable light and as for the assertion made that only Jews are presented in a good light,that is simply rubbish For example we read about the Scottish Christian Captain Wingate who shows great valour and love for the Bible and God and this is what leads him to help the Jewish people in their struggle.He shows many positive qualities in the Haj himself and presents a compassionate portrayal of the German prostitute Ursula who is basically a decent woman who has found herself in a terrible situation ,and who shows great courage and conscience. In Leon Uris' books he presents all sorts of people who are brave and noble-hearted including British,Germans, Greeks ,Americans and Poles as well as bad people among all nations too. Read it.It presents the TRUTH about Israel and the Arabs at a time we are presented with Anti-Semitic untruths about Israel from the media everyday."}, {"userName": "Mike", "userReviewDate": "Jan 24, 2008", "userURL": "http://www.goodreads.com/user/show/545336-mike", "userReview": "\"We wanted to build a Singapore and they wanted a Somalia\" I heard those words from an Israeli businessman as I looked over the Erez crossing and industrial park. What I saw of the Palestinian areas during my visit there conforms to what this book has to say about the impact of the religion, the wars and the culture on Palestinian society. This is a sad and depressing book, as it gives you a view from the Palestinian side of the events before and after the establishment of Israel. It is well worth learning about the islamic mind and how they react or think about the modern world. Truly, it is a culture adapted to the harsh environment and mercy or love have little place there. I felt some empathy for the Palestinians as they watched the Jews come back to their ancient homeland and bring the desert to life. The point most interesting to me was how the Palestinians felt like they were paying the price for the barbarism of modern Europe in WWII. I have some sympathy for that point. But not much as the Jews always have held a right to live in Israel. The most infuriating part of the story is the barbaric, medieval treatment of the women as property or slaves. The fact is that one half of the population will never contribute much to advancing the culture and society. This book illustrates how dysfunctional this group of people is. It is not a pleasant read but it is accurate in portraying this society"}, {"userName": "Irene", "userReviewDate": "Sep 05, 2007", "userURL": "http://www.goodreads.com/user/show/211549-irene", "userReview": "This book is about the Arab culture, the creation of the State of Israel and how the Palestinians became refugees. Great book but makes you despair about ever being able to come to a resolution in the Middle East."}, {"userName": "Chris", "userReviewDate": "Oct 02, 2012", "userURL": "http://www.goodreads.com/user/show/2020759-chris", "userReview": "I'm not sure what it is with Leon Uris. Maybe it's just me, but I feel like every time I get through one of his stories, the ending just disappoints. That's how I felt about Armageddon and Topaz, and it's the same here.SPOILERS will follow: This book, dealing with the origins of the modern Arab-Israeli conflict, specifically in regards to the perspective of a Palestinian family in the 1920s-1940s, is not usually my cup of tea. But I had the book, and figured I'd give it a shot. Like my other Uris experiences, the initial concept is actually quite engaging, but I had bigger problems with this one.For one thing, the narrative style is erratic, shifting from third person, detailing the life of Haj Ibrahim, a Palestinian muktar, to first person (from the perspective of Ibrahim's son, Ishmael), to a more broad third-person narrator, describing global/political events at large. That's tricky enough, but on top of that there are some odd time jumps, backwards and forwards, in the first third of the book, which fortunately cease after a point. I also have to take issue with the theme of the book. It's largely a heavy-handed condemnation of Muslim culture, at least as far as the lower and middle classes of the Middle East are concerned in this time period. There really doesn't seem to be any attempt to portray the protagonists in a positive light, focusing instead on religious dogmatism, brutal sexism, and fatalism. Not to mention the fact that almost every character is portrayed as treacherous, hostile, and vicious. It's very hard to empathize with characters like that.Which is why the ending becomes such a problem for me. (Again, SPOILERS!) At the climax of the novel, Ibrahim, who has been a morally conflicted character throughout the book, attempting to find some means of peace and hope for the Palestinian refugees displaced by armed conflict, effectively gives up. His daughter Nada offends him by defying social and religious convention, which Ibrahim responds to by brutally murdering her and dumping her body in the gutter. Ishmael, the hero of the story, berates his father into dying of what appears to be an apoplectic heart attack, before descending into delusional madness and, presumably, death. The end. It's an absolutely depressing and defeating finish to a five-hundred page novel, that completely negates the characters' journeys. The only message I really got from Uris here is a mallet-to-the-head sermon of the failings of Arabic/Muslim culture. You're made to feel that at least one of these characters will have a future, but ultimately denied. And that doesn't even factor in some of the dangling plot threads - what becomes of Gideon, of Farouk, of Tabah - of the region itself - or the ongoing problems and conflict that lingered into the '80s (when the book was written.)Ultimately, I found the book a laborious read with an enormously unsatisfying conclusion. I was disappointed, because I kept wanting to like it (I never want to dislike a book I'm reading, since it's an investment of both time and interest), but try as I might, I could not. Reading a lengthy work only to reach a conclusion of \"And then they all died and life was horrible, the end\" is not a good return on my investment, personally. Based on the three Leon Uris stories I've now experienced, I don't really see myself seeking out more."}, {"userName": "Andy", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/18810398-andy", "userReview": "50p in a charity box, was thinking be rude not to pick one of his up! Not something I would normally pick-up but glad I didAn engaging start with a mix of the history of the Palestine/Israeli conflict retold through mostly Arab eyes along with the narrative from an Arab family. The story begins in 1922 & runs throu to 1956 bringing critical points in the history to life through the involvement of the family whose father is the Muktar of Tabah, a leader of his people in a region of Palestine who come into direct conflict with Jews from 1922. Arab life & culture is all relayed through the family’s interactions with each other as well as the rest of the tribe & one early passage sums it up very well - “So before i was nine i had learned the basic cannon of Arab life. It was me against my brother; me & my brother against our father; my family against my cousin & the clan; the clan against the tribe; and the tribe against the world. And all of us against the infidel.”The history at times wants to make you weep with the frustration & pig headedness of it all, not to mention the politics of the Arab nations which are taken from actual documents & show the divide amongst themselves which is incredulous when you are supposed to be fighting a “common” enemy.It’s thought provoking & very emotional at times, you WILL laugh at places, you will SMILE too but be prepared for a fair few glowers & palm forehead smacking moments too...... there are quite a few sub-plots (Dead sea scrolls?) as well which always manage to involve the family in some small part to illustrate Arab life/culture.I would add that the Arab culture that is shown to the reader is pretty much what someone from the west (me) would expect & I’m not going to believe 100% that it’s accurate & would be interested to review what an Arab reader would think of this book? There are parallels with the hatred & bigotry of the North in Ireland of the last century in terms of religious divide & doctrine which leads to blind hatred. Is it a fair reflection of the Arab psyche? Possibly so.... I cant answer that but I will say it’s written by an American Jew & so some form of predigest must lie within the text. It does have a sympathy with certain Arab viewpoints, those that wanted to live in peace with their neighbours be they Arab or Jewish which comes from the lead families experiences.A very good read overall although I’m not quite happy with the ending which I have to add.... recommend highly for all history buffs & those interested in learning about other cultures."}, {"userName": "Anne  (Booklady) Molinarolo", "userReviewDate": "Jan 08, 2012", "userURL": "http://www.goodreads.com/user/show/3615945-anne-booklady-molinarolo", "userReview": "The Haj isn't for the faint of heart. It is very depressing and startling. Uris takes the reader back to Palestine in the the early to mid 20th Century. Exodus gave us the Jewish perspective while The Haj presents the Arab perspective. Uris covered 25,000 miles in the Palestine area and conducted over 1500 interviews researching his breakout masterpiece.While his trip was funded by a PR firm and Uris' religion is Judaism, I see no overt bias in either novel. The Haj seems to be biased, because Arab life and Islam is portrayed harshly. But the character, Gideon Asch, reminds the fictional Ben Gurion that his ways were not that of a Jew.The Haj in the novel is not the trek to Mecca that every Moslem male must make in his life-time, but the story of a village muktar that is in a strategic place on a highway leading to Jerusalem. His village is next to a Jewish kibbutz. He watches his hated enemy drain the swamp and bring the land back to life. He starts questioning everything he's been taught. He shares his soul with Gideon Asch -a Jew! A life long friendship begins. Their friendship is strained and broken at times, but Haj Ibrahim realizes late in the book, that Gideon is the only person he trusts and is is only true friend. An Infidel! All of his life he has been taught to hate the Jew, adhere to the Koran, obey his leaders with a blind faith, and that life on Earth is not to be enjoyed. But his Arab leaders are only after power and wealth. They use and depend upon their illiterate followers to follow the strict interpretations of Mohammed's teachings in the Koran. The Arab society is built on the caste system, hopelessness, and illiteracy. Knowledge is power and if you are ignorant, a man can be persuaded by his leaders to do anything in the name of Allah.The novel also tells the story of the Haj Ibrahim's son, Ishmael. And his story is told in the 1st Person. His story is also stark and harsh, leading to a madness that seems a perfect way to end the novel. In his story we learn of the treatment of women, honor of the family, and questioning beliefs. While the women are treated as chattel, Ismael's mother is very clever. Clever as fox. She manipulates Ibrahim and Ishmael like a violin. But the ultimate story is that the madness in the Middle East, especially the Palestinian area will continue with no end in sight."}, {"userName": "Nonsequiteuse", "userReviewDate": "Aug 17, 2010", "userURL": "http://www.goodreads.com/user/show/3970488-nonsequiteuse", "userReview": "In sixth grade, everything I knew about Israel and Palestine, I learned from Leon Uris. We did not cover the history of that region in school, and if fwe had, I'm sure that the coverage would have lacked nuance.After reading Exodus, I wanted to be Jewish and live on a kibbutz. In sixth grade, the purity and passion of the characters seemed wholly believable. In Leon Uris books, one side very clearly wears the white hat at all times. Given the desperate and horrible situation in the middle east, I understand wanting this to be true. And maybe it is, but human nature and years of hatred will never allow that to be the case, which is of course what makes the crisis so compelling.The Haj covers a period of history from before WW2 through the Suez War in 1956, including the creation of the Palestinian refugee camps throughout the West Bank, Jordan, Syria, Lebanon, and the Gaza Strip. The book essentially asserts that over and over again, Arab treachery and deception, literally brother scheming against and selling out brother, created all of the problems, while the Jewish settlers (and, once they declared Israal a nation, the Israeli nation) were constantly blamed even though they basically said, over and over, can't we just all get along. Reading this book now feels like reading propaganda - funny, because checking Leon Uris's Wikipedia entry, I see that Exodus, his breakout novel, was written after an American PR firm sent him to the mideast in the 1950s. My recommendation would be reading this with a big grain of salt. I suspect Leon Uris novels shaped many Americans' understanding of Israel/Palestine, and so would asset they are important novels for that reason. They shed light onto what has remained an explosive humanitarian crisis, but The Haj shouldn't be your only source of information."}, {"userName": "Rohit Enghakat", "userReviewDate": "Dec 18, 2016", "userURL": "http://www.goodreads.com/user/show/15355957-rohit-enghakat", "userReview": "Finally I finished this ! Reading this book after 30 odd years after it was first published is kind of surreal. This is an account of the Arab - Israeli conflict through the eyes of an Arab-Palestine boy Ishmael. The author weaves a fictionalised account of the creation of Israel. Since I wanted to read something about the history of Israel, I had bought this book as well as \"Exodus\" which is a viewpoint of the conflict seen through the eyes of a Jew. The story is about a Palestine family from the 1920s - 1950s and the travails they go through from being a tribal clan to becoming a refugee. The story seemed a bit biased towards the Israelis showing them in a better light than the Arabs. This is by no means a detailed history but the author has woven a good story in the backdrop of history. Yes this is a decent attempt at historical fiction."}, {"userName": "Ram", "userReviewDate": "Jun 27, 2016", "userURL": "http://www.goodreads.com/user/show/2220787-ram", "userReview": "nice read. The story is interesting, and flows. As it is about my country, the places and events are familiar. The book is about a family of Palestinian refugees and spans from the 1920's to 1957. Through the story of the refugees, the author presents many issues of the Israeli/Arab conflict, and the general attitude of Muslims in the middle east to foreigners. The books introduces the reader to various aspects of Muslim/Arab life…. Religion, treatment of women, family tradition, various social issues, and mainly the attitude to foreigners in general and the Jews/Zionists in particular. If this book would be written by a Palestinian, it would be considered a sensational book and would be treated as an authentic description of the events. As it is, it was written by an American Jew. It includes sentences like \"The short fuse that every Arab carries in his guts had been ignited with consummate ease. Enraged mobs poured into the streets.\"Practically all the Muslims and Arabs are presented as either wicked/villains/cruel or stupid/helpless (and in many case both). The Jews are presented as smart/kind/brave….. etc.I do believe that allot of the narrative of this book is accurate , but there is much more to it."}, {"userName": "Diane", "userReviewDate": "Jun 26, 2012", "userURL": "http://www.goodreads.com/user/show/2557070-diane", "userReview": "I thought this was a very well researched historical novel, both entertaining and informative. It made the history in the region between the 1920s and 1950s easier to understand. The story was terribly tragic and sad. I was aware of the author’s obvious bias while reading it, but had a feeling that what he was saying about Arab and Jewish character was probably based mostly on reality. It seems that the Arab culture, which formed the religion of Islam, was summed up early in the book when Ishmael learned by the age of eight that it was father against son, brother against brother, family against family, clan against clan, tribe against tribe, and most of all, all Islamic Arabs against the infidel. It seems that even now, most of the Middle East is stubbornly stuck in the attitudes of past centuries, and is just waiting for the 7 paradises. I was very interested to see that an Arab reviewed and liked this book, on Feb. 21, 2010, and said that it gives a great description of Arab character."}, {"userName": "Clara Roberts", "userReviewDate": "Nov 23, 2009", "userURL": "http://www.goodreads.com/user/show/1974067-clara-roberts", "userReview": "The book was a fascinating read of Arab and Islamic culture. The Arabs refused to do more than the miniumun amount of work and therefore were amazed to see the hard work of the Jews and some Europeans. This was 566 pages of Arabs sitting around in squalor complaining and expecting someone to come and rescue them. There seemed to be no iniative or ambition to do anything on their own. They had them same resources available to them that the Jews had but lacked any work ethic. Whereas the Jews absorbed their refuges into the larger Jewish society, the Arabs rejected their refugees leaving them in camps to be fed and cared for by American and European largess. No Arab country gave for the needs of fellow Arabs. The Arabs in the book had an almost incomprehensible obssession with sex. Sex of every variey was mentioned. After reading this book it is hard to look on Muslim Arabs with anything but disgust. This is supposed to be a well researched book of historical fiction. If that is true then Muslim Arabs are disgusting."}, {"userName": "Anne", "userReviewDate": "Aug 22, 2007", "userURL": "http://www.goodreads.com/user/show/293764-anne", "userReview": "I picked up this book, thinking that it would be set in Saudi Arabia at the time of the Haj - the pilgrimage to Mecca. Instead it is about the head of a clan who has made the journey to Mecca and takes the name Haj as a title. It is an interesting read as far as Palestinian thought and reason (or lack thereof!) Since I live in the Middle East, I can attest to the reality of the profile presented in the book. There were points in reading the book when I had to pause and say to myself, \"Oh - that's way they act like that!\" or \"Yeah - I've heard people talk exactly this way!\" The setting is in Israel and the \"West Bank\" between the 1920's and the 1950's. The storyline itself is not one of my favorites. My copy conveniently had all the steamy scenes torn out, so I can't say that I would wholeheartedly recommend it, because I don't know the content of all of it, but someone who wants to get inside Palestinian self-destructive thinking and understand the refugee situation - this is your book."}, {"userName": "Jbarth", "userReviewDate": "Aug 14, 2013", "userURL": "http://www.goodreads.com/user/show/1090305-jbarth", "userReview": "I normally love Leon Uris' work so when I saw this in the library I eagerly added it to my stack and ran home to read it. Maybe it's a product of my being a mom and trying to instill a sense of fairness in my kids; maybe it's being a Jew in the thick of the Bible Belt, hyper aware of how I present myself and my viewpoints so that I don't offend or alienate anyone. However, I found myself putting the book down about 1/4 of the way through because I just couldn't handle the smug \"Jews are always superlative Arabs are always ignoramuses who need the Jews to help them figure out how to even breathe\" tone any more. I still love Uris, and will continue to pick up his work wherever I can find it - hopefully the next book will be a little more equitable in it's opinions. :)"}, {"userName": "Chris", "userReviewDate": "Aug 09, 2014", "userURL": "http://www.goodreads.com/user/show/6770267-chris", "userReview": "I marked this as historical fiction although at the time of publication in 1984 it doesn't quite meet the 50 yr guideline. Anyway, I'm torn in how to review this book is it biased? Probably. There are certainly some very black & white situations & characters; however I felt like the descriptions of traditional Arab tribal culture in many areas of the Middle East seems to be as true today. Hatred, vengeance, barbaric brutality, the subjugation of women, the brainwashing of young boys and men. The primary setting is Palestine and covers the period from just before WWII through 1956. Told from the Arab point of view it follows the creation of Israel and the Palestinian refugee crises. It is brutal, and tragic. Told in the first person (young Ishmael) and 3rd person narration, which did not bother me as much as other reviewers, it explored both history and a culture that rigidly stuck to their dogma to the detriment of its people. As you take this journey with Ishmael and his family, you hold out hope for a brighter future for someone in this novel, it is not to be. The best part of the novel I felt was the complicated relationship that develops between Ishmael's father, the muktar of his village Tabar, and Gideon Asch, a Jew."}, {"userName": "Matt", "userReviewDate": "Feb 02, 2008", "userURL": "http://www.goodreads.com/user/show/263698-matt", "userReview": "A certainly biased look at the origins of the Israeli/Palestinian conflict, as it was written by Jewish Leon Uris. It leaves doubts in my mind as a reader as to how fictional or nonfictional some of these events are. I understand it's a fictional novel, but the book spends a lot of time trying to paint the picture of Arab life in the Middle East. The more liberal side of me hopes that Uris has painted a falsified and horribly inaccurate picture because I wish people didn't have to live like that. The more conservative side of me hopes that Uris has painted a falsified and horribly inaccurate picture because I am afraid of what accuracy in this case might mean, especially regarding the Jewish community in Israel.I wonder how a book like this could be published if there isn't a certain amount of truth to what is being written."}, {"userName": "Deb", "userReviewDate": "Jul 25, 2008", "userURL": "http://www.goodreads.com/user/show/1356467-deb", "userReview": "Not the easiest read in the world, but a great look at the history of the Palestinian refugees. I was amazed by the fact that the story is told from the Arab point of view, yet it is the Jews that come across as reasonable, honest, desiring of peace, etc. This book has definitely given me a desire to read some non-fiction on the history of the Arab/Israeli conflict. I want to know how historically accurate this book is."}, {"userName": "KOMET", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/4183137-komet", "userReview": "Several years ago, I read Leon Uris' epic best-seller Exodus. At that time, I had also purchased his other Middle East based novel, The Haj, which roughly encapsulates the same time period as covered in Exodus, albeit from the Arab perspective. But I was hesitant to begin reading it. And so, I didn't begin reading 'The Haj' until about 10 days ago. 'The Haj' is an epic novel centered on the lives of Haj Ibrahim al Soukouri al Wahhabi (the Muktar of Tabah) and his family. It is a story that is told through a number of voices - the land itself, formerly named Palestine from the 1880s when it was a largely barren province of the Ottoman Empire, and on into the mid-1950s following the establishment of the State of Israel in 1948 and its varied impacts on the surrounding Arab nations; and from the perspective of Haj Ibrahim's youngest son, Ishmael. Indeed, it is through Ishmael that the reader becomes witness to the life of the Arabs in Tabah, a village near Lydda and Ramle in what is today the West Bank. In Tabah, Haj Ibrahim is absolute ruler, fulfilling the role of sage, judge, and arbiter of all disputes and issues therein. And, though illiterate, Haj Ibrahim is knowledgeable about the economics of his domain through his brother Farouk (who had been fortunate enough to have been the recipient of a Christian education from missionaries, which made him both literate and skilled in accounting). Up til he was 8, Ishmael (who was born in 1936, the year the Arab uprising in Palestine against British rule broke out; it would last for 3 years) was largely overlooked by his father and lived in the part of the household where his mother Hagar and the other women held sway. Ishmael and his mother were especially close. He was also close to his sister Nada (who was slightly older than him and figures prominently later in the novel). Ishmael, unlike his 3 older brothers, has a great curiosity about the world around him and develops a thirst for knowledge. He wants to learn, to be able to read and write. Whenever Ishmael tried to impress his desire for an education to Haj Ibrahim, he is treated with disdain. Haj Ibrahim sees no need for him to be educated because as the youngest son, he is expected to become a herder of goats. On the other hand, Hagar recognizes that Ishmael has a sharp mind and urges him to try to make himself useful to his father by finding out the true number of all his land holdings in Tabah. In the process of doing this, Ishmael learns that his Uncle Farouk has been pocketing some of the annual profits, and shares this knowledge with his father. At first, Haj Ibrahim is inclined to ignore his son's claims out-of-hand. But when Ishmael is able to present incontrovertible evidence of Farouk's deception, he begins to see that, perhaps, this son can be of use to him. Thus, Ishmael is allowed to attend school, where he becomes one of the best students in class. The novel also explores the relationship Haj Ibrahim had with Gideon Asch, a Jewish revolutionary leader he first crosses paths with when Asch and a group of Jewish pioneers come into the area during the early 1920s to establish a kibbutz near Tabah. Though Arab and Jew are sworn enemies, the 2 men over the next 30 years develop a close, brotherly friendship that Haj Ibrahim takes considerable pains to keep unknown to his community. But in the main, \"The Haj\" is a novel about family and how the convulsive history of the Middle East as played out over the past century affected family relationships and livelihoods. It makes for compelling and at times, maddening and heartbreaking reading. For anyone wanting to get a better understanding as to why the Middle East is what it is today, \"The Haj\" is a good place to start."}, {"userName": "Peter", "userReviewDate": "Mar 04, 2015", "userURL": "http://www.goodreads.com/user/show/3229150-peter", "userReview": "This Leon Uris 1984 classic is worth reading (or re-reading) today in light of current events. It tells the story of an Arab family living in Palestine during the influx of Jewish settlers from Europe prior to World War II, the failure of the Arab nations to deal honestly with the refugees after the 1948 war, and the failure of the refugees to adjust to the new reality, leaving us where we are today, 67 years after Israeli independence, with the refugees still thinking their freedom depends on the destruction of Israel. Uris interweaves the story of his Arab family with historical events and people, but not always successfully as he is stuck with how to end the book--a problem that has been noted by other reviewers. There is no happy ending, no bright light at the end of the tunnel. There is only the piling up of generations on a grave built of religious fanaticism, lies, and betrayal. The latter by the leaders of Jordan, Saudi Arabia, Syria and other Arab nations as well as by their own leaders--from Yasser Arafat to today's leaders who talk out of both sides of their mouths.Uris quotes a Jewish military leader at one point saying \"I can forgive the Arabs for murdering our children. I cannot forgive the Arabs for forcing us to murder theirs.\" That line, the origins of which may have come from Golda Meir, says it in a nutshell. Someone please correct me if I'm wrong about its patrimony. The last thing the Jewish settlers wanted was war. Yes, they wanted independence, but not by removing the Arab population. Many settlers worked consciously to include their Arab neighbors in their communities, which resulted in freeing Arab peasants from feudal relationships with landowners who lived in Cairo and Damascus, but when violence prevailed as the Arab response to changes they were unprepared for, the Jews in Israel had to defend themselves.The Haj is a novel, but novels get at truths in ways non-fiction cannot. This one exposes the foundation of attitudes many of us in the West cannot understand––why a mother would send her teenage son into battle knowing he will die at the same time that women are treated as chattel, why people kill those who disagree with them as Hamas kills \"moderates\" who oppose them, why leaders never go into battle themselves, but always send the weakest and least prepared. In The Haj, the father sees the flaws of his fellow Arabs, but cannot persuade them to take a different course and eventually he succumbs to the same irrationality. Let's hope a leader emerges one day who has read The Haj and sees a different path."}, {"userName": "Beverly", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/4509739-beverly", "userReview": "Leon Uris now gives us the story of the birth of the state of Israel from the Arab point of view. His point of view could be categorized as anti-Arab, so everything he writes needs to be taken with a grain of salt. He follows one family as they cope with the changing times. Haj Ibrahim is the muktar of his village which is situated on the road to Jerusalem in a very strategic spot. Right down the road, on land that used to belong to the same absentee landlord that owns Ibrahim's village, a new Jewish Kibbutz is built. The Haj forms a friendship with the Haganah liasion, Gideon Asch. They become good friends and Ibrahim feels that he is really the only person he can trust. All the Arabs are characterized as being untrustworthy, lazy, scheming, harsh, and embedded in tradition. If they lose a battle, they report that it was a training exercise, testing the Jewish response. They blame everything on the Jews, even when it was an Arab's fault. They are undisciplined and easily manipulated. Their so-called leaders ask thousands of Arabs to leave their homes for strategic reasons. All these people wind up in refugee camps which have no organization whatsoever. Haj Ibrahim and his family wind up in a camp outside Jericho. He becomes a very respected man voicing opposition to the Arab leaders. He is the voice of reason but no one listens to him. This story is very relevant today. It shows how things started to unravel, leading to the current situation in the Middle East. The Arabs have raised generations to hate the infidel whether they are Jewish or other non-believers. It was a hard book to read because they could have lived peacefully side by side with the Jews. Many Arabs chose to stay and their lives have been better. Those that left, were given many choices. They were offered the opportunity to return but they chose not to. They were offered the materials and expertise to build schools, industries, crops, but they chose not to accept. They continue to blame the Jews for all their hardships. It is very sad."}, {"userName": "Nicholas", "userReviewDate": "Nov 26, 2012", "userURL": "http://www.goodreads.com/user/show/7307214-nicholas", "userReview": "As a novel, this book wasn't particularly good. The plot is interspersed (especially at the beginning) with long historical treatises about the history of israel/palestine/the british mandate. Plot-wise, it gets better around page 200, but still feels more like an exposition than a work of fiction. I did find the sometimes narrator (Ishmael) compelling and likeable. But the ending was disturbing and a huge disappointment (I'll leave it vague to avoid spoilers).For historical information, I found the book quite interesting, but I'm concerned about its biases. It clearly presents the Jews as industrious, hardworking, and sympathetic. The Palestinians are also presented sympathetically (displaced by the war, and so on on), but the larger Arab culture is criticized broadly and sweepingly, and the Palestinians are ultimately presented as lazy and to blame for their own lack of making their refugee camps better places for themselves. I'm sure that some of this is true (particularly the depiction of the treatment of women in traditional Arab cultures), but it seems rather one-sided. As someone with Jewish background myself, I find it hard to approach discussions of Israel open-mindedly, and I would love to believe that the Jews wanted the Palestinian Arabs to stay in Israel, and that the Palestinian's continual plight is not the fault of the Jewish Zionists (but rather the British who made such a mess of the whole region, and the Arab nations who invaded Israel and displaced the Palestinians and then refused any peace treaties with Israel that would have let them return). But given that the author was Jewish, and that there are random generalized anti-Arab statements throughout, I find it hard to believe that the book is a completely fair portrayal of the situation.In summary, this book left me wanting to find a non-fiction, un-biased book about the modern history of the region. Which is probably impossible to find."}, {"userName": "Jean", "userReviewDate": "Aug 14, 2013", "userURL": "http://www.goodreads.com/user/show/23100707-jean", "userReview": "I read this book in 1984 when it first came out. I have a note in my records that I thought the book was excellent. I can remember that I did not enjoy it as much as I did “Exodus.” I thought that with all the problems in the Middle East the book might provide me with some insight to the situation, so I decided to re-read the book.The story is about a Palestinian Arab family living in Palestine in the 1920-1950 eras. The main narrator of the story is Ishmael the youngest son of Ibrahim, who is the Muktar of an isolated village of Tabah in the Ajalon Valley. The book drags along, Ibrahim made his pilgrimage to Mecca as a young man. The pilgrimage is called the Haj, thus the title of the book. The story takes us to the formation of Israel and the family chooses to flee Palestine to a refugee camp near Jericho.Uris provides colorful details, descriptions of the country and lots of sex and violence. I had to keep in mind the book is written by a Jew and the time frame of the book is 1920 to 1950. Uris does provide some history mixed into the story. I really enjoyed the part of the story when Ishmael took artifact he found to the archeologist. The history explained by him and the explanation about archeology was interesting. The author does write with some sympathy for the Arabs but mostly the impression I got from the book is the British and Arabs are bad and the Jews are good.I had a totally different response to the book than I did when I read it in 1984. At that time I just enjoyed the story, this time I see the hyperbole, propaganda and the oversimplification. The story remains exciting but now I guess I can see more than just the story. I read this as an audio book downloaded from Audible. Neil Shah does a good job narrating the story."}, {"userName": "Tashfin", "userReviewDate": "Mar 30, 2014", "userURL": "http://www.goodreads.com/user/show/804534-tashfin", "userReview": "The characters are well etched out.It is also true that the middle eastern leaders have a cutthroat policy, something whose absence would have helped the entire region to prosper rather than be stagnated in their present situation with uprisings and wars.While the book has shed some light about how the conflicts began right after the jewish resettlement into Palestine around 1920s, the entire story is a one-sided description where Arab muslims are depicted as inferior blood-thirsty sanctimonious fools, arab christians as turncoats, the British as supreme politicians, UNRWA as an impotent organization and so on.The only 'supermen' seem to be the Jews who have resettled. They fear no one. They can overcome hunger, they can not be defeated, they can be wronged but can do no wrong and more. Even the Deir Yassin incident seems to be a 'mistake that they did not want to do' by the Irgun in the book.There is more. The sexual acts of the protagonist who has also completed his pilgrimage indirectly nudges the readers to the thought, 'See, that is how they really are.'I hope readers who read the book will also read up on Deir Yassin massacre, Israeli involvement in Sabra-Shatila and other recent incidents, to realize that only one side cannot bear the entire blame for the middle east fiasco.The author also blatantly points out that 'Islam cannot live with anyone in peace'. That is a seed that can sprout out to be Banyan trees of hate and intolerance in the minds of many who are non-muslims and have never lived around any practicing muslim.In 2014, there are practicing muslims all over the world, who are living lives in complete harmony with people of other faiths."}, {"userName": "Blaine DeSantis", "userReviewDate": "Dec 24, 2015", "userURL": "http://www.goodreads.com/user/show/2994598-blaine-desantis", "userReview": "Outstanding book. I wish someone had given it to our President and Secretaries of State as Uris really does a fine job in both giving us an operational breakdown on the Koran and a great analysis of the Arab/Palestinian/Israeli situation. Told from the perspective of the Arab narrators this book really does a fine job in giving us a history lesson of the conflict in the Middle East and since it was written in 1984 the characters have also gave us a glimpse of today. I learned so much from this book that I was unaware of with regard to this portion of the world and this conflict. How Arabs and Jews can reach an unwritten compromise and then have the Arabs come out and yell \"Death to the Jews\" and incite riots. Also there are some pretty damning representations of Arab culture and so I definitely recommend this to one and all.As a historical fiction writer, I feel Uris is a peg below Michener and Rutherfurd and even Follett, but he does voluminous research and it certainly appears that his \"history\" in the book is backed up by facts. Good read!"}, {"userName": "Lananorris", "userReviewDate": "Aug 30, 2011", "userURL": "http://www.goodreads.com/user/show/5976599-lananorris", "userReview": "This book was a great source of information about what really lies at the bottom of the conflict between East and West, Jews and Arabs, Arabs and other Arabs, and Arabs and everyone else. It is however, very depressing. It is not uplifting at all. The misery of the Palestinian people is infinite and totally self-inflicted. They are pawns of everyone, but most of all of themselves. The main characters are not really likeable and they do not really like themselves. The life of Haj Ibrahaim, muktar of a small Palestinian village is representative of the Palestinian people as a whole. If what Uris depicts as normal life for an Arab woman is true, then it would be better not to have been born at all. Often I picked this book up out of sheer determination to finish it, not because I wanted to read it. But on the other hand if one can get past the hopelessness and degradation contained within, it is a worthwhile read simply for the historical value."}, {"userName": "Michael Sump", "userReviewDate": "Oct 28, 2015", "userURL": "http://www.goodreads.com/user/show/3050876-michael-sump", "userReview": "A Jewish perspective on the Arab experience from the 1920s to the birth of Israel in the form of a novel. A clear indictment of Arab inhumanity to the Palestinian people. Leon Uris, who is Jewish, is not without bias. However, it seems to me, that he largely tells the true story of a people, the Palestinians, who have been failed again and again by their leaders and by their Arab brothers. A key event of this story has recently been in the news as Netanyahu tried to put the blame of the holocaust on a pre-WWII Palestinian leader. This is nonsense, but there is no question that the Arabs were eager to side with Germany and to participate in the annihilation of Jews, but clearly the idea of this crime did not originate in the Middle East. It is a sad story but one that is interesting and well worth reading."}, {"userName": "Sylvia", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/2379151-sylvia", "userReview": "Powerful look at the Muslim culture, decades before we realized we were at war with it. Larger than life characters, driving plot."}, {"userName": "Lars Dradrach", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/8122169-lars-dradrach", "userReview": "Uris is a good story teller but simply too biased to write meaningfully about the people of the Middle East.Unlike Exodus, which I read as.teenager and ate raw without questioning any of the prejudices, I read this one as a grown up and struggled to complete it due to the unfavourable description of Arabs in general an Islam especially."}], "description": "The New York Times bestselling story of Haj Ibrahim as he tries to lead and protect his village in the time leading up to and following the rebirth of Israel. From the moment Ibrahim is declared the Muktar of Tabah, he is forced to grapple with the growing tensions between the Arabs and the Jews in the Middle East. As fights break out and guerrilla warfare takes hold, Ibrahim’s family and villagers are forced to flee. Separated from the other villagers, Ibrahim and his family struggle for survival as refugees amidst the raging war. Leon Uris is no stranger to writing about the birth of Palestine, but The Haj offers an Arab perspective that gives a comprehensive look at the dynamic history of the Middle East. “Tumultuous.” —USA Today “The Haj plays to one of the strongest and oldest human drives—curiosity, the need to know.” —The Washington Post Book World “No serious study of the Middle East would be complete without the perspective of this book.” —El Paso Times About the Author: Leon Uris (1924–2003) was an author of fiction, nonfiction, and screenplays whose works include numerous bestselling novels. His epic Exodus (1958) has been translated into over fifty languages. Uris’s work is notable for its focus on dramatic moments in contemporary history, including World War II and its aftermath, the birth of modern Israel, and the Cold War. Through the massive success of his novels and his skill as a storyteller, Uris has had enormous influence on popular understanding of twentieth-century history.", "title": "The Haj", "url": "https://www.goodreads.com/book/show/33118399-the-haj", "average": 4.01, "cover": "https://images.gr-assets.com/books/1479964549l/33118399.jpg", "reviews": 406, "authors": [{"url": "https://www.goodreads.com/author/show/19708.Leon_Uris", "name": "Leon Uris"}], "type": ["Historical", "Fiction", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/33118399-the-haj", "http://www.goodreads.com/book/show/42691.The_Haj", "http://www.goodreads.com/book/show/1368232.The_Haj", "http://www.goodreads.com/book/show/28377022-the-haj", "http://www.goodreads.com/book/show/13338549-the-haj", "http://www.goodreads.com/book/show/42697.Exodus", "http://www.goodreads.com/book/show/426825.QB_VII", "http://www.goodreads.com/book/show/42692.Mila_18", "http://www.goodreads.com/book/show/42696.Trinity", "http://www.goodreads.com/book/show/42694.Battle_Cry"]}