{"ratings": 912, "userreviews": [{"userName": "Helen Ροζουλί Εωσφόρος   Vernus Portitor Arcanus Ταμετούρο   Αμούν Arnum", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/20643658-helen-vernus-portitor-arcanus-arnum", "userReview": "Περί της θαυμαστής Χάριτος του Θεού και της Γεννήσεως του μακαριστού Πάπα Γρηγορίου της πέτρας..ή απλώς,Η ιστορία του καλού αμαρτωλού.Ο \"Εκλεκτός\" είναι η μυθοπλασία ενός νόθου παιδιού μοιραίας αιμομιξίας. Καρπός διπλής φρικωδίας που καλείται να εκπληρώσει αναπόδραστα τη Θεϊκή προφητεία.Το\"μπασταρδάκι\" του Μαν έχει καταγωγή απο την αρχαιότητα. Είναι παρακλάδι των Οιδιπόδειων μύθων και των ηθελημένων αιμομικτικών αμαρτιών μεταξύ αδελφού και αδελφής-μητέρας και γιού. Βασισμένος στον αδελφικό έρωτα ο \"εκλεκτός\" άντρας σε διαφορες εκδοχές -ανόσιων ηρώων-της ιστορίας,διαμορφώθηκε ως μύθος στη Δυτική Ευρώπη και ενεπλάκη στην καταγωγή μεγάλων Παπών. Ο Πάπας Γρηγόριος της ιστορίας μας έιναι η εξέλιξη ενός μεσαιωνικού δράματος που πραγματεύεται στοιχεία της Βίβλου διευρυμένα και μυθικά που είχαν αναπτυχθεί και επακριβωθεί μέσα σε επτά αιώνες αφηγηματικής τέχνης και ψυχολογίας. Το δράμα εκτυλίσσεται τοπικά στο δουκάτο της Φλάνδρας Αρτουά και χρονικά σε έναν υπερεθνικό-δυτικό Μεσαίωνα. Στο γλωσσικό κομμάτι παντρεύονται με χιουμοριστικό τρόπο τα παλαιογερμανικά,παλαιογαλλικά και αγγλικά στοιχεία. Ο Γρηγόριος μόλις μαθαίνει πως είναι καρπός αιμομιξίας και ηθελημένης διπλής αμαρτίας αποφασίζει να μετανοήσει. Επιβάλλει στον εαυτό του δεκαεπτά χρόνια μετανοίας πάνω σε έναν βράχο χωρίς φαγητό,νερό,ρούχα ή οποιαδήποτε προστασία του ανθρώπινου κορμιού. (Δεκαεπτά χρόνια μετά ζει και στέφεται Πάπας της Ρώμης). Πρωτίστως έχουμε ζήσει παραμυθένια θρυλική ατμόσφαιρα με βασιλείς,ηγεμόνες,ιππότες,λόγιους ποιητές,άρχοντες,σταυροφορίες και συγκρούσεις κληρικών και κοσμικών ιπποτικών κύκλων.Η Θεία Χάρις αλλά ειδικότερα η Χάρις είναι το κύριο θέμα του βιβλίου. Ο Μαν συνεχίζει κατά κάποιο τρόπο την ιστορία του Δόκτωρ Φάουστους καταλήγοντας σε έναν φαιδρό Πάπα που είναι άγιος κι αμαρτωλός,ένας σατανικός Άγγελος. Ο Εκλεκτός είναι ως ιδέα η αναίρεση του κακού και της κόλασης. Αφού ο αμαρτωλός εξιλεώνεται και ανυψώνεται,σε πλήρη αντιδιαστολή με τον Φάουστους που θριαμβεύει το κακό και η πτώση είναι οριστική. (Άποψη του Μαν για τη μοίρα της Γερμανίας μετά τον πόλεμο)Σε όλο το βιβλίο ο συγγραφέας περιγελά παρωδιακά το παλαιό και το ευσεβές αλλά το κάνει με μελαγχολία και όχι με υποτίμηση. Παρόλη την ειρωνεία και το σκωπτικό ύφος δεν αποπνέει ασέβεια και περισώζει στο τέλος τον Χριστιανικό πυρήνα και την ιδέα της Χάριτος και της αμαρτίας.Η αξιολόγηση μου 4/5 για τον Εκλεκτό έγκειται μόνο και μόνο στο γεγονός μιας δήλωσης του Τόμας Μαν. Όταν κάποιος ευλαβής κριτικός έγραψε πως \"καλαμπουρίζει με τον καλό Θεό\"εκείνος απάντησε: «Ε, εδώ το έκανα με τον Γκαίτε,γιατί να μην το κάνω και με τον καλό Θεό; Είμαι βέβαιος ότι καταλαβαίνει απο αστεία σε τούτη την όψιμη μορφή του θρύλου».  (Υπόκλιση αναγνώστη αναμενόμενη). Καλή ανάγνωση!!Πολλούς ασπασμούς!"}, {"userName": "Nataša", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/4994064-nata-a", "userReview": "Kao što rekoh već, dopada mi se. Pojedini delovi naročito. Rečenice pisane u imperfektu ponajviše :)Pripovedač Kliment Irac mi je sa svojim monolozima prirastao srcu. I čini mi se da imamo sličan smisao za humor :)"}, {"userName": "Kim Jones", "userReviewDate": "Aug 04, 2012", "userURL": "http://www.goodreads.com/user/show/11447440-kim-jones", "userReview": "Magical narration of a story that has no duplicate.Thomas Mann must have had one of the most amazing story-telling abilities of all times. He knows exactly how to keep the reader in insane excitement, constantly feeding them with new, challenging conflict, alternating your emotions between the wish to discover the resolution, and awe of its unexpected revelation.From the cover, I had never suspected the books placement in time, but I was pleasantly surprised. I must say, this novel had fell into my hands at an ideal moment, when I was having a sort of quest to discover everything medieval, an age not dark, as it is commonly known, but that hides in it enlightenment. Most importantly, the ridiculed myths, from which we may have much to learn. And Thomas Mann was able, in his time, to create his own myth, through this novel, inspired by Gregorious and other Biblican and Medieval legends, to explore, alongside unforgettable, hyperbolic characters, their path at the hands of passion, loyalty, evil, magick, and Wyrd.Also, the not exhausting but concise and utterly magical developments had totally brought me into that medieval atmosphere.Conclusion: Without duplicate, unexpected, hyperbolic, enlightening, unforgettable."}, {"userName": "Razvan Zamfirescu", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/19039516-razvan-zamfirescu", "userReview": "Unul dintre motivele pentru care mi-aș dori să știu germană este să pot citi marii scriitori germani în limba lor natală.Este un deliciu să te înfrupți din proza lui Thomas Mann. Or, chiar dacă mâncarea este reîncălzită, Corneliu Papadopol profită la maximum de calitatea ingredientelor și a rețetei secrete care i-a adus autorului Premiul Nobel pentru Literatură și ne servește, cu ajutorul editurii Humanitas, o traducere a unui roman foarte plăcut.Alesul lui Thomas Mann este o reintepretare, ca să zic așa, epopeei în versuri Gregorius a poetului medieval german Hartmann von Aue care, la rându-i, s-a inspirat din literatura și folclorul francez: Vie de Sant-Grégoire.Mă gândeam să încep să vă povestesc puțin despre ce-i vorba dar am să mă abțin pentru că pe mine mă scot din sărite recenziile care îmi povestesc cărțile în loc să-mi vândă ponturi care să mă facă să vreau să o citesc.Pe scurt, Thomas Mann adaptează o epopee medievală la și pentru gusturile omului modern al secolului XX. Astfel avem parte de un roman cu de suspans, incest, răsturnări incredibile de situație, discursuri religioase numai bune de citit și luat în seamă în preajma Paștelui, iar incest, puțin fantastic, picături de umor fin, ce să mai, un roman excelent din toate punctele de vedere.S-ar putea să mai citiți tot felul de recenzii care mai de care mai simandicoase și pretențioase care să vă bage în sperieți datorită, în primul rând, renumelui autorului dar, credeti-mă, acest volum chiar este accesibil, chiar merită și, zic eu, nu ar strica nimănui să-și mai scoată nasul din volumașele ușurele care se scot pe bandă rulantă și să vadă ce înseamnă, cu adevărat, să construiești poezie-n proză.Acest volum este bine venit în orice bibliotecă, geantă de voiaj sau noptieră de weekend."}, {"userName": "Paul Ispas", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/21922974-paul-ispas", "userReview": "Prima întâlnire cu Thomas Mann și am ales fix ”Alesul” sau ”Păcătosul Sfânt” cum au ales englezii să intituleze lucrarea. Neavând nicio tangență cu povestea originală, am trecut prin diverse stări, de la amuzament, semne de întrebare, oripilare, speranță la dezamăgirea previzibilului și șocul plăcut al poveței finale. Mann, ne vom mai întâlni!"}, {"userName": "Bryan", "userReviewDate": "Sep 14, 2015", "userURL": "http://www.goodreads.com/user/show/16951301-bryan", "userReview": "I'm not sure exactly what Mann was going for here, at least beyond the obvious. I'm going to avoid talking about the story, because I just don't think I can do it and avoid spoilers, but I will say there is an overwhelming catholic atmosphere to the book and anyone who is opposed to religious-themed books will probably want to avoid this. I don't mind religion in my books--it's an integral part of life, one way or the other--but if it holds center-stage, I'd like at least to be challenged. Some of the jacket copy on my edition led me to believe the book was an investigation into original sin; Sin does play a primary role, but I wouldn't say that it tries to penetrate any mystery. Overall, the book seems more like preaching to the choir rather than exploring faith. Even so, it's not poorly done--nothing like, say, The Shack, for instance. It sets forth a tale using the parameters of the Catholic faith, and the events conform to those boundaries. The effect, I thought, was tautological. There is a note at the end which indicates Mann took the idea for his story from a medieval chronicle, but I still have to track that down, though it may be in German. At any rate, given Mann's reputation (or my understanding of Mann's reputation) as a writer of ideas, this may not have been the best book of his for me to start with. I still plan on reading his other heavyweights someday (The Magic Mountain and Buddenbrooks: The Decline of a Family, for example), but for me, the best example of the Holy Sinner in literature is still Graham Green's The Power and the Glory.I'd also add that the technique Mann uses here of narrating the story--as if written by a monk during Middle Ages or the Renaissance--does get tiresome by it's end."}, {"userName": "sabisteb", "userReviewDate": "Mar 19, 2011", "userURL": "http://www.goodreads.com/user/show/5100042-sabisteb", "userReview": "Lange vor Rufus Beck und CO war Gert Westphal der König der Vorleser. Er hat die meisten Klassiker gelesen und gab genau wie Rufus Beck jeder Person eine eigene distinkte Stimme.Den Erwählten zu lesen wäre nicht so mein Ding gewesen, aber gelesen von Gert Westphal ist dieses Buch einfach wunderbar. Eine Ödipusgeschichte von Thomas Mann, spannend erzählt und tiefgründig.Absolut empfehlenswert, wenn man mal Klassiker nachholen will. Gert Westphal ist immer eine gute Wahl. Schade, dass er schon tot ist."}, {"userName": "Katie", "userReviewDate": "Jul 24, 2008", "userURL": "http://www.goodreads.com/user/show/1362299-katie", "userReview": "This is a wonderful book of story-telling in lyric, medieval prose. I loved it for its enchanting, rhythmic lilt and its redemption theme."}, {"userName": "Paul Johnston", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/10588046-paul-johnston", "userReview": "This is a really surprising book - and it seems to rather divide people. I have read it a number of times and have always seen it as an extremely arch joke. Mann who is both incredibly sophisticated and incredibly modern takes on the persona of a prudish and credulous medieval monk and with that strange voice (and in a jumbled-up mix of high and low language or languages) tells the most ludicrous tale imaginable. It is outrageous - a constant stream of knowing jokes at the expense of these medieval characters who are so ridiculous in their deeply circumscribed mindsets but then perhaps by extension at the expense of all of us who think we know. Reading it again recently I was struck by how influenced Mann seems to have been by Freud with the characters including the principals doing things for reasons they don't see or knowing things that they do not think they know. I also feel that while Mann's intentions were to write a deeply ironic book, he (and the reader) do get a little bit taken over by the power of the tale and its themes, so one's thoughts about how ridiculous these people and their world view was take on a different hue and it becomes less clear that we are far above them. Indeed, one might even think that while we know much that they didn't, there are also things that we could learn from them or at least aspects of their thinking that can enrich us and broaden our experience."}, {"userName": "una_sussa", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/58821003-una-sussa", "userReview": "L'Eletto è la rielaborazione della leggenda medievale di papa Gregorio che convola a nozze e genera prole con una donna che non sa essere sua madre: una vicenda che tratta il concetto di diversità, colpa e espiazione rese meno drammatiche dall'elegante, piacevolissima ironia di Mann. \"Così da ciò che è orribile e nefando può nascere ciò che è perfetto, come pur debbo riconoscere in questa mia claustrale maledizione. In verità, a rappresentarsi le coniugali gioie di Gregorio l'anima mia riesce solo per una specie di coraggio, di religioso coraggio e per amore del dolore che in quelle gioie si nascondeva, in lui non meno che in lei, come nella rosa il verme.\""}, {"userName": "Francesco Fantuzzi", "userReviewDate": "Jun 17, 2014", "userURL": "http://www.goodreads.com/user/show/6155410-francesco-fantuzzi", "userReview": "O felix culpa quae talem ac tantum meruit habere Redemptorem!\nScelta calzante della germanista Lea Ritter Santini, curatrice dell’introduzione al romanzo, è quella di anteporre tale epigrafe nel presentare L’eletto di Thomas Mann. Le parole del preconio della liturgia romana della veglia pasquale alludono alla colpa del padre Adamo e della madre Eva, gravissima in sé, ma indispensabile per sperimentare la Grazia e la Misericordia del Padre. Attorno a questo concetto chiave si sviluppa tutta la narrazione del romanzo di Mann, imperituramente impresso nella mente della voce narrante (monaco medievale) che ad esso riferisce continuamente, rendendo plausibile l’artificio letterario sul piano del contesto culturale medievale.Il romanzo in sé è tremendamente ironico, e lo è nella misura in cui i grandi autori sanno di essere in grado di essere autorizzati a guardare alle verità importanti con un occhio eccentrico. La prima riflessione che spontaneamente affiora è che Mann - e non altri - avrebbe potuto scrivere un’opera tale. E cioè, anche laddove non vi sia per forza un’opera immensa, si riesce ad apprezzare il genio che l’ha prodotta. Con questa riflessione ci si sposta sulle altre caratteristiche del romanzo. Nel divertimento che l’autore si fabbrica nel manipolare le leggende e la cultura medievali, trovano spazio illuminazioni importantissime su questioni di letteratura della più stringente attualità. Ne sono un esempio, su tutte, le riflessioni che la voce narrante produce in relazione alla figura del narratore nei testi letterari, talmente chiare, lucide, divertenti e ben esposte, da meritare spazio anche nelle nostre lezioni a scuola. La materia in sé mette latamente in relazione il tema affrontato – le leggende medievali attorno alla figura di Gregorio Stilita (il futuro papa) con i dovuti debiti nei confronti del poema di Hartmann Von Aue – con il mito greco di Edipo, ovvero una sorta di reduplicazione in amplificazione dell'incesto (Gregorio stesso, nuovo Edipo, è il frutto di un'unione carnale incestuosa, più di Edipo). Un viaggio nel tempo e nello spazio, una rete di connesioni culturali ininterrotte, riprese e trapiantate, che nella penna di Mann si misurano con la materia cavalleresca, con la lirica di corte, e con la virtuosistica, anche se scontata, invenzione linguistica di un idioma plausibile (ma impossibile) che fonde elementi di francese antico, di medio tedesco e di latino.Per comprendere pienamente il Begriff sotteso a tale prodotto artistico, risulterà interessante la lettura della Nota sul romanzo L’eletto (scritta da Mann stesso nel ’51 e pubblicata nel ’53) giustamente riprodotta nell’edizione Mondadori nella traduzione di Lea Ritter Santini:\n...Amor fati – io non ho nulla in contrario ad essere qualcuno arrivato tardi, un ultimo, uno che conclude e chiude e non credo che dopo di me questa storia e la storia di Giuseppe verranno raccontate ancora una volta. Quando ero molto giovane feci tirare al piccolo Hanno Buddenbrook una lunga linea sotto la genealogia della sua famiglia, e quando fu rimproverato per questo, lo feci balbettare: «Pensavo, pensavo, che non venisse più niente».Per me, ho l’impressione come se non dovesse venire più nulla. Spesso la nostra letteratura contemporanea, le cose più sottili e più alte mi paiono quasi un congedo, un ricordare rapido, un ricapitolare ed evocare ancora una volta il mito occidentale – prima che cada la notte, forse una lunga notte e un profondo oblio. Una piccola opera come questa è tarda cultura che viene prima della barbarie, già guardata da tempo quasi con occhi estranei. Anche se la leggenda irride parodisticamente le vecchie e pie cose, questo sorridere è più melanconico che frivolo e lo stile giocoso del romanzo, la forma finale della leggenda, conserva in pura severità il suo nucleo religioso, il suo cristianesimo, l’idea del peccato e della grazia.\nAnche se lo sviscerarne tutte le implicazioni culturali fa correre il rischio di ritenere questo romanzo un prodotto pesante, la lettura si rivela invece sorprendentemente scorrevole, trascinante, a tratti entusiasmante: siamo di fronte a quello che si potrebbe definire un divertissement confezionato a regola d’arte."}, {"userName": "Tony", "userReviewDate": "Jul 05, 2016", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "THE HOLY SINNER. (1951). Thomas Mann. ***.I have no idea of how many stars this work deserves; I have no point of reference. According to Mann’s postscript, the story is based in the main on the verse epos Gregorius Vom Stein by the Middle High German poet Hartmann von Aue (c. 1165-1210) who took his legend of chivalry from the French. How much of Mann’s work is derivative, I don’t know. I do know that it is unlike anything else that Mann ever wrote. The basic story is about the incestuous relationship that develops between a pair of twins that leads to a child. They panic and try and get rid of the child by putting it in a small boat (like a cocoon) and setting it adrift. The baby is ultimately found and raised by fishermen on an island. He grows up to be a strong and honorable young man. When he leaves the island, he finds himself in another kingdom, where he becomes the hero of a small kingdom that is being threatened by a warlike duke who plans on leveling the city unless its queen agrees to marry him. The queen is – unknown to either party – the mother of the abandoned baby. It goes on for a while, but ultimately plays out with the grown-up son becoming the Pope of Rome. There’s lots of stretch here – told in medieval language in an appropriate background. Honor is everything. The work has elements of the medieval geste plus the standard fairy tale. What I can’t figure out is why Mann wrote this to begin with. There is a simple answer, however: Money. He needed money to get out of the U.S. and away from the HUAC probe going on around him. The book was a selection of the Book-of-the-Month-Club, and was essentially banned by the Catholic Church. With those two events behind you, sales should move up quickly. It was difficult to follow the story – mostly because of Mann’s insistence in using archaic language to tell it. I really don’t know what my star rating means."}, {"userName": "Fırat Koçyiğit", "userReviewDate": "Jun 15, 2014", "userURL": "http://www.goodreads.com/user/show/11183163-f-rat-ko-yi-it", "userReview": "Thomas Mann üstadın belki en güzel eseri. Özellikle cennet vatanımızda \"Venedik'te Ölüm\" ya da \"Buddenbrooklar\" kadar tanınırlığı yok ne yazık ki. Saklı bir define gibi kitapçılarda eski baskılarıyla bekleyen bu hacmi küçük ama etkisi büyük romanda gerçek bir olaydan yola çıkan Thomas Mann'ın o kendisine has lirik/dinî dokusuyla ilmek ilmek işlediği enfes bir aşk ve kader öyküsü bulacaksınız."}, {"userName": "Vik Berbé", "userReviewDate": "Mar 14, 2016", "userURL": "http://www.goodreads.com/user/show/31665466-vik-berb", "userReview": "Een Oedipus story, zo geestig clericaal verhaald dat ik het ondanks dat of dankzij dat graag uitgelezen heb."}, {"userName": "Costacoralito", "userReviewDate": "Mar 09, 2010", "userURL": "http://www.goodreads.com/user/show/3415949-costacoralito", "userReview": "Very well written book that takes you on a wonderful trip that ends up with an epiphany at the end when you realize what the story really is about. On my top 20 book list."}, {"userName": "Saide Kurt", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/44711756-saide-kurt", "userReview": "öncelikle hristiyanlıkla ilgili öğelerin çokluğu biraz sıktı açıkçası. ama hikaye güzeldi. İkizlerin birbirine aşık olması sonrasında kız olanın hamile kalması ve yaptıkları günahtan ötürü oğlanın hacca gitmesi ve yolda dayanamayıp ölmesi ve kızın yani prensesin de sadık silahşörlerden birinin şatosunda kalıp çocuğunu doğurmasını konu ediniyor. tabi devamında prenses kardeşinin (eşinin) öldüğünü duyunca kendini manastıra ve ibadete adıyor. Bu arada silahşörün akıl vermesiyle çocuğu kundaklayıp sandala koyup denize salıveriyorlar. Uzaklarda bir ülkede balıkçılar çocuğu fıçının içinde buluyorlar sonra papaza götürüyorlar. Papaz çocuğun yanına konan altınları ve annesinin soyunun nereden geldiğini anlatan tabletini de alıyor. Balıkçıya iki altın veriyor ve çocuğa bakmasını salıveriyor. çocuk büyüyor manastıra gidiyor. papazın himayesinde dini şeylere kolaylıkla vakıf oluyor. Ama içinde silahşör olma isteği var. papazdan yalvar yakar izin koparıp uzak ülkelere deniz yolculuğuna çıkıyor. sonra bir ülkeye varıyorlar ama tabii orası annesinin ülkesi.. sonra annesini onu almak isteyen hırslı bir prensi yenerek kurtarıyor ve ülkesini. sonra halk bir prensleri olmadığından bu çocuğu prensesle evlendirmek istiyorlar. sonra işte çocukları oluyor sonra prens prensesin annesi olduğunu öğreniyor. sonra yine kendini çileye çekiyor gidiyor anneside falan filan. günah ve kefaretlerle örülü bir yaşam kısacası. odipus un hikayesini hatırlattı."}, {"userName": "Андрій Гулкевич", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/73564219", "userReview": "Такий собі середьовічний роман з вигаданими персонажами. Протагоніст Грігорс, дитина народжена в інцесті, є спадкоємцем герцогського титулу, однак про це йому невідомо, оскільки його немовлям було викинуто в діжців море. На щастя, його врятували англійці та виростили. Коли йому виповнилося сімнадцять, він покидає дім та вертається у рідне герцогство, де перемагає ворогів своєї держави та стає герцогом. Проте однією з умов миру стає одруження на герцогині - на його справжній матері, котра впізнала його. Грігорс живе в гріху, не знаючи, що його дружина його матір. Герцогиня з часом зізнається йому через що Грігорс зрікається титулу, земель і вирушає жебраком у мандри. Проте обставини приводять його до Риму, де стає Папою Римським. Мені сподобався стиль написання, що якомога ближче відображав той, яким писали у Середньовіччі. Зважаючи на сюжет, здалося, що Томас Манн стібеться з католицької церкви."}, {"userName": "Elena Tamborrino", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/21726242-elena-tamborrino", "userReview": "Una sorpresa affascinante questo romanzo di Thomas Mann, scritto nel 1951, pochi anni prima della morte dello scrittore premio Nobel per la Letteratura nel 1929. Si tratta di un romanzo che prende origine da una leggenda su Gregorio Magno, che lo vuole figlio e marito allo stesso tempo di una principessa delle Fiandre; lo stile richiama la narrazione medievale, il romanzo epico e la saga leggendaria a cui grande contributo dà la tradizione di Bruno Arzeni. La lettura è fluida e coinvolgente, i colpi di scena si succedono dalla prima all’ultima pagina, in un crescendo di pathos che lascia il lettore completamente appagato alla fine della storia. Bellissimo."}, {"userName": "cris", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/60145813-cris", "userReview": "Está claro que Thomas Mann escribe de una forma única pero el libro a ratos es muy pesado y lioso. No me arrepiento de haberlo leído pero sí de que este sea el primer libro suyo que leo, ya que me ha quedado la impresión de que Thomas Mann escribe de una forma aburrida (aunque solo a ratos)."}, {"userName": "Yvonne", "userReviewDate": "Aug 26, 2017", "userURL": "http://www.goodreads.com/user/show/13458355-yvonne", "userReview": "I didn't know that Thomas Mann wrote a novel based on Hartmann von Aue's medieval verse epic Gregorius. His style is amazing as usual ... and he also had a great sense of humour which shines through all the time :)."}, {"userName": "Sinem", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/72934495-sinem", "userReview": "ulaşmak için çok çabaladığım bir kitap olmuştu. odipus kompleksi, narsisizm barındıran soyluluk sevdası, ensest ögeleri Orta Çağ dekorunda muntazam işlemiş. Mitolojik bir destana benziyor"}, {"userName": "Christoph Dettling", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/22360274-christoph-dettling", "userReview": "An incredible text that left a profound mark on me and resulted in a lifelong love of German literature."}, {"userName": "Cesar Moreno", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/72681187-cesar-moreno", "userReview": "A book with a very unique writing style that is both serious and comical (in a german kind of way)."}, {"userName": "Laura Caltea", "userReviewDate": "Mar 10, 2014", "userURL": "http://www.goodreads.com/user/show/6164392-laura-caltea", "userReview": "Vechi teme mitologice (incestul, gemenii, nașterea excepțională a eroului), biblice (alesul, îngerul vestitor), curtenești (cavalerul luptând pentru salvarea inaccesibilei doamne iubite, ritualuri ale corteziei), se amestecă în această poveste a păcătosului cel bun care pare a fi o bună ilustrare a celebrei butade aparținând lui Oscar Wilde: „Orice sfânt are un trecut, orice păcătos are un viitor”. Un roman despre păcat și mântuire, despre iubire și vinovăție, despre destin și alegere, un roman despre roman, nu în ultimul rând.De la pupitrul său din biblioteca mănăstirii Sankt Gallen din Țara Alemană, călugărul Clemens („spiritul povestirii”, pe care ți-l și imaginezi zâmbind în barbă pe măsură ce așterne rândurile pe hârtie) are misiunea de a spune lumii povestea cu suișuri și coborâșuri a unui sfânt păcătos. Sub aparențele unei legende medievale, un fel de exempla asemănătoare celor din Viețile sfinților, această „poveste a păcătosului bun” este un fel de biografie exemplară a unui om de excepție (papa Grigore cel Mare, se poate bănui), cu mențiunea că viața acestuia poate fi oricum, numai exemplară nu. Rod al unui incest (părinții săi fiind frați gemeni) Gregorius, eroul romanului, devine la rândul său incestuos după ce se căsătorește cu propria mamă (cu care are la rândul lui două fete). O penitență de 17 ani îl transformă însă pe cel mai mare păcătos într-unul dintre cei mai de seamă conducători ai bisericii creștine.http://lauracaltea.ro/articlesite/ori..."}, {"userName": "Ece", "userReviewDate": "Aug 09, 2014", "userURL": "http://www.goodreads.com/user/show/28941432-ece", "userReview": "İkiz kardeşlerin günah meyvesi, bir fıçının içinde denize bırakılır. Çocuk günün birinde annesini babasını aramaya koyulur. Ne bilsin ki o Tanrı tarafından seçilmiştir ve arama sürecinde annesiyle -ya da halası mı desek- evlenir ve çocukları -yani kardeşleri mi yoksa yeğenleri mi desek- olur.. Bu büyük günah affedilir mi? Kefareti nasıl ödenir? Öykü ruhu bedenize girmeyi bekliyor. \"Oysa, içinde bu ruhun yeniden doğabileceği kadar değerli bir bedenim yok. ... beden, etten ve kemikten yapılma ve tümüyle şeytanın egemenliği altında. Bu nedenle her türlü iğrençliğe ve kötülüğe yatkın. ... Ruhun taşıyıcısı ve Tanrı'nın takdiri olmasına karşın bu gibi işlerden neden vazgeçemediğini anlamak zor. ... bedenin vazgeçilmez bir kötülük olarak değerlendirilmesi gerekir. Ona en uygun tanım budur. ... Bu denli bedensel iğrençliklerle dolu olan ve bedenin kendisini nelere kaptırabileceğini gösteren ürkünç kanıtlarla dolu bir öyküyü korkmadan ya da duraksamadan anlatacak ya da yineleyecek birinin gönlü, bedeni böyle bir ruh taşıyor diye abartılı bir biçimde övünmeye nasıl razı olabilir ki!\""}, {"userName": "David", "userReviewDate": "Jul 13, 2013", "userURL": "http://www.goodreads.com/user/show/11077996-david", "userReview": "Thomas Mann's Holy Sinner is the ecclesiastical version of Twain's Prince and the Pauper. The fable is loosely historical fiction based on the times of the early popes. The pope in this story could be either based on Evaristis or Alexander I because of his contact with the emperor Trajan. His use of holy water to bless houses of worship points more to Alexander I since he is recorded as the one who introduced this practice.Mann tells the story through the monk, Clemens. I like what Mann does...the tale has a casual feel like a yarn spun in a tavern but it also provokes profound thoughts on hereditary sin and redemption. It is also distinguished by shocking turns, namely the double dose of incest. The narrative is enjoyable, is in consistent motion, never stalls, and blends humor and tragedy well enough to hold the reader's interest."}, {"userName": "Edward Jawer", "userReviewDate": "Jan 22, 2016", "userURL": "http://www.goodreads.com/user/show/4537048-edward-jawer", "userReview": "Thomas Mann's extraordinary contribution to great literature has at times been interrupted by the strangest of fairy tales. This one is about the making of a great Pope (Gregory).In the latter middle ages, a great lord's two children commit incest, and create a child who is then put into a small crib size boat, and put out to sea. He survives, grows to become a great warrior, returns to his ancestral home, and without either of them realizing, marries the Queen (his Mother). When they stumble upon this horror, their lives are finished, yet their child flourishes, and grows to become one of the greatest of Pope's.This chilling and magical tale is a different side to Thomas Mann, but a fascinating one. It reads beautifully."}, {"userName": "Vasco Ribeiro", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/32313077-vasco-ribeiro", "userReview": "História de incesto, pecado e redenção. na alta idade média contada por um monge , Clemente, que conta a história de dois gémeos filhos de um duque, que pecam e têm um filho. o irmão vai para a terra santa e morre. ela fica e promete nunca casar. mas 17 anos depois surge um cavaleiro para a salvar de um pretendente, que afinal é o seu filho. ignorando isso, casam têm duas filhas. descobrem o parentesco, ele vai para um penedo, ela funda um albergue para peregrinos. 17 anos depois, milagrosamente, dois bons homens de roma, face a o lugar de papa estar livre, recebem uma mensagem do cordeiro de Deus e vão busca-lo ao penedo onde penava, reduzido a um estado animalesco, de que recupera. E é esta a história do Papa Gregório."}, {"userName": "Stefano Restelli", "userReviewDate": "Jan 10, 2017", "userURL": "http://www.goodreads.com/user/show/62773601-stefano-restelli", "userReview": "\"Mi accingo a narrare una storia orribile e nello stesso tempo altamente edificante\". Così esordisce Thomas Mann nella sua rielaborazione di una leggenda medievale sulla vita di Gregorio Magno. L'opera, quasi ironicamente, ruota intorno ad assurdi rapporti incestuosi nella vita di Gregorio, che creano grottesco stupore nel lettore. Ciò nonostante, come indica appunto lo scrittore nel suo incipit, la figura di Gregorio viene consegnata al pubblico in tutta la sua magnificenza spirituale che si innalza al di sopra di sfortunati eventi, in ciò che sembra un'ode al libero arbitrio e alla grazia e perfezione del perdono umano. Stilisticamente impeccabile e affascinante, come ci si può aspettare da un premio Nobel. Molto consigliato!"}, {"userName": "Cevat Sucu", "userReviewDate": "Jun 04, 2011", "userURL": "http://www.goodreads.com/user/show/5445417-cevat-sucu", "userReview": "The book is based on the Medieval legend of Saint Gregory. Book is interesting because it reconstructs the legend, and it reveals us that one of the main problematics of the Christianity is held in this legend by folk culture so by Mann. \"Being chosen\" by the God, like the parody of Jesus.\" The last speech of the narrator puts the problematic very obviously. There is very weird common motives with the Ancient legends' like Oedipus, and Mann narrates some event in the tragedy technique especially dialogues between indespensible characters of the story."}], "description": "THE BOOK: An epic arch sinfulness, The Holy Sinner is one of Thomas Mann's great works. From the incestuous union of the two beautiful children of the Duke Grimald of Flanders a boy is born. Left to die at sea, the child is eventually rescued & brought up in holiness on the channel islands. Only after marrying his mother does the child come to realise the unwitting - and witting - extent of his crime against nature.", "title": "The Holy Sinner", "url": "http://www.goodreads.com/book/show/250524.The_Holy_Sinner", "average": 3.91, "cover": "https://images.gr-assets.com/books/1417808276l/250524.jpg", "reviews": 64, "authors": [{"url": "https://www.goodreads.com/author/show/19405.Thomas_Mann", "name": "Thomas Mann"}], "type": ["Fiction", "Classics", "European Literature", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/250524.The_Holy_Sinner", "http://www.goodreads.com/book/show/24565049", "http://www.goodreads.com/book/show/536936.The_Holy_Sinner", "http://www.goodreads.com/book/show/20890281-alesul", "http://www.goodreads.com/book/show/7499495-the-holy-sinner", "http://www.goodreads.com/book/show/8064388-der-erw-hlte-ungek-rzte-ausgabe", "http://www.goodreads.com/book/show/23566205-l-eletto", "http://www.goodreads.com/book/show/13604465-l-eletto", "http://www.goodreads.com/book/show/22431544-se-ilen", "http://www.goodreads.com/book/show/23634481-de-uitverkorene", "http://www.goodreads.com/book/show/1466669.Der_Erw_hlte", "http://www.goodreads.com/book/show/35520961-der-erw-hlte", "http://www.goodreads.com/book/show/21414493-alesul", "http://www.goodreads.com/book/show/28576734-o-eleito", "http://www.goodreads.com/book/show/88077.The_Magic_Mountain", "http://www.goodreads.com/book/show/53061.Death_in_Venice", "http://www.goodreads.com/book/show/80890.Buddenbrooks", "http://www.goodreads.com/book/show/53064.Death_in_Venice_and_Other_Tales", "http://www.goodreads.com/book/show/34440.Doctor_Faustus", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}