{"ratings": 2208, "userreviews": [{"userName": "Cathy", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/67927050-cathy", "userReview": "Not a quick readThis was not an easy book for me to get through. I started it once but put it aside for new books that caught my fancy. Last week I decided it was time to clean up all the unread 'orphan books in my kindle and I categorized all of them as currently being read on Goodreads thinking that would shame me into finally reading them all. I am a voracious reader and thought I would have accomplished my goal in a week. This book took 5 days to complete. Sometimes I just had to put the book down because I would be so angry with how the characters were being so cruel or very whiny and sometimes just boring. But I forced myself to finish it and I can say I am glad I did not because the ending was better than the rest of the book, but because it is over. My favorite character in the book is Holger, probably the least attractive, appears in the fewest scenes but has the most empathy of everyone in the book. I highlighted quite a few passages because I did like the author's voice in places. But if this was a road trip I was on I would describe it as a freeway with a few side jaunts that make the trip less dreary."}, {"userName": "K Korona", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/40954742-k-korona", "userReview": "This is easily the worst book I've attempted to read in years. Maybe it's the translation, but the language is stilted and odd. I didn't like any of the main characters in the book. The plot revolves around the dysfunctional relationship between 3 sisters and their history of betrayal, lies, passive aggressive interactions, and selfishness. The lesser characters are one-dimensional. The entire book is made up of the character's thoughts, and very little else, the plot unfolds as in turn we get the perspectives of each sister on the same events. Interaction between the sisters is incomprehensible, and the 3 different perspectives of the sisters fail to make sense or clarify why everyone is so messed up. Not, not, not a good book."}, {"userName": "Lynda Kelly", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/3565785-lynda-kelly", "userReview": "This was my Kindle First choice for August. It was a little slow and repetitive in places but I liked it and would definitely read this author again. Apparently she's written a lot but this is the first translated into English from the Swedish. The three sisters featured are all very different. I was one of three and it's a bad number, really. As two of them tended to gang up on the third, we did too. It was a different pair at different times but one was always left out of what two were maybe giggling about or kept out of what they were up to. These girls are the same, although it seems to always be the same pairing in this tale. I felt pretty sorry for Henrik most of all. He was such a good and decent guy who was taken advantage of a great deal, which was a shame.I did find there was a surfeit of tears throughout.....everyone was snivelling at one time or other !!There weren't too many errors throughout but the ones there were were howlers....this was written-hum3iliated-and how nobody spotted it is beyond me. Sluffed was used instead of sloughed but the worst by far was referring to Lena as Lean at one point....that was a huge old ouch and that cost it the 5* for me.It took me days to get through but I was away while it was on my reading list so wasn't reading as often as at home. A couple of times near the end I was sobbing......but there were also some funny little lines throughout as well. I'd certainly recommend it."}, {"userName": "Cheryl", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/24878504-cheryl", "userReview": "The Heart Echoes opens with Astrid, the eldest of three sisters, purchasing cheese for the family party she is hosting to celebrate Viktor's graduation from high school. She wants everything to be perfect. Unfortunately, she is far from being the perfect wife and parent she wants to be. As we meet Astrid's sisters and mother it becomes apparent that there is a strong undercurrents of tension in heir relaionships wih each other. Throw in the complication of Michael, Viktor's biological father, whom Astrid has not seen since he walked out on her and their one year old son, and and a cancer death sentence and everyone's world is thrown off kilter.This beautifully wriiten story explores how childhood memories echo into adult lives. And how secrets, even those kept hidden for the best of reasons, taint relationships. The delicate interweaving of sibling rivalry, petty jealousies, misunderstandings, lies and expectations exposed by the women's grief is insightful and realistic. The humanity of each of the characters, their experiences and the locales are so compelling developed I felt as though I were there with the women as they struggled to make sense of what was happening.. By the satisfying conlcusion to the story I genuinely cared that everyone would be okay with the way things turned out.I am very disappointed to discover that The Heart Echoes is the only book by Helena von Zweigbergk that has been translated into English. I want to read more from this author."}, {"userName": "Kayo", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/31710254-kayo", "userReview": "Had a hard time getting thru the book. Slow like molasses."}, {"userName": "Helena Halme", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/12646358-helena-halme", "userReview": "This is a heartfelt story of three sisters and long ago buried secrets. I thoroughly enjoyed this novel, especially as it was set in Stockholm in one of my 'hometowns' and favourite cities in the world!"}, {"userName": "Katie athens", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/26950134-katie-athens", "userReview": "The heart echoesI really liked this book. The characters are relatable in their flaws and in their strengths. The book is written from each sisters point of view, which f for me, made it more interesting and allowed me to see each sisters version of life. The ending came to soon and abruptly for my liking. That is the reason behind the 4 stars.  I would recommend this book to anyone with a complicated family whom they love regardless of their flaws."}, {"userName": "Tanya Eby", "userReviewDate": "Apr 20, 2017", "userURL": "http://www.goodreads.com/user/show/4216771-tanya-eby", "userReview": "A lovely, sometimes heart-wrenching, story of sisters who have loved and lost, kept secrets, and found their selves along the way."}, {"userName": "Sue", "userReviewDate": "Aug 31, 2017", "userURL": "http://www.goodreads.com/user/show/4742206-sue", "userReview": "Only my inability to stop a book once I've started it could make me finish this book. The writing seemed kind of choppy until I got used to it, I'm not sure if this is because it was translated to English. The book is related separately by all three characters which makes it seem repetitive. With the exception of Henrik, Astrid's husband, who is too good for her and Lena who is dying, the characters are miserable, unlikable people with messy lives and dysfunctional relationships. There is some reconciliation at the end. Most of the book drags. The exception being Lena's part, which I thought was well written from the point of a person with a terminal illness. That earned it the second star. I got this as a Kindle First choice and am glad I didn't spend money on it."}, {"userName": "Kate B.", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/51632932-kate-b", "userReview": "Not good...Unlikeable & under developed characters. There was no real plot... I chose this as my kindle first pick for August and wish I chose something else. I struggled to finish it."}, {"userName": "Mary L.", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/21227890-mary-l", "userReview": "Not really my type of book but the characterizations were well done. Three sisters, all of whom have found what they thought was a great love but that they do not have at the moment. One sister is dying and they all end up looking closely at what they had and lost. I really didn't like the ending but it was what would or could have happened. Interesting in how they thought the other sisters thought about what they were--and how they really perceived each other."}, {"userName": "Goth Gone Grey", "userReviewDate": "Sep 10, 2017", "userURL": "http://www.goodreads.com/user/show/71053477-goth-gone-grey", "userReview": "This is not a book laden with beautiful moments and happy endings. Flawed characters rich with flawed choices unwind their tale in a multiple perspective narrative. It's elegant and too real, the sisters and their families unraveling in self absorbed misery.Affection for the characters didn't draw me in, but curiosity about what would happen next. Not all of my favorite characters are good people, but they can still be captivating.The story keeps circling back to early or lost loves, how yesterday impacts today again and again. Poetic in sadness, it mires the ladies down in memories and dulls the present; a sound moral lesson as the characters slowly unravel from their original perceived perfect lives.The translation from Swedish is fascinating, with so many universal themes about life. Reading it as an American, it was interesting to see the differences in culture, like apartments being more the norm than houses and iPads for kids seen as a luxury, not a necessity nearly handed out in the delivery room."}, {"userName": "Deborah", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/9129277-deborah", "userReview": "The story line was interesting. Three sisters who suddenly have to face the decisions they have made in the past that have taken them to the point where they are in life, while dealing with the illness of a loved one.I was looking forward to reading the book, but I found it disappointing. The characters of the the three sisters are well fleshed out, but there seems to be some contradiction in the way the characters act at times, which is okay, because few people are consistent in their reactions at all times in their life.I guess the main problem that I have with this book is the excuse that two of the characters were young and immature when they made mistakes or choices. From where I am from 24-26 year old are adults and should be held responsible for their actions. Instead of taking responsibility, they give excuses and run away from the problems.Their actions have impact on the rest of the family...which leads to my other \"problem\". Does it really take someone 16 or 17 years to come to terms with the past? The main character has married and started a family with her new husband. He is a loving and supportive spouse. I would think she would have found a way to move past her \"past\" by this time, after all she is described as an \"adult\", \"accomplished\" and successful career woman, wife and mother.The one sister, who is supposedly controlling and jealous of the other two sisters, appears to be the only sister who is actually loving, caring and selfless in her actions.This book is filled with grownups who are selfish, self-centered people who don't ever \"talk\" to each other, but instead are judgemental and more juvenile than the young teens/adults in the book. While the adults are harping at the children to stop acting so selfish, they in turn are much more selfish and self absorbed than the children, who are actually sweet and delightful characters.By the end of the book, I was happy that the characters were not my family or friends. This may seem harsh, and I am sure many people will find the book insightful, and I agree there are some poignant moments and thoughts, however I truly hope that most people are more loving, thoughtful, forgiving and mature than these characters. Overall, the book left me with a flat feeling. I am glad it was a free read."}, {"userName": "Keli Larson", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/52100708-keli-larson", "userReview": "It's rare for me to want to stop reading a book, and I wanted to stop reading this one. It read like someone's unhappy diary. Very heavy on descriptive thought, rather light on dialogue. There's not enough character development early on in the book to be able to buy into the choices being made by the main characters; and the development that comes later (stilted and overly typical) seems to attempt to justify the characters' moral choices. The three sisters in this book each seem rather self-absorbed; one, perhaps, has reason to be - but regardless, all three seem to simply wallow in their current state of affairs and endlessly discuss in that descriptive thought that state of affairs. I think this book doesn't work because it wants to provoke inner reflection, but it's too heavy-handed and directionless. I don't mind a sad book; not at all. If the sadness is purposeful. This book is simply depressing. This read feels like that conversation you have over and over again with a friend who says they want to change but don't, really - they just like having the conversation about the idea of change. It's tiresome. It's difficult to commit to after some time. Parts of the storyline itself were intriguing enough to finish the book...But I wish I could say I enjoyed it more."}, {"userName": "Carol", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/2347325-carol", "userReview": "Like a pebble being dropped onto the surface of a still pond and the ripples that then extend for a very long distance, this is the story of how one act reverberates in the heart for a very long period of time impacting all those within its circle. But which act is it that echoes: the husband's infidelity, the sister's betrayal, the wife's blindness to self and others? There are four husbands, three sisters, four wives, four mothers, four fathers, and five children whose stories are interwoven. The author does a very good job of pulling the reader into a very sad story. The reader continues turning the pages as the story unfolds hoping for the happily ever after ending, knowing that one aspect will not end so but hoping that moment will be a turning point. It is a turning point but not the happily ever after which in reality is a reflection, and echo, of life."}, {"userName": "Heather  Erickson", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/28965215-heather-erickson", "userReview": "A Hard Book to ReviewFirst, the pros of this book:The story is excellent. I could easily see this made into a movie. It moved me to tears. It was a five star story.Now, the cons:At first, I thought it might have been the translation that was the problem. The book reads in such a stiff manner. But I think it has more to do with being written in the present tense. It's so, in your face. To make matters worse, we must continuously hear the same timeline role over and over again in each of the sisters ' voices. It is a jarring adjustment. Also, the people are not likable. Perhaps it's a cultural thing, but they are all so cold. The one exception is Henrik. This made it difficult to read. I would not this book. It's a shame, too, because there is so much potential there."}, {"userName": "Snorki", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/63367250-snorki", "userReview": "This was a free Kindle monthly book, and certainly not the worst I’ve read out of that series. The novel focuses on the lives of three Swedish sisters with very different lives and circumstances - from the stylish and controlled Astrid with a perfect family life, to dancer Sandra and businesswoman Lena. We learn more about each with different chapters written in different voices, as a family tragedy exposes secrets from the past. It is a well written book, with an interesting Swedish setting, and the characters are also well-fleshed out. But I can’t say that I really liked any of them, and in the end, that made the book less enjoyable."}, {"userName": "Cathy Pierce ", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/5763066-cathy-pierce", "userReview": "The same events are seen thru the eyes of each character. For example, each character tells their perspective of what happens at a high school graduation. This format continues thru the story. It gets a little boring. Several times I thought 'if this keeps on, I think I'll quit reading this book'. But there was a enough interest (or something) to keep reading til the end. Many of those perspectives could have been eliminated and made the story shorter and more interesting. There were times when the wrong words were used to portray the point of view. A good editor should have caught those mistakes. I would not recommend unless no other book choices were available."}, {"userName": "Lee Ann", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/59958566-lee-ann", "userReview": "ReflectionsAt first I wasn't sure about this book, this selection. As a daughter a sister and not a mother it evokes much in the way of confusion and clarity at the same time. I saw myself though each of the women's eyes even if I did not live this life.Strength comes not from living a lie, it comes from standing in absolute truth even when it hurts. You just have to find the courage inside to find it. We as women are much stronger together if we would only look past the external things we believe are true.This book shows true faith, strength and resilience even in the face of adversity and how being real is all we have."}, {"userName": "SHARON  Boyle", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/39894030-sharon-boyle", "userReview": "True sistersThe author must herself be one of three sisters. She captures the nuances of sisterhood effortlessly. Her women , with all their imperfections, are so real; we know each of them intimately from the very first pages, from petty jealousy to unconditional love. The death of one must be the death of the two that are left. Their lives are so changed and irreconcilable from before to after that they can't be maintained. All in all a most fascinating read filled with insights into what it means to be sisters."}, {"userName": "Cindy Piller", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/70163377-cindy-piller", "userReview": "Having just returned from Stockholm, I wanted to add to that experience, and this book did it. The story of these three sisters, bound by a few family secrets and shared experiences from different perspectives, was very enjoyable. I do wonder how the translation affected the reading experience. I loved re-envisioning Stockholm's oldest area with it's narrow alley's, tightly-spaced buildings, and cobblestone streets. I could see those picnics, the food on the tables, and experience the weather. Zweiggberk did a great job with the ending; it wasn't what I expected, but it is so right."}, {"userName": "MartyAnne", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/5731600-martyanne", "userReview": "Separation and connectionAt times I wanted to shout at the characters to tell them to get on with it....go ahead, all of you, devolve into your worst selves, if you must, but hurry up, finish the job! I felt that every character was so damned morose. The one spark of joy is a daughter dancing, and the adults involved merely used it as cannon fodder. I have no idea why I kept reading. And then there was a great love, so large it spanned oceans. Then the gathering of sisters, trying to move beyond their implacability. Impossible but Imperative. Reaching for connection."}, {"userName": "Vickie Sigler", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/51362894-vickie-sigler", "userReview": "Keep a hanky handy!This is a touching, thoughtful story about three sisters who, like all siblings, have their ups and downs, their misunderstandings and their moments of clarity. Each has their own separate life, but also their communal life, with all the joys and sorrows and betrayals and forgiveness that come with being part of the family that we don't get to choose. It centers around an illness, so keep the hanky handy! Well worth the read.This is the author's first novel to be translated into English. Hoping they'll do more."}, {"userName": "Carol A. Farrish", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/50686505-carol-a-farrish", "userReview": "I came upon this book when looking for something of substance to read. This story of three sisters and their mother dealing with the impending death from ovarian cancer in one sister was played out against other life crises each faced. It reinforces the point that everyone's life has tensions that they may try to keep below the surface but that eventually erupt. Had the sisters and other characters in the book been able to be more honest about their lives, perhaps they could have helped each other and reduced some off their pain.It made me do a lot of thinking."}, {"userName": "Crystal Moreno", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/40865402-crystal-moreno", "userReview": "A story with no ups...I read a lot of books and my mood can be greatly influence by them, if you are the same way - take caution before reading. The story in itself is good but depressing and can make you oddly reflective, if you let it. The book has also been translated so it can get a little off when you're reading from a character's perspective and suddenly it's in the third person."}, {"userName": "Marissa Crawford", "userReviewDate": "Sep 10, 2017", "userURL": "http://www.goodreads.com/user/show/40060558-marissa-crawford", "userReview": "Perhaps I'm being generous because it was my Kindle First selection so I didn't have to pay for the book. I could see the potential of this book and its plot. But, like others have said, the writing is very stilted and formal. I think it is the translation from Swedish. I didn't like any of the characters besides Henrik. I struggled through the book but, ultimately, I could see how this could be a very good book and that's why it gets three stars."}, {"userName": "Leigh", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/9321582-leigh", "userReview": "The story of three Swedish sisters during the summer one of them is dying. The theme seems to be “coming into one’s true self” through adversity. Interesting, if not very likable, characters. The book was a fail for me because I couldn’t overcome the air of Scandinavian gloom that permeates the pages. I did love some of the author’s metaphors and a few sharp insights. But not enough to send me down the path again."}, {"userName": "Nancy", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/51312006-nancy", "userReview": "I'm wondering if this story lost something in the translation. I found the characters unsympathetic with the exception of Lena who was dying of cancer, not something I care to read about. I didn't like how Astrid treated her children or husband and carrying a torch for her former love was ridiculous. The best part was the ups and downs of the relationship between the sisters and how that grew and changed over time. If you like family sagas you may like this book."}, {"userName": "Barbara", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/2511537-barbara", "userReview": "This was a book I attempted to read for a book club. The idea was interesting enough. It dealt with the relationships of three Swedish sisters and their mother. I abandoned it about halfway through for several reasons: It seemed both boring and depressing, there was lots of cursing, including frequent use of the \" F bomb\", and the sisters didn't seem to have many admirable qualities that made me want to get to know them. Simply put, it wasn't the type of book I wanted to spend my time reading."}, {"userName": "Susan Boyd", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/39411449-susan-boyd", "userReview": "Absolutely loved it!If you are a fan of family drama and secrets, this is the perfect book for you. It was definitely a page turner and I love how the author gave a point of view from each family member. Best book I've read in a long time, and the ending was very appropriate, never leaving you guessing of how things would turn out. I love books with a solid ending and this one has one."}], "description": "Swedish sisters Astrid, Lena, and Sandra have struggled to get along since childhood, but when Lena is diagnosed with ovarian cancer, they are each thrown into crisis together.Astrid’s well-ordered, predictable world is shaken by the return of her ex-boyfriend Michael, an American who abandoned her—and their infant son—years earlier. While Astrid has remarried and had more children, she is suffocating under her husband’s kindness and cannot escape the pull of the past. Seeing Michael at their son’s high school graduation reawakens her grief and rage, along with more complicated and threatening emotions.Envious of Astrid’s seemingly stable life, Sandra is married to an alcoholic and drowning in debt. She turns to Lena for help at the worst possible time. Lena, fighting to stay alive, must finally confront a devastating secret she’s kept from Astrid since the summer Michael left. As the walls they’ve built between them crumble, the three sisters must try to forgive and to rebuild their shattered bonds…while there’s still time.", "title": "The Heart Echoes", "url": "http://www.goodreads.com/book/show/35670397-the-heart-echoes", "average": 3.64, "cover": "https://images.gr-assets.com/books/1499991378l/35670397.jpg", "reviews": 164, "authors": [{"url": "https://www.goodreads.com/author/show/1396309.Helena_von_Zweigbergk", "name": "Helena von Zweigbergk"}, {"url": "https://www.goodreads.com/author/show/163203.Tiina_Nunnally", "name": "Tiina Nunnally"}], "type": ["Fiction", "Abandoned"], "outlinks": ["http://www.goodreads.com/book/show/35670397-the-heart-echoes", "http://www.goodreads.com/book/show/33149086-the-heart-echoes", "http://www.goodreads.com/book/show/4014092-ur-vulkanens-mun", "http://www.goodreads.com/book/show/13274955-anna-och-mats-bor-inte-h-r-l-ngre", "http://www.goodreads.com/book/show/7117497-s-nt-man-bara-s-ger", "http://www.goodreads.com/book/show/26844136-k-rleken-till-livet", "http://www.goodreads.com/book/show/32718193-de-beh-vande"]}