{"ratings": 76044, "userreviews": [{"userName": "Raeleen Lemay", "userReviewDate": "Jun 07, 2015", "userURL": "http://www.goodreads.com/user/show/3452652-raeleen-lemay", "userReview": "*finally read the book*This was awesome! This book was like some sort of weird mashup between Lord of the Flies and Frankenstein, with a little dash of Sweet Tooth. Sounds weird, but.... well, this book was definitely weird, but I love weird! I read this book because of how heavily it influences the third season of Orphan Black (aka my fave show), so reading it with that in mind was really interesting. The book is about a man who is stranded on an island where Dr Moreau has been messing around with living creatures, and Orphan Black has a healthy dose of that as well (minus the island lol). All in all, a great book, and I'm glad I finally read it!pre-readingThe fact that I suddenly have a huge urge to read this has NOTHING to do with the fact that I've been binge-watching Orphan Black. Nothing at all."}, {"userName": "Lisa", "userReviewDate": "Jul 15, 2016", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "H.G. Wells is undoubtedly an exceptional human being!Apart from the fact that \"The Island of Doctor Moreau\" is clearly part of the Victorian science fiction tradition, it contains all elements of a timeless study of the human condition, as well as a reflection on issues that are more worrying now than they were in the 19th century.Do scientists have to follow ethical rules, or are they entitled to indulge in experiments that satisfy their curiosity, regardless of the consequences? In the tradition of a kind of pre-catastrophe Frankenstein, Doctor Moreau himself answers the question without any doubt:\"I asked a question, devised some method of getting an answer, and got - a fresh question. Was this possible, or that possible? You cannot imagine what this means to an investigator, what an intellectual passion grows upon him. [...] To this day, I have never troubled about the ethics of the matter.\"While Wells leaves it to Moreau's creatures to punish him for this detached attitude, I am reminded of a real scientist who reflected upon the question himself, and understood the ethical dilemma of unrestrained science. When Oppenheimer quoted the \"Bhagadvad Gita\" to express his pain over his contribution to the development of the atomic bomb, he illustrated the path towards responsible science: \"I have become Death, the destroyer of worlds!\" The need to understand the consequences of scientific curiosity is the implicit message. Only if we manage to act responsibly with our inventions, hope in the future will be possible. Interestingly, Wells ends his story with the notion of hope, not because there is any reason for it, but because it is not possible to live without it. This closes the circle of Pandora's box, opened out of curiosity, unleashing all the terrors of the world, but leaving hope for humankind to be able to bear its fate.Apart from the obvious question of science and ethics, I found another story line in the short novel equally interesting. What makes us human? Main character Prendick paraphrases Descartes' idea when he notes: \"He was a human then[...] for he could talk.\" Being able to communicate thoughts, feelings and ideas certainly makes us human, and it makes us storytelling animals, readers, Goodreads users. Over and over again, we repeat our stories, we reread them and re-interpret them, and I find it almost heart-breaking to follow the Beast Men's ritualistic repetition of the story they commit to - The Law, told with authority, transmitted as a poem to recite. It evokes the development of Margaret Atwood's Crakers, who also need religious origin stories and powerful poetical words to become fully human. Her MaddAddam develops the idea of humanity as a community based on mythical storytelling to perfection, but Wells reflected on the same theme, as did Oppenheimer, when he chose to quote a timeless Indian classic to express his feelings of distress regarding the creation of modern horror.Looking around my house on this typical Swedish sunless summer day, I can only agree with the definition of humanity as a bunch of voracious story consumers:My eldest son is on the living room sofa, reading Zola's \"Germinal\", and I am vaguely jealous that he gets to do it for the FIRST time. The magic of it! My middle child is on his bed, reading a fabulous golden hardback version of Star Wars, the trilogy, and the story behind this reading adventure is well worth reflecting on: he found it in a bookstore, and begged me to buy it, despite the fact that he had already seen the movies, and we have as a rule that you read first and watch then. But since he DIDN'T KNOW there was a (thick!) novel, he asked for permission to reverse the procedure. Verdict on his part: so much more detail in the book! My youngest child is at the kitchen table with a pile of books that she seems to be reading simultaneously: She is in the middle of the Laura Ingalls Wilder series, and well into the fourth or fifth of \"Anne of Green Gables\". Oh, to be going back to Avonlea with her. Another memory of childhood reading bliss! So, I can hear my Middle School students pointing out that I am digressing from the digression right now, but my point is that \"The Island of Doctor Moreau\" brought it back to me why I read in the first place, why it makes me feel happy even when the content of the book scares and worries me. There is something unifying, peaceful and fulfilling in sharing books over cultural, generational and language borders, and it gives me hope for the future, even in times of violence.I will let Prendick have the last words, since he inspired this digression:\"There it must be, I think, in the vast and eternal laws of matter, and not in the daily cares and sins and troubles of men, that whatever is more than animal within us must find its solace and its hope. I hope, or I could not live.\""}, {"userName": "Brad", "userReviewDate": "Mar 25, 2008", "userURL": "http://www.goodreads.com/user/show/1022982-brad", "userReview": "Much creepier than I expected and much smarter, The Island of Dr. Moreau, as with so much of H.G. Wells' science fiction, addressed the ethical pitfalls of a scientific eventuality far too early to be anything other than prophetic, yet it still manages to be more entertaining than preachy. Edward Prendick finds himself shipwrecked on an island with Doctors Montgomery and Moreau. The former a follower of the latter, who just happens to be a mad vivisectionist. Beyond these scientists, Prendick finds himself intensely weirded out by the other inhabitants of the island, frightening man-animals created by Dr. Moreau. Moreau captures the island's animals and painfully turns them into half-men, then forces them to live by strict standards that he believes will overcome their bestial natures. Moreau's primary commandment is that they cannot eat meat. This is, of course, a recipe for suspense and horror, for how can one expect Leopard Men or Puma Men to curb their need for meat, when the humans conducting the experiments cannot curb their own bestial natures? It simply can't be done.Prendick finds himself becoming a participant, although not entirely willingly, in Moreau's society of vivisection. And once the animals finally rebel, as we know they must, he becomes the last man on the island, watching the tortured animals return to their natures and throw off Moreau's pseudo-society.Even now, one hundred and thirteen years after it was written, The Island of Dr. Moreau is spooky enough to work as an effective horror/sci-fi story, but its still relevant thematic depth is what makes Moreau essential to anyone who loves books. Genetics (eugenics), animal experimentation, psychology, colonization, imperialism, patriarchy, scientific chauvinism, religion, and ethical imposition are seriously and intelligently explored. Wells' implied conclusions may be unsettling at times, but The Island of Dr. Moreau will make you think. China Mieville says that Moreau is \"a kind of fantasy echo of Shakespeare’s The Tempest.\" Could there be higher praise than that?"}, {"userName": "Leonard Gaya", "userReviewDate": "Jan 28, 2016", "userURL": "http://www.goodreads.com/user/show/27098959-leonard-gaya", "userReview": "This book stems from an idea that is at the same time thought-provoking, insane and very tangible. That is probably the reason why it is so scary. It is a classic of the victorian era, but for some reason probably not as famous as many other fictions of the “gothic” movement and indeed not as well known as a few other novels by H.G. Wells (such as The Time Machine, The Invisible Man or The War of the Worlds). But it definitely deserves to be read again today.The plot is rather simple: a castaway by the name of Prendick ends up on an uncharted island in the Pacific Ocean and meets the infamous Dr. Moreau and his assistant. Dr. Moreau is known for having practiced vivisection experiments some years before in London and, as a result, was excluded from the scientific community. Prendick later discovers that Moreau has been carrying on with his experiments and has created some monstrous beasts, while trying to turn animals into some wretched semblance of human beings. This discovery is planted and built up with some amount of suspense right from the first pages until it is fully exposed around the middle of the novel, in the chapter entitled “Doctor Moreau Explains”. The second part of the book is a nail-biting account of the catastrophic series of events that follow the dreadful discovery.Obviously, “The Island of Dr. Moreau” is in the same vein as Gustav Meyrink’s The Golem or Shelley’s Frankenstein (it can also evoke earlier figures like Shakespeare’s Prospero and Caliban in The Tempest, or even Shylock’s most famous lines in The Merchant of Venice). It is about the hubris of men attempting to imitate God and create a human being with the help of science. The result is invariably dreadful and deadly. Wells original treatment of this theme rests upon the idea of vivisectional experiments carried on animals in an isolate place: mammals are surgically and chemically modified to look and behave as much as humans as they possibly can. But the mental distress caused by this novel lies of the fact that these attempts are always cruel, disastrous and abortive. The Isserley of Under the Skin is a distant relative of Moreau's creatures.In some way, this book presages WWII’s Nazi’s “scientific” testings or even today's plausible out-of-line genetic engineering initiatives. Wells closes the book with these words: “the manufacture of monsters - an perhaps even quasi-human monsters - is within the possibilities of vivisection.” But, more deeply, perhaps, the horror lies in the fact that this fiction shows how feeble and unreal our human values are (including religious ones), and how easily men can fall back below animality."}, {"userName": "Fernando", "userReviewDate": "Aug 19, 2016", "userURL": "http://www.goodreads.com/user/show/7665532-fernando", "userReview": "En tan sólo cinco años, H.G. Wells escribió este libro, \"El Hombre Invisible\", \"La Guerra de los Mundos\" y \"La Máquina del Tiempo\", lo que demuestra la potencia creadora de la que era capaz este gran autor a la hora de sentarse a escribir.Cada una de estas novelas son innovadoras, brillantes, futuristas. Contemporáneo de Julio Verne y tan inteligente como el escritor francés, se hizo famoso por sus libros de anticipación científica acompañados de una aventura bien llevada de mano de la literatura.Pero lo que distancia un poco a Wells de Verne es que sus novelas tienen un trasfondo, plantean dicotomías o denuncian los potenciales peligros que sabemos generar los seres humanos.Es también importante destacar que estas novelas terminan siendo un pequeño estudio sociológico de la humanidad. Cualquiera de las cuatro novelas tienen esos detalles. En \"La Guerra de los Mundos\" podemos reemplazar fácilmente a los marcianos por países que invaden y lo destruyen todo (ver las fotos de las tropas nazis invadiendo a Polonia en 1939 tiene el mismo efecto horroroso que la de las naves alienígenas de largas patas caminando por nuestro planeta en esa novela).Si nos detenemos en \"La Máquina del Tiempo\" nos encontraremos con otro náufrago como el de este libro, pero atrapado en el tiempo, y ¿qué encuentra? que el planeta en el futuro sólo está poblado por dos razas: Los Eloi y los Morlock. Los primeros son los que disfrutan de las bondades del planeta y la vida mientras que los otros son oscuros seres que viven en las cavernas, apartados de todo sistema humano y social. Eso claramente nos muestra que hay una historia detrás de esa historia. Y no se trata solamente de la dicotomía Eloi/Morlocks, sino en marcar las graves diferencias sociales que existían en la Inglaterra de su época.Y si recordamos la historia de \"El Hombre Invisible\", Wells nos dice que no es tan divertido ser invisible. Es más bien un sufrimiento. Griffin, el personaje principal es un científico que en su afán de lograr la invisibilidad pasará las de Caín y experimentará las peores vicisitudes posibles que su nueva condición de invisibilidad le da, dejándolo al borde del paroxismo. Yendo a \"La Isla del Dr. Moreau\", nuevamente descubrimos parte de los argumentos planteados en algunas de las otras novelas. Nos cuenta que los peligros de los avances científicos pueden ser letales si se los utiliza en forma errónea. Una cosa es querer mejorar la calidad de vida de los seres o buscar la cura de los males que nos aquejan y otra muy distinta es \"experimentar\" persiguiendo algo con obsesión y ceguera.Moreau quiere \"humanizar\" a los animales a partir de la vivisección y allí reside su error, por eso nos preguntamos: ¿para qué?, ¿con qué objeto?. Él intenta explicarlo cuando dice \"Esta vez acabaré por completo con el animal, esta vez haré una criatura racional de mi propia invención.\"Nuevamente pregunto: ¿era necesario? Moreau queda a mitad de camino entre Víctor Frankenstein y Dios. Altera la naturaleza de los animales para llevarlos a la condición humana en pos de una civilización artificial, de una nueva especie. Edward Prendick intenta razonar esto cuando descubre que está sólo a merced de tantas criaturas extrañas y hombres bestia en su propio hábitat pero ajenos a su lógica condición animal. Para llegar a conseguir criaturas como \"hombres-leopardo\", \"osos-toros\", hienas-cerdo\" y otras aberraciones, Moreau parte de animales normales mediante una dolorosísima vivisección de laboratorio para que estos puedan comenzar a humanizarse, hablar dentro de lo que su capacidad les permita e incluso caminar en dos patas.Wells, con maestría, nos advierte que eso es peligroso, que no se puede alterar lo natural, no significa ninguna mejora ni para los animales ni para los hombres.Pendrick lo afirma en un momento con todas las letras: Los animales pueden ser muy astutos y feroces, pero sólo el hombre es capaz de mentir y tiene razón.Los animales no mienten, no matan por matar, no destruyen su propio medio ambiente para estar más cómodos, los animales no discriminan, no abandonan a sus seres queridos. A veces, escucho a ciertas personas mofarse de otras que están haciendo algo indebido exclamando cosas como \"¡mira lo que está haciendo tipo, cómo puede ser tan animal!\" Cuán equivocados están. ¡Es tanto lo que a los seres humanos nos queda todavía por aprender de los animales!"}, {"userName": "Bill  Kerwin", "userReviewDate": "May 21, 2007", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "Popular historian and utopian novelist H.G. Wells is sometimes thought of as the “anti-Gibbon”: whereas Edward Gibbon devoted himself to studying a culture’s “decline and fall”, H.G. Well’s celebrates the march of progress, showing how our culture, despite many obvious setbacks, moves on toward greater and greater achievements. But Wells, although an optimist by nature, was also a gifted literary artist, and when he seized upon an idea with disquieting implications, he did not hesitate to explore them. The Island of Dr. Moreau, perhaps the greatest and disturbing of his “scientific romances,” is an example of his uncomprising art at its best.The plot is straightforward. The shipwrecked Edward Prendick ends up on an island presided over by the once notorious but now discredited surgeon Dr. Moreau, who has dedicated his life to transforming animals into humans by a series of painful operations. His more successful failures (all his works are failures) have formed a society on the other side of the island, where—with the doctor’s help--they have created an ethical system that “men” like them should follow, and a religion too, in which above all else Dr. Moreau and his laboratory (the House of Pain) are both reverenced and feared.The book has many themes, the most obvious of which are the morality of both animal experimentation (or “vivisection,” as it was called in Well’s time) and the use of pain in experimentation, but also touches upon the twin processes of evolution and degeneration, the nature of religion, the character of a man who would play God, and—yes—even the character of God himself and the deplorable semi-human beings that he “creates.” This last theme is perhaps the reason why an older Wells once referred to this book as “an exercise in youthful blasphemy.”To give you an idea, here is a bit of the most blasphemous portion of the book, in which Dr. Moreau explains himself to Prendick:\n“So for twenty years altogether — counting nine years in England — I have been going on; and there is still something in everything I do that defeats me, makes me dissatisfied, challenges me to further effort. Sometimes I rise above my level, sometimes I fall below it; but always I fall short of the things I dream...These creatures of mine seemed strange and uncanny to you so soon as you began to observe them; but to me, just after I make them, they seem to be indisputably human beings. It’s afterwards, as I observe them, that the persuasion fades. First one animal trait, then another, creeps to the surface and stares out at me. But I will conquer yet! Each time I dip a living creature into the bath of burning pain, I say, ‘This time I will burn out all the animal; this time I will make a rational creature of my own!...They go. I turn them out when I begin to feel the beast in them, and presently they wander there. They all dread this house and me. There is a kind of travesty of humanity over there...There’s something they call the Law. Sing hymns about ‘all thine.’ They build themselves their dens, gather fruit, and pull herbs — marry even. But I can see through it all, see into their very souls, and see there nothing but the souls of beasts, beasts that perish, anger and the lusts to live and gratify themselves. — Yet they’re odd; complex, like everything else alive. There is a kind of upward striving in them, part vanity, part waste sexual emotion, part waste curiosity. It only mocks me….And now,” said he, standing up after a long gap of silence, during which we had each pursued our own thoughts, “what do you think? Are you in fear of me still?”"}, {"userName": "Lyn", "userReviewDate": "Aug 02, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "\"Not to go on all-Fours; that is the Law. Are we not Men?Not to suck up Drink; that is the Law. Are we not Men?Not to eat Flesh or Fish; that is the Law. Are we not Men?Not to claw the Bark of Trees; that is the Law. Are we not Men?Not to chase other Men; that is the Law. Are we not Men?\"H.G. Wells 1896 novella The Island of Dr. Moreau may have been a science fiction / fantasy precursor of William Golding’s 1954 classic Lord of the Flies. Both works explore the theme of the fragility of humanity and civilization and the unguarded impetus towards chaos inherent in us all.Or it’s a fun book about a guy stuck on an island with beast people.The character of Dr. Moreau himself can be seen as an extension of Dr. Frankenstein, willfully toying with the mysteries of creation for his own scientific curiosity and blithely uncaring about his experiments until he is forced to deal with it. In this sense, Wells’ work is fundamentally tied to modern writing about the morality and ethics of genetics and with the integrity of our science and technology and how it affects nature.Published a couple of years before Joseph Conrad’s brilliant Heart of Darkness, this also provokes thought about the intellectual climate of the end of the 1800s to lead such talented writers towards these questions.Sometimes this can be painfully dated and the language is in that stilted Victorian prose, and there are some gaps in the plot, but this is a seminal work that should be read for fans of speculative fiction."}, {"userName": "Apatt", "userReviewDate": "Sep 11, 2015", "userURL": "http://www.goodreads.com/user/show/2457095-apatt", "userReview": "“Not to go on all-fours; that is the Law. Are we not Men?\"“Not to suck up Drink; that is the Law. Are we not Men?“Not to eat Fish or Flesh; that is the Law. Are we not Men?“Not to claw the Bark of Trees; that is the Law. Are we not Men?“Not to chase other Men; that is the Law. Are we not Men?”\"You gotta fight for your right to paaaaarty!\"Sorry for a spoiler so early on but yes, The Beastie Boys are to be found on the unnamed – but titular – Island of Dr. Moreau. Sort of.Interestingly The Island of Dr. Moreau begins with a brief introduction by \"Charles Edward Prendick\" – nephew of the novel’s protagonist Edward Prendick – explaining the background of his uncle’s first hand account of his shipwreck and the uncle's records of the time he spent on this mysterious island. From then on the first person narrative is switched to the original Edward Prendick and Charles is never heard from again. So basically what we have here is a precursor to the “found footage” trope often used in modern movies like The Blair Witch Project, Paranormal Activity etc. As a literary device this it seems to have gone out of fashion, nowadays we even get first person narratives written in the present tense which does not make sense when you think about it, but makes perfect sense if you just accept it as the author’s chosen narrative technique.Basically, Edward Prendick is shipwrecked, rescued by an associate of Dr. Moreau and taken to a mysterious island where he finds a bunch of man-beasts living there. How did they come to be? Well, there is a scientist living there, the creatures worship him, and he is a few sandwiches short of a picnic, so all that should be fairly indicative! Prendick spends about a year on this island until one day “the fit hits the shan”. That is all the synopsis you need I think.This book is what I would call “sci-fi horror”, it is probably Wells’ most horrific book, with all the vivisections, gore, and violence. In my previous reviews of H.G. Wells’ books I mentioned that he pioneered at least three standard sci-fi tropes: time traveling, alien invasion and genetic engineering. That last one is a reference to The Island of Dr. Moreau of course, but back then I have not reread this book yet and I forgot an important detail. There is no genetic engineering in this book! Animals are turned into imitations of men by Dr. Moreau through the process of vivisection, chemical injections, blood transfusion and brain surgery. It is a little like cutting and pasting in word processing I think. If “Frankensteining” was a verb you can probably apply it to mad Moreau’s process. I find the science in this book is less convincing than Wells’  The War of The Worlds,  The Time Machine and The Invisible Man. It is hard to believe Moreau is able to create intelligence or sentience through brain surgery and his technique of replacing and grafting limbs to animals seems more likely to make a mess than an anthropomorphized creature able to run around. The pain he depicts is convincing and disturbing, though.Characterization is a little thin in this book, the human characters are fairly two dimensional, even Doc Moreau is your standard issue cranky and obsessive mad scientist. That said some of the “manimals” are quite adorable, like the dog-man who is loyal to Prendick to the last and a little sloth-like creature that Wells describes as repulsive but still sounds pretty cute to me. Wells is clearly against men playing God, slicing and dicing animals just to see what happen. All in the name of science and progress, of course, morals can get in the backseat and keep quiet. This short novel is very fast-paced; if you are inattentive for a few seconds you are likely to miss some important plot points. That should not be much of an issue though as there is never a dull moment in the book.The Beastie Boys fighting for their right.The Island of Dr. Moreau is well worth a read, of course, H.G. Wells always is."}, {"userName": "Paul Bryant", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "I think Vegans will like this book because they would say this is what happens if you start to eat dairy and wear leather, suede, pearls, silk or fur. Eventually you will think nothing of eating pepperoni pizza and monkey brains. And from eating animals it will be a short step to thinking it’s okay to experiment on them for better cosmetics. And from that it’s only natural that you will end up creating a horrible race of Beast People by vivisection on an isolated island in the South Pacific. Well maybe not everyone will do that but enough people will go on to become crazed vivisectionists that we should ban dairy and suede right now and also Kellog’s cornflakes as they contain lanolin which comes from wool bearing animals like lamas or alpacas or goats. It can be tough being a Vegan and avoiding things you may not realise you should avoid but it is all good if it prevents you from going to an isolated island in the South Pacific and creating a race of horrible Beast people by vivisection.I asked my friends what they thought of this book as we all had to read it and here is what they say. My scientist friend said she was reading along and all the time saying “this could not be done” “they would all have died within 15 minutes because of infection” “he would be struck off” “this could possibly be done but only now, not in 1895” and “you cannot hypnotise an animal into learning language however rudimentary, this book is silly”. So she thought this book brought science into disrepute.My friend who is doing religion thought it was pretty cool though. He said that Dr Moreau = God and H G Wells was therefore able to attack God without mercy. Dr Moreau is called a mad experimenter, creating the race of Beast People in horribly painful operations and not caring about their lives afterwards, except to tell them about some random Law which they must follow or they will die. And that is exactly what God did, according to the Bible, according to HG Wells, according to my friend.Wow, some pretty deep thoughts there. I will stick to my Vegan interpretation and say that in my opinion this book says you should not eat meat or dairy or any animal products but you do not have to wear sandals as they now do very stylish Vegan shoes."}, {"userName": "Agnieszka", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/2446508-agnieszka", "userReview": "I’ve decided to catch up some classics this year and H.G.Wells with  The Island of Dr Moreau was my first choice. Rather successful I think. It worked for me on different levels. Less as horror story obviously more as a trigger to ponder about some valid and timeless questions. How far can we go to satisfy our curiosity, do scientists to achieve their goal should be deaf to suffering of the objects of their studies, can we throw all the compassion and empathy and ethic and morals and scrupules out the window? And aren't we responsible for effects of our experiments?For Wells a man studying nature becomes as merciless as Nature is itself. But in the end on the island it is pure instinct that defeats reason. Moreau is an extremely ambiguous figure, whether he is a demiurge, an omnipotent maker and creator bending the laws of nature to his caprices, mercilessly enforcing the law set for the human-like beings to keep them in obedience? Or is he an instrument of an absolute evolutionary process? He is not completely blind, he is aware that each of the created beings will sooner or later respond to the atavistic call proper to his inner nature and need. Who is he then?The novel was written in the last years of the nineteenth century and really humanity did not have to wait too long for terrible medical experiments, vivisection and other atrocities that make your flesh creep."}, {"userName": "Jason Pettus", "userReviewDate": "May 02, 2008", "userURL": "http://www.goodreads.com/user/show/147289-jason-pettus", "userReview": "(Reprinted from the Chicago Center for Literature and Photography [cclapcenter.com]. I am the original author of this essay, as well as the owner of CCLaP; it is not being reprinted here illegally.)The CCLaP 100: In which I read for the first time a hundred so-called \"classics,\" then write reports on whether or not they deserve the labelBook #16: The Island of Dr Moreau, by HG Wells (1896)The story in a nutshell:Along with French author Jules Verne, the British HG Wells is considered one of the co-founders of the \"science-fiction\" genre*, in which the latest advances in that field are elegantly enfolded into thrilling or sometimes philosophical fictional narratives. (So in other words, think of him much more as the spiritual godfather of Michael Crichton than Isaac Asimov.) And indeed, his early-career masterpiece The Island of Dr Moreau contains not a single fantastical element at all, but is rather a chilling extrapolation of what was happening at the time in the real world of medicine, starting as these Victorian novels often do with a shipwreck in the middle of an ocean, and of our everyman hero (a gentleman named Prendick) getting picked up by a mysterious ship out in the South Seas somewhere. Taken back to the remote tropical island where his rescuers are heading, he is there introduced to our eponymous doctor, a creepy former London surgeon who was disbarred from his profession for shady ethical practices.And sure enough, it's no coincidence that Moreau happens to be on this remote island, and is having his nutso alcoholic nihilist assistant run around the various nearby islands and acquire as many exotic animals as possible; turns out that he has continued his formerly banned research here, a truly horrific series of experiments that has him seeing if he can somehow turn an animal into a fully rational human, through an elaborate series of delicate surgeries and psychological conditioning. Needless to say, he hasn't exactly succeeded yet, leaving the three humans on an island full of snarling, retarded man-beasts; to protect themselves, Moreau and the assistant have established among the beasts what they call \"The Law,\" a combination of rational rules and religious dogma that keep the human/animal hybrids just barely civilized and not in a constant state of violent bloodlust. The majority of the book, then, concerns Prendick's time on the island and the ways that this delicate peace of course starts quickly falling apart; I'll leave the actual plotline itself as unspoken as possible, in that this 112-year-old story is actually still thrillingly surprising.The argument for it being a classic:Like many of the books reviewed here as part of the CCLaP 100, there is a strong argument for The Island of Dr Moreau being a classic based on its historical, trailblazing aspects; it's one of a handful of books, after all, to singlehandedly kick off the entire genre of science-fiction (now with millions of fans and which generates billions of dollars a year in revenue), not to mention such speculative tech writers as the aforementioned Crichton, Tom Clancey and more. But on top of this, though, this particular book is important too because it's held up so well over the decades, certainly much better than almost all of its Victorian fantastical counterparts; as its many fans will tell you, it still has the power to shock and disturb, and deals with issues like genetic engineering and the ethical role of doctors that are surprisingly relevant to this day. If you're going to pick any of the pseudo-science-babble books of the late 1800s to designate as a must-read, fans say, best to pick a book like this, not only as historically relevant as the others but simply a much more entertaining modern read.The argument against:A weak argument today at best; like many other Victorian fantastical tales, I suppose you can argue that Dr Moreau is too flippant and garish a tale, too focused on pleasing a lurid, mainstream crowd. But then that gets us into the whole subject of whether the forefathers of the various modern artistic genres out there even deserve to be recognized as the authors of \"classics,\" people such as Edgar Allen Poe and Nathaniel Hawthorne and the aforementioned Jules Verne; and I think most intelligent people at this point in history would say that these are indeed authors worthy of \"classic\" status, making this not really much of an argument at all.My verdict:Ah, how nice to again come across a book whose \"classic\" status seems to not be questioned by very many people at all; it happens so rarely, after all, much more rarely than you would think for a series of book reviews all centered around so-called classics. And indeed, it was a sincere and pleasant surprise to read Dr Moreau for the first time (I haven't even seen any of the movie versions) and discover just how legitimately scary and gross and great it was to modern eyes, after a year now of such badly dated 1800s prose like is found in Twenty Thousand Leagues Under the Sea (to mention one infamous example). Now that I've sampled both, I can definitively state that Wells was a much better writer than Verne, and that his titles can hold up in a canon list without necessarily the Roger-Marin-style asterisk that so many other Victorian genre authors need. That said, please be aware that this is a surprisingly disgusting book, one that deals with such then-current hot topics as vivisection (or the act of cutting open animals while still alive, in order to figure out how their insides work); but then again, it also gets you thinking about all kinds of interesting ethical questions still relevant to current society, like whether the animalistic part of our brains can ever be truly tamed and controlled (another hot topic among Victorians), and if the torture and slaughter of animals can ever be a morally justifiable action. It not only gets an enthusiastic yes from me today, but I can even declare it better than a lot of the contemporary genre novels I've read in the last year. Highly recommended.Is it a classic? Oh my, yes*And by the way, it's no surprise that Wells ended up as one of the founders of science-fiction; he was actually a dual student of biology and sociology at university, who pursued not only creative writing as a lucrative hobby at the same time but also the visual arts as well. In fact, Wells was much, much more well-known when alive as a brilliant political analyst, socialist activist, and a forefather of \"futurism:\" among other accomplishments, in the 1910s he predicted the outbreak of World War I, in the '20s predicted that the war's destruction would pave the way for the rise of fascism, in the '30s predicted that fascism would culminate in another world war right around 1940, and in the '40s called for the creation of what we now know as Wikipedia (which he called the \"World Brain\"). Oh yeah, and he was a founding member of both the League of Nations and the United Nations, and incidentally was the inventor of the world's very first miniature war-game (\"Little Wars,\" in 1913). What a surprisingly fascinating guy!"}, {"userName": "7jane", "userReviewDate": "Mar 23, 2015", "userURL": "http://www.goodreads.com/user/show/28266234-7jane", "userReview": "Much reviews have been written on this book, so I just say some personal bits.This was one of those books which has a point hard to get over to continue reading. Some books are just like that to me: a point where a trouble starts, or an argument is had, or something. It's not a long book, but quite intense.I think the chapter on just hearing the sound of the puma's suffering (it had already suffered during a long sea travel in a too-small cage) was quite distressing - I hate even reading of the details of an animal suffering - yes, this book is partly a comment on vivisection. Dr Moreau's reasonings, especially on the subject of pain, showed that his mind was crooked in some way (sociopath? narcissist a bit? I don't know).The island and it's creatures (created by Moreau) was quite interesting; another lonely island out of the way of the usual ship routes, mildly volcanilly active. The story was very flowing and the afterword... one could clearly see why Prendick, our teller here, was so profoundly changed that he could only live a solitary life close to nature where he could wandering to feel calmer - and after his experiences, calm was what he needed.A great book that still carries its message well today, quite likely better understood now, especially when it comes to darker sides of science (and those who pratice it). Uneasy maybe, but I still think I will read it again."}, {"userName": "ᴥ Irena ᴥ", "userReviewDate": "Sep 14, 2013", "userURL": "http://www.goodreads.com/user/show/5252054-irena", "userReview": "'What could it all mean? A locked enclosure on a lonely island, a notorious vivisector, and these crippled and distorted men?'\n This is the actual plot without any details. The details make this a very disturbing story. I forgot just how disturbing.It is interesting how this was an adventure when I first read it. Not a happy one, but still an adventure before anything else. Now, it is a horror story. However you choose to see it, it will still be a horrifying account of Prendick's stay on the island. The strongest and, of course, the most disturbing part of the story is Moreau's explanation of his work. The fact that he talks about it as if pain and suffering don't matter, makes it even worse. Combine that with the sounds of a tortured animal day after day and you'll get it. \n'This time I will burn out all the animal.'\n I felt sorry for most of his subjects, but there is something simply disgusting about pigs and hyenas that sickened me every time they appeared."}, {"userName": "Jolene", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/8171153-jolene", "userReview": "\"There is - though I do not know how there is or why there is - a sense of infinite peace and protection in the glittering hosts of heaven.\"4.5 stars. This was a quick yet engrossing read. Think Frankenstein meets Lord of the Flies. I found it incredibly sad, but with important and fascinating commentary regarding the implications of science and religion on humanity and morality. Overall, this story certainly gives the reader a lot to 'dissect.' See what I did there? I'll show myself out."}, {"userName": "MJ Nicholls", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "The Island of Doctor Moreau? Please! Who among us hasn’t gambolled in fields with apecats, badgies, cockpigs, donrets, elephocks, ferrats, gerbats, horsharks, iguanomones, jagutans, kookakeys, llamoles, monkelots, narwhelks, ostringos, pandicoots, quaileeches, rhinilgais, shaardvarks, tigeels, uintapmunks, volemice, wombulls, xanthraffes, yakapes and zebrams? In your back garden (or if you live in a city, in the countryside—a mythical place where grass exists), trillions of micro-organisms are cross-breeding right now to introduce even more wondrous deviations and half-breeds to the planet, twice as splendorous as the cloned sheep and spliced deer-penguin hybrids being created in underground labs by Evil Docktors and their hunchback locums. Nature is a language, can’t you read?"}, {"userName": "Karlyflower *The Vampire Ninja, Luminescent Monster & Wendigo Nerd Goddess of Canada (according to The Hulk)*", "userReviewDate": "Oct 08, 2014", "userURL": "http://www.goodreads.com/user/show/17243568-karlyflower-the-vampire-ninja-luminescent-monster-wendigo-nerd-godde", "userReview": "Buddy-read with the Bitchin' Kristin. Set to commence October 1... Look at me, getting all classic in my spooktober this year... (for those of you new to this, I am a HUGE Halloween fan. The month of October in Ninjalandia is dedicated to all those things which go bump in the night - and day.)W, is for Wells3 StarsOkay, so I am officially the worst buddy-reader ever, Kristin hasn’t even started this yet! However, owing to the insanity that is spooktober, and the fact that I am starting another buddy-read tonight, I rushed on ahead and read The Island of Doctor Moreau. Can you ever forgive me, my Bitchin’ Beauty? I’ve never been a ‘Research Reader’. By that I mean that I am far too lazy to do things like search up who did what first, so while I could surmise that Wells is likely the great-grandfather of genetic modification fiction I don’t actually know that for a fact, nor do I especially care. Judge me if you will. So I’m not going to talk about that. I’m going to talk about my personal feelings in relation to this book, and those feelings are very conflicted. I have read four different Wells’ stories (The War of the Worlds, The Invisible Man, The Time Machine and now this) and I have to say that this is probably my least favourite, in as far as language choice itself. This book reads incredibly dry and vague. However, the subject matter? OH MY GOD, THE SUBJECT MATTER!! The concept of The Island of Doctor Moreau is cutting in an amazing way, and I don’t know if that was Wells intention or not; to cause me to think deeply on the reflection of animal testing and the incredible advancements that humanity owes entirely to the mistreatment of animals? And how that morally sits on the conscience of someone who truly views creatures as our equals? When is it okay? Is it ever okay? What does it mean that I am happy that my mother is alive today, in large part, because of cancer treatment which was discovered through scientists torturing animals in a human’s stead? It’s wrong, morally and ethically, to me but yet it’s saved countless lives? What is the balance? Is there one? (My mind is a scary place, no?)Anyways, I think we can mostly agree that what Doctor Moreau does in this book is wrong but for what reasons, is the harder question. I would say that it is wrong because it was science for science’s sake, there was no perceptible ‘reason’ behind his research. It had no comprehensible application. And to harm something for the sake of your own curiosity, at least in my opinion, is wrong. This is all my personal speculation on the book though, much of this is not gotten into in the actual text of The Island of Doctor Moreau as it was written long before animal rights were an understood concept. That said, there are many thoughts that Prendick has with regards to things being okay because The Beasts are animals that unsettled me. And the perceivable social commentary about the relation between humans and animals, while perhaps accidental, is really biting. This is a novel that will make me think long after I finished reading it, and for that alone this is still a relevant book today. Category: A book more than 100 years old"}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "I started this in early August, but it took me a while to finish it. One of the reasons is it's a profoundly unsettling book. I'm a scientist by training, and I take the ethics of science pretty personally. Dr. Moreau crosses so many ethical/moral lines in his experimentation, it's not even funny. Some things just should not be done, even if it's to advance scientific knowledge. I am also a inveterate lover of animals, and I felt a horrible rage at the way Dr. Moreau was torturing animals. I feel it's fair to admit I am a meat eater, and I don't feel that eating meat is wrong. This book did make me feel extreme discomfort and think about what an animal goes through so I can eat a hamburger (something that I know intellectually but still ponder the ethics of regularly). However, there is a clear line that even both vegans and avowed carnivores can agree on: torturing animals for no reason, and inflicting pain on them because they are merely animals and don't feel pain the way humans does is terribly wrong. Also, to treat animals he had ostensibly humanized with no decency or respect was capping off the wrong that Moreau was doing. I admit I wasn't sad about Dr. Moreau's fate at all. I could feel Prendick's sense of pervasive horror acutely. Because of that, I had to put the book down at one point and didn't go back to it until yesterday/today. I listened to this on Kindle Text-to-Speech and it adds an element of horror to experiencing the book as an auditory experience. HG Wells is a good writer. He immerses the reader fully into the story. He writes descriptively and seems to be aware of science in a way that lends credibility to the story (although my mind went to what we know about tissue matching, organ donation and graft rejections today). I felt all the emotions that Prendick felt, although not his sense of superiority that comes from being a white Englishman of the 19th century. I know I would feel the weirdness of humanlike animals put in a situation where they are forced to act human but are denied the same respect and decency that humans deserve. I believe in the quality of life for animals and as a veterinarian this is a huge issue for me. I felt so sorry and angry on behalf of the Beast Men that it was a huge discomfort factor for me as I read. That's probably a good thing. I don't think anyone should be okay with how those poor beings were treated.There is a touch of racism but it's not as bad as some of the classic novels can be. I always notice it, because I'm a black woman, and for good reason, I am clearly sensitive to such things. It's good to read books from different periods and see how things were then and be grateful that things have changed for the better, or at times, realize things haven't changed all that much. I wonder what Wells would say about some of the things we do in modern medicine/medical research without blinking an eye at. Thankfully, there are stringent limitations on animal research (although I admit that I think some research that takes place is beyond what I consider moral or ethical). If anything, this kind of story will make a reader feel uncomfortable and ask themselves about what is ethically okay, and challenge them to feel things from a different perspective that they might not always be sensitive to.Prendick was mostly a sympathetic character. He was in a very extreme situation way beyond his control or comprehension, and his actions were probably what one could expect for someone put in such a horrific situation. I can see why he would remain scarred emotionally for the rest of his life. Who could blame him?This is a book that can easily be classified as science fiction horror. The horror is psychological because of being confronted with the extremes of science and the unnatural results of it on nature. HG Wells is considered a foundational science fiction writer, and I believe he definitely writes something prophetic about biomedical research that still can serve as a warning to us in the 21st Century. There is a line and we must not cross it.I can't give this more than 3.5 stars because of the ick factor. The writing is good but it made me feel icky inside. As an emotional reader, I have to listen to those instincts."}, {"userName": "Yani", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/13686880-yani", "userReview": "[ por no hacerlo, terminan siendo “devorados” en el final.  (hide spoiler)]"}, {"userName": "Leo .", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/71478086-leo", "userReview": "To be able to write about these concepts before anybody else was talking about it. Genetics. Mutation. What imagination Wells had. It must have been mesmerizing to have read this book when it first came into print. We see so much of this now in films and TV shows. Super hero's and Agents of Shield. X-men etc. DARPA springs to mind. Trans Humanism.Anyhow, Wells was one of the pioneers in the fantasy \"fiction\" genre. I say fiction loosely. 👍🐯"}, {"userName": "Amber", "userReviewDate": "Dec 11, 2014", "userURL": "http://www.goodreads.com/user/show/23016460-amber", "userReview": "Edward Prendick is marooned at Sea after his ship and crew capsizes over. He is then rescued by a man named Montgomery who spirits him away to an island to transport wild animals there. When Edward sees the inhuman perversions on the island and meets the mad scientist Dr. Moreau, he fears that he would be next under the doctor's knife and tries to escape from the island. Will he survive? Read the Island of Dr. Moreau and find out for yourself.This is the first book I have ever read by H.G. Wells and it was a pretty good and scary science fiction mad scientist story. Definitely check this out for yourself. I found this for free on Gutenberg."}, {"userName": "K.D. Absolutely", "userReviewDate": "Dec 16, 2009", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "This book can make you lose sleep. It is an easy yet a very engaging read. It is engaging because it is disturbing. While reading, I thought I would like to see any of the movie adaptations. After reading, I decided not to look for it. The images in my mind are enough scare for this novel to remain as one of my favorite classic sci-fi masterpiece.In this book, I learned about vivisection or the surgery conducted for experimental purposes on a living organism, typically animals with a central nervous system, to view living internal structure. To be honest about it, we do this with frogs in our biology in high school or zoology class in college, right? Wiki says that, in the UK, anyone who is planning to do this must first seek a written permit from Home Secretary (Source: Wiki). If this is imposed here in the Philippines, there will be deluge of application from students. H. G. Wells (1866-1946) was an English novelist and is considered as one of the \"Fathers of Science Fiction.\" The others are Jules Verne and Hugo Gernsback. I've read H. G. Wells' The Time Machine (3 stars) almost three years ago and I definitely enjoyed this book about half-beast, half-human creatures more. The reason is that I think the idea of time machine is not possible but the idea of creating a perfect human being through combination of different organs from men and beast is now within our reach. That makes this book of H.G.Wells not just a science but even a speculative even prophetic fiction. Also, here, the storytelling of H. G. Wells here is clearer. His characters are more memorable (more gruesome, more barbaric) and the plot has enough twists to make the adults (who are not supposed to go gaga anymore about these kinds of stuff) engaged all throughout the reading. For example, when Prendick comes to the island and he starts seeing all those \"creatures,\" I thought that he would just be like a bystander and did not anticipate that he is lined up for the next operation or experiment. I will not tell other twists that make this novel really scary and engaging at the same time because I do not want to give too much spoilers.Suffice it to say that the images of this book will stay for a long time in my memory. The island will now compete with the memories of the island of Monte Cristo, the island in The Lord of the Flies, the island in the TV series LOST and the island where I was born - an island in the Pacific. Never mind Boracay island because it is real and I have been there twice. What I am fond of keeping in my brain are the islands that are not real because it is more fun and challenging to picture them in my mind.BTW, this is the only H.G.Wells' novel that is still included in the 2012 edition of 1001 Books You Must Read Before You Die. All the two others that used to be included like The Time Machine and The War of the Worlds have been dropped off that list."}, {"userName": "Gregor Xane", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/2165551-gregor-xane", "userReview": "Many will dismiss Wells' tale as a racist's fever dream, a parable that blames the failings of English imperialism on subjects who were just too beastly to be properly civilized. And it would be easy to do so. Wells was a vocal proponent of Eugenics, and the text of this book does contain passages like the ones I've reproduced below.First, Moreau tells of how he used the delicate art of vivisection to carve a 'negroid type' out of an ape he had on hand:“Then I took a gorilla I had; and upon that, working with infinite care and mastering difficulty after difficulty, I made my first man. All the week, night and day, I moulded him. With him it was chiefly the brain that needed moulding; much had to be added, much changed. I thought him a fair specimen of the negroid type when I had finished him...\"Then our protagonist describes another of Moreau's creations:\"The Satyr was a gleam of classical memory on the part of Moreau,—his face ovine in expression, like the coarser Hebrew type; his voice a harsh bleat, his nether extremities Satanic. He was gnawing the husk of a pod-like fruit as he passed us.\"Although the above passages seem to be fairly damning evidence of a racially motivated agenda, I would suspect that Wells' prejudices inadvertently seeped into his narrative while, perhaps intentionally, writing another parable altogether. This work could just as easily be read as a warning against what he believed happens when a society turns its back on God and religion. Then again, he could simply have been writing a tale about the dangers of science in the hands of insane and wicked men.And I think it's because of the various ways this story can be interpreted that it's been a perrenial favorite and will continue to be so for years to come. Or, its staying power could be merely the result of Wells having written a great, imaginative story.I particularly liked the scenes in which Moreau explains himself.\"To this day I have never troubled about the ethics of the matter,\" he continued. \"The study of Nature makes a man at last as remorseless as Nature.\"I also was struck by the unexplored horrific cinematic possibilities of a film wherein Moreau's method of carving humanity into beasts using vivisection is shown in all its gory detail. Imagine a scene with Moreau carving up a beast in his laboratory with a voiceover of his monologue on pain playing throughout:\"The capacity for pain is not needed in the muscle, and it is not placed there,—is but little needed in the skin, and only here and there over the thigh is a spot capable of feeling pain. Pain is simply our intrinsic medical adviser to warn us and stimulate us. Not all living flesh is painful; nor is all nerve, not even all sensory nerve. There's no taint of pain, real pain, in the sensations of the optic nerve. If you wound the optic nerve, you merely see flashes of light,—just as disease of the auditory nerve merely means a humming in our ears. Plants do not feel pain, nor the lower animals; it's possible that such animals as the starfish and crayfish do not feel pain at all. Then with men, the more intelligent they become, the more intelligently they will see after their own welfare, and the less they will need the goad to keep them out of danger. I never yet heard of a useless thing that was not ground out of existence by evolution sooner or later. Did you? And pain gets needless.\"“Then I am a religious man [...] as every sane man must be. It may be, I fancy, that I have seen more of the ways of this world's Maker than you,—for I have sought his laws, in my way, all my life [...] And I tell you, pleasure and pain have nothing to do with heaven or hell. Pleasure and pain—bah! What is your theologian's ecstasy but Mahomet's houri in the dark? This store which men and women set on pleasure and pain [...] is the mark of the beast upon them,—the mark of the beast from which they came! Pain, pain and pleasure, they are for us only so long as we wriggle in the dust.\""}, {"userName": "Kaethe", "userReviewDate": "Sep 17, 2009", "userURL": "http://www.goodreads.com/user/show/1072582-kaethe", "userReview": "I really don't know why I keep thinking that Wells' stories aren't any good. Before much reading time had passed I was talking to the Spouse about how much more plausible and realistic the story was than I thought it was going to be. And also, his structure is good, how he brings the reader in, how information is revealed, how our narrator changes his opinion as he understands more. The story never went where I expected it to, either.Who anticipates being surprised by a hundred year old story that's been adapted to film I don't know how many times? An interesting read, entertaining, but also, one that doesn't raise issues and try to pass off easy answers. Personal copy."}, {"userName": "Наталия Янева", "userReviewDate": "Apr 27, 2016", "userURL": "http://www.goodreads.com/user/show/9539140", "userReview": "Едва ли има точен отговор на въпроса дали животинското е по-силно при хората, отколкото „човешкото“ при животните, но пребиваването на „Острова на доктор Моро“ определено е взиране в криво огледало (нещо като камера обскура, ама малко по-иначе). Хората по принцип доста разчитаме на сетивата, не толкова на разума си и то противно на печално известния факт, че сетивата лъжат. В своето „младежко богохулство“, както нарича романа си Хърбърт Уелс, той ни показва какво се получава, когато „горе“ стане „долу“ и обратното, или когато хората започнат да се държат зверски, а от зверовете се очаква да се превърнат в хора.Има нещо особено зловещо в това да се месиш в работата на природата. В това да си играеш на Творец. Може би по-зловещо дори от смъртта, тъй като тя си е естествена фаза от живота. Да се опиташ да превърнеш животно в човек е лудост, може би съпоставима с лоботомията, при която са намирали за удачно да ти разбъркат и изчегъртат предния дял на мозъка, пък току-виж се оправиш от психическото разстройство, от което страдаш, като в крайна сметка обаче се превръщаш в кротко добиче. Във втория случай направо ти ампутират същността, но в първия тя е просто дълбоко потисната и се поддържа такава чрез промиване на мозъка, а всички знаем докъде води това – траеш, траеш, а накрая изригваш като вулкана Етна и затриваш всичко по пътя си (за справка – „Портокал с часовников механизъм“). Ако има нещо, което еднакво не прощават всички видове, то е да упражняват явно насилие над тях. Демагогия – да. Сладникави приказки и малко бой с вестника – става. Обаче ако си толкова нагъл, че да причиняваш открито болка на някого, насила да се опитваш да го промениш, без дори да се постараеш да позамажеш мотивите си, то тогава даже няма какво да чакаш и да се надяваш – възмездието все някога някъде ще те намери. То отмъщението нали се поднася студено, та точно когато някой е решил, че вече ти е видял сметката на индивидуалността, можеш да му покажеш колко точно се е объркал.Според Хърбърт Уелс описаното в неговия научнофантастичен роман е напълно вероятно да се случи, ако подобни опити наистина се извършат. Хората винаги са се стремели да надскочат себе си (което всъщност е прекрасно), но създаването на нови видове надали е нещо, което би трябвало да се случва, както и Мери Шели правилно е документирала преди около 200 години. Точно така, просто защото има някои врати, които трябва да си останат затворени."}, {"userName": "James", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/41609617-james", "userReview": "‘The Island of Dr Moreau’ is well and truly firmly rooted in the Victorian / Edwardian tradition of the scientific / Sci-Fi novel and genre of which Wells was very much one of the key founding fathers. This novel was written against a backdrop (at the time the novel was written) of concern regarding vivisection – which amounted in some quarters to moral outrage and to the formation of the proto anti-vivisection movement. In this novel Wells explores the possibility of, and the very real potential for (or so it may have seemed at least at the time) the crossing of ethical lines in scientific research and experimentation – taken here to its possibly logical and nightmarish conclusion of a complete absence of an ethical or moral compass, combined with a skewed and warped sense of scientific purpose and progress. The influence is here in part at least of Shelley’s much earlier ‘Frankenstein’ - unfortunately however, Wells story lacks the sheer visceral power and impact of Shelly’s great novel.One key problem that I did have with this novel was in visualising the creations / beings described, although I’m not sure whether that says more about the limits of my imagination rather than Wells literary powers? Whilst ‘The Island of Dr Moreau’ does raise many interesting and important debates concerning fundamental scientific, ethical, moral and religious issues – and is therefore an important and thought-provoking novel, it just doesn’t provide as convincing a story and narrative and lacks the power of Wells other Sci-Fi works (‘War of the Worlds’, ‘The Time Machine’ et al). Whilst this is a good story well told, as you would expect from Wells – ultimately it fails to convince and engage to the same degree as many of his other works."}, {"userName": "Tracey", "userReviewDate": "May 10, 2014", "userURL": "http://www.goodreads.com/user/show/16973418-tracey", "userReview": "Do you have a ghoulish fascination for the macabre, the unspeakable, the unusual? and a VERY strong stomach then this book is for you.The story is fantastical and politically incorrect. Vivisection is always going to be a tricky subject matter. Don't let it put you off reading this.H.G.Wells is a great writer and his imagination appears boundless. The creatures he has imagined in this book are weird and wonderful a mixture of beasts humanised but will nature win out or will 'The house of pain' ensure that they remain as Dr Moreau has 'made' them ?Horror for me is better when it is feasible. Is this story a possibility? Omy I hope not!!"}, {"userName": "Rick F.", "userReviewDate": "Oct 10, 2011", "userURL": "http://www.goodreads.com/user/show/2789848-rick-f", "userReview": "The Island of Dr. Moreau is the third HG Wells novel I have read this year. The Time Machine and The Invisible man are the others. I have enjoyed all three so very much, each are so engaging and far far ahead of their time. The Island of Dr. Moreau is very much the achetype of a perennial classic. Why? Simply because it becomes more and more relevent as the medical achievments CATCH UP to his theories! With all the recent advances in gene therapy, cloning ect, what seemed to many in late 19th Century when The Island of Dr. Moreau was written, is not so very far fetched now. The main plot, a shunned biologist, Dr. Moreau, attempting to create a new species of animals by combining biological elements of the original animal with human and other animal bloods and cells, is handled in both a dramatic, yet accessible sicentific manner. What surpised me the most is that the main character, and true anchor of the book, is not Moreau at all, but Edward Prendick, a man of science lost at sea, who ends up on Moreau's island. The use of Prendick's nephew and heir in the beginning, explaining how he came across his late Uncle's papers, and felt the need to have them published adds an air of authenticity and is a superg starting point.While Moreau's presence is felt throughout, he actually has a relatively minor role in the narrative, Prendick, speaking in first person, talks more about Moreau's assistant, a drunken, discraced (the cause is hinted at but never explained)and most important, the \"beast people\" that inhabit the Island.Like Shelly's Frankenstein, these \"monsters\" are not simply portrayed as one dimensional Godzillas, rather, each have complex, and at times touching attributes that Wells so deftly portrays. The battle between their natural instincts, and the synthetic human aspects of each make for a facinating portrait of nature versus man's attempt to change the natural order, and what results is nothing short of unforgetable.A very highly recommended read. Wells seemed to see that as human understanding of biology increased, many moral questions would arise. He was quite right, as today's medical headlines prove. The Island of Dr. Moreau should be a read as both a very original and interesting novel as well as a cautionary tale. RICK FRIEDMANFOUNDERTHE JAMES MASON COMMUNITY BOOKCLUB"}, {"userName": "Wanda", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/9246169-wanda", "userReview": "I’ve been cataloguing an enormous collection of H.G. Wells for the special collections division of our library, and as a result I’m thinking I need to read a little more Wells. Just looking at the wide spread of his interests is fascinating! It was an interesting exercise to read this tale, which I read in school at about Grade 5, I think, and see how different the experience was.Wells was a very dedicated socialist and didn’t have much time for religion (although he went through a phase of flirting with the spiritual). I don’t think there’s any doubt that he had read Darwin’s On the Origin of Species before he wrote this story (it was published in 1859 and Moreau in 1896). Dr. Moreau has set himself up as God on this little island and he has handed down his commandments to the Beast-Men that he has created. Edward Prendick watches as their essential nature pulls the Beast-Men back to their original state—but he sees the same in people, suggesting the Darwinist view that humans are animals too. Moreau never gives any rationale for what he is doing, rather like the Christian God, who has left his creation to its own devices.The Island of Dr. Moreau seems rather prophetic today, in our days of bioengineering and genetic modification. I’ll be interested to see what other tidbits await me in Wells’ prolific writings."}, {"userName": "Nandakishore Varma", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "The story was known to me much before I started reading it - and that, I think, is the reason for my 3 stars. I was expecting an SF/ Horror novel. H. G. Wells is, however, asking deep questions on what we mean by humanity and what separates us from the beasts. The island itself is a metaphor for our inner selves where beast and human roam free, transform into one another, and occasionally become monsters."}, {"userName": "Jon(athan) Nakapalau", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/58774673-jon-athan-nakapalau", "userReview": "H.G. Wells truly could see into the future...this book is truly a foreshadowing of some of the bioethical debates going on right now. But the question to my GR friends is: what is more bestial...beasts who must follow 'The Law' or men who put beasts into that position? It seems to me that is a question that still echoes into our age."}], "description": "Ranked among the classic novels of the English language and the inspiration for several unforgettable movies, this early work of H. G. Wells was greeted in 1896 by howls of protest from reviewers, who found it horrifying and blasphemous. They wanted to know more about the wondrous possibilities of science shown in his first book, The Time Machine, not its potential for misuse and terror. In The Island of Dr. Moreau, a shipwrecked gentleman named Edward Prendick, stranded on a Pacific island lorded over by the notorious Dr. Moreau, confronts dark secrets, strange creatures, and a reason to run for his life.While this riveting tale was intended to be a commentary on evolution, divine creation, and the tension between human nature and culture, modern readers familiar with genetic engineering will marvel at Wells’s prediction of the ethical issues raised by producing “smarter” human beings or bringing back extinct species. These levels of interpretation add a richness to Prendick’s adventures on Dr. Moreau’s island of lost souls without distracting from what is still a rip-roaring good read.", "title": "The Island of Dr. Moreau", "url": "http://www.goodreads.com/book/show/29981.The_Island_of_Dr_Moreau", "average": 3.72, "cover": "https://images.gr-assets.com/books/1388230211l/29981.jpg", "reviews": 3133, "authors": [{"url": "https://www.goodreads.com/author/show/880695.H_G_Wells", "name": "H.G. Wells"}], "type": ["Classics", "Science Fiction", "Fiction", "Horror", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/29981.The_Island_of_Dr_Moreau", "http://www.goodreads.com/book/show/15990644-the-island-of-doctor-moreau", "http://www.goodreads.com/book/show/573178.The_Island_of_Dr_Moreau", "http://www.goodreads.com/book/show/31557838-la-isla-del-dr-moreau", "http://www.goodreads.com/book/show/7675378-the-island-of-dr-moreau", "http://www.goodreads.com/book/show/2923173-the-island-of-dr-moreau", "http://www.goodreads.com/book/show/341272.The_Island_of_Dr_Moreau", "http://www.goodreads.com/book/show/26241096-la-isla-del-dr-moreau", "http://www.goodreads.com/book/show/33990876-the-island-of-doctor-moreau-is-an-1896-science-fiction-novel-by", "http://www.goodreads.com/book/show/7204737-the-island-of-dr-moreau", "http://www.goodreads.com/book/show/6265974-the-island-of-dr-moreau", "http://www.goodreads.com/book/show/6672566-the-island-of-dr-moreau", "http://www.goodreads.com/book/show/24287859", "http://www.goodreads.com/book/show/18780812-the-island-of-doctor-moreau", "http://www.goodreads.com/book/show/7985831-the-island-of-dr-moreau", "http://www.goodreads.com/book/show/2493.The_Time_Machine", "http://www.goodreads.com/book/show/8909.The_War_of_the_Worlds", "http://www.goodreads.com/book/show/17184.The_Invisible_Man", "http://www.goodreads.com/book/show/17136.The_Time_Machine_The_Invisible_Man", "http://www.goodreads.com/book/show/536478.The_First_Men_in_the_Moon", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}