{"ratings": 13621, "userreviews": [{"userName": "Seth", "userReviewDate": "Apr 18, 2007", "userURL": "http://www.goodreads.com/user/show/63444-seth", "userReview": "I gave this book 5 stars. - As science fiction it would get 2 - As philosophy it would get 1 (the world-view it argues for is much better discussed in other books--some of them even by RAW) - As humor it would get 3. Maybe 4 on a good day - As conspiracy theory it would get 4 - As research it doesn't even rate 1 - As a good guide to things to research for yourself, it's a solid 4 (great game: open to a random page and pick 5 things to look up in a library)But it crosses the line on two things: * Cultural references that make points and explain things in the SF/geek/outcase/introvert subcultures. The Roberts nailed the experience of believing you're different and believing that what you want or experience is different and wanting to share it with the world. The terms and phrases that come out of this (fnord, illuminati, AUM, \"You'll like it inside the apple,\" All Hail Discordia, Law of Fives, Aneristic Illusion, Paratheoanametamystichood, etc.) may not all be original, but they have built a part of a culture. Much like it's worth seeing Monty Python even if you don't \"get\" the humor to understand the \"code.\" It inspired two (excellent) card games and a wide variety of \"bits\" of other games, books, comics, and so forth.  * This book is one of the best tools for an adolescent or young adult (not YA--young adult) colonostickectomy. A young person hiding their creativity and trying to be \"serious\" so they can make it through life will get a huge amount of value from this book. You have to forgive them for believing the viewpoint for a few years and then you have to forgive them for rejecting it for a few. In the end, they'll probably come to a happy medium, but they'll always be gratefull for getting that damned uncomfortable thing out of their butt.Oh yeah... the first 100 pages suck. Really. They're bad. But they're never referenced again (well, until the last 100 pages, which you really just skim looking for jokes), so skim them or skip them. You really don't need to start reading until the words \"Egyptian Mouth-Breeder\" appear on the page.Actually, that might be the simplest and best review of all:You really don't need to start reading until the words \"Egyptian Mouth-Breeder\" appear on the page."}, {"userName": "J.G. Keely", "userReviewDate": "Apr 21, 2009", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "A sprawling, many-faceted, satirical series, Illuminatus! is difficult to rate and more difficult to review. There are so many aspects which one could address, so many points of divergence, ideas, philosophies, and influences, but at it's heart, it's a rollicking adventure story that, despite its many political and social themes, rarely takes itself too seriously.I can certainly say I liked it, but it's hard to say how much. Some parts were better than others, but there are many parts to be considered. Unlike other reviewers, I did not find the numerous asides and allusions to be distracting. If one piqued my interest, I looked it up and more often than not, learned something entirely new. Some didn't intrigue me as much, and I was happy to let them be.I treated the book like I treat life: following those threads which seemed, to me, to be the most fruitful, and refusing to become bogged down in the fact that I can't know everything. If a reader tried to track down every reference, they'd be going to wikipedia three and four times per page and likely lose the thread of the story entirely. The sheer volume of research behind the book is an achievement in itself, sure to keep the attention of detail-obsessed trivial pursuit players of the internet generation.Others have also complained about the structure of the book, switching as it does in place, time, and character with no forewarning, sometimes in the middle of a paragraph. Certainly these switches can cause a moment's uncertainty, but they hardly make following the plot impossible. The authors could have put more line breaks in, it would be a minor change. So minor, in fact, that I find it difficult to take seriously any claim that the lack of such breaks somehow ruined the story.It was a deliberate effect by the authors, meant to impart information realistically and force the reader to take a more active role. In life, we are constantly inundated by information and it is up to us to decide what is important and where to make strict delineations. Likewise, in this book, the authors want us to take responsibility for our own parsing of data, refusing to spoon-feed it to us like so much propaganda.The authors, themselves went through huge amounts of data to combine all of these conspiracy theories into a grand ur-conspiracy, too large and detailed to be believed and too ridiculous to be doubted. I've never had much interest in such theories, so it was nice to have them all in one place where I could enjoy them as part of a fun spy story.I also admit a lack of interest in the beat poets, psychedelic culture, and World War II, so I'm glad to have gotten those all out of the way in the same fell swoop. This book is, at its heart, a chronicle of a certain point in American history, a certain mindset, a baroquely detailed conglomeration of the writings and ideas of the raucous sixties.The book is at its least effective when it is taking itself seriously, particularly in the appendices. When it seems to believe in its own conspiracies or Burroughs' bizarre understanding of history, it becomes a victim of its own joke.It is at its best when it takes nothing seriously, least of all itself. The authors were involved in the flowering of the Discordian Movement, which has been described as a religion disguised as a joke disguised as a religion. The movement plays a large role in the text and is analyzed from all sides, but basically boils down to religion as imagined by Mad Magazine.The revolutionary thing about Mad was not that it undermined authority, but that it simultaneously undermined itself. Its humor lay in the insight that only a fool would believe any one thing to be the source of wisdom, but that you were perfectly justified in mistrusting everything.Rather like the remarkable Sixties BBC series 'The Prisoner', the final message is that you must decide for yourself what is important, what is real, and what is misdirection. Also like 'The Prisoner', Illuminatus owes much to the spy genre of the sixties, from freewheeling sex to ultra-modern undersea bases and high-stakes secret missions. There is even an overt parody of the Bond franchise running through the books.Unfortunately, it also seems to fall into the Boys' Club atmosphere of spy stories. Though it switches between narrators, all of them are men, and the focused sexuality of the book is usually aimed at women. There are moments where bisexuality, homosexuality, and feminist sexual power dynamics are explored, but these tend to be mere intellectual exercises while the hot, sweaty moments are by and large men taking their pleasure from women. I can enjoy porn, but I wish it were as balanced as the rhetoric to which the authors pay lip service.Many male authors have shied away from writing female characters from the inside, despite having no compunction about getting inside them in other ways. I cannot reiterate enough the late Dan O'Bannon's insistence that the secret to writing women was writing men and then leaving out the penis. He scripted 'Alien' without gender markers, all characters being referred to by last name, and Sigourney Weaver's portrayal of Ellen Ripley has proven one of the most realistic and unaffected of any woman in film. It was a disappointment to see Shea and Wilson so fettered by gender while simultaneously spouting the latest feminist sound bites.In many ways, Illuminatus provides a bridge between the paranoid, conspiracy sci fi of Dick and the highly referential, multilayered stories of Cyberpunk. Conceptually, it represents a transition from Dick's characters--always unable to escape destruction at the hand of their vast, uncaring society--and Cyberpunk agonists who are able to adapt to their distant, heartless society and thrive where they can. The language of Illuminatus is flashier and cooler than Dick's, but has not yet reached the form-as-function linguistic data overload of Gibson or Stephenson.The writing is quite good: crisp, witty, evocative and mobile. Far from the accusations of being a text 'written on an acid trip', it is lucid and deliberate, even if it does take itself lightly. There certainly are those aspects which are inspired by psychedelic culture, including the free-wheeling structure. The authors invite comparison between moments, events, and characters which, in most other books, would be separated by the strict delineation of the page break.But then, the surest sign of genius is the ability to synthesize new data from the confluence of apparently disparate parts, as Da Vinci did one day while studying the eddies in a stream for a painting, finding himself suddenly struck by the notion that the heart would pump blood more efficiently by forming such swirling eddies in its chamber instead of working as a simple pump. In the the past decade, internal body scanners have proven the accuracy of his small corner sketch. By inviting you to make such comparisons and synthesize your own conclusions, the book respects the potential intelligence of its reader. But it is not all such conceptual exercises, and the lesson Cyberpunk authors learned was that a fast-paced, flashy shell can sugar even bitter pills. But what delighted me was the realization that at its heart, this is a story of Lovecraft's Cthulhu mythos. Outside of Lovecraft and Howard, very few of the stories set in that universe are even passable, but this one comports itself ably, taking to heart the notion that an overabundance of data can break the human mind, which dovetails nicely with the cautionary lesson of conspiracy theory: it seems vast, inexplicable beings of unimaginable power can also be human, and have cults just as Unaussprechlichen.Overall, the series is interesting, unique, informative, humorous, and entertaining. There are moments where it bogs down, but overall, it is well-structured and well written. There aren't many books where you get a fun spy story, a harrowing Cthulhu tale, and a rundown of the zeitgeist of an American era all in one, but there is at least one.Unless you're a teenager looking for a counterculture to believe in, the conspiracy mish-mash probably won't be a life-changing revelation, but it might be food for thought. Conspiracy fiction is big business these days with 'The Name of The Rose', 'Foucault's Pendulum' and 'The Da Vinci Code', yet the originator of the genre gets insufficient credit.But this book is not designed to be easy to digest. You are not meant to internalize its message thoughtlessly. It's funny, contradictory, and self-aware, and it's hard for people who take themselves seriously to get caught up in a book that, for the most part, doesn't. I could say this book deserves to be more than a cult classic, but at its heart, this book is a cult classic, and its cultural influence will continue to seep with or without grander acclaim."}, {"userName": "Ryan", "userReviewDate": "Jan 25, 2008", "userURL": "http://www.goodreads.com/user/show/831864-ryan", "userReview": "I'm re-reading this now, and felt I should clarify my position on this book, as I often list it as one of my favorites.High Literature this is not. It is campy sci-fi, saturated with gratuitous sex scenes, psychedelia, conspiracy theories, counterculture etc. When I recommend this book, it's usually with the caveat that the authors are sort of bumbling about and finding their feet for the first 80 or so pages.When it finally does start moving along, the reader finds his- or her-self bombarded with multiple, conflicting realities and extremist, revolutionary politics from all points of the spectrum. The intended result is mind-expansion. This book invites the reader to become more skeptical, but also to start thinking about what he or she thinks about the world and why.The narrative is experimental; Wilson has an obvious admiration of Joyce that shows up not just here, but also in his lectures and more autobiographical books. As such, it jumps between characters, places, and times, sometimes mid-paragraph, sometimes entering stream-of-consciousness. This may make it difficult for readers who feel that whatever Wilson and Shea are getting at isn't worth the headache. You need to be on your toes, but it's probably best to just \"roll with it\" and not spend overlong trying to tie every piece together. In any case, re-readings can consistently reveal new interrelationships.Early on, one of the main protagonists comes across a painting bearing the message, \"think for yourself, schmuck!\" which probably sums it all up."}, {"userName": "Danny", "userReviewDate": "Dec 01, 2007", "userURL": "http://www.goodreads.com/user/show/652509-danny", "userReview": "If James Joyce was a one-man literary IRA, then Robert Anton Wilson and Robert Shea are the literary Al Qaeda. As these groups can be viewed as either terrorists or freedom fighters, depending on your point of view, so it is with this book. As is probably not ironic for a book considered to be the holy grail of conspiracy theory, it's definitely not difficult to perceive the Illuminatus Trilogy as an act of intellectual terrorism. This is not an easy book to read. Time, location, perspective, and identity can and do shift without warning in mid-paragraph, sometimes mid-sentence (making an interesting model for the idea of the 'collective unconscious'). The best analogy I can think of for this book is that it's like reading someone else's acid trip, and that someone else is criminally schizophrenic and watching 15 televisions at the same time. It is definitely a product of it's generation. The copious drug use, and underlying philosophies are very typical of most of the underground cult classics of the '70s that I've read, but for the most part it's brilliantly insightful, and has many fantastic aphorisms that you'll probably want to repeat later. It's also beautifully self-satirical, which is probably a good thing because if this book took itself seriously it really might have been an act of intellectual terrorism. You will probably either love this book, loathe it utterly, or possibly even think it's totally ridiculous. If you're not up for a difficult read, you may not want to bother. But if you do find you like it, you might be happy to know that it's a hell of a lot easier to read the second time through."}, {"userName": "Elf M.", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/6826433-elf-m", "userReview": "The Illuminatus! Trilogy saved my life.It won't save yours.Since first reading it at age 13 (the year it saved my life), I have dutifully re-read the entire trilogy (really, it's not that long) every five years since. But when I was 13, that was 1979: the jokes about Nixon, late 60s and early 70s rock bands, the coming of disco, the obscure neopagan nonsense that washed through every college campus in the late 1980s, bizarre alternative histories and conspiracies theories, were hilarious and fascinating.There's even a page from the Principia Discordia mentioned, and that too was life changing, because in tiny print in one corner it contained this quote: \"When I was 8 or 9 years old I acquired my first split beaver magazine. You can imagine my disappointment when, upon examination with a microscope, I discovered all I could see was dots.\" And I realized that, hey, I'm not the only one who's tried that. Being 13 and finding someone like Robert Anton Wilson, who wrote so irreverantly about sex, morality, religion, politics-- all the things that do not make up polite dinner conversation-- does change a life, especially when that life had been constrained by a middle class conventionality wherein parents seethed with their own furtive excesses and failed to understand their SF-reading child.The Illuminatus! Trilogy really is a beast of its own time, and that time has passed. It is a historical oddity. The wacky conspiracy theories of Illuminatus! have become either the grist of Dan Brown's mill or the weirdly pessimistic thought experiments of Scott Adam's Dilbert. Our culture now has its own bugaboos-- we are a highly pornographic culture, with nearly-naked underage nymphs selling underwear on billboards and Disney promoting boy bands with lyrics about irresponsible lust and desire, yet at the same time we consider red-lettering for life any and every man who had sex in a public park at midnight or chatted up just the wrong person at the wrong moment. The Internet tightly wires our entire informational existence together which has had the effect of telling us what other people really think and feel-- and paradoxically led to the even stronger vehemence against those opposing worldviews because now we perceive just how many people hold to them. These habits of thought, these expectations, just do not live in Illuminatus! and we miss them. Illuminatus! is a historical oddity and a good one, but unless you have a grasp of that history, Illuminatus! will be a hollow and unmemorable pleasure."}, {"userName": "Gar", "userReviewDate": "Jul 12, 2007", "userURL": "http://www.goodreads.com/user/show/188437-gar", "userReview": "Honestly, the bury-the-needle rating on this is primarly from nostalgia and gratitude. The thing is, the book saved my soul. I say this because I read the Illuminatus! trilogy the very first thing after stumbling into reading Ayn Rand's Fountainhead and Atlas Shrugged in high school, as a fairly bright and moderately-creative geek, which qualities looked even more exaggerated by relative comparison to a very small class size. That's like getting injected with concentrated live-culture viruses after your immune system has been taken out by heavy radiation blasts.But the Illuminatus! trilogy is like a gene-tailored antidote to that. Who knows what abyss I would've fallen into otherwise?It also was instrumental in priming me to get right with \"Bob\" later in life. It couldn't fully open the Third Nostril, but it loosened things up in there for the eventual forceful blow."}, {"userName": "Greg", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/42508-greg", "userReview": "Maybe I'm destroying the integrity of my reading list and goals for the year by rating this along with the three individual novels. I have thus only read either three books instead of four, or one instead of four if I want to think of the books I've read as something closer to the books I've bought, since I don't own old mass market copies of the three books, and thus only 'read' from one book. I think in the spirit of this book it's most appropriate to add four books to my reading list... since I think it was Pythagoras who called four (or a tetrad) the perfect number, because contained in it is the number 10 (1+2+3+4), and ten is 5 two times (I'm trying my hardest to come up with some rationalization for all this that ends in the number 23 but I'm failing, I'm sure it's there somewhere though..... oh oh oh, I've got it, by rating four books the tetrad becomes 5 and 23, 1+4 = 5 and 2 and 3 in the middle are obviously 23, thus this trilogy needs to be read/rated in this manner, or at least now I can feel comfortable having done so and not feel like I'm throwing off the whole 'how many books did I actually read' number or feel like a total fake when December 31, 2017 comes around and I'm reading some comic book just to get one last book to on to my 'read' list for the year so I can earn yet another 'reading goal' little image on my profile...).Without having to use the crazy logic of this book to support this decision, the real reason I'm rating this alongside the three books that make it up is that the whole here is greater than the parts. Each individual book I only gave four stars to, but as a whole, it's definitely deserving of five stars. It's right up there with Gravity's Rainbow for me. I don't know if it's a good thing or not that it took me twenty years or so to finally getting around to reading this (as a note: I haven't owned the book for 20 years, I actually bought it right before I started reading it, but it had been something I had felt I 'should' read on and off for the past two decades). If I'd read it twenty years ago I might be able to say that this book was a huge influence. I didn't and it wasn't. Instead, there is an awful lot in this book that (politically, at least, and maybe ontologically) felt like Oh My God! this is how I think, and because it's so convoluted kind of insane sounding and often times seemingly contradictory it's also the reason why I don't talk about politics (or almost anything actually) with people... and why if I were of a paranoid state of mind I would believe that the sound of goose-stepping jackboots were (still) coming from the right and the left. I have no idea what this says about me.Anyway, five stars, and now back to my regularly scheduled reading regiment, where I go and re-read a book that I didn't enjoy the first time reading but which other people love, and which I'm hoping to enjoy more the second time around."}, {"userName": "Naomi", "userReviewDate": "Mar 30, 2007", "userURL": "http://www.goodreads.com/user/show/43004-naomi", "userReview": "The authors thought they were WAY more clever and intellectual than they really were. Mostly these books were pretentious and boring and a regurgitation of themes that had been explored numerous times in numerous other places. Not to mention the fact that the whole trilogy pretends to be building up to some huge world-altering event that never actually happens. It's like the authors finally realized after 3 books that they didn't really know what they were trying to say or where they wanted the plot to go, so they just decided to end it. A huge, utter, complete waste of time."}, {"userName": "rachelm", "userReviewDate": "Sep 25, 2007", "userURL": "http://www.goodreads.com/user/show/82566-rachelm", "userReview": "As I'm having trouble summarizing this book myself, I've decided to quote the meta-review of their book which the authors wrote into the novel:\"'It's a dreadfully long monster of a book,' Wildeblood says pettishly, 'and I certainly won't have time to read it, but I'm giving it a thorough skimming. The authors are utterly incompetent--no sense of style or structure at all. It starts out as a detective story, switches to science-fiction, then goes off into the supernatural, and is full of the most detailed information of dozens of ghastly boring subjects. And the time sequence is all out of order in a very pretentious imitation of Faulkner and Joyce. Worst yet, it has the most raunchy sex scenes, thrown in just to make it sell, I'm sure, and the authors--whom I've never heard of--have the supreme bad taste to introduce real political figures into this mishmash and pretend to be exposing a real conspiracy.''If The Lord of the Rings is a fairy tale for adults, sophisticated readers will quickly recognize this monumental miscarriage as a fairy tale for paranoids.'\"That said, it was a great book. If you either like science fiction or are skeptical of privilege and politics, you should read it. If you don't see the fnords, they can't eat you."}, {"userName": "Tim Pendry", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/1016626-tim-pendry", "userReview": "[This review is dedicated to the anarchist and occasional friend Steve Ash who sadly died last year. This book meant a great deal to him.]Wrongly sold as science fiction, this is an anarcho-libertarian bit of mischief mashing up some serious indirect philosophy and psychology with popular cultural memes, conspiracy theory, erotica, the occult and a lot of dated political satire.It is so deliberately occult in places as to become occasionally (and ironically) a bit pompous, much like its 'hero' Hagbard Celine, the Captain Nemo of the story. The satire is somewhat jaded and the three novels taken together are too long and sometimes over-written.But, having said this, the book is mostly a great deal of fun and, once you get used to the technique of having apparently disconnected tales flow into each other without any clear sign that the narrator has changed, easy enough to get through.It is a classic text because it introduced into popular culture an entire alternative way of thinking about the world which, though sometimes as absurd as the 'morning of the magicians', is genuinely liberatory and, ultimately, 'true' or 'as true' as anything else.We have to remember the time when it was written - the depressingly reactionary period in early 1970s America that emerged in response to the counter-cultural liberatory aspects of the 1960s. Yes, the 1960s were an era of unorganised narcissism whose final result was Hillary Clinton but, in that specific context, Shea and Anton Wilson provide us with a cogent popular explanation of why anarchic narcissism may be the only appropriate response to authority.The themes in these book - Lovecraftian, erotic, science fiction, conspiracy, new age - have, for better or worse, embedded themselves in the minds of those who will not accept that state authority is anything other than oppressive.In this respect, the seeds laid by Shea and Anton Wilson in the 1970s act as counterpoint to those laid by Saul Alinsky, as alternative democratic sub-socialist and anarchic sub-libertarian responses to Leviathan, the State - or rather to Man's determination to submit.The dominant model of political organisation in relation to the American State on the American Left is a sort of 'femininised' or beta male baring of the arse in order to be buggered in the hope that eventually the old beast will die and the buggered beast will inherit.The anarcho-libertarian model seems to abandon all notions of Right or Left (which confuses the traditionalists of the Left) and laud the trickster, freethinker, pirate and even criminal against the very notion of order. It is a view of human nature as good in the very end - or at least as less bad than when it is in under orders. The politics may be questionable but the psychological and philosophical insights are less so, even if presented in quasi-Zen parables and obfuscatory occultism.The Trilogy (and the 'serious' Appendices, with no more 'truth' in them than any other part of the books) offers us versions of a number of theories questioning the reality that we create out of our sense perceptions and, in particular, social reality.This questioning of social reality will last far longer than the political satire and the book's somewhat stock appropriation of cultural memes, such as Lovecraftian monsters and Nazis waiting to rise to make blood sacrifices to 'immanentize the eschaton'.The book is justified by its bringing these thoughts about social reality subliminally to thousands of young people in every generation although, sadly, for every one who gets it, ten or a hundred will not and cease to be as functional in their own interest as they might.Many observers have not noted that, as a book of constant paradox, the Trilogy, with its twists and turns has inherent fascistic aspects too - the elite eroticism, the leadership principle underpinning Hagbard, the cyclical views of history, the appropriation of traditionalism. There is also implicit in the vision a disturbing sense of history as elites manipulating masses but without any real outrage being expressed - the Discordians seem simply to wish to play in the game on equal terms, disrupting the forces of order to restore 'balance'.In this world view, there is still a hierarchical view of humanity. The masses could have their eyes open, and the Discordians devoutly wish that this would happen, yet a deep conservative pessimism in the game players leads them to accept that it will not.The clever trick played in the book is that the naive reader who thinks he has 'got it' is really being manipulated into the false belief that, because he has 'got it', he is now part of the same elite that gave 'it' to him. He is not. The authors warn but not directly.Look hard and there is a paragraph in the Appendices where an argument for human sacrifice of a most primitive type is made too plausible to be ironical, a nod perhaps to Evola, yet contrasted with horror at the mass immolations of war and that 1970s preoccupation, the Holocaust.This is where the 1960s Generation can be seen to be bifurcating into an authoritarian and ideological optimism on the one side and a tendency to inverted rage and pessimism. The slave now adopts guerrilla tactics to undermine what cannot be destroyed frontally. Magick and the occult in particular are the tools of the frustrated and the outsider and this book is heavily imbued with magical thinking. Contemporary anarchism, Goth culture, popular horror, fantasy and the occult are now very much combined as a model for libertarian resistance to Leviathan - and the fantastic aspects do not stop police raids even today on those who withdraw from the system and wear black.Culturally this is an important book, a tour de force in terms of its organisation of literary references and even plot. Its weaknesses are those of its time and we can only understand it by referring back to that time.Beyond the politics, the book must be marked out as a text that introduced radically new ways of thinking to a mass audience - even if its subtleties have bypassed and will bypass those who read the New York Times and the Guardian and think they represent reality. Related Reviewhttps://www.goodreads.com/book/show/6... - the history of magical grimoires and their use as forms of resistance"}, {"userName": "Robyn", "userReviewDate": "Mar 26, 2011", "userURL": "http://www.goodreads.com/user/show/5106028-robyn", "userReview": "Be careful if you're going to pick up this book. This is not the kind of story that hands everything to you, or wraps up every element of the plot in a neat little bow. This book demands a lot of you, it moves fast, and not always in the way you expect, and you just have to keep up. Yes, there are plenty of places where you are going to have NO IDEA just what is going on, you are going to have to go back and re read passages to understand them, and you do need to read all of the appendices if you want to fully get it.That being said, this book has great rewards to offer. I can't even begin to try to explain the way that this book changed the way I think, and the way I see the world. I'm not the only person in this world for whom this book was an utter revelation, if you don't believe me, just google it.This book has pretty much everything that I could want from a book, conspiracies and plots, philosophy, romance, action. My boy friend reminds me that this book is also Hilarious, on so many levels, whether you have a taste for goofiness, dark humor, or dry irony, there is something to laugh at. And if course, when you're reading it, it's perfectly acceptable, even encouraged, to laugh at anything you aren't sure about.This is one of those books I think Everyone should read. So, get yourself a copy, and strap in for the ride."}, {"userName": "nostalgebraist", "userReviewDate": "Mar 13, 2012", "userURL": "http://www.goodreads.com/user/show/8178894-nostalgebraist", "userReview": "(Edit, 8/3/13: finally finished this. Review still stands.)On p. 650 of 800 but the last 70 are just appendices and I feel like writing a review now, so . . .I've been reading this very slowly over the course of many months, which I guess is a reflection of how little it has really engaged me. On the other hand, I feel no animosity towards it, and fully intend to finish it eventually. To my taste it is neither especially good nor especially bad; it is just a odd, underwhelming if inoffensive sort of book that seems to have been intended for an audience I do not belong to.According to Wikipedia, this is how the authors came up with their premise:The trilogy was originally written between 1969 and 1971 while Wilson and Shea were both associate editors for Playboy magazine. As part of the role, they dealt with correspondence from the general public on the subject of civil liberties, much of which involved paranoid rants about imagined conspiracies. The pair began to write a novel with the premise that \"all these nuts are right, and every single conspiracy they complain about really exists\".The trilogy is pretty much what you'd expect to yield from such an idea, or specifically what you'd expect from a work that set out to thoroughly explore that idea at the expense of plot and characters as traditionally conceived. The narrative is a phantasmagoria of crackpot ideas, rarely sticking with one character or idea for more than a few pages. To say that the plot is full of twists would be misleading -- in fact there is not so much a \"plot\" as an extended, rather monotonous sequence of shifts from one weird worldview to the next. The reader quickly learns not to be surprised when any given perspective on the story begins to break down, so there is little room for these shifts to have anything like the impact of ordinary \"plot twists.\"Reading the trilogy ultimately feels a lot like surfing the internet in search of information about conspiracy theories. If you've ever done that for fun (and I have), you may find it entertaining. But 800 pages worth of conspiracy surfing is quite a lot. There is a set of recurring characters but none of them are especially well developed -- different segments of the book are told from different characters' perspectives, but often these are barely distinguishable -- and, outside of a few fairly effective scenes of frightening peril, there is very little \"human interest\" material to sustain one's interest. The prose is mostly flat, unadorned description, with occasional not-very-impressive stream of consciousness episodes. There is plenty of violence, unusual sex, drug use, and far-out ideological talk, but the people who engage in this behavior feel to the 21st century reader like a set of 60s/70s cliches, and the trilogy's attempts to be weird and shocking feel like quaint artifacts of their time, much less truly mind-bending than, say, Joyce (whom Shea and Wilson clearly idolize -- in fact they mock themselves for this in the text).I get the feeling that Shea and Wilson would agree with me that their characters are cliches. Much of the trilogy is written with a deliberate sense of artifice, as if the authors want their characters to feel like they are outgrowths of ideas -- cliches, conspiracy theories, ideologies -- rather than organic, independent beings. The goal is, I guess, to instill a universal skeptical wariness in the reader, to encourage them to reflexively doubt every element of the story, whether it emerges from conventional wisdom or from the furthest-out fringe. Again, though, 800 pages of this is a lot, especially for readers for whom universal, reflexive wariness is not a new idea. The parts of the trilogy I have most enjoyed are the parts that come closest to ordinary extended fictional narrative -- such as a segment about the history of Atlantis -- and these segments make me wish Shea and Wilson had written something closer to a straight science fiction novel about an elaborate mega-conspiracy, rather than this campy, self-parodic, under-characterized not-quite-a-story, which stretches its gimmick out at great length in the name of some fairly obvious principles of critical thinking. It's not that I have a problem with experimental writing, or with novels that don't have conventional plots, or with works that joke about and undermine each discourse they invoke -- it's just that there are plenty of books that do those things much, much better. When Shea and Wilson bring up their love for Joyce it's hard not to wonder what they think they have to offer that he doesn't.Nonetheless, this is a pleasant, readable, likable work that occasionally achieves the kind of transcendence-through-zany-bricolage that its authors are striving for. It apparently has a lot of extremely devoted fans, which I don't entirely understand, but I'm not going to question the validity of their enthusiasm. Maybe if I had read it ten years ago -- or had been born thirty years earlier -- Illuminatus! would have blown my mind. As it is, my opinion of it is almost entirely neutral, as if it and I have passed through each other in ghostly fashion without touching or leaving any marks."}, {"userName": "Erin the Avid Reader ⚜BFF's with the Cheshire Cat⚜", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/23003918-erin-the-avid-reader-bff-s-with-the-cheshire-cat", "userReview": "What a strange, strange trilogy that I *unfortunately* was not able to finish. I was 1/4 way through \"Leviathan\" (the third and final book in the trilogy) before calling it quits. It got so repetitive to read and the stuff they daresay call \"humor\" was well, kinda boring and not original at all.I meant to review this trilogy after I read it but it sort of just left my mind until my mom brought the book home that she borrowed from a co-worker a couple weeks ago. I looked at the cover and instantly remembered. I was kind of surprised to see my mom bring this home, for my mom is the one who reads classics, philosophy, and noir horror.I asked her \"Uh, are you interested in reading this book?\"She looks at me and says \"No. Looks outdated and lame.\" She's 100% correct on that on, and all she hadn't even opened the dang book. This book tried selling itself as being funny and having raunchy sex and foul language. Does it deliver on both levels?Eh. Kinda vanilla, really. I think they only put it in the book because they thought it would sell, and sell it DIDN'T. In some ways I'm partially disappointed I didn't finish it all, but part of me is just patting myself on the back. This book was an absolute CHORE to get through. It's also not a very original piece of literature. Imagine taking concepts that have been to death and spanning them for 500 pages each, the throw in boring banter and humor, vanilla sex every now and then, and some swear words cuz why not? You got the Illuminatus! Trilogy.I will admit though, this book does start out intriguing, but by the end of the first book (The Eye in the Pyramid), it started losing a lot of steam. It was midway through The Golden Apple where I was just trying to prop my eyes open from reading this, but I managed to finish it. I then started Leviathan and called it quits by page 100 or so.Even though I thought this book was boring and unoriginal, do I hate this trilogy? No. Not at all. It's just that this book felt like a CHORE more than escapism, which is why I read books in the first place. Lots and lots of them.Some people are gonna say I should not review this book since I didn't finish the trilogy, but let me tell you, I WAS SO CLOSE, yet so far. I seriously couldn't even try on this book anymore. I lost all my steam and patience for it."}, {"userName": "Carolina Liechtenstein", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/33788398-carolina-liechtenstein", "userReview": "Approaching this book like a puzzle is the best way to read it, in my opinion. It is a puzzle, linking many pieces into a loose network of organizations, individuals and leaders. It reveals the loosely linked nature of the Elite influencers at the top. Going in this book talking it lightly, I completely enjoyed it. I also learned a great deal about the Elite."}, {"userName": "Michael", "userReviewDate": "Feb 09, 2009", "userURL": "http://www.goodreads.com/user/show/1938544-michael", "userReview": "For me, this book was a moment of Awakening, and the changes I wrought in myself after first reading continue to reverberate today. I had been brought to it through playing the card game it inspired. A desire to Seek the Mysteries caused me to follow up on the \"Bibliography\" included with that game, and I picked up this book expecting a sort of \"In Like Flint\"-style spy thriller/parody that exploited theories of vast conspiratorial networks. What I found was an exploration of reality on various levels that deconstructed my assumptions about the nature of politics and existence. It won't work this way for everyone; all Awakenings are personal. It remains, however, a very funny book with a surprising amount of metaphysical insight - a pretty rare combination (although I daresay that the truly Enlightened laugh while reading the Bible or the Tao Teh Ching). On re-reading it today, I perceive that I came upon it at a propitious moment in my life. It has also become clear to me that it works less well for others than it did for me - in the book club I was in, none of the women were able to finish even the first book, which seems to result from the rather adolescent attitudes toward sex expressed by the authors. It was healthy enough for me as a 16-year-old male, but it does occasionally make me wince as an adult. A more minor concern is that there is so much bad German (since the \"Illuminati\" were Bavarian, of course). It's pretty clear that neither author spoke German, yet they tried to insert it in various places to spice things up. When I read the German translation of the book, this led to some amusing moments as the translator often just left their nonsensical German phrases in the midst of the prose. The many English puns often went right over his head as well, so I guess it was even.A lot of the book hinges on then-current political events, which makes it a kind of funky-hippy lesson in American history: Watergate, Vietnam, the Kennedy assassination(s), the 1968 Democratic National Convention, Woodstock, the Weather Underground and the Civil Rights movement all play their parts. Discerning between the parody and the reality may require some knowledge of the period, or perhaps one could create annotations to the text through frequent reference to Wikipedia. Part of the awakening aspect I spoke about for me was figuring out what it was everyone was so worked up about when I was a kid, and seeing the political world through the eyes of concerned and disillusioned adults.I suspect one of the reason people have difficulty reading it is that it is written in an experimental and seemingly random third-person omniscient perspective, which floats into the first person and occasionally changes from past tot present tense. The sort of thing that was common enough at the time, but today gives editors (and many readers) fits. This may help to explain why I have such a hard time reading contemporary fiction - if the point of view hasn't changed after three chapters, I'm bored. I do think however that Wilson & Shea handle their transitions and pacing well, it just takes some getting used to if you're new to it.I still enjoy the book greatly, and it belongs in the pantheon of \"important\" books of my life. It is not without flaw, but I owe it a great deal nonetheless."}, {"userName": "Aaron", "userReviewDate": "Jul 17, 2007", "userURL": "http://www.goodreads.com/user/show/198291-aaron", "userReview": "Couldn't finish it. Didn't even finish the first book in the trilogy. Interesting. Ever-shifting in perspective like \n Ulysses\n, but Ulysses unlocalized. Instead of focusing on one person on one day in a very distinct place, it looks at a number of disparate people all over the world in places both real and imaginary, with no regard for chronology. Some fine writing in there, but the hyper-leaps from the JFK assassination to underwater battles over Atlantis to graphically-described sex rituals (sometimes without even a paragraph break!) are just a little too messy for my taste."}, {"userName": "Norman LaFave", "userReviewDate": "Apr 29, 2011", "userURL": "http://www.goodreads.com/user/show/5299646-norman-lafave", "userReview": "This was the strangest book I have ever read. I almost gave up a couple of times but I am glad I didn't.The book presents every conspiracy theory known to man in a fashion that seems to defy coherent timeline and consistency. It is as if each chapter was written independently, with only the faintest of connecting threads. I often thought that I was reading someone's acid induced musings.It wasn't until I had read well into the book that I realized there actually was a pattern to the story. It was sort of like looking at a TV screen with your eye an inch from the screen. Everything looks random and disconnected. It isn't until you back away do you see that the pixels form an actual picture.I found this unique approach to be fascinating once I understood what the authors intended. The story comes together not through a timeline, but like seemingly random brush strokes on a canvas makes a painting.Couple this with a truly paranoid story, strange characters, sexual perversion, and lots of drugs, and you have a truly unique and disconcerting tale that leaves you wondering if you had been secretly slipped LSD while you were reading."}, {"userName": "Matt", "userReviewDate": "Mar 29, 2008", "userURL": "http://www.goodreads.com/user/show/1033675-matt", "userReview": "I like this book because it takes every conspiracy theory that existed prior to 1975 and weaves them into a grand narrative of the 'haves' pulling a fast one on the 'have nots' since before the beginning of recorded human history. Also, similar to William S. Burroughs, I think you have to examine RAW's work in the context of him being such a defining force in the American underground culture. Having said this, I do have one major complaint about this work. This is one of those books that has too many damned characters involved in too many damned things. The fault may lie in my attention span, but I think it is a problem when a character reappears after a couple of hundred pages and the reader has to stop and think, \"Now who was that again?\" Part of the genius behind the whole thing is that the writers could sit down and write this thing and manage to keep all the characters (some with shifting alliances), conspiracy theories, and storylines straight."}, {"userName": "Geoff Gerrietts", "userReviewDate": "Jul 24, 2007", "userURL": "http://www.goodreads.com/user/show/141826-geoff-gerrietts", "userReview": "I have given this book away so many times now. It's the only way I can repay the favor Jayson did me when he initially loaned it to me. This book literally changed my life, and I can only believe for the better.Countless bizarre ideas and ideologies are brought together in a raucous, chaotic storyline spun through three volumes. Discordianism, Kabbalah, the Church of the Sub-Genius, elaborate retellings of conspiracy theory and countless other bizarre and interesting ideological landscapes get mashed together into what I can only describe as a snapshot of all those eddies and pools that can't quite make it into the main stream.This book has a sort of cult classic status to it. It's got a lot of post-adolescent hormonal appeal to it. It's got an uneven narrative and the characters range from human to cartoon, sometimes within the same character. But for its flaws, it's a touchstone for alt.geek culture."}, {"userName": "Josh", "userReviewDate": "Feb 05, 2008", "userURL": "http://www.goodreads.com/user/show/864861-josh", "userReview": "This book was so unbelievably aggravating to read it's hard to fully explain. There are no chapters, three gazillion characters and plots, and most of them are on acid the whole time, so it's nearly impossible to keep track of what's happening. But, there's so much information in it that everyone should know about the rich history of conspiracy theories and mythology that it's hard not to recommend it. Basically, this is a book that you want to have read, but not to actively read."}, {"userName": "Jack Waters", "userReviewDate": "Apr 30, 2010", "userURL": "http://www.goodreads.com/user/show/3663641-jack-waters", "userReview": "INTIMIDATION FACTORSOver 800 pages (though the pages span over three books)Who in the world are these authors?You don't want to be caught in public holding a book that looks like this.Not for the dogmatically sensitive.The plot of Illuminatus! is difficult to describe, but I'll try. The offices of a magazine are bombed, supposedly by a conservative group of some sort. The editor of the magazine has disappeared without a trace. Detectives assigned to the case find out that the cause is actually much more confusing than originally supposed. Yes, this sounds similar to plots from other books you've read. But involved here is a likely conspiracy that may go back 18,000 years in the past. Or perhaps just back to the eighteenth century. Or maybe it's all made up. It really is up to the way you interpret it on your own. Okay, that also sounds like other books you've read. But Illuminatus! isn't hack writing like Dan Brown.Could I convince you to read it knowing that you can expect talking dolphin poets fighting off a secret government's pop stars' zombie Nazi army during a Woodstock type of a rock festival? Or that it is full of Zen philosophy, Discordian ideals(look it up online), Freudianism, nympho free masons, and outright nonsense? It is also chock-full of secrets societies, conspiracies, LSD, giant golden submarines, and escalating cold war issues. The humor and blatant non-seriousness of these woven stories leaves a reader with a feeling of not knowing what to believe. The overall feel like you're reading a parallel universe of alternate history book. The book sets out to break the readers mind down by stripping away your preconceived ideas on each of the above topics and will have your head spinning after the first few pages.The authors themselves were kind enough to review their own book on page 238; \"It's a dreadfully long monster of a book...\" \"The authors are utterly incompetent -- no sense of style or structure at all. It starts out as a detective story, switches to science-fiction, then goes off into the supernatural, and is full of the most detailed information of dozens of ghastly boring subjects. And the time sequence is all out of order in a very pretentious imitation of Faulkner and Joyce. Worst yet, it has the most raunchy sex scenes, thrown in just to make it sell, I'm sure, and the authors -- whom I've never heard of -- have the supreme bad taste to introduce real political figures into this mismash and pretend to be exposing a real conspiracy.\" What the Illuminatus! Trilogy is really like -- imagine your uncle leading you along in an interesting and likely emotionally-drenched story, and then cracks a joke seemingly out of nowhere, at which point you are likely not going to be able to ascertain whether it's really funny, or really messed up. Or like the feeling of watching a really good History Channel documentary delving deep into secret societies or regimes and then sitting on the remote, causing the channel to change abruptly to Family Guy. It clumps chronologically separated moments into a thread of continuity that actually makes the books better off for doing such. History nuts aside, who really remembers precisely when historical events took place, rather than ‘in the past’ or ‘in my textbook?’Put your Dan Brown and Hot Chocolate down, and request that the bookstore orders a copy of the Illuminatus! Trilogy. I had to get my copy at Ken Sanders Rare Books in SLC, and it was on a bookseller’s recommendation that I got the book. I have yet to see a purchasable copy in Utah County. Call the store beforehand. Illuminatus! is a ‘Rated R’ to Dan Browns ‘Rated PG-13’ if that makes sense. You'll be happy you did."}, {"userName": "Whitney", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/8321217-whitney", "userReview": "Best book I've read all year. I can't describe it. I can only say that my reading list has quadrupled since adding sources I learned of from this book. It is ostensibly about a detective investigating a bombing, but it is actually about everything and I'm not being hyperbolic. I will recommend it to every smart person I know. It blew my mind so hard. They have me investigating Buddhism, magick, negative-interest currencies, Discordianism, Gestalt therapy, game theory, and so so much more. It connects the dots of our fragmented society to create a whole picture.READ IT!"}, {"userName": "cory", "userReviewDate": "Feb 07, 2008", "userURL": "http://www.goodreads.com/user/show/887217-cory", "userReview": "conspiracy theorists burned this book while everyone else rejoiced. at one point the devil emerges on LSD (no Lake Shore Drive) at an apartment in the form of billy graham. yeah right! and there are talking dolphins. now go back in read those words in a random order, interjecting any three letter acronym you can think of, and piece together what they might try to mean and effectively 5+5+4=5 and you'll know what i mean"}, {"userName": "Vickie Schmidt", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/72285156-vickie-schmidt", "userReview": "The only work of fiction I needed to take notes with. It has lingered with my thoughts for a decade. Something to read when you want to make reading an entertaining feat."}, {"userName": "Ron", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/5938624-ron", "userReview": "I first read this masterwork about 10 years after it was released, just as I left college and turned that magical number age of 23. While I scarcely knew any of the references in the book at the time, I realize now that all of the political themes were accurate and that it influenced my political orientation for the rest of my life (and though I wrote nothing down at the time, I've randomly come across and devoured nearly all of it, from La Bas by Huysmans to the work of Bucky Fuller). While I abhor fantasy literature and all the creatures made from whole cloth--and make no mistake that this is not science fiction, but realism tainted ever so slightly with the fantastic--their portrayal here is tolerable because it illustrates the use of fantasy as propaganda throughout history to keep the populace in fear. What little that isn't accurate is only due to certain scientific facts not yet being known (that there have been 5 rather than 2 mass extinctions, as one example). Additionally, many things that had not yet come to pass were presciently envisioned by this book that already noted that our world was a police state and would only grow more fascist with time, as well as suggesting that when a more efficient medium arose that taboos on TV would decrease (we saw that with the rise of the internet and social media at the turn of the century, when a new golden age of TV arose that was more honest and explicit). The book didn't merely inform my political sensibility, but my personal beliefs about living a life more true to nature (the Biogram having precedence over the Logogram, elements of the Gaia theory that informed John Zerzan's anarchist theory). Drugs and sex as pathways to mystical enlightenment, as ways of cutting the puppet strings once they have been revealed, are also brilliantly explicated. The authors hint near the end that those who read it may not understand it fully for months or even years but that it would still have the effect of the repetition of certain Buddhist modes of writing and cause a fundamental shift in sensibility (something I also later encountered in a brilliant novel called Gojiro). While it would take me many, many years to absorb much of the data intellectually, the emotional content was apparent immediately. Reading it again as only affirmed that, as it was even more powerful now that I understand all of the references (I even found a copy of the Monk along with it in a little library that same day)."}, {"userName": "Sandy Bookwitch", "userReviewDate": "Jan 31, 2013", "userURL": "http://www.goodreads.com/user/show/5381862-sandy-bookwitch", "userReview": "Stream of consciousness style from hell! More decipherable than Finnegan's Wake, but how much does that really say?? Keeps switching tense, point-of-view, moves between first person perspective of multiple and conflicting characters over space and time. A real mind fuck and I'm only about 100 pages in... Still trying though. Fascinating actual historical stuff and actual conspiracy theory quoted documentation dating back centuries. The first fictional work, of which I'm aware any way, to tackle the Illuminati theories etc. The authors do so *mostly* tongue-in-cheek. 02/22/2013 Still slogging through it, at about page 220 now. Some amazing research of conspiracy theories but the jumping back and forth between characters and points of view is still dizzying and confusing but so far worthwhile, if slow-going. I see that some of the research done for these books eventually also went into Shea's \"All Things are Lights\" about the Inquisition's destruction of the Cathars in Languedoc and Templars in the Crusades. 03/05/2013 Now up to page 350-ish and into the 2nd book. Found they had written their own mostly accurate but hilarious review of this triple volume within the first book as something for which the magazine that begins the whole tale is awaiting the submission by the reviewer.\"'It's a dreadfully long monster of a book,' Wildeblood says pettishly, 'and I certainly won't have time to read it but I'm giving it a thorough skimming. The authors are utterly incompetent--no sense of style or structure at all. It starts out as a detective story, switches to science-fiction, then goes off into the supernatural, and is full of the most detailed information of dozens of ghastly boring subjects. And the times sequence is all out of order in the very pretentious imitation of Faulkner and Joyce. Worst yet, it has the most raunchy sex scenes, thrown in just to make it sell, I'm sure, and the authors--whom I've never heard of--have the supreme bad taste to introduce real political figures into this mishmash and pretend to be exposing a real conspiracy. You can be sure I won't waste time reading such rubbish, but I'll have a perfectly devastating review ready for you by tomorrow noon.'\" At least somewhat accurate..."}, {"userName": "Donald", "userReviewDate": "Oct 23, 2007", "userURL": "http://www.goodreads.com/user/show/208809-donald", "userReview": "The \"Illuminatus\" trilogy is marvelous, compelling and often hilarious. Authors Shea and Wilson weave a complex, meandering tale around the Illuminati, a group that even establishment historians acknowledge existed. The difference here is that, like many conspiracy theorists, the authors propose that the Illuminati never disbanded and continue to run the world behind the scenes.Reading author Robert Anton Wilson's susequent works, some inspired by his friendship with LSD guru and rumored CIA operative Timothy Leary, reveal him to be a true skeptic towards all conspiracy theories, and in fact he was often accused of being a government disinfo agent himself. Another fact most people don't know is that Discordia, whose principles are woven throughout the trilogy, was actually the invention of a real-life character related to the JFK assassination. Kerry Thornley, who was somehow known to the authors (enough to make some of us suspicious in and of itself), was one of Lee Harvey Oswald's fellow marines, and actually wrote a book about him BEFORE the Kennedy assassination. Many JFK assassination researchers, myself included, think that Thornley was a shady character, and perhaps was connected to the conspirators in some way. Still, his principles of Discordia are entertaining and certainly add to the books. At any rate, the \"Illuminatus\" trilogy captivates the reader, with its assortment of fictional and real characters, and its allusion to a very powerful Them orchestrating the significant events in our lives. Some of the material here is obviously meant to be ridiculous; it's highly doubtful, for instance, that John Dillinger survived his battle with government agents and became a member of the Illuminati. This trilogy influenced me deeply, both in my writing and my personal conspiracy theories. I'd recommend it to everyone, but I suspect only the paranoid and cynical, like me, will truly appreciate it."}, {"userName": "Noble", "userReviewDate": "Oct 02, 2010", "userURL": "http://www.goodreads.com/user/show/4366761-noble", "userReview": "In a nutshell: sex, drugs, and conspiracies.Ridiculously surreal, jumping from one POV to another often and without warning (and sometimes mid-sentence, I think - it's been a while), as well as bouncing between pre-history and the near future and various points in between. Not even the characters really know who/where/when they are, half the time. Most of it seems like abject silliness, until you come across something, such as a prediction or comment about government and/or society, that makes just enough sense to make you start to question your sanity (because things simply shouldn't make sense in a book that includes mass human sacrifice with the intent to create Nazi zombies).This book introduced me to Discordianism and Operation: Mindfuck. Both are wonderful, and this may affect how much I like the book.A less flattering take comes from a character in the book (yes, they included a character for the sole fnord purpose of panning the book they were writing - it's that kind of weird):\"It's a dreadfully long monster of a book, and I certainly won't have time to read it, but I'm giving it a thorough skimming. The authors are utterly incompetent--no sense of style or structure at all. It starts out as a detective story, switches to science-fiction, then goes off into the supernatural, and is full of the most detailed information of dozens of ghastly boring subjects. And the time sequence is all out of order in a very pretentious imitation of Faulkner and Joyce. Worst yet, it has the most raunchy sex scenes, thrown in just to make it sell, I'm sure, and the authors--whom I've never heard of--have the supreme bad taste to introduce real political figures into this mishmash and pretend to be exposing a real conspiracy. You can be sure I won't waste time reading such rubbish, but I'll have a perfectly devastating review ready for you by tomorrow noon.\""}, {"userName": "Alexandra", "userReviewDate": "Jan 27, 2012", "userURL": "http://www.goodreads.com/user/show/7551251-alexandra", "userReview": "Possibly the wittiest book i have had the pleasure to read, from start to finish. It makes you lol, not an internet lol but a real lol, vocal chords and and lots of \"hehehehe Hagbard you bugger, your funny\" kinda laugh.I have read it twice now so am very familiar with the book, which really helped upon the second reading. It is a very long book, and if your taking your time reading it then you may forget a few things, like why Saul ended up in that weird hospital, the first time i read it i completely forgot all about the coppers and where Goodman went prior to the hospital episode, and when i got to that part i was like, what???? I knew the timelines jumped about so i thought it was part of the plot initially, though second read it all made sense.It is a very convincing book, i know lots of dolphins called Harold actually, though Nazi spider ships was a bit OTT =oPSeriously, this is a fab read, complex at times, confusing but downright funny, and clever.Will read this one again one day i am sure of that."}, {"userName": "Darth", "userReviewDate": "Apr 16, 2011", "userURL": "http://www.goodreads.com/user/show/363357-darth", "userReview": "Why cant I pick zero stars? This was less entertaining than the cereal box - and I havent eaten cereal since I was 12...From the cover and the write-ups on this, I thought this would be right up my alley - quirky / funny / entertaining / etc...After 100 pages I stopped reading - that may not mean much if you dont know me, but I NEVER stop reading. Same thing I do with movies, I ALWAYS see them through to the end. I guess I always figure there could be something at the end to tie it all up, or make it all worthwhile. Seldom happens though (Brown Bunny) but I still keep at it. But not with this nonsensical piece of rubbish.If there was a clear idea or thought stream, I didnt hang around long enough to find out. Think of this as Fear & Loathing in Las Vegas in book form - if that movie was your cup of tea, you might dig it, and I might just be the straight square not willing to drop acid to see the lights ;-)"}], "description": "It was a deadly mistake. Joseph Malik, editor of a radical magazine, had snooped into rumors about an ancient secret society that was still alive and kicking. Now his offices have been bombed, he's missing, and the case has landed in the lap of a tough, cynical, streetwise New York detective. Saul Goodman knows he's stumbled onto something big—but even he can't guess how far into the pinnacles of power this conspiracy of evil has penetrated.Filled with sex and violence—in and out of time and space—the three books of The Illuminatus! Trilogy are only partly works of the imagination. They tackle all the cover-ups of our time—from who really shot the Kennedys to why there's a pyramid on a one-dollar bill—and suggest a mind-blowing truth.", "title": "The Illuminatus! Trilogy\n      \n          (Illuminatus! #1-3)", "url": "http://www.goodreads.com/book/show/57913.The_Illuminatus_Trilogy", "average": 4.0, "cover": "https://images.gr-assets.com/books/1386923913l/57913.jpg", "reviews": 762, "authors": [{"url": "https://www.goodreads.com/author/show/5752454.Robert_Shea", "name": "Robert Shea"}, {"url": "https://www.goodreads.com/author/show/2918.Robert_Anton_Wilson", "name": "Robert Anton Wilson"}], "type": ["Fiction", "Science Fiction", "Fantasy", "Humor", "Philosophy"], "outlinks": ["http://www.goodreads.com/book/show/57913.The_Illuminatus_Trilogy", "http://www.goodreads.com/book/show/62542.The_Illuminatus_Trilogy", "http://www.goodreads.com/book/show/241879.The_Eye_in_the_Pyramid", "http://www.goodreads.com/book/show/208267.The_Golden_Apple", "http://www.goodreads.com/book/show/129128.Leviathan", "http://www.goodreads.com/book/show/975953.Time_of_the_Dragons", "http://www.goodreads.com/book/show/68365.Last_of_the_Zinja", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}