{"ratings": 169, "userreviews": [{"userName": "Anna", "userReviewDate": "Sep 30, 2012", "userURL": "http://www.goodreads.com/user/show/3096077-anna", "userReview": "First of all, the subtitle is a bit misleading. You won't get information on many aspects of growing nutrient-dense food, like variety selection and time of harvest, out of this book. What The Intelligent Gardener does provide, though, is well worth the price.I've been nibbling around the edges of learning about soil testing for the last couple of years, but this book turned my understanding into a full (and nutrient-dense) meal. Solomon's work is based largely on Albrecht's studies of the optimal ratios of cations (calcium, magnesium, potassium, and sodium), with a lot of updates from the more modern work of Astera. Solomon breaks it all down into simple worksheets that anyone can fill out with a calculator able to multiply, add, and subtract.A second warning is due --- you'll need to put quite a bit of cash into Solomon's method if you have a large homestead. Solomon's math only works if you do a Mehlich 3 soil test, which is about $20 per sample from a few select labs; then, you'll probably be committing to adding several hundred dollars' worth of amendments (like gypsum) to get your soil back in balance.Even if you don't want to go the scientific route, though, this book is worth it for its explanation of the chemistry of soil. Highly recommended!"}, {"userName": "Robin", "userReviewDate": "Jul 10, 2014", "userURL": "http://www.goodreads.com/user/show/16086956-robin", "userReview": "Reading the other (glowing) reviews, I wonder what I'm missing here. I did not love this book. The author actually implies that the AMA blatantly disregards knowledge of poor soil fertility leading to human disease to further it's own monetary interests in treating those diseases. Um, no. I can get behind assuring our soil is appropriately mineralized to grow nutrient rich food - I'm going to test the soil of our veggie plot and amend the beds appropriately. I can even believe fertilizer manufacturers would have farmers believing that traditional commercial fertilizer is all they need. But a conspiracy by doctors? Give me a break.And the microbiologist / geneticist in me reels at his assertions that the plague ( and other bacterial or genetically-influenced disease) only affects those eating food grown from nutrient poor soil. I'm sorry, but being \"already convinced\" *without* a study being done is ridiculous. Sure, just make totally unfounded assertions and call yourself intelligent. Gah. This book drove me crazy."}, {"userName": "Kathely", "userReviewDate": "Feb 23, 2013", "userURL": "http://www.goodreads.com/user/show/6252035-kathely", "userReview": "Too complicated. Let me boil it down: Your garden soil need more than just carbon and manure. Get a soil test. There. I just saved you a couple hundred pages of complicated soil chemistry."}, {"userName": "Randy", "userReviewDate": "Jan 23, 2013", "userURL": "http://www.goodreads.com/user/show/1918807-randy", "userReview": "Near the end of his new book, The Intelligent Gardener, long-time garden guru Steve Solomon makes a significant point: “There is no place on this planet that remains free of toxic residues.” He then suggests we would be far better off if we quit worrying so much about toxicity and, instead, concentrated on growing and eating nutrient dense food.I’ve been able to follow, and participate to a degree, in Mr. Solomon’s metamorphosis from expert “organic” gardener to expert “nutrient dense” gardener. Solomon, in my opinion, has long been ahead of the pack as evidenced by his books “Growing Vegetables West of the Cascades” and “Gardening When It Counts.” Through his early gardening experiences and from starting the Territorial Seed business he devised his Complete Organic Fertilizer (COF) which was an attempt to balance garden soil. COF is still a good way to go for people who don’t wish to go any farther and the formula is easily found on the internet. (Also in The Intelligent Gardener pps. 84-85).In the last half dozen years through association with Michael Astera’s Nutrient Dense Project and a re-study of the work of scientists like William Albrecht and Victor Tiedjens, Steve Solomon has become a convert to the concept of “nutrient dense.”The concept of nutrient dense food is pretty simple. The gardener works over time to balance the soil with the proper mix of minerals. The result will be soil that encourages the life forms (worms, bacteria, etc.) that help with soil symbiosis and soil that provides the nutrients plants need to grow properly. Balanced soil will mean healthier plants, resistant to pests. Balanced soil will result in food that is nutrient dense, providing us with the vitamins and minerals we need to be healthy.Steve Solomon spends a lot of time debunking the concept promoted by J.I. Rodale that compost would solve all problems and that by continuing to heap organic matter on a garden a garden would only get better and better. This is not the case as Solomon explains in detail in a chapter titled: SAMOA (The Shit Method of Agriculture). More important is bringing calcium and magnesium into proper balance. When garden soil is properly balanced, according to Solomon, the garden will create its own nitrates.Balancing calcium, magnesium, potassium, sulphur, sodium and other minerals is the key to nutrient dense food. Getting this balance correct begins with a $20 soil test. Then, with a copy of The Intelligent Gardener in hand, one can use the worksheets provided to come up with a prescription for a custom fertilizer designed for one’s own garden. Solomon’s colleague and co-author, California gardener Erica Reinheimer has developed a website where you can find copies of the worksheets found in Steve’s book. On this same website you will find a link to “OrganiCalc” which allows you, for a small fee, to compute your custom fertilizer prescription on line."}, {"userName": "Sébastien", "userReviewDate": "Dec 09, 2015", "userURL": "http://www.goodreads.com/user/show/12221895-s-bastien", "userReview": "\"Le Batterie de Cuisine\"! Really? Batterie is a feminine noun so it requires a \"la\" not a \"le\". People use French just to make it seem more sophisticated. Nothing sounds worse than mixing the masculine and feminine. This coming from an author who proudly names his book the \"Intelligent Gardener\". In other words, he's saying \"organic gardeners\" are stupid. Well, this author belly-flopped right after self-declaring his high intelligence - and that even before page number one!Aside from this blunder, there seems to be more science and fewer organic mantras. It is practical and rich in information but what the....le batterie? I pick up this book, eagerly start reading about cations, then I come across \"le batterie\" so now I want to throw this book in the compost!"}, {"userName": "Tad Hussey", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/27166576-tad-hussey", "userReview": "My only complaint is that he downplays the significance of the soil food web and nutrient cycling in the rhizosphere in my opinion. Excellent read though and the best bridge between the mineral folks and the soil food web guys I've read to date."}, {"userName": "Andrew Welleford", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/67642053-andrew-welleford", "userReview": "This book takes on the challenging task of breaking down an advanced soil test and using that information to produce food of the highest quality, and succeeds in that goal. Solomon presents a workbook (and points to the digital alternatives) that breaks down this process step-by-step, and spends most of the book explaining the importance of each step, caveats, and alternatives. He also shares the recipe for a \"Complete Organic Fertilizer\" based on this information. The source of this approach is author's interpretation of the Albrecht-Kinsey hypothesis of soil mineral balancing, a compelling alternative to conventional \"sufficient levels of available nutrients\" approach recommended by most university extension offices. I find this book especially valuable because it comes from the perspective a long-time organic grower and author who through personal experience over the years has become convinced that this soil test-based approach can improve upon conventional compost-focused backyard organic gardening. The author has changed his mind several times over the years based on new information, and admits to it, which I find honest and refreshing."}, {"userName": "Jean-marie Prevost", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/23372629-jean-marie-prevost", "userReview": "Coming from a bunch of purely permaculture/organic gardening books and experiences, it was very interesting to get this sort of \"in between\" opinion that highlights some glaring weaknesses of various methods.What I personally didn't like about this book is that while accusing some organic gardening's myths and faulty reasoning, the author is guilty of some pretty \"bad science\" himself, jumping to conclusions from his own experiences as if they were facts a few times throughout the book. Nothing major, and mostly when the author speaks of stuff outside the scope of this book.Speaking of the scope of the book, as it's subtitle clearly states, it is all about growing nutrient dense food. It's not about general growing tips, growing lots of food, it's not necessarily about being the most organic you can be or about permaculture (though there are some interesting ideas on the subject); the main goal is growing food that has the highest nutrients vs calories."}, {"userName": "Rob", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/41538467-rob", "userReview": "Hard book to review. This is a five-star book if it is scientifically accurate, and a one-star book if it's just a bunch of pseudo-science. Assuming that the truth is somewhere in the middle, and that the author has drawn a mixture of true and untrue conclusions from his (few) sources, I give the book three stars for being interesting, offering a fresh perspective on home gardening, and at least making an effort to sound scientific. I guess there isn't any harm in accepting the author's word as gospel and making some soil fertilization changes, but it's probably worth confirming some of this stuff w/ local horticulture departments and soil science graduates."}, {"userName": "Simone", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/4922077-simone", "userReview": "Eccentric and repetitive but he makes some very important points. It's very in depth and I would recommend this to more experienced gardeners. Newbies would get scared off!"}, {"userName": "Ben", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/11070117-ben", "userReview": "The Intelligent Gardener lays out the practical science for growing the best garden possible. Solomon goes beyond simply giving practical, common sense advice and looks to the science behind plant growth to give the whys and wherefores along with the hows. He has made be a believer in the soil test and, mea culpa, I will get one before next Spring. Though he can be preachy and at times acerbic, Solomon writes a good gardening book. Thankfully his tone has mellowed over the past decade. While I agree with much of Solomon's science and practical advice, I strongly disagree with his insistence that almost all health problems are caused by poor nutrition. While there is truth to the fact that nutrition is a big part of health, saying that a host of ailments can be cured by more nutritious food verges on magical thinking. Second, Solomon completely discounts \"Big Ag\" agricultural science, often to his detriment. Nevertheless, I recommend The Intelligent Gardener to anyone who grows food, albeit with a grain of salt or a pinch of ag lime."}, {"userName": "Mitch Allen", "userReviewDate": "Dec 21, 2013", "userURL": "http://www.goodreads.com/user/show/18861631-mitch-allen", "userReview": "Steve Solomon is a master. His clear, unvarnished explanations will help anyone succeed with their vegetable garden, particularly in the Northwest, and his latest book takes on the controversial topic of nutrient density. For some time the food industry has focused on yield and shelf life while consumers are concerned about food safety, and we've sacrificed the nutrition in our food to the detriment of our health. I've read everything that I can find on this topic and this is by far the best, most useful guide to the home gardener interested in enriching the nutrition in their vegetables and fruit."}, {"userName": "Leah Walker", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/15565639-leah-walker", "userReview": "A fascinating analysis of soil remineralization to produce nutrient dense food. Solomon presents arguments that counter the current trends in organic gardening. His tone is often derisive of the reader and modern culture, but I have started using his basic principles combined with the \"back to eden\" techniques. I am excited to see the results. This is not a fast read and at times a degree in chemistry would be helpful."}, {"userName": "Karen Mahtin", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/2850818-karen-mahtin", "userReview": "I couldn't take the book seriously because 1. Solomon and the coauthor spent 6 months studying soil science before writing the book, and 2. he said that grazing does not sequester carbon (net). The latter has been proven incorrect.I have only taken one soil and plant nutrition class, so I don't feel qualified to talk about the main premise of the book, which as to do with the need for more Calcium (wrt Magnesium, iirc) _available_ in the soil."}, {"userName": "Sim Hanscamp", "userReviewDate": "May 30, 2015", "userURL": "http://www.goodreads.com/user/show/21604651-sim-hanscamp", "userReview": "If you think plants are about more than NPK. This is for you. Best gardening book that is 'intelligent' that i know. Probably gotta be into the science of making compost and a bit more serious than your average (1-2season gardener hobby idealist). Seriously important if you're an avid grower to read."}, {"userName": "Brad Belschner", "userReviewDate": "Apr 08, 2014", "userURL": "http://www.goodreads.com/user/show/2875060-brad-belschner", "userReview": "Excellent book, mostly on soil mineral balancing. Good for increasing yields, decreasing problems with pests and diseases, and above all increasing the nutrient density of the resulting food. Written from a gardener's perspective, for beginners who've never done soil testing before. Should be very helpful for its intended audience."}, {"userName": "Michel Vaillancourt", "userReviewDate": "May 16, 2014", "userURL": "http://www.goodreads.com/user/show/6963906-michel-vaillancourt", "userReview": "Ultimately worth the effort and money. Lots of great information, even if at times some of the anecdotal or personal philosophy is a bit much. As circumstance permits I will be putting the information here to use in our own garden. That will be the real test of what this book is really worth"}, {"userName": "Betsy", "userReviewDate": "Jan 12, 2013", "userURL": "http://www.goodreads.com/user/show/34733-betsy", "userReview": "How to bring your soil to its maximum potential for growing nutrient dense food. Depends heavily on a knowledge of chemistry so the book is slow reading but otherwise good advice. Some of it is counter-intuitive, like additions of compost and manure should be limited."}, {"userName": "Steve Richards", "userReviewDate": "Jul 09, 2016", "userURL": "http://www.goodreads.com/user/show/5571511-steve-richards", "userReview": "Makes a good case for the importance of good mineral balance in soils"}, {"userName": "Charlie Kester", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/17555834-charlie-kester", "userReview": "After reading this book, I will definitely be doing a soil test before I plant my garden next spring."}, {"userName": "Peri", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/25901080-peri", "userReview": "Very helpful to have read this book before I buy some land!"}, {"userName": "Virginia", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/9365871-virginia", "userReview": "One of the best non-fiction attempts I've treated myself in a while. Great information and steps to create a successful environment."}, {"userName": "Megan", "userReviewDate": "Nov 06, 2013", "userURL": "http://www.goodreads.com/user/show/1524110-megan", "userReview": "I am trying some soil amendment experiments in my garden this season after reading this book. He has a persuasive argument for trying to grow nutrient dense food."}, {"userName": "Anna", "userReviewDate": "May 26, 2014", "userURL": "http://www.goodreads.com/user/show/3852772-anna", "userReview": "I need to get back into the Intro to Chemistry mindset in order for this to sink in."}], "description": "Vegetables, fruits, and grains are a major source of vital nutrients, but centuries of intensive agriculture have depleted our soils to historic lows. As a result, the broccoli you consume today may have less than half of the vitamins and minerals that the equivalent serving would have contained a hundred years ago. This is a matter for serious concern, since poor nutrition has been linked to myriad health problems including cancer, heart disease, obesity, high blood pressure, and diabetes. For optimum health we must increase the nutrient density of our foods to the levels enjoyed by previous generations.To grow produce of the highest nutritional quality the essential minerals lacking in our soil must be replaced, but this re-mineralization calls for far more attention to detail than the simple addition of composted manure or NPK fertilizers. The Intelligent Gardener demystifies the process while simultaneously debunking much of the false and misleading information perpetuated by both the conventional and organic agricultural movements. In doing so, it conclusively establishes the link between healthy soil, healthy food, and healthy people.This practical step-by-step guide and the accompanying customizable web-based spreadsheets go beyond organic and are essential tools for any serious gardener who cares about the quality of the produce they grow.Steve Solomon is the author of several landmark gardening books including Gardening When it Counts and Growing Vegetables West of the Cascades. The founder of the Territorial Seed Company, he has been growing most of his family's food for over thirty-five years.", "title": "The Intelligent Gardener: Growing Nutrient Dense Food", "url": "http://www.goodreads.com/book/show/13591953-the-intelligent-gardener", "average": 4.14, "cover": "https://images.gr-assets.com/books/1344908376l/13591953.jpg", "reviews": 24, "authors": [{"url": "https://www.goodreads.com/author/show/107107.Steve_Solomon", "name": "Steve Solomon"}], "type": ["Gardening", "Food and Drink", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/13591953-the-intelligent-gardener", "http://www.goodreads.com/book/show/17972478-the-intelligent-gardener", "http://www.goodreads.com/book/show/183595.Gardening_When_It_Counts", "http://www.goodreads.com/book/show/192570.Growing_Vegetables_West_of_the_Cascades", "http://www.goodreads.com/book/show/11226515-organic-gardener-s-composting", "http://www.goodreads.com/book/show/8717018-gardening-without-irrigation", "http://www.goodreads.com/book/show/969681.Water_Wise_Vegetables", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}