{"ratings": 17757, "userreviews": [{"userName": "Tom Callaway", "userReviewDate": "Oct 16, 2011", "userURL": "http://www.goodreads.com/user/show/6022869-tom-callaway", "userReview": "This was my first Brad Meltzer book, and it started out well, but as time went on, a few things became painfully obvious:1. \"No one is who they appear to be at first.\" And I mean, no one. Not a single named character escapes this cliche.2. Towards the second half of the book, we get hit with Dan-Brown mini chapters, intended to add suspense, but only achieve a sense of talking to the reader as if he/she is 5 years old.3. The plot gets more and more and more convoluted...I halfway expected space aliens or mole people to emerge as the masterminds. Then again, when the plot collapses on itself in a rushed made-for-tv movie-like dramatic moment (in a puddle, in a cave) we're repeatedly reminded by the author that he has left plot threads dangling, unresolved...4. ... because he's already working on a sequel! Did you notice that I introduced these unresolved plot threads during the final 75 pages? Then pointed them out in mini-chapters?Meltzer seems like a smart guy, well versed in historical and military lore, but this book feels like his publisher requested a \"Dan Brown series of novels\"."}, {"userName": "Mike", "userReviewDate": "Feb 07, 2013", "userURL": "http://www.goodreads.com/user/show/1370632-mike", "userReview": "I love books with the whole historical conspiracy thing and I like Brad Meltzer, but this one was a miss. Since it's a Brad Meltzer book, I expect a certain amount of sad sackness to the protagonist, but this one was too much to take. And there were too many moments where everything stopped for exposition from people who would not normally do such a thing, in situations that no one would normally do it. And some situations, I just didn't buy. If you've never read Meltzer's books, do yourself a favor and read The Zero Game instead."}, {"userName": "Daniel Audet", "userReviewDate": "May 02, 2011", "userURL": "http://www.goodreads.com/user/show/4411850-daniel-audet", "userReview": "If you're not a Brad Meltzer fan yet, you will be after you read this book. Released earlier this year to rave reviews, it looks like we have the beginning episode in a series featuring our reluctant, mildly dorky, intellectual but - inexperienced in espionage - hero - Beecher. Meltzer's attention to detail and his well known expertise in American History play in beautifully here as the plot deepens, thickens and splinters into several directions. Secret groups bent on preserving the presidency and national security at ANY cost, people with their own agendas, dirty deeds done dirt cheap that end up costing a nation it's security and maybe even a President his office. Beecher intends to do the right thing - even if it costs him his life. Ya gotta love this guy, a very easy HERO to relate to, though I wouldn't call him that to his face. The girl? If you ask me I wouldn't trust her as far as I could throw her(and I'd like to - literally...)but our man cares for her....so....let him find out for himself....I highly recommend this book and I'm looking forward to more from Brad in the future. I'll be also taking a read through his backlist. Many of you out there in readerland know Brad's work well, I just read my first one but it will not be my last! You can also find Brad on Twitter.Just want to add this too: I'm both a writer and a huge fan of thriller fiction, so for me this book was a great read. Many of us on our way up look to other authors for all the elements of art and craft and Brad certainly has them mastered._____________________________________________________________________________________________I started reading Brad Meltzer's \"The Inner Circle\" over the weekend, this being my 1st Meltzer book. Meltzer is a writer whose style and intelligence level, and love of history and micro managed detail are so intertwined, like Steve Berry's, you KNOW you're in for a good ride and that's exactly what Brad delivers here. The story; An insecure archivist at a national book and priceless collection vault in DC stumbles onto a secret document while prepping a secret meeting room for the prez of the U.S. There's a torn book once owned by George Washington, a girl from our hero's past involved and a wise-ass co-worker also in the mix. Meltzer skillfully paints the portrait of a thriller from word one, page one, switches pov's like the pro that he is and uses dialogue so well to fill us in on what we're doing and where we're going. Good stuff so far, I will keep you posted."}, {"userName": "Jay Connor", "userReviewDate": "Apr 17, 2011", "userURL": "http://www.goodreads.com/user/show/2616572-jay-connor", "userReview": "I had lost faith in Brad Meltzer. His stellar explosion onto the political thriller scene in the late '90s and early '00s was very welcome. Grisham had moved on to \"Italy,\" Baldacci had begun a storytelling \"plausible-deniability\" period with his Camel Club series, and the rest of the landscape was trying to create plot lines around the new national dread - terrorism. Meltzer came on the scene with three great reads having different branches of government taking center stage: \"First Counsel\" (White House); \"The Tenth Justice\" (Supreme Court); and \"The Zero Game\" (Congress). Then came the \"Books.\" \"The Book of Fate\" and \"The Book of Lies\" rivaled each other in having their reader ask the worse possible question: do I really want to finish? He had clearly run out of interesting branches of government!Now comes \"Inner Circle.\" I almost passed. But Meltzer has found a new \"branch\" of government -- the National Archives! His lead - Beecher - and his mentor, Tot, make archivists cool. Well ... interesting. Though \"Inner Circle\" isn't up to the caliber of his first three, despite some really good historical underpinnings, it is a sign of recovery from Meltzer's most recent subpar performances. Whatever you do, do NOT expect \"Inner Circle\" to give you the complete plausibility which comes with truly great thrillers. But be happy for a good writer struggling to get back on form."}, {"userName": "Jennifer", "userReviewDate": "Jan 03, 2011", "userURL": "http://www.goodreads.com/user/show/2850786-jennifer", "userReview": "The Inner Circle is a smart political adventure full of intriguing mystery. The novel starts with a bang and continues at a thrilling pace until the very last word. Brad Meltzer takes political history and turns it on its ear. Creating a massive presidential conspiracy theory that surpasses even the wildest of imaginations, Meltzer convincingly leads the reader on a joyride through the darkest of presidential secrets.Beecher White is a compelling lead. An average guy with job steeped in history finds himself caught in a fight for his life. Racing to learn the truth before his time runs out, Beecher loses his naivety and learns that the advice \"trust no one\" is harder than it may seem. The Inner Circle could easily be compared to The Da Vinci Code. The historical attributes and adventure feel is the same. The Inner Circle replaces religion with politics and adds a more intellectual feel though.The Inner Circle is a thoroughly modern novel, though it leans heavily on events in the past. It's a wonderful mix of old and new with a mystery that'll spin you in circles. I was blown away by this novel. Reading The Inner Circle is, by far, the best adventure I've been on in quite a while."}, {"userName": "Dawn", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/1936922-dawn", "userReview": "Everyone knows I love State of the Union night. Reading all the pre-event hype left me craving a mid-winter escape with a political thriller, a fictional president and a zingy caper. The kids at Huffington Post made it seem hip to avoid O: A Presidential Novel, so I went with Brad Meltzer's The Inner Circle. That's how the conspiracy among NPR, Comedy Central, and yes--the History Channel--was revealed to me. They worked in covertly in unison to make me believe that this was an excellently crafted story with a well-constructed mystery featuring novel historical highlights. It is not. It contains the blandest protagonist in fiction, dialogue presented exclusively in the form of questions, and ridiculously basic plot failures. In Brad Meltzer's world, a character who was a 20-year old man when he became involved in a fight 26 years ago is described in the present as \"sixty or so.\" And so on.This book was a complete disappointment. If you want to know how high up this thing goes, start with Steve Innskeep and follow the money."}, {"userName": "Eric_W", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/1711431-eric-w", "userReview": "This book starts off with an incredibly implausible scene. Beecher, an archivist, is helping an old the friend in the archives try to locate some information about her long-lost father (who turns out to be in an asylum for the criminally insane after attempting to assassinate the president.) He is showing her a SCIF room, very private rooms where the president and other special dignitaries can view especially important and secret documents without being spied upon (why would they have surveillance videos in the room then? Anyway, Beecher spills coffee and knocks over a chair revealing a hidden document which for some bizarre reason (the room might be being used as a blind drop site) Beecher and the security guard friend feel they must take and investigate. The guard squirrels away a copy of the security video to hide that they were in the room and then he is murder. Inexplicably, Beecher becomes immediately paranoid assuming everyone else knows something is is out to get him. My crap detector was into overdrive by this point.The premise is not a bad one, and I love books that integrate historical facts to build alternate conspiracy theory type of story. The Culper Ring was a group of spies working for George Washington. This group actually existed, but Meltzer takes it one further, building his plot around the continuation of the ring as a conspiracy to well, you know, take over the world. Supposedly they communicated by using special invisible inks and sending messages on pages in books in the Library of Congress and the National Archives. Clementine (Clemmi for short if you can swallow it,) is an old friend of Beecher (his fiance had recently died, of course) and, we learn, the unknown daughter of Nico who had assassinated the president’s wife, missing the president, and is now incarcerated in a mental institution. The implausibilities continue to build. That’s enough. A big disappointment.Smacks of a badly done DeVinci Code. I received this book free as an advance reader copy."}, {"userName": "Emilie Hendryx", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/6086309-emilie-hendryx", "userReview": "I picked up this book in the search for finding additional writing like David Baldacci, one of my favorite authors, and was pleasantly surprised with this book and author (who was new to me). I enjoyed the context, having lived in DC previously, and liked reliving some of the highlights of that city. I also enjoyed the conspiracy aspect of this series. It wasn't as fast paced as I'm used to with Baldacci and I hoped for more action from the main character and a little less…sappiness, but that in no way made this a bad read. I'll definitely be continuing on in the series and look forward to book 2.---This was an audiobook read for me"}, {"userName": "Michael", "userReviewDate": "Feb 26, 2011", "userURL": "http://www.goodreads.com/user/show/1177534-michael", "userReview": "[And the story ends at a point that we could possibly have a follow-up book or series of stories. At this point, I'm not sure I enjoyed this one enough to want to continue reading more. (hide spoiler)]"}, {"userName": "Rebekah Scott", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/7675307-rebekah-scott", "userReview": "In 1778, a man by the name of Benjamin Tallmadge organized a spy network in New York City, right in the middle of the British troops. Tallmadge was acting under the order of George Washington himself, and the purpose of this group was to pass information about the British to General Washington. This much is generally known, but what if that group of spies didn’t disband after the Revolutionary War? What if the group known as the Culper Ring continued to work behind the scenes protecting the presidency for over 200 years? “The Inner Circle” by Brad Meltzer delves into this clandestine group and reveals conspiracy, betrayal, blackmail and murder.Beecher White, a young archivist working for the National Archives in Washington D.C., has spent his professional life digging up stories and finding answers for other people, but when his childhood crush Clementine Kaye contacts him with a request for help in tracking down the identity of her father, he’s thrilled that he finally gets to play a small role in one of the stories.Hoping to impress Clementine, Beecher takes her into an off limits area, a seemingly insignificant act that has major consequences. Soon, a security officer is dead, and Beecher and Clementine are both being scrutinized by people at the highest levels.Determined to find who was behind the death and why everyone from the head of security of the National Archives to the President of the United States is interested in him, Beecher digs deeper into the mystery surrounding a man who has been visiting the Archives for over 150 years and uncovers more questions than answers. Without knowing who he can trust or where he can turn for help, he has to unlock the secrets that surround the mysterious Culper Ring.“The Inner Circle” is a fast paced, political thriller with a plot that twists and turns into a maze of conspiracy, deception, and cover ups. At times, the plot gets a little hard to follow, and the book is clearly setting itself up as the beginning of a series, but “The Inner Circle” is still a page turner that will keep you up until you’ve reached the final chapter."}, {"userName": "Titus Burley", "userReviewDate": "May 18, 2013", "userURL": "http://www.goodreads.com/user/show/4751657-titus-burley", "userReview": "I approach any book I read with an innocent until proven guilty attitude; I plunge into a book expecting and hoping to like it. Though I had been intrigued by the premises of Meltzer's books, it wasn't until I read a really touching and well-crafted blog dedicated to his late father that I felt compelled to read one of his novels. Meltzer's premises often tap into little known facts or \"secrets\" in American history. Think \"National Treasure\" type adventure novels. So here was the perfect set-up - a book I wanted to like, by an author whose essay I had loved, about a subject (American history) of which I am an enthusiast. What could possibly go wrong? Well, the plot actually. A roller coaster, convoluted, completely unbelievable plot. In retrospect I learned that Meltzer also writes comic books. Ah-ha. That explains the comic book aspect of this novel. I'm not sure what it is about these promising American history meet contemporary action novels that have been so disappointing to me of late. There are three that I have read in the past year and considered duds. The terrain is fertile, but the authors allow the harvest to spoil."}, {"userName": "Jeremy", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/27127643-jeremy", "userReview": "this book for sure is a page turner. I started it and could not walk away. Brad definitely can tell a story. Beecher is an incredible character. If you read this book I hope you have a map because you are sure to get lost in it."}, {"userName": "R.P. Morel", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/67501396-r-p-morel", "userReview": "Great book with a good twist on the average run-of-the-mill thriller."}, {"userName": "Mike", "userReviewDate": "Jun 01, 2011", "userURL": "http://www.goodreads.com/user/show/3358904-mike", "userReview": "The worst Brad Meltzer book in his published career. Then again, because I usually enjoy this author, maybe my expectations were too high. The first BM i read was THE MILLIONAIRES whenever that one was new. I couldnt put it down. it was so good that i read THE FIRST COUNSEL shortly after. I never read the same author back-to-back so that was a big deal. DEAD EVEN was a lot of fun! THE INNER CIRCLE tasted the same as THE BOOK OF LIES & THE BOOK OF FATE. It almost seems as if Meltzer has gotten too comfortable with the insecure childless single 30yr old man caught between a rock and a historical conspiracy hardplace. I swear it was much like reading the same exact book after someone went and shook some of the words around.OH and what a terrible ending. No spoilers but expect a lot of finger pointing and \"Beacher, listen to me! ...\" on replay.Not my favorite. Will not be re-reading or recommending. I'll wait for the next one."}, {"userName": "Kate S", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/3841473-kate-s", "userReview": "I enjoyed this thriller set in and around the DC area. I found myself very familiar with many of the places mentioned throughout the story. I had a problem with the timeline. Ten years ago there was an assassination attempt on the President of the United States and around that time the First Lady was killed. This First Family was not the Clintons, either of the Bush families, or the Obamas, but all of those First Families are discussed and apparently held their office as history reports it. Now, there is a new President, but 14 years ago email was still a little known thing. I had trouble with when this story was taking place and it was to a point of distraction from the story. Otherwise, it was a fast-paced, cliff hanger thriller. I felt the ending was a little weak, but it was set up nicely for a sequel."}, {"userName": "David Monroe", "userReviewDate": "May 30, 2011", "userURL": "http://www.goodreads.com/user/show/1223383-david-monroe", "userReview": "I saw this at the library last week. I thought it would be a good bathroom book. We all have those, right? OMG! I ended up literally throwing this into the wall. I've never done that. The protagonist is a young, supposidly bright archivist for the US National Archives. This character suffers from so many annoying Tropes. Let's see: Horrible Judge of Character; Ignore all evidence; No knowledge of his primary job; Selective obliviousness; Suffers from 2 unrequited relationships; Carries the Idiot Ball and basically becomes an example of Too Dumb to Live. Skip this and just Google \"The Culper Ring.\""}, {"userName": "Ken Hanes", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/12180890-ken-hanes", "userReview": "This book was the worst book I've read (listened to actually) in years. I've read that Meltzer's earlier work was better, but I'm going to have a tough time going back to anything by the author after this trite.The main character is an idiot. A boring, unsympathetic, whiny idiot. The vast majority of the side characters aren't any better. There was a somewhat interesting mystery at the start, but after the 971st ridiculous plot twist, it really started to lose me. There was some interesting historical information I guess? So, one positive.I wasn't really hoping for much. Generic fun would have been more than adequate, but this isn't even close to that."}, {"userName": "Lauren", "userReviewDate": "Aug 28, 2011", "userURL": "http://www.goodreads.com/user/show/4025444-lauren", "userReview": "Grandma, I'm so sorry I sent this to you last Christmas. I know it was signed by the author, but that's no excuse for such a crappy present. I understand if you viewed it as an insult. Again, my apologies. With love and regret, Lauren"}, {"userName": "Tim", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/17042835-tim", "userReview": "This story is longer than necessary. There are interesting conspiracy plots , but the main characters are not strong and become distracting. 6 of 10 stars"}, {"userName": "Matt", "userReviewDate": "Jul 30, 2011", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "Meltzer puts out another great novel! He brings conspiracy to the forefront and makes you wonder what is REALLY going on inside US Politics."}, {"userName": "Debbie", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/67026060-debbie", "userReview": "This is the first book that I've read by Brad Meltzer, and I really enjoyed it. Having never read another of his books, I can't make any kind of comparison.Washington D. C. is the setting for this political thriller with flashbacks of earlier memories. A story filled with so many twists and turns including betrayal, conspiracy, and murder. We learn about the Culper Ring & the Plumbers. Which to trust? Meltzer also provides lots of historical details including facts about George Washington."}, {"userName": "Shelley", "userReviewDate": "Aug 28, 2010", "userURL": "http://www.goodreads.com/user/show/3081722-shelley", "userReview": "*Plot/Summary* Beecher White works for the National Archives not only answering researchers from around the country's questions, but also giving them tours of the Archives as well. One day out of the blue, a long lost childhood interest, Clementine Kaye, emails him after reading him on Facebook. Beecher finds himself caught up in intrigue and mysteries surrounding George Washington's Culper Ring. Clementine shows up in trying to find out who her real father is.Clementines character was not a very nice when you get right down to it. She's calculating, somewhat cold, and a blackmailer. She uses Beecher to get exactly what she wants, and ends up killing one of his friends in the process. She claims it was an accident, but I say it was intentional to throw him off knowing her true intentions. Another fact that I found highly implausible is that the Archives would really let anyone walk around their files when a sitting US President is set to visit? Also, putting Beecher in the middle of her blackmail scheme was just plain cold blooded of her. If she really is sick with cancer, and the book ended without tying up that loose end, then she could have been more forthcoming with her reasonings.Beecher's finding Entick's Spelling Dictionary, which supposingly belonged to Washington, was a little bit corny. It's supposed to be a book that has invisible ink so that the British can't read what was said in it's contents. Later we find out that other books, including Don Quixote, have been used in order to send out secret messages between the Culphers, and the Plumbers.I enjoy books that delve into actual US history while trying to tell a story. I find George Washington to be one of the most interesting presidents this country has ever had.**True Fact** The Culper Ring was a spy ring organized by Major Benjamin Tallmadge under the orders of General George Washington in the summer of 1778. Their name was derived from the alias' taken by two of it's main members, Samuel Culper, Sr. and Samuel Culper, Jr. The Ring's task was to send messages to General George Washington about the activities of the British in New York. They operated mostly in New York, Long Island and Connecticut. The Ring conducted covert operations until after the end of the American Revolutionary War. Though its heyday was between 1778 and 1781, some believe it may still be in existence today. They were the pre-cursor of the CIA and OSS. It is said this was born into existence because Washington himself was extremely mad at having his messages interrupted by the British. **True Fact** The White House Plumbers, sometimes simply called the Plumbers, were a covert White House Special Investigations Unit established July 24, 1971 during the presidency of Richard Nixon. Its task was to stop the leaking of classified information to the news media. Its members branched into illegal activities working for the Committee to Re-elect the President, including the Watergate break-ins and the ensuing Watergate scandal.Meltzer dives into this subject as well. They and the Culpher Ring in this book, are often at odds over some of the Presidents policies. The Plumbers in this book, go back 26 years.Other aspects: The one thing I did like about this book is, you couldn't really tell who was a Plumber and who belonged to the Culpher Ring, until the very end. Naturally, my dislike with this book is that it left too many unanswered questions. Does that mean he intends to do a follow-up book? If so, then here are my questions.1. Is Beechers father really alive, or was Clementine so set on blackmailing the President that it didn't matter who she used, including someone from her past who has feelings for her?2. What part does Nico really play in this storyline? OK, so, supposingly he tried to assassinate the President, and did kill the First Lady to who he talks to. Creepy! He didn't realize that Clementine was his own daughter even after spending nearly 4 months with him? He keeps saying that Beecher and he will play together again very soon. Really?3. Who are the actual members of the Culper Ring besides Tot and Venkat Khazei? We know that Beecher is going to meet and join them when the book ends. Last thoughts: I really found myself at odds with other readers on this book. I couldn't bring myself to raising this any higher than 3 stars. It was an OKAY read, but I also came to a point several times during my reading it, that I wanted to stop. The plot itself was interesting, but the characters themselves were somewhat flat. I would love to be able to spend a few days sifting through the National Archives in DC. As you get older, you start to refuse to listen to any politicians garbage they throw out. You want to see the truth, and nothing but the truth. This President comes across like any other. Cold, and calculating, even sadistic in that he watching his own sister try to take her life."}, {"userName": "Melenia", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/15777205-melenia", "userReview": "DNF"}, {"userName": "Lauri", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/1658353-lauri", "userReview": "This one occasionally defies credibility, but if you enjoy the “National Treasure” movies this book is for you!"}, {"userName": "Giovanni Gelati", "userReviewDate": "Dec 17, 2010", "userURL": "http://www.goodreads.com/user/show/3474899-giovanni-gelati", "userReview": "Hello again and welcome to 2011. I really wanted to start off with a hot one and The Inner Circle by Brad Meltzer (to be rleased Jan.11th) is just that. Are you a conspiracy reader, someone that loves history, enjoy a good, fast paced novel, then check this one out. Here is the synopsis: “So says Benjamin January, a young archivist who spends his days working with the most important documents of the U.S. government. When Clementine Kaye, his first childhood crush, shows up at the Archives asking for his help tracking down her long-lost father, Benjy tries to impress her by showing her the secret vault where the President of the United States privately reviews classified documents. It is also where Benjy and Clementine accidentally happen upon a priceless artifact-a 200-year-old dictionary that once belonged to George Washington-hidden inside a desk chair. Eager to discover why the President is hiding this important national treasure, the two soon find themselves entangled in a web of deception, conspiracy, and murder that will reveal the most well kept secret of the U.S. Presidency”Gotta love a geek that is trying to impress the girl of his dreams! What relationship between a man and a woman doesn’t involve deception, conspiracy and murder I ask you? Okay, enough fun already my wife is going to give me a shot in the arm for that one. Brad Meltzer has a high speed, turbo ride waiting for you in The Inner Circle. Did Washington really hide a dictionary? Could and should Benjy really be able to show a girl named after a fruit into a highly classified room like this? Are there some more questions I would like answered? Sure, but who cares. I was thoroughly entertained. This is fiction after all and once you get past a few things the novel rocks and rolls to the very end. I see no downside to entering The Inner Circle, check out and see what else George Washington has been hiding all these years.What are you reading today? Check us out and become our friend on Shelfari & Linkedin. Go to Goodreads and become our friend there and suggest books for us to read and post on. You can also follow us on Twitter, Wattpad. Did you know you can shop directly on Amazon by clicking the Amazon Banner on our blog? Thanks for stopping by today; We will see you tomorrow. Have a great day. http://www.gelatisscoop.blogspot.com"}, {"userName": "Kristen", "userReviewDate": "Aug 04, 2012", "userURL": "http://www.goodreads.com/user/show/11382577-kristen", "userReview": "This was a very good political suspense thriller. Good characters, well thought-out plot and plenty of nail-biting suspense.Beecher White is an ordinary guy. He works in the National Archives in Washington D.C. and has a fairly normal daily life.Then, one day, the girl he had a crush on in high school shows up and asks for Beecher's help finding her father. Wanting to show off the cool place he works in and impress Clementine, Beecher takes her on a tour of the Archives, specifically the \"skiffs\" secure rooms where the President of the United States comes to read documents from the archives.While Beecher is showing Clementine around, along comes Orlando, one of the security people at the archives and a friend of Beechers. Orlando lets them all into the skiff the President will be sitting in any minute for his regular visit to the archives. Unfortunately, while they are all in there a cup of coffee gets spilled and the chair is knocked over at which point a very old looking book falls out of a secret compartment in the chair. On closer examination, it appears to be a Dictionary belonging to George Washington. What's it doing in the chair? Is it for the President? Because it has coffee on it from the spill they take the book with them and high-tail it out of the room just before the President arrives.Next thing you know, Orlando is dead, and Beecher and Clementine are caught up in a deadly game of cat and mouse as they try to figure out who the book belongs to, what it means, and most importantly who is after it and what lengths they'll go to to get it back, including murder!This is a quintessential suspense thriller. It has multiple groups of people all doing things that could be good or could be evil. There's political wrangling, there are powerful people doing questionable things, there are dirty secrets from the past, and in the middle of it all is a nerdy guy from the Archives.Fast-paced, twisty turney, with really interesting characters and a great story. Recommended!"}, {"userName": "Jay", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/8046340-jay", "userReview": "The Inner Circle is a very good idea that unfortunately falls flat. I loved the premise of a 200-year old spy group tasked with protecting the office of the Presidency. At points, the book meets my expectations while at other points the book seems to drag. Normally this would be a three-star book. But the ending is just so bad.Meltzer created quite an interesting plot. A couple of seemingly normal folks stumble upon a conspiracy concerning a decades-old crime by the future President and an attempt to blackmail him. Two competing \"circles\" fight to protect the secret and main character Beecher. Where the plot goes sour is the pacing. The entire story (except for a few flashbacks and the final couple of chapters) take place during a span of a few days. But it feels like much more than that. It feels seemingly impossible for so many things to happen at so many places in such a short period of time. The character of Beecher is probably my favorite. I cheer for him and at points even feel sympathy for him when I read all the terrible things that happen to him. Poor guy had a pretty bad week. The rest of the characters are a bit much though. It seems like Metlzer is trying a bit too hard to make the readers guess. Nobody is who they seem. Beecher is the only character who doesn't have the switcheroo pulled on him at least once.*********Spoilers Ahead******************I still would have really liked this book if not for the ending. It is horrendous. So many questions go unanswered. Is the President's secret ever exposed? What would happen if it does? What happens to Clementine? What was she lying about? What was true? Who is Beecher's father? At one point, the President purposely stressed the word \"son\" when speaking to Beecher. What was that all about? Who else was in the Culper Ring? I have no problem with an unanswered question here or there. But we are left hanging on what happens to the second most important character and the main aspect of the plot is just left hanging. That is simply unacceptable."}, {"userName": "Philip", "userReviewDate": "Jan 11, 2011", "userURL": "http://www.goodreads.com/user/show/71601-philip", "userReview": "[ I've always wanted to do that. That has nothing to do with the book at all, but only the people who read the book - or who could care less about spoilers will ever find that out. HAHAHAHA! It's like I have my own little Culper Ring of people who have read the book. Though, I guess my code is pointless. Sorry for wasting your time. (hide spoiler)]"}, {"userName": "M.E. Kinkade", "userReviewDate": "May 28, 2013", "userURL": "http://www.goodreads.com/user/show/3771564-m-e-kinkade", "userReview": "I listened to this book as an audiobook, and that may have affected my perception of it. I really wanted to like it--I loved the overarching mystery, and Meltzer clearly knows his stuff when it comes to little-known White House/Washington, D.C., history. But for every point in which he awed me with delicately folded in historical detail, there were two points where he had characters speaking or acting clunkily.I mean, I know there needs to be an explanatory character in a mystery, just in case the audience really doesn't get it, but characters who are otherwise repeatedly heralded as really smart cookies end up acting like total morons, with no apparent rational behind it. Additionally--and maybe this was just because of the audiobook that it stuck out more--but Meltzer uses the phrase \"eyes locked\" a gazillion times (I started counting, but the number got too big for me). Build the drama with another phrase, please!As a writer, I found the unusual use of tense to tell the story very interesting: the main character speaks in present tense, while every other characters' perspective is told in past tense. It took awhile to get used to, but ultimately allowed the reader (listener) to bond a bit more with Beacher, the lead character, while allowing Meltzer to continue with a broader omniscient view.It was a great way to pass about 12 hours in a road trip, especially because I didn't mind dozing through the stupid or boring bits. I feel like I know a lot more about the National Archive, and I loved the idea of a quiet detail-oriented archivist finding himself in the midst of a dangerous political intrigue--it just didn't quite come together for me. I would recommend this book if you're looking for a light political mystery and are a huge history nerd, but I won't be giving the sequel my attention."}, {"userName": "Michael", "userReviewDate": "May 15, 2011", "userURL": "http://www.goodreads.com/user/show/2065514-michael", "userReview": "Beech (Beecher) White is employed at the National Archives and is visited by an old high school girlfriend, Clementine Kaye, who wants help in finding her father.After Clemmi's mother's death, Clemmi found a document with her father's name on it. By bringing the document to the National Archives, they are able to determine that her father is Nico Hadriam, who is in a psychiatric hospital after an attempt on the president's life, ten-years ago. At the Archives building, Beech wants to impress Clemmi and brings her to a secret vault where the president goes to do his reading and research. They spil something and while cleaning it up, find a document taped to the bottom of a chair. The document was apparently from George Washington.Shortly thereafter, something happens to a security guard and Beech is questioned about what went on in the reading room.Clemmi decides to visit the father she's never met. Beech follows her and learns that Nico knows about the book they found. He tells them that this was how Washington and later presidents communicated with the Culper Ring, a group of people that the president could trust and would give him honest information about political items.The story is convoluted and was difficult to follow. Not only is there one Culper Ring but there are two. In this ring the president's physician and barber are included. The story would appeal to fans of \"The Da Vinci Code.\"The characters are well developed and we learn about Beech and Clemmi from their high school days but I didn't find either of them particularly interesting. Neither did I feel the antagonists were villanous.I was only mildly entertained with this novel and would rate it 2 1/2 stars, rounding up to 3 for the attempt at a good puzzle. I've enjoyed this author in the past and am willing to give him another chance in a future novel."}], "description": "The best-kept secret of the U.S. Presidency is about to be revealed.\"There are stories no one knows. Hidden stories. I love those stories. And since I work in the National Archives, I find those stories for a living.\"Beecher White, a young archivist, spends his days working with the most important documents of the U.S. government. He has always been the keeper of other people's stories, never a part of the story himself . . . Until now.When Clementine Kaye, Beecher's first childhood crush, shows up at the National Archives asking for his help tracking down her long-lost father, Beecher tries to impress her by showing her the secret vault where the President of the United States privately reviews classified documents. After they accidentally happen upon a priceless artifact—a two-hundred-year-old dictionary that once belonged to George Washington—hidden underneath a desk chair, Beecher and Clementine find themselves suddenly entangled in a web of deception, conspiracy, and murder.Soon a man is dead and Beecher is on the run as he races to learn the truth behind this mysterious national treasure. His search will lead him to discover a coded and ingenious puzzle that conceals a disturbing secret from the founding of our nation. It is a secret, Beecher soon discovers, that some believe is worth killing for.", "title": "The Inner Circle\n      \n          (Culper Ring #1)", "url": "http://www.goodreads.com/book/show/7932146-the-inner-circle", "average": 3.77, "cover": "https://images.gr-assets.com/books/1442612340l/7932146.jpg", "reviews": 1500, "authors": [{"url": "https://www.goodreads.com/author/show/14610.Brad_Meltzer", "name": "Brad Meltzer"}], "type": ["Mystery", "Fiction", "Mystery", "Thriller", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/7932146-the-inner-circle", "http://www.goodreads.com/book/show/10786718-the-inner-circle", "http://www.goodreads.com/book/show/8487568-the-inner-circle", "http://www.goodreads.com/book/show/26085.Identity_Crisis", "http://www.goodreads.com/book/show/85321.The_Tenth_Justice", "http://www.goodreads.com/book/show/85320.The_Zero_Game", "http://www.goodreads.com/book/show/14889776-the-fifth-assassin", "http://www.goodreads.com/book/show/3202905-the-book-of-lies", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}