{"ratings": 3928, "userreviews": [{"userName": "Rachel Ramirez", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/43622386-rachel-ramirez", "userReview": "The story had an inventive premise and I appreciated that it was based off an Indian myth. My interest was really high when I started but as I got further into this book I realized this book just wasn't for me. At first I thought maybe I might have liked this story more had I been younger but I kept getting everyone confused and had to repetitively use the character glossary because the characters were numerous and just not memorable enough for me. It seems hard to imagine these issues being resolved had I'd been a younger reader. Overall it was disappointing read; maybe this is why most people don't choose books based solely off of covers that interest them. If the summary interests you and you want to learn a bit about Indian mythology give this book a shot but otherwise I wouldn't recommend."}, {"userName": "Mel Anie", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/62618407-mel-anie", "userReview": "Rating: 5   'There is another truth behind the truth...'  Great read for a break between two epic fantasy series :)  Short spoiler-free review It was a really good book recommended to me by my friend who knows how much I adore myths.  The Iron Ring  focuses on Hindi myths and tradition. Written for the middle grade it was still enjoyable for an adult. I wasn't bored at all.I really liked life wisdom hidden in passages of this book. Story and worldbuilding were also well created. I found myself anticipating what will happen next and how it all would end.Full of adventures, good and bad characters, risks, love, and friendship... this story really captured my attention."}, {"userName": "Tiffany", "userReviewDate": "Apr 15, 2011", "userURL": "http://www.goodreads.com/user/show/4146093-tiffany", "userReview": "This novel is based on the traditions and legends of India. The tale begins when Tamar, the young King of Sundari, is challenged by Jaya, a powerful ruler, to a friendly game of Aksha. In this gambling game, they wager life for life and Tamar loses. Jaya places an iron ring upon the young King's finger before vanishing.Tamar's courtiers try to convince him that he was having a dream, but the iron ring upon his finger troubles the young man. He sets out on a journey to the Kingdom of Mahapura, though he is unsure of its existence. Along the way, he faces many adventures, makes just as many friends, and has his courage, compassion, and character tested at every turn. This book does not make light of such serious topics as war, violence, and social class. Alexander writes beautifully and handles these sensitive subjects in a respectful manner. I enjoyed this book as a child and upon rereading it, find it just as captivating and poignant as it was more than fifteen years ago. It's definitely worth a read and I encourage anyone who enjoys fantasy and adventure to read this book."}, {"userName": "Marissa", "userReviewDate": "Feb 03, 2009", "userURL": "http://www.goodreads.com/user/show/876626-marissa", "userReview": "Years ago, during a children's lit course, I read that Prydain Chronicles. I found them fantastic. So looking in the library the other day I saw this one and decided to pick it up. It follows Tamar, a young king in long-ago India. The story follows Tamar as he begins a quest to maintain his honor, or his \"dharma\". Alexander is interested in Indian folk-tales and is influenced by them in his story. Tamar meets a number of people and animals who join him on his way. The story is quite archetypal (which I love). It had a lot of interesting tidbits about the Indian caste system and other interesting thigns. I found it quite interesting and it was enjoyable but I am not passionate about it.I don't think it is a book my kids will be hearing for a while. There are a myriad of characters that is a little hard to keep straight. It sounds as if it was written much longer ago than the 1997 publishing date (which is cool, just harder for my kids to follow). And some of the themes are ones I don't think my children would quite get yet."}, {"userName": "Keeley", "userReviewDate": "Jun 09, 2008", "userURL": "http://www.goodreads.com/user/show/925669-keeley", "userReview": "I love Lloyd Alexander anyway, so this opinion is biased. This book is highly entertaining and filled with page-turning excitement. I know the book is good when I am feeling the emotions that the characters are experiencing. My stomache was in knots all throughout this book. I love how he pays so much attention to the characters working out right and wrong for themselves. It really shows the process we all go through when trying to make righteous decisions that affect our lives. As this is a book for young adults I applaud his decision to show this process so that it can be a guide to the young generation on how to choose right and wrong.This is a love story, an action adventure, and a moral compass story. It is a quick and easy read but is worth the time."}, {"userName": "Terence", "userReviewDate": "Apr 17, 2010", "userURL": "http://www.goodreads.com/user/show/1019174-terence", "userReview": "This is a very accessible, fast-paced and enjoyable fable about a young man and his journey toward wisdom. Along the way he's helped by the usual cast of characters in myths of this sort: His true love, a mischievous sidekick, a beloved teacher, and others whose roles are to illustrate the best and worst qualities in human nature.Alexander's prose is lucid and unpretentious and perfect for the tween crowd. If you're a parent with a talent for voices, the varied dramatis personae easily lend themselves to a bravura performance before bedtime.I'm going to pass this along to my sister and her daughters, which should be recommendation enough."}, {"userName": "GiaHue", "userReviewDate": "Feb 07, 2012", "userURL": "http://www.goodreads.com/user/show/6764108-giahue", "userReview": "I seriously don't like this book. It just gets me bored when I read it. Not recommended for young readers."}, {"userName": "Julie", "userReviewDate": "May 27, 2011", "userURL": "http://www.goodreads.com/user/show/131002-julie", "userReview": "My review/memoir of my first reading of this book is posted at http://bookgargoyle.blogspot.com/2011...."}, {"userName": "Becky", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/32930845-becky", "userReview": "This was my first Lloyd Alexander book and it will not be the last. The combination of adventure, love, magic, and friendship is a great recipe for a fun page-turner, but add in the culture, mythology, and setting of India and you have the perfect story. Despite being somewhat predictable, Alexander's story of bravery, honor, and lessons learned teaches as much as it entertains. Honesty, reliability, loyalty, and wisdom are common themes throughout the book, as are consequences--both good and bad--for choices made. Each character has its own personality that shines throughout the book, and they all struggle with their own decisions, as each one made affects the entire gorup. Perhaps the only reason it was predictable for me was that I am not a YA and have read a few books in my day. :) A beautifully crafted and well-spun story, \"The Iron Ring\" is definitely one to read again, and would make a fun mini-series. From the first paragraph I knew I would love this book and it did not disappoint."}, {"userName": "Ruth Dahl", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/36924153-ruth-dahl", "userReview": "Didn't super care for it.The main character, Tamar, is one of those impulsive 'you looked at me wrong we must fight to the death!' characters, and I just wasn't feeling it.Well, I was feeling frustrated as he single-handedly halted the plot over, and over, and over.The ending was almost cool in its' reveal, but something was lacking.I think it's the sort of book younger middle schoolers would enjoy, however."}, {"userName": "Sree Raksha", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/77990206-sree-raksha", "userReview": "NiceBook"}, {"userName": "Nathan", "userReviewDate": "Aug 26, 2014", "userURL": "http://www.goodreads.com/user/show/11690644-nathan", "userReview": "I rarely remember how I got my books, especially those I have owned for a long time, but The Iron Ring is an exception. I had just finished completing the summer reading program with Barnes & Noble, and came in to get my free book. Unfortunately, the list of titles I could choose from was very slim, but the lady in charge of the young adult section told me to go ahead and choose any trade paperback I liked off the shelves. I grabbed this volume, and we had a lovely discussion about Lloyd Alexander (one of her favorites as well) as she helped me to check out.Previously I knew nothing about the book, but soon I found myself caught up in the magical and dangerous world of Tamar, Prince of Sundari. It became one of my favorite standalone Alexander novels and I felt the urge to read it again after I heard a gentleman from India speak about caste, especially as the last two books I read by the author were disappointments.The Iron Ring may have one of the best openings in the entire fantasy genre. Tamar is awakened in the middle of the night by the sound of elephants in the courtyard, and informed by his courtiers that a maharajah, King Jaya, has arrived demanding food and rest for he and his warriors. This arrogant monarch challenges Tamar to “a friendly game of ashka,” governed by the rules of chance. The wagers continue to increase until Tamar finds that he is lost, and his life is now Jaya’s to control. In semblance of this, the older warrior gives him an iron ring and commands him to journey north to his citadel of Mahapura. When Tamar wakens the next morning, he finds that no one remembers the maharajah’s visit but him; still, he holds it as a point of honor to keep his vow, and sets out on his journey north, accompanied by his beloved teacher Rajaswami. Along the way, they meet up with a varied and colorful cast of characters, including the mischievous king of the monkeys, a beautiful village maiden named Mirri, a cantankerous eagle, a jack of many trades who has been meditating in an anthill, and the deposed king of Ranapura, the lion-eyed Ashwara.Though I am an old fan, even I must admit that at times Alexander can be—how shall I put this?—a little goofy. This comes out a little in The Iron Ring, particularly during the first stage of the journey, when too many characters are being introduced too quickly, events seem to follow each other haphazardly, and awkward exposition abounds. Moreover, the romance between Tamar and Mirri blossoms within the course of a chapter, which seems rather sudden to me—although I suppose that by the time he emerges from the water a la Colin Firth and starts spouting love songs, there isn’t that much more to be done.Fortunately said goofiness fades away quickly; after its inception even the love story becomes interesting and complex. The story as a whole has wonderful moral weight, and Alexander certainly is not afraid to ask the difficult questions. How are we sure that what we experience is reality and not illusion? Should society determine how we act? Do codes of honor break down in difficult circumstances? And should you follow duty under all circumstances, even when it may be leading you to your death?I cannot remember where I read this, but I recall hearing the story described as “Tolkienesque.” Despite its Eastern setting and much simpler world-building, I’d have to agree: thematically and tonally, there are some striking similarities between this and the master’s work. I also picked up traces of C. S. Lewis’ The Chronicles of Narnia and Patricia McKillip’s Riddle-Master books, the latter especially in the book’s final revelation. I don’t think Alexander rivals any of the three aforementioned as a prose stylist, but he has shown himself to be a great storyteller, and The Iron Ring remains a book close to my heart."}, {"userName": "Brigid Keely", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/1376296-brigid-keely", "userReview": "\"The Iron Ring,\" by Lloyd Alexander, is a self-contained story (as opposed to series) rooted in Indian mythology and folklore. As with \"The Remarkable Journey of Prince Jen\" and The Prydain Chronicles, Alexander has done research into the mythology and folklore (in a time when that sort of research was harder to do), and the novel follows a very specific progression. It is, in a word, predictable... but not in a bad way. As readers of fairy tales, we know that when The Noble Hero frees a trapped talking animal or is kind to an elderly beggar that's going to pay off later in the story. The book's formulaic, but the characters are still given room to grow and change.In the book, Tamar (the king of Sundari) is coerced into a dice game. He keeps winning big, but tries to end the game after each turn. He's very aware, after all, that he's gambling with his kingdom's treasury and if he loses it his people will suffer. His mysterious and imperious opponent, however, appeals to his pride and he throws the dice one more time... and loses. His opponent claims his life and sets off a chain of events that involve a long journey of both body and soul as Tamar learns about himself and just how important honor, pride, and codes of conduct are. The story of a young man reaching adulthood via a journey both physical and spiritual, attracting a following of allies (including a hot, brilliant, skilled woman he totally wants to smooch) reminded me quite a bit of \"Prince Jen,\" although I haven't read that book in a while so might be remembering it wrong. But then, that sort of story is pretty timeless.I picked this book up at the library while looking for something to read to my kid. I was surprised when I found it because it's a Lloyd Alexander book I haven't read. I think I would have enjoyed it a lot more if I'd read it as a teen, because as an adult I have some reservations about it... namely, about a book portraying East Asian (Indian, specifically) culture/religion, but written by a white guy from the USA. I'm not really sure it's appropriate for a white writer to have Indian characters musing on the caste system and how it's all a bunch of garbage, for instance. Like, there's criticisms to be made of it, but maybe outsiders shouldn't be the ones making the criticisms? Other than that, I didn't see a lot of Orientalism going on, though, and there's lots of descriptions of dark skin, hair, and eyes as normal/attractive without exotifying stuff.Ten years ago, I'd have recommended this book solely because the market's pretty flooded with white people traipsing through Western European folkloric worlds on adventure, and fantasy novels overtly using other cultures were a rarity. Now, though, there's a lot more diversity in both subject and authors, and it's easier to find books about Indian culture/mythology/folklore written by people from India. \"The Iron Ring\" is well written and entertaining, but there's newer, fresher books written from a personal experience."}, {"userName": "Mara", "userReviewDate": "Nov 05, 2011", "userURL": "http://www.goodreads.com/user/show/6879652-mara", "userReview": "While I certainly enjoyed The Iron Ring, it was not my favorite Lloyd Alexander book. While having a clearly Indian feel, this story still felt very eclectic with its numerous characters whose names start to blend into one, and who appear very suddenly, tag along for a little while, then disappear just as suddenly, though I will not complain about their not hanging around. Tamar already has too much of a retinue. I will always be of the opinion that too large of a traveling group ruins any good journey story. Rajaswami, Tamar's tutor, began to grate on my nerves, especially when it became clear that he served no real purpose but to spout some little wise saying every once in a while. And the ending battle was so convoluted with every single character suddenly appearing for a \"final bow\"; it was really confusing. To top it all off, the Reader later finds out that a demon has been pursuing them this entire time, trying to steal away a gem that turns out to be really important.However, not all of it was bad (even if the dialogue was very choppy). Hashkat, the monkey, and Garuda, the eagle, are hilarious, well-done comic relief, and I missed them as soon as I closed the book. I did not much care for Tamar, but other characters - Mirri especially - made up for the lack of a relatively likable hero. And though it is obvious that Tamar is not going to die in any of his dangerous encounters, the Author managed to add enough of an element of suspense that I actually wondered a little in the back of my mind.With a beautiful female character along, it's obvious that the hero is going to fall in love, and I dreaded this happening because it almost always gets in the way of journey stories. And of course, with a journey, the romance has to be sped up to a point that if real people got married after knowing each other for so little time, they would either be miserable for the rest of their lives, one of them would end up murdered, or they would get divorced. Hence why I am not a fan of \"instant love.\" However, it somehow worked between Tamar and Mirri; it did not feel cheap, hurried, or shallow. I was greatly in support of their feelings.Unlike other Lloyd Alexander books I have read, the ending to The Iron Ring did not feel slapped together. With other books - not all, but some - it almost felt as if the Author got bored with writing the story one day and just cobbled together an ending that was bizarre, unexpected, and thoroughly unsatisfying. That is my biggest complaint about Mr. Alexander's writing: his endings have always felt weak. And though this book's ending is predictable and kind of silly, it felt planned. Like he had intended it to end thus from the very beginning, and for that, I was satisfied with it."}, {"userName": "Alden", "userReviewDate": "Mar 27, 2014", "userURL": "http://www.goodreads.com/user/show/4896918-alden", "userReview": "The first thing you need to know is that Lloyd Alexander is one of the greats of children's literature. His magnum opus is the Chronicles of Prydain, a pseudo-Welsh fantasy coming-if-age that can break your heart in all the right ways; I'm partial myself to the faux French Revolution of his Westmark trilogy, in particular the second book, The Kestrel, where war brutally, beautifully drives Theo into post-traumatic madness. Lloyd Alrxandet writes for kids, but his protagonist suffer, because of life. Which brings us to The Iron Ring. Here, we find a young lord in a Hindi-derived setting (although more philosophy than religion), setting out to pay a debt of honor and stumbling into war, love, the limits of his rigid world. Alexander is in fine form with both his casual explanations of caste, never quite seeming to \"As you know, Tamar...\" as well as his motley of characters, elder loyal teachers and monkey kings and vengeful serpents and noble exiles. And yet...Well, for one thing, the love interest, Mirri, in particular feels too much like that. While Eilonwy or the Beggar Queen Mickle feel fairly fleshed out, Mirri is spunky on a children's novel love interest sort of way, withou much more to reccomend her. For another thing... There are way too many characters for such a slender book. At one point, three important new characters walk onto the stage and introduce themselves over two chapters. It gets a lulu title crowded, and if he'd cut a few and given the remaining characters more to work with, things may have seemed tighter. Finally, the end itself works well, but the penultimate event of the novel concludes a plot line you had probably forgotten about ages ago, which seemed more like world building at the time. Again, cutting it would have made the rest of the plot hold together more. There are a few other quibbles. But it's a kids book: if you're an adult, these criticism mean more, so bump it down to three stars. But if ultimately the biggest problem with the book is that it isn't as good as the best Lloyd Alexander has to offer, is that really a failing?"}, {"userName": "Amy", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/2329228-amy", "userReview": "I really, really enjoyed this book. It is unusual, in one way as a fantasy, because it takes place in Inida, though the setting adds beautifully to the story. It is both a fantasy and, I think, something of an allegory, with some elements of historical realism. The story follows the journey of a young king, Tamar, who binds himself to someone in a dice game (don't think to hardly of him, he was only being courteous) and sets out to obey the summons of his new master. Raised and fairly-well brainwashed in the ways of the cast-system and the codes of honor, the journey is, in one way, a coming of age story as he discovers that not all live by honor and sometimes the obvious path is not neccesarily the right now. He discovers love, friendship, and betryal on his journey as he works towards his final goal - to surrender himself, possibly to death, and keep his honor. The story is both amusing and adventerous, full of danger, with a strong female heroine, and a solid, if occasionally misguided, hero. The author is not afraid to let bad things happen to good people. In many ways, it is a heart-breaking and sweet. The ending puzzles me a little, and I would love to discuss it with someone. It is a facinating glimpse into a transcendental worldview and I am not in the least bit suprised to learn it was, at least at one point, a Sonlight book.I would definetely reccomend this book, especially for around Midle School (whether younger or older depends on the kid) It would make a great family read-out-loud and offers lots of opportunity for discussion. A good read for boys and girls."}, {"userName": "The Winter Rose", "userReviewDate": "May 11, 2010", "userURL": "http://www.goodreads.com/user/show/2977810-the-winter-rose", "userReview": "I am a huge fan of Lloyd Alexander. I love how he seemlessly pulls together threads of mythology and foreign cultures to create brillant, vibrant new stories and worlds. They feel rich and alive.It was great to see him give the same treatment to Middle Eastern mythology. However, I will admit that, while still enjoyable, it is my least favorite of Alexander's work that I have read. I definately think he did a great job at evoking the flavor of the culture and the texture of these type of stories, but it dragged on way too long. In the middle of the story, it just slumped. It was too many stories and elements crammed together. I wished he would have streamlined it a bit more to pull the reader in. Instead, I found myself often thinking \"Where is this going?\" and \"When are they getting back to the main story?\". It felt like the story was drifting too much, and while it does all tie back together again at the end and make sense, I feel it could have been done a bit better.Either way, it was a fun read and I think it's a great adventure story for young readers."}, {"userName": "Mouselet", "userReviewDate": "Jul 08, 2015", "userURL": "http://www.goodreads.com/user/show/23998901-mouselet", "userReview": "This is not actually the first time I have tried to read this book, only the first time I have succeeded. The Iron Ring was a gift to me when I was about eleven years old. Between my unfamiliarity with the Indian-style fairy tales and my inability to understand how a dream could be real but still a dream, I had to put the book down to gather dust.Recently I had begun to think that I should revisit this novel that only my own understanding had prevented my reading. On this occasion I found a richly vivid world that clearly evoked India even without reading the author's note. With a more mature understanding of fairy tales, I was able to accept even those things I didn't understand, especially because many of the tropes at play here are just that - tropes seen many times before.Because I had such trouble the first time I tried to read this book, I would recommend it for an audience slightly older than I was. The tale is an enjoyable read with some good messages, but in the end I would still consider it to be fluff. Exotic, well-written fluff, but fluff all the same."}, {"userName": "Nancy", "userReviewDate": "Apr 28, 2015", "userURL": "http://www.goodreads.com/user/show/890720-nancy", "userReview": "As King Tamar gambles away everything in a game of dice with the mysterious King Jaya; a iron ring appears on the young King of Sundari’s finger as a reminder that his riches, his kingdom, even his life are no longer his own. Tamar, accompanied by his wise and cheerful teacher, journeys to Jaya’s kingdom of Mahapura to make good on his debt. Along the way, he meets a variety of companions including, among others, a fast-talking monkey, a cowardly eagle, a journeyman with magical powers, and a young milkmaid with a sharp sense of wits. Together this groups develops a sense of camaraderie and cooperation as they embark on a dangerous battle between two warring kings.\tIn this fantasy-adventure deeply rooted in Indian mythology, Tamar is motivated by his sense of dharma, or honor apparent in his warrior caste. Tamar soon learns about the true meaning of dharma, that this adventure has an even greater significance. Good discussion book for advanced readers grades 5 and up."}, {"userName": "Elzbeth", "userReviewDate": "Apr 29, 2016", "userURL": "http://www.goodreads.com/user/show/3759756-elzbeth", "userReview": "The book itself was magically written, like mythology that'd been expanded upon. However, throughout the entire book from the time Tamar left on his journey to the point it was concluded, I hated his whiny little self. He was whiny the entire time and I'm sure he was supposed to learn some sort of lesson in the end, but I just didn't see it. He had tons of people around him all the time saying grow up, you're an idiot, dharma doesn't mean a darn thing and he's just like \"no, I must defend me honor because I have honor that must be defended. If I leave my honor undefended, then I have not defended my honor. Did I mention I have honor?\"Honestly, my favourite characters were the Gopi, the tiger, the monkey and Ashwara."}, {"userName": "Connor", "userReviewDate": "Jul 01, 2010", "userURL": "http://www.goodreads.com/user/show/3402064-connor", "userReview": "this book was freakin marvelous. when i picked it up off the shelf at the library i saw the cover and almost put it back. but i guess that i learned not to judge a book by its cover. i was 20 pages into the book and i was into it already. theres many characters and its a little hard to put them all in place so u might get confused at some point. but when u get the characters straitend out u really start to enjoy the book. it has a mixture of things in it: kings, sword, bows, battles,talking animals, indian mytholigy,a good story of friendship,and a tad bit of romance. all in all i rate this as a book u shuld read in ur life time or u a totally gigantic enourmis stupid nincompoop."}, {"userName": "Zach", "userReviewDate": "Oct 06, 2016", "userURL": "http://www.goodreads.com/user/show/50919402-zach", "userReview": "A very interesting story in which Tamar discovered many things about the world and greatly matured.When he started off, he was impulsive and only acted according to his warrior's dharma (code). As he travelled, he learned to value others' lives, respect the dead, think to solve problems rather than hack through them, etc.Very interesting group of traveling companions, and it was cool to see how every story tied together.I will admit, all the caste names and titles were a little complicated, and the book treated the reader as if they were expected to know them. Luckily, the back had a list of all the definitions.Anyway, very good read."}, {"userName": "Bernadette", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/57572270-bernadette", "userReview": "For a non-Christian writer, the beautiful allegories and deep truths this novel brings out were stunning. The India setting was fun to explore and learn about, and the story was a constant jump from action to action with unique and lovable characters. The end did give me a deja vu of C.S. Lewis' Voyage of the Dawn Treader, with Hashkat getting his tail back as a gift from Jaya in the same way Reepicheep has his restored by Aslan at the end of Lewis' 5th installment of the Narnia series. Overall, it was a delightful read. Alexander never disappoints me, and I honestly love all his works."}, {"userName": "James", "userReviewDate": "Jun 26, 2014", "userURL": "http://www.goodreads.com/user/show/32585039-james", "userReview": "i loved it"}, {"userName": "Jenna Henderson", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/77560544-jenna-henderson", "userReview": "The Iron Ring is a wonderful book for young adults, with a great tale of adventure, complex characters, and a vivid setting. The story starts with a dream Tamar, a young king, has about losing a dice game, and the right to call his life his own. He believes it to be more than a dream when he sees an iron ring he was given on his finger. Being the honorable character he is, Tamar decides to travel with his “acharya” to a kingdom between two mountains, to pay off his debt. Along the way he meets new characters who decide to join him on his quest to the kingdom of Mahapura. There was never a dull moment in the book and every detail was important. There was enough detail to make out a clear picture of what was happening and enjoy the entire experience. My favorite part of the whole book was the amazing characters with fun personalities and great stories."}, {"userName": "Diane", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/1631496-diane", "userReview": "Tamar is visited (or is he?) by King Jaya. He loses his life to the king and is honor bound to go on a quest to Jaya's kingdom. Along the way, accompanied by his Rajaswami, he encounters others who join him in his quest: Hashkat, a monkey whose life Tamar saves; Mirri, a gopi and Adi-Kari, another teacher. Along the way, the companions learn important lessons on life, love and honor. The group joins Ashwara and his brothers, Kirin and Skandia, in a battle against an evil war lord who has taken Ashwara's kingdom by force and treachery. They have much to give, but also much to learn."}, {"userName": "Maria", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/1217440-maria", "userReview": "It’s an adventure book with a moral about being an ethical human being. For its message, it does kind of go on and on... but it’s an entertaining listen if you pretend the narrator is Rudy Kipling mansplaining to the natives. As an adult, I found it kind of preachy, but I could see how, if I were 11 or 12, I might have enjoyed the tone."}, {"userName": "Michele", "userReviewDate": "May 09, 2017", "userURL": "http://www.goodreads.com/user/show/1386139-michele", "userReview": "Read several times. Wonderful story, & the audio book version is excellent!"}, {"userName": "Jordan", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/32560362-jordan", "userReview": "This author is my favorite. He always weaves a lesson into his stories."}, {"userName": "Jane G Meyer", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/107337-jane-g-meyer", "userReview": "A fun adventure story, and a good introduction into some basic Indian themes found in Indian culture... A nice read aloud if your'e good at voices!"}], "description": "Driven by his sense of \"dharma,\" or honor, young King Tamar sets off on a perilous journey, with a significance greater than he can imagine, during which he meets talking animals, villainous and noble kings, demons, and the love of his life.Alexander's latest epic adventure is rooted in the mythology of ancient India. A losing game of chance with a mysterious stranger seems like a dream to young King Tamar, but the iron ring on his finger is a very real token that his life may be forfeit. A journey to the stranger's distant kingdom seems his only chance to discover the truth. Many adventures and diversions crop up along the way as Tamar gains some surprising companions, including a brave and beautiful milkmaid, a cowardly eagle, and a wiley monkey king who used to be a man. The author's flexible style moves smoothly from comedy to tragedy and back again; from battle scenes to ridiculous situations, Alexander never loses the thread. Set within the action are small gems of poetry and folktales. The concept of dharma, or proper conduct, and the rigid caste system deeply affect Tamar's actions. Plot, characters, and setting all have their parts to play, but it is the tension set up among the lively characters and the cultural conventions binding them that create the structure of the story and lead inevitably to its conclusion. This wise and witty adventure can be enjoyed on many levels.", "title": "The Iron Ring", "url": "https://www.goodreads.com/book/show/773693.The_Iron_Ring", "average": 3.82, "cover": "https://images.gr-assets.com/books/1348006482l/773693.jpg", "reviews": 179, "authors": [{"url": "https://www.goodreads.com/author/show/8924.Lloyd_Alexander", "name": "Lloyd Alexander"}], "type": ["Fantasy", "Young Adult", "Fiction", "Adventure", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/773693.The_Iron_Ring", "http://www.goodreads.com/book/show/2011245.The_Iron_Ring", "http://www.goodreads.com/book/show/2940435-the-iron-ring", "http://www.goodreads.com/book/show/24780.The_Book_of_Three", "http://www.goodreads.com/book/show/24784.The_Black_Cauldron", "http://www.goodreads.com/book/show/24781.The_High_King", "http://www.goodreads.com/book/show/24782.Taran_Wanderer", "http://www.goodreads.com/book/show/24779.The_Castle_of_Llyr", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}