{"ratings": 18, "userreviews": [{"userName": "Laura Gardner", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/215964-laura-gardner", "userReview": "Thanks to @PenguinKids for the free book. All opinions are my own.~*~*~*~*~*5/5 and ⭐️ALL THE STARS⭐️ for Jigsaw Jungle by @Kristin_Levine_author, which comes out June 19. Preorder your copy now!~*~*~*~*~*Claudia's father has disappeared without a trace. When clues start appearing in the form of puzzle pieces, Claudia assembles a scrapbook to document the treasure hunt she hopes will uncover her father. With the help of her grandfather and a new friend, Claudia must investigate her father's past, present and future to discover his secrets. Claudia thought she had a happy family, but now she's beginning to doubt everything he thought she knew.~*~*~*~*~*I'll admit it. I'm a BIG fan of all of Kristin Levine's books (especially Lions of Little Rock!) so I was pretty happy to pick up her newest book, which is NOT historical fiction. Nope! This book is a solid mystery comprised of phone, text and video transcripts, emails, postcards and other documents. You might think that's a stilted way to tell a story, but under Levine's masterful writing it flows beautifully. I couldn't put it down and I absolutely loved all the twists, especially the ultimate twist at the end.The mystery is cleverly created and very complex. I predict this will be a huge hit with students and the kind of book we gush about together in the library when they return their copy. ~*~*~*~*~*This belongs in ALL elementary and middle school libraries. Put it on your pre-order list now and be sure to order more than one copy; it's going to fly off the shelves!~*~*~*~*~*#bookstagram #book #reading #bibliophile #bookworm #bookaholic #booknerd #bookgram #librarian #librariansfollowlibrarians #librariansofinstagram #booklove #booktography #bookstagramfeature #bookish #bookaddict #booknerdigans #booknerd #ilovereading #instabook #futurereadylibs #ISTElibs #TLChat #kidlitexchange #jigsawjungle"}, {"userName": "Kat", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/10646666-kat", "userReview": "#TheJigsawJungleI don't want to give away too much of the overall plot because it would take away from the mystery of what Claudia and the reader go through. The Jigsaw Jungle is a tender hearted story about family and the how we view our family through rose colored glasses. I loved this novel for middle grade readers because it gives them a glimpse about the trials of being a family and how we navigate those changes."}, {"userName": "Mary", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/16051892-mary", "userReview": "Very well-written and fun to read. However, the overall premise annoyed me. I get that adults can make mistakes and need to process big life choices, however, to just leave your wife and daughter (Claudia) and then make your daughter go on a treasure hunt to figure out why you left is immature. I couldn't get past it, even if Claudia could. I would have given this 4 stars but i just couldn't. It reeked too much of running away from your problems. It seemed like the only way he would come back and face his family was if Claudia solved the clues, which i felt put undue pressure on her."}, {"userName": "Meghan", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/75921661-meghan", "userReview": "So one day, 12-year-old Claudia Dalton’s father just up and disappears with nothing but a “working late” email. At first it’s just a minor inconvenience- there’s no adult who can drive her and her friend Kate to the movies. But the next day, when he still hasn’t shown up, Claudia and her mother realize this is serious. They file a missing persons report, but then receive a postcard from him saying that he’s gone to “think things over”. And since it’s not illegal for a man to just wander away from his family for a while, there’s not really anything the police can do.Claudia’s mother has to go away for two weeks for a conference, and Claudia has to stay with her paternal grandfather, who is working through his own grief by recording messages to his late wife. At her grandfather’s house, Claudia makes friends with the (apparently ‘cute’) neighbor’s son, Luis.And then, they receive word from her father. Three items: a flyer for the National Air and Space museum, an ad for a pizza restaurant, and a letter containing a single puzzle piece with the words “find the time capsule”.It’s oddly appropriate, since she and her dad always loved to do puzzles together. Now Claudia has to solve a series of puzzles with the help of her friends and her grandfather, hoping that once they reach the end of the quest there will be an answer waiting.This story is told in the form of a scrapbook of letters, pictures, text messages, emails, receipts, and transcripts of phone calls and recordings with the occasional note from Claudia to explain things in more detail. She painstakingly combs through old home movies from hers and her dad’s childhoods, trying to make sense of everything. And while most adults might be able to figure out what’s up fairly early on, this is an insanely intriguing mystery that will keep kids hooked from page one.What I like about this book is that Kristin Levine doesn’t shy away from the real problems. Claudia has legitimate questions to ask, like “Was it my fault? Was I not a good enough daughter? Will my parents get divorced? What will that be like?” The book even explores the issues of her friends and family. Kate’s father is distant and her mother’s about to have a baby, and Kate wonders if either of them will still have time for her, or if her dad might vanish too. Luis has already experienced the pain of divorced parents. And Claudia’s grandfather, in his messages to his wife, wonders if he wasn’t a good enough father to his son, and if he’s going to mess up his granddaughter too.Full of heart, laughter, and tears, this book encompasses so many aspects of life and growing up- regrets, love, loss, heartbreak, friendship, change, and redemption. Just like a jigsaw puzzle, this book explores how all those pieces fit together. Sometimes, they won’t make a perfect picture. Sometimes, that picture is incomplete or damaged, but manages to be complete in its imperfection."}, {"userName": "Carrie Shaurette", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/2900133-carrie-shaurette", "userReview": "With a runaway father that leaves clues behind in order for his daughter to find him along with the mixed media formatting, this book practically booktalks itself. While I figured out the mystery fairly early, it didn’t hamper my enjoyment of the treasure hunt and I don’t think kids will catch on quite as soon. As with Levine’s other books, sympathetic characters are the basis for a good story.Librarian note - the author is super engaging when Skyping with kids."}, {"userName": "Rubie Gallegos", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/61580714-rubie-gallegos", "userReview": "I really did enjoy this story. A realistic to our times coming of age story for the young and the adults. Plenty of mystery, intrigue with grit and honesty, new friendships, and old."}, {"userName": "Crystal", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/938799-crystal", "userReview": "ARC via publisherI solved the puzzle on page 125. I'll review later. I'm still working through what I feel and how I would explain my thoughts without spoilers.After sitting with this book for quite some time, I still don't appreciate it as much as I had hoped. There is definitely good build up for the mystery and so the suspense is there, but I simply didn't find the plot completely believable. The clues are fun to follow, but the twist also didn't sit well with me. I can't explain why exactly without giving things away. The father has disappeared and is providing a kind of scavenger hunt for his daughter. Abandonment is no joke and yet the hunt is on. I found this to be a little too cruel since he seemed to be an otherwise loving and caring father."}, {"userName": "Emily", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/2669444-emily", "userReview": "I love Kristin Levine books, so I went into The Jigsaw Jungle prepared to enjoy it. I wasn’t disappointed. It had mystery and heartache. I can’t imagine going through what the main character did. If my dad would have done something like this, I would have had a horribly hard time forgiving him. The ending was well done and I was happy with it. However, one thing that annoyed me (and should not have) was how all of the characters said, “work the puzzle.” Either you PUT TOGETHER a puzzle or you WORK ON a puzzle. Ooo, it drove me crazy. It shouldn’t matter in the long run. Overall The Jigsaw Jungle was excellent and good for fans of Mr. Lemoncello’s Library."}, {"userName": "Cynthia Parkhill", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/20616966-cynthia-parkhill", "userReview": "#GoodreadsGiveaway"}, {"userName": "Brenda Kahn", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/2700654-brenda-kahn", "userReview": "Being purposely oblique here because it is a mystery after all. Claudia, our engaging, introspective keeper of the scrapbook has had her life as she knew it turned upside down."}], "description": "A mysterious treasure hunt helps to heal a broken family in Kristin Levine's first contemporary tale. Claudia Dalton's father has disappeared. What began as a late night at work has spiraled into a missing persons case - one that's left twelve-year-old Claudia questioning everything she's ever known about her father and their family. But when she finally gets word from her dad, it turns out he isn't missing at all. He's just gone to \"think things over and visit an old friend,\" whatever that means. Feeling confused and helpless, Claudia starts to assemble a scrapbook, gathering emails, receipts, phone transcripts and more, all in a desperate attempt to figure out what's happening with her dad. Claudia's investigation deepens at her grandfather's house, where she receives an envelope containing a puzzle piece and a cryptic message.It's this curious first clue that sets Claudia on an unexpected treasure hunt that she hopes will bring her dad home and heal whatever's gone wrong with her family.", "title": "The Jigsaw Jungle", "url": "http://www.goodreads.com/book/show/35457251-the-jigsaw-jungle", "average": 4.0, "cover": "https://images.gr-assets.com/books/1513118809l/35457251.jpg", "reviews": 10, "authors": [{"url": "https://www.goodreads.com/author/show/1904055.Kristin_Levine", "name": "Kristin Levine"}], "type": ["Childrens", "Mystery", "Realistic Fiction", "Family", "Lgbt"], "outlinks": ["http://www.goodreads.com/book/show/35457251-the-jigsaw-jungle", "http://www.goodreads.com/book/show/11699349-the-lions-of-little-rock", "http://www.goodreads.com/book/show/4570908-the-best-bad-luck-i-ever-had", "http://www.goodreads.com/book/show/20821303-the-paper-cowboy"]}