{"ratings": 46503, "userreviews": [{"userName": "Paromjit", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "This is a delightful, charming, and comic read set in London and Brighton which I adored. Laura is a divorced and broken woman for whom intimacy has proved to be a disappointment. She finds employment as housekeeper and assistant to writer Anthony Peardew, who experienced heartbreak with the loss of his beloved Therese on his wedding day. That event has coloured and haunted his entire life, with guilt over a broken promise, a lost communion medal, and led to the enormous collection of lost items which he has found with the hope of reuniting them with their owners. He dies, leaving his home, Padua, to Laura for whom it is a sanctuary, with a condition that she makes efforts to restore the lost items to their true owners. Whilst owning Padua brings security and delight to Laura, the real prize turns out to be the task Anthony sets for it offers Laura a path toward resurrecting her life again, tenuously learning to trust people and connect with the world again. With faltering steps, Laura befriends the extraordinary girl that is Sunshine, a downs syndrome child who has been bullied. Sunshine is special and has the capacity to see and understand things that elude Laura, particularly when it comes to a irascible and troubled ghost and the lost items. Laura, Freddy, the gardener, Sunshine, and Carrot, a rescued dog, begin to connect as a unit slowly developing the strength to overcome obstacles such as the ugly local rumours concerning Laura. There is a parallel story about Eunice and Bomber, and the tragedies and triumphs that litter their lives through time. The storylines do eventually connect. Interspersed throughout we have entrancing and shocking tales of some of the lost items, and the various situations that the owners found themselves in. Laura, with the help of Freddy and Sunshine, sets up a website documenting the lost collection only to find it becomes so much more than she envisaged.Ruth Hogan has weaved an intelligent, magical and fantastical tale of loss, love, heartbreak, redemption and hope. It is infused with whimsy and laugh out loud humour. It is beautifully written, and wonderfully descriptive. The wide ranging characters are what really makes the book, including the minor ones like the monstrous Portia and her ghastly novels. I cannot recommend this book enough, it is an enchanting contemporary fairytale and a great read. Many thanks to John Murray Press for an ARC."}, {"userName": "Elyse", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Library ebookOnce in-awhile a book comes along that feels a little lacy, dressy, decorous, cultivated, rosy, sweet, courteous, cordial, romantic, a little mysterious, quirky, touching, sad, humorous, warm, cozy, and loving. AND YOU’RE UP FOR THE TASK! This novel was very unexpected- I not only mean the novel itself— but my enjoyment of absolutely EVERYTHING ABOUT IT. I consider myself to be a modern woman —- I rarely tap into an appreciation for people’s sentimental tchotchkes. I ‘did’ ......tap into my appreciation for the smallest ‘lost things’. Silly me! Darn....where is that hair clip I lost- which I use to love? Would one of you please return it to Westgate Ave. in San Jose? Thank you, kindly!There are two plot-timelines. Both were engaging—-but there was also a ‘third’ treat: stories within the storytelling. They were good! Afterall the Gentleman- Anthony Peardew, “Keeper of Lost Things”, was a writer! When housekeeper Laura inherits the job as “Keeper of Lost Things”....and tries to reunite them to their owner, she gets inventive, and gains new friends. The quiet calm tea drinking novel takes off - things get a little wacky - fun. Great characters —from gentle tranquil comforting ones to a downright wicked woman. Oh my gosh..... please enjoy your favorite drink tea ‘ properly ‘ when you read this novel .....Ha....Here is an excerpt that might warm some readers hearts ( if you’re in the mood as I was).... or perhaps you’d like to skip that page.....but I cherished it! A little context first: Laura was interviewing for the job as housekeeper/personal assistant. She fell in love with the house right away- the Padua. Anthony would later hire her. He became her employer and close friend for 40 years. The day of the interview: “ Anthony had made her tea at the interview. He had brought it into the garden room; teapot with cozy, milk jug, sugar bowl and tongs, cups and saucers, silver teaspoons, tea strainer and stand. All set out on a tray with a tray cloth. Pure white, lace –edged linen. The tray cloth was definitive. Padua was clearly a house where all these things, including the tray cloth, were part of every day life”. Ha.... and that’s the way I prepare tea in my house every day, several times a day. Why don’t you believe me? Old-Fashion values - decorum- manners - I found it to be enchanting! Lovely book ....read it when you’re in that special mood!!!"}, {"userName": "Esil", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "Charming, light and whimsical are the words I would use to describe The Keeper of Lost Things. Set in England, the story features two parallel stories that ultimately come together quite nicely. One story features middle aged Laura who inherits a house full of lost objects which she is tasked with reuniting with their owners. The other story features the lengthy unlikely friendship between Eunice and Bomber. What makes this one good are the details such as stories about the lost objects and Laura's friendship with a neighbourhood girl. The writing is fluid and enjoyable. I gather this is Ruth Hogan's debut, and I hope she writes more books because she is a lovely storyteller. Had I known that a slight tolerance for ghosts, magic and over the top coincidences are required to enjoy The Keeper of Lost Things, I may have been hesitant to give it a try. But none of this ended up interfering with my appreciation of this one. Thanks to Edelweiss and the publisher for an opportunity to read an advance copy."}, {"userName": "PorshaJo", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/5464046-porshajo", "userReview": "What a cute, quirky, charming book that gives you the 'feels-goods' all over. Sometimes you have to believe, that things happen for a reason. And this book, certainly points that out.Anthony Peardew is the keeper of lost things. His wife died many years ago. On the day she died, on the way to meet her, Anthony lost some precious item that she gave to him and made him promise to always keep with him. Anthony was distraught at loosing his wife and also the one item that would keep his promise and keep him close to her. So, in turn, he began to collect things that others had lost, hoping to return those items to them. He meticulously documented the items he found, eventually writing stories about them. Laura, who is completely lost, after marrying a dolt of a husband she probably never loved, comes to be Anthony's housekeeper at a wonderful home. When Anthony passes, he leaves the house to her and a condition, that she begins to return the lost things to their rightful owners. And so begins this wonderful tale. Throw in a small little love story, a wonderful neighbor Sunshine, a girl with disabilities, and you have such a heartwarming story. But there is also another interweaving story line - Eunice, who has lost something and lost the love of her life (literally). But Eunice has also found something and these two stories come together.OK, so in the end it was a bit predictable. There was a bit much going on too. At times, you also heard the stories that Anthony wrote about the lost items, then you throw a ghost into the mix. Wait...what? Honestly, I would have preferred to focus on Laura's story. But I didn't care. Such a wonderful thing, to return items to people who have lost them, often times, it was more the memory of the item that made them happy, rather than the item itself. But for me, the standout was the lovely character of Sunshine. I love her. I listened to this one via audio and enjoyed it tremendously. However, sometimes I got lost a bit in the switching of stories back and forth and wish I had the print. Overall, a read I would suggest to anyone who wants a quick, quirky read that will lift their spirits."}, {"userName": "Phrynne", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "This book was a real pleasure to read. It had a bit of everything, romance, ghostly presences, magic, mystery and clever literary references being just some. I enjoyed all of the characters especially Sunshine with her quirky speech and odd ways. Two main stories alternate and meander gently through the book, interspersed with lovely anecdotes about the lost things. Some of these are quite sharp and counteract the general sweetness of the book. Mind you this is a book which starts and ends with a biscuit tin full of someone's earthly remains so it is not all sweetness and light!At the end I discover that this is a debut novel (impressive), the author comes from Bedford in the U.K (so do I) and that she wrote much of the book while she was being treated for cancer. Congratulations Ms Hogan on such a good first book and may you write many more!"}, {"userName": "*TANYA*", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/29049556-tanya", "userReview": "Enchanting!!! A fairytale type of story and I loved it!! Funny, witty, sad and very endearing!! The characters and all the side stories were very engaging. (I’m off to make a lovely cup of tea!)"}, {"userName": "Helene Jeppesen", "userReviewDate": "Nov 19, 2017", "userURL": "http://www.goodreads.com/user/show/21992464-helene-jeppesen", "userReview": "1.5/5 stars. Okay, this was really bad! Maybe my expectations for this book were a bit too high since I picked it up because it was nominated for Goodreads’ Best Fiction 2017, but I can’t say I understand why it’s on this list. “The Keeper of Lost Things” is, in my opinion, a mediocre and sentimental love story that operates with superficial characters and unbelievable scenes. For instance, The Keeper of Lost Things turns out to be an old man who collects lost things he finds and then writes down where and when he found them. One thing I did like about this part, though, was that he’s a writer who writes cute and imaginative stories to go along with these lost things. Then, he decides to pass his huge collection on to his house assistant and asks her to make sure everything finds its home, and this is when the story began unravelling to me, because she accepts this challenge as a way to make up for her being a huge disappointment to her parents? I found a lot of the story to be superficial and too convenient. For instance, there is a scene in which two men meet for the first time. One man asks the other man whether he likes being a taxi driver, and the other man says yes but then elaborates with an incident in his early career in which he ran down a man? “But don’t tell my daughter”, he adds. Who in their right mind would share such an incident within the first sentences of a conversation? The beginning of this novel was kind of enchanting, but as my reading progressed my interest took a turn, and by the end I read with a constant cringing of my toes. How did this story end up on a list of “Best Fiction of the Year”?"}, {"userName": "Margitte", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "This was a super entertaining, fun, mysterious, and charming read. Love in different forms, from different angles, and stories in the little things lost. And then there is the Keeper of Lost Things, who knew how to connect the dots for those who needed to find ending in the clues. A dollop of magic realism strewn around London and Brighton. Mmmm .... spooky, sad, and funny. The blurb is longgggg....and explains the book. I'm just adding the first introductory paragraph here:A charming, clever, and quietly moving debut novel of of endless possibilities and joyful discoveries that explores the promises we make and break, losing and finding ourselves, the objects that hold magic and meaning for our lives, and the surprising connections that bind us.A perfect description for a perfect read. If you need a chicken-soup-for-the-soul read, this is the one for you.I loved everything about it. Hope you do too ;-)"}, {"userName": "Amanda", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/40452101-amanda", "userReview": "\"It had been in his pocket as he stood waiting for Therese on the corner of Great Russell Street. But she never came, and by the time he got home that day, he had lost them both. He went back to look for the medallion. He searched the streets and gutters, but he had known that it was a hopeless task. It was as though he had lost her twice. It was the invisible thread that would have connected him to her even after she was gone, but now it was broken along with his promise to her. And so it was that he began to gather other people's lost things; gather them in and keep them safe, just in case one day, one of them could mend a broken heart, and thus redeem a broken man.\"The Keeper of Lost Things is a delightful debut by British novelist Ruth Hogan. The story centers around two different sets of characters. The primary storyline is modern day and revolves around Laura, an assistant to aging author Anthony Peardew. Laura has suffered some major setback in her life but finds refuge at Padua, Peardew's estate. After her employer dies, Laura is left with the task of finding the owners of all of the lost items that he had collected over the years. The second point of view is told from the perspective of Eunice and centers around her life-long relationship with publisher/employer/ best friend Bomber. The story is beautifully written, humorous, and includes many colorful and charming characters, human and canine, along with a few odious ones. The story really begins to flow after the first forty pages and the pieces of the stories begin to connect. I would describe the novel as a modern day fairy tale in which fantastical events intertwine all of the characters and their fates. It examines love in its many forms and includes literal and figurative ghosts. I highly recommend this novel for anyone looking for a charming, feel-good read."}, {"userName": "Alena", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/4456042-alena", "userReview": "I was so drawn to the premise of this book -- a man mourning the loss of the love of his life collects lost objects, hoping to reunite them with their owners, meanwhile writing short stories about each object. So much potential there.It started off with charm but quickly fell apart into disjointed parallel storylines, with so many plot contrivances I was groaning. Add the ancillary characters who were only there to move the plot and by the time the ghost (yes, ghost) came in I was pretty much done."}, {"userName": "Helga", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/23362895-helga", "userReview": "Sometimes when you are reading a book, you feel you want to join the characters, have some tea and biscuits with them, share their laughter and sorrows and cheer them in their journeys, be a part of them, be with them. And when you read the final chapter, the final sentence, and you see THE END, you feel miserable that the time has come for you to say your farewells. Well, this is one of those books. An enchanting debut novel from Ruth Hogan about love, friendship and passion, life and afterlife, acceptance and endurance.Absolutely loved it!"}, {"userName": "Patti", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/3054228-patti", "userReview": "If I had a dollar for every time the author wrote,\"a lovely cup of tea\", I could buy another book."}, {"userName": "Maria Espadinha", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/20749430-maria-espadinha", "userReview": "A Cereja que Bóia no CocktailChá...Fantasmas...Mistério...Magia...É neste estranho cocktail que esta história acontece!E que livro único!Daqueles em que se exclama:Oh!... Nunca li nada assim!...E é sempre tão reconfortante soltar uma exclamação cada vez mais funda!Que teima por não sair!Deleitei-me a sorver este cocktail de sabores exóticos!... ;)E que capa!Objectos perdidos, disseminados sobre rosas vermelhas.Cada objecto, uma história linda e triste -- uma rosa com espinhosEpisódios da vida real -- ficções que bem podiam ser verdades...E as personagens são malhas duma rede que se vai formandoNós que se atam nos momentos certosPara que a rede persista, não rasgue, não rompa!...Seres que se complementam e completam, mostrando que nada acontece por acaso neste todo misterioso, onde vidas pontuais coexistem e se interligam, num plano insondável, que as abarca e transcende!...Original, Estranho, Maravilhoso!E tem brinde -- o cocktail vem com cereja:É um hino em prosa à amizade -- haverá melhor presente na vida?!... :)“— O que é que me chateia? —”“— Não ter um tipo bonito com um desportivo vermelho, um Filofax e um apartamento em Chelsea?Eunice deu uma dentada decidida na ponta do gressino. — Para que diabo havia de querer uma pessoa assim quando te tenho a ti e ao Douglas?”Para ler num jardim povoado por canteiros -- belos canteiros de rosas vermelhas :)"}, {"userName": "Victoria", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/22727329-victoria", "userReview": "Accept the things to which fate binds you, and love the people with whom fate brings you together, but do so with all your heart. Marcus Aurelius \nAn uplifting, enchanting and marvelously crafted escapist read with minimal fluff and maximum appeal. The Keeper of Lost Things is the perfect antidote for what ails us. As much a tale about the loss of things as people, love and even self, the threads that connect us and the kindness of strangers.Hogan has seamlessly plotted two separate stories, each just as entertaining, while weaving the imagined stories of the lost items throughout. She then added more than a few eccentrics, a feisty spirit and a sweet innocent by the name of Sunshine whom you will come to love, and gave us a story brimming with wit, wisdom and charm galore.Whether The Keeper of Lost Things is a story of happenstance, serendipity or the fickleness of fate is up to each reader to decide, but for me it was a gloriously clever and heartwarming story that belied its simple premise and gave me much to ponder. And I’ve already put her new novel, The Wisdom of Sally Red Shoes on my list for when I need a small dose of frothy, feel-good bookishness.__________Excerpt from an interview with Ruth Hogan for those of us who like to know the inspiration for a story and just a teeny bit more: The Keeper Of Lost Things began with a single sentence that came into my head on a train journey and that sentence eventually became the first line of the novel. But it took a while for me to come up with the rest of the story. I often describe myself as a documentary junkie, and the more weird and wonderful the topic, the more it interests me. I’m forever cutting things out of magazines and newspapers, and the plot for Keeper was initially sparked by two news articles – the first about the strange things that end up in Lost Property Departments, and the second about the fate of cremation remains that are never claimed from funeral directors. My leading man, Anthony Peardew, was inspired by a former neighbour of mine who, I was told, became a reclusive hoarder after the tragic death of his fiancée. I named him Anthony and gave him a house called Padua, because Saint Anthony of Padua is the patron saint of lost things. Peardew was a little joke that I had with myself. It is pronounced in the same way as ‘perdu’ – the French word for ‘lost.’ Anthony’s fiancée, Therese, was named after Saint Therese of Lisieux, who was also known as Saint Therese of the Roses, which just happen to be my favourite flowers."}, {"userName": "Steve Walsh", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/25246765-steve-walsh", "userReview": "I was sent a copy of The Keeper of Lost Things by Goodreads, which means that it is a shame that I feel duty bound to put up a review of this book. I pretty much knew from paragraph one that I wasn’t going to like it. It is the worst book I have read in a long, long time, and certainly the worst book I have finished. The most complimentary word I can find to describe it is ‘cute’. Everything about it is cute, every stereotyped character is cute, every stereotyped dog is cute. It is sugar, coated in sugar. If you were thinking of reading it because of the cute cover, just find another book. The one next to it has to be better than this trite drivel."}, {"userName": "Pauline", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/57991562-pauline", "userReview": "The Keeper of Lost Things was very different from the books I usually read. It had a lot of different storylines and characters. Some of the characters were very likeable and my favourite character was Sunshine. I would like to thank NetGalley and John Murray Press for my e-copy in exchange for an honest review."}, {"userName": "Kirsty &#x1f4da;&#x1f4d6;❤️", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/5390112-kirsty-x1f4da-x1f4d6", "userReview": "A delightful feel good story."}, {"userName": "Poppy fairy ", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/18322003-poppy-fairy", "userReview": "A ray of sunshine of a novel. Beautifully written. Every character I cared about. I highly recommend to contemporary readers as the whole story just pulls you in."}, {"userName": "Marialyce", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "If you are a lover of wonderfully told stories where people truly love one another, then this book is ever so right for you. It is told with such tenderness of a love story immersed within two love stories. It is a story of requited love and love that was felt but never could be carried through. It was a story of people, a bit broken at times, but with the strength and love we all possess and probably should show more of. This was a feel good story, one that will propel you out of the doldrums and make you quite glad that you got to spend some time with Anthony, Laura, Sunshine, Freddy, Eunice, and Bomber and least I forget some lovely four legged friends.Imagine finding and labeling and keeping things you have found in your lifetime. Now imagine wanting to find the people who lost those things. In that you have the premise of this book. It was endearing and brought a big smile to my face as I turned the last page and read the last word. Now out to take a look for some lost things as I would truly love to be a keeper of lost things too!"}, {"userName": "Hannah", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/45650030-hannah", "userReview": "Anthony Peardew has lost something precious to him, breaking a promise to someone he loved dearly. He would give anything to get it back and now he collects anything he deems lost in hopes that he will one day reunite the objects with their owners. But time is running out and his study is still filled with lost things. Laura is the houskeeper of Mr Peardew's lovely home, Padua. When he dies, he leaves the house to her under the condtion that she tries her very best to find the owners of all the labeled contents in his study. She is now the new Keeper of Lost Things. Challenged with the overwhelming task, Laura befriends a young girl named Sunshine & the gardener Freddy who begin to help her. The trio is also tasked with the job of reuniting Anthony Peardew with his beloved in death. In 1974, Eunice has found something special that she has kept as a good luck charm. Forty years later however, she has lost something else dear to her. Something she will never forgive herself for losing. With two intriguing stories that start off years apart, the characters of this heartwarming book will have to come together to solve the mysteries of life and death, while learning lessons of love and happiness as well as death and sadness. It was difficult for me to write a review that does this book justice. There are so many parts to this story that make it beautiful, but also difficult for me to piece together to make sense in a review. This book was charming, whimsical, emotional, and all around a lovely read. I loved the creativity in the stories behind the lost objects. I also loved how different stories were told throughtout the book and then tied together in the end. All of the characters were interesting and likable. I was nervous to start reading this due to how different it is from what I normally read, but it was the highlight of my day to open this book and enjoy the pages."}, {"userName": "Carolyn", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/19559507-carolyn", "userReview": "This is a really lovely gentle story full of warmth and charm. Anthony Peardew is the original 'Keeper of Lost Things'. He not only lost his beautiful fiance, Therese, just before their wedding day but also a precious medallion she gave him that he promised to keep forever. Never able to get over her loss, he began to collect lost object, carefully recording where he found them, a button, a child's umbrella, even a box containing someone's ashes. Anthony began to write short stories based on these items and became famous as a writer but one day he decides it is time for him to join Therese and pass on his collection of lost things and his beautiful house to Laura, a young woman who has been looking after him as a secretary/housekeeper. In his will he asks that she try to find a way to reunite the lost objects with their owners. Unsure how to do this Laura finds help from Anthony's handsome gardener, Freddy and Sunshine, a neighbouring girl with Down's Syndrome who she befriends.The characters in this book are lovingly drawn - Anthony the gentle writer who grieves for those who have lost something, Sunshine who excels at making a lovely cup of tea and sees solutions to problems with simple directness and Laura, a lonely woman who unexpectedly finds a new life, friends and love in taking on Anthony's quest. There is also a little bit of magic as Laura receives help from an unexpected source. Guaranteed to bring a smile to your face with its gentle humour and wry observations. Definitely a delightful way to spend a few hours. 4.5★"}, {"userName": "G.J.", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/58061134-g-j", "userReview": "This is a wonderful book, when I read the first few pages I was really not sure, I came across a couple of sentences which I thought \"oh no, not dozens of adjectives to just describe one thing\" BUT as the story progressed I settled into it and thoroughly enjoyed it. There are so many stories within the book but this doesn't distract from the pleasure of reading it, it enhances it . The variety of characters are by turn entertaining, amusing, irritating, funny . Throughout the whole book there is an underlying poignancy, sadness even, but reading it doesn't make you feel sad, it's mixture of themes makes it oddly uplifting."}, {"userName": "Jen", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/3156542-jen", "userReview": "This was such a delightful, charming, beautifully written novel. ♥️ The Keeper of Lost Things had me entranced from start to finish. A little quirky, a little whimsical, a little witty, a little mysterious, a little sappy...it all added up to one delightful read! In The Keeper of Lost Things we meet Anthony Peardew, a broken hearted widow who begins to collect items he finds after the loss of his beloved. He writes beautiful tales of these found objects and files them away in his study. After he passes, he leaves the contents to his assistant (and friend) Laura. Laura is reeling from a bad divorce and finds purpose in these lost objects and returning them to the rightful owners. Add in a love interest and a delightful neighbor with Down Syndrome (aptly named Sunshine) and you have yourself a heartwarming tale! Reviews were mixed on this one but after a string of thrillers and heavy topics, I loved this light and heartwarming tale. For me, this was ⭐️⭐️⭐️⭐️/5 stars."}, {"userName": "Maria Espadinha", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/20749430-maria-espadinha", "userReview": "Real Life TalesWOW! What a cover!What an exquisite faithful portrait, springing from the heart of this book:Those objects spread among red roses, each one with a beautiful sad story to tell -- roses with thorns -- fictions grazing anonymous truths -- episodes of anyone's real life.The perfect graphic teaser for this particular storyline!...The story about to begin, will lead us into an universe where characters are knots merged in a web -- people crossing at due timings, showing that nothing happens by chance in this misterious whole where we all interact, complementing each other, towards an incognito strange kind of purpose -- something undefined, we feel bigger then us, where all those crossing paths will hopefully gain a common sense!...A real life fantasy to enjoy in a garden full of red roses :)Magic!Ghostly!Misterious!Enchanting!It's 1, 2, 3, 4 super shining stars to this small masterpiece :)Get ready for your reading ceremony! ;)"}, {"userName": "Mary", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/25340667-mary", "userReview": "Dear Reader,This was truly one of the most beautifully written books that I've ever had the pleasure of reading. Not specifically looking for it,yesterday,in the bookstore it found me. Once I'd read the first page I knew it had found a new home. Wonderfully descriptive,this story weaves the life stories of Anthony,Therese,Laura, Freddy,Sunshine,Eunice and Bomber into a rich tapestry of daily life burnished with its myriad sorrows and joys.Peppered with emotive issues,soulful moments and delightful snapshots into these colourful characters,we are privy to a tale encompassing love,second chances, familial bonds and companionship. I loved this addictive,deeply compelling,'food for the soul' story. I highly recommend it to those seeking a life affirming,heartwarming tale,eloquently penned by a talented author gifted with a magical way with words."}, {"userName": "Mandy Radley", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/28892382-mandy-radley", "userReview": "I absolutely loved this book. A perfect read, especially when laid on a sun lounger. Highly recommended"}, {"userName": "Rebecca Dunbar", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/10630118-rebecca-dunbar", "userReview": "AWFUL. Truly appalling. I don't even know where to start. Maybe with a single positive - the first three chapters were quite good, and it's a terrible shame that Anthony Peardew didn't stick around because things went decidedly downhill after he died. I started to really worry about the book when it became clear that there would be no shift in the narrative voice whatsoever - and what I mean by that is that, when the little 'stories behind the items' were included, they were narrated in the exact same manner as the text that had come before it, with Laura in centre stage. Given that they were supposed to have been written by Anthony, this was a grievous mistake. Now I'm no stranger to alliteration and similes and I understand the purpose that they serve. However, Hogan took this TOO FAR. Everything was an alliteration - Poisonous Portia, Slinked seductively into the salon (everything was alliterated, all the time!) and the clichés were never-ending. The dialogue was nothing short of embarrassing, 'Liar Liar Pants on Fire!' Etc etc. I don't think anyone speaks to friends and family like that. By far the most AWFUL part of the book was Sunshine, the 'dancing drome' character with Down Syndrome. This was truly, truly appalling and really quite shameful. 'Is it time for the lovely cup of tea' will haunt me until my dying day. What a horrendous sentence to impose upon the character, whose sole purpose *seems* to have been to provide some comedy for the woeful characters that were her 'friends' - such as best friend and 'heroine' Laura who mocks her, hides from her in the larder and, at no point I would argue, is likeable in any sense. In fact, despite Anthony's belief that she is a tortured soul who loves the house as much as him ... she spent most of the last 200 pages trashing it in a rage. Added to that Sunshine's preternatural capabilities, a TERRIBLE, predictable and sickly-sweet plot, not to mention another 15,000 similes and cliches ... this was not a good read. AVOID."}, {"userName": "Anne", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/546484-anne", "userReview": "The Keeper of Lost Things by Ruth Hogan is published in hardback by Two Roads Books on 26 January 2017, and is the author's debut novel.Every now and again, a book comes along that can make the reader laugh out loud and then cry within just a couple of pages. The Keeper of Lost Things is one of those books. I have been absolutely entranced by it for the past few days.Anthony Peardew is the keeper of lost things. He has spent most of his life picking up the items that others have lost, taking them home and treasuring them. He began to collect things after losing something of his own, something that was so precious. His aim is that one day he may be able to reunite the lost items with their owners, and heal some broken hearts.Not only does Anthony lovingly store them, and label them, he also writes stories about them. His imagined tales of how the item came to be lost.When Anthony dies, he leaves instructions for his housekeeper and companion, Laura. She must do her best to find the owners, and give back the missing pieces of people's lives.Running parallel with Anthony and Laura's story, the reader learns about Eunice and Bomber - from a different era, but living in similar circumstances with Eunice keeping house for Bomber. These two stories are so cleverly interwoven, and gently overlap towards the end of the book.Ruth Hogan has created a wonderful, beautiful, touching and funny story with some incredibly crafted characters. Each one of them has a distinctive voice, from Portia, the cruel, vindictive sister of Anthony, to Sunshine the lovable neighbour of Anthony and Laura.I adored the stories that Anthony wrote about the missing items, I howled with laughter whilst reading about the blue jigsaw piece and sniffled quite a bit when it came to the white umbrella. The imagination and creativity that has gone into each short story, alongside the expertly written main plot is amazing.This story is multi-layered, with a range of themes. It's a love story, it has a bit of magic, there are ghosts and story-telling. The author explores family dynamics, relationships, illness and loss, and all are dealt with beautifully and with feeling.The Keeper of Lost Things is an absolute delight. It is gentle and charming and full of wisdom. I loved every pagehttp://randomthingsthroughmyletterbox..."}, {"userName": "Saoirse Milotte", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/42369733-saoirse-milotte", "userReview": "Laura has nothing left to lose when she applies for a job as a housekeeper and secretary for writer Anthony Peardew. Her marriage to her cheating childhood sweetheart has collapsed, her burning desire for children was never fulfilled and she has no education to speak of. Anthony’s house is like a balm on her soul, quiet, beautiful and filled with the bitter sweet memories of Anthony’s dead wife. There is only one room, the study, that she is not permitted to enter. When Anthony dies and leaves her everything Laura is shocked, especially when she learns there is a caveat to the will. Inside the study is a lifetime’s worth of lost objects that Anthony has collected and meticulously catalogued. He wants Laura to reunite them with their owners and complete his life’s work.This novel has a little of everything, mystery, history, magic, ghosts and romance. Some aspects are great and some are not. First, the parts that did not work. The ghost of Anthony’s wife, and the magical ability of Sunshine, a neighbouring girl with Down Syndrome who becomes firm friends with Laura, seem a little forced. Rather than manifesting themselves slowly they appear as and when the plot needs to develop. The relationship with Freddy the gardener also feels a little flat, and truly the story would have been all the better had Laura built herself into a strong independent woman without him. It is a colour by numbers romance: hot, mysterious, silent man; woman who believes she could never be considered attractive again; lots of misunderstandings...it never really rings true. Finally, there is something a little snobbish about some of the descriptions that pop out like a poke in the eye. In one instance Laura describes the girls her husband has affairs with as ‘the kind of girls that drop their knickers as quickly as they drop their aiches’, there were also some comments about single mothers on benefits all smoking Benson and Hedges that were irksome. Now whether these are Laura’s opinions, a woman who admits she wished to escape her poor upbringing for the kind of life that has tea-tray doilies, or the author’s own, remains to be seen.Now for the parts that work. The flash back stories linked to each object are fabulous and show Hogan’s incredible skill at creating immediately relatable characters. Each story is an absolute gem, giving sufficient information to peak your interest but leaving enough unsaid to have you wondering what happened next. The descriptions of the house are rich enough for the reader to believe they are there, and Anthony’s character is fascinating. Beyond all else though, it is the concurrent story of Eunice and Bomber, which runs throughout the book that is an absolute joy to read. Eunice is gregarious, colourful and full of life, while Bomber fills the page with his personality making it easy to see why Eunice falls in love with him. The descriptions of their small publishing office, their dogs and their beautiful, platonic relationship throughout the years are exceptional and so believable that you will feel like you are saying goodbye to friends when you finish the last page. Their story will have you laughing and crying in turn, making them the true stars of this novel."}, {"userName": "Syndi", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/1656405-syndi", "userReview": "i am surprise by this book. i though its going to be boring book. reading couple first chapters it does looks very very boring. but then it gets very intereting about 45%. see how magical it is for the keper of lost things collecting lost objects and try to reunite it with the owner. or at least putting it on narrative. i always though lost things uave their own story. story about the joy, the lost, the salvation of the owner. delightful reading."}], "description": "Once a celebrated author of short stories now in his twilight years, Anthony Peardew has spent half his life lovingly collecting lost objects, trying to atone for a promise broken many years before.Realising he is running out of time, he leaves his house and all its lost treasures to his assistant Laura, the one person he can trust to fulfil his legacy and reunite the thousands of objects with their rightful owners.But the final wishes of the Keeper of Lost Things have unforeseen repercussions which trigger a most serendipitous series of encounters...With an unforgettable cast of characters that includes young girls with special powers, handsome gardeners, irritable ghosts and an array of irresistible four-legged friends, The Keeper of Lost Things is a debut novel of endless possibilities and joyful discoveries that will leave you bereft once you've finished reading.WE'RE ALL JUST WAITING TO BE FOUND...", "title": "The Keeper of Lost Things", "url": "http://www.goodreads.com/book/show/33815380-the-keeper-of-lost-things", "average": 3.84, "cover": "https://images.gr-assets.com/books/1483832501l/33815380.jpg", "reviews": 3505, "authors": [{"url": "https://www.goodreads.com/author/show/15305372.Ruth_Hogan", "name": "Ruth Hogan"}], "type": ["Fiction", "Contemporary", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/33815380-the-keeper-of-lost-things", "http://www.goodreads.com/book/show/30363088-the-keeper-of-lost-things", "http://www.goodreads.com/book/show/33828785-the-keeper-of-lost-things", "http://www.goodreads.com/book/show/33828677-the-keeper-of-lost-things", "http://www.goodreads.com/book/show/34217557-the-keeper-of-lost-things", "http://www.goodreads.com/book/show/33828743-the-keeper-of-lost-things", "http://www.goodreads.com/book/show/36052194-o-guardi-o-dos-objetos-perdidos", "http://www.goodreads.com/book/show/34856247-the-keeper-of-lost-things", "http://www.goodreads.com/book/show/39860004-the-wisdom-of-sally-red-shoes", "http://www.goodreads.com/book/show/39880954-la-noyade-pour-les-d-butants", "http://www.goodreads.com/book/show/40059510-vielleicht-tanzen-wir-morgen", "http://www.goodreads.com/book/show/40383104-el-guardi-n-de-los-objetos-perdidos"]}