{"ratings": 1673, "userreviews": [{"userName": "Dan Schwent", "userReviewDate": "Aug 12, 2009", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "Professor Amelia Harsh joins an expedition, funded by Abraham Quest, to find the fabled city of Camlantis. Joining her are Commodore Black and his U-boat, a blind sonar man named Billy Snow, a crazy steamman named Ironflanks, and assorted dregs of society. Meanwhile, Cornelius Fortune, aka Furnace-breath Nick, a demon masked vigilante, stumbles upon what Abraham Quest is really planning...Two words come to mind when I think about The Kingdom Beyond the Waves: \"F@cking\" and \"Great.\" All of my problems with the Court of the Air were remedied in this, the next book in the series. The stories are clearer and the characters more interesting and likeable. While some of the characters made appearances in the Court of the Air, I wouldn't think it would be essential to read that one first.Amelia Harsh is like a musclebound female Indiana Jones/Doc Savage, archaeologist and explorer extrordinaire. The story reads like a Doc Savage tale written by Jules Verne. Hunt's world is a very original place, free of many fantasy cliches.I recommend this to all steampunk fans and those of pulp adventure tales."}, {"userName": "Sally", "userReviewDate": "Feb 18, 2011", "userURL": "http://www.goodreads.com/user/show/2481083-sally", "userReview": "I'm glad I'm through this. It was way too busy for my taste. Too many concepts (though some very good ones), Too many adjectives, too many metaphors (and many of those shoved in your face), too much superfluous description, too many characters and not enough depth to them to care particularly about their fates and the nomenclature irritated me a great deal.I'm still looking forward to the third book, which is the one my friend who is loaning me these read first and the one she swears is far better than the first two and which hooked her into this series to begin with. If it doesn't come through for me, that's it with this series, though I still love the steampunk genre."}, {"userName": "Enoch", "userReviewDate": "Sep 27, 2011", "userURL": "http://www.goodreads.com/user/show/4040558-enoch", "userReview": "I admit it. I read this book because of the its cover. Unfortunately there is no indication on that cover that it is the second in a series (or at least of related books). It read like it too. Don't just start talking about \"lashlites\" without telling me what they are first. It took me several chapter to discern that the word did not denote a nationality or occupation but a race of sentient, flying lizard-birds. Also, it seems, \"shifties\" is slang for people from Quatétershift, but Hunt never capitalizes \"shifties,\" so it just looks at first that he's describing people as deceitful or evasive.One of the quotes on the back lauded the author's world building. While there were some very interesting ideas presented, I was not impressed by the cacophony of influences that seemed to dilute the story's potential potency. If the author wants to use magic as the basis of the world's laws, go ahead; if he wants to use mechanics, or electricity, or the force—great! But don't use everything that was ever thought of in one world, unless there is going to be some sort of payoff/twist near the end that aligns what the reader things is incongruent. I had a very difficult time immersing myself in the world because it seemed like there weren't enough limitations. Along with the above, if an author is going to create a world, he should spend some time/effort making good names for things. This is an irksome issue for a number of authors, not just Stephen Hunt. Some of his names (or renaming of things) were quite satisfying, such as calling factories \"manufactories\"; the race of lashlites—a good word that is easy recognize and pronounce. \"Carlists\" instead of \"Marxists,\" effective. \"Womb mage,\" conjures magic and the creepy factor! But \"Jackels.\" I read that several times at the beginning wondering if this was for real, that the main county in the story is a respelling of a wild, African dog? I imagined that there must be some reason for names like that, or Quatérshift, as there was obviously embedded references to real-world geography/legend in names like Camlantis (Atlantis), Cassarabia (Arabia). I could have forgiven all of this if there had been some sort of payoff at the end, some reason. But no, the references to real world locations were a red herring.Caveat: perhaps Hunt will continue to write in this world and will fill in gaps—maybe this is all some master plan. (But I didn't get that sense by the last page of this book.) I did like that he wasn't afraid to kill of characters—that did lend a sense of peril to the story, and I appreciate it. I also realize that the quality of naming things is not as big a deal to some as it is to me. However, I think that someone who is a writer, who has a sensitivity and appreciation for words (and how they sound and feel) should be more attentive."}, {"userName": "Skip", "userReviewDate": "Oct 19, 2014", "userURL": "http://www.goodreads.com/user/show/1389748-skip", "userReview": "I happen to like steampunk very much. I even read this one knowing it was the second book in a series, but reviewers liked it so much better than the first, I thought: why not? I give author Stephen Hunt kudos for some interesting characters, strange races and machine inventions, but found the book awfully long. Good battles, but the main character professor Amelia Harsh keeps waking up after oft-unexplained trauma. Other things that bothered me were that many of the main characters had prior lives and names they were hiding. Also, some explanatory background from the first book is needed. The basic plot is a commissioned search for a lost city (Camlantis = Camelot + Atlantis?), where peace reigned for a millennium, with secrets buried in a dangerous jungle with hive-driven inhabitants. 3.5 stars."}, {"userName": "Brooke", "userReviewDate": "Mar 07, 2008", "userURL": "http://www.goodreads.com/user/show/126262-brooke", "userReview": "The Kingdom Beyond the Waves is an absolute improvement on the first book in Hunt's steampunk series. Gone is the untamed mess of ideas and characters and storylines; in its place is a streamlined, two-pronged adventure that comes together without confusion in the end. It's still ambitious and epic, but in a much more focused, precise way. If you felt like there was much to enjoy in The Court of the Air but that the execution left something to be desired, this book will seem like a reward for giving the author a second chance."}, {"userName": "Filipa", "userReviewDate": "Jul 16, 2012", "userURL": "http://www.goodreads.com/user/show/8957953-filipa", "userReview": "http://reinodeadlle.blogspot.pt/2012/...Eu já devia saber que gosto sempre dos livros que compro na pseudo-Feira do Livro da Ericeira. Este, como é óbvio, não foi diferente. Agarrei nele mal vi que era steampunk, já que andava à procura de um livro desse género em português à bastante tempo, mas essa foi a única parte que me desiludiu no livro: é um steampunk com uma mistura de magia. De resto, adorei-o!O livro conta a aventura de Amélia na busca pela Camlântida, que na minha cabeça era uma espécie de Atlântida. A receita para aventura é juntarmos um capitão habituado a todas as mordomias, uma equipa de três marujos bastante diferentes, bastantes crimonosos acabados de sair da prisão e um monte guerreiras musculadas que não hesitam em matar. Como se pode ver, tem tudo para ser uma aventura excitante, e é! Quando pensamos que sabemos o que vai acontecer a seguir, acontece qualquer coisa completamente inesperada que nos deixa de boca aberta.O livro está dividido em duas narrativas: uma conta a aventura de Amélia pela selva de Gelileão e a outra a do misterioso Cornelius Fortune. No fim, estas duas narrativas acabam por se juntar, mas de uma forma bastante inesperada.Há algum romance bastante camuflado, mas que acrescenta alguma coisa ao livro. E ele vem das personagens mais inesperadas. Quando ao oposto, o ódio, não há uma parte do \"bem\" e uma do \"mal\", cada personagem tem um bocadinho dos dois em si.A escrita de Stephen Hunt não é confusa, mas houve algumas partes que tive de ler várias vezes para perceber. Secalhar também foi problema da tradução.ATENÇÃO: Há algumas mortes neste livro, portanto, se não gostarem de mortes de personagens importantes, já sabem...Este é o segundo livro de uma série, e só quando fui ao GoodReads é que vi. No entanto, também li algumas opiniões e vi que não é preciso a leitura do anterior para se ler este, apesar de algumas personagens serem as mesmas. Fez-me lembrar um bocado a série Robert Langdon do Dan Brown, em que podemos ler os livros pela ordem que quisermos."}, {"userName": "Nikki ", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "The Kingdom Beyond the Waves is much more coherent a narrative than The Court of the Air -- I suppose it probably helps that a lot of the world is established already, and that some of the characters and concepts are familiar, but the story does seem to flow better too. Well enough that I think I will read the third book (if my library ever gets it in, anyway) and give Stephen Hunt the benefit of the doubt one more time. The last half of the book was genuinely gripping, though I did pause partway through for a long time before getting back into it.It's fun to read, quite a lot of fun, but... I don't know. Too many characters, too few bonds between characters, too many improbable survivals and last minute rescues."}, {"userName": "Forrest", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/5511477-forrest", "userReview": "Stephen Hunt’s sophomore entry into his epic steampunk-fantasy series isn’t an enormous improvement on the first book. He still has trouble focusing in on the characters that really mater and the story doesn’t flow so much as lurch from one fantastical sequence to the next. But the core draw of the series, Hunt’s brilliant and expanding setting, is still there, shining brightly in the mess of plots and characters.The Kingdom Beyond the Waves focuses primarily on Ameila Harsh, a minor character from Hunt’s first book, The Court of the Air, and her family’s obsession with discovering the lost city of Camlantis (yes… Cam-lantis. Laugh it up). After an Indiana Jones style sequence in the tomb of a prehistoric Black-oil chieftain, we’re brought to the meat of the plot, Harsh’s utter dismissal from the halls of Jackelian academia and her inability to launch another expedition. With the unlikely aid of her sworn nemesis, Abraham Quest, she prepares to try one last time. Amelia’s story runs parallel to Commodore Jared Black, navy man and U-boat captain extraordinaire. Black is another refugee from Hunt’s first novel, along with his roommates, Molly Templar and Aliquot Coppertracks. His inclusion as a primary protagonist is where things start to get complicated. The Commodore comes complete with his own bevy of secondary characters and a wholly unnecessary subplot involving the last remnants of The Jackals royal family in exile.The second primary storyline follows Cornelius Fortune, otherwise known as Furnace-Breath Nick, trying to unravel a mystery of his own making in the Jackelian capital of Middlesteel. Fortune’s role in the novel is a vehicle for Hunt’s trademark ‘storm of a thousand Deus Ex Machinas’ in the final chapters, but that doesn’t stop him from getting a third heap of secondary characters who all have their own wacky back and side stories. For those of you counting that 3 main characters, 3 hordes of supporting characters and somewhere between 8 and 12 sets of vignettes for those supporting characters Despite Hunt making many of the same story-based mistakes he made in The Court of the Air, The Kingdom does feels less cumbersome. It helps that many of the ideas and plots are building on concepts introduced in the first novel but at the end of the day, there are just fewer names and places to keep track of this time around. Which says more about The Court of the Air than it does about The Kingdom Beyond the Waves.Thank goodness the setting still as interesting as before. Hunt takes advantage of his Indiana Jones character and really delves into the meat of his world’s history. Typically, Steampunk novels run with the idea of an industrial revolution taking place earlier on the timeline than happened in recorded history. The rapid advances in technology associated with that time period have a different vocabulary in Steampunk, replacing combustion engines with steam boilers and electricity with clockwork. Not so in The Jackals. The Kingdom reveals that oil and electricity don’t work the same way any more, so technology had no choice but to evolve in new and interesting ways. Alongside these revelations are examinations of the existing mythos of the world, from the disturbing Womb-magic of Cassarabia to the bizarre hive mind of the Daggish Empire in deepest Liongeli. What’s impressive is that that Hunt hasn’t trotted out a whole new set of places and people for this second book, but expanded on concepts and ideas present in book one. For that reason I recommend reading these novels in sequence and quickly after one another.Again, Hunt has a long way to go before these novels can be considered anything other than pleasure reading for steampunk fans. The writing is just as bad as before and while the story is less confusing overall, he’s still relying on the same tired plot devices to wrap everything up. But I sure as hell can’t put these books down."}, {"userName": "Althea Ann", "userReviewDate": "Jun 24, 2011", "userURL": "http://www.goodreads.com/user/show/3846743-althea-ann", "userReview": "I seemed to remember liking the first book in this series enough to put the sequel on my wishlist. But, upon reading this, I realized that I hardly remembered any details of the previous book (Court of the Air), and I really didn't particularly like this book.It's action-packed... but rather than being exciting and emotional, events rush by so quickly that they're barely described, and they don't have time to make an impression, let alone an impact. Neither the characters or the settings came to life for me, and the plot elements were so sketchily outlined that they were sometimes confusing. (Well, except that some of them were lifted from 'Heart of Darkness.')I liked a lot of the steampunk-y concepts and gadgetry - too bad most of them were cadged from China Mieville's Bas-Lag novels. (I mean, seriously, there're lobster-people, bird-people, and cactus-people, as well as sentient robots. Sound familiar?) A few digs at Mieville's politics are thrown in there too, for good measure.On top of it, it ends up with my Least Favorite Trope of Fantasy: the super-powerful Thing which could confer Mystic Knowledge must be destroyed/gotten rid of, because Humanity Isn't Ready, and it's Too Dangerous. Blah to all that.If I had been more entertained, I wouldn't mind, but I ended up reading as fast as I could, just to get to the end. It's too bad, because I feel like this ought to be the sort of book I would like."}, {"userName": "Paul", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/6208757-paul", "userReview": "I really like this world. Patterned on our own world, basically 19th century British empire, but very different in so many ways. In this world, the age of oil is long past, and electricity is uncontrollable. High-tension (their term) clockwork motors run u-boats, motorcars, and transaction engines (computers). This book involves the search for lost Camlantis (the equivalent of our Atlantis). This is great adventure, along the lines of Indiana Jones, but better."}, {"userName": "David", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/67692136-david", "userReview": "A wild ride. Epic imagination. I enjoyed it."}, {"userName": "Kerstin", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/27555367-kerstin", "userReview": "I'll have a very long book hangover over this."}, {"userName": "Alan", "userReviewDate": "Jan 13, 2010", "userURL": "http://www.goodreads.com/user/show/1153204-alan", "userReview": "Another sequel which for me, like Gordon Dahlquist's The Dark Volume, did not quite measure up to its predecessor. I would strongly recommend that you read The Court of the Air first if you are going to read this series at all. While only a few characters in this volume are shared with Hunt's earlier book, the milieu is largely left unexplained here, treated as if it's already a known quantity.Which it may be—which it should be, perhaps, if you have any interest at all in the steampunk craze. As in The Court of the Air, you'll find here all the oiled brass and leather furnishings you could shake a sword-cane at: pneumatic tubes and zeppelins and clockwork computers are the least of it. But this book does range farther afield than the first one, which focused primarily on two children and stayed (well, mostly) within the borders of Jackals, that country so like Victorian England in look and feel that it could be sued by Britannia for trademark violation if it really existed. This book takes its characters—Abraham Quest, the eccentric financial genius; Amelia Harsh, the struggling archaeologist with a controversial Theory, and the rest—by submarine and airship into Liongeli, remote jungle territory where awkwardly-named giant reptiles like the \"kilasaurus\" try to eat them and creepy distributed intelligences try to take over their minds, where Harsh hopes to discover the lost secrets of the lost utopian city-state of long-lost Camlantis (which could not possibly be a time-squeezed and tongue-tripping portmanteau of \"Camelot\" and \"Atlantis,\" of course).It's all great fun if you don't squint at it too closely, and even playing the game of \"hey, where have I seen that bit before?\" is entertaining enough. While I can't really recommend it highly, I can say that The Kingdom Beyond the Waves is a rather ripping yarn."}, {"userName": "Shannon", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/12362256-shannon", "userReview": "So, turns out this is second in a series/universe, which I was unaware of when I picked it up (and nowhere on the book does it indicate this is the case). That might have helped to know.In any case, the huge assault of unfamiliar terms and countries and places and things made this a really hard slog for the first third to half of the book. Nowhere did they explain what things actually were, and I spent a lot of time re-reading to try and grasp what was going on. Government systems, political ideologies, countries, human-like races, religion, general creatures and more were all thrown in indiscriminately. Carlist? Catosian? Craynarbian? Cassarabia? Camlantis? Commonshare? Circlist? Communityism? (And that's just the start...)And it didn't start well - really, glaciers ground down a mountain range and turned grasslands into desert in the space of a couple thousand years? A tomb of a mysterious ancient artifact, described alike to an eighteen-wheeler, once owned by a warlord called Diesela Khan? Really?? An academic interested in ancient artifacts who also happens to have super muscular arms alike to a gorilla? Oookay.It took a while for the terms to start to make sense, and my ability to suspend belief and buy into this world to start to operate (my issues above were eventually satisfactorily explained... except the Diesela Khan, that's just a stupid name)... but after that point, it became quite an enjoyable read, action-packed and a good rollicking adventure.I am going to have to go back and read the first book, Court of the Air, then re-read this one, and see if it is a bit smoother of a read now that I have some clue what is going on. Will see."}, {"userName": "Lousie", "userReviewDate": "Aug 18, 2010", "userURL": "http://www.goodreads.com/user/show/4171354-lousie", "userReview": "Steampunk-by-numbers. Enjoyable enough, except for the frequent political asides & the conservatively transposed geopolitics. ('Ok, so this part is like England and this part is like France and this part is like Arabia - they have slaves, by the way. And all revolutionaries are bloodthirsty, insane and doomed to failure'.)There were a few ideas I found striking - the way the winged characters deal with their dead (and the shame of not fulfilling that duty); that one of the scariest defense systems was a highly developed waste disposal unit that had evolved to neutralise all impurities. Other aspects of the world building seemed perfunctory. (It's probably unfair to compare, but the borg-like forest organism had me imagining something similar in the hands of China Mieville, say, would probably have some kind of cult of devotees  wanting  to be absorbed.)The steammen are fun but the central plot - treacherous search for Utopia - was like something out of cold-war era children's fiction."}, {"userName": "Daniel Brandon", "userReviewDate": "Feb 08, 2013", "userURL": "http://www.goodreads.com/user/show/17129803-daniel-brandon", "userReview": "The writing style puts me in mind more than anyone else of Jack Vance (and his various other literary descendents, such as Matthew Hughes). The world that Hunt has created is weird, and complicated, but has the occasional hint that it might be our world after many eons and some fundamental changes in the universe. Some shades of Michael Moorcock's Hawkwind books as well. This is a good thing.On the other hand, the colorful world is slightly afflicted with bloat. After reading both this and Hunt's first book, The Court of the Air, I really feel like they both suffer from having one (or possibly two) too many good ideas. They both hit a point where you start to feel like you're having trouble keeping track of all of the important fantastical plot elements-- and then they give you some more. As it is, it's good; but if Hunt could make it just a bit tighter, it could be really good."}, {"userName": "Casey Hunt", "userReviewDate": "Jan 22, 2011", "userURL": "http://www.goodreads.com/user/show/4857734-casey-hunt", "userReview": "I think it was a pretty good book however the author has a bad habit of killing off characters in a very dishonorable way. To me it left me wondering why these characters were introduced in the first place. I would have also liked to see more hero stories being told from these seemingly overly developed and under-utilized characters. At the same token, the book is very inventive with respect to an alternate universe. There is absolutely non-stop action however I think there are MANY stories to be told not just the one. A lot of loose ends but a really fun read with a lot going on. Nothing too complicated, just good fun."}, {"userName": "Martha", "userReviewDate": "Sep 18, 2010", "userURL": "http://www.goodreads.com/user/show/132626-martha", "userReview": "Ah, what to say. I'll leave it simple. So much of the supposed steampunk being churned out right now is dreck. This series is substantive, complex, intelligent, entertaining, action-packed, and challenging. I want to read this again, but only after I go back and read  The Court of the Air  again. Then I'll start in on the third book."}, {"userName": "Sarah", "userReviewDate": "Aug 23, 2009", "userURL": "http://www.goodreads.com/user/show/258075-sarah", "userReview": "This is one of the few books I have liked better then the first book the series, I think because it did not get bogged down by any never-ending battle scene, and instead had a smooth and nicely flowing plot throughout. This read more like a great fantasy/adventure more then a steampunk novel; I think because it focused a little less on the society (especially in light of his first novel which was very society based), but still has an interesting world setting."}, {"userName": "Karen", "userReviewDate": "Nov 22, 2008", "userURL": "http://www.goodreads.com/user/show/1741894-karen", "userReview": "This one was also very good. This is not really a sequel; a few of the characters from the last book turn up in this book, but not the main characters. Again, it's a very imaginative world, with extraordinary creatures in it. It makes me wonder why all American science fiction is so similar. Why doesn't anyone here publish anything half as inventive as this?"}, {"userName": "Katie", "userReviewDate": "Jan 31, 2016", "userURL": "http://www.goodreads.com/user/show/4902544-katie", "userReview": "I'm right in the middle of loving this book and thinking it was way to long. I think both are true. There was a lot going on in this one, much of it awesome, but maybe just a bit to much in general. Maybe I'm just a book minimalist, I think you can (and maybe should in most cases) tell a kick ass story in 300 pages."}, {"userName": "Michal Marcinkowski", "userReviewDate": "Apr 19, 2009", "userURL": "http://www.goodreads.com/user/show/2237196-michal-marcinkowski", "userReview": "A fantastic story of a lost civilisation and the people looking for it.I would say that this book is a combination of \"indiana jones\" with \"2000 leagues under the sea\" with lots of inventive and original idéas."}, {"userName": "Benjamin Kahn", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/8254203-benjamin-kahn", "userReview": "What an excellent book! I picked it up on a whim from the library science fiction section while I was in getting books with my son. I've had more misses than hits from that shelf, so my expectations were low, but what a pleasant surprise! The story was exciting, with great characters, and just flowed along. I find that often steampunk novels get bogged down in how clever their technology is. This one just went with it, created a believable world with a story that kept me on the edge of my seat throughout. I actually found myself thinking several times \"how are they going to get out of this one?\" And what an imaginative world! I couldn't believe some of the things that Hunt came up with! One of the best books I've read in quite awhile. A great, great read!"}, {"userName": "Joana", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/5163755-joana", "userReview": "3.5 stars"}, {"userName": "Hailey", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/68924423-hailey", "userReview": "I had a hard time really rooting for the protagonist. I felt as though she was too cliche and couldn't really feel sorry for her. Other than that the book was okay though it was slow at times."}, {"userName": "Laura Martinelli", "userReviewDate": "Jan 07, 2011", "userURL": "http://www.goodreads.com/user/show/2186180-laura-martinelli", "userReview": "Excuse me while I go kick myself for not picking this one a lot earlier. Unlike the previous entry in the series, this is a lot more streamlined in terms of plot, and I had a lot more fun reading it. (Not saying that I don’t love the first book, but this is a lot better with the writing.)Unlike Court of the Air, the plot of Kingdom Beyond the Waves is a lot more straightforward. There’s still a lot of jumping back and forth between the protagonists, but seeing as their interests lie with the same man, Abraham Quest, it’s a lot easier to follow and guess at what his ultimate plans are. It’s a little jarring to go from high adventure to mystery steampunk noir, but not to the point of keeping detailed charts like the first book. And I also like the fact that this is really more of an adventure tale in the tradition of H. Rider Haggard. Seeing as Amelia Harsh was one of my favorite characters from Court of the Air (all two and half pages she showed up on), I was really excited to find out that she’s the main character here. Like with Molly and Oliver, she’s another character type that comes straight out of the pulps—the obsessive professor dedicated to her father’s dying dream. She does play it a little straighter than the earlier characters, but I like that she’s willing to save Jared’s crew, even if it means giving up her dream. Cornelius Fortune is a bit more intriguing, as he’s putting on a double-life as a ne’er-do-well count and as Furnance-Breath Nick. I liked his scenes a little more, as he brought more intrigue to the plot.I do think the real stars are the supporting casts. Commodore Black was a fantastic character in book one, and to see him in full force with his crew was fabulous. I’m hoping that they get their own book to star in. I even liked the crew that Quest brings on, even though their purposes are a lot more muddled, there’s still a loyalty built between both crews. AND I LOVE IRONFLANKS. You know the crusty old guide who’s only in it for booze money and knows all the dangers of the jungle river and would probably make a heroic sacrifice? Now make him a steampunk robot. It really shouldn’t work, but it does, and I love him for it. (Oh, and his white whale is multi-eyed Tyrannosaurus rex queen that learned how to swear. Seriously, this series runs on so much Rule of Cool and it works and I love it.) Not sure how much I like Septimoth, although I do love his interactions with Damson Beeton. Oh, and Damson Beeton is PURE WIN FOREVER. (I seal-clapped when her first big revelation moment came.) And the villain has a more defined goal in this book, as opposed to overreaching political philosophy.As with the first book, what really works in this series is the world building. I liked the move to the jungles and exploring the cultures that arose there and even the exploration of an ancient society. The real world parallels are little more obvious in this book (to the point where I’m hoping that the end isn’t going to be “Oh, this was our world the whole time.” Because that would suck.) And going with the steampunk element, I like that it’s taking the idea out of gaslit cities and really exploring this world. We have submarines now; the steammen society in the jungle are equipped with multiple machetes. And I like that there’s less mysticism in this book—there’s still elements of magic and sorcery, but we’re also seeing how normal people cope in this world. There are some downsides to this, though. The lashlites are cool—flying lizards!—but I have no idea what their larger role in the plot had to do with anything. If Hunt had just left in Septimoth, it would be better, but I really didn’t get what adding the whole of the lashlites to the final battle does for anything. I’m not a fan of the full explanation of why Amelia is so obsessed with Camlantis, it feels like too much speculation on the antagonist’s part. And I was really disappointed with the Daggish, mostly because they were set up as a terrifying threat—hive-mind race of trees that enslave unsuspecting travelers and mind-wiping them—and we only get to see the once and they don’t even do anything. However, I did have a lot of fun reading this. I’d actually recommend starting with Kingdom Beyond the Waves rather than Court of the Air, as it’s much more streamlined plot-wise and while there’s a few elements from the former book that are carried over, they’re explained without dragging the plot down. It’s a really fun book, with some really interesting ideas."}, {"userName": "Viridian5", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/1948178-viridian5", "userReview": "In Stephen Hunt's The Kingdom Beyond the Waves, archaeologist Amelia Harsh is obsessed with finding the lost civilization of Camlantis, a legendary city from pre-history that is said to have conquered hunger, war, and disease with the creation of the perfect pacifist society, but her superiors in academia think she's a crackpot and refuse to fund her. With no options left, Amelia accepts the patronage of the mega-rich Abraham Quest, who financially ruined her family, which led to her father's suicide. It helps that Quest has evidence proving Camlantis existed and that some of the Camlantean ruins are buried under one of the sea-like lakes that dot the dangerous jungles of Liongeli. Amelia blackmails her old friend Commodore Black into giving her transport along the river on his beloved ancient U-boat, crewed by an untrustworthy group of freed convicts, Quest’s personal force of female mercenaries, and a lunatic steamman as their guide. She'll face the many lethal and often bizarre dangers of the Liongeli and the sabotage of a traitor on board. Worse, finding Camlantis might lead to the destruction of current human society....Hunt's last book in this series, The Court of Air, had amazing worldbuilding but mostly flat characters and somewhat lackluster plotting. I liked the worldbuilding enough that I decided to give him another chance with a book featuring mostly different characters taking place in the same world, thus The Kingdom Beyond the Waves.Initially, I found The Kingdom Beyond the Waves disappointing, as its characters didn't appeal much, the plotting didn't interest me, and the book didn't show as much of the world and society, but once everything starts to kick in I really needed to find out what happened next. The deeper the crew goes into the Liongeli, the stranger and more original the threats to them get, bringing in new aspects and areas to the worldbuilding I enjoyed in The Court of Air. The characters still don't do that much for me, but the plot makes up for it.Though I do have some quibbles about something that comes up again in this second Jackelian book. Jackels is Victorian England but with more extreme elements, steampunk, and magic. For all the pride Jackelians show when speaking of their country, a lot of Jackels' people face squalid Dickensian condition. Orphans are homeless or put to just about slavery in workhouses and whorehouses. Starvation and disease are common. Jackels still has a figurehead of royalty that gets his or her arms chopped off and then spends the rest of his or her life in captivity, occasionally getting brought out for the citizens to pelt with rotten garbage. Jackels breeds a \"royal\" line specifically for this purpose. Some people with unusual abilities are put in collars that will immediately kill them if they don't follow the government's orders. Jackels just looks better than the even worse countries around it.Yet every person who professes an interest in social justice and equality and speaks of decreasing poverty and cruelty is ineffectual at best and a sadistic mass-murdering psycho at worst, with the last being far more common. An entire country is ruled by the Commonshare, which takes the worst excesses and cruelties of Communism up to 11, and in the jungle the Daggish is a society of brainwiped people and animals under the absolute mind control of a single monarch, thus \"equal.\" So the books show the Jackelian way is better as it is and shouldn't be changed. It's not an unreliable narrator issue, because the actual events show that. It leaves a bit of a bad taste in my mouth and makes me wonder why Stephen Hunt has such a weird axe to grind.Still, I recommend The Kingdom Beyond the Waves, though the first hundred and something pages can be a bit of a slog at times."}, {"userName": "Vanessa", "userReviewDate": "Sep 13, 2010", "userURL": "http://www.goodreads.com/user/show/1932814-vanessa", "userReview": "Professor Amelia Harsh has lost her tenure at the last university in Jackals that would hire her (after being fired by the other seven...). Why? Because instead of studying and writing papers like a normal university professor, she's out hunting relics of Camlantis, which everyone knows is a myth. Enter Abraham Quest, the richest man in Jackals, who has been doing his own archaeology on the sly, and found proof that Camlantis exists. Unfortunately, the clues point the way into the heart of darkness itself, the source of the Shedarkshe river in the wilds of a jungle from which no explorer has returned. Camlantis was a utopia, with untold engineering feats, a society of pacifists, and Amelia and Abraham are convinced that it holds the key to making their own war-torn society a better place. But it means risking lives in order to see that goal realized. Hunt spends the first half of THE KINGDOM BEYOND THE WAVES setting up the story, and because there's a lot going on, several characters to introduce, and a world to build, the time it takes to do this isn't unreasonable. However, it does make the first half slow-going. His prose can be dense, which also slows down the pacing and flow, but does make for a richer world. I love Hunt's metaphors. He is truly clever with his descriptions, adding depth to the world at the same time. Finally at about the halfway mark everything goes wrong for our protagonists. And not just wrong, I mean horribly, how in the heck are they going to get out of this without dying, wrong. It's a series of life-threatening events that lasts the entire second half of the book. Hunt spins threads between all the characters deftly, so that when everything begins to collide, the weaving stories makes sense despite the chaos. Awesomeness on many levels. Set in an Earth that could have been, Hunt mixes machinery, magic, and a dizzying assortment of races with alacrity. There's the race of mechanical steammen, who, while they have no country to call their own, still have autonomy wherever they live. There's the amphibian craynarbians, which unfortunately don't get as much face-time as the others. Also, the flying lizard lashites, who turn out to play an important role. In a story like this the races could have been gimmicky, but the cultures of humans and non-humans alike were all integrated into the plot in satisfying ways. Hunt's steampunk world is ambitious, and while he does an excellent job of introducing it without overwhelming the reader, about 5% of the time I didn't remember or understand a name, race, or piece of equipment. On the whole for such a steep learning curve, only forgetting a small percentage is a petty complaint, and says a lot about the author's world-building, which is complex and fascinating. KINGDOM is Hunt's second book about this particular world, and while it isn't a sequel, I wonder how much more I would have retained if I had read the first. Trust me, I will go back to read THE COURT OF THE AIR. Even then, KINGDOM is readable as a standalone. Magic plays a secondary role to the mechanical, which made me sad because Hunt hints at interesting possibilities he simply doesn't have time to explain or explore. Also, while the pacing is consistent, the flow of action can be jarring, and sometimes I had to re-read a few paragraphs to grasp everything that happens when the action switches. The biggest problem I saw, which could be minor considering the other strengths of the novel, is that with such a large cast it is difficult for the main characters to have any real depth. While the characters have their interesting quirks and motivations, there's no question that for KINGDOM, it's the setting here that's on display--and what a vision it is."}, {"userName": "Phil Leader", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/28233323-phil-leader", "userReview": "Professor Amelia Harsh is a discredited academic, shunned by any university she could work for because of her obsession for the lost city of Camlantis which is dismissed by most as a myth. When all her other avenues dry up she grabs a lifeline from a rich industrialist to lead an expedition to find the last evidence of the city.Meanwhile, why is someone graverobbing obsolete steamman corpses from cemetaries? And why has Furnace-breath Nick - scourge of Quatershift - been asked to break a prisoner free?For those unfamiliar with Hunt's incredibly imaginative world - revealed in this book to likely be a far future version of our own which somehow mirrors certain aspects such as Victorian England and the French Revolution - would soon be at home in this book, particularly as half of the book involves a trip up a native-infested jungle river worthy of Conrad. Meanwhile the trail is being followed from the other end and the smoggy streets of Middlesteel in the country of Jackals by Furnace-breath Nick's not so mild mannered alter ego, Cornelius Fortune.The way the story unfolds is very reminiscent of Saturday morning serials that used to be popular when not everyone had a television. There are a series of episodes where our heroes are put into peril and yet somehow (mostly) break free. The difference is in the mostly. Hunt is not afraid of killing off a character and that keeps the reader on the edge of their seat and turning the pages to see if that really was the end or there is a miraculous escape on the cards.The inventiveness Hunt showed in The Court of the Air is very much still evident with a fiendish plot and fantastic ideas zinging off the page together with very clever dialog. Once again this is a book to read carefully and not to skim, it will be so much more rewarding.All in all this is a stronger book than the first and the characters in it are terrific, heroes and villains alike. There are still Deus Ex Machina escapes here and there but they are on the whole consistent with the world of Jackals.I would very much recommend this to anyone who likes their science fiction broad and heading to steam punk rather than space opera (although it's not really steam punk) and their adventure old-school swashbuckling. Terrific work."}, {"userName": "Jage", "userReviewDate": "Apr 15, 2011", "userURL": "http://www.goodreads.com/user/show/4801110-jage", "userReview": "I'm not sure why, but once I finished with the story I wasn't as satisfied as I thought I'd be. It has a solid story and multiple intertwining threads that seem pointless at first but they do all tie together. You can imagine the world clearly in your mind [well I could] and although things were a bit confusing when it comes to the smaller details I really liked that Artificial Intelligence had their own gods and city state and the like although the countries read more like cities to me then actual countries though that might have been because the action was so focused.However there was just something off about it. It took a bit too long to get to the plot, which I understand since the world building is fairly complex but at the same time there was nothing to really grab me, the most interesting bits for me were when I was trying to figure out what countries/areas each place mentioned was based on [I have London, France during the Revolution, the Amazon and Sparta] the plot itself was interesting but I think the multiple POVs ruined it for me. Yes, thy were needed to tie everything together but I didn't really connect with any of the characters and the 'main' character was frustrating to me. I didn't find her particularly likable and there were bits where I wished she'd get a good wallop so she'd use her education and think and consider why things might work out the way they were instead of just chasing fairy tales. One thing I will give this author, he's not scared to hurt his characters, although that might be because it's not as if you'll get emotionally attached to them enough to feel that they're hurting. On this same note, there were a few deaths that did annoy me, mainly because if they were going to go out, these were characters I expected to go out fighting and I felt cheated even if their deaths moved the plot along. Too much detail, too much telling and a brilliant world that gets lost through too many voices. I read this before I read the first book and I felt that the world was solid enough that I don't have to read the first one to understand what was going on. I will read the other two books in the series since it's a solid enough read and from the looks of other reviews it gets better//the first one was the best, lol, so I shall read and see."}], "description": "Professor Amelia Harsh is obsessed with finding the lost civilization of Camlantis, a legendary city from pre-history that is said to have conquered hunger, war, and disease with the creation of the perfect pacifist society. Without official funding, Amelia is forced to accept an offer of patronage from Abraham Quest, the man she blames for her father’s bankruptcy and suicide. She hates him, but he has something that Amelia desperately wants--evidence that proves that Camlantis existed and that the Camlantean ruins are buried under one of the sea-like lakes that dot the murderous jungles of Liongeli.Amelia will blackmail her old friend Commodore Black into ferrying her along a huge river on his ancient U-boat. With an untrusty crew of freed convicts, Quest’s force of fearsome female mercenaries on board, and a lunatic steamman acting as their guide, Amelia’s luck seems to be going from bad to worse. Her quest for the perfect society has a good chance of bringing her own world to the brink of destruction…", "title": "The Kingdom Beyond the Waves\n      \n          (Jackelian #2)", "url": "https://www.goodreads.com/book/show/2971026-the-kingdom-beyond-the-waves", "average": 3.74, "cover": "https://images.gr-assets.com/books/1352218134l/2971026.jpg", "reviews": 152, "authors": [{"url": "https://www.goodreads.com/author/show/435114.Stephen_Hunt", "name": "Stephen Hunt"}], "type": ["Adventure", "Science Fiction", "Science Fiction Fantasy", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/2971026-the-kingdom-beyond-the-waves", "http://www.goodreads.com/book/show/3279067-the-kingdom-beyond-the-waves", "http://www.goodreads.com/book/show/6330421-the-kingdom-beyond-the-waves", "http://www.goodreads.com/book/show/13334399-o-reino-mais-al-m-das-ondas", "http://www.goodreads.com/book/show/7063144-the-kingdom-beyond-the-waves", "http://www.goodreads.com/book/show/837197.The_Court_of_the_Air", "http://www.goodreads.com/book/show/5886162-the-rise-of-the-iron-moon", "http://www.goodreads.com/book/show/6881498-secrets-of-the-fire-sea", "http://www.goodreads.com/book/show/13027248-sliding-void", "http://www.goodreads.com/book/show/8515996-jack-cloudie"]}