{"ratings": 44, "userreviews": [{"userName": "Jean", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/23100707-jean", "userReview": "The book begins when ten-year-old John Quincy joins his father on assignment to France and then covers his entire life in some areas with either more or less detail. Cooper covers in-depth the period when John Quincy Adams was Secretary of State under President James Monroe. He details Adams’ authorship of the Monroe Doctrine and also his key role in the 1819 Adams-Onis Treaty in which the U.S. gained Florida as well as territory from the Rocky Mountains to the Pacific Ocean. Cooper analyzes the growing populism and political polarization that presaged Adams’ defeat by Andrew Jackson in the 1828 presidential election. Cooper then covers Adams’ distinguished career in Congress and his Supreme Court argument in the Amistad case. The book is well written and researched. Cooper wrote a balanced, well-sourced and highly readable book. The book does not break new ground but concentrates on Adams’ work prior to becoming president. Cooper also covers the Antimasons and the Whigs. He places Adams primarily in the time frame of the founding fathers and flows into the Antebellum period. Cooper provides insights into John Quincy’s strengths and weakness.Cooper wrote the award- winning biography of Jefferson Davis. I read this as an audiobook downloaded from Audible. The book is just over sixteen and a half hours. Richard Poe does a good job narrating the book. Poe is an actor and a prolific audiobook narrator."}, {"userName": "Mark", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/6678151-mark", "userReview": "It's not unreasonable to ask whether a new biography of John Quincy Adams is needed. In recent years Paul Nagel, Robert Remini, Harlow Giles Unger, Fred Kaplan, and James Traub have all published books that chronicle the life of America's sixth president, which raises the question of what William J. Cooper offers that is different from these other works. His answer is embodied in the book's title, as he sees Adams not as a figure of the antebellum-era politics in which he served but as more reflective of the generation of the \"founding fathers\" that preceded it. It's an interesting argument, and one that Cooper supports not just by detailing the commonalities between Adams's politics and those of his father's generation, but also by describing Adams's religious beliefs and enthusiasm for intellectual discovery, which are closer to the Enlightenment-era thinking of the Revolutionary generation than the more Romantic ideas that would characterize the 19th century.The sense of Adams as a man out of step with his times emerges over the course of Cooper’s book. Part of the reason for this was his upbringing, which was itinerant due to his accompanying his father on diplomatic missions during the American Revolution. Traveling through Europe exposed him more directly to Enlightenment ideals, and gave him the motivation to master several different languages. Such an education helps to explain why President Washington selected the 27-year-old Adams as minister to the Netherlands, as he brought to his job a level of knowledge that belied his youth. This was the start of a succession of diplomatic appointments over the next two decades, broken by a term in the United States Senate, and which culminated in eight years as Secretary of State.Cooper describes Adams’s early career and presidency in a fairly straightforward manner. It is when he gets to Adams’s post-presidential career in the House of Representatives, however, that his narrative hits its stride. This is understandable given Cooper’s background as an historian of the antebellum South, as he brings a different set of insights to Adams’s involvement in the political issues of the 1830s and 1840s than previous biographers. Foremost among them is Adams’s role in the debates over the “gag rule” over slavery in the House during that time, which Adams was at the forefront of the fight against. Cooper’s explanation of Adams’s relationship with the abolitionist movement during this period is a particular strength of this book, as is its role in his development of his nationwide celebrity. As Cooper demonstrates, even Southerners who opposed his championing of antislavery petitioning esteemed the elderly Adams as a living link to their legendary past, which contributed to the national mourning that greeted his death in 1848.Cooper’s approach makes for a valuable appreciation of Adams’s significance as both a politician and a national symbol. While concentrating on his political career comes at the coverage of his personal life – with his family absent from the text for pages at a time – this seems an accurate reflection of the life Adams lived, in which public service was always at the forefront. It makes for a book that is an excellent resource for anyone seeing to learn about Adams’s long and distinguished public career, as well as what it represented to a growing nation."}, {"userName": "Joe Stack", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/35348314-joe-stack", "userReview": "Having read this book, I now know more about John Quincy Adams then I had ever expected, and I’m glad I picked up this biography on a whim. This is a erudite but highly readable account of the life of John Quincy Adams. The author has an interesting premise, that Adams is a “lost Founding Father.” I’m not sure the author convinced me about that, but he did convincingly show the weakness of Adams’ presidency and how he and the public were out of step during his time as president. His years as president are a small part of the biography and, for me, the least interesting. His life before and after we’re the best and most thoroughly informative sections. Besides the political life of Adams, I think the author also provides a thorough coverage of his personal life and beliefs, particularly Adams’s lifelong study of the Bible and Christianity. I think time is well spent with this biography."}, {"userName": "Deb", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/5606654-deb", "userReview": "This is a great book for the person truly interested in politics! There is biographical info about John Quincy, his relationship with his parents and with his sons, and highlights about Louisa. But, this is not a biographical text; the title is appropriate, the transformation of American politics.I very much appreciated learning about early American diplomacy by John Quincy, our first diplomat (beyond our relations with England and England). And, about his role/development of many foreign and domestic policies...the Monroe Doctrine was his concept, his battle for the concept, and his authorship. John Quincy had prescient views, arguments, and life-long opinions about the horrors of slavery. He fought the good fights to limit slavery. Cooper gave excellent (best I've ever read) insight into Constitutions 3/5s rule, the Missouri Compromise, and many other important American historical decisions. I was never aware of the Adams-Onis Treaty... when James Quincy negotiated with Spain to expand the United States across the whole northern half of the continent, west of the Mississippi -- partly along the Sabine River.Cooper, the author, wrote clearly enough about the Federalists vs. the Republicans that I believe I finally have the differences in my head. He wrote about political strategies, like Federalists vs. Republicans, in context with very good examples from historic characters. I believe that the Cooper, the author, wrote very well and shared quotes to give insight into John Quincy's character...\"He was spoken of as honest and quite well informed. Yet his vehement opinions and rigid manners came to define his temperament.\" \"Too tenacious of his opinions.\""}, {"userName": "Mona", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/9504930-mona", "userReview": "TITLE: The Lost Founding Father: John Quincy Adams and the Transformation of American PoliticsWHY I CHOSE THIS BOOK: It is part of my US Presidents Reading ChallengeREIVEW: A long lived individual his life spanned pre-Revolutionary War to almost the Civil War. He was either witness to or direcdt participant in the events that shaped this country. This makes his life story interesting. Although he could be a bit of a ditherer making you want to shout at him, \"just make a decision and stick to it\". In this respecdt he was a bit like his father, John Adams. They both also made the mistake of keeping the previous administrations cabinet who then worked against him. Part of the reason some had issues with him being president was because they felt he stole the presidency which was a ridiculous charge. No one got a majority in the original election. The decision went to Congress. If promises were made that is the part of doing business. It is not as if the people had spoken with a majority and Congress picked someone differently. JQA certainly had lots of governmental experience prior to be president and afterwards. He was an interestiing guy I just think the writing was just okay."}, {"userName": "Chris Carson", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/21716342-chris-carson", "userReview": "Terrific storytelling, and a tour de force for raising John Quincy Adams into the ranks of Founding Fathers. Cooper’s achievement - encouraged by the widow of his mentor and acclaimed Lincoln historian David Herbert Donald - is nothing short of remarkable. JQA deserves the recognition of a truly amazing life well lived. When history reads like a really great novel, there can be no higher praise. Thanks to Mr Cooper for this enjoyable treat."}, {"userName": "Grindy Stone", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/16911558-grindy-stone", "userReview": "Dull, wooden attempt to make John Quincy Adams into something he wasn't, a \"lost Founding Father.\" A one-term president, part of a father-son presidential combo, a jack of all trades and master of none, JQA has more in common with George HW Bush than any Founding Father. I read Cooper's Jefferson Davis bio, which was pretty good, so I know that the fault doesn't lay with him. He just didn't have much to work with for this effort."}, {"userName": "David Britten", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/43922172-david-britten", "userReview": "Not just a well-written and interesting biography of a great patriot and last link to the founding fathers, but also an excellent window into the tearing apart of our young country by the evils of slavery, sectionalism and growing partisanship. You can literally feel this conflict brewing and gain a better understanding of the politics that even more so still divides us today, despite the end of slavery."}, {"userName": "Bill Taylor", "userReviewDate": "Jan 07, 2018", "userURL": "http://www.goodreads.com/user/show/41499503-bill-taylor", "userReview": "Written by a superb historian; recommend anything he has done. Brisk and informative narrative that immerses that reader in the life and times of JQA. You finish this sterling biography realizing that the younger Adams did his best public service, not in the White House, but in his careers before and after being president."}, {"userName": "Shane Castle", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/61649526-shane-castle", "userReview": "Review to come..."}, {"userName": "Nicholas Bobbitt", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/25349064-nicholas-bobbitt", "userReview": "I don't agree with his premise, but Cooper is a solid writer."}, {"userName": "Quincy Balius", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/43676073-quincy-balius", "userReview": "Great book! Drags a little at the end, but a good look at an incredible figure in US history."}, {"userName": "Annie Pasma", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/19455655-annie-pasma", "userReview": "This is an excellent look at a rather unknown president. It chronicles the times and politics of a very interesting man at a very interesting time in history."}], "description": "Why has John Quincy Adams been largely written out of American history when he is, in fact, our lost Founding Father?Overshadowed by both his brilliant father and the brash and bold Andrew Jackson, John Quincy Adams has long been dismissed as hyper-intellectual. Viciously assailed by Jackson and his populist mobs for being both slippery and effete, Adams nevertheless recovered from the malodorous 1828 presidential election to lead the nation as a lonely Massachusetts congressman in the fight against slavery. Now, award-winning historian William J. Cooper insightfully demonstrates that Adams should be considered our lost Founding Father, his moral and political vision the final link to the great visionaries who created our nation. With his heroic arguments in the Amistad trial forever memorialized, a fearless Adams stood strong against the Jacksonian tide, the Gag Rule, and the expansion of slavery that would send the nation hurtling into war. This game-changing biography reveals Adams to be one of the most battered but courageous and inspirational politicians in American history.", "title": "The Lost Founding Father: John Quincy Adams and the Transformation of American Politics", "url": "http://www.goodreads.com/book/show/35118050-the-lost-founding-father", "average": 4.07, "cover": "https://images.gr-assets.com/books/1494553739l/35118050.jpg", "reviews": 13, "authors": [{"url": "https://www.goodreads.com/author/show/1146577.William_J_Cooper_Jr_", "name": "William J. Cooper Jr."}], "type": ["History", "Biography", "Politics", "Nonfiction", "Politics"], "outlinks": ["http://www.goodreads.com/book/show/35118050-the-lost-founding-father", "http://www.goodreads.com/book/show/34069558-the-lost-founding-father", "http://www.goodreads.com/book/show/1863106.Jefferson_Davis_American", "http://www.goodreads.com/book/show/13330443-we-have-the-war-upon-us", "http://www.goodreads.com/book/show/768161.Liberty_and_Slavery", "http://www.goodreads.com/book/show/4033202-jefferson-davis-and-the-civil-war-era", "http://www.goodreads.com/book/show/3520040-the-south-and-the-politics-of-slavery-1828--1856"]}