{"ratings": 2091, "userreviews": [{"userName": "Jesse (JesseTheReader)", "userReviewDate": "Jul 09, 2015", "userURL": "http://www.goodreads.com/user/show/8114361-jesse-jessethereader", "userReview": "Courtney C. Stevens does it again with another fantastic book! I'll admit that it took time for me to get completely sucked in. The characters felt a bit meh to me at the beginning, but they grew on me towards the middle of the book. It also took awhile for the story to really take off, but once it did, it soared! I can't wait to see what Courtney C. Stevens has up her sleeve next."}, {"userName": "Aimee ♥ | Aimee, Always", "userReviewDate": "Feb 16, 2015", "userURL": "http://www.goodreads.com/user/show/5478965-aimee-aimee-always", "userReview": "I officially dub Courtney C. Stevens as \"The Queen of Hitting Me Right in the Feels.\" It's a mouthful, but it's totally appropriate. I'm not even exaggerating, guys--I've read both of her novels and they are both AMAZING and gorgeous and emotional and just deserve all the asdfghjkls your keyboard can possibly handle.There are just so many reasons why I want to push you all to read her latest book, The Lies About Truth. First and foremost, we have an incredibly lovable heroine. Sadie has scars, and with those scars come insecurities. Despite this, she still takes small steps to try and get back up, to be the better version of herself again. And she gets ALL THE BONUS POINTS for being one of the most respecting daughters in YA.Sadie's parents have a really strong presence in her life. All they really want is for their daughter to be happy. They're strict when they need to be, but they also understand her need for personal space, and time.Aside from parents, Sadie also has a support system in the form of the sweet, caring and loving Max. I mean it guys, he's the YA hero we're all dreaming to have in real life. He's supportive, adorable, and does his best to understand Sadie and to help her up. Their romance was just so cute, and not cheesy at all!So awesome family? Check. Awesome romance? Double check. How about the friendships, then?They are definitely present in this book as well. Sadie and her friends have their ups and downs--in a totally realistic manner, which I approve of--but they're still there, you know? They TRY really hard, and that's the most important thing in a friendship, right?The only reason I didn't give this book five stars was because of the actual plot. It isn't really all that unique, is it? I have a slight feeling this book won't be VERY memorable, unlike Courtney's debut. But execution was SPOT-ON.If you have a thing for emotional, beautiful, quiet YA a la Emmy & Oliver, do yourselves a favor and pick up a copy of The Lies About Truth!Deadly Darlings | The Social Potato | The Book Geek | Twitter | Instagram"}, {"userName": "Alienor ✘ French Frowner ✘", "userReviewDate": "Jun 26, 2015", "userURL": "http://www.goodreads.com/user/show/31461418-alienor-french-frowner", "userReview": "Actual rating : 3.5 stars \n\n\"Here's a secret. I want to matter. I want to be known. I want to be myself. I want you to write this day on a piece of paper and put it inside Big. And one day, when you open him, you'll read about me and think, 'God, that day with Trent was one of my favorite days ever.\"\n\n \nLIE\n : This novel was an instant favorite of mine. (hard) \nTRUTHS\n : a) There's nothing really original about this synopsis : a teenager overcoming grief, been there, done that. b) The first 30% bored me to death. Yet the multiple layers of this story drew me in little by little - email by email, flashback by flashback, envelope by envelope. The unraveling of all the little things we call our life, of all the little lies we use as a blanket protection every day gradually won me over. \nLIE\n : Sadie May is an easy character to relate to. \nTRUTHS\n : I'm not gonna lie, I spent most of the book feeling disconnected to the MC : not out of hate or from a lack of understanding on my part, but I couldn't shake off the unpleasant impression that I didn't really know her, and it took me a while to realize that the reason lay in the way her characterization was handled. Indeed throughout the novel Sadie is defined by her relationships with others (her parents, her friend, her ex, Max) rather than as an individual, and I had a hard time to connect with her at first. Yet if I can't say when I started to care, it did happen. She let me in and from that moment, I couldn't stop the flow of my emotions. \nLIE\n : The Lies About Truth is a fast-paced, feel good novel. \nTRUTHS\n : It captures perfectly how messy grief is. How appealing the numbness is. How closed-off our heart can be. I strongly believe that life sometimes offers us moments where there's no such thing as understanding. There's no such thing as selflessness. There's no such thing as empathy. There are blame and anger and despair. There are shame and guilt and confusion.Yet somehow, someday, our heart starts beating again, and it's so beautiful. \n\"Step one : Change happens. (The wreck.)Step two : Pretend the change doesn't exist. (What wreck?)Step three : get angry the other person can't be who they used to be. (You're a wreck.)Step four : Create change. (Wreck this.)I wish I could hate them and mean it\".\n \nLIE\n : Grief is a solitary process. \nTRUTHS\n : I'm not saying that introspection isn't needed, because it is, and Sadie understandingly goes through lonely phases. Yet the strength of this novel lies in the truthful way relationships are portrayed, without sugar-coating anything but always showing how support is important, whether from her parents or her friends : Family ties are rarely well-done in young adult, that's why I can't stress enough how much I appreciated the endearing relationship between Sadie and her parents. Moreover, friendship was pictured in a honest manner without hiding the pain and resentment, and I found it really refreshing. Gray, Trent, Max, Sonia, Gina... I cared for every one of them.\n\"It took millions of years for that ocean to beat rocks into sand.We're not that broken.\"\n \nLIE\n : Love heals all. \nTRUTHS\n : What bothers me in books that imply that we need a love-story to overtake a traumatic event is the fact that it considerably (and falsely) simplifies what is complex by essence : we humans beings. I can't accept a story in which sex heals everything and where some huge issues are dealt with by the mere presence of some man (and his big dick). This being said, I do believe that the love of someone can help, and that's why the romance between Max and Sadie moved me : no instalove, but a slow growth that we are unconventionally following backwards, mostly through the emails they sent each other the year before. It doesn't hurt that Max is supportive, sweet, and all kinds of adorable. \nForgiveness (n.) releasing the toxins of bitterness.\n ► The Lies About Truth is a very character driven novel that took its time in making me feel invested, but from the moment I started to care, it never wavered. For more of my reviews, please visit:"}, {"userName": "Maggie", "userReviewDate": "Aug 14, 2016", "userURL": "http://www.goodreads.com/user/show/51318038-maggie", "userReview": "❝Sometimes the journey to let someone love you is the journey to loving yourself.❞\nI had mixed feelings about this one and decided to stick with the rating of 3 stars. It started off well, knowing about the past of Sadie and how she got her scars, became sad, how she was looking back at the tragedy, and looking back at her past, missing her old friends and getting to have fun with them. But after reading a couple 100 pages or so, I was conflicted on my rating and thinking I wouldn't enjoy it as much as I expected to and wanted to. But even with that, contemporaries remain as my favorite and summer is coming to an end so I will say, this was one of those great summer reads because it felt like the main character was trying to live summer while she could've and not continued to be sad and not be surrounded by people, so I was glad the theme of this novel went with the present day at the moment.\nIf nothing changes, nothing changes. If you keep doing what you're doing, you're going to keep getting what you're getting. You want change, make some.\nThe Lies About Truth is about a teenage girl trying to run away from her past. Okay, sort of. After being scarred because of a car accident and losing one of her best friends, she's avoided her family and friends and has been trying to stay away from them. When she's trying to go back to something, a memory pops up and distracts her. She feels like being a distant person from everyone else is better for her and for everyone else. She doesn't want people to see her real face and body and is afraid of showing herself because of her scars. But even with that, Sadie challenges herself and even lives up to it at times, showing her arms and not bothering with wonders everywhere thinking someone will judge her because of who she is.She wears short sleeved shirts because her mother has encouraged her along with shorts, feeling a little less insecure about herself and feeling like she could make some impossibilities to possibilities. So that's what she does. Sadie makes a list where she challenges herself in completing them. Most are things she considers impossible. Some include: kissing a boy without flinching, forgiving her friends because of her past, going back to the Sadie she was before, and being less insecure about herself. The real list included: Wear a tank top in public, walk the line at graduation, forgive Gina and Gray, stop following and start leading, drive a car again, kiss someone without flinching, and visit the Fountain of Youth. After reading that list, this novel instantly reminded me of Love Letters to the Dead and Girl Against the Universe.In both of those stories, the main character is trying to get away from her past and trying to challenge herself by doing something she considered impossible because of the reason it happened.Sadie knows she will have to forgive her best friends, Gina and Gray, at some point after distancing herself for a while now. But because they can't completely understand her and are trying to persuade her a little too fast, there's still some hope in her and there's still one person who can understand Sadie: Trent's little brother, Max.Max is Trent's little brother and Trent was one of Sadie's best friends. He died due to a car crash, the reason for Sadie's scars. After not being able to move forward, Max returns from El Salvador. But he isn't the same Max Sadie knew. Well, he is in personality, but not in appearance. Sadie always thought of him as his brother, never really had \"feelings\" for him. But after seeing him at the airport and picking him up, she can't help but find him quite attractive. He's gotten taller, built some muscle, gained some pounds (in muscle) and can't felt feel attracted to him. I wouldn't call it insta love, since she didn't fall in love at the airport, just found him attractive. C'mon, we all do it.Reuniting with Max has helped Sadie move forward and accomplish her bucket list. Being the only person that can help her and understand her, not flinch and try to escape because of her scars and how different she looks. The problem is, he can't help Sadie with her whole list, since most of them include herself and making a decision of trying to accomplish it or not. But he sure can help her with one of them, and that is kissing a boy without flinching.\nMaybe forgiveness was giving the past less power to hurt me. Or even building new memories that were stronger than the painful ones.\nI tried by best to read as many contemporaries as I could before summer ended and school started, but there were so many other novels calling my name and those included fantasy, sci-fi, paranormal and romance elements. While I try my best to enjoy contemporaries even when it isn't summer, it isn't the easiest for. I always feel like I should read contemporaries for summer since it is summer and contemporaries are always short and quirky and cute and just fill my heart with happiness and joy and cheers. The Lies About Truth wasn't what I was fully looking forward to.I can't really say much, since I didn't hate a lot but didn't love a lot as well. The characters weren't annoying in any way. A lot of the things that happened felt real and realistic and I was able to understand Sadie and was able to understand her feelings through it all. I was glad she moved forward and didn't really blame herself for the loss and accident. She was able to find out the truth and even spill some truths out, but I was glad she was able to move along and go back to the life she had. She was able to forgive her friends and was able to forgive herself, accomplishing her challenging goals and know there wasn't a reason to give up.Max was sweet and nice and understandable. I completely laughed and loved how he went to the University of El Salvador because if you didn't know, I'm Salvadorian and knowing that small unknown country was mentioned in a book made me smile. I completely agreed with his encouragements and I was glad he was the kind of guy that missed Sadie and was glad he came back home to spend time with her. He wasn't one of those guys who blew off their friends because of a tragedy that happened with a family member and would blame the person, even if it was their fault or not. He was there for Sadie and was always able to be counted and trusted on. He didn't shy away from her scars and completely accepted her for who she was. He would compliment her in the sweetest and cutest ways possible and he just made her and me so happy. Yes me as well.Their relationship started off at a normal pace but didn't feel right at first. I was glad they got together and was rooting for them a little. I knew they wouldn't separate and boy I'm glad there was no love triangle. Thank you Courtney for creating a character that decided to move forward and not just think about her ex boyfriend or \"about to become boyfriend.\" Of course she chose Max and completely rejected and left Gray, but hey, girl had her reasons. She moved forward, like I said, and didn't go back for Gray. He wasn't there for her when she needed him the most, but was there for her when she didn't need anyone, not even Max. YES GIRL! I didn't understand her friendship with Gray but Courtney added some background information about them and what led to their awkwardness and \"I don't want to talk to you\" moments. Gray was an asshole at times, so I was glad Sadie blew him off and would constantly remind him about what happened. I guess he needed to be reminded. But in the end, I was glad they forgave each other along with Gina, Sadie's \"ex best friend\", and they were all able to get along, including with Max.The writing of this novel reminded me of Love Letters to the Dead and Girl Against the Universe as well. It's not short, quirky, and filled with \"eye rolling and laughable moments.\" It feels real and relatable, like in few contemporaries I've read. I really liked how Courtney was able to bring realistic elements into this because that is something I completely love from contemporaries. Maybe now that summer is ending and winter is coming up, I will read contemporaries like these, some that can feel realistic and not just some that deal with drama and romance. Oh and also, this didn't deal with drama, at all. There was none of it and I was glad of it! There were no \"I love him but I hate him\" or \"I can't make up my mind\" moments. The romance isn't a completely subject in this and it's not just about romance, but it's a kind of romance where the relationship is helping one another and is able to make the person move forward and not look back. It's those kind of contemporaries I love and make me so happy.\nNature, at its strongest, shaved off mountaintops or threw houses into the air, but it couldn't was away pain. Everything had limitations.\nI'm pretty sure my library has Courtney's other novels and if they do, I'm gonna see if I can check them out and read it. I literally have no idea what they are and I've seen them, but I haven't clicked on them and seen reviews or even read the synopsis. I should probably do that. Overall, this was a cute read and pretty fast. It's my last contemporary of summer 2016 since summer ends tomorrow and school starts but I was glad I was able to finish it and enjoy most of it."}, {"userName": "Chelsea ❤Peril Please❤ ", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/8422853-chelsea-peril-please", "userReview": "Peace hid from me this year, and I'd searched for it at Metal Pete's, in therapy sessions, in long runs on the beach, and hours of Star Time. I hadn't found it hiding among that dark, black sea of sparkles or anywhere else. But tonight, in the gentleness of my friend stretched out next to me, breathing in and out so rhythmically that he sounded like breaking waves, it felt within reach again.\n\nOkay so....I've been undeniably excited about another Courtney Stevens book coming out. After Faking Normal she became an instant favorite and I knew I would never pass up a book if she was the one who released it. I can't say this blurb intrigued me like it did all of my friends...but this was more of a 'I'm reading this because I am in love with this author always and forever' type of thing. And while I want to say I loved this new addition despite my earlier trepidation about the lack of connection with the blurb, I just...didn't. And it makes me sad because there was so much that I did like about it. For one, I haven't really had the time or patience to be reading new books lately, and I was hoping this would pull me out of my stupor and new book reading hiatus. Alas, this was not the case. As always, her writing was beautiful and her male lead was over the top perfect-two things with which I find to be without flaw in each of of her novels-making this a page turner...even if the story wasn't as gripping as I'd hoped. That's not to say I didn't love the idea of the story (once I delved into it), but there was a matter of living in the past for most of the novel and while in some books I tend to love this if done correctly, most books I find it to be rather tedious. It just so happens this book fell in the latter category, and that makes me incredibly sad. And it's not so much the content of the story as much as how it's delivered. Flashbacks and old emails encompassed the story to lead the readers into her life and why she is the way she is and what makes her tick, helping us to grasp onto a circumvent view of the girl that is Sadie (Love that name, by the way). \nAnd I guess it's not even the flashbacks. I hate them, but I could have made it work. No, my biggest problem is the lack of...hmm....presence? The lack of presence when we were in her current state. I felt like most of the story relied on those flashbacks and old emails to pack emotional punch in the story and make us fall in love with the people they all used to be...and while I did find some enjoyment out of these moments, I was bored more often than not when we were in the 'now'. I think I noticed this about 40-50% in.But, like I said, I love this author and her writing so it pretty much evened out for enjoyment level. That being said....there was a certain boy named Max, who stole my heart. I don't think it's possible for Stevens to create a boy that doesn't break my soul and immediately cause me to pledge myself to him within a measly amount of numbered pages. \n\"Cassiopeia was a queen,\" I said. He took his eyes off the sky. \"Like you.\"\"Um, not exactly, Romeo, since she went around boasting about her unrivaled beauty.\"He laughed. \"That does sound like you, but...\" He turned back to the sky. \"You should boast about your beauty.\"\"Max.\" I didn't mean to sound so condescending, but it came out that way before I could correct my tone.\"I'm not joking.\"\n\nLoyal, sweet, kind, confident, and supportive, Max is everything Sadie needs in her life. She is in a shell and doesn't show any signs of leaving said shell, but Max is determined to bring her back to life again. He, too, was in the wreck that killed their friend and his brother, leaving him with a permanent loss of regular voice, causing excessive whispering and raspy speech tendencies...ummmmmm....Am I sick? Because....yum. Oops. My favorite thing in a guy paired with a Courtney Stevens character? Shoot me dead, because I have fallen. \nHe huffed.\"God, I'd like to kick Gray Garrison in the nads.\" He sat up and forced me to do the same. His hands cupped my face and he locked eyes with me. \"Look at me.\"We were inches apart. There was nowhere else to look. \"Your face is beautiful, but I'm not some shallow asshole who falls in love with a face. You hear me?\"That rasp in his voice was perfect. I braved an answer. \"Yes.\"\"Sadie, you could go through a million windows and nothing would change.\"\nSo, this book isn't without it's positives *cough* writing *cough* boy. But it definitely lacked the passion of Faking Normal. I fell so hard for FN and even want the hardback (DESPERATELY) for my bookshelf. But all I could think while reading this was how I couldn't wait to start a new book. And it's not fair because I am obsessed with Max and I loved everything to do with him. I got uncontrollable butterflies and could hardly breathe as they were falling in love....but that's not enough to make me \nlove a story\n. I need to fall for the substance, not just for the boy. And in this case, that's really all the book had going for it, for me. And OKAY FINE I'LL ADMIT IT: I. FELT. BAD. FOR GRAY. There. I SAID IT. I adore Max. He's the best....but still. I'm forever a bleeding heart.For more of my reviews, please visit:\n \n\n\n \n \n \n*********************UPDATE!! Buddy read with my crazy French Banana! (Aka Dark Pup) What an exciting new development!*****AGHHHH This author \nROCKS\n. If you haven't read Faking Normal, you MUST. Don't let me down Courtney!!!EEPS SO EXCITED"}, {"userName": "Sarah", "userReviewDate": "Mar 12, 2015", "userURL": "http://www.goodreads.com/user/show/7591340-sarah", "userReview": "(Source: I received a digital copy of this book for free on a read-to-review basis. Thanks to HarperCollins and Edelweiss.)\n“Mom said when a person dies, you don’t get over it by forgetting; you get through it by remembering.”\nThis was a YA contemporary story about a girl who lost her best friend and her life as she knew it in a car accident.I felt quite sorry for Sadie in this story, but I also wanted her to move on and change. The way she was so hung up on her scars seemed a bit superficial compared to everything that she had gone through, and I wanted her to stop focusing on her scars, and start focusing on her life.\n“I missed Trent like I missed the person I used to be. Makeup covered parts of the my, scars, but nothing covered up grief.”\nI liked the mystery over what had happened, and who was sending Sadie the notes stolen from her sort-of diary, although I guessed pretty early on who the culprit was. There were a couple of twists in the story that I didn’t see coming though, which made up for the slow pace a little bit.\n“Everyone out there knew about Trent, knew I’d gone through the window of his Yaris, knew why Gray and I broke up. They probably assumed I blamed Gina and Gray for more than cheating.”\nThere was some romance in this, although not a lot. I didn’t really feel anything for Max though.\n“A kiss can be a kiss or it can be an event.I have cared about Max McCall all my life.”\nThe ending to this was fairly happy, and tied things up pretty well, the story was just missing a special something for me though.7 out of 10."}, {"userName": "Fafa's Book Corner", "userReviewDate": "Dec 31, 2015", "userURL": "http://www.goodreads.com/user/show/7366569-fafa-s-book-corner", "userReview": "Review posted on Fafa's Book Corner !Beware spoilers ahead!I had heard about this book through Twitter. There was a giveaway going on and I entered. Now I didn't win the giveaway but this book was always in the back of my mind. After reading several reviews I decided to buy it. I am happy to say that I enjoyed it!The book begins with Sadie walking to the beach. Going to the beach in shorts is apart of Sadie's list of goals that she made with her therapist Fletcher. So far she's managed to do it until she sees whose on the beach. Gina who is her former best friend calls her over. Seeing no other choice Sadie follows suite and the two talk. Their conversation goes as it normally does. Gina tries to get Sadie to keep in touch, she apologizes profusely, and assures her that Gray (Sadie's ex boyfriend) and her aren't dating.Gray joins the conversation and it just goes south from there. He can't look Sadie in the eye. She has a few scars from the accident and he simply cannot bear to look at her because it reminds him of their best friend dying. Sadie takes that as her cue to leave. Once her old friends are out of sight she writes in the sand her goal list. Then she jogs back home.At home her mother gives her a letter that came for her in the mail. Noticing Sadie's expression she asks what happened. Sadie tells her that she ran into Gray and Gina and that it didn't really go well. Her mother then mentions that she was talking with Sadie's dad and they have decided to put Sadie back in school in the fall. She further explains that they found homeschooling necessary because of the therapy sessions and surgery. But now Sadie is better and should go back to school. Sadie argues but her mother points out that Sadie isn't happy at home and that she can't spend the rest of her life avoiding people.Sadie says that she'll think about it and her mother leaves. She decides to open the letter. It has no return address just her name typed up. Once she has it open she is shocked at what she reads. It was something she wrote years ago. Sadie has this blue ostrich toy. Trent had won it for her and they named it Big. Her mother then pointed out to her that there was a hole in the bottom of the toy. Trent then suggested that Sadie put papers in Big. Much to Sadie's surprise the words on the letter are one of the papers she put in Big years ago.Sadie thinks that her parents are behind this and confronts them. It becomes obvious that her parents aren't behind it. Her father brings up going to school again and Sadie storms off to her bedroom. She immediately checks Big for the paper and finds it. Sadie doesn't have any idea who is doing this and how the person even got the paper, but she intends to find out.I honestly did not expect to enjoy this book! When I started reading it I thought that I rate it 3 stars. But as I continued to read on I found myself enjoying it immensely! The book is written in first person all in Sadie's point of view. There are letters, emails and flashbacks that come in this book.A year prior to The Lies About Truth Sadie, Max, Gina, Trent, and Gray were in a car crash. Trent was killed. Sadie who had forgotten to put her seat belt on went flying out of the window. Sadie has some scars on her and she went through several surgeries to look somewhat the same. Max's vocal chords are not what they used to be. He has a hard time speaking and it usually comes out as horse. While Gina and Gray didn't have physical injuries they were scarred as well.Max's family moved to El Salvador for a year (his family comes back in the beginning of the book). Sadie stopped keeping with Gina and Gray. After she saw Gray (her boyfriend at the time) kiss Gina. Sadie kept up with Max through emails. Sadie pretty much stopped getting out of her house. She's very conscious about her scars and she now has social anxiety. So she can't be in a crowd. Sadie's parent decide to put Sadie through a Social Experiment. To get her ready for school. At first Sadie does not want to participate but it becomes very obvious that she has no choice and decides to go along with it.I liked how the author showed the readers the aftermath of the car crash. It's true that there isn't only injuries especially if you lose a loved one. The grief was messy and dealt with very well. I understood Sadie's need to forgive Gina and Gray but at the same time she couldn't bring herself to do it. It was realistic. The relationship between all four of them was also dealt with well. There were a lot of Before and After's which was to be expected.I liked reading about Max and Sadie. They had a nice relationship and it was sweet to see it unfold with the emails. I also liked reading about Sadie and her parents. They were an amazing support system! I also liked reading about her therapist Fletcher and the goals she set for herself. A lot of the people Sadie met were nice and supportive. This is probably one of the most realistic contemporaries I have ever read.I liked how there was a strong focus on forgiveness and finding the strength to move on. The flashbacks were also sweet. You saw what all the characters were like before the accident including Trent. The mystery aspect wasn't that great. But it didn't bother me and I understood why the person did not. What is nice about this book is that I got to relax and turn off my brain and just enjoyed the ride. I also liked how everything came to a full circle at the end. I did have one problem with The Lies About Truth. I couldn't relate to the characters. I felt that they were defined by their lies, regrets, and mistakes. Sadie was defined by the relationships she had with the people around her. I didn't know any one of the characters. I honestly thought that because of this I wouldn't rate it higher than 3 stars. But much to my surprise the plot sneaked up on me. I'm not sure when this happened but it did.Note this is a really slow contemporary. This didn't bother me but it might bother some readers. It takes a very long time for anything to really happen. Including the mystery with the letters. It also deals with a lot of grief so if you don't like that I would skip this book.Overall this was a fun ride. I recommend it to fans of contemporary and people who like reading books dealing with grief."}, {"userName": "Tink Magoo is bad at reviews", "userReviewDate": "May 02, 2016", "userURL": "http://www.goodreads.com/user/show/38603325-tink-magoo-is-bad-at-reviews", "userReview": "It's no secret I avoid books that are likely to upset me - I simply don't like being upset. My eyes get all puffy, my face turns red, there's snot. Getting upset makes me angry. This book achieved all those things and I regret none of them. While I expected a slightly fluffy romance, what I actually got was a beautiful tale of forgiveness and hope. I can agree with the reviews that thought the pacing was slow, but for me, it fit the story and characters journeys perfectly. There are no over the top dramatics, this was just a story about losing someone you love, not knowing who to blame and the whole thing was executed perfectly.A few times I thought it was heading down a predictable route, only to be surprised when it didn't. And for a change, this shows some solid, supportive relationships not only between parent and child, but with friends and with people who have experienced similar things and understand how hard it is to accept and live.Loved it"}, {"userName": "aria [dear darling reader]", "userReviewDate": "Aug 26, 2015", "userURL": "http://www.goodreads.com/user/show/5769334-aria-dear-darling-reader", "userReview": "RATING:    \nMANY THANKS TO HARPER TEEN FOR THE REVIEW COPY IN EXCHANGE FOR AN HONEST REVIEW\n\n\n\"Best friends, even former ones, were supposed to understand crap like social anxiety and scar exposure.\" \n\n\n\nFirst off let me just say that I liked this book. I liked the flow of the story and the characters. There were things here and there that made me wonder why anyone would ever do something like that. But overall, I really liked this book.The Lies About The Truth dealt with pain. All types of pain. The pain of not being able to tell everyone how you feel. The pain of going through something you think no one could understand. The pain of having to let go of the past. And lastly, the pain of not being able to do the things you have been able to do.\n\n\n\nWear a tank top in public. \n\n\nWalk the line at graduation \n\n\nForgive Gina and Gray \n\n\nStop following. Start leading. \n\n\nDrive a car again. \n\n\nKiss someone without flinching \n\n\nVisit the Fountain of Youth \n\nThese are things Sadie Kingston would like to do. But she puts them off everytime. Trying to make excuse on why she couldn't do it just yet.Almost a year ago, an accident happened that completely changed Sadie's life. It was an accident that killed her best friend Trent, damaged Max's voice, and left Sadie with physical scars she doesn't want anyone to see.The physical scars not the only scars she got that day. Emotional scars because of the death of Trent and a lot of guilt for surviving the crash while Trent hasn't.Sadie feels Max is the only one who could really understand how she feels. Max didn't shy away from looking at her even with the scars on her face. \nBut is she healed enough to start a real relationship with Max? Or does she have to face the past first before she could finally move forward.\n\nSadieI loved Sadie's character. I found her reaction to everything she went through was realistic. How she felt insecure. How she felt scrutinized every time she goes out. How her scars remind her every day that she lost not only her best friend, but also her confidence. It hadn't been easy for her to go out with big scars all over her body. She's been through a lot of surgeries to fix them, but the surgery could only do so much. And with all that, she wasn't some bitter, full of angst teen who always rant about how unlucky she was that this happened to her. She even named her scars. She named one Mississipi and I forgot the other ones. But she also have one named Pink Floyd. So cute.Going back, I felt Sadie's struggle. I understood her fear of going out. Being seen by people and when they see her ask themselves , \"what the fuck happened to that girl's face?\". She didn't like to be pitied. That's why she tried to avoid everyone as much as she can. But she tries. She tries to make herself better. She doesn't roll her eyes and scream at her parents for wanting her to feel better about herself. She accepts the suggestions and try to do it. She tries to do them in baby steps. And I like that. Sometimes, moving on and letting go of stuff from the past is hard. But she's so lucky she has a good family, good friends, and a good head on her shoulders.MaxMax was so cute. I liked him the first time he was introduced to the story. He was reliable and thoughtful and sweet. And everything I wanted him to be. Max is Trent's brother who was also close with her and their other friends. At first, I was worried about him, but as the story progressed I really liked how supportive he was of everything Sadie does. There was also a sense of possessiveness at times which was okay. It was cute.TrentHe was Sadie's best friend. He wasn't present in the story physically, but you get to know a lot about this guy. You see how his relationship is with his family, with Sadie, and with his self. Trent has secrets that I would not spoil because I did not expect it at all. His actions through Sadie's flashbacks were pointing me to a different scenario. I'm not going to spoil you but I love Trent just as much as Sadie.Secondary CharactersI'd like to say that I love each and every character on this book. Especially the parents of both Max and Sadie. They were so supportive and fun. They weren't disregarded in the story. They played an important role in the life of their kids and five thumbs up for that. I liked Gray and Gina too who were the other . All five of them has this sort of friendship that I really envy. I loved the dynamic that all of them had. You could feel the deep connection between these characters and I loved it.\nI was scared. There was a point in this book that I was worried that the story might be an entanglement of relationships. I'm so fucking glad that it wasn't. There was romance, but it isn't the main story. It was there, but when you read about it, you'll see that it isn't the main focus.I loved Max and Sadie. I knew they were meant to be together. I was worried for a bit that I would have liked someone else for Sadie, but no, Max is the man for me.Max and Sadie's relationship wasn't forced. It was built on friendship, trust, and love. I always love romances like that. There was no insta-love. Thank goodness! And it was realistic. The relationship that bossomed between these two was as realistic as they can get.\nIt was very easy to get to. This is my first Courtney C. Stevens and I really enjoyed her writing and the way she characterizes her characters. She really does well showing us how she builds the relationship with the characters. There were times that were a bit too slow for me, but I felt it was necessary for Sadie to realize the things that she needed to do. To realize that she needed to settle a few things before she could really move forward with her life.\n- I loved the theme of this book. It dealt with friendship, love, forgiveness, and letting go.- I loved Sadie's relationship with her parents. You'll constantly sense their presence in her life, even if it's just o the sideline. You'll feel how much they care about her and her well-being. There's not much of those type of parents in YA literature. Mostly, you will see a negligent parent or a parent who says love their kid but isn;t ever present.- The friendship. I love the friendship that these five had. Through ups and downs they were together. They did encounter hiccups along the way, but their friendship endured.- The characters were all well-rounded. No stock characters here.- The romance was a plus for me.- The writing was very good.- I liked the e-mail exchange between Max and Sadie. I thought it was a nice way of showing us what Max and Sadie's relationship was like when they weren't together.- I loved Trent. Seriously. He's dead (not a spoiler), but the way you got to know who he is and what he was like and the secrets he kept, made me love him. I just love him.\n- The pace was a bit off for me at times. I didn't like how sometimes, it seems to drag on some places. But this is just me.- These kids were all keeping something. The only valid one in my opinion was Sadie's and Trent's. I get the reason why Sadie couldn't tell Trent's secret because it wasn't her secret to tell, but the others were a bit weak. I didn't get why Gina and Gray would do the things they did. I don't buy their reason for not telling Sadie the truth. It was really stupid. They waited a year to tell her. Tsk tsk.\nAll in all, I really loved this book. I haven't touched a good contemporary book in a while so I was lucky I picked this one.\nThe Lies About Truth\n is a very well written book with a heartwarming story about a Girl who wants to let go of her past but is having a hard time to. I would highly recommend this book to anyone who loves a contemporary book about moving on and forgiveness that isn't too dramatic."}, {"userName": "Lily (Night Owl Book Cafe)", "userReviewDate": "Sep 08, 2015", "userURL": "http://www.goodreads.com/user/show/12907755-lily-night-owl-book-cafe", "userReview": "An emotionally charged story about lose, friendship and love. In that order. Sadie Kingston is a girl who survives a car accident that killed her best friend Trent, scarred her face, and damaged his brother’s Max voice. She is now living in the aftermath of the accident and is trying to deal with the deep painful feelings of loss, her boyfriend's betrayal and the fact that her face took quite a beating. Moving on isn’t easy for Sadie, but I respect her journey and her will and courage to do so. This book was not an easy read for me, especially with losing some family members in the past year. The circumstances might be different then the books, but the pain is no different. Me dealing with loss, I really don’t know how to and maybe this was why reading this book was kind of a milestone for me. Usually I tend to stay away from anything heavy or what would bring me into easy tears. I was happily surprised with this one, thought it was a difficult read, the main character was likable. Sadie went through a lot and although I have questioned some moments, like how is she taking this harder than Trent’s own family, her journey did feel somewhat realistic. Especially since she had to cope with the fact that her face will never be the same, she will carry those scars like battle marks of survival for the rest of her life and that is not easy.There was a bit of a love story laced into this, but it was not the main focus. The main focus was Sadie is trying to move on and put her life together closer to the anniversary of the death. Trying to forgive her best friend and her ex-boyfriend for what had happened and dealing with new information that had come out in light of everyone trying to move on.I did enjoy this book. I thought it was well written. The story was good. It made me want to know Trent and feel sorry that he was lost before the book started. He felt real, with Sadies memories bringing him up throughout the book, it made me feel kind of like I knew him and in the end, wish I knew him better. This review was originally posted on Night Owl Book Café"}, {"userName": "Sue (Hollywood News Source)", "userReviewDate": "Feb 12, 2015", "userURL": "http://www.goodreads.com/user/show/6511257-sue-hollywood-news-source", "userReview": "Once upon a time, there were four friends, two couples, who stopped being friends before they stopped being couples. Little questions niggled the back of their heads like splinters buried in the skin. Questions of trust and intention. Who loved whom the most? What if he wasn’t the best person for her? What if she wasn’t? No one talked about the questions, because talking ruined plausible deniability. Talking burst the bubble of innocence. Talking ended the happily ever after. These were the truths they believed. And they were lies. They should have talked while there was still something to say.Actual Rating: 3.8 starsThe Lies About Truth hit me at all the right spots, this book managed to occasionally teared me up. But I don't quite know how to rate this one. I'm conflicted. It is one of those books where you've read that kind of synopsis before, where most of the aspect and elements has been done countless of times by different authors with a whiff of something new to offer. In spite of these banal reasons, most readers are beginning to feel weary of. I will still recommend The Lies About Truth for people who are looking for books that tackled grieving, friendship, healthy family relationship and teenage love."}, {"userName": "Lala BooksandLala", "userReviewDate": "Mar 31, 2015", "userURL": "http://www.goodreads.com/user/show/31027440-lala-booksandlala", "userReview": "It was good, just didn't impress/shock/move me in any type of way. Will definitely pick up more from this author in the future."}, {"userName": "Clara  Cheng", "userReviewDate": "May 24, 2015", "userURL": "http://www.goodreads.com/user/show/4125080-clara-cheng", "userReview": "\"When a person dies, you don't get over it by forgetting; you get through it by remembering.\" I received an ARC of this book from HarperCollins via Edelweiss in exchange for an honest review.4.5 truthful stars.Affectionate. If I was only allowed to describe the book with one word after reading, this would be it - affectionate.This book was so beautifully written, so heartwarming that the smell of tears often lingered between the pages. It felt like I've walked through the stages of grieving, dealt the loss and even explored the possibility of \"what if\" with Sadie, Max, Gina and Gray.And then the realization painfully struck upon us, we don't have a time machine. But seeing them kept recalling the bits and pieces of their memories with Trent, suddenly I've started to miss him too. Those flashbacks and confessions were vividly described that they left me heartbroken at times. One of the things I really loved was the exchange of emails between Sadie and Max. It was creatively done and I liked to see how did their romance realistically flourished with the imperfections throughout the painful period.The story was not only about love, it was all about LOVE. If you understand what I mean. It was about family and friendship, the depiction of relationships and deep connection among the characters were brilliantly on point, thoroughly explored and balanced, especially the one between Sadie and Trent. Trust me, you'll love Trent more than Max, or maybe almost.Lastly I would like to add, because of the contented feeling that I'd experienced with the peaceful closure, this would probably be the most beautiful YA contemporary I've read this year, and Courtney C. Stevens's writing has captured my heart that I have no choice but to add her into my favorite authors list. “Happiness was getting stuck with someone and never feeling stuck.”"}, {"userName": "Pavlina Read more sleep less blog❤❤  ", "userReviewDate": "Apr 30, 2015", "userURL": "http://www.goodreads.com/user/show/6603203-pavlina-read-more-sleep-less-blog", "userReview": "ARC provided via edelweiss in exchange for an honest review"}, {"userName": "Jen Ryland", "userReviewDate": "Oct 25, 2015", "userURL": "http://www.goodreads.com/user/show/6497049-jen-ryland", "userReview": "A very moving book about grief and loss and forgiveness. A touch on the melodramatic side for my taste with all the secrets, but loved the writing, the family dynamics, and the emotion underlying the story. I was a bit confused about the ages of Sadie and Max. She's seventeen going on eighteen, so he's .... how old? (nvm - Danielle cleared this up for me - below). Read more of my reviews on YA Romantics or follow me on Bloglovin Thanks to Harper Teen for providing an advance copy for review!"}, {"userName": "Danielle (Love at First Page)", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/1312450-danielle-love-at-first-page", "userReview": "3.5-4 starsI didn't *love* this one, but the writing by Courtney Stevens is once again fantastic. I just wasn't crazy about some of the story lines. I wanted more Max and Trent and less Gray."}, {"userName": "Jasmine (Jasmine Pearl Reads)", "userReviewDate": "Mar 31, 2015", "userURL": "http://www.goodreads.com/user/show/26419076-jasmine-jasmine-pearl-reads", "userReview": "Book: The Lies About TruthAuthor: Courtney StevensFinished Reading: October 31, 2015 (Saturday - 12:19AM)*I would like to thank HARPER COLLINS INTERNATIONAL for sending me an ARC of this book. This doesn't affect nor influence my review.This review also appears on my blog.Do you know that feeling when you finished reading a book and you were like, “What did I just read? What the f*ck did just happen to my feelings?” I felt this right after I finished reading The Lies About Truth.I assure you that this novel will make you feel enthralled and will leave you astounded. Oh gosh. If you must know, I love novels about friendship. Whenever I browse for books, I always search for friendship-related novels. Romance is a plus point, but FRIENDSHIP is my thing. I just don’t get inspired by the characters, but I can also relate to them.Sadie. She survived a car accident. She got traumatized after that incident. She always had second thoughts if she’ll do this or that. Until she met Max….. She’s just unsure of what will happen in the future.Max. His brother, Trent, died in a car accident where Sadie survived. Max did his best to be with Sadie…..The thing that will really remind me about this book is the friendship circle. Sometimes, friends fight for each other. Sometimes, friends fight each other. Come on, there’s no such thing as a perfect friendship but it’ll all come down to this – true friendship will last forever. Sometimes, me and my friends have a misunderstanding but we’re still one (or at least I still consider them as my friends). Another fact, whenever you’re having a fight with your friend, there’s no way you can hold the feeling of being angry at him/her for a very long time. There will always come a point wherein one of you would give up and smile and say hi to the other person….. unless you have a stone-ish heart. I’m always like this. I always end up smiling at him/her because I really don’t want a fight. I don’t want to have harsh feelings for somebody.This was my first Stevens’ novel and let me just say that she NAILED it. She’s such an AMAZING author. I would like to read more from her. She and her book deserve 5 GLITTERING stars. No words can explain how I felt while I was reading her book. Gosh, it was SO good. I RECOMMEND this to EVERYONE!P.S. I also made a printable bookmark, just so you know. You can download it."}, {"userName": "Brittany (The Book Addict's Guide/Novelly Yours)", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/4471081-brittany-the-book-addict-s-guide-novelly-yours", "userReview": "Initial Impressions 10/22/15: 4.5 starsWell that was just beautiful, bittersweet, and so incredibly well done. I loved how the book was serious, deep, and emotional but still full of life and had some really delightful moments. THE LIES ABOUT THE TRUTH was incredibly well-rounded and really impressed me! The characters were just so real. Each one really came to life and they felt like genuine people and feelings. I can connect with characters and still not feel like they're real live people. Sadie was just such a well-developed character and the story of her, her family, and her friends really pulled me in. I absolutely adored her parents and it was so nice to see loving, supportive, PRESENT parents! I loved how the friendships were handled. Each friend was going through something very different and yet something very similar. I loved how relationships changed within their groups and everything felt like a really realistic transition. I also really appreciated how each conflict resolved because it was glorious to see people heal and really work past an issue without becoming enemies first. Not quite rating it a full five stars because I did have a lot of emotion poured into this as I was reading but it could have gone JUST a bit farther to really pull me in. Such a stellar book though! Really, so well done in every aspect. Full review originally posted HERE on The Book Addict's Guide 11/2/15: I had heard so many good things about THE LIES ABOUT TRUTH that I simply couldn’t wait for its release and I requested a copy from Harper Teen. The book fairies granted my wish and sent me a copy and let me tell you… the good things I heard? All true and then some! I started and finished this book in just a day because I couldn’t put it down! (Although I do regret that a teensy bit because I already miss the characters!)THE LIES ABOUT TRUTH is just so well done all around. From the characters to setting to plot to emotion — everything was incredibly realistic and really came across to me as a real story, almost surpassing that feel of it being fiction. Aside from just connecting to the characters, I really got to know them inside and out, feel their grief and their joy, and every reaction just really felt so genuine. I was so impressed with the character development that Courtney C. Stevens was able to include in this book! I absolutely loved Sadie. Even though I haven’t been through nearly anything like what she did, I saw pieces of myself in her and I just felt like I really got to know her so well throughout the book. She was so realistic to me and I felt like she could have been one of my friends and not just a character in a book, which is something that rarely happens to me.I also adored Sadie’s parents. Any avid reader of young adult will tell you that too often parents are absent in some way (it does amp up a story when putting a teen into that leadership or life-changing role) but it was so, so refreshing to see loving, caring, and present parents. Sadie’s mom was truly amazing and I loved the relationship she had with her mom. She didn’t seem as close to her dad but they were both really awesome parents and incredibly supportive as she went through this terrible grieving process for her friend and the way she used to look.I didn’t connect to some of Sadie’s friends as much but it was so great to see how their friendships devolved, changed, and then evolved all over again throughout the course of the story. There’s such a tension between them after “The Wreck” and it was really great to see these characters go through the stages of working on their friendships as they try to figure out how to work on themselves and find that inner-peace again. I also really appreciated how they experienced this massive, life-changing event and it really did change their lives in the sense that no one was really the same once the book was done. Everyone was still true to themselves and they managed to really work on who they became after this incident but they also really did change and took on new roles even in their own friend groups. It was so refreshing to see that exponential change in the characters and really witness them move forward. A mantra that Sadie kept repeating throughout the book was something like “I do not have a time machine” and I loved how the book really carried this mantra all the way through to the end. The characters had to come to this true acceptance that they could never go back to the way things were and they really had to continue on towards the future, embracing who they are in the present day and who they will be once they’re able to move on from this.The emotion captured in this book was simply fabulous too. I laughed, cried, and everything in between with Sadie, and these characters really had some dynamic personalities. Courtney C. Stevens did an amazing job of allowing those feelings to flow naturally and really let her characters carry the story to the reader through their experiences. It really was like peeking into their lives and I felt very emotionally invested in them.THE LIES ABOUT TRUTH even had a few surprises and a small mystery! I’ll admit that a mystery always hooks me so the anticipation of figuring out that answer definitely kept me turning the pages in addition to my connection with the characters. There was even a small yet large surprise (I mean, it’s called THE LIES ABOUT TRUTH so naturally some lies are unearthed…) that I totally didn’t see coming in the book that really changed the course of the book for me for the better. When that little knowledge bomb was dropped on me, I became even more invested!This book was great from start to finish. It was an emotional roller coaster in the best possible way, but it really flowed so well, allowing me to really experience everything naturally as the characters did. (And emotional… water slide? Terrible metaphor, I know.) THE LIES ABOUT TRUTH was so refreshing with its wonderful characters, meaningful story, and true character growth. This is one of my favorite realistic fiction novels in a while and I’m so glad I didn’t wait to read this!"}, {"userName": "Kim at Divergent Gryffindor", "userReviewDate": "May 02, 2015", "userURL": "http://www.goodreads.com/user/show/10140696-kim-at-divergent-gryffindor", "userReview": "I may have been expecting something from this book because of how much I loved Faking Normal, but I don't know what that something is. While I am not really disappointed in this one because I feel like they're really different, I do like Faking Normal more than this one. \n7 THINGS I LOVED ABOUT THE BOOK:\n• The family aspect: Oh my gosh, the family aspect in this book is unbelievable! I love the relationship of Sadie's parents - it was clear that they loved each other very much and they have a great relationship! My favorite family aspect is how Sadie's mom can still scold and be firm with Sadie, while giving her all the support that she could get. I really felt uplifted by that and it just warmed my heart.\n\"From what I could tell, happiness was getting stuck with someone and never feeling stuck.\"\n• The friendship: The friendship in this book is so, so good. Granted, they weren't friends for most of the book - Sadie, Gray and Gina, I mean - but it portrayed how friends will always have ups and downs and challenges to face. The way that they made up, which took a lot of time, made it seem realistic to me. I also really enjoyed all the fun times that were portrayed of the four or five friends in this book. \n\"Where one goes, the other follows.\"\n• Sadie's relationship with her psychologist: In most teenage novels, the psychologists are the bad guys, the bitches, the uncaring bastards. In this book, Sadie actually appreciated her doctor and was really willing to let him help her, which I think really helped her case. It was also clear that Dr. Fletcher really cared about Sadie's progress and was really supportive throughout everything. \n\"Scars tell a story, but this week, you decide what that story's going to be.\"\n• The healing journey: I love how the healing process in the book was done gradually, instead of immediately. Also, I loved how Sadie actually did the healing on her own rather than relying on the love interest, Max. Granted, she had help from Max, but he wasn't at the core of it. I also loved the support that everyone has given her. As with the friendship, I think this one was really realistic too.\n\"Sometimes the journey to let someone love you is the journey to loving yourself.\"\n• The writing: Man, Courtney C. Stevens' writing can do no wrong! She fall in love with her words with Faking Normal, and she has done it again with The Lies About the Truth. I just love how she lets her stories unravel and she has really good choice in words, which creates lots of quotable quotes in her books.\n\"I missed Trent like I missed the person I used to be. Makeup covered parts of the my, scars, but nothing covered up grief.”\n• Max: My gosh, Max was so sweet in this book! He was the expert at pushing Sadie to reach her goals while not being pushy or obvious. I loved how he was always there without hovering, and how he just seems to know exactly what Sadie needs. Best of all, I think he is the most patient and most understanding love interest I've read. \n\"I think maybe everyone is a mystery. Even the people we know really well.\" \n• Metal Pete: My gosh, the friendship of this two is just so weird that I love it! Just imagine - a car parts owner and a teenage girl! I loved the dynamic of their friendship, and how much they understood each other without words having to come out. He was also really supportive, and I loved how Sadie could confide in him.\n\"Then, somehow, you have to accept that you're still here, and that maybe, just maybe, there's a reason. Find the reason.\"\n This book was an amazing journey for me to take part in, with really amazing character development. I was not able to connect with the characters as much as Faking Normal, but I loved watching how everything unraveled. I didn't feel like I was the main character in this book, but a spectator from afar, watching everything unfold."}, {"userName": "Alise  (Readers in Wonderland)", "userReviewDate": "Jun 25, 2015", "userURL": "http://www.goodreads.com/user/show/4152087-alise-readers-in-wonderland", "userReview": "FAKING NORMAL by the same author was one of my favorite reads of 2014 so I had high expectations for THE LIES ABOUT TRUTH. Stevens’ new release has its good elements, but it just didn’t stand out to me as extraordinary, especially when compared to her debut. \n“Maybe forgiveness was giving the past less power to hurt me. Or even building new memories that were stronger than the painful ones.”\nThis is an extremely character driven novel, but it does not have bad pacing. We spend so much time in Sadie’s head and while knowing her feelings about everything is good on one hand because we get to know her fully and completely, it’s hard to branch out and connect to the other characters.I think my main issue was just that-the other characters. None of them really stood out to me and most felt like they were just there. I never fully established a connection or cared about anyone else than the main character and even that was because I could relate to her thoughts and feelings.The strongest aspect of this book, to me, was the friend and family dynamics in this novel. No disappearing YA parents here! Sadie’s parents were supportive and present in her life, which was a great change to see. THE LIES ABOUT TRUTH portrays friendship and forgiveness realistically and authentically.\n“Sometimes a hand is an anchor. His held me to the world.”\nThe romance was close to perfect; it added to the story and was not an in-your-face thing. Max is so supportive and the two are great together. Their relationship was one of my favorite elements of the book.While I thought FAKING NORMAL was a more powerful read than THE LIES ABOUT TRUTH, this one is still a great book with an important message and it might just have you reminiscing about your own memories with old friends."}, {"userName": "nick ", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/2993271-nick", "userReview": "Beautiful!I loved Sadie's journey in overcoming her grief and her insecurities. I especially loved that her parents played a pivotal role in her healing. Her love interest, Max, was also the sweetest.Full review to come closer to release date."}, {"userName": "Linda ❤️ Sassy, Classy && a Little Bit of Nasty", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/14581722-linda-sassy-classy-a-little-bit-of-nasty", "userReview": "3.5 stars Cute little story. Review to come"}, {"userName": "Christy", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/4794494-christy", "userReview": "4.5 Stars!Hey, Courtney StevensHow do you do it? How do you write such honest characters that break my heart? This is the second book that I have read of yours and both of them are so real, so raw, and so touching. The Lies About Truth really caught me by surprise. I had a hunch that I would love it because I loved Faking Normal so much, but I didn’t expect to be so touched by these characters and their story.SadieIt was such an honor to get into Sadie’s head and to see where she was at after the accident and to see her come to terms with what happened and everything she lost was so moving. Sadie is such a strong person, definitely more so than she realizes and I loved being able to watch her grow and accept the life she has now and the person she has become.Max Is The Best He is so sweet and kind and he always seems to know exactly what Sadie needs, even when she doesn’t know herself. This is the epitome of what a good book boyfriend is and this is the type of guy that girls should be swooning over. I know I did <3Family and FriendsThe family and friend aspect in this book is by far one of the greatest that I have ever read. Sure, things start off a little rocky with Sadie, Max, Gina and Gray, but in the end they are always there for each other and that’s what matters. Sadie’s parents are so amazing and supportive and that is so rare to see in books so I really appreciated seeing such a great family and friend dynamic in this book.OverallThe Lies About Truth is a wonderful story of loss and life after loss. It’s about learning to move on in the face of tragedy, it’s about learning to forgive those around you and yourself. It’s about telling the truth even when it hurts to do so.The Lies About Truth is a story that touched my heart."}, {"userName": "Gisbelle", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/2149405-gisbelle", "userReview": "My thanks to \nHarperTeen\n--------------------------------------------------------------Point of View: Single (Sadie)Writing: First Person | Past TenseSetting: FloridaGenre: Young Adult | Realistic Fiction--------------------------------------------------------------This one is such a heartwarming book. I absolutely enjoyed every minute spent on reading it. I loved Courtney C. Stevens when I read Faking Normal, and now this book has made me love her even more.What's not to like when the book is about a girl surviving a car accident which has left behind scars on her body, her face and her soul. The storyline is seriously delicious with just the right amount of heartbreak.I've always found books that are not solely focusing on the romance interesting. Likewise, since this book is not entirely aiming on the gooey love story, I had a wonderful time reading it. The book focuses on not only the romance, but also on family and friends. I loved Sadie's family!The writing itself is top notch. I loved that the author revealing the whole story bit by bit in the smoothest, and the most flowing way possible. Learning about the past and witnessing Sadie's journey to find a peace of mind is a enjoyable experience."}, {"userName": "Emma Jones", "userReviewDate": "May 24, 2015", "userURL": "http://www.goodreads.com/user/show/28954704-emma-jones", "userReview": "Such a strong book on friendship, redemption and forgiveness. This book really made me think and that's one of the things I really liked about it. A really quick but gripping book."}, {"userName": "Shannon (It Starts At Midnight)", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/8652150-shannon-it-starts-at-midnight", "userReview": "This review was originally posted on It Starts at Midnight This book. Where do I even begin. I have been going back and forth between 4.5 and 5 stars. I really, really liked this one, as you can tell. Can I give it 4.75 stars? Because that is really what it is. Almost perfect. I just don't know if I can make the five star leap, though I will give it 5 on Goodreads and Amazon and such.  Anyway, I digress. Sadie and her entire close circle of friends and family have been in mourning over the car accident that killed Trent, and injured Sadie and Trent's brother Max. The emotions are palpable, of course, because this group has been friends quite literally forever. Their parents are friends with each other, and there's just a very deep connection among them all.And Sadie has scars. Lots of them, both external and internal, and she isn't dealing with any of them very well. She's shut out her friend Gina and e-boyfriend Gray. Really, the only relationships she has been bothering with at all are Max, Metal Pete at the scrapyard, and her parents. And yes, her therapist Fletcher, but that is kind of not of her own desire.I am going to try to break this into two parts: Inside Sadie and Outside Sadie. \nInside Sadie\nThis is the turmoil, despair, and self consciousness lurking within Sadie. This is her trying to somehow come to terms with Trent's death, with her own newly scarred appearance, her fears, and her new obstacles. It's such a gorgeous and heartbreaking journey, tears are welling just thinking about it. I think that no matter what, everyone will find some aspect of Sadie to relate to. We've all suffered loss, and fears, and self doubt. We've all had roadblocks and challenges and gut wrenching sadness. So even when Sadie does things that may be selfish, or immature, or even self deprecating, it's so plain to see the pain she's in. The thing is, she never gives up. She may take a step back, but she always tries to regain her ground, eventually. Sadie was both broken and brave, and so incredibly, imperfectly human.\nOutside Sadie\nAh, the relationships of Sadie. There are many, and they are all incredibly dynamic in nature.  Sadie's family. Sadie's mom... just wow. She was such a lovely, lovely character, and even though they are kind of all fictional, I was so glad that they had each other. Sadie's dad was a good guy too, but I fell in love with her mom. Also, notice we're talking about parents? Yeah, that is because they are a huge part of Sadie's live and her progress, which is how it should be! \n   Sadie's friends. Clearly there has been some disconnect between Sadie, Gina, and Gray. I won't spoil anything, because it is a complicated situation. But they are hurting too. Gina is Trent's ex-girlfriend, so she is in her own world of hurt, and Gray was his best friend, so again, hurting. But they try to get Sadie out of her own head even though they're having a rough time too. \n   Max. Ohh Max, where do I start with thee? I adored Max. He was just a good guy, plain and simple. A broken guy, after losing his brother, of course. His whole family, understably, was a mess, and took a year away. But they're back now, and have to learn how to live again with their loved ones as a family of three. I can't even imagine Max's pain, but he tries so hard to be there for Sadie, even though he is torn apart inside and out. We also get to see some of their feelings through a series of emails from Sadie to Max while he was away. \n   The others. You'll meet Metal Pete (so much love!) and Sadie's therapist, who she has a very realistically portrayed relationship with. I find this to be a huge win. \n   Trent. Yes, we get to know Trent quite a bit throughout this story, which I loved. It's rare that the deceased character has such personality in a story, but Trent does indeed. Through flashbacks, talks between the friends and families, and even Sadie's thoughts, we see so much of who Trent was. He wasn't perfect. He was wonderful, but not some canonized version of himself. They remembered his good qualities; they remembered his flaws. \n   \nBottom Line:\n Sometimes a book can really, really touch your heart, and this book touched mine. The characters seemed to jump off the page with their struggles, heartache, and ultimately their desire to live again. The Lies About Truth was a journey through and through: a journey of grief, of friendship, of love, but mostly of self. And it was far more beautiful than I could have expected."}, {"userName": "Bee {Quite the Novel Idea}", "userReviewDate": "Jun 12, 2015", "userURL": "http://www.goodreads.com/user/show/9639554-bee-quite-the-novel-idea", "userReview": "Istyria book blog ~ B's world of enchanted booksAt the end of 2013 I fell in love with Faking Normal and I knew I had to read any book written by this author because I knew it would be great. And then I got this one on Edelweiss and when I read it... I loved it even more than I thought I would. So. Many. Feels.The Lies About Truth tells the story of Sadie Kingston. A year ago she survived a horrible car accident that killed her friend Trent and left her face and body scarred. She can't seem to move forward and the one one that seems to understand her is Trent's brother, Max. When Max comes back home after being gone for so long, the past starts to surface again and Sadie has to face all the truths about the accident or be trapped in the past.Courtney makes me feel with her books. So very much. I felt for Sadie the moment I started reading. Part of that is great writing, of course. But it's more than that. It's the story, the characters, all of it combined. This story was so moving and uplifting. I was crying happy and sad tears at once when I finished this. It really is such a beautiful story. Needless to say this author has moved onto my author auto-buy list. I need to read everything from this author. I really do.The best thing about this book has to be the characters. I felt for every single one of them. From the main characters to her parents to her friends. I loved them all and I cared about them. I loved Sadie, she's such a strong character. She really is. I adored Max so very much. Their romance was very sweet and it didn't get in the way of the rest of the story, it actually helped it move along. Max is total book-boyfriend material. Seriously.The Lies About Truth is another beautiful, touching story by this author and I can't recommend it enough to fans of contemporary. I feel like this author deserves all the attention, so read this book. You won't regret it!\nThis review is also (or -soon- will be) posted on Istyria book blog."}, {"userName": "Nara", "userReviewDate": "Feb 16, 2015", "userURL": "http://www.goodreads.com/user/show/7087918-nara", "userReview": "Aaand with this book Courtney C. Stevens has landed herself a spot in my list of auto-buy authors. Congratulations, Courtney! You know what she's really good at?Characters.Characters that aren't one dimensional, no matter how minor they are. Characters who can recognise themselves as flawed but aren't able to take that step to change themselves. Characters who support others knowing that they're guilty. Characters that inspire, that embolden, that frustrate, that make you swoon.Characters.So the first character that needs to be talked about is our protagonist, Sadie Kingston. I have to admit, she's pretty frustrating at times. It's kind of like you're sitting there mentally willing her to be brave and have the confidence to do the things she used to do. Obviously that's easy to do as an observer, but it's interesting because she herself is also frustrated by how she's unable to make progress for a decent portion of the book. On the other hand, when she does take those small steps, you feel strangely proud of her and eagerly await what comes next. I also loved how her parents are very visible throughout the novel- very visible and very supportive. Too often, contemporary YAs forget that parents are often a big part of who people are.And of course we need to mention the love interest, Max. Gahhh, the nice ones always get me! Max is seriously adorable, and the way he's so supportive of Sadie is one of my favourite things about this book. I have to admit, often the thing that'll tip a contemporary over into \"incredible\" territory for me is the love interest. Sue me. I'm not going to say much more about Max so you can all meet him yourselves.Gina and Gray. Two characters who you blame along with Sadie from the beginning. But as the story unfolds, you realise there is more to their stories than what's been revealed to you, and you realise that each character is not good or evil. There is no \"them vs us\". All of the characters have their reasons for what they've done, and all of the characters have their reasons why they should be forgiven.Overall, if you're a fan of character-driven novels, I think you'll enjoy The Lies About Truth very much. While the story isn't the most original, all of the characters are wonderfully developed and the romance is pretty swoon-worthy. Definitely recommended.RatingsOverall: 9/10Plot: 4.5/5Romance: 5/5Writing: 5/5Characters: 5/5Cover: 4/5"}, {"userName": "Andi (Andi's ABCs)", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/4102218-andi-andi-s-abcs", "userReview": "That was fantastic. I loved Courtney's first book but this one I loved even more. What a great story of grief, live, loss and friendship. Read it guys! Review to come."}, {"userName": "Karima chermiti", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/42944800-karima-chermiti", "userReview": "Once upon a time, there were four friends, two couples, who stopped being friends before they stopped being couples. Little questions niggled the back of their heads like splinters buried in the skin. Questions of trust and intention. Who loved whom the most? What if he wasn’t the best person for her? What if she wasn’t?\n\n\nFull review now posted\n\n\nsome people are hard to understand and easy to love.\n\nThe lies about the truth managed to do things that no other book has done with me. It managed in an effortless way to change my opinions and feelings towards every character in a radical way that surprised me beyond imagination. I come so close to DNF it many times but then I fell in love with it completely and I was grateful that I didn’t listen to myself because I would’ve been deprived from reading this book that touched me in a deep genuine way and made me see things differently. \n\nForgiveness isn’t always returning to the old thing. Sometimes forgiveness is making an entirely new thing.\n\nI’ve read this book more than a month ago so I’m really hazy on the details but I remember all the important things that stood out for me while reading it. \n\nSharing a heart with someone isn’t a crowded thing when they understand you that well.\n\nThe story revolves around this group of four friends that are now fractured and broken because something happened that changed their lives forever: the death of a boy who as a friend for one, a confident for another, a big brother and a boyfriend and it’s not only the death that changed them forever, it’s the accident that scarred a girl for life making her insecure about herself and lonely in her sadness, it’s about a boy that lost his brother, his home and moved to a place he doesn’t love so his family may heal in peace, it’s about a boy feeling the guilt of what happened and a girl whose left with heartbreak and so many questions about the last thing that happened between her and her dead boyfriend. \n\nIt’s crazy. In the time we need each other most, we don’t seem to know what to do with each other.\n\nThe lies about the truth is about those truths we hide deep inside us for fear that we’ll hurt those we want to protect but we end up hurting them anyway, it’s about bottling all those words inside us never telling our friends what we think because we don’t want to lose them forever but we end up alone after all that.\n\nNo one talked about the questions, because talking ruined plausible deniability. Talking burst the bubble of innocence. Talking ended the happily ever after.These were the truths they believed.And they were lies.They should have talked while there was still something to say.\n\nIt’s a story about grief, guilt, love and the beautiful nature of letting go and moving on. It’s about coming to terms with the truth that we can hurt those we love the most and the people that we trust with our lives maybe the ones to break us. it’s about learning that there’s no good without the bad and if people are so worth it then to hell with all the lies that may save us and the perfection we seek and let’s embrace the truth no matter how bitter and overwhelming it can be.\n\nThe truth was finally a beautiful thing."}], "description": "Sadie Kingston, is a girl living in the aftermath. A year after surviving a car accident that killed her friend Trent and left her body and face scarred, she can’t move forward. The only person who seems to understand her is Trent’s brother, Max.As Sadie begins to fall for Max, she's unsure if she is truly healed enough to be with him — even if Max is able to look at her scars and not shy away. But when the truth about the accident and subsequent events comes to light, Sadie has to decide if she can embrace the future or if she'll always be trapped in the past.", "title": "The Lies About Truth", "url": "http://www.goodreads.com/book/show/24892774-the-lies-about-truth", "average": 3.88, "cover": "https://images.gr-assets.com/books/1423864847l/24892774.jpg", "reviews": 331, "authors": [{"url": "https://www.goodreads.com/author/show/6431805.Courtney_C_Stevens", "name": "Courtney C. Stevens"}], "type": ["Contemporary", "Young Adult", "Romance", "Realistic Fiction"], "outlinks": ["http://www.goodreads.com/book/show/24892774-the-lies-about-truth", "http://www.goodreads.com/book/show/29472220-the-lies-about-truth", "http://www.goodreads.com/book/show/24928294-the-lies-about-truth", "http://www.goodreads.com/book/show/15726915-faking-normal", "http://www.goodreads.com/book/show/33295690-dress-codes-for-small-towns", "http://www.goodreads.com/book/show/18209865-the-blue-haired-boy", "http://www.goodreads.com/book/show/38563591-four-three-two-one", "http://www.goodreads.com/book/show/28902446-welcome-home"]}