{"ratings": 14121, "userreviews": [{"userName": "Leila", "userReviewDate": "Jan 07, 2013", "userURL": "http://www.goodreads.com/user/show/15194189-leila", "userReview": "Wonderful story as always with all Brian Jacques's books."}, {"userName": "Josiah", "userReviewDate": "Sep 30, 2010", "userURL": "http://www.goodreads.com/user/show/1914201-josiah", "userReview": "\"It was a wondrous tale he had to tell...It was also very sad at times, but does not sadness mingle with joy, to make us grow fully into the creatures we are?\" —Abbess Germaine, The Legend of Luke, P. 373  I wasn't sure what to expect when I first picked up this book to read it. Would the plot be focused more on Luke the Warrior or his son Martin, who has become a legend to fans of the Redwall series all around the globe? Ultimately, I believe that The Legend of Luke is the best Redwall book since volume number eight, Outcast of Redwall. The tone of Luke's adventures carries the same bittersweet style and spirit as the first few odysseys that Brian Jacques put down on paper, leading us on an impossible to forget journey into a world of surprising new characters and dark, unexpected plot twists, a fantasy world that never delves so far into the surreal as to dull the emotional impact of its sharply poignant moments. At his best, Brian Jacques is a master of writing and creativity, and his books reflect a deep knowledge of the human experience and the kind of wisdom that can touch us all and transform our hearts. For anyone who loved the land of Mossflower as Martin the Warrior knew it, The Legend of Luke is an essential read. Being taken back once again to the time of Martin the Warrior is a gift that no lover of literature should pass up, well worth the time commitment required for a three hundred seventy-four page tome. Since the beginning of the Redwall series we have heard whispers about the immortal Luke the Warrior, casting teasing shadows of who this powerful warrior was and how the events of his life worked to make Martin into the great champion he would become. The Legend of Luke answers many of these questions, completely respecting the history that had come before it while introducing new ideas and characters whose identities will forever be etched in Redwall lore."}, {"userName": "Joseph Leskey", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/58147426-joseph-leskey", "userReview": "Somehow, I managed not to review this when I read it, but it was highly fine and of excellent quality and all that."}, {"userName": "Cole", "userReviewDate": "Nov 18, 2013", "userURL": "http://www.goodreads.com/user/show/24620371-cole", "userReview": "What I loved about this book is that the beginning is in the present then in the past. It really unearths some of the characters' personalities. It also helps understand how Martin feels."}, {"userName": "Anne L.", "userReviewDate": "Jan 22, 2012", "userURL": "http://www.goodreads.com/user/show/6424629-anne-l", "userReview": "The Legend of Luke is one book in the series A Tale from Redwall, in which all the characters are animals, with their own quirks, dialects, and interests. Redwall Abbey centers in most of the stories. An immense (for critters) edifice that houses dozens or more, it’s a place where anybeast (part of the series’ lingo: nobeast, everybeast, etc., just substitute “beast” where you normally would say “one” or “man”) can come to live in peace and harmony, working in the orchard or kitchens or with the dibbuns, the baby animals that sometimes seem to rule the roost. The stories are simple, involving great adventures, hardships, villans, and just plain fun, such as picnics in the orchards. There are good guys (mice, badgers, otters, shrews, and hedgehogs) and bad guys (rats, foxes, stoats, and toads). In this particular book, Martin the Warrior, a mouse of great renown and one of the founders of Redwall, searches for clues to the fate of his father, Luke, a great warrior of his own time. In the company of friends, he journeys north to discover why his father deserted him as a child and never returned. Not only Martin’s tale is told here, but also Luke’s. The books are cute, and would be best read a chapter at a time as a bedtime story to small children. Just be sure you’re up to tackling the oft-times difficult-to-read dialects of some of the species. I tended to skip over the poems and songs, which abound. My favorite part is when they’re dining on repasts that sound so enticing, I’m tempted to become a vegetarian. If you’re looking for something different, give one of the Tales of Redwall a try."}, {"userName": "Ross", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/5786320-ross", "userReview": "The Legend of Luke was written with the same high quality that we have come to expect from Brian Jacques and his Redwall series. Unlike his previous stories though, this novel lacked the same level of character connection that the others created between the characters and the reader.The story leading up to Martian finding his father's former comrades had some adventure, but nothing that we have not seen before from Martin and his loyal companion Gonff, including Gonff making a reprisal of his ability to out wit crabs.As for the tale of Luke's last adventure, I think the fact that we the reader knew that this was an account that was not currently taking place, that we lost the sense of being involved in the action.As for Martin's return trip to Redwall, he met up with old acquaintances and made a couple of new friends, but it all took place in a very quick, sum-it-up, kind of way.Overall the story wasn't the most engrossing of the first four novels (chronologically), but it was a very good story and has peaked my interest as to what will happen next now that Marten has laid down his sword."}, {"userName": "Jeff", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/1632997-jeff", "userReview": "I first red the book Redwall over 20 years ago. It brought back a love for reading which had been dormant for a few years. After that I would read each of Jacques' books, many just as soon as they came out. Later I moved on to other books and genres. I was given this book as a gift, and while grateful - because of the special place in my heart for Jacques and his tales, I was too busy reading \"more important\" pieces. Then I decided to take a little break, dust off \"The Legend of Luke\" and enjoy the tale. What a delight. While it is a little simplistic in the plot, it is filled with fun adventures, mixed with a little bit of Christian values.It nicely wraps up the tale of Martin the Warrior, a character who is central to Jacques stories. And while it might seem like a good way to end the Redwall chapter of my life, I now have a daughter and I hope that I will have many more chapters with her in the years to come.While there may be other books which are \"more important\", I have learned that books like Jacques' are a good cement to fill the cracks."}, {"userName": "Jennifer", "userReviewDate": "Sep 14, 2007", "userURL": "http://www.goodreads.com/user/show/91495-jennifer", "userReview": "The wonderous thing about reading Brian Jacques' writing is that it is so enchanting, you always want to return to it, in particular Redwall Abbey. Yes I have the audiobooks and I love how they have been dramatised, but reading the words created by Jacques is something altogether special.This book gives the final piece of background to the one character who appears in nearly all of the Redwall books, Martin the Warrior. The story is in toxicating and although you know that there cannot be a completely happy ending, Jacques' writes it in a way that makes you still think there is a chance complete happiness will be found. The Redwall books are truly brilliant books for readers of all ages, but particularly for younger readers as they grow up due to their portrayal of youngsters and the learning curves they go through.I will always love returning to the world of Redwall and it still saddens me to think there will be no more adventures coming from the imagination of Brian Jacques."}, {"userName": "Leona  Carstairs", "userReviewDate": "Dec 30, 2016", "userURL": "http://www.goodreads.com/user/show/63240900-leona-carstairs", "userReview": "This is a great book and I...um....eh....used to own it, but I gave it to my sister along with 9 other books in exchange of her really nice hardcover box set of Lord of the Rings."}, {"userName": "Jenny Clark", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/20647331-jenny-clark", "userReview": "This was a really good Redwall book. I like the ones that have Martin in them, because he is not just a warrior who fights and stands for good and has no personal issues, like a lot of the other protagonists. He has a history, and it comes back to him. He wants to know what happened to his father, he wants to know where he came from. He is a very dynamic character. The writing is great as always, very descriptive, especially the feast scenes. This is a good series to talk to young children after, about the difference between good and evil and how it is not always black and white. A really good action tale as well, with plenty of humor throughout as well."}, {"userName": "Meaghan", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/43189878-meaghan", "userReview": "4.5"}, {"userName": "Jonathan", "userReviewDate": "Sep 22, 2014", "userURL": "http://www.goodreads.com/user/show/35237701-jonathan", "userReview": "\"The Legand of Luke\" by Brian Jacques is is a story about a mouse Named Martain, who is like a person in this series, looking for his father. The main character Martain was level heade,\"wondrous indeed, Trimp, but you must always remember what a sword is really made for. It has only on purpose, to slay...\"(Jacques 22). Martain was aware that Trimp admired the sword as if it were holy and could do no evil. He was aware of the perpous of the sword and was reminding Trimp of that. Martain was kind, \" Karar isn't gone, Chugg, he's watching over us, even though we can't see him...\" ( Jacques 60)  \"The Legand of Luke\" by Brian Jacques was not my favorite book in the \"Redwall\" series. It was slow pasedit took almost a quorter of the book to get to the rising action. It was in eventful. It was just discrasful to the series. I did not enjoy \" The Legand of Luke\" by Brian Jacques."}, {"userName": "Joshua", "userReviewDate": "Jun 14, 2015", "userURL": "http://www.goodreads.com/user/show/43959974-joshua", "userReview": "Spoilers luke dies."}, {"userName": "Sam", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/70717467-sam", "userReview": "Sam Bequette1st period11/06/17The Legend of Luke, a fantasy novel by Brian Jacques, is a classic tale of heroism.\tThe book opens in a place called, Mossflower Country, where woodland creatures are in the process of creating a giant abbey for all to live. The main protagonist, Martin, is helping to construct the abbey when suddenly, for no apparent reason, he is hit with a wave of questions and longing for the home he had to leave when he was just a small child. With his faithful friend, Gnoff and Dinny, he sets out on a perilous adventure to go back to his homeland and find the father he never knew. They encounter many dangers on the way, until they reach the destination and hear the legend of Martin’s father, Luke the Legend.\tI liked this book a lot because the author did a really good job describing the setting in the book. Like on pg. 147 when it said ‘’The lush grass sprawled out before them, green for as far as the eye could see.’’ The setting was just so beautiful. \tAnother reason why I liked this book was the way the author kept you engaged. There was never really a boring point in the story, because just when you had had enough of the setting, something exciting happened. Like the characters would be chatting for awhile, then BOOM! A sword fight. That way, the author always kept the reader engaged.Although I did like this book, sometimes the story would get to predictable. I really felt the author could have incorporated more twists in the plot. There were only one or two times when I felt shocked, (And I’m NOT going to give an example because that would spoil the book.) and the rest of the time it was predictable.Also, I did not care for all of the gore and violence in this book. There were times when the characters would be in a battle and it would say something disgusting like. ‘’He watched as the arrow came down and buried itself in his arm.’’ (92)In conclusion, I really enjoyed this book and would recommend it to anyone who is looking for an exciting read."}, {"userName": "Wing Kee", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/25567578-wing-kee", "userReview": "I am biased so disregard this review. So much of my childhood has been spent here and therefore I can't really be objective here. World: The world is dense and fully lived in and magical. It's the most beautiful of forests and adventures are high stakes but not really. This time we travel to the north to learn the origins of Martin's father Luke. It's a tale of the high seas and it's beautifully described. Story: Follows the Redwall formula and doesn't really stray. Although the framing of the tale within a tale is present here to present both Martin and Luke's perspective. It's good. I do feel that there was enough time for us to get to know Martin's group but we switch to Luke's tale in the bulk of the middle so the love for the Martin group could have been better. Characters: Magical. It's simple, black and white and so descriptive. The new characters fun but also fall safely into the Redwall mold. Nothing out of place here. An adventure that fits snugly into the rest of Redwall. Onward to the next book!"}, {"userName": "Theresa", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/18403922-theresa", "userReview": "I love the Redwall books. Somehow, Brian Jacques takes warrior mice, goofy but gallant hares, rustic hedghogs and other creatures, combines them with adventures and terrific descriptions of food, and creates compelling stories. I'm not always a fan of anthropomorphized animals, but I find the Redwall series to be very enjoyable."}, {"userName": "Tez Cain", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/64614329-tez-cain", "userReview": "I loved this book. I've reread it a dozen times, it contains humour, sadness, excitement, battles and adventure. I was sad to finish this the first time as I was really enjoying the book and anxious to see how it ended, however I will keep rereading this book and keep an eye out for more of the Redwall books"}, {"userName": "Matthew McAndrew", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/74161705-matthew-mcandrew", "userReview": "Oh man, this one was good. I loved delving into the lore of Martin the Warrior's family, seeing his ancestors' past. There were a lot of unique ideas in this one, and I remember enjoying it so much I couldn't put it down."}, {"userName": "Masada", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/9881833-masada", "userReview": "My favourite Redwall book by far. What an enthralling and encompassing story and so many memorable characters! A story I'll think of fondly for a long time to come and happily rereard when I get the chance to! Thank you Mr. Jacques for your wonderful work."}, {"userName": "SophiaB", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/71707647-sophiab", "userReview": "This book was okay."}, {"userName": "Shira Bea", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/17901391-shira-bea", "userReview": "The ultimate sacrifice done by Martin the Warrior's father, Luke. At least there is some closure as to what happened to Luke, as Martin has been thinking about his father for a long time."}, {"userName": "Thomas Ray", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/57606295-thomas-ray", "userReview": "SO GOOD!!!!!"}, {"userName": "Emmaline", "userReviewDate": "May 16, 2017", "userURL": "http://www.goodreads.com/user/show/2232108-emmaline", "userReview": "This is my favorite of all the Redwall books. Anyone who says that this series is just for kids needs to read this story."}, {"userName": "Lauren ", "userReviewDate": "Dec 09, 2011", "userURL": "http://www.goodreads.com/user/show/7141908-lauren", "userReview": "The Legend of Luke is defiantly one of those one time favorites. You never ever want to read it again, but you absolutely enjoyed the legend of Redwall's famous Martin the Warrior's dad, Luke. In previous Redwall adventures there wasn't much information given on Luke, except that he was the long lost father of Martin. In this tale Martin decides to leave Redwall, accompanied by Trimp the Hedgehog, Dinny Foremole, and his best friend Gonff (who might I add considers himself the Prince of Mousethieves) on an expedition to uncover the mystery of what happened to his legendary father. As he listens to his father's saga, told by his father's very old mate Beau, he hears the tragic but heroic story that lives in his blood.Brian Jacques is one of my all time favorite fantasy authors. The Redwall series has so far been a pleasure to read, and The Legend of Luke is defiantly of the twelve I have read been the best. The main reason is how compelling the story. You know it's going to be a wild tale from the moment you know that Martin is going to go search for the mystery that is his father. Especially if you have read the previous Redwall tales containing Martin, you are dieing to know what his father was like. The moment Beau begins to recall the legend of Luke, you are wisped away into a world of cruelty and brutality, keeping you on the tip of you tail all the time. With each twist and plot, from the two hilled island where Luke is almost killed, to his final moments of crashing the Gorleech into the two giant rocks near what used to be his tribe's happy home, you are amazed at the quick thinking and courage it took to do the actions that Luke did.One thing that is so loveable about this book is that all the characters are creatures of variety. Usually with characters of people, looks come into matter, and you become the character, if not want to possibly be the character. In The Legend of Luke you stay separate, because you know you are not a mouse, stoat, hedgehog, or whatever other creatures you might come across. Your mind can focus on the brilliancy of the story, not the things that connect it to your life. The book stays the book, and you stay you. It's either simple psychology, or me just being weird, but the fact that the characters are animals helps me focus on the personality and the actions, instead of how I compare to them.The last thing I liked about this book was the end to Luke's legend. In the end he was captured and put into slavery by his mortal enemy Vilu Daskar, which is the one he has sworn to kill so he could avenge his slain wife, Sonia. He tricks Vilu into thinking he has treasure buried near his old home. Vilu then takes the ship back to Luke's former cave. When they get there, not even bothering to get off the ship, Luke sees that the rest of his tribe is gone, including his son, Martin. Knowing there is nothing left for him to even escape alive for, he creates the perfect plan to end Daskar and his band of vermin. He leads them to believe that there is treasure in the two tall rocks off the shore. The area around these pillars is dangerous, filled with sharks and other rocks that could rip the ship apart. Once Daskar realizes what Luke was doing, it was too late. Even after begging, the Gorleech is driven into the rocks, where it split in half, taking everyone, even Martin, down to the cold water of the North seas, never to be seen or heard from again. The only survivors were Beau, Luke's best friend Vurg, and Denno, who have stayed with the ship, living out the last of their days.If this review hasn't gotten you to want to read this novel, then I don't know what will. This story is a masterpiece only to be read once, for knowing the plot spoils it. Personally if I had the choice (and this I wish I could do with some other books...i.e. The Nanny) I would have the memory erased, so I could feel the suspense and horrific but sometimes splendid action that happens through four and eight ninths of ever five pages of this novel. This truly is the legend of Luke."}, {"userName": "Alex S.", "userReviewDate": "Sep 23, 2010", "userURL": "http://www.goodreads.com/user/show/4293206-alex-s", "userReview": "The book begins during the construction of Redwall Abbey, when a roving hedgehog named Trimp visits the abbey and sings a song to help the workers lifting a beam. Martin the Warrior recognizes his father, Luke the Warrior, mentioned in the lyrics and asks Trimp more about him. He decides to go on a quest to learn more about his father. Martin, Gonff the Mousethief, Dinny, and Trimp befriend an orphaned woodlander squirrel named Chugger, the bird Krar Woodwatcher, as well as two brother otters, Folgrim (who is very close to becoming feral, having filed his teeth to points, and even eating vermin after he kills them) and his older brother Tungro. When they reach the northlands, Martin meets his father's friends: the old mouse, Vurg and Beauclair Fethringsol Cosfortingham, an exuberant old hare, who show him a book titled In the Wake of the Red Ship, an account of Luke's life.US cover of The Legend of LukeThe plot then flashes back to Martin's birth to Luke and Sayna. Luke was the leader of a tribe of mice who lived an idyllic life for many seasons until Vilu Daskar, the murderous captain of the pirate ship Goreleech, attacked the settlement and killed Sayna, as well as many others with his Sea Rogues. Luke vowed revenge upon Daskar and soon had an opportunity when Reynard Chopsnout, master of the Greenhawk, sailed in, hoping to fix his broken vessel: Luke and his tribe slew Chopsnout and his crew and captured the ship. Together with Vurg, Beau, and others, they sailed off. Martin, now older, wished to accompany his father, but Luke declined, giving Martin his sword, and the chance to name the ship, which he dubbed Sayna.The account of Lukes' life contains the scene where Luke gives his sword to his son. The same scene occurs in the beginning of Martin The Warrior, when Martin receives a flashback of his childhood, as he was captured and put out for the seagulls by Badrang the Tyrant. Therefore, the events in the Second Book occurred around the same time as Martin The Warrior.At one point, Beau was believed to be dead, but survived. Luke, however, was captured and forced into slavery by Daskar when the Sayna was destroyed. He befriended a black squirrel, Ranguvar Foeseeker, who also wanted her revenge. Luke is quite a bit like his son. For instance, he threatened to strangle the slavedriver, whereas Martin tried to choke a Marshank hordebeast with the creature's own whip. Luke was able to convince Daskar of a hidden treasure that only the mouse could steer to. Vurg and Beau sneaked aboard to free the slaves as Ranguvar and Luke killed foebeasts. Initially planning to run the ship aground where his tribe could join the fight to take the ship, upon realising his tribe had abandoned the area, Luke ordered the slaves to take the ship,trapped Daskar at one end of the ship, then smashed it against two rocks, breaking it. The ship's stern sinks instantly and Luke, Ranguvar, Daskar, and much of the vermin crew upon it were drowned. The bow becomes stuck between the two rocks and the surviving vermin are massacred by the liberated slaves.Beau and Vurg presented Martin with a tapestry of his ancestor, which would eventually be expanded into one of the mouse himself. They returned to Redwall, and Martin allegedly chose to put down his sword and live a life of peace."}, {"userName": "Jeremy Gallen", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/35009294-jeremy-gallen", "userReview": "This Redwall prequel opens with Trimp the hedgemaid wandering the woodlands of Mossflower Country, when she meets two older hedgehogs from Redwall Abbey, Ferdy and Coggs. She goes to the Abbey where Martin, son of Luke, lives, depressed and yearning to return to the place he was born. Thus, Martin embarks with Trimp, Gonff the Prince of Mousethieves, and Dinny Foremole, first visiting a camp belonging to vermin known as the Flitchaye. Here, they rescue a squirrel Dibbin (basically, a very young inhabitant of the Redwall universe), from captivity, the youngling named Chugger.The travelers meet others such as Beau the hare, traveling on the vessel Honeysuckle, before coming to a place known as the Arfship, part of a larger ship lodged between a cliff’s sides. Here, Vurg the mouse, an old friend of Luke, tells Martin the tale of his legendary father, which occurs chronologically after Lord Brocktree but before Martin the Warrior. Luke eventually comes into conflict with a pirate stoat named Vilu Daskar, who commands the large vessel Goreleech, Luke himself ultimately commandeering a clipper of his own he names the Sayna, after his beloved wife. The second portion of The Legend of Luke ends with the eponymous character’s capture into slavery and slave rebellion, with the third part detailing Martin’s return journey to Redwall Abbey, in the book’s time still in construction, after hearing about his patriarch. Overall, this is another enjoyable Redwall tale, although as with its predecessors and successors both chronologically and in publication order, it adopts a black-and-white stance on the nature of specific animals, species such as mice, otters, and squirrels inherently good, and others such as foxes, stoats, and rats inherently bad. Even so, younger audiences are sure to appreciate this yarn."}, {"userName": "Elizabeth", "userReviewDate": "Jun 07, 2014", "userURL": "http://www.goodreads.com/user/show/31967709-elizabeth", "userReview": "The Legend of Luke contains a unique format for Redwall: the story-within-a-story. The first and third parts are about Martin first traveling towards and then returning from the northern caves. The second part is Luke’s story, and what it shows above all is that Jacques was certainly capable of compacting a story when he wanted to. “In the Wake of the Red Ship,” as the characters call the tale, is essentially a novella, and it is probably the most concise story in all of Redwall. In fact, it makes the long, rambling journey of Martin, especially afterwards, seem boring and uneventful in comparison. I’ve always wondered why Jacques cuts out the return trip of the heroes in his books, and now I know why: after the meat of the story, such a long denouement is a bit…boring.I love the character of Folgrim. There have been “gray” bad guys in Redwall before, but Folgrim is maybe the closest we’ll get to a “gray” good guy, unless I’m mistaken. I’ve always liked otter characters and Folgrim is an especially interesting one. It’s always the unusual, abnormal quirky characters that are the most enticing in Redwall, it seems.As much as I thought Martin’s journey was really flat compared to the fast-pace of Luke’s story, I did think that the dynamic between the characters was great—-especially because there were so many on the journey. But Martin and Co. all sounded like old friends, and they interacted like old friends, and despite the large amount of people, nobody was lost in the mix. This might have been the best group dynamic in Redwall so far, even.But like I mentioned, Martin’s journey, especially the one back to Redwall, seems incredibly dim next to the bright and shining awesomeness of Luke’s. It’s nice to see his reaction to finally knowing what happened to his father, but the adventures he has are rather generic and almost take away from his introspections.Overall,“In the Wake of the Red Ship” is pretty brilliant, Redwall-wise. The other two parts are interesting, with a really good group dynamic and some interesting characters, but they unfortunately pale in comparison to the middle part. If only Jacques wrote every Redwall book like he wrote Luke’s story, because the theme for Redwall seems to be the more concise the plot of a Redwall tale is, the better the Redwall tale is."}, {"userName": "Jason", "userReviewDate": "Jan 17, 2009", "userURL": "http://www.goodreads.com/user/show/1747192-jason", "userReview": "In this book The Legend of Luke is about a mouse named Luke, who with his family moved into an area where they live in caves. His wife was killed and his son Martin survived the killing by Vilu Daskar. Vilu Daskar is on a ship with a band of sea rouges with vermins. Luke goes on a ship with a group of mouse to avenge the death of his wife and his tribe.I can connect to the world about Martin, where he wants to be able to find out his inhertance. Some people in the world want to find out about their ancestors and where they were born. Martin goes to the beaches where he eas ambushed and captured, in another book, by Badrang and where he lived. Also some people would like to ask close friends or other family members about their parents or others. Martin asked Luke's closest friend who would do anything for Luke, Vurg and the remaining group that was with Martin when he died.I would give this book a five out five because this book fits perfectly with the other books in the series. It shows how where in the book Martin the Warrior where Martin shows his half of the story and where this book shows what happened for Luke to give away his sword, why he left Martin and how he did it. I liked this book because I read Martin the Warrior and Mossflower where they show Martin as a great savior where he kills a tyrant cat and a evil slave controling madman. After those books I knew about Martin and what he does because he is refered everytime in each of the books in the series but I didn't know about Luke his father until this book. Luke is probally the same as Martin being strong, brave, and willing to help others in need. I think this book fits perfectly with the series."}, {"userName": "Megan Cutler", "userReviewDate": "Nov 09, 2011", "userURL": "http://www.goodreads.com/user/show/1276590-megan-cutler", "userReview": "In a word: disappointing.I was actually looking forward to the Legend of Luke because it involved Martin and his fabled father. And indeed, the opening of the book was a breath of fresh air. I liked the linear nature as opposed to the back and forth the books usually feature.Alas, as soon as the book reached the main story, the one about Luke, it became the same predictable formula of all the other books, though compressed to fit in the midsection of the book. The parts with Martin, Gonff and gang seem to only serve as a very long prologue and epilogue with no meaningful story or character development to speak of. Worse, the old mice telling the story in the first place reveal the climax before they even begin to tell the story!I won't talk about the fact that no one can put together a coherent sentence in this world (now even the good guys talk like pirates! \"Yore?\" Seriously?). What I do find disturbing, though, is that with each passing book the good guys become more indistinguishable from the bad guys. I'm not sure which is worse; Martin and company *laughing* as a child is *beaten* or Luke and his tribe slaughtering a group of sea rogues to the last to steal their ship, not to mention some of the brutal and grotesque slaughter featured near the end of the book.Unless you're fond of continuity bending, easily skipable. It adds nothing to the series."}, {"userName": "Amanda Butler", "userReviewDate": "Jul 10, 2013", "userURL": "http://www.goodreads.com/user/show/22086194-amanda-butler", "userReview": "I love this book!This answers many questions about Martin the Warrior's origins, seamlessly melding the \"past\" with Martin's \"present\". The characters are well-developed and original, and easily become memorable \"friends\" for those of us that enjoy the world of literature.If you have not read \"Martin the Warrior\" and \"Moss Flower\", the two books that come (chronologically) before this one, you may be a little confused by some of the references about Gnoff the Prince of Mouse thieves and Tsarmina, the Queen of a Thousand Eyes, at the beginning of the book, but don't sweat it. This book can stand on its own.I'm a huge advocate for family story time, and if your family has older kids (10 to 30) the Redwall series is an excellent choice. Good story lines, memorable characters, but not as dark as some fantasy stories (as say Tolkien), can get and thus is \"safe\" for the younger members of the family.Two things I think I should mention, though: (#1) If you do choose to read the series out loud, the person reading ought to practice any \"mole speech\" in the chapter beforehand OUT LOUD. It's hard to do correctly. (#2)Almost all of the songs in the Redwall series can easily be sung to old ballad melodies (like Scarborough Faire and others), so if you're familiar with those meters then you can pretty much sing any of the Redwall songs."}], "description": "-Luke, father of Martin. is joined by Trimp the Hedgehog, Dinny Foremole, and Gonff--the ever-mischievous Prince of Mousethieves. Martin hopes to discover the truth of a legend when he embarks on a perilous journey to the northland shore, where his father abandoned him as a child. There, within the carcass of a great red ship--broken in half and wedged high up between pillars of stone--he finally uncovers what he has been searching for: the true story of the evil pirate stoat, Vilu Daskar, and the valiant warrior who pursued him relentlessly over the high seas, seeking to destroy Vilu at all costs, even if it meant deserting his only son.", "title": "The Legend of Luke\n      \n          (Redwall #12)", "url": "https://www.goodreads.com/book/show/7987.The_Legend_of_Luke", "average": 3.99, "cover": "https://images.gr-assets.com/books/1442546166l/7987.jpg", "reviews": 179, "authors": [{"url": "https://www.goodreads.com/author/show/5329.Brian_Jacques", "name": "Brian Jacques"}], "type": ["Fantasy", "Young Adult", "Fiction", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/7987.The_Legend_of_Luke", "http://www.goodreads.com/book/show/1912242.The_Legend_of_Luke", "http://www.goodreads.com/book/show/774477.The_Legend_of_Luke", "http://www.goodreads.com/book/show/1189208.The_Legend_of_Luke", "http://www.goodreads.com/book/show/23347300-the-legend-of-luke", "http://www.goodreads.com/book/show/7996.Redwall", "http://www.goodreads.com/book/show/201341.Mossflower", "http://www.goodreads.com/book/show/99085.Lord_Brocktree", "http://www.goodreads.com/book/show/201345.Martin_the_Warrior", "http://www.goodreads.com/book/show/201342.Mattimeo"]}