{"ratings": 5049, "userreviews": [{"userName": "Lynda", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/13400128-lynda", "userReview": "”It was horrible, really, what I was feeling, the sense I had that I was running a terrible risk every minute of my life - risking my family, my career - but not being able to help it; somehow just not being able to help it. I was thinking every day how I had to change my life, how I couldn’t go on this way; but I knew the more I thought that, the farther I was getting from where I thought I should have been.”[Owen Benjamin]The Lost Language of Cranes is David Leavitt’s first novel and was published in 1986. It explores the terrible secrets that families keep from one another, and the consequences of their discovery.Set in 1980s New York against the backdrop of the Aids epidemic, the novel recounts the lives of the Benjamin family; parents Rose and Owen (both 52) and their son Philip (25). Rose is a copy editor, and Owen, the director of admissions at a private boys’ school. They lead a tightly structured life, devoting their days to work and their evenings to reading. While Rose and Owen both know that their intimacy has faded, neither is willing to question the basic value of their relationship. Every Sunday, they go their separate ways; Rose reads the paper and works in their apartment, while Owen spends the day at a gay pornographic cinema. Rose has no idea how Owen spends these Sundays and would never dream of asking. When she accidentally meets Owen on the street one Sunday while taking a walk, Rose realizes that after 27 years of marriage, she hardly knows him: \n“She had stumbled into her husband on a strange street corner, running some mysterious errand she knew nothing of, and they had spoken briefly like strangers, parted like strangers.”\nThe first cracks appear on the surface of the Benjamin family life when Rose and Owen learn that their New York City apartment will be converted into a co-op, and they must either buy it or move out. Once their sanctuary from the outside world is threatened, the rest of their carefully structured life begins to crumble as well. Their son, Philip, infatuated with a new lover, wants to share his happiness with his parents and finally summons the courage to reveal that he is gay. His disclosure has an immediate impact on their comfortable, settled lives. Rose feels shocked grief, driven by her fear of the sexual danger that her son has to negotiate as a homosexual. Owen is inconsolable, confused by the upheaval in his family, and overwhelmed by his inability to cope with his own undisclosed homosexuality.The Lost Language of Cranes is a multilayered work of sensibility, delicate on the surface yet packing the punch a reader may feel upon discovering that the title refers not to long-legged birds but to machines employed in lifting materials for building. In a psychological case history discovered by a lesbian friend of Philip's, a boy named Michel who was neglected as a baby is found to have identified with the cranes he saw working outside his nursery window. \n”He moved like a crane, made the noises of a crane, and although the doctors showed him many pictures and toys, he only responded to the pictures of cranes, only played with the toy cranes. Only cranes made him happy. He came to be known as the 'crane-child.'”\nAs Philip's friend muses: \n''How wondrous, how grand those cranes must have seemed to Michel, compared to the small and clumsy creatures who surrounded him. For each, in his own way, finds what it is he must love, and loves it; the window becomes a mirror; whatever it is that we love, that is who we are.''\nPerhaps in personal relationships our life experiences have shown us that maybe that line should read:\nWhoever it is that we love, that is who we are\nDavid Leavitt is gifted at portraying both the mundane as well as the emotional interaction of family members, particularly the marriage crises brought on when Rose and Owen realise they've been living a lie for the past three decades.This is a beautifully written and perceptive novel about sexual identity and family; about people struggling toward a sense of self in a world where feeling love is a certainty even if being loved is not. 4.5 starsTV FILMThe Lost Language of Cranes was adapted to a BBC TV film in 1992. The setting was changed to London from New York. While the movie is a fair adaptation of the book, the book (in my opinion) is way better.The TV film is available on You Tube (free) at: http://www.youtube.com/watch?v=-nmQxY...THE AUTHORAt the age of twenty-three, David Leavitt burst on the American literary scene with a collection of short stories entitled Family Dancing (1984). The stories dealt with issues of sexuality and terminal cancer. Family Dancing received the PEN/Faulkner Award and was a finalist for the National Book Critics Circle Award. Because of his youth, Leavitt received much attention and was hailed by some as the new voice of his generation.Two years later, The Lost Language of Cranes, Leavitt’s first novel, appeared to mixed reviews. Focused more clearly on homosexual themes and characters, it established him as a gay writer. During the mid-1980’s, the gay rights movement was well into its second decade and approaching a certain maturity; Leavitt’s novel was noted for dealing with gay themes in a very accessible and universal manner. Despite the critical response, The Lost Language of Cranes spent many weeks on best-seller lists and was a popular success. In 1992, the British Broadcasting Corporation filmed an adaptation of the novel, transferring the story to London.Leavitt’s other works include Equal Affections (1988), a novel about a family facing its matriarch’s slow death; a second collection of stories, A Place I ve Never Been (1990); and a novel set in wartime England entitled While England Sleeps (1993). His other books can be viewed at his author page David Leavitt. Leavitt has lived in Europe, and his work enjoys great popular and critical success there.The Lost Language of Cranes is also listed in the recently updated 1001 books you must read before you die"}, {"userName": "Trevor", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/4869694-trevor", "userReview": "The Lost Language of Cranes strikes me as effortlessly comprehensive in its portrayal of gay characters in different walks of life, but also an examination of other characters and tropes that have been staples of gay literature. In many ways, Cranes is a product of its time. The gay identity has certainly evolved a lot since the 1980s, and the struggle of the closet is much less at the forefront. However, this book remains a moving portrait of acceptance and passion. It tells the story of several people who experience coming out in a different way: the woman whose parents disown her, the boy raised by gay parents who experiences acceptance from the beginning, the married man with private fantasies. It explores the excitement and passion that arises from being truthful with your sexuality.Leavitt’s prose sucked me in and left me wanting more. My only complaint is that I felt the ending was a little unfinished, as we’re offered no resolution to some issues that arise throughout the story. I was sad when the story came to an end, as I wanted to spend more time in the lives of these characters that were so beautifully written. Not one character had a sense of feeling false or undeveloped. Even the wife, who is usually portrayed as shrill and overbearing, felt here as a vulnerable and raw person truthfully dealing with the revelations her family is going through."}, {"userName": "James", "userReviewDate": "Jan 07, 2008", "userURL": "http://www.goodreads.com/user/show/147433-james", "userReview": "What I admire about this novel is that Leavitt explores the significance in mundane details of the characters' lives. Grabbing a stranger's cock or fighting with a loved one is easy, but talking to those people takes immense courage. The characters find that opportunities come and go, and many aren't worth pursuing, and others can be created. I find their internal lives believable, and this book hooked me and kept me reading far too late for a few nights. But I wouldn't want to be any of the characters, except maybe briefly to experience the excitement of coming out or falling in love for the first time all over again."}, {"userName": "Sub_zero", "userReviewDate": "Sep 01, 2013", "userURL": "http://www.goodreads.com/user/show/7645532-sub-zero", "userReview": "4.5/5Sin comerlo ni beberlo, David Leavitt me ha regalado una de las historias más emotivas, cautivadoras y dolorosamente curativas que he tenido el placer de leer en muchos meses. La historia, ambientada en el Nueva York de mediados de los 80, orbita alrededor de una familia de clase media americana a punto de sufrir una drástica cadena de revelaciones: Owen, el marido, sufre constantemente los remordimientos de un vicio inconfesable, mientras que su mujer Rose lleva años ocultando el anhelo de una pasión secreta. Sin embargo, será su hijo Philip el que dinamite por completo ese acogedor espejismo de tranquilidad cuando decida airear públicamente su homosexualidad. Intensa, abismal, devastadora, cotidiana... El lenguaje perdido de las grúas es una auténtica demostración de talento narrativo y habilidad para manejar varias historias aparentemente inconexas que no solo habla de amor, deseo, sexo y perversión en toda su complejidad, sino que además analiza desde un punto de vista muy interesante nuestra forma de asimilar el lenguaje, de comunicarnos a través de un retorcido entramado de convenciones sociales y de establecer relaciones interpersonales que por lo general tienden hacia lo autodestructivo."}, {"userName": "Surreysmum", "userReviewDate": "May 22, 2010", "userURL": "http://www.goodreads.com/user/show/1153430-surreysmum", "userReview": "As far as I'm aware, this is Leavitt's first published novel, and it's an impressive effort. Leavitt's theme is that of many of his stories in Family Dancing - that is, family relationships from a specifically gay standpoint. In a way, you could analyze this novel down into a rather pedantic series of illustrative dissertations on possible varieties of family response: there's Jerene, the black lesbian whose parents have entirely disowned her; there's Eliot, brought up as the adopted son of a settled & sophisticated gay couple - Eliot who somehow has never managed to develop a capacity for emotional intimacy; there are the two principal characters, Philip and his father Owen, both gay, and both making that revelation in the course of the book. The generational difference is nicely etched - differences in expectations, in guilt level, in ways of going about things. The last main character to mention is Rose, Philip's mother and Owen's wife. She cannot fully accept or understand what she finds out about the two men in her life - but what I find interesting is that she is portrayed neither as monster nor victim. I think I mentioned elsewhere that Leavitt seems to have a surprisingly strong sense of his female characters. Anyway, the point I started out to make and didn't quite finish is that these characters seem to me not only to be perceived/analyzed but to be felt. I really can't think of much higher praise for a modern novel. This is a post-AIDS book, by the way. It's not mentioned by name, but the consciousness of it is everywhere. One last thought just struck me. There are no straight men in this book - gay men, straight women, and gay women, yes."}, {"userName": "El", "userReviewDate": "Nov 28, 2010", "userURL": "http://www.goodreads.com/user/show/83144-el", "userReview": "[image error]"}, {"userName": "Cindy", "userReviewDate": "Oct 21, 2010", "userURL": "http://www.goodreads.com/user/show/2493714-cindy", "userReview": "A story of family and friends coming to grips with who they are and redefining their lives in the process.These have to be some of the most real, vivid characters I've ever encountered in a novel. Really incredible. So why didn't I give the book 5-stars? I just wasn't compelled or all that interested in the story until about 2/3 of the way through the book.If you love great, interesting, complex and evolving characters, this is the book for you. If you need a bit more plot, maybe not.I also wonder if some of my inability to latch-on to the story was that it was set in Manhattan? I've always found the ways of New York life to be foreign, and I never quite 'get' it.I really loved how the book captured the mid-eighties, like a little time-capsule. There were quite a few pop-culture references, which was nostalgic. I was also fascinated by the discussions of AIDS and how it was impacting the gay community in those early days."}, {"userName": "John ", "userReviewDate": "Oct 11, 2012", "userURL": "http://www.goodreads.com/user/show/13555808-john", "userReview": "Set in New York in the 1980s, the central character, Philip, is gay. He comes out to his parents. At that time, neither Philip, nor his mother Rose, realises that Owen, husband and father, is also gay. Interesting character drawings and sketches of relationships. The importance of the family unit is central to the main story with the acceptance/rejection of the child and lifestyle. Rose is perhaps the best drawn character in the book and the one who evokes the most sympathy. Cold and rather self-contained she could be said to have “lost” her husband and son by the end of the book. Philip seemed weak and wimpish.First impressions of the book were that it was trite in style but I was won over as I read on and enjoyed reading it. I could identify with the growing up process and the coming to terms with self and consciousness of same."}, {"userName": "T4ncr3d1", "userReviewDate": "Apr 06, 2013", "userURL": "http://www.goodreads.com/user/show/4894181-t4ncr3d1", "userReview": "\"Ciascuno, a modo suo, trova ciò che deve amare, e lo ama; la finestra diventa uno specchio; qualunque sia la cosa che amiamo, è quello che noi siamo.\" Ho scoperto Leavitt tardi, confesso: e quel Ballo di famiglia, che pure mi ha rivelato l'atroce sensibilità e capacità di un ventenne, quale era l'autore al momento della sua pubblicazione, m'era sembrato una noia mortale. Ripetitivo, monotematico, estremamente riduttivo delle mille complicazioni della vita.Quale estremo piacere, allora, scoprire La lingua perduta delle gru. Laddove, al termine del primo libro, mi chiedevo \"ma è davvero tutto qui?\", in questo secondo e ancora giovanile romanzo (nel 1986 io nascevo e Leavitt intanto aveva venticinque anni) la domanda diventa un'affermazione: \"è davvero tutto qui\". C'è tutto: l'irriducibile dissezione del quotidiano, le violente contraddizioni della vita, la chirurgia asettica e precisa della vita familiare, e l'amore, che ti condanna e ti salva. Dotato di una scrittura meravigliosa, davvero impensabile per un ragazzo di quell'età, ma ancora più incredibile per la sua capacità di fare a pezzi la realtà, di spiarne gli anfratti più oscuri: con una maturità inspiegabile Leavitt analizza i riti quotidiani, li scompone, sviscera le liturgie sacre della famiglia, disseziona i ruoli. Potente è la caratterizzazione dei suoi personaggi, straordinariamente audace quella di Rose, la madre, centro indiscusso dell'intero romanzo, continuamente scomposta e ricomposta. Il momento più alto è sicuramente il monologo di Rose, nella scena-chiave del romanzo: la famiglia riunita a cena insieme all'avvenente ospite, estraneo che incrina un triangolo tutt'altro che perfetto. Rose si rifugia nella sua sicura posizione di osservatore esterno, fredda e calcolatrice, scolpisce con lo sguardo il marito e il figlio, attratti dal fascino dell'ospite, prova l'impulso di rovesciare l'intero tavolo, lo placa, allora si sottrae mentalmente, lascia che il suo pensiero scivoli tra i ricordi, in un flusso di coscienza dal sapore joyciano che trascina il lettore. A fianco della madre, nella cui complessità Leavitt riversa tutta la sua femminile sensibilità, l'autore colloca le due figure maschili, complementari e opposte: il padre represso e depresso, stritolato da un'attrazione mista a repulsione verso un mondo nuovo, e il figlio, Philip, audace nella sua resa incondizionata all'amore, con tutte le sue conseguenze. Spingendosi oltre, lo sguardo di Leavitt dipinge una New York che si fa volutamente cartolina turistica, con descrizioni posate, equilibrate, mentre confina i suoi personaggi in spazi chiusi. E che dire del significato che l'intero romanzo assume, alla luce del titolo? Scelta audace e inusuale, quella di staccare il messaggio dal medium, di dichiarare apertamente la morale della storia, eppure ponendola al di fuori di esso, dedicandovi uno striminzito capitolo centrale che taglia in due il romanzo e inchioda al centro della lettura il suo perforante senso. La lingua perduta delle gru, richiamandosi a un fatto psichiatrico realmente avvenuto, è il linguaggio segreto dell'amoore, sono le parole non dette che s'incastrano tra madre e figlio costruendo un muro di silenzio, è l'unica certezza che rimane mentre il romanzo finisce, proprio quando la storia sembra cominciare per davvero: qualunque sia la cosa che amiamo, è quello che noi siamo."}, {"userName": "Roberto", "userReviewDate": "Feb 22, 2016", "userURL": "http://www.goodreads.com/user/show/15956368-roberto", "userReview": "L’estinzione degli etero a NYCSi racconta che un bambino di due anni vivesse in una casa popolare di New York. La madre non si curava di lui e il piccolo aveva presto imparato ad imitare i movimenti e i rumori delle gru che vedeva dalla finestra a cui stava affacciato da solo per ore: quelle gru erano i suo unici punti di riferimento e dovevano essergli sembrate bellissime ed enormi, in confronto con le piccole e sgradevoli creature che lo circondavano.“Ciascuno, a suo modo, trova ciò che deve amare, e lo ama. La finestra diventa uno specchio; qualunque sia la cosa che amiamo, è quello che noi siamo.\"Ecco, il libro si basa su questa citazione e sull’aneddoto del bambino. Siamo noi che diamo significato a quello che amiamo. Amiamo la rappresentazione di ciò che siamo o vogliamo essere, ossia costruiamo nel nostro immaginario l’oggetto del nostro amore. Quando rimaniamo delusi nello scoprire che chi ci sta accanto non è come pensavamo che fosse è solo perché scopriamo purtroppo che tutte le cose belle che abbiamo apprezzato in passato in realtà erano frutto della nostra immaginazione. Il libro é una storia di persone che vogliono comunicare qualcosa, ma faticano a farlo per paura delle conseguenze. Comunicare per condividere, comunicare per essere capiti, accettati ed amati.Come Jerene, ragazza di colore, che quando parla ai suoi genitori della sua omosessualità si sente dire, in una scena di intensità incomparabile:“Avrei preferito che mi dicessi che avevi un cancro. Sei sempre stata una delusione per noi. E adesso questa porcheria, questo sacrilegio. È come un lutto, È come se fosse morta. Tu non sei mia figlia. Ringrazio Dio almeno per questo. Tu non sei mia figlia.\"Intolleranza che colpisce ancora di più considerando che proviene da persone di colore che hanno subito discriminazioni per il colore della pelle. Ma forse chi fatica a farsi accettare tende a rifiutare di aiutare chi è diverso.Oppure come Rose, che scopre dopo vent’anni di matrimonio che il marito è omosessuale e ha sempre cercato di nasconderglielo: \"Stava sempre zitto durante il sesso, mai una lode, raramente un apprezzamento. Forse semplicemente mi odiava. Forse era tutto qui.\" In una New York del 1986 dove sembra che gli eterosessuali siano scomparsi (possibile? Questo punto è molto poco credibile, nel libro), molte sono le sorprese, i coming-out, che ci consentono di assistere a perfette, ma anche angoscianti, descrizioni dei sentimenti e delle emozioni che animano i protagonisti, tanto da riuscire spesso ad immedesimarci e a domandarci come ci comporteremmo in situazioni analoghe.Un romanzo che in sostanza ci vuole dire che tutti i modi di amare sono perfetti, purché ci facciano sentire bene. Ma il punto è proprio qui: spesso non riusciamo a sentirci bene per la nostra incapacità di comunicare, di capire gli altri, di accettarci per quello che siamo, per mancanza di sincerità, per il nostro bisogno di consenso del gruppo, della massa. La prima parte del romanzo, indubbiamente ben scritto, avvincente ed interessante, è incredibilmente reale, lo squallore di certe situazioni e il malessere correlato sono descritti in modo perfetto. I dialoghi sono secchi, serrati, precisi, affilati, realistici. Nella seconda parte il discorso un po’ si sfuma, alcune situazioni sono meno credibili, la tensione cala. Nel complesso è comunque un ottimo romanzo che si legge molto bene. 3 stelle e mezzo."}, {"userName": "Julia", "userReviewDate": "Apr 23, 2011", "userURL": "http://www.goodreads.com/user/show/2719191-julia", "userReview": "I've kept this on my shelves for a long time, never really feeling in the right mood to read it as I somehow expected the book to be too keen on political correctness, to centred on the homosexual theme everyone knows about when purchasing this book, and I also kind of thought it'd be too eighties. I don't know where these ideas came from, and I'm so glad that I was completely wrong.The Lost Language of Cranes is one of the most engaging books I've read in a while with characters that are so psychologically acurate that one actually believes them to be autobiographical because they're so much like real people. Even secondary characters are drawn in a precise and loving way, the dialogue is believable and the every-day drama of a family torn because of secrets revealed and the pain we all inflict on our loved ones we often choose not to know as they are in order to have our own way is all-encompassing. Leavitt's prose is lucid and beatiful. Great literature, no matter if you're straight, gay or bisexual. Everyone will end up identifying with the people in this book and that's the greatest achievement in a book for me. Thus the five stars."}, {"userName": "Myles", "userReviewDate": "Apr 25, 2011", "userURL": "http://www.goodreads.com/user/show/1630205-myles", "userReview": "From all quarters I've heard that this is one of the most best and most influential modern gay novels, and when I started reading Gay Men's Literature in the 20th Century I noticed one of its last chapters was devoted to it and even Pulp Friction name-dropped it in its introduction. I've slowed down on those two books, especially Lilly's, but I was curious enough to give The Lost Language of Cranes a try.The book centers on Phillip Benjamin, his parents Rose and Owen and, to a lesser extent, Jerene, the roommate of Phillip's boyfriend. Because of when it was written its treatment of AIDS especially can feel dated, but the book doesn't hinge on that fact. Authenticity doesn't have precise parameters, but I felt the book addressed many different aspects of gay life and culture and was sensitive to different populations within the glbt community. As I was reading this I bemoaned the marginal token lesbian Jerene seemed to be playing, but, as if Leavitt heard my objection, expanded her role in the later parts of the novel.Cranes strikes me as effortlessly comprehensive in its portrayal of gay characters in different walks and periods of life, this is a modern coming-out story, but also an examination of other characters and tropes that have been staples of gay literature from the suppressed middle-aged man, decadents of all ages, wounded family and spouses, nods to a gay culture that was only just beginning to be codified and dissected, something I was more attuned to because of my recent readings in gay literary criticism. Leavitt's prose is clear and matter-of-fact without being too spare. There is plenty of dramatic incidents, the book is touching and sad, but also very funny even during the most self-pitying moments of the characters. A call is made to a phone sex line and it is hysterical. Heartbreaking, sure, but hysterical. I've delayed this review for so long, holding up the line for weeks, because it's yet another book that I feel deserves a little more than my usual key tappings, but in the end goings-ons force me to cut my ambitions. Let me just say that I liked it. It was good."}, {"userName": "Ron", "userReviewDate": "Sep 12, 2012", "userURL": "http://www.goodreads.com/user/show/6169326-ron", "userReview": "an excerpt, when Rose realized his husband is gay:But how could she have know that then? Homosexuality was a peculiarity to her, a condition to be treated in hospitals - not a way of life to be embraced or saved from. She had marched down the aisle, and now it seemed to her ironic that she should have seen in Owen's face assurance,a sign that she was aking the right decision, when in fact she was making the first and largest of a series of mistakes that would carry her out into her life like an undertow, then cease , leaving her stranded, fifty-two years old, with nothing to look back on but a chain of wrong decisions carefully made, blindly made, an exam failed bacause the student has made one essential, thoughtless error over and over. Oh, why hadn't he told her? Why hadn't he let her know? Perhaps he imagined that those secret feelings he harbored would go away, fade with time; perhaps he thought he could cure himself, or that she could cure him. No, even if he'd told her, she realized (and it was a vague consolation), she would have married him anyway, would have believed, as he did, that marriage would provide the cure for the disease. The secret was thus buried, but even from underground it had its influence. A single lie, twisted and preserved, riddled the fabric of their lives together like a flaw in silk, so that a single rip might tear everything apart. They were not, and never had been, what they seemed; that she had somehow known all along. But how shameful that she had lived this life for more than twenty years, and never known, not even secretly, what it was they were.and at the confrontation:Don't interrupt me. No. And not for the stupid reason you think I'm thinking. Because I was very careful, Owen. I made sure I never disrupted our lives together. It was a separate thing, something i needed - for reasons which are now clear and obvious. But with you - what you're saying is the the whole premise of our marriage has been a lie, a sham. And that's bigger than cheating on someone. Because it means for you that our marriage was the cheat, your - other life, that was the real thing.\" her voice grew suddenly softer. \"With me,\" Rose said, \"you were always the real thing.\""}, {"userName": "Alena", "userReviewDate": "May 24, 2014", "userURL": "http://www.goodreads.com/user/show/4456042-alena", "userReview": "Maybe only 3.5,because I didn't get as emotionally invested as I thought I should. It's a unique family drama as mother, father and son struggle with their disconnect, stemming largely from sexual preferences. Owen and Phillip are both gay men, but at completely different places in terms of acceptance. Rose needs to figure out how/if to accept either her husband or her son's homosexuality. All of this is set against the onslaught of AIDS in New York City. It's an era I know, and one that affected me deeply, so I'm surprised that this well-written novel didn't quite capture my heart. While I could appreciate how evocative it is, and the complexity of its characters, Leavitt just never allowed me to fall into his book. And the amount of sex in this novel threw me off. It wasn't at all smutty, but it was startling.Disappointing because I had such high hopes."}, {"userName": "Ingrid", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/38698167-ingrid", "userReview": "Libro datato (anni 80) ma che per l'argomento che tratta (l'omosessualità, l'outing in particolar modo) sa di già sentito, già detto, già vissuto. A tratti pare che il concetto di omosessualità sia legato ad una sorta di ereditarietà e quindi di malattia e l'ho trovato molto sgradevole, anche se il romanzo parla essenzialmente di amore, in tutte le sue forme, della paura dell’amore e della paura di soffrire per amore, del disagio, delle difficoltà di esprimersi e di lasciarsi andare.Una buona e interessante lettura, anche se in fin dei conti mi ha lasciato abbastanza indifferente emotivamente."}, {"userName": "Grazia", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/29190640-grazia", "userReview": "Quanta sofferenza in questo romanzo...I riflettori son puntati su Philip (figlio) e Owen (padre) che dichiarano, con tempistiche diverse, la propria omosessualità in famiglia, dopo aver vissuto i propri istinti sessuali in modo sommerso e, nel caso di Owen, aver cercato di reprimerli.Siamo negli anni '80.Indicativo del sentire del periodo la parola con cui il traduttore del romanzo, sicuramente d'epoca, abbia deciso di rendere 'eterosessuale ' col termine 'regolare'.Il romanzo dipinge un contesto (non troppo realistico, mi aspetterei una configurazione un po' più eterogenea) in cui l'unica persona non omosessuale presente è Rose, madre di Philip e moglie di Owen.E bizzarramente è proprio questa donna, il personaggio che a me è parso più compiuto, più credibile. Nella sua strenua difesa dello status quo. Nella sua necessità di non voler vedere, di non voler sapere.\"Noi tutti abbiamo dei segreti, Philip. Io ho dei segreti, un sacco di segreti, significa forse che dovrebbero essere rivelati tutti?\" \"A volte è meglio essere onesti.\" \"Meglio per chi?\"E qui come non pensare ad una intersezione libresca col tema carissimo a Marias, le nostre orecchie non hanno palpebre, non ci possiamo sottrarre da chi si vuol confidare, non possiamo evitare di ascoltare, non possiamo proteggerci dalle parole che non vogliamo ascoltare. E nel momento che il segreto o la verità nascosta è rivelata, nulla potrà più essere come prima.Ed è proprio Rose che a difesa strenua del suo mondo cerca con tutte le forze di procrastinare il momento delle rivelazioni di cui non vuol essere partecipe, ma venendo a sapere, sarà obbligata a prendere coscienza di come non si possa più cambiare ciò che si è vissuto. E volente o nolente, per quanto sbagliata o basata su assunti errati, dovrà accettare il fatto che la vita che le toccata rimane irrimediabilmente quella che è stata.Era vero che il loro non era stato un gran matrimonio. Non era neanche stato un matrimonio particolarmente buono. Ma era stata la sua vita.E Rose assiste distrutta al crollo delle sue convinzioni che pongono la famiglia al primo piano, come il più importante dei legami. Ed anche il più condizionante.\"Ai miei tempi, la gente si preoccupava di cose più importanti che non la soddisfazione personale. C'erano davvero cose più importanti. Si facevano delle rinunce per un bene più grande. Si aveva una famiglia.\"Come se una persona potesse, o meglio dovesse, negare quello che è o quello che sente per il bene familiare. Come se l'orientamento sessuale potesse essere ritenuto 'soddisfazione personale'.Il romanzo è ben scritto, avvince e si legge molto rapidamente.Leavitt rende con efficacia le situazioni ( riuscendo ad essere molto crudo a tratti) , il clima di incomunicabilità, le incomprensioni, le difficoltà di accettazione della diversità. Usa toni esasperati e angoscianti nei momenti maggiormente drammatici, coinvolgendo il lettore come fosse testimone impotente.Il finale aperto però mi ha lasciato un senso di insofferenza... Ecco io ho questo limite: insoddisfazione e frustrazione nei confronti dei finali aperti. Mi pare sempre, come da ragazzina, una mancanza di presa di posizione da parte dell'autore... Un non voler concludere..."}, {"userName": "Becky", "userReviewDate": "Feb 22, 2012", "userURL": "http://www.goodreads.com/user/show/2341546-becky", "userReview": "After reading the blurb for this one, I was a bit concerned that I was setting myself up for the Manhattan Hollinghurst. Luckily, this wasn't the case. There's none of the pretentiousness in Leavitt's writing, he's a straight forward, but evocative writer, and the whole book had more humanity in the first 20 pages than the whole of the damned Swimming Pool Library. It is guilty of being overly romantic in the odd place, and the ghoulish spectre of AIDS feels old fashioned, which is enitrely not the fault of the author. While the story is ostensibly about Philip, the son of two scholarly parents, who has known he's gay for as long as he can remember, finding his way in a city full of casual sex and barely concealed prejudices, it's more about the effects of a society beginning to fulling accept and embrace homosexuality on individuals most affected by it. The story of Jerene, the lesbian friend of Philip's boyfriend Elliot is heart breaking. The story of Owen, Philip's closet homosexual father, is handled a little more heavy handedly, and I feel may have been more affected if the two of them weren't so closely related. The effect on their mother Rose, is genuine. The real difference between this novel and some of the other gay fiction that appears on it, is that Rose is a wonderfully written character, flawed but no victim, and at the one, you're left feeling devastated for her.Well written, moving, but nothing spectacular. And not a Hollinghurst type character in sight, even if Elliot does scrape worringly close occasionally."}, {"userName": "Anastasia", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/5040946-anastasia", "userReview": "Se Goodreads me lo permettesse, metterei quattro stellette e mezza.Leavitt è disarmante. Scava nelle anime dei suoi personaggi così a fondo che, giuro, fa spavento (in senso buono), ed è soprattutto questo che fa acquistare loro pregnanza. Rose, Owen, Philip e gli altri hanno dei rapporti pieni di omissioni, distanze, incomprensioni, fino a non conoscersi davvero, ma davanti al lettore le loro emozioni e i loro sentimenti sono come un fiume in piena, confessato con un'onestà struggente. Leavitt rende così tangibili i loro desideri, le loro paure, insicurezze, che i personaggi acquistano quella concretezza delle persone reali, nella loro complessità e allo stesso tempo universalità. Diventa difficile non empatizzare con loro, non comprenderli anche nei loro difetti, come il cieco egoismo. Anche New York emerge in alcuni suoi lati particolari, come un naturale prolungamento dei personaggi, che spesso vagano per le sue strade meditabondi, solitari. Tutto questo, poi, è coronato da uno stile fluido e ricco, che fa divorare le pagine, ma dà tante immagini e tanti particolari che aumenta quel senso di realtà, concretezza di cui ho prima parlato."}, {"userName": "Julie", "userReviewDate": "Mar 14, 2015", "userURL": "http://www.goodreads.com/user/show/691161-julie", "userReview": "I reread this book to kick off spring break. It is as gorgeous and moving as I remembered. Lost Language of Cranes centers on the lives of Owen, Rose, and their son Philip. While this book is on its face a story about coming out, it is also a book about find love. In my reread, I was again smitten by the character Jerene, a graduate student. Jerene studies lost languages for her dissertation, though that too is a language she loses when she drops out. Leavitt writes about Jerene learning about a child who spoke the language of cranes: \"he moved like s crane, made the noises of cranes.\" Jerene thinks: \"What did it sound like? What did it feel like? The language belonged to Michel alone; it was forever lost to her. How wondrous, how grant those cranes must have seemed to Michel, compared to the small and clumsy creatures who surrounded him. For each, in his own way, she believed, finds what it is he must love, and loves it; the window becomes a mirror; whatever it is that we love, that is who we are.\""}, {"userName": "Carol Peters", "userReviewDate": "Jan 19, 2015", "userURL": "http://www.goodreads.com/user/show/33120943-carol-peters", "userReview": "Hard to rate a book this anguished, that is to say, easy to downrate it because it's so grim, but of course it has a happy ending, in the happy/sad corner of that spectrum. Leavitt is very skilled at bringing chars to life, I think, & at the same time I wonder whether it's only that I'm mouth wide open because he's depicting people whose lives I've never lived. I've not been a closet homosexual, at least not to my knowledge (as we used to say). Now I'm trying to imagine Owen, a 52-yr-old homosexual man who's lived the last 30ish years of his life only for Sundays. I'm also trying to imagine living the warped life of his deprived & resented but also loved for non-sexual reasons wife. I'm unable to imagine this kind of physical/emotional secrecy being unnoticed or noticed but ignored/pretended away for decades. Makes me want to say we all accept diminished emotional lives, happiness is mostly about the quality of our compensations."}, {"userName": "Ilya", "userReviewDate": "Dec 31, 2011", "userURL": "http://www.goodreads.com/user/show/438737-ilya", "userReview": "This book is part of the gay fiction canon but it feels more like an artifact than a story that will be lovingly read and re-read for years. Public opinion on homosexuality has shifted dramatically since the late 1980s, so that's part of it. Without the whiff of judgment and scandal that must have made this book interesting to people back then, it's a pretty pedestrian read. The characters are thinly sketched, and some scenes feel as predictable as an after-school special. Too much exposition, poor dialogue, etc.It's such an interesting contrast to The Swimming Pool Library, which was written around the same time, and which I read last month for the first time.The events described in TLLC are far more realistic, but TSPL feels much more true, it contains so many great observations about human nature. It hardly feels dated at all.Having now damned TLLC, I'll just add that it's a quick and actually pretty enjoyable read."}, {"userName": "Jennifer", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/204702-jennifer", "userReview": "I read this all in a night, sucked in by the really beautiful prose and dead-on description of New York a little before I lived there but very recognizable. It's about a family whose son and father both come out as gay at about the same time, and all the men in the book are very artfully drawn. Little disappointed about the mother, Rose, who is a shrill caricature, but other than that, extremely well done."}, {"userName": "Len", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/11764304-len", "userReview": "Finally getting around to reading some of the books that were hot when I was coming out...it's very interesting to read this now, at 45, and draw the parallels of my younger gay years with Phillip's. Something comforting about reading this all these years later, that the endless 'drama' has subsided. :-)"}, {"userName": "Ed", "userReviewDate": "Nov 30, 2012", "userURL": "http://www.goodreads.com/user/show/14996633-ed", "userReview": "What an incredible book to launch my 2014 reading! First published in 1986, The Lost Language of Cranes by David Leavitt is an intense, powerful, well-written study of an intellectual middle-age couple and their grown son. Set in Manhattan in the 1980's, each of the three main characters has kept secrets from one another for a long time, and the story traces the need to finally reveal those secrets and the consequences each faces for doing that.Rose and Owen Benjamin have been married for twenty-seven years and live quiet, mundane lives on Manhattan's East Side. Rose is a copy editor for a small NYC publishing house. She is a very structured person and her work is the centerpiece of her life since her home life is so passionless. Her secret is that of a five-year affair she had in the distant past with a co-worker. Owen had a promising academic career long ago but gave it up and settled for a drab position as the director of a private Manhattan boy's school, a position that leaves him unfulfilled. The boredom of his professional and home life is relieved only by his visit every Sunday afternoon to a gay porno theater which he has frequented for many years. The couple's lives are further complicated by the fact that they soon may be forced to leave their apartment of many years due to a proposed condo-conversion.Their only child and twenty-five year old son Philip has his own apartment on the West Side and works midtown as an editor of romance novels. He has fallen in love with Elliott Abrams whom he has known for about a month. Philip is painfully insecure and since Elliot is his first love in a long time he is overly eager to cling to him which alienates Elliot. Phillip is also captivated by the fact that Elliot was raised by two gay men in a literary and bohemian world, an environment totally alien from his own experience. While he is out as a gay man to his friends and co-workers, Philip has never revealed his sexuality to either of his parents even though he has known since a young teenager that he was gay. Now he feels a need to tell them since he has finally fallen in love. His decision to come out to his parents has unforeseen consequences, most acutely his father's need to finally acknowledge that he too is gay.This is a book to be enjoyed on many levels. Leavitt's rich and rewarding story draws the reader into the hearts and minds of its characters. It is an excellent portrayal of different relationships: lovers, parent/child, husband/wife, friends, roommates. The story is also an engrossing account of keeping secrets and the terrible toll that can have on a person physically and emotionally. The author raises valid questions. Is it always best to tell the truth or should some things be left unspoken? Is the burden lifted from the bearer of the secret simply transferred to the person learning the secret? Leavitt does not answer these questions but raises them in the reader's mind for consideration. He also shows what a horrible price one pays for living in the closet. Reading and understanding Owen's many years of secrecy, shame and guilt is painful and his desire to touch and be touched by someone for whom he feels passion is very poignant. Additionally throughout the story there is an overriding theme of loneliness and what one can or should do to try to overcome it that goes beyond just the three main characters.The specter of AIDS looms through the story. Written at the time of the introduction of the cataclysmic AIDS era there is the fear and dread of contracting the disease running through the minds of many of the characters, a sense they are being forced into monogamy to simply survive. \"Now monogamy was in fashion, but it had taken on the status of a safety tactic, an unappetizing but necessary catastrophic measure, like one of those World War II recipes for stretching precious rationed meat. 'Find ten buddies and agree to fuck only with them,' Phillip had read in a porn magazine early in the crisis. Then ten was reduced to five, five to two...fear became an indirect route to monogamy and, sometimes, to happiness.\"Before reading the novel I was intrigued by its unusual title and assumed it was a reference to the long-legged and long-necked birds. Instead though it is a reference to research being conducted by Elliot's roommate Jerene, clearly the strongest and most powerfully drawn of the secondary characters. A black lesbian who was coldly rejected by her adoptive parents once they learned of her sexuality, she is busy doing research on lost languages. She stumbles upon the bizarre story of a neglected two-year old boy who related to and imitated the movement and sound of the mechanical cranes he saw from his tenement window rather than that of his biological single mom. The boy becomes the Crane-Child and when he is removed from them what he shared is forever lost.This is a perfectly slow-paced novel, just the right tempo to paint incredible characters and draw the reader into their lives. Never did I feel it was moving too slowly; it held my interest throughout. As I am writing this it has dawned on me that the story in some ways reminds me of Edward Albee's play Who's Afraid of Virginia Woolf? which like this novel dealt with dark secrets and the consequences of revealing those secrets. I was totally captivated by this book and plan to read more by this talented author.One final comment. The book was adapted by the BBC into a made-for-TV movie in 1991. The one significant change was the setting, London rather than New York. I caught a glimpse of it on YouTube and from what I saw other than the setting it appeared very faithful to the book."}, {"userName": "Ian  Cann", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/7655313-ian-cann", "userReview": "A thoughtful moving novel about homosexuality, relationships, secrets and desires. Although I'm not familiar with the 1980s NYC that the book plays out in with the backdrop of Aids, there was a real sense of place and time, especially when Leavitt talks about gentrification and things moving on, & the brutal ugliness of homphobia is not shirked and emphasized front and centre is the courage needed to say aloud and come to terms with who one is and who one loves."}, {"userName": "Unda", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/8010891-unda", "userReview": "It's a wonderful book. Great style, hard theme, easy read."}, {"userName": "Seward Park Branch Library, NYPL", "userReviewDate": "Feb 01, 2015", "userURL": "http://www.goodreads.com/user/show/32904730-seward-park-branch-library-nypl", "userReview": "3.5To think! A world where the Upper West Side is 'gentrifying!' Before my time, before my time...David Leavitt's 'The Lost Language of Cranes' gives its reader a seamlessly gorgeous story from start to finish. It contains characters that are impossible not to invest emotion with, despite their flaws. Like all good books, Leavitt takes no simple view on 'human nature', instead painting a vast, multigenerational picture of attitudes towards honesty and sexuality—but most importantly, languages of *love*.I felt so much for Philip Benjamin. I was almost embarrassed at the degree to which I found myself identifying with his being the at short end of intense infatuation. And yet who among us sore lovers have not ever come to the realization that we so easily find ourselves inhabiting the role of 'oppressor', rashly expressing our love? Philip's reflections upon his tryst with the Columbia student contained a maturity I think even the most unlucky lovers eventually come to realize, that we too are capable of inflicting emotional pain on others—this, as I would find, is far, far worse (though Leavitt doesn't go in to this much...). My sympathy for Philip's love for Eliot was strong, and my embarrassment in seeing myself in him so fully, even at his most pathetic moments, is surely a credit to Leavitt's writing.And though I may never have shared Owen's anxiety towards his latent homosexuality, it was illustrated brilliantly. Truly, we sweat with Owen in the Bijou.Yet I found Rose to be the most interesting character in the whole novel. I have a 'thing' for silent characters in novels, those whose lack of agency would find no voice if not for the narrator's (which is a very tricky thing to pull off for the author!). George Eliot's Mary Tulliver and Dorothea Brooke come to mind... Diane Lookins from Jonathan Lethem's 'Dissident Gardens' has for me been the most interesting exploration of this theme I've read to-date. All comparisons aside, I couldn't help but love this passage, as Rose wanders through Barnes and Noble after a trip to D'Agostino's:\"A couple of young women stood at the rack, absorbed in a book called 'Go For It'. They were in their twenties, chewing gum; secretaries probably. They were genuinely interested in improving themselves. The sight of them made Rose feel fleetingly good, as she remembered the doldrums of her own life, those not-too-distant days when she too had had the luxury of worrying about whether she was going for it or was a victim of the Cinderella Complex. Those days had passed . What she needed now was a book telling her how to live in rubble.\"I loved this passage for its resonance, though it scares me to death.I feel the book suffers from a lack of resolution in regards to Rose. OK, so undoubtedly this book is primarily about generational attitudes towards homosexuality, truth, and love, but Rose is definitely the all-out loser in this book. Unlike many of the characters in 'TLLOC', Rose fails to speak a language of love by the end of the story. And though in this case we may talk of pointing the finger right back at the victim, ought we not to feel sorry for her? My sympathies, Rose. Though it isn't always appropriate, anyone who is essentially kind who finds themselves at the mercy of a world which changes without them will always have a special place in my heart.—AF"}, {"userName": "Lexa", "userReviewDate": "Dec 19, 2017", "userURL": "http://www.goodreads.com/user/show/62695912-lexa", "userReview": "I happened to pick up a copy of this book in a $1 discount bin at Barnes and Noble. The summary intrigued me; I enjoy family dramas, as well as the history of the LGBT+ community in America. It seemed like the perfect read for me. This book felt very intelligent to me. On the surface, there are the events of the story themselves, but it left me with a lot to think about. At first, I wondered why certain passages were relevant - Leavitt would often interrupt action to describe characters' backstories or allude to memories that felt random at times. The story itself ended up feeling not-quite episodic but not-quite linear. Overall, the author's use of flashback was effective and fleshed out the characters well. I enjoyed seeing the parallels between Owen and his son, Phillip, who are both gay but grew up in different eras. As the book was published in the mid-1980s by a gay male author, it offered interesting perspectives on different aspects of gay life at the time. It also reminds readers today that the gay community in the 80s was still lively even in spite of the AIDS crisis. I have mixed feelings about the book's ending. While the final confession at the end felt satisfying, it leaves open several questions that served as significant plot points over the course of the story. I wondered whether or not a solution was necessary, as leaving off the book with a bit of uncertainty emphasizes the father beginning his life anew, but I cannot help but shake the feeling that the issue with the apartment ended up being completely irrelevant. Additionally, Rose did not feel as developed as that of Owen or Phillip. Despite being a main character, she never underwent any particular growth or change. Rather, her passages serve to establish what kind of person she is in order to explain her interactions with and attitudes towards Owen and Phillip later on. I understand that not every character needs to be dynamic, but as several scenes were devoted to her perspective, I had expected more. Overall, the book is an interesting, well-written look at the gay community in the 1980s as well as people and families in general. I found its realism appealing as well as the text's structure, though some details and scenes seemed irrelevant. Though I enjoyed it, I do not find it a must-read for others."}, {"userName": "Jon", "userReviewDate": "Jun 02, 2014", "userURL": "http://www.goodreads.com/user/show/11794080-jon", "userReview": "According to the preface of The Lost Language of Cranes, \"... at the time of its publication ... the critics and pundits of the publishing world roundly dismissed the novel as a disappointment, or a case of 'sophomore slump'.\" After reading Leavitt's novel, I find myself wondering if the critics and pundits read the same novel. The Lost Language of Cranes is a novel about a young man, Philip, who is having a difficult time revealing to his parents that he is a homosexual. Unbeknownst to Philip, his father, Owen, is also struggling with his sexuality. Owen has known his entire life that he is gay but, eventually, explains to Philip that he grew up in a different time (when homosexuality was considered an illness). He continues to say that, during that time, men did what was expected of them (i.e., get married and raise a family) and hoped no one discovered their realities. This novel touches on several situations that arise in the gay culture, and the characters are rich in personality -- from Jerene, a lesbian whose parents have disowned her, to Brad, who can't find love, despite the fact that it's right under his nose. When I first looked at the title, I envisioned birds. However, the reference is to the machines that erect buildings. This reference does have meaning, and when you discover the meaning, it will result in a resounding \"Hmm ... that's interesting.\" If the critics and pundits are right about this being one of Leavitt's worst attempts at a novel, I definitely will be reading more of his works, as they really missed the mark on this one."}, {"userName": "KC Smelser", "userReviewDate": "Oct 10, 2012", "userURL": "http://www.goodreads.com/user/show/12456487-kc-smelser", "userReview": "This might have been the first \"queer\" novel I ever read. I have no idea how I came across it, but I do remember reading it, in secret, late at night after my parents had gone to bed, feverishly. And did not understand a thing. Growing up in an extremely rural place, I was discovering that I was different, but I wasn't sure how, or why, thought I was pretty sure it had something to do with being “gay.” So I might have just picked up this book, and dived in, hoping it would, like other books, take me a new place, teach me what I needed to know. All that I can remember was that is was very “literary” and that the image of the crane-child haunted me vaguely for years. So when I flew to Italy earlier this year I grabbed it for the 8 hour flight and dug in about half-way. Then put it down for the rest of the summer. After just finishing it I can say that I did not come away with much again. Overall it is a beautiful book, but stale in a way. It doesn’t read true because all of the characters feel wooden. Given the subject matter, the anguish, depression, and joy should all jump off of the page, but I find myself struggling to even remember most of their names.The one passage I found excellent was when the main character Phillip, and his lover shave each other’s faces – and Phillip’s internal dialogue about not ever learning to shave from his father struck a chord deep inside. I do think this warrants another re-read sometime in the future. Third time’s the charm?"}], "description": "David Leavitt's extraordinary first novel, now reissued in paperback, is a seminal work about family, sexual identity, home, and loss. Set in the 1980s against the backdrop of a swiftly gentrifying Manhattan, The Lost Language of Cranes tells the story of twenty-five-year-old Philip, who realizes he must come out to his parents after falling in love for the first time with a man. Philip's parents are facing their own crisis: pressure from developers and the loss of their longtime home. But the real threat to this family is Philip's father's own struggle with his latent homosexuality, realized only in his Sunday afternoon visits to gay porn theaters. Philip's admission to his parents and his father's hidden life provoke changes that forever alter the landscape of their worlds.", "title": "The Lost Language of Cranes", "url": "http://www.goodreads.com/book/show/373049.The_Lost_Language_of_Cranes", "average": 3.96, "cover": "https://images.gr-assets.com/books/1400631276l/373049.jpg", "reviews": 215, "authors": [{"url": "https://www.goodreads.com/author/show/28978.David_Leavitt", "name": "David Leavitt"}], "type": ["Lgbt", "Glbt", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/373049.The_Lost_Language_of_Cranes", "http://www.goodreads.com/book/show/18594480-the-lost-language-of-cranes", "http://www.goodreads.com/book/show/536232.El_lenguaje_perdido_de_la_gr_as", "http://www.goodreads.com/book/show/1196106.The_Lost_Language_of_Cranes", "http://www.goodreads.com/book/show/1294234.The_lost_language_of_cranes", "http://www.goodreads.com/book/show/16167238-la-lingua-perduta-delle-gru", "http://www.goodreads.com/book/show/28954970-la-lingua-perduta-delle-gru", "http://www.goodreads.com/book/show/11331493-la-lingua-perduta-delle-gru", "http://www.goodreads.com/book/show/11181421-la-lingua-perduta-delle-gru", "http://www.goodreads.com/book/show/290712.The_Lost_Language_of_Cranes", "http://www.goodreads.com/book/show/24405129-the-lost-language-of-cranes", "http://www.goodreads.com/book/show/21937665-the-lost-language-of-cranes", "http://www.goodreads.com/book/show/210094.While_England_Sleeps", "http://www.goodreads.com/book/show/17286659-the-two-hotel-francforts", "http://www.goodreads.com/book/show/210113.The_Indian_Clerk", "http://www.goodreads.com/book/show/98830.Family_Dancing", "http://www.goodreads.com/book/show/208278.The_Man_Who_Knew_Too_Much"]}