{"ratings": 4086, "userreviews": [{"userName": "Meredith", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/30978160-meredith", "userReview": "Booklover, bookworm, booknerd, bibliophile--whatever you prefer to be called--this is a book for you! “Who wouldn’t rescue a book?” \nTouching read about a bookseller with a dark past who finds solace in books. When she finds a lost book, she doesn’t expect to connect with its owner in a way that forces her to come to terms with her difficult childhood. This is an enjoyable, poignant story that pulled at my heartstrings. Loveday likes books more than people. Books mean so much to her that her tattoos are of her favorite first lines. She is 25 years old and has worked in the same secondhand bookshop since she was 15. The bookstore and books are her comfort zone; the reader doesn’t know exactly why Loveday hides amongst books and the little bookstore. Her life is quiet and she relishes in her routine. As much as she tries to stay away from people, there’s something about her that seems to attract them to her, especially the crazies. It is not until Nathan, who is a poet and magician, comes into her bookstore to claim a lost book that she slowly starts to let down her guard. I absolutely loved reading this--the main focus is on Loveday's traumatic childhood, which is slowly revealed. Since this is primarily a character study, there isn't much action but Loveday's character held my attention. The mystery of her childhood kept me intrigued, although the more I learned the less I wanted to know as what is revealed is pretty awful.Loveday is a likable and witty character, and I could identify with her relationship with books. And of course, I loved the role of books and the bookshops! I really liked how Butland used books to help bring Loveday's emotions to the surface. It has some very dark moments but there's a lot of whimsy, wit, and love woven in to lighten the tone. I highly recommend! I received a copy of this book from NetGalley and St. Martin's Press in exchange for an honest review."}, {"userName": "Paromjit", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "Stephanie Butland writes a delightfully charming, moving and beautiful piece of contemporary fiction set in a second hand bookshop in York. It features the wonderfully prickly, hard to get to know and sarcastic Loveday Cardew, with her nose ring and tattoos of lines from treasured books. Books mean so much more to her than humans, and the bookshop is her refuge from the world. Only the endearing and eccentric bookshop owner, Archie, has managed to pierce her heavily fortified armour, with a friendship that has developed through the years, and even he has no idea of the secrets she keeps close to her chest. Archie adores Loveday, feeling that she is worth the time and effort it takes to get to know her. Fifteen years ago, Loveday experienced a huge heartbreaking trauma that led to her being taken into foster care. One day, she happens to come across a book of poetry outside on the pavement, picks it up and puts up a found notice in the shop. This fateful act presages the entrance of the magically entrancing poet, Nathan Avebury, who sees beyond the difficult and unprepossessing exterior of Loveday's character. Strange parcels begin to arrive which have meaning for Loveday. This is a dark story of heartbreaking secrets and love. Will Loveday be able to let love enter her life after her experience with Rob? This is a novel that goes back and forth in time narrated by Loveday. This is a brilliant read with great quirky characters, the memorable Loveday and the perfect setting of a bookstore where it is understood just how special books are. Just wonderful and highly recommended! Many thanks to Bonnier Zaffre for an ARC."}, {"userName": "Melisa - Traveling Sister", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/42481357-melisa---traveling-sister", "userReview": "Do you ever open up a book and connect with it right away? That’s what happened to me with this one. The writing, the characters, the dialogue - it all hooked me from the get go and didn’t let go. The beautiful cover is a little misleading - I thought this was going to be a light-hearted read based around a bookshop but it ended up being so much more. This is a very deep, detailed look at a woman who has gone through an unimaginable amount of pain in her life and how it affects all of her decisions and personality going forward. This is a book for book people. The main character, Loveday (what a cool name!), has worked in a bookshop since she was fifteen years old, enjoys books more than people, and even has her favorite quotes tattooed on her body. I absolutely loved the character of Archie (and not just because my son’s name is Archer!) he was such a charming, lovely character who always had Loveday’s best interests at heart. This is a slow moving, highly developed story that will tug at your heart strings and give you a whole new cast of characters to love. Recommend to all bibliophiles!Thank you to St. Martin’s press for a copy of this book in exchange for an honest review."}, {"userName": "Kendall ", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/42327848-kendall", "userReview": "I was instantly intrigued by this story by the cover and the title. The Lost for Words Bookshop... what more can you ask for?! This novel features our main character Loveday Cardew. Loveday has worked for Lost for Words bookstore for over 10 years. She is quite the character with her nose ring and fascinating tattoos depicted throughout her body that represent quotes from her favorite books. It almost made me want to get one... :) Loveday isn't the best fan of people and loves her books way more then socializing. As the story starts to progress, you realize that Loveday has suffered a great loss has a young girl. She hides her secrets very well and doesn't want to open herself up to anyone. One day Loveday starts receiving books at her bookshop that suggest someone knows about her past. Loveday's life is about to change..... What I really enjoyed about this novel was the characterization. I loved Archie!! It's full of warmth and love!! The story really comes to life exploring how one can overcome their fears and loss. \"A bookshop is not magic but it can slowly heal your heart.\" I felt the story was a bit slow in the beginning for me and it dragged in some areas but overall it was a light, uplifting, and fluffy read :).3.5 stars rounded up for me! Thank you so much to Netgalley and St. Martin's Press for the advanced arc!Publication date: 6/19/18Published to GR: 5/16/18"}, {"userName": "Karen", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/12851291-karen", "userReview": "I enjoyed this story about a quirky young lady named Loveday Cardew, with nose ring and first sentences of novels tattooed on her body, who has worked in a bookshop in York since she was fifteen years old. Loveday had spent years in a foster home after a tragedy happened in her family life, and she just has a crazy love for books which makes her job ideal.Because of what happened in her family, I don’t think she believes in love for herself, and she just really doesn’t like people anyway... except for the older man Archie who owns the bookshop and has taken her under his wing. Archie is a great character in this book, and is a help to her in realizing her potential.A love interest comes around in the form of a magic man who loves poetry. Maybe things will actually be okay for Loveday!There are a couple other stories going on within this story that kept me reading.A light and easy read!Thank you to NetGalley and St Martin’s Press for the ARC"}, {"userName": "Fictionophile ", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/4428094-fictionophile", "userReview": "What bibliophile can resist a novel about a charming used bookshop, with even more charming and quirky protagonists? I can't.  To further my interest, I've read some great reviews of this novel by some of favorite fellow bookbloggers. And... did I mention it is set in York, England?  What a package!This delightful novel features a memorable protagonist, Loveday Cardew. She has worked for \"Lost for Words\" for the past ten years, is twenty-five years old, has a nose ring, and several tattoos which depict lines from her favorite novels. She'll be the first to admit that she likes books much better than she likes people.  An introvert, she avoids confrontation at all costs. I confess that in the first chapter or so I wasn't Loveday's biggest fan, though over the course of the novel I came to love her like a daughter.  The author cleverly put forth her bristly and sarcastic character so as to show how Loveday put up walls against the people she meets.\"I word hard, but I know that I'm also hard work.\"Loveday's poem explaining why she loves books:\"I like books cause they don't care if your knickers match your bra. If you've washed your hair. I like books cause they don't invade your space. They sit on your shelf and don't get in your face. I like books cause they don't mind what your heart contains, who you've left behind. I like books cause they don't give a shit when you get to the end - what you think of it. Books don't care if you've got a degree or what you watch on TV. Books don't judge if you've got tattoos, if your friends are few. I like books cause they don't care.\"Loveday's one true friend is the owner of \"Lost for Words\". More like family than he is a boss, Archie is a portly, gregarious gentleman. Generous in size and generous in nature. Archie wears a lot of tweed, smokes a pipe, and has a luxuriant moustache. He adores Loveday like a father and calls her his little 'stray waif'.\"Archie says I keep all my interesting bits well hidden and getting to know me is an exercise in faith rewarded.\"One day Loveday finds a poetry book on the pavement. As any true bibliophile would, she rescues the book from the elements and takes it back to the bookshop. She posts a sign in the window \"Found\" with the books details.  This small, seemingly inconsequential event will profoundly impact the lives of three people.Nathan Avebury, a poet and magician, notices her sign in the window and comes in to claim his book. Nathan seems to see beyond Loveday's off-putting demeanor to the person she is underneath.\"When you're a child you don't always know the right questions, and you don't know that you don't have forever to ask them.\"Though part of this novel are flashbacks to Loveday's childhood days in Whitby, her past is a well guarded secret that is not divulged until near the end of the book. We know that she suffered a great trauma in her childhood and that when she was ten years old she was put into the foster system.\"Small memories come from the kind of tiny reminders that you simply can't predict, and so can't protect yourself from, and they catch you, paper cuts across the heart.\"All of the characters in this novel are so genuine and so very 'human'.  Villains and angels are both represented - showing that no one is completely one or the other.  This is a book that will steal the heart of ardent bibliophiles and those who carry emotional baggage from their youth. \"Lost for Words\" is laced with moments that will alternately make you laugh and make you weep. If you were expecting a 'cutesy' chick lit book, you will soon discover that \"Lost for Words\" has hidden depths with some very serious themes. In a nutshell - I loved it!My sincere gratitude to Bonnier Zaffre Books via NetGalley for providing me with a digital copy of this novel. I was only too happy to write this review."}, {"userName": "Dale Harcombe", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/4800708-dale-harcombe", "userReview": "A book set in a bookshop always has the potential to be good. But it needs more than just being about books. It need interesting characters. Enter Loveday Cardew. (Loveday is a Cornish name for those who were wondering.) Loveday much prefers books to people. Perhaps for good reason. She knows what to expect from books. People are much harder to figure out and sometimes those you trust let you down badly, she has found. Then into the York bookshop where she has worked since she was 15, comes a poet. Around the same time three deliveries of books arrive that resonate far too much with Loveday and bring to mind unsettling memories. Her past is not something she wants to dwell on and with good reason.I loved the quirky, prickly character of Loveday and the way she has first lines of books tattooed in various places on her skin. I loved all of the book references including some of the crazy requests people come in with to bookshops and especially the way Loveday’s back story unfolds throughout the book. Chapters are divided up into poetry, history and crime with a couple of different ones at the end. Archie who owns the bookshop and Nathan, both poet and magician, are interesting and likeable characters. Not everyone is. The writing is engaging. I liked, ’His eyes were the kind of blue you find on self-help book covers, to suggest clarity and calm.’ And this one when Loveday is looking at a particular book. ‘I suppose it’s the fact that these small memories come from the kind of tiny reminders that you simply can’t predict, and so can’t protect yourself from, and they catch you, paper cuts across the heart.’ The reader gets a clear picture of a happy early family life before everything changes and Loveday ends up in foster care. Since then she has worked on remaining largely invisible. I loved everything about this book and powered through it. My husband could tell how involved I was in the story by the sounds that erupted at times, laughter, anger, concern and tears. I simple had to keep reading till I reached the end. A must read book for anyone who loves books and characters that are a bit out of the ordinary, while not skimming over some of the good and the bad aspects of families, friendships and romantic relationships. An absolute five star read."}, {"userName": "Robin Bonne", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/43171956-robin-bonne", "userReview": "3.5 A quick and pleasant read about a used bookstore, a woman with a secret past, and the men who love her. I had a little trouble relating to the main character, Loveday, as she seemed just as closed off to me, the reader, as she did to the other characters in the book.Even though I enjoyed this book, there were a few elements that were off to me. I wished for a more suspenseful build up around the ex boyfriend, Rob. I found myself puzzling over Loveday’s choices and reasoning behind her choices. She was a very confusing character, and sometimes her motives were unclear. I assume she had C-PTSD, but the symptoms were glossed over which disappointed me. There were a lot of missed chances at character development. I wanted to know them better. My favorite character was Archie, and he brightened every scene he was in. He brought more life to this book than any of the other characters in it, though Nathan’s Doc Martins were a close second best. The comment about Angela Carter irked me. In a book that is supposed to be for book lovers, it felt like a slap in the face to have one of my favorite authors insulted. Thanks to NetGalley and the publisher for a free copy of this ebook in exchange for an unbiased review."}, {"userName": "Hristina", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/17945431-hristina", "userReview": "Copy received through NetGalleyIt's a book that talks about the power of books, it's especially written for bookworms. I loved that, I loved how the story progressed, the writing is great, but most of all, I loved the characters, they make this book. This was a very interesting, comforting read, and it's definitely a book that I will re-read soon."}, {"userName": "Liz Fenwick", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/7024660-liz-fenwick", "userReview": "I loved this book. It has stayed with me...beautiful and heartfelt."}, {"userName": "Elizabeth of Silver's Reviews", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/1882027-elizabeth-of-silver-s-reviews", "userReview": "FULL REVIEW WILL BE ON JUNE 20, 2018.LOVED this book.\"If you like books, bookshops, wonderful characters, a bit of mystery, and secrets kept, THE LOST FOR WORDS BOOKSHOP is for you.I’m sure most readers fall into most of those categories, so you won’t want to miss reading this charming, alluring read.The cover itself draws you in.There are some heartaches in it, but for the most part it is a lovely, bookish read. ENJOY when you read this book. 5/5This book was given to me free of charge and without compensation by the publisher in return for an honest review.\""}, {"userName": "Joanne", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/33121229-joanne", "userReview": "Despite the title, I won't be lost for words reviewing this lovely book. It is full of characters you will take to your heart and I loved the way the story unfolded. Loveday Cardew is a young woman in her twenties, quite a spiky character, who works in an independent bookshop in York owned by the wonderfully eccentric Archie. Some years previously as a young girl, as the story hints at and gradually reveals, she suffered terrible loss. This is one of the reasons she now wants to be so self-sufficient and closes herself off from most relationships. She guards her past secrets well and doesn't discuss them with anyone. So when some books arrive at her bookshop which suggest that someone knows about her past and is trying to send her a message, she feels that her carefully constructed life may be about to fall apart. As with Stephanie Butland's previous novels, the story takes place over a few time frames. The present day story is related under chapters called Poetry, reflecting how Loveday is beginning to attend poetry evenings and share her own poetry. Chapters from the recnt past looking at her relationship with ex-boyfriend Rob are entitled Crime and chapters dealing with Loveday's childhood are appropriately named History. There was also a particularly poignant chapter called Memoir.There were a few small details which really caught my attention. I loved the idea that having to finish a chapter of a book is an acceptable reason to be late for work! And I really liked the notice-board Loveday had in the bookshop for things 'Found in a Book'. It made me think about the strangest thing I had ever found in a book but I don't think I've found anything very interesting. I did buy a second hand Nigella cookbook once which had lots of notes in the margins (marginalia as I discovered it is called). Some were just suggested changes to the recipe but some were things like 'this is Mark's favourite' or 'must try this when Jane and Martin come round!'It is the characters which make this a very special book. Part of me wanted to wrap Loveday in a hug and to look after her but of course there's no way she would let anyone do that. She's a character you want to protect from the heartbreak that she feels she has to hide from everyone. She is scared to let herself love and be loved and with what she has gone through and how she has been let down in the past who could blame her? Could magician and poet Nathan be the one to break through her barriers?Archie is also a fabulous character. Larger than life with a huge heart and capacity to love. Archie has had the most unconventional life with many hints at the adventures in his past. While reading about him, I had a picture of Simon Callow in mind! He was such a generous, caring character and the quiet compassion he showed Loveday was enough to make me love him.Lost for Words is a book I adored. It's full of warmth with wonderful characters and it's full of the magic and power of books. If you love books set in bookshops, you'll love it. If you love books about damaged people learning to love again, you'll love it. If you love books with quirky characters, you'll love it. In fact, if you love any beautifully written story, you'll love Lost For Words!"}, {"userName": "Carlene Inspired", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/8322921-carlene-inspired", "userReview": "For this review and others visit Carlene Inspired.Wow, this book got to me in ways I never expected it to. The Lost for Words Bookshop by Stephanie Butland left me with my heart hurting, tears streaming down my face, and a desire for it to go on and on and never end. We follow Loveday in present-day 2016 and learn of her, at first wonderful and later difficult, past in flashback chapters. We see her in school plays, reading with her father, baking with her mother, and hiding with her secrets in her bedroom. She's kept her past private, her family consisting of the people she chooses, specifically bookshop owner Archie. Lost for Words is her happy place, her escape with the books she connects to better than people, but the bookstore also brings to her people, like a lover, a poet, and someone with boxes that take her right back into the past.\"It's good to be reminded that the world is full of stories that are, potentially, at least as painful as yours.\"Loveday is an enigma, she functions with little help from others, shares very little personal information, but allows the first lines of novels to tell her story for her as tattoos on her skin. She's hiding from a past she doesn't want to admit she has, hiding from comfort of sharing herself with another, and yet so desperate to tie the books she reads to her past in some way. She's like a child in many ways, though more caution with her feelings and matters of the heart. I ached for her, even before I knew what her past was made up of. She was meek in many ways and yet so strong and stubborn in others. Her past making up much of who she is, though unaware of how impactful those around her presently also are in making her into someone new. Loveday is a reader and The Lost for Words Bookshop is a book for book lovers.\"I suppose it's the fact that these small memories come from the kind of tiny reminders that you simply can't predict, and so can't protect yourself from, and they catch you, paper cuts across the heart.\"Stephanie Butland's writing is lyrical, the story is fresh, and the poems that tie Loveday to another such a romantic way to reveal feelings. I loved every single secondary character in this novel, even those who are more foe than friend. Each sparks a match to Loveday, pushing her to reveal more of herself, to accept more of herself, and showing her to accept the open arms of others. Archie is the best man I've ever met in a book and he's not even what one would consider handsome. He's described as portly and jovial, the kind of man who tells a tale that you know must be embellished, only he's got the odd friends to show for it. His love of Loveday, his support of her, is so much like that of a father and I really ached for Loveday and how she didn't recognize him as such. He's so important in her growth in this novel and I easily could have read the story of them working together for ten years forever. They're quite the pair, I think I would've liked to know him. Of course, there's Nathan, a boy who charms her and disarms her, bringing forth a Loveday that I had come to think we would only see in her childhood flashbacks. He's the knight who helps her take down the walls she'd spent so long building and fortifying. Every character felt so real, with Stephanie Butland's descriptive storytelling bringing each to life along with the quant York setting. \"'And be brave, Loveday. Ask the questions you want to ask. Seek out the people you want in your life. It might not be as hard as you think.'\"The Lost for Words Bookshop is not what I would call chick lit, but rather Women's Literature and really a book anyone with difficult baggage can relate to. With heavy topics covered like mental health, trauma, and abuse, Stephanie Butland tells a romantic story with a purpose. As a bibliophile I connected with this book, with Loveday and her only-in-my-dreams tattoos, and the unique take Stephanie Butland had on burying the hatchet, finding oneself, and embracing life's quirks whether joyous or difficult. I had a fantastic giggle when Loveday, as a child, pointed at that being a reader makes saying words aloud so much more difficult, as we really haven't a clue how it really should sound. So true. I do suggest you prepare yourself with tissues, because for every laugh I had at the character's wittiness I also shed a tear for the heartache Loveday had come to accept. I know this is a book I will reread many times, in fact I can already picture the cold winter nights with cocoa in hand and Loveday to keep me company. ARC provided by St. Martin's Press and Netgalley."}, {"userName": "Lisa *OwlBeSatReading*", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/4695379-lisa-owlbesatreading", "userReview": "What can I say? I'm lost for words!Loveday on her passion:'Anyone who’s worked in a bookshop for longer than an afternoon will tell you that people buy books for all sorts of reasons. There’s the simple love of books, of course: the knowledge that here is an escape, a chance to learn, a place for your heart and mind to romp and play'.I read that statement, and I was sold. I knew I'd love this book.Stephanie Butlands story started out as a quirky, cute little read. So bookish and perfect for anyone who has a penchant for books about books. Lost for Words is the name of the book shop where our main protagonist works. Loveday (yes, that's her wonderful name, and strangely my kindle auto corrects it to the word library, which pleases me) is a sweet, quiet soul, who has wonderful relationships with books and words, but humans, well, that's a different matter altogether. Loveday on people:'I don’t really do ‘nice until you prove you’re not’– I find it saves time to work it the other way around, in the normal way of things'.She spends her days working in the second hand book shop, reluctantly dealing with customers and colleagues, just wanting to be left to immerse herself in books. They're her escapism, for which I completely get. She's so passionate about poetry and stories, her body is a canvas of book~quote tattoos. Wow, I just love that!As the story unfolds, it becomes apparent that Lovedays introverted personality is the product of a childhood trauma, and she's dealing with it. That's until strange packages start to arrive at the shop, and Lovedays world is turned slowly upside down.All the characters in Lost for Words are so convincingly real. Loveday has so many endearing qualities, she's funny, dry and full of wit. But she doesn't even realise it, she's adorable. Archie, her book shop boss had me visualising Sir Ian McKellen playing the part. And Nathan. Lovely gorgeous, bonkers Nathan, with his DM's laced up all wrong, he is a magical, mystical character. And rather bookishly good looking I'd imagine.The chapters range from 'Poetry', 'History' and 'Crime', with various timelines that steadily combine to form the 'bigger picture' and pull the reader in with emotionally charged realism. I felt as though I was 'people watching' in this book. At times I was THAT ENGROSSED that I felt as though I was hiding at the end of the bookshop, (among the Classics) ear-wigging everything that was going on!Everyone and everything sat very vividly in my mind, and that is a sure sign of superb writing.Lost for Words is an enlightening, powerful and rather heartbreaking read. There's lots of life~lessons in here as well as laugh out loud moments. Bad stuff happens to good people sometimes, and there's nothing you can do about it apart from accept it and move forward.For those of you who enjoyed Gail Honeymans 'Eleanor Oliphant is Completely Fine', I urge you to give this book a go. I found a few similarities throughout the story, which I loved because Honeymans book was brilliant. And so is this. I'm going to give this a 4.5 star rating, rounded up to 5 stars as 4 isn't enough. And it's going on my 'best of 2017' Goodreads shelf.I'd like to thank the author, Stephanie Butland, Zaffre Publishing and NetGalley for the opportunity to read this in exchange for an honest review."}, {"userName": "Karen", "userReviewDate": "Apr 25, 2017", "userURL": "http://www.goodreads.com/user/show/1119019-karen", "userReview": "Having loved Stephanie’s last book, The Other Half of My Heart I just knew I was in for a treat with this one – and the story is set around a book shop. What’s not to like!Loveday Cardew hasn’t had the happiest of lives. Until she met Archie, the owner of a second hand bookshop ‘Lost for Words’, she had had a troubled life but she was a survivor and such an intriguing character. Sometimes I felt so much sympathy for her, and at others she frustrated me with her stubborn and unmoving attitude. I was however very fond of her and was desperately hoping that she would a find a happy ever after – in whatever form that would be.Loveday’s story is told by way of different titled chapters – ‘History’ slowly reveals details of her childhood; ‘Crime’ tells of more recent events and ‘Poetry’ is in the present time and her experiences at a local poetry group. All the differing strands come together to form a superbly rounded story which may tug at your heart strings – it certainly did mine.The story hints at events in her past and I’m not going to reveal any of them here. All I will say is that because of what has happened to her, Loveday has become a self-sufficient character, she doesn’t want to be beholden to anyone and can be rather prickly. She keeps her secrets close and doesn’t trust easily, preferring to spend her time with books rather than people (I can understand that!). Can Nathan, a local poet, be the one who can break down her self-imposed wall of self-protection– or is Loveday determined to avoid any emotional attachment at all costs?There wouldn’t be a story without the characters but the bookshop is at the heart of it. The irrepressible and eccentric Archie, who, underneath a gruff exterior has a heart of gold, some of my favourite scenes were with Archie and Loveday. The quirky Melody, Loveday’s colleague at the bookshop, the very thoughtful Nathan. There are other characters who didn’t bring out the best in me and the least said about them, the better!Stephanie Butland always writes so beautifully, and her characters are so well rounded with distinct personalities and emotions. The story moves back and forth in time, slowly revealing details of Loveday’s past whilst the reader follows Loveday through the present. Between the pages you will find sadness, humour and even a little bit of mystery as Loveday tries to discover who is leaving books for her at the shop.As soon as I started reading Lost for Words I knew I was going to love it, and I wasn’t disappointed. If Loveday doesn’t steal your heart, then I’m sure that Archie and his bookshop will!"}, {"userName": "Emma", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "A bookshop is not magic, but it can slowly heal your heart.This was a heart warming book. What happens to us when life goes wrong at an early age? This is the story of love, redemption, healing, expression and overcoming our fears. An interesting cast of characters and the book shop setting help Loveday grow into herself. A coming of age tale..."}, {"userName": "María Valero (Mecomenloslibros)", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/51486503-mar-a-valero-mecomenloslibros", "userReview": "INSTAGRAM: @mecomenloslibros✨¡Buenas tardes, chic@s!✨Ayer terminé ✅ LA VIDA ESCONDIDA ENTRE LOS LIBROS de Stephanie Butland. ⭐️4,5/5⭐️ No puedo decir con palabras lo agradecida que estoy con @lince_ediciones por haber elegido enviarme este ejemplar. Ha sido una historia maravillosa que tardaré tiempo en olvidar.✨✨✨✨Loveday es una chica muy especial. Tras un suceso horrible que destrozó su encantadora infancia, encontró en los libros el lugar donde esconderse y sentirse ella misma. Han sido siempre su refugio, tanto que trabaja en una libre de segunda mano y su cuerpo está lleno de tatuajes con las primeras frases de algunas novelas que le han gustado.Pero el pasado siempre vuelve a buscarte y debes estar preparado para reencontrarte con él.✨✨✨✨El libro, ya de primeras, me enamoró tanto por su portada como por su título.La novela está escrita en primera persona, por lo que te introduces enseguida en la historia, y va intercalando capítulos con 3 momentos diferentes: el presente, un pasado inmediato y otro con los primero años de su infancia/ adolescencia.✨✨✨✨Cuando empecé a leerlo, pensé que se trataba de liter feel good, esa que descubrí hace poco y que me encanta. Pero la vida de Loveday después del suceso horrible no ha sido de color de rosa. A partir de entonces, su forma de ser cambió y se esconde de todo contacto humano. Sin embargo, ha tenido la suerte de encontrar por el camino a personas que se han preocupado por ella y la han querido y comprendido. Entre ellas está Archie, el dueño de la librería que la contrató cuando ella no era más que una adolescente de 15 años. Un hombretón gordinflón y achuchable que me ha parecido un personaje tan entrañable como excéntrico (como la propia Loveday).✨✨✨✨Ha sido una lectura maravillosa que, a pesar de sus momentos duros, está llena de esperanza y resurrección. Vuelvo a darle las gracias a @lince_ediciones por poner en mi camino esta histor inolvidable. Un libro con frases tan bonitas que también serían merecedoras de estar tatuadas en la piel.✨✨✨✨#lavidaescondidaentreloslibros #stephaniebutland"}, {"userName": "Judy", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/5778052-judy", "userReview": "Of course I had to read this book because: 1) it's set in a bookshop; 2) the description ensures a quirky character (which I always love); and 3) it has a cute cover. How could I possibly pass it up? I loved the main character, and get this name - Loveday Cardew. Even her name was interesting. Loveday's father is dead and we don't know where her mother is - at least for a good portion of the book. She works in The Lost for Words Bookshop for another interesting character, Archie. Loveday likes books more than people and she has the first lines of her favorite novels tatooed on her body. Loveday has been working at the bookstore for ten years and all this time has been keeping her past a secret. But someone has discovered her secret and is sending her a message.I truly enjoyed the book and loved the author's lyrical writing style. The characters were quirky and interesting. I didn't realize until after I finished the book that Stephanie Butland is also the author of The Little Paris Paris Bookshop and 84 Charing Cross Road - both of which are on my 'be read' list and were highly recommended to me by friends. I can't wait to read more by this author.Thanks to Stephanie Butland and St. Martin's Press through Netgalley for the opportunity to read this advance copy!"}, {"userName": "Paula Bardell-Hedley", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/53441266-paula-bardell-hedley", "userReview": "“I don’t like people much. Well, some are okay. But not enough to make it a given.”\nWhen the misanthropic Loveday Cardew discovers a tatty copy of \nGrinning Jack\n by Liverpool poet Brian Patten carelessly abandoned on the ground, she cannot foresee that her actions to reunite it with its negligent owner will provoke a sequence of disruptive events in her carefully regulated life.I wasn’t at all sure that \nLost For Words\n by Stephanie Butland was going to be my sort of book. The promotional write-up was tempting, describing it has having the “emotional intensity of \nThe Shock of the Fall\n and all the charm of \nThe Little Paris Bookshop\n and 84, Charing Cross Road” – the latter being a great favourite of mine - but it was categorized as chick-lit and romance on Goodreads, which are probably my two least liked genres (i.e. I wouldn’t normally bother to read the blurb after making such a discovery). However, something compelled me to give it a shot, and it was worth the effort.The author lives by the sea in Northumberland, where she writes in a studio at the bottom of her garden. She once worked as a bookseller, but now trains people to think creatively, and is an occasional performance poet – a topic that plays a major role in this novel.Lost For Words is a fictional bookshop in the historic city of York, owned by Archie, an endearing, loquacious, well-upholstered rascal who keeps a paternal but discreet watch over Loveday, his reticent but dedicated assistant. She has worked for him since being in her teens (she’s in her mid to late twenties when the story begins) and is perfectly content to continue doing so indefinitely.Loveday may show every outward sign of being a sulky, uncommunicative emo, but she’s actually quite a compassionate character, it's simply that she prefers books to people. This is unsurprising once you learn that her life has been difficult, and she has a past she would rather forget. I felt an instant warmth for her because (like me) one of her special books is A.S. Byatt's Possession, which is partly set in her home town of Whitby. Byatt’s famous work is of course a romantic novel, but I somewhat ridiculously prefer to think of it as pure literary fiction.Butland’s book isn’t the sentimental mush I was half expecting it to be – nor is it a particularly cosy read – it’s more a warm at heart mystery novel which sneaks domestic violence, stalking, trauma and mental health issues in through the back of the bookstore. While there’s plenty here to keep us book fetishists happy (lots of literary name-dropping, for instance), there is also a romance of sorts, as well as humour, remorse, love and shelves filled with second-hand volumes.The principal characters’ poetry is heartfelt but not terribly good, although I don’t think it was meant to be. Butland’s novel is, however, an ideal read for the tome-weary bibliophile looking for something undemanding but intelligent to fill a relaxing evening. Many thanks to Bonnier Zaffre for providing an advance review copy of this title."}, {"userName": "Angela Smith", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/2755807-angela-smith", "userReview": "Labelling this as chick-lit I feel I do it a bit of a disservice because there are plenty of weighty issues covered in this story, loss, abuse, mental health and the foster system. This book is also a love story to the written word in that the protagonist, beautifully named Loveday Cardew is a true bibliophile after my own heart. If you have ever felt that a book/s has/have saved you through difficult times you will totally get her.Loveday has a difficult past and although what caused it was fifteen years ago in the story, you can understand why it is affecting her in the now and her ability to trust people and form relationships, feeling books are a safer option. She tried a relationship (albeit a short lived one) with a creep named Rob. It hasn't exactly improved her opinion of people, choosing to trust in Archie (a middle aged bookshop owner) who owns the shop \"Lost For Words\" that she has worked in for the past ten years. Archie is a flamboyant and generous hearted figure who takes care of her even if she doesn't want him to. Loveday has a fiercely independent streak and loves books with a passion. The story starts with her finding a book on the pavement on the way to work. She puts in lost and found in the shop with a notice on the shop window incase the owner sees it. This leads to her meeting Nathan, a performance poet and a part time magician. He invites her to one of their poetry evenings and reluctantly she ends up going. During the book you discover why Loveday is the way she is and her fear of relationships. The book tells her past and present in different sections. I liked the way the book was set out and it had romance as well as real issues without being syrupy or overly sentimental."}, {"userName": "Ana Duque", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/33844219-ana-duque", "userReview": "Los libros sobre librerías siempre me llaman la atención, pero este (aparte del maravilloso ambiente de la librería de Archie) tiene un drama buen documentado, que va abriéndose ante ti y atrapándote poco a poco. Recomendable."}, {"userName": "Inés", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/49073312-in-s", "userReview": "Me ha gustado la historia a pesar de ser algo escuchado,visto y leído un millón de veces,ni siquiera es de un dramatismo extremo pero está bien. También me ha agradado el personaje principal (Loveday Cardew) y los secundarios que la rodean. La manera de narrar de la autora es agradable,incluso sorprendente en ocasiones cuando se dirige directamente al lector que resulta poco habitual y muy curioso.Me ha fallado el tema de la metaliteratura que es abundante en el libro. Cuando hay multitud de referencias literarias pero resultan,en su gran mayoría,desconocidas se pierde la gracia. Un montón de poetas anglosajones que no había oído ni de nombre y mucho menos leído,referencias constantes al libro de cocina de Delia Smith que por lo visto todo el mundo tiene en su casa y otras muchas frases de novelas,estas sí muy conocidas como Ana Karenina por ejemplo que se pierden en significado en el contexto de la historia si no eres de las que se saben el texto de memoria y puedes identificarlas y situarlas a la primera. Pues eso que si hubiera sido Miguel Hernández,Lorca o Machado,si el libro de cocina fuera de Arguiñano y el resto de referencias fueran al menos explicadas por la autora(algunas sí están explicadas pero la mayoría no) hubiera disfrutado mucho más de esta lectura."}, {"userName": "Donna Irwin", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/4026997-donna-irwin", "userReview": "Just loved this book. Just loved Loveday.And set in a bookshop in my home town of York.Wonderful writing.Full review to follow."}, {"userName": "Arantxa", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/59073441-arantxa", "userReview": "Esta lectura no ya sido lo que me parecía, me esperaba encontrar una lectura sencilla de librerías, sí lo admito, me gustan las librerías, pero es algo más que eso, trata temas más profundos y por desgracia muy actuales. Recomendada"}, {"userName": "Moni", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/63971034-moni", "userReview": "Lo siento, pero es un NO. Soso, aburrido, lento... una historia que no avanza, ni engancha. Varias veces lo he abandonado para darme un respiro por si era yo. Me ha costado entender a Loveday(el propio nombre de ella ya debería haberme indicado que no me iba a gustar), es un personaje que no me ha transmitido nada. el mejor Archie, el dueño de la librería."}, {"userName": "Sarah", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/16313113-sarah", "userReview": "As I am slightly obsessed with books, reading, book clubs, book shops (you get the idea) I was really looking forward to reading this story, set in a second-hand bookshop in York (not too far from where I live). I expected a cosy plot line and a little light relief from the heavyweight book I had just finished. The book is all this and so much more, and the old adage \"never judge a book by its cover\" has never felt more apt. There are a couple of hard-hitting events that reverberate throughout the book, and the characters were really engaging and, more importantly, complex individuals. Loveday is the central character, and slowly but surely her prickly outer layers are peeled back to reveal what had happened in her life to make her so introverted and mistrustful. A chance incident brings Nathan into her life, and along with Archie, the flamboyant owner of the bookshop where she works, she finds herself part of a support network that allows her to start experiencing life. The book is peppered with little descriptions that reveal the authors love of books, and Loveday herself has a poem that most bibliophiles can related to. The book made me laugh and cry, and very glad that I had read it. Thanks go to the publishers and net galley for the advanced copy in return for an honest review."}, {"userName": "Jeanette", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/2016189-jeanette", "userReview": "I rather liked the cover, which initially attracted my attention. Plus the story has a bookshop! I am always up for trying something different from my usual and this was such a book. I'm glad i did, as i enjoyed more than i thought i would. I am not going to write what the story is about, as i do prefer one to read a book for themselves, but i think this book is worth a read. I'm sure my 18 yr old granddaughter would love it!My thanks to Netgalley and the Publishers for my copy."}, {"userName": "Jill's Book Cafe", "userReviewDate": "Apr 16, 2017", "userURL": "http://www.goodreads.com/user/show/6663999-jill-s-book-cafe", "userReview": "Having read and loved both of Stephanie Butland's previous books I was looking forward to reading this latest title and I was not disappointed. In fact, I think this is the best so far - I loved it. Of course as an ex librarian, with an obsessive passion for books, I was probably pre-disposed to be enchanted by someone who prefers books to people, I can quite understand the notion that you know where you are with books.Loveday works at the second-hand bookshop Lost for Words. She is a fascinating character, that we gradually get to know as the book unfolds, by means of a multi thread narrative looking at the past (history), present (poetry) and a more recent past (crime). She is a troubled soul, that prefers the solace and comfort of books to the everyday interaction with people who she tries as near as possible to keep at arm's length. Archie, her boss and what passes for a friend (or as near as she'll allow) is the guardian angel that stepped into her life when she needed one most and has remained constant.Don't be fooled by the cosy cover, this is a story with a mystery at its heart, that deals with some hard-hitting subjects. As a balance it also has humour, especially when Loveday offers her wry and often acerbic views on people, especially people who inhabit bookshops. From experience I can confirm that the same people also inhabit libraries and exhibit the same traits that had me nodding in heartfelt agreement.I have no intention of revealing anything about the plot than that revealed in the blurb. This is a story that needs to be read, without any hint of what happens or might happen next. It is a story that works because the characters are exceptionally well drawn, realistic and believable. Loveday is a character that I defy you not to be enchanted by, despite her failings, she has an outer confidence and self-reliance that hides her inner brittleness and fear of relationships. Archie, her boss, is a whirlwind of larger than life bonhomie, with a collection of life tales that no-one is ever sure is true, but his heart of gold is never in doubt. Then we have Rob and Nathan, who both vie for Loveday's affections, with differing strategies and success, all I will say is I might be a little bit in love with one of them myself, but you'll need to read it yourself to discover who that might be. This is a book that as all the elements that I look for in a good read, great storyline, believable characters and a perfect balance of humour, pathos and romance. It had me smirking one minute and almost in tears the next. With several 'nooo' moments this book was heartwarming and heartbreaking in equal measure with more than one heart stopping moment. I have no hesitation in recommending this book, it is quite simply brilliant.I received a review copy via NetGalley for the purpose of this review."}, {"userName": "Storyheart", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/12351598-storyheart", "userReview": "4.5 stars. Loved this engaging, heart-warming story of a damaged young woman rebuilding her life through gradually learning to trust in love."}, {"userName": "Sumaiyya", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/8240536-sumaiyya", "userReview": "This was such a heartwarming story about a young woman who works at a bookstore. Lost for Words was a comfort read for me, and as a bookworm I really loved reading about a bookish protagonist. I'd recommend this if you're looking for something light to read that has a bit of a dark twist."}], "description": "The Lost for Words Bookshop is a compelling, irresistible, and heart-rending novel, perfect for fans of The Storied Life of AJ Fikry and  The Little Paris Bookshop.Loveday Cardew prefers books to people. If you look carefully, you might glimpse the first lines of the novels she loves most tattooed on her skin. But there are some things Loveday will never, ever show you. Into her hiding place - the bookstore where she works - come a poet, a lover, and three suspicious deliveries. Someone has found out about her mysterious past. Will Loveday survive her own heartbreaking secrets?", "title": "The Lost for Words Bookshop", "url": "https://www.goodreads.com/book/show/38122541.The_Lost_for_Words_Bookshop", "average": 4.16, "cover": "https://images.gr-assets.com/books/1519488222l/38122541.jpg", "reviews": 569, "authors": [{"url": "https://www.goodreads.com/author/show/5276201.Stephanie_Butland", "name": "Stephanie Butland"}], "type": ["Fiction", "Writing", "Romance", "Contemporary", "Womens Fiction"], "outlinks": ["http://www.goodreads.com/book/show/38122541-the-lost-for-words-bookshop", "http://www.goodreads.com/book/show/34320324-lost-for-words", "http://www.goodreads.com/book/show/37946044-the-lost-for-words-bookshop", "http://www.goodreads.com/book/show/36347878-the-lost-for-words-bookshop", "http://www.goodreads.com/book/show/34825191-lost-for-words", "http://www.goodreads.com/book/show/38146614-la-vida-escondida-entre-los-libros", "http://www.goodreads.com/book/show/38587121-la-vida-escondida-entre-los-libros", "http://www.goodreads.com/book/show/37435951-the-curious-heart-of-ailsa-rae", "http://www.goodreads.com/book/show/25546444-the-secrets-we-keep", "http://www.goodreads.com/book/show/25124092-the-other-half-of-my-heart", "http://www.goodreads.com/book/show/14486106-how-i-said-bah-to-cancer", "http://www.goodreads.com/book/show/20144977-thrive"]}