{"ratings": 1752, "userreviews": [{"userName": "Tulay", "userReviewDate": "Mar 03, 2017", "userURL": "http://www.goodreads.com/user/show/36800166-tulay", "userReview": "Couldn't put it down.If you're interested reading this book, please read the City of Echoes first. You'll understand and like this book more.Dr. George Baylor and LAPD detective Matt Jones are very strong characters, but they're opposite end of the humanity scale. Escaped serial killer is suspected of murders of family in Philadelphia, Jones there to help and catch him. He's working with power hungry people, they don't listen him. Story moves very fast, meantime Jones learns more about the skeletons in his family attic.Really enjoyed this book and learned the meaning behind Philadelphia, sculpted Robert Indiana."}, {"userName": "Sean Peters", "userReviewDate": "Sep 03, 2016", "userURL": "http://www.goodreads.com/user/show/14058345-sean-peters", "userReview": "Firstly, thank you to Net Galley, the publishers and the author Robert Ellis.My first book by this author, but not my last !Approved this book and decided with the authors comments in the introduction with this book, that you can read number 2 in the series, I agree this book gave me the information I needed to follow this book and pick up from number 1.Agreed if you can read number one please do. After reading the second one in the series, I'm love this author.For the past six weeks, LAPD detective Matt Jones has been recovering from the wrong end of a hit man’s bullet. Before he can look for payback, Jones finds himself enlisted in the manhunt for an old foe. Dr. George Baylor, the serial killer who escaped after murdering three coeds in LA, resurfaces on the East Coast. This time, an entire family has been slaughtered in their home outside Philadelphia, and the doctor’s fingerprints are all over the crime scene.With panic rising, the FBI seeks Jones’s help, and the hunt for this brutal mass killer is on. But so is the hunt for the man who paid to have Jones shot. When a second family is found murdered, the search for the killer becomes frantic, and Jones’s shocking personal history explodes before his eyes. With his two missions welded together as one, Jones enters the madman’s world—a place of unimaginable terror—and hopes that if he survives, he can find his way out.Seems like Matt is betrayed by everyone he trusts plus everything he believed about his childhood gets called into question. I don’t want to give anything away, so you’ll have to read this book for yourself, which I recommend you do!The reader will experience such a wide range of emotions - fear, dread, laughter, sadness and shock! . The story is very powerful, the emotions deep, the shock head-shaking and the sadness real, the murders graphic.Adding some great touches of humour, clever twists, you have a fast paced action crime thriller.Robert Ellis is a great author, bringing together a perfect crime/detective story with a very nasty serial killer, some very gory murders, some great characters and a very well put together story, with great and clever twistsNow I am adding this author to the list of favourite authors of mine, not bad after one book.Now will look out for his Lena Gamble books.Hope that I can persuade the author to do a Q & A's For my group \" A Good Thriller\""}, {"userName": "Linda Strong", "userReviewDate": "Jul 28, 2016", "userURL": "http://www.goodreads.com/user/show/13684015-linda-strong", "userReview": "Dr. George Baylor, the serial killer (CITY OF ECHOES) who escaped after murdering three students in Los Angeles resurfaces on the East Coast. Detective Matt Jones is still recovering from bullet wounds received from a hit man, courtesy of his own father.Finally cleared to return to work, Matt is assigned to the task force to hunt down Dr. Baylor. An entire family has been slaughtered in their home in Philadelphia and the Doctor is the number one suspect.When a second family is brutally murdered, the hunt becomes very personal for Matt. Before too long, he has alienated the LA police, and the FBI with his own theory … one that will change the whole picture.This is an amazing crime thriller! I was riveted to the plot from page one and was sorry to see it end. I have not read the first book in this series, so I see a shopping trip in the very near future.There are so many twists and turns which change the whole story. The plot line is seamless. The character development is finely drawn. Matt is a man of many layers. His personal issues include his biological father who tried to have him killed. He has been unable to locate any history of his own deceased mother and aunt who raised him. What he learns about himself and his family during this investigation blows his mind. Highly recommended!Many thanks to the author / Thomas & Mercer / NetGalley who provided a digital copy in exchange for an honest, unbiased review."}, {"userName": "Monnie", "userReviewDate": "Aug 08, 2016", "userURL": "http://www.goodreads.com/user/show/6277675-monnie", "userReview": "This is the second book in the series featuring Detective Matt Jones of the Los Angeles Police Department, and from where I sat (Kindle Fire in hand), it's a winner. Despite the author's note in the introduction that it's best to read the first book first - to which, as a general rule of thumb, I heartily concur - I hadn't done that, but neither did I have any trouble following the action in this one.And boy, there's plenty of it - and for those who lean toward the squeamish, I'll warn that some of it is rather grisly. Jones is well on his way to full recovery after being shot by a hit man - which I presume happened in Book No. 1 - when he gets tapped to help the FBI with a case just outside Philadelphia. There, he encounters the gruesome murder of an entire family in their home (complete with sexual overtones). The killer is thought to be Dr. George Baylor, a serial killer Jones tried, unsuccessfully, to capture once before (also, I presume, in that first book, which for the record is City of Echoes). Jones wants to help, although the across-the-country assignment threatens to take valuable time away from his mission of finding the person who funded the hit that nearly took his own life. But as he delves further into the family's murder, doubts begin to creep in as to whether it's really the work of the not-so-good doctor. Those doubts grow stronger when a second family bites the dust in similar fashion.The FBI, though, always gets its man, and the powers-that-be are hell-bent on making sure it happens in this case as well. Jones goes head-to-head (and in one case, head-to-bed) with a couple of them as he tries to sort out the details and track down the killer. Along the way, he learns a few things about his personal background that are unsettling, to say the least. All of that means some unexpected plot revelations that will, no doubt, carry over to the next installment (the ending in this one certainly is a killer).So count me in with those looking forward to hooking up with Jones in the [hopefully near] future - and I thank the author and publisher, via NetGalley, for the opportunity to read and review this one. Great story, great writing and a thoroughly enjoyable reading experience!"}, {"userName": "Jim", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/36199787-jim", "userReview": "This book is the 2nd book in the Matt Jones series and follow up to City of Echoes. Jones is recovering from his wounds when he is assigned to a FBI task force to apprehend Dr. George Baylor who appears to have resurfaced on the east coast. An entire family has been brutally murdered in a wealthy Philadelphia suburb (Radnor). The evidence seems to indicate Dr. Baylor is responsible. When a second family is brutally murdered a short time later the manhunt becomes frantic. It doesn't take long for Matt Jones to decide that this is not the work of the insane doctor responsible for the murders of the coeds in City of Echoes. These murders are a new level of depravity. They could not have been committed by the same person could they? Unless Dr. Baylor's insanity has reached an even darker place. But Jones is alone in his belief that they should be looking elsewhere. He has no support from anyone else on the task force. The FBI wants it to be Dr. Baylor. It has to be Dr. Baylor. Any support that Matt Jones gets in his pursuit of the murders will be from surprising sources.In City of Echoes we learned that Jones father had abandoned him and his mother, that his mother had died of cancer, and that his father was a wealthy Wall Street tycoon who would go to any length to protect the fact that he had walked away from his first wife and son. Even hire someone to eliminate the son he refuses to acknowledge. In this story Jones will have to deal with his personal history and come face to face with the several demons. He may wish his father was dead. He may have dreams of killing his father himself. But how far is Matt Jones willing to go to get back at the father who abandoned him and hired someone to kill him? How many degrees of separation are there between him and Dr. Baylor? If he acts out on killing his father are they that different?This was a fast paced and action packed story. Read the story and you enter a very dark world of madness and insanity that spirals downward and out of control. Some of the situations were not very believable but nonetheless it is a good story. You don't have to read City of Echoes before reading this 2nd Matt Jones story but it may help to know what happened in that story. On a purely personal note I live near Philadelphia and am familiar with Center City. It was interesting reading about places, streets, radio stations, etc. that I am familiar with. I could visualize the scene when the story mentioned places like the Art Museum area, Love Park, Market Street, Filbert Street, etc."}, {"userName": "Pat", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/7407123-pat", "userReview": "Woo hoo what a ride! This book picked up six weeks after the events of the previous book - City Of Echoes. It appears that the mad and very bad Dr Baylor is up to no good again as his fingerprints have been found a murder scene, this time in Philadelphia. But this time its different. Not content with murdering the child of an unethical businessman/professional, a whole family has been murdered and posed in a gruesome tableau.Matt is called in to assist the FBI as he has experience in hunting Baylor. Matt's new boss though warns him to be very careful, he is concerned that Matt may be being set up for a fall.The murder scene bothers Matt, however. But soon another family is murdered. Things start to niggle and Matt is soon wondering if perhaps the FBI got it wrong and there is another murderer at large. His views are not welcome and it seems that the FBI and Department of Justice are only baying for Baylor's blood and ignoring other possibilities.Matt becomes convinced there is something very fishy going on but soon finds himself under suspicion. You just know this is going to get ugly so you strap yourself in for the ride to the finish line. And what a ride it is. Matt is no angel, he has his own dark side so is a very interesting character. There are some shocking revelations. Matt finds out some disturbing things about his family background and you hurtle towards a totally apocalyptic ending. Great story, great characters (I kind of actually like Dr Baylor) and a bit of a pointer to another possible book in the series. Oh yes please.I really, really, like Robert Ellis's books."}, {"userName": "Michelle", "userReviewDate": "Sep 05, 2016", "userURL": "http://www.goodreads.com/user/show/6345207-michelle", "userReview": "I really don’t understand all the positive reviews for this novel, when it was actually worse than the first novel in the series. The first had some issues that I tried to overlook—like why such a high profile case involving the murder of one of their own was entrusted to a detective who had never led a homicide investigation before; and a romance that occurred out of nowhere, feeling forced and inappropriate, with nary a guilty thought by our honorable protagonist. But this second installment just had too many issues to be ignored.It takes places about 6 weeks after the first novel timeline ends, with the LA co-ed serial killer still loose and now believed to have surfaced in Philadelphia. But now, he apparently has a completely different MO that no one finds questionable except rookie detective, Matt Jones, who is called in by the FBI to assist in their investigation. Whereas the co-ed serial killer character was developed just enough to believe he possessed the necessary medical training, intellect, and finesse to commit the murders and escape capture, the author fails to create a convincing character in the “real” killer. At no time did I believe he possessed the cunning intellect and ability required to sneak up on trained professionals, break into billion dollar mansions—which likely would be surrounded by top notch security systems—and pull off such depraved and heinous crimes single-handedly, all with sophistication and ease, and leaving no evidence behind. It was really just too implausible to be believed.So much for finding a LA police procedural series to satisfy my fix between Bosch novels. The search continues while I wait for Connelly’s next release in November…"}, {"userName": "Trish R.", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/23070724-trish-r", "userReview": "Spoilers, maybe..Well, as of 25% I really didn’t think I’d like Matt in this book. His thoughts of murder and how to get away with it just don’t do it for me. But it turned out OK. But, man, every time you turned around he was in trouble. AND, I know, I know, Dr. Baylor was a serial killer but when he was with Matt I really liked him. Whereas, Rogers and Doyle were real jerks and Kate turned out to be even worse. What a piece of work she was. And the info that came out about Matt was just incredible. And, OMG, what this new serial killer had his victims doing was soooo horrible. And what Andrew and his mother were doing was totally disgusting. And when Andrew hooked up with Avery Cooper…EWW. She was some kind of sick! This book had an amazing storyline and ending, although it was left open for another book. I just hope we can have a story without Matt smoking or chewing nicotine gum.There was no sex that was described but there was some really gross sex hinted at.The F-bomb was used 28 times.This was a really good murder/suspense, I enjoyed every word of it AND this time the author gave you a few more descriptions of what people looked like. As to the narrator: Nick Podehl was just as amazing in this book as he was reading City of Echoes. He laughed, yelled, whispered, everything he was supposed to do. I love his narration."}, {"userName": "Don Gorman", "userReviewDate": "Aug 10, 2016", "userURL": "http://www.goodreads.com/user/show/1311439-don-gorman", "userReview": "(3 1/2). The first Matt Jones book was big fun, and this one is just as good if not a little better. Jones is a terrific protagonist, an easy character to identify with. Hardly perfect, his instincts and smarts carry him all the way. Lots of action, plenty of nice twists and turns here keep you turning pages easily. I am interested to see how Ellis takes this series once the thread that has kept these first two books together has been broken. I look forward to finding out!"}, {"userName": "Terri Lynn", "userReviewDate": "May 08, 2017", "userURL": "http://www.goodreads.com/user/show/5699299-terri-lynn", "userReview": "This second book in the Detective Matt Jones series takes up around 6 weeks after the events in the first book. It appears that Dr. George Baylor, the serial killer from the first book, is now in Philadelphia having escaped from Los Angeles and killing whole families rather than lone young women. He had killed 4 young rich women in Los Angeles to punish their parents for wrong-doing but now seems to be killing off the rotten dads and their wives and kids and posing them, having the teen boys have intercourse with their mothers before death. The FBI wants Matt's help because Matt had encountered the doctor before and in fact, the doctor saved his life twice. Not everyone on the FBI team seems happy to have Matt there. Again, he makes a stupid mistake with a woman, this time an FBI agent who is also sleeping with the prosecutor. Right away, Matt realizes that the two sets of murder here are totally different from the doctor's style though the male victims have some similarities to those preferred by the doctor such as one who is also a doctor who had given perfectly healthy patients cancer diagnoses, chemo and radiation to defraud insurance companies and had caused serious health problems. Oddly enough, when Matt goes to the houses where the families were killed, Dr. Baylor keeps showing up. He takes Matt's gun while they are together but doesn't try to hurt Matt and always returns the gun. Dr. Baylor says he didn't kill the families but had considered killing the men. He said there is another killer afoot. He warns Matt that the FBI will want to pin these crimes on him and says he even put some of his own fingerprints at the scenes to confuse them.Poor Matt finds out that it is true. The FBI and prosecutor are hostile to Matt's info that it wasn't Baylor and he is forced to seek out the real killer himself- only the real killer has Matt in his sights!"}, {"userName": "Carrie Garza", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/26467461-carrie-garza", "userReview": "Just finished The Love Killings, the second in a series by Robert Ellis. Matt is a Los Angeles PD detective. When a heinous murder is committed in Philadelphia that is connected to a serial killer Matt identified in LA, Matt is brought in by the FBI. Only the FBI has their sites set on a serial killer and Matt believes there is new mass murderer. Very good. Frustratingly for Matt, the FBI has tunnel vision, and his career and possibly his life are on the line. Recommend !"}, {"userName": "Barbara Mahan", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/37947837-barbara-mahan", "userReview": "You have to read the first book to know what is going on. I did like both books."}, {"userName": "Dee", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/2794410-dee", "userReview": "Two-haiku review:Whole family killedThey think same perp as first bookMatt goes to PhillyVery excitingMatt's family is revealedHe's really tough cop"}, {"userName": "GymGuy", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/5850785-gymguy", "userReview": "I picked up this book as a \"filler\" waiting for the next Connelly book to be out in a few weeks, and have to say it it was not much more than a \"filler.\" Not sure why there are so many such raving reviews. Now, while I have to say that I did not read the first Matt Jones novel because of weaker reviews, I can't say that this one is a barn-burner. Jones seemed like a total mystery, and at the same time quite unbelievable. He seems to have at least two personalities: highly aggressive when confronted, and at the same time a marshmallow when he's with his superiors. At times he seems weak and naïve and at others brutally aggressive. I just didn't understand him. I also didn't get why he was qualified to do any of the stuff he was asked to do....none of that was explained...he just seems to appear from the ether as this detective savant who solves cases by observing how people look.....Bazar.Alas, I've go 3 more weeks before it's Connelly-time."}, {"userName": "Adam", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/17730092-adam", "userReview": "Eh, it was straight stereotypical good guy bad guy, the man is out to get me. I remember liking the first one in this series much better. The narrator did a great job with men, however all the women came off as the damsel in distress. Eh."}, {"userName": "Sheila", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/3349264-sheila", "userReview": "This book was special. Not just one serial killer. Matt is sent to Philadelphia to help the FBI catch the serial killer Dr. Joseph Baylor who he has experience with. Things are not as they seem once he gets there."}, {"userName": "Stacy Bearse", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/6516164-stacy-bearse", "userReview": "A chilling psycho crime thriller, written to keep you turning pages late into the night. Graphic, gory and gut-wrenching, Ellis' novel is focused, ironically, on the city of brotherly love. As much as I liked the author's punchy style, a handful of plot points just don't add up ... so here's another book to approach by suspending reality, and just going along for the ride."}, {"userName": "Coreen Arioto", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/62017755-coreen-arioto", "userReview": "The love killingsI must say this book had everything you'd want in one great mystery. This was the best you thought you were at the end and turn the and there's more. Hat's off for Matt Jones.! ! !"}, {"userName": "Sharon", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/28180449-sharon", "userReview": "Thomas & Mercer and NetGalley provided me with an electronic copy of The Love Killings. I was under no obligation to review this book and my opinion is freely given.Six weeks after Detective Matt Jones becomes involved in his first murder case, he is still coming to terms with the fact that his father hired an assassin to kill him. Called into work by his new supervisor, Lt. Howard McKensie, in the middle of the night, Jones knows it is not an ordinary case. Dr. George Baylor seems to have struck again and an assistant US prosecuting attorney by the name of Ken Doyle has requested Jones for his expertise in the matter. Temporarily relocating to Philadelphia as an agent for the government was not in Matt's game plan, but he does have some unfinished business in the area. With a complicated and dangerous serial killer lurking in the shadows, who is Matt Jones more threatened by - his father or Baylor?As this book builds upon the events in City of Echoes, it is essential to read the series in order. Detective Matt Jones is a complicated man and it is impossible to get a clear picture of his character without the continuity of the story. The only problem that I had with The Love Killings was the fact that the criminals contained within are all masterminds. A sophisticated killer is not all that common, especially one with a planned signature, so I did not feel it was a successful part of the plot. That being said, I am definitely interested in seeing where author Robert Ellis takes Detective Matt Jones into the future. Readers who like police procedural thrillers and suspense would like this determined and interesting main character, as well as the complicated plot twists."}, {"userName": "Lynn Perry", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/44487167-lynn-perry", "userReview": "Well Written, Tight Story With (Almost) All Loose Ends Accounted ForThe one outstanding \"loose end\" is one that even this reader didn't want to see tied too quickly - for it leaves open the possibly of one or more sequels - until the nephew finally brings the uncle to justice. The storyline moved fast with a tale worth telling, involving some cookie-cutter type characters, who were interesting nonetheless, including a \"Natural Born Killers\" duo, a \"Gordon Gekko\" or two, and civil servants more interested in promoting their own self-interests than in serving the pubic. There were a couple of \"surprise\" murders in here that I was personally a little dissappointed with, and just a lot of unneccessary killing in general near the end of the book - but thankfully, no gruesome depictions. Incest was also a subject-matter - and somewhat of a focal point - in the development of the story - a point I mention solely as a \"heads up\" for those who might be offended by such content. The main character, Matt, is really the glue of the book - a truly likeable and honourable guy. - so much so, that I'm gonna go back now and read \"Book 1\" - and keep on the look-out for \"Book 3\" ( assuming it's not already out)."}, {"userName": "Dave Michalski", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/43543558-dave-michalski", "userReview": "The author does a great job building on his first story which you should read to understand the history of the characters and the main character. Solid story with lots of twists and turns. The drama builds quickly and before you know it the action takes over. Interesting parallels to other serial killer types so the new villain fits right in.This is a good read so don't mis it!"}, {"userName": "Janine", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/904936-janine", "userReview": "[ Teenage boys being forced at gunpoint to have sex with their mothers while the rest of their families (who are naked of course) are forced to watch and then everyone is killed? (hide spoiler)]"}, {"userName": "Lora King", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/3451479-lora-king", "userReview": "Well now what do I do...I've run out of all the Lena Gamble and Matt Jones books! In this #2 Matt Jones series book, Matt comes to Philadelphia to help with murders that the prosecutor & FBI think is the work of Dr. Baylor. But Matt seems to be able to see things that they can't or won't....is there someone else out there killing affluent families? A fine detective novel."}, {"userName": "Vicky Fox", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/75923936-vicky-fox", "userReview": "Terrifying and gripping. Hard to put down .A great read but make sure you have a strong stomach. Keeps you guessing what will happen next. Matt Jones doesn't disappoint as he ferrets out the truth that eludes everyone else. Highly recommend reading this series."}, {"userName": "Andrea  oller", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/69444831-andrea-oller", "userReview": "One of the best books I've ever read!Another gripping and suspenseful book!! There is so many twists and turns, that again I was guessing until the very end! One of my new favorite authors, thank you for an amazing read!!"}, {"userName": "Mike Margary", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/46559458-mike-margary", "userReview": "Top stuff, Matt Jones books 1 & 2, just great.In my opinion it is important to read these two excellent stories in sequence. Gripping from start to finish. Wonderful tales, twists throughout. Will now read all Robert Ellis I can."}, {"userName": "Mary", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/44703273-mary", "userReview": "Great sequel This book kept me yearning to read more quickly to find out what happens! I kept finding myself skimming ahead just so I could know what happened as quickly as possible to then reread the page so not to miss any details. Great sequel and great read!"}, {"userName": "Randy Ramsey", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/26630031-randy-ramsey", "userReview": "Two for two with this seriesI've enjoyed the first two books in this series. The characters are quite intriguing even though none of them could be misconstrued as good upstanding people. Storylines are really strong."}, {"userName": "Eva Raley", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/47483124-eva-raley", "userReview": "GoodLike the characters, even if one knows he is not the smartest when it comes to women. The killings are graphic and over the top, but that is what happens when you read serial killer novels."}, {"userName": "Luann", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/1108506-luann", "userReview": "Another great Matt Jones story. Even though we know who the killer is, Ellis doesn't disappoint with a surprise I didn't see coming."}], "description": "For the past six weeks, LAPD detective Matt Jones has been recovering from the wrong end of a hit man’s bullet. Before he can look for payback, Jones finds himself enlisted in the manhunt for an old foe. Dr. George Baylor, the serial killer who escaped after murdering three coeds in LA, resurfaces on the East Coast. This time, an entire family has been slaughtered in their home outside Philadelphia, and the doctor’s fingerprints are all over the crime scene.With panic rising, the FBI seeks Jones’s help, and the hunt for this brutal mass killer is on. But so is the hunt for the man who paid to have Jones shot. When a second family is found murdered, the search for the killer becomes frantic, and Jones’s shocking personal history explodes before his eyes. With his two missions welded together as one, Jones enters the madman’s world—a place of unimaginable terror—and hopes that if he survives, he can find his way out.", "title": "The Love Killings\n      \n          (Detective Matt Jones #2)", "url": "http://www.goodreads.com/book/show/26070005-the-love-killings", "average": 4.34, "cover": "https://images.gr-assets.com/books/1465663813l/26070005.jpg", "reviews": 111, "authors": [{"url": "https://www.goodreads.com/author/show/4385962.Robert_Ellis", "name": "Robert  Ellis"}], "type": ["Mystery", "Mystery", "Fiction", "Thriller", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/26070005-the-love-killings", "http://www.goodreads.com/book/show/25050652-city-of-echoes", "http://www.goodreads.com/book/show/575135.The_Dead_Room", "http://www.goodreads.com/book/show/17735247-access-to-power", "http://www.goodreads.com/book/show/503005.City_Of_Fire", "http://www.goodreads.com/book/show/5420355-the-lost-witness"]}