{"ratings": 10096, "userreviews": [{"userName": "Lee", "userReviewDate": "Jun 21, 2014", "userURL": "http://www.goodreads.com/user/show/4369018-lee", "userReview": "[Even when it makes no-sense whatsoever. Our brains will evolve to be four dimensional? Really? (hide spoiler)]"}, {"userName": "Dan", "userReviewDate": "May 19, 2014", "userURL": "http://www.goodreads.com/user/show/7325648-dan", "userReview": "I feel this series is a classic \"marmite\" series in that you will either love it or you will hate it. As this is the third book I expect everyone to have decided what they think by this point but I am one of the former. I adore the light-plot style of these books with them focusing more on a journey through amazing worlds with a limited plot point that ties the characters together. I thought this one was the best of the series so far.The Long Mars is probably an inappropriate title as it is one of the narrative threads which is least important here. Sally Lindsay joins her father, who invented the stepper and caused lots of trouble, and astronaut Frank on an expedition across the Long Mars, the endless line of parallel Marses. Like Earth, most are similar to the original but some are very different. And just what is Sally's father looking for?We also get another twain trip as we see the continuing adventures of Maggie Kauffman as she captans a twain further across the Long Earth than has ever been seen before. Here are some of the best worlds of the series so far, including a fantastic crab world. We also learn a little bit more about the Beagles as Snowy joins the expedition. And then the main arc of the book, although given less time until the end, is Joshua Valiente investigating \"the Next\" a group of evolved humans from Happy Landings. They are essentially the improved version of Homo Sapiens, the ultra intelligent and a really good Midwich Cuckoos feeling is created. Stephen Baxter has used the idea before but it it developed better than ever as humanity has to decide what to do with the Next- destroy them, detain them or no nothing at all. There are no easy answers. This book gives us endless worlds, quite literally, to satisfy the imagination. For the first time we have endless Marses as well as endless Earths. It is perhaps a little slow most of the way through as we travel with the characters but the ending is dramatic with a tense debate about the fate of the Next. More than ever this book is about ideas rather than plot but it has enough of a storyline to make it worthwhile whilst packed full of some fantastic ideas. I wonder where the series will go next..."}, {"userName": "kate", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/18637558-kate", "userReview": "This book had three parallel stories, and I enjoyed two of them. Unfortunately, the third one was the source of the title, so it was kind of important. I enjoyed the on-going adventures of Joshua Valiente, but he was kind of lost by the end of the book. His family totally disappeared, but they were fairly unimportant in The Long War as well. I enjoyed the ever further venturing of Maggie Kauffman and her navy crew on board the airships. They travel out into the 100,000,000s and beyond range, where Earth is barely recognizable, and she has to deal with an overzealous captain of the ship accompanying her. I tired of the third story-line, with Sally and her father and Frank traveling out to Mars fairly quickly. Mars is dull and their mission is fairly uninteresting. President Crowley has swung back to the old \"hate anyone who's different\" stance that he embraced in the first book, but now his targets are the super-smart people who seem to come out of Happy Landings, rather than steppers or trolls. Military nutcases act like military nutcases.Questions I have: 1) Why are there no gay men? There are plenty of lesbians in the series, but no gay men. Weird, right? I've been wondering about this since the first book, and this entry in the series clearly wasn't interesting enough to distract me from that fact. Same with: 2) Why are there no bad women? There aren't any really evil characters of either gender, but all of the unpleasant people are men. I like to believe that I belong to the more reasonable, level-headed gender, but there are certainly terribly women out there, and it's being a bit unrealistic not to depict a single one.I still like the idea of this series. Frankly, I think the only chance that we as a species have to continue existing is if something like this pops up. But I've grown tired of it all. It's dragging, and it doesn't have the pure joy of the Discworld novels to carry me through the boring parts."}, {"userName": "Jeffrey", "userReviewDate": "Jun 30, 2014", "userURL": "http://www.goodreads.com/user/show/7375207-jeffrey", "userReview": "[ there must be a space elevator because the character can't conceive that there wouldn't be a space elevator? And the hunter dude who has never stepped is able to track them across multiple worlds with no problem? And the crazy guy doesn't have a weapon? And, And, and...  (hide spoiler)]"}, {"userName": "Thomas Edmund", "userReviewDate": "Jun 19, 2014", "userURL": "http://www.goodreads.com/user/show/2976142-thomas-edmund", "userReview": "When I saw the next 'Long' series was titled The Long Mars, I immediately credited Baxter and Pratchett for at the very least taking the series places unexpected. Since the mildly disappointing Long War, I was somewhat geared for not so much low expectations, but an assumption that Long Mars would follow a similar pattern of the majority of the book being a sort of sociological exploration with a very intense world(s) changing event at the end.Even with differing expectations this book unfortunately still did not stir much for me. While intriguing the Mars plot simply served as a watered down repeat of the first book (i.e. a lengthy exploration of the many Long Mars) The simultaneous plot-line on the long Earth(s) seemed in fact a direct replica of Long Earth and until the character Paul appeared I was actually struggling to understand what the book was actually about this time.SPOILERS AHEAD (hard to review without them)The major plot-line of 'the next' a super-intelligent variation on humans, was quite intriguing. However, there was relatively little page-time devoted to these guys, and most of the time we just heard repeats of their origins explained to different characters in different situations. I got pretty sick of hearing explanations for 'low' and 'high' bulbsThe ultimate climax - a nuclear warhead threatening 'Happy Landings' was almost tense. Once again (you'll notice a theme here) the beat fell flat, when the situation was bizarrely resolved by the main characters having a debate about whether to set it off (I don't think many personalities are such that they would advocate for a nuclear bomb being used to wipe out an entire subspecies, even in fiction)Which brings me to my ultimate complaint - the characters. Only the barest development of interest occurred briefly for Lobsang, our other well-known folk, Joshua and Agnes (who surely should have had something to think about undergoing the whole transition thing) seemed to just bungle along the storyline with barely a reaction to the plot let-alone experiencing anything too compelling. Some stuff happening for Sally, but honestly who cares about her?Long Earth rates as one of my most frustrating to read series - I so desperately want there to be a continuation of the themes explored in book one - such as the giant transparent thing - or at least more exploration of Joshua V or even Lobsang. I suspect that I am going to be unhappy though, its hard to see what the authors are hoping to achieve with the series, but it doesn't seem to be working."}, {"userName": "Tim Hicks", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/111076-tim-hicks", "userReview": "I have nearly all of Terry Pratchett's solo books, and I've enjoyed some of Baxter's work. Long Earth wasn't bad. Long War was a little disappointing. This one was depressing. It's boring. It feels as if it's written for bright 12-year-olds. And it's sloppy. (Other than that, Mrs. Lincoln, how did you like the play?)There are in fact some scenes where stuff actually happens. But by the time I got to them I was skimming pages, whipping over them in a way disturbingly similar to the twains' flight across millions and millions of timelines. The authors even told us that the crew were bored, as if they were apologizing to the readers for getting lost in a plot theme but the only way out was to keep writing. Or this: they wrote a pretty good book, but it turned out to be 100 pages short, so the publisher told them to just pad out the twain twip (sorry, couldn't wesist that). I tip my hat to the exhaustive exploration of the many ways life might have turned out. I suspect in some places they are playing fast and loose with science, but in others they were careful so I'll let it pass. But exhaustive turned into exhausting and I lost interest. As others have noted, the authors stretch artistic licence in many places. Far too often, characters conveniently spot something during their millisecond over a world. The Mars guy guesses that something must be there somewhere, and luckily finds it, and then explains how hard it is to see! Pratchett would say that narrativium made it happen. Sally's dad is just too much of a jerk to have lived this long. Cutler is ridiculous, and after setting him up as Slim Pickens in Dr. Strangelove, the authors turn him into a pussycat at the crucial moment. The authors seem to have decided that Lobsang is a bit of a dick too, so he's relegated. There is a decent story in here, but it doesn't work as published. This turkey needs a massive rewrite, and should end up about 80-100 pages shorter. Then it would have a chance to be good. I won't read book 4."}, {"userName": "Otherwyrld", "userReviewDate": "Apr 01, 2015", "userURL": "http://www.goodreads.com/user/show/10781757-otherwyrld", "userReview": "How could two of the best SF & F authors of the modern era make a story of two epic journeys across billions of worlds so boring?Virtually the whole book is taken up by these journeys - one across the multiple Earths, and another across similar multiple Mars's - and both journeys come across as \"here's this world and it's got this going on, then there's this different world and it's got this different thing going on\" - and it goes on like this for millions of worlds.Along the way, the authors seem to forget that a book needs a story to make it interesting. It takes 90% of the book before they suddenly realise this and throw in some bogus stuff about pseudo-Marvel mutants to make it seem like they were planning this all along. There was no sparkle, no life to anything in this book. None of the characters were in any way interesting or relateable. What little plot there was was tedious to read. There's an occasional stop on a world that's a little bit different, but it feels like accident rather than design. They even managed to make the eruption of the Yellowstone supervolcano boring. A barely deserved 2 stars"}, {"userName": "Brendon Schrodinger", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/5448792-brendon-schrodinger", "userReview": "I enjoyed the last two volumes in this series because the characters were interesting and the ideas presented were fascinating. They are strange books, there is not so much of a plot to them, they're more like a series of fascinating ideas. Stuff happens, but it's more like a documentation of events rather than a drama. The third book carries on this style, and introduces some new concepts to the Long series, with an expedition to Mars, and then through the Long Mars with Sally. Joshua is embroiled in intrigue with children who are the new super humans that come from Happy Landings, and Captain Kauffman is out on the longest Twain journey to-date. If you enjoyed the previous ones, keep reading. It's not quite as good, but still very worthwhile and interesting. All the ideas haven't yet been used. I've got the last two volumes on my shelf and I'll be getting around to them over the summer."}, {"userName": "Paul", "userReviewDate": "Jun 01, 2014", "userURL": "http://www.goodreads.com/user/show/11951948-paul", "userReview": "It is now 2040 and on datum Earth the Yellowstone Caldera has finally blown. Most of the population is fleeing to other Long Earth worlds, and it is causing huge disruption. Sally, Joshua, and Lobsang are helping those that cannot step easily and getting them to safe havens. Out of nowhere Sally is contacted by her father, Willis Lindsay, the creator of the original Stepper. He is planning on going to Mars, and wants Sally to come along.Whilst this is happening, the US Navy is intending on going to the very limits of the Long Earth, stepping through thousands of parallel world to explore and locate a previous mission. But humanity also has a challenger; the Next. These super bright people have evolved in these new parallel worlds and have a natural ability to step, and a lot of them are living their new community, Happy Landings, deep in the Long Earth. People see them as a threat.As we follow them on their journeys, we see the new and wondrous things that they discover; new life, hostile environments, new landscapes and occasional threats. They don’t stop that often, preferring to skip through the worlds at a frantic rate. The Next have been collected onto one world and are being prevented from moving off it as they pose the biggest threat to humanity, but others think differently and think they should be free.Much preferred this book to the second in the series. The three loosely interwoven stories are wrapping up details and plotlines from the first and second books and are opening up new threads to be continued. Sadly wasn’t quite as good as the first. Writing about people crossing worlds can drag a little, and it could have had more about the worlds where they do stop. I did like the nod to Clarke and Herbert with some of the things that they find. More interesting is the new step in evolution for humanity. Looking forward to where the story is going to go in the next two books."}, {"userName": "Peter Tillman", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/8101737-peter-tillman", "userReview": "Not starting out well at all. At p.40, I'm already bored.\"How could two of the best SF & F authors of the modern era make a story of two epic journeys across billions of worlds so boring?\", asks Otherwyrld, https://www.goodreads.com/review/show...Do yourself a favor, and read some of the 2 and 1-star reviews before you take this one on.Long Earth #1 was very good, Long War (#2) was pretty good, this one looks like it's headed back to the library soon. I'm closing it out as as DNF after 40 pages, a new record, I think. I did leave a bookmark in, in case I change my mind...."}, {"userName": "Tfitoby", "userReviewDate": "Mar 25, 2015", "userURL": "http://www.goodreads.com/user/show/5454475-tfitoby", "userReview": "There's so much wrong with these books that have such an imagination inspiring premise, potentially all of it stemming from the apparent dumbing down of two very intelligent British authors as they write what to all intents and purposes is an American YA series. Why would this be the case? Vignette after vignette slowly and obviously making a statement about colonial crimes, genocide, hatred of the other etc. complete with an inordinate number of references to the Cold War and Adolf Hitler mount up, incidents and observations happen, the wonder is skipped over, three hundred pages are spent getting people to a place only to have the return journey essentially described as \"they all went home and had lashings of ginger beer and rounds of cucumber sandwiches\" and then the book ends. Oh look there's a fourth one coming. I'd definitely not be reading this if I wasn't a fan of the two authors and perhaps that's what they're counting on?"}, {"userName": "Phrynne", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "Not as good as The Long Earth but better than The Long War, hopefully this series is back on the way up. This time round I really enjoyed each of the three parallel story lines. Plenty of things happened and some of the characters became really interesting. There was a bit less philosophising which helped the book progress faster and the introduction of the Next offers exciting possibilities for the next book."}, {"userName": "Maureen Wynn", "userReviewDate": "Jun 08, 2014", "userURL": "http://www.goodreads.com/user/show/5397250-maureen-wynn", "userReview": "I could never have imagined giving a Terry Pratchett book one star, but I'm afraid this book deserves it. I have always enjoyed the \"what if?\" idea as a starting place for a story, and I loved the \"what if there was an infinite number of Earths?\" idea at the heart of The Long Earth. Unfortunately, it was an idea that was not fleshed out with an actual story - it was just a long series of \"what if?\" speculations. Each book in this series has been weaker than the one before it, and I doubt that I will continue with the remaining two books that will apparently continue this series.The hardest thing to understand is how any book that Pratchett contributed to could be so devoid of a sense of humor."}, {"userName": "Elizabeth", "userReviewDate": "Aug 06, 2014", "userURL": "http://www.goodreads.com/user/show/8287397-elizabeth", "userReview": "There is a special place in my heart for these books. Nothing really happens except that what's happening is an epic adventure - you have to take a step back and realise that it's just written so gently you aren't even amazed by the fact that they're traversing multiple millions of parallel worlds. I heard this series described as a 'quantum playground' for the authors, and I really can't disagree with that. Given that many sf novels take place in some kind of parallel history/future of earth then this long earth suddenly allows the authors to introduce homages to so many sf classics without you batting an eye. Love it!"}, {"userName": "Melanie", "userReviewDate": "Nov 17, 2014", "userURL": "http://www.goodreads.com/user/show/992639-melanie", "userReview": "I love Terry Pratchett so you can imagine how excited I was when I saw he'd written a new science fiction novel. In fact three of them! And what an intriguing title! What could it mean? Ididn't know this Stephen Baxter guy but I figured he was bound to be okay if Terry Pratchett liked him.Oh, how my hopes were dashed! I'm writing only one review and putting it on all three books: The Long Earth, The Long War, and The Long Mars. That's because the books are basically indistinguishable. Yes, I read all three because in my excitement, I bought all three. Without reading the reviews. Okay, I'm dumb.The problem with these books is that they seem to mistake an interesting setting for an interesting story. I agree, the concept of an infinite series of Earths that can be reached, sequentially, by single steps, is new, at least to me. What would happen if such an infinite resource suddenly became available? There's lots of room to explore there, lots of possibilities. But the \"characters\" in these books don't really interact with these worlds or with each other. In fact, I put characters in quotes because they are simply devices for the authors to move through their imagined universe. They have no depth, no emotion, no lives, no pains, no loves, no fears, no joys. They are viewpoints, sometimes with a little bit of attitude but generally very bland.And where is the story? There isn't one. At least I can't think of a story other than a dispersed set of people, aliens, and artificial intelligences \"explore\" an infinite universe which feels basically like one of those old time movie reels where the film is going slowly enough for you to see the images flicker. This happens slowly in the first book, more quickly in the second, and on Mars (and again the Earth) in the third.By the way, there is no war in The Long War, in case you were thinking that would add excitement. Instead it is supposed to be a look at human interaction with other intelligent species. I think. But if it is, it is not very imaginative or insightful. All the viewpoints presented are the same, \"let's be friends.\" There are other people who don't want to be friends but we never see anything from their POV. And we don't see much, except events, from the main characters viewpoints either.The Long Mars is especially frustrating because it takes half the book to get to Mars, which turns out to be an even more boring exploration than the Earth was. And, spoiler alert, it ends in a setup for a likely fourth book. Meanwhile back on Earth, the authors demonstrate a classic misunderstanding of evolution while in the same book expounding on what a simple idea it is to grasp once it is explained to you. I'm referring to the spontaneous and timely appearance of a new human species with just the qualities needed to take the human race to the next level. Appropriately, the call themselves the Next. While the books have almost an exclusively American perspective, the Next species is reputed to appear spontaneously around the globe.There were so many ways to go with this concept, it is disappointing that they didn't choose any of them.3 stars for The Long Earth: the idea is new and. being the first book, it's not as boring.2 stars for The Long War: it's more of the same but the writing is not terrible.1 star for The Long Mars: it's even more of the same and the evolution stuff was just too much for me."}, {"userName": "Mjhancock", "userReviewDate": "Jul 12, 2014", "userURL": "http://www.goodreads.com/user/show/3897241-mjhancock", "userReview": "It's taken me a long time to appreciate The Long Earth series. The first book was fine enough, with the basic premise starting things off: humanity gains the ability to walk into different alternate worlds. And then big question, then, is what happens next. I liked the book but didn't love it. It felt like there wasn't very much Pratchett in it for one thing (which isn't entirely true; his latest Discworld books suggests he's moved away from the humor a bit, at least in comparison to what the books used to be, and The Long Earth certainly has the same \"faith in humanity, but suspicion too\" that's in books like Nation or Discworld's Lord Vetenari). And it didn't have much of a climax; there was a clear threat of sorts, but it's diffused rather quickly. I think my biggest problem is that I envisioned the series as a sort of space opera set on multiple Earths, and it's not that at all. Rather, it's a platform for telling particular types of story, almost a greatest hits of sci-fi plotlines. In this case, The Long Mars starts off where the second book left off, with the explosion of the Yosemite supervolcano triggering a disaster scenario for the US, and soon, the rest of the world, as global temperatures plunge into ice age territory; it soon becomes clear that most of Datum Earth (Earth Prime, if you will) will have to be abandoned. From there, it follows three big plotlines: Captain Maggie and her crew's voyage into the furthest depths of The Long Earth; Joshua and Lobsang's investigation into a new breed of human (a variation of sorts on the Midwich Cuckoos, with supersmart kids instead of outright psychics); and Sally and her father explore the Long Mars, which is arguably a tribute to sci-fi as diverse as Dune, Ray Bradbury, Arthur C. Clarke, and John Carter of Mars. There's echoes that seem less deliberate as well: a plotline with the Beagles will be familiar to anyone who's played through Mass Effect, and the resolution of the book reminds me very much of a particular episode of Star Trek: Next Generation. The book's at its best, I think, when it's describing the dizzying arrays of almost-Earths, the variety of ways our planet (or Mars) could have turned out. \"The Kids Aren't All Right\" plot feels a little off--I think it's the way we only have older protagonists' perspectives on them, which makes them more a metaphor for dealing with generational change than anything else. It's not a great book, but it's a solid one, and I can appreciate it as a sort of mash-up tribute to other sci-fi forms."}, {"userName": "David", "userReviewDate": "Jul 10, 2014", "userURL": "http://www.goodreads.com/user/show/4251182-david", "userReview": "Too preachy. I could stop there, but there might be more questions than answers with that. Pratchett/Baxter's ideology has always been tinged with left-of-center/counter-culture propaganda, and that has been okay with me [though I lean to the middle ground of a Libertarian right]. The main reason for my being okay with their propaganda is that the books have been wildly entertaining. The first book in this series was, but beginning with The Long War the books were light on the entertainment and long on the ideology. The Long Mars takes the propaganda to a whole new level. The deeper you get into the book the more strident the far-left, culture hating [Western Culture], degrowth, anti-tech, anti-capitalist, anti-male rhetoric becomes. Now, I accept there have been missteps by the West [though I also accept this of Asia as well...not to mention the southern civilizations], but this self-hating misanthropy has gotten entirely out of hand. As a result, you have a book which is a challenge to get through, and once you have the reader feels dirty and abused. NOT RECOMMENDED -- for anyone!! 2 out of 5 stars."}, {"userName": "Jack Bradbury", "userReviewDate": "Mar 12, 2014", "userURL": "http://www.goodreads.com/user/show/9851564-jack-bradbury", "userReview": "The Long Earth series is a what if story. What if mankind suddenly discovered an infinite number of uninhibited dimensions all laid out in a line? With each book in the series so far the authors have taken this question and created an entire universe for us to enjoy. Each book takes the reader further and keeps him surprised. Pratchett and Baxter are able to blend genres better than most other books I've ever read. On the one hand we have a hard sci fi feel, telling the story of the Long Earth over the course of years without the generic YA plot structure that most people going into this book apparently can't live without and still enjoy a book. We have a story of the survival of mankind. On the other hand we have an old west frontier tale. With each book these themes are expanded beautifully, especially in the most recent book, The Long Mars, which focuses on what kind of life can evolve in the Long Universe. It was fascinating. A word of warning: Don't go into this series expecting everything to wrap up in a nice bow at the end of books, or for everything to happen the way you think it will. There is a lot of criticism for this series, but it has nothing to do with the quality of the books but with them being different than what readers expect out of Pratchett. This series is a tale of exploration and discovery as told through the eyes of the people living it. Can't wait for the next book!"}, {"userName": "Cale", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/9288112-cale", "userReview": "This book is kind of strange. It feels like the world's longest story starter... There are three separate stories, practically separate novellas that all feed into a short climax piece. But each takes the world of the Long Earth into different directions - past 250 million steps, to Mars, and to explore the next step of evolution among humans. Each is interesting (although the Mars story had the most interesting new developments), but they all feel kind of underdeveloped; and the transitions between each feels very rough. And the story has a tendency to focus on the telling rather than the showing, and devoted to philosophy more than action. There's a prison break led by four of the major characters in the series that literally takes a paragraph. It's a strange focus, almost like the outline got published instead of the novel in some sections. That's not to say it's bad; the stories are still interesting, and the expansions of the world are intriguing and open up a huge range of places for future stories to go (I can see this becoming an Amazon Worlds kind of series). But this one doesn't resonate as strongly as the previous books did."}, {"userName": "Jason", "userReviewDate": "May 29, 2014", "userURL": "http://www.goodreads.com/user/show/2613919-jason", "userReview": "2.5 StarsFirst let me say that I have enjoyed every minute of reading the three books in this trilogy so far. The Long Mars was a fast and fun read for me that did not suffer until the end. This is by far the weakest of the three books and it does have some major flaws. That being said, it is still a fun read set in a cool world that explores some potentially major themes.The Long Mars is three separate story lines that unfortunately all do almost the exact same thing. By the end of this book it put me off. There is little character development done as this book takes place right after the end of the second book with all of our cast returning. It is sad that this is not really a science fiction series even with the major themes and plot points that are covered. Things are just too light...I love the concept of these books I just wish that they went deeper. If you are a fan of these authors, you will like these books."}, {"userName": "Susie ", "userReviewDate": "Feb 18, 2016", "userURL": "http://www.goodreads.com/user/show/26980726-susie", "userReview": "Oh man. While I still thoroughly enjoy the concept of this world, the quality of the story telling is continually lacking. This is the worst yet as far as that goes. The problem, I think, is that there is too much going on, with not enough time spent on any one thing. I've read plenty of novels with more than one perspective, and it's doable, but each needs to be done well. So much here felt pointless. Transitions between characters were haphazard. Motivations are questionable. The general point of entire sections became a mystery to me. It's unfortunate.This would have been better if it had focused solely on the Mars plotline, and brought the interesting characters in there. The potential for a good story is here, even with a slower pace. Yet, it's not a page turner. The aspects that I love, with the discovery of new things as we travel, ends up not being terribly meaningful. I'll finish the series (two more!), but the poor performance at this point is a shame."}, {"userName": "Cherie", "userReviewDate": "Dec 09, 2014", "userURL": "http://www.goodreads.com/user/show/6460330-cherie", "userReview": "It is always satisfying when a trilogy you just finished leaves you feeling that more questions were answered than not. When it doesn't leave you in the lurch, feeling totally unsatisfied - but calm and thankful. That is how I feel right now. Thankful that two awesome authors put their heads together and came up with the consept, characters and very satisfying plot for these stories. I have absolutely NO complaints.If you are a follower of Star Trek and Discworld and Sci-Fi, you may recognize some points in these stories that may feel familiar. Even some characters. Even some Wild West themes and some characters from right out of early Americana literature, now that I think about it.RIP Sir Terry. You did good. Thank you."}, {"userName": "Nicole", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/25273853-nicole", "userReview": "enttäuschender dritter Teil, was aber nach diversen Rezensionen zu erwarten war. Dafür geht es angeblich ab jetzt wieder schön bergauf mit der Reihe."}, {"userName": "Michael Brookes", "userReviewDate": "Jan 06, 2016", "userURL": "http://www.goodreads.com/user/show/11332400-michael-brookes", "userReview": "I've enjoyed the series so far and this third book has continued that appreciation. The core premise of the Long Earth, a seemingly endless array of parallel worlds is an effective one. The light style of the writing carries some fascinating concepts and this book carries them further with the introduction of the Long Mars.It's the exploration of these worlds that is the real strength of the series for me. There are some vivid and strange worlds on offer here and to be honest I would happily have read more about the oddities and explorations here. There's also a glimpse of alien civilisations and approached in a novel fashion.The story follows two main threads, that of the Long Mars and the Next. The Long Mars might be the title of the story, but it is the lesser thread in terms of content, but again the exploration of what might have, or could have been lends it extra weight.The Next provide the more traditional story and plot and it doesn't excel in the same way as the exploration aspect. The basics are fine and examine the ramifications of a new human species coming into being. However it isn't developed too deeply and at times almost feels like a cursory examination of the subject.The characters are reasonably well drawn, but do pale in comparison to the setting. Part of the issue here is that page time is spread thinly as there is quite a lot going on. In this regard the Next are perhaps the most weakly drawn.Overall though it's a decent read and an easy one. It might not be up there with the greatest sci-fi, but it's an interesting enough read."}, {"userName": "Phil", "userReviewDate": "Mar 18, 2014", "userURL": "http://www.goodreads.com/user/show/6896908-phil", "userReview": "I've never felt the need to give a book a 1 star review but this one earned it (it is also the only book I'm not recommending to anyone). I feel really let down by this series, three books in and nothing has really happened except the main characters travelling back and forth across the Long Earth's - and now Long Mars' - but not really going anywhere. All three books even have near carbon copy endings - Bk#1 Nuke, Bk#2 Yellowstone going nova and Bk#3 asteroid strike. Considering the standing messers Pratchett and Baxter have I was expecting something good, I've never read any Baxter and only ever read The Colour Of Money (which I to found unimpressive), being honest after the three books in this series I have no inclination to read anything by either of them again."}, {"userName": "Laurène Poret", "userReviewDate": "Apr 24, 2015", "userURL": "http://www.goodreads.com/user/show/20827746-laur-ne-poret", "userReview": "I would put 3.5 stars, because while this book certainly was long and boring in parts, there are some amazing ideas behind it. It's obvious it's a collaboration between two amazing SF/fantasy writers, but maybe they're not that well suited to work together? But it's really hard to find new ideas in SF books anymore, and I was pleasantly surprised.I am really tired of these series of books that start by one book then two/three/four books ... I don't like ending a read on a 'oh you'll know the end of the story in yet another book!' . I will probably still buy the next one because I am curious, but I can't wait for this trend to stop."}, {"userName": "Aaron", "userReviewDate": "Jul 06, 2015", "userURL": "http://www.goodreads.com/user/show/9107978-aaron", "userReview": "Third in the trilogy, this book brought in even more discoveries and scientific jumps. Can't say I felt a complete closure as there is so much more to be discovered in this multiverse, especially with some of the revelations made.Being familiar with Pratchett's work, I must now discover Baxter's work. Evidence of his hand at work in some of the sci-fi ponderings leaves me wondering what else his mind has dreamed and created."}, {"userName": "Chris Dietzel", "userReviewDate": "Jun 21, 2016", "userURL": "http://www.goodreads.com/user/show/19351209-chris-dietzel", "userReview": "This was an odd book in terms of story dynamics: there was no conflict in the book until the very end. Because of this, the book came across as more of an appreciation of space exploration and the possibilities of the universe than a novel. That by itself is okay, but a story with no conflict makes it impossible to care about what is happening and what the characters are saying and doing."}, {"userName": "Kim", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/4026072-kim", "userReview": "I feel this series has been on a downward slide since book 1 and I have a feeling it was as Pratchett contributed less and less. This book was darker, more drawn out, more boring, than the previous. I really don't know if I want to continue the series even though I have book 4 on my Kindle already."}, {"userName": "Leona Lecturopata", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/11496904-leona-lecturopata", "userReview": "Entretenida. Invita a seguir con la serie pero a esta novela le pasa lo mismo que a la cruzadora marciana: le falta la patata"}], "description": "The third novel in Terry Pratchett and Stephen Baxter’s “Long Earth” series, which Io9 calls “a brilliant science fiction collaboration.”2040-2045: In the years after the cataclysmic Yellowstone eruption there is massive economic dislocation as populations flee Datum Earth to myriad Long Earth worlds. Sally, Joshua, and Lobsang are all involved in this perilous rescue work when, out of the blue, Sally is contacted by her long-vanished father and inventor of the original Stepper device, Willis Linsay. He tells her he is planning a fantastic voyage across the Long Mars and wants her to accompany him. But Sally soon learns that Willis has an ulterior motive for his request. . . .Meanwhile U. S. Navy Commander Maggie Kauffman has embarked on an incredible journey of her own, leading an expedition to the outer limits of the far Long Earth.For Joshua, the crisis he faces is much closer to home. He becomes embroiled in the plight of the Next: the super-bright post-humans who are beginning to emerge from their “long childhood” in the community called Happy Landings, located deep in the Long Earth. Ignorance and fear have caused “normal” human society to turn against the Next. A dramatic showdown seems inevitable. . . .", "title": "The Long Mars\n      \n          (The Long Earth #3)", "url": "https://www.goodreads.com/book/show/18586487-the-long-mars", "average": 3.7, "cover": "https://images.gr-assets.com/books/1397123447l/18586487.jpg", "reviews": 736, "authors": [{"url": "https://www.goodreads.com/author/show/1654.Terry_Pratchett", "name": "Terry Pratchett"}, {"url": "https://www.goodreads.com/author/show/20295.Stephen_Baxter", "name": "Stephen Baxter"}], "type": ["Science Fiction", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/18586487-the-long-mars", "http://www.goodreads.com/book/show/22047337-the-long-mars", "http://www.goodreads.com/book/show/18635108-the-long-mars", "http://www.goodreads.com/book/show/23278523-the-long-mars", "http://www.goodreads.com/book/show/19731915-the-long-mars", "http://www.goodreads.com/book/show/22236650-the-long-mars", "http://www.goodreads.com/book/show/26869119-der-lange-mars", "http://www.goodreads.com/book/show/31421183-el-marte-largo", "http://www.goodreads.com/book/show/12067.Good_Omens", "http://www.goodreads.com/book/show/34497.The_Color_of_Magic", "http://www.goodreads.com/book/show/386372.Mort", "http://www.goodreads.com/book/show/64216.Guards_Guards_", "http://www.goodreads.com/book/show/34507.Equal_Rites"]}