{"ratings": 84, "userreviews": [{"userName": "Jibran", "userReviewDate": "Apr 05, 2016", "userURL": "http://www.goodreads.com/user/show/5407952-jibran", "userReview": "People should not leave looking-glass hanging in their rooms any more than they should leave open cheque books or letters confessing some hideous crime.\nThis opening line sets you for a deeply sensuous experience rich in imagistic detail from the life-sketch of Isabella Tyson, her story suffusing the mindscape like the ever-changing penumbra of light and shadow to converge like a fluid painting set within the gilt frame of the omniscient looking-glass that bares every truth about the inevitability of loss: her riches, her loves, her disappointments, her fading beauty, her womanhood - her whole humanity. It's amazing how Virginia Woolf manages to convey a novel-length characterisation of her protagonist in a few pages only. That and her ingenious deployment of the looking-glass...erm...the mirror, as a reference point that sees all like the lens of a camera and like a deep, invisible, secret chest of truths which is privy to all that Isabella doesn't want us to know. So beautifully written, there couldn't be a better example of Woolf's - indeed any writer's - stream of consciousness mode of storytelling.April '16."}, {"userName": "Ania", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/7070820-ania", "userReview": "What an interesting story. I don't mean the plot of course (there is none) but just how clearly and directly the author transports you to that one short brief moment in time. Suddenly I found myself out-of-body along Virginia, also out-of-body, standing in a bright and airy living room, looking at her flesh self via reflection in the mirror. Her spirit self, the looker, was keenly aware of the true state of things and was waiting for the lookee (her flesh self) to finally see past the illusions. Her prose is quite wonderful and poetic: lyrical and flowing. I must confess didn't like this short story at first. But the more I thought about it, the more I was impressed how clearly and easily she was able to transport me into that 1 moment with her dissociative perspective on herself and how clearly it all stood out in my mind."}, {"userName": "Reem", "userReviewDate": "Nov 07, 2014", "userURL": "http://www.goodreads.com/user/show/11773797-reem", "userReview": "It's amazing how quickly and smoothly Woolf can take you deep down into her characters' minds. You are there in no time. You understand their feelings. You become them seeing through their eyes and struggling their struggles. This short story is a perfect example of Woolf's magical abilities. You will become the lady in the looking-glass while reading. You will see her hopes, dreams and be hit by her reality. Thank you Virginia for not keeping your thoughts for yourself."}, {"userName": "Karin", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/6666465-karin", "userReview": "It's all creatures, flowers, and light, and exquisite clothes, tales of travels, and letters, until it's not. It is not.That ending. Well done."}, {"userName": "Morgan", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/7366675-morgan", "userReview": "This is the short story I read in college that got me into Virginia Woolf's style. Been a fan ever since."}, {"userName": "Susan Molloy", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/29670035-susan-molloy", "userReview": "Narrated by an unnamed speaker, this is a short story of an aged woman and the scenes observed through a hall mirror. This is merely a descriptive story – quite lovely descriptions at that – yet it’s anticlimactic. What is striking is the style in which Woolf wrote this, and begs the question, “Did she ever come up for air?” Her stream-of-consciousness writing style is dizzying at times.{F}"}, {"userName": "Laura", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "Free download available at: Feedbooks."}, {"userName": "pie", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/10416784-pie", "userReview": "Excellent short story!"}, {"userName": "Bettie☯", "userReviewDate": "Nov 03, 2012", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Free: http://www.feedbooks.com/book/1397/th..."}], "description": "The Lady in the Looking-Glass was first published in the American monthly Harper’s Magazine in December 1929. The story was inspired by a visit Woolf made to Ethel Sands in Normandy. She noted in her diary for 20 September 1927", "title": "The Lady in the Looking-Glass", "url": "http://www.goodreads.com/book/show/32507857-the-lady-in-the-looking-glass", "average": 3.9, "cover": "https://images.gr-assets.com/books/1476047706l/32507857.jpg", "reviews": 10, "authors": [{"url": "https://www.goodreads.com/author/show/6765.Virginia_Woolf", "name": "Virginia Woolf"}], "type": ["Short Stories", "Classics", "Fiction", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/32507857-the-lady-in-the-looking-glass", "http://www.goodreads.com/book/show/16121957-the-lady-in-the-looking-glass", "http://www.goodreads.com/book/show/14942.Mrs_Dalloway", "http://www.goodreads.com/book/show/59716.To_the_Lighthouse", "http://www.goodreads.com/book/show/18521.A_Room_of_One_s_Own", "http://www.goodreads.com/book/show/18839.Orlando", "http://www.goodreads.com/book/show/46114.The_Waves"]}