{"ratings": 46122, "userreviews": [{"userName": "James", "userReviewDate": "Sep 01, 2012", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "I have been fascinated by the Tudors and Plantagenets most of my life. I knew the various kings and queens, as well as how they ascended to the throne. But to focus on all the women behind the scenes and then in front of the scenes was a fantastic approach. Definitely will continue this series.The setting and the descriptions are magical. You feel transported to the time frame. You are half in a bit of shock and a bit of concern, all knowing some of this actually happened. Of course, some of it is fully made up... but to know these people were real and these women gave birth to and raised Kings and Queens. And some even became Queen themselves.I almost wish I could be a fly on a wall some 4oo+ years ago to see what was really going on!\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by. Note: All written content is my original creation and copyrighted to me, but the graphics and images were linked from other sites and belong to them. Many thanks to their original creators."}, {"userName": "Kai", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/41788524-kai", "userReview": "\"“Any woman who dares to make her own destiny will always put herself in danger.” \"This was my first Philippa Gregory novel, and my first historical novel this year. (Although I tried to read Outlander. But I put it aside after 200 pages because it was sexist.) I fully enjoyed this book and am super intrigued to continue this series. The British Royals and their history always sparked an interest in me and while this novel satisfied me 100%, it also made my hunger even bigger. Since my knowledge of British (or basically any) history is basically nonexistent, historical books always manage to captivate me. Since the events are real and google knows everything it's a challenge not to look everything up right away.Philippa Gregory's writing is fantastic, romantic and wise. There are so many beautiful quotes in this book. Since it's an adult, historical novel in English it took me a while longer to read than your typical YA story, but I still loved it lots.I also love the portrayal of the main character and any other woman in this book. Yes, it's the 15th century and women had no rights whatsoever. But while keeping everything historically accurate, the author still managed to write a powerful, independent and intelligent woman. Jacquetta was aware that, as a woman between many powerhungry men, she needed to tread carefully, but she never lost her dignity. (Not like some other female main character, who jumped back in time, and let her husband hit her just to forgive him a second later. And that was supposedly 300 years after Jacquetta lived. Never again tell me historical accuracy needs women to be disrespected.)The never ending power game, the back and forth between running and ruling are somewhat tiring but that isn't Philippa Gregory's fault. These royals are incredibly stubborn and often too stupid to rule a country.What frightens me is the sheer size of this series. I doubt that I will finish it in the next few years, but I will continue it for sure.Find more of my books on Instagram"}, {"userName": "Orsolya", "userReviewDate": "Jun 16, 2011", "userURL": "http://www.goodreads.com/user/show/5647191-orsolya", "userReview": "I have a problem with authors thinking that they have to reach a larger mass audience once they are popular. It is comparable to a musician who “sells out”. The Lady of the Rivers certainly portrayed a dummied down storyline which started with the immediate opener. Perhaps Gregory is so popular now, that she took away much of the magic so evident in some of her earlier works to reach a wider audience. The theme of my complaints against The Lady of the Rivers is the lack of depth. Admittedly, this novel is a fast page-turner but solely because it is easy to read and has very short chapters (several were only one page); and not because it is overly intriguing or capturing. The book is rather slow in the beginning (even by page 109, I was bored) and it was obvious that this is because Gregory didn’t have much research to include. Is it a coincidence that the latter part of the book is more interesting and not as sparse when describing the battles? Not at all. Sadly, even the events which were described appeared glossed over which relates back to the lack of depth element. Although Jacquetta is the main character, her character development is extremely weak, to say the least. Her inner feelings and actions never felt fully disclosed and understood, making her seem very one-dimensional. Moreover, many of the other female characters also felt very demeaned and ill-described. Joan of Arc was portrayed quite foolishly and Margaret of Anjou was even more annoying than usual. Margaret of Anjou is already “known” as being villainous but at least she has drama and depth. In The Lady of the Rivers, she just comes off as a spoiled teenager in a teen film. Plus, more of the book was about Margaret of Anjou than Jacquetta. I found this all to be disappointing because none of the characters were likable or encouraged support. Imagine a star-studded ensemble cast in a movie but with a terrible plot and poor acting. That is the best way to describe this book. Sadly, even the proposed highlights were unsatisfying. Moments in the plot which were meant to be “strong” such as Richard Woodville declaring his love to Jacquetta; were elementary, rushed, and so predictable that I actually rolled my eyes. The inescapability caused the story to be very difficult to “get into”. I have to admit, there were SOME strong points throughout but I have to judge the novel on the whole, and overall, the momentous events covered (Hundred Years War, Wars of the Roses) were barely even scraped in potential by Gregory. The Lady of the Rivers is more of a summary of these events or YA novel. Some contradictory points were also evident. For example: the novel stressed that the Earl of Suffolk opposed Margaret’s marriage to Henry but then about a page later said that he predicted its success. Um… sure. I also have to ask, did they actually say “hi” during this time period? Jacquetta surely did in this novel. I may not be a linguistic expert but never, ever, have I come across the word “hi” in any other Plantagenet or Tudor novel and I have read countless sources. This bothered me. Also, the churching ceremony appeared to be described in the manner of the rules set forth by Margaret Beaufort which she obviously didn’t do yet at the time of this novel. Let’s not even get into the complaint which is evident by all readers across the board: the overuse of the titles (ie. “My lord, the Duke of Bedford”).The end of the book was the best, similarly to how the Battle of Bosworth scene at the end of The Red Queen was surely the highlight and climax. It also set the lead-in to The White Queen quite seamlessly, especially if one would want to re-read it after The Lady of the Rivers. I will give Gregory credit where credit is due that she attempted to cover a person who doesn’t have a million biographies or sources available on her. Jacquetta is a lesser known individual and I support bringing the “underdogs” to the table. I admit that I may be a little harsh and that I shouldn’t expect a thorough novel when such little information is available. However, Gregory should have instead transversed this as a novel about Margaret of Anjou, then. I do support the effort, however. Overall, not AS terrible as I suspected but definitely a dummied down version. Either Gregory is losing her spark or I’m just slipping out of the target market."}, {"userName": "Bookdragon Sean ", "userReviewDate": "Jan 17, 2014", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "I’ve always had a love hate relationship with Philippa Gregory. Sometimes she does what she does extraordinarily well, and sometimes she writes crap like this. I really struggled with this one. I just found Jacquetta’s story \nSO\n uninteresting. When I was reading it I couldn’t help but wonder how better this series would have been if Margaret of Anjou had her own novel. This way another perspective of the wars would have been covered. Moreover, this isn’t even chronological with the previous two books or the one after it; it’s just a random prequel stuck in the middle. It’s strange, and, if anything, it disrupts the series. I want more Margaret! Give me more Margaret!This really isn’t the best reaction to have to a book of this type. If you’re immediately wishing for a different character, then you know something isn’t quite right. Jacquetta’s story had the potential to be interesting because of the suggestions of witchcraft. But, it was all too vague. The author couldn’t directly allude to the fact that she was or wasn’t a witch. Witchcraft is obviously fictional, and this is a realism novel so she couldn’t say she had magic. Nor could she say that she wasn’t because of the rumours. This resulted in a disappointing dynamic. I wish she went with either side of the picture because what we’re left is a character who doesn’t actually seem to know what she is or isn’t. It was a little bit weird.This just needed more Margaret of Anjou. In the other books the characters view her as the villain; she is simply the “bad queen.” Only in this book does Philippa Gregory bother to show a glimpse of her story. I think it would have been incredibly interesting to see how she interpreted the events, and that way I think we would have had a fairly overall picture of the war. Well, at least from the perspective of the powerful women/queens. So far, York and the Tudor faction of the house of Lancaster have had their story told. But, Margaret of Anjou remains a quiet bystander to the events. Where is her voice? Where is her tale? Her minor part in this novel was not enough; this novel was not enough to establish her presence in this series.  A weak story when Margaret went This book was also, undoubtedly, too long. Some of the chapters were packed out and far too long, the opening was terrible; it was the worse beginning in the series. The romance was okay. It felt secretive and at the same time realistic. But, I just didn’t care about it. It didn’t feel relevant to the major events. I wanted to see the Cousins War, the Wars of the Roses, and how it affected the lives of the overlooked women in positions of power and persuasion. This was a random tangent to the story, one that I needn’t have read. This was, definitely, the bad egg in this series. I just felt that there was far too much wrong with this book for me to enjoy it. It lacked a lot of the politics, and conniving characters of the previous two books. It also lacked any sense of narrative drive; I had no real reason to carry on reading this after Margret left the scene. This was too unlike the rest of the series for it to feel like it was actually part of the series. Jacquetta’s characterisation was too weak and confused for it to evoke any investment. I didn’t like this book, but the rest of the series is really good. Well, except for the last book,  The King’s Curse, but I’ll get to that at a later date. The Cousin's War Series 1. The White Queen- A strong four stars2. The Red Queen- A fair three stars3. The Lady of the Rivers-  A Margaretless two stars"}, {"userName": "Anniebananie", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/47587994-anniebananie", "userReview": "Ich bin durchweg positiv überrascht!Aufgrund vieler Videos und Fotos zum Thema #makehistossexyagain in letzter Zeit hab ich mir letzten einfach mal \"blind\" die Mutter der Königin zugelegt. Ohne zu wissen um was es geht und jaaaaa ich bin auch nicht unbedingt sehr bewandert in der Geschichte der Rosenkriege, habe mich also völlig planlos in dieses Buch versinken können. Die ersten paar Kapitel war ich daher auch noch etwas verwirrt und überfordert von den vielen Namen und Titeln, auch wenn zu Anfang des Buches Karten und Stammbäume abgebildet sind, war da schon eine große Flut an Informationen.Aber nach den anfänglichen Schwierigkeiten lief es dann, der Schreibstil war extrem angenehm und überraschend schnell zu lesen (hätte nie erwartet dass ich dieses doch recht dicke Buch in knapp 4 Tagen lese 😱). Auch unsere Protagonistin Jacquetta fand ich mehr als sympathisch und absolut rational in ihrem Handeln. Auch ihren zweiten Mann Richard mochte ich gerne, vor allem wie er mit seiner Frau umgeht und sein Anstand sowie seine Treue fand ich für die damalige Zeit sehr bewundernswert.Die Handlung erstreckt sich über die Jahre 1430 bis 1464, dementsprechend viel passiert auch und man rast nur so durch die Geschehnisse. An manchen stellen hätte ich mir aber noch etwas weniger Tempo und mehr Gefühl gewünscht. Aber alles in allem hab ich jetzt wohl Philippa Gregory und die Rosenkriege für mich entdeckt und freue mich, dass dazu schon so viele Bücher erschienen sind 🏰👑🌹🥀"}, {"userName": "Misfit", "userReviewDate": "Sep 06, 2011", "userURL": "http://www.goodreads.com/user/show/1375548-misfit", "userReview": "**This review may be considered slightly spoilerish so enter at your own risk**Lady of the Rivers is the third book in Gregory's Cousins' War series, and focuses on Jacquetta of Luxembourg. While staying in France with her uncle, Jacquetta *meets* imprisoned Joan of Arc and the two share some BFF time together with the tarot cards and the wheel of fortune. After Joan meets her unhappy end, the beauteous Jacquetta catches the eye of the powerful Duke of Bedford, uncle to young king Henry VI. Jacquetta's worries about being ravished by her older husband come to naught as he's more interested in using Jacquetta's virginal qualities to aid his experiments - experiments that have something to do with alchemy, the philosopher's stone and the unicorn. If you are scratching your head over this, rest assured I was doing the same thing. I didn't understand it then and I don't understand it now.Her older husband eventually dies and Jacquetta waits for the King's councilers to choose another husband after her year of mourning. John's squire Richard Woodville has other ideas, and Jacquetta is willing to risk the king's wrath for the sake of true love. The marriage is a fruitful one and Jacquetta spends lots of time in the country producing one baby after another (yawn). The wheel of fortune spins again when the king marries Margaret of Anjou and Jacquetta is summoned to serve the new Queen, but that marriage isn't exactly smooth sailing, and one thing leads to another until a little dispute erupts between the houses of Lancaster and York.That's about as much plot summary you'll get from me, I'd rather discuss the reading experience, starting with the repetitive text. The Melusine count exceeded twenty, and that's not counting the water/river/fishy woman references or the tally would be much higher. There are times when nothing much happens in Jacquetta and Richard's lives (making babies, cooling heels in Calais for a year waiting for the king to do something), and it would have served the story better just to fast forward a few years with a brief mention rather than more tedious detail on what isn't happening.I don't understand the great need to repeat same words three times in a single sentence, over and over and over again (can't quote examples from the ARC, sorry). Then there are the mind-numbing reminders to the reader of who is who via the *as you know, Bob* method. Any time Jacquetta mentions her first husband in a conversation he is always my Lord John, Duke of Bedford. Margaret will mention her uncle in a conversation with an intimate friend as my uncle, the king of France (I think everyone at court would know that she was niece to the king of France). And Richard of York, reviled by all the Lancastrians is always always always (see, I can do things in threes) Richard Duke of York. Every time. I got it the first time, and did not need to be clubbed over the head with it :(The characters were all rather *meh*, neither good nor bad, just incredibly uninteresting. Instead of filling us in on the politics and intrigues of the court that caused these wars, we get endless exposition on the court on progress, as well as how Edmund Beaufort Duke of Somerset dotes on Margaret of Anjou, bringing her all those sweet little presents. All in all, a very disappointing read and not one I'd recommend for those wanting more background and insight into the Wars of the Roses - there are much better choices out there with Penman's fabulous Sunne in Splendor still being the gold standard. Library only, then buy it if you love it. Two stars.**This review is based upon a digital ARC received from Net Galley and might differ from the final edition."}, {"userName": "Jane", "userReviewDate": "Dec 14, 2011", "userURL": "http://www.goodreads.com/user/show/2679341-jane", "userReview": "Where I got the book: review galley from NetGalley.Philippa Gregory takes a step back farther in time with The Lady of the Rivers; after exploring the lives of the various Tudor women in a succession of novels, she now dives into the rich and complicated history of the Wars of the Roses. This was a period in the 1400s in which two branches of the Plantagenet royal family struggled for power over England (and various bits of France). The protagonist in The Lady of the Rivers is Jacquetta of Luxembourg, who is not generally a well-known historical figure. The story covers Jacquetta's life from adolescence to middle age, and Gregory fans will realize that it ends with the beginning of Gregory's 2009 novel The White Queen.I've been critical of Gregory's kings-and-queens novels in the past, mostly because I would like to see more pure fiction from her, but I enjoyed The Lady of the Rivers. As usual, though, I did not find the protagonist particularly interesting; I felt that she was an observer of history rather than being a participant in it. Of course, in those days a noblewoman's role was to run the house and lands while the men fought (Jacquetta does plenty of that) and produce children (Jacquetta had sixteen). So maybe the impression of passivity that I received was due to the necessity of sticking fairly close to historical fact. The bits of white magic that all of Gregory's heroines inevitably indulge in do not come across as exciting enough to compensate me for the lack of action.And yet there were some definite improvements over recent novels in the series. For one thing, Jacquetta gets to travel around quite a bit, and even though she's not in the battles I did get a better sense of being near to the action than I usually do. And the supporting cast was good; I particularly liked Margaret of Anjou, Henry VI's queen, and I found the account of Henry VI's mental illness compelling. There were several other memorable characters; in fact, I now understand the Wars of the Roses a whole lot better. So if you read historical fiction for the history, you'll be satisfied.I'm not going to say much about Gregory's writing idiosyncracies here, since what I was reading was a galley (which had not even been edited for capitalization and paragraph layout; that surprised me). I desperately want to send her the gift of a big bag of semicolons, though. Gregory is the undisputed queen of the comma splice.One last comment; I have been reading Gregory for years, and am fascinated to note that the novels are getting less sensual as time goes on. This one was PG-rated.Overall impression: a good Gregory, and recommended for lovers of English history."}, {"userName": "B the BookAddict", "userReviewDate": "May 17, 2014", "userURL": "http://www.goodreads.com/user/show/19832827-b-the-bookaddict", "userReview": "I really did enjoy reading this Cousins War installment featuring Jacquetta, The Lady Rivers, even though each time I had to key the name of the book into Goodreads, I typed “The Lady of Shallott” :) I'm a sucker for that poem!My only grizzle is that being numbered Cousins War #3, you would think that it would be following in a chronological sense after The White Queen and The Red Queen but this is not so. Currently, the chronological order that these books should be read in is: (as shown on https://www.goodreads.com/series/5542...)The Lady of the RiversThe Red QueenThe White QueenThe Kingmaker's DaughterThe White PrincessThe Last Rose / The King's Curse (not yet released)NOTE - where The Last Rose fits on this list is currently unknown.BUT - The books are numbered (and show on Goodreads) in publication order. The White Queen (Cousins War #1)The Red Queen (Cousins War #2)The Lady of the Rivers (Cousins War #3)The Kingmaker's Daughter (Cousins War #4)The White Princess (Cousins War #5)The King's Curse (Cousins War #6)So if you follow the publication order, like this foolish woman here did, you're all out of order! I didn't like leaping all over the place in time. Personally, I'd have liked to read the damn series in order! Be warned about this anomaly if you haven't read this really interesting and entertaining series by Ms P Gregory yet.Okay, grizzle over, 4★ P.S. You could not have kept me at a royal court in England in the 15th and 16th century for all the money in the world. I like my head just where it is - planted very firmly on my shoulders, thank you very much."}, {"userName": "Michele", "userReviewDate": "Aug 26, 2011", "userURL": "http://www.goodreads.com/user/show/1494832-michele", "userReview": "I've enjoyed a small handful of Philippa Gregory novels in the past and the subject of her newest book entitled The Lady of the Rivers, the third in her Plantagenet women series, is Jaquetta of Luxembourg and mother to Elizabeth Woodville (subject of a previous novel, The White Queen).For those of you who have read The White Queen, you'll know that Gregory drew a lot (and I do mean A LOT) from the mythical descendant-aspect of those Woodville girls. There were a lot of allusions to witch-craft, second-sight, and that mythical water/fishy lady Melusina. You can expect more and more of the same in The Lady of the Rivers.The story follows Jacquetta from a young teenaged girl who befriends Joan of Arc through her brief marriage to the Duke of Bedford and subsequent love match with Richard Woodville (later made Earl of Rivers) and the production of their 16 (!) children, the oldest of which would go on to marry Edward IV of England.Why only two stars? After all, the subject matter (excluding the supernatural bits) is fascinating stuff. Jacquetta was one interesting and powerful lady. The two stars comes from the writing. I'm not sure if Gregory is thinking that her readers are new to historical fiction and therefore likely to become confused about the characters, their relationship to one another and their respective titles or if the editor fell asleep on the job. But the end result is that every time a character is mentioned, either in dialog or in the text, we are told their name, title and relationship. Over and over and over again. It makes reading the text of the novel a repetitious bore.For example (one of many, many, many), Jacquetta speaking to Margaret of Anjou, whom she has served for years and years as a lady-in-waiting and therefore is very close friends with:\"I think that Richard, Duke of York, is the only man to successfully hold French lands since my first husband, the Duke of Bedford.\"Of course Margaret would know that Richard is the Duke of York....he is her greatest enemy at court and they've hated each other for years. She doesn't need to be reminded of his title. And of course Margaret very well knows that her close friend's first husband was the Duke of Bedford, for heaven's sake! For that matter, so does the reader because names/relationships/titles have already been mentioned in the book at least a dozen times prior to this. ARGHHHHH! If an editor had come along and slashed these repetitious titles/relationships/names, this novel would be far, far better reading. But alas, they didn't. So the end result is stilted dialog (you don't need to reference your brother-in-laws title when speaking to your husband....trust me, he KNOWS his brother is the Duke of whatever) and the feeling that you're being clubbed over the head with this stuff. Even if you don't care for the supernatural stuff (the Duke of Bedford, Gregory imagines here, marries Jacquetta for her witchy-talents), the novel could have been far better with a little editing."}, {"userName": "Alaina Meserole", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/50620706-alaina-meserole", "userReview": "The Lady of the Rivers was an okay kind of book. After watching the TV shows The White Queen and The White Princess I have been kind of dying to read this series. However, this book was just an okay kind of beginning to it.Jacquetta of Luxembourg was a pretty interesting character to read about. Well, after so many chapters because the first half of this book was completely boring. Which is why I rated it what I did. It did start to pick up a little bit better after the half way point.. but there wasn't much to this book if I'm being honest.The Lady of the Rivers was written like a diary. Again, it was mostly boring in my eyes. Probably because I've read some books that were kind of a diary and they were so much better. Maybe it's the whole genre being different than I usually read or just that there's not a lot of information out there about Jacquetta.. but I was just mostly bored in this book.When Jacquetta was a young girl she married the duke of Bedford. From this connection, she was instantly dragged into the war of the roses. Cousins battling against one another for power and land. I didn't really like Jacquetta in the beginning of the book, but once the cousin war and more people were introduced I started to like her a little bit more.Overall, it was okay. I wish this book was a little bit better so that I could be more excited about diving into the second book but I'll take what I can get at this point."}, {"userName": "Susan", "userReviewDate": "Sep 05, 2011", "userURL": "http://www.goodreads.com/user/show/1251273-susan", "userReview": "In The Lady of the Rivers, Philippa Gregory continues her Wars of the Roses saga (I balk at calling it the Cousins’ War) with the story of Jacquetta, Duchess of Bedford, mother to Edward IV’s queen, Elizabeth Woodville. Like her daughter Elizabeth, Jacquetta is possessed of supernatural powers.First, I did strongly appreciate one aspect of this novel: the sympathetic portrayal of Jacquetta and the Woodville family. Most novels about the Wars of the Roses portray the Woodvilles negatively, to the point of making them into cardboard villains, and it was refreshing to see Gregory take a different tack. Unfortunately, there’s not much else about this book I liked. Jacquetta’s first husband, John, Duke of Bedford, who served as Regent of France during Henry VI’s minority, was an interesting man faced with the very difficult task of holding on to England’s possessions in France while at the same time dealing with political infighting in England. Gregory turns him into a rather pathetic sort who marries pretty young Jacquetta only to make use of her gift of seeing into the future. Other important players of the time, such as John’s younger brother, Humphrey, Duke of Gloucester, and his ambitious wife, Eleanor, make appearances, but their dramatic potential is never realized. Margaret of Anjou shows promise when she first appears in the novel, but soon becomes the she-wolf, complete with budding psychotic son, familiar to anyone who's read a lot of Wars of the Roses fiction.Early on in the book, the widowed Jacquetta makes a scandalous marriage to her first husband’s squire, Richard Woodville. The novel then quickly jumps ahead into the court of the grown Henry VI and his French bride, Margaret of Anjou, whom Jacquetta serves. At this point, Jacquetta is reduced to the role of standing by and shaking her head as Henry and Margaret drag the country into civil war. Except to read the occasional Tarot card and to give Margaret sound advice, which is usually ignored, Jacquetta plays almost a minor role in her own novel.The writing in this novel simply isn't up to the standard of some of Gregory's earlier efforts. I thoroughly enjoyed The Boleyn Inheritance, especially Katherine Howard's chapters, which I thought caught the voice of the ditzy young queen perfectly. The first-person present tense here is simply mind-numbing, with needless repetition. Too often, Jacquetta says something, then tells us what she said. For me, however, the novel’s biggest flaw was what was not inside it—Jacquetta’s later years. The most dramatic events of Jacquetta’s life, her being accused and exonerated of witchcraft, the murders of her husband and her son John, and her flight into sanctuary with her daughter, belong to this period, as does the controversial role the Woodvilles allegedly played in the trial of Sir Thomas Cook, but Gregory chose to end her novel well before these things occurred. It’s her novel and her choice, but I for one would have loved to have seen how Jacquetta reacted to the controversy her family’s sudden rise generated, how she fought the charges against her, and how she dealt with the murders of her husband and John. With this missing, the impression as we close the book (or turn off the Kindle, in my case) is that of a pleasant but rather milquetoast Jacquetta: Wendy the Good Little Witch.I received an electronic review copy of this novel from Net Galley."}, {"userName": "Amelia", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/27019999-amelia", "userReview": "3.5 starsFull review is here:https://amelianamora18.wixsite.com/am...Overall I did enjoy this book."}, {"userName": "Jackleen", "userReviewDate": "Oct 20, 2011", "userURL": "http://www.goodreads.com/user/show/5480965-jackleen", "userReview": "Two and a half starsThe Lady of the Rivers follows the story of Jacquetta, the mother of Elizabeth Woodville, (who becomes Queen of England), from a privileged child of the family Luxemburg in France, a family descended from the goddess Melusina; through her encounter with Joan of Arc; an early marriage to the Duke of Bedford, regent of France, uncle to King Henry of Lancaster, who exposes her to alchemy and secret books of forbidden knowledge, and subsequently, accusations of witchcraft. Upon the Dukes death, Jacquetta follows her heart and against royal consent, marries Richard Woodville and is banished to the country side, descending from a Duchess to the wife of a squire. When Margaret of Anjou is brought over to England to marry King Henry of Lancaster, Jacquetta, as her relative, is retrieved from the countryside to befriend the new Queen. Jacquetta is soon the constant companion of Queen Margaret and privy to the secrets and intrigues that surround the throne of the unfortunate, King Henry. Witchcraft, alchemy, being best friends with a much malaligned Queen, this has all the elements to be a great read, but…First, I must tell you that I am a fan of Philippa Gregory as my bookcases will attest. I have almost all her books and the last four are in hardcover. So, as you can imagine, I was shocked when in the midst of The Lady of the Rivers to find myself not enjoying this story very much at all. Why, I started to wonder. Have I just read too much historical fiction? Have I overloaded on the genre? I had always thought I could read about history, and especially about different view points in history, until, well… my eyes bled. I do not expect historical fiction to be completely accurate, after all the second word in that genre is fiction. And, when you really put your mind to it all history is fiction to a certain extent, as history is the story left behind by the victors or simply by those in power. It is the propaganda and slander of the day carried forward to the present. So within historical fiction is the opportunity to present another side of the story. I mistakenly believed that, finally, I would be given the Lancastrian point of view during the war of the roses. The York rise to the throne of England was yet another power grab in England’s long history of power grabs. The Celt took England from the prehistoric people, who were invaded by the Saxons and Danes, who lost power to the Romans who came and went, and, finally, William the Conqueror came long and established Norman rule, setting the stage for the Plantagenet’s and their eventual power squabbles that led to the war of the roses. With all this history of conquest in England, I do not understand the need for writers to be so protective of the house of York. The house of Lancaster was the ruling house, how is that they were defeated? That story would be well worth reading about. We all know that the Woodville’s changed sides following the York victory of Edward IV in 1461, and, of the fateful meeting in 1464 of Elizabeth Woodville and King Edward, if only because we all read Gregory’s The White Queen. But in The Lady of Rivers, I wanted to read the Lancastrian point of view, read about their story. Unfortunately I am still waiting.The underlying theme, or lesson, of The Lady of the Rivers is one of caution for strong women who seek power. Those women who crossed the line from ornamental to power seeking were taken down either through accusations of witchcraft, adultery or being ‘unnatural.’ And, I applaud Gregory for presenting this premise. Gregory presents Joan of Arc, who as we all know was burned at the stake, as an example early in the book, of what historically happened to women when they seeked and assumed power during the middle ages. Another example is the sister in law of Jacquetta, Duchess of Gloucester, Eleanor, who married to the Uncle and heir to King Henry of Lancaster, assumes too much power and privilege, and consequently, is accused of witchcraft and sent to convent from which she never leaves. Jacquetta, herself, with her family history of magic and witchcraft must walk a careful line and avoids being to publically forward in her opinions and actions in order to avoid the scrutiny of the male powers of the time.So, I naturally believed, as similarly to other of Gregory’s books, this book, while told from the first person point of view of Jacquetta, was in fact the story of Queen Margaret of Anjou. A small point, the woman on the cover of the book has red coppery coloured hair like Margaret, while Jacquetta is supposed to have had white blond hair which she passed down to her daughter Elizabeth. So who is this book about? This should be, as framed by Gregory herself, the story of Margaret, a woman fighting to save the throne for her son against the male powers of the time and being beaten down and defamed by those same men who grab the throne and the power of the land for themselves. But, instead of Margaret’s point of view of a woman disempowered, we are given the same old Yorkist slander of adultery and unnatural female behaviour, Margaret the wolf. I confess to being greatly disappointed, as I believed Philippa Gregory had indeed set out writing a potentially great inspiring novel of one woman’s tragic struggle against overwhelming odds, only to turn her into a cartoon. In, closing, as Jacquetta abandons her friend Margaret for the house of York, so too, does Philippa Gregory abandon a much defamed Queen to the slanders of history."}, {"userName": "Sara", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "Hands down, Philippa Gregory is my favorite English historical novelist. She brings the era she is exploring to life and always tells the story from such a personal point of view that you feel you are, or at least know, the main character. I also love that she takes historical women who have been literally overlooked by historians and brings their stories, their stuggles, into the light.The Lady of the Rivers is Jacquetta Woodville, lady-in-waiting to Margaret of Anjou, who becomes the Queen of England in 1445. Jacquetta is a fascinating person, wise and true and regal. She is a direct descendant of Melusina, the water goddess of legend, and this lineage gives her some powers that separate her from the everyday people around her. This aspect of the story is handled beautifully and without anything that makes it seem preposterous or unrealistic. If there is anything more interesting or captivating (and sometimes more confusing) than the British royal house during the Wars of the Roses and the Tudor eras, I do not know what it would be. These times are gold in Gregory’s hands. Like some of her characters, she practices alchemy, she spins gold from paper pages.I am gradually working my way through her canon, and having read them completely out of order, I keep wanting to begin at the beginning and read them chronologically. If God grants me the time, I will not grudge starting over. They are well-worth a second read."}, {"userName": "Erin", "userReviewDate": "Mar 02, 2013", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "Philippa Gregory is another of those historical fiction writers that I believe must have time traveled. Page by page, I was swept back into the world of Lancaster and York. Although The Red Queen and The Kingmaker's Daughter are both tied for first as the faves of this series, I loved the unexplored territory of the life of Jaquetta."}, {"userName": "Kelly (Belle of the Literati)", "userReviewDate": "Oct 07, 2012", "userURL": "http://www.goodreads.com/user/show/5361057-kelly-belle-of-the-literati", "userReview": "\"I put the charm bracelet away in the purse and return it to my jewel case. I don't need a spell to foresee the future; I am going to make it happen.\"--Philippa Gregory, The Lady of the RiversThe third book in Philippa Gregory's The Cousins' War series is The Lady of the Rivers which chronicles Jaquetta of Luxembourg. While this is the third book in the series I hesitated reading this because I wasn't sure if this particular woman in history would interest me. I read The White Queen, the first book in the series which follows Elizabeth Woodville, and absolutely LOVED it! The newest and fourth book in the series I actually read next called The Kingmaker's Daughter; this tells the life of Anne Neville, daughter of Richard Neville, Earl of Warwick and eventual wife of Richard III. Again, loved this book. So I decided to go back and read this one and I cannot understand my hesitation. This book was enthralling!I must premise, I am a HUGE English history geek. I have read more books about the Tudors than I care to admit to and am creeping up on that number with this era about the Plantagenets. I also am very hesitant to admit that this family might be stealing the place in my heart that was previously held by the Tudors. They are slowly but surely surpassing them. This is huge. But anyways, I can understand that this type of writing or book might not appeal to everyone but I absolutely cannot get enough of Gregory's writing. I am obsessed with this entire 200 year time period that she has written about and I devour her books like they're fast paced young adult novels; I just love them. So back to Jaquetta, her story starts out very interestingly because while in her uncle's keeping they have captured Joan of Arc. Weird, right? This time in her life and seeing Joan's inevitable fate cements her fear of being caught and tried for witchcraft for the rest of her life. Jaquetta descends from Melusina, the water goddess, and she is blessed (or cursed) with the Sight. Because of this Jaquetta eventually catches the eye of the Duke of Bedford and he proposes marriage. He's about two and a half times her age, her at roughly 15, him at almost forty. And while this is not unheard of in these times, his reason for wanting her is. He does not want her as his bedmate, he will not take her virginity, he does not desire to make an heir, instead he wants her pure in order to use her gift to find the Elixir of Life. This all comes to naught obviously and throughout her marriage she is slowly starting to fall for her husband's squire, Richard Woodville *sigh*. He is handsome, strong, courageous, and kind. After her husband's death, and a little trickery, she finally convinces him to marry her. He was worried he was too far beneath her and would be the ruin of her, but alas, true love prevails and with a heavy fine they are left to their devices and a very happy marriage. The rest of the novel takes us through their lives together which include no less than 12 children, the marriage of Henry VI to Margaret of Anjou, the beginning of the battles of the Cousins' War with Richard, Duke of York, and the eventual demise of Henry and Margaret with the rise of Edward IV of York. I devoured this 437 page novel in about a day and a half...no joke..this is how much I love this stuff. Gregory's writing is so poetic and flowing that you forget you are reading about actual historical events and the drama that goes on rivals any non-historical fiction work out there. Seriously people, the best stories are those rooted in the past.The only negative I have are some of the battle scenes got a little boring to me, but they were not long or drawn out I was just impatient to get to the meat of what happens after. I also reeeeeally wish Gregory would have taken us to the arrest and execution of her husband and son. We get this story both in The White Queen and The Kingmaker's Daughter but I would have love love loved to hear her personal perspective of the situation. Oh well, we can't get everything we wish for. I also love how much power and strength Gregory gives to her heroines. In a time where women were regarded as property of their fathers then husbands then sons, she weaves tale after tale of women rising up and wielding the power that is within their reach. And while some women take things too far and create their own downfall (Anne Boleyn, Margaret of Anjoy, Katherine Howard, etc.), there are those that know how to play the game and solidify their spot in the world (Jaquetta, Elizabeth Woodville, and Elizabeth of York). I find it so interesting how Gregory portrays these strong women of the time and how easily they could have played such major roles of the time but just had to be kept more behind the scenes.Like I said, I cannot get enough of this time period, I mentally swoon over Richard Woodville and Edward IV and I am totally going to now re-read The White Queen so I can re-live, yet again, the courtship and life of Edward IV and Elizabeth Woodville."}, {"userName": "Wilja", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/40211206-wilja", "userReview": "In meinen Instagram-Highlights unter „currently“ könnt ihr meine „Kurzmeinung“ dazu hören. https://www.instagram.com/wiljavanblog/"}, {"userName": "Kimberly", "userReviewDate": "Mar 04, 2011", "userURL": "http://www.goodreads.com/user/show/2669490-kimberly", "userReview": "Where to begin...It had been a while since I'd read a Philippa Gregory book (and I'd liked her books in the past--The Other Boleyn Girl being my favorite), so I was looking forward to reading The Lady of the Rivers after I won it through First-Reads. After starting it, I quickly realized PG's writing has become a shadow of its former self. Devoting an entire book to Jacquetta was questionable to begin with; for all the royal goings-on that she was privy to, her life really wasn't all that exciting. The novel consisted a lot of such-and-such happened and then I went into confinement and had another baby (I believe the grand total was 14). Since not as much is widely known about Jacquetta as, say, Anne Boleyn, I was expecting some further character development and insight into who she was. Unfortunately, PG does extremely little character development and for most of the book I couldn't ascertain if Jacquetta was just stupidly ignorant or so innocent that she couldn't quite grasp political implications. All of the other characters were as equally one dimensional and you really couldn't love or hate any of them because they were just...there. PG should have just written a non-fiction book about Jacquetta since she really didn't offer any insight into Jacquetta which, in my mind, is part of the point of historical fiction. But, oh yeah, Jacquetta's life isn't really that interesting to begin with! The beginning of the novel was really reminiscent of an Arthurian legend to me: Jacquetta is married to John of Lancaster, 1st Duke of Bedford (a.k.a. Arthur), but she is really in love with Richard Woodville, the Duke's Chamberlain (a.k.a. Lancelot). All of the magical infusions in the story really made this seem even more so. When Jacquetta finally realizes she is to be parted with Richard, her verbal reaction was incredibly stilted. I would compare it to a modern woman finding out that she was going to have to live without her cell phone, \"But, I've always had a cellphone...what will I ever do without one?\" After Richard got a taste of Jacquetta's virginal, unicorn beckoning magical huha, Bam! they were inseparable and there really wasn't any more to their relationship than that. Well, in PG's imagination at least.Two other major gripes I had with the book were the constant reminders of who characters were. Within pages it was literally, \"Duchess Eleanor\", \"The duchess\", and then \"Eleanor, the duchess\". Readers aren't that stupid that they can't remember who one of the main characters is and what title they hold! Also, I really didn't understand why PG had Lewis die at age 12 when the family tree says he died in infancy. Now I know infancy is a loose term, but shouldn't it be 'adolescence' or 'childhood' by that age? Maybe not, but it seemed so to me.Overall, the story was okay and even entertaining in parts with the King and Margaret. I don't think this novel could ever have been a 5 star book considering the subject alone, but it definitely would have garnered a higher rating if PG had just explored her characters more and had fun writing it. I really got the feeling that the book was more of a chore for PG to write rather than a pleasure. I wish she could tap into her imagination like she used to to at least write a page-turner with some scandalous and interesting people. 2 stars."}, {"userName": "Jessie  (Ageless Pages Reviews)", "userReviewDate": "Apr 06, 2011", "userURL": "http://www.goodreads.com/user/show/4863162-jessie-ageless-pages-reviews", "userReview": "Read This Review & More Like It On My Blog!Though not nearly as hair-pullingly irritating as its predecessor The Red Queen, (which irritated me so much I didn't even review it. Who wants to read four+ paragraphs of \"UGH\" and \"WHY DOES SHE DO THIS!\" and \"Shouldn't Margaret of Anjou be the Red Queen NOT Margaret Beaufort?\") The Lady of the Rivers has its fair share of problems. This time the story follows Jacquetta of Luxembourg, Dowager Duchess of Bedford, historically remembered most as the mother of Elizabeth Woodville, the wife of King Edward IV of England. This novel has an additional focus on witchcraft/charms/herbs that the previous novels lack (exception: The Queen's Fool [Tudor Series #4] has a supernatural element for the main character as well, but less hackneyed and also less of a deux ex machina) - and a move I cannot fully support. Using the legend of the mermaid-like Melusine/a as an ancestor to Jacquetta's House (a \"fact\" which was repeated ad nauseam - one reviewer was keeping a count of mentions and I stopped paying attention after #20) to justify this fantastical element, Jacquetta is shown to be quite adept as well as having considerable powers. I felt that reducing Jacquetta's hard-won influence and knowledge to a charlatan-like propensity to \"read the cards\" did the character a serious disservice. If the author wants to write a strong, determined historical fiction about a woman in the 1500s - by all means do so! But don't reduce her accomplishments and feats by flavoring the success with \"magic\". I also was out off by some inconsistencies within the novel (I am not even touching historical inaccuracies) such as Richard being referred to as a squire, a knight, and then a squire once more without any mention as to a knighting ceremony or why he would've been reduced to the status of a squire after achieving knighthood.Self-important and strident, Jacquetta is not the typical woman of her times (the novel begins in 1430) and the message that she, and strong, commanding women like her, are not welcome and face death for their knowledge. Gregory uses several famous women to illustrate this point - repeatedly - throughout the novel. Joan of Arc(!), Duchess Eleanor of Gloucester, and the even the proud Cecily Neville are all brought low before her eyes, seemingly just to teach Jacquetta caution. I can't say I cared too much for this version of Jacquetta, though I did warm to her particularly in the last fifty pages of the book. She rarely demonstrates a feeling or idea, most of this entire novel is \"told\" rather than shown. Having married her first husband's squire (Robert Woodville) for love, I found a sad lack of chemistry between the two. Example: how do I know Jacquetta loves Richard? She says she does. That's it, that's all; no real emotion or demonstrances of genuine affection. Stiff and awkward dialog along with clunky exposition do the two lovers no favors either. The first-person perspective was well-used, and Gregory even manages to show a battle scene without randomly/abruptly changing perspective and locales. It also helps that Jacquetta, though often annoying and slightly ridiculous is far easier to read than Margaret Beaufort's cold arrogance in The Red Queen.Gregory does a fine job with the atmosphere of the story, as she usually does. There's a decent amount of tension constantly teeming around Jacquetta: her witchcraft/magic abilities, her illegal marriage, her husband is far sent away (again and again), birthing 16 (!!!!) children, running from battles, her fear of persecution, etc. For all my complaints, I will say that this is far from a staid novel; the kickoff to the War of Roses is excellent fodder for suspense and ridiculous amounts of tension between royal houses. The frequent and bloody battle scenes add much to the feel of the novel, creating a dark and foreboding air. Intrigue among the court is what Gregory does best and the novel succeeds the most when it is within the confines of the scheming court. While the writing itself can be stiff and overly formal, I noticed less and less over the book. Whether it's because the quality of the writing itself improved or I adjusted to Gregory's \"style\" is up for debate. I do find the random jumps in the chronology (a year here, three years there) to be very distracting from the flow of the narrative and also FULL of info-dumping. Short, very pointed chapters explain away the missing years but left me feeling very dissatisfied. For instance after Jacquetta marries Robert without permission (a rather big no-no for a Duchess), the story completely skips over the intervening years of poverty and struggle and instead flashes forward to when the newlyweds are re-welcomed at Court. I felt slightly cheated by this particular jump; Jacquetta struggling to earn a living versus the entitled pampered life she led before would have provided a nice dichotomy between the lifestyles of the rich and the poor of England.A novel that both entertains and irritates, Gregory uses a lot of the same \"tricks\" that so many deride her over. There is the constant repetition of names with titles, of past accomplishments, who is related to whom... as if she has no faith in her readership to tell characters apart. Added to explanations of \"why\" and \"how\" people do things instead of showing them, Gregory can be frustrating to read. I know it's frowned upon to quote from an ARC but this passage exemplifies many readers issues with Gregory:\"'Edmund Beaufort Duke of Somerset...' [...] 'You mean Edmund Beaufort Duke of Somerset? The man who lost us Normandy [...] but for the King's unswerving belief in his kinsman and the Queen's misplaced affection... [...] 'I'll be commanded by the man who gave away Normandy. '\"Instead of just using \"Edmund\" or \"Beaufort\" or even \"Somerset\", the man's name has to be supplied twice, along with his title and his most recent accomplishment in the novel. Furthermore, the author even explains why the Duke is so beloved instead of showing so and trusting her readers to pick up on the plotline. Gregory clearly buys into the \"Somerset + Margaret of Anjou = Edward, Prince of Wales\" theory so why not try to SHOW such instead of having a character narrate the information? I understand this is a historical fiction, so dates/events might get mixed around and changed but underestimating your readers to the point you have to hammer in every title, every detail is insulting.The ending felt, to me, rather abrupt and uneven. The finale of this novel transitions to the very beginning of The White Queen: with Jacquetta's beautiful daughter Elizabeth Woodville standing by the road looking to enchant King Edward IV. I had hoped for more time with Jacquetta. I would've preferred less focus on the early years in order to see what Gregory would do with this character later on in the century; I was much more interested in what would happen after the Rivers family switched from Lancaster to the York side. I also wonder why this novel was published third, when it would make the most sense to read first in the series. Not only is it chronologically first,but it is a stronger effort than The Red Queen or The White Queen. I think I may be running out of time and affection for Ms. Gregory. I loved her Tudor novels when I first read them sixish years ago (though I'd probably not in a re-read now) but this series has so far done little to make me fall in love. With such a drama-filled, absolutely interesting and dynamic era, I can't help but feel there should be more substance and less drama/dresses to The Lady in the Rivers."}, {"userName": "Naomi Blackburn", "userReviewDate": "May 26, 2011", "userURL": "http://www.goodreads.com/user/show/3849903-naomi-blackburn", "userReview": "I think I was probably harder on this book than I needed to be, but I really felt this book was choppily written for being a PG book. In her last few books, I have found her going down the path of James Patterson~lower quality books because the market for her works is already set. That is how I felt with this book. Not only did I feel it was choppily written, but very superficial to boot. I was just really, really disappointed. I have seen this occurring in a very slow progression with her books and have always given her the benefit of the doubt, but this one just ticked me off because it was so obvious."}, {"userName": "Cher", "userReviewDate": "Jun 15, 2014", "userURL": "http://www.goodreads.com/user/show/4776032-cher", "userReview": "2 stars - Meh. Just ok.This series is not placed in chronological order as is the case with her Tudor series. Unfortunately, this led to a feeling of repetitiveness as this story takes place before the 1st in the series. Therefore many things are repeated or have already been covered which made for a ho-hum read. I never felt particularly moved or impressed by the writing, and the historical figures simply did not come to life as they typically do in Gregory's books. Hopefully this one was just a fluke.-------------------------------------------Favorite Quote: Any woman who dares to make her own destiny will always put herself in danger.First Sentence: She sits, this odd trophy of war, as neat as an obedient child, on a small stool in the corner of her cell."}, {"userName": "Lois", "userReviewDate": "Aug 31, 2012", "userURL": "http://www.goodreads.com/user/show/1105306-lois", "userReview": "This remains my favorite of The Plantagenet and Tudor series. I LOVE the supernatural elements woven into this character. It's honestly the most historically accurrate aspect of this novel. Modern views on mysticism and witchcraft don't apply in this time. The people alive very much believed and ordered their major life events around what we now label superstitious nonsense. It was very real to them and I always appreciate when that aspect is included in narratives of this kind."}, {"userName": "Konstantin", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/60906430-konstantin", "userReview": "3.5 zvezdice"}, {"userName": "Iset", "userReviewDate": "Feb 25, 2011", "userURL": "http://www.goodreads.com/user/show/4973578-iset", "userReview": "[I highly doubt that the Duke of Bedford married Jacquetta in order to keep her a virgin so she could be a seer for his experiments into alchemy (hide spoiler)]"}, {"userName": "Ocean Weeks", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/31359202-ocean-weeks", "userReview": "I just couldn't seem to get into this book, but I will reread it before the year is through so that it actually counts towards my reading goal.DNF.But, I think I'm just not in the mood for this specific writing style."}, {"userName": "Alex Farrand", "userReviewDate": "Sep 24, 2016", "userURL": "http://www.goodreads.com/user/show/37663070-alex-farrand", "userReview": "2.5-3 stars. How can I put this? I was interested in the topic, but it was a little dull. I thought Jacquetta was an interesting character. I started looking up information about her and her family. She has a lot of potential, but I don't think there was much information about her, hence more of the book was sort of ehh. It started out well with Joan of Arc. I like her. I think Philippa Gregory was trying to fill in the blanks, basically, until a certain part of history occurred. So not much action pack information, but boring herbs and a lot of waiting. Maybe the last 100 to 150 pages were interesting. By the end of the book I just wanted to know the real history. It wasn't a hard read. I was surprised of the simple language that was used. There were no complicated passages with medieval slang or words. I did get annoyed with repeated sentences.I heard that the other two books of the Cousin's War were good, and I think this book is a good start for the other novels. Gives you a little back ground information about what is going on. Therefore, I will read the White Queen whenever I get the chance."}, {"userName": "Liliana Rio", "userReviewDate": "Mar 19, 2016", "userURL": "http://www.goodreads.com/user/show/19390729-liliana-rio", "userReview": "4.5*"}, {"userName": "C.W.", "userReviewDate": "Dec 12, 2011", "userURL": "http://www.goodreads.com/user/show/1591888-c-w", "userReview": "- This review was first published in the November 2011 edition of The Historical Novels Review -Philippa Gregory’s third entry in her Cousins’ Wars series features an unusual character: Jacquetta Woodville, mother of Elizabeth, who in turn gave birth to the princes who disappeared mysteriously in the Tower. In THE LADY OF THE RIVERS, Ms Gregory travels further back in time, bringing us a glimpse of the seeds of the epic conflict that will be known as the War of the Roses. French-born Jacquetta first weds an older duke more interested in her supernatural gifts than her physical ones; upon his death, she defies convention to find love with his squire, whose loyalty to the crown brings them heavy responsibilities. Through Jacquetta’s eyes, we’re given a wide-angle view of the lethal intrigues that plague the English court, where a young, weakling king is manipulated by his nobles, and accusations of witchcraft are wielded to destroy opponents. The end of the Hundred Years’ War, when England lost its territories in France, offers a compelling backdrop to Jacquetta’s personal trials as she endures repeated separations from her husband and witnesses the depredations of power-hungry courtiers. When her fortunes increase with the arrival of Margaret of Anjou, a princess brought to wed the king, the novel becomes more intimate, as well. Margaret is a compelling character who steals the show— not yet the Lancastrian virago of legend, Gregory depicts her as a brash, beautiful girl tethered to a man better suited to prayer than bed play; Margaret’s vulnerability and fallible relationship with Jacquetta bring humanity to the crowded historical events. Jacquetta’s magical gifts are underplayed except for one crucial episode; and her astounding fertility and perennial passion for her husband, as well as her keen insight, center her as a voice of reason in a complex, treacherous era."}, {"userName": "Patty", "userReviewDate": "Oct 26, 2011", "userURL": "http://www.goodreads.com/user/show/3550357-patty", "userReview": "First off, isn't that a glorious cover?I did not have the good fortune to read Ms. Gregory's The White Queen and The Red Queen which told the stories of Elizabeth Woodville and Margaret Beaufort the two queens involved in \"The Cousins' War\" or The War of the Roses as it came down in history. The Lady of the Rivers is about Elizabeth Woodville's mother, Jacquetta.Jacquetta is a woman almost lost to history in spite of her being Henry VII's grandmother and Margaret Beaufort's devoted friend and ally. I am not going to go into her history here as the book synopsis explains it quite adequately. I will tell you that what traces of Jacquetta that could be found in the historical record are woven into a fascinating tale of young woman with a knowledge of healing and a mystical family history living in a dangerous time.Witchcraft was feared by rich and poor alike in this period of time and the hysteria that led to burning so many innocent women at the stake is only a few years away. Jacquetta has a gift with herbs and healing and she is very prescient so some think her a witch. Her supposed descent from the water goddess Melusina is well known and at times cause for suspicion.I was enchanted by this story and found Jacquetta to be a fascinating woman. In other books from this time period she has been represented as a bit of a shrew so it was nice to see her as a fully fleshed out character. Ms. Gregory is, as always, a delight to read. She has divined a life for this woman out of very little written record and a good life it is. As always, I will look forward to her next book."}, {"userName": "Elaine", "userReviewDate": "Sep 22, 2012", "userURL": "http://www.goodreads.com/user/show/8189898-elaine", "userReview": "Philippa Gregory is always good value and very rarely disappoints. I love the way she always looks at the female protagonists and their perspective, of the era she writes about.Usually quite overlooked in what was quite a male dominated time and place. Although criticised for the liberties she takes with some historical facts, she is the first to admit to poetic license. There is enough historical content to satisfy those who want it that way and enough fiction to make for a great story. The story of Jacquetta of Luxembourg, mother to the first Yorkist Queen is quite fascinating."}], "description": "Jacquetta, daughter of the Count of Luxembourg and kinswoman to half the royalty of Europe, was married to the great Englishman John, Duke of Bedford, uncle to Henry VI. Widowed at the age of 19, she took the extraordinary risk of marrying a gentleman of her household for love, and then carved out a new life for herself.", "title": "The Lady of the Rivers\n      \n          (The Plantagenet and Tudor Novels #1)", "url": "http://www.goodreads.com/book/show/9542439-the-lady-of-the-rivers", "average": 3.97, "cover": "https://images.gr-assets.com/books/1327946219l/9542439.jpg", "reviews": 3061, "authors": [{"url": "https://www.goodreads.com/author/show/9987.Philippa_Gregory", "name": "Philippa Gregory"}], "type": ["Historical", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/9542439-the-lady-of-the-rivers", "http://www.goodreads.com/book/show/10796011-the-lady-of-the-rivers", "http://www.goodreads.com/book/show/15762087-die-mutter-der-k-nigin", "http://www.goodreads.com/book/show/12265880-the-lady-of-the-rivers", "http://www.goodreads.com/book/show/10796012-the-lady-of-the-rivers", "http://www.goodreads.com/book/show/22537025-ledi-rivers", "http://www.goodreads.com/book/show/12637464-the-lady-of-the-rivers", "http://www.goodreads.com/book/show/13418927-a-senhora-dos-rios", "http://www.goodreads.com/book/show/37470.The_Other_Boleyn_Girl", "http://www.goodreads.com/book/show/16181.The_Constant_Princess", "http://www.goodreads.com/book/show/5971165-the-white-queen", "http://www.goodreads.com/book/show/252499.The_Queen_s_Fool", "http://www.goodreads.com/book/show/16180.The_Boleyn_Inheritance", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}