{"ratings": 1266, "userreviews": [{"userName": "Esil", "userReviewDate": "Oct 01, 2015", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "2 ½ stars. I probably shouldn’t have read The Light of Hidden Flowers. I expect that many people will enjoy it, but it wasn’t really for me. It’s quite light and predictable. When I started it, I had just finished a very heavy book and something light seemed like the right thing. After a while, my need for something light waned as did my interest. Missy’s mother died when she was four years old. She has always been close to her father and chosen a straight and unadventurous life, working in partnership as a financial adviser wither her father. Her father dies and leaves her a letter suggesting that she try a more adventurous life. At first, she is furious and then she starts to see that he may have a point. And off she goes on an adventure in search of a more meaningful life. There’s also a lost love in the background, and a steady but dull current boyfriend. As I said, where this goes is quite predictable and I must admit to having only really scanned the last 20%. But I see that many of the ratings are fairly high and I expect that many readers will enjoy this book. Missy is quite likable and the underlying message is fine. But I’m going to move on to something more quirky and meaty. Thank you to Netgalley and the publisher for an opportunity to read an advanace copy."}, {"userName": "Kelly", "userReviewDate": "Jul 24, 2015", "userURL": "http://www.goodreads.com/user/show/9077138-kelly", "userReview": "See this review on 1776books.net...http://1776books.blogspot.com/2015/08...What does it mean to really live? Are we meant to take life by the horns and suck every ounce we can out of it, or is better to just sit back and let others do it? In Jennifer Handford's The Light of Hidden Flowers, the answer is pretty clear, and the main character's journey to this realization is one that readers will love taking with her.Missy Fletcher is a partner in her father's financial firm. Frank Fletcher is Missy's only family member, as her mother died when Missy was very young and she doesn't have any siblings. A force to be reckoned with, Frank loves life, enjoys it immensely, and can't understand why his daughter is content to just sit in the background, going home every night to her Jeopardy reruns, Facebook lurking, and pistachio gelato. Missy's dream has always been to go to Italy, but her debilitating fear of flying has kept her grounded. When Frank develops Alzheimer's and ultimately passes away, it's a letter he leaves Missy that helps her to turn her life around, becoming more assertive, contacting a lost love, and even getting over her fear of the airplane to do something great.Not to sound all Oprah, but The Light of Hidden Flowers is one of those wonderful books that really makes you think about how you're living your own life. With characters you come to care about (especially Missy, who you'll be rooting for all the way), it's perfect for when you need a little pick-me-up.MY RATING - 4"}, {"userName": "L.A.", "userReviewDate": "Sep 14, 2015", "userURL": "http://www.goodreads.com/user/show/4055856-l-a", "userReview": "Posted first to Blog Critics as Book Review: 'The Light of Hidden Flowers,' A Novel by Jennifer Handford.In The Light of Hidden Flowers by Jennifer Handford, we are introduced to a touching and realistic relationship between a father and his daughter. Melissa Fletcher works with her father who she admires for his ability to garner trust and friendship’s with his clients while at the same time seems to have a depth of memory in which to draw upon background information that helps solidify their trust. Melissa herself is more quiet and serene, working behind the scenes at their business, while helping to guide both her father and the others working in their financial offices.As her father’s searing memory begins to falter, Melissa tries to help as much as she can. When his clients also begin to notice the decline, trust also begins to falter. Leaving the more demanding tasks of the business to his closest partner, Melissa can only do her best to help her father through the ravages of Alzheimer’s. Becoming primary of the firm has never been her want, and yet it is thrust upon her when he passes.When she finds a letter from him, meant to sooth her she is only further troubled for on one hand he praises her for being dutiful and yet he also scolds her for not taking risks. Unable to put his words aside, Melissa heads for Italy where she meets a young woman who suggests a very radical idea.Melissa soon finds herself in India, searching for herself while putting together a plan of redemption and reconnecting with a lost love. Is her search really the answer to her father’s dream or her own? She must pursue her dreams and take the risks that have always felt so out of bounds. Can she overcome her insecurities and become the woman her father dreamed her to be, and can she come to terms with her own dismay at his words?Handford takes us into the psyche of a young woman who has grown up in a sheltered world and been in the background of her father’s life, unwilling to move from the protection. When she is thrust from her comfort zone and forced to face the world on her own she must draw from within to find what she finally understands is missing. Yet she must deal with anger and pain, self-doubt and insecurity pushing her own internal boundaries.The story of love, loss and growth is well written and grabs you from the beginning. You endure the heartache of the loss of a loved one and the journey of redemption. There is a great appeal to the reminder that we can follow our dreams, for it is never too late.If you enjoy contemporary fiction with threads of growth and loss, love and light, and an overall moral of determination you will find this a great work for your library. The beauty of thought leaves you searching your own dreams.This would be a great look for a Book Club or reading group. The idealism and questions garnered would create solid dialogue."}, {"userName": "Rob Slaven", "userReviewDate": "Dec 20, 2015", "userURL": "http://www.goodreads.com/user/show/14011226-rob-slaven", "userReview": "I received this book free for review from the author or publisher in exchange for an honest review. Despite the privilege of receiving a free book, I’m absolutely candid about it below because I believe authors and readers will benefit most from honest reviews rather than vacuous 5-star reviews.The spoiler-free nutshell on this book is that it is a coming of age story centering on a 35-year-old woman who spent her life as the nerdy bookish sort and never really got out of her shell to find out who she truly was. The story centers on her development as she breaks free of her usual well-worn rut and makes the life for herself that she always wanted.On the positive, side, the book displays a lot of positive role modeling for those of us who are a little less thrill seeking in our lives. Our protagonist pushes her boundaries and for the first time in her life does what she wants rather than residing in her fearful bubble. The prose is silkily smooth and very easy to consume in a few hours. You can gobble this one down in a few hours. The characters are consistent and well-developed.To the negative, there aren't really a lot of surprises in this book. It follows pretty much the path you would expect from beginning to end. If you want a book that challenges you are makes you think new and lofty thoughts then this isn't it. It's got a sure Lifetime made-for-TV movie feel to it but that is compensated for by the fact that it is so well polished and, perhaps in part, so easy to relate to for those of us who aren't pushing our own envelopes on a regular basis.In summary, this is a book to gobble down in a single long Saturday afternoon, perhaps with your feet up or swinging in a hammock. It won't teach you anything new but it may inspire you to try something new that you've been considering for a while.PS: I hope my review was helpful. If it was not, then please let me know what I left out that you’d want to know. I always aim to improve. --- Free copy received for review"}, {"userName": "Rebecca (agirlirlblog, bekkilyn)", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/4912335-rebecca-agirlirlblog-bekkilyn", "userReview": "Missy Fletcher is a 35 year old woman, introverted, brilliant, and works with her dad in her dad's company as a financial analyst. Her mother died in an accident when she was four, and her dad is very extroverted, well-liked, and gregarious. Though she loves her dad, she tends to feel overshadowed by his personality. Though her dad loves her, he seems to feel that she would be happier if she came out of her shell and learned to take more risks. It seems that everything will go on as it always has until the day her father gets sick and passes away from the illness.Now Missy has to somehow learn how to be an adult, on her own for the first time ever.Usually coming-of-age stories are about children in their teens, so this book is more unusual in that it's happening to a 35 year old woman. \"Who is Missy, really?\" is one of the questions that Missy must discover now that she can no longer live as her father's daughter. Will Missy need to somehow turn into another version of her father, or can she better succeed by moving forward in her own way?I really enjoyed the way this book was written. It had something of a fairy-tale quality to it that I liked, though made no promises of happily-ever-after. Living in the moment and in the here-and-now was more of a theme in that sense."}, {"userName": "Maryellen Walter", "userReviewDate": "Oct 30, 2015", "userURL": "http://www.goodreads.com/user/show/12161715-maryellen-walter", "userReview": "Couldn't put this book down. Missy is dealing with her father's ALzheimer and dealing with what she calls her ordinary life. What she does definitely makes her life anything but routine. The only thing missing was more about what happens after she makes so many life changes. More would have been good."}, {"userName": "*P*u*r*p*l*e* Masochist", "userReviewDate": "Oct 02, 2015", "userURL": "http://www.goodreads.com/user/show/1977643-p-u-r-p-l-e-masochist", "userReview": "~Arc was provided as a gift by Netgalley in exchange for honest review~ Thanks Netgalley! <3"}, {"userName": "Nancy", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/6147556-nancy", "userReview": "This book was a page turner for me. Beth is the main character, who works for her dad in a very successful investment business. Her mother was killed in a car truck accident when she was four years old. Beth was a genius, and had a hard time making friends in junior high school, and afterwards. She didn't go through the teenage rebellion phase, and was always the good daughter. In high school she fell in love, and they promised to love each other forever, but they went their separate ways. The dad started having memory losses, and had a stroke. Beth took care of her dad, and hired a nurse to take care of her dad during the day. The dad died, leaving Beth a rich woman, with a note from her dad, telling her to make more of her life. Now she is angry, and goes through her teenage rebellion. She makes changes, and helps girls in India get an education. She learns more about herself. I thought she would end up with her high school love, but that was left open."}, {"userName": "Brandi", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/11839891-brandi", "userReview": "I liked it. There weren't any huge surprises or anything but I had a feeling of lightheartedness when I finished. I don't want to give any spoilers, but if you read it, you'll be able to predict what happened. One thing I did really like was the prose."}, {"userName": "genyvieve", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/1237881-genyvieve", "userReview": "\"We were born whole; we were born new, and each life experience coated us with another layer. These layers protected us like armor, but they also covered us to the point where we no longer could feel. That was the balance: to open up to the experiences, to strategically place the layers, but to leave the heart open. The heart had to be sent into the front lines every day, naked, unarmed, willing to take fire. That was the only way to live. With risk. On the cusp of dying.\""}, {"userName": "Sophie Cayeux", "userReviewDate": "Dec 06, 2015", "userURL": "http://www.goodreads.com/user/show/8938367-sophie-cayeux", "userReview": "This story is a real do-good-and-feel-good story. It is easy to fit in the skin of Missy, the protagonist. She reminds me of loads of ambitious young women, beautiful, intelligent and successful yet always pushing themselves to perfection, working to exhaustion, socially isolated, shying away from intimate relationships and dedicated to the care of their loved ones – and yet they crave for love and life but are too scared to just leave it all and go to taste what it is like beyond their comfort zone. In this book Missy at last managed to overcome her fear of life and love and achieves something wonderful. And this happens when sadly her wonderful super clever hero of dad has a stroke and becomes demented – again a sadness that a lot of us can associate with. It is her dad who prompted her to go for life and when he dies she does at last go for it.However too much of the book is about her secure and boring life managing portfolios of millionaires and surrounded by uninspiring men. I nearly tossed the book away at that point. I’m glad I didn’t because at last she overcomes her fear and leaves and goes away to do something with all her knowledge and money. This experience opens her up emotionally and is at last exciting to read. I so much wished that this caring super woman would let more emotions enter her body and heart (and that it would infuse her writing) - but this wasn’t to be. Alas her mind keeps her emotions under control and guides her emotionless pen – so much so that she doesn’t even tell us what happens in the end when she finds love again with her college sweetheart after fifteen years of separation. However her charity work stands strong and for this I am grateful that she sets an example and shows how fulfilling this can be to both those who give and those who receive. I wish so much that many Missy out there with their heavy portfolios would follow Missy’s example and enhance their lives in a similar way. The Island Girl"}, {"userName": "Janine", "userReviewDate": "Dec 29, 2015", "userURL": "http://www.goodreads.com/user/show/2847202-janine", "userReview": "A thought provoking tale of self discovery.Melissa “Missy” Fletcher was always a good girl and her father’s pride and joy. At thirty-five, she has a successful career as a financial adviser working with her father. She doesn’t care for socializing after work or dating. She prefers her predictable life as it is, working and then going home alone. When she is introduced to Lucas, she decides to give him a chance and they start dating and get serious. But there is one man that Missy will never get out of her head, Joe, her high school boyfriend. What if they could have a second chance?When Missy loses her father to Alzheimer’s, her world is turned upside down. She starts second guessing everything in her life. She decides to give into one of her biggest fears, flying. She takes a trip to Italy, a place she always wanted to visit. During the trip, she meets a young lady, Reina, who works for UNICEF. When Missy learns what Reina does, it sets her mind in motion. From Italy, Missy heads to India to meet with Reina again. Together they make life changing plans for some underprivileged girls and Missy finally finds a new life for herself and one that would make her father very proud.I thought the story was very well thought out and it is one that will stay with me for a long time. I enjoyed the reunion between Missy and Joe and how well Missy got along with Joe’s daughter Katherine who needed a meaning in her life as well. The only issue I had with this book was the ending. I felt it ended abruptly and more could have been added to wrap up the story."}, {"userName": "Nayuleska", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/2272587-nayuleska", "userReview": "This story is a really emotional read about self-discovery and following your passions in life (after discovering them), something which I'm keen to promote as I follow my dreams of being published! I felt sorry for Missy, it's super hard to get her father to acknowledge that he is having health issues, which does affect a few customers negatively at first. When the acceptance comes he is still stubborn and tries to do more than he is able, making Missy having to cover his mistakes.When the inevitable happens Missy questions her own life, and what she truly wants to do. That holiday to Italy sparked an incredible journey which led her to helping girls who desperately needed help to better their lives, and the lives of their families. It goes to show how 1 person (with others on the same project) can make a huge difference, even when the odds aren't stacked in their favour and they don't quite think everything through. Inspite of the heaviness of the story, there is a lot of humour which balanced the overall feel of the book. Missy's old and new friends made me smile, and were there to help when Missy was bombarded with problems. Missy's story is an inspirational read, so go find your passion and live it! I received a copy from NetGalley in exchange for an honest review on my blog Nayu's Reading Corner nayusreadingcorner.blogspot.co.uk/201..."}, {"userName": "Sue ", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/1895704-sue", "userReview": "I was easily able to sink into the pages of The Light of Hidden Flowers.I liked the differing POV's that The Light of Hidden Flowers was written from. I liked feeling like I got to know the main characters below the surface...and these characters are deeper than they first appear. I struggled between being frustrated with Missy at times, and at other times my heart ached for her. She is an interesting character and her journey through The Light of Hidden Flowers was one I am glad I took with her!Where we end up with Missy was unexpected, but it felt good. There is romance in The Light of Hidden Flowers, but this is mainly Missy's journey about moving on, and finally moving out of her safe zone.Jennifer writes with wonderful descriptives, especially when Missy ends up in India. This felt realistic, was educational, and a real eye opener. The Light of Hidden Flowers flows smoothly, is emotional and inspiring. I'd recommend it to any women's fiction reader!I received a free copy for an honest review."}, {"userName": "Kara Hansen", "userReviewDate": "Oct 07, 2015", "userURL": "http://www.goodreads.com/user/show/10572178-kara-hansen", "userReview": "I received this book from NetGalley in exchange for an honest review. I found with this book that there were a lot of parts I enjoyed, and there were some that I found difficult to get through. While I enjoyed the character of Missy Fletcher, I found that the points of view of the different characters was not consistent~ there were parts where it conveniently flipped from a chapter with Missy, then a chapter with Joe. Then suddenly we don't hear from Joe for a long time, until we are nearing the end. As for Lucas, he is portrayed as very one-dimensional, and I felt overly done character traits. The other part that I had a hard time with was Missy's sudden turn from self-described workaholic, to suddenly deciding that she needs to do something more for the world. Yet, throughout her time in India~ both with Reina and Kate, I felt her heart was not truly in it. That she was building this orphanage to say she had done it, but would very quickly get back to her old life. Not a book for my highly recommended list."}, {"userName": "Nikki", "userReviewDate": "May 22, 2016", "userURL": "http://www.goodreads.com/user/show/1591542-nikki", "userReview": "Tender and lovely.What a lovely, thoughtful story. Missy Fletcher is the kind of character a lot of people can relate with-someone with dreams but also trapped in the minutiae of a well-established life. The process by which she slowly peeled away the ties that bound her and ventured out into what she really wanted was very organic and very REAL-I think that's what made it so powerful, because I could see not just myself, but many people in her struggle to figure out who she was away from the shadow of her father's light. I loved the way her relationships developed-with Joe, with Kate, with Reina, and even with Lucas. I felt the latter was in some ways the most important of all, because it was the safest at a time when she was learning how to be dangerous. Just a lovely story."}, {"userName": "Jennifer ~ TarHeelReader & Traveling Sister", "userReviewDate": "Sep 19, 2015", "userURL": "http://www.goodreads.com/user/show/32340179-jennifer-tarheelreader-traveling-sister", "userReview": "A charming book about a woman moving past her losses and growing up, even in her 30s. Missy's story was beautifully and uniquely told. It was nice to have a protagonist choose a \"different\" path for her life from what is typical or expected. I highly recommend this book for fans of women's fiction."}, {"userName": "Rosanna", "userReviewDate": "Oct 04, 2015", "userURL": "http://www.goodreads.com/user/show/21289166-rosanna", "userReview": "I was a bit confused as to what this book what trying to be. Was it a romance, coming of age, self-discovery??? I think there was too much going on to be wrapped up in a neat little package. Also, there was too much minutiae about the main character's daily routine.I was given and advanced copy by NetGalley in exchange for my review."}, {"userName": "caroline", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/3398145-caroline", "userReview": "I received this book as part of Goodread's First Reads program. Honestly, the book could have started at page 200 with the letter from her father. The back story was such fluff. Although I did enjoy her fathers messages and meaning of life."}, {"userName": "Donna J", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/45182517-donna-j", "userReview": "I expected more....When I was reading \"The Light of Hidden Flowers\" I was getting exhausted with the main character...i felt as if I was yelling at her, but realistically, I was so angry at the author. The subject matter of Alzheimer's is a sensitive one and emotional, but you add a woman as the caregiver who has convinced herself she has no life, no backbone and it's beaten so much into this book, it's exhausting. I loved her father as the Alzheimer's patient, yes he was her world but when it becomes out of control, as the reader I expected the story to come to a head sooner than it did. The author then adds another story of a veteran Joe who lost his leg and has his own issues, but I decided not to give the story away since it's too easy...I believe our opinion counts more. I was sensitive to all issues brought up in this story but if you decide to read this book I truly believe when Alzheimer's and other issues re: Indias poverty are explained...I basically could have read a text book...It's waaaay too long, and many times I wanted to quit but I continued on. There's too many areas that I disagree on...wasn't the book I was expecting..."}, {"userName": "Michele", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/1065386-michele", "userReview": "This was an OK book with OK characters. It wasn't, though, thoroughly engaging. Missy is an introverted, extremely talented financial expert who works with her father in his financial firm. Her life is her father and her work. When she loses the former, she begins searching for what she is missing. Her search takes her to Italy (this episode was much too short for me) and then on to India where she hopes she can use her financial fortune to help others.The other part of the book is Missy's love life. She has none until she meets Lucas, a wonderful man who is just like her but maybe too much like her. Then, there is Joe, a long-lost high school sweetheart who is married with three children.There was an occasional word of profanity but fortunately, that was pretty rare. Sex outside of marriage was accepted but there were no sex scenes.Interesting enough to keep me reading until the end but nothing that truly drew me to the story."}, {"userName": "Lacey", "userReviewDate": "Sep 09, 2015", "userURL": "http://www.goodreads.com/user/show/2006264-lacey", "userReview": "*I won this book from goodreads' first reads.From the goodreads description that led me to enter the giveaway in the first place:\"After her father’s death, Missy finds a letter from him in which he praises her for being a dutiful daughter but admonishes her for not taking any risks in life.Devastated, Missy packs her suitcase and heads for Italy. There she meets a new friend who proposes a radical idea. Soon, Missy finds herself in impoverished India, signing away her inheritance and betting on a risky plan while rekindling a lost love.\"Sounds great, doesn't it? Too bad that's only an accurate description of the plot in the very vaguest of terms. Sure, she goes to Italy and makes a friend . . . who doesn't really propose any idea. And sure, she goes to India . . . where she \"signs away\" a fraction of her inheritance, and a pretty small fraction at that, on a plan that is presented as exceedingly complicated but not particularly risky and rekindles a lost love in the sense that she facebook stalks an old boyfriend. Oh, and then she goes back home a does some sort of stock market money managing magic or whatever ensuring that she doesn't actually spend a dime of her inheritance..If that doesn't tell you enough about what a disaster this book is . . . well, I've been wanting to write a rant-y review for going on three weeks. (another hint that a book is bad: when circumstances cause you to put it down for over a week and you're still dreading having to pick it back up when your schedule clears)The set up for the actual plot takes literally the first two-thirds of the book. Which would not be terrible if it didn't read like it was plot-setting-up-filler. And of course it goes without saying that when you finally get to the (sort of) interesting part it's rushed . . . and then it's over. Nothing is tied up, and while I don't mind open endings, this one doesn't end. It just stops.Missy, our main character, is a mess - and not in the way she was clearly meant to be. Nothing but a bag of contradictions because she had to be too many things. She has this decades long fantasy of traveling to Italy and taking a cooking tour of Tuscany, but she completely drops it after one chance encounter on an unplanned overnight layover in Sicily. Her expensive, month long vacation? Abandoned after, like, three days. Because . . . reasons? She's so afraid of flying that years before she tried to go and had to be escorted off the plane before it took off because she was having an epic meltdown, and all I could think of was why didn't she take a trans-Atlantic cruise if she wanted to go so badly but couldn't bring her self to fly? It's well established that she would be all over that, but apparently it never occurs to her. Mostly because the plot needs her to become a jet setter after just one successful trip. seriously, she boards the first plane so freaked out that she has to board the plane high on some prescription sedative that's the equivalent of, like, three dozen valium, and she's still only a few breathing exercises away from a panic attack, but we're supposed to believe that eight months later she's all about flying back and forth and popping over to Paris on the way back just because. Because the plot has her going back and forth between India and Virginia. So 200 pages of \"I CANOT NOT NOT NOT NOT GET ON A PLANE\" gets hand-waved away into \"I just took a few deep breaths and focused and oh look, yay, India!\" which . . . just . . . no. Does not work.Speaking of India . . . holy White Savior-ism, Batman! I'm sure both character and author meant well but the whole \"I've seen the light and I'm going to change the world because these poor backwards people just don't understand how important my new cause is so I will teach them and fix them\" thing just reeks. The actual plot is all about opening a school for girls in India, but the Indian characters are all minor, under-developed, and homogenized. I was decidedly not impressed.Also, Missy has a \"boyfriend\" who she feels absolutely nothing for, has to grin and bear every single date they go on (and only gets through them by downing a bottle of wine on every single one) and does everything he can to discourage her interests. He proposes to her by showing her a hypothetical joint tax return and saying it made more financial sense to get married than to stay single. Then he tells her she's wasting her life by taking care of her father who's had a stroke, has Alzheimer's, and is rapidly failing. Instead of kicking him to the curb and then some like any decent human being would do after comments like that, Missy says \"he's right, marriage would be financially beneficial, so even though I've admitted several times that I can barely stand being in the same room as this guy, let's save some money!\" And this is the character we're supposed to identify with and root for. She disgusted me from start to finish.(side note: the first time Missy and boyfriend have sex, while the scene is done in a \"fade to black\" style, it is clearly not consensual. She makes it clear she's not interested in that moment although possibly up to it after a little foreplay (or at least some showing of some sort of emotion from boyfriend) but he says he doesn't want to wait anymore and yanks her pants off . . . *cue fade to black* . . . also, ew. And again, she doesn't dump his sorry self right then and there. I kind of hate her for being such an idiot.tl;dr: girl dreams of going to Italy for twenty years. Highly medicates herself to get there. As soon as she gets there she leaves and never mentions her (literal) life-long dream again and is magically cured of her extreme phobia because India is a Magical Place for White Saviors. She White Saves her little corner of the Indian World and everyone lives happily ever after. Except for me, who is left wondering why I wasted good reading time on this."}, {"userName": "Barbara Weiss", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/40463331-barbara-weiss", "userReview": "A powerful, lyrical bookI loved this book. I was initially a bit frustrated with Missy, the main character, but as she grew as a person, I just fell in love with her honesty and her wanting to be more while still being true to herself. The book was very well written and the descriptions of the foods and of India were wonderful. The story is contemporary and deals with our wounded warriors and their struggles with their PTSD and physical issues. It also discusses poverty and abuse of children and women and the abuse of bullying in schools. This book makes one want to do good in the world. Simply a fabulous book."}, {"userName": "Dawn Combs", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/50068604-dawn-combs", "userReview": "Tender and vibrant story of life, love and lossI see so much of Missy in myself. Well...except for the financial genius part! Odd girl out growing up, being bullied, feeling \"less than\" all her life and having a parent rub your nose in it in their own well meaning way. I love that she finds her path in life and gets it all. Gives me hope and reminds me its never too late to reach for the stars."}, {"userName": "Sally", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/2142895-sally", "userReview": "WOW!This was quite a book. It started out in a fairly predictable fashion, and then built layer by layer to point where I could not put it down; I had to find out what happened next. It has been a long time since I have been so emotionally involved in a book as this. Try not to cry, like I did."}, {"userName": "Suzy", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/12978721-suzy", "userReview": "Meh..I do have to say I finished it, and I enjoyed her writing (that title--right?) I am miffed I guess. I loved her father so much and his love for his daughter was all encompassing I thought and I felt sad as I felt when he became so sick, I felt still sadder that she found her dad to be something less than her hero at the end."}, {"userName": "James Shelby", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/66486273-james-shelby", "userReview": "WowWhat an inspiring work to all of the Missies and Kate's of the world. I think there is to varying degrees aspects of their struggles in all of us. And life does leave its pile of chips."}, {"userName": "Loran", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/1563892-loran", "userReview": "I enjoyed this book as a light, quick read. Parts of the beginning to middle lag but then things pick up quite a bit towards the end. I grew up in Alexandria so I appreciated the setting and I could easily imagine the financial office."}, {"userName": "Anitasaffran", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/31516975-anitasaffran", "userReview": "Unpredictable butsatisfyingThere are many aspects to this story: places, ages, roles in life, time periods, and all contribute to the richness of experience. Not predictable but satisfying and worth the time and thought."}, {"userName": "lynda", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/37167120-lynda", "userReview": "I really enjoyed this book. I wouldn't consider it heavy reading, but there is a very worthwhile point to the story. Kind of a late coming-of-age story. I'll be tracking down whatever else Ms. Handford has written."}], "description": "Book-smart Melissa Fletcher lives a predictable life in her hometown, working behind the scenes for her charismatic father in a financial career that makes perfect sense. But when her dad is diagnosed with Alzheimer’s, Missy is forced to step up and take over as his primary caregiver and the principal of the firm.After her father’s death, Missy finds a letter from him in which he praises her for being a dutiful daughter but admonishes her for not taking any risks in life.Devastated, Missy packs her suitcase and heads for Italy. There she meets a new friend who proposes a radical idea. Soon, Missy finds herself in impoverished India, signing away her inheritance and betting on a risky plan while rekindling a lost love.The Light of Hidden Flowers is a deeply felt story of accepting who we are while pushing our boundaries to see how much more we can become. It’s a reminder that it’s never too late to pursue our dreams.", "title": "The Light of Hidden Flowers", "url": "http://www.goodreads.com/book/show/25828751-the-light-of-hidden-flowers", "average": 3.99, "cover": "https://images.gr-assets.com/books/1436909805l/25828751.jpg", "reviews": 128, "authors": [{"url": "https://www.goodreads.com/author/show/5752680.Jennifer_Handford", "name": "Jennifer Handford"}], "type": ["Fiction", "Contemporary", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/25828751-the-light-of-hidden-flowers", "http://www.goodreads.com/book/show/25514718-the-light-of-hidden-flowers", "http://www.goodreads.com/book/show/13483959-daughters-for-a-time", "http://www.goodreads.com/book/show/21169287-acts-of-contrition", "http://www.goodreads.com/book/show/22090593-fortune-cookies---excerpt-from-2010-amazon-breakthrough-novel-award-entr", "http://www.goodreads.com/book/show/28176734-t-chter-auf-zeit-german-edition-kindle-edition", "http://www.goodreads.com/book/show/28113825-akt-der-reue-german-edition-kindle-edition", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}