{"ratings": 4863, "userreviews": [{"userName": "Bill  Kerwin", "userReviewDate": "Dec 08, 2007", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "This cult classic--a bigger hit in Poland than in the author's native USA--is a strange novel, and a very interesting one. At the beginning, it seems to be a piece of realistic fiction, narrating the efforts of a high school English instructor in his 30's and his researcher girlfriend to write the biography of a deceased children's book author they idolize. But when they get to the author's hometown, things get weirder and weirder--and the book itself gets stranger and stranger. Unlike many books that develop this way, however, the ending does not disappoint. This is a good novel, well worth your time."}, {"userName": "Jeffrey Keeten", "userReviewDate": "Mar 25, 2011", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”The Land of Laughs was lit by eyes that saw the lights that no one’s seen.”\nJonathan CarrollThomas Abbey is a prep school English teacher who is weighed down with loneliness, boredom, and a lackluster attitude about the direction of his own life. He has three passions: one, he likes to collect unusual masks from around the world; two, he loves the books of Marshall France; three, he hates (loves) his famous father. He has been defined his whole life as the son of….Things begin to change for him during a chance encounter in a bookstore. Bookstores, in my experience, are sometimes the best settings for life changing moments. Thomas finds a first edition book by France he has never seen before, only to be told by the bookseller that the book has already been sold. A piece of his collector’s soul goes up in flames. He decides to wait to meet the person who has bought the book to offer her more than she paid for it. His father has left him with means, the bastard, and so the price of the book is irrelevant in regards to the pleasure he will achieve in owning it. This is how he meets Saxony. He has masks on his walls. She has puppets. He loves Marshall France and so does she. As it turns out, she will provide the spark that will set him on a new course. No one has ever successfully written a biography of Marshall France. Saxony is good at research, and Thomas is a pretty decent writer; maybe between the two of them they can bring Marshall France back to life.Back to life? Interesting choice of words there, Mr. Keeten. Thomas takes a semester off, and he and Saxony decide to make the pilgrimage to Galen, Missouri, which is where France had lived until his sudden death at the age of 44. I don’t know if Jonathan Carroll picked 44 on purpose or not, but that number resonates with me because it was the age of two of my favorite writers when they died: F. Scott Fitzgerald and Robert Louis Stevenson. In fact, one might say I’m a little leary of the number 44. There is one hurdle that must be leaped for Thomas to have a chance at writing this book about his favorite writer. France’s daughter, Anna, has the keys that unlock all the doors with the treasure troves of information to make the book a definitive biography. Anna has that “Lauren Bacall-deep ‘if-you-need-anything-just-whistle’ voice” which gives Thomas an ”eleven-foot-long erection.”Maybe a slight exaggeration, but you get the idea. He has been knocking boots with Saxony, so this is a new wrinkle that could potentially blow the whole project sky high. To the discerning collector, having sex with your favorite writer’s daughter is the ultimate in obtainable collectible items. All that I have discussed is the set up for the main plot, which leads up to the twisty, eyebrow raising, mouth dropping conclusion. Things really start to get wiggy when Thomas hears the Bull Terrier, named Nails, talking in his sleep. I didn’t say barking. I said talking.What the hell is going on? I mean...what the hell? Soon Thomas is wrestling with the concept of whether his idol was...God or Frankenstein?\nThe thing I’ve always enjoyed about Jonathan Carroll is how his plots always start out so normal, and he just keeps adding elements. Some of them are a bit odd, but still within the scope of the lives we all lead. He sucks us in, makes us invested in the characters, and then he starts leading the reader into more and more unfamiliar territory, but still at a pace that the reader has to keep going to find out where Carroll is taking them. Then he hits you with the great reveal that is a bit wicked, a bit deviant, and always brimming with originality. I recently read Pat Conroy’s book “My Reading Life”, and he devotes the final pages of that book discussing how much he enjoys Carroll’s work. Conroy inspired me to reread Carroll’s books for the pure joy of having a chance to revisit his writing, but also a chance to review these books that have given me so much pleasure over the years. If you haven’t had the chance to read Jonathan Carroll, I can’t recommend him highly enough. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "karen", "userReviewDate": "Dec 16, 2009", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "jonathan carroll's books are like gourmet jellybeans. even his shittiest flavors are better than most regular jellybeans, and who doesn't like jellybeans? (alfonso claims that only white people eat jellybeans, which is untrue, but it's such an odd racial stereotype i feel compelled to add it here).you know how there is some music that no matter what mood you are in, it just happens to be the right music?? jonathan carroll is like that for me. he's just...wonderful, like a new crush you can't stop gushing over. he's definitely a high fabulist, but in the best sense of the term. let's compare: better than graham joyce, more charming than millhauser, slightly less ambitious than robertson davies,but always always entertaining. i would name-drop alasdair gray, but so few people have read him, it's not even worth it. stop reading this review and go read lanark, already...jonathan carroll can be summed up in two words: death and dogs.not your gritty noir alsatians snarling over an abandoned corpse, but generally affable dogs involved in some way in a character's meditations or experiences with death and what comes next: bull terriers who are either sentient or symbolic, but are carroll's literary stamp as recognizable as any of lynch's recurring visual details/tics. carroll has a few major themes; mostly ideas of life and death and karma and the afterlife and man's responsibilities to man and woman and ghosts and film. they are philosophical/moral/spiritual journey stories but in a playful, not didactic way. \"spiritual journey\" should in no way conjure up images of coelho, redfield, or martel. take those thoughts to go, please.land of laughs is a really good introduction to jonathan carroll. the ending? shrug, not the best, in my opinion. but it honestly does not matter, because it's such an incredible story throughout. his endings are pretty consistently weak, but it almost becomes an adorable quirk, like when kids can't say \"spaghetti\" or something that people think it is cute when kids do. at the end of the day, he is just a good storyteller, and like the opening credits for \"amazing stories\", isn't that the foundation our \"littry appreciation\" should be built upon?"}, {"userName": "karen", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "real review of book here: https://www.goodreads.com/review/show...review of this spectacular edition:ohhhhhh A CHRISTMAS MIRACLE!!\nafter missing out on buying this very limited print run edition of The Land of Laughs because i couldn't justify, at this financial point in my life, spending $85 on a book i've read many times and already own many many different editions of in different languages or with different covers, i had the mopes, but then LO! connor got me a copy for early christmas! and it's signed by carroll and the three illustrators and numbered (111 is a wonderful number):\nit is beautiful! and HUGE!look how much bigger it is than a dime!\nor fizzgig\nor even oogie boogie\nand it's illustrated all over the place. here is the back cover\nand the dust jacket flaps\n\nand then there are full color illustrations at the beginning:\n\nand tons of internal illustrations throughout:\n\nkids, go to bed!\nI LOVE IT I LOVE IT I LOVE IT!maggie loves it, too!\n\nand maybe, just maybe, it cures cat cancer.we will wait and see how big of a christmas miracle this book is.but i have high hopes.THANK YOU SO MUCH, CONNOR!!!"}, {"userName": "Margitte", "userReviewDate": "Dec 18, 2017", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "I had no clue what to expect of this novel, and cannot even remember where I encountered it already many months ago. FROM THE BLURB\nHave you ever loved a magical book above all others? Have you ever wished the magic were real? Welcome to The Land of Laughs. A novel about how terrifying that would be.Schoolteacher Thomas Abbey, unsure son of a film star, doesn't know who he is or what he wants--in life, in love, or in his relationship with the strange and intense Saxony Gardner. What he knows is that in his whole life nothing has touched him so deeply as the novels of Marshall France, a reclusive author of fabulous children's tales who died at forty-four.Now Thomas and Saxony have come to France's hometown, the dreamy Midwestern town of Galen, Missouri, to write France's biography. Warned in advance that France's family may oppose them, they're surprised to find France's daughter warmly welcoming instead. But slowly they begin to see that something fantastic and horrible is happening. The magic of Marshall France has extended far beyond the printed page...leaving them with a terrifying task to undertake.\nIf I have read the blurb or reviews, I would probably have skipped it, since I am not overly keen on magical realism. Some people define this novel as modern fantasy, but while reading it I kept on thinking about Gabrial Garcia Marquez. An then I thought about Neil Gaiman's works. Sela, in the end this author, who developed his own cult in the end, was indeed hailed by Neil Gaiman as one of 100 best magical realism authors in the world. The book was first released in 1982, but became so popular that it was released again in 2010.With that said, the story fitted perfectly into the surrealistic world of magic meeting reality in Galen, Missouri.The story is written in the cultural language of the early Eighties, with all the elements of the times present, such as women as sidekicks for mostly salacious purposes, and the music of the times forming the background noise of the plot ( I actually enjoyed that). Small town America functions perfectly in the scheme of things with little indication of what was to be expected in what seemed to be a perfectly normal smalltown life.As the story progresses, things change and weirdness creeps into the lives of all the inhabitants. Nobody has any other dogs but bull terriers in town. Everyone seemed to be weirdly happy even in the most inexplicable moments. The magical realism allowed for the gobsmacking, surreal ending. I don't want to say much about the plot, since it will spoil the surprise for someone who might want to read this book. I found this book strangely mesmerizing. Although it was a bit too creepy for my taste, I still kept on reading until the very end. Gripping, mysterious, compelling, and totally out of my comfort zone. Still I felt connected and invested in this magical experience. From the beginning there were ants running down my spine, and they relentlessly increased in numbers till the last sentence in this very well written book.It's not for everyone, but I do believe it will be a thrill for the right reader. I won't become one of the groupies, but certainly appreciated the rattling of my comfortable reading cage. It was the perfect choice for this purpose :-)) Just over 240 pages it was a perfect read."}, {"userName": "Maciek", "userReviewDate": "Apr 05, 2013", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "Jonathan Carroll is a writer whose name I have been hearing over the years, but whose fiction I've never tried. An American living in Vienna for many years, he has developed a quiet but steadfast cult following - much like the city itself, with its with its unlimited supply of quiet coffee houses - the famous Viennese cafés, described by UNESCO as places \"where time and space are consumed, but only the coffee is found on the bill\". Legend has it that soldiers from the Polish-Habsburg army found sacks full of strange beans while liberating Vienna from the Turks in the 1600's. They initially wanted to burn them as they thought that they were camel food, but Polish king Jan III Sobieski gave them to one of his officers, who recognized what they were and soon started the first coffee house. Many Viennese cafés hang the picture of the officer - whose name was Jan Franciszek Kulczycki - in their windows.The Land of Laughs is Carroll's debut novel, published in 1980. It's both a fan favorite and a cult classic, having been reprinted by Orion Books in 2000 as the ninth volume of their Fantasy Masterworks series. The Orion edition brough it back to print, as it has fallen out of it for a number of years, and became a reason for despair for many Carroll fans who couldn't get their hands on their favorite author's debut, which grew in value and expectations. Of course now the age of digital publishing has largely eliminated such problems, as the Kindle immortalized hundreds of thousands of volumes which would otherwise share the same fate - which is both a blessing and a curse: the blessing being an eternal digital life of novels, with readers not fearing that their favorites will go out of print and that they will be unable to read them, as there is no print to speak of - but also a curse, resulting decreasing sales of paper books made of trees in favor of their Kindle counterparts made of ones and zeroes. I fear for independent mom-and-pop book stores going out of business, places where you could walk in and browse the books and talk with the owners about them. I would very much miss such places, as I would miss the paper book - with its smell and feel and history. Most of my books come from second hand, and I always wonder about the previous readers and owners. Where did they get it? How did they like it? What was the book's journey before it reached my part of the world? Sometimes readers would inscribe short notes on the book, a dedication to someone they gave it to - and I wonder, what made that person to give it away?I hope that you'll excuse this longish introduction, which I felt was appropriate for Carroll's novel, which also deals with books. It's narrated in the first person by Thomas Abbey, a man famous for being the son of his father - a famous actor. Thomas is a man stuck in a limbo - he teaches English in a prep school in Connecticut and feels that his life is as interesting as watching grass grow. Desperate for a change, Thomas decides to do something which is interesting to him - write a biography of his favorite writer, the late Marshall France. France wrote children's books which Thomas loved when growing up, and remained very much interested in. Although France was renowned for his imaginative and unique work, almost nothing is known about his personal life. Motivated by curiosity about France's life and staleness of his own, Thomas sets out on an ambitious project which will take him to the small midwestern town of Galen, Missouri, where France was born and lived. He will be accompanied by Saxony Gardner, a fellow France-fanatic whom he met by chance in a bookstore while shopping for a rare book by his idol. With their combined efforts they hope to convinve France's surviving daughter, Anna, into letting them her write father's biography. To their surprise, Anna welcomes them warmly and find her excited about their proposal - even eager to have the biography written as soon as possible. But it won't be long before Thomas and Saxony will discover that in Galen not everything is what it seems.Carrol doesn't hesitate to use all the tropes: a troubled male protagonist and a female sidekick, a mysterious woman and a town with its own secrets, and the last but not least - books full of wonder. Who could resist such a mix? Beginning The Land of Laughs feels like sitting down to relax in an old and comfortable armchair - a personal favorite, creaky and wobbly but still very relaxing. But in Carroll's case the armchair is filled with holes, and its arm rests dangle dangerously, threatening to fall apart at any moment.Published in 1980, the book is charmingly dated with having no contemporary technology which we grew so used to - forget about cell phones, personal computers, iPads and Facebook. To do his research Thomas has to go to a library, and actually browse through huge volumes. But the sheer fact that he was so obsessed with a writer's work and never in all these years developed any interest in learning anything about his life seems wildly implausible - even if he had no Google. (imagine if he had a Kindle - so many problems solved! But then you can't hit anybody on the head with a Kindle. Well, you can, but the thing is so light and thin that it'd break in two and would feel like a mosquito bite, so what would be the point?). I did not find any of the characters likable, and found Thomas to be unsympathetic, ungrateful and boring. None of the characters was paricularly interesting and all of them were very undeveloped - especially both women. Anna is presented as little more than a mysterious minx, and Saxony never rises above the label of the devoted nerd. There's a ton of sex scenes in this book which it really could have done without, which made it seem as if they were the only reason for inclusion of two female characters. This smelled strongly for sexism, even for an 80's fantasy novel. Perhaps the biggest flaw is that along with technical aspects the plot itself has dated - after so many versions of a similar story done in film, television and literature I did not find any of the developments particularly surprising, and the sudden and unsatisfying end left me feeling let down.The Land of Laughs was praised by Neil Gaiman, who also chose it as his selection for Audible. Pat Conroy has described Jonathan Carroll as a \"cult waiting to happen\", and it has happened indeed - but I would never have guessed it from this rather weak and predictable debut. I do not understand why Orion books chose it as a representation of a Fantasy Masterwork, and why it's considered a cult classic - it reads more like a clunky creative writing assignment commisioned to a young writer, fresh out of college. The plot is largely predictable, the characters and their relationships shallow, and the sudden resolution lets any tiny amount of suspense swoosh away quickly like air from a punctured balloon. Perhaps his later novels are better - I sure hope so - but only in the eighties could anyone begin a longlasting career with an effort like this."}, {"userName": "seak", "userReviewDate": "Mar 07, 2011", "userURL": "http://www.goodreads.com/user/show/1805180-seak", "userReview": "Thomas Abbey has always loved the books by Marshall France, you may even say he's obsessed with them. He has a copy of just about every book written by the famed (and fictional) author and has an inheritance from his famous father that allows him to pay big bucks for even the rarest publications.Abbey, who is also a school English teacher, decides he wants to write a biography of his favorite author even though he's never written anything in his life. He manages to run into a fellow France-obsessed fan in his endeavors and they proceed to visit the mysterious town where France did the majority of his writing and where he escaped the limelight.The Land of Laughs is really a book for book lovers. I'm sure if you've found yourself here on Goodreads, you may have been borderline obsessive about an author or two in your life and even currently, so this book is extremely easy to relate to in that respect. If this doesn't make perfect sense to you, I don't know what will:“Reading a book, for me at least, is like traveling in someone else's world. If it's a good book, then you feel comfortable and yet anxious to see what's going to happen to you there, what'll be around the next corner. But if it's a lousy book, then it's like going through Secaucus, New Jersey -- it smells and you wish you weren't there, but since you've started the trip, you roll up the windows and breathe through your mouth until you're done.” Then again, I've gotten over my need to read through everything I start. Life's way too short for that.The Land of Laughs is considered a fantasy, but most of the book has almost nothing fantastical about it. It could also very easily be described as a horror, at least just as much as it can be considered fantasy because there were some truly spine-tingling scenes toward the end that are worth the read alone.What impressed me almost immediately is that this is Carroll's debut novel and he's writing about a fictional author who's legendary in this novel he's created. Naturally, you have to prove at least to some degree why this person is such a beloved author. I guess you don't have to necessarily, but it would be much harder to make it believable. And yet, some of the lines from this fictional author are beautiful and therefore completely believable in all respects.Similar to Kurt Vonnegut's Breakfast of Champions, The Land of Laughs is a book of many other books. Many of the famous books that are fictionally written by Marshall France are explained and even plotted even though never written in real life. Carroll even gives us lines from the books which are splendid and as I said above, purvey the beauty of France's writing.The eponymous book is actually France's most famous book:\"The eyes that light The Land of Laughs was lit by eyes that saw the light's that no one's seen.\"There were a few lines like this that just made me smile and enchanted me to no end. I wish I could find more of them right now because they're excellent and really do provide a magical quality to the story and writing both. In addition, the rest of The Land of Laughs is written in a clever way that resonated really well with me. The first person narrative of Thomas Abbey is clever, but in a self-depricating way. In a book where I should have been bored by the slow start, I was enamored from the beginning.This story has that magical aspect to it that makes reading an experience. Neil Gaiman doest this to me as well with the same sort of wit and charm. Add to that the twist at the end and this is one of those books that's impossible to forget.4 out of 5 Stars (Highly Recommended)"}, {"userName": "Karl", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/1935255-karl", "userReview": "This is copy 40 of 300 copies signed by:Jonathan CarrollRyder CarrollMichelle LopesDavid Mattingly"}, {"userName": "Stuart", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/9456990-stuart", "userReview": "The Land of Laughs: Weird things are afoot in small-town MissouriOriginally posted at Fantasy LiteratureThe Land of Laughs was written back in 1980 and I wonder how many readers know about it now. It’s written by Jonathan Carroll, who has written a number of offbeat modern fantasies, and I only know about it because it was selected by David Pringle for his Modern Fantasy: The 100 Best Novels. Even that is probably not enough to put it on most radars, but Neil Gaiman also chose it for his “Neil Gaiman Presents” series of audiobooks, so I listened to it during a series of long walks along Tokyo Bay in Rinkai Park. It’s narrated by Edoardo Ballerini, who does a nice job of capturing the strange events of the story.The Land of Laughs is the story of Thomas Abbey, son of famous film actor Stephen Abbey. He teaches English at a small Connecticut prep school for rich kids, and tries to avoid the huge shadow that his famous father casts over him. Dissatisfied with teaching The Scarlet Letter to bored teens, he decides to take a sabbatical to pursue his greatest passion — writing a biography of his all-time favorite writer, Marshall France, a renowned creator of quirky children’s fantasies in the mold of Lewis Carroll. France was a secretive man who lived much of his life in the small town of Galen, Missouri, and when Thomas runs into another obsessed female fan of Marshall France named Saxony Gardner, they strike up a relationship and decide to take an extended road-trip to Galen to research a biography of their beloved author.When they arrive in small-town Galen, they are unsure how the townspeople will react, and even less so the famous author’s daughter Anna, a mysterious woman who they have been warned will be hostile but turns out to be extremely welcoming and offers to help with their research. They meet many of the townspeople, attempting to gather as much material as possible about the life and influences of Marshall France. But the longer they stay, the more they notice a number of strange and disturbing incidents in the supposedly idyllic small town, which seems to have an overabundance of bull terriers…The Land of Laughs may sound like a familiar set-up, with dark undercurrents lurking beneath the surface of a quiet Midwestern town, but this is as much about the obsessions of Thomas and Saxony and the intensity with which they idolize their favorite childhood author. As we learn about their pasts, we come to understand why they have been so strongly drawn to the quirky fantasy worlds of Marshall France. All lovers of fantasy worlds are likely to recognize that sentiment, even if not to this degree. And as the emotional lives of Thomas, Saxony, and Anna get tangled with the life of Marshall France, things get deliciously twisted.The revelations of the power of Marshall France’s imaginary worlds and how they have influenced the town of Galen are eye-opening. And though there are moments of discomfort, this story is far more humorous than horrifying, at least until the final chapters (which felt a bit rushed, and less than fully satisfying). The Land of Laughs could have been played as an Amityville-style horror story, but really it’s more about obsessions and how they shape our lives, as well as the overwhelming influence that parents can have on their children. It also is a tribute to the godlike powers of the author to create and shape worlds to his/her liking, but a warning of the responsibilities that come with that. It is a very entertaining and thought-provoking tale, and not like anything else I’ve read before."}, {"userName": "Caro M.", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/7951847-caro-m", "userReview": "I've read this book twice. Both times I was satisfied and amazed. And I am going to do it again."}, {"userName": "Brent Legault", "userReviewDate": "Jan 17, 2009", "userURL": "http://www.goodreads.com/user/show/395634-brent-legault", "userReview": "Here's what I think: it has a lot of \"Boy, howdy!\" dialogue. Sometimes the narration reads like an eager family newsletter and is infested with as many tired phrases. The plot and its \"twists\" are no more interesting or serpentine than an episode of The Twilight Zone or a Stephen King short story. Someone (An editor, perhaps. Did this book have an editor?) should have suggested that Carroll look up \"elegant variation\" in Fowler's. Much or most of his sentences are just careless, thoughtless, rushed. I often had to check the spine of the book to make sure I wasn't reading something that had been published by a vanity press. Many scenes are simply overwrought, almost all of them are overwritten. The main character talks often about rewriting but I don't get the impression that Carroll thinks much about it. I don't know how I read this book to its awful, awful end."}, {"userName": "J.K. Grice", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/72137025-j-k-grice", "userReview": "This book was my introduction to the incredible writing of Jonathan Carroll. He writes these modern fantasies that are sometimes dark and usually humorous. I can't think of another author that I know of that writes like Carroll. The problem is, he usually runs hot or cold for me; I either love the book or I can't even finish it. Again, this is an enigma that I share with no other author. At any rate, THE LAND OF LAUGHS definitely hit a home run for me. Wonderful, funny characters and imaginative situations. Highly recommended."}, {"userName": "Julia", "userReviewDate": "Dec 19, 2008", "userURL": "http://www.goodreads.com/user/show/1777325-julia", "userReview": "I'll end up with a slew of Carroll novels--this one came out in America in 1980, so is one of the early ones. Check out Carroll's website www.jonathancarroll.com . Neil Gaiman, who admires Carroll greatly, wrote an introduction for the website which says: \"Jonathan Carroll's a changer. He's one of the special ones, one of the few. He paints the world he sees. He opens a window you did not know was there and invites you to look through it. He gives you his eyes to see with, and he gives you the world all fresh and honest and new. In a bookstore universe of bland and homogenised writers and fictions, the world that words from Carroll's fountain pen is as cool, as fine and as magical as a new lover, or cool water in the desert. Things matter. You can fall in love with his women, or his men, worry when they hurt, hate them when they betray or fall short, rejoice when they steal a moment of magic and of life from the face of death and eventual nothingness.\"LAND OF LAUGHS deals with the idea that a writer can bring people back to life, which is a sentence that Carroll fleshes out in his amazing, quirky, fantastical magical realism style. He lives in Vienna, where many of his novels are set. I'd start with LAND OF LAUGHS--and see if you're ready for his dark magic."}, {"userName": "Phil Williams", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/529836-phil-williams", "userReview": "(Review originally posted on my author website, Write Right Now)Jonathan Carroll has developed an almost cult status as a slipstream author, and it was with his contemporary fantasy reputation in mind that I picked up a copy of The Land of Laughs, part of the Fantasy Masterworks collection. It had incredibly high praise from a number of reputable critics and authors, including Neil Gaiman, and comes with claims that if you’re new to Jonathan Carroll then his debut is a great place to start. Such build up can go two ways with a book; it can give it an advantage making you love it before you’ve even begun, or it can set you up for great disappointment.In this case, it was not what I had hoped for in one major way. For a fantasy masterwork with such strong endorsements, it was remarkably light on fantasy. In fact until the final third (if that) you’d be forgiven for thinking it was a relationship drama. Except it was remarkably light on drama, too.In short, this is the story of a rather uninspiring teacher, Thomas Abbey, who sets out to write a biography of his favourite writer, Marshell France. His journey to the town France lived in reveals a series of inconsistencies that suggests more is going on than anyone’s admitting. The problem is there isn’t that much more going on – much as it heads to a rather crazy reveal it is, despite its extremity, rather predictable and doesn’t generate much in the way of tension or excitement. It’s scarcely a spoiler to say, for example, that the sinister overtones of details such as whether or not France changed his name amounts to precious little nothingness.In fact for a good 200 or so pages of the 240 page book what you’re actually treated to is the meandering tale of a man trying to navigate the standard challenges of biography writing against the background of meeting an adoring geeky girlfriend and the seductive daughter of his idol. Given the rather unlikeable nature of the protagonist, whose greatest challenge in life is having a famous father, it’s the handling of these two female characters that is to make or break the plodding story.And the handling of the adoring girlfriend, in particular, is a misogynistic mess.To say the book feels dated is an understatement; its almost glacial pace is one thing, its attitude to the girlfriend, portrayed as a perfectly selfless and undeserving victim, should have been laid to rest centuries ago. The protagonist’s male entitlement is bold and unashamed, though, to the degree that his cheating is not only accepted without much in the way of judgement it’s also forgiven without any kind of atonement. I was waiting for terrible things to happen to Abbey, whose arch appeared only to become increasingly irritating and self-important. Sadly, he never changed, and was scarcely even threatened.Carroll is known for combining various genres, and I was in hope of feeling a sense of dread or horror – even just conflict – that I persevered. The only feeling I got from The Land of Laughs, though, was shock at the handling of the protagonist’s philandering. Which was presented dismissively (despite a few vacuous comments that he felt pretty bad about it, but kept doing it) and was ultimately inconsequential.It’s a shame, as in all I could sense the building blocks of the greatness others see in Carroll here – it’s testament to his writing ability that I managed to finish the book despite any particular interest in the plot or characters. And the ideas in there hinted at his ability to create interesting new worlds. It just all felt too lacklustre, too lacking in pace and drama and, most unforgivingly, too accepting of its main characters flaws."}, {"userName": "Katerina", "userReviewDate": "Sep 27, 2014", "userURL": "http://www.goodreads.com/user/show/16054419-katerina", "userReview": "This book most definitely would have deserved 5 shining stars had it not been for the weakest love line ever (and the author should have revealed a bit more about the female bookish-nerdish sidekick, I got a feeling as if she's got a lot to hide).(and I wish the main character hadn't been such a self-important jerk sometimes!)Apart from it, it's almost perfect. What I liked the most was the ending, which was beautiful and scary and cool. I liked the whole 80's gadgetless atmosphere, when people actually had to go to libraries to do research and shuffle through all yellow pages of newspapers, when they couldn't just call each other from the middle of nowhere crying for help, and had to stay at home for a week to take a long-awaited phone call. Hey, when they actually visited and talked to people. This is so, so old-fashioned and at the same time familiar it makes me want to shed the tears of joy:)Surely enough, the central idea of getting lost in a magic world created by a book is not less familiar, and the point of finding out everything about the guy who created the world is as well deeply felt by me. Thank you, Mr Carroll, for me being 14 again. In a nutshell, this book is really cosy and it would be a blessing to the adults who, like Thomas, spent their childhood wrapped in an old blanket, hugging a book and hiding a flashlight from preoccupied mothers. Hey mom, I'm just gonna finish this chapter real quick!"}, {"userName": "Teri Nolan", "userReviewDate": "Feb 24, 2012", "userURL": "http://www.goodreads.com/user/show/3211751-teri-nolan", "userReview": "I nearly gave this novel fives stars - it was so close! The omission of that fifth star was purely based on dialogue. The story was five star, the narrative was five star, but sometimes (not all of the time) the dialogue did not flow naturally, like real conversation. It's a cleverly written book, very enjoyable and holds your attention in that delectable way the best stories do. Land of Laughs was written in 1980 and published in 1982, which was really fun because reading the story reminded me what it was like to live before the technology explosion of the 1990's. It was like a time-travel back to those yesteryears that I sometimes miss. Miss a lot! But, I wouldn't part with my iPhone, no. I'm not one to outline plots in my reviews as so many others have done that before me. Instead, I like to say things about the book that made me particularly happy or annoy me in some way. In Land of Laughs, the mystery Carroll sets up and gradually reveals made me very happy. The crafting of the female characters annoyed me just a tad. We have come a long way baby, as things that were acceptable in 1980 make me cringe now! I do, however, stand by my stars, and suggest you read this novel. It pulls you in and keeps you there and lingers after you are done."}, {"userName": "Saretta", "userReviewDate": "Aug 01, 2012", "userURL": "http://www.goodreads.com/user/show/3547950-saretta", "userReview": "Il paese della pazze risate non è affatto un paese ma un libro, per la precisione un libro per bambini scritto da Marshall France, scrittore osannato dal protagonista del romanzo.La ricerca di informazioni sullo France e il desiderio di diventarne il biografo porterà Thomas Abbey e Saxony Gardner a Galen, cittadina in cui lo scrittore è vissuto fino alla morte.Il romanzo è divertente e ironico, parla del rapporto con i genitori che non ci sono più e di quello con le divinità crudeli che guidano le loro creazioni umane. Detto questo ci sono un paio di considerazioni da fare: Thomas è il tipico esempio di uomo guidato dagli istinti e chiaramente privo del concetto di fedeltà (quindi mi ha fatto innervosire da matti) e di intuizione (che Anna sia una pessima persona il lettore lo capisce subito).Considerazione sull'edizione: la quarta di copertina Mondadori è una roba che più spoiler di così non si può, quelli che scrivono questi riassunti andrebbero bacchettati fortissimo sulle mani, così magari ci pensano due volte prima di svelarti il succo del romanzo."}, {"userName": "Robert Warren", "userReviewDate": "Aug 17, 2013", "userURL": "http://www.goodreads.com/user/show/5135508-robert-warren", "userReview": "A dear friend who knows me well pressed this book on me and said, \"Read it, you'll love it.\" She told me nothing about the Land of Laughs, and I'm glad. She loaned me her old paperback copy, which, unlike later editions, has no Neil Gaiman intro. I'm also glad about this, as I'm sure NG, who I love, divulges some plot points because he can't help himself.The passing of this book from hand to hand was one of those times when a friend's enthusiasm was all it took for me to give it a shot. While I didn't LOVE it, I found it really enjoyable and original, with some golden WTF moments that somehow, amazingly, work. All told, time well spent in Jonathan Carroll's head.As I said, I'm glad she didn't give me any details, and I'm doubly glad I didn't read any of the reviews on Goodreads (or anywhere else) before I settled in. In the ensuing review, I will endeavor not to spoil any of the surprises of Land of Laughs. And there are quite a few surprises. I was going to list a few hugely successful books that owe JC/LoL a debt, but even that would give you some clues and spoil some of the fun.One of the aspects that drew me in was Carroll's ability to create characters who are petty, obnoxious, and selfish, yet somehow magnetic. Narrator Thomas Abbey (great names all over this tale) is the son of a famous deceased actor Stephen Abbey. Thomas is an unfulfilled English teacher obsessed with children's book author Marshall France, who died unexpectedly at age 44, some years before. Thomas and fellow France devotee Saxony Gardner - damaged, shoot-from-the-hip, high maintenance and my favorite character - travel from NYC to France's hometown in the Midwest - Galen, Missouri - so Abbey can write France's biography and Saxony can edit it. France's editor has told them it's a fool's errand - France's daughter Anna is impossible - but of course they go anyway. Absolute madness eventually ensues. The book you finish is not the book you begin.For me, it was quite a \"meta\" experience, as the kids say. At times I was thinking, \"I am reading a book about the unparalleled pleasures of reading a book, inhabiting a world in which deeply flawed people discuss inhabiting a world invented by deeply flawed people.\" That sounds unappetizing, maybe a little heady, but, when combined with the sharp, economic details of the landscape, the Galen townspeople, and the gradually unfolding craziness, I was engaged, especially for the last 1/4 of the book. I just wish the craziness could've unfolded a little sooner. But still, a nice payoff.Sometimes I loathed Thomas Abbey and actually wanted something bad to happen to him, but when bad things did happen to him, I felt for him, which is a trick only a great writer can pull off. I never wanted anything bad to happen to Saxony.The Dead Dad Dilemma is the soul of Land of Laughs, and frankly, I've never read a story that handles it in such an original way. The two Dead Dads - Marshall France and Thomas Abbey's father, Stephen - haunt the book and, it turns out, drive the narrative, though you only gradually come to realize it.Another aspect that kept me glued is Carroll's ability to fuse dream reality with \"real\" reality. In fact, when you put down Land of Laughs, you'll experience that feeling of half-wakefulness, when a receding dream still seems real, for a few delicious, or horrifying, moments."}, {"userName": "Rita", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/4716160-rita", "userReview": "The Land of Laughs is a tricky book.I thought it was pretty close to perfect, until the last ten pages or so; I walked away from the ending dissatisfied -- distressed, even -- and am still trying to work out whether it was a failure on the level of expectation or of writing. Was I thrown because I assumed the narrative would follow traditional, comforting fantasy logic? Or did Jonathan Carroll just write a careless, pulpy, trainwrecky ending?The novel starts out full of nostalgia and metafiction. Two very odd people, Thomas (narrator) and Saxony (love interest; firey, tactless, vulnerable, stubborn, and adorable!) are drawn together by a mutual obsession with Marshall France, author of the whimsical children's books they fell in love with and never quite let go of. The plot unfolds quickly and engagingly. Thomas and Saxony become involved, and involved in a project to write France's biography. They end up in Galen, France's hometown, meeting his daughter and the people he used to live amongst. And then things get really fucking weird, shifting the emphasis to the \"magical\" half of \"magical realism.\"There's a lot of fun in the middle section of the book, and wonder, and exploration of the magical power of words. Without spoiling anything, I'll say -- the shiny surface of the town disintegrates. Think Disney on psychoactive drugs. Pay close attention to the cracks, Reader, and don't make the mistake of expecting a traditional happy ending, like I did; Carroll is much more subversive than that.There's no doubt that he's good. Carroll writes with a light, sweet touch which I really enjoy, especially after my recent binge on too much ponderous postmodern stuff. He carries the narrative with a concise mixture of smart dialogue and internal narration, and leaves the boring bits out, so scenes come through like little detailed pictures in sharp, bright colours. The book's actually written in first person -- but in a personable, colloquial sort of first person, which makes it feel as if the narrator's a good conversationalist who's chatting with you.I will read Jonathan Carroll again. I might even read this book again. But I'll probably skip the last ten pages."}, {"userName": "tim", "userReviewDate": "Jul 09, 2009", "userURL": "http://www.goodreads.com/user/show/230113-tim", "userReview": "Five stars here. Five stars there. I'm shameless. Maybe it's because I'm impressed by almost anyone that can write this well (including so many of you GRers!). It could also be that I'm on a recent streak of really awesome books. Or maybe I don't feel the star-rating system means much one way or the other except to reinforce some deep-seated reward expectation at receiveing gold stars for a job well done.Either way, this is my favorite Jonathan Carroll so far, by far. Subtle, sleight-of-hand tricks are at work from the very beginning in this unassuming gem of a book which builds into a very rewarding (gold star!) ending."}, {"userName": "Michael", "userReviewDate": "Jun 28, 2007", "userURL": "http://www.goodreads.com/user/show/155411-michael", "userReview": "The Land of Laughs is the subtle sort of slipstream novel where something just itches at your brain; you know things aren't on the level but it's impossible to place precisely what until quite a ways in. Carroll imbues his characters with quirks and humanity. The ending was not one that I would have ever guessed. A very pleasant surprise of a book that shouldn't have sat in my cupboard for as long as it did."}, {"userName": "Marion Hill", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/1946521-marion-hill", "userReview": "“Reading a book, for me at least, is like traveling in someone else’s world. If it’s a good book, then you feel comfortable and yet anxious to see what’s going to happen to you there, what’ll be around the next corner. But if it’s a lousy book, then it’s like going through Secaucus, New Jersey—it smells and you wish you weren’t there, but since you’ve started the trip, you roll up the windows and breathe through your mouth until you’re done.”I begin this review with that passage from an early part of The Land of Laughs by Jonathan Carroll. For the readers who have read my reviews over the past year and a half should know Jonathan Carroll has become one of my favorite novelists. This is the fourth Carroll novel I have reviewed in the same time frame and the first sentence in the aforementioned passage sums up how I feel each time I have read one of his novels.The Land of Laughs tells of Thomas Abbey, a teacher and son of a famous film star, who gets the chance to write the biography of his favorite children’s book author, Marshall France. Abbey is a zealous fan of the author and jumps at the opportunity to write a biography about him.Abbey travels to France’s hometown in Galen, Missouri, a small Midwestern town where the author is still the most famous person even years after his death. Everybody in town has a Marshall France story and want to help Abbey with his biography.So it seems.Abbey meets Marshall France’s daughter, Anna, who is highly protective of her father’s works and legacy and is unsure about the schoolteacher’s intent with the biography. Also, Thomas has a companion, Saxony Gardner, who travels with him to Galen and has her own role with the schoolteacher and biography.This volatile mix as well as Abbey dealing with issues surrounding his father come together in a fascinating and surrealist picture about the power of creativity and imagination. Can the imagination recreate life? Can a writer (or any creative person) become a God to the world they have created in their stories?Those questions kept coming to mind as I read The Land of Laughs. Carroll gives an interesting perspective in relation those questions and something to ponder on for a while. However, I will admit that the ending of the novel was a let down. The ending pulls the story together, but it felt abrupt and somewhat out-of-the blue for the story he was telling.The Land of Laughs is Jonathan Carroll’s most well-known novel and I can see why for a lot of reasons. I’m glad I read it and continues to add to my growing appreciation of this unique and interesting author. But, I will rank it below my favorite Carroll novel, The Wooden Sea, and White Apples."}, {"userName": "Kevin", "userReviewDate": "Jan 08, 2011", "userURL": "http://www.goodreads.com/user/show/4239462-kevin", "userReview": "Someone just handed this book to me the other day. I'd never heard of Carroll and never of this book, and yet here I am two days later writing my review because I couldn't put it down. Don't misunderstand, it's not the perfect example of pure literature, it has its flaws - and yet I was entranced and excited from page one. There was just something about the way he moves his details through the story that captured my attention in a way that I still can't describe.I felt very strongly about the protagonist much like I felt about Hugo Whitter from The Epicure's Lament in that the author was sometimes describing actions or ways of communicating that resonated deeply, and often not in a pleasant way.This is the part with the spoilers: the scene with Nails (you know which scene) affected me more strongly than anything in Pet Sematary, for sure. It was somewhat stereotypical in its approach with the lights off, the slow lead in to the room, and yet ... ugh. I want to shudder still. Even the knowledge of what was going on doesn't negate the intensity of that passage.And of course that's for me, your mileage may vary, your mileage will vary. Still, it was incredible and fast and wonderful to me, so it's getting a definite five stars."}, {"userName": "T4ncr3d1", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/4894181-t4ncr3d1", "userReview": "Il romanzo d'esordio che ha fatto conoscere il genio di Jonathan Carroll al mondo intero. O quasi.C'è già tutto, di Carroll, tutti gli ingredienti fondamentali del suo particolarissimo stile. E' un trionfo di surreale ed ironia. Soprattutto questa, che rende il libro un po' diverso dalle altre opere di Carroll (soprattutto dal \"Sestetto\"), spesso più cupe e horror.La storia è originalissima, fresca, innovativa, assolutamente imprevedibile, fino alle ultime battute.E' una storia molto particolare, certo, anche perché sembra avere diversi livelli di lettura. C'è il livello della storia surreale (con il mistero, tutto da svelare, della strana cittadina Galen), e c'è il livello della storia tutta introspettiva del protagonista, che poco a poco impara a conoscere se stesso, le sue potenzialità, e a riscoprire la grande figura del padre defunto.Unica pecca, forse, una caratterizzazione dei personaggi non proprio eccezionale. Certo: c'è la narrazione in prima persona del protagonista (e qui la caratterizzazione è totale), ma i comprimari sono un po' trascurati.Rimane comunque un libro fondamentale per tutti i fan di Carroll, e assolutamente godibile."}, {"userName": "Lee", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/1617945-lee", "userReview": "When you're an English lit teacher, with a little creative writing background, can afford to take a semester off (your late father was a very popular actor,who left you a comfortable inheritence), to go talk to the daughter of your favorite childhood author (who is a God in your eyes) to see if you can write his biography. You head for the midwestern/small town/Mayberry look alike - Galen, MO. Then you start to realize, this isn't like where Opie lived after all.This is one of the books I have had, that I consider \"a read outside my norm\" - \"expand my author reads\". This was my first Carroll novel, and what a wild, unexpected fantasy trip it was...all in a one day read. Recommended, if your kinda like me, and want to read something, \"outside the box.\""}, {"userName": "Iva", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/65227693-iva", "userReview": "Дуже дивна проза яка мені, втім, соподобалась. Багата фразеологізмами та відсилками до поп-культури мова, багато образів, що так і нагадують англійського товариша із ідентичним прізвищем. Напевно, одна із найцікавіших книг, що я прочитав цього року; тій же Правді про справу Гаррі Квеберта не поступається.Читав е-бук з 600 е-сторінок, і до сторінки так 400-ї не було жодної ясності чи прозоро фентезійної містичності. Магічним реалізмом у Джонатана і не пахне, але от Борхесівською химерною прозою ще й так віддає. Той дух перебиває лише слабкий душок белетристики, у яку, я так зрозумів із анотацій на пізніші книги Керрола, він скотився із головою. Белетристика тут у недоеротиці, у слабкості жіночіх персонажів, у ось-це-так-поворот!-ності.Та навіть із цім книга є хорошою, гарним прикладом якісної контркультури. Будь моя воля, і підлітки-недопанки читали б Керрола замість Паланіка чи (мазохісти!) Берроуза (і це тут не про чуваків із джунглів у дранті навколо геніталій).Хочеться чогось неформатного, проте емоційно та стильово якісного? Прошу - ось вам Джонатан Керрол.Пи. Си.: і з його цікавою мовою мені капець як хочеться побачити, чи можна його адаптувати українською"}, {"userName": "Pam Baddeley", "userReviewDate": "Jan 28, 2016", "userURL": "http://www.goodreads.com/user/show/42764850-pam-baddeley", "userReview": "[Thomas writes a biography of his father and resurrects him too. I might have suspended my disbelief that this was possible with France due to general Galen weirdness, but is Thomas now magic himself?  (hide spoiler)]"}, {"userName": "Michael Baumgartner", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/54550629-michael-baumgartner", "userReview": "Den Autor braucht man interessierten Lesern fast nicht mehr vorstellen. Auch seinen ersten ins Deutsche Übersetzten Roman \"Das Land des Lachens\" wohl nicht. Denn der hat sich so gut verkauft, dass er nach einer anfänglichen Taschenbuchausgabe ins Hardcover-Programm aufgenommen wurde, was ja sehr ungewöhnlich ist. Nun ist die spannende Geschichte um die Herstellung einer Biographie eines berühmten Kinderbuchautoren, die ungeheuerliche Folgen hat, wieder als Taschenbuch aufgelegt worden. Auf erstklassigen Papier gedruckt mit schönen, expressionistisch Farbillustrationen versehen. Ein Geschenk an die Leser. Und nicht zuletzt ist der Roman über die Macht der Vorstellungskraft rundum lesenswert."}, {"userName": "Adam Roloff", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/37587172-adam-roloff", "userReview": "Very enjoyable, although it has it's flaws. It gives the readers a chance to examine just how important an author is to his or her creations."}, {"userName": "Jenbebookish", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/5194069-jenbebookish", "userReview": "When I picked up this book I had high expectations. It was on a trusted GR's friend's \"favorites\" shelf and she had attested to Carroll's talent and skill. So. My feelings after I finished, which was just this very instant... I'm not so sure. I guess this book is sometimes categorized as horror, which doesn't quite make sense to me but there was a undercurrent of creepiness that was clearly evident.To sum it all up it's about a guy who is borderline obsessed with an author and who wishes to write that author's authorized biography. In order to do so, he and a companion slash girlfriend slash research assistant he picks up along the way travel to said author's hometown in order to speak with his daughter and other friends and acquaintances. Shit starts to get weird as he starts writing; there is a sexy, mysterious, kinda scary daughter, some crazy neighbors spouting gibberish, talking dogs and a whole bunch of hush hush secret keeping.I liked the way Carroll wrote most of his story. Skillfully and well, without being extensively wordy. I've often found that the less wordy kind of authors lose a little of something along the way but Carroll does it well. I also liked the way he unveiled his whole world. a little at a time.. piece by piece. But as I neared the end and noticed that I only had like 30 pages left I wondered how Carroll was going to manage wrapping up his whole big mysterious story in such a short amount of time and once I got to the end I realized how: poorly. The thing that happens so often in stories happened here, it was a great story with a sort of dud of an ending. When this happens I always wonder at the author's novel writing strategy. Like, with these kind of bummer bust endings it feels as if the author sat down and wrote from beginning to end, without planning it all out before starting, and he wove together an awesome story but didn't quite know how to top it all off when he got to the end. So he just wraps it all up as neatly as possible but it turns out being messy and uncoordinated. This is just my guess obviously, I have no idea if there's any truth to that theory but it's just what it feels like when such a great, thoughtful, smart story ends in the abrupt and so much less interesting than first 3 quarters of the book way.I hate poorly written endings. It's such a bummer, and for me always changes my entire outlook on the book. The basis of Land of Laughs was great, especially great for people who love books and authors and can relate to Thomas's obsessiveness and delight over France. (the author) But, I didn't particularly like any of the characters-especially Saxony who bugged-and the ending bummed me out. I laughed out loud a lot as I read, there was a bit of quirkiness to things that I found humorous. Honestly, I am not rushing out the door to buy more books by Carroll, but I am sure I will give him another go around sometime and that speaks for itself."}], "description": "Have you ever loved a magical book above all others? Have you ever wished the magic were real? Welcome to The Land of Laughs. A novel about how terrifying that would be.Schoolteacher Thomas Abbey, unsure son of a film star, doesn't know who he is or what he wants--in life, in love, or in his relationship with the strange and intense Saxony Gardner. What he knows is that in his whole life nothing has touched him so deeply as the novels of Marshall France, a reclusive author of fabulous children's tales who died at forty-four.Now Thomas and Saxony have come to France's hometown, the dreamy Midwestern town of Galen, Missouri, to write France's biography. Warned in advance that France's family may oppose them, they're surprised to find France's daughter warmly welcoming instead. But slowly they begin to see that something fantastic and horrible is happening. The magic of Marshall France has extended far beyond the printed page...leaving them with a terrifying task to undertake.", "title": "The Land of Laughs", "url": "http://www.goodreads.com/book/show/42143.The_Land_of_Laughs", "average": 3.9, "cover": "https://images.gr-assets.com/books/1388472821l/42143.jpg", "reviews": 397, "authors": [{"url": "https://www.goodreads.com/author/show/23704.Jonathan_Carroll", "name": "Jonathan Carroll"}], "type": ["Fantasy", "Fiction", "Magical Realism", "Fantasy", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/42143.The_Land_of_Laughs", "http://www.goodreads.com/book/show/32831247-the-land-of-laughs", "http://www.goodreads.com/book/show/983427.The_Land_of_Laughs", "http://www.goodreads.com/book/show/929660.The_Land_of_Laughs", "http://www.goodreads.com/book/show/929661.The_Land_of_Laughs", "http://www.goodreads.com/book/show/10362807-il-paese-delle-pazze-risate", "http://www.goodreads.com/book/show/929659.The_Land_of_Laughs", "http://www.goodreads.com/book/show/28808851-the-land-of-laughs", "http://www.goodreads.com/book/show/507053.Das_Land_des_Lachens", "http://www.goodreads.com/book/show/42146.Bones_of_the_Moon", "http://www.goodreads.com/book/show/366086.The_Wooden_Sea", "http://www.goodreads.com/book/show/157821.White_Apples", "http://www.goodreads.com/book/show/42145.Sleeping_in_Flame", "http://www.goodreads.com/book/show/2997253-the-ghost-in-love", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}