{"ratings": 91, "userreviews": [{"userName": "Heena Rathore P.", "userReviewDate": "May 11, 2015", "userURL": "http://www.goodreads.com/user/show/19253213-heena-rathore-p", "userReview": "Note: I received a paperback copy of this book by the author in exchange for an honest review.Plot/Story:This book has an amazing plot and the story is simply AWESOME!!! If you want to read a really, really good psychological thriller then you should definitely read The Magician. The concept is out of the world and I really, really enjoyed reading each and every chapter. The entire time I was at the edge of my seat and it was surprisingly hard to put down this book even for a second.It was a fast-paced thriller that gripped me from to end. I always found myself craving the next part to see what would happen next. There were a lot of things going on in this book at the same time (in a good way) and I enjoyed all the elements thoroughly. There are two parallel story lines and sometimes three (James' past and present and Agent Sorello's present.) Every time there was a shift I cursed out loud for the small cliff-hanger endings to every chapter, but, after a line or two, I found myself fully engaged again.The Magician is a perfect combination of love, revenge, determination, craziness, passion, intellect, mystery, murder(s), torture and pain.Overall it had everything one can expect from ten thriller books combined. The writing and characterisation were amazing and it all worked perfectly.Characters:I loved both the lead characters, especially James- the antagonist (maybe more than I really should!) His character is developed beautifully and creatively.Agent Frank Sorello (now retired) is also a well-developed character. Aside from being an FBI icon he is a really good guy. A gradual recovery from his tragic past is portrayed beautifully through the emergence of a new love in his life. It makes you feel involved in each and every aspect of his life (and the same goes for James.)Romance/Kills:There is a fair share of subtle romance and a lot of horrific kills. I really liked the way James' and Maria's relationship took such a beautiful shape and I was shattered to bits when the entire thing turned upside down. [Sorry for the spoiler.]Writing:Correction - The writing is simple but effective, which for me, is the perfect combination for any book. No unnecessary complicated words; the few used were really good and insightful! I loved the simple sentences and the ease with which they flowed. The writing was absorbing and complimented the book beautifully.Beginning:The beginning is as good as it can get! I was into the book right from the first line (read below.) It captured me in it's awesome thrilling experience and I enjoyed it like hell.Ending:OMG! This book just kept on getting better and better by the page and I can promise you that it ended just as incredibly. I really can’t wait for the next installment and have already asked the author to count me in for reviewing the second part as well.Blurb:It's more than enough to make anyone pick it up from the shelves (at least I would have picked it up for sure.) But it hardly explains how really, really good this book actually is! I mean this book is so awesome that they should probably write this in big letters above the blurb: A Mind-blowing Thriller.I really liked the 212 number written just above the blurb in blood-like ink and it was an additional bonus to see it after reading the book (as it's meaning gets significant in the second half of the book.)Cover Art:I love it. While reading the book, I began to understand what the hand with the bleeding nails meant. I always love when the cover of a book is symbolic in relation to the story.I loved the white background and the blood splattered on the entire book totally stands out! Initially, it really freaked me out, but now when I look at it, it's totally cool and gives a really good idea of what's inside.You can also read this review at \nThe Reading Bud"}, {"userName": "Stephen", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/3256717-stephen", "userReview": "This book by first time author, David Pupa will have you on the edge of your seat. Retired FBI agent Frank Sorello is haunted by his wife's murder. David's use of Hurricane Sandy'wrath to disguise a maniacal genius serial killer's own wrath. An author in his own right Killer James has written a bestselling novel with riddles that have caught the attention of Frank. Frank is back on the path of the \"psycho \". James leads Frank's team on a journey filled with dead ends and continues to haunt Frank. Well written, great characters that are driven. Fast paced, with twists and turns, you will driven to finish this tale as the suspense pulls you further into Frank and James' lives"}, {"userName": "Ana", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/33471531-ana", "userReview": "[I thought there should have been a link that explained the dentist's appointment, for instance. Did James switch his dental records with someone who looked like him? That would have been cool to find out. Especially if it turned out to be any number of characters that were described to be blonde, blue eyed and tall throughout the book. Because in the end everything James did had a purpose but a lot was left unexplained and I found that a shame. (hide spoiler)]"}, {"userName": "Galit  Balli", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/16576838-galit-balli", "userReview": "5 Stars and beyond <3I will keep this review short, sweet and spoilers free ;)The Magician is an amazing story to read and I would give it 10 awesome stars in Goodreads if I could. I enjoyed every second of reading this book, from start to finish (I even read it twice) ;)The plot caught my attention from the first few pages and since then, I was glued to the book. I've missed reading a good book and I normally wouldn't read a psychological thriller, but I am so happy I did!The plot builds up so smoothly, I truly enjoyed reading the story. The characters felt so real to me, making the book ever better. I loved how the author ended each chapter, it was awesome!The author made the main character Frank so strong but also very human, with flaws. This made me connect with Frank so much easier. James (the antagonist) was written so perfectly that I connected with him immediately, something I never thought I could (OMG).I loved the pov changes as well, even though in most cases I don't like it, but here... It was done perfectly. When the author showed us the killer, I was hooked, craving for more. I loved how original it was and how perfectly it was executed.You can find everything in this book: Love, murders, revenge, obsession and pain. All these elements are so well written, that you are literally on the edge of your seat, craving for more, calling out load for each twist in the story or at each end of a chapter.Trust me when I say... You will want more!Overall: The book is a fast-paced read and very intense. Also... Have you seen this fantastic/amazing cover? Wow <3Amazing book to read, thank you Dave :) Can't wait for the next one ;) \"Life’s unpredictable patterns had a strange way of forming a connected web.\" - By Dave Pupa (The Magician)Thank you so much for reading <3Galit From Coffee n' Notes"}, {"userName": "Mindy", "userReviewDate": "Dec 30, 2014", "userURL": "http://www.goodreads.com/user/show/15276744-mindy", "userReview": "This book is so great. It has the perfect mixture of suspense, drama, intelligence, love, twist and turns. You can really get into the heads of all the characters. If I wasn't reading the book I was thinking about it or even dreaming about it. It really lets you see how the killer was a product of his environment. I even found myself rooting for him time to time. Love how even fictional psychos end up in Montana at some point. I loved that you got to see all sides of the story: the killers view, the victim view, the psychologist view and the F.B.I. view."}, {"userName": "Dawn", "userReviewDate": "Dec 31, 2014", "userURL": "http://www.goodreads.com/user/show/19614724-dawn", "userReview": "Story is great. Editing needed --comma splices. Pronoun usage. Characterization was extreme."}, {"userName": "Babus Ahmed", "userReviewDate": "Jan 20, 2015", "userURL": "http://www.goodreads.com/user/show/523471-babus-ahmed", "userReview": "This gripping thriller starts off with retired FBI profiler Frank Sorello trying to keep calm as he discovers the second novel written by Gary Jones, a thriller novelist, carries details perhaps only the killer or someone in a select few within the FBI could have known. Frank has enjoyed some outstanding success in his career but he could not bring the murderer who killed his wife to justice and subsequently retired. His obsession with Gary Jones started when he read his first book but Frank's assertions of Jones being the killer was seen as delusional ranting by a bereaved husband but now there are just too many circumstantial coincidences to ignore his hunch. I loved reading this thriller and am a huge fan of serial killer fiction, I enjoyed the original premise of the flawed FBI agent and the brilliant but deranged killer he chases in this cat and mouse game. The story is written so that the opening chapters up to and including chapter six sets the present day scene and chapters from The Taking by Gary Jones, which I found quite an original idea in which to introduce the killer. From chapter seven onwards the chapters alternate to tell us the history of how a serial killer is made and Frank's progress in trying to hunt him. There are some really exciting sequences as you would expect as the FBI close in on their quarry but for me the journey a man takes to become The Magician was the most compelling part of this outstanding read. I thoroughly enjoyed this and would have awarded it five stars if for not the typos. A good proofread and edit would make this a seriously compelling contender for my personal best thriller of the year."}, {"userName": "Jill Miller", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/1580296-jill-miller", "userReview": "This is an awesome book -- the story is incredibly complex, yet told in such a way that it's easy to follow. Totally unpredictable, too. My only criticism is that the book needs to be \"cleaned up\" a bit -- the incorrect use of commas was very distracting. That said, guided by the hand of a strong editor, this book could easily stand among the best of the genre and be a best seller. I cannot wait for the sequel -- there WILL be a sequel, right????!!!???? (I won this book in a Goodreads giveaway)"}, {"userName": "Lisa Paden", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/51579273-lisa-paden", "userReview": "I thoroughly enjoyed the book. I would have given the book more stars, but I did find it difficult to get past the dialogue of the characters and the prose the author used at times. The book, however, did keep my attention and I did find that I could not put it down."}, {"userName": "Stefanie", "userReviewDate": "Nov 12, 2014", "userURL": "http://www.goodreads.com/user/show/20716668-stefanie", "userReview": "Fantastic debut novel. Thank you for a thrilling ride. Great twists and turns. Is there a sequel?"}, {"userName": "Jay G", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/30890847-jay-g", "userReview": "*I was given a copy of this book by the author in exchange for my honest review*VIDEO REVIEW: https://youtu.be/BG6aO5-hnoQFrank Sorello has retired from the F.B.I when a recent case involving a serial killer struck a little to close to home. Now, several years later after the release of a novel from a best-selling author raises red flags, Frank is sucked back into the F.B.I lifestyle. Frank must work quickly against the clock to catch the killer before its too late. This book was extremely fast paced and very thrilling! It follows 3 timelines running in parallel to each other (Frank's present as well as James' past and present) which made for a very interesting story! The writing was simple yet effective and it made it an easy read. The only major complaint I had about the writing was some of the dialogue. The character's tended to use each other's names every other sentence which became a bit annoying as the story progressed. (I understand why the author may have done this, but it still bothered me). Obviously, this is a personal thing and should not take away from the enjoyment of the story for others. The story was very complex but told in a way that made it easy to follow and very enjoyable. I found Frank to be slightly annoying, only because he seemed to be so perfect and didn't have one single flaw. I LOVED James though. He was so smart and the way he thought things through truly fascinated me. AND THAT ENDING THOUGH! SEQUEL?!?!? PLEASE?!Want to see more bookish things from me? Check out my YouTube channel: https://www.youtube.com/channel/UCfer..."}, {"userName": "Rob", "userReviewDate": "Mar 07, 2016", "userURL": "http://www.goodreads.com/user/show/49082488-rob", "userReview": "[ the burned body they found with the matching dental records isn't the killer DUN, DUN, DUN. Of course everyone knew this when the author \"cleverly\" foreshadows the ending by having the killer POINTLESSLY go to a dentist near the FBI offices (hide spoiler)]"}, {"userName": "Lauren", "userReviewDate": "Jan 07, 2015", "userURL": "http://www.goodreads.com/user/show/10309967-lauren", "userReview": "I was... underwhelmed by this one. I mean, it was a good story, don't get me wrong, but it feels like just about every other thriller I've read. For starters, this is one of those books that is interesting when you're reading it, but it's not something that you just can't put down. Additionally, after you put it down (for any amount of time), there's nothing that really makes you want to pick it back up.I did like that it was partially based in NJ. That was part of the reason I picked it up when I was down in 'Squan this past summer. The whole number thing with the 2-1-2 thing was pretty cool too, but it seemed to fall together too easily for the FBI agents. I don't know. I really wanted to like this. I love supporting local authors, and sometimes you really find a gem. This looked like it could be, but as I said earlier, it felt like every other thriller I've ever picked up:Serial killer with some sort of unknown past has a vendetta against the brilliant law enforcement person that is super clear to the reader and the killer, but not to the cop. The killer takes the life of someone close to said law enforcement official, leads them on a wild goose chase, and eventually squares up with them, mono e mono because someone else will die and it will directly be his/her fault if the killer wins (which is exactly how the killer wanted it to go in the first place). Then the serial killer mysteriously vanishes, & his charred or otherwise unidentify-able remains are found, somehow identified, and everyone goes home, shaken, but happy. Case closed, killer dead... or is he?Seriously, stop me if you've heard this one before.All in all though, if you're looking to support a local author, pick it up if you like thrillers. Overall, it wasn't a bad novel."}, {"userName": "Fleur", "userReviewDate": "Nov 08, 2016", "userURL": "http://www.goodreads.com/user/show/7322160-fleur", "userReview": "This is a very generous 2 stars. I couldn't even finish the book and that's saying something. I thought the book had potential. The idea was interesting but the writing was unforgivable. The characters were so horribly stereotyped that they grated on my nerves. In addition, there was no drama when the disastrous event finally happened. There was no build up, anticipation, no fear. It was just bam(!), everybody who's important is dead. Anticlimatic. Then there's the continuous...\"Best years of his life but not for long\" after every chapter for like 13 chapters. I felt like I was rereading the same chapter after the first one over and over and over again. I found myself rolling my eyes with disgust after the first 3. But, aside from all that, I liked the idea of the story. And that's why I gave 2 stars. If the author worked hard on his character development, dramatic twists, and rid of the senseless sentiment I think he'd be a great writer. Don't give up!"}, {"userName": "Jessica ", "userReviewDate": "Jan 27, 2016", "userURL": "http://www.goodreads.com/user/show/15276983-jessica", "userReview": "I give this 5 stars! I won this book from the author in a contest he had ( Paperback)This book is intense and honestly gave me nightmares when I read it before bed. There is a great mix of drama and suspense. There is a lot of twists and turns. Some things were easy to figure out and some things had me guessing. I didnt want to put it down but I had to because I had nightmares about this book. I loved that it make me not want to read at night because to me that makes it a great book. The Story will well written, and flows very well. The characters are well written and its easy to feel what they feel. I am really looking forward to the next book!"}, {"userName": "Kelly Sluka", "userReviewDate": "Jan 17, 2016", "userURL": "http://www.goodreads.com/user/show/20294567-kelly-sluka", "userReview": "I set out to make this the book I was to read over the school holiday break. I had to find another within 3 days because I couldn't put this down and finished it so quickly. It was a great read with many twists. I recommend it to anyone who enjoys psychological thrillers. Now I anxiously await the next book!"}, {"userName": "Jackie", "userReviewDate": "Aug 22, 2016", "userURL": "http://www.goodreads.com/user/show/5888407-jackie", "userReview": "Definitely catches your attention and keeps you interested!! I thought the main character was a little too perfect (of a murderer) so thought there could have been a little more contrast around him. Other than that, this book certainly kept me hooked!"}, {"userName": "Meg O'sullivan", "userReviewDate": "Sep 22, 2015", "userURL": "http://www.goodreads.com/user/show/36295100-meg-o-sullivan", "userReview": "Extremely fast read! Thoroughly enjoyed it! New author to watch out for! I highly recommend!"}, {"userName": "Jeni", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/56695317-jeni", "userReview": "First off, I have to say the author, D.A. Pupa is one of the nicest people I've ever encountered. When I added his book to my TBR shelf, he personally thanked me, then when I listed it as read, he messaged me and thanked me for reading his book. So if for anything, read this book so that you can get a message from a really nice author thanking you for reading their book, it really makes you feel good! I wasn't even gifted a copy of this book or anything, I bought it for Kindle and then I bought the WhisperSync Audible option so that I could listen to the Audiobook.The Magician is a book that switches back and forth between the past and present, and I know that's a commonly used trope these days, but I promise it's done well here. We are first introduced to present-day Frank Sorello, then the past is to see how the killer is brought up into a killer and how Frank's wife is killed during Hurricane (or is it SuperStorm?) Sandy. I'd say that most of the book is in the present and what's in the past doesn't detract; if anything, it gives the background information necessary to know what motivates the killer, James. I was glad that we were able to get into the mind of not only the hunter, but the hunted. There are quite a few more minor characters, and I feel like they could have been fleshed out a bit more, but honestly, I quite enjoyed the central spotlight being on James and Frank; it seemed a bit obsessive at times, but on the flip side, then we would see other characters and it would cool off.I think my only couple criticisms would be that the ending isn't wrapped up very neatly and that a few things were just a bit too easy. POTENTIAL SPOILER. First, I have been told that there is a sequel in the works, but the ending isn't tied up in a pretty bow. If that's going to bother you and you're going to give this book a 1-star review because you can't handle a book that ends but doesn't quite resolve everything, don't waste our time. This is a phenomenal book that the author has obviously worked very hard on; I'm really looking forward to reading the sequel. The ending didn't leave me disappointed or feeling unsatisfied and I wouldn't call it a cliffhanger at all, it's just not neat and tidy. END POTENTIAL SPOILER. Second, a couple things were just too easy, for example after the death of Frank's wife, he was at rock bottom and drinking too much, and we see that he has a Sensei that brings him from the depths, but we don't get too many details and it seems like it was just Frank pulling himself up by the bootstraps and getting on with life. Also, Sara is the only one that can break through his hardened heart, but it doesn't take much and is just really easily done, almost a gimmee. Again, these things don't necessarily detract from the storyline since the rest of it is so incredibly intense, but it would be nice to see just a bit more detail and fleshing out of these moments to see a bit more of the human side of Frank.I have to take a moment to comment on the beauty of that cover. Before I read the book, I didn't understand the cover at all and I thought it was a bit weird, but after reading the book, HOLY COW, I've never seen a cover that embodies a book better than this one! You must really zoom in to see and appreciate the detail that was put into this cover to really appreciate it, but it's really a thing of beauty.I listened to the audiobook narrated by L.J. Ganser that is available on Audible and as a WhisperSync option with Kindle ebooks. Since I didn't actually read the Kindle or paperback versions, I can't comment on any grammar or spelling issues. L.J. Ganser did a great job as a narrator and I think he embodied Frank and James really well. He struggled just a little bit with the female voices in dialogue, but I was still able to differentiate them and I was never confused as to whom was speaking. I found this book riveting and am very excited for when the sequel comes out! I'm looking forward to more for D.A. Pupa and wish him the best in the publishing world as he writes a great book and is one of the nicest authors I've ever encountered."}, {"userName": "Karen Gail Brown", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/5561752-karen-gail-brown", "userReview": "This book needs serious editing. The story is good, but the punctuation errors and some grammatical errors make it really difficult to read, which is the reason it to me so long to do so."}, {"userName": "Leslie Fuller", "userReviewDate": "Jun 20, 2016", "userURL": "http://www.goodreads.com/user/show/12663844-leslie-fuller", "userReview": "Could use some editingI enjoyed the storyline. I thought it had good potential, but I kept getting distracted by the way this book read. To many times a chapter would jump around from one character's thought or action to suddenly something unrelated and then back again making me re-read a page to make sure I understood what the author was trying to explain. A good editor would have caught these jumbled thoughts and had them rewritten to smooth out the read.I also found the dialogue stiff and unnaturally paced a lot in the book. When lightly sketched characters spend too much time in small talk or needless responses, I find that off putting. I also would have enjoyed learning more about certain characters that interacted so strongly with the main character James that they set the tone of his mental downward spiral. We are told this, but they are so weakly drawn and it just doesn't seem as important as they are supposed to be.Again, the storyline is good. The ending sets everything up for a sequel. This will be a good thing if a good editor gets a hold of it."}, {"userName": "Jae Park", "userReviewDate": "Oct 01, 2015", "userURL": "http://www.goodreads.com/user/show/3150238-jae-park", "userReview": "The story of Frank Sorello as he follows a gruesome serial killer, who has an IQ of 200, is one of those stories that you cannot put down. I wished that I could freeze my life just so I could read this book uninterrupted.  Frank investigates the many twists and turns of this tale with unshakable aplomb, even when the murderer sends the most hideous clues. No spoilers, but the killers trademark made me cringe. And I've been reading Stephen King since I was 11...so that's not easy to do.  The character of the genius murderer is well-written, and even somewhat sympathetic even though he is horribly psychotic, or sociopathic (I can't remember the difference.) The terrible circumstances that he went through as a child, then again as a young adult thoroughly twisted him into what he eventually turned into...a monster. The ending was exciting and could most likely be made into an action movie, with gunfire and explosions galore. And then comes the 'happily ever after' part...or does it? Bring on the next installment, I'll be the first in line to buy a copy!"}, {"userName": "Megan Overholser", "userReviewDate": "Dec 30, 2016", "userURL": "http://www.goodreads.com/user/show/48017911-megan-overholser", "userReview": "This book was interesting and I was hooked from chapter 1. I found myself torn between rooting for Frank and for James. This was a descriptive book that thoroughly explained what led James to his decisions. This was a very engaging book that I couldn't help but talk about every time I set it down. That being said...I was a little distracted by some misplaced commas, but even more distracted by how unrealistic this book was. It was a great idea, but is James really that intelligent, beautiful, and athletic knowing how to do everything perfectly? He has no faults other than he's a murderer. Parts of this book were a little too unbelievable. I received this book in a giveaway."}, {"userName": "Carolyn Rowker", "userReviewDate": "May 29, 2016", "userURL": "http://www.goodreads.com/user/show/50858016-carolyn-rowker", "userReview": "I absolutely loved this book! It definitely deserves a rating of more than five stars! This is easily my new favorite book to read again and again; I am looking forward to the sequel and hope I don't have to wait long! I plan on recommending it to everyone. Kudos to the writer for an absolutely great page turner!"}, {"userName": "Nancy Jansen", "userReviewDate": "Oct 01, 2015", "userURL": "http://www.goodreads.com/user/show/45912528-nancy-jansen", "userReview": "I like the idea and story line, but feel the book was written for teens, or individuals new to English. Very easy wording - too much explanation for things that were quite easy to grasp without all the verbiage. Also, the ending was sort of predictable. But it was a good story, and made me want to read it all the way through. Thank you for the book."}, {"userName": "Darla Obrien", "userReviewDate": "Dec 03, 2016", "userURL": "http://www.goodreads.com/user/show/6862195-darla-obrien", "userReview": "I'm not going to review with spoilers. This was such an engrossing, edge of your seat book.This is not just another serial killer book. Its a tale of human surffering, love and pain. Can love save us from our darkness? Can it unravel us?If you like character driven stories then this book is one of the best."}, {"userName": "TA ", "userReviewDate": "Feb 18, 2016", "userURL": "http://www.goodreads.com/user/show/30719764-ta", "userReview": "OK, this was such a fun read! The story was fast paced and action packed, not unlike a comic book. I will definitely be leaving my copy within reach in case I end up reading a boring book and need to read something interesting to pick my brain back up."}, {"userName": "Chip Luonuansuu", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/26174171-chip-luonuansuu", "userReview": "One of the best thrillers I have ever read. A former F.B.I. agent Frank Sorello, is convinced an author of thriller novels is actually a serial killer, known as The Magician. Sorello comes out of retirement, to try to put an end to the killing spree."}, {"userName": "Lashana", "userReviewDate": "Mar 17, 2016", "userURL": "http://www.goodreads.com/user/show/11997205-lashana", "userReview": "I only made it to 23% of this book before I had to call it quits. It was so boring. I felt like I was reading a book report. None of the characters had any life to them and every action seemed forced."}, {"userName": "Debbie Oxier", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/21813445-debbie-oxier", "userReview": "I couldn't even finish this one. The narrative just went on and on and there was very little dialogue. It was impossible to get a good feel for the characters. Not my cup of tea."}], "description": "Hurricane Sandy ravages the Jersey Shore while simultaneously providing the backdrop for a horrible crime. A serial killer takes advantage of the night's ferocity and inflicts his own damage. The madman then disappears leaving a famed F.B.I. agent broken in the process. Frank Sorello retires from the Bureau only to be drawn back into the game after a bestselling novel by a new author raises suspicions about details inside the book. Is the homicidal maniac announcing his return or is it purely a coincidence? The intrigue builds as a young man with an intellect rivaling that of Einstein and Da Vinci is tragically connected to the Bureau's top agent. As the investigation is renewed, the murders begin once again. While the mystery unravels no one is truly safe; neither the gated communities of Hollywood nor the hallowed grounds of an Ivy League University provide refuge from what lies waiting in the shadows. The suspense mounts as the hunt gets ever more personal when the agent's current romantic interest becomes a target. Sorello vows to put an end to the killer's reign in this fast paced thriller . . . but the killer has other plans.", "title": "The Magician", "url": "http://www.goodreads.com/book/show/22807550-the-magician", "average": 4.1, "cover": "https://images.gr-assets.com/books/1420520709l/22807550.jpg", "reviews": 31, "authors": [{"url": "https://www.goodreads.com/author/show/8412377.D_A_Pupa", "name": "D.A. Pupa"}], "type": ["Mystery", "Thriller", "Fiction", "Adult", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/22807550-the-magician", "http://www.goodreads.com/book/show/22851087-the-magician", "http://www.goodreads.com/book/show/22807552-the-magician", "http://www.goodreads.com/book/show/29213501-the-magician"]}