{"ratings": 98688, "userreviews": [{"userName": "Madeline", "userReviewDate": "Jun 04, 2010", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "I went into this book with a bit of an attitude. Roger Ackroyd is the only Agatha Christie book featured on the list of 1001 Books You Must Read Before You Die, and I was skeptical about the List's claim that this was the only Christie book worth reading. But, as much as it pains me to say this, I think the List is right on this one. At least a little - I'm definitely not suggesting that you should read this book and then never pick up a Christie novel ever again, but if you find yourself in a situation where you're going to spend a month on a desert island and can only bring one book, and the only books you've been offered are from the Agatha Christie canon, you should pick this one. The ending (which I will not discuss in explicit detail for fear of spoilers) is what makes this a 5-star book. Let me assure you: you will not guess who the murderer is. Never ever ever. When the murderer is revealed, you will not believe. When the murderer goes on to explain his/her actions, you will continue to not believe it. Only by rereading certain important passages will you start to realize that the answer was in front of you all the time, and you couldn't see it. It's a testament to Christie's skill as a writer that this is accomplished. And, having now read a Miss Marple mystery, I'm going to choose a side: I'm officially Team Hercule. He is silly and self-centered and ridiculous and funny and all I want to do is pinch his cheeks and then go sit in a cafe with him and eat croissants. My favorite part of the book is when Poirot makes his grand entrance. The narrator, Dr. Sheppard, is in his garden when someone throws a vegetable marrow over the wall. A second later, the doctor's new neighbor pokes his \"egg-shaped head, partially covered with suspiciously black hair, two immense mustaches, and a pair of watchful eyes\" over the garden wall and attempts to explain himself:\"I demand of you a thousand pardons, monsieur. I am without defense. For some months now I cultivate the marrows. This morning suddenly I enrage myself with the marrows. I send them to promenade themselves - alas! not only mentally but physically. I seize the biggest. I hurl him over the wall. Monsieur, I am ashamed. I prostrate myself.\""}, {"userName": "Mohammed Arabey", "userReviewDate": "Sep 16, 2016", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "Arabic/English Reviewفي 15 سبتمبر/عيد ميلاد ملكة الجريمة، ذات أعلي مبيعات لمؤلفة في التاريخ، والتي جعلت أجيال \"حرفيا; تذكر ما ذكرته بريفيو سابق عن أنها مؤلفة والدتي المفضلة\" تخمن دائما من الفاعلفي 16 سبتمبر/جودريدز يرشح لي تلك الرواية كأكبر مفاجأة بنهايتهافي 17 سبتمبر/تم العثور علي السيد روجر أكرويد مقتولاوفي 18 سبتمبر دخل المحقق بوارو، وأنضممت معه لمرافقة دكتور شيبارد وأخته الرائعة كارولين ببلدة كينجز أبوت الصغيرةفي قصة حزينة..قاسية وقبيحة مشوقة وجميلة!؟\n“The truth, however ugly in itself, is always curious and beautiful to seekers after it.”\"الحقيقة مهما كانت قبيحة، فإنه البحث وراءها جميل دائما ومثير للفضول\"\nلا يسعني سوي القول أن حتي منتصف الرواية نجح هيركيول بوارو في تشغيل الخلايا الرمادية بمخيوتحليله الدقيق لمسرح الجريمة لا يقل عن تحليلة النفسي للشخصيات بشكل رهيبأمامنا عشر شخصيات مشتبه فيهم.. وقد أصررت عن أن أجعلهم عشر شخصيات رغما عني بسبب تشغيل تلك الخلايا\nأرملة أخيه ، ابنتها ، ابن زوجته الراحلة ، سكرتيره ، صديقه الصياد ، صديقه الدكتور ، الخادم ، مديرة المنزل ، خادمة الأستقبال ، الزائر الغريب\nعشر تفاصيل صغيرة محيرة\nرسالة الأبتزاز من سيدة منتحرة ، الخنجر من درج الانتيكات ، الشباك المغلق ، الكرسي ، ريشة الأوزة ، منديل ابيض ، نعل الحذاء ، مكالمة تليفونية ، خاتم زواج من ر ، فلوس مسروقة\nعرفت القاتل بعد منتصف الرواية بقليل.. وتأكدت في الربع الأخير من الرواية بخطبة هيركيول بوارو القاسية عن الضعف البشريولكن كيف كيف كيف...كيف كيف كيف..عشرة كيففحتي إن خمنت القاتل لن تعرف أبدا كيف كل تلك التفاصيل تجمعتمهما دربت خلايا مخك الرمادية ... إن هيركيول بوارو لرجل مخضرم بحقمهما خمنت فلن تصل بالحل النهائي المقنع الذي جاء بأخر عشر صفحاتلتجد كل لغز وسر تم كشفه وحله..كل شئ تم ربطهمهما حليت بعض العُقد فلن تصل لدرجة ملكة الجريمة في ربط كل التفاصيل الصغيرة\n“Women observe subconsciously a thousand little details, without knowing that they are doing so. Their subconscious mind adds these little things together—and they call the result intuition.”\"النساء تلاحظ لاشعوريا ألاف التفاصيل الدقيقة، دون علمهن بفعلتهن تلك. عقلهن الباطن يُجمّع تلك الأشياء الصغيرة معا- وتكون النتيجة هي الحدس 'الحاسة السادسة'\"\nولمقولة بوارو السابقة، شعرت بأعجاب شديد بأخت الراوي ، دكتور شيبارد، الفضولية عاشقة النميمة ، الذكية اللمّاحة ذات الحدس والحاسة السادسة ; كارولينوأعتقد أنها لتكون مساعد ممتاز للمحقق بوارو إن ما استمر في بقاءه بكينجز أبوتتلك القرية الصغيرة العاشقة للنميمة والتي مرت بخمس أيام عاصفة والتي بدأت بوفاة شابها الكثير من النميمة للسيدة فيرارز في 16 سبتمبرولكن يكفي النميمة إلي هنا..فأي نميمة أخري ستؤدي لحرق الأحداث .. وأعتقد ان متعة روايات أجاثا تكمن في تشغيل الخلايا الرمادية الصغيرة بمخك.. أليس كذلك؟ --------------------** أسلوب الرواية **هي أول رواية أقرأها لتحقيقات بوارو ، ولكني فوجئت بأن الراوي هو الطبيب الطيب \"شيبارد\" والذي راق لي أسلوبه الرائع في الوصف والدقة والتحفظ بل والتشويقحواراته مع أخته المثيرة -أقصد شخصيتها فحسب بالطبع- كارولين كانت ممتازة ، ذكرتني كثيرا ببتونيا دارسلي الفضولية في سلسلة هاري بوتركسر الحائط الرابعوأكثر ماراق لي بحق هو أن الدكتور شيبارد يحكي لنا أنه هو من يكتب الرواية فعلا..وبالفصل الحادي والعشرون يعطي للمحقق بوارو الفصول العشرون السابقة التي كتبهاكانوا ثلاثي ممتاز وعجيب ، دكتور شيبارد وكارولين وبوارو..وحوارات بوارو حول أفتقاده صديقه وشريكه بالتحريات السابق جعلني أشعر حقا بحزن شديد بالنهاية لأن الحياة ستمضي وسيذهب بوارو لمكان أخرلن يمكن أن يستكمل حياته بكينجز ابوتوأعتقد أن هذا يكفي كي لا أحرق لك متعة البحث عن الحقيقة التي مهما كانت قبيحة، فإنه البحث وراءها جميل دائما ومثير للفضولصدقني لن تملك أن تربط كل تلك التفاصيل الصغيرة.. وستفاجأ بكل قصة من قصص الشخصيات المشتبه بها العشرةلن أقل لك لن تخمن من القاتل فبتشغيل خلاياك الرمادية الصغيرة بمخك ستصل له كما وصلت ، ربما بمنتصف الرواية او بعدها بقليلولكن كيف عرف بوارو من الجاني من العشر مشتبهينوكيف قام بذلك التحليل النفسي القاسي الرهيبوكيف عرف بوارو براءة التسعة الباقينهذه هي العبقرية بحقكما قلت بريفيو سابق -اول قراءة لي لأجاثا-مقولة \"لابد أن الخادم هو من فعلها كقصص أجاثا كريستي\" جعلتني متشككا أن الحل دائما نمطيا.. حسنا، حتي إن كان -إن كان- الخادم هو من فعلها.. فكيف ولماذا هو أمرا لن يخطر لك علي بالمحمد العربيفي كينجز أبوت من 17 سبتمبر 2016إلي 20 سبتمبر 2016---------------------A Brief English Review Sep. 15, The Queen of Crime, and Mystery... Agatha Christie's Birthday.Sep. 16, Goodreads recommending this to us as 'one of' the best Twist/Reveal in her novels.So, I went to the nearest book store to celebrate the the best-selling novelist of all time who 'literally, she was my mom's favorite author' kept generations of readers guessing..Sep. 17 Mr. Roger Ackroyd found murdered at his office.Sep. 18 Me, Mr. Hercule Poirot start a hell of time in King's abbott with Dr. Sheppard and his ingenious sister, Caroline, trying with all our brain's little grey cells finding out Who Murdered Mr. Roger Ackroyd.10 Suspects.. I forced to include all, even the narrator Dr. Shepparad, as Mr. Ackroyd's friend..10 little things, clues unplaced and appears unrelated at all that found by Poirot from a goose quill to a unplaced chair..and even I suspected the killer strongly after half of the novel.. You'll never know why..Why, 10 Big Questions of Why, told one by one till the last 10 pages to know why every thing.. to connect everything brilliantly and perfectly..\n“Women observe subconsciously a thousand little details, without knowing that they are doing so. Their subconscious mind adds these little things together—and they call the result intuition.”\nWomen are really great in this.. that's why The Crime has a Queen , her name is Agatha Christie..I loved the minor -yet important- character ,Caroline so much.I loved also the way of Breaking the fourth wall by the brilliant, smart, vigilant, discreet yet detailed and thrilling narrating (writing) of Dr. Shepparad and how in Chapter 21 he gave the written previous 20 chapters we already read.And I loved this brief partnership between them..And may be that's why I felt it's really A Very Sad Story cause I wished they keep partners, but alas, Poirot must go on and leave 'King's abbott' eventually.---------------Well, even I suspected the killer by the half of it, even if we say \"It must be the butler, like in Agatha Christie novels\", well... even if it was the butler... trust me you'll never see how and why and place the little pieces together.. unless you really can use Brain's little grey cells as perfectly as Agatha Christie Mr. Poitot.Mohammed Arabeyfrom 17 Sep. 2016to 20 sep. 2016"}, {"userName": "Brina", "userReviewDate": "Mar 03, 2017", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "I read mysteries in between denser reads and Dame Christie never disappoints me. As in all of her cases involving Inspector Hercule Poirot, Christie unearths layer upon layer of the case, leaving her readers guessing until the very end. Just when you think whodunit, she throws in a twist by revealing a key clue that only Poirot could have thought of. Occasionally, I guess the criminal, but other times I am left stumped. This time, in The Murder of Roger Ackroyd, Christie leaves me hanging until her final paragraphs, creating a thrilling case. In this particular case Dr James Sheppard meets his old friend Roger Ackroyd for supper and minutes later Ackroyd is found murdered. To solve this particular crime involving blackmail, drugs, and forced marriages, Ackroyd's niece Flora turns to Hercule Poirot to get to the bottom of the murder. As in the other of his cases that I have read, Poirot just happens to be in the area because he is either retired or on a holiday. Here, he claims to be doing Miss Ackroyd a favor and states that this is his last case, which, of course, it is not. Just as in the other Poirot tales I have read, he uses his little gray cells, stumps the local police, irks the local populace who are happy to be rid of the little Belgian man, yet solves each case in ways that most detectives are not capable of achieving. I am attempting to read primarily women authors during March, Women's History Month. This month would not be complete without an Agatha Christie mystery because she remains the standard that many modern mystery writers strive to attain. Roger Ackroyd was definitely a captivating Christie case but not quite at the level for me as Orient Express was. I am enthralled by Poirot's manner of solving cases, but I must space them out so that his mannerisms and humor do not stale for me. Yet, Christie is still Christie, and this case rates a sparkling 4 stars."}, {"userName": "Adina", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/22189348-adina", "userReview": "The Murder or Roger Ackroyd is one of the most well-known mysteries written by Agatha Christie and the only one to be featured in the 1001 Books To Read Before You Die list. After having read it I understand why it is so well praised. As with all her mysteries, it leaves you guessing until the end who the killers is and in this particular case, the way the murderer was unraveled was particularly interesting. Sadly for me, I already knew who the killer was as I accidently found out from an audio course on Crime and mystery novels. Because of that, a large part of the book’s appeal was lost for me. However, I can still appreciate the unique way this novel was thought out. I don’t want to say anymore so I do not spoil anything for the ones that still haven’t read it. If you enjoy Agatha Christie’s novels this one is a must."}, {"userName": "Arah-Lynda", "userReviewDate": "Aug 12, 2016", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "Wow just Wow! Agatha Christie had me from the first page, hook line & sinker and she never lost my attention until the very end. No wonder this is considered to be one of her very best.I do not want to say too much about this book, I mean the title pretty much tells you what it is about and to go too much further into any details runs the risk of spoilers. If there are others out there, like me, who are late in the game of reading this I do not want to spoil that experience for them in any way.This is only the second Agatha Christie book I have read and my first Hercule Poirot. Know this, you will not be bored. I spent my time while reading trying to figure out who did the dastardly deed. Not! It wasn’t until right near the end that I thought “It can’t be”. I love when that happens. I want to go back and read it again, just to see how many clues I missed along the way. If you have not as yet taken the Agatha Christie plunge, look no further. This is the one.Highly Recommended!!!"}, {"userName": "Bookdragon Sean ", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "Agatha Christie offers her readers an invite, an invite to come and solve her tantalising murder mystery.It was a real tricky one, though I did have my suspicions very early on. There was a certain emphasis on a tiny bit of information that we didn’t really need to know that gave the game away. It added little to the story and, for me, only had the purpose of giving her killer an excuse not to be the killer. So it was obviously that person. Most readers seem to have been utterly dumbfounded at the reveal but I spotted it a mile of, perhaps only because I have seen the same device used in a book by another author. I’m not going to mention the name of the book because it will give it all away. Nevertheless, when it was finally confirmed it still brought me a great deal of delight. The actual murder event was ever so discreet, tucked in between two paragraphs in plain sight that will always be missed on an initial read. It was the editor afterward that drew my attention to the piece of text, and despite my suspicions I still missed it when I read it the first time. When I went back to read it though I noticed exactly how subtle Christie has been; it is exceedingly clever writing that’s for sure. The real success of Christie’s writing is her narrative drive. It is impossible to read this in a slow leisurely manner. I found myself storming through pages and chapters at an alarming rate. I actually read the entire novel in one evening and pretty much in one sitting. Christie gives you just enough information to keep you second guessing yourself but not enough to finally confirm your suspicions, at least, until that memorable reveal: the grand unmasking of her killer. Poirot knew all along; he was just keeping the killer as close as possible for as long as possible, baiting him the entire time. In the mode of modernism, Christie’s prose is deceptively simple. It pushes ever forward, picking up speed, as it heads towards the climax: a single line of dialogue that has, no doubt, dropped the jaw of many a reader. She also explores the psychological state of her characters and demonstrates awareness of Freud’s theories of psychoanalysis. It allowed her to get way with so much here and Poirot uses it too when he considers the possible murder motives his line of suspects could have. Overall, a brilliant book. This will not be the last Agatha Christie novel I read."}, {"userName": "Araz Goran", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/32779601-araz-goran", "userReview": "لا شك أن هذه الرواية هي من أجمل وأغرب وأعقد ما قرأت لأجاثا...النهاية كانت صادمة وخارجة عن كل التوقعات , وكان التشويق سيد الموقف في كل صفحة من صفحات الروايةهذه الرواية إبداع حقيقي من السيدة أجاثا...أنصحكم بها يا أصدقاء.."}, {"userName": "Adrian", "userReviewDate": "Mar 09, 2017", "userURL": "http://www.goodreads.com/user/show/22809267-adrian", "userReview": "My 2018 Review ooh 4.5 starsSo as part of my Hercule Poirot challenge, courtesy of Jessica in \"Reading the Detectives\", I decided to read this book for the 2nd time in 13 months (why when I have so many books I want to read I don't know, but I did). Was I disappointed, oh no, if anything I'm seriously thinking of upping it to 5 stars. Despite a gap of only 13 months , I got so much from this re-read. In fact I've obviously read so much in that intervening time, that it took me over 3/4 of the book to guess who had done it.I'm not going into any spoiler details but it is superbly written with so many red herrings and false clues. So so well done. Maybe a third time, but give me a few years.My 2017 Review 4 starsWhere to start, well I saw a few other people wanted to read this as a Buddy read, so whilst on a Miss Marple kick (challenge) I thought why not. I cannot remember ever having read this or even seeing it as a TV adaptation and did not guess the ending until right at the very end.The central characters of Dr Sheppard and his sister Caroline are excellent, with the Dr playing the Hastings role for Poirot. I think the story is well constructed with many twists and turns, and overall generally good (i've given it 4 stars), I was just a little sad at the end. Read it and find out."}, {"userName": "Hajar", "userReviewDate": "Oct 17, 2016", "userURL": "http://www.goodreads.com/user/show/60671127-hajar", "userReview": "Dear Agatha Christie,You tricked my mind with style and I love you for it!xxTerrific, outstanding, spectacular, and everything in between…What can I say about this book that hasn’t already been said? It’s brilliant, simply and utterly brilliant!This book is the reason why Agatha Christie’s my all time favourite writer.At 4am, I found myself feverishly flipping through the pages, trying to get to the bottom of the mystery, which I only figured out towards the end of the book. This unputdownable masterpiece unravelled with a bang and there it was, the truth, the whole truth, and nothing but the truth. It was there all along and yet I missed it.If you’re into mysteries and haven’t read this book yet, do it. I promise you’ll not regret it!!This review can also be found on my blog."}, {"userName": "Ebookwormy1", "userReviewDate": "Mar 20, 2008", "userURL": "http://www.goodreads.com/user/show/1005834-ebookwormy1", "userReview": "Just finished a re-read of this classic. I remember the first time I read it, the twist at the end knocked my socks off! My second thought was: \"Agatha Christie understands evil in a way that is a little frightening!\"This time through, I remembered how it turns out (which is not always the case!), and was able to watch the clues with the murderer in mind. An astonishingly masterful piece of work.When it was first published, in 1926, this book caused quite a stir, because no one had ever used this twist before. People were shocked! and some were offended! After you have read the book, you can read about it's reception on the Wikipedia page devoted to it, but there are numerous spoilers, so don't check it out until you are 'in the know':http://en.wikipedia.org/wiki/The_Murd...Many consider this novel to be Agatha Christie's best, though I have also heard many votes for \"And then there were none\" (Originally published as \"Ten Little Indians\"). My feeling is that Agatha Christie is so good, it won't hurt to read both. My personal preference is for this book, \"The Murder of Roger Ackroyd\" because I prefer the twist at the end - the surprise is excellent -- over the puzzle to be solved as in Ten Little Indians.My other Christie recommendation is the unChristie, Christie, Endless Night.Endless Night, Christie, 1967https://www.goodreads.com/review/show...And then there were None, Christie, 1939https://www.goodreads.com/review/show..."}, {"userName": "Sanjay Gautam", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/10179929-sanjay-gautam", "userReview": "A mystery that lasts till the last page and ends with an unprecedented plot twist.One of the favorite books that I read in 2015. Nothing much can be said about the story or plot, or anything for that matter, without dropping a major spoiler. But trust me, it's bloody clever. Agatha Christie will leave you dazzled. One of her finest.Highly Recommended!"}, {"userName": "Bill  Kerwin", "userReviewDate": "Jun 15, 2007", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "This Hercule Poirot is a genuine tour de force, a classic of the genre, for a very good reason that you will understand perfectly as soon as you have finish reading it."}, {"userName": "mark monday", "userReviewDate": "Dec 08, 2010", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "Choose Your Own Adventure!You are a country doctor living in a cozy English village - and your friend has been murdered! Suspects abound. Whispers and secrets and dastardly blackmail surround you. Your sister prattles on. The situation becomes increasingly aggravating and even worse, your nosy and very foreign neighbor decides to make your private business his own. His bizarre Belgian behavior soon becomes quite intolerable. Whatever is a country doctor to do?If you decide to take a nice long trip to ease your mind, choose http://www.goodreads.com/review/show/...If you decide to visit relatives in your sprawling country manor, choose http://www.goodreads.com/review/show/..."}, {"userName": "Erin", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "5 bloody brilliant stars Number #9 in my Agatha Christie Challenge this year.  The Murder of Roger Ackroyd definitely my favorite Hercule Poiriot mystery(so far). Agatha Christie once again leads readers to a small English community where EVERYONE has a motive and open windows and locked doors make this the kind of mystery that needs our favorite Belgian detective. Our story is narrated by local doctor, Dr. James Sheppard who lives next to Poiriot and soon finds himself as the Watson to the Belgian's Holmes. I do believe that A.C. might just have created my favorite literary character cast as I found each of them utterly delightful. Although Caroline Sheppard is perhaps my favorite! Highly recommended!"}, {"userName": "Poonam", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/17656456-poonam", "userReview": "Soo, I have heard a lot of wonderful things about this book and about this great ending. I am a huge fan of Agatha Christie stories and they are the \"Perfect\" cozy mysteries for me. Whenever I read a cozy mystery, I end up comparing it to Christie novels.\nMy personal favorites are And Then There Were None , Murder on the Orient Express. If you haven't read these, go ahead and give them a try.\nSo as this book is counted in top 1000 mystery books, I definitely wanted to be ahead of Christie or should I say Poirot and solve this one on my own. I started this book with determined air and put on my thinking cap with vigor.Was I able to guess the ending? No chance in hell. There were few smaller mysteries along the way and some of them I was able to guess correctly.I had a lot of theories and suspicions for the main ending but none of them came to be true. Around 90% of the book, things started falling into place and my heart started beating faster. The beauty of the ending is, it's all very simple and left meIf you have read this one, were you able to guess the ending well in advance?"}, {"userName": "Abdelrahman fathy", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/54294419-abdelrahman-fathy", "userReview": "ما هذا بحق السماء ؟؟!!!!مما خلقت تلك الأجاثا !!!! حسنا أصدقاء الجودريدز أنا هُزمت :D ..لا بل هزيمة منكرة والله :D ..شيء مؤسف أن تضيع كل المجهودات هباءا منثورا .. ولكن من ذا الذي يتحدي تلك السيدة !! يجب أن تعلم وانت تقرأ لأجاثا انك كلما اقتربت من الحقيقة التي نسجتها مخيلتك ..فانت تحت تنويم مغناطيسي من مس كريستي..هي التي توهمك بأنك عبقري وستتوصل للحل بذكائك الفذ :D ثم ماذا ! ثم تصفعك علي وجهك بالنهايه . لتغدو أحمق من جديد نعم مثلي تمام :D ..انا من هؤلاء الذين أسرفوا طفولتهم في مشاهدة حلقات وأجزاء المحقق كونان (المُدبلجة)..لطالما استمتعت بالتحليل المنطقي للاحداث وكشف القاتل بالنهايه.. شعور الغباء جميل بحق :D ! علي العموم لا أدري ما يقال في شيء كتب من ثمانين عاما بتلك الكيفية !! لا أدري والله :) اذا لننسحب في هدوء ونضع تلك النجمات الخمسة ونلتزم الصمت .:D الي اللقاء في صدمة جديدة يا شباب.. وحسبي الله ونعم الوكيل :D :\"D : .."}, {"userName": "Nikoleta", "userReviewDate": "Feb 13, 2016", "userURL": "http://www.goodreads.com/user/show/13362307-nikoleta", "userReview": "Η αλήθεια είναι πως έχω συναντηθεί με την Αγκάθα Κρίστι και στο παρελθόν, αλλά μπορώ να πω, πως μόνο αυτές τις ημέρες την γνώρισα. Ο λόγος είναι ότι όταν την διάβασα στην προεφηβεία, το τελευταίο πράγμα που είχα στο μυαλό μου είναι να λύνω φόνους. Και έτσι στο πέρασμα του χρόνου την λησμόνησα και την περιφρόνησα. Όταν πριν λίγες μέρες έπεσε στα χέρια μου ένα βιβλίο της και δέχτηκα να το διαβάσω, έπαθα πλάκα. Η Κρίστι είναι σαν την ηρωίνη, έτσι και πέσεις σε ένα βιβλίο της θα θες κι άλλο. Δεν το λέω με υπερβολή, είναι άκρως εθιστική. Οι ιστορίες της δεν είναι αυτό που περίμενα, είναι πρωτότυπες, διαφορετική η μια από την άλλη, κι ας αφορούν όλες εξιχνίαση εγκλημάτων, με ποικιλία, χωρίς περιττές φλυαρίες, με έντονη αγωνία, έξυπνο χιουμοράκι και υποθέσεις εξαιρετικά δύσκολες στην εξιχνίαση τους. Έχω να πω δε, ότι το Ποιος σκότωσε τον Ρότζερ Ακρόυντ είναι το καλύτερο από όσα έχω διαβάσει έως τώρα, είναι απλώς εξαιρετικό!!! Ειλικρινά θεωρώ ότι παρόλο που έχουν περάσει γενεές ολόκληρες από τότε που γράφτηκαν αυτά τα βιβλία, σε καμία περίπτωση δεν είναι ξεπερασμένα. Όσα αστυνομικά και αν έχουν γραφτεί από τότε, αυτά θα παραμένουν αξεπέραστα και δύσκολα στην επίλυση τους, ενώ οι ατάκες της Αγκάθα θα συνεχίζουν να έχουν την ίδια ζωηράδα που είχαν και τότε.Τα αδίκησα, και καλά να πάθω που τόσα χρόνια δεν τα άγγιζα. Ένα έχω να πω ακόμα, όσοι θεωρείτε την Αγκάθα μπανάλ κ ξεπερασμένη, σας προκαλώ! Πάρτε στα χέρια σας τον Ακρόυντ και αν μπορείτε βρείτε τον δολοφόνο!"}, {"userName": "Richard Derus", "userReviewDate": "Jul 06, 2014", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Rating: 4* of five **THIS REVIEW IS FOR THE AGATHA CHRISTIE'S POIROT EPISODE AS WELL AS THE BOOK**The Publisher Says: In the village of King's Abbot, a widow's sudden suicide sparks rumors that she murdered her first husband, was being blackmailed, and was carrying on a secret affair with the wealthy Roger Ackroyd. The following evening, Ackroyd is murdered in his locked study--but not before receiving a letter identifying the widow's blackmailer. King's Abbot is crawling with suspects, including a nervous butler, Ackroyd's wayward stepson, and his sister-in-law, Mrs. Cecil Ackroyd, who has taken up residence in the victim's home. It's now up to the famous detective Hercule Poirot, who has retired to King's Abbot to garden, to solve the case of who killed Roger Ackroyd--a task in which he is aided by the village doctor and narrator, James Sheppard, and by Sheppard's ingenious sister, Caroline.The Murder of Roger Ackroyd is the book that made Agatha Christie a household name and launched her career as a perennial bestseller. Originally published in 1926, it is a landmark in the mystery genre. It was in the vanguard of a new class of popular detective fiction that ushered in the modern era of mystery novels.My Review: Undoubtedly the most famous novel written by Dame Agatha. It is well-known even among non-mystery readers, poor benighted sods, and has been cited by scholars as a turning point in the history of the mystery genre as a literary force. An English professor, [[Pierre Bayard]], has even delved deeply into the text to propose, from the book that Dame Agatha wrote, an alternative (and very interesting) ending!I'm not going to spoiler the ending's Big Twist because the ten or twelve literate-in-English people who have never read it will come screaming in from the Internet to call me unpleasant names, and I'm done with that. It is indeed a Big Twist, it makes the entire experience of the book far more interesting than it otherwise would be, and it's just flat fun to come to, that first time, all unknowing.So that said, when I first read this novel in 1973, I was all unknowing and was I gobsmacked! My oldest sister had a copy of it in her house, where I was visiting her, and she was deriving major amusement from my responses as the pages turned. It was a great way to spend a summer weekend.Then after what, maybe 35 years, they make a Poirot TV episode out of the story. The vast bulk of you, having read the book, are now looking bemused, befuddled, or annoyed. How, you're asking yourself, can the Big Twist be preserved? How can the essential frisson-granting narrative device translate onto film, for pity's sake?!Not all that well.It's still a stylish and entertaining film, and I liked watching it, but it was NOT the equal of the book. For one thing, Inspector Japp appears out of nowhere and assumes his usual role as Poirot's foil-cum-sidekick. WTF? I screamed at the screen, WTF IS THIS HOOPLA?! (I used a dirtier word, but I am attempting to portray myself as a sweet and mild-mannered old man.) (Stop laughing.) Japp appeareth not in the novel! Not even close. It is but one of many shifts required to bring the story to the screen.And for the only time in the entire history of the series Agatha Christie's Poirot, I wished they had just left the book alone and unfilmed. So why four stars? Because the book is five, and the film is three. Do the math. But don't bother with the show unless you're a completist.\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License."}, {"userName": "Sherif Metwaly", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/24529830-sherif-metwaly", "userReview": "صفحة 327 كان رد فعلي زي الصورة اللي تحت دي حرفيًا وعارف إني مش لوحدي اللي عملت كدة :D الصراحة أنا معرفش الناس بتكتب ايه في ريفيوهاتها عن روايات أجاثا، معرفش ايه اللي ممكن يتقال يعني!، دي واحدة شغلتها إنها \" تغفّلنا \" يا جماعة كل مرة وتطلّعنا محدودي الذكاء والبصيرة، اللي هو كل ما نقرأ لها رواية بندرك قد ايه الست دي كانت عبقرية وقد إيه إحنا ولا حاجة لمؤاخذة و أن أي حد ماشي في الشارع ممكن يدينا على قفانا الصراحة، وبعد أن ننتهي من قراءة رواية لها منبلاقيش حاجة نعملها غير إننا نيجي هنا عالجودريدزعشان نواسي بعضنا على التغفيلة اللي لبسناها كلنا :Dالله يسامحك يا أجاثا أنتِ وبواروده أنا خلايا مخي الرمادية عايزة تتبني من جديد :D تمت"}, {"userName": "Josu Grilli", "userReviewDate": "Jul 25, 2015", "userURL": "http://www.goodreads.com/user/show/4322616-josu-grilli", "userReview": "Leída en dos sentadas, es una de las novelas de misterio que más me han gustado. La verdad es que no es un género que lea normalmente, pero sí que me va conquistando poco a poco, y creo que es la novela justa para hacer que me enamore del género y continúe con él durante más tiempo.A Agatha Christie tan solo la había catado con Diez negritos, y pese a gustarme, eché en falta un final que cambiase completamente la historia. Y El asesinato de Roger Ackroyd lo ha conseguido. Cada detalle está medido, cada personaje (y hay muchos) tienen sus motivos, cada capítulo el sospechoso cambia. La cantidad de giros que hay en la trama es impresionante, pero el último es el que definitivamente te deja con la boca abierta. ¡Aunque en realidad estaba tan claro! Me ha encantado el personaje de Hercule Poirot, y ahora entiendo su fama: es maravilloso. Su manera de desmenuzar el caso, con ese aura constante de misterio, hace que no puedas dejar de leer la novela.En serio, menuda autora. Tiene un estilo increíble, cuidado, lleno de recursos y con una narración realmente ágil que no aburre en ningún momento. Está claro que voy a seguir leyendo novelas de esta mujer. El problema es que tiene TANTAS que es complicado decidir con cuál seguir. ¡Brava, Christie, brava!"}, {"userName": "Kat Kennedy", "userReviewDate": "Oct 30, 2010", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "She got me! That cheeky beeotch! She got me!"}, {"userName": "PattyMacDotComma", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/1128612-pattymacdotcomma", "userReview": "4★“Caroline can do any amount of finding out by sitting placidly at home. I don't know how she manages it, but there it is. I suspect that the servants and the tradesmen constitute her Intelligence Corps. When she goes out, it is not to gather information, but to spread it. At that, too, she is amazingly expert.”Caroline Shepphard is the older, spinster sister of our narrator, Dr Shepphard. She lives with him in a small village where he's the local country doctor (so knows everyone), and she has discovered that their new next-door neighbour is an interesting fellow, Mr. Porrot. Dr Shepphard deduces that the neighbour’s large mustache identifies him as a retired hairdresser, but Caroline insists that hairdressers all have wavy hair. See, she’s quite the detective, isn’t she? So is he, for that matter.We readers chuckle, because we recognise M. Poirot, the famous Belgian detective immediately. However, he’s retired, it seems, and hasn’t bothered to correct his name amongst the villagers, choosing a quiet, anonymous life.In typical Christie fashion, there is a suspicious death followed almost immediately by murder most foul with a specific cast of characters and a few connected outsiders. All of the characters are introduced to us early, so there are no annoying surprises when a perpetrator jumps out at the last moment. But for me, the ending was certainly a surprise!I saw all the details, and I had a few theories as more evidence came to light, but no way could I have beaten M. Poirot to the conclusion. I enjoy Christie’s humour. About Shepphard’s nosy, gossipy sister again:“Caroline was at home. She had had a visit from Poirot and was very pleased and important about it. ‘I am helping him with the case,’ she explained. I felt rather uneasy. Caroline is bad enough as it is. What will she be like with her detective instincts encouraged?”When Roger Ackroyd’s niece Flora discovers that M. Poirot is in the neighbourhood, she prevails upon the Shepphards to help her convince him to investigate her uncle’s murder. The finger of suspicion is pointing strongly to Flora’s fiancé, Ralph Paton, the adopted stepson of the victim., and she hopes Poirot will discover that he isn’t guilty.“‘Of course he didn't do it,’ said Caroline, who had been keeping silent with great difficulty. ‘Ralph may be extravagant, but he's a dear boy, and has the nicest manners.’I wanted to tell Caroline that large numbers of murderers have had nice manners, but the presence of Flora restrained me.”Poirot agrees, of course, and nominates Dr. Shepphard as his chosen companion in the investigation, so that’s how we see the story unfold, through Dr. Shepphard’s telling. I also enjoy Christie’s examples of Poirot’s speech patterns. Even if you don’t know French, you would understand Poirot is doing some literal translating here and there into English.\"‘I thank you, no,’ said Poirot, rising. ‘All my excuses for having deranged you.’‘Not at all, not at all.’ [Poirot and Shepphard leave.]‘The word derange,’ I remarked, when we were outside again, ‘is applicable to mental disorder only.’'Ah!’ cried Poirot, ‘never will my English be quite perfect. A curious language. I should then have said disarranged, n'est ce pas?’‘Disturbed is the word you had in mind.’‘I thank you, my friend. The word exact, you are zealous for it.’”Ah such fun, watching the little Belgian detective at work. This is near the end of the story and gives nothing away, except to show it is quintessential Christie/Poirot style.\"‘The number is complete', said Poirot. ‘Everyone is here.’ There was a ring of satisfaction in his tone. And with the sound of it I saw a ripple of something like uneasiness pass over all those faces grouped at the other end of the room. There was a suggestion in all this as of a trap—a trap that had closed.”This can be read as a stand-alone mystery. You don’t need to have read any previous Poirot stories to enjoy this. We learn early on that he is famous and admired and sought-after. I would add only, so is the author!)p.s. You can borrow this and other books, particularly old ones, from the Open Library as well as Gutenberg. https://openlibrary.org/"}, {"userName": "Lawyer", "userReviewDate": "Dec 09, 2009", "userURL": "http://www.goodreads.com/user/show/3025547-lawyer", "userReview": "The Murder of Roger Ackroyd: Something Hidden \n\"The truth, however ugly in itself, is always curious and beautiful to the seeker after it.\"-Hercule Poirot\nHercule Poirot appears for the third time in a novel. Remarkably, after only two novels, The Mysterious Affair at Styles, and The Murder on the Links, we find that Poirot has retired and taken a house, The Larches, in the fictional village of King's Abbot, near the home of his friend Roger Ackroyd.Unlike the previous Poirot outings, the narrator of this tale is village physician John Sheppard. Where is Hastings? Why, married and off to the Argentine. The happy event occurs in Christie's first anthology, Poirot Investigates.Every Holmes must have his Watson. Dr. Sheppard fills the role here.Poor Ackroyd. He loved Mrs. Ferrars, rumored to have murdered her abusive and drunken husband. Poor Mrs. Ferrars, who would have become Mrs. Ackroyd as soon as her period of mourning was over, is being blackmailed.Tested beyond her emotional and financial limits, commits suicide. An overdose of sleeping draughts, Veronal. Ackroyd is set on bringing the person he holds responsible for his love's death be discovered and brought to justice.However, before Ackroyd achieves his wish, someone stabbed him in the back with a dagger from his own home, always displayed in a glass top table. It is gone. Of course, it is. It is most definitely in Ackroy's back.The game is afoot when Ackroyd's niece Flora approaches Poirot to ask him find out who killed Roger Rabbit. I mean Ackroyd. Ahem.Poirot takes the case. No matter wherever the truth lies. That will be quite painful. For all the evidence points to Ackroyd's step son, RalphPaton. Ah. Paton is engaged to Flora Ackroyd.However, suspects abound. There is Parker, the butler. Raymond, Ackroyd's efficient male secretary, who's lost a bit on the ponies. Blunt, the big game hunter, whose reputation is built on his renown as a big game hunter, who is certainly in love with Flora who is pledged to Paton. The parlor maid, Ursula Bourne, dismissed from her position after a heated argument the afternoon before he was killed. Miss Russell, the mysterious head housekeeper.We have the suspects. Each had a motive.Poirot tells Sheppard that cases of this type all have one thing in common. Everyone has something they want to hide.But all eyes focus on Ralph Paton. He was staying in King Abbot, but at the Three Boars Inn, not his stepfather's house. He fled the village leaving his clothing and luggage th nightAckroyd was killed. If he's innocent, why doesn't he come forward?As Poirot puts his little grey cells to work, he will put the pieces together. This novel pays off in the reveal. The identity of the killer was stunning. Everything clicks in the last twelve pages.Poirot knows who killed Roger Ackroyd. He will take the truth to the Inspector in the morning. A mere ploy to get the real murderer to confess? Ah, an intelligent idea, but what will you think of it all should you solve the mystery?What Christie achieved in this novel may not seem so original to us today. Perhaps we have become jaded and think Agatha Christie unimaginative and her books are ready for the Dust bin. But, no. That is not the case.From Wiki:\nIn 1990, The Murder of Roger Ackroyd came in at fifth place in The Top 100 Crime Novels of All Time, a ranking by the members (all crime writers) of the Crime Writers' Association in Britain. A similar ranking was made in 1995 by the Mystery Writers of America, putting this novel in twelfth place. In 2013, the Crime Writers' Association voted this novel as CWA Best Ever Novel.[3] The 600 members of CWA said it was \"the finest example of the genre ever penned.\" It is a cornerstone of crime fiction, which \"contains one of the most celebrated plot twists in crime writing history.\" The poll taken on the 60th anniversary of CWA also honored Agatha Christie as the best crime novel author ever.\nThis is a must read if you have any curiosity in how the writing of crime and mystery novels came to be."}, {"userName": "Sidharth Vardhan", "userReviewDate": "Aug 04, 2016", "userURL": "http://www.goodreads.com/user/show/58296635-sidharth-vardhan", "userReview": "I guessed the murderer!"}, {"userName": "Bắp", "userReviewDate": "Apr 06, 2016", "userURL": "http://www.goodreads.com/user/show/43605909-b-p", "userReview": "Thực tế thì vài tháng gần đây mình không mua sách của NXB Trẻ để coi như 1 sự phản đối nho nhỏ (và tất nhiên là trong vô vọng) đối với loại giấy xốp mà họ đang sử dụng để in. Đó là 1 loại giấy rất đau thương :| Nhưng cuối cùng vẫn ko kìm đc cõi lòng lúc chọn để được tặng cuốn này khi trúng giải của 1 trò review dạo linh tinh trên fb :3 Với sự thiếu kiên trung ấy thì có lẽ mình không thể làm 1 chiến sỹ cách mạng đc :))Mình thấy nhiều người bảo truyện của Agatha cứ tẻ tẻ sao ấy, điều này có thể do nhiều lý do. Lý do tiêu biểu chắc là tại bạn mê kiểu trinh thám phải có đầy rẫy những pha hành động giật gân, ly kỳ, gay cấn. Với lý do này thì bạn có thể chuyển sang đọc truyện của David Baldacci, Lee Child hoặc xem phim anh Deadpool nhây và lầy hoặc khăn gói quả mướp lên sân bay Tân Sơn Nhất rình xem có vụ choảng nhau nào đó giữa mấy a xe ôm \"làng\" (đã được bảo kê và đã mất tiền bảo kê) với các a Grabbike. Mũ bảo hiểm chuẩn hợp quy CR mà cầm để nện vào đầu nhau thì rất thích và vừa tay. Mức độ sát thương chắc cũng ngang ngửa việc bị Cân Bằng Mong Manh hay Suối Nguồn rơi vào đầu từ độ cao tương đương với tầng 3 xuống :vCuốn này gần như chỉ có thoại thôi, không có gì khác đâu, thoại everywhere. Nhưng việc chỉ dùng thoại để lần giở các đầu mối, để miêu tả tâm lý thậm chí để tung hỏa mù đối với người đọc...qua tới hơn 350 trang chi chít chữ cũng chứng tỏ \"nội công\" của tác giả không hề tầm thường. Viết đến đây tự dưng lại nhớ tới thuyết âm mưu mà mình từng đặt ra hồi trẻ trâu, đấy là Agatha thực chất ko phải là phụ nữ mà là...đàn ông giả dạng, soi chiếu vs những bà hàng xóm xung quanh thì mình thấy phụ nữ rất khó có thể thành công trong việc viết truyện trinh thám vì họ hay buôn dưa lê, không thể kín miệng giữ tên hung thủ cho đến phút chót =))Tất nhiên, vẫn như mọi lần, bà ấy vẫn giữ được tới phút chót - 1 phút chót cực kỳ bất ngờ :)). Trước khi đọc cuốn này mình có đọc vài review ko có spoil. Điểm chung của các review này chính là cụm từ \"cực kỳ bất ngờ\" đấy. Sau khi đi được khoảng 1/2 cuốn sách, với cái tâm thế \"là kiểu gì cũng có bất ngờ\" thì mình nghĩ hung thủ là nhân vật X đó thì chắc chắn sẽ bất ngờ nhất - mặc dù đó là 1 sự tưởng tượng có phần... ko tưởng ở thời điểm đó, xét theo những gì câu chuyện đã phô bày. Chính mình cũng đã cười khằng khặc khi đặt ra giả thuyết này, nó hơi nhiều mùi \"sữa Fristi\" :)) tuy nhiên cuối cùng khi cái kết mở ra...Nói chung fan trinh thám và đặc biệt fan trinh thám cổ điển khônh thể bỏ qua cuốn này. Trinh thám cổ điển rất đơn giản và...cổ điển. Chỉ cần 1 cái xác, 1 vị thám tử tài ba, những động cơ mờ ám, những nghi ngờ bủa vây và những trò lừa không tưởng. Vậy là đủ. Giật gân đâu phải chỉ đến từ những pha hành động :v 1 plot twist choáng váng cũng là 1 cách để \"chơi đùa\" vs sự giật gân, phỏng ạ :3Kết luận đúc rút đc từ cuốn sách : mọi rắc rối trên đời phần lớn đều do tiền hoặc thiếu tiền mà ra. Để giải quyết vấn đề này thì phải làm giàu hoặc lấy chồng giàu. Nếu bạn không thể lấy chồng giàu vì 1 số lý do về giới tính, vd như bạn là đực rựa chẳng hạn, thì yên tâm, giờ là thời đại nào rồi, giới tính chắc chắn là cố định nhưng sử dụng thì có thể linh hoạt :vP/s : mới đọc đc trên 1 bài báo nói tên của thám tử Poirot xếp thứ 6 trong danh sách những nhân vật văn học thường bị đọc sai tên. Nghe ngta giải đáp cách phát âm xong, hóa ra mình cũng nằm trong số đó :v"}, {"userName": "Mohammed  Ali", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/48402276-mohammed-ali", "userReview": "سأكتفي بجملة واحدة تلخص هذه الرواية بأكملها..من الذي قتل السيد روجر أكرويد ؟"}, {"userName": "Erin ☕ *Proud Book Hoarder*", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/3048260-erin-proud-book-hoarder", "userReview": "“The things young women read nowadays and profess to enjoy positively frighten me.” It's kind of funny that I read Agatha Christie for years and didn't know until a few years back that this was one of her most famous books. I'd heard of the others, but this always fell under my radar until this year. Now that I've read it, does it deserve it's rep? I have to say yes, yes it does. I was starting to suspect the ending turn-out, but it was still done in such a delightful and clever away that pre-guessing this take away from my enjoyment of the mystery.Featuring my favorite detective, the great and egotistical Hercule Poirot, we see different sides of him here. First as a neighbor who has an accident with gardening, then a loyal friend, then an intervening detective with an ironic twist at the end. What makes it different though as Hercule doesn't narrate this story at all, and he's only a side character. The real main character is the narrator, Dr. Sheppard. Some of her books did this before with Hercule being seen through another's eyes, but in those cases it was usually his sidekick Hastings.Usually this would bug me since I love when Poirot narrates the story but it worked in this case for other reasons. Sometimes Agatha indulges in a surprising amount of politically incorrect humor in her stories too, especially when it comes to funny hang-ups people have about race, but in this case she spends a lot of time with outright humor involving the doctor and what he has to put up with concerning his nosy sister. The humor helped the story and there seemed to be a deeper connection with some of the characters compared to other Agatha books. Sometimes she focuses on the plot so much that the characters blend together a bit, with exceptions, and this is one of the exceptions. Well done.A locked-room type of mystery, I didn't guess everything involved, but I did guess the culprit (kind-of). Still who cares because it still rocked, and I loved the twist at the end with Poirot's delivering line and what he wants done once the crime has been solved. There is more in store here than just surprise of who did it, but also what's going to be done after the fact and the motive behind it all in the first place.I'll join other legions of fans in declaring this as one of my favorite Christie novels. Not my top favorite, but it's up there with the best."}, {"userName": "Wanda", "userReviewDate": "Apr 20, 2017", "userURL": "http://www.goodreads.com/user/show/9246169-wanda", "userReview": "M. Poirot, what were you thinking? Retiring to a small village to grow vegetable marrows? I too would hurl them in fits of regret! As if marrows could suitably engage those little grey cells!Excellent depiction of the competitive sport of gossip. Small communities everywhere suffer from it. That is one of the reasons that I came to live in a city—I can actually keep my private life relatively private! Dame Agatha really did set the patterns for current mystery literature, didn’t she? Very, very enjoyable and as usual, I had no idea who the perpetrator was until M. Poirot did the big reveal."}, {"userName": "Mashael Alamri", "userReviewDate": "Oct 13, 2008", "userURL": "http://www.goodreads.com/user/show/1071650-mashael-alamri", "userReview": "قررت ترتيب مكتبتي ( المخربطه ) فسحبت الرواية هذه وقلت في نفسي من زمان عن أغاثا كريستي (مع إني كنت مغرمه فيها ) جلست ع الأرض جنب المكتبه قلبت في الكتاب قليلاً وبعدين بديت أقراء لم أعيده إلا حينما عرفت من قتل (روجر أكرويد) فعلاً أغاثا عجيبه في الحبكات الكل متهم والكل لديه دوافع قتل التفاصيل الصغيره للجريمة تهتم بها الغوص داخل أعماق الشخصيات الحس الفكاهي اللذيذ الوصف الدقيق غير الممل للأماكن كل ذلك يجعل من روايات أغاثا كريستي أفلام على الورق :) إستمتعت وتمنيت لو أنني أقتني باقي روايات أغاثا كريستي التي لم يسبق لي قرآئتها ستضل أغاثا من أروع الكتاب في نظري مهما كبرت وتغيرت إهتماماتي في القرآئة :)"}, {"userName": "Yousra ", "userReviewDate": "Oct 08, 2016", "userURL": "http://www.goodreads.com/user/show/9548031-yousra", "userReview": "Wow!! :) Now I'm a big fan of Christie ^_^ I have an ear to ear smile of satisfaction :) ... that's a very wide smile indeed ^_^Christie fooled me I admit ... made me think of other suspects, so surely thinking it was one of them and I was just waiting for the moment when one of two is to be stated as the murderer ! And oopss!! It happened like this! This book was one of many of those I got upon my request as my birthday gift from my dear beloved husband and still there are some more to be read ... and I'm happy ^_^ And THANKS a million for my dear goodreads friend Sulaf for the recommendation and for encouraging me to read more novels in English ♡♡It took me sometime to read it because of school preparations and following my kids up with their new classes and school supplies and because of preparing for some other family events, so I wish I can read her other books in much less time."}], "description": "Roger Ackroyd was a man who knew too much.He knew the woman he loved had poisoned her first husband. He knew someone was blackmailing her ― and now he knew she had taken her own life with a drug overdose.Soon the evening post would let him know who the mystery blackmailer was. But Ackroyd was dead before he'd finished reading it ― stabbed through the neck where he sat in his study...", "title": "The Murder of Roger Ackroyd\n      \n          (Hercule Poirot #4)", "url": "http://www.goodreads.com/book/show/816080.The_Murder_of_Roger_Ackroyd", "average": 4.22, "cover": "https://images.gr-assets.com/books/1408925195l/816080.jpg", "reviews": 6319, "authors": [{"url": "https://www.goodreads.com/author/show/123715.Agatha_Christie", "name": "Agatha Christie"}], "type": ["Mystery", "Fiction", "Mystery", "Classics", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/816080.The_Murder_of_Roger_Ackroyd", "http://www.goodreads.com/book/show/16328.The_Murder_of_Roger_Ackroyd", "http://www.goodreads.com/book/show/13499449", "http://www.goodreads.com/book/show/6251566-the-murder-of-roger-ackroyd", "http://www.goodreads.com/book/show/21064438-the-murder-of-roger-ackroyd", "http://www.goodreads.com/book/show/5051141", "http://www.goodreads.com/book/show/994671.The_Murder_of_Roger_Ackroyd", "http://www.goodreads.com/book/show/26534008", "http://www.goodreads.com/book/show/23251107-el-asesinato-de-roger-ackroyd", "http://www.goodreads.com/book/show/652734.The_Murder_of_Roger_Ackroyd", "http://www.goodreads.com/book/show/28185377-v-m-s-t-ng-roger", "http://www.goodreads.com/book/show/16299.And_Then_There_Were_None", "http://www.goodreads.com/book/show/16343.The_Mysterious_Affair_at_Styles", "http://www.goodreads.com/book/show/853510.Murder_on_the_Orient_Express", "http://www.goodreads.com/book/show/16331.Murder_at_the_Vicarage", "http://www.goodreads.com/book/show/131359.Death_on_the_Nile"]}