{"ratings": 4428, "userreviews": [{"userName": "Olivia", "userReviewDate": "Feb 22, 2016", "userURL": "http://www.goodreads.com/user/show/43582060-olivia", "userReview": "There are some books that are amazing every time you read it. This is one of those. \"The Meeting Place\" is an example of why I've gotten so picky with the Christian fiction I read ;) I'm totally for description, and Janette Oke and T. Davis Bunn describe things so beauitfully. The story itself is unique. French and British young women meet in a meadow, and strike up a friendship. Despite the trouble between these two countries, the two women find common interests and when Louise needs help Catherine knows what she must do. I loved their husbands, Henri and Andrew. I've always loved reading things with the military, so Andrew's scenes especially interested me. I so felt for him when he had to make a hard decision that put his position in jeopardy.And the romance. It is so much deeper and real than a lot of books I read. I wouldn't hesitate giving this book to a younger teen. There is one kiss (after they are married), a few touches, but most of the book the two couples are married. Interwoven with the story and historical details, is a spiritual strain that is also deep. I just wanted to cry for Louise toward the end with everything that happened. Yet neither she, Catherine, or their husbands were angry at God. They trusted in Him even if they didn't understand everything that happened. One good Henri said was that it was man's fault that all the bad things were happening to them. He couldn't blame God. Oh, that was good!I highly, highly recommend this book. The fact that I've read it three or four times and loved it every time shows that it's a pretty good (well, don't you think?) ;)"}, {"userName": "Lindsey (Books for Christian Girls)", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/19266895-lindsey-books-for-christian-girls", "userReview": "About this book:“Set along the rugged coastline of 18th century Canada in what was then called Acadia (now Nova Scotia and New Brunswick), The Meeting Place re-creates a world that was home to native Indians, French settlers, and English garrisons. Such diverse populations did not live in accord, however. Instead, they were isolated within their own groups by a brewing political tension under the difficult English rule. Amid such chaotic times two women, both about to become brides and both trying to live lives of quiet peace, meet in a lush field of wildflowers. Louisa, a Frenchwoman, and Catherine, who is English, continue to meet secretly through the seasons, sharing both friendship and growing faith. The outside world does not mirror their own tranquil happiness, and the dreaded crackdown by the English throne threatens far more than their growing bond. In the face of a heart-wrenching dilemma, Louisa and Catherine strive to maintain their faith and cling to their dreams of family and home.”Series: Book #1 in the “Songs of Acadia” series. Spiritual Content- Matthew 5:9 at the beginning; Many, many Prayers; Many talks about the Bible & reading it; ‘H’s are capital when referring to God; Bible reading & many Scriptures are quoted or mentioned; Very, very strong Faiths!Negative Content- Eel hunting (semi-detailed; Yes, it’s a thing, call me naïve but I didn’t know that!); Blood (barely-above-not-detailed); Mentions of wars, fires & guns (barely-above-not-detailed); Mentions of killing and hanging (not-detailed). Sexual Content- A couple kisses between married couples (barely being barely-above-not-detailed); An urge to kiss someone; A mention of touching his wife’s hair (barely-above-not-detailed).-Catherine-Louise  P.O.V. switches between them, Andrew, Henri, & John (three times) Set in 1753-1755 281 pages~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*Pre Teens- One StarNew Teens- Two StarsEarly High School Teens- Three Stars (and a half)Older High School Teens- Five StarsMy personal Rating- Four StarsI’ll admit I really didn’t know much about the French Acadians or King George’s War before reading this book, so this was educational! This also was my first Janette Oke book! (Though I’ve been watching the “When Calls the Heart” series on Hallmark, #Hearties unite! ;D ) I was a little worried at first because of the married couple being the main characters, because most married couple books have a lot of Sexual hints...it gets awkward for us unmarried, young girls (and I would think those who are married, too, but I can’t speak for them) but Oh. My. Goodness. There was seriously nothing! Like, look at the Sexual Content! Can we get all “new” Christian authors to do like Janette Oke?! It was so refreshing with the super strong Faiths and lack of icky stuff! And another note: Eel hunting. Okay, what? It’s makes since I guess, but I've sure never thought about that before!Link to review:http://booksforchristiangirls.blogspo...*BFCG may (Read the review to see) recommend this book by this author. It does not mean I recommend all the books by this author."}, {"userName": "Traci", "userReviewDate": "Jun 11, 2012", "userURL": "http://www.goodreads.com/user/show/2345224-traci", "userReview": "[it speaks really loudly for me that the husbands not only supported the temporary baby swap, but Andrew was the one to suggest it to Catherine and Henri was actually the one to start acting like the baby Louise was carrying around was actually theirs. I can understand the mothers' points of view, how they would do anything for their children, even if it means they can't be with them, but for dads I think it's different. (hide spoiler)]"}, {"userName": "Victoria Minks", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/54251522-victoria-minks", "userReview": "I haven't read many of Janette Oke and what I have read was more for younger children in years past. I started reading this just to see if I liked it or not, not really sure what I was expecting. At first, the writing was kind of slow, I thought. It was hard for me to focus on the story in the beginning, especially through a lot of the uber-poetic descriptions. I'm a character-oriented person and tend to enjoy punchier and shorter descriptions, so I was having a little bit of a hard time getting through the beginning. Let me say-- the descriptions are beautiful. Some people will absolutely love this element of the book-- and I definitely did once I understood the characters better. But it took me a while to really connect with the characters and so the descriptions in the first part seemed a bit tedious to me. But once I grew close to the characters--wow! I LOVED it! I loved the relationships and the personalities. Yes, sometimes the characters were almost too similar but I forgave that because it ties into the plot nicely. ;) My favorite character was Eli, and he's not even a main character. (He just grabbed my attention as soon as he appeared, lol...please don't die in the sequel, Eli...) I also really liked Henri. His character just really grew on me. I appreciated that the romance was not mushy, was between married couples, and was clean and unsensationalized, and I also really liked Catherine's attitude towards her husband-- her and Andrew's relationship was strong and I thought a good example. The plot is fairly quiet the first half of the book but then it gets interesting...and definitely plays on your emotions. I have a bad habit of \"acting\" out things as I read it with some books and I accidentally started doing that in the last few chapters of this book and ended up crying in a parking garage. (Just ignore me, people...)It's definitely one I'd say have the next book handy to pick up as soon as you can. ;) Thankfully my friend gave me the sequel too, lol. I almost minus-ed off half a star for the slow/descriptive beginning without feeling a strong interest/connection with the characters but decided against it. I liked it so much once I did get involved in the book that it makes up for it...and almost, if you ask me, makes the tension of the last half all the more real. Read it. ;)"}, {"userName": "Ron", "userReviewDate": "Dec 04, 2013", "userURL": "http://www.goodreads.com/user/show/1256262-ron", "userReview": "[Historical errors abound: Fort Edward was just four years old when the story opens, not seventy as Oke reports. Likewise, Louisburg was already in England hands. Muttonchop sideburns were almost a century in the future. (hide spoiler)]"}, {"userName": "Anna", "userReviewDate": "May 29, 2014", "userURL": "http://www.goodreads.com/user/show/30625888-anna", "userReview": "I couldn't finish this book - the only one I've read by Janette Oke that I didn't really care for. I had some trouble keeping the characters straight, and the historical/political context of the book confused me even more. I finally gave up on this one."}, {"userName": "Celeste", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/55866512-celeste", "userReview": "4.5Man... I'm crying. This book was a pleasant, quick, and thoroughly addicting read. I don't really know what more I can say without getting into spoilers so I guess that I'll leave it there for now!"}, {"userName": "paperdollmom", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/13228718-paperdollmom", "userReview": "This was a favorite book of mine for many years. I love the characters in the book, and how well they were developed. I was unaware of this part of history, and what had happened to the Acadians prior to this book, and I think this book really helps one to understand how hard that time must have been for those people. I have read the other books in the series, and think all of them deserve 5 stars. These books are definitely keepers! To comment on other reviews that keep comparing this book to other Oke books, it is good to keep in mind that this book was co-written with T. Davis Bunn. T. Davis Bunn also has written a continuation of this series with his wife. The writing style is much different than Oke's other books...but I personally think this one shines above the rest!"}, {"userName": "Wen", "userReviewDate": "Oct 10, 2009", "userURL": "http://www.goodreads.com/user/show/2230868-wen", "userReview": "I really liked this book. Sweet story of 2 women from different town and cultures forming a very close bond. It is set with early American settlers. One town English and the other French. The conflicts between make their friendship harder to have but stronger because of it all. The big question of what happened to them and their families at the very end make you want to reach for book 2 in the series right away."}, {"userName": "Amy", "userReviewDate": "Aug 21, 2009", "userURL": "http://www.goodreads.com/user/show/1612382-amy", "userReview": "I enjoyed the characters of the story and the storyline. I felt that it was slow and hard to get into, although it picked up much more at the end. I also wish there had been more detail as to the conflict between the British and French going on during that time period. I was not familiar with the history, and so the storyline did not impact me as much. I am going to read the sequel though, because I have to find out what happens next!"}, {"userName": "Hosanna", "userReviewDate": "Jun 09, 2015", "userURL": "http://www.goodreads.com/user/show/43814784-hosanna", "userReview": "This is a great, Christian book for teen, or adult, girls. It shows how everyone, not matter the nationality, is equal and capable of being a friend and an encouragement. It is captivating from the beginning to end, and I didn't want to put it down! It also forces you to read the rest of the series, ending on an amazing cliff-hanger. :) I really want to read the rest of the series!"}, {"userName": "LanaDwire", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/63403470-lanadwire", "userReview": "It was hard to put this book down. I just wish it didn't leave me hanging at the end."}, {"userName": "Christa", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/51417352-christa", "userReview": "I really enjoyed how this story was so focused on friendship! I'm used to books that are about couples falling in love it's nice to read something different. I was never board during this book, that said it was a pretty short book haha but I really loved the storyline and reading about a Canadian history! Sometimes I feel like I give too many books 5 stars but I just really enjoyed this one! I cannot wait to read the next in the series!"}, {"userName": "Sarah", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/40147342-sarah", "userReview": "In the place we now call Canada, descendents of French and English settlers live separate but peaceful lives. Their villages exist side by side, yet they keep no contact because of centuries-old hostilities between their old homelands. Across the Atlantic, England and France are fighting again. The British governing forces in Acadia are forcing the French-descended Acadians to swear an oath to the King. The Acadians may be willing, had there not been a demand in the oath that they take up arms for the King. The Acadian people refuse to take up arms for France, why would they do it for England? Still, the British refuse to see that fact and view the Acadians as the cause of real or imagined problems. Into this atmosphere, an unlikely friendship is born. Catherine - a British woman - and Louise - an Acadian - meet one day in a meadow. Catherine speaks a little French, so they can communicate some. Their meetings are not frequent, not at first. But they slowly begin to grow closer. Catherine studies French again to speak better to Louise. They study the Bible together. Catherine even visits Louise's village.Catherine and her husband can see that the Acadians are not dangerous, nor are they an enemy. But sadly, no other British officials share their views. One day, it all comes to a head, as the Acadians are rounded up and sent off for other colonies - Louisiana, Charleston, New York, etc. Divided so that they can not come back together. In the midst, the unthinkable happens - children separated from their parents. Will the parents ever see their child again when they are a so far apart? I really enjoyed this story, so much so, that I read it almost in one sitting (I had a free evening). I liked how Catherine and Louise's friendship was portrayed. They seemingly have nothing in common, yet they discover that all their differences don't really matter. What bonds them most, although not the first thing, is reading the Bible together. God is what brings them the closest. They would do anything for one another, even though their heritages say they should be enemies. Another theme is that not all citizens or descendents of a certain heritage, culture, or country are enemies. The Acadians were French Huguenots (they were Protestant not Catholic) who wanted to live in peace. They so desired to be left alone, that they would not raise arms for their own \"mother country\"! Terrible things can happen when we create stereotypes and then shut our eyes to any outliers. Yes, stereotypes occur for a reason, and yes, they are usually accurate for most of a group, but, we cannot ever refuse to see that a stereotype is not all-inclusive. Sorry if I'm on soapbox here. I just liked how Oke and Bunn got across that idea without being preachy or political. It was very well done. Now I have to get the next book, because the ending was heart-wrenching!"}, {"userName": "David Gregory", "userReviewDate": "Aug 06, 2010", "userURL": "http://www.goodreads.com/user/show/4117178-david-gregory", "userReview": "This is the first book of a five book series coauthored by Janette Oke and T. Davis Bunn. The entire series is set in the tumultous era of pre-Revolutionary War days in early America, only in this instance the setting is in Acadia, more recenly Nova Scotia.The authors set a riveting tale of two families, one Enlish and the other French, only a few miles away from each other but never meeting or relating to each other, OTHER than a meadow high up in woods where two young girls, both engaged to be married, go to find wildflowers and smell the wonderful mountain air.The girls become good friends, thanks to the ability of the English girl to speak some French, and eventually their families find out, and both families are to a degree imperiled by the discovery.In due season both young married girls are with child and give birth also to baby girls. And when one of the infants develops a life threatening condition, the love of the other mother causes her to do a very self-sacrificing thing, which has very far reaching consequences. The entire series gave my and my wife a brand new understanding of both the horrors of war, especially the unwarranted hatred of the French by the English, but even more so of the conquering power of the love of God. It also gave us knowledge of a little known but highly importance and very dramatic event in the decades preceding the Revolutionary War. The above rating goes above the five starts, it is beyond excellent, as are all five books in this series, and there IS a second series."}, {"userName": "Casey", "userReviewDate": "Jan 27, 2010", "userURL": "http://www.goodreads.com/user/show/3194216-casey", "userReview": "It’s the third time I have picked up “The Meeting Place” by the talented duo of Bunn and Oke and it’s like I’ve never read it before. The story remains fresh and vibrant across the years since it was first published to just last night when I closed the cover on the final page.Every good story is about a relationship, a love story. Not a romance, but love. Love between friends, child and parent, a husband and wife, a love for country. “The Meeting Place” has this and so much more. I am always drawn in by the depth of research that must have gone into this book, the landscape becomes another character, especially the meadow where Louise and Catherine meet. The characters in their actions, their struggles and their determination against a time that must have felt every bit as uncertain as our own, makes them extremely endearing to me. Which I think is one of the reasons I love this book, it doesn’t matter that it was based three hundred years ago. It could have happened today and I can only hope to face such trials with the grace of the Robichauds and Harrows.It goes without saying that this book has more than impact, it has spirit, valor, heart wrenching moments, moments of forgiveness and crossing boundaries no one would have thought passable. It is a story that retains its freshness and beauty long after the final page has been turned. What else could you expect from such a talented writing team?"}, {"userName": "Rachel", "userReviewDate": "Aug 10, 2015", "userURL": "http://www.goodreads.com/user/show/7398985-rachel", "userReview": "“God's hand is on this journey.”  And so the series begins, a story of two young women from very different worlds. Catherine Price is the daughter of an English nobleman, yet Louise Belleveaue is a Frenchman's daughter in a local village. Their lives connect and change forever one spring day in a peaceful meadow – their special meeting place - far away from their nation's conflicts and the rumors of war... once so far away...now growing ever nearer to their beloved homeland of Acadia.  “It is your fears speaking, and these too you must turn over to God. Rely on His strength. Not on yours. He will see you through. Remember this when you feel attacked in the night by all that is beyond your control. Rely on God's strength. It will come one day, one moment, at a time. Just when you need it.” A beautiful story of faith, coming of age, marriage, love and friendship in the lives of two young women. I was encouaraged and inspired in so many ways. It touched so many memories of my own growing up years. The girls' budding faith and the difficult challenges they face along the way lightened my own burdens and gave courage for the challenges that I too face. It was the perfect book to read in this season of my life, and God used it to answer some of my own wondering questions. :) I would recommend to all, but I expect girls older than sixteen would enjoy this best."}, {"userName": "Jean", "userReviewDate": "Jan 11, 2016", "userURL": "http://www.goodreads.com/user/show/51408516-jean", "userReview": "The authors did a good job in their research of the east coast during the 1700's which is the time period this story is set in. There are French settlers who have been there for generations and they live in villages by themselves. The English haven't been there as long and have their own little settlements. Even though they might live just a few miles apart, the English and the French people do not usually meet. They each have feelings of hate against the other people which have come from generations of hatred. Some people from both groups sympathize with the other groups. One woman goes to a meadow that is kind of hard to get to. She is from an English settlement. While there, she runs into a woman from a French settlement. The French girl doesn't know english, but the English girl knows some french, so they are able to communicate a little bit. Their friendship grows from there, and the story is about what happens in both of their lives and with their friendship. It is a really well done story. It is worth reading. I didn't realize there are four other books in the series, so when I got to the end of this one, I was disappointed, as there things that weren't resolved. I was glad to find that the story does continue."}, {"userName": "Sue", "userReviewDate": "Apr 06, 2015", "userURL": "http://www.goodreads.com/user/show/830760-sue", "userReview": "‘The meeting place’ is the first in the five-book series ‘Song of Acadia’. It’s set in the 17th century, in ‘Acadia’ on the Canadian coast; England was at war with France, although there was an uneasy peace in the Acadian region. The novel features two women: one English, one French. They become friends and discover that despite their different backgrounds, they are at a similar stage in life. I liked the way that the story was told, from alternate points of view. A good picture is painted of these two women as we learn about their daily lives, their hopes and their fears. There’s some overt Christian content; but I didn’t find it too preachy, and it was mostly relevant to the story.As the book progresses, tension rises and there is some high drama towards the end which - to my disappointment - leaves the story unfinished, hanging in the air. I downloaded this book free for my kindle; presumably it was as a taster for the series, to tempt me to pay full price for the others. I’m not inclined to do that - yet I’m interested enough that I plan to look out for second-hand editions of the paperback versions.All in all, I’d recommend this - but be prepared to buy at least one sequel too."}, {"userName": "Peggy N", "userReviewDate": "Feb 28, 2014", "userURL": "http://www.goodreads.com/user/show/11967279-peggy-n", "userReview": "The Meeting Place is a story based during the English occupation of Nova Scotia and the subsequent exportation of all the French settlers out of Acadia as it was called. I looked forward to reading this as my husband has grown interested in the history and culture of the Cajun people in Louisiana. This book follows the lives of two very different young women, Louise who is French and Catherine who is not only English but the wife of an English officer. The two women met the day before their weddings as they married on the same day. They both had a secret place that they found gave them peace, but they found that they shared this place with a person that culture and the times said should be their enemy. The story traces the friendship that developed between these two women and the story of their husbands and children and how the evolving conflict between the English and the French effected them all. It is a heartbreaking story of love of family and heritage, as well as love of a friend and of faith in God and prayer. I was sad that the end left so many unanswered questions. I will be reading the other books in the Song of Acadia Series. This was one of my favorite books to date."}, {"userName": "Kelley", "userReviewDate": "May 12, 2012", "userURL": "http://www.goodreads.com/user/show/4711930-kelley", "userReview": "Two young women, one English (Catherine) and one French (Louise), meet in a chance encounter in a meadow situated in the middle of their respective towns on the eve before their weddings. It is a time of conflict between England and France and the womens' budding friendship could be dangerous for all involved. There is a lot of history and spirituality intertwined in this story. I developed a great sympathy for both the English and French sides: The French for what they had to endure and the English that were forced to inflict it. Though the terrible things that come in war time are clear, this story also allows us to see what can come from allowing God to take over and using His strength and power to overcome.Just a little slow to start out, but by the end I couldn't put it down. A great love story, exploring the love between family, community, husband and wife, mother and child, and the strength of love that can develop between friends. An amazing inspirational read. After finishing this, I immediately broke out my Bible, wanting to read and learn from the same passages Catherine and Louise read together.Prepare to not even have the choice to read the sequal: with the way this one ends, you will NEED to."}, {"userName": "Helen", "userReviewDate": "Oct 23, 2016", "userURL": "http://www.goodreads.com/user/show/52506480-helen", "userReview": "E-Reader Historical - British & French of AcadiaThis book will show how important God is in peoples lives, whether they be British or French.The English have a Ft. Edward at the Cobequid Bay, Acadia (early name of Arcadia & New Brunswick).An English woman Catherine Price Harrow becomes a French woman's best friend, Louise Belleveau Robichard. They meet in an open field of wild flowers, unknown to many.They both married the same day. Also had a baby daughter 2 days apart, Elsapeth Catherine's & Antoinette Ann Louise's. The King of England wants all of Acadia. The Frenchmen must sign Allegiance to his Royal Highness King of England. Which they refuse because they refused to fight for France.There is romance, love, hardships brutal winters. Catherine & Louise switch babies. Catherine & Andrew decide they want to try & save Antoinette Ann who is very sick. Catherine goes with father to take her to a doctor while he's on official business. The British soldiers over take Minas & forced all to leave on big ships to unknown destinations. Will they ever see their daughters again? I recommend reading this book. There are so much to this book. Many other people, love, hardships. It's an excellent book."}, {"userName": "Nadine Keels", "userReviewDate": "Oct 05, 2010", "userURL": "http://www.goodreads.com/user/show/4379044-nadine-keels", "userReview": "Thoughts on the entire series.With these novels, I joined the ranks of readers who know what it is to be in the midst of a series, waiting, even with bated breath, for the next book in the series to be published.I appreciate the style and language that Bunn clearly brought into this co-written historical fiction saga with Oke. I remember being totally engrossed and on edge during a certain crucial stretch in The Meeting Place and was floored by the unembellished end to that nerve-racking rush: “And then it began to rain.” I grew attached to the characters over the course of the series, though I’ll admit I got a bit weary during the fifth novel, as while some of the characters were yet making more grand departures from one another, I lost the sense of what they were actually getting done, apart from moving around the globe.I might’ve been missing and/or forgetting things, though, weary in general after doing so much waiting, and I don’t regret a minute I spent with this saga."}, {"userName": "Sarah", "userReviewDate": "Sep 03, 2014", "userURL": "http://www.goodreads.com/user/show/6194929-sarah", "userReview": "Watching the Janette Oke series called \"Cedar Cove\" made me want to check out more of her books and I found this one at the library. The first in the series about a part of the world and a part of history I knew nothing about. During the 18th century, French settlers in the southeastern (I think) part of Canada lived in a small French controlled area surrounded by British settlements. The two groups of people did not mingle as the British were very wary of the French and did not like them since the 2 countries seemed to be constantly on the brink of war. Although the French in Acadia had never harmed anyone for decades even generations, most Brtish despised them simply because they were French. This series is about what happened to the French in Acadia. I went back to the library to get the 2nd one immediately after finishing the first and I'm enjoying it as well. It is amazing how history repeats itself all over the world."}, {"userName": "Pegg", "userReviewDate": "Jan 04, 2014", "userURL": "http://www.goodreads.com/user/show/4486713-pegg", "userReview": "Set in the Canadian frontier during the turbulent years when France and Great Britain fought for control of the territory. Catherine Price was married to her British office on the same day Louise Robichaud married her French farmer. The two women met by accident in a forest meadow. Could their blooming friendship span a cultural divide steeped in hatred and suspicion?Wonderful setting and history background to this story. Loved the rich descriptions of the area during this time. The characters are strong and likable, having missions the reader clearly understands and sympathizes with. This is the first book in a series and it doesn't really end, it stops. The action, presumably, picks up with the next book. It is not a book to read as a stand alone novel. If you're not willing to invest in the series, this is probably not the best book for you. If you enjoy the saga of a full series, dig in!"}, {"userName": "Sabrina", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/1261615-sabrina", "userReview": "After reading an 800+ page book, I like to settle next on a small quaint book of fluff. Usually to relax my mind a bit and let myself just enjoy.I picked up The Meeting Place with this thought in mind. Much to my surprise, this book was definitely not the uncomplicated, simple romance that I was expecting.This book has a wonderfully complex story built around 2 women who accidentally become friends. What transpires is very deep and for the most part heart-wrenching. I realized when I was coming close to the end of the book what was going to happen and I hated it! You have to read book 2 for a conclusion and I just wasn't expecting to have to do this. I have not allowed any time for a 2nd book. GGRRRSome day I imagine I'll pick up the next book, but don't see it happening in the foreseeable future."}, {"userName": "Sally Wolfsberger", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/47077704-sally-wolfsberger", "userReview": "One of Okes best works. The book began slowly but became one of my favorites. Looking forward to the sequel. As usual, Janette Oke does not disappoint."}, {"userName": " Mummy Cat Claire", "userReviewDate": "Aug 26, 2010", "userURL": "http://www.goodreads.com/user/show/2648857-mummy-cat-claire", "userReview": "I enjoyed this book. The reader is introduced to two women from different countries. One is Canadian and the other is French Canadian. I love how they come together and get to know each other in their meeting place, a meadow. This series is about the conflicts with the French Canadians. I learned a lot about this issue, however it has been a while since I read this book and I feel like I should go back and read it again.Each of their lives are discussed in this first book. This information is important for the second book in the series. This author is Christian and so her books have a lot of scripture reference and God talk."}, {"userName": "Emily Barrus", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/20480963-emily-barrus", "userReview": "The Meeting PlaceA bittersweet story of family and friendship during the conflict between the British and French. Louise (French) and Catherine (British) first meet in a beautiful meadow. Their friendship continues to grow, growing fond of each other and in no way thinking of the other as an enemy. They grow as close as sisters can and are joined together in their fellowship with God. Through a tragedy and when all hope seems lost, they both continue to trust in God. The book does end in a bittersweet cliffhanger. You can't put this book away without wondering what happens next! On to book #2!"}, {"userName": "Terri", "userReviewDate": "Apr 07, 2016", "userURL": "http://www.goodreads.com/user/show/143428-terri", "userReview": "This book is an example of why I really like historical fiction: I learn stuff! I'd never heard of the Acadians or their forcible removal from Nova Scotia during the French and Indian War. My knowledge of that war was limited and only related to the American Colonial side. In this book we have two ladies (Katherine who is English and Louise who is French) who build a friendship based on common interests and similar life experiences despite language difficulties and the natural enmity between their native countries. As in all Oke novels, the characters rely firmly on God. I especially like how Oke describes them acting on inspiration and feelings they receive through prayer."}], "description": "A Chance Encounter Forever Changed Their Lives--and Destinies. Crafted by two masters of inspirational fiction--Janette Oke and T. Davis Bunn--and combining the engaging historical settings, rich characterization, and heartwarming messages quintessential to both authors, The Meeting Place is another timeless story for you to cherish.Set along the rugged coastline of 18th century Canada in what was then called Acadia (now Nova Scotia and New Brunswick), The Meeting Place re-creates a world that was home to native Indians, French settlers, and English garrisons. Such diverse populations did not live in accord, however. Instead, they were isolated within their own groups by a brewing political tension under the difficult English rule.Amid such chaotic times two women, both about to become brides and both trying to live lives of quiet peace, meet in a lush field of wildflowers. Louisa, a Frenchwoman, and Catherine, who is English, continue to meet secretly through the seasons, sharing both friendship and growing faith.The outside world does not mirror their own tranquil happiness, and the dreaded crackdown by the English throne threatens far more than their growing bond. In the face of a heart-wrenching dilemma, Louisa and Catherine strive to maintain their faith and cling to their dreams of family and home. Winner of the Christy Award, presented by the Christian Bookseller Association to honor the best in Christian fiction.", "title": "The Meeting Place\n      \n          (Song of Acadia #1)", "url": "https://www.goodreads.com/book/show/706250.The_Meeting_Place", "average": 4.06, "cover": "https://images.gr-assets.com/books/1347613763l/706250.jpg", "reviews": 196, "authors": [{"url": "https://www.goodreads.com/author/show/4049.Janette_Oke", "name": "Janette Oke"}, {"url": "https://www.goodreads.com/author/show/7584938.T_Davis_Bunn", "name": "T. Davis Bunn"}], "type": ["Christian Fiction", "Historical", "Christian", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/706250.The_Meeting_Place", "http://www.goodreads.com/book/show/6640606-the-meeting-place", "http://www.goodreads.com/book/show/18746119-the-meeting-place", "http://www.goodreads.com/book/show/16457856-the-meeting-place", "http://www.goodreads.com/book/show/65497.Love_Comes_Softly", "http://www.goodreads.com/book/show/389827.When_Calls_the_Heart", "http://www.goodreads.com/book/show/31507.Love_s_Enduring_Promise", "http://www.goodreads.com/book/show/65484.Love_s_Long_Journey", "http://www.goodreads.com/book/show/233820.Love_s_Abiding_Joy", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}