{"ratings": 12925, "userreviews": [{"userName": "Cara St.Hilaire", "userReviewDate": "Jan 04, 2010", "userURL": "http://www.goodreads.com/user/show/1741361-cara-st-hilaire", "userReview": "Rarely will one story make you literally feel anger or pain, let alone bring tears to your eyes. This story will do that to you. Two innocent and endearing children—young girls—have their sad little world torn apart the day their fathers enters their apartment in Brooklyn and kills their full-of-life mother. What Lulu and Merry endure throughout their life after this horrific event is simply heart wrenching. Both spend their lives just trying to find some sense of closure and peace with the tragedy and aloneness—and abandonment—that they’ve had to struggle with. The characters that Meyers created are so real that you could imagine each as someone you know, and they grow to be such different women with times of strength and times of melting despair. The looming shadow in their lives is their father, who brings out a rainbow of raw emotion.The story will make you want to cling to those that you love to. I won’t give away how it ends, but it does leave the reader with a sense of closure and understanding somehow. This debut novel gives us a sense of what a strong writer Meyers is and I cannot wait to read her next. Definitely a must-read."}, {"userName": "Sawsan", "userReviewDate": "Sep 09, 2014", "userURL": "http://www.goodreads.com/user/show/11592808-sawsan", "userReview": "this novel tracks the lives of two little girls after the murder of their mother by their fatherclarify the emotional and psychological effects of domestic violence and childhood trauma on the growth of the children and their relationships with othersthe girls grow up, one of them denied her father's existence trying to succeed at her life, and the other gets into disturbed relationships with wrong men but kept a connection with her father in prisonthe writer showed their pain and struggles and how they confronted their past and move forward at last, we can't erase the painful past but at least try not to allow it to control the future"}, {"userName": "Liesl", "userReviewDate": "Jan 08, 2012", "userURL": "http://www.goodreads.com/user/show/1755202-liesl", "userReview": "Vapid story, vapid characterization, vapid prose.I was impelled to try out this book due to the number of positive reviews it got and the fact that it was translated into several other languages, but popular opinion proves to be vastly misleading. First of all, the plot is rather thin, and at times cliché - and those clichéd moments remind me of a cheap imitation of \"White Oleander\". The author of \"The Murderer's Daughters\" does not have the ability to flesh out her characters into authentic, three-dimensional individuals, nor to write in such a way as to give any of those characters their own distinct voices, despite the story being narrated in first person by the two sisters. Granted, the sisters ARE supposed to be quite different from each other, but the way the author writes that aspect into the story feels very contrived. Names of secondary characters are introduced and thrown around in the story without any personalities attached, and the few that do get a bit of focus are by no means memorable.That said, a novel does not always have to be plot- or character-driven to be successful, if the writer is the type that relies on poetic style or experimentation. However, no such literary merit is present to redeem this novel, as the prose is highly plain and even more bland and uninteresting than the plot and characters, if such a thing is possible. The author's sparse attempts at poignancy are also feeble and ineffective and fall short of anything profound. Hence, there was nothing in this book to sustain my attention. Yet, I mustered enough willpower to plod through \"The Murderer's Daughters\" in hope of finally finding and taking away something worthwhile from it, but those tediously spent efforts sadly did not pay off."}, {"userName": "Talulah Mankiller", "userReviewDate": "Apr 22, 2010", "userURL": "http://www.goodreads.com/user/show/3245656-talulah-mankiller", "userReview": "This is the kind of book I would have eaten up with a spoon when I was in my early teens. The drama! The angst! The HORROR! Now that I’m older I tend to find it all a little exhausting and depressing, but since I’ve apparently pared down my reading to memoirs, paranormal romance, and YA of all varieties, I thought I’d get off my ass and read something outside of my current comfort zone.Hey, going back to something I enjoyed a decade ago and haven’t since kinda counts as doing something new and different, right? Right? Shut up!Ahem. So Lulu (such a lovely name!) and Merry are the titular murderer’s daughters; one afternoon, their father comes by their apartment, intimidates Lulu into letting him in (even though her mother expressly told her not to), and then stabs his estranged wife to death, gives Merry a scar on her chest that she’ll have to hide for the rest of her life, and tries to slit his own wrists. Unfortunately for everyone, he survives and goes to prison. And then the fun really begins!For the first year or so after their mother’s death, the girls are cared for by their maternal grandmother; but then their grandma has a stroke and dies, their maternal aunt refuses to take the girls in because their his daughters, and their paternal grandmother is incapacitated and cannot care for them. So they end up in a group home. Cheers!The book tracks Lulu and Merry from the day of their mother’s murder until their father’s eventual release from prison several decades later (oh yeah, bitch got parole). I had a somewhat…mixed reaction to the novel, which I will now break down into convenient, bulleted lists:What I Liked * I thought that Merry and Lulu’s reactions were very natural and well-rendered. Merry, daddy’s little favorite, the cutie, the baby, spends the rest of her life trying to appease everyone. Even though she’s frightened of her dad (dude, he tried to kill her), she goes to see him as often as she can while he’s in prison. Lulu, on the other hand, cannot forgive herself for having been the one to open the door, for having frozen when her mother screamed at her to go get help, and expresses this by cutting her father out of her life completely. Later in life, she tells everyone–including her own children–that he died in a car accident when she was small. * Merry and Lulu’s mom was kind of a turd. I liked this, not because I like unpleasant characters, but because I thought Meyers did a good job handling Lulu’s conflicting emotions about her mom. On the one hand, Lulu flat-out didn’t like her mother, who wasn’t exactly a carbon-copy of June Cleaver: the woman didn’t cook, she sent her kids out to buy their own dinner at ridiculously young ages, and she basically forced Lulu to raise Merry for her. On the other hand, as an adult, Lulu can understand her mother’s frustrations a little better: her mom got married because she was pregnant with Lulu, and then she was trapped in a loveless relationship with a man who, obviously, was not exactly perfect husband material.What I Didn’t Like * The racism. This book is very, very tacitly racist. Lulu’s first serious boyfriend is a fellow med student who just happens to be Asian–and doughy, and boring in bed (not that she minds, she’s quick to point out). He quickly fades out of the picture, and her Prince Charming is, of course, white. * There’s often this moment in books by or about white people who’ve had it rough wherein the white person in question is paired up with a minority or two and thinks bitterly, “I bet you think I’m so privileged. IF YOU ONLY KNEW.” I hate that moment. I really hate that moment. There’s this undercurrent of “HaHA! Racism isn’t as simple as you think! White people can have it hard, too!” and it drives me up the wall. It’s called intersectionality. Please read about it and then shut the fuck up. * Merry grows up to be a parole officer, and thereby becomes some black kid’s white savior via a HELEN KELLER QUOTE. * The way that Lulu’s daughters find out that grandpa’s in the clink? Let’s just say that it involves a hostage situation. Yeah. No, SERIOUSLY. * Oh, and even though Merry grows up to be first a victim’s advocate and then a parole officer, she never quite grasps that her dad is a dirtbag. He never apologizes, not really–he’s always talking about how he was “just a kid” (he was 28), and drunk, and sad that his wife was using his money to buy her new boyfriends booze (that last part was probably true). He doesn’t even really apologize to Merry for stabbing her in the chest. And even though there are all the danger signs of an abusive personality–more than one person hints that Lulu’s conception was a plan on her dad’s part to keep her mother from leaving him, which is textbook–Merry just…never learns to call a spade a spade. She says that her father is a “limited person.” Uh, no, Merry, your dad isn’t “limited”: he’s got the emotional capacity of an overlarge lizard. He doesn’t love you, because he doesn’t love anyone. Accept it and move on.So no, although there are some things I admire about this book, on the whole? Kinda schlocky, racist, sexist, and overblown. I get why younger me enjoyed stuff like this: when you’ve got that many hormones raging around in your BRANES, you need something wildly over-dramatic so that you can cry buckets and get it out of your system. Because unless you’re EXTREMELY UNLUCKY, nothing in your real life is going to provide you with the necessary stimulus for that kind of emotional release. As an adult, though? Eh. Give me a book about hobbits any day.Recommended for: skip it."}, {"userName": "Bailey", "userReviewDate": "Apr 27, 2011", "userURL": "http://www.goodreads.com/user/show/3875466-bailey", "userReview": "On that fateful day, Merry and Lulu's father comes into their apartment in a drunken rage and does the unthinkable - kills their mother and wounds the youngest daughter, Merry. After being shuffled between several dysfunctional family members, the daughters live at an orphanage and are eventually taken into foster care. The rest of the book chronicles the girls' lives and how they are forever changed by their father's terrible crime. Sorry to be a negative nancy and a debbie downer for what seems like the 27th review in a row, but I do not recommend this book and here's why: 1. I read the first 150 pages at an engrossing pace. The last 150 took a week. For me, the author handled Lulu and Merry's childhood much better than their adulthood. 2. The girls don't grow. There is no character development or maturation. This was depressing. 3. The daughters are hot messes. I appreciate the author's realistic portrayal of how domestic violence destroys lives, but really Lulu and Merry are never happy and cannot overcome their circumstances. Once again, depressing. So, while the subject is interesting and unique, it is dealt with depressingly and there is no light at the end of the tunnel. Also, just a friendly warning, there is pointless language & sexual content throughout."}, {"userName": "Ryan", "userReviewDate": "Aug 15, 2010", "userURL": "http://www.goodreads.com/user/show/2510203-ryan", "userReview": "This was another one of those books that while the synopsis from the book sounded good (which is why I agreed to read it), it didn't really do the book justice. For some reason, and I'm not sure why, I was expecting a book that would have concentrated more on the father and that the story would some how revolve around him. And while his actions acted as the pivot point in the story, this was more about Lulu and Merry and how they chose to deal with their tragic past.Lulu is the eldest daughter and like most older children (myself included) she tended to internalize her emotions and not really deal with them on the surface. When they were still children, Lulu took the responsibility for making sure Merry was taken care of and protected. When they were sent to the orphanage by her mother's sister who refused to take care of them any longer because of what their father did, it was Lulu who became the tough sisters to allow Merry to remain a little girl. As an adult, Lulu never told anyone about her father. Instead she would tell them that her parents died in car crash, she even made Merry tell that lie to everyone she met. Psychologically, Lulu was the more interesting of the two to read about. I guess it's because I'm a lot like her in how she dealt with things. As a kid, while my father never took it the level of Lulu's, my dad wasn't exactly the nicest guy on the street. The few memories I have of him are heavily laced with violence and it took me years to deal with it. I would never talk about him and when he passed away when I was 8, I never cried. I actually didn't cry until my Freshman year in high school and even then it was years later that I even wanted to visit his grave. So I understand Lulu's reluctance to discuss or even deal with her past, who wants people judging them for something they had no control over. And as both Lulu and myself found out, children and even some adults will judge you based on those events in your past that they don't understand.Even in the way she finally lets what happened out to someone else, her behavior was similar to mine. When she meets Drew, her future husband, she finally feels she can tell someone about her father. And while some readers may think it was rather soon and out of character for her to tell him the morning after they hook up for the first time, I completely understood it. When you meet someone that you feel that comfortable and secure with, even if only for a short period of time, you want to let it all out. You want to talk about it to someone who didn't know you then. It's a relief to relax and let someone else in on your secret.This was a brilliant book that dealt with the emotional and psychological impact of childhood violence and one that I connected with on so many levels. The author, in my opinion, captured two distinct and valid ways that children internalize and cope with traumatic experiences and how it impacts them as adults. Reading this book actually helped me reanalyze my own feelings about my father and I'm grateful for it. I would encourage everyone to read this book, but I would implore anyone else who experienced horrific events as children to pick this one up and understand that you aren't alone, that there are many of us out there who do understand what you went through and how that has made you into the person you are today."}, {"userName": "Mary", "userReviewDate": "Nov 14, 2009", "userURL": "http://www.goodreads.com/user/show/1002344-mary", "userReview": "I won! I won! Can't wait to read it!ETA - This was a very compelling story, and I consider myself lucky to have received an advanced copy through First Reads. From the first page, I was drawn into the characters' lives. I enjoyed the way the story's viewpoint changed from Merry's to Lulu's and back throughout, and I loved that it spanned about 30 years time. Overall, I was very satisfied with this author's debut novel and look forward to reading more of her work."}, {"userName": "Rebecca McNutt", "userReviewDate": "Sep 03, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "The Murderer's Daughters tells the story of a dysfunctional family plunged into a nightmare. When ten-year-old Lulu lets her beloved father into the house one day, she never expects him to do the unthinkable. Shocking, powerful and unforgettable, this book is one that really makes readers think."}, {"userName": "Jamie", "userReviewDate": "Sep 28, 2011", "userURL": "http://www.goodreads.com/user/show/4605519-jamie", "userReview": "*Won this book as a first reads free giveaway on Goodreads. Well, this book had some good points and not-so-good points. The whole book focuses on two sisters, Lulu and Merry. The book starts off when they are young children and their father murders their mother and even tried to kill Merry (the youngest). The story follows them through their grandparents while being exiled by aunts and uncles, an orphanage and finally a foster home. It also continues through their adult years.Lulu has shut her father out of her life, telling herself and others he is dead. Merry clings to him, in a love/fear relationship. The book is first person perspective that takes turns throughout chapters from Merry's POV then Lulu's. while I enjoyed the perspective and could understand much of what each girl was gong through, for some reason I just could not FEEL it. In a like this I want to be able to fully understand and experience what is going on. I could not quite to that. The book also had wierd jumps, some chapters seemed pointless while other I thought should have been hit on more (such as their teen years which was heavily glossed over). Regardless it was still an enjoyable read and does make you wonder about why someone may act the way they do, how trauma can effect somebody."}, {"userName": "Ruth Turner", "userReviewDate": "Oct 06, 2014", "userURL": "http://www.goodreads.com/user/show/17861817-ruth-turner", "userReview": "The story is told from two points of view, Lula's and Merry's. Both girls were so similar that at times I got confused about which sister I was listening to. The first half of the book was an enjoyable, fast read, telling of Lulu and Merry's early years after the murder of their mother. But then story dragged.I struggled with adult Lula and Merry. I didn't like them particularly, and felt no sympathy or compassion for them at all. As the years passed it was a case of same old, same old, with a husband and a couple of children thrown in for Lulla, and for Merry, numerous men, only discernible by the changing names.It's a well written, quick read, just not a great one."}, {"userName": "Kelly Houser", "userReviewDate": "Dec 04, 2011", "userURL": "http://www.goodreads.com/user/show/1388304-kelly-houser", "userReview": "This book was just OK for me. The premise of the novel sounded very interesting, and I would say the first half of the novel was very good. The first half of the novel dealt with the details of Lulu and Merry’s abusive childhood and the terrible conditions they lived in. This led up to the murder of their mother and what happened to the two girls after her death and their father’s imprisonment. The girls are bounced from family member to family member until they finally end up in an orphanage.As Lulu and Merry become adults, the novel became much less interesting and very predictable. One of the sisters is super straight-laced, living out the perfect life she never had as a child. The other sister is a slutty, emotional wreck, choosing relationships with men who are bad for her, and being generally directionless in life.The latter half of the novel was very predictable and lackluster. The amount of enjoyment that I derived from the first half of the novel was shattered by the latter half.I don’t think I would recommend this book. There are many more better and enjoyable novels out there and I wouldn’t advise wasting your time on this one."}, {"userName": "Corey", "userReviewDate": "Dec 26, 2009", "userURL": "http://www.goodreads.com/user/show/866083-corey", "userReview": "It has been a long time since I've devoured a book as quickly as this one but once I started reading I did not want to walk away for long. The story begins with Lulu whom is awaiting her 10th birthday and makes a single mistake that will haunt her for the rest of her life. For the next 30 years, the story switches from Lulu to Merry's point of view to tell the story of growing up as a \"Prison Girl\" and overcoming that stigmata. Lulu gets tough, buckling down and making sure to control everything in life that can possibly be controlled. Merry takes a very different route, allowing herself to be taken care of and not attaching herself to anything knowing all too well that something that can be taken easily can also be taken away. These characters are written very realistically and aren't the typical heroines you find in novels. This is quite unlike any story I have ever read and I guess that is why I was so transfixed. If you are looking for a book that you can escape into, this is an excellent choice."}, {"userName": "Neide Parafitas", "userReviewDate": "Jan 03, 2013", "userURL": "http://www.goodreads.com/user/show/6016211-neide-parafitas", "userReview": "\"NÃO FIQUEI SURPREENDIDA quando a mamã me pediu para lhe salvar a vida. Desde a minha primeira semana no infantário, tinha percebido que ela não era o género de mãe que usa colares de macarrão. Basicamente, a mamã considerava-me como uma criada prestável em miniatura.- Vai buscar-me uma Pepsi, Lulu.- Traz-me o leite para os cereais da tua irmã.- Vai à loja comprar-me um maço de Winston.- Até que um dia subiu a parada:- Não deixes o pai entrar em casa.\"Assim começa este grande livro que conta a história de Lulu e de Merry, duas irmãs que, com apenas 9 e 5 anos, vêem a sua infância ser marcada por um acontecimento terrível: a morte da mãe... pelo pai! O pai que, bêbado, não queria só matar a mãe, mas também a filha Merry.O pai é preso, mas também Lulu e Merry estão presas... presas ao passado. Às suas vidas destruídas pela imagem do pai a matar a mãe...Enquanto uma finge que ele está morto, a outra mantém contacto com ele. Mas ambas têm a sombra do pai a pesar sobre cada acção que tomam nas suas vidas!!Contudo e, volvidos cerca de 30 anos de pena cumprida, o pai poderá estar quase a sair em liberdade condicional. Lulu e Merry não sabem o que fazer. Apenas sabem que estão aterrorizadas perante a possibilidade desse dia chegar...Baseado em histórias verídicas, este não é um livro cor-de-rosa para nos fazer sentir leves. É antes um retrato de muitas vidas que são destruídas por acontecimentos como este mencionado neste livro. É um livro cuja leitura aconselho e que nos faz pensar em como, tantas vezes, existem coisas que o tempo não pode simplesmente curar!"}, {"userName": "Sharon L", "userReviewDate": "Jan 12, 2013", "userURL": "http://www.goodreads.com/user/show/15591068-sharon-l", "userReview": "3.5 stars. i'm a bit torn about this book. on the one and there were moments i was bored. the girls, though growing up didn't really grow up. on the other hand, both sisters were complicated, full of contradiction. and the way they navigated life, love, career and family was beautifull. the effects of what the father did were interesting. especially how two girls having the same path in childhood became so different (even how they treated their father). also, there were moments my heartbroke. when the older sister became a mother and was suprised yet frightened to how strong she felt toward her children, loving them more then air, yet knowing she doesn't know how to be a mother and as a result screwing things up (exactly because she didn't want to screw up). many reviews mention that the girls do not grow up, and it's true. but i think, considering their circumstances, that tgey grew up best they could. so while it was good and interesting, it also has parts that were a bit...well, not that good. so that's it. 3.5 stars."}, {"userName": "Kasa Cotugno", "userReviewDate": "Dec 08, 2009", "userURL": "http://www.goodreads.com/user/show/2345554-kasa-cotugno", "userReview": "The reason Randy Meyers writes with such authority is explained in her acknowledgement section. She has worked with men who are not monsters but who have committed monstrous acts. This book addresses the collateral damage inflicted on children who witness, in this case, the murder of their mother by their father. Meyers pulls off the difficult feat of two-person narration, alternating between the two sisters at the center of the story. It is astounding that this is her debut in that she has managed to make each voice individual and character-driven. Ironically, the mother whose murder they witness appears to be the less sympathetic of the parents. Not to infer that her self-absorbed benign neglect of her daughters earned her the disastrous fate she suffered, but that the father, despite his explosive nature, seemed to hold more deep seated affection for them. The majority of the book deals with the sisters' attempts to reconcile themselves to the outside world and to each other. Highly recommended."}, {"userName": "Heidi", "userReviewDate": "Jun 10, 2011", "userURL": "http://www.goodreads.com/user/show/5161706-heidi", "userReview": "I wanted to like this book. However, by about page 35, I knew it wasn't going to happen. The narrative bounces between two sisters who have survived horrific domestic violence. There is no real difference between the two narratives. Lulu's voice is Merry's voice. The shifts between the sisters seem random and forced until very near the end of the book when the reader suddenly gets a more natural, back and forth change of characters. Early on, the story starts from Lulu's perspective. About 4 chapters in and a couple of *years* later, the first shift to Merry's perspective occurs. I also found all the characters shallow. The mean people that peppered the girls' lives were just copies of the ones before. Their friends merely changed names through the years. I found myself needing to go back to try to remember who someone was because if the character was mentioned within a page of the other character who seemed exactly like them, I would think to myself, \"Wait a minute... Wasn't that person just doing X, Y, Z...?\" only to turn back a page and realize my brain transferred the name to that of their clone from earlier in the story. It is entirely possible that my confusion was also due to the fact that these empty people did nothing to draw me in. Including the sisters, Lulu and Merry who, in the end, were hallow characters who never seem to grow or change at all.I really tried to like this book... But the writing made it impossible for me to do so.And I edit to add that the ending was TERRIBLE. I literally turned the page not realizing that was it. And then I flipped it back and forth a couple of times to check to see if there were pages stuck together. Seriously."}, {"userName": "Cheryl", "userReviewDate": "Apr 03, 2010", "userURL": "http://www.goodreads.com/user/show/1179650-cheryl", "userReview": "After Lulu and Merry’s father murdered their mother, all Lulu and Merry wanted was another place to call home. Unfortunately, they never found another place they could call home, as they were bounced from place to place. Though this all, Lulu and Merry realized that home is where the heart is and nothing is stronger then a sister’s bond. Sadly before they could both come to this realization, they first would have to endure lots of heartache and loss. Lulu is forever haunted by the words of her mother asking her to not let their father into the house. Lulu feels like she let her mother and sister down. Merry on the other hand carries with her the scar from when her father cut her. Can Lulu and Merry step out of the shadows of being known as The Murderer’s Daughters?The Murderer’s Daughters is the debut novel by Randy Susan Meyers. Right from the beginning this book grabbed me by the heart and sucked me into Lulu and Merry’s world. I literally almost couldn’t stop reading this book. It is a one sit read! There are few books that come along, every once in a while, that make you want to jump up and scream to everyone that you have got to check this book out. When this happens you know you are holding and reading a winner. Every step that Lulu and Merry took…I took with them. The bond that Lulu and Merry shared is priceless. Mrs. Meyers is an author to watch out for. She has made a big name for herself in the booking world. The Murderer’s Daughters is a book you will want to read over and over. I can’t wait to see what she brings for me next."}, {"userName": "Woodwhisperer", "userReviewDate": "Mar 05, 2011", "userURL": "http://www.goodreads.com/user/show/4209643-woodwhisperer", "userReview": "The Murderer’s Daughters by Randy Susan MeyersAs the title suggests, The Murderer’s Daughters is a study of the lives of two sisters who lose their mother when she is killed by their father. The book follows the lives of the sisters as they carry the impact of that singular event with them through their lives.This well written novel studies how the murder causes dysfunction in the children and how it reverberates out into the families on both sides of the marriage. It is not a pretty picture. Ms Meyers manages to maintain the emotional levels from beginning to end through thirty years in the lives of Lulu and Merry. The edge is unrelenting – so much so that this reader became exhausted and exasperated that no one except the murderer could get past the murder and that was only because he was presented as a sociopath. Such was the connection the writer was able to develop with me.In a perfect world, people will learn and grow. My only complaint with this story was that I became so attached to the characters, I found myself willing them to rise above their damaged personalities and they never really did. In the end there is a glimmer of hope but it is left unresolved. Perhaps this is what the writer intended. Perhaps there are too many happy endings. Unrelenting misery, however, just becomes normalcy. It is a very dark view of the human way but in the end, maybe not too far from the truth."}, {"userName": "Jessica (BlogEared Books)", "userReviewDate": "Dec 08, 2011", "userURL": "http://www.goodreads.com/user/show/166898-jessica-blogeared-books", "userReview": "I can’t stop thinking about this book. It is haunting and an amazing character study. After reading this, I wondered if the author, Randy Susan Meyers had actually experienced something traumatic like this. The book is told from the perspective of Lulu and Merry, the murderer’s daughters- they take turns telling the story in their own words. Merry and Lulu’s parents have a difficult relationship and after a separation period, their father convinces Lulu to let him in to talk to her mother. After entering the apartment, Lulu races to the neighbor for help, comes back and finds her mother dead, and her father and little sister bleeding. The book follows Lulu and Merry through the next 30 years and documents how they cope with the tragedy.This book is full of colorful description and relatable characters. I have never been in that situation (my dad sticks to killing flies and spiders) but I actually could understand and even relate with some of the girls’ actions, outlooks on life, and insecurities as a result of this. I fell in love with both Merry and Lulu, although I wanted to strangle them both at times. This is the first book from a powerhouse-I can’t wait to see what she has in store for her sophomore effort."}, {"userName": "Colleen", "userReviewDate": "Jan 22, 2010", "userURL": "http://www.goodreads.com/user/show/640637-colleen", "userReview": "This debut novel tracks the lives of two sisters as they attempt to create lives in the shadow of a harrowing family tragedy. Older sister Lulu must cope with the guilt of opening the door to their father the day he stabbed their mother to death, while younger sister Merry lives with her memories of the murder and her father's failed attempt to kill her and himself. Forced into an orphange by the death of their maternal grandmother, the sisters are lucky enough to find a stable foster family who nonetheless fail them on an emotional level. Betrayed by everyone else, the two sisters form an unhealthy (but understandable) co-dependent relationship marred only by Merry's regular visits to her father and Lulu's refusal to admit he is alive. I literally couldn't put this book down- it was powerful, heart-breaking, and ultimately redemptive all at the same time. The girls are wonderful characters whose voices and actions ring true without seeming stereotypical. I felt emotionally connected to these girls, invested in their well-being and frantic to try to keep them safe. The author's experience with the victims of violent crime serves her well and gives the reader a wonderful (and terrifying) insight into the lives these victims lead. Highly recommended!"}, {"userName": "Jenny", "userReviewDate": "Dec 10, 2009", "userURL": "http://www.goodreads.com/user/show/1482403-jenny", "userReview": "I was lucky enough to get an ARC of Randy Susan Meyes' debut novel and thus not have to wait for a novel I was very excited for.The premise of THE MURDERER'S DAUGHTERS is that sisters, Lulu and Merry, lose their mother in an especially horrifying way when their father kills her.But THE MURDERER'S DAUGHTERS is not a roadside accident, a spectacle which the more honest among us admit we can't help gawking at a little.Instead, Ms. Meyers, who has a background in victim crime, raises this issue to one of the familial bond in general. We all have things for which we must forgive our loved ones, even if we're lucky enough not to have them be as dread as what Lulu and Merry must face. How does love survive an assault? Where does loyalty go once it is divided? These are the questions Ms. Meyers grapples with in her poignant novel.The fact that her writing is lucid and lovely, that the sisters are strong and subtle characters you will root for, are all icing on this delicious debut."}, {"userName": "Hira", "userReviewDate": "Dec 08, 2010", "userURL": "http://www.goodreads.com/user/show/4356644-hira", "userReview": "In this wonderfully written novel, author Randy Susan Meyer has surpassed all my expectations with a debut novel that reads nothing like a debut. Well-crafted characters with depth, the story of Lulu and Merry is one that is sure to touch your heart. It is a true representation of how abuse and childhood trauma can truly stunt the growth of children, emotionally - so much so that they spend their entire lives trying to overcome their emotional handicap. A must read for all. (Detailed Review to come soon)."}, {"userName": "Kristie", "userReviewDate": "Nov 20, 2009", "userURL": "http://www.goodreads.com/user/show/707820-kristie", "userReview": "This story was very captivating. I quickly became invested in Merry and Lulu. I felt myself inserting myself in their places throughout the book. With 60 pgs to go, I thought I had it all figured out.....but I didn't and I was glad that I didn't. This great story of Lulu and Merry and how the tragedy of one event can shape entire lives, was well written and heartfelt."}, {"userName": "Laurel-Rain", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/1402123-laurel-rain", "userReview": "In the summer of 1971, in Brooklyn, the Zachariah family went through a horrible upheaval. When Celeste threw out her husband, Joe, she could not have foreseen what would happen next.Daughters Louise (Lulu) and Meredith (Merry) have been fending for themselves for a while, so when, in July, there is a knock on the door, Lulu tries to keep her father from entering. But he convinces her that all will be fine.But it is not. Soon their lives are in crisis mode: their mother is dead, they are living with their maternal grandmother, Mimi Rubee, and their father is in prison.\"The Murderer's Daughters\" is alternately narrated by Lulu and Merry, in the first person voice of each, and it carries us along through the years, revealing what happens to them. Cast aside by their maternal relatives, they find themselves in the Duffy-Parkman home for girls, since their paternal grandmother, Zelda, is in ill health.At the time of the disaster, Merry was five and Lulu ten. They each have very different attitudes toward their father. Lulu refuses to visit, but Merry comes to count on Grandma Zelda taking her to see their father.Even though Merry was also stabbed in the altercation, she seems to need her father. Perhaps because she was the light of his life...before.Through the years, we follow each of them and see how the events of that summer have informed their lives. Is Lulu unable to forgive her father because she can't forgive herself? What if she hadn't opened the door? A question she asks herself. Why is Merry able to forgive her father? How does going into an upper middle class foster home, after the girls' home, affect their lives? Will they continue to feel \"not good enough\"?Their relationships, or lack thereof, can be attributed to the domestic violence of their early lives, and the secrets they keep will define them in the future. In adulthood, Lulu becomes a doctor and finds a man named Drew who is understanding, supportive, and truly good, while Merry continually makes wrong choices and drinks too much.As a probation officer, she seemingly clings to the dark side. When Merry moved into an adjacent apartment in Drew and Lulu's home in Cambridge, she seemingly inserted herself into their lives. Much of what she did seemed to suggest the symbiosis of their relationship; a symbiosis that Lulu has railed against.In this excerpt, I find the hidden truths:\"The past trapped us. Even now, at forty-one and thirty-six, we remained prisoners of our parents' long-ended war, still ensnared in a prison of bad memories, exchanging furtive glances, secrets known and secrets buried flashing between us.\"And then, finally, a frightening hostage situation at Merry's work brings everything to a head. Then, when a letter from prison informs them of the unexpected, something is altered. The chains of the past may finally slip away. Although this dark and emotionally combustible story kept me engaged, I felt that the more than thirty year span of the book did not allow for a deeply insightful look into the lives of the characters, and the narratives of the girls were limited by their unreliable perspectives. 4.0 stars."}, {"userName": "Bridget Thomas (Bridgetsbookstagram)", "userReviewDate": "Jun 30, 2017", "userURL": "http://www.goodreads.com/user/show/56553271-bridget-thomas-bridgetsbookstagram", "userReview": "This book was full of emotion. These two sisters had to go through so much pain and tragedy throughout their lives. It starts out with them as young children having to deal with their father murdering their mother. Then it follows them throughout the next 32 years. You get to see what happens to them and what type of people they become. You watch them as they grow up. It's such a heartbreaking and beautiful story. I will say though that I preferred the first half of the book over the second. The story with them as children was more interesting to me than them as adults. But I'm glad it told the whole story so that I wasn't left wondering what they were like as adults. I really enjoyed this. I read it in 2 days. I just couldn't put it down."}, {"userName": "Rachel", "userReviewDate": "Dec 01, 2009", "userURL": "http://www.goodreads.com/user/show/1083872-rachel", "userReview": "\"The Murderer's Daughters\" is a compelling read, which really shows the author's mastery over the subject of domestic violence and it's aftermath, not just technically but emotionally as well. I was incredibly impressed by the character study of Lulu and Merry, two sisters who grew from tiny girls into middle-aged women, and in first-person too!Lulu and Merry's lives were incredibly rich and textured, which perhaps gave me pause in how shallow and unkind the rest of their family was, particularly Aunt Cillia. The aftermath of their needy, self-absorbed father murdering their sleazy, uncaring mother ultimately landed the girls in an orphanage because no grandmothers, aunts or uncles were able to look beyond themselves. (Also, both grandfathers were MIA and both grandmothers died in their 50s/60s of bad health...maybe socioeconomical?) I'm hesitant to put their foster parents, the Cohens, in the same category- they, too, were selfish, but they were selfish in different ways, at least. Also, their affluence was able to catapault the girls from a bleak, lower class outlook to college educations and steady jobs. Sorta. :PAnother interesting component- both the family and the foster family were Jewish. It played in odd, barely-connected ways throughout the girls' childhoods through Yiddish phrases and secularized Chanukah and Passover celebrations, until Lulu's marriage to the gentile Drew (easily the most selfless, kindhearted character in the book) basically ended that association. I would assume that Meyers herself is Jewish, and it's an interesting, though largely unimportant, cultural connection to have in the book.I was expecting the father to be more sadistically violent, but this passive-aggressive, needy little child man ultimately had a huge impact on his daughters, no matter how (self-servingly) he loved them. I really admired how Lulu and Merry struggled and grew under their father's imprisoned influence over the course of the 30 years. Their stories were realistic, subtle rather than haranguing, and complete with the gritty details and unclear conclusions that I'd expect. My only complaint might be how convenient it was for the father to be parolled at the same time that Merry and her nieces were held hostage, thereby forcing what Lulu had been presently struggling with- telling her daughters the truth about their grandfather.Overall, an amazing piece of craftmanship; definitely reccomend."}, {"userName": "Alisha Marie", "userReviewDate": "Mar 30, 2010", "userURL": "http://www.goodreads.com/user/show/1585205-alisha-marie", "userReview": "I had such high hopes for this book. From the reviews and the synopsis, it seemed like it would be right up my alley: psychologically complex, angsty, dramatic. But nope, no dice. Okay, well, it was a dramatic (but not in a good way) and angsty, but it was just very mediocre. And here's my biggest problem with The Murderer's Daughters...it was repetition galore.Firstly, this book dragged. My God was this a long book! And it was only 320 pages, but man, did it feel long! Again, this was excacerbated by the repetition going on (I'll get back to that). Another thing was that there's no plot in this book. At all. Now, I don't mind books about character development...as long as the characters, you know, actually develop. But they don't. For Merry and Lulu it was the same shit, different year.In 1971:Merry [while touching her scar]: I want you to see Daddy!Lulu: I don't want to see Daddy! He killed our Mama and stabbed you! Stop seeing him and grow up!In 2003:Merry [while touching her scar]: Why don't you see Daddy?Lulu: He killed are mother! Why are you still seeing him?And on, and on, and on, and on. It started getting seriously annoying. Nothing happened in The Murderer's Daughter after the intial two chapters. Nothing different, anyway. This all could've been covered in two to three chapters and made a pretty good short story. Plus, Lulu and Merry started getting on my last nerves after a while. First of all, no one forced Merry to see her dad so that whole \"I was smothered by everyone else's needs\" was crap because she could've stopped seeing her dad whenever she wanted. And Lulu was a hypocrite with her whole \"Merry, we need to stick together crap\" considering that she kept telling Merry to get her own life. How is she supposed to do both? Gah!So, in short (or semi-long), I didn't really like The Murderer's Daughter. Two stars instead of one for having an extremely intriguing premise. Too bad it couldn't have worked out in a way that didn't have me turning back the pages thinking \"I swore I've already ready this part!\""}, {"userName": "Michael", "userReviewDate": "Apr 22, 2012", "userURL": "http://www.goodreads.com/user/show/3680008-michael", "userReview": "Lulu and Merry are close in every way but they differ in how they live their life. Lulu as the responsible girl is warned not to invite their drunken father in their household. However she is sensitive to his demands when he persuades her to let him in. In fear of disappointing him, she opens up the door to him and what happens next is something that Lulu will never forget. Merry tries to hold on to the resentment that her sister has when her mother is murdered in the hands of her Father. However she has a soft side to him, trusting that he is deeply regretful for the pain he inflicted on his daughter but Lulu is not buying the childish act.Growing up, Lulu wants to escape her past by bonding with her grandmother. Things are not as smoothly as they should be because her grandmother wants her to reconcile with her estranged father. As her health deteriorates, she wants her to promise that she will take care of Merry and visit her father in prison. Although she has no problem taking care of Merry, the latter part will be difficult considering that she wants nothing more to do with her dad. On the other hand, Merry takes it upon herself to visit her father and no matter how old she gets, he will always be her \"Daddy.\". Furthermore, the two girls grow up to be distant from each other but their Father presence still lingers between them.I thought this was a very gripping and evocative novel. I love how the characters were developed, it was hard not to feel sympathetic to Merry. Merry loved her Father despite her flaws but her sister deep down loved him but his flaws got in the way of their relationship ever renewing. I also liked how consistent the story was and the journey the two sisters had.Pleasantly surprised how much I enjoyed this, highly recommended to anyone."}, {"userName": "Louise", "userReviewDate": "Feb 06, 2011", "userURL": "http://www.goodreads.com/user/show/2143983-louise", "userReview": "Ten-year-old Lulu (Louise) and five-year-old Merry (Meredith), live with their mother and father in a small apartment. The girl’s mother spends more time visiting with her friend and painting her toe nails blood red than she does with her daughters. Their father is a big mouth drunk who thinks his wife is an absolute beauty queen and just can’t get enough of her. Fed up with his drunkenness and constant obsession with her, she finally kicks him out.Lulu, being the oldest, has been strictly warned by her mother to keep the door locked and not let her father in. The day before her tenth birthday, Lulu’s father shows up at the apartment and convinces her to let him in. He stabbed and killed their mother, stabbed little Merry in the chest and attempted to cut his own wrists. Lulu runs for help but upon her return she learns it’s too late, her mother has been murdered and Merry is on the way to the hospital.Now orphaned by their mother’s death and their father’s imprisonment and with relatives refusing to care for them, Lulu and Merry end up in the Duffy-Parkman House for Girls. The girls try to plot to be taken in by a well-to-do family but soon learn that they’ll never, ever really belong anywhere or to anyone-all they have to love and hold is each other.For the next thirty years Lulu and Merry try to make sense of what happened. Lulu tries to believe her father no longer exists while Merry visits him regularly in prison. But what will happen if and when the day comes that he makes parole and gets out?The Murderer’s Daughters was a great debut novel with well-written characters and a good solid plot. A book for everyone to enjoy!"}, {"userName": "Melissa Crytzer Fry", "userReviewDate": "Aug 19, 2010", "userURL": "http://www.goodreads.com/user/show/3857699-melissa-crytzer-fry", "userReview": "What a fabulous portrayal of family loyalty and guilt (and all its sticky trappings). This tale of two sisters rings true as they navigate their lives after severe trauma in childhood, and come to grips with their damaging pasts later in life.The essential truth of this story is that family bonds, motivations and obligations run oh-so-deep, even when they can be detrimental. And in the case of Aunt Cilla, that family can so easily be dismissed. Don’t we see this kind of tug o-war every day? I was engaged from the start and enjoyed the story of these sisters’ lives – spanning childhood to adulthood. The novel tackles the tough topic of abuse and its long-lasting effects, as well as the “fight” instinct of humans to persevere. Emotionally on target and recommended for readers who enjoy drama and wish to understand more about the inner workings of family relationships. This novel hits all the key themes that make for great drama; it’s a tale of acceptance, finding one’s place, forgiveness, strength and character."}], "description": "Lulu and Merry’s childhood was never ideal, but on the day before Lulu’s tenth birthday their father drives them into a nightmare. He’s always hungered for the love of the girl’s self-obsessed mother; after she throws him out, their troubles turn deadly.Lulu’s mother warned her to never let him in, but when he shows up, he’s impossible to ignore. He bullies his way past ten-year-old Lulu, who obeys her father’s instructions to open the door, then listens in horror as her parents struggle. She runs for help and discovers upon her return that he’s murdered her mother, stabbed her sister, and tried to kill himself. For thirty years, the sisters try to make sense of what happened. Their imprisoned father is a specter in both their lives, shadowing every choice they make. Though one spends her life pretending he’s dead, while the other feels compelled to help him, both fear that someday their imprisoned father’s attempts to win parole may meet success.http://us.macmillan.com/themurderersd...", "title": "The Murderer's Daughters", "url": "http://www.goodreads.com/book/show/6674372-the-murderer-s-daughters", "average": 3.69, "cover": "https://images.gr-assets.com/books/1437274492l/6674372.jpg", "reviews": 1265, "authors": [{"url": "https://www.goodreads.com/author/show/3006839.Randy_Susan_Meyers", "name": "Randy Susan Meyers"}], "type": ["Fiction", "Mystery", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/6674372-the-murderer-s-daughters", "http://www.goodreads.com/book/show/8679656-the-murderer-s-daughters", "http://www.goodreads.com/book/show/8136612-the-murderer-s-daughters", "http://www.goodreads.com/book/show/8533983-as-filhas-do-assassino", "http://www.goodreads.com/book/show/15015228-the-comfort-of-lies", "http://www.goodreads.com/book/show/18774980-accidents-of-marriage", "http://www.goodreads.com/book/show/30753736-the-widow-of-wall-street", "http://www.goodreads.com/book/show/17800629-atria-book-club-bites", "http://www.goodreads.com/book/show/40114585-trois-secrets", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}