{"ratings": 30, "userreviews": [{"userName": "Laurel", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/4619724-laurel", "userReview": "THE MAN IN THE CINDER CLOUDS is one of those middle grade books that the grown-ups get sucked into along with their kids. You think you bought if for your young reader but after you browse chapter one you just sort of... can't stop.For the kids: The story starts with an adventure gone dreadfully boring as a boy accompanies his dad on an expedition to the North Pole. He discovers that the exotic location can't overcome the drudgery of hanging out with scientists for a few weeks, even if Santa Claus is reputed to live somewhere nearby. The scientists make a discovery in the ice, though, that captures not only Jason's imagination but everyone else's. For one thing, not even the scientists can figure out why the book they've found appears to each person in his native language.If the book they've uncovered is what it seems, it tells the tale of how Santa Claus came to be the figure we all know today. The traditions and images we associate with Santa are all rooted in his first Christmas venture to find one example of goodness in humanity. He fulfills his own quest while helping a brother and sister who desperately need an ally. For the grown-ups: THE MAN IN THE CINDER CLOUDS is intricate, with two stories unfolding together as Jason discovers the history of Santa Claus and the children in the Santa story overcome their own hardship by taking care of each other. It's also funny, with humor and references the kids will get but doesn't rely on lowbrow jokes that an older reader would just find silly. The wit shines through in chapter one and the story carries you right through to the end.I'm going to recommend this one to my school librarian as well as my kid's teachers. Charming, satisfying, warm, and plain old fun to read."}, {"userName": "Susan Quinn", "userReviewDate": "Jul 21, 2011", "userURL": "http://www.goodreads.com/user/show/3334005-susan-quinn", "userReview": "The Man in the Cinder Clouds, Rick Daley's delightful Christmas Tale, is a story within a story within a story. I love how Rick weaves these three plots together, each dependent on the other, nested like Christmas Dolls.In the first, we follow Jason to the North Pole where his father's scientific team is drilling for ice cores (go science! Points for arctic coolness here). Instead they find a magical book that tells the second tale, of one Kris Kringle before he was the chief bringer of gifts. Kris' search to find his true family and proof of human virtue leads us to the third tale, the story of Aaron and Alice, two orphaned children struggling to survive in a long-ago time when life wasn't easy for anyone, especially children dependent on nasty uncles trying to rob them of their inheritance. The three stories twist and turn together, bringing modern and ancient adventures together with a splash of magic and the wonder of Christmas in this completely fresh take on the story of Santa Claus.There is some peril of main characters in the book, so I wouldn't recommend The Man in the Cinder Clouds for the very young, but it makes a great Christmas read for readers age 7+."}, {"userName": "D. Robert Pease", "userReviewDate": "Aug 24, 2011", "userURL": "http://www.goodreads.com/user/show/3479682-d-robert-pease", "userReview": "Just in time for the Christmas season, a fabulous re-imagining of the origins of Santa Claus. Kids will love it, and adults will enjoy reading it to them. Even though the language in The Man in the Cinder Clouds is simple enough for young readers, it almost feels like one of those stories that must be read out loud. For this forty-something father, it brought back the magic I remember as a child when I watched the Christmas specials on TV, except this story seemed more \"real\". I definitely think it could be a new classic, allowing modern kids to feel the same sense of wonder we all felt when we were young. If you have young kids, all the way up to fifth grade or so, this is a story you must have before the holiday season rolls around."}, {"userName": "Peggy Sims", "userReviewDate": "Aug 29, 2011", "userURL": "http://www.goodreads.com/user/show/5395714-peggy-sims", "userReview": "I won this book the man in the cinder clouds written by Rick Daley on goodreads free giveaway. With the intention of giving it to my grandson. I decided to read a few pages and found myself enjoying the book. I like the modern way that the author kept the spirt of kris kringle Santa Clause alive in all our hearts. Thank you Rick Daley I will share this book with others. Its a really feel good book for all ages. HOPE THERE WILL BE OTHER BOOKS TO COME......"}, {"userName": "Funbooks", "userReviewDate": "Nov 23, 2011", "userURL": "http://www.goodreads.com/user/show/440714-funbooks", "userReview": "Did you ever wonder...? The Rest of the Story, Santa style! Clever and imaginative telling of how Santa came to be the man he is today. well written and fast paced. I'd give it 4.5 stars if I could!"}, {"userName": "Sharon", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5895202-sharon", "userReview": "Very creative! Easy and fun reading for all ages! Would make a great xmas movie!"}, {"userName": "Red Dwyer", "userReviewDate": "Apr 29, 2012", "userURL": "http://www.goodreads.com/user/show/8869256-red-dwyer", "userReview": "This is a delightfully different twist on the Santa story. The characters are well developed and easily identifiable. Definitely on my recommended list for everyone who loves Christmas."}, {"userName": "Julienne Siano", "userReviewDate": "Dec 26, 2012", "userURL": "http://www.goodreads.com/user/show/10648977-julienne-siano", "userReview": "Very very cute story. Perfect for this time of year. Enjoyed learning where the traditions originated"}, {"userName": "Cathy", "userReviewDate": "Oct 19, 2011", "userURL": "http://www.goodreads.com/user/show/4355050-cathy", "userReview": "Very nice story about the beginnings of Santa Claus."}, {"userName": "Laurie Carlson", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/4898049-laurie-carlson", "userReview": "A CLASSIC! I give this a \"10\" STAR book! Although I can only give it 5, bummer! It does deserve 10!So, you think you know everything there is to know about Santa Claus? Guess again! You don't even know a sliver of the history behind Santa! Did you know Santa is part elf? Yes!This is not 'just' a children's book, it is a book for adults, as well. It's a story within a story. This magical story captivates you as you read it. It pulls you right into the story. First allow me to tell you how we learn this story is all about Santa Claus, Kris Kringle, and all the other names he is known as today around the world, in all the different countries. Every year he comes, almost since the beginning of time itself.This story starts off in the modern world, with Professor Hodgin working at the north pole with other scientists, drilling deep cylinders into the ice studying them for the effects of global warming. One time the professor decides to take his youngest son, Jason, along with him so he could see the type of work he is doing at the North Pole.Just last year, Jason's older brother, Justin, had told him Santa was not real, but Jason refuses to believe him. As they were on their way to the North Pole, Jason did expect to see Christmas villages, lights, reindeer games, and more. Instead, all he saw was snow, cold, and stuffy old scientists who thought they were fooling him into believing they really had seen an occasional reindeer, and that they did see Santa one time. He knew one thing was true, it was COLD!As Jason continued to get more bored as each day wore on, all of a sudden there was sudden commotion. The scientists had drilled into one of the deepest areas of ice, and inside that ice cylinder they found a book. They wanted that book and got it out. This book turned out to be thousands of years old. They all took turns reading the cover of the book, and the most incredible thing happened to anyone who spoke a different primary language. They were all able to read the book in the language they spoke. It was as if the book magically customized itself to each person reading it. Amazing! They could not believe their eyes! This was just the start of the magic of this book.So the story starts, all about Santa, oh, wait, I mean Kris, Kris Kringle, when he was a mere babe, found swaddled in rags in the brush out in the open, abandoned and left to die. An elf, Kristina, went out for a walk with her infant son, and came upon this poor human baby left out in the elements. She could not leave him there to die, so she picked him up and nursed him to health. There is so much more to this story with the elves, too. This is where this book jumps to life.Jason took over the book, and started to read it aloud, starting from the very beginning of the book, and all the way through. The story tells us how Santa came to be.This story goes on to explain different Christmas traditions, how Kris decided to deliver gifts to children all over the world and more.This story is quite magical! It is unlike ANY other Christmas story about Santa ever written. This magical story grabbed me from the very beginning and I could not stop reading it until the very end. I've actually read it twice, and reread other sections a third time! I just LOVE this book! You NEED a copy of this book in your library!This book is SURELY to become a Christmas Classic over time! You HAVE to read this!I HIGHLY RECOMMEND this book! You will want to read it every year, and the year after that, and after that, and after that, until it is memorized! No one is to old for this book!You can find out more about this book at www.cinderclouds.com and, Rick Daley, the author, has a personal blog at http://www.mydaleyrant.blogspot.comYou can follow Rick on Twitter as @rjdaley101071 Facebook: Friend Request \"Cinder Clouds\" You can also purchase this book at the link below through Amazon. Again, I HIGHLY suggest this book! It is one you will NEVER FORGET!A CLASSIC HAS EMERGED!"}, {"userName": "El Video", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/564797-el-video", "userReview": "NOTE TO ANY WHO READ THIS:Let me start this by making a statement: I have never written a review before. Bear with me as I attempt to correctly express my opinions on this novel.Also, I don't like rating systems with numbers or stars at all. It's too subjective … what does a 3/5 mean to me, as opposed to what it means to you?Here is how I rate books …1) Sell the book back - this means I probably didn't finish the book, or I did, but I really don't want it around any more. This is the worst thing I can do to a book, really.2) Shelf the book - this means that I enjoyed the book enough to read it all the way through, I am not sure whether I'll read it again, but hey it's there if I want to. I probably won't be telling anyone about it though.3) Pass the book along - this means I loved the book, I plan on reading it again, and that I will most definitely tell my friends that they should read it too. Basically, if I tell someone to read a book I have to have loved it.BLAH BLAH BLAH Here's my Review:THE MAN IN THE CINDER CLOUDS is a fresh and humorous take on the man we all know as Santa Claus (Cinder Clouds).It starts off from the viewpoint of a present day child who is stuck at the North Pole with his father's exploratory mission to find ice cores. What he thought would be an adventure turns out to be just plain boring … that is, until his father and Co. find a mysterious text buried in the ice. This text details the life of the man we know as Santa Claus (Cinder Clouds) and his unyielding belief that humans, every once in awhile, display true virtue. This is shown not only through the Cinder Clouds portion of the book, but also through the present day part. But, that is the ending, and I won't ruin that.Now, I won't rehash the story in boring detail, but know this, the story is good, really good. Why should you read it? Well, why not? It's a light, quick read with a wonderful message. It's engaging and will keep you turning the pages.Things I liked: Aaron and Alice were fun to read. Their uncle was a perfect villain and just enough background was given to let the reader know why he was such a miserable old coot. The same goes for his son, Thomas. The lesson that in most situations it is better to act altruistically than selfishly doesn't beat you over the head, but is present enough for anyone to pick it up. Plus, the story makes you feel good. And that's what it is all about, right?Things that bothered me: I would have like to have more of the story about Jason. It seemed less developed than the Cinder Clouds parts. But, that was really all I can complain about. How bad is a complaint when it is just asking for more?All in all, THE MAN IN THE CINDER CLOUDS gets a Pass the book along. In fact, I think one of the highest compliments I can give it is that it will sit on my son's bookshelf until he is old enough for me to read it to him."}, {"userName": "Sher A. Hart", "userReviewDate": "Dec 14, 2011", "userURL": "http://www.goodreads.com/user/show/6104899-sher-a-hart", "userReview": "Please read the blurb to learn the premise. Who could resist a book written by an elf about the origins of Santa Clause? I couldn't, and I'm a little past (okay, way past) the target audience's age. The book was a little like the Princess Bride, a story inside a story. In this case, I'd say nested Christmas presents, and altogether a very nice package with plenty of excitement in the unwrapping. Too bad I had to fly back home before I finished reading to my sister's grandchildren. We went through 8 chapters while driving around seeing Christmas displays. Every time we got back in the car, they wanted more. I was sad they never got to enjoy some very funny stuff about the animals pulling the sleigh, not the ones you think. Rick's dialogue was often funny, an important skill to keep kids and teens entertained. Okay, adults too. There were also some tense moments for Kris Kringle along the way to proving to the Elfs that there was some goodness in mankind. Explaining how two children's lives were in danger would spoil the story, so just make sure not to leave off at those places right before bedtime if reading to very young children. Yes, you should read it to very young children. I read Tolkien to my kindergarten son when he balked at learning to read, and he became a voracious reader. Try this book on your young ones if you don't believe me. If you're still not convinced, but have ever seen your children act selfish or mean, you won't find a better way to convince them to mend their ways without them knowing they're being taught. They'll also gain a new appreciation for the necessities of life like a home,food,warm clothing,and health. You'll also find out how Santa's hair turned white, how he fits all those toys into one bag, and a sleighful of other neat surprises. Overall, it was a very inventive story.I was surprised to find how well written the book was until I remembered Rick's writing background. And then Susan Quinn, author of the awesome YA Open Minds, told me Rick is in her Indelibles group, which may partly explain the very clean copy. The book isn't perfect. As a writer I would have given it 4.5 stars, but for kids and teens it's a definite 5 star. Go buy it now. If your children are young now,they'll want to read it every year,eventually to their own kids."}, {"userName": "Tami", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/1472968-tami", "userReview": "I haven't received yet. Just received notice I had won. 8/31/11Received Saturday 9/3/11, started and finished yesterday 9/5/11Jason goes to the North Pole with his father on a work trip. His older brother told him Santa Clause is not real, so he takes along his camera to get proof his brother is wrong. His father and his coworkers are drilling into the ice to study the effects of global warming. They accidently drill a hole right through the middle of a book. Then they get out their picks and shovels and dig up the rest of the book. This story is about the father reading through that book.I love this story. Sure it is short and sweet and a little fluffy, but how fun! I am so excited I won this book, and I can't wait for my nieces and nephews to read this book too. It will help everyone BELIEVE again."}, {"userName": "Brogan", "userReviewDate": "Dec 19, 2011", "userURL": "http://www.goodreads.com/user/show/7141314-brogan", "userReview": "The Man in the Cinder Clouds is a great representation of the selfless giving we associate with the holidays. I fully expected the book to be just another adaptation of the classic Christmas stories for the amusement of children. Despite being written in simple language appropriate for elementary and middle school students, The Man in the Cinder Clouds is a refreshing spin on how Santa Claus came to be. Rick Daley has done a fantastic job of weaving fantasy with realistic concepts every reader can relate to in order to explain the existence of our favorite Christmas icon. Overall, a well-written story that I will be more than happy to recommend and pass on to friends."}, {"userName": "Larry", "userReviewDate": "Dec 20, 2011", "userURL": "http://www.goodreads.com/user/show/3601602-larry", "userReview": "I received this book as a first reads selection a while ago. I picked it up for a fill-in after another read that was hard to get into. This book is an easy read and moves along. The setting is a modern day arctic research station and the incidental finding of a book in an ice core drill sample. The gist of the story is the origin of Santa Claus with the subtle undercurrent that the concerns of the Elf High Council are still at issue today. Enjoyed the easy read and the reminder the story provides."}, {"userName": "Anita Macauslan", "userReviewDate": "Feb 18, 2013", "userURL": "http://www.goodreads.com/user/show/5930093-anita-macauslan", "userReview": "Awful, just awful! An ancient book is found under thousands of years worth of ice; great start for some sort of a lore-based work of fiction, especially given the title. I really had such high hopes... But the idea fell flat when it went on to turn into Christian propaganda that isn't even based on actual Christian beliefs. I don't really know what else to say. Yes, it's a children's story, but one that is entirely lacking in creativity."}, {"userName": "Jeannie", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/2731284-jeannie", "userReview": "I won this book through the Goodreads First-reads giveaway program,\"Thank You!\" to goodreads and Rick Daley \"The Man in the Cinder Clouds\" Is a Christmas Tale,that is a story within a story. I loved the way they intertwined! The plot, storyline and events were well written.I highly recommend this book!! Its a fun quick read.Rick Daley is Great new author! ♥:)♥♥~♥"}, {"userName": "Nancy", "userReviewDate": "Jun 29, 2016", "userURL": "http://www.goodreads.com/user/show/2589071-nancy", "userReview": "A new twist on Santa Claus. Enjoyed it."}, {"userName": "Kasia Hubbard", "userReviewDate": "Oct 24, 2011", "userURL": "http://www.goodreads.com/user/show/4845841-kasia-hubbard", "userReview": "I won this on Goodreads. I received my copy on October 26."}], "description": "The freezing temperature is the only thing cool about Jason’s trip to the North Pole, but things heat up when his father discovers a book buried deep in the ice. This is no ordinary book, mind you. For starters, it was written by an Elf. And if that’s not enough, the book proves the existence of Kris Kringle—you know, Santa Claus.Born human but abandoned as a baby, Kris is rescued by Elfs and grows up among them…but he doesn’t really fit in. Kris embarks on a quest to find his true family among the humans by delivering presents on Christmas day. But there’s a catch: the High Council of Elfs is convinced humans are wicked at heart, and Kris can’t return to his Elfin home unless he can prove otherwise. His journey takes him all the way to the legendary Great Northern Glen, and from there to the town of Oldenton, where he finds two orphans who are about to lose everything they have to a greedy uncle. With only days before Christmas, Kris must try to help the kids, deliver his presents, find his family, and prove that human virtue does exist…even in the most unexpected of human hearts.", "title": "The Man in the Cinder Clouds", "url": "http://www.goodreads.com/book/show/12085498-the-man-in-the-cinder-clouds", "average": 4.3, "cover": "https://images.gr-assets.com/books/1312896816l/12085498.jpg", "reviews": 19, "authors": [{"url": "https://www.goodreads.com/author/show/5054515.Rick_Daley", "name": "Rick Daley"}], "type": ["Holiday", "Holiday"], "outlinks": ["http://www.goodreads.com/book/show/12085498-the-man-in-the-cinder-clouds", "http://www.goodreads.com/book/show/12460661-the-man-in-the-cinder-clouds", "http://www.goodreads.com/book/show/12291961-the-man-in-the-cinder-clouds", "http://www.goodreads.com/book/show/15734091-rudy-toot-toot", "http://www.goodreads.com/book/show/17857351-indiestructible", "http://www.goodreads.com/book/show/13561529-variations-on-a-theme-anthology"]}