{"ratings": 170000, "userreviews": [{"userName": "mark monday", "userReviewDate": "Oct 18, 2012", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "RIDDLE ME A MARTIAN RIDDLE۞A Riddle: What walks on two legs, uses two arms, talks like a human, acts like a human, kills humans, replaces humans, wants to be accepted and loved by a human?Answer: A Martian!۞A Riddle: What walks on two legs, uses two arms, talks like a human, acts like an animal except that's unfair to animals, kills others of its kind, wages war on its own kind, and destroys its own planet?Answer: A Human!۞A Riddle: What is built like a succession of linked stories, feels at times like a play by Brecht, feels at times like a mournful and elegiac ode to the dying of small towns, is a wise tale of human nature, is written with melancholy and sighs, is quietly sinister, is gently tragic, yet is also a science fiction novel?Answer: The Martian Chronicles!۞A Riddle: What is a ball of blue fire, a transcended entity, a being that lives in God's grace, a model of wisdom and goodness, and a terrifying symbol of the unknowable? What is meek and shall inherit their earth - but has lost the inclination?Answer: A Martian!۞A Riddle: What should have stayed on its own planet? What does not belong on Mars? What persists in persisting? What flees from home? What destroys that home? What flees back to that destruction? What eradicates much of what it comes into contact? What is a hopeless fool? What has a little - just a little - hope for it yet?Answer: A Human!۞A Riddle: What is science fiction as parable? What creates a series of haunting and haunted tableaux onto which we can project our own desires and fears? What transcends genre trappings? What is a landscape of forgotten plans and failed goals? What is like a waking dream? What is a journey that begins in death and ends with a small, fragile chance that all is not lost? What is like tears painted on a page? What is witty and sardonic and tender and angry and, finally, full of its own strange and painfully human soulfulness?Answer: The Martian Chronicles!"}, {"userName": "Nataliya", "userReviewDate": "May 02, 2010", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "\"We earth men have a talent for ruining big, beautiful things.\"The Martian Chronicles, a perfect example of what I'd call a 'quintessential Bradbury' - fragmentary, at times disjointed, occasionally crossing the line into the realm of surreal, full of his trademark nostalgia and sadness, this account of the failed American Dream approach to the exploration of the ultimate frontier never stops fascinating me and drawing me in with its inexplicable charm. (Side note: as a person of Russian descent, I reserve the right to run-on long-winded sentences in the best tradition of Tolstoy and Dostoyevsky of which my literature-teacher mother clearly approves).It is such a multifaceted tale! It is a condemnation of the dear to the human heart way of 'exploration' and colonization - that is, coming to a place new to us and attempting to turn it into a carbon copy of 'home', of the place where we come from, of the place that gives us comfort - and all else be damned. It is an ode to the beauty of the strange and un-understood alienness. It is a criticism of the American Dream which was written in the heyday of this 'Dream'. It is a thinly veiled cautionary tale about the perils of science when misapplied. It is all of the above and none of the above, with everything masterfully interwoven to create a unique unforgettable reading experience.'Who wants to see the Future, who ever does? A man can face the Past, but to think - the pillars crumbled, you say? And the sea empty, and the canals dry, and the maidens dead, and the flowers withered?' The Martian was silent, but then he looked ahead. 'But there they are. I see them. Isn't that enough for me? They wait for me now, no matter what you say.'The story, for those who somehow are not familiar with it, is simple. In the far future of 1999, rocket ships from Earth start coming to Mars. The Martians - the enigmatic, serene, telepathic race - sense the disturbances. Eventually they die off, and the colonization in the American Dream style begins, until the nuclear war on Earth interferes. But the narrative is not quite this linear. It is made of separate, rather stand-alone short stories that often read as interludes, some straightforward, some surreal, but all of them quite haunting, memorable, and thought-provoking. Bradbury is (was, actually - I still can't believe he's dead) a master of writing peaceful, nostalgic sadness that feels upliftingly purifying. His writing is poetic and lyrical, often dreamlike, with almost a musical quality to it. He often straddles the line between cautionary and moralistic, but mostly succeeds at not crossing over to the unpleasantly preachy side. He is exceptionally good at writing amazing short fiction - since this is what this book essentially is, a collection of interlinked short stories. He manages to create a memorable, beautifully flowing, sophisticated story without a steadily progressing plot, without a main or even a major character, without even a consistent setting.\"Night are night for every year and every year, for no reason at all, the woman comes out and looks at the sky, her hands up, for a long moment, looking at the green burning of Earth, not knowing why she looks, and then she goes back and throws a stick on the fire, and the wind comes up and the dead sea goes on being dead.\" =================================Now, as an aside, I heard this book described as 'not really a science fiction book but a speculative fiction book' quite a few times, almost apologetically, as though science fiction is something to be ashamed of. I understand that this book is essentially a crossover phenomenon which appeals to sci-fi fans and 'general public' alike, and describing it as something else besides sci-fi can help generate a wider audience and a broader appeal. But hey, I realized that I don't want to be the person falling into this trap - the trap of dismissing sci-fi as something that is not literary enough, something of interior quality, something to be apologetic about. Bradbury, Le Guin, Miéville, Lem (insert your own favorite acclaimed sci-fi author here) are NOT great writers that...ahem...just happen to write sci-fi but maybe not quite really. They are excellent sci-fi writers, and that's how I recommend their books, even at the threat of losing potential audience. After all, Bradbury's The Martian Chronicles was not only one of the first books that I checked out of the 'adult' library, but also the book which cemented my love for science fiction, first fueled by Poul Anderson's Call Me Joe. The Martian Chronicles is an excellent book, the one that I will continue to re-read every few years or so. It deserves ALL the stars. \"The Martians stared back up at them for a long, long silent time from the rippling water.\""}, {"userName": "Matthew", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "The Martian Chronicles is a book I have heard about for years, but ended up passing it by in lieu of other Ray Bradbury classics (do you need to qualify them by saying “classic”? I think that goes without saying). I have now finally read it and it is amazing. I continue to be impressed with Bradbury’s writing style – and his style is very well defined. I am pretty sure he is so integrated into how and what he writes, I could probably guess that a book is written by Bradbury after just a few paragraphs (and that is not me bragging on my ability to figure out who wrote something, it is just that obvious that it is Bradbury).When I went into this I thought, “Martian Chronicles = Sci-Fi”. That is very wrong! This book felt much more like his Magical Realism titles I have read. While most of the book takes place on Mars, the content is not about space travel, and aliens, and cool technology. It is about the human condition, perception vs reality, misuse of natural resources, man seeing himself as an island, etc. It is a commentary on people and the tendency for our hopes to be destroyed by our inability to truly see the best and right course of action. Generally it is very dark – there is a little ray of hope to it, but the overall feel is if we don’t get our s#!t together, we are doomed.So, if you are looking for sci-fi and want nothing less than space battles and cool spaceships, this is not the book for you. If you are a fan of other Bradbury, cautionary tales, and speculative fiction, this is right up you alley."}, {"userName": "Bookdragon Sean ", "userReviewDate": "Jul 18, 2015", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "For centuries man has dreamed about going to Mars. He has finally achieved this monumental feat, and when he arrived he expected to be greeted as a hero; he expected to be greeted with open arms by the Martians. But, alas, the Martians have a very different opinion to the aliens that invaded their planet.  A funny, and realistic, response When the Earth men arrived the Martians murdered them for a number of wacky reasons. They feared that the invaders would steal their wives and also that the humans were in fact Martians merely pretending to be humans, this, according to their lore, is one of the many signs of madness. So, the Martians euthanized them. Yes, euthanized them. This made me laugh so much because man, in his naivety, expected an entirely human reaction from an alien race. They couldn’t comprehend that perhaps the aliens may be different to themselves; they didn’t consider that their so called expeditions could be received so negatively. \"It is good to renew one's wonder, said the philosopher. Space travel has again made children of us all.\"Indeed, as ever man did not stop to think about what he was doing: he simply rushed in and expected the best. He ignorantly presumed that he wouldn’t be received as a threat and an invader that needed to be fought off. Time and time again man repeats his mistakes and, for me, this formed the main motif of this collection of short stories. Man just never learns. This is signified by the repeated expeditions into the unknown that only ended in disaster, first for the humans and then eventually for the Martian people.  Bradbury questions human existence A very dim view of humanity is evoked in these pages. Bradbury suggests that Martian culture has transcended its human counterpart; the Martians have accepted an animalistic ethos in which they live for the simple sake of existence. They do not question religion or science; they blend the two together in a display of cultural harmony. However, the brutish man is too limited to do this and as a result has lost all sense of faith. The image of the Martian way of life is captured in the serene beauty of their cities, which is juxtaposed against the humans incessant wondering on foreign soil. \"We earth men have a talent for ruining big, beautiful things.\"I think in drawing this parallel Bradbury makes a suggestion on the foolish nature of man. By contrasting the two cultures we see that man will never be fulfilled and complete; he will be harboured by a perpetual longing to have more than he has. The continuous visits to Mars symbolise this. Earth is not enough for man, he wants Mars too. Perhaps I am reading too much into this but I think in this Bradbury creates a message that is strong and true. These short stories come together to provide a picture of man that highlights some of his less admirable qualities.This is a great collection of science fiction stories that, together, speak louder than they do alone. Whilst each is individual they are, of course, meant to be read as a collection. This provides a comment of the nature of man, and a highly entertaining reading experience."}, {"userName": "Fabian", "userReviewDate": "Aug 21, 2014", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "A magnificent experience in which we discover that the inhabitants of the fourth planet in the Milky Way Solar System are identical in the trifles of the everyday as the resident in the 3rd planet. Then some collective idea pops out of nowhere--a fine symbol of apocalypse and annihilation--& scares the living shit outta everyone.I know I haven't read much sci-fi in the past, but I know that to top this one will be VERY tough.\"Martian Chronicles\" surpasses, in some ways, that which Bradbury tried, and admits to imitating with this collection of short stories (the crazy masterpiece, \"Winesburg, Ohio\" by Sherwood Anderson). The fear that permeates in these pages-- a horror novel more than a sci-fi one (well, early sci-fi is mostly always horrific)-- is un-peggable, untraceable, and just completely... yep, Martian. It is eerie at a supreme level... truly heightened emotions in this 50's version of our future. The Chronicles turn Voltairesque, then it all becomes a western as fixed and terrible as anything by Cormac McCarthy full of guns and violence, then takes a Tarantino turn of events, robots and-- It's all one powerful and unique oxymoron. Bradbury writes just the perfectly extra adjective in many of his sentences. Maybe one extra more than needed. Et voila-- amazingness! It's tidily overindulgent and superfluously concise... A Terrific, Terrible Wonder!"}, {"userName": "Lyn", "userReviewDate": "Nov 02, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "Poetic science fiction. Being set in the future and involving space travel, Mars and futuristic technology makes this fit into the science fiction genre, but Bradbury is a writer of literature. This is beautiful writing and Bradbury is an artist with a mastery of the language. Mars could be another dimension, or fairy land, it does not really matter, Bradbury has concocted an alternate reality to explore psychological ethos. If Heinlein is the science fiction ideologist / sociologist, and Clarke the science fiction anthropologist, and Asimov the science fiction theologist; then Bradbury is the science fiction psychologist. Martian Chronicles is a chronological set of short stories tied together around the theme of Earth colonization of Mars, but it is really about the human psyche and a study of what is best and worst about us. SF must read."}, {"userName": "Adina", "userReviewDate": "Dec 04, 2015", "userURL": "http://www.goodreads.com/user/show/22189348-adina", "userReview": "I enjoyed this short story collection a lot more than the famous, Fahrenheit 451. I believe Ray Bradbury has an exceptional talent writing short stories. I am not a fan of short stories in general, however, I was totally absorbed and fascinated by this book. I was expecting the stories to be something different than what i read, something more Science Fiction. Yes, it does have a bit of space travel, some alien encounters, some \"hi-tech\"technologies but they are totally not the point of these stories. I guess the main idea I got can be summarized by the following quote: “We earth men have a talent for ruining big, beautiful things.”The martian Chronicles are stories about destruction, in many forms caused by what humanity has worse: war, censorship, ignorance, disrespect for other cultures, greed, fear etc. The stories are beautiful, fascinating but very disturbing and scary in the same time. It made me meditate on the future of humanity and for long we will be able to survive as a race, doing what we are doing. Will we be condemned to destruction? I leave you with some quotes below: “There was a smell of Time in the air tonight. He smiled and turned the fancy in his mind. There was a thought. What did time smell like? Like dust and clocks and people. And if you wondered what Time sounded like it sounded like water running in a dark cave and voices crying and dirt dropping down upon hollow box lids, and rain. And, going further, what did Time look like? Time look like snow dropping silently into a black room or it looked like a silent film in an ancient theater, 100 billion faces falling like those New Year balloons, down and down into nothing. That was how Time smelled and looked and sounded. And tonight-Tomas shoved a hand into the wind outside the truck-tonight you could almost taste time.” “I'm not anyone, I'm just myself; whatever I am, I am something, and now I'm something you can't help.” “They began by controlling books of cartoons and then detective books and, of course, films, one way or another, one group or another, political bias, religious prejudice, union pressure; there was always a minority afraid of something, and a great majority afraid of the dark, afraid of the future, afraid of the past, afraid of the present, afraid of themselves and shadows of themselves.” “Ignorance is fatal.”"}, {"userName": "Megan Baxter", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "Wow. Just...wow. Why have I never read this before? Ray Bradbury has written an amazing, lyrical, spooky-as-hell set of pieces that all add up to something much more. Some are very brief, mere sketches of events. Others are full-length short stories.Note: The rest of this review has been withdrawn due to the recent changes in Goodreads policy and enforcement. You can read why I came to this decision here.In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Apatt", "userReviewDate": "Aug 29, 2011", "userURL": "http://www.goodreads.com/user/show/2457095-apatt", "userReview": "Since Ray Bradbury passed away (about a month ago at the time of writing) it occurred to me to reread his books that I have read before, and read the others that I have missed. After rereading Something Wicked This Way Comes last month I thought I'd read Fahrenheit 451 but as it turned out The Reddit SF Book Club chose The Martian Chronicles as book of the month (July 2012) so in order to keep up with the Joneses here we are! How about that for a useless intro?This book is a fix-up novel which is something between an anthology and a novel, and it benefits from both of its sibling formats. The stories are interrelated with only a few recurring characters but read together the whole is certainly greater than the sum of its parts. It is also worth noting that while the table of contents look as if there are almost 30 stories in the book, quite a few of these are not really stories in themselves but brief passages that lead to the next story or provide background information to move the major story arc of the book forward. In general the book tells the story of the colonization of Mars, which in a sense is a little bit like the reverse of H.G. Wells' The War of the Worlds in that we invade Mars and they fight back in their quiet ways only to meet the same fate as their counterparts in Wells' book. The major difference is that there is no interplanetary war and it is only the first part of the Chronicles.I just want to make a few notes on the main stories, the brief interludes are also great but too short my noting purposes.Ylla (February 1999/2030*)A Martian woman dreams (or have a premonition) of an Earthman's arrival. The actual First Contact does not go well.The Summer Night (August 1999/2030)Name that tune! suddenly an Earth song becomes a hit on Mars but none of the Martians can name it because they pick it up telepathically. The song's lyrics remind me of Stairway to Heaven a bit.The Earth Men (August 1999/2030)This one starts off as a comical First Contact story, with the Earthmen not getting the rock star welcome they expected. It soon becomes rather tragic and ends on a dark melancholy note. Wonderful story.The Third Expedition (April 2000/2031)A little creepy in a nice sort of way, reminds me a little of Invasion of the Body Snatchers. No point noting especially that it is a great story because they all are in this book.And the Moon Be Still as Bright (June 2001/2032)Us Earthlings do have a tendency to ruin everything we touch with our inconsiderate and uncouth ways. Love that teeth knocking ending!The Settlers (August 2001/2032)\nmost men felt the great illness in them even before the rocket fired into space. And this disease was called The Loneliness, because when you saw your hometown dwindle the size of your fist and then lemon-size and then pin-size and vanish in the fire-wake, you felt you had never been born, there was no town, you were nowhere, with space all around, nothing familiar, only other strange men.\nI just love this passage, so evocative!The Green Morning (December 2001/2032)Miraculous bit of terraforming.Night Meeting (August 2002/2033)A sort of meeting in The Twilight Zone, feels like a ghost story but is not one. More of a time traveling tale but who is doing the time traveling?The Musicians (April 2003/2034)Damn kids using Martian bones as xylophones!Way in the Middle of the Air (June 2003/2034)A wonderful heartfelt story about the Black Americans who have had enough of being lorded over and just want to emigrate to Mars.Usher II (April 2005/2036)This really does read like a Poe story, or a cross between Fahrenheit 451 and Theatre of Blood (old Vincent Price movie).The Martian (September 2005/2036)Poor little Martian boy. One of the best stories herein.The Watchers (November 2005/2036)En masse de-colonization.The Silent Towns (December 2005/2036)A comical story about the last man in the world and the girl he is almost fated to marry. LOL!The Long Years (April 2026/2057)I like the robo-family.There Will Come Soft Rains (August 4, 2026/2057)I am not sure if this story is in the public domain (though I doubt it) but the full text seems to get posted online a lot. The first time I read it was as a standalone and I did not really appreciate it. For me reading this story out of the context of The Martian Chronicles does not quite work because I did not know what led up to the abandonment of the automated house at the centre of the story. Now having read the preceding chapters this story has stronger impact.This is Bradbury at his poetic best.The Million-Year Picnic (October 2026/2057)Nice optimistic ending.I am useless at deciphering themes but it seems that there is a subtext that we as a species have a nasty tendency to ruin everything, but we are not completely hopeless if we would only try harder to live in harmony with each other and with nature.Fantastic from beginning to end, and effortless 5 stars.Note:* A 1997 edition of the book advances all the dates by 31 years (thus running from 2030 to 2057) (from Wikipedia)"}, {"userName": "Ted", "userReviewDate": "Jul 20, 2014", "userURL": "http://www.goodreads.com/user/show/7213075-ted", "userReview": "[here Wiki says “ten thousand dollars”; but the interview cited as the source of the story (ref. Paris) says “seven hundred fifty dollars” – maybe the Wiki writer thought they’d be cute by adjusting it for inflation? (hide spoiler)]"}, {"userName": "David Schaafsma", "userReviewDate": "Aug 26, 2012", "userURL": "http://www.goodreads.com/user/show/269235-david-schaafsma", "userReview": "“We earth men have a talent for ruining big, beautiful things.” The Martian Chronicles tells the story of humanity’s repeated attempts to colonize the red planet.I listened to this book, and my version features an introduction by Bradbury, wherein. we hear that Bradbury met Aldous Huxley, who read this book and insisted Bradbury was a poet. That makes sense to me, especially if you consider passages such as this:“There was a smell of Time in the air tonight. He smiled and turned the fancy in his mind. There was a thought. What did time smell like? Like dust and clocks and people. And if you wondered what Time sounded like it sounded like water running in a dark cave and voices crying and dirt dropping down upon hollow box lids, and rain. And, going further, what did Time look like? Time look like snow dropping silently into a black room or it looked like a silent film in an ancient theater, 100 billion faces falling like those New Year balloons, down and down into nothing. That was how Time smelled and looked and sounded. And tonight-Tomas shoved a hand into the wind outside the truck-tonight you could almost taste time.” This book is less conventional novel than a series of lyrical vignettes stitched together to give us a sense of why a variety of Earth people might have come to Mars. The need to escape endless war, racism, environmental destruction. To Go Back to the Garden and begin again.The thing is, we are who we are, to a certain extent. Can we ever change? I was in therapy once and the guy asked me (the unhappy one): So move to Santa Fe, what would be different for you, how could you be happy there? I saw his point. Over time, in a new place, in a new relationship, I would probably be the same old me, unless I worked very hard to be different. I have changed, thankfully, in some ways. But can human beings as a species do that? Can we eschew capitalism and rapacious materialism and embrace the arts and care about each other and save the planet? It really looks doubtful.This book is shelved as science fiction, because Mars and space travel, I guess, but calling it speculative fiction would be closer to it. As in his autobiographical book Dandelion Wine, there is a streak of nostalgic despair in Bradbury, a hankering to go back to the days of his Waukegan, Illinois boyhood. He understands the hopefulness in some of his characters’ desires to go back to the times when some people seemed to appreciate the arts, when machines were feared more than revered. One can see how this 1950 book was embraced by the late sixties counter-culture movements. “Rocket summer. The words passed among the people in the open, airing houses. Rocket summer. The warm desert air changing the frost patterns on the windows, erasing the art work. The skis and sleds suddenly useless. The snow, falling from the cold sky upon the town, turned to a hot rain before it touched the ground. Rocket summer. People leaned from their dripping porches and watched the reddening sky.”“They knew how to live with nature and get along with nature. They didn't try too hard to be all men and no animal.”Bradbury says this book was written after reading Sherwood Anderson’s Winesburg, Ohio, and was initially a kind of attempt to recast that small town feel on Mars. And it’s there, in the focus on every day characters, in the sad nostalgia and sense of loss.But what actually happens, in Bradbury’s move to Mars?“The rockets came like locusts, swarming and settling in blooms of rosy smoke. And from the rockets ran men with hammers in their hands to beat the strange world into a shape that was familiar to the eye, to bludgeon away all the strangeness, their mouths fringed with nails so they resembled steel-toothed carnivores, spitting them into their swift hands as they hammered up frame cottages and scuttled over roofs with shingles to blot out the eerie stars, and fit green shades to pull against the night.” There’s a kind of admiration of Mankind in this passage, a kind of hopefulness in man’s determination, but there’s also a kind of dystopian despair. Rather than making a New World in the way of communes and cooperation, there’s a sense in which we would destroy Mars in the same way we destroyed Earth. When I first read this fifty years ago I thought this book was sweet, fanciful, both a romantic call to Tune In and Drop Out of conventional society and a dark warning of the Apocalypse. But today it reads to me like a sad elegy."}, {"userName": "Char", "userReviewDate": "Feb 16, 2016", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "The Martian Chronicles is an amazing collection of interconnected stories about Mars. Human missions to Mars, religious missions to Mars, nervous breakdowns on Mars, etc... Even though some of the tales are outdated by today's views, the underlying values and messages remain the same; they are timeless.Some of the stories have been released previously, and some have been changed over the years. I discovered, thanks to Wiki, that one tale having to do with race relations, was not included in this collection at all. I'm not sure it really matters, but just know that this anthology is NOT the same as it was upon its original release. There's not much new I can add to what's already been said about The Martian Chronicles. Ray Bradbury's writing is so simple, yet so evocative-he can get across in just a few words what it takes me paragraphs to say. His observations on human nature are spot on and even though these stories were written back in the 40's and 50's, most of them are still relevant today. Classics are classics for a reason and this one is truly special. My highest recommendation!"}, {"userName": "Erin ☕ *Proud Book Hoarder*", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/3048260-erin-proud-book-hoarder", "userReview": "4.5 stars“I have something to fight for and live for; that makes me a better killer. I've got what amounts to a religion now. It's learning how to breathe all over again. And how to lie in the sun getting a tan, letting the sun work into you. And how to hear music and how to read a book. What does your civilization offer?” I’m basically a noob when it comes to science fiction. Other than one Sci-fi book I dared (and enjoyed) a few years ago and a sampling of alien creature-features, I haven’t explored much inside this complex genre. Enter a book like this, a classic by an author who has given man several other timeless warnings.At first I worried it’d be difficult to get into since it seemed too out there, too surreal, but it didn’t take long to grab my interest and shake off my annoyance that the visitors were being given such a hard time. It’s a pet peeve of mine when characters aren’t believed. All made sense soon enough, so have a small amount of patience and all will be rewarded.When the final page is closed, what echoes and stands out is how beautifully unique this work is. It’s clever and much more layered than it starts. There is not only one central story or one central theme, but a showcase of journeys and stories throughout different ages. As time passes, more worsens and less progresses. Clearly it should be the other way around, but Bradbury’s heart seemed to be in dystopian and twisted futuristic fiction that shows man ruins societies and worlds he tries to improve.Pacing is no struggle at all once the beginning has eroded away. Each small story that shows a different view and time piece flies by, all leaving an impression without boring me. Sometimes I had to pause between pieces to mentally fathom the emotional jabbing. There is no one larger-than-life lesson or story here, for the pieces are too varied and artistic to come together where it would only fit into one mere puzzle.I think what impressed me most is how the surreal feel and epic imagery with the talented writing made me picture certain scenes so clearly. The slow movements of the faces and the turning heads with the wine pouring over the lips was downright creepy. The tragic face-changing finale of a particular tragic figure wanting to fit in and be loved is not forgettable. The haunting ending with the reflections – all shiver inducing stuff.‘The Martian Chronicles’ was such a strange beauty of a book. I shall not forget it. Varied and tragic, clever and haunting, it definitely deserves the classic stamp. Oh, and how nifty was that mini tribute to Edgar Allen Poe in one of the timelines? May the books never be burned. “All down the way the pursued and the pursuing, the dream and the dreamers, the quarry and the hounds. All down the way the sudden revealment, the flash of familiar eyes, the cry of an old, old name. Everyone leaping forward as, like an image reflected from ten thousand mirrors, ten thousand eyes, the running dream came and went, a different face to those ahead, those behind, those yet to be met, those unseen... And here they all are now, at the boat, wanting the dream for their own.”"}, {"userName": "José", "userReviewDate": "Jan 18, 2017", "userURL": "http://www.goodreads.com/user/show/35062854-jos", "userReview": "Podés encontrar esta y otras reseñas en mi blog.\n\nEste año me propuse comenzar a leer a Ray Bradbury, un autor que tenía pendiente desde hace un montón de tiempo. Por suerte me encontré con un autor maravilloso y por fin pude ver por qué sus obras son consideradas grandes \"clásicos modernos\".Crónicas Marcianas es, junto a Fahrenheit 451, el libro más conocido de Bradbury. Se trata de un libro que no sigue una estructura narrativa convencional, sino que está compuesto por varios relatos (o crónicas) que transcurren entre 1999 y 2026, y nos cuentan cómo los terrícolas llegan a Marte, los primeros contactos con los habitantes del planeta rojo y nos describen cómo era la vida en dicho planeta antes y después de la llegada de los seres humanos. A pesar de ser una serie de crónicas independientes, siempre hay alguna pequeña referencia a eventos narrados anteriormente y se mantiene cierto hilo conductor a lo largo de todo el libro.Lo que más disfruté de este libro fue lo variados que son las diferentes crónicas. Si bien todas giran en torno al mismo tema (cómo reaccionan los seres humanos ante lo desconocido y lo propensos que somos a la violencia), la forma en la que Bradbury lo trata es brillante: vas a encontrar relatos con cierto toque humorístico, otros bastantes macabros, relatos verdaderamente hermosos que son más que nada descripciones de Marte, crónicas en las que abunda la ironía y también otras que son bastante trágicas. La prosa de Bradbury me pareció fenomenal. A pesar de haber leído Fahrenheit 451 (que también me gustó mucho), creo que Crónicas Marcianas está mucho mejor escrito y refleja verdaderamente las capacidades narrativas de este gran autor. Es por esta razón que recomiendo que lo lean en el idioma original, si tienen la oportunidad.A pesar de tratarse de una novela que se ubica dentro del género de la ciencia ficción, considero que es un libro que tiene más de ficción que de ciencia. No te vas a encontrar con largas descripciones científicas acerca de los dispositivos tecnológicos y tampoco vas a encontrar alienígenas cabezones y de ojos enormes (de hecho, los marcianos que aparecen en este libro no son muy diferentes a los seres humanos), sino que la mayoría de los relatos exploran diferentes aspectos de la conducta humana ante lo desconocido y cómo siempre terminamos tomando el camino de la violencia. Otra cosa que me fascinó de este libro fue encontrar varios relatos que homenajean a diferentes autores. El caso más notorio es una crónica titulada «Usher II» que es un enorme homenaje a las obras más emblemáticas de Edgar Allan Poe, fue mi relato favorito. También pude apreciar referencias a las obras de Asimov y Lord Byron, e incluso «Usher II» está directamente relacionado con Fahrenheit 451. Te preguntarás qué tienen que ver Poe y Lord Byron con Marte, pero la forma en la que Bradbury se las ingenia para homenajear a estos grandes autores es brillante y no resulta disparatada en ningún momento; mientras leía «Usher II» no pude dejar de sonreír debido a la enorme cantidad de referencias ingeniosas que hay desde el principio del relato hasta la última frase. A pesar de que el resto de las referencias son más difíciles de apreciar (e incluso seguramente haya pasado unas cuantas por alto), me encanta ver cómo un autor rinde homenaje a sus ídolos o fuentes de inspiración, en especial cuando lo hace de una forma tan original y entretenida. Calificación 10+:Crónicas Marcianas es un libro brillante y se convirtió en uno de mis favoritos. A pesar de ser una novela de ciencia ficción, no se parece en nada a otras novelas del género; es más que nada una historia acerca de la naturaleza humana y cómo siempre terminamos optando por la destrucción y el enfrentamiento en vez de intentar trabajar juntos. Es por eso que la recomiendo incluso si no te gusta la ciencia ficción, pues no es tan \"densa\" como otras novelas del género.La prosa de Bradbury es impresionante y la variedad de estilos de las diferentes crónicas hacen de este libro una lectura sumamente entretenida y amena. Encontrarás referencias a grandes autores, humor, ironía e incluso algunos relatos macabros. Ya no me quedan más palabras para expresar lo genial que es este libro. ¡LÉANLO!"}, {"userName": "Fernando", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/7665532-fernando", "userReview": "Luego de Farenheit 451, mi libro preferido del viejo Ray. Una distopía interplanetaria que nos muestra el poder de fuego destructivo del hombre, así en la Tierra como en Marte. Bradbury cuenta cómo los colonizadores humanos del planeta rojo van corrompiendo el nuevo hábitat en el que viven: el propio suelo marciano. El capítulo que más me gusta es Usher II, un homenaje de Ray Bradbury a unos de sus más grandes ídolos literarios (que también es el mío): Edgar Allan Poe."}, {"userName": "Elizabeth", "userReviewDate": "Dec 29, 2006", "userURL": "http://www.goodreads.com/user/show/5-elizabeth", "userReview": "I vividly remember reading this book. I was in 8th grade and I read it in Mrs. Zimmerman's class. She was this bizarre ageless woman who wore her jet-black hair in a crusty bee-hive and had gobs of pastel green eye shadow on her eyelids. She also had a rusty voice-like an ex-smoker, and spoke really slowly. She could have been a character in Martian Chronicles. I still kind of wonder if she was human. Anyway, I read this book over and over. There was something so pristine about the world that Bradbury creates, and also incredibly odd and mysterious. As a writer, he kind of reminds me of Edgar Allen Poe. Another thing about Bradbury, I heard him speak once in college and he said that he wrote this book from the UCLA library (he wasn't a student there), he just liked to hide out in the basement. He was super eccentric. I liked him immediately."}, {"userName": "Jonathan Ashleigh", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/33737465-jonathan-ashleigh", "userReview": "I wish there were more books that told a story though many short stories the way this book does (or just more that I were privy to). I would have never thought that I would enjoy this book more than Bradbury’s most famous book, Fahrenheit 451. I guess that book is more widely read because it is focused for children and they apparently read more. Everyone should read The Martian Chronicles, not just those who like science fiction."}, {"userName": "Duane", "userReviewDate": "Jun 04, 2014", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": ".I've seen this referred to as a masterpiece of science fiction, but it's less about the science and more about the faults and failures of humanity, in this case Americans. He delivers a sharp slap to the face of American racial prejudice, aggressive colonization, wastefulness and disregard of the environment. I think Bradbury would be shocked to see the same conditions existing in the 21st century. He would also be shocked to see we haven't sent any humans to Mars yet.This is a collection of short stories that taken as a whole has the appearance of a novel. It very much reminds me of Sherwood Anderson's Winesburg, Ohio, which he credits with influencing the structure of Chronicles. I'm sure many readers have avoided The Martian Chronicles because it is mid-twentith century science fiction, but Bradbury rises above the cliches' of the genre to offer a view of who we are and what we need to change before introducing ourselves to future \"Martians\"."}, {"userName": "George", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/53179837-george", "userReview": "How wonderful, strange and poetic this book was."}, {"userName": "Owlseyes", "userReviewDate": "Jun 08, 2012", "userURL": "http://www.goodreads.com/user/show/6132231-owlseyes", "userReview": "UPDATEThis recent study published in Science*, gives some reason to the imagined Dead Sea of Mars, by Ray Bradbury.\n(NASA scientists have determined that a primitive ocean on Mars held more water than Earth's Arctic Ocean and that the Red Planet has lost 87 percent of that water to space. NASA/GSFC)PrologueBack in the late nineties I was a member of The Planetary Society. I used to receive, at home, their magazine. I always took notice of that name: Ray Bradbury, among the long list of other famous names as board of directors and Advisory Council members: Carl Sagan (co -founder), Bruce Murray, David Brin, Arthur Clarke …. Maybe I knew one day I would read the Martian Chronicles. And now I had the chance. For some time I still held in my mind the names of the missions (to Mars) and the photos of TPS magazines: Pathfinder and Sojourner roving through the Mars dust and rocks …and then I’ve started reading this idealization of a planet.\n\n\n Bradbury told this story once. He was in San Diego, back in 2001, at Point Loma Nazarene University. He was lecturing about the “hygiene of writing”. He told the students: Christopher Isherwood told him: Aldous Huxley wanted to meet with him; they met and Huxley told Bradbury “you are a poet”. Bradbury got delighted.In an interview he explained how, when he was 29 years old, he went to New York: a journey of 4 days and nights by Greyhound, to get his short stories published. The Martian Chronicles were a collection of separate short stories, but they got together in a tapestry that is the present book (first published in 1950).The Martian Chronicles\nThe book is a collection of short stories that cover the period of about 60 years of Mars colonization by men, starting in 1999.A place with Blue Mountains,… golden fruits and houses with crystal columns. People (Martians) with gold yellow eyes and brown skin, capable of telepathy (of understanding other languages)… who read on metallic books with salient hieroglyphs. That’s truly poetic. Planet Mars has a Dead Sea…and violet water canals…and twin white Moons. Children play with golden spiders.\nPoetic as well the conversation between Lady Ttt and Mr Iiii and Mr Aaa….on planet Tyrr. From their planet they see Earth as green. But not so poetic for commander Williams,and his men, who conclude later that he’s been visiting a madhouse, and that Martians think “we’re crazy”. This was a story of hallucinations.\n In another story there’s a character who would like to organize Mars in a way it would resemble Earth;he,himself and fellow men conclude there’s a collective hypnosis: a woman thinking she’s still living on planet earth; a crew member thinks he meets his brother;… and Marylyn. In the end 16 men are dead.Yes, planet Mars harbors a dead civilization. Hathaway, a geologist, concludes: “by the look of their cities it was a beautiful, gracious and philosophical people”. Martians fuse Art and life: not like Americans.When Benjamin Driscoll arrived to Mars there were no trees: he wanted to see a green Mars; the air-like-the-Andes was not satisfactory.By year 2002, 90,000 people arrived …rockets arrived like grasshoppers. Someone says: I must forget earth; I have a lot of fun with the weather here: day hot as hell, and the night cold.\nMartians look like blue spheres. Stone is having a conversation with a priest. Stone had been saved in an avalanche of stones, by the blue lights; the priest says: that proves they have a soul: there’s compassion: they’re not animals. “What kind of Christ they adore?”.A Martian explains: “it’s been 10,000 years… we have abandoned our bodies…we live in happiness, we live in the grace of God…we once were humans, with bodies like you…we live in the mountains and the wind…we have abandoned material life”.\n \n\n (…)And yet in Red City the Martians killed a man.November 2005 news: there’s war on earth. We need to get back. It’s still our homeland.Sam got a territory from the Martians the size of half of Mars. He receives a message from Earth: the Australian continent exploded, London and LA were bombed.Hathaway, a former State governor, says Earth science went ahead of us: wars killed Earth. The governor wants to start a new life on Mars. Hathaway and family are fishing in the Mars canals; and the kids want so badly to see a Martian. Father tells them to look at the image reflected on the waters. Martians are earthlings.\n The Bradbury chronicles tell little about Martians, but a lot about humans. *https://astrobiology.nasa.gov/article...Great interview by Sam Weller Ray Bradbury, The Art of Fiction No. 203in: https://www.theparisreview.org/interv...https://www.google.pt/amp/s/amp.thegu..."}, {"userName": "Werner", "userReviewDate": "Mar 20, 2008", "userURL": "http://www.goodreads.com/user/show/903390-werner", "userReview": "Note, Nov. 2, 3017: I edited this just now to correct a minor typo.Though the 16 stories that comprise this collection are fitted into a super-imposed chronological framework, and are joined by some short units of bridging material, they were originally composed as stand-alones, not part of any larger unity. Bradbury was primarily a writer of short fiction, the main medium for his characteristic supernatural and science fiction in the era when he started writing; this book simply collects most of the stories he composed in the 1940s set on, or related to, Mars. Several of them have totally conflicting or contradictory premises and features, and they vary wildly in tone and effect. (They're uneven in quality as well, as noted below.) But that said, there are certain recurrent themes that bind them. Bradbury envisioned Mars colonization as a kind of re-enactment of the settling of the American frontier, a new New World with the same pitfalls and the same potential promise. He also was haunted, as were most post-World War II SF writers working in the long shadow of Hiroshima and Nagasaki, by the threat of nuclear war, and that concern is reflected in a number of the stories.Some reviewers, both on and off of Goodreads, have faulted Bradbury for a drastic lack of scientific accuracy in his portrayal of Mars, which he pictures as much more hospitable to humanoid life than it actually is. (His ascription to his Martians of psi powers --the possibility of which, to say the least, is undemonstrated-- also doesn't please hard SF purists.) To a degree, those criticisms miss the point, however: Bradbury isn't trying to write scientifically accurate, hard SF, and failing at it; rather, he's writing from the standpoint of the genre's \"soft\" tradition (of which he was always an exponent, even in the days when the U.S. pulp SF ghetto was rigidly dominated by the hard school). He simply posited the kind of Mars he wanted for the kind of stories he wanted to tell, knowing full well that it was fictional and invented; if we take his \"Mars\" on those terms, the stories work as he intended.Criticism has also been directed at these stories on the grounds of an alleged anti-American agenda. His space explorers/colonists are all Americans; they invade and occupy Mars, inadvertently bringing disease germs that virtually annihilate the native Martians, who are portrayed in \"Ylla\" as an aesthetic, artistic race. \"Way in the Middle of the Air\" is openly critical of white racism in the segregated U.S. South of the 1940s. And several of the stories posit a nuclear war on Earth, with the penultimate story, \"There Will Come Soft Rains,\" graphically portraying the wanton total destruction of life and negation of human science and achievement that such a war would entail. These features, however, do not add up to or prove a root-and-branch essential hostility to America and its values. (Bradbury is actually a product of a small-town America that he often evokes with an affectionate nostalgia that's obviously genuine.) The parallel between the fate of Bradbury's Martians and our Indians is real and historically grounded; you can't re-tell American frontier history without facing it --and at least here, the Martians die only of unintentionally-borne disease; they aren't victims of deliberate genocide. (It could also be questioned whether the portrayal of Martian attitudes is intended as glowingly positive --Yll, as his wife recognizes, is a cold-blooded xenophobe and murderer.) But the promise of the frontier as a place of new beginnings, new possibilities and a second chance is also evoked here; one could view that as a positive take on the meaning of the American experience. Criticism of the treatment by some Americans of blacks (who are also Americans) isn't in itself anti-American; it echoes the sentiment of the song \"My Country, 'Tis of Thee,\" where it says, \"God mend thine every flaw.\" And to view nuclear war as immoral idiocy is not a position of disloyalty to America or American principles, unless we assume that mass genocide and mass suicide have always been intrinsic American ideals (they haven't). \"Usher II\" expresses a libertarian cultural attitude that's arguably quintessentially American; and \"The Million-Year Picnic\" brings a family of American nuclear war survivors to Mars as agents of a new beginning, where they finally have a chance \"get it right.\"There are certainly merited criticisms that can be made of several of these stories. The only one with any religious message, \"Fire Balloons,\" is simply a wooden preaching of the \"gospel\" according to Gnosticism: \"salvation\" through evolving away from icky physicality. (The apostles Paul and John, judging from their letters, would have puked over it. :-)) The conclusion (not the climax) of \"Mars Is Heaven!\" is supposed to be dramatically effective, but doesn't make sense in the context. IMO, the poorest story in the group is \"The Silent Towns,\" which showcases the sexism of Bradbury's generation at its worst; it has no message, except ridicule of overweight females and an attempt to generate \"humor\" at their expense.Overall, though, I liked this collection; obviously, some stories are better than others, but I thought that most worked artistically. For me, Bradbury's style is a plus; it's lyrical and evocative, and full of appeals to all of the senses. My favorites in the group are \"There Will Come Soft Rains\" and \"Way in the Middle of the Air,\" which I think are masterpieces. (Either would have been better selections for the Science Fiction Hall of Fame, IMO, than \"Mars Is Heaven!\")."}, {"userName": "Carmine", "userReviewDate": "Jun 01, 2015", "userURL": "http://www.goodreads.com/user/show/43396096-carmine", "userReview": "Pronti per un nuovo pianeta da distruggere? Fantascienza che diventa poesia; sci-fi che si tramuta, quasi impercettibilmente, in una sorta di fiaba dalla morale semplice e diretta.Il genuino spirito della scoperta, l'amore per l'ignoto e il desiderio di sconfiggere la solitudine, motori trainanti della progressiva colonizzazione di Marte, lasciano posto all'insofferenza da parte di un'umanità sempre più in balia dei propri limiti, tristemente incapace di districarsi dalla scarsa lungimiranza.Ma la deresponsabilizzazione dalle proprie colpe non cambia la realtà dei fatti: volenti o nolenti, siamo tutti di passaggio su questa terra.E siamo ancora in tempo per fare in modo che chi verrà dopo di noi abbia un lascito."}, {"userName": "Nandakishore Varma", "userReviewDate": "Sep 29, 2011", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "I had read a lot about The Martian Chronicles before I read this book - and I must say that for a change, the hype was justified. This is an absolutely fantastic piece of literature.I am a bit lenient with the stars in genre fiction - I don't hold them to the exacting standards that I do with literature. So in SF, if the concept is unusual, it tends to gather five stars. But in case of this book, the five stars have nothing to do with genre. It's purely for the literary merit.There are two writers whose stories grew with me - Roald Dahl and Ray Bradbury. I first enjoyed their stories as a pre-teen, right through my teens and youth: and I find that still give me pleasure in a somewhat cynical and crabby middle age.-----------------These set of connected stories about Mankind's Martian expeditions starting from the early nineties to 2026 is not about science. They are about mankind, its infinite need to expand and push the boundaries: at the same time dancing on the edges of self-destruction. It is about exploration, the meeting between alien races who interact and destroy one another without meaning to, most of the time. It is about the casual disrespect of an uppity race and their callous disregard for a centuries-old culture they cannot understand. It is about man, who thinks might is right and that most disputes can be settled with firearms. Ultimately, it is about man who looks on the ruins of his own world, brought about by his own hands, and dreams of building another civilisation on top of it.Reading Ray Bradbury is the sheer, unalloyed pleasure of losing oneself among the pages of a book: of wandering unfettered through a bountiful and boundless imagination. Mars is just a prop: he could have used any planet, any fantasy world. These stories skirt the thin boundary between hard SF and fantasy, and do it masterfully. But ultimately they address human concerns, as all good literature does.Five golden stars!"}, {"userName": "Sonia", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/18450298-sonia", "userReview": "Estupendo.Es la segunda obra de Bradbury que leo y no me deja de fascinar el inevitable cuestionamiento del comportamiento humano, a veces muy sutil, a veces bastante clara, pero siempre con la misma conclusión de inverosimilitud en algunas cosas que el hombre hace o piensa. Además, me sigue pareciendo una prosa encantadora, la de este autor. Los relatos me parecieron muy interesantes. Interesantes de verdad.Como un extra diré que, a pesar del alto precio que pagué por este raro ejemplar (aunque en una edición barata que no debió costarme lo que me costó, pero bueno, era el último, no había tiempo para dudas), no me arrepentiría en absoluto de obtener un libro de este autor. El prólogo de Jorge Luis Borges fue otro buen aliciente para no pensármelo ni siquiera una vez. Ojalá pudiera encontrar una edición mejor, pero en los tiempos que corren..."}, {"userName": "PorshaJo", "userReviewDate": "Jul 04, 2016", "userURL": "http://www.goodreads.com/user/show/5464046-porshajo", "userReview": "For years The Martian Chronicles is a book that has intrigued me. I've gone back and forth on 'read it, don't read it'. I always thought martians and outer space, it's not my preferred reading. But it's Bradbury. I've read two of his other books (Fahrenheit 451 and Something Wicked This Way Comes) and have enjoyed both of them. (The movie versions of the books are pretty good too). Reading reviews on GR I came across something on Bradbury (Thanks Ron!) and pretty much said 'I have to read it now'.The Martian Chronicles was really not what I expected. Yes, its martians and outer space, but its so much more. A series of short stories, brought together to become what we know as the Chronicles. It's fascinating to see how Bradbury created this in 1950 but quite a bit of what he says is so true of this time on Earth and people. I laughed so hard at the story of Walter Gripp - alone on Mars, lonley, looking for another soul on planet and calls numbers in the phone book until anyone answers. When he finally finds Genevieve and she is needy, whiny, clingy....that he flees her, preferring to be alone again on Mars.I listened to this one via audio and it was amazing. Scott Brick did the narration and he just adds so much to the story. Right from the beginning he sucked me into this world where I was immersed in the story, forgetting what was around me and what I was doing (not good, I generally listen to audios in the kitchen while making dinner). I highly suggest a listen to this one, even if you have read the book.I look forward to more Bradbury, even revisiting those I've already read."}, {"userName": "Christy", "userReviewDate": "Sep 29, 2007", "userURL": "http://www.goodreads.com/user/show/248667-christy", "userReview": "Ray Bradbury's Martian Chronicles is a lovely, lyrical collection of short pieces about the human colonization of Mars and its consequences, beginning just before first contact and ending after the death and destruction of most of the population of both Mars and Earth. Since this is a collection of stories and vignettes instead of a novel, the central, guiding element of the book is not a character or set of characters; instead it is the setting and the emotion evoked by Bradbury's prose. His main concern is Mars itself, as a place separate from human intentions. As one character, a member of an early expedition to Mars, says, \"Ask me, then, if I believe in the spirit of the things as they were used, and I'll say yes. They're all here. All the things which had uses. All the mountains which had names. And we'll never be able to use them without feeling uncomfortable. And somehow the mountains will never sound right to us; we'll give them new names, but the old names are there, somewhere in time, and the mountains were shaped and seen under those names. The names we'll give to the canals and mountains and cities will fall like so much water on the back of a mallard. No matter how we touch Mars, we'll never touch it. And then we'll get mad at it, and you know what we'll do? We'll rip it up, rip the skin off, and change it to fit ourselves\" (53-4). \"There Will Come Soft Rains\" takes this emphasis on place over people to its furthest conclusion, perhaps, telling the story of a house that continues running even after its human inhabitants have abandoned it: \"The house was an altar with ten thousand attendants, big, small, servicing, attending, in choirs. But the gods had gone away, and the ritual of the religion continued senselessly, uselessly\" (167). The house itself takes on life, described as trying to \"save itself\" when it catches fire (170): \"The house shuddered, oak bone on bone, its bared skeleton cringing from the heat, its wire, its nerves revealed as if a surgeon had torn the skin off to let the red veins and capillaries quiver in the scalded air\" (171). Bradbury drives this point home with a poem by Sara Teasdale that states, \"Not one would mind, neither bird nor tree, / If mankind perished utterly; / And Spring herself, when she woke at dawn / Would scarcely know that we were gone\" (169). The book is absolutely suffused with what is best described as a sense of nostalgia for the future. Bradbury romanticizes the Mars of future decades (1999-2026; the book was published in 1950) and distances the reader from Earth itself. Mars is a place of wonders, a place of great civilizations and developed individuals; it is a place to protect. And in The Martian Chronicles, what Mars needs protecting from is us. We bring with us violence, war, advanced technologies that we have yet to master, mining, and ideas about ownership and colonization that, if allowed to spread, would destroy Martian civilization as surely as they destroyed Native American societies, African cultures, and countless other ways of life on Earth. This is a future that has yet to happen, a place we have yet to see, but we, as readers, are meant to sympathize with Martians, with Mars, and root against humans. We are meant to see in conquering humanity the same problems we face here on Earth and in Mars a haven for freethinkers, former slaves, and survivors (c.f., \"Usher II,\" \"Way in the Middle of the Air,\" and \"Million-Year Picnic\"). This makes The Martian Chronicles both conservative in the way that the nostalgic mode is typically conservative and progressive in its subversive critique of the Earth way of life, specifically the American way of life.In \"The Million-Year Picnic,\" Bradbury's nostalgia for the future turns against human science and scientific progress as the father of a family who has left Earth after the wars to live, practically alone, on Mars, says to his family, \"Science ran too far ahead of us too quickly, and the people got lost in a mechanical wilderness, like children making over pretty things, gadgets, helicopters, rockets; emphasizing the wrong items, emphasizing machines instead of how to run the machines. Wars got bigger and better and finally killed Earth. That's what the silent radio means. That's what we ran away from\" (179-80). In this anti-technology statement, Bradbury provides little hope for the future of humanity and of Earth and little faith or interest in science. However, elsewhere in The Martian Chronicles, he does afford a small glimmer of hope in a different kind of future, a different attitude toward science, religion, and art. He gives us this in the Martian civilization:\"The Martians discovered the secret of life among animals. The animal does not question life. It lives. Its very reason for living is life; it enjoys and relishes life. . . . And the men of Mars realized that in order to survive they would have to forgo asking that one question any longer: Why live? Life was its own answer. Life was the propagation of more life and the living of as good a life as possible. . . . They quit trying too hard to destroy everything, to humble everything. They blended religion and art and science because, at base, science is no more than an investigation of a miracle we can never explain, and art is an interpretation of that miracle. They never let science crush the aesthetic and the beautiful\" (66-7). Following this model of science, one that does not separate science and technology from art and religion and humanity, there is hope for a future for humankind. The question Bradbury leaves us with, then, is whether or not we will be able to heed this warning."}, {"userName": "Adrian", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/22809267-adrian", "userReview": "What a marvellous book. As I mentioned in a comment when I started reading it, I have read this before, I'm guesstimating mid/late 70s, and also (for some reason) have a fond remembrance of the 1980 Rock Hudson TV series. Well as a book it certainly lived up to my expectations.I don't normally say much about the contents or stories of books I review as I leave that up to the back cover or others to read themselves, but I will say this about The Martian Chronicles (or Silver Locusts); it is a wonderful 1940s and 50s social commentary and as such it is like looking back into history (given the dates of when the book is set, most of it is now set in the past anyway). The racial bigotry that existed during the time comes across very clearly in the book, as well as how Bradbury viewed mans ability for self destruction and disregard of the environment. All things that are still unfortunately very visible in todays world.Overall I thoroughly enjoyed the book and can see me reading it again (sooner than 40 years time I'm thinking). I've now read 2 Bradbury books in the last 6 months and know why as a teenager I read an awful lot more, I think as well as my challenges that should also be a focus of my reading.I would recommend this book to anyone who enjoys SF, it is not \"hard\" or military or opera or any of the other genres, it's just a very good book, well written, enjoy !"}, {"userName": "Gabrielle", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/6753400-gabrielle", "userReview": "4 and a half stars.My husband ruined reading Ray Bradbury for me when he showed me this video : www.youtube.com/watch?v=e1IxOS4VzKM . Now I can’t pick up any of his books without that ditty getting stuck in my head, and if you click the (not really safe for work) link, the same thing will happen to you. You’re welcome.I found “The Martian Chronicles”, “The Illustrated Man” and “October Country” at my favorite used bookstore, all the same edition, all in perfect condition. When that happens I often wonder who had the heart to sell these books off… while simultaneously being very grateful because I now have them on my shelf. It’s a complicated feeling.Having only read « Fahrenheit 451 », I wasn’t really sure what Bradbury’s other work would be like, but I had a feeling I’d like it because I have always enjoyed golden age sci-fi (I am a bit of a sucker for nostalgia), and the clean and evocative prose that Bradbury is often praised for.This book is a collection of related vignettes chronicling the colonization of Mars by humans in the 21st century and it is poetic, nostalgic and heartbreaking. It is a very quietly thought-provoking book, even when there is what we normally think of as “action” taking place. It’s all about subtle things happening under the surface – in a very 1950’s way, I suppose. Thoughts about loneliness, grief, colonialism and faith are explored through the story of humanity’s settlement on the Red Planet. Would moving to a whole new planet fix the problems we have left behind on Earth? Or would we take the dark side of human nature along with us everywhere? Bradbury’s longing for a simpler, better time – that probably never existed outside of his prodigious imagination – is what these settlers are trying to capture by setting up shop away from the threat of the atom bomb, from racism, from environmental decay… From all those things that made life on Earth feel intolerable.The wish for a better world is universal and timeless, so no matter how dated some elements of those stories can seem to a modern eye, their spirit still resonates very strongly. Sure, his Martians are a lot like Midwest Americans from the 50’s, but I don’t think that can be chalked up to a lack of imagination. Rather, I think it’s Bradbury’s way of saying that if there is life on other planets, why should we assume the beings there would be that different from us? Maybe we are much, much more alike than we can imagine…Lyrical, sad, haunting and lovely. No other works of this genre that I have read so far feels quite the way this one does. A must-read for sci-fi fans and fans of good writing in general."}, {"userName": "Poonam", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/17656456-poonam", "userReview": "This is my Book Of the Month- February 2017, with GR group- Nothing But Reading Challenges- Category: Adult Sci-Fi/Fantasy BOM.A classic in Science-Fiction category, this book was originally published in the year 1949 and I have to applaud the author's imagination and story-telling!At first the book was not something that I expected but then it became something that I kind of expected and then again it veered in a direction that I did not expect. There were times I was confused and at times I could not stop reading. My main point is this book is interesting and keeps you hooked.We get to meet the Martians and get a glimpse in their life.\n\"I've seen that what these Martians had was just as good as anything we'll ever hope to have. They stopped where we should have stopped a hundred years ago. I've walked in their cities and I know these people and I'd be glad to call them my ancestors.\"\nThe above quote does not mean they were not super creepy at times. There were times when I liked them and then when I was scared of them. They were bumbling idiots at times and then very intelligent in the others.And then there are the Earthlings, and the desperation to escape from Earth.\n\"They came because they were afraid or unafraid, because they were happy or unhappy, because they felt like Pilgrims or did not feel like Pilgrims. There was a reason for each man. They were leaving bad wives or bad jobs or bad towns, they were coming to find something or leave something or get something, to dig up something or bury something or leave something.\"\nThe ending did take me by surprise but it is a suitable one. I would recommend this to all science- fiction lovers."}, {"userName": "Gaijinmama", "userReviewDate": "Jan 25, 2011", "userURL": "http://www.goodreads.com/user/show/917504-gaijinmama", "userReview": "Whether you read SF or not, Ray Bradbury writes beautifully. His style is dreamy and lyrical, satirical and funny, and at times creepy as hell.This book is interconnected short stories, rather than a novel in the traditional sense. It describes the imagined human colonization of Mars. Some parts are extremely dated: all the men smoke cigars and shoot things; the women bake gingerbread. I guess cell phones and YouTube were beyond the realm ofpossibility in 1950, too; Bradbury had people still using typewriters and listening to the radio. This quaintness doesn't detract from the work's value today, however. I have been haunted since junior high school by \"There Will come Soft Rains\", near the end of the collection, which describes an automated house that goes on cheerfully making breakfast and vacuuming the carpets, even though the family who lived there, and their entire city, have been obliterated in a nuclear war. I'm 44 now, and it still makes me shiver.I also liked an earlier story in which all the black people in a small Southern town get tired of waiting for civil rights (remember, this was 1950) and simply build their own rocket ships and leave! For that time, Bradbury was making a strong statement, and sadly we still have not ended racism today.I would particularly recommend this book to anyone getting started in the SF genre. The inside front cover of my copy says 14 and up. I'd say that younger kids might not pick up on the political statements, but it would be a great starting point for some interesting discussions, comparing Bradbury's vision of the 21st century with how things have actually turned out."}], "description": "The strange and wonderful tale of man’s experiences on Mars, filled with intense images and astonishing visions. Now part of the Voyager Classics collection.The Martian Chronicles tells the story of humanity’s repeated attempts to colonize the red planet. The first men were few. Most succumbed to a disease they called the Great Loneliness when they saw their home planet dwindle to the size of a fist. They felt they had never been born. Those few that survived found no welcome on Mars. The shape-changing Martians thought they were native lunatics and duly locked them up.But more rockets arrived from Earth, and more, piercing the hallucinations projected by the Martians. People brought their old prejudices with them – and their desires and fantasies, tainted dreams. These were soon inhabited by the strange native beings, with their caged flowers and birds of flame.Contents:Rocket SummerYllaThe Summer NightThe Earth MenThe TaxpayerThe Third Expedition-And the Moon Be Still As BrightThe SettlersThe Green MorningThe LocustsNight MeetingThe ShoreInterimThe MusiciansWay in the Middle of the AirThe Naming of NamesUsher IIThe Old OnesThe MartianThe Luggage StoreThe Off SeasonThe WatchersThe Silent TownsThe Long YearsThere Will Come Soft RainsThe Million Year Picnic", "title": "The Martian Chronicles", "url": "http://www.goodreads.com/book/show/8577197-the-martian-chronicles", "average": 4.13, "cover": "https://images.gr-assets.com/books/1378654767l/8577197.jpg", "reviews": 5807, "authors": [{"url": "https://www.goodreads.com/author/show/1630.Ray_Bradbury", "name": "Ray Bradbury"}], "type": ["Science Fiction", "Fiction", "Short Stories", "Fantasy", "Science Fiction Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/8577197-the-martian-chronicles", "http://www.goodreads.com/book/show/10480387-the-martian-chronicles", "http://www.goodreads.com/book/show/76778.The_Martian_Chronicles", "http://www.goodreads.com/book/show/22782036-the-martian-chronicles", "http://www.goodreads.com/book/show/24924984-the-martian-chronicles", "http://www.goodreads.com/book/show/970651.The_Martian_Chronicles", "http://www.goodreads.com/book/show/391094.The_Martian_Chronicles", "http://www.goodreads.com/book/show/6571877-the-martian-chronicles", "http://www.goodreads.com/book/show/13259262-the-martian-chronicles", "http://www.goodreads.com/book/show/1950540.Cr_nicas_marcianas", "http://www.goodreads.com/book/show/9624.The_Martian_Chronicles", "http://www.goodreads.com/book/show/2927592-cronache-marziane", "http://www.goodreads.com/book/show/11698803-the-silver-locusts", "http://www.goodreads.com/book/show/17905322-the-martian-chronicles", "http://www.goodreads.com/book/show/6906016-the-martian-chronicles", "http://www.goodreads.com/book/show/4381.Fahrenheit_451", "http://www.goodreads.com/book/show/248596.Something_Wicked_This_Way_Comes", "http://www.goodreads.com/book/show/24830.The_Illustrated_Man", "http://www.goodreads.com/book/show/50033.Dandelion_Wine", "http://www.goodreads.com/book/show/761381.The_Halloween_Tree"]}