{"ratings": 30438, "userreviews": [{"userName": "KAS", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/20691061-kas", "userReview": "This is a powerful read which had me glued to my chair. I did not expect all the twists and turns of the plot, but they were amazing and kept my anticipation levels soaring. Well done, Ms. Chamberlain! IMHO, you will be hard pressed to find anyone who can rival Diane Chamberlain when it comes to writing women's fiction. Her storylines are always intriguing and pull you in from the very beginning. Her character development is top notch and you feel intimately acquainted and invested in their lives. This story follows three women who met in college over twenty years ago and became the very best of friends. Noelle, the midwife, commits suicide. Her best friends, Emerson and Tara, have no idea what triggered her to end her life. No one saw it coming. As they delve into letters and journals she left behind, what they discover is even more shocking and disturbing news. Emerson and Tara know they need to call the police about their suspicions, but the more they try to figure out the bizarre sequence of the horrific events Noelle was involved with, the more they realize just how wrapped up their own lives are intertwined in the scandals.So many secrets! So many lies! So many great \"Are you kidding me?\" moments!"}, {"userName": "Lucy", "userReviewDate": "Sep 01, 2011", "userURL": "http://www.goodreads.com/user/show/307208-lucy", "userReview": "I don't even know how to write this without spoilers so consider this your big spoiler alert.Ugh. My apologies to Diane Chamberlain, who I'm sure is a nice woman with lots of ideas and talent, but The Midwife's Confession gives fiction a bad name. I feel rather strongly that fiction has a lot more to offer than escapism or entertainment. I feel its medium is especially suited to teach - namely empathy and understanding for the multitude of life experiences we'll most likely never have as individuals. Additionally, I have learned from Tolstoy and Stagner and Steinbeck and Stockett and many others that no matter our color or religion or age or gender, we are all a lot more similar than it seems. So are our relationships with others. Toss in some history, geography, or any area of expertise (governing, medicine, cooking, sports, kite flying), a few conflicts for flavor, steady it with good writing and better editing, and, voila, you've got yourself some quality fiction. What does not make quality fiction is unbelievable, unlikely and ridiculous drama. Again, those kinds of stories may be entertaining to some but it feels like such a waste of pages and ink to me. What can possibly be the purpose of reading about three women who meet at college and become BFFs and all live in the same town and all still hang out regularly together (unlikely) until one of them unexpectedly commits suicide? Is it likely that those who have been adopted relate to becoming a midwife because they happened to be given to the midwife who delivered them (unbelievable)? Or that they identify with the woman who secretly discovers the names of her birth parents while moving her adoptive mother's furniture because she kept her daughter's birth file in an old swivel chair (unlikely)? Maybe we can glean a bit of that universal human condition by reading about about happens when you accidentally drop your newborn baby niece that was just born to your sister who thinks you're really just her old RA from college turned friend because you were high on prescription drugs that you secretly take due to a back injury from a car accident that happened on the night you slept with your best friend's fiance who you will always love even though he then marries your best friend so you become engaged to his partner but use your old lover as your attorney to arranges the paperwork for the five surrogate children you secretely deliver to help you atone for the fact that you replaced the dead baby that you hid in your purse at the hospital, stealing a baby from a woman in a coma who now has another daughter who needs a bone marrow transplant but now this secret niece of yours who was raised by your secret sister of yours discovers that she is the stolen baby and maybe can save her real sister's life by donating her genetically similar bone marrow? No? And don't get me started on the jolted first person narratives between five or six or seven different women. It's like she didn't know how to write one story so she just changed to have someone narrate when they needed to express how they felt or what was going on in their life or what secret they had. I never really like this style but Chamberlain's use of it felt downright lazy. Like I said - unbelievable, unlikely, ridiculous. Criminal. Stupid."}, {"userName": "Sheree", "userReviewDate": "Mar 30, 2011", "userURL": "http://www.goodreads.com/user/show/1612410-sheree", "userReview": "4.5 stars What a nail-biter! An absolute labyrinth of twists, turns and just when you think you've got it all figured out ... bam another shocking revelation! Ok not all were the unexpected, knock-your-socks-off type revelation, some where the ... damn ... I knew it, kind, but still, quite a gut-wrenching rollercoaster ride. I loved the seamlessly woven alternating narration from key characters and the flashbacks to past events. I loved the complexities of the mother-daughter relationships, I loved the bond between best friends Noelle, Tara & Emerson and I loved Chamberlain's portrayal of their bond following Noelle's suicide. The 'realness' of their feelings; the shock, the guilt, the questions, the anger, the betrayal, the love, the quest for answers, the desire to set things right.Following the death of my mother a long buried secret was uncovered that came as quite a shock to our entire family so many of Tara & Emerson's emotions were also familiar to me. When your knowledge of someone you love is so emphatically challenged it rocks your entire world. The Midwife's Confession is a powerful and moving landscape of love, friendship, grief, suicide, lies, guilt, & life-shattering secrets.If you're hankering for an extremely compelling read with a poignant depth of emotion and a blistering pace then don't miss out on this one!"}, {"userName": "Maria Espadinha", "userReviewDate": "May 28, 2013", "userURL": "http://www.goodreads.com/user/show/20749430-maria-espadinha", "userReview": "Nem Confissão Nem ParteiraComo sei que muitos leitores chumbaram de imediato este livro, logo que deram de caras com as palavras \"confissão\" e \"parteira\", quero começar por dizer que esta escolha de título não foi das mais felizes.Isto porque \"parteira\" cheira a maternidade, partos, recém-nascidos...e de facto este livro pouco tem a ver com isso.Quanto a mim, faria mais sentido intitulá-lo \"O segredo da carta inacabada\", pois foi esse o catalisador de toda a intriga.Bem...findo este preâmbulo que dedico especialmente aos que torceram o nariz à \"confissão\" e à \"parteira\", irei então debruçar-me sobre aquele que considero ser o fulcro desta estória:O grande tema desta narrativa é a Amizade!Os nossos laços, as ligações que contraímos ao longo da vida são como que prolongamentos do nosso Eu, envolvendo-nos numa teia que constitui um Nós que simultaneamente nos abarca e transcendeSempre que algum fio dessa teia se quebra e solta, esse Nós estremece e vacila na sua totalidade. Tem então início todo um processo que se propõe consertar a teia quebrada , de forma a que tudo volte a funcionar sem esse fio que dela se desprendeu para sempre.E é de todo esse processo de recuperação dum equilíbrio perdido que esta estória se ocupa.O resultado foi um page turner, pleno de voltas e reviravoltas que constantemente nos surpreendem e prendem a atenção!"}, {"userName": "Anne", "userReviewDate": "Apr 06, 2011", "userURL": "http://www.goodreads.com/user/show/2464996-anne", "userReview": "There’s a small handful of authors who you know can be relied upon to hook you in from page one, take you swooping through twists and turns of story, with well-written and likeable characters and the feeling (when you come out of the wringer at the other end ) that you’ve thoroughly enjoyed a really, really good book and can’t wait for her next. Jodi Picoult’s one. Heather Gudenkauf is another. And then there’s Diane Chamberlain. This was everything I want in a book – secrets, love, friendship, redemption, mysteries, discoveries... wonderful stuff. I loved the multiple perspectives on the developing story through shifts in narrator and time. I remember Diane saying on her blog that she hadn’t originally “written in\" Noelle – what a different book that would have been, as she provides a really strong emotional centre to the story. A really excellent book – and I can’t wait for her next!Thanks to netgalley for providing an advance reading copy for my Kindle."}, {"userName": "Heather", "userReviewDate": "Feb 27, 2012", "userURL": "http://www.goodreads.com/user/show/2877392-heather", "userReview": "I have to stop reading Chamberlain's books. I have to. I read the reviews on here and thought it would be better than the last one I read, but it was not. Stop reading now if you don't want spoilers.In this story Noelle is a midwife and she has a lot of secrets. She also has two best friends, Emerson and Tara. One night, for reasons that no one knows Noelle ends her own life. This leads Emerson and Tara on a quest to find out what was going on with their good friend. Noelle was hiding a lot. They had all been friends for 20 years and somehow she managed to hide five pregnancies, her love for Tara's husband, that she is really Emerson's half sister and she accidentally dropped a baby and switched it to cover it up. I still do not understand what Noelle being in love with Sam had to do with the rest of the story. I felt like it was just thrown in there and had no reason. I could have lived without that story line. There was PLENTY going on without it. The five pregnancies were also not needed. She was secretly a surrogate five times and, while I understand the author was trying to show she was doing it to pay a penance it just seemed a bit over the top. I want to like Chamberlain's books, I really do. She writes such great characters, but then she just piles on so much they get lost in it all. It would have been a compelling story to just have Noelle commit suicide, have Emerson be the secret half sister and deal with the death of her infant and switch of the baby. All the other things that were going was just more than the book needed. I would have liked more depth to some of the relationships instead."}, {"userName": "Leslie ", "userReviewDate": "Dec 03, 2015", "userURL": "http://www.goodreads.com/user/show/43740193-leslie", "userReview": "I have read many Diane Chamberlain books, and this was one of my favorites thus far."}, {"userName": "Tina", "userReviewDate": "Jun 25, 2012", "userURL": "http://www.goodreads.com/user/show/5009669-tina", "userReview": "Loved it, easy read with many new twists and turns. Yes, at times unbelievable but a page turner for sure! I love her style."}, {"userName": "Jennifer", "userReviewDate": "Oct 20, 2014", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "The first book I ever read by Diane Chamberlain was Necessary Lies and I loved it! To this day, I remain impacted by its story and the historical issues I learned about. So needless to say, I jumped at the chance to read another one of Ms. Chamberlain's women's fiction novels! I know it's unfair to compare an author's books, but as a reader with a fair amount of natural expectation, I can't help it. My reading experience with The Midwife's Confession was good... but I was hoping for awesome. I'm not sure if there were too many past and present characters/storylines or if I just wasn't connecting with the characters the way I have with other books (maybe a combination of the two), but my lack of investment definitely affected my overall enjoyment. However, let me add that I was genuinely intrigued by the mystery element in this novel and my heart was hurting when I heard what the midwife's confession actually was. At around the thirty to forty percent mark I thought I had it all figured out and was a bit insulted Ms. Chamberlain would write a story that was so predictable, but oh was I wrong. There were definitely some revelations I didn't see coming and that's always fun. Despite any negativity written in this review, I would recommend The Midwife's Confession to others who enjoy women's fiction with some family drama and mystery elements. Even though I didn't love it, I did like it and there's nothing wrong with that :)My favorite quote:\"There's no big mystery to it Noelle. Doctors today would like you to think that there is. They make you think you need drugs and C-sections, that's surgery that cuts the baby out of you, and all sorts of sophisticated interventions to have a baby. And sometimes you do. A good midwife needs to know when it's safe for a woman to have a baby at home and when it's not. But it's not rocket science.\""}, {"userName": "Love Fool", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/29084789-love-fool", "userReview": "Dear Anna,What I have to tell you is difficult to write, but I know it will be far more difficult for you to hear, and I'm so sorry-The unfinished letter is the only clue Tara and Emerson have to the reason behind their close friend Noelle's suicide. Everything they knew about Noelle - her calling as a midwife, her passion for causes, her love for her friends and family - described a woman who embraced life.Diane Chamberlain has become an author I like and want to read all her books. She is talented, coming up with creative and heartbreaking stories that will stick with you for a few days. The Midwife's Confession is one that puts fear into you, making you think of \"what if this happens to me\" throughout the book. Diane also has a talent of making you feel bad for a character, even with all her faults.I highly recommend this book if you have a long commute, because you will not want to stop reading this book. There are so many twists and turns it will leave you breathless."}, {"userName": "Aoibhínn", "userReviewDate": "Aug 24, 2011", "userURL": "http://www.goodreads.com/user/show/5799885-aoibh-nn", "userReview": "It took me a couple of chapters to get into this novel but once I did I was hooked! The chapters are written from the point of view of the five main characters giving the reader a number of different perspectives on the events as the story unfold. Every time you think you've guessed the big secret it moves to another level and you realise what you think you've guessed is only a tiny piece of the puzzle. This is a fabulous novel. It is extremely well-written with an emotional and moving story. I couldn't put it down. I only wish the author could have developed the ending a bit more. I'm trying not to give away any spoilers but I would have liked to learn more about what happened to Anna and her daughters. Four stars!"}, {"userName": "Maria", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/7278451-maria", "userReview": "Gostei muito deste livro. Uma história emocionante, com muitas reviravoltas, que nos prende do principio ao fim. E se pensam que vão ler muitas descrições de partos e nascimentos de bebés desenganem-se, é de facto em torno da profissão de parteira que gira a história mas tem muito mais que se lhe diga. Só não digo que é perfeito porque achei o final abrupto, penso que merecia ter sido tratado com um pouco mais de cuidado, mesmo que isso implicasse mais umas quantas folhas para ler. Recomendo pois a sua leitura"}, {"userName": "Staci", "userReviewDate": "Apr 27, 2011", "userURL": "http://www.goodreads.com/user/show/177641-staci", "userReview": "My thoughts:I had read so many great reviews of this title that I just had to get my hands on a copy. I'm a bit ashamed to admit that I finally realized that I was approved to download a copy of this to my Kindle months ago from NetGalley....I just was too lazy to figure out how to do it. Well, thanks to my fellow book lovers and their awesome reviews, I was motivated to learn how to get that ebook on my lovely Kindle. And I'm so happy that I did because this was a fantastic read!! I was drawn in from the very first paragraph and couldn't get enough of the story. I love the way Chamberlain writes and she didn't disappoint me in any fashion with this book. The characters were fully fleshed out and the story was riveting.Recommend? Absolutely!! This book has it all: love, secrets, betrayal, mystery, friendships rocked by deceit and moving family dynamics. If you've never read a book by Chamberlain, I highly recommend picking this one up.Rating: 9/10"}, {"userName": "B the BookAddict", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/19832827-b-the-bookaddict", "userReview": "[Women A, B and C are best friends. C kills herself, A and B find out that C has known she is B's half-sister since they met at college but has kept the knowledge to herself. C is a midwife; she has helped deliver A's baby and after a terrible accident, A's baby is killed. C swaps A's dead baby for a live one. But A and B do not discover this until C has committed suicide (hide spoiler)]"}, {"userName": "Sarah", "userReviewDate": "Sep 09, 2015", "userURL": "http://www.goodreads.com/user/show/7477266-sarah", "userReview": "I like some drama in my books. It's always interesting to read. However Diane Chamberlain certainly knows how to overdo it. This was SO dramatic. There were so many twists and a lot of them were unnecessary. A few of the dramatic elements didn't actually add a single thing to the book. The book reminded me of Desperate Housewives or Devious Maids, it was THAT dramatic. The characters were okay. I felt like Ermerson, Noelle and Tara were done the best. The rest of the characters all felt a little one-dimensional. I think Diane Chamberlain focused too much on how to make the story dramatic and unpredictable rather than focus on how to make the characters seem real. It had a nice enough pace but I felt like it was dragged out a bit. It didn't need to be over 400 pages long. I guessed the ending so it wasn't unpredictable but there were a few things thrown in the book that I hadn't predicted.The strongest thing about this was the main storyline (without all the waffle). If Diane Chamberlain just cut out some of the drama, it would have been much better... then again she wouldn't have much of a book. Bits of it were also painfully coincidental just so Diane Chamberlain could weave the story the way she wanted. I mean a coincidence once or twice, okay, but a bunch of coincidences is not okay. Even though there was a lot to dislike, I actually did enjoy this book. There were a few rare moments when I felt like I was getting a great insight into a character that seemed real and I liked that. I would read another book by Diane Chamberlain again. I would only recommend this book to readers who like lots and lots and lots and lots and lots of drama (like a lot)."}, {"userName": "Samantha March", "userReviewDate": "May 17, 2011", "userURL": "http://www.goodreads.com/user/show/4681357-samantha-march", "userReview": "I love giving five stars, and the latest novel by Diane Chamberlain earns them all. The Midwife’s Confession is a tangled story of friendship and love, secrets and betrayal, and realistic characters that will make you cry while you see their story unfold. Tara, Emerson, and Noelle have been friends for years, but when Noelle commits suicide, leaving behind only an unfinished note, Tara and Emerson find out they might not have truly known their friend. The complex mystery that surrounds not only Noelle’s death, but Noelle’s life before her suicide drives the woman to put the pieces together. But when Noelle’s secrets are finally revealed, Tara and Emerson are in for a heart-wrenching discovery. This novel was near impossible to put down. I loved trying to figure out the mystery alongside Tara and Emerson, and there were several occasions that I thought I had it all pieced together. I was never even close. The compelling drama indeed made me cry, and left me a bit unsettled at the end, but I loved it all the same. I know I said something similar in my review of Chamberlain’s The Lies We Told, but I was unsettled for a different reason. I don’t want to give a lot away here, but it was because there was a mystery surrounding Noelle and Tara’s deceased husband. The story was so good I had to call my mom immediately after I finished it to talk her ear off about it, then send her out my copy so she could read it as well. Again- all five stars are earned in The Midwife’s Confession."}, {"userName": "Carol", "userReviewDate": "Dec 28, 2012", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "UN-PUT-DOWN-ABLE!A story of friends, families, betrayals and an unimaginable shocker of a secret that will break your heart.Just after Sam's automobile accident and death,Tara and her daughter Grace are having a difficult time trying to cope when Tara and her friend Emerson's closest friend Noelle commits suicide. The two friends decide to solve the mystery of her death and find many surprises along the way with personal consequences.Although the secret is pretty hard to take, this book is now one of my favorites as well as the author!"}, {"userName": "Margarida", "userReviewDate": "May 18, 2013", "userURL": "http://www.goodreads.com/user/show/9615198-margarida", "userReview": "Este livro foi-me recomendado pela minha filha mais velha, que como já tive oportunidade de dizer é uma leitora tão ou mais ávida que eu! Também já tinha lido críticas muito boas… depois disto, meia dúzia de páginas foi o suficiente para confirmar que tinha nas mãos um verdadeiro turn-page.Há já algum tempo que não lia um livro assim! Impossível largar sem uma grande batalha interior, tinha literalmente de me “obrigar” a pousá-lo!Após o suicídio de Noelle (a parteira que dá o título ao livro) um segredo começa a criar contornos e cai como um raio na vida das suas duas maiores amigas, Tara e Emerson. Depressa percebem que na realidade nunca conheceram tão bem como pensavam aquela que consideravam a sua grande amiga e todo o seu mundo fica de pernas para o ar pondo à prova a sua própria amizade.Voltas e mais voltas e reviravoltas e quando pensamos que já nada mais vai acontecer… mais uma reviravolta, mais uma revelação que nos deixa literalmente de boca aberta! Uma autêntica montanha russa!Gostei do facto de ser narrado alternadamente pelas várias personagens e com alguns flashbacks que nos iam dando a conhecer a vida de Noelle e as razões que a levaram a tomar uma atitude tão drástico, como o suicídio.Adorei a forma como a autora nos mostra a verdadeira amizade entre duas mulheres, as relações familiares, o amor entre pais e filhos com todos os seu altos e baixos, dúvidas, culpa, raiva … Como mãe tocou-me especialmente a forma como a autora nos mostra as relações mãe-filha na voz das duas personagens principais, ambas mães de adolescentes.“A Confissão da Parteira” é uma história poderosa que nos fala de suicídio, tristeza, traição, mentira, culpa, segredos, doença… mas acima de tudo fala-nos de amor, amizade, laços familiares, força...Um romance fantástico. Extremamente bem escrito, é uma história com as emoções à flor da pele…. O fim podia ter sido um pouco mais desenvolvido, mas mesmo assim foi um bom final para uma história arrebatadora!Adorei a escrita da autora e espero ansiosamente por novos livros dela.Para quem gosta de um livro cheio de emoção e intenso, não pode deixar de ler este! Prende-nos da primeira à última página com uma intensidade de cortar o fôlego!Recomendo absolutamente! Cinco estrelas, sem dúvida!"}, {"userName": "T&C", "userReviewDate": "May 26, 2012", "userURL": "http://www.goodreads.com/user/show/4165397-t-c", "userReview": "I feel like this review is best read like Stefon from Saturday Night Live…This book has everything: Suicide, babies switched at birth, extra marital affairs, secrets and lies, kids with Cancer, unrequited teenage love, a car accident, dead husbands, broken engagements…Seriously. Take every clichéd tragedy and plop it into one narrative and that’s what this book is. I thought it was too long and didn’t get to the point fast enough. I wasn’t sure why she threw in the love triangle, either. There was just too much going on in one book and so the plot meandered a bit. It was a page turner, sure, but I thought it was a bit weak because of everything that was going on."}, {"userName": "Liliana Rio", "userReviewDate": "Nov 02, 2016", "userURL": "http://www.goodreads.com/user/show/19390729-liliana-rio", "userReview": "Cada vez mais gosto da autora, e sem dúvida uma das minhas preferidas. As suas histórias são emocionantes, intensas e profundas que nos agarram e entranham e não nos conseguem largar. Esta é propriamente uma historia imprevisível de perdas e cheia de segredos aterradores,que abalam certamente os mais fortes,..... mas também predomina um grande sentimento de amizade que unia as famílias das protagonistas que se mostrou delicioso de ler, e no fim resta-nos a esperança que as nuvens negras se afastem e nos mostrem um sol radioso!!"}, {"userName": "Christa", "userReviewDate": "Apr 03, 2011", "userURL": "http://www.goodreads.com/user/show/261662-christa", "userReview": "I found this book to be full of unexpected twists. It kept me guessing what would happen next, and I just could not put the book down. The Midwife's Confession has some really good, strong characters. It is the story of three friends - Tara, Emerson, and Noelle. Tara, recently widowed and trying to put her life back together, was my favorite. I enjoyed the friend ship between she and Emerson. I also really liked the secondary character of Anna Knightley, a strong woman who has faced the disappearance of an infant, the desertion of her husband, and the illness of her remaining daughter. The characters all tied together in surprisng ways. This was a very well written book, and I thoroughly enjoyed reading it.Tara, Emerson, and Noelle have been close friends since their college days. After Tara is suddenly widowed, her friends provide support and help her and her daughter pick up the pieces of their lives. Tara and Emerson are both blindsighted when Noelle suddenly commits suicide. As they pack up Noelle's belongings, they are stunned by the pieces of her life that they uncover. They suddenly realize that she had shattering secrets, and that they didn't really know her. Noelle's secrets send both of them reeling and threaten what they know about their own lives. Tara and Emerson must find a way to deal with Noelle's secrets and their ramifications.This was a compelling book that held my interest from the beginning. The story is told from the point of view of several different characters, and that worked well. Each time I thought I had figured out all of the connections, the author would throw in another surprise. There were some very touching and poignant moments in the book, as well as some that were completely heart-wrenching. I enjoyed this ARC that I received from Netgalley, and I recommend it highly."}, {"userName": "Carol Brill", "userReviewDate": "Apr 16, 2015", "userURL": "http://www.goodreads.com/user/show/4427869-carol-brill", "userReview": "Compelling characters and plot twist that kept me engaged from the first page. Noelle is a midwife who has carried the burden of heartbreaking secrets for years. As the book opens, she has decided it's time to let go of the weight and kill herself. Her best friends, Emerson and Tara can't believe they missed whatever drove her to this decision. They find a mysterious letter, a confession to a woman named Anna among her belongings. As they dig for answers, they uncover one secret after another. POV shifts smoothly between Noelle, Emerson, Tara, and Anna. This is a well written, suspenseful relationship story about friendship and mothers and daughters. My only quibble is that Noelle had so many secrets, there were times I questioned how her best friends knew so little about her."}, {"userName": "Carla Geraldes", "userReviewDate": "Nov 02, 2016", "userURL": "http://www.goodreads.com/user/show/21693847-carla-geraldes", "userReview": "A única explicação que encontro para ter andado a adiar a leitura deste livro, foi mesmo o título, que sugere um tema completamente diferente daquilo que se me deparou.E tenho de confessar que adorei, mesmo. Nunca pensei. Parti para esta leitura com um pé atrás, mas ainda bem que me enganei.Com uma escrita fluida, o enredo não cansa e leva-nos a querer ler cada vez mais e mais. Se estão com dúvidas por causa do título, esqueçam. Vale cada hora dispendida com este livro."}, {"userName": "Redfox5", "userReviewDate": "Apr 27, 2017", "userURL": "http://www.goodreads.com/user/show/3816075-redfox5", "userReview": "It says on the front 'As Good As Jodi Picoult Or Your Money Back', no one will be asking for their money back. This was amazing! I zoomed thought this book of firm friendship and tragic secrets. There were almost so many secrets, that it wasn't realistic. But I don't care, I still loved this. I have no idea how someone would deal with this situation, it would be heart breaking.  I would recommend if you are a fan of Picoult, this is actually better than some books I've read by her recently."}, {"userName": "momruncraft", "userReviewDate": "May 22, 2011", "userURL": "http://www.goodreads.com/user/show/862171-momruncraft", "userReview": "One of the best books I have read this year. Diane Chamberlain writes in the same style as Jodi Picoult; however, the twists, turns, and drama are never forced, obvious, or far-fetched. I got this book yesterday afternoon and absolutely devoured it. I couldn't put it down. I found myself sneaking away from the boys to read a chapter and then stayed up far too late finishing it.As with many of her books, just when you think you've got it figured out Chamberlain throws you another curveball. And then another. Much of this book hits close to home. Giving birth is one of the most life changing, life altering experiences I have ever gone through. I would have been completely lost without the amazing nurses and doctors at my side. It is a relationship built on trust. And humilty: woman parts out in the open changes a lot of things. I wholeheartedly trusted that they would help me bring my boys into the world and never questioned that. I realize a relationship with a midwife and home birth is vastly different; however, Chamberlain brings up the question of whether or not you ever really know a person. How much do really know about the person you ask to help you bring your baby into the world?Emerson and Tara have built a strong friendship with their college RA, Noelle. One that continues long after they graduate from college. Noelle goes on to follow in her mother's footsteps as a midwife and is there for Emerson and Tara when they give birth to their daughters. Following what seems to be a shocking suicide, Emerson and Tara learn that they knew nothing about their dear friend, Noelle. Nothing at all. The woman who they trusted with their lives and the lives of their daughters turns out to be hiding secrets that will change their lives completely. And turn their worlds upside down."}, {"userName": "Sabrina", "userReviewDate": "Jun 30, 2011", "userURL": "http://www.goodreads.com/user/show/34942643-sabrina", "userReview": "I almost marked it as two stars, as I wanted to like it much more than I did. I don't mind knowing what's going to happen early on in the plot, but when it is so obvious, and the author pounds you over the head with clues, but then leads up to a big \"Ta-da!\" moment, it just leaves me cold. I also didn't connect with the characters the way you need to when you have such an intimate portrait of people's lives. However, the writing made it readable, despite my lack of emotional connection.** Just marked it down to two stars, tried explaining why I didn't enjoy the story to my DH, and realized it's like that quote about trying to believe 6 imposible things before breakfast-only not in a good way. I just didn't buy all the contrived plot twists.***Took it down one more notch, I can't get this book out of my head, and not in a good way. Now I'm just generally peeved about the whole plot. Sincerely wish I hadn't finished this."}, {"userName": "Sónia", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/10423285-s-nia", "userReview": "3,5*Embora a dada altura me tenha sensibilizado com partes da estória achei-a demasiado rocambolesca. Demasiado drama, demasiados dramas individuais que tornam a narrativa um pouco exagerada no seu todo e passível de castrar as emoções. Também por isso, a leitura decorreu, em grande parte, de forma aborrecida. É certo que os gostos são subjectivos, porém não compreendo todo o falatório em torno deste livro."}, {"userName": "Sarah (Workaday Reads)", "userReviewDate": "Feb 23, 2011", "userURL": "http://www.goodreads.com/user/show/4695627-sarah-workaday-reads", "userReview": "Tara, Emerson and Noelle have been close friends since college. When Noelle, a former midwife, commits suicide, Tara and Emerson are left wondering why. As they investigate, they learn things that make them question if they ever really knew Noelle at all.I am not sure I have the words to describe how powerfully emotional this story is. Chapter 15 and 16 left me crying and needing a break. I was completely unprepared for the direction the story began to take. The synapsis doesn't even begin to touch the whole story.The remainder of the book was a roller coaster of emotion. The author did an amazing job at creating characters that suck you in. I felt like I was a part of their world, and suffered along with them at every new twist and revelation.Normally, book reviews tell you who would likely enjoy the story. I will take the opposite approach and warn off a few readers. Not that you wouldn't enjoy the story, but it might be a bit too emotional to handle:- if you're pregnant or have a newborn- if you've recently experienced the death of a loved oneThat being said, this is definitely an amazing story, and Diane did a great job telling it. I can see myself reading it again, just to see if I can pick up any little hints about the outcome that I didn't see the first time."}, {"userName": "Leila", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/15194189-leila", "userReview": "This is the first book I have read by Diane Chamberlain and not an easy one to review. The synopsis sounded really interesting so I decided to give it a try. Every chapter is told from the point of view of one of the characters which seemed fine at first but for me became ore and more confusing towards the end of the book. Initially I was intrigued by what was going on and keen to carry on. I try not to bring spoilers into my reviews,so sufficient to say that there are many twists and turns within the plot, perhaps too many... which held my interest until about two thirds into the story I found myself losing interest as it all became more and more complex. I found the last part of the book very rushed and over emotional. The men in the story don't really figure much at all. The story is based in the fact that we never really know others as well as we think no matter how close we have been and often when the truth does come out it leaves a whole mess of shattered illusions and heartbreak. I didn't take to Noelle at all and found the interaction between the other characters becoming more emotional and unbelievable as the story unfolded.Overall it's an ok book but I was disappointed after an intriguing beginning. I do have another of her books to read so perhaps this second one will live up to all the many praises for this author's work."}, {"userName": "Marleen", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/1616365-marleen", "userReview": "How many secrets can one person have, I wonder. At the beginning of this captivating story, we are confronted with the mysterious suicide of a woman – named Noelle, who was single and a midwife by trade.Page after page, and told through the eyes of her best friends, Tara and Emerson, we discover that Noelle kept more than just one secret. Honestly, she had many. I admit I thought that was all a bit much for one woman to withhold from her friends, but then it lends itself to a compelling & entertaining story-telling.True, I didn't like Noelle – she might have seen wonderful to her friends, but I didn't see it. We get to know her a little through flash-backs. And no – I didn't detect any sign of remorse. Another character that immensely irritated me was sixteen year old Grace. For the most part of the book she treated her Mom (Tara) with disrespect. Why not write about teenagers who know kindness? They are out there. For that matter, I totally adored Haley, the twelve-year old daughter of Anna Knightly; that little girl was a trooper, suffering from leukemia and still so brave and upbeat.What I enjoyed best was the intrigue and the plot – discovering what Noelle had done - not only to, but for her friends – was not only baffling, but it was also provocative. I was engrossed in Diane Chamberlain’s fantastic writing."}], "description": "Dear Anna,What I have to tell you is difficult to write, but I know it will be far more difficult for you to hear, and I'm so sorry—The unfinished letter is the only clue Tara and Emerson have to the reason behind their close friend Noelle's suicide. Everything they knew about Noelle—her calling as a midwife, her passion for causes, her love for her friends and family—described a woman who embraced life.Yet there was so much they didn't know.With the discovery of the letter and its heartbreaking secret, Noelle's friends begin to uncover the truth about this complex woman who touched each of their lives - and the life of a desperate stranger - with love and betrayal, compassion and deceit.", "title": "The Midwife's Confession", "url": "https://www.goodreads.com/book/show/10059498.The_Midwife_s_Confession", "average": 4.05, "cover": "https://images.gr-assets.com/books/1323870279l/10059498.jpg", "reviews": 3064, "authors": [{"url": "https://www.goodreads.com/author/show/93345.Diane_Chamberlain", "name": "Diane Chamberlain"}], "type": ["Fiction", "Womens Fiction", "Mystery", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/10059498-the-midwife-s-confession", "http://www.goodreads.com/book/show/17878445-a-confiss-o-da-parteira", "http://www.goodreads.com/book/show/11192703-the-midwife-s-confession", "http://www.goodreads.com/book/show/26007352-the-midwife-s-confession", "http://www.goodreads.com/book/show/10481960-the-midwife-s-confession", "http://www.goodreads.com/book/show/17286747-necessary-lies", "http://www.goodreads.com/book/show/19286669-the-silent-sister", "http://www.goodreads.com/book/show/2485785.The_Secret_Life_of_CeeCee_Wilkes", "http://www.goodreads.com/book/show/13035050-the-good-father", "http://www.goodreads.com/book/show/2589061-before-the-storm", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}