{"ratings": 396, "userreviews": [{"userName": "mark monday", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "build a bridge, bridge builder, build a bridge. to where? to yourself, of course. to other people. build a bridge across the mist, the alien mist, thick and full of life and toxic to the touch. build a bridge to bridge two lands, to make one empire whole. build a bridge that makes change. build a bridge to the you of your story, build a bridge back into your life, into your past and then out again, to your future. build a bridge to your fellows, to love; build a bridge and keep it, keep the connection, for once. there are all sorts of bridges. make one that lasts. you can do it!the fantasy elements are minor. the mist is one such element. a river of it, an ocean of it. small un-fish swim in it, big ones too, big ones that rise with the mist, that make things disappear.looking for action, reader? don't look here. looking for a novella that gets deep into its fully three-dimensional protagonist's head - a story built around character? looking for the kind of tale that has an exquisite sort of tension based on things that may or may not happen to characters that you have come to understand, admire, even love? pick this one, pick it! looking for a whole world that is fully contained in a finite number of pages? a story that actually ends... but the best kind of ending! an ending that promises more, off the page, a bridge to a place that you will have to imagine yourself. you can do it! The Man Who Bridged the Mist won the Hugo and Nebula Awards for Best Novella in 2011. a well-earned win.the story intrigued me, it saddened me, it made me happy and hopeful and it made me think about myself and the choices I've made in my life. it was excellent. smart prose, smart characterization, smart and sensitive author. also, a lot of technical detail about building a giant bridge in the sky, across a strange and terrible and fascinating mist.hey you can read this for free:http://www.kijjohnson.com/MistBridge.doc"}, {"userName": "Nataliya", "userReviewDate": "Aug 21, 2014", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "Every beginning is the end of something, but every ending is also the beginning of something new. Change will come everywhere, eventually. Bittersweet and hopeful and, more than anything else, inevitable. \n\"But it will still have been a wonderful thing, to cross the mist.\"\nI can't promise you that you will love this story. All I can say - I loved it completely, but I've always been a strange kid.It is an unusual story. It lacks the extensive worldbuilding we assume from the beginning it will bring us. It lacks the conflicts and the unexpected turns of events that we are so used to when thinking of a plot. Instead, it slowly but surely glides along in its own river of narrative, focusing not on the obvious that we can expect - the vast Empire, the strange mist and the ominous creatures it harbors, the potential conflicts between the bridge makers and the ferry drivers, the old and the new - but instead, through the bridge and its construction, it focuses on people and 'the invisible web of connections' they form when they slowly, through small and big actions change the world in millions of little ways.Kit Meinem, an engineer and an architect, comes from the capital of Empire to bridge the mist river on the sides of which, hidden by very tall levees, are the small provincial towns (villages, rather) of Nearside and Farside. We don't know what exactly the mist is - except that it's a strange pearly white corrosive substance that flows in the deep riverbed into an ocean just like water, and hidden in its depth are the 'fishes' and the 'Big Ones' (or, as a local joke has it, maybe just Fairly Large Ones). From the bits and pieces we hear, it's clear that the mist is dangerous, and the Big Ones are a clear source of well-deserved fear. The mist river, splitting the Country in half, is only crossed by select few in the ferries, each time setting on a journey on which they know they can perish any time, guided by little else but courage and a gut instinct that on this particular day they can cross the mist and live to see another sunrise.\n\"​The mist streams he had bridged had not prepared him for anything like this. Those were tidy little flows, more like fog collecting in hollows than this. From this angle, the river no longer seemed a smooth flow of creamy whiteness, nor even gently heaped clouds. The mist forced itself into hillocks and hollows, tight slopes perhaps twenty feet high that folded into one another. It had a surface but it was irregular, cracked in places and translucent in others. The boundary didn’t seem as clearly defined as that between water and air.\"\nKit Meinem comes here with the plans to undertake a massive construction project - a suspension bridge that will cross the mist river, connecting the parts of the country, making crossing the river a mundane activity instead of a daring and often doomed feat of courage, eliminating the need for ferry crossing, and - as everyone knows - put an end to the world as it used to be, bridging it to a different future.\n\"​After a while, Kit noticed that a large part of the pattern that made a bridge or a tower was built entirely of people.\"\nAnd so the story flows through the five years Kit spends slowly but surely planning and overseeing the construction of the bridge - a feat thought almost impossible and yet inevitably progressing to its completion. Kit forms the 'invisible web of connections' with the towns and their inhabitants - especially with Rasali Ferry, a woman for whom the perilous crossing of the mist river in a ferry boat is both a curse and exhilarating destiny, whose work will be made obsolete when the bridge is finished and the dreaded 'Big Ones' are little but the creatures occasionally glimpsed from the towering height of the bridge, left behind in the wake of progress. \nHe had a sudden vision of the bridge overhead, a black span bisecting the star-spun sky, the parabolic arch of the chains perhaps visible, perhaps not. People would stride across the river an arrow’s flight overhead, unaware of this place beneath. Perhaps they would stop and look over the bridge’s railings but they would be too high to see the fish as any but small shadows—supposing they saw them at all, supposing they stopped at all. The Big Ones would be novelties, weird creatures that caused a safe shiver, like hearing a frightening story late at night.​Perhaps Rasali saw the same thing for she said suddenly, “Your bridge. It will change all this.”\nThe entire story flows like a chronicle of sorts - a big feat to accomplish in a comparatively short novella. (It reminds me actually of the spirit of Ivo Andric's The Bridge on the Drina, the underappreciated in the Western world epic Nobel Prize winning chronicle of a real life bridge in Bosnia). Through the narration that at times has almost a dreamlike quality to it, through brief glimpses of the construction over several years we see the surrounding towns grow and change, people change, new connections grow and form - the people and the bridge alike - and through all of this the growth and change even in Kit, the quietly unhappy precise and measured man who set out to alter the world.\n​“I know. You do care. But inside the framework of a project. Right now it’s your studies. Later it’ll be roads and bridges. But people around you—their lives go on outside the framework. They’re not just tools to your hand, even likable tools. Your life should go on, too. You should have more than roads to live for. Because if something does go wrong, you’ll need what you’re feeling to matter, to someone somewhere, anyway.”\nThis short novella has mesmerized me, has spoken to something inside of me that both embraces and fears the change, the movement, the flow of history and life. The inevitable movement of change of history, the progress propelled by people with the vision, the subtle and not-so-subtle changes moving forward creates in the community, the good and the bad and the unstoppable that comes with it, and the thought that every end is a beginning of something new, and every beginning is the end of something old.\n“Did I change the world?” He knew the answer already.​She looked at him for a moment as though trying to gauge his feelings. “Yes,” she said slowly after a moment. [...] ​“These cables will fail eventually, these stones will fall—but not the dream of crossing the mist, the dream of connection. Now that we know it can happen, it will always be here.”\n------------You can read this award-winning novella free on Kij Johnson's website-: http://www.kijjohnson.com/MistBridge.doc"}, {"userName": "Richard Derus", "userReviewDate": "Aug 22, 2014", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Rating: 4.5* of fiveThe Publisher Says: The river of Mist, an almost living organism, divides the Empire in two. A few Ferries make dangerous and treacherous journeys across the Mist when they can, trusting in good fortune and the uncanny skills of those plying the trade. *** A bridge across the Mist will greatly ease the suffering of those who risk crossing the river. The last bridge builder sent by the Empire died while building it. *** Kit now comes to the town of Nearside to complete the task left unfinished by the dead bridge builder. Will he be the man who will finally bridge the Mist?My Review: My Goodreads friend Nataliya recommended this novella to me today. The title, as beautiful and evocative as this author's debut collection of short fiction's was (At the Mouth of the River of Bees), hooked me; the Doc's warble of rapture sealed the deal.There was for everything a possibility, an invisible pattern that could be made manifest given work and the right materials.Bless you, dear Doc, bless you and those whose hurts and harms you heal with that magiqckal ability to see and fix a pattern. This story was a piece of my own pattern that was missing, and you gave it to me.This tale of a man in a world not entirely like our own, a man whose purpose is to function and whose function is to build, that needs a way to communicate and connect its parts. Technology isn't advanced, and there's not even a HINT of majgicqk to sully the handsome, spare caternary curve of the story. It is a story of a world beset by troubles we know bone-deep, connection and confusion and longing and fear. And every character, no matter how fleeting their time or how small their space on the page, carries the weight of their piece of the pattern fairly and squarely. This is how I know I'm in the presence of top-quality writing. I see the pattern, I sense the supporting structure, and I am still *in* the story. Many writers write lovely sentences and many others imagine some strong characters, relatable and investible, and many many more create stories that bind and grip and sweep and carry me away. A very few do two of these things, and a vanishingly small number do them all. In this work, Johnson has done them all.In a fortyish-page novella, five years of toil and change and death and learning fold into a structure as deceptively simple as an origami crane. The slow and unhurried pace at which the folds present themselves belies the time it took to craft them as well as the conciseness of their delivery. It is never easy to be brief. It is much more demanding to satisfy the jaded, spoiled-for-choice reader in a compact package.“The soul often hangs in a balance of some sort. Tonight do I lie down in the high fields with Dirk Tanner or not? At the fair, do I buy ribbons or wine? For the new ferry’s headboard, do I use camphor or pearwood? Small things. A kiss, a ribbon, a grain that coaxes the knife this way or that. They are not, Kit Meinem of Atyar. Our souls wait for our answer because any answer changes us. This is why I wait to decide what I feel about your bridge. I’m waiting until I know how I will be changed.”“You never know how things will change you,” Kit said.“If you don’t, you have not waited to find out.”Simple, direct, truthful, and (for me anyway) resonant with truth.Perhaps the defining moment of the story, the bridging of the Mist River, came for me when Kit and Rasali experience a deeply, intensely frightening encounter with the Mist. Reflecting on it, and on the death that comes for us all at some time we can't know for sure, Kij Johnson rang my eyes like gongs:“If {Death} comes for you?” he said. “Would you be so sanguine then?”She laughed and the pensiveness was gone. “No indeed. I will curse the stars and go down fighting. But it will still have been a wonderful thing, to cross the mist.”Won't it, though?\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License."}, {"userName": "Lyn", "userReviewDate": "Jan 03, 2015", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "“The soul often hangs in a balance of some sort. Tonight do I lie down in the high fields with Dirk Tanner or not? At the fair, do I buy ribbons or wine? For the new ferry’s headboard, do I use camphor or pearwood? Small things. A kiss, a ribbon, a grain that coaxes the knife this way or that. They are not, Kit Meinem of Atyar. Our souls wait for our answer because any answer changes us. This is why I wait to decide what I feel about your bridge. I’m waiting until I know how I will be changed.”The Man Who Bridged the Mist by Kij Johnson won both the Hugo and the Nebula for best novella.I’m not sure what other stories were nominated, I am sure they were all well written by talented writers that tell fine stories – but this one was really, really good.This works on so many levels: it is an interesting science fiction story, it is an intense and revealing character study of a complicated man in a complex and alien culture, and it is a brilliant allegory of obstacles that keep us apart and connections that bring us together.Johnson has introduced the reader to a fascinatingly mysterious and alien culture. There is a river of mist that is caustic like acid and in it swims indefinable monsters. There is an Empire that is split in two by the mist, there are families and friends whose lives are defined by what separates them, and there are families who accept a generational sacrifice for the duties placed upon them by the obstacles.Like the best storytellers, Johnson shares with us what needs to be known and leaves a lot of mystery, we end with questions unanswered and ambiguities unexplained. I am sure there will be those who want MORE, MORE, MORE – a trilogy, a series of Mist with an accompanying graphic novels – but I hope not. Johnson has given us a wonderful gift, a beautifully written, minimalistic treasure, a work that stands alone.I cannot help comparing this to Lucius Shepard’s brilliant The Dragon Griaule stories."}, {"userName": "Sarah", "userReviewDate": "Apr 24, 2012", "userURL": "http://www.goodreads.com/user/show/642041-sarah", "userReview": "I like stories that lie on this particular border of fantasy and science fiction: stories set in strange cultures or places that are in themselves the fantastic element, allowing the focus to be on the characters and how they react to their environment. This story has the requisite stranger come to town, which allows the reader to experience a simple and scary and beautiful location through his fresh eyes. It's a lovely read and worthy Nebula-and-Hugo Best Novella nominee, though I think it will probably lose out to the gorgeous Valente piece."}, {"userName": "Ana ", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/5237420-ana", "userReview": "Anything is safe until it kills you. I loved this short story. It's well written, it has a nice feel to it, like for the first time you touch silk, for example, and you are amazed by how it moves in your hands. That's the way this story made me feel. Lately I'm really into short stories, because I haven't read much of them over the years and I recently found out I have a passion for them, so I devour anything that I can find. Kij Johnson is one good writer and she can put thoughts into words without missing a single idea! Love love love it!"}, {"userName": "Althea Ann", "userReviewDate": "Aug 20, 2013", "userURL": "http://www.goodreads.com/user/show/3846743-althea-ann", "userReview": "A beautiful and romantic fantasy novella of an engineer who arrives to build a bridge over a river of poisonous mist, and the ferrywoman whose life has been devoted to crossing that treacherous expanse. Evocative, thoughtful, and bittersweet."}, {"userName": "Derek", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/5420722-derek", "userReview": "This is so not the kind of story I love.I love epic fantasy and space opera and technological thrillers. As one of my favorite reviewers says, a book needs BOOM!      And yet this quiet character study moved me.  But why is it a novella? I want to know more about Kit, and Rasali, and the empire, and Mist, and ... MORE!"}, {"userName": "prk", "userReviewDate": "Jun 13, 2012", "userURL": "http://www.goodreads.com/user/show/9961837-prk", "userReview": "Reviewed as part of the 2012 Hugo Voter Packet.Synopsis: Kit Meinem, engineer and architect, comes to the towns of Nearside and Farside to finish construction of a bridge over the magical and mysterious Mist. Once complete, this bridge will join the Empire, currently split by the Mist, and herald significant changes to the two towns, including the end of the need for the Ferryfolk.Plot: Kit needs to build a bridge and get over it. No, I’m not kidding, that’s pretty much the entirety of the plot.Characters: What’s lacking in plot is made up for in characterisation. We get significant insight and character development of Kit, who approaches initially as a somewhat aloof character trying not to alienate the townsfolk and ends up forming solid friendships and relationships with them. We also get snippets of characterisation from a number of townsfolk and people in Kit’s life, including Rasali Ferry of Farside, the lead Ferrywoman, who’s livelihood and meaning in life will be rendered obsolete if the bridge is completed.Scope: In one way, this novella is very small in scope, focussing entirely on Kit and the building of the bridge, with no coverage of the Empire, the Mist, or any of the rest of the world. In another way, the novella is wide in scope, and examines the importance of human interaction and personalities in completing large projects and the significant changes in Kit’s life through the relationships he forms with the townsfolk and his lover.Writing: Nothing specific to comment on, writing wise.Pacing: The pacing is reasonable, with a steady build up (pun intended) towards the completion of the bridge. There are some appropriate interludes, cleverly done, based on emotions and events, which allow us to see even more of Kit’s character development.Other Comments: I found the ending of the novella very anti-climactic and this left me rather dissatisfied with the story as a whole. I wanted to know more about the Empire, about the Mist and about the world, none of which was forthcoming.Overall: I suspect that for the reader who likes character driven stories, this would have been a very enjoyable novella. However, as more of a plot driven reader, I didn’t enjoy it that much."}, {"userName": "G33z3r", "userReviewDate": "Oct 09, 2013", "userURL": "http://www.goodreads.com/user/show/7136749-g33z3r", "userReview": "An extremely entertaining story concerning the construction of a bridge across a chasm filled with a strange mist, and of the man who oversees that construction, and the effect he has on the people on either side of the chasm. A couple of really well-drawn characters, and a deliberately-paced story of the masses communal undertaking.(I can't decide whether this is science fiction taking place on another planet or fantasy taking place in another world.)"}, {"userName": "Suz", "userReviewDate": "Aug 20, 2012", "userURL": "http://www.goodreads.com/user/show/241989-suz", "userReview": "This is one of those books that is hard for me to classify as either sci-fi or fantasy.It's deliciously subtle and simple and complex, all at the same time. Kit is a bridge builder who has come to build a bridge across the mist. This mist \"river\" slices the empire nearly in half. The only way to cross the mist is by ferry, which is more than a little treacherous. The mist is dangerous and mysterious. Its properties are neither thoroughly explained, nor really Known. There are dangerous creatures that live in the mist and it seems to be largely unpredictable.This story isn't about the mist, though, although it is almost its own character. The story is about Kit and not just his building of the bridge, but his life, his character and his relationship with the townsfolk and other workers, especially the ferry-woman Rasali, whose livelihood (and love) his bridge will destroy. I love the townsfolk, the characters, their feelings and acceptance of life. I love the environment and the weirdness and zen of it all.This work is complicated and deep, gentle and sophisticated. I've only read a couple of Johnson's other works and she's just a consistently phenomenal writer. This doesn't have the emotional sucker punch of last year's Ponies, but it's just as strong and beautifully done."}, {"userName": "Horia Ursu", "userReviewDate": "Aug 22, 2016", "userURL": "http://www.goodreads.com/user/show/1228759-horia-ursu", "userReview": "A well-deserved Hugo and Nebula win for this great story by Kij Johnson, a writer whose work I am just beginning to explore. Excellent storytelling, great world-building, and the end that I was hoping for. There are more stories to tell in this fictional universe and I hope Kij Johnson will write more soon."}, {"userName": "Anthony Panegyres", "userReviewDate": "May 20, 2016", "userURL": "http://www.goodreads.com/user/show/24743734-anthony-panegyres", "userReview": "Growing up with a civil engineer as a father, I could really relate to this work. A beautiful and gentle novella about engineering, love and change. Liked the fact that it wasn't overly pacey but, like the bridge being built, the story took all the time it needed. A fresh take. Recommend it."}, {"userName": "Sunil", "userReviewDate": "Apr 07, 2013", "userURL": "http://www.goodreads.com/user/show/7364359-sunil", "userReview": "There is a man. He bridges the mist. This story is boring and there's nothing interesting about it besides detailed descriptions of bridgemaking. I have no idea why it won the Hugo over its superior competitors."}, {"userName": "Elessar", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/3412308-elessar", "userReview": "Chronique complète[...] Kij Johnson nous offre ici une superbe tranche de vie, un récit humain et touchant, plein de poésie. Il y a vraiment une ambiance particulière qui se dégage de ce texte, on a presque l'impression de naviguer nous aussi sur le fleuve de brume.Encore une fois, Le Bélial fait mouche avec cette excellente novella pleine d'émotion qui nous permet de découvrir une auteure quasiment pas publié en france."}, {"userName": "Kristin", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/892406-kristin", "userReview": "I knew this one was going to be good. Kij's short story \"Ponies\" from 2011 Hugo Nominees elicited a very strong Ewww response. If a writer can pull an emotion out of the reader like that, they know how to write. Kij had demonstrated she knows how to write well. Man/Bridged had a fascinating world setting and was an interesting look at how a large scale project can be looked at in so many different ways. Well done."}, {"userName": "A. Dawes", "userReviewDate": "May 28, 2016", "userURL": "http://www.goodreads.com/user/show/55066255-a-dawes", "userReview": "3.5 starsA fantasy novella, set in another world, which feels much older than our own. This is a story about engineering feats and love. I found it both brave and unique. It flows along at a gentle, unforced pace. An enjoyable and recommended read."}, {"userName": "Abbas", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/193550-abbas", "userReview": "درست می‌دونست کجا لازمه فضا رو عوض کنه. ایدهٔ پیچیده‌ای نداشت ولی موضوع هم ایده نبود. عالی بود."}, {"userName": "Andrea", "userReviewDate": "Oct 15, 2012", "userURL": "http://www.goodreads.com/user/show/5277400-andrea", "userReview": "I read this in Asimov's, and immediately knew here was an award winner. Subtle, haunting, exquisite."}, {"userName": "The Cannibal", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/25756716-the-cannibal", "userReview": "♫ Faire un pont ♪ Pour de bon ♪ Lui donner ♫ Ton prénom ♪ Le traverser ♪ Pour t’embrasser ♫ Faire un pont ♪Si Dick Rivers ne vous tente pas, vous pouvez toujours siffler la musique du film « Le pont de la rivière Kwaï », seul film (ou livre) que je connaissais et qui parlait de la construction d’un pont entre deux rives.Maintenant, sur mon CV, je pourrai ajouter que je sais comment construire un pont sur une rivière de brume, rivière qui est remplie de trucs pas nets, genre des gros poissons ou des géants que l’on n’a jamais vu, mais qui ont déjà fait chavirer bien des barges.On ne sait pas d’où vient cette brume épaisse, ni où elle va, ni même s’il y a de l’eau sous la brume, tout ce que l’on sait, c’est que certains il ne fait pas bon naviguer dessus et que cette foutue brume coupe l’Empire en deux !En peu de pages, l’auteur arrive à nous faire ressentir de l’empathie pour ses personnages, dont les deux principaux, Kit Meinem d’Atyar, l’architecte du pont et Rasali Bac, celle qui aide les gens à traverser ce fleuve de brume qui fait 400 mètres de large.Une belle histoire d’amour, tout en retenue, tout en douceur, une belle histoire humaine de construction d’un pont qui prend des années, une histoire de défis humains, de stress, de paperasses (et oui, chez eux aussi).Une belle histoire qui nous montre aussi que la vie dans les deux villages séparés par le fleuve de brume est en train de changer aussi, avec l’arrivée des travailleurs et du fait qu’il ne faudra plus prendre les bacs pour passer d’un côté à l’autre.Un court roman de SF qui se lit paisiblement, un mojito à la main et où, en plus de voir un pont prendre forme, on voit une société et des personnages se transformer.Très plaisant. Une petite bouffée d’air frais que j’ai pris grand plaisir à respirer."}, {"userName": "Mladoria", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/41761029-mladoria", "userReview": "A dire vrai, je ne sais pas trop comment je me sens au sortir de cette lecture ! Un peu déboussolée, émue, remuée, perdue dans la brume qui nimbe ce récit.Le moins que je puisse en dire c'est qu'il mérite les prix qui lui ont été décerné. L'originalité de cette histoire dépayse complètement. Ce n'est pas bourré d'action, c'est plutôt contemplatif et foncièrement poétique.Mais on a envie d'aller au bout de cette histoire, celle de Kit et Rasali, de tous les habitants de Proche et Loinville, l'histoire de la naissance de ce pont, de ce fleuve impétueux et dangereux, enveloppé du mystère de cette brume délétère et des créatures, ces Géants qui rôdent aux abords sans jamais se montrer clairement, comme des monstres chimériques qui se cachent aux limites de l'imaginaire collectif. Le tout avec une fin pleine de promesses d'aventures à venir, pour continuer à rêver, les yeux rivés vers l'horizon, les pieds plantés sur le fait du pont sur la brume !"}, {"userName": "Francis Thibeault", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/31534570-francis-thibeault", "userReview": "J'avais beaucoup entendu vanter cette novella de Kij Johnson dans la presse et par les internautes. Et bien que le concept d'un pont sur la brume intense soit original et invitant, je trouve que l'on a mal exploité le sujet, car la SF dans cette plaquette devient plutôt un prétexte pour l'intériorisation et le développement du portrait psychologique des personnages. L'on construit des ponts, des débuts, des fins, des entre-deux. Je déplore pourtant la grande liberté que s'est permis l'auteur à la fin de cette novella, de croire que l'on pourrait s'imaginer notre propre suite, s'imaginer ce qui adviendra des personnes après le récit. Pour moi, cette fin est une déception en soi, mais je ne déplore toutefois pas le talent de l'auteur. Seulement, je m'attendais à plus que ça..."}, {"userName": "Tyler", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/3938670-tyler", "userReview": "The Man Who Bridged the Mist is a Nebula and Hugo award-winning novella by Kij Johnson. The story is as the title suggested, but the mist is a thick, poisonous river that houses dangerous creatures. It also focuses on the bridge builder, Kit Meinem, and his relationship with the town-folk on either side of the mist, and with Rasali Ferry, one of the few ferry captains who cross the treacherous mist.A delightful and entertaining story dealing with the interconnection of people, and how we deal with change."}, {"userName": "Patrick", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/11024213-patrick", "userReview": "I asked myself why the hell I was reading this on every page. A man sets out to build a bridge; he builds a bridge; wins both Hugo and Nebula. What? Don't tell me one ought to read this for the characters. There are no characters here. Read Wendell Berry, Chekhov, Hilary Mantel, whoever. Those are characters. They cast shadows. They make hard choices. They achieve genuine insights. I'd recommend John Williams' novel Stoner for anyone who liked what Kij Johnson's book was trying to be."}, {"userName": "Marie-paule", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/7627039-marie-paule", "userReview": "ProcheVille et Loinville, entre les deux le fleuve et la Brume. Une brume vivante avec ses formes, les gros poissons et les geants qui engloutissent les bacs de passage de la brume parfois. Rasadi est une passeuse, ainsi que Valo. Un jour arrive Kit, l'architecte, venu pour construire le pont sur la brume...mi science fiction, mi saga aventure battisseur romanesque, ce petit livre se lit vite et agreablement. Une histoire de brume qui m'a fait pense aux scultures de brumes de Fujiko Nagaya ..."}, {"userName": "Andrew Morris", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/19620282-andrew-morris", "userReview": "Simple and beautiful"}, {"userName": "Ana Rigby", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/38469478-ana-rigby", "userReview": "The idea was very interesting, even though the narration was sometimes too slow for me."}, {"userName": "Philipp", "userReviewDate": "Dec 22, 2017", "userURL": "http://www.goodreads.com/user/show/8325737-philipp", "userReview": "You know this is fantasy since people are in touch with their emotions."}, {"userName": "Sero", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/58405239-sero", "userReview": "3.5"}, {"userName": "John Wiswell", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/147818-john-wiswell", "userReview": "My first longer work from Kij Johnson, who has wowed me every time with her short stories. The first impression was how it lacked that verve and immediate sense of purpose that “Spar” and “Mantis Wives” have from their first paragraphs, even though the story is so deliberate that the lead’s desire is its title. Here we follow an outsider, who was an anti-social bookworm as a kid and is now a frequent traveler and engineer of difficult structures, planning to build a bridge across a giant river of caustic mist, beneath which moves dangerous creatures only called “the Big Ones.” The territory of the Empire is split by this river, and it will change the course of commerce if he can erect this great bridge.In terms of Fantasy, it’s nice reading a story about simple construction, no war or epic destiny waiting on it. He’s never besieged by orcs, though sometimes by bad weather. And he has an interesting side, particularly early on when he observes that “a large part of the pattern” of building a bridge is made up of people. It’s exciting to get a sociological view on how to motivate the locals to yield materials and brave dangerous work to construct something the likes of which the world has never seen.But the sociology falls away very quickly, and while we meet some interesting faces, they’re washed aside by tide of other non-recurring names. It’s a bummer to meet the eccentric hands-on Liu Breaker and then have her never resume a speaking role again, especially when the dialogue begins to shift to our lead’s pathos. He mourns the world he’s changing, what he’s taking away from ferry captains and the like, and does so exclusively in talking. There’s never a revealing action; the novella devolves into the announcement of melancholy, which is not something I’d cross a bridge for.What we come for is that Johnson verve, and there’s still some of it keeping it above a typical story. That first page crinkles with details, with golden limestone walls and the schematics hidden in folios. And she lands some memorable lines – “Anything is safe until it kills you” could have been an alternate title."}], "description": "Novella.Nebula Award for best novella of 2011.Hugo Award for best novella of 2011.Sturgeon Award finalist for best short SF of 2011 (Johnson is a juror, thus withdrew it from contention).Locus Award finalist for best novella of 2011.Kit came to Nearside with two trunks and an oiled-cloth folio full of plans...", "title": "The Man Who Bridged the Mist", "url": "http://www.goodreads.com/book/show/13554238-the-man-who-bridged-the-mist", "average": 3.93, "cover": "https://images.gr-assets.com/books/1332267535l/13554238.jpg", "reviews": 64, "authors": [{"url": "https://www.goodreads.com/author/show/110153.Kij_Johnson", "name": "Kij Johnson"}], "type": ["Fantasy", "Science Fiction", "Short Stories", "Novella", "Speculative Fiction"], "outlinks": ["http://www.goodreads.com/book/show/13554238-the-man-who-bridged-the-mist", "http://www.goodreads.com/book/show/17086022-the-man-who-bridged-the-mist", "http://www.goodreads.com/book/show/31694093-un-pont-sur-la-brume", "http://www.goodreads.com/book/show/29635545-the-dream-quest-of-vellitt-boe", "http://www.goodreads.com/book/show/12970063-at-the-mouth-of-the-river-of-bees", "http://www.goodreads.com/book/show/189022.The_Fox_Woman", "http://www.goodreads.com/book/show/10452275-ponies", "http://www.goodreads.com/book/show/189015.Fudoki", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}