{"ratings": 637, "userreviews": [{"userName": "A.F.", "userReviewDate": "Apr 30, 2012", "userURL": "http://www.goodreads.com/user/show/838705-a-f", "userReview": "I loved this book. Now I might have been a bit pre-disposed to enjoy it considering it’s full of things that interest me: ghosts, history and circus performers, but there is enough charm and grace in the book to entrance any reader.The book essentially tells the story of two women, Marisa, who is starting her life over after loss, and the ghostly Lucinda, whose truth has been lost in time. Their stories interweave in a fascinating tale of mystery, ghosts, romance, and circus history until they collide in a tense conclusion.The perspective of this novel is told from two points-of views, Marisa’s and Lucinda’s, and shifts the reader back and forth from the modern day to the early 20th century. Now this change could have easily become disjointed, but the author makes the transition seamless, and as a reader I flowed through the story effortlessly. Both Marisa and Lucinda are compelling characters -never seeming helpless or weak, even when they faced adversity- and you are naturally pulled into their captivating parallel stories.The book is also rich in alluring backdrops of setting and description. Both worlds come to life exquisitely as the book takes you on a charismatic journey through modern Florida and the bygone era of the heydays of carnivals and circuses. This lovely detailing keeps the book’s pace flowing perfectly until the end.The Midget’s House is an easy and enthusiastic recommend"}, {"userName": "Cheryl Landmark", "userReviewDate": "Aug 02, 2014", "userURL": "http://www.goodreads.com/user/show/4411217-cheryl-landmark", "userReview": "I really enjoyed this book. It was an awesome blend of historical fiction, paranormal spookiness and intriguing mystery and was very well-written. The two separate viewpoints--Lucinda's and Marisa's--could very well have made the story disjointed, but the author did an excellent job of keeping the transition between their POV's and different timelines flowing smoothly and effortlessly.Lucinda's story was the highlight of the book for me with her descriptions of life as a midget \"freak\" in circuses and sideshows in the 1920's. She was a great character, who, despite all the ridicule and insults she received as a little person, still managed to remain strong and beautiful.Marisa's modern day timeline also had its enjoyable aspects with her struggles to keep the intriguing Midget House from being demolished by land developers.The author obviously spent a great deal of time researching her topic and it shows in the excellent writing. Well done, Ms. Bartholomew!"}, {"userName": "Elizabeth", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/3682569-elizabeth", "userReview": "An interesting book about 2 women, one dead, one alive who live in a charming cottage in Sarasota, FL. The house has been built for a midget. Marisa, who had lived in the cottage for a short time in childhood inherits it quite unexpectedly. She moves in and learns a developer is trying to get the land to build condos, the taxes haven't been paid in several years, and weird things keep happening in the house itself. The chapters go back and forth between now and the 1920's freak shows that were part of every circus. Lucinda is a midget who joined the circus when it was traveling through TN. It was interesting to learn about circus life. Marisa investigates the history of her house and learns , in the words of Paul Harvey, the rest of the story about a pivotal event in the mid 1920's.The book is fiction but the author lives in a cottage in Sarasota built for midgets."}, {"userName": "Tisha", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/11363171-tisha", "userReview": "I wish there was a 4.5 rating on this book, because that was what I would give this very good book. The setting jumps between the \"freak\" shows of the 1920's circus culture and current day Florida's real-estate boom. This book is similar in a lot of ways to Water for Elephants, which I also liked. As the title says, it is a love story, a ghost story and a circus story. With that many genres, it could make a book seem jumbled, but Ms. Bartholomew did a great job at making all the elements work together very well. The writing flowed well enough, even given the jumps in setting, to allow me to forget I was reading and just feel like I was experiencing the story. This, to me, is the litmus test for a good book.All in all, a really good book and I would recommend it to anyone who wants a good read."}, {"userName": "Christine", "userReviewDate": "Jun 08, 2012", "userURL": "http://www.goodreads.com/user/show/4685573-christine", "userReview": "I read this book on the kindle, and also was able to get it for free.As a little kindle read, and as a free book, I was pretty pleased with it. Because the story is short, and it occasionally jumps from two different viewpoints, the story is kept fresh and interesting. Usually I don't care for jumping from different people, but this book managed to pull it off tastefully, and both viewpoints were fairly interesting (although Lucinda's was more so).Overall, it was a charming as a normally priced book, but great as a \"bargain\" book."}, {"userName": "Jeanine", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/5795170-jeanine", "userReview": "Excellent story, read in one sitting."}, {"userName": "Suzy", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/8129152-suzy", "userReview": "I loved it!This is a wonderful book. The characters are all well developed. The \"bad guys\" are never caricatures or stereotypical. The \"good guys\" and sympathetic without being portrayed as perfect. There are surprises all along the way. The story is extremely engaging. I was sorry when I finished it."}, {"userName": "Ginny", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/5112878-ginny", "userReview": "I enjoy quirky characters and unusual stories. The Midget's House fits both categories well. I did not connect as well with the characters as I wished, however, and I don't really know why. Still, it was a pleasant read and if you're looking for an interesting story with different twists, you will like this one."}, {"userName": "Stephanie L Fisher Watkins", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/54877799-stephanie-l-fisher-watkins", "userReview": "This was a nice break from all the serious stuff in the world. I liked this book, anyone who just wants something of a get away and not to long should check it out."}, {"userName": "Tomi", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/63185771-tomi", "userReview": "Pretty good, although the ending was really predictable. Maybe the author did a little too good of a job dropping breadcrumbs along the way."}, {"userName": "Michael J Schult", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/60508905-michael-j-schult", "userReview": "I have to rate before readingThats not fair you have tor ate before reading because people cant say if its good or bad yet so i say it is dumb"}, {"userName": "Sue", "userReviewDate": "Jul 29, 2012", "userURL": "http://www.goodreads.com/user/show/6238733-sue", "userReview": "I loved this book so much I want to take a picture of it and hang it in my heart. I really need to stop overrating the books I really really like and leave five stars for books that I love as much as this one. The characters, the story, the voices are so vivid that reading it was practically a hallucinatory experience for me. I could totally differentiate between individual voices and when the ghost spoke, she sounded like she was giving a fascinating oral history.Inspired by the author's own Sarasota home and its surrounding history of circus employees, it is a ghost story about Lucinda's early 20th-century life as a circus midget and her doomed love affair with the circus owner. Lucinda's story runs parallel with story of the house's current 21st-century inhabitant, Marisa--a single (divorced) woman with a nice cat and very bad judgement in men. Because of her own personal history with the house, Marisa feels called upon to save the house, surrounding land and its wildlife from developers. She feels pitted against and afraid of the ghost Lucinda because she does not know her story. However, we the readers are privvy and sympathetic to the Lucinda's history, learning a little more and a little more, several steps ahead of Marisa, as we go.I particularly loved the interesting historical factoids and the side stories about the 1918 Spanish influenza epidemic and the effect of WW I on the circus performers. I also really appreciated the acknowledgement of gay love, both then and now. I loved the many details about living in circus communities and the humanizing of the \"freaks.\"The author clearly did a lot of loving, personalized research into circus history and culture. She writes very respectfully of the \"freaks\" who otherwise might have had no employment because they were either born poor or visibly different. Much like sex workers, they learned to earn money from their bodies while disdaining and cheating the \"rubes\" on their circuits, who paid cash from their pockets to be shocked and awed. Lots of food for thought about how human beings mistreat and exploit one another based on appearance and lack of wealth.The ending is so satisfying, even though it is a bit too neat. I just really wanted happiness for Lucinda and Marisa and was happy to get it, even at cost to credibility. I finished the book awash in goosebumps. Will read again! Very grateful I got it via free download. :)This review also appears on Amazon."}, {"userName": "ѦѺ™", "userReviewDate": "Jan 25, 2012", "userURL": "http://www.goodreads.com/user/show/4555905", "userReview": "\"It always amazes me to think that every house on every street is full of so many stories; so many triumphs and tragedies, and all we see are yards and driveways.\" - Glenn CloseMarisa Delano's elation at inheriting a house straight from the pages of a fairy tale book turns dismal and terrifying. there are expenses that need to be settled and other people want a piece of Marisa's house. moreover, Lucinda Lacey's ghost is reaching beyond the grave to stake her claim on the property as well. author Anita Bartholomew's novel takes the reader on a trip down memory lane to the circuses and freak shows of the early twentieth century to modern-day Florida. the voices of Marisa and Lucinda alternate throughout the book. each woman tells her story and despite the differences in time and circumstances, both of them are bound by one single thing - a house. i enjoyed reading about the early days of the circus and what the whole troupe had to undergo in order to make a living and entertain crowds across America. without demystifying the appeal circuses have for me, i also found amusing some inside information about them. between the two women, i was more fascinated with Lucinda's character. i could just imagine the world she grew up and lived in as a midget. despite her stature, she comes across as a very strong person. she is equally vulnerable to taunts and ridicule because of her size but she remains confident and beautiful inside and out. in addition, her love affair makes the whole book interesting because the origin and secrets of the house are tied to it. Ms. Bartholomew's writing really stands out whenever Lucinda speaks especially when she describes how Lucinda attempts to find her way from the other side to the world of the living. those interludes had a lyrical and dream-like quality to them. overall, a good book with a good story and i would recommend it those who love the circus, enjoy a bit of romance and would not mind having a ghost thrown into the bargain."}, {"userName": "Marti", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/7224922-marti", "userReview": "While this book sometimes seemed to move a bit slowly, I did like it quite a lot. It basically has 2 main characters, Marisa and Lucinda. In 2004, Marisa's life was pretty much going off the rails. She'd gotten out of a disastrous marraige and not long after that, her beloved mother had died. When she learned that she'd inherited a house from a distant relative in Sarasota, FL, she felt it was a sign of a way for her to make a fresh, new start. Unfortunately, there were many problems with the house including the many rumors that it had been haunted. More \"real world\" problems included the fact that the house was in poor condition, and a developer was threatening to use Imminent Domain to seize the house in order to make a new set of McMansions. Lucinda, a little person, who lived in the early part of the 20th century, had traveled with the circus after her beloved brother helped her escape from her abusive father. She didn't really like being gawked at as a freak, but it was a better life than the one from which she had escaped. The chapters generally alternate between Marisa's story and Lucinda's. Of course, eventually, their stories do coincide. There had been a terrible fire which had killed Lucinda and another person and Lucinda had been blamed. When Marisa found that out, she still wanted the house but was pretty afraid to stay there. This book came to a very satisfying conclusion. I would readily recommend this book, especially those who like more than one genre included within the confines of one book."}, {"userName": "Shari Larsen", "userReviewDate": "Oct 06, 2012", "userURL": "http://www.goodreads.com/user/show/2751691-shari-larsen", "userReview": "This novel is the tale of two women, one alive, one long since dead, each mourning lost love and struggling for control of the one place that feels like home.Marisa is thrilled when she inherits the enchanting, fairy-tale like cottage in Sarasota, Florida, after her Aunt Enid passes away, until she learns that Lucinda Lacey, a sideshow midget who died on the property in 1924, still inhabits it. She searches for clues to discover what happened on the day Lucinda died.The story alternates between Marisa in the present day, and Lucinda, who started traveling with the circus in 1917, to escape her abusive father, and later did shows for carnivals before ending up in Sarasota. Lucinda's point of view is not only set during her \"living\" years, but also of the spirit version of herself.I enjoyed this story, especially Lucinda's since I love historical fiction. It had a few spooky parts, but nothing too scary; just enough to send a chill up the spine but not bad enough to keep you keep you awake if you are reading this before bedtime.This story was inspired by the house the author lives in, which was thought to be a house that John Ringling built to house the dwarfs who performed in his shows, and it was called \"the midget house\" because of it's petite appearance from the street and the odd placement of the windows, which seemed to be placed a lot lower than in an ordinary house. If you want to read more about the house that inspired this story, go to: http://www.heraldtribune.com/article/..."}, {"userName": "Rebecca Jo", "userReviewDate": "Mar 27, 2012", "userURL": "http://www.goodreads.com/user/show/3627659-rebecca-jo", "userReview": "A friend recommended this book after I finished reading Water for Elephants. This was another 'circus-themed' book... but much different.This book is about a house that was built for midget's in the time of carnivals, traveling circuses - a place where people would come & watch these small people... but it never worked out as planned.I'm not even sure how to explain the book... its told from 2 different times... from Lucinda, the small person who owned the house & from Marisa, the owner of the house today. Lucinda is a spirit that is stuck in the house & Marisa can feel her presence & all the odd things happening around her.The story flips back & forth so we get to see what happened in the past as well as what Marisa was doing with the house in the present...I absolutely loved this book... didnt want it to end.I loved hearing about Lucinda's life & how she traveled with the circus & carnivals & the people she met, who became her friends, & the man she fell in love with, Cyprus.& I loved hearing about Marisa - a child who grew up in this house when her aunt owned it & then inherited it when her aunt passed away. Marissa has a fight on her hands to keep the house from being demolishedI dont want to give anything away... I just know I loved the story. The way the characters tied into each other, the history of the traveling circus, the story of Lucinda being different& just wanted the things everyone wants... love.Thank you to my friend for recommending it... definitely enjoyed every minute of reading it."}, {"userName": "Desiree reilly", "userReviewDate": "Jun 12, 2012", "userURL": "http://www.goodreads.com/user/show/2710062-desiree-reilly", "userReview": "his review is from: The Midget's House: A Circus Story... A Love Story... A Ghost Story (Paperback)Here is great story and then i got it for a review and then the author done a great job going in to the era of the circus.You see there is a lot of circus out there and then they go form one town to another. The story start off were a boy and his sister is heading out off the family farm. The sister is small and then she not like all other kids dads need the boys to work on the farm.So the brother said we need to find something for you .well the story goes on and the brother and sister keep in touch she goes form one town and then she find love she thought it wswith the man who ran the circus and then the circus go to Florida for the winter and then one thing goes form one thing to otherand then the lovers move to get together.well the family house burn down and then there is house left on the propriety and it left to relative well the house is empty the whole time. And then it run down so it need a lot of repair well the relative want to have the house and then some one who is suppose to be the uncle who is suppose to take care of the probetyThe house is haunted with the one who live in the small house but how is she going to not let the rich one get the house totear it down and build height rise condo. You see her aunt left some thing for her and who find it and then let her know about thefind you will love the story and then i love doing the reading and hope t"}, {"userName": "Jeannie and Louis Rigod", "userReviewDate": "Jan 28, 2012", "userURL": "http://www.goodreads.com/user/show/3049435-jeannie-and-louis-rigod", "userReview": "I really enjoyed this look at the mystery, history, and background to the famous circus sideshows. The book takes place in Sarasota, FL where a woman inherits a house known locally as the \"Midget's House.\"The book swings from two narratives. The first is Marisa Delano. Her Aunt, Enid Parker died and left this house and property to Marisa. Unfortunately, her Cousin is left lifetime tenancy in an apartment over the garage and you get a sense of trouble from him. Marisa is delighted to own this house that is just a wee bit smaller scale than a normal home. Through rumors she learns of the nickname of the house.Everyone wants her to sell the property. The lawyer, the developer, and Cousin Otto. Meanwhile, Marissa gets sued by a tortoise protection group. Marissa can't figure out why they all are so eager to get rid of this perfect house.The second narrative is from Lucinda Lacey, a midget from the days of traveling circuses and side show Freaks. The house was hers. She knows the secret of how Cyrus Parker died (she was blamed,) and also the secret that lies within the house. Lucinda is a ghost.Ms. Bartholomew did complete and thorough research into times, lives, and yes, into the actual house described within this wonderful historical fiction novel. I hope to read more novels by Ms.Bartholomew in the future."}, {"userName": "Rebecca Graf", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/1027658-rebecca-graf", "userReview": "A woman inherits a house and is determined to make it her home despite everything against her including a ghost. It is called The Midget’s House because it was built for a midget during the times of the great circuses. A circus owner loves a woman so much that he will give her a house but cannot publically call her his mistress. A mysterious fire and death brings the new owner of the house into a search for the past and a threat in the present. The story takes you from the present to the past and through the eyes of the woman who inherited the house and the midget who was given the house. I love the exposure to a world I was unfamiliar with. It was fascinating. The mystery plot was well done with so many secrets that were revealed little by little. Some created new questions which kept me hooked. This was more than just a ghost story. Yes, the ghost of the midget was there, but her reasonings aren’t as horrible as I originally thought. The story is deep and well-done.I highly recommend this read. You’ll enjoy the worlds it opens up to you.Note: I purchased this book with my own funds with no expectation of a positive review."}, {"userName": "Melody", "userReviewDate": "Feb 15, 2012", "userURL": "http://www.goodreads.com/user/show/4550617-melody", "userReview": "This is a charming book! A book for anyone who loved the circus history of Water for Elephants and anyone that loves a little ghost story thrown in with the mystery & charms of an old house; this book is for you. Similar to Water.. it flips back & forth between present day & a time frame of around 1920ish. Present day depicting the current character's story & past representing the former lady Lucinda that is a mere 'ghost' of her former self in the present day story line. I was rooting for both present & past characters by the end of the book. This is Bartholomew's first novel & it was well done!! I appreciate the work she put into the circus research for this story as well as it having taking shape as an idea from her own home. While the circus' of the past were not always sunshine & rainbows I enjoy reading about the history of 'how it was'. I pass this book (recommendation) along for the fun & intrigue it gave me; I hope it proves to be the same for you!"}, {"userName": "Georgeanna", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/5182226-georgeanna", "userReview": "The Midget's House was a light, enjoyable read. The main character, Marisa, is an easy going woman with a very old aunt who dies - and unexpectedly leaves her house to Marisa. Having fond memories of the place from her childhood, Marisa is delighted. Of course, it's hard to keep being so delighted when she finds the house in serious disrepair. And in serious debt due to unpaid back taxes. And has a miserable old man living above the garage. And an unscrupulous land developer who needs to knock the house down to complete his current project. And that's all before she realizes that she's got a ghost haunting the place.            Marisa is charming and has her head on straight. Her friends are fun and a little kooky. I would recommend this to anyone looking for an engaging, light mystery. It would also be appropriate for the YA audience with no swearing, violence, or sex scenes."}, {"userName": "Empress5150", "userReviewDate": "Aug 25, 2015", "userURL": "http://www.goodreads.com/user/show/2561148-empress5150", "userReview": "2+.I realize this is a first novel and as such, will be lenient.I live in Sarasota and drove by this house; this is the only reason I decided to read the book. I've always been somewhat interested in the circus; especially the sideshow aspect of it. The part of this book that dealt with that was pretty good.As for the rest, well, not so much; pretty simple plot, not much character development, stuff that came out of the blue, other stuff that was begun and not finished with the odd bit of sex thrown in for \"good\" measure.But, as I said, first novel and it was apparently inspired by the author's real life experiences (she bought the midget house in Sarasota in Indian Beach and supposedly felt the presence of \"something\" there). Given the area the house is in, it's more likely it was vagrants, but, whatever!"}, {"userName": "Kathy", "userReviewDate": "Apr 06, 2013", "userURL": "http://www.goodreads.com/user/show/5694816-kathy", "userReview": "In the past Lucinda was a farm girl who joined the circus as a midget, and fell in love with the circus' owner. They went separate ways and met several years later. He hired her as his nanny to hide the fact that they were lovers, and had a specially built house moved on to his property for her. They both died in a fire at the main house and her ghost haunts the little house that she lived in.In the present the Midget House is inherited by Marisa who always loved the tiny house as a child. Unaware of Lucinda's presence, Marisa moves in and starts repairs. The story alternates between the two women's lives, and between 1920's circuses and freak shows and the real estate and business boom of present-day Florida."}, {"userName": "Laura", "userReviewDate": "Jan 18, 2012", "userURL": "http://www.goodreads.com/user/show/57296-laura", "userReview": "The Midget’s House is a gentle book. While a number of dramatic things happen in this mystery, ghost story and romance, somehow it remains a bit muted. The intrigue, however, keeps the pages turning, and I especially like the main character, Lucinda, a diminutive young woman who finds her happiest moments living among circus “freaks.” I loved all the old circus lore and the details about the Midget’s House, sometimes wishing there were even more, especially about the house. (It was very interesting to find out that is an actual place where the author lives!) I found the ending a little rushed, with a few things happening off-stage, but overall this was a satisfying and different pageturner about an interesting time and place."}, {"userName": "Matt", "userReviewDate": "Jan 12, 2012", "userURL": "http://www.goodreads.com/user/show/2611409-matt", "userReview": "Having seen 'midget house' in real life, it was amazing to see how Ms. Bartholomew made it come to life on paper as the book switches from the house's past and present in her imagination. The parallels between the main characters Lucinda, the circus midget from the past, and Marisa, the present day owner of the house, as they overcome problems made the two characters feel so connected as they both cling to the one constant in their lives; the house. The stories of the two extremely different lives blend together the entire book and eventually come together at an exciting finish. The book is unpredictable and the plot is unlike anything I've read before, I would definitely recommend it to anyone looking for good mystery and something a little different."}, {"userName": "Shelly", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/860709-shelly", "userReview": "This was okay. There is definite writing talent and I'd be curious to see/read something else by Bartholomew. The modern character that I assume was based on herself, was kind of flat for me. Which I can understand, it's hard to write about yourself even though I find the story content compelling since it was based on her own experiences. However, I very much enjoyed the \"ghost\" character, midget Lucinda. She was a witty, vibrant, complex character that came to life for me (no pun intended). For those readers that eschew the Politically Correct in our modern novels I suggest you skip chapter 22, you won't miss anything.All-in-all, a good read and interesting story."}, {"userName": "Jan", "userReviewDate": "Feb 05, 2012", "userURL": "http://www.goodreads.com/user/show/1900784-jan", "userReview": "This was an enchanting story-a young woman inherits a fairy tale house that she recalls from her childhood. The ghost story aspect was pretty predictable but the characters were well written and I could visualize them. I loved the history of the circus, Sarasota Florida and its' connection to the history of the circus. This is a sweet little story that has potential to be a large majestic movie. This was one of my very first novels that I read on the kindle touch. I noticed a couple of typos and have noticed this on some essays; not sure why but it did not detract from the pleasure of reading."}, {"userName": "Kendra", "userReviewDate": "Mar 30, 2012", "userURL": "http://www.goodreads.com/user/show/5983505-kendra", "userReview": "I give this one about 3.5 stars. Its a very simple, easy read and the writing keeps the story intriguing. The first 3/4 of the book is better than the last bit and a lot of it is predictable but overall it kept me wanting more. An added bonus that I didn't know until the very end is that portions of the story are based on real life...there really is a \"midget house\" in Sarasota, FL. This book reminded me a lot of Water for Elephants because a large portion of the story is set in early 1900 circus life. There are a lot of interesting facts, especially about the performers known as \"freaks\". I recommend this one.Kindle edition is lendable."}, {"userName": "Persephone ", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/1986694-persephone", "userReview": "I was captivated by the book's own description and had to read it. I have a kind of fascination with the 1920s anyway, but how in the world could I pass up a book called, The Midget's House with the subtitle (A Circus Story... A Love Story... A Ghost Story)? It's a great story, very well researched, which I much appreciate. My only complaint is that the present-day part of the story seemed a bit rushed... the author could have spent a little more time developing and fleshing out that part, and connecting the stories from the past and the present. Regardless, it was a great read!"}, {"userName": "Rayni", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/458828-rayni", "userReview": "I wavered between giving this 4 or 5 stars. I decided to give it a 4 because of \"bedroom scenes.\" I kept thinking about the book after I finished it. I picked it up again last night, trying to find where I'd left off. I finally found my last note at approximately 60% through the book. I would read along, & think, \"I've already read this.\" It did help to read the last half of the book again. I finally got it sorted out in my mind & haven't had Lucinda & Marisa running around in my mind taking my thoughts off of daily tasks."}], "description": "Librarian's Note: this is an alternate cover edition - ASIN: B005T4GLGOMarisa Delano is thrilled when she unexpectedly inherits the fairy-tale like cottage on the Sarasota, Florida bay front. What she doesn’t know is that another woman, Lucinda Lacey, a sideshow midget who died on the property in 1924, still inhabits it. And Lucinda has no intention of giving up her home to the new owner. Switching between the carnivals, circuses, and freak shows of the early twentieth century, and the boom-and-bust of today's Florida, Lucinda's life story unfolds as Marisa searches for answers about the strange presence in her new home. The diminutive Lucinda might not be as benign as she first seems. Did Lucinda murder her lover on the day she died? And, if so, is Marisa in danger? THE MIDGET’S HOUSE was inspired by the author's own house in Sarasota, Florida, that, if local legend is to be believed, was built for the little people of the Ringling Bros. Circus, and is haunted to this day by at least one of them.", "title": "The Midget's House", "url": "https://www.goodreads.com/book/show/29250602-the-midget-s-house", "average": 3.7, "cover": "https://images.gr-assets.com/books/1456222423l/29250602.jpg", "reviews": 89, "authors": [{"url": "https://www.goodreads.com/author/show/4077278.Anita_Bartholomew", "name": "Anita Bartholomew"}], "type": ["Historical", "Fantasy", "Fiction", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/29250602-the-midget-s-house", "http://www.goodreads.com/book/show/13331841-the-midget-s-house", "http://www.goodreads.com/book/show/13421008-the-midget-s-house", "http://www.goodreads.com/book/show/8429870-something-to-prove"]}