{"ratings": 243, "userreviews": [{"userName": "Chrissie", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "This book was a disappointment to me for primarily three reasons:1. The book describes characters worried about social convention. I wanted to shake them, to tell them to stop worrying about what other people think and to think for themselves. The empty talk of such characters, their gossip and tittle-tattle at parties and social gatherings bored me.2. Couples and mismatched partners fight incessantly, have adulterous relationships or in one way or another behave despicably. The realism, the authenticity of the unrelentingly miserable relationships made the story wearisome and unpleasant to listen to. Listening became a chore.3. The story is too long and too drawn out. The novel flips between disconnected stories about so-called “friends” that meet up off and on. A number of couples’ relationships are to be observed; through them the author delivers a message. The story does not hold together, except as a platform for delivering a message. At the end, I saw what the author intended to say--in this disconnected, long and drawn out fashion. I am going to tell you what I believe Maugham is saying; it is just my opinion, so I do not consider it a spoiler. A person must follow their heart and their own personal convictions. One should NOT do what is correct, what one ought-to-do, what one should do if your head and heart does not wholly support this so-called “proper choice”. What are the consequences of NOT following your heart? What are the consequences when that which one passionately desires is morally wrong? Obviously, the best is if your heart and your convictions motivate you to do that which is morally right. And if motivated in another direction, what then? Most of the characters live their lives with little consideration of such questions. The questions are instead posed by readers as the different relationships are juxtaposed. The whole becomes analytical rather than captivating because one does not adequately empathize with the characters. The story plays out in London at the turn of the 20th century. Life then and there in the big city was viewed as and called the “merry-go-round” life!If I describe this as a typical Edith Wharton story, but set in London, I think you will know what I mean. Such a story might very well fit you better than it fits me.The audiobook is very well narrated by Eva Karpf. Her intonations capture the respective characters’ personalities well. Different accents, for example Cockney and Queen’s English, male and female voices, straight-laced speeches, jocular and drunken dialogs are all well performed.My ratings of Maugham’s books:Then and Now 5 starsMrs Craddock 4 starsCakes and Ale 4 starsThe Painted Veil 4 starsThe Verger 4 starsLiza of Lambeth 3 starsThe Razor's Edge 3 starsThe Magician 3 starsUp at the Villa 3 starsChristmas Holiday 3 starsTheatre 2 starsThe Moon and Sixpence 2 starsOf Human Bondage 2 starsThe Merry-Go-Round 1 star"}, {"userName": "Duane", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "Set in Edwardian England, a small circle of characters who seemingly have nothing better to do than go through life making bad choices, and in typical English fashion, see them through to the bloody end. It appeared to me to be an English version of one of Edith Wharton's New York stories, but not as good."}, {"userName": "Susana", "userReviewDate": "Oct 20, 2008", "userURL": "http://www.goodreads.com/user/show/1205030-susana", "userReview": "(review in English below)Mas que boa decisão esta de reler Somerset Maugham! Escolhi este porque estava mais à mão (a maior parte dos livros que li deste autor são da minha mãe), mas acredito que teria sentido o mesmo se tivesse escolhido qualquer outro.A escrita de Maugham é, ao mesmo tempo, simples e rica, com diálogos brilhantes, cheios de considerações sobre a vida feitas, em geral, com muito humor mas, por vezes, também com alguma carga dramática.A caracterização dos personagens e dos ambientes é feita duma forma precisa e na justa medida, ou seja, Maugham faz-nos sentir que podíamos estar lá e conhecer aquelas pessoas mas não exagera nas descrições, deixando muitas vezes o leitor apreender as sensações dos diferentes ambientes e desvendar a personalidade de cada personagem através da acção e dos diálogos.Gostei que a história tivesse vários focos de interesse, relacionados principalmente com questões do coração, e que têm um ponto central na personagem de Miss Ley - a imagem do carrossel aplica-se perfeitamente a esta estrutura narrativa que, para mim, funcionou muito bem, mantendo sempre o leitor com vontade de querer saber como terminaria cada enredo.Confirmei, portanto, que a minha memória não me enganou e que Somerset Maugham é realmente um autor cuja leitura me dá um grande prazer, pelo que, como já tinha pensado, vou reler todos, ou quase todos, os seus livros, mais tarde ou mais cedo.Para quem nunca leu nada de Maugham, não sabe o que perde!...P.S. Quem tem paciência para ler as minhas reviews já deve estar um pouco farto(a) das constantes queixas sobre as traduções/revisões, mas na verdade não consigo deixar de lamentar a falta de cuidado revelada por estes supostos profissionais, que se torna ainda mais desesperante quando se percebe (mesmo através de frases com defeituosa construção gramatical em português e erros idiotas) a espantosa qualidade da escrita de um determinado autor, como é o caso.Ainda mais me irrita o facto de isto acontecer mesmo em livros editados há mais tempo, antes deste \"boom\" dos últimos anos, em que a quantidade astronómica de livros editados por mês até podia justificar traduções e revisões mais desleixadas...Am I glad I decided to reread Somerset Maugham!I chose this one because it was at hand (most of the books I read by this author belong to my mom), but I believe I would've felt the same had I chosen any other.Maugham's writing is, at once, simple and rich, with brilliant dialogues, full of considerations about life, usually made with lots of humour but, sometimes, also of dramatic nature.Character and ambience characterization is precise and in due measure, I mean, Maugham makes us feel we could've been there and meet those people but he doesn't overwork his descriptions, often leaving it to the reader to get the feeling of the different ambiences and to unveil the personality of each character through action and dialogue.I appreciated that the story had several centres of attention, mainly related to matters of the heart, with a pivot played by Miss Ley - the merry-go-round model perfectly applies to this narration structure which worked beautifully in my opinion, always keeping the reader hooked on how each plot would develop.So, my memory served me well and Somerset Maugham is truly an author from which I get great pleasure. For that reason, and as I'd already thought, I'm going to reread all, or nearly all, of his books, sooner or later.Those of you who never read Maugham, you don't know what you're missing!..."}, {"userName": "Bettie☯", "userReviewDate": "Dec 28, 2014", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Wandaful found the link: http://www.gutenberg.org/ebooks/47229Opening: ALL her life Miss Elizabeth Dwarris had been a sore trial to her relations. A woman of means, she ruled tyrannously over a large number of impecunious cousins, using her bank-balance like the scorpions of Rehoboam to chastise them, and, like many another pious creature, for their soul’s good making all and sundry excessively miserable. Nurtured in the evangelical ways current in her youth, she insisted that her connections should seek salvation according to her own lights; and, with harsh tongue and with bitter gibe, made it her constant business to persuade them of their extreme unworthiness. She arranged lives as she thought fit, and ventured not only to order the costume and habits, but even the inner thought of those about her: the Last Judgment could have no terrors for any that had faced her searching examination. She invited to stay with her in succession various poor ladies who presumed on a distant tie to call her Aunt Eliza, and they accepted her summons, more imperious than a royal command, with gratitude by no means unmixed with fear, bearing the servitude meekly as a cross which in the future would meet due testamentary reward."}, {"userName": "Aaron", "userReviewDate": "May 23, 2011", "userURL": "http://www.goodreads.com/user/show/1210563-aaron", "userReview": "This is lesser Maugham, an early book that reflects his struggles to master his own style and technique, but which is nevertheless engaging and entertaining, and at points deeply moving (if absurdly melodramatic). Maugham himself regarded his approach in this book as affected and \"precious,\" and wrote later that he was afraid to let himself go. It shows. At time it seems that he is channeling Oscar Wilde, a very un-Maugham voice that comes off as overly-stylized. In some respects it reads more like the kind of drawing room plays that Maugham was writing at the time (with huge success), and rather less like the novels he became famous for. And yet I found myself quickly engaged with the three tales that whirl around the central narrator, Miss Ley--a shrewd, witty, cynical but compassionate spinster who connects the otherwise disparate subplots, and keeps you reading. And I loved some of the marginal characters, the snobberies and petty schemes that so blindly occupy them. It's not for Maugham virgins, but fans will find plenty."}, {"userName": "Lubov", "userReviewDate": "Aug 14, 2015", "userURL": "http://www.goodreads.com/user/show/13971932-lubov", "userReview": "I just can`t understand why this book is so underestimated. I`ve finished it for 2 days as I was so engrossed by it that I literally couldn`t put it away. This novel is life itself full of precious experience. Presented as a merry-go round life is a chain of ups and downs, right and bad choices in lifes of different people. A rich woman obsessed by an insolent gigalo. Blinded by love she can`t realize the nature of his character.Young man uncapable to fight the sense of duty. Spinster finding the light in the darkness and losing it too soon . Actually all these people were struggling to achieve happiness. In the centre of this merry-go-round we can see a spectator of all the events -Mrs. Ley -old spinster who is a friend to all main characters.She is trying to guide them and give some advice throughout the novel. While reading not once did I wish I had a friend like her, shrewd and bright , ready to listen and guide when needed.I do believe in the incredible value of the book. After reading it one can make some useful conclusions."}, {"userName": "Tracy Le", "userReviewDate": "Jul 29, 2015", "userURL": "http://www.goodreads.com/user/show/6754376-tracy-le", "userReview": "I describe Maugham's books as \"tragically beautiful\" but enlightening. His writing is beautiful and full of detail and life. I am learning a bunch of vocabulary words! Other than that, The Merry go - round has a bunch of characters where their stories get a bit jumpy but there is definitely development. I was quite surprised with how things turned out with some of them. I was rooting for Miss Ley and Frank in the end but well, can't get what we want...*spinster for lyfe* I guess, haha. Maugham definitely left their story open ended...I especially loved how this book brings up the theme about one's sense of duty. Maugham does bring up a lot of religious contexts and morals. Especially when it comes to adultery, temptations and other sins like gossip, drinking, gambling, etc but Miss Ley, who is known to openly speak her mind oddly balances out everyone's lives and while pointing out their flaws, she's sets them straight. Also, while it is good to be righteous and even though feel it is ones duty to not give into temptation, one shouldn't neglect his or her life from the pleasures of what life is to offer like love, happiness with people, friends or marriage. I also see it in a Christian point of view of how God loves. Although God is our father and he has his laws and rules but he is also a just God and loving God. Yes, he punishes but he does not keep us kept prisoner from things in life that makes us unhappy. We are free. Seeing how these character's have kept others prisoner and entrapped based on their own selfish desires, it makes sense that the characters would rebel and go against their authority. Anyway, I could go on and on. This book has tons of life lessons and advice, haha I took notes and underlined a lot of Maugham's writing!"}, {"userName": "Everett Darling", "userReviewDate": "Oct 16, 2011", "userURL": "http://www.goodreads.com/user/show/771227-everett-darling", "userReview": "As good as anything he had ever written and his most delightfully witty and campy heroine, Miss Ley returns and is at her finest here. Can´t say too many good things about Maugham, who has become by far, my favorite writer."}, {"userName": "Laura", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "Free download available at Project Gutenberg."}, {"userName": "Lee Anne", "userReviewDate": "Jan 23, 2012", "userURL": "http://www.goodreads.com/user/show/966521-lee-anne", "userReview": "As far as \"pretty people with pretty problems\" novels go, this one has something for everyone--a pregnant barmaid; a poor poet dying of consumption; imperious, demanding old women; a regretted affair. It's not to be classed with Maugham's masterpieces, but this early work was still highly satisfactory."}, {"userName": "Brendan Heneghan", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/48412640-brendan-heneghan", "userReview": "I thought this was an interesting story of human character. Maugham constantly depicts the weakness of humans as they strive to reach a sense of happiness, or actually, equilibrium. Most reviews depict this as a melodramatic story of Edwardian England, but in truth it is a universal story of striving and seeking happiness that just happens to be set in Edwardian London. The various characters and stories who are loosely tied together by the dowager Miss Ley could occur in any place from the outback of Australia to the modern English serial East Enders. Of course, the stories are colored by Maugham's own life and some of the struggles encountered, such as a dedication to a gentleman's honor are rarely found outside of that milieu, but are nevertheless struggles that people do encounter and are as valid as any other human struggle. Maugham depicts the society and the period excellently. One feels that one is walking through London in its omnipresent drizzle and unending society parties. One unexplored theme, and beyond this review, is that virtually all of the romances in the book involve younger men with older women, which is quite rare at the time. I thought the denouement was sad as poor Jennie, the working class wife of gentleman Basil takes her life as she is rejected by him. He is depicted as an honorable fool for marrying her, yet he goes on to a life of satisfaction while she is gone. Maugham could have better developed her character and her worldview which would have been more realistic. Rather she was a prop used to question the virtues of honor and to provide character and plot development to Basil Kent."}, {"userName": "Perry Whitford", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/5485442-perry-whitford", "userReview": "A loose circle of Edwardian friends make some bad life choices and learn some hard but valuable lessons, overseen by a sympathetic spinster.Miss Ley conceals her deep concern for her friends behind a frosty exterior and an acid tongue. A keen observer of human nature, in their time of crisis she is always on hand to give the right advice for each individual, regardless of how harsh it at appear.Basil Kent, the son of an adulteress socialite mother, wants to do the right thing by a barmaid he gets pregnant. The wise Miss Ley questions his motives (\"Are you sure you don't admire too much your heroic attitude?\") and provides this counsel, the novel's key message:\"I think you're a fool, but then most people are. They never realise that they only have one life, and mistakes are irreparable. They play with it as though it were a game of chess in which they could try this move and that, and when they get in a muddle, sweep the board clear and begin again.\"Also benefitting from Miss Ley's ministrations are Bella Langton, an old maid who begins an unlikely friendship with a young, sickly would-be poet, Herbert Field; Mrs. Castillyon, an attractive socialite bored with her husband who has an affair with a caddish womaniser named Reggie Bennett, a fling which escalates into a tempestuous relationship of dependency and exploitation; and the friend she is closest to, bachelor Dr Frank Hurrell, a staunch materialist who despises spirituality.For an early novel by Maugham, The Merry-Go-Round surprised me with just how satisfying it was, both intellectually and emotionally. For some reason I expected something stuffier and lacking in heart. I was very pleased to be wrong.The bad choices made were followed through with a fair amount of depth, the plot developments which brought self-awareness to the characters were highly effective, nobody was portrayed as lacking in dimension.Surely an underrated novel."}, {"userName": "Susan", "userReviewDate": "Apr 26, 2013", "userURL": "http://www.goodreads.com/user/show/1304700-susan", "userReview": "Another unexpected find from Hockessin Bookshelf. I always liked Somerset Maugham, particularly Of Human Bondage and the short stories, but had never seen this. Set in London at the turn of the 20th century, the story revolves around Miss Mary Ley, a 'spinster' in her fifties, and several of her friends and family members who have varying success in their love lives. Melodramatic but still moving. I enjoyed it."}, {"userName": "Ffiamma", "userReviewDate": "Sep 18, 2012", "userURL": "http://www.goodreads.com/user/show/4574821-ffiamma", "userReview": "maugham in tono leggermente minore, con la vena sarcastica leggermente annacquata (anche se parte benissimo, in tal senso) e qualche moraleggiamento frusto sparso qui e là. in ogni caso, questa giostra di personaggi, vite, intrecci, gioie e tragedie è garbata, gradevole e con qualche pagina memorabile che fa perdonare l'eccesso di melassa e melodramma. niente di eccezionale, ma a uno dei miei autori del cuore perdono questo e altro."}, {"userName": "Piego di Libri", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/36350036-piego-di-libri", "userReview": "La signorina Ley, deus ex machina della Giostra, è un personaggio estremamente interessante: non si può dire sia la protagonista di questo romanzo, ma in un certo senso lo è, o almeno è il nodo che tiene assieme tutte le vicende narrate, e con esse i suoi protagonisti.http://www.piegodilibri.it/narrativa-..."}, {"userName": "Kirstin", "userReviewDate": "Aug 22, 2013", "userURL": "http://www.goodreads.com/user/show/3143446-kirstin", "userReview": "One of the best novels ever written, and cerainly one of the best female figures ever depicted. Which is interesting, because generally I do not think Maugham has well, lets be polite and say, any affection for women."}, {"userName": "Lynne", "userReviewDate": "Nov 26, 2014", "userURL": "http://www.goodreads.com/user/show/5872661-lynne", "userReview": "Admittedly the version I was reading was a bad transfer to kindle, but even so, there seemed to be a lot of inconsistencies. However, as an early work of his, it does show indications of the sparkling wit of his later works."}, {"userName": "Andie", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/8620899-andie", "userReview": "Probably the most entertaining and moving of Maugham's novels. The characters are so alive and complex, and as usual, the storyline quick-moving and engaging. Maugham's ability to capture being human in all its essence will never cease to astound me."}, {"userName": "Melva", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/7258447-melva", "userReview": "If you want to check out Maugham, start with this one first. Very light and quick to read."}, {"userName": "John", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/1944133-john", "userReview": "Another clever gem by William Somerset Maugham."}, {"userName": "Sarah", "userReviewDate": "Mar 08, 2012", "userURL": "http://www.goodreads.com/user/show/8048168-sarah", "userReview": "Life is indeed a merry go round.Life; Rising,with the wisp of smoke.Falling,with every raindrop"}, {"userName": "elizabeth", "userReviewDate": "Apr 14, 2012", "userURL": "http://www.goodreads.com/user/show/15934786-elizabeth", "userReview": "It's no Liza of Lambeth, at least."}, {"userName": "Douglas", "userReviewDate": "Apr 17, 2008", "userURL": "http://www.goodreads.com/user/show/1010691-douglas", "userReview": "When I read William Somerset Maugham, I am more impressed with character development than plot. This book left me with that same impression."}, {"userName": "Dave", "userReviewDate": "Oct 18, 2011", "userURL": "http://www.goodreads.com/user/show/1354727-dave", "userReview": "Entertaining characters and dialogue. Witty, amusing and fascinating. Sort of a combination of Emma by Jane Austen and anything by Oscar Wilde."}], "description": "Somerset Maugham was one of the world's most prolific and popular authors. He wrote with great facility and at one time had four plays running simultaneously in four different London theaters.He was trained as a doctor, and he must have been good: his observations are truthful and free of sentiment. His books are a tonic.The \"merry-go-round\" was his term for London at the turn of the century. His narrator, Miss Ley, is a shrewd and amusing elderly spinster, something like Maugham in drag. A born commentator, she acts like a Greek chorus. The world may be mad, she seems to say, but it is amusing.", "title": "The Merry-Go-Round", "url": "https://www.goodreads.com/book/show/746964.The_Merry_Go_Round", "average": 3.82, "cover": "https://images.gr-assets.com/books/1177976073l/746964.jpg", "reviews": 25, "authors": [{"url": "https://www.goodreads.com/author/show/4176632.W_Somerset_Maugham", "name": "W. Somerset Maugham"}], "type": ["Classics", "Fiction", "Literature", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/746964.The_Merry_Go_Round", "http://www.goodreads.com/book/show/36105806-the-merry-go-round", "http://www.goodreads.com/book/show/12059863-o-carrocel", "http://www.goodreads.com/book/show/2367762.The_Merry_Go_Round", "http://www.goodreads.com/book/show/15703773-la-giostra", "http://www.goodreads.com/book/show/18908676-merry-go-round", "http://www.goodreads.com/book/show/1165254.The_Merry_go_round", "http://www.goodreads.com/book/show/31548.Of_Human_Bondage", "http://www.goodreads.com/book/show/31196.The_Razor_s_Edge", "http://www.goodreads.com/book/show/99664.The_Painted_Veil", "http://www.goodreads.com/book/show/44796.The_Moon_and_Sixpence", "http://www.goodreads.com/book/show/31326.Theatre"]}