{"ratings": 34, "userreviews": [{"userName": "Damaris Tonner", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/24060388-damaris-tonner", "userReview": "The Quebec Referendum of 1995 happened four years before I was born, and it undoubtedly shifted and altered the Canadian social and political landscape into the nation we live in now. Wright does a fantastic job of laying out the facts, of retaining an objective standpoint and taking us deeper than the surface-level political story any encyclopedia can give you. This is a great read for anyone interested in the fabric of the Referendum, or even anyone wanting a deeper understanding of Quebec-Canadian relations today."}, {"userName": "Jean-François Lisée", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/6200074-jean-fran-ois-lis-e", "userReview": "Il est très rare de trouve un ouvrage écrit au Canada-anglais qui offre une vision équilibrée du débat sur l'indépendance du Québec. Ici, Robert Wright livre une tentative honnête du récit menant au référendum de 1995."}, {"userName": "Sarah Daigen", "userReviewDate": "Sep 07, 2014", "userURL": "http://www.goodreads.com/user/show/19164450-sarah-daigen", "userReview": "In this book, Robert Wright covers a complicated topic with many emotional and tangible moving parts, in an easy-to-read, accessible way. It is incredibly fair and even-handed, and Wright's \"my Canada includes Quebec\" understanding of both sides of the issues shines through. He outlines both the wise moves, and the blunders, on both sides, and gives us an excellent insight into the character of all the main players. He does a pretty good job of digging through the punditry and yammering to the heart of what did and didn't, what could and couldn't have been, and what would and would not have happened that fateful night of Oct. 30 1995 when all of Canada watched Quebec vote on sovereignty. Having read a few reviews of this book, the main complaint I saw that I might echo is that there is little 'new' research or information here. However, that said, taken for what it is, this book synthesizes well a very large chunk of the ink spilled on this topic, and distills it in a readable way, in one place, which anyone with an interest in this topic can digest. As someone for whom this was the first political issue I remember following avidly with any kind of detail or real awareness, this book was a great reminder of what the province of Quebec, and the country of Canada, went through in those difficult months and weeks of the 1995 sovereignty referendum."}, {"userName": "Alan Bowker", "userReviewDate": "Sep 26, 2014", "userURL": "http://www.goodreads.com/user/show/33455954-alan-bowker", "userReview": "This is a comprehensive account of the 1995 Quebec referendum when Canada came within a whisker of breaking up. For those who lived through those harrowing weeks in October and the nail-biting evening when the votes were counted, and witnessed the astonishing self-immolation of Premier Parizeau when he attributed his loss to “money and ethnic votes”, the title of this book is apt. Wright brings those days alive again in polished prose. His book provides a useful companion piece to Chantal Hébert’s The Morning After, which is based on interviews with the main players two decades later. Together, they confirm that what Quebeckers were told could be achieved painlessly would have ended in catastrophe for Quebec and the destruction of what was left of Canada as well. These two books should be compulsory reading wherever countries are facing similar existential choices."}, {"userName": "Michael", "userReviewDate": "Jul 11, 2014", "userURL": "http://www.goodreads.com/user/show/17566573-michael", "userReview": "Lived as an expat in Montreal for four years starting just about six months after the 1995 referendum. Would have loved to have come across such a detailed account of those fateful events while I was there. A very interesting read. It provides extremely useful context to help better understand the politics and passion of that historic moment."}, {"userName": "Raimo Wirkkala", "userReviewDate": "Dec 04, 2014", "userURL": "http://www.goodreads.com/user/show/5561607-raimo-wirkkala", "userReview": "A very straight-forward account of how the 1995 Quebec Referendum unfolded. The author is a history professor and writes like one. This is a good primer on the topic for the uninitiated but there is very little new information for any who followed the events as they unfolded and followed-up by reading the accounts of many of the principal players."}, {"userName": "David", "userReviewDate": "Oct 10, 2014", "userURL": "http://www.goodreads.com/user/show/35720404-david", "userReview": "Know what happened in the 1995 Quebec provincial referendum."}], "description": "How Canada was almost broken apart with one referendumThe Quebec-sovereignist juggernaut began with the creation of the Parti Québécois in 1968 and climaxed in the provincial referendum on sovereignty, held on October 30, 1995. On that extraordinary evening, Canadians from all walks of life, in every region of the country, sat glued to their television screens as polling results trickled in from across Quebec. Unlike the first referendum, in 1980, when the victory of the federalist No vote led by Pierre Trudeau was a foregone conclusion, the race in October 1995 was a dead heat. All evening, the returns pitched and rolled, and anxious Canadians pitched and rolled along with them. In the end, the No vote won by the narrowest of margins, 50.56% to 49.44%. This was no euphoric victory, no easy vindication of Sir John A.'s federalist dream. Never before had the country come face to face with its own imminent extinction.In The Night Canada Stood Still, Robert Wright revisits the drama and intrigue that brought Quebecers and Canadians alike to that fateful watershed event.", "title": "The Night Canada Stood Still", "url": "http://www.goodreads.com/book/show/20726935-the-night-canada-stood-still", "average": 3.94, "cover": "https://images.gr-assets.com/books/1394478499l/20726935.jpg", "reviews": 7, "authors": [{"url": "https://www.goodreads.com/author/show/57798.Robert_Wright", "name": "Robert Wright"}], "type": ["History", "Nonfiction", "Politics"], "outlinks": ["http://www.goodreads.com/book/show/20726935-the-night-canada-stood-still", "http://www.goodreads.com/book/show/18738893-the-night-canada-stood-still", "http://www.goodreads.com/book/show/681941.The_Moral_Animal", "http://www.goodreads.com/book/show/6340873-the-evolution-of-god", "http://www.goodreads.com/book/show/32895535-why-buddhism-is-true", "http://www.goodreads.com/book/show/1124380.Nonzero", "http://www.goodreads.com/book/show/214570.Three_Scientists_and_Their_Gods"]}