{"ratings": 2087, "userreviews": [{"userName": "David", "userReviewDate": "Jan 07, 2009", "userURL": "http://www.goodreads.com/user/show/166376-david", "userReview": "EXECUTIVE SUMMARY: IF YOU LOVED (HATED) \"THE CORRECTIONS\", YOU'LL LOVE (HATE) THIS.OK. Let's get the whole rating thing out of the way right now. Objectively speaking, this is a three-star book. But I enjoyed it very much - and read all 600 pages in about a day and a half. Which I think deserves some acknowledgement. There are many, many books that are far superior to \"The Northern Clemency\", but are way less fun to read. So I'm giving it 4 stars. Here is an example of Philip Hensher in action as a critic. Writing about James Thackara's \"The Book of Kings\" it's terrible. Startlingly badly written, with no apparent understanding of what drives people or how people relate or talk to each other, it is a book of gigantic, hopeless awfulness. You read it to a constant, internal muttering of 'Oh - God - Thackara - please, don't - no - oh, God, just listen to this rubbish'. It's so awful, it's not even funny. There is not one decent sentence in the book, nothing but falsity and a useless sincerity. It may be the very worst novel I have ever read. Which has no bearing at all on my review; I just thought you might enjoy reading it.Aspects of The Northern Clemency that I liked:It's a  sprawling  portrait of two families, spanning the period from 1974 to about 1994. Yes, that's right: the Thatcher years.Hensher is really terrific at capturing the dynamics of relationships within a family. He can be very funny for long stretches.He can also write very movingly about intra-family tensions and loyalties.With one glaring exception, the characters are believable, and he keeps us interested, even though the events of their lives, objectively viewed, are pretty mundane. So if you like a nice, generation-spanning family drama that's a 'good read',  The Northern Clemency  definitely has something to offer. But I'd be doing you a disservice if I didn't warn you that:The book is way too long. At 600 pages, it's a bit of a doorstopper, and it cries out for editing on every page. If one of the characters gets a drink, expect to be told the height, weight, hair color and demeanor of the bartender, as well as what he's wearing. Somewhere around page 500, we spend four pages in the company of a woman called Rosalie, we learn about her relationships with her heroin-addicted son, with the different security guards in the building where she cleans offices at night, with the late-shift supervisor, Brendan, her nosy neighbors etc. Rosalie has grit and is a survivor. But the only function she serves in moving the action along is to pass along something she reads in one of the main character's recycling bins. Which told us nothing we didn't already know anyway. Don't even get Hensher started on anything food-related. The description of a fish pie can run to two pages. Canapes and appetizers receive similar attention, bordering on the fetishistic. Hensher's disdain for the use of easy cultural references, such as pop songs, to evoke a particular point in time is on record. Apparently it doesn't bother him to use vol-au-vents, shag carpeting, and specific TV programs to do the same thing. Although the book is set in Sheffield, against the backdrop of the miners' strike and Thatcher's response, there is no political commentary of any depth. To be fair, Hensher may wish to make the (valid) point that even during periods of (relative) political turmoil, the interest and engagement of the upper middle class was virtually nil. But his development of Tim, the troubled youngest kid in one of the families as a caricature Trotskyite who is laden with every tired cliche in the book is unforgivable. And boring.Baffling title.Occasionally, the plot just meanders into a completely implausible digression. This didn't bother me particularly, as Hensher generally manages to keep things entertaining, and is often very funny. What can I say? I enjoyed  The Northern Clemency  a lot, warts and all."}, {"userName": "Maya Panika", "userReviewDate": "Nov 01, 2008", "userURL": "http://www.goodreads.com/user/show/1411655-maya-panika", "userReview": "THE NORTHERN CLEMENCY by PHILIP HENSHERThis is a most interesting book. A truly epic tale (around 300,000 words) of the everyday that follows the lives of two Sheffield families from the seventies to the mid nineties – and it really is a story of the everyday. Nothing truly momentous happens, even the ‘Big’ events are the Big things that happen to us all; death, sudden life threatening illness, emigration, job change, a court case. Nothing world-shattering happens. There are no startling twists of plot because there’s actually, very little plot – just a vast, spidering tapestry of the normal things of Life .Which is what makes it such an unusual and compelling book. I can’t say I found it hard to put down – I did put it down, frequently (it’s a very big book, my wrists got tired) but I always picked it up again. I wanted to know what was going to happen to these ordinary, fascinating, dreary, hateful, selfish, kind, cruel, indifferent, loving and loveable people.Some I grew to dislike intensely; vain, self-centred Sandra, the oftentimes cruel and selfish Katherine. For all his deceits, I rather liked Nick. I adored poor sweet nerdy, Francis but most of all, my heart went out to Tim. I never really worked out whether the author wanted us to hate him, sometimes it felt like that, but I liked him. Life dealt him a rough hand and he didn’t often deal with it well but from the moment his mother did the cruellest thing imaginable, he consistently broke my heart.I didn't care for the political slant and that coloured my feelings for the book and the characters. The times were dealt with... correctly, probably, bearing in mind the overwhelmingly middle-class-suburban background of the characters. At the height of the Miner's Strike, the only true supporter is the (slightly clichéd) middle-class Marxist.The only representative of the miners themselves is a right-wing would-be-scab-if-he-had-the-nerve. It's not how I remember it - and for that reason, it's the lowest point in the book for me, but there are stronger things here to outweigh the weaker bits.The style is smooth, unremarkable, intense in detail – in an almost Dickensian way at times. It doesn’t get in the way of the characters and their world. It’s a world I know quite well. My family are from that side of Sheffield described so meticulously and the places - Broomhill, Sheffield City Library, the Rivelin Valley, Cole Brothers – so very well drawn this book was special to me in that respect above all others. You don’t have to be from Sheffield to love this book, but it does help. It's a good book (but imo, not half as good as some reviewers are claiming)"}, {"userName": "Michael", "userReviewDate": "Jan 11, 2009", "userURL": "http://www.goodreads.com/user/show/989036-michael", "userReview": "What is it about Brits and novel-writing? Must be something in the water. They are so good at it. Or, rather, they are very good at a particular type of novel (what F.R. Leavis would call \"The Great Tradition\") that I really gravitate toward. The finest American novelists tend toward the mythopoetic (Ellison, Morrison, Cormac McCarthy, Faulkner, Hawthorne, Melville) whereas the best Brits tend toward the secular and social. This is a reduction, but not a gross one, and many implications (and strong opinions) follow from this basic divide (call it the transcendental versus quotidian fight). And various writers would be hard to plot on either side of this divide (David Mitchell and Richard Powers, say, who write \"serious\" novels that blend the mythopoetic with the social novel). At any rate, Hensher's book seems part of a little renaissance of finely tuned, quietly brilliant British novels of manners (whose parents would be, say, Zadie Smith's On Beauty and Alan Hollinghurst's Line of Beauty). This kind of novel isn't absent in the US by any means (and has many gifted practitioners here as well--Francine Prose can do great things with the social novel), but it doesn't seem to get as much play here, or earn as much respect, as it does in the UK. (Hence Franzen's THE CORRECTIONS is the exception that proves the rule to books like Michael Chabon's and David Foster Wallace's). Some would say that Hensher's book is uninteresting because it does nothing \"new\" in the genre (the postmodernist argument). But it's in my view a gripping novel, as funny as Muriel Spark and as serious-minded and spiritually generous as Iris Murdoch at their best. It's also ripping good social history."}, {"userName": "Lisa", "userReviewDate": "Apr 19, 2010", "userURL": "http://www.goodreads.com/user/show/1758411-lisa", "userReview": "I loved this. I don't think it's 'great' literature, but for nearly three weeks as I listened to it en route to work, I found it vastly entertaining - in the way that a well-constructed soap opera is entertaining. Other reviewers haven't been especially kind to it, see http://www.guardian.co.uk/books/2008/... or http://www.guardian.co.uk/books/2008/... and http://www.theage.com.au/news/book-re... Would I have enjoyed it as much without the excellent narration by Carole Boyd? Maybe not. But if you enjoy a panoramic bit of nostalgia from a place you've never been (and are highly unlikely to visit), this will be fun. And it does show the sad truth, that for most people, momentous change is something they barely notice because they're so busy with their own banal lives.Except to them, their lives are not banal at all..."}, {"userName": "Ian Mapp", "userReviewDate": "Apr 06, 2009", "userURL": "http://www.goodreads.com/user/show/1598886-ian-mapp", "userReview": "One word to sum up this behemoth of a book is a chore.It plots the lives from 1970-2000 of two families in sheffield - The glovers and the sellers. They live in the same street, with a house party happening at the time when the sellers move up from London.It uses the standard technique of plotting the family lives against the key political events of the time, mainly the miners strike.So what is wrong with the book. Let me count the ways.At 737 pages it is far too long. Nothing of any real note happens that requires this length. The initial chapter sums this problem up perfectly. Its about 150 pages of attention to detail to tell the story that the glovers matriach has foreclosed a one night stand with her dodgy boss at a flower shop (its a front for drugs money laundering) and she hasnt embarked on a full flung affair. This is summarised by the unlikely event of her stamping to deaths her youngest sons (Tim) pet snake in the street. As clumsy a metaphor as you could ever expect.Next is the characterisation. Its very poor and I struggled keeping up with who was a member of which family, having to write this on note paper in the inner sleeve of the book to remind me. This is a crying shame from the author as over a 12 day read, we should really now and care for the characters. But this doesnt happen. It doesnt help when new characters - such as the boy dying from some disease - are introduced, given a chapter and then disappear from the story. It also doesnt help when Sandra character changes to Alex half way through the book.The politcis are a missed event. The tension of the period never materialises and it seems a missed opportunity to educate, inform or discuss the key events of the time.I really am unsure how this made the prize list. I would give it 2 stars for ambition but this was a real chore to get through and i know (apart from the weight of the book) this will be instantly forgotton in a few weeks.A shame. It was my time of book. Rumours of a hurricane is a similar example of this type of book that does things so much better."}, {"userName": "Alex Csicsek", "userReviewDate": "Jan 16, 2009", "userURL": "http://www.goodreads.com/user/show/1918660-alex-csicsek", "userReview": "This sweeping novel covers decades in the lives of two families in suburban Sheffield in a series of episodes of varying length exploring family life, love and romance, growing up, Thatcher-era politics (particularly the miners' strike), the death of the English cities, and identity in all its shapes and forms. With nine main characters and plenty of peripheral ones, it's not surprising a book of such scope comes to 750 pages, but it is an easy read and can be done quite quickly and enjoyably.Although cluttered initially by a few scene-setting episodes, the most clearly identifiable start is when the Sellers are moving into their new home and greeted by the woman across the street stomping her son's pet snake to death in the front lawn (or garden as the Brits say, but even an Anglophile writing a review of a thoroughly British novel by a writer as self-aware of his Englishness as anyone should stick to his native American language, in my opinion). Hensher is only moderately successful in framing the rest of the novel with this story. His episodic approach doesn't lend itself to a coherent plot and attempts to force cohesion through stories like the snake-stomping is ineffective. That said, real life is often lacking in cohesion, so this aspect is actually a testament to the realism achieved.The characters and the cities where they live are wonderfully drawn. Hensher understands and appreciates his characters and their settings and it shows. The one notable acception is the adult Tim, whose radical politics are caricatured and seem out of place in the nuanced novel in which it exists. The affection developd for the characters more than compensates for lack of plot, and what they reveal about life in post-war suburban England (and, of course, life in general) is rewarding. Recommended."}, {"userName": "Adrian White", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/7766197-adrian-white", "userReview": "Good enough to read over 700 pages but nowhere near as good as I thought it was going to be. An engaging ( and occasionally overwhelming) collection of people like you and me: living mundane lives; fucking each other up and fucking each other over; hearts of gold and hearts so cold. All of human life isn't here in these pages but a fair slice of it is. Just . . . expected more."}, {"userName": "Isabelle", "userReviewDate": "May 22, 2010", "userURL": "http://www.goodreads.com/user/show/231580-isabelle", "userReview": "I should have loved this book; it has everything that makes a novel I cannot put down... loads of character, great settings, multi-generational plot spanning over decades etc...The story takes place in Yorkshire, Sheffield actually and follows the trials and tribulations of two middle-class families living across from each other. In turn and through time, we \"touch base\" with each character: the two couples, together and separately, and the five children whose paths cross every so often. There is a lot of drama, a lot of angst, a lot of pent-up darkness and enough moral flaws to go around. This is obviously a book that was written as an homage to the great British novelists: Dickens first and foremost, George Eliot, Trollope surely.So, I should have loved the novel, and yet I did not... Overall, I was disappointed and struggled through most of the novel. I found the characters a little too formulaic at times, the pace was very uneven, moving briskly in the best Victorian fashion and then coming to a crawl for long introspective passages (possibly in homage to V.Woolf??), and finally I thought that the backdrop of the mining crisis of the Thatcher era was presented like a history lesson much more than a literary setting, not to mention that, due to its incredible dramatic, albeit historical richness, it could have played a greater, more interesting part in the novel.To sum it up, I really thought the novel was too \"studious\"..."}, {"userName": "Jen Padgett Bohle", "userReviewDate": "Feb 23, 2009", "userURL": "http://www.goodreads.com/user/show/421492-jen-padgett-bohle", "userReview": "Take two random families living on the same street and write a novel spanning 20 years that chronicles their lives and fortunes and you have Philip Hensher’s The Northern Clemency. In this case, the novel centers around two British suburban families --- Malcolm and Katharine Glover, their children Daniel, Jane, and Tim and the Sellers family across the street, consisting of Bernie, Alice, Sandra, and Francis. I’ve seen reviewers describe these as “dysfunctional” families, but one of the points of this work is presumably to illustrate that every family defies any norm or prescribed standard. Indeed, the individual quirks of the characters, when magnified by Henshaw’s writing, serve this same normalizing function. We’re all weird.The work is, paradoxically, about everything and nothing. I was attempting to explain to a friend of mine what this novel is about (his wife writes mystery and suspense novels) and when I was finished all he said was, “so basically nothing happens?” Well, erm, yes, nothing much, really. We’ve got a Jonathan Franzen/ Virginia Woolf combo writing the sublime of the everyday and the tragedy of the everyday. And unless you’re a wealthy jetsetter or adventurer, it is the banal everyday where most everything happens --- dinner parties, illness, quiet mistakes, marital complacency, child rearing -- this novel encompasses the realm of domesticity beautifully (and perhaps better than even Franzen’s zeitgeisty novels). This is a thoroughly British novel, and one that will likely resonate more with British readers as locales and shops and Thatcher era politics are evoked. Northern Clemency is the literary equivalent of a still life painting; I can now fully detail middle class dinner menus from the 70s and 80s (coronation chicken or vol au vents, anyone?), fashion (polyester neck tie blouses) and home interiors. National and world politics is, appropriately for this work, not often mentioned except for Tim Glover's forays into socialism and the 1984 Miner’s strike. Ok, so admittedly, I set this novel aside twice, determined that I would begin something else. And then I couldn’t stop thinking what the characters might be doing and about how odd the children are and what would become of them. It helps that the sentences are beautiful, full of unusual imagery and thoughtful metaphors. I imagine Hensher laboring for hours over various dazzling descriptions. Part of the problem with this novel’s likeability is that there’s no character with whom we can really sympathize. They’re all either a bit pathetic or somehow insufferable. I suspect, though, that this is because Hensher lets us know them intimately over a long stretch, and few of us would look particularly pleasant under an author’s dissecting gaze. There’s also an undercurrent of bleakness coupled with an expectation that something unspeakably horrific is going to occur, and I‘m not sure if that was just me or if this was intentional and others have noticed it as well. I kept waiting for something apocalyptic to happen, especially with regard to inflexible and obdurate Tim, the youngest son of Katherine and Malcolm Glover. The Northern Clemency, though occasionally humdrum and plodding, will become a classic of late 20th century British life. Hensher’s consistently measured and poetic prose and his ability to illuminate the everyday compromises and small acts of forgiveness that make ordinary peoples’ lives livable ensure his place in the modern canon, or at the very least in the pages of the New York Times book review."}, {"userName": "Clif Hostetler", "userReviewDate": "Nov 20, 2009", "userURL": "http://www.goodreads.com/user/show/793473-clif-hostetler", "userReview": "Reading this book gave rise to mixed feelings of fascination and wearisomeness. The Northern Clemency is part history, part sociology and totally compelling—but too long--read. The story is sprawling, detailed and ambitious in scope and design. Hensher’s superbly nuanced and detailed writing makes the relative mundanity of these family’s lives almost compulsively readable. The book was so compelling that it kept me listening* even though I kept thinking to myself, “Gaaawd, I can’t stand all this excruciating detail!” It’s just too long and has more extraneous detail than I wanted to know. (*I listened to the audio format of the book) This book is much the same as life for most of us, ordinary and boring. That doesn't mean life isn't worth living. And it also doesn't mean that this book isn't worth reading. If you like sprawling literary evocations of familial drama, then this book is for you. After getting half way through the book I began to care a bit about the characters and wanted to know where life took them. I kept thinking, surely a book this long must have something worthwhile in the plot somewhere. In the end the story was pretty much like real life--some things are resolved, some are not; some things are better, some are not; there is a death, but life goes on for others. This book comes about as close as possible to providing the experience of living 20 years without actually using up 20 years of time to do so. I guess a another way of saying this is, reading this book seems like it takes 20 years, but actually it only takes 20 hours to read. Defenders of the book have suggested that it was inspired by “the great nineteenth-century Russian novels.” On the other hand, critics say they see more influence from Desperate Housewives than from Tolstoy. I think they're both right. Hensher has given us a 21st Century update to the great 19th Century novels. If we don't like it, it may be an indication of how we feel about 21st Century literary styles. Frankly, I am intrigued with the comparison of this book with War and Peace. Just as War and Peace follows life on two different Russian estates within the context of the Napoleonic war, The Northern Clemency follows the members of two neighboring families during the anti-union and pro-privatization economic policies of the Thatcher government. And of course, they are both very long stories filled with much detail. However, I suspect that War and Peace will still be a classic one hundred years from now, and The Northern Clemency will be forgotten. This book can be classed as a historical novel because it deals with the economic and political changes in the 70’s and 80’s in northern England. The second half of the book in particular addresses politics and policies of Prime Minister Margaret Thatcher (i.e. privatization of public services and coal miners' strike). But in the end the surrounding politics is a pale backdrop for the lives of the fictional characters. Besides, the 70’s and 80’s aren’t so far in the past to be called historical. So I’ve classed the book as being just a novel."}, {"userName": "Felice", "userReviewDate": "Dec 10, 2010", "userURL": "http://www.goodreads.com/user/show/2507841-felice", "userReview": "I have to warn you I'm going to need some extra adjectives here. I might be saying brilliant, wonderful, impressive and glorious so often that I have to resort to using multi-layered as well. Let me apologize in advance for that. I've read The Northern Clemency (picked up solely because it is so very extra chubby) by Philip Hensher and it is fantastic. You can stop reading my puny writing now and go get a copy of it if you want. I won't be insulted.Clemency starts out in 1970's Sheffield and follows two families:the Glovers and the Sellers. Malcolm and Katherine Glover have three children and have been Sheffield staples forever. Bernie and Alice Sellers, parents of two, are recent arrivals having moved to Sheffield from London for Bernie's new job. The day the Sellers move in Malcolm accuses his wife of having an affair and disappears. The next twenty years bring other catastrophes and passing cruelties both personal and nation wide that have lasting effects on both families.This a War and Peace type of novel only without all the war part. Clemency is not only concerned with the events of its characters lives but it also details the physical, social, economic and political world they inhabit. Nothing happens in a vacuum in The Northern Clemency. It's a big novel that charts the internal and external world of two generations in one community. A cross section. This is the book for someone who wants to be entertained and at the same time come away with a complete portrait of the times. Hensher has a firm grip on this tremendous slice of life novel and yet he makes it all feel very organic and realistic. It's as if the neighborhood gossip were giving you the straight skinny over a drink while you perused the March 1973 edition of Ladies Home Journal (Speaking of which a little Can This Marriage Be Saved would not have gone amiss here.) rather than an extremely talented writing is behind it all plotting away, pulling strings and researching every visual element of 70's and 80's decor and food. Nothing occurs in The Northern Clemency that doesn't have repercussions. From the minutiae of day to day domestic life to the events of the time that were felt across the country everything is put into his microscope, inspected and then brought to our attention with magnificent writing. I was totally impressed and after one quick phone call my local independent bookstore has ordered me an earlier novel written by Philip Hensher, The Mulberry Empire. Yippee!"}, {"userName": "Julie", "userReviewDate": "Jan 08, 2009", "userURL": "http://www.goodreads.com/user/show/589617-julie", "userReview": "I went into this book thinking that I might find it fabulous, given some of the reviews and the subject matter. That attitude usually seems to put a book——or a movie, or a person——at a disadvantage because so much is expected. Well, this is a long, winding narrative filled with characters who, at best, are mostly only semi-likeable. The writing is generally very good, although this was one of those books in which I not infrequently stopped and reread sentences, wondering exactly what the author was trying to say. It was overdone at times; I thought I could feel the author getting too self-consciously caught up in the way he wanted to depict or describe something. I was disappointed in the degree to which time and place were actually conveyed. Still, I liked the book very much; go figure. It held my interest throughout; I was never bored. It wouldn't be for everyone. It's too long by about 10%, as are so many current novels. I wavered between 3 and 4 stars but think this deserves the higher rating."}, {"userName": "Mark Landmann", "userReviewDate": "Dec 28, 2012", "userURL": "http://www.goodreads.com/user/show/15844895-mark-landmann", "userReview": "I kept on moving this book down on my queue just because of its length, but in the end I zipped through it. Despite its length there were hardly any sections where my mind drifted and I didn't ever want to miss a single word. I can really see why reviewers here are comparing the book to Franzen... I almost wish I hadn't read that before because I found myself comparing as I went through the book, and usually finding this book not quite measuring up, though I don't really feel like that anymore now that I'm finished. I think what they have in common is a number of central characters in one or (in this case) two families, and a story that is told from different characters' points of view. And the authors have the most amazing ability to write good dialogue... I think that was my favourite part of The Northern Clemency - I loved the entirely credible but multi-layered and conflicted (and sometimes playful) conversations between the characters, like between Daniel and Helen. I think one difference was the time span of this book - because the book spans many years I sometimes felt like the story had to be told as a series of vignettes. And at first I thought that would bother me. But they're pieced together so smoothly that it doesn't feel choppy at all, even though I think certain storylines have to be picked up and dropped in order to make it work. But now that I'm finished I'm feeling the loss of these people (characters) that I spent the last days with and I'm sorry my time with them is over."}, {"userName": "Larry H", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "When I saw that Amazon had named this their best book of 2008, I absolutely had to read it. And I'm so glad I did. This is a BIG book--600 pages long--and it's a sweeping story that primarily centers around two generations of two families. But don't let that slight description steer you away from reading the book. This story is fascinating, compelling, funny, frustrating, a bit heartbreaking and life-affirming, all in one package. True, there is a lot to wade through. But it's well worth it."}, {"userName": "Veronica", "userReviewDate": "Mar 25, 2009", "userURL": "http://www.goodreads.com/user/show/2153853-veronica", "userReview": "Somehow Philip Hensher has managed to pass me by up to now, but when I read a review of this novel and discovered it's set in Sheffield during the 1970s, I couldn't resist. It's billed as a state-of-the-nation saga on a Tolstoyan scale, following the fate of two families, the Sellers and the Glovers, from 1974 to 1994. It's certainly Tolstoyan in size, weighing in at a hefty 736 pages, but it lacked the historical sweep of Tolstoy. Tolstoy sets the minutiae of his characters' lives in the wider historical context with lots of references to major current events, and, in War and Peace, intersperses the action with long philosophical disquisitions. Hensher doesn't do any of that -- he focuses (very well) on the characters' daily lives, and the way they grow and change while remaining recognisably the same people.All the same, I found it a bit baffling that they barely seem to notice the Falklands war, and apart from one character, a student radical, the miners' strike and collapse of Sheffield's industry brushes lightly by them. But at least Hensher manages to convey the atmosphere of an era without stuffing his narrative with brand names, the way David Mitchell did in Black Swan Green. He also very noticeably shuns the popular device of using music to situate the characters. In a rather supercilious and self-serving essay about state-of-the-nation novels published in Prospect, he says snottily: \"I was a teenager when the Clash are reported by Coe as playing in Fulham. I wouldn't have cared. At the time, my records were mostly of Mahler, Schoenberg and Boulez.\" I'm rather glad I read this after I'd finished the novel, so I wasn't put off by his condescending tone when writing about authors like Jonathan Coe and Sebastian Faulks.But he writes well, and he can convey emotion and character wonderfully; two scenes that stood out for me were the one where Katherine Glover returns home after being arrested by the police in connection with fraud by the owner of the Broomhill florist shop she works in, and a compellingly creepy scene where Sandra Sellers meets her secret admirer Tim Glover twenty years later. So I did enjoy it, and it's worth reading -- he just does himself a disservice by comparing his work to Tolstoy, because his strength is precisely in the mundane details of ordinary lives. Looking at his backlist, he appears to be startlingly versatile.But the defining state-of-the-nation novel for me is still Jonathan Coe's What a Carve-Up And I even thought Tim Lott's Rumours of a Hurricane did a better job of summing up the change of mentalities during the 80s. Read this for the characters rather than the period atmosphere. And take his views of Jonathan Coe with a pinch of salt."}, {"userName": "Lobstergirl", "userReviewDate": "Jan 24, 2014", "userURL": "http://www.goodreads.com/user/show/1910836-lobstergirl", "userReview": "On page 391 of this 597 page novel, a main character has \"been reading The Far Pavilions for four weeks now, persevering with it; handling seemed to have increased its bulk by half as much again.\" I knew how she felt: The Northern Clemency also seemed to expand as I turned its pages, its plotlines and characters multiplying, new tendrils shooting off in two dozen directions, old stems thickening. Was Hensher mocking his own novel here? The book does end with a metafictional twist, as another character picks up a new novel and reads the first few words, which are also the first words of The Northern Clemency.I spent the first 95% of the novel wondering where it was headed, if anywhere. I wondered if a novel needs a trajectory. Essentially we follow a rather large cast of characters - two families, nine family members total, plus all their neighbors, friends, associates, lovers, employers, roommates - from 1974 to 1994, covering the prime ministerships of Harold Wilson to John Major. (The novel is set in Sheffield, England, and briefly London and Australia.) There are no deep or hideous mysteries to be solved. Each character has ups and downs, some more severe than others. No one turns out to be a serial killer. The most dramatic plot twist is perhaps a brain hemorrhage late in the book, then there's some unpleasantness in Australia (which was a bit too much of a sour note, I thought). This is the second of Hensher's novels I've read, and based on it, I think it's fair to call him the British Jonathan Franzen. There are also similarities to Alan Hollinghurst's last two novels, The Line of Beauty and The Stranger's Child. The length of this book is borderline inexcusable, but it's redeemed by having most of its characters turn out to be engaging and humane (the reader has doubts initially), people who end up doing the right thing.Still, some moments might push you over the edge, like when Hensher introduces five new characters on page 459 (that's about 75% into the book) - characters who are office cleaners, a security guard, and a cleaning supervisor - and then drop them four pages later once the office has been cleaned, never to be heard from again. Does everything in a novel need to serve a purpose? There are other subplots that feel unsatisfyingly truncated and unexplored - a major character named Nick feels a burst of once-in-a-lifetime love for a minor character named Sonia, and that's the last we hear of it. Maybe the point is to capture the truth of real life, where everything is messy, people drop in and drop out with no warning."}, {"userName": "jillian", "userReviewDate": "Jun 18, 2009", "userURL": "http://www.goodreads.com/user/show/81376-jillian", "userReview": "This was a brilliant book. It's one of those wonderfully crafted books that goes so far into human nature, into the pieces of atypical, illogical behavior that, despite their strangeness, are still universally sympathetic. Set over two decades in Sheffield, UK, it follows two families through the events and non-events of their lives. It also gives a true insight into the lives of the coal miners and the social conditions that surrounded the decline of the mines, and the onset of the Thatcher era. I found this book to be beautifully crafted, yet emotionally raw in places - especially in the themes related to sex, or to the petty cruelties children impose on each other. It is more character driven than plot driven, although as the plots do pick up, it does move faster and faster from the 1970s to the 1990s.This is a universal book about the minute, everyday lives of people in northern England in the latter half of the 20th century, in a rapidly homogeonizing country, and a changing, globalizing world (which is contrasted, in places, against the unchanging nature of the moors). I also realized, after I finished it, that the characters of the older generation that are in their mid to late 30s at the book's opening would have been of the same generation as my father. And I thought, so that's what would have happened to Dad if he hadn't emigrated. He might have ended up living an everyday life in a suburb of Carlisle, much like the neighborhoods of Sheffield, where he would have been challenged to hang on to his livelihood as the region's industries were privatized and shut down. Also, his children wouldn't have had the opportunities and the drive that my sister and I, growing up on American capitalism, had. And maybe that's what I found slightly depressing about the book - the lack of vision in all the characters. What, after all, is there to be visionary about in the suburbs of Northern England in the Thatcher era? Hensher turns those visions inward, and focuses them on the everyday movements, and that's what made this book so fascinating."}, {"userName": "Stephanie", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/49305671-stephanie", "userReview": "2.5 stars. Disappointing."}, {"userName": "Susan", "userReviewDate": "Feb 27, 2011", "userURL": "http://www.goodreads.com/user/show/3727579-susan", "userReview": "If you had asked me a week ago if I liked this book, I would have groaned and rolled my eyes. I completely stalled about 35% of the way into the book. I stalled there for about a month by reading other books and entire issues of the LA Times, unable to commit to finishing the Northern Clemency. Then with a quiet weekend of time, I picked it up again and within an hour or so, I was hooked into the rhythm of Hensher's story - a rhythm that totally eluded me earlier.The story mainly follows the lives of two suburban, middle-class British families. The life stories of the neighborhood are told from the perspectives of the parents, children and neighbors. A perverse sense of dread lay over the childrens' school years (the reason I didn't dive into this book, undoubtedly). Things - some significant, some insignificant - happen to parents and children that mark their later lives. What hooked me was the realization that Hencher was going to try and trace those marks on their lives. I was intrigued to discover whether he'd issue comeuppances, karma, redemption or judgments. Not to spoil the reading for others - let's just say that he didn't share the contempt for his characters that Jonathan Franzen demonstrated in Freedom (reviewed here earlier). The author showed heart - so much so that when I came to the end I was a bit saddened to leave Sheffield at last."}, {"userName": "Glorialaihuang", "userReviewDate": "Jan 20, 2011", "userURL": "http://www.goodreads.com/user/show/4147367-glorialaihuang", "userReview": "Dear Lord, this book felt long. It also seems to progress in fits and starts - I found myself becoming engrossed in some parts, only to suddenly find myself sloshing through a randomly-placed description of the English moors. The story is nearly epic in scale - it follows the lives of several townspeople who live in an industrial village in Northern England during the 70s and the 80s. I will concede that the author effectively paints the Thatcherite/miner strike mood of the time. But I couldn't get away from the irritating feeling that the sentence construction was a lot more convoluted than it needed to be - I found myself re-reading certain sentences several times, just to understand what they were trying to say. Several of the characters are also deeply unlikable, but to be honest, they were sometimes the ones that moved the story along. It's a detailed portrait of Northern English life a few decades ago and a fairly interesting read once you get through it, but I'm not gonna lie, it'll take some effort (unless you are naturally fascinated by long-winded descriptions of English flora)."}, {"userName": "Alice", "userReviewDate": "Jun 10, 2010", "userURL": "http://www.goodreads.com/user/show/1529137-alice", "userReview": "One of my favorites of 2010 so far. I asked the clerk at my favorite bookstore if she could recommend something, and she walked out with The Little Stranger (read and loved), Let The Great World Spin (which I was reading, at least until my Kindle got stolen), and this book. I have to go back and thank her. Hensher has written a big, sprawling multi-family saga of 1970's middle-class England, accurate down to the smallest detail, and full of hilarious moments. I think one of the reasons I liked this so much, though, is because I grew up in England until 1985, so many of the references are familiar to me. I liked a lot of the characters and enjoyed seeing how their lives changed over 20 years and where they ended up. I'm sending this to my mother, but I'm not sure that it's everyone's taste; I really think my cultural background played a huge influence in how much I enjoyed it."}, {"userName": "Amy", "userReviewDate": "Apr 03, 2009", "userURL": "http://www.goodreads.com/user/show/1093212-amy", "userReview": "Didn't like this book as much as I thought I would. I initially picked it up because it was shortlisted for the Booker Prize and got some good critical reviews. It's a long novel about two neighboring families in suburban Sheffield, England and their interwining lives over several decades (1970's & 1980's mostly).In some ways it drew me in (somewhat slowly) to the lives of the many different characters. The author is great at describing the everyday details of life in a family, whether boring or interesting. But after awhile as I kept reading, I just started not caring as much. By the end, I finished the 600 pages feeling dissatisfied. He seems like a great writer in terms of the way he describes characters, places, marriages, sibling relationships, life in the suburbs--all of that. And certain sections were really captivating. But still I finished thinking, \"What was the point?\""}, {"userName": "Jennifer ", "userReviewDate": "Feb 06, 2009", "userURL": "http://www.goodreads.com/user/show/1198520-jennifer", "userReview": "The Northern Clemency tells the 25-year story of two families living in suburban Sheffield, England, from the day in 1974 when the Sellers move from London to the house across the street from the Glovers, who just happen to be in the middle of a domestic crisis. This book seems like an answer to those times when you're looking out the train window heading north from London and, by the time the post-war housing is passing by, you're wondering what their inhabitants' lives are like. (I still don't hesitate to ponder how people who leave their curtains open decorate their living rooms when I walk the dog by night, or obsess about the furniture in movies, so there you are.) My only quarrel is a cultural one--sometimes the humor in this book, which has many wry moments--teeters on the edge of that British cruelty that, to my mind, really isn't funny any more."}, {"userName": "Kathleen", "userReviewDate": "Jun 21, 2009", "userURL": "http://www.goodreads.com/user/show/1058004-kathleen", "userReview": "Orginally set in the 1970's in Sheffield, England, this book chronicles the Sellers family and the Glovers as neighbors raising their children in changing economic times into the 1990's. Well-written with intricate details about every day life, my only criticism is that the book could have been a hundred pages shorter. Many intricate short stories are wrapped around the family members, and at times it was difficult to keep it all straight. I liked all the \"Briticisms\". Parts of it felt like peering through the window-- into a marriage, sibling relationships, friendships, people feeling bored and not knowing why they do what they do. Compelling"}, {"userName": "Amy Chang", "userReviewDate": "Sep 21, 2009", "userURL": "http://www.goodreads.com/user/show/2544175-amy-chang", "userReview": "Lee Child picks The Northern Clemency by Philip HensherI'm going to read The Northern Clemency, a good old-fashioned 600-page novel about two families, set in England over a 20-year period spanning the 1970s to the '90s ... fun for me because it takes place during times — and upheavals — that I remember very well, in the city where I went to college. I'm told it's funny, moving, full of drama and detail and humanity, and I'm hoping it'll prove once again that to really understand recent history, you need to approach it through fiction, not nonfiction.Child is the author, most recently, of the No. 1 New York Times best seller Gone Tomorrow"}, {"userName": "Dianne", "userReviewDate": "Aug 19, 2012", "userURL": "http://www.goodreads.com/user/show/9750774-dianne", "userReview": "A beautifully written book about several families whose lives intersect, between London and Sheffield, an industrial (coal) city. We move through early childhood to mature adulthood of several of the characters, and although it's a little tough sometimes to keep the names straight, it is possible with a little bit of extra attention. The writing is fantastic and sometimes so elegant you just want to read a sentence again because it is so well said. Lots of irony and sarcasm, my favorite kind of humor, so it has humor but is not at all flippant."}, {"userName": "Merilee", "userReviewDate": "Aug 11, 2010", "userURL": "http://www.goodreads.com/user/show/1652517-merilee", "userReview": "Hensher's a really good writer and I'm looking forward to his Mulberry Empire and his book about Berg's opera, Lulu. This book is a big, rambling story of two families in 1970s and 80s Sheffield. That sounds deadly boring, but it's a far cry from that."}, {"userName": "Hywel", "userReviewDate": "May 28, 2009", "userURL": "http://www.goodreads.com/user/show/1882977-hywel", "userReview": "'...small nursery-tale animals appeared in the grounds, shooting rat-like up trees with their furry little tails behind them.'Does he mean squirrels? Why doesn't he say squirrels?"}, {"userName": "Ron Charles", "userReviewDate": "Nov 28, 2013", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "Philip Hensher missed winning Britain's Booker Prize last month by a hair, but now comes a surprising consolation prize from the United States: Amazon has named The Northern Clemency the best book of 2008. I like this enormous novel very much, but I'm surprised that the savvy booksellers at Amazon would make such a daring choice in a recession-bound holiday season. After all, last year they picked Khaled Hosseini's bestselling A Thousand Splendid Suns. Given the army of book clubs already primed by The Kite Runner, that was about as risky as choosing Santa as favorite Christmas celebrity. Amazon may disappoint some customers with a novel as demanding as The Northern Clemency, but it's encouraging to see that the ascendancy of online booksellers needn't mean the end of high culture.Though still relatively unknown in the United States, Hensher is a respected writer and critic in London. In 2002 he published The Mulberry Empire, an alarmingly relevant novel about England's efforts to overthrow the government of Afghanistan during the early 19th century. And in 2003, Granta magazine included him on their sometimes prescient list of \"Best Young British Novelists\" along with the now famous Monica Ali and Zadie Smith.The Northern Clemency thoroughly justifies Hensher's place in that Olympian group. It presents a continuously evolving panorama of two middle-class families in Sheffield, where the author grew up, about 150 miles from London. In 1974, when the city \"was entering on the last phase of its industrial greatness,\" this was, Hensher writes, a place that \"made its money from steel; it was driven by its waters; it was built on coal.\" But those elemental foundations are about to shift dramatically, and over the next 20 years, the gossipy citizens who live on an ordinary Sheffield street will endure upheaval they could not have imagined.The Glovers have three children and maintain a dull, passionless marriage that Hensher examines with comic but never demeaning concentration. Malcolm Glover works in property management and enjoys battle reenactments in his spare time. His frustrated wife, Katherine, has upset the family routine by taking a job at a florist's to give herself something to do besides the children's laundry. Their new neighbors, the Sellerses, have come from London so that Bernie Sellers can become deputy manager of the electric company. On the day they move in, they watch Katherine run out of her house with a snake and stomp on its head while little Tim Glover trails after her shrieking in horror. Thus begins a complicated friendship between these two families.The story moves along from one engaging episode to another as the Glovers and the Sellerses grow older, drift apart and reconnect in surprising ways over the next two decades. A number of things happen in the five sections of this long novel, but it's impossible to speak of The Northern Clemency as having a plot in the conventional sense. In fact, it's easy to imagine some readers waiting impatiently -- and futilely -- for the story to begin. But Hensher's intricately crafted sentences flash with wit, his dexterity with telling detail is captivating, and his dialogue delivers the guilty pleasure of eavesdropping. If you give yourself over to this novel's organic movement, you'll fall in love with its startlingly perceptive depiction of these people. And eventually, you'll enjoy the satisfaction of seeing how these disparate scenes lock into each other in the most poignant ways.The first two sections show the Glover and Sellers households when their children are still living at home. Suburban repression is the rule, \"reserve and restraint, the usual conditions of an English life.\" Acts of rebellion and cruelty are politely ignored with \"a party-like smile as if at a personal comment in bad taste from the friend of a guest, brought and welcomed under sufferance.\" Hensher writes that \"no one seemed able to talk to each other. . . . They all had their reasons for concealing matters from or snubbing each other.\" Katherine's husband blurts out the whole culture's philosophy in a rare moment of agitated candor: \"If you don't say anything it can't become important, but if you say it everyone's ever after got to walk round it like a pile of rocks in the living room.\" And so they walk around every disappointment and burden, even though Katherine's entire body is \"written over with the fact of her obligations.\" Her husband notes the lack of intimacy between them but can't imagine living any other way. \"For most of their lives together,\" Hensher writes, \"it had seemed to him that he was admitted only to the public downstairs rooms of Katherine's mind. The more intimate spaces and speculations, the whole upstairs and attics of her thinking were kept from him.\"There are spot-on scenes of the children at school, particularly Sandra and Francis Sellers, who never escape accusations of being London snobs; their cringe-inducing experiences in PE are classic. In later sections of the novel, we follow them and the Glover children, now adults, to London where they struggle to find jobs and affection in a country transformed by economic and social change. Loneliness haunts them all, especially poor Francis, who \"was tall and drawn-out in shape as someone else's shadow.\" In one painfully naked confession, he cries: \"I was wrong, deciding not to be shy. . . . Because if you're not shy you go out into the world, but if you are shy then you stay at home, and it's really better to stay at home. You're going to be happy if you stay at home.\" Sandra Glover, meanwhile, can't wait to get away and cut herself \"off from the guilt and burden of family. . . . She could feel herself shedding her ties like a dog shaking itself after a bath.\"The later sections grow more explicitly interested in class, sometimes in ways that emphasize differences between America and England. (Even the chapter titles -- \"Mardy,\" \"Nesh,\" \"Gi'o'er\" -- will send you scurrying to a dictionary of Briticisms.) We see the disastrous coal miners' strike of 1984 from several competing points of view. Tim Glover, whose sad plight dominates the end of the novel, becomes a comically self-righteous Marxist, but his radical cant hides a dangerous sexual fury. Meanwhile, his slick brother, Danny, responds to the fluctuating economy with just the sort of entrepreneurial spirit that Margaret Thatcher celebrated.This absorbing portrait of a large group of people invites comparison to Jonathan Franzen's The Corrections or Claire Messud's The Emperor's Children, but Hensher is a gentler satirist and treats his characters more tenderly. Indeed, he writes with such illuminating attention to the flutterings of everyday hope and despair that you come away from these pages feeling like a more insightful person. That's all we ask from the best books of the year. http://articles.washingtonpost.com/20..."}, {"userName": "Ellen", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/1420168-ellen", "userReview": "Reading this reminded me of the time in high school when the English teacher assigned \"Main Street\" by Sinclair Lewis. Most of the class hated it and didn't make it very far, while I lapped up every mundane detail. This is an in-depth look into a specific place and time. There's not a lot of plot, but there is a lot of exploration of how the place and time affect the relationships and personalities of the characters. If that's up your alley, you'll like this a lot. If you get weary of extended description after, say, 400 pages, you should probably give this one a pass."}], "description": "Beginning in 1974 and ending with the fading of Thatcher's government in 1996, 'The Northern Clemency' is Philip Hensher's epic portrait of an entire era, a novel concerned with the lives of ordinary people and history on the move.", "title": "The Northern Clemency", "url": "https://www.goodreads.com/book/show/2927460-the-northern-clemency", "average": 3.45, "cover": "https://images.gr-assets.com/books/1328158427l/2927460.jpg", "reviews": 349, "authors": [{"url": "https://www.goodreads.com/author/show/306578.Philip_Hensher", "name": "Philip Hensher"}], "type": ["Fiction", "European Literature", "Family", "Contemporary", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/2927460-the-northern-clemency", "http://www.goodreads.com/book/show/3976230-the-northern-clemency", "http://www.goodreads.com/book/show/6328950-the-northern-clemency", "http://www.goodreads.com/book/show/8776642-the-northern-clemency", "http://www.goodreads.com/book/show/9818525-king-of-the-badgers", "http://www.goodreads.com/book/show/13539083-the-missing-ink", "http://www.goodreads.com/book/show/20428638-the-emperor-waltz", "http://www.goodreads.com/book/show/715237.The_Mulberry_Empire", "http://www.goodreads.com/book/show/13447923-scenes-from-early-life", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}