{"ratings": 2145, "userreviews": [{"userName": "~☆~Autumn♥♥", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/36269827-autumn", "userReview": "I just finished this book and its very interesting and informative overall but it was only going to get 4 stars until almost the last page when she finally mentions asthma and says that some should not go out in the tree pollen! (finally she thinks of that)  Children with attention deficit disorder should be taught outside as \"they can't bounce off the walls there\". The difference for small boys is amazing. I have always thought it was torture to be cooped but in a hot reeking classroom and not allowed to go outside. Its like torture for small children and very bad for them. She really discusses this at length. In Germany they have \"forest classes\" outside. Also, classrooms are toxic with magic marker odors and other toxins which can cause brain damage. There is usually no fresh air as teachers won't open the window or there are NO windows to be opened. For a time I had to sit too near the chalkboard and I am allergic to chalk and it gave me asthma. It was impossible for me to say anything about this and I just had to endure it. I hope people will read this book and wake up about these problems.  I was surprised to learn that being out in nature also makes a big difference for those with PTSD. People need to be around trees and water. These things are far more important than we realized."}, {"userName": "KC", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/7582369-kc", "userReview": "This is a must read for anyone who is in a rut, unhappy, or even for those who already embrace and benefit from the great outdoors. Thorough and thought provoking text. Nature really can be a wonderful pill for all that ails you."}, {"userName": "Laura Leaney", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/3633494-laura-leaney", "userReview": "I already spend as much time as I can outside, so reading Florence Williams's book was a great affirmation of my devotion to all things in nature: oceans, rivers, lakes, birds, predators, trees, and more trees. Preaching to the already converted is an easy job - but I fervently wish that more institutions would pay attention to the deep physiological/psychological connection that human beings have with nature. Schools should incorporate more outside activities and studies. Buildings should be constructed with nature in mind. Give us trees, give us air, and give us a little more silence.......please.Still, despite the fact that I already know I feel better hanging around outside, Williams's book articulates why I feel the way I do - and she incorporates the current science behind it. Why do we think better while walking in nature? Why is our memory better? Why is our mood? This book gathers many answers in an attempt to reveal the significance of getting outside. The author writes: Humans have brains that are sensitive to social and emotional stress and we always have. Perhaps what matters is not the source of the stress but the ability to recover from it. This is a key point, because it's perhaps what we've lost by giving up our connection to the night skies, the bracing air and the companionate chorus of birds. When I'm walking across a pleasant landscape, I feel I have time and I feel I have space. I'm breathing deeply things that smell good and seeing things that bring delight. It's hard not to feel the pull of a grounded reality when you're dipping into a muddy trail or a flowing river. And yet, apparently 15% of the population hates anything to do with the natural world. They hate the dirt, they hate bugs, and their stress (cortisol) levels do not dip down. Interesting. But the other 85% of us probably feel trapped by car exhaust, traffic, leaf blowers, and four walls. Of course, if you're a park ranger or a ski instructor then you're already living the life of Riley - but most of us can't do that and survive economically. (Or perhaps we just think so). Still, some great points are made about \"containerized children\" and ADHD, points which lead to the overall message of the book: nature heals. I'm a believer."}, {"userName": "Mike", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/7567867-mike", "userReview": "As much as I wanted to love this book, and was excited to finally get my hands on it, I found the material to be presented in such a dry and slogging format I was relieved to finally finish it. The author's writing style tends to focus chapters on key studies or events going on, and takes what should be a 5-10 page story and extends it into something much longer. This book could have been 1/3 the length with the same takeaways and would have been better."}, {"userName": "Erin", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/4112781-erin", "userReview": "The book doesn't flow well. It's basically chapters (short stories) of how other countries experience and interact with nature. All I could think when reading it was that the author wanted to visit all these cool places and the book was an afterthought (and what paid for the trips). The ending still didn't give me the closure or cohesive-ness that this book greatly needed. Good ideas, just poorly executed and not really enjoyable to read."}, {"userName": "Rachel León", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/21291796-rachel-le-n", "userReview": "(3.5 stars, rounded up because this book inspired me to get outside more)Florence Williams outlines why getting into nature is so essential for our health and well being. She also talks about the implications of all the time we spend \"plugged in.\" I have always loved being in nature, but my introvert default mode is to curl up on the couch. This book reminded me of how good I feel when I'm in nature, how much clearer I think, and how much more creative I am. Overall, it's an interesting read."}, {"userName": "Esther Marie", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/4193789-esther-marie", "userReview": "Truly more of a 3.5 stars than a 4 for me, BUT it definitely made me think and since I'm an earlier reviewer it seems mean to curve downwards. I am reviewing an advance reading copy. The strength of this book is the skill that Williams has with setting a scene. Her descriptions are very visual and engaging. My favorite chapters were about nature therapy and the role of nature within society in both Japan and Korea. She also does a good job of citing her sources, which is something that writers in the \"popular science\" genre sometimes really fail at. Similar to other popular science authors, (Mary Roach, for example), Williams is herself a character in her journey to learn more about \"why nature makes us happier, healthier, and more creative.\" For the most part she comes across as earnest and self-aware, but if her voice gets under your skin early on, she can come across as a little annoying. I think that this is a problem that editing could definitely remedy, and it may not be a problem with the book when it is published. The primary downfall of this book (or at least the advance reading copy) is that it seems to lack a real focus or narrative arch. Williams does a lot of research into LOTS of ways that humans interact with nature as well as studies looking into how nature impacts the moods and health of people. A ton of food for thought, but there isn't a clear journey. My opinion is that this book would have been more powerful if it were slightly less episodic. I am passing this book along to my boyfriend (who bemoans our living in New York City and yearns for rural life) so I can say that I would recommend this book, especially to people who already hold some beliefs that green space is superior to urban/concrete space. It's also worth noting, however, that my coworker--a born and bred New Yorker--thought that The Nature Fix was a bunch of hooey.**Update**The boyfriend who hates city life *adored* Nature Fix and called it one of the best books he has read recently. He's a scientist, too, which I think speaks highly of Williams's ability to write clearly and use scholarly resources. For me, this book remains 3.5 although I haven't looked at a finished copy since my review."}, {"userName": "Emily Crow", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/23080450-emily-crow", "userReview": "The subject matter is fascinating--the author travels around the world, talks to researchers, and participates in different projects that are attempting to demonstrate all the different ways that being around nature is good for us. Some of the projects were kind of goofy, like virtual reality treadmills or taking walks with EEGs on her head, others made me wish I could experience them as well, such as Japanese forest bathing or a therapeutic kayaking trip. I'm less enthusiastic about Williams' writing style, however. It's quite readable, and I think would be appealing to those who are only casually interested in the topic, which is good, but sometimes her random pop cultural references or strange comments about someone's appearance would be distracting. Her chapter about the Finns seemed especially glib and patronizing, at various points characterizing them as \"gnomic\" and being in a state of arrested development (due to their enduring love of being outside). Despite my reservations, this is one of the more interesting nature books I've read this year, and I would recommend it to just about anyone. Even if you think you don't like nature, it might still improve your health."}, {"userName": "Laura", "userReviewDate": "Apr 13, 2017", "userURL": "http://www.goodreads.com/user/show/1581924-laura", "userReview": "Very dry and boring, very little about the science behind the premise. It was mostly about this woman's nature hikes with various professionals who take \"city people\" out into nature for a couple hours. The \"proof\" as evidenced by lower vital signs is so little that natural variation throughout the day is easily twice or more, so basically it proves nothing. Found myself skimming, and decided to dnf it. Life's too short to read crappy books."}, {"userName": "Deanna", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/417688-deanna", "userReview": "Super informative and fun little read about nature and yourself and your body. Though I didn't get to read it in nature just reading it kind of made me feel better. I love being outside and I honestly feel so much better surrounded by trees and wildlife and after reading this book I've been convinced that I need to buy a log cabin in the middle of nowhere so thanks for that haha"}, {"userName": "Shiloah", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/973558-shiloah", "userReview": "This book is jam-packed with information. She has a spunky sense of humor. I enjoyed this thoroughly and learned bunches."}, {"userName": "Holly", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/4763049-holly", "userReview": "Well-balanced and extremely interesting (like her earlier book on Breasts). Sort of reminded of Mary Roach. I'm disappointed that I missed hearing Williams speak when she was in town recently."}, {"userName": "Shelly", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/27190191-shelly", "userReview": "I’ve been missing the outdoors of Wisconsin lately. (Easier to do during the summer and early fall. Though my son loves Wisconsin winters.) So this book is a good match for me. It’s an exploration of the science of nature’s effect on people. I liked how she went to several countries and shared their research and programs. A couple chapters seemed a little repetitive but she made up for that by following up those chapters with ones on vets with PTSD and children with ADHD."}, {"userName": "Olga Kowalska (WielkiBuk)", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/5400141-olga-kowalska-wielkibuk", "userReview": "Niby w książce Florence Williams nie odnajdziemy nic nowego, bo przecież wniosek, jakoby wpływ natury był dla człowieka pozytywny pod każdym względem wydaje się być wnioskiem oczywistym, niemniej w „Natura leczy” odnajdziemy mnóstwo inspiracji oraz motywacji, by faktycznie bliżej natury się znaleźć. Autora przestawia argumenty w sposób błyskotliwy, bliski współczesnemu czytelnikowi, na własnym przykładzie udowadniając, że pogłębianie kontaktu z przyrodą przynosi jedynie wymierne korzyści tak dla naszego zdrowia fizycznego, jak i psychicznego. A recepta jest najprostsza z możliwych, wystarczy podążać za słowami pani Williams:„Starając się uchwycić kwintesencję wszystkiego, czego się dowiedziałam, wymyśliłam niezwykle proste zakończenie: Wychodź na świeże powietrze, często, czasami w dzikie okolice. Zabierz przyjaciół albo nie. Oddychaj”."}, {"userName": "Literary Ames {Against GR Censorship}", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/2109885-literary-ames-against-gr-censorship", "userReview": "Reminds me of the 72-hour cabin case study:\n'To explore the effects of the unique relationship Swedes have with nature, Sweden did a case study in September 2017. Five people with some of the most stressful jobs got to experience Sweden’s 'close to nature' lifestyle, whilst their well-being was measured by leading researchers. During the study, the participants stayed in custom-built cabins made of glass to be as close to nature as possible. After 72 hours, they all showed a decrease in blood pressure, stress levels and heart rate - and they became more creative too.'"}, {"userName": "Sarah Booth", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/3524795-sarah-booth", "userReview": "A great book researching how time in nature effects us. Scientific studies where we find that being outside or in nature compared to the city or a control had an effect on blood pressure and other bodily functions in a positive way. We have become greatly removed from nature and our health has started to show it. Worth taking a look at!"}, {"userName": "John Lamb", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/7764860-john-lamb", "userReview": "Most likely I will bring this book up with a gathering of people indoors and it will remind me that I really don't want to be with a gathering of people indoors."}, {"userName": "Allie", "userReviewDate": "Dec 19, 2017", "userURL": "http://www.goodreads.com/user/show/28152261-allie", "userReview": "I am really shocked at the high reviews on this one. I was less than unimpressed."}, {"userName": "L.P. Logan", "userReviewDate": "Jan 18, 2017", "userURL": "http://www.goodreads.com/user/show/55257294-l-p-logan", "userReview": "Alright. This book is the perfect kick in the pants that you've been waiting for. The one that is going to tell you to stop reading this review right now, and go outside. You'll be happier if you do. Science has proven that you will be dramatically more happy, and healthy, and creative, and chill simply by going outside and getting back in touch with nature. You know, that place where wild animals roam and there is nary a concrete patch to be seen?In all honesty its a great read, very informative and easy to follow. I definitely enjoyed it and would recommend this to anyone who is wondering just how they might manage to finally figure out how to make themselves happy. This isn't a cure-all, but it does give you a great starting point. So check it out and find yourself well on the way to inner peace and happiness. The creative boost you'll feel is merely an added bonus."}, {"userName": "Robin", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/11249194-robin", "userReview": "I picked up The Nature Fix, knowing from experience that exposing oneself to nature is food for the body, mind and soul - but still I was curious. This is a smart, thought provoking feast of information from kids with ADHD to soldiers coming back suffering from PTSD and just your every day person who like many are suffering from nature deficiency with the explosion of technical devices and who are more apt to stare down at their phones than up at the sky or the horizon or to notice a beautiful sunset or the light shining off a river. We are disconnected from the natural world more and more and this book tells us all the reasons why just a walk in the forest, each and every day, is enough to make us happier, healthier and more creative in our everyday lives."}, {"userName": "Kaisha", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/5441925-kaisha", "userReview": "From Japanese forest bathing to Finnish metsänpeitto (being covered by forest) Williams explores the role of nature in human well-being. Current neuroscience has finally given us the tools to test how things like the smell of trees, quiet green spaces, and urban vs. natural views affect the brain. This book provides science for the sceptics and inspiration for the couch potatoes to \"go outside, often, sometimes in wild places. Bring friends or not. Breathe.\""}, {"userName": "Jo", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/12091097-jo", "userReview": "I was drawn to this book by an article I’d read recently on the Japanese concept of ‘Forest Bathing’. This idea of healing stress, by simply walking and being in nature, whether that be forest, by the ocean or in the desert made so much sense to me. I was very keen to read Florence Williams’s look at the science behind the positive, or otherwise, effects of nature on us as we move away from being outside in this digital age.Williams’s writing is so engaging, serious when she has to be, sometimes skeptical, jokey and often humorous. She meets a huge cast of researchers and scientists from an array of countries and succeeds in giving the details that individualize these people while giving fascinating information about countries such as South Korea –which I realized I clearly knew nothing about beforehand.The book moves from an introduction where Williams talks about her own move from Boulder Colorado to Washington D.C because of her husband’s job –she is clearly still irked about this- and how this has changed her own experience of nature, to Japan which was one of the first countries to spend money on researching this field. She then moves to looking at the amount of time spent in nature; five minutes, five hours a month, days and weeks at a time, all with a correlating increase it seems in wellbeing. These effects range from an increase in NK (natural killer) immune cells (a good thing), lowered blood pressure, a decrease in pre-frontal cortex activity –basically turning off our ‘thinking’ brain and switching to our ‘relaxed, dreamy brain’, relief from depression, an increase in memory and cognition skills and more. All the way through, there is fascinating historical snippets and quotes, clearly articulated science explanations, interesting people, enthusiasm and empathy. It is when she turns to the experience of wilderness for those who have PTSD, in this case female USA veterans who are suffering mentally and physically, that what has seemed relatively light-hearted gets serious. With a husband who is an Afghanistan combat vet, the stories these women told touched my heart and reading about their experience on a specialized outdoor program that took them out for a week into the Idaho wilderness was strong stuff. They weren’t miraculously fixed but you can read about what it did or did not do for them yourself.There is so much great stuff in this book, how being outside is so important for kids, particularly those with ADHD, what we can do to experience nature when we live in cities –as over half of us do- and the fact that for 15% of us, being in nature is not beneficial at all, even scary. The studies and names are numerous and I feel as though this is a book that needs rereading because of how much is in it. Yet it is entirely readable, I am a very slow reader but shot through this. The science of this subject is in its early stages and continually evolving but I can’t wait to see where else it might go to show how clearly we need the natural world."}, {"userName": "Marigold", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/31624155-marigold", "userReview": "Time spent in nature is restorative, creativeizing, anxiety busting, miraculous. This book explains how this has been explored by scientists looking to prove and explain nature's benefits. The Nature Fix felt disjointed to me, hopping around the world and briefly visiting scientists or forest rangers. It wasn't until I was near the end of this book that I realized the connections between its message and what I try to do at work. The accumulated evidence of measurable positive impact achieved through time spent outside is powerful. But again, the disjointed scattering of information made the idea of rereading to find pertinent facts a dreaded chore promptly discarded. I read this while on a long wilderness retreat, curious of the effect the combination of setting and story could have. Underwhelmed. I wanted to be blown away. But I do think it's important that nature benefits research has been investigated and collected in this volume."}, {"userName": "Leo Walsh", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/2118933-leo-walsh", "userReview": "I thought this was going to be light-weight New Age fluff. But it turned out to be an interesting book based on compelling scientific research. Because it turns out that connecting with nature is good for both the soul, increasing creativity and decreasing anxiety, and the body, lowering stress-related diseases, like high blood pressure. This is a fast read, and pretty light as most self-help books tend to be. However, since it's based on real science and does not overstate the case as is typical of the genre, I feel comfortable giving it four-stars since using it will improve lives."}, {"userName": "Scottsdale Public Library", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/4332892-scottsdale-public-library", "userReview": "Do you gaze wistfully out the small window from your desk, bathed in recirculated air, annoyed by your coworkers' incessant chatter and wish you were bathed in sunlight on a blanket of grass instead? Well, you may be suffering from Nature Deficit Disorder! Florence Williams takes a look at why we long for babbling brooks, chirping birds and the outstretched arms of mighty trees. For starters, greener areas of urban landscaping have less crime rates, blood pressure and heart rates tend to lessen with the company of a natural environment, creativity flows, and feelings of awe from nature tend to make people more generous. This is a relevant look at our need for nature and a great reminder: go outside. Often! –Sara G."}, {"userName": "Cathie", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/7399091-cathie", "userReview": "\"This book explores the science behind what poets and philosophers have known for eons: place matters.\"Walk, walk, walk {location, location, location}Received copy in exchange for review."}, {"userName": "Devon", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/58855417-devon", "userReview": "Go read this book immediately"}, {"userName": "Yvo Hunink", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/61750298-yvo-hunink", "userReview": "I started reading this book in a plane flying towards the amazone. I couldn’t have picked a better time. While the feeling of being in nature has always been said to be a beneficial one, now it is completely clear to me where this originates from. The chapters are well segmented and give form to different types of benefits and different types of research that is done on the topic. It really enriched my walks through the amazone forests, where I focused much more on the aspects the book showed me.All together a must read, especially for urban architects and planners, because it is alarmingly clear that our urban habitats are not doing much good for our physical and mental wellbeing."}, {"userName": "Jess Dollar", "userReviewDate": "Apr 26, 2017", "userURL": "http://www.goodreads.com/user/show/6514697-jess-dollar", "userReview": "An interesting and enjoyable exploration of how essential time outside i nature is to our well being. Lots of food for thought and definitely inspired me to try back country camping some day!"}, {"userName": "Daniel", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/638550-daniel", "userReview": "This review originally published in Looking For a Good Book. Rated 2.5 of 5People are happy, healthier, and do better overall (in school, at work, etc) when they are able to be exposed to a natural environment (woodlands or waterways) and there's plenty of documentation to back this up.Now you can either take that one sentence and move forward or you can sit and read a 300 page book and come away with the same thought. Your choice.The subtitle for this book is: Why Nature Makes Us Happier, Healthier, and More Creative. Author Florence Williams does give us some of the scientific evidence to answer the question of 'why' and she's clearly explored a few different studies into the effects of nature on the human psyche.But why do we need this book?I picked up this book even though I'm already a strong believer in the need for fresh air and the outdoor environment. I personally would rather be hiking through a woods or sitting on a beach shore than just about anywhere else. I don't need convincing in the effects of the outdoors. This book isn't for me.But I'm no fool. I know that there are many people (more than half the population as of 2008, according to this book) who live in metropolitan areas who don't get to experience nature. So is this book for them? Is this going to change the mind of the shut-in or the city dweller who doesn't experience a walk among trees or a long a shore? \"Oh...I didn't realize there was scientific evidence...\"?Most urbanites, in my mind, don't get out into nature because they either can't or they don't know where or how to go. The scientific evidence that they need to go isn't the motivation that they need. No ... this book is more for the self-confirming - to maybe justify why we head out for a picnic on a Saturday instead of cleaning out the furnace room or doing a little work at home to catch up.I can't imagine who I would give this book to. My outdoorsy family doesn't need it, and my city-dwelling family wouldn't care about it.Some of the material is presented in a straight-forward, rather dry style and the early chapters where a bit of a chore to read. The later chapters were more engaging and felt like a breath of fresh air. Still, while I agreed with the conclusions presented, I was left wondering why this book would be important or a must-read. I haven't come up with any answers.Looking for a good book? The Nature Fix by Florence Williams is a hard look at the documented importance of finding time to spend in nature, but the book is self-affirming to those who already spend time outside and unlikely to convince anyone else of the need.I received a digital copy of this book from the publisher, through Netgalley, in exchange for an honest review."}], "description": "From forest trails in Korea, to islands in Finland, to eucalyptus groves in California, Florence Williams investigates the science behind nature’s positive effects on the brain. Delving into brand-new research, she uncovers the powers of the natural world to improve health, promote reflection and innovation, and strengthen our relationships. As our modern lives shift dramatically indoors, these ideas—and the answers they yield—are more urgent than ever.", "title": "The Nature Fix: Why Nature Makes Us Happier, Healthier, and More Creative", "url": "http://www.goodreads.com/book/show/35187181-the-nature-fix", "average": 4.0, "cover": "https://images.gr-assets.com/books/1497194694l/35187181.jpg", "reviews": 422, "authors": [{"url": "https://www.goodreads.com/author/show/5824043.Florence_Williams", "name": "Florence   Williams"}], "type": ["Nonfiction", "Science", "Environment", "Psychology", "Health"], "outlinks": ["http://www.goodreads.com/book/show/35187181-the-nature-fix", "http://www.goodreads.com/book/show/30231812-the-nature-fix", "http://www.goodreads.com/book/show/13418346-breasts"]}