{"ratings": 18015, "userreviews": [{"userName": "Jennifer", "userReviewDate": "Apr 24, 2016", "userURL": "http://www.goodreads.com/user/show/9420458-jennifer", "userReview": "4.5 enthusiastic starsI'm stunned this book isn't receiving more buzz, as it is one of the better books I've read this year.\"The One in a Million Boy\" is about a socially-awkward 11 year old boy who is obsessed with The Guinness Book of World Records (known to readers only as \"the boy\") and a 104 year old woman named Ona Vitkus whom the boy interviews for a school project. Of course, to say that the book is only about Ona, the boy, and the school project, would be like saying that The Unlikely Pilgrimage of Harold Fry is about a man who went out for a walk. \"The One in a Million Boy\" is filled with love and humanity without at all being saccharine. I'm not saying anymore, because for me part of the joy was discovering the beauty of this book without any preconceived notions. In fact, DO NOT read the Amazon description, and be very wary of reading other reviews, unless they are from trusted reviewers who do not give spoilers (you may even want to skip the GoodReads blurb).If you liked The Unlikely Pilgrimage of Harold Fry, The Love Song of Miss Queenie Hennessy, or even Me Before You my prediction is that you'll enjoy this."}, {"userName": "Angela M", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "We never know his name but we come to know almost immediately the fate of the eleven year old boy who has a thing for world records and for counting and making lists and collecting things by 10. Is he just quirky or anxious or obsessive compulsive or lonely? Maybe a little of all of these but what we know for sure - he's smart and perceptive and has a special capacity for understanding as he connects with the lonely 104 year old Ona Vitkus , who he helps each week as he works toward his Boy Scout badges. Throughout the book we come to know just how much the boy gives to Ona - mostly it's the gift of friendship, but it's also the ability to come to terms with her past and her future. Telling the boy her story for a school project, she also somehow finds her native language, Lithuanian, even though she has been in the US for 100 years . The interview, the amazing interview tells us a little about the boy's life as well - his parents are divorced, he's bullied and has no friends, except of course, Ona Vitkus. The story is also about grief, regret, forgiveness. This is somewhat sentimental and sweet, and sad but I loved every word . It's also uplifting and a story I probably won't forget soon largely because of the boy and Ona, two characters that it took me all of a minute to fall in love with. I can't make a list of complaints because there is only one - I wanted to know his name ."}, {"userName": "Elyse", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "This is the season of the Jewish High Holy Days.....A time to reflect - a time for moral self-assessment-seeking forgiveness from others we have harmed- making amends as appropriate. This story fits with the season!!! In Monica Wood's book.....\"The One-In-a-Million-Boy\"...... After the loss of his son, a father carries on the boy's commitment to a 104 year old woman, named Ona.The father was resistant at first....but because of the boys devotion and obligation to Ona, the father soon reaps the value himself -by obtaining a terrific friend and perceptibility about himself. In the most unexpected way people and history come together. This is a beautiful story about unusual friendships. The writing is poetic, humorous, tender & sensitive.The universal themes of friendship, love, regret, forgiveness, and atonement are not sugar coated --not sappy - simply awe-inspiring and enjoyable!!"}, {"userName": "Karen", "userReviewDate": "Apr 13, 2016", "userURL": "http://www.goodreads.com/user/show/12851291-karen", "userReview": "4.5 stars I just loved this book! So heartwarming, funny, sad, you will feel it all. Ona Vitkus a 104 yr old Lithuanian immigrant and the most unlikely friends she made just make this an awesome read."}, {"userName": "Ron", "userReviewDate": "Oct 17, 2016", "userURL": "http://www.goodreads.com/user/show/43881851-ron", "userReview": "My thoughts are awash after reading this story that I cannot stop thinking about. Books I’ve loved tend to do that. “Loved” kind of says it all, but because the boy in the book, who grabbed my heart, was a boy who liked to count and list things by groups of ten, I thought I’d form my own list of ten thoughts and feelings that tries to explain why this story so affected me:1.)\tI cannot ignore the World records that were such a part of this 11-year old boy’s personality. I found myself looking forward to these lists as they popped up between chapters, in groups of ten of course. The best part: they pertained to and enhanced the story.2.)\tGosh, this book made me laugh. Inside and out loud.3.)\tOn the flipside - tears. Yeah, I was close. Quite a few times actually. I’ve said it before: emotions can lift a story to the next level.4.)\t The friendship between this uncommonly wonderful boy and the 104-year-old woman named Ona defied proved that the boundaries of age are nonexistent and trivial.5.)\tThis boy’s stamp on many hearts made a deep impression on mine. A boy so young and seemingly small yet whose presence remains large. He is the intangible that binds.6.)\tThe dad realizing that he cannot go back, but can still love the son that was lost and understanding the blessings of the love he did not see. 7.)\tThe mom whose broken heart finds solace in forgiveness, and the knowledge that the same heart can yet love another.8.)\tThe way a child can teach a 104-year-old friend to recall the best parts of a life; that age is only a number; and beginnings can occur at any point.9.)\tGorgeous, heartfelt wording: \n”Then ten, and ten again, chiming from concealed spots above and between and around the houses and garages and parked cars and telephone poles and the light urges into the astonishing hour, each chime pecking a pinhole in the sheeted dark until the last layers shred completely and the light pours in and in.”\n 10.)\tBeautiful endings."}, {"userName": "Maureen", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/13427823-maureen", "userReview": "It's sad, it's amusing, it's uplifting, and the writing is beautiful. This is the most unlikely of relationships - 104 year old Ona Vitkus and an 11 year old boy, but it's a joy to see it unfold, and watch how the story develops because of this relationship. Their friendship impacts on all those who know them, and just be sure to keep the tissues handy!*Thank you to Goodreads for this first reads giveaway*"}, {"userName": "Suzanne", "userReviewDate": "Mar 29, 2016", "userURL": "http://www.goodreads.com/user/show/11889829-suzanne", "userReview": "This was a very sweet book, which I thank Goodreads and the publisher for my hard copy. I have never seen such a specific layout in a book before, and this made a lovely story into a quirky reading experience.I love to read about the underdog, and here we meet a lovable 11 year old boy who forms an unlikely friendship with Ona – who happens to be 104 years of age! I also love to watch a character, seemingly flawed, grow from something not to be proud of into something to be absolutely so. Quinn was this character for me, this time around.The boy loves numbers, he counts, and this is just one of his many quirks. Born to Belle and Quinn he’s an old soul. Quinn has been an absent father and is a musician and doesn’t seem to have bonded with his son. The last scene of this book brings us some clarity here, the ending was special.A recording device is used by the boy to tape Ona as she muses over her life, the way in which this was captured was clever, we see the to-ing and fro-ing of the conversation. Ona thinks she’s seen it all and is very moved to realise how much this child has taught her over such a small period of time, after all it should be her teaching him, shouldn’t it?The boy has a lot to teach, even his absent father. I love the imagery at the very end where birds have captured a musical note on his recorder that the boy was not able to capture. His dad would have been so proud of this. This is a slow to burn story, patience is a requirement but will be rewarded."}, {"userName": "Cheri", "userReviewDate": "Apr 22, 2016", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "As this story begins, Ona Vitkus is a hundred and four years, one hundred and thirty-three days old. Born in Lithuania, raised in Maine where she’s lived since she arrived at the age of 4 years old. Her parents fled with her to the US in fear of the coming Russian invasion. Her parents spoke little English, where Ona can speak only English, a word or two of Lithuanian floating through her memory now and then. The boy’s father, Quinn, appears two weeks after the boy had last visited Ona, doing what scouts do, assisting the elderly with chores that need periodic tending. Ona has been disappointed in all the previous Scouts until this latest boy, Quinn and Belle’s son. He’s different from the rest, more attentive, inquisitive. In his journal he’d written of her: “Miss Vitkus is EXTREMELY inspiring in her magic powers and AMAZING life events!!!” Quinn knows this since he has been reading this diary, a way for him to get to know his boy on a level he never could any other way, anymore.The boy has been fascinated with numbers since he first learned to talk, his first words being: “one, two, three.” He’s fascinated with counting things, has an obsession objects in his lists in stacks of ten. He’s obsessed with world records, the Guinness World Records and begins recording sessions with Ona as she tells the story of her life according to his lists and questions. Ona is quite taken with him; he has become the closest thing she has had to a friend in a number of years. She enjoys the boy’s company, enjoys having something to look forward to. And so, over the course of time, as all love stories go, they become friends. The more time that Quinn shares with Ona, the more he feels all the reasons why his son loved coming here. He has six more weeks to go before his 7 weeks of duty are finished, but he discovers that he really doesn’t mind being there. As he looks around he sees things that show touches of the boy’s presence. Maybe through his visits he’ll come to understand the boy. The friendship between the boy and Ona is priceless. Charming. Endearing. The friendship which evolves between Quinn, and even Belle and Ona equally heartwarming. There are other people you come to know through Ona retelling the story of her life, some still living, some not. It’s all wonderful. One young boy who’s a bit reminiscent of Owen Meany’s un-childlike tendencies (A Prayer for Owen Meany) and a storyline that is a bit reminiscent of Harold Fry’s Pilgrimage (“The Unlikely Pilgrimage of Harold Fry”), add salt from a few tears and you’re close to understanding a little bit about the magic that occurs between the pages of “The One-in-a-Million-Boy. ” Tissues might come in handy."}, {"userName": "Jaline", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/7234171-jaline", "userReview": "A diligent, hard-working 11 year old boy who loves making lists and counts everything bonds with a 104 year old woman over animal crackers and milk. The boy is committed to earning a Scout badge for volunteering to do her yard work and, despite ‘firing’ previous young lads, Ona Vitkus sees something in this boy that is rare and special.When the boy can no longer keep his commitment, his father, Quinn, steps in to complete the seven remaining scheduled Saturdays. Quinn considers himself a failed husband, a failure as a father, and is bemused by the fact that he may be the oldest working musician who has never had a recording offer.Quinn’s twice-ex-wife Belle agrees with his self-assessments but also has her own problems to bear. Like magnets, they keep being drawn to Ona and her ambitions set in motion by the boy to become a respected entry in the Guinness World Book of Records.The dynamics between the characters in this book are unreservedly captivating. I bonded with almost every character mentioned in the book for various reasons and shed tears for – and with – many of them, too.This story is unique and breaks your heart at times, yet the strong notes of redemption and triumph are always there in the wings, awaiting their moment. I found this book to be very moving and tangible. The people are genuine, their story dramatic, yet without a hint of soap opera or melodrama. Real people, living real lives, experiencing the realities of each other and the bright notes where their realities touch each other’s. A beautiful book that will bring light into your life and a song in your heart."}, {"userName": "Phrynne", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "[ Quinn would never know how much the boy loved him and wanted his approval (hide spoiler)]"}, {"userName": "Liz", "userReviewDate": "Apr 14, 2016", "userURL": "http://www.goodreads.com/user/show/20625013-liz", "userReview": "I crept out of bed at 3:30 a.m. this morning to finish this book and I must have read the last sentence ten times with my heart in my throat. Back in bed next to the open window, I heard the slow beginning and then the full morning chorus of birds as the darkness receded through the woods. It gave me goosebumps. I realize that may sound cryptic but when you read the book – and you must read this book - you’ll know just what I’m talking about. This story could not possibly have ended more powerfully.Monica Wood’s writing is delightful and endearingly quirky but her characters are the star of the show. She has created this brilliant boy, his father, and their mutual friend Ona as shining human beings, each on their own journey toward self realization. Their story reflects on all the things that one person can be for another and how family is not always formed through blood or by marriage. It’s a story of sorrow, regret, penance and absolution. It’s a story about love. I’m going to say what other reviewers have already said and that’s this: if you haven’t yet read the blurb on the inside flap of this book, don’t do it. Just open it up and meet Ona, Belle, Quinn and the boy, and witness their extraordinary gifts."}, {"userName": "Sarah", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/18894476-sarah", "userReview": "Wow ! The One In A Million Boy is outstanding !! You never know his name, but you won't forget him. This book was recommended to me and I was told to not read any reviews, \"just read it\". I'm surprised there isn't more talk about it. It's a beautiful novel that is engaging, sad, but not without hope, funny, poignant. The author draws so many emotions from you. The story of an 11 year old and a woman who is 104. The boy seen through Ona's eyes is such a sweet character. The story of a Father who didn't think he loved his son enough.It's very character driven, but all of the characters are special to the story and very believableThis book is about life and friendship.It's hard to do a review on a book like this and give it justice. I will just say that I highly recommend it. It's ultimately uplifting and hopeful. It had all the feels for me"}, {"userName": "Marilyn C.", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/8170584-marilyn-c", "userReview": "A fantastic and heartwarming story about an unlikely friendship between an 104-year-old Lithuanian immigrant and a 11-year-old Boy Scout. The bond they share is uniquely special, and will definitely touch your heart. I took the advice of several Goodreads friends, and did not read the blurb for this book. It really was best not knowing too much of this story beforehand and letting it just unfold as it goes. You are in good hands as Monica Wood delivers a well written story that will make you think about life and those that you share it with. After finishing this book the night before, it was a solid 4.5 stars. But after wanting to reread the final chapter the next morning, I felt it became a five star book. Well done, Monica Wood."}, {"userName": "Cathrine ☯️ ", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/22600410-cathrine", "userReview": "3.75★“But certain others, they move in and make themselves at home and start flapping their arms in the story you make of your life. They have a wingspan.”A life-affirming story of how a boy spread his wings producing turbulence in the lives within his airspace. Just about any reader would enjoy it, particularly anyone who has or works with a special needs, or should I say specially gifted child. Or perhaps you could use some inspiration in your winter years and be reminded that it’s never too early or late to live a life that really counts."}, {"userName": "Aditi", "userReviewDate": "Feb 17, 2016", "userURL": "http://www.goodreads.com/user/show/16069171-aditi", "userReview": "“If you live to be a hundred, I want to live to be a hundred minus one day so I never have to live without you.”  ----Joan PowersMonica Wood, an award-winning best-selling author, pens a heart-rending tale of friendship in her new book, The One-in-a-Million Boy that narrates the story of a boy, and a 104-year old immigrant lady and the boy's father, who form a strong bond of friendship over loss and grief and their passion for Guinness World Records.Synopsis: Miss Ona Vitkus has - aside from three months in the summer of 1914 - lived unobtrusively, her secrets fiercely protected.The boy, with his passion for world records, changes all that. He is eleven. She is one hundred and four years, one hundred and thirty three days old (they are counting). And he makes her feel like she might be really special after all. Better late than never...Only it's been two weeks now since he last visited, and she's starting to think he's not so different from all the rest.Then the boy's father comes, for some reason determined to finish his son's good deed. And Ona must show this new stranger that not only are there odd jobs to be done, but a life's ambition to complete. This heart-warming tale is about an eleven-year old boy, a boy scout and and used to help out a 104-year old lady, Ona Vitkus with some odd jobs over the weekend, who is now dead and has left a strings of people who care for him deeply and is trying to adjust with the void that he created with his death, or rather say fighting hard everyday to cope up with the loss. But mostly this is that old lady's tale who is 104-years old and has a lot of bird feeders. After the boy's death, his father, Quinn, takes up his job with Ona, who figures that just like other 11-year old boy scouts, \"the boy\" too have quit. His father, Quinn, is a guitar player, and used to travel a lot from one place to another for gigs and had given very less time to family life with Belle, his wife and \"the boy\". And through Ona, Quinn, realizes that the boy has left his great presence with her rather than in his home. Well, I never ever read anything so beautiful and delightful in my entire lifetime. A death of someone could result in sadness and that sadness beheld by the author is extremely fascinating. The author gave positivism to death. \"The boy\"- he is at the center, surrounded by his parents, Quinn and Belle and that old lady, Ona. How he left them with a void after his death and how these three human beings try to comprehend with his absence in their lives, moreover, what changes it brings to their old demeanor, all these are the main highlights of this story. You might be wondering why I'm saying \"the boy\" instead of using his? Because that's the idea of the author to not to use name of \"the boy\" in order to contemplate with loss of the other characters he left behind.The writing is evocative and eloquent and the author has poured her soul and deep heart-felt emotions into the story while writing it. The narrative is extremely poignant and engaging and will keep the readers glued till the end of the story. The pacing of the nook is medium as the book evolves in a slow manner with Ona and Quinn's friendship and also with the fact that \"the boy\" is dead. \"The boy's\" passion for Guinness World Record Holders is extremely rare and enlightening thereby just like \"the boy's\" passion, the author too will try to make her readers develop that passion, by featuring the real names of some of the Guinness World Record Holders in various categories, in between this story.The characters of the book are the gems of this book and just like the captivating story line, the characters too are absorbing and are we ll-developed with their flaws and weaknesses. The author depicted them in their vulnerable moments and that can be only when a human being is hit by a death of his closed one. The author have explored the friendship among Ona and \"the boy\" and Ona and Quinn. One and \"the boy's\" friendship is enchanting an d very precious, how the old lady begins trusting \"the boy\" based on his eccentric attitude towards Guinness World Record Holders. Ona is depicted as someone who is brave and intense and still knows how to survive in a modern world. Her life story is featured in the form of recordings done by \"the boy\" for the Guinness World Record title. The friendship between Quinn and Ona is really deep with lots of compassion that will eventually make the readers feel their raw pain and grief for \"the boy\". Quinn is a flawed character, not a good father but he evolves through out the story finally becoming an understanding and caring friend to Ona. The supporting characters are too well-developed and they too hold a power to leave an imprint long after the end of this story.This is a voyage through loss, especially for Quinn, and on the way, he finds a great friend like Ona, a Lithuanian immigrant. Together they share the memories and together they share hope and loss, eventually dealing with life, as a whole, thereby beholding a power to bring tears to the eyes of the readers and at times bringing a smile to the face of the readers.Verdict:  Yes this a must read for all. Drown yourself into the depths of this story and let your emotions get controlled by the course of this story. Courtesy:  Thanks to the author, Monica Wood's publicist for giving me an opportunity to read and review an early copy of this book."}, {"userName": "Larry H", "userReviewDate": "Apr 18, 2016", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "I'd rate this 4.5 stars.Well, I know I'm a sap, but this one had me in pieces. Or maybe there was just something in my eye.Ona Vitkus is 104 years old, a Lithuanian immigrant whose prickly exterior belies a warm heart, a mischievous spirit, and a lifetime of regrets. When the local Boy Scout troop assigns an awkward yet earnest scout to help her with household tasks to earn a merit badge, she's ready to scare him away as she has the others, if he doesn't disappoint her first.Yet there's something about this boy that makes Ona let down her guard. Perhaps it's his lack of self-confidence, or his incessant curiosity about her life. Perhaps it's his emotional openness and his desire to be won over by everything she does. Or perhaps it's his obsession with the Guinness Book of World Records, which even fuels in Ona a desire to find a record she can achieve, even at her age.The two form a close bond, made more so as he chooses her as an interview subject for a school assignment. But when one weekend when the boy doesn't show up, and his father Quinn, an erstwhile musician who had trouble connecting with his son, appears in his place, Ona feels hurt and disappointed that he abandoned their relationship and their quest. It isn't long, however, before she realizes the boy died suddenly and inexplicably, and Quinn decides to pick up his son's tasks in an effort to better understand the boy who bewildered him, who never seemed to get what Quinn wanted to give him.Quinn is adrift, wanting to land on his feet professionally yet feeling utterly lost psychologically. Belle, his ex-wife (twice) and the boy's mother, won't let him share in her anger or her guilt, and all she wants to do is make Quinn pay for not giving their son the love and security he needed and deserved. But while she wants both to mourn her son and get on with her life, she starts to realize that Quinn might have the right idea in forging a relationship with Ona in an effort to keep the boy alive.\nThe One-in-a-Million Boy\n is moving, beautiful, and even a little whimsical. Ona and Quinn are particularly fascinating characters, and I love the way Monica Wood gave Ona so much more depth than I first expected. Amazingly, however, it is the boy who is the most memorable character, despite the fact that we never learn his name, and you mostly see him through the eyes of Ona and his parents, as well as his myriad lists of Guinness record-holders.This is a special book, one which dwells not on surprising plot twists but rather on pure emotion. You may know where Wood will take her characters, but you savor the journey anyway, and if you're like me, you may tear up (at the very least) a time or two.See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "☮Karen", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/1076079-karen", "userReview": "Book club read #6, May 2017.Outstanding characterizations sparkle and shine in this heartwarming book about second chances. An eleven year old Boy Scout has met a sudden end, but lives on through his journals and tape recordings of 104 year old Ona Vitkus. His duty to help her around the house and to try to get Ona into the Guinness book of records was to end soon too, but is taken up by his guilt - laden father Quinn. Quinn and Ona end up helping each other more than anyone could have predicted. This touches on themes of grief, friendship, family, music, aging (of course), and our obligations to and acceptance of our fellow human beings. I listened to the audio and had the book close by for clarification of some things, since this will be discussed later in book club."}, {"userName": "Hilary", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/42315986-hilary", "userReview": "4.5 stars rounded up. An 11 yr old boy scout comes to help a 104 yr old woman. Over a 10 week period of Saturday mornings a wonderful friendship grows between them. The boy records Ona talking about her life on a dicta phone. He turns off the tape to ask questions and by reading her side of the conversation you can fill in his voice. The book is interspersed with guiness book of records facts relevant to the story, these records were an interest of the boy, and his hope to imortalise Ona. Lovely characters."}, {"userName": "Melissa Crytzer Fry", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/3857699-melissa-crytzer-fry", "userReview": "--4.5 to 4.75--I thoroughly enjoyed this book – from the spunky 104-year-old Ona Vitkus and the young boy, so clearly different from his peers – to the physical structure of the book, which included scenes, as well as taped interviews of the woman as she responded to the boy’s questions, plus various lists of world record facts. The parents of the boy (whose name we never learn – making him that much more ethereal), Quinn and Belle, are also well-drawn, flawed characters.Ona and the boy are so thoroughly characterized with incredible language:Ona, when viewing an elderly World Record holder: She looked at the woman’s picture again – taken on the poor thing’s one-hundred-twentieth birthday. “That face could halt an anvil in mid-drop,” she muttered.Ona’s observations about the Boy: … His hopping around the kitchen last week had rattled her. He didn’t move the way other children moved – he carried a marionette-ish precision in his wrists and shoulders – and it had made her feel sorry for him.Monica Wood’s writing is assured and lovely, and Ona’s observations will frequently have you laughing out loud. The skill with which Wood writes the one-sided responses on the tapes is mesmerizing, and her knowledge of music is laudable as well. In the end, this is a tender upmarket-to-literary story about friendship, love, forgiveness, the things that inspire us to dream and the power of harnessing those dreams. It’s also a story about the impact a single person can have on a life. It was the perfect read for me on my treadmill – transporting me to a different world filled with heartache, happiness, love and discovery. Also a bit of a surprise was the mention of a genetic rarity, which my mother actually has."}, {"userName": "Marialyce", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "This was a lovely story of love lost, found, and regained. It was a story of how no matter what age you are, one can always find what is needed to make your life worthwhile and whole again. \"“At times, we are the bridge that allows another to re-enter the world after a loss. Don't mistake it for more or its beauty may be lost.”― Danielle Pierre"}, {"userName": "Gary", "userReviewDate": "Dec 03, 2015", "userURL": "http://www.goodreads.com/user/show/15055195-gary", "userReview": "I agreed to read this book when I received an email off the publisher with a brief description of this novel. The write up and the subsequent reviews painted a fabulous picture of a novel not to be missed, so I eagerly looked forward to reading this book.It would be unfair to say the book was not worth the read but I did feel a little let down after reading about it previously. What I got was a well written novel that touched the heart strings as expected but didn't deliver the exceptional novel I hoped for.The book is a story of an unlikely friendship, between a woman of 104 and the world-records-obsessed eleven-year-old boy tasked with doing odd jobs around her decaying property so that he can earn a scouting badge.104 year old Ona discovers an unexpected rapport with the young scout and they become great friends.Then one week he doesn't show up. He has died unexpectedly and His absent father, Quinn is sent by his ex wife to complete the young scouts tasks. Through Ona the father discovers the love of the son he barely knew. I would like to thank Net Galley and Headline for supplying me with a copy of 'The One in a million boy' in exchange for a honest review."}, {"userName": "Connie", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "\"The boy\", an eleven year old Boy Scout, is helping 104 year old Ona Vitkus fill her bird feeders and do some yard work. He's intelligent and direct, but a little different (suggesting Aspergers, but not identified). He loves to divide tasks into ten parts, and is fascinated by the Guiness Book of World Records. Ona is charmed by the boy and shows him magic tricks. He gives her a goal in life by suggesting that she go after the world record of the oldest licensed driver to achieve immortality. He also helps her record her life history as a school project. Ona, a Lithuanian immigrant, tells him secrets that she had buried for years.We find out in the first few pages that the boy had died unexpectedly, and his father, a guitarist named Quinn, came to complete his son's obligation to Ona. Quinn had been on tour with bands for much of his son's life, and never really connected to him. The boy did not understand the nuances of the music his father loved, but loves the songs of the birds at Miss Ona's house. Quinn feels his son's presence at Ona's, and sees another side of the boy through Ona's eyes.While Ona and the boy's parents take a road trip, their memories of the boy forge a connection between the three travelers. Their lives are revealed, layer by layer, in the coming days. A strong friendship develops between Quinn and Ona, a curmudgeon with a soft heart, a dry wit, and an underlying vulnerability. People don't have to be related to feel like family. This was one of my favorite books this year--a story that is quirky and heartwarming, without being saccharine."}, {"userName": "Carolyn", "userReviewDate": "Apr 15, 2016", "userURL": "http://www.goodreads.com/user/show/19559507-carolyn", "userReview": "This is a lovely, gentle novel about the relationship between a 104 year old woman, an 11 year old boy and his often absent musician father. Ona Vitkus, born in Lithuania in 1900 lives a lonely life in her empty house in Portland, Maine. Every Saturday the local Scoutmaster drops off a boy scout to help out with odd jobs. Mostly Ona finds the boys quiet and shy, until one day a very different boy turns up who is also a bit of a misfit in this modern world. He is fascinated with her age and gradually through getting her to talk about her life they become friends. One day the boy's father Quinn turns up in his place to do his Saturday morning chores. Separated from his family, he has never really understood his son and what makes him tick but starts to get an inkling of what he's missed from the relationship his son has forged with Ona.I loved the way Monica Wood has written this novel with the story interspersed with lists of Guiness Book records and tape recordings on Ona's story. Her prose is wonderful and she has written a beautiful story that touches on all the joys and grief of living - birth, marriage, love, friendship, loss and aging. It's one told with humour and affection for her quirky characters who through their bonds teach each other to stop living in the shadows and grab on to what life has to offer. Highly recommended."}, {"userName": "Donna", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "If I'm considering this book as a whole, and being picky, this would be 3 stars. However, I'm going with 4, because of the emotional response this book created in me. This was a sweet story that showed human kindness and triumph. Truly, the characters were given sour lemons but ended up making lemonade. It had some great overall messages. Okay, so it was a little sappy. The younger more cynical me, would have docked stars for that, but maybe I'm getting soft with age because I liked this."}, {"userName": "Karen", "userReviewDate": "Feb 15, 2016", "userURL": "http://www.goodreads.com/user/show/3060349-karen", "userReview": "A very special boy whose life was cut short at the age of 11 made a substantial impact on people he left behind, including the boy’s largely absent father, Quinn, and a 104-year-old woman named Miss Ona Vitkus. The “one-in-a-million” boy was tasked with doing chores for Ona as a Boy Scout project. After his death, Quinn pledges to continue helping Miss Vitkus, a promise he makes to try and compensate for his failings as a father. The two form an unlikely friendship and their journey toward healing and self-discovery make for an uplifting story.I especially liked the inclusion of the boy’s taped recordings of Ona’s life memories, which are interspersed in ten parts. The questions he asks are not included, only Ona’s answers. This is so cleverly done that I found myself especially looking forward to those sections, along with the peppered-in Guinness World Record lists that the boy was so obsessed with. The author explores relationships and love in a unique and gratifying way."}, {"userName": "Dannii Elle", "userReviewDate": "Jan 10, 2016", "userURL": "http://www.goodreads.com/user/show/44487975-dannii-elle", "userReview": "I received this book from Goodreads Giveaways. This has in no way impacted my opinion of the book. Thank you to the author, Monica Wood, and the publisher, Headline Review, for the opportunity.This was one of the most beautiful and heart-warming tales I have ever read. The entire story, and the characters therein, are haunted by the memory of a deceased child and their actions are due, in-part, to how his loss has affected them and how they attempt to cope with their grief. This unnamed child can be said to be the main character of the tale, as we learn so much about him through the adults left behind after his untimely demise.This book is heartbreaking, no doubt about it, but there is beauty there too that alleviates the sadness and makes this a book about growth, personal discovery and how we view both ourselves and others. This has altered my opinion on so many things and I feel I have left this book with a hopeful promise to become a more caring, compassionate and attentive human being. This touched on so many wistful subjects and made this a book that the reader too could learn from: I know I did!"}, {"userName": "Claire Robinson", "userReviewDate": "Mar 19, 2016", "userURL": "http://www.goodreads.com/user/show/14026987-claire-robinson", "userReview": "3.5 - \"Start counting.\" Stars.I will be honest and say that after reading the prequel novella to this book A Woman in a Million, I wasn’t 100% certain that I was going to get on with the authors writing style. But The One-in-a-Million Boy was a really unusual and intriguing read.Miss Ona Vitkus has lead a long and varied life, the book is basically the retelling of it through different mediums. You are given her early years and mid life adventures through the tape recordings of the Boy. And what begins as a child doing good deeds for an elderly woman, develops into so much more as an unlikely friendship grows between them on his weekly visits, flashbacks of her memories, and her retelling certain incidents in the course of her interactions with other characters in the story. \nShe’s no twinkly old gal in a gingham apron.\nBut those visits come to an abrupt halt, and Ona is left wondering if the boy is as flaky as all of the other children who have been tasked with giving her assistance in the past. That is until two weeks after his last visit, the boy’s father; Quinn turns up at the allotted time, and on the required day to fulfill his son’s obligations over the forthcoming weeks, something he can no longer do himself.\"He was made of magic.\"What follows is a journey of grief and self-discovery, guilt and acceptance, letting the past go, and making plans for the future. Mainly told from Ona and Quinn’s points of view, this is a tale of an unexpected allegiance that grows from a mutual and wholly unexpected loss. Both are quite complex characters, the Ona of now, is a different Ona to the one you discover over the course of the book as her hundred odd years of living are covered, this is a woman that has lived through all of the important world events of the last century, and you get her own take on a lot of them and their impact on her life in general as the story progresses.\"People don’t write their own endings.\"Quinn also spends a large amount of time through the book reflecting on his past as well, mistakes he made with Belle, his son’s mother, the lack of any meaningful time that he feels he felt with his son. Acknowledging that in truth he really didn’t understand him as a little boy, due to his unique personality and interests being so much different from his own. \"I did fall in love with him… But not until after he was gone.\"This was such an unusual and diverse story. Each character you come into contact with through Ona and Quinn, very much has a part to play in it the overall flow, the timeline does move back and forwards somewhat but it wasn’t a struggle to keep up with what was going on in the plot at any point. I really liked the characters, and the writer has a very engaging writing style in that everything was vividly described and at points in very unique ways, but for all that I also found it felt a little blunt in parts, and totally lacking two very important things for me and that was feelings and emotions. The delivery of the whole book for want of a better word was dry, and while entertaining I really missed the emotional attachment I would normally expect to form with characters that have experienced such an upsetting event, but it wasn’t until the closing chapters that I really felt anything from or for any of them, for almost the whole book I felt like I was on the outside looking in, rather than being pulled into the fabric of the story.I would certainly look too read more from Monica in the future though, as this is certainly a book I won’t forget reading in a hurry, and that for me, highlights just how well put together it was. ARC generously provided via Netgalley, and it was my pleasure to provide the above honest review."}, {"userName": "Marianne", "userReviewDate": "Jun 12, 2016", "userURL": "http://www.goodreads.com/user/show/5067228-marianne", "userReview": "“He had not loved his son enough. This knowledge lived like a malignancy on his heart. He wanted to believe that the boy, in a future now lost and impossible, would have forgiven him, would have taken their blundering history and found its logic and shaped it into items on a list. And that this – eating cake with Miss Ona Vitkus – would be one of those items”The One-In-A-Million Boy is the fourth novel by American author, Monica Wood. When Quinn Porter turns up at the home of Miss Ona Vitkus on Sibley Avenue in Portland, Maine, he does so to fulfil a duty his eleven-year-old son had taken on. As part of Scout Troupe 23, the boy (whose name is never mentioned) had been doing yard work, filling the bird feeders, whatever needed to be done for the old lady. But now could not.Quinn plans to do his duty for the required seven Saturdays and then move on. But in Ona’s house, he finds traces of the son he was unable to connect with in life. “Quinn had never wanted children, had been an awkward, largely absent father; and now, in the wake of the boy’s death, he was left with neither the ice-smooth paralysis of shock, not the crystalline focus of grief, but rather with a heart-swelling package of murky and miserable ironies”Miss Ona Vitkus is old; one hundred and four years old, to be exact. “Her stockinged legs looked like rake handles jammed into small black shoes”. And yet, somehow, this old lady does connect with the boy: “He waited. With the unruffled patience of a cat. This did not seem like a deficiency…She regarded him carefully; maybe it was the uniform, which could have been fifty years old; maybe it was his throwback manners; or the sea gray of his irises, which suggested an age and wisdom he could not possibly possess”She finds she trusts him enough to consent to the recording of her memories: “He began with a question of his own, passed across the table in immaculate penmanship. His handmade questions, the product of silent forethought, invariably unhooked a shut gate, leaving her to brace against an onrush of memory. The surprise was how little she minded”“She felt suddenly fond of her unremarkable life, that humdrum necklace of imitation pearls with the occasional glint of the real thing. The boy kept glancing at her as he would at a prize heifer, and she felt like one: round and healthy, clean and well brushed, a surefire winner”. Wood’s format is original: Divided into five parts, each prefaced with a Lithuanian word, she uses a combination of straight narrative, transcripts of tape recordings and World Record Lists (which may seem a little strange, but is quite effective) to tell the far-from-ordinary life story of Miss Ona Vitkus, but also to reveal events in the life of Quinn, the boy, and his mother, Belle.Wood’s descriptive prose is exquisite: “Mrs Japan and Mrs Romania had unpronounceable names, the former free-floating with vowels, the latter fortressed by consonants” and “She’s tucked the boy safely offstage, in a species of Limbo. He was less than real but more, much more, than a memory: a voice speaking from the wings, an impression of living stillness” are examples.Wood’s characters are appealing for all their quirks and flaws, especially the boy: “Belle managed something like a laugh despite her sorrow, for the boy’s syntactical oddities had always pleased her. He’d read obsessively – instruction manuals, record books, novels far too old for him – picking up linguistic baubles like a crow mining a roadside”.Wood touches on grief, on ageing, on obsessive behaviour, on responsibility, on the love between a parent and a child. Her ending is bound to bring a lump to the throat of the most cynical reader. Funny and poignant, this is a brilliant read."}, {"userName": "Sherri Thacker", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/36561653-sherri-thacker", "userReview": "Just a fabulous book from start to finish!!! Just fabulous!!!"}, {"userName": "Ariel ", "userReviewDate": "Jun 28, 2016", "userURL": "http://www.goodreads.com/user/show/13908931-ariel", "userReview": "Miss Ona Vitkus is one hundred and four years old. She is not the oldest living person in the world but she has a feasible shot at snapping up the Guiness World Record title if she can stick around for another two decades. A fact discovered with great enthusiasm by the keen eleven year old boy that marched up to her door in a scout uniform one rainy, thawing March day. Ona Vitkus hasn't had much luck with the scouts that appear throughout the year at the behest of scoutmaster Ted Ledbetter but there is something different about this boy, something familiar that warms between the two of them as an unlikely friendship is struck. A Lithuanian immigrant brought to America at the age of 4 by her parents, Ona has led a kaleidoscopic life. She regales The Boy of the intense eyes and infinite questions with her experiences and some impressive card tricks. As the weeks pass there is a sense of breath rushing back in to not only Ona's present days but also a well worn and faded past. The One-in-a-Million Boy offers up a wealth of empathic introspection. Monica Wood delves into family, friendship, loss, memory, and more with a fluid style that provides quirk and sparks a sustaining interest. I believe that it is easy to write loss, in the same way it's easy to write love - they are universal human experiences, they grasp at everyone in some way or another. However, it takes skill to make the universal personal, to provoke identifying emotion in a reader. Wood possesses this skill and employs it poignantly. To a point at which a novel that could have been simply strung together by modern quirks becomes a moving read.I enjoyed Wood's One-in-a-Million though there were parts I wanted more from. What impressed me most and caused me to lean towards a 3.5 to 4 star rating was Wood's artistic prowess in relaying character interaction. There is so much to be gleaned about each character's personality as you read their conversations, so much to connect with. As an example, the interview between Ona and The Boy. Though this is a large aspect of their relationship throughout the book, it is one sided. Ona answers questions that The Boy has written down yet you still get a clear picture of The Boy as the interview progresses. He becomes such a relatable and fleshed out character in these passages. Whether for artistic ability or for the emotional experience, I would recommend this book as an interesting, if quick, read. I'd also recommend that a tissue or two be handy along the way. I'd like to thank NetGalley and Houghton Mifflin Harcourt for this ARC. I'm grateful for the chance to read and review this novel as well as the chance to be introduced to Monica Woods' writing."}], "description": "The story of your life never starts at the beginning. Don't they teach you anything at school? So says 104-year-old Ona to the 11-year-old boy who's been sent to help her out every Saturday morning. As he refills the bird feeders and tidies the garden shed, Ona tells him about her long life, from first love to second chances. Soon she's confessing secrets she has kept hidden for decades. One Saturday, the boy doesn't show up. Ona starts to think he's not so special after all, but then his father arrives on her doorstep, determined to finish his son's good deed. The boy's mother is not so far behind. Ona is set to discover that the world can surprise us at any age, and that sometimes sharing a loss is the only way to find ourselves again.   “Readers won’t be able to resist falling for Ona … The conclusion will leave them smiling through their tears.”—Shelf Awareness ​“Poignant … There is much to enjoy in this heartfelt tale of love, loss, and friendship.”—Express “A must-read book … Whimsical and bittersweet.”—Good Housekeeping", "title": "The One-in-a-Million Boy", "url": "https://www.goodreads.com/book/show/33560321-the-one-in-a-million-boy", "average": 4.11, "cover": "https://images.gr-assets.com/books/1482627091l/33560321.jpg", "reviews": 2881, "authors": [{"url": "https://www.goodreads.com/author/show/80719.Monica_Wood", "name": "Monica Wood"}], "type": ["Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/33560321-the-one-in-a-million-boy", "http://www.goodreads.com/book/show/25862989-the-one-in-a-million-boy", "http://www.goodreads.com/book/show/34339760-the-one-in-a-million-boy", "http://www.goodreads.com/book/show/25862990-the-one-in-a-million-boy", "http://www.goodreads.com/book/show/25897890-the-one-in-a-million-boy", "http://www.goodreads.com/book/show/28961470-the-one-in-a-million-boy", "http://www.goodreads.com/book/show/29758030-the-one-in-a-million-boy", "http://www.goodreads.com/book/show/13202093-when-we-were-the-kennedys", "http://www.goodreads.com/book/show/139605.Any_Bitter_Thing", "http://www.goodreads.com/book/show/139606.The_Pocket_Muse", "http://www.goodreads.com/book/show/139603.Description", "http://www.goodreads.com/book/show/139609.Ernie_s_Ark"]}