{"ratings": 14753, "userreviews": [{"userName": "Sara Bow", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/14391138-sara-bow", "userReview": "Wunderschöne Geschichte ❤️"}, {"userName": "Anica", "userReviewDate": "Jul 07, 2011", "userURL": "http://www.goodreads.com/user/show/136120-anica", "userReview": "[Xavier, who wasn't dead at all. (hide spoiler)]"}, {"userName": "Tanja Berg", "userReviewDate": "Aug 20, 2011", "userURL": "http://www.goodreads.com/user/show/5935491-tanja-berg", "userReview": "This novel is so bad it is a shame to the written word. I cannot believe I read through 577 pages of clichées, stick figures, stupid plot and uninteresting intrigue. I should have left it at page 80, with \"Oh Julia, I'll never forget until my dying day, the moment I walked into that Magnolia bedroom and saw her for the first time\". That should have been a hint that there were only worse things to come.The story is that of Julia, who is in deep morning after the loss of husband and child. She's back in her childhood surroundings, near the magnificient Wharton Hall. She slowly returns to life and finds out about the secrets that tie the heir of Wharton Hall to her own family. Somewhere in this Julia falls in love with the current Lord of Wharton Hall, Kit. Predictable from the description of their first meeting as children.This book does not have a single redeeming quality. However, when Julia's dead husband turns out to not be so dead after all - having survived the train crash - that took the prize as the worst plot twist to ever come to print. This is not a book that will enjoy the comfort of my shelves, it will be thrown into the paper recycling bin. I never throw books away, ever, but \"Hothouse Flower\" deserves nothing better than a new life as toilet paper."}, {"userName": "Diana Solito", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/40743745-diana-solito", "userReview": "Eine wunderschöne Familiensaga!Sehr bewegend, sehr emotional und traurig schön, und der Funken Hoffnung verglimmt an keiner Stelle dieses Buches! ❤"}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Mar 26, 2013", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "I've read a lot of contemporary chick lit in my day, I only wished I had saved myself the time and money and had just gone straight to reading The Orchid House instead, since the author kindly read all those books for me, and then conveniently condensed every single modern-woman literature trope into one book. Elin Hildebrand? Audrey Niffenegger? Kristin Hannah? Nah. Save yourself hundreds of books and hundreds of dollars, you will find them all condensed here.Let's see, off the top of my head, ZEE TROPES.1. Modern-day famous pianist barely subsisting and starving her way through recovery from a hinted-at horrible tragedy (which isn't actually told until 1/4 of the way through the book after I had ripped about half the hair off my head in frustration)2. Burgeoning romantic relationship with modern-day rake with a heart who also happens to be an aristocrat with a beautiful ancestral home3. Well-meaning older sister, the hustle-and-bustle perfect family type, with 2.5 kids, a house with a picket fence, and a gruff and friendly husband4. Re-acquaintance with old family. Oh, grandma? Totally forgot she existed, but now that she's here, time for old family secrets to be revealed!!!!!! She knows everything, and I mean EVERYTHING. Details of her lady's bedroom secrets? Spilled.5. Ambiguously gay husband6. Man recovers from illness in Thailand, falls in TWOO WUV with 17-year old Thai girl. Bonks her, swears up and down he'll leave his wife for her. Does he? Dun dun duuuuuuun.7. Secret adoptions8. Secret loves9. Secret adoptions (2 is better than 1)10. A Frenchman who is so over the top, this is how I imagined him:And that's just off the top of my head. I think I had more fun keeping track of the tropes than reading the book itself. It took me a month to read this, getting through pages at a time. It was just that unabsorbing. If you must read this book, read it for the amusement value, there is little else to be had here."}, {"userName": "Meg - A Bookish Affair", "userReviewDate": "Apr 15, 2012", "userURL": "http://www.goodreads.com/user/show/1132408-meg---a-bookish-affair", "userReview": "On the whole, I really liked this book. I questioned a couple things (I'll get into that) but as a whole, I really liked this historical fiction book. Julia has just suffered a great loss in her life and has gone back to see her grandmother who begins telling her stories of the people who once lived in a great house where Julia's grandmother worked. As with many of these stories that take place in two time periods, I liked the old one a lot better. I loved seeing how the mystery of Julia's family came together. The historical part of the book takes place during World War II in both England and Thailand. I liked how the story was told by Julia's grandmother as sort of an omniscient point of view. The part of the story set in Thailand was definitely my favorite. It's a love story between two people who deeply care for each other and holds the secret to Julia's existence.Now here's where I had some issues with the book. I had some trouble understanding the motives behind some of the characters. First, Henry, the heir to Wharton House, is sort of horrible. He leads Olivia on and traps her in a loveless marriage and only seems to be looking out for himself. He doesn't seem to understand why what he's doing is wrong and he sort of manipulates Julia's grandfather to get what he wants. Even though I liked the love story between Henry and Lidia, it made it a little hard to fully support their love story as Henry was just generally horrible.The other issue that I had was everything that happened with Julia's personal life. I don't want to give anything away so excuse me for being vague. First, it just seemed a crazy that it would happen in the first place. I almost wished that it would have been left out of the book because aside from making Julia really sad, I don't think it added anything to the book.I still really liked this book and would definitely recommend it even with these couple of things that I didn't care for.Bottom line: This is a great historical fiction!"}, {"userName": "Oda", "userReviewDate": "Aug 21, 2012", "userURL": "http://www.goodreads.com/user/show/4575782-oda", "userReview": "Lucinda Riley's endings are disgustingly cheesy, with everything being more than a little too perfect. Especially her characters. Here with her famous pianist (tormented by recent loss), and recently with her extremely gifted artist (tormented by recent loss) and ballerinas (also tormented by recent loss) of \"The Girl on the Cliff\". Riley clearly lives in a dream where all the good people get to live off of their art. She's part of a wave of authors that I feel are generally trying to be Kate Morton, just without the debth. Their books aren't a far step away from the single title historical romance paperbacks I sometimes get at the grocery store. And what's up with this sub genre of historical romance that is so popular right now? Tragic events happen between 1900 and 1940, dual-time narrative with flashbacks and histories of people of the past is intertwined and run paralell with the story of some present day woman who is having a hard time but finally finds love. The reader and the present time protagonist(s) get to unravel all the old secrets together. Blah blah blah.That being said... It is a page-turner, and I like a light read now and then. When I wasn't being distracted by it's shallowness or annoyed by all the unlikely happenstances in the plot, it was an enjoyable read. I just feel that these books are trying to be something better and more serious than they are. Don't expect anything life-changing."}, {"userName": "Srhbth", "userReviewDate": "Aug 19, 2012", "userURL": "http://www.goodreads.com/user/show/12024667-srhbth", "userReview": "Book was displayed in a bookstore as \"for fans of Downton Abbey\" - I've never watched the show but everyone has told me I'll love it. In this case, I regret wasting my time. I feel like a fool because I kept slogging on until the end, despite early and plentiful signs that it wasn't going to be what I hoped; I admit I was interested enough in the plot to just read a little further... a little further... But it just could have been so much better.Characters just never come alive and are hard to care about or believe in. Their speech is clumsy and unrealistic.Action is described thoroughly and clearly, but not elegantly or with any spark of liveliness.Language is trite (I literally threw the book down when one character decided \"she could not allow herself to love again\"); and as though the author doesn't trust that the dialogue between characters conveys the proper ideas, each exchange is followed by a few lines redundantly summarizing what everyone meant and felt.Plot twists range from predictable to absolutely ridiculous. One in particular toward the end was just totally absurd, negating whatever redeeming qualities the novel had maintained up to that point.Not recommended."}, {"userName": "LindyLouMac", "userReviewDate": "Jan 21, 2013", "userURL": "http://www.goodreads.com/user/show/117720-lindyloumac", "userReview": "It is worth noting that Hothouse Flower was republished in 2012 with the title of The Orchid House just so that any confusion with readers thinking it might be a different story, when this is not the case are cleared up straight away. Although the central theme of a family saga set in a country house spanning from the 1930's to the present day is far from an original one, this one is different. It has such a multi layered story to tell us with so many stirring and compelling love stories, secrets and surprises to share I stayed awake far too late at night reading this as I was engrossed. Extremely well written the story flows beautifully, period and locations are credibly described and the characters feel realistic. The situations that they face are ones that we are all able to empathise with from generation to generation. Certainly one of the best family sagas of the genre that I have read recently.At the centre of the story is the female protagonist Julia Wharton who growing up had spent many happy hours in the heated greenhouses of the Wharton Park estate where her grandfather tended the orchids. It seems only natural therefore for her to return to the area when she needs to recover from a devastating personal tragedy. It is whilst coming to terms with her grief that she discovers quite by chance a family secret that will cause even more heartache. The story of the family history is related to Julia by her grandmother and stretches back to the nineteen forties when Harry Crawford the heir to the estate marries his bride Olivia before the second world war separates them. The results of this enforced separation will be felt for generations to come as this poignant and atmospheric story takes us from war torn Europe to the present day alternating between Norfolk and Thailand. With plenty of passion and twists and turns along the way I highly recommend this to all fans of the genre.http://lindyloumacbookreviews.blogspo..."}, {"userName": "Connie (Ava Catherine)", "userReviewDate": "Jun 22, 2012", "userURL": "http://www.goodreads.com/user/show/8773670-connie-ava-catherine", "userReview": "I love these lines from the book: We are sharing a moment in time. Like the universe, there is no beginning or end. We just are.This is what Kit told Julia when they were at Wharton Park looking at the stars and everything seemed to be perfect for them. Of course, Julia was still grieving for her son and husband, but Kit was helping her. Then she found out that Xavier had done something terrible, and it sent her reeling, causing her to wonder if she and Kit could ever make it together. Then a true miracle happens when she finds a lost ancestor, someone of whom Julia had been unaware of. This ancestor helps Julia understand love and pain. I really enjoyed this book although the plot line is implausible. It is really very interesting, so I forgive the author for the stretch in plausibility.I like the way the author threads the two timelines together so seamlessly. It is fine look at family relationships and at the long term effects of family secrets."}, {"userName": "Janice", "userReviewDate": "Jan 03, 2012", "userURL": "http://www.goodreads.com/user/show/2513987-janice", "userReview": "I would have rated this book 3.5 stars, if half stars were allowed on Goodreads. There is truth about the old adage, \"less is more\". I was happily reading along when one extra twist in the story punted it firmly into the realm of melodrama. Unfortunately, there were a couple more twists to come. Lucinda Riley, you were doing just fine until you started to embellish too much.The story had promise. I loved the fable told at the beginning of the novel and how it played out throughout the story. While I enjoyed the story, I would have enjoyed it more if the twists and turns were pared down in favour of better character development."}, {"userName": "Jaime Boler", "userReviewDate": "Feb 06, 2012", "userURL": "http://www.goodreads.com/user/show/6103494-jaime-boler", "userReview": "The Baker's Daughter by Sarah McCoy (Random House; 304 pages; $23).The Orchid House by Lucinda Riley (Simon and Schuster; 464 pages; $15).\tOver the past few years, the book world has witnessed a rising trend in which a present-day protagonist, grappling with her own problems, stumbles upon an intriguing past mystery. Only when she solves the puzzle can she then tackle what is wrong in her own life. Curiously, many of said novels have ties to World War II. Recent notable books in this genre are Those Who Save Us by Jenna Blum (2005); Sarah's Key by Tatiana de Rosnay (2007); The House at Riverton by Kate Morton (2008); and The Madonnas of Leningrad by Debra Dean (2009). \tTwo new novels are a welcome addition to this fairly recent development: The Baker's Daughter by Sarah McCoy and The Orchid House by Lucinda Riley. Both books have a similar feel yet are very distinctive. Both feature strong, memorable heroines and move from our own time into a past we cannot even begin to contemplate. Yet these women must; if they do not, then they will never get on with their lives.\tIn Sarah McCoy's The Baker's Daughter, the main character is Reba Adams, a writer who lives in El Paso, Texas. Reba dreams of going to California but has not capitalized on her vision yet: \"I thought I'd start here and eventually make my way to California—L.A., Santa Barbara, San Francisco.\" She has yet to leave Texas, however. \tSeveral things stand in Reba's way. She is engaged to Riki Chavez, an agent with the U.S. Border Patrol, but Reba is reluctant to commit. She wears her engagement ring on a chain around her neck; she is not ready to wear it on her finger, and she may never be. Her parents had a difficult marriage. Vietnam affected her father so badly that he later committed suicide. The tragedy led Reba to flee her Virginia home when she was old enough, and she has only minimal contact with her mother and sister. She is unsure of Riki and of their relationship; most of all, Reba is unsure of herself.\tReba is like the border town in which she resides, \"stuck in between\" where she is and where she is headed. She is a very flawed, even damaged, character, making her a very relatable and very real protagonist. Like most of us, she does not have it all together. Reba is far from perfect.\tAn assignment leads Reba to a German bakery where she wants to interview an elderly woman on Christmas traditions around the world. The old woman, Elsie Meriwether, the owner of Elsie's German Bakery, is uncooperative. With a deadline fast approaching, Reba spends more and more time with Elsie and her daughter, Jane. Soon, though, Reba finds she likes visiting the women. She opens up to them. The feeling is mutual. Elsie opens up to Reba not about German Christmas traditions but about a Christmas in 1944, one that changed everything.\tHere is where The Baker's Daughter truly shines. Elsie and her parents run a bakery in Garmisch, Germany, a city where Gestapo soldiers raid houses and residents fear for their lives in the worst days of World War II. McCoy renders the bakery especially well. I could smell, see, and taste the breads and sweet treats. My mouth still waters thinking about them. Goodies aside, the bakers move this part of the story. At seventeen, Elsie is being courted by an SS officer who is closer in age to her father than to her. She does not love him. Rather, Elsie adores Hollywood movies and is more concerned with keeping a secret that could get her and her family killed. \tMcCoy has done meticulous research for The Baker's Daughter. The best example of her diligence is Elsie's older sister, Hazel, a participant in the Lebensborn Program. This was part of Germany experiment to perpetuate the Aryan race by producing blond-haired, blue-eyed German children with high morals, exceptional intelligence, and an unbreakable bond with the state. Hazel, in effect, had babies for Germany and had to give them up. Lebensborn was real, and McCoy accurately portrays this chapter in German history.\tMcCoy, little by little, never too much too soon, reveals what happens to Elsie and her family. Elsie's story transforms Reba in ways readers will cheer. Thus, Elsie and her family take on the role of helper characters as they steer Reba back on the road to life.\tI love The Baker's Daughter and feel the novel is even better than Sarah's Key. McCoy effectively draws a comparison between anti-Semitism and anti-immigrant (read: anti-Mexican) sentiment. She uses Riki to do this. Rather than being heavy-handed and didactic, it works rather well.\tWhile characters propel The Baker's Daughter, it is the setting that drives Lucinda Riley's The Orchid House, already a bestseller in Europe. The true star of Riley's novel is Wharton Park, a majestic British estate \"comprising of a thousand acres of fertile farmland\" that has been in the Crawford family for three hundred years. The house, though, is not as grand as it once was. Running the estate requires a lot of money, money the present heir, Kitt, simply does not have.\tWharton Park holds a special place in the heart of Julia Forrester, a world-renowned concert pianist. As a child, Julia spent time there since her grandparents were long-time employees of the Crawfords and lived in a cottage on the grounds of the manor. Her grandfather grew exotic orchids and made Wharton Park famous for the rare flowers; her grandmother, Elsie, was a lady's maid. Their devotion to the manor parallels that of the servants of Downton Abbey for the Granthams. Julia's summers at the estate were dreamlike: \"The tranquility and warmth of the hothouses—sitting snugly in the corner of the kitchen garden, sheltered against the cruel winds that blew in from the North Sea during the winter—stayed in her memory all year.\" \tA horrible tragedy makes Julia remember Wharton Park all the more. Her husband, Xavier, and their son, Gabriel, were killed in a car accident. A forest fire started as a result. Their deaths have understandably broken Julia. She is a changed woman unable to play the music she played the night of the catastrophe. She seeks comfort in a cottage near the sea in Norfolk. But Wharton Park beckons to her. It is an idyllic place where she so desperately needs solace, \"a place of peace.\" Julia recalls wistfully that at Wharton Park, \"nothing changed.\" \"Alarms and timetables weren't in charge, it was nature dictating the rhythm.\" \tThat earlier, easier time appeals to Julia so much that she returns to Wharton Park for an estate sale. While there, she runs into Kitt Crawford, the new heir. They had briefly met as children when Julia played his late uncle's piano but have had no contact since then. A friendship develops with the promise of more. Kitt is renovating the cottage her grandparents had called home. In the midst of remodeling, he discovers an old diary of a man imprisoned in Thailand during World War II. Kitt mistakenly assumes the diary is the property of Julia's grandfather. Her grandmother, though, reveals the diary belonged to the deceased Lord Crawford, Kitt's uncle, who, together with Julia's grandfather, was a prisoner. \tJulia finally comes back to life as her grandmother tells her events before and after the war. This is my favorite part of The Orchid House. The lives of two young couples take shape: William and Elsie and Harry and Olivia. Riley's real focus, though, is on Olivia and Harry. She marries Harry only to find him kissing another man. Devastated, she continues on with her unhappy marriage because that is what was done back then. The outbreak of war sends both Harry and William to Thailand, where they are later captured. After the war, William returns to England before his master; Harry suffers more sickness and thus takes longer to recuperate. While in Thailand, Harry falls in love with a young Thai woman named Lidia. He plans to divorce his wife and marry Lidia. However, after he returns to Wharton Park, he must fulfill his obligations to his wife, his family, and to the estate. Harry writes to her. When his letters go unanswered, he sends his trusted servant, William, to Thailand. William's journey changes everyone's lives forever. \tJust when I think Julia and Kitt will live in bliss, Riley throws several curveballs. She does this to mix things up. First, we learn that Julia and Kitt are kissing cousins, which I finally decided to go along with. Second, Julia's husband rises from the dead. This is difficult to swallow. I could not wait for Julia to leave the horrible cad. \tRiley reminds me of Kate Morton, and I also see traces of Downton Abbey. If you are a fan of either, I recommend this novel. It is easy to understand how The Orchid House took Europe by storm. I predict the same will happen in the United States.\tThe Baker's Daughter is a character-driven novel, while The Orchid House is propelled by its setting. In that sense, they are very different. Each has a distinctive voice and feel. Yet both feature heroines stuck in a certain place in life, desperate, tragic, or even both. Neither protagonist can continue on the path she is on. She must find a new road. A past mystery or secret is the only thing that can propel the women forward. A quest is what each must undergo. Solving the riddle means another chance at happiness and at life. Perhaps that is why these novels appeal so. Second chances are a universal desire."}, {"userName": "Harmonyofbooks", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/63278313-harmonyofbooks", "userReview": "Dairenin tamamlanmış olduğunu fark etti. Kuşaklar ötesine uzanan bir hikayese herkes sonunda hayatlarında önemli bir rol oynayan Wharton Park'ta tekrar bir araya gelmişti.4,5/5🌟🌟🌟🌟🌟Yazardan Yedi Kız Kardeş kitabını okuduğumdan beri kaleminden tekrar bir kitap okumak hep aklımdaydı. Ama okumayı biraz geciktirmek istemiştim ve öyle de yaptım. Kendisinden ikinci olarak okumak istediğim asıl kitap ünlü serisinin devamıydı ama çevrilmediğini görünce biraz daha beklemeye karar vererek Orkide Evi'ni okumaya başladım. Konusunu okuduğum kadarıyla beni nasıl bir kitabın beklediğini tahmin ediyordum. İkinci kitabıyla beraber yazarın genellikle kaleminde yasak aşklara ve ikili anlatıma yer vermeyi tercih ettiğini söyleyebilirim. Bu kitabınaysa oğlunu ve kocasını bir trafik kazasında kaybeden ünlü piyanist Julia'nın büyüdüğü kasabaya dönmesi ve orada çiftliğin yeni sahibi Kit'le tanışmasını okumakla başlıyoruz. İkisi arasında adım adım yeni hisler yeşermeye başlarken Julia'nın büyükannesi Crowfard ailesiyle ilgili çok eskilere dayanan uzun bir sırrı anlatmaya karar verir. Böylece hem günümüzden hem de 1939'ların İngiltere'sine değinen hikayemizi okumaya devam ediyoruz. Harry ve Olivia'nın hikayesini okurken evlenmelerinin ardından bir yasak aşkın gerçekleşeceğini tahmin ediyordum ama bu durum öyle olsa da benim düşündüğüm gibi ilerlemeyerek yazarın beni şaşırtmasını sağladı. Geçmişte İngiltere'den Tayland'a uzanan bir hikaye, günümüzde de İngiltere ve Fransa arasında süren bir başka hikaye okuyoruz. Kitaptaki o ikili anlatımın heyecanını tabii ki çok beğendim. En büyük merak konusu ise Harry ve Olivia'nın arasında geçenlerin Julia'yı neden ilgilendirdiğiydi. Bunun cevabı da tahmin etmediğim bir şekilde ilerledi. Diğer yandan da Julia'nın Kit'e olan aşkı için büyük sınavlardan geçmesi gerekiyordu. Baştan sona gerçekten çok büyük zevk alarak, bazı yerleri bayılarak, bazı yerleri de gözlerime bir hüzün dalgası oturarak okudum. Aile sırrının arka planı çok ustaca kitaba geçmişti. İlk aşkın sarsıcı hisleri, İngiltere'deki önemli ailelerdeki varis gerekliğinin insanların nasıl hayatlarını kukla gibi ele aldığını ve bir diğer yandan da çiçeklerin güzelliğine, aslında hatıralarda nasıl keskin şekilde kalıcı kaldıklarına değinen harika bir kitaptı. Okurken yaşıyorsunuz adeta. Kitabı okurken içimdeki ufak eksiklik hissi de sanırım okuduğum bir önceki kitabı kadar bağrıma basamamış olmamdan kaynaklanıyordu. Yazarın bir diğer kitabı olan Uçurumun Kenarındaki Kız'ı okumak için sabırsızlanıyorum. Size de keyifli okumalar dilerim.."}, {"userName": "Janelovering", "userReviewDate": "Apr 03, 2011", "userURL": "http://www.goodreads.com/user/show/4782996-janelovering", "userReview": "Sorry, this was a wallbanger for me, and I only made it less than 100 pages in. Started it with such high hopes (beautiful cover, great blurb), when I got to where one sister is telling the other how old she is and about her house, dogs, husband and kids I thought 'hmmm, not sure her sister needs to be TOLD how old she (her sister) is', but gave it the benefit of the doubt. A few pages later I got to where the same sister prefaces a conversation with her father (amid an improbably perfect domestic setting) with 'As you know, Dad...' and the book hit the wall. Sorry. It came over as stilted and some of the writing seemed... I dunno...beginnerish. No idea why, probably just me and the mood I was in, and no fault of the book's at all, but even so..."}, {"userName": "Mel Usack", "userReviewDate": "Dec 09, 2015", "userURL": "http://www.goodreads.com/user/show/13339201-mel-usack", "userReview": "2.5. Very predictable. Horrible dialog. Velly?!?!? And the word \"darling\" was used 122 times ..."}, {"userName": "Christina", "userReviewDate": "Nov 19, 2012", "userURL": "http://www.goodreads.com/user/show/7067300-christina", "userReview": "General thought: I don't know what to make of this book. Lucinda Riley can truly spin a tale and frankly, after reading Kate Morton's novels, which are essentially tragedies, it's refreshing to read a story told in the same vein but with a more uplifting ending. Julia, the protagonist has just had her world thrown upside down. Devastated and mostly catatonic, she stumbles upon a mystery of the noble house she grew up by. So at this point, the story takes off. We're introduced to a bevy of characters, including Harry, Lord Crawford. Oh man, was this guy unlikeable or what? He marries this largely affable girl, Olivia, whom he hurts repeatedly. One second, he's possibly gay and is found kissing one of her male friends. No harm, no foul. It turns out he was confused and professes to Olivia that he loves her and wants to do right by her. She gives him a second chance and the reader is treated to a few paragraphs where the couple are basking in their new love. Then he goes off to war and falls in love with a 17 year old in Thailand, then makes plans to be with her and leave his wife because apparently, he never loved her. I'm sorry. He was an selfish asshole. Anyway, it turns out that Julia, remember our modern-day protagonist, is his granddaughter. Turns out, he unknowingly left the 17 year old pregnant. I think this book would have been better had Harry been more likable. In any case, as this story unveils, Julia finds love with the modern-day Lord Crawford and heals from her previous tragedy. I liked Kit, but the dialogue was...corny. Moving on, the ending was really cheesy but I did like the happy ending. If I had yet another gripe, it would be that Alicia, Julia's adopted sister, didn't get any acknowledgment from Lidia, her grandmother. After all, even though she was not related by blood, she was Jasmine's first daughter. I felt that this part was written rather poorly, after all, wasn't Jasmine herself also adopted and every bit part of her adopted family? It would seem that her birth mother would have been just as intrigued by her daughter's daughter who had known Jasmine longer. To conclude, I thoroughly enjoyed Riley's style and while it could have been better, the fact remains that I couldn't put this book down, gripes and all. Her work demonstrated a lot if promise that I immediately downloaded her second novel after having finished this one...and I'm glad I did."}, {"userName": "Carla Ford", "userReviewDate": "May 13, 2012", "userURL": "http://www.goodreads.com/user/show/2472067-carla-ford", "userReview": "This wonderful novel is an exploration of the many ways in which we are powerless, or allow ourselves to be powerless, to change the course our lives take. Sometime we have to go a certain direction out of family obligation, or we get started on a path where it is just too hard to turn back. Sometime we turn a blind eye to reality, and live in a world of not quite reality because we are afraid to face the truth. Sometimes we really have no choices, and we do the best we can with what life hands us. The Orchid House shows some of all these situations in the story of Julia Forrester, newly widowed and close to drowning in her grief over the loss of her husband and her young son. When Julia returns to her childhood home to spend some time dealing with her tragedy, she comes across old family diaries that contain stories about Julia's family that have been kept secret for many years. Through these stories, and the learning of some new family history, Julia begins to find the strength she will need to deal with her own future. This was a truly beautiful story of many different kinds of love, and it was told with such poignancy that my heart truly ached for everyone involved, and each character elicited true feelings of compassion. This was a wonderful novel, it just kept me wrapped up in the story through each twist and turn, and there were a lot of twists and turns!"}, {"userName": "Carmen", "userReviewDate": "Jan 13, 2013", "userURL": "http://www.goodreads.com/user/show/15541356-carmen", "userReview": "Me ha gustado, pero no me ha entusiasmado. Tampoco es un libro que volvería a leer... Al principio es excesivamente descriptivo, hacia la mitad del libro empiezan a suceder cosas, pero no es una historia entrañable o que emocione, o por lo menos a mi no me ha provocado este sentimiento. Encuentro que podría haber sacado mas partido a los personajes y a la historia, ha habido momentos que me he quedado con ganas de mas, me ha faltado algo... También es verdad que por el titulo y la sinopsis, me esperaba estilo kate morton, un hecho misterioso, y acontecimientos y personajes que se desarrollan alrededor de este. Por mi parte ha sido un error tener esta expectativa, por que no tiene nada que ver, hay un \"misterio\" pero es muy intutivo. También la manera que tiene la autora de unir escenas alejadas en el tiempo, o que no tienen nada que ver me han parecido forzadas, y un poco artificiales. Para mi es un libro que no está mal, pero le daría prioridad a otros."}, {"userName": "Northwestreader", "userReviewDate": "May 15, 2012", "userURL": "http://www.goodreads.com/user/show/6488126-northwestreader", "userReview": "The Orchid House is set on two continents, covers three generations, and has interesting entanglements between two families who both hail from an English country estate. The author has complicated relationships betwixt the families and draws interesting parallels between generations. While the foreshadowing of events lacked subtlety, I still found it to have an engaging story line. The dialog was definitely not reflective of how anyone I know actually speaks, but, I thought, perhaps this is how the Brits speak. I dealt with these distractions and still continued to enjoy the book. A perfect summer read—enough to hold my interest without overly taxing my brain—a pleasant way to spend a lazy weekend.And then I hit a plot twist that defies believability—it was too big of a leap for me and it just didn’t sit well. After that, everything was tied up “too neatly” and I was only too glad to get to the end of it.A promising start that didn’t end that way."}, {"userName": "Dzenana Brkic", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/10765395-dzenana-brkic", "userReview": "Another wonderful book of the genre that I really like. Two stories that are going on in the same time, one happening in the past, another now, in the present. Destinies that are connected in some way, and people who all have some relationship with each other. I enjoy these type of books, never have enough of them. They always show that, no matter what happened in the past, and no matter how much people suffered through a set of bad circumstances, present is here to bring us a better future and a happy ending. We hope and hope, while we read, that the new generation will manage to win and live with the one they love."}, {"userName": "Brittnee", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/9155803-brittnee", "userReview": "This is a hard book to rate. I really enjoyed the beginning & reading about Julia's story (as well as her sister Alicia & Kit). I felt like this book was a bit too long (50 pages or so) & the end kind of threw me, very random plot twist that felt strange. Olivia's story - break my heart why don't you? :'''''( And Harry....Dude! Really? Really!!? There is alot going on in this book."}, {"userName": "Overdramatics", "userReviewDate": "Nov 10, 2016", "userURL": "http://www.goodreads.com/user/show/47706005-overdramatics", "userReview": "Die Story war wirklich sehr toll, wenn nur nicht dieser merkwürdige Schreibstil in der Erzählung der Gegenwart gewesen wäre. So unterhält sich dich heutzutage einfach kein Mensch mehr ... Ich werde Lucinda Riley aber auf jeden Fall noch eine Chance geben, da die Geschichte an sich sehr gut war."}, {"userName": "İntellecta", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/67897611-ntellecta", "userReview": "\"Cover und Titel sind gelungen.Die Autorin schaffte es nicht die Emotionen glaubhaft darzustellen.Protagonisten waren ständig müde und müssten\"Schläfchen\" halten.\"Fazit: \"Ein Buch völlig überflüssig und ohne Tiefgang.\""}, {"userName": "Catherine", "userReviewDate": "Dec 22, 2015", "userURL": "http://www.goodreads.com/user/show/36545785-catherine", "userReview": "3,5 - 4 SterneAuch wenn es mich anfangs nicht wirklich überzeugen konnte, hat mir das letzte drittel und vorallem das Ende total gut gefallen."}, {"userName": "Sarah", "userReviewDate": "Jul 04, 2014", "userURL": "http://www.goodreads.com/user/show/9157519-sarah", "userReview": "3.5 Stars. So tragic! But I really enjoyed the surprise ending and how it all wrapped up."}, {"userName": "Biluma", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/5484582-biluma", "userReview": "4,5 Sterne"}, {"userName": "Svjetlana Tesla", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/16973312-svjetlana-tesla", "userReview": "Moze li crna orhideja uspjevati u vlaznoj Engleskoj,da li je vaznija ljubav ili obaveza,Hariju je bilo vaznije odrzati naslijedjeno imanje,a izgubiti Lidiju,s druge strane Lidijinoj unuci Juliji bila je vaznija ljubav jednog muskarca,a staklenik pun orhideja ih uvjek prati..."}, {"userName": "Nina", "userReviewDate": "Dec 30, 2011", "userURL": "http://www.goodreads.com/user/show/1778889-nina", "userReview": "I ended up liking the characters and plot of this book more than I expected when I started reading. The book jumps back and forth between the present and recollections from two generations back and deftly spins a story that reveals hidden connections, secrets, and parallels between many of the characters. There are repeated themes of dealing with the grief of losing loved ones, the conflict between love and duty, and the strong bond of family. The settings are lovely, featuring an English country estate and exotic, lush Thailand. All of the story lines wrap up nicely, maybe a little too nicely, but it left me with a feeling of satisfaction. Unfortunately, the weak writing takes away significantly from this book's potential. The worst part is the dialogue, and the characters talk too much for this to be overlooked. There's a lot of uninspired dialogue. There's an extreme overuse of ellipses. But worst of all is when the author is trying to make the characters sound a certain way, and that character's dialogue alternates between normal English and something unrealistic and exaggerated. For example, the two French-speaking characters demonstrate their French-ness by constantly adding \"n'est-ce pas?\" to their sentences. And Lidia, a formerly wealthy Thai woman supposedly educated by the British, mostly speaks in the stereotypical Asian way (\"I get pay rise too, so my family very happy.\") but occasionally lapses into regular English, saying things like \"Now I must leave you, as I have new guests arriving very soon.\" For a character who typically can't remember to put verbs in sentences, a sentence like \"I would have to ask Madame\" shows pretty good mastery of verb conjugation. It’s also hard to deal with Kit, a contemporary character, saying things like, \"Whilst I concoct the pasta sauce, I shall pour our my troubles to you.\"As a storyteller, Lucinda Riley has potential. Hopefully with her future books, she can overcome the challenge of writing convincing dialogue. I was ultimately glad I didn’t give up on this book, but there were many points while reading where it was tempting to do so."}, {"userName": "Eva Maraki", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/33390154-eva-maraki", "userReview": "\"ΤΟ ΛΟΥΛΟΥΔΙ ΤΟΥ ΘΕΡΜΟΚΗΠΙΟΥ\" Λ.ΡΑΪΛΙ Μεθυστικές μυρωδιές,σαγηνευτικά χρώματα,συναισθήματα με ένταση...αυτά θα συναντήσετε όταν διαβάσετε \"το λουλούδι του θερμοκηπιου\".Είναι από τα μυθιστορήματα που μου κέντρισαν το ενδιαφέρον από την πρώτη σελίδα&καταφέρε να το κρατήσει αμείωτο με ακόμα μεγαλύτερη ένταση ως την τελευταία.Αν έπρεπε να το χαρακτηρίσω συνολικά θα το όριζα ως τρυφερό κοινωνικο-αισθηματικο βιβλιο που σε ταξιδευει.Σε στέλνει νοερα στη Μπανγκονκ &στην Αγγλία του ΒΠΠ,μέσα απο μια δυνατή ιστορία ζωης που θα σας συγκινησει.Μια σχέση αγάπης αναμεσα σε δυο αλοτελα διαφορετικους ανθρώπους,το Χάρι&τη Λίντια&παράλληλα τόσο ταιριαστους, που αγγίζει,διδάσκει&προβληματιζει με τις επιλογες που καλούνται να λαβουν οι κεντρικοί ήρωες.Παράλληλα με ωραίες εναλλαγές στο χρόνο ,βρισκόμαστε στο σήμερα γνωρίζοντας την Τζουλια ,ένα τραγικο προσωπο που περνά απο Συμπληγάδες για να ισορροπήσει &η οποια συνδεεται με την ιστορια του χθες, με ένα μαγικο τροπο.Αποκαλύψεις που σοκάρουν αλλά ταυτόχρονα αποκαθιστουν πρόσωπα&συνειδήσεις έρχονται στο φως με τη βοήθεια της συγγραφεως ,που καταφέρνει σε ενα ογκωδες μυθιστορημα η πλοκή να είναι σφιχτοδεμένη ,τα συναισθήματα έντονα,οι ήρωες αληθινοι&τα μηνύματα να σε διαπερνουν. Με λιγα λογια με ταξίδεψε &ειμαι πεπεισμενη πως ανήκει στα βιβλία που πάντα θα έχουν έστω&μια μικρή θέση στη μνήμη μου.Αγάπησα ολους τους ήρωες γιατί όλοι μίλησαν στην καρδιά μου,χωρίς φλυαρίες,αλλά με ουσία&πάθος.Οπως διατεινονταν οι ήρωες του,ζούμε τη στιγμή,γιατί αυτη δεν έχει αρχη&τελος.Πάντα θα υπάρχει...σαν \"το λουλούδι του θερμοκηπιου\"που αντέχει στο χρόνο."}, {"userName": "Lill", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/11775769-lill", "userReview": "After reading a book that opened up parts of my emotions I had closed off, I now find myself yearning for more. I couldn´t go back to books were sensible to read. My emotions needed to be heard, the full spectrum of them. Standing in the bookstore, scanning the shelves for something to inspire me, I finally gave up, and asked the salesperson for something similar that I´d read, when my eyes noticed the cover of \"The Orchid House\", and the excerpt that they gave away for free. I started reading, and I heard someone talking to me, but I was momentarily lost in the world of Julia Forrester and her sorrows, numbness and yearnings for what she had and the impossibilities of having any hope for loving again. Until she meets Kit Crawley.Kit is a character strong enough to make you feel wooed by a man that loves you for who you are, even though you are down and feel like a used rag.This mesmerizing story has a backstory which is equally breathtaking, - giving us a perspective of the early twenties world, where we assume the man has all the choices in the world, but also he can feel trapped by his apparent good fortunes. These stories meet to give us a climax that lingers with you for weeks, and for me established a hope for love, that kept me nourished until I met my own Kit Crawley. :-)"}], "description": "For fans of The House at Riverton and Rebecca—a debut spanning from the 1930s to the present day, from a magnificent estate in war-torn England to Thailand, this sweeping novel tells the tale of a concert pianist, Julia, and the prominent Crawford family whose shocking secrets are revealed, leading to devastating consequences for generations to come. As a child Julia Forrester spent many idyllic hours in the hothouse of Wharton Park, the great house where her grandfather tended exotic orchids. Years later, while struggling with overwhelming grief over the death of her husband and young child, she returns to the tranquility of the estate. There she reunites with Kit Crawford, heir to the estate and her possible salvation. When they discover an old diary, Julia seeks out her grandmother to learn the truth behind a love affair that almost destroyed Wharton Park. Their search takes them back to the 1930s when a former heir to Wharton Park married his young society bride on the eve of World War II. When the two lovers are cruelly separated, the impact will be felt on generations to come.Lucinda Riley skillfully sweeps her readers between the magical world of Wharton Park and Thailand during World War II with irresistible and atmospheric storytelling. Filled with twists and turns, passions and lies, and ultimately redemption, The Orchid House is a romantic, poignant novel that became an instant bestseller in the UK and Germany.", "title": "The Orchid House", "url": "http://www.goodreads.com/book/show/12449167-the-orchid-house", "average": 3.84, "cover": "https://images.gr-assets.com/books/1320957431l/12449167.jpg", "reviews": 1430, "authors": [{"url": "https://www.goodreads.com/author/show/4512899.Lucinda_Riley", "name": "Lucinda Riley"}], "type": ["Historical", "Fiction", "Romance", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/12449167-the-orchid-house", "http://www.goodreads.com/book/show/11417471-das-orchideenhaus", "http://www.goodreads.com/book/show/10151892-hothouse-flower", "http://www.goodreads.com/book/show/9919390-hothouse-flower", "http://www.goodreads.com/book/show/17227427-the-orchid-house", "http://www.goodreads.com/book/show/12449168-the-orchid-house", "http://www.goodreads.com/book/show/18487467-orkide-evi", "http://www.goodreads.com/book/show/17618814-el-secreto-de-la-orqu-dea", "http://www.goodreads.com/book/show/16207931-tajna-orhideje", "http://www.goodreads.com/book/show/23654045", "http://www.goodreads.com/book/show/11973190-the-girl-on-the-cliff", "http://www.goodreads.com/book/show/22609358-the-seven-sisters", "http://www.goodreads.com/book/show/16130405-the-lavender-garden", "http://www.goodreads.com/book/show/18143789-the-midnight-rose", "http://www.goodreads.com/book/show/34401961-the-pearl-sister"]}