{"ratings": 1800, "userreviews": [{"userName": "Doris", "userReviewDate": "Jun 04, 2011", "userURL": "http://www.goodreads.com/user/show/1821855-doris", "userReview": "I couldn't wait to finish this book so that I could get to a better one. Poorly developed characters, a thoroughly predictable plot and trite dialog made me wonder that I ever bothered reading it except that the library was closed for a holiday weekend and I was fresh out of new reads.I wonder that this book ever got published."}, {"userName": "Jennifer", "userReviewDate": "Jun 20, 2011", "userURL": "http://www.goodreads.com/user/show/1379654-jennifer", "userReview": "This book is told through the perspectives of four generations of a family who are all very ( actually extremely) different from one another. Each character is so extreme in who they are, I found it unbeleivable. It centers around the family cafe and the hardships that they all went through. Very depressing although it comes through with the predictable happy ending."}, {"userName": "Kimberly", "userReviewDate": "Nov 27, 2011", "userURL": "http://www.goodreads.com/user/show/1459492-kimberly", "userReview": "I made it to page 160 and couldn't take it anymore. Both the characters and the story line were so cliche'. I should have known better when the 2 endorsements on the back were from Jodi Picoult and Kristin Hannah."}, {"userName": "Mich", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/1173346-mich", "userReview": "A great entertaining story. Would recommend for sure"}, {"userName": "Carrie", "userReviewDate": "Aug 27, 2009", "userURL": "http://www.goodreads.com/user/show/2182909-carrie", "userReview": "\"She could lead a discussion on sociology but she still didn't know where seagulls made their nests.\"Enough said."}, {"userName": "Mindy Conde", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/5827820-mindy-conde", "userReview": "Another light and easy chick-lit novel after the rather heavy experience of my last read, The Drowning People. This was slightly more substantial than the last few fluff chick-lit novels I've read, but not too much so. I think it took itself more seriously than it actually was, trying to make a statement about medical marijuana as well as pulling in some fairly far-reaching plot points, but it was an interesting enough read. The novel switches between the perspectives of three generations of Moon family women: Allegra, her daughter Mariah, and Mariah's twelve year old daughter Lindsay. After being laid off from her University teaching position, Mariah moves herself and Lindsay in with her mother and grandmother who live in the apartment over the family business, the Owl & Moon Cafe, near the beach in the coastal city of Monterey. As to be expected there are some tensions of these very different women all loving together, which is not helped by Allegra's diagnosis of leukemia. While they try to put aside old arguments in the effort of taking care of Allegra during her chemotherapy, they are not always successful, and it turns out that their path to understanding one another and becoming a closer family is much more nuanced and difficult than expected. In my opinion the most interesting character was Mariah's mother, Allegra. She is a product of the 70's and is as interested in the latest cause as she is in organic cooking in her cafe. She made mistakes in her youth, getting pregnant at 16, but is now trying to make amends for her parenting mistakes with Mariah by being a better grandmother to her granddaughter Lindsay. She's an infectious personality who makes her quirky cafe a popular spot among the locals. Her progression and acceptance of her leukemia was the most interesting journey for me in this novel. The author uses Lindsay, the smarter-than-average kid who attends a pricey private school, to bring in the topic of medical marijuana (she does her science project on it based on her grandmother's illness). It was ok and kind of interesting, but seemed like a bit of a side point. I'm not one for the \"genius kid\" characters in novels though as most authors really have trouble creating a voice authentic enough to be knowledgable and innocent. It generally just rings false to me, as it did here from time to time. Maybe I'm just being nit-picky, but everyone has their little things and this is one of mine. Maybe it won't bother you a bit. Anyway, it was an interesting read that helped me pass a lazy Saturday morning while I had the house to myself. I'd recommend it if you're looking for something a bit more substantial than your normal chick-lit, but not too heavy."}, {"userName": "Sandra", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/330479-sandra", "userReview": "Love, love, loved it! Another top favorite of mine for this year.From Amazon: After losing her teaching position at the local university, Mariah Moon will do anything to keep her gifted twelve-year-old daughter, Lindsay, in a prestigious private school -- which means moving in with her mother and grandmother in an apartment above The Owl & Moon Café. When her mother, Allegra, is diagnosed with leukemia, Mariah rises to the challenge of running the café: mastering her mother's famous fudge and chatting up customers -- including a man who might just reawaken her heart. Meanwhile, Lindsay's controversial entry in a major national science contest creates a minor maelstrom in the cosseted Monterey Bay community. And Allegra, with one last great love affair in her, will revisit a man she loved so many years ago, and disclose the biggest secret of the Moon family: the identity of Mariah's father. Will the Moon women recognize this as the moment to do away with their family history of dubiously fathered children, and learn to forgive others and themselves in order to move forward? In her poignant new novel, bestselling author Jo-Ann Mapson explores the complexities of love and family with the keen eye and stylistic grace that have made her books perennial favorites."}, {"userName": "Julie", "userReviewDate": "Jun 24, 2013", "userURL": "http://www.goodreads.com/user/show/2004925-julie", "userReview": "I felt this book underachieved what could have been a really compelling story. The premise is 4 generations of women living and working together to run a restaurant. The characters are all set up in reaction to the generation prior. So, the hippy has a conservative daughter...you get the picture. The youngest is 12 and a brainiac on a mission to help her grandma. The book was ambitious so none of the characters or relationships were fully developed. I just wanted more the whole time. That being said, it was a good easy summer read. Would have been perfect on a beach with a drink in my hand."}, {"userName": "Denise", "userReviewDate": "Oct 08, 2010", "userURL": "http://www.goodreads.com/user/show/2953994-denise", "userReview": "This is a pretty entertaining read but I found the contrast of the characters to be a bit extreme. The hippy grandmother and the college professor daughter don't ring true to me. I felt a bit manipulated by the unlying story that marajauna should be legalized and does more good than harm and that spiritual life is of no value.The immmature, irresponsible, free-love grandmother who is still living in the 60's is quite annoying as is the overly religious great-grandmother. I don't really think I would recommend this book unless you like cartoons."}, {"userName": "L.M.", "userReviewDate": "Jul 20, 2010", "userURL": "http://www.goodreads.com/user/show/2579724-l-m", "userReview": "I wanted to enjoy this book more then I actually did. The characters all seemed to have the same voice, even though they were supposed to be on opposite ends of the spectrum. it was also more predictable then I expected, I kept waiting for something more and it never materialized. I'm not regretting reading it, just not gonna recommend it to anyone."}, {"userName": "Michelegg", "userReviewDate": "Feb 05, 2009", "userURL": "http://www.goodreads.com/user/show/253691-michelegg", "userReview": "I quite enjoyed this book. I loved the story of the 4 Moon women, all four generations living and working in the cafe and how they all figured out their problems and found happiness. It was sweet and sad and full of forgiveness."}, {"userName": "Jenn O'Brien", "userReviewDate": "Jan 25, 2010", "userURL": "http://www.goodreads.com/user/show/2054052-jenn-o-brien", "userReview": "This was one of those books that started off with a lot of promise and was good until you were 3/4 of the way through, then it all fell apart and you were just struggling to make it through to the finish. Good concept, poor execution."}, {"userName": "Maureen", "userReviewDate": "Jun 14, 2010", "userURL": "http://www.goodreads.com/user/show/2832289-maureen", "userReview": "My favorite character is the granddaughter as she struggles with very dominate women. Easy read"}, {"userName": "Kelly", "userReviewDate": "Nov 24, 2008", "userURL": "http://www.goodreads.com/user/show/1583392-kelly", "userReview": "This was pretty enjoyable. It was a two-day read, told from three different viewpoints. Fairly predictable, but still fun."}, {"userName": "Amy", "userReviewDate": "Jan 01, 2009", "userURL": "http://www.goodreads.com/user/show/1757764-amy", "userReview": "My first Mapson book. Simple yet endearing characters with a mild peppering of scientific enlightenment. I will definitely read more of her books! Thanks for the recommendation Margo."}, {"userName": "Crystal Brooke", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/30606838-crystal-brooke", "userReview": "I really enjoyed this story. The writing was a little ehhh.. but I loved it. I actually wish it would become movie. Definitely has the potential to be a great chick flick, that you could take your grandma, mom, and daughter to see. <3"}, {"userName": "Kelly Roll", "userReviewDate": "Oct 28, 2012", "userURL": "http://www.goodreads.com/user/show/1154966-kelly-roll", "userReview": "I’m afraid this book was a bit of a disappointment for me. In this case it would partially be due to reader expectations. The book was recommended to me as a novel with elements of magical realism in it which, alas, never appeared. Instead we have the story of four women who are forced to live together over the family owned café. We have Gammy the bible spouting “elder’ of the clan and her daughter, Allegra who is an aging hippie about to be diagnosed with leukemia. Rounding out the cast of characters we have Allegra‘s daughter Mariah a recently unemployed college professor and her daughter Lindsey are forced to live with Allegra due to the job loss. Mariah comes across as a bitter, pinched sort of soul while 12 year old precocious Lindsey appears to be the most mature of the four women.What I liked about the story was Lindsey and her decision to discuss the use of medical marijuana as a science project as Lindsey watched her grandmother become sicker and sicker due to her treatments. The author was careful to mention that Allegra had tried a wide variety of medications to try and stem the nausea including Marinol and that none of them had been effective so it was logical for Lindsey to consider medical marijuana. Lindsey was probably, for me the most accurately drawn of the characters. Her feelings and emotions as a middle schooled rang true for me. Some of Mariah’s emotions also seemed to ring true as well. I did understand why she was resentful of her mother and her newly found father even though she was a 34 year old woman.What didn’t work for me were the sketchily drawn personalities of the older characters. Grammy was a walking stereotype of the older Christian woman constantly praying for the souls of her sinner relatives and co-worker. She was so heavy handed in fact I was amazed that Simon the gay cook had managed to work for her all those years or that the café managed to attract return customers. Then we have Allegra, the epitome of aging hippydom who meditates, has her chakras adjusted etc and yet who then seems to settle pretty comfortably into the life of being a doctor’s fiancé. The doctor, incidentally, just happens to be her one true love from 33 years ago and Mariah’s father, a touch too much of a coincidence for me. She barely protests his huge house or gas guzzling cars and seems more than happy to give up her life at the café even though at one point she mourns the loss of her daily social contacts there. Yet, hippie that she allegedly is she refuses to smoke the marijuana that would help in her recovery and stimulate her appetite and for the most contrived of reasons. We are told constantly throughout the book that she will not become healthy again unless she eats and gains weight so after a certain point I just felt like hitting her over the head and yelling “smoke already”. Finally we have Mariah who is bitterly uptight. I was amazed she was able to attract Fergus as she came across the page as a really unsympathetic somewhat self absorbed individual and yet we are expected to believe this man would court her and then ultimately fall in love with her. I also had difficulty with the fact that Mariah would on a nightly basis abandon both her daughter and her sick mother to the care of Gammy, who was constantly being described as being in poor health herself due to her varicose veins. Because I never really felt attached to any of the characters except Lindsey I cannot really recommend this book unless you are looking for a simple feel good story.Oh and one last nitpicky point – while Carmel by the Sea is the name of the town no one refers to it by its full name. This admittedly minor point drove me nuts throughout the book."}, {"userName": "Mary Lou", "userReviewDate": "Oct 15, 2015", "userURL": "http://www.goodreads.com/user/show/1267139-mary-lou", "userReview": "The Owl and Moon Cafe by Jo-Ann Mapson is typical chick lit: love, secrets, and conflict, plus a bit of a coming of age story. The cast includes four generations of women, three single parents. The setting is Pacific Grove, California, a charming beach town; the time frame, fall through New Year's 1990-91. The conflicts are ostensibly different values among the women and a diagnosis of leukemia. Mapson does a capable job of building interest in the characters and the story. Mapson's philosophy and key theme is \"If you see your happiness out there on the horizon, honey, you run for it like hell's hounds are on your heels. Don't let somebody else steal it.\" (326).Plot details follow.Gammy Bess is the matriarch; Allegra, Bess's daughter; Mariah, Allegra's daughter; and Lindsay, Mariah's daughter. Bess met Myron Moon on the rebound, married him when their one night stand left her pregnant, was widowed and then ejected from Moon's rich family with the gift of the property that is now the Owl and Moon cafe (186).Allegra had a summer fling with Alvin Goodnough just after he returned from Vietnam, during his last free summer before medical school. His parents will fund it, but they expect him to marry a woman he's known all his life. When Allegra finds herself pregnant, she doesn't tell him or Mariah (110).The novel begins with Mariah losing her position as assistant professor of sociology just as the fall quarter is about to begin. Mariah and Lindsay move to the apartment about the cafe where Allegra lives because Mariah can't afford Lindsay's their apartment and private school for Lindsay. Only 12, but in 8th grade because of her 175 IQ, Lindsay is fascinated by science and idolizes Carl Sagan.Like many others written in the beginning of the 21st century, the novel is almost too inclusive. In addition to the single moms and leukemia, there is a gay cook (Simon Huggins) and Goodnough moves to the area, after overcoming the death of his daughter and being divorced by his wife, in time to diagnose Allegra's leukemia and Lindsay's bleeding ulcer. Naturally, he is rich. Mariah begins a relationship with a man from Scotland, Allegra goes into remission and moves in with Doc who is adored by Lindsay and gradually accepted by Mariah. Bess moves away from the cafe and Simon steps up to partner with Mariah."}, {"userName": "Natalie", "userReviewDate": "Apr 07, 2014", "userURL": "http://www.goodreads.com/user/show/5868516-natalie", "userReview": "This book wasn't great, it was simply pretty good. It flowed alright, and the characters were believable to a point. What I found the hardest to believe was that everything had been plodding along in this life that these women had created, the same way for 12 years, then all of a sudden, everything completely changed in a year. That can happen with a cancer diagnosis, I don't begrudge Mapson that- I have first hand experience. However, everything else- Allegra finding her lost love, Lindsay taking the huge chance at the science fair AND finding a best friend, Mariah suddenly coming out of her shell and falling in love, and Gammy giving up the cafe, all in a year? I don't think so. Too much went down in a short period of time for it to really be believable. Mariah drove me up the wall- initially refusing to go out with Fergus, second guessing sleeping with him and berating herself for falling in love with him. I felt like she needed a wake up slap. No one told Gammy to shove her unwanted judgmental Christian ideals either- and that drives me insane. \"It's ok if I judge you if I stand behind this cross.\" However, that is an argument for another day. I know that the author had a note at the end of the novel stating that she didn't have a hidden agenda with the Marijuana, but that just made me believe it all the more. Why that topic? If she really wanted to write about it, why not have the novel centered around it? If the controversy really intrigued Mapson so much, she should have had Lindsay be the center of the novel, tell the whole thing from her perspective, and have it focus almost wholly on this taboo science project. It felt like she did enough research to touch on a few things about Mary Jane, but not enough to really feel like she put in the effort. After all this, you might be wondering how I even enjoyed the novel at all. I did enjoy Allegra, and Simon, and the way Sally told off the school bullies made me feel vindicated, somehow. The pacing was ok, except during the middle of the book where it slowed down to a snail's pace. It ended on a feel good note, but there wasn't enough epilogue for my taste. If you like those novels where enough good happens to make you feel life is worth living, yet enough cynicism to bring you back down to Earth a little, this might just be for you."}, {"userName": "Sara", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/2081924-sara", "userReview": "A story which has a bit of all of us in it!"}, {"userName": "Christine", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/1409064-christine", "userReview": "This wasn't bad. I was a little skeptical at first, kind of worried that we were in romance/\"women's lit\" territory, which isn't usually my cup of tea, but it didn't end up being too romancy for me. Despite there being two big romance stories (one with a superrich doctor and one with a ruggedly handsome Scot) (seriously) (I mean... could that stuff be any more cliché?). There were other storylines that reeled me in though, and while the line of \"finding my perfect mate will solve ALL THE THINGS wrong in my life!\" was certainly trod, it wasn't overdone. The focus was mainly on the three younger generations of Moon women and their lifestuff + relationships with each other. The youngest was my favourite, my penchant for YA lit showing I guess. The whole book did feel a little like a public service announcement against health insurance companies and pro medical marijuana. There was a fourth \"elderly\" Moon, Gammy, but we never had a chapter from her point of view so I would consider her more of a supporting character. And can we just take a moment to note that sixty-eight is not elderly? Cripes. She was written like an ninety-eight year old from pioneer days, but the women I know in their mid-sixties are not exactly at the crone stage of life. Maybe being in your sixties was a lot worse back in... when was this published? 2006? Oh. Well maybe this was written a lot earlier than that, I think it must have been because no one breathed a word about mobile phones. So yeah... a few things didn't make a lot of sense, a few characters were less well developed than others, and it was definitely a deliberate heard-string-puller but I enjoyed most of it anyway. Also, now I want cookies."}, {"userName": "Tonya Helser", "userReviewDate": "Jan 21, 2015", "userURL": "http://www.goodreads.com/user/show/32019688-tonya-helser", "userReview": "This book was ok. It follows the lives of four generations of women. Bess aka Gammy starts the Owl and Moon cafe after her husband dies and his family leaves her to fend for herself and raise their daughter. Alice who goes by the name Allegra is a protesting flower child and a free spirit. She is suddenly diagnosed with lukiemia. When she goes to the Doctor, she finds out that he is her long lost love Alvin, who is the father to her daughter. Mariah has been asking about her father her entire life, but Allegra never reveals his identity until she finds him again. A romance blossoms. Everyone is thrilled except for Mariah. She feels cheated out of her childhood. Mariah is the 'sensible' one. She is let go from her job as a sociology proffesor and is forced to move in with her mother and grandmother in the small apartment above the cafe. She is a little uptight and bitter. The way her life has gone, she has good reason to be. She is raising her daughter Lindsay by herself. Lindsays father ran off when Mariah told him she was pregnant. In the book Mariah meets Fergus Applecross, a man from scottland. They start dating and she finally gets to enjoy a love affair after thirteen years! Lindsay is twelve years old and has an IQ of 175. She has a special interest in science. She is struggling with so much stress that she develops stomach ulcers. Her and her friend choose to do thier science project on the benefits of medical marijuana. Lindsay sees her nana (Allegra) struggling with her apetite because of cancer. She knows that their are medications that can help her, but it is still a taboo subject. They are taking a huge risk by growing marijuana plants. This book rings true in many ways. It could be describing the life of many women in modern day America."}, {"userName": "Sterlingcindysu", "userReviewDate": "Nov 05, 2013", "userURL": "http://www.goodreads.com/user/show/946086-sterlingcindysu", "userReview": "I didn't get off to a good start here--on the 2nd page I was having difficulty understanding Mariah's rant against public schools. So you have a brilliant daughter, have her skip not one, but two years and then put her in a rich mean girls private school against 12-13 year olds? Oh sure, that's much better! Throughout the story whenever Lindsay does/say anything (such as balancing the checkbook) I'm thinking, this is an 11 year old! And really, the mother wears the daughter's underwear by accident? There was a lot of missing info on the money front--so Mariah gets laid off and there's no unemployment--what happened to the 2 years being given out back in 2007? Why wasn't Gammy collecting SS? There's a line out the door for the café, but they can't hire any help? Most of the characters were way too clichéd--the old hippie, the holy roller grandmother, the handsome Scotsman, etc. Except they didn't stay in character--why would Gammy let a 15 year old Allegra camp out with men and be gone for days? Mariah never had any time, was such a rushed professor--but she had never written her thesis? How can you be a professor, grade other theses and never have written your own? She had free daycare but couldn't take her daughter out trick or treating? How busy do you have to be to miss that? Yet it was repeated often what a \"good\" mother she was. Right, her daughter didn't eat and she doesn't catch that while working at a café? There were way too many snags in the story for me to follow without saying (out loud sometimes), that doesn't make any sense. I started dogearing pages where there was a logic discrepancy and after 6 in a row, I gave that up too."}, {"userName": "Bethany", "userReviewDate": "Sep 24, 2007", "userURL": "http://www.goodreads.com/user/show/3756103-bethany", "userReview": "As far as a work of fiction goes, this book is pretty decent. The characters are all complete opposites, yet they come together nicely, in a way that somehow complements each other. The story line revolves around a four generation family of women. Gammy, the oldest, is a devoutly religious woman who is constantly praying for the salvation of her daughter's soul. Her daughter, Allegra, is an old school hippie with no fear of getting arrested for the right cause. Allegra's daughter, Mariah, is a more conservative woman, a recently unemployed college sociology professer. The final member of the family is Lindsay, a junior high child prodigy of sorts, who worries over everything, and often finds herself trying to keep her family functioning from day to day.The story is told from the alternating perspectives of Allegra, Mariah and Lindsay. Each woman is facing her own personal battles, along with trying to cope with life on a daily basis. I read a customer review of this book somewhere (I can't remember which website I read it on) and the reviewer wrote that this book was terrible, and that so many issues were raised which were never given any resolution. Having just finished the book, I would have to strongly disagree. In my opinion, all the issues were touched upon, and dealt with. If no answer was directly given, readers are at least left with the sense that the Moon family is going to triumph once again. The book ends on a note that is hopeful and positive, and you realize that everything will go as it should. At least that's the feeling I walked away with."}, {"userName": "Linda", "userReviewDate": "Jan 18, 2011", "userURL": "http://www.goodreads.com/user/show/2225443-linda", "userReview": "Mapson explores love and family relationships through the eyes of four generations of women, all of whom are facing various problems and difficulties in their lives. Lindsay is a middle-school student who is enthusiastic about science. Her mother, Mariah, a college professor, has just lost her job and is concerned about financing Lindsay’s tuition at her private school. Allegra, Mariah’s mother, owns and runs a café called “The Owl and Moon” and lives in an apartment over the café with her mother, Bess, who is usually called Gammy. Allegra and Mariah were each single mothers when their daughters were born, and Mariah has obsessed for years because Allegra won’t reveal the name of Mariah’s father. Shortly after Mariah and Lindsay move into the apartment over the café, Allegra is diagnosed with leukemia and Lindsay, looking for a way to help her grandmother’s treatment, decides to do her science project on medical marijuana. Mariah falls into a relationship with a customer she meets at the café. Allegra discovers that her cancer doctor is a long-lost lover. Lindsay and her friend Sally cause quite a stir with their science project and the marijuana they grew. It was easy to like these four women and become involved in their lives. I had read a few of Mapson’s books several years ago, and was glad to find that she has written several others, which I am sure I will enjoy as much as this one."}, {"userName": "Kris - My Novelesque Life", "userReviewDate": "Jul 24, 2014", "userURL": "http://www.goodreads.com/user/show/6275022-kris---my-novelesque-life", "userReview": "4 STARS\"After losing her teaching position at the local university, Mariah Moon will do anything to keep her gifted twelve-year-old daughter, Lindsay, in a prestigious private school -- which means moving in with her mother and grandmother in an apartment above The Owl & Moon Café.When her mother, Allegra, is diagnosed with leukemia, Mariah rises to the challenge of running the café: mastering her mother's famous fudge and chatting up customers -- including a man who might just reawaken her heart. Meanwhile, Lindsay's controversial entry in a major national science contest creates a minor maelstrom in the cosseted Monterey Bay community. And Allegra, with one last great love affair in her, will revisit a man she loved so many years ago, and disclose the biggest secret of the Moon family: the identity of Mariah's father.Will the Moon women recognize this as the moment to do away with their family history of dubiously fathered children, and learn to forgive others and themselves in order to move forward?\" (From Amazon)I really enjoyed this warm and humourous novel. Allegra, Mariah and Lindsay are great characters that will touch your heart instantly."}, {"userName": "Casceil", "userReviewDate": "Nov 15, 2011", "userURL": "http://www.goodreads.com/user/show/6247910-casceil", "userReview": "I just reread this book. The first time I read it, several years ago, I wasn't that impressed. I got much more out of it this time. The characters are well-drawn, and develop in a believable fashion. The plot weaves together four generations of women in one family. The three oldest each raised a daughter without help. The great-grandmother's husband died when Allegra was a baby. Allegra was an unwed mother at 16 by someone she did not know how to contact. Her daughter, Mariah, got pregnant around age twenty by a man who thought she should have an abortion and he did not stick around. Mariah's daughter Lindsay is almost twelve in this book. All four of them live together above the cafe they run, the Owl and Moon Cafe. There are some soap-opera type elements to the story, but the book is not maudlin. The interactions between the central characters, several generations of mothers and daughters, are well done and their conversations ring true. I am glad I gave this book a second chance."}, {"userName": "Almira", "userReviewDate": "Jul 03, 2008", "userURL": "http://www.goodreads.com/user/show/1103497-almira", "userReview": "\"The Owl and Moon Cafe\" by Jo-Ann MapsonFour generations of women, from the same family, end up living, working, and sharing family secrets together - during which time, they must learn the secret of living together in harmony. An unexpected job loss to Mariah Moon forces her to move in with her mother, Allegra, and Gammy, so that her daughter, Lindsay, can continue to attend her fancy private school. Gammy waits tables at the Owl & Moon, Allegra does all the baking and cooking, when Mariah arrives and pitches in to make ends meet - until, her mother is diagnosed with leukemia, at that time Mariah take over running the Owl and Moon. Lindsay moves ahead with a scret and dangerous science project with her \"sometimes\" rich friend Sally.The biggest surprise to all is when Allegra meets her former lover, who just happens to be her cancer specialist - things start to unravel, and yet start to fit together again.Read this one back in 2006, still brings back memories when I check it out to a library patron, or return it."}, {"userName": "Fermentum", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/2934518-fermentum", "userReview": "3.75?lol.. one part of the story is the 13 y/o daughter Lindsay and her BFF ...and their science project. Growing Marijuana!LOVE Lindsay's letter to Carl Sagan!I probably would have given it a 4 if I was truly interested in how Marijuana grew. LOL"}, {"userName": "Donna", "userReviewDate": "Jun 03, 2013", "userURL": "http://www.goodreads.com/user/show/7892984-donna", "userReview": "I really enjoyed this book. It is about four generations of women who have a cafe and all of the dynamics of their relationships with one another as well as the men in their lives. Lindsay was a wonderful character. I could not wait to see how her middle school science project turned out. Mariah, her mother, lost a job due to downsizing and I've been there, done that, so I could totally relate to her character. Mariah's mother, Allegra, was a lovable hippie and her mother, Bess, a rosary holding church goer trying desperately to save the soul of their cook, Simon, who was gay. This book had likable characters and humor in it as well as a great story line. It was truly an enjoyable read and I recommend it."}], "description": "After losing her teaching position at the local university, Mariah Moon will do anything to keep her gifted twelve-year-old daughter, Lindsay, in a prestigious private school -- which means moving in with her mother and grandmother in an apartment above The Owl & Moon Caf�.When her mother, Allegra, is diagnosed with leukemia, Mariah rises to the challenge of running the caf� mastering her mother's famous fudge and chatting up customers -- including a man who might just reawaken her heart. Meanwhile, Lindsay's controversial entry in a major national science contest creates a minor maelstrom in the cosseted Monterey Bay community. And Allegra, with one last great love affair in her, will revisit a man she loved so many years ago, and disclose the biggest secret of the Moon family: the identity of Mariah's father.Will the Moon women recognize this as the moment to do away with their family history of dubiously fathered children, and learn to forgive others and themselves in order to move forward? In her poignant new novel, bestselling author Jo-Ann Mapson explores the complexities of love and family with the keen eye and stylistic grace that have made her books perennial favorites.", "title": "The Owl & Moon Cafe", "url": "http://www.goodreads.com/book/show/50458.The_Owl_Moon_Cafe", "average": 3.62, "cover": "https://images.gr-assets.com/books/1442785338l/50458.jpg", "reviews": 185, "authors": [{"url": "https://www.goodreads.com/author/show/28397.Jo_Ann_Mapson", "name": "Jo-Ann Mapson"}], "type": ["Fiction", "Womens Fiction", "Romance", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/50458.The_Owl_Moon_Cafe", "http://www.goodreads.com/book/show/17852506-the-owl-and-moon-cafe", "http://www.goodreads.com/book/show/6442119-the-owl-moon-cafe", "http://www.goodreads.com/book/show/18399110-the-owl-and-moon-cafe", "http://www.goodreads.com/book/show/7149472-the-owl-moon-cafe", "http://www.goodreads.com/book/show/7925361-solomon-s-oak", "http://www.goodreads.com/book/show/13538813-finding-casey", "http://www.goodreads.com/book/show/87210.Bad_Girl_Creek", "http://www.goodreads.com/book/show/7551438-hank-chloe", "http://www.goodreads.com/book/show/87212.Blue_Rodeo"]}