{"ratings": 205, "userreviews": [{"userName": "Nancy Haddock", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/6233405-nancy-haddock", "userReview": "Another winner I'm hooked on this series! The characters are believable and relatable, and add to both solving the mystery and the humor. Take advantage of the fun!"}, {"userName": "✰  BJ's Book Blog ✰Janeane ✰", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/11580881-bj-s-book-blog-janeane", "userReview": "ARC received for an honest reviewThis is the second book in this new series from Ms Keane, and I have to say, I think I liked this one better than the first.Maggie Doyle's arrival on Whisper Island seems to have really stirred up all kinds of trouble. It is becoming like the towns on Midsomer Murders, where they look lovely, but you don't want to go there as everyone ends up dead!The Postman Always Dies Twice is full of fun, laughter, mystery and intrigue. The rag tag bunch characters of this island ensure that there is never a dull moment! I am loving that we are getting to know the characters better, they are building relationships and causing havoc all over the island! There is so much going on in this story, however it is not OTT. It is well paced and well written, and I just had to keep turning the pages as I needed to know what happened next.I am usually good at picking the bad guy, but once again I had no idea and was surprised when the culprit was revealedI am still holding out for a little romance between our Maggie and the hot cop Liam, and things do seem to be progressing between them!This is quickly becoming my favourite series by Ms Keane and I can't wait to see what she brings us next."}, {"userName": "Kay Hudson", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/34263831-kay-hudson", "userReview": "The Postman Always Dies Twice is another funny, fast-moving entry in the Movie Club Mysteries series. This time Maggie and her friend Lenny discover the body of the local postal carrier, and Maggie goes undercover at the island hotel in an attempt to find the poltergeist scaring the guests away. Meanwhile Sergeant Reynolds has moved into the cottage nest to Maggie's, but he may not be there long if the postman's murder gets any more complicated. Between wardrobe disasters, bootleg whiskey, and pot-laced brownies, Maggie's stay on Whisper Island is far from the uneventful r&r she was looking for--but maybe just what she needs."}, {"userName": "Janine", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/5731291-janine", "userReview": "Another good read in this fun series. Lots of zany characters and good sleuthing by Maggie."}, {"userName": "Thomas", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/40958944-thomas", "userReview": "Maggie Doyle comes across the apparent suicide of the local postman, she doesn't think things are as they seem. Her childhood friend Lenny's brother is arrested for the crime, she steps in to investigate. Much to Sergeant Liam Reynold's chagrin. Her least favorite fan, Melanie Greer, also hires her to discover who is behind a poltergeist that is scaring away the hotel guest and staff. And she has less than a week to solve it or she doesn't get paid. Zara continues the saga of Maggie, the ex San Francisco cop with lots of humor and action that make the story a page turner. I'm looking forward to the next in the series being released soon. I hope."}, {"userName": "Georgette", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/7630754-georgette", "userReview": "This second caper in the Movie Club Mysteries is a real whodunit. In this case what appears to be an open and shut case is anything but. A former policewoman from San Francisco believed she was only visiting an Island off the Coast of Ireland to visit old friends, her Aunt Noreen, to reconcile the massive changes in her life for a few months. Well it won't take the reader long to realize that old friendships and new options for her career present a paradigm shift and potential romantic alignments so who could leave that and go back to nothing and bad memories. Enjoy this story and look forward to more."}, {"userName": "Bernie", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/3836047-bernie", "userReview": "This is another 5-star offering from Zara Keane. I have loved reading the offerings in the series so far. Maggie, the ex-pat from San Francisco now living in the small village of Whisper Island, Ireland, birth home of her father and his ancestors, is a remarkable, fun, astute woman who is learning to love her new home, ever more with each new book. Her growing relationship with the handsome Police (Garda) chief Reynolds is sweet and challenging at the same time. Maggie's experience as a former San Francisco cop aids her every time she comes across another \"incident\" that requires her skills to solve the mystery. I totally look forward to more from Zara Keane."}, {"userName": "Suzan", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/9530251-suzan", "userReview": "What a fun read. Zara Keane has me hooked on this \"Movie Club Mystery series\". This is the second book I have read in the series with book one being the first. I can't wait to read book three. Maggie is a fun character and I like that she came to Ireland for a vacation to just get away from her life in San Francisco but has made a new life for herself and looks as though will be staying on in Ireland."}, {"userName": "Sheryl", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/5186851-sheryl", "userReview": "A fun follow up to the first in the series. While you don’t necessarily need to have read the first to enjoy the second, familiarity with the characters and their past experiences and interactions makes the book more enjoyable. Two solid mysteries in this book make it even more entertaining while Maggie races the clock to solve both. I really like Maggie’s personality and attitude and look forward to more in this series."}, {"userName": "Mooncat", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/33744767-mooncat", "userReview": "So it's a typical second book of a series. Not as great as the first one - but all in all, it was still a fun read. As predicted, the regulars are so far all entertaining and I love the sizzle between Maggie and Liam. Most of all I love her adult, sensible approach on her cases. Can't wait to start the next one!"}, {"userName": "Jana Gundy", "userReviewDate": "Dec 11, 2017", "userURL": "http://www.goodreads.com/user/show/25334062-jana-gundy", "userReview": "It has everything to keep you entertainedWhat’s not to love about this book and series? Maggie is an intelligent ex cop that solves crimes and murders in a very well done manner and her sometimes helpers inject the right amount of hilarity to make it funny. She also has a little bit of a flirtation going on with the new local police man that is entertaining as well."}, {"userName": "Jennifer", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/24910948-jennifer", "userReview": "I really enjoyed this book. It grabbed me from the first page. Once I started reading, I did not want to put it down. It is set in a quaint town in Ireland. The mystery was good and there were plenty of twists and turns. I recommend this book to anyone who enjoys a good cozy mystery."}, {"userName": "Kitten  Peters", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/37689661-kitten-peters", "userReview": "Great readI love this series. The author picks some great story lines, loveable characters and lots of suspect's. In this book ghosts, dead bodies, not so dead bodies and Maggie must find the killer to save the hot cop's job."}, {"userName": "Arow", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/2983614-arow", "userReview": "Enjoyed this second installment in the movie club mystery series. There is something about the characters, the setting, the writing style and overall feel of the series that I am loving. Finshed this one in a day and already started the 3rd."}, {"userName": "Lori", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/13188827-lori", "userReview": "3.5 stars Liked it but too many silly side stories"}, {"userName": "Linda Cole", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/29504944-linda-cole", "userReview": "Great adventureI loved this series. The characters are not perfect real and interesting. The movie theme is an added bonus. Mysteries are complex and full of surprises."}, {"userName": "Bobbi", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/37035282-bobbi", "userReview": "Great characters ~ fast read and kept me guessing who in the end it was ~"}, {"userName": "Julie Jefferies", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/47609604-julie-jefferies", "userReview": "Once again Zara has excelled. I'm loving this new series of hers. There were so many twists and turns and just like the first book, you were kept guessing to the end. I loved that all my fav pyrites were there. And I must admit a highlight was the two Geri's 'games night' I'm sure you'll love it too. I can't wait for the next book in the series to come out, I'm well and truly hooked.I received a free copy of this book and chose to VOLUNTARILY review it. My review is completely honest, and a non-incentivized review."}], "description": "Postmen. Poltergeists. Poteen.When former San Francisco cop, Maggie Doyle, extends her stay in Ireland, dealing with more murder and mayhem isn't on her to-do list. The instant Maggie and her UFO-enthusiast friend discover the dead body of the Whisper Island postman, Maggie's plans to chill for the next two months are put on ice.After Police Sergeant Reynolds, Maggie's handsome neighbor, arrests Lenny's brother for the murder, her friend begs her to find the real killer. Meanwhile, Maggie is hired to investigate ghostly goings on at the Whisper Island Hotel. Can she solve two crimes before St. Patrick's Day? Or will the island's annual celebrations end in a glittery flame of green, white, and orange?***Includes a recipe for one of Maggie's favorite cocktails!***", "title": "The Postman Always Dies Twice\n      \n          (Movie Club Mysteries #2)", "url": "http://www.goodreads.com/book/show/34876903-the-postman-always-dies-twice", "average": 4.41, "cover": "https://images.gr-assets.com/books/1492517814l/34876903.jpg", "reviews": 46, "authors": [{"url": "https://www.goodreads.com/author/show/7729304.Zara_Keane", "name": "Zara Keane"}], "type": ["Mystery", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/34876903-the-postman-always-dies-twice", "http://www.goodreads.com/book/show/34622774-the-postman-always-dies-twice", "http://www.goodreads.com/book/show/32798679-love-and-shenanigans", "http://www.goodreads.com/book/show/33493082-dial-p-for-poison", "http://www.goodreads.com/book/show/32798980-love-and-leprechauns", "http://www.goodreads.com/book/show/24235258-her-treasure-hunter-ex", "http://www.goodreads.com/book/show/24235285-the-rock-star-s-secret-baby"]}