{"ratings": 4748, "userreviews": [{"userName": "Madeline", "userReviewDate": "Oct 10, 2010", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "\"Elegant ThingsA white coat worn over a violet waistcoat. Duck eggs.Shaved ice mixed with liana syrup and put in a new silver bowl.A rosary of rock crystal.Snow on wisteria or plum blossoms.A pretty child eating strawberries.\"Sei Shonagon was a lady-in-waiting to the Empress of Japan during the Heian period. At one point, she was given some extra paper that had been lying around and decided to make a pillow book - a book kept by her bed, where she jotted down stories, memories, lists, and whatever else came into her head. I loved this little book a lot more than I expected to. For the history buffs, it's an incredibly detailed picture of court life in imperial Japan. For the artistically inclined, Shonagon's images and descriptions are beautiful and stirring (\"When crossing a river in bright moonlight, I love to see the water scatter in showers of crystal under the oxen's feet.\"). For the gossip-inclined, there's tons of court gossip that Shonagon dishes out for us, and she also gives her reader lots of interesting anecdotes about the men she's slept with (she has lots of rules for how gentlemen should and should not behave when visiting a lover at night). The best part, for me, was the whole tone of the book - if I were to follow Shonagon's example and make a list of \"Things That Give a Comfortable Feeling\", I would put this book at the top. Whenever I was stressing out about tests or papers or work, it was amazingly soothing to pick up this book and read nice anecdotes about rich Japanese women visiting temples, reciting poetry, writing lists, and generally being very clever and elegant all the time.Shonagon, it must be admitted, is not perfect. She hates lower-class people, especially if dress badly or wear their hair wrong. She also writes at one point, \"Men have really strange emotions and behave in the most bizarre ways. Sometimes a man will leave a very pretty woman to marry an ugly one. ...I do not understand how a man can possibly love a girl whom other people, even her own sex, find ugly.\"But then she writes little almost-stories like this: \"An attractive woman, whose hair tumbles loosely over her forehead, has received a letter in the dark. Evidently she is too impatient to wait for a lamp; instead she takes some fire-tongs, and, lifting a piece of burning charcoal from the brazier, laboriously reads by its pale light. It is a charming scene.\" She tells stories about the Empress, the other courtiers, and makes sure we know her opinions on everything. She lists mountains, lakes, forests, and temples. She gives her opinions on fashions and what colors look good together. Some other sample list titles are: \"Things That Are Hard to Say\", \"Features That I Particularly Like\", \"Things Worth Seeing\", \"People Who Look Pleased With Themselves\", \"Things That Are Near Though Distant\", \"People Who Seem to Suffer\", \"Things That Make One Nervous\", \"Things That Seem Better at Night Than in the Daytime\", and \"Things That Make One Sorry.\" A lovely, charming book. Should be read somewhere near a garden, while drinking tea and listening to nice music. \"I wrote all these notes at home, when I had a good deal of time to myself and thought no one would notice what I was doing. Everything that I have seen and felt is included. Since much of it might appear malicious and even harmful to other people, I was careful to keep my book hidden. But now it has become public, which is the last thing I expected. ...I set about filling the notebooks with odd facts, stories from the past, and all sorts of other things, often including the most trivial material. On the whole I concentrated on things and people that I found charming and splendid; my notes are also full of poems and observations on trees and plants, birds and insects. ...Whatever people may think of my book, I still regret that it ever came to light.\""}, {"userName": "Наталия Янева", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/9539140", "userReview": "„Неща, от които сърцето силно се разтуптяваДа храниш врабче.“Ако и вие като мен сте свързвали заглавието на тази книга с едноименния холивудски филм, където неясни калиграфски образци сластно се появяват върху голи тела, недейте. Своеобразният дневник, който представлява „Записки под възглавката“, е изпреден от вниманието към дребните неща и една съзерцателност, която носи духовно удоволствие и въодушевление.Като придворна дама на японската императрица в края на 10-ти век Сей Шонагон пише предимно за дворцовия живот, за светски разговори и поезия, за красиви предмети. От време на време в тона ѝ звънват скрежни нотки безсърдечност, когато излага забележките си относно слугите и нравите им, „простото“ им облекло и поведение. Въпреки тези като цяло очарователни и неизбежни недостатъци на жена, заобиколена от разкош и внимание, тя демонстрира искрен възторг от обаянието на нежната като разцъфнала вишнева клонка Япония. Типичният за епохата, а и за японците като цяло, пиетет към съвършенството на природата води до проницателни наблюдения за всичко, което заобикаля Сей Шонагон. В записките ѝ се долавя онзи покой и хармонично сливане с обкръжаващото, характерно за човек, който няма делнични грижи или някакви особени тревоги, а разполага с времето и възможността просто да се наслаждава на света около себе си с всички сетива.„Изискани нещаБяло наметало върху бледолилава роба.Яйца на дива патица.Гроздов сироп с малки парченца лед в сребърен съд.Кристална броеница.Цветовете на глицинията.Сливов цвят, отрупан със сняг.КоткитеНай-красиви са черните котки със снежнобели коремчета.“Освен множеството занимания с мирски характер, често са описвани и поклонения в храмове, ритуали за духовно пречистване от суетата и цялостно религиозно благоговение, което обаче не звучи показно. За мен то представляваше необходимата тежест за уравновесяване на везните на етичното и естетичното.„Записки под възглавката“ е аранжирана с внимание икебана, автобиографично описание на стремежа към пълно съзвучие на физическото и духовното, към съзирането и осмислянето. Мисля, че всички имаме какво да научим от една средновековна японка."}, {"userName": "Hana", "userReviewDate": "Jan 05, 2015", "userURL": "http://www.goodreads.com/user/show/10571559-hana", "userReview": "A thousand years ago, one evening, a woman picked up her brush, drew it over an inkstone and wrote….In spring it is the dawn that is most beautiful. As the light creeps over the hills, their outlines are dyed a faint red and wisps of purplish cloud trail over them.In summer, the nights. Not only when the moon shines, but on dark nights too, as the fireflies flit to and fro, and even when it rains, how beautiful it is!She was a lady-in-waiting who served ten years in the court of a Heian Empress; her given name has been lost. We know her only by her family name and honorific, Sei Shonagon. Yet she lives in these ancient notes as surely as if she had only just taken off her long, multi-layered court robes and slipped into something comfortable. She makes a few last notes, intimate, poetic, or perhaps a little naughty, and listens to the night sounds of the household….The floor-boards in the ante room are shining so brightly that they mirror everything nearby...The curtains glide smoothly back revealing the lady of the house, who under the faded dark robe she is using as her bedclothing wears a white unlined gown of raw silk and a crimson trouser skirt.In another part of the room ladies are huddled together under a closed blind. A fire is smoldering deep in the incense burner, giving out a scent that is vaguely melancholy and full of a calm elegance. …Late in the evening there is a stealthy tap outside. A lady-in-waiting (the one who always knows what is happening) hurries to the gate and lets in the gentleman visitor. Then with a smug look on her face she stealthily leads him to the lady who has been awaiting his arrival.From one side of the hall comes the beautiful sound of lute music. The player plucks the strings so gently that one can barely make out the notes.Sei Shonagon is such a study in contrasts. She was undeniably bitchy, an inveterate gossip and a dreadful snob. She spent her days in idleness, writing poetry, making snarky comments about the servants and lower classes, and flirting with the courtiers.But Sei Shonagon was also quick-witted, sensitive and fully awake to all the beauties of the world and when she writes like this I cannot help but like her.\nThings That Make One's Heart Beat Faster: Sparrows feeding their young.To pass a place where babies are playing.To sleep in a room where some fine incense has been burnt.To notice that one's elegant Chinese mirror has become a little cloudy.To see a gentleman stop his carriage before one's gate and instruct his attendants to announce his arrival.The ladies of the Heian court were probably allowed more freedom than most Japanese women of the time and despite their modest fans and the curtains that screened them from view there was the possibility of semi-secret liaisons, preceded and followed by a stylized exchange of poetry. And if favors were granted one hoped that all would be graced by a certain style.Frail as a string of bubbles is that ice.A certain victim to the sun’s first rays.The ribbon too will quickly come undone.As though it were the frailest gossamer veil.A good lover will behave as elegantly at dawn as at any other time. He drags himself out of bed with a look of dismay on his face. The lady urges him on: ‘Come my friend, it’s getting light. You don’t want anyone to find you here.’ He gives a deep sigh, as if to say that the night has not been nearly long enough and that it is agony to leave…Indeed, one’s attachment to a man depends largely on the elegance of his leave-takingIf poetry and time travel are your thing take a trip back to tenth century Japan and see the world fresh and vivid through Sei Shonagon’s eyes. Content rating G: There are themes of love and late night meetings, but everything is coded and strictly fade-to-black and softly rustling silk."}, {"userName": "Michael Finocchiaro", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "Less interesting than its closest contemporary, The Tale of Genji, this is another interesting book about the intimate life of the Japanese imperial court during the Heian period (as Genji is as well). It is full of interesting anecdotes and pillow talk (thus the title), but in a less poetic style as Genji which for me remains the reference and the milestone."}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Jan 30, 2014", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "Lovely, amazing, brilliant book from a court lady with spectacular wit and humor. I really need to reread this again some day. When I have a week to spare.I've never had to work so hard to read a book before. It's been years since I've read it, but this book took me days and days to read, mainly because of all the footnotes. And you HAVE to read the footnotes. Every entry had a footnote, and I had to constantly flip back and forth to read it in order to understand the context."}, {"userName": "Jimmy", "userReviewDate": "Mar 10, 2010", "userURL": "http://www.goodreads.com/user/show/1107219-jimmy", "userReview": "\"He spoke to me of Sei Shōnagon, a lady in waiting to Princess Sadako at the beginning of the 11th century, in the Heian period. Do we ever know where history is really made? Rulers ruled and used complicated strategies to fight one another. Real power was in the hands of a family of hereditary regents; the emperor's court had become nothing more than a place of intrigues and intellectual games. But by learning to draw a sort of melancholy comfort from the contemplation of the tiniest things this small group of idlers left a mark on Japanese sensibility much deeper than the mediocre thundering of the politicians. Shonagon had a passion for lists: the list of 'elegant things,' 'distressing things,' or even of 'things not worth doing.' One day she got the idea of drawing up a list of 'things that quicken the heart.' Not a bad criterion I realize when I'm filming; I bow to the economic miracle, but what I want to show you are the neighborhood celebrations.\"-Chris Marker-This excerpt is taken from Chris Marker's San Soleil (Sunless); his surreal filmic travelogue in which the filmmaker meditates on time, cultural paradox, and memory. Memory informs most of the film. As the images flicker randomly, footage from around the world, a British, female narrator intones these ponderous reflections on the soundtrack. Not only is Shōnagon directly referred to in the film, but her particular style of voyeuristic observation most certainly influences Marker's approach as a filmmaker, particularly in the case of San Soleil.Sei Shōnagon was a courtly woman who lived in Heian-Kyo (present day Kyoto). She served as a gentlewoman in the court of Empress Fujiwara Teishi of the famous Fujiwara clan, the dominant clan of the Heian period (roughly from 794 to 1186). In the context of Japanese history, the Heian period was a time devoid of war, and blessed with the idle calm of peace. Makura no Sōshi (The Pillow Book) is a collection of insights, observations, short stories, poetry, and frustrating daily occurrences kept by Shōnagon throughout most her time in the service of empress Teishi. Heian period literature is a notoriously complicated cultural phenomenon for the western reader. An understanding of the cultural mores of Japanese Heian period society, also of its architecture, politics, literary and religious relationship to China, is more or less essential in order to appreciate the true brilliance of the work of Shōnagon or Lady Murasaki. It's in this sense that Shōnagon will appeal to a contemporary western audience. This is because, unlike the sweeping, convoluted narrative of a piece such as The Tale of Genji, The Pillow Book is more intimate, full of ephemeral fragments of courtly life in Heian Japan. Shōnagon is one of those writers who possess the poignancy of the universally relatable and the timeless. For lack of a better comparison, the tiny, cathartic pleasures in life mentioned in the film Amelie resemble Sei's list of \"things that look enjoyable\", or \"things that create the presence of deep emotion\". In other words, one doesn't necessarily require a full background knowledge of Japanese culture to be capable of relating to Sei's aesthetic predilection, albeit the sub-narratives that weave in and out of The Pillow Book are more esoteric, and mainly entail historical gossip as well as stories about poetry competitions.There are, of course, two sides to Shōnagon; one is that of the pleasant servant of empress Teishi who enjoys reciting poetry and commenting on the beauty of her pastoral surroundings, the other is a socially duplicitous misanthrope. Her contemporary, and stylistic opposite Murasaki Shikubu (author of Genji Monogatari (The Tale of Genji)) mentioned something to this affect in her diary, \"Sei Shōnagon ... was dreadfully conceited. She thought herself so clever and littered her writings with Chinese characters; but if you examined them closely, they left a great deal to be desired. Those who think of themselves as being superior to everyone else in this way will inevitably suffer and come to a bad end, and people who have become so precious that they go out of their way to try and be sensitive in the most unpromising situations, trying to capture every moment of interest, however slight, are bound to look ridiculous and superficial. How can the future turn out well for them?\" One does get this sort of impression from several passages in The Pillow Book. First off, Sei was a class snob; she repeatedly criticizes the attire of the poverty stricken, as well as their manners. She clearly had a pretty short temper, and little patience for the idiosyncrasies of those around her. And a majority of the positive lists that she mentions mainly have more to do with the beauty of nature, or the complexity of poetry, rather than musings on how wonderful people are in general. It's difficult to imagine that this wasn't simply part and parcel of the sensibility of her age. Heian courtly life was so idle and lackadaisical to the point where petty back-stabbing and spreading vitriolic gossip must have seemed like popular pastimes.The Pillow Book is most effectively enjoyed in fragments; a good book to pick up at random. There really isn't much of a unifying story, and it seems that the most erudite scholar still runs into difficulty in the matter of coming up with a chronology in relation to the layout of the book. Herein lies its charm though: that of leisurely digesting these observations and considering how much you might be inclined to agree or disagree. And Shōnagon's writings are immensely charming if nothing else."}, {"userName": "Edward", "userReviewDate": "May 22, 2014", "userURL": "http://www.goodreads.com/user/show/5895486-edward", "userReview": "AcknowledgementsChronologyIntroductionFurther ReadingNote on the Translation--The Pillow BookAppendix 1: PlacesAppendix 2: People and Where They AppearAppendix 3: TimeAppendix 4: Glossary of General TermsAppendix 5: Court Ranks, Titles and BureaucracyAppendix 6: Clothes and Colour GlossaryNotes"}, {"userName": "pearl", "userReviewDate": "May 25, 2009", "userURL": "http://www.goodreads.com/user/show/1421798-pearl", "userReview": "Incredible, witty, beautiful prose. Shonagon Sei was a sarcastic and insightful woman who was unafraid to air out her own prejudices (staples among her lists of hated things: commoners, and exorcists who fall asleep on the job), as well as her love for all things beautiful and the mildly hilarious. Many call this the earliest \"blog\" in history, but it's much more than that. It's a vivid, if not remarkable look into Heian court life through the eyes of a strong Japanese woman, a true individual of that time.My favorite sections were when Sei discusses the Royal Family, specifically the young Empress, whom Sei waited upon. Different from the other passages, which vary between bitingly sarcastic portrayals of her peers to descriptions of beautiful landscapes, the entries about the Empress are colored with much more gentle and affectionate emotions. Disarmingly human. It is friendship, adoration, and poetic lyricism all in one. A favorite passage from the book:“Once when I had gone to Kiyomizu Temple for a retreat and was listening with deep emotion to the loud cry of the cicadas, a special messenger brought me a note from Her Majesty written on a sheet of red-tinted Chinese paper: Count each echo of the temple bell As it tolls the vespers by the mountain’s side. Then you will know how many times My heart is beating out its love for you.‘What a long stay you are making!’ she added. ‘Surely you realize how much I miss you.’Since I had forgotten to bring along any suitable paper, I wrote my reply on a purple lotus petal.”"}, {"userName": "umberto", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/2580971-umberto", "userReview": "This famous 10th-century Japanese journal \"The Pillow Book\" (Penguin, 2006) by Sei Shonagon translated by Dr Meredith McKinney is a bit more descriptive than its predecessor \"The Pillow Book by Sei Shonagon\" (Penguin, 1981) translated by Dr Ivan Morris as we can see to compare, tentatively, from the following extracted paragraphs:[1]* In spring, the dawn -- when the slowly paling mountain rim is tinged with red, and wisps of faintly crimson-purple cloud float in the sky.In summer, the night -- moonlit nights, of course, but also at the dark of the moon, it's beautiful when fireflies are dancing everywhere in a mazy flight. And it's delightful too to see just one or two fly through the darkness, glowing softly. Rain falling on a summer night is also lovely.... (p. 3)Morris's text:1. In Spring It Is the DawnIn spring it is the dawn that is most beautiful! As the light creeps over the hills, their outlines are dyed a faint red and wisps or purplish cloud trail over them.In summer the nights. Not only when the moon shines, but on dark nights too, as the fireflies flit to and fro, and even when it rains, how beautiful it is! ... (p. 21)However, the following seem to surprise us as the reverse, in terms of descriptiveness:[4]* It breaks my heart to think of parents sending a beloved son into the priesthood. Poor priests, they're not the unfeeling lumps of wood that people take them for. They're despised for eating that dreadful monastic food, and their sleeping arrangements are no better. A young priest must naturally be full of curiosity, and how could he resist the forbidden urge to peep into a room, especially if there's a woman in there? But this is criticized as disgraceful too.... (pp. 7-8)Morris's text:6. That Parents Should Bring Up Some Beloved SonThat parents should bring up some beloved son of theirs to be a priest is really distressing. No doubt it is an auspicious thing to do; but unfortunately most people are convinced that a priest is as important as a piece of wood, and they treat him accordingly. A priest lives poorly on meagre food, and cannot even sleep without being criticized. While he is young, it is only natural that he should be curious about all sorts of things, and, if there are women about, he will probably peep in their direction (though, to be sure, with a look of aversion on his face) What is wrong about that? Yet people immediately find fault with him for even so small a lapse.... (pp. 25-26)Being not a Japanese reader and nearly equally enjoying reading both texts, I have no idea which translated text is finer; therefore, such a decisive verdict should be honored to a committee whose Japanese and English scholarship has been acknowledged. If there are some Sei Shonagon newcomers who would like to start something simpler and manageable, I would recommend \"The Pillow Book of Sei Shonagon: The Diary of a Courtesan in Tenth-Century Japan\" (Tuttle, 2011) translated by Arthur Waley.Of course, we've long known this book's fame due to the formidable lady writer's witty observations, sense of humor, ancient traditions, etc. in which they undeniably reflect Japan's high level of literacy in the tenth century. In a word, there are innumerable scholars and Japanophiles who have since written and studied on this unique book as one of the great literary works of Japan. Thus, in my humble review I'd like to raise a point related to my observation first made after reading \"Aubrey's Brief Lives\" (Penguin, 1982) [https://www.goodreads.com/review/show...]The point concerns with illegible calligraphy, ลายมือเหมือนไก่เขี่ย, in an informal, spoken Thai phrase and I was amazed to come across an English phrase with a similar meaning as narrated in my Aubrey review. Surprisingly, I didn't expect to find another mentioned in this ancient work cited as follows:You'd think that when some fine lady who's surrounded by a bevy of gentlewomen plans to send a message to someone of particular distinction, she should safely assume that none of her ladies would write it in some dreadful chicken scrawl. ... (p. 153)The phrase in question 'in some dreadful chicken scrawl' depicting such illegibility has its apt meaning similar to the Thai phrase. This suggests at least two points: (1) Chicken as household fowls have long since been domesticated and observed regarding their lives, nature, habits, etc. and (2) Writing legibility has long since been admired, respected and treasured as one of the true attributes of scholarship.In brief, reading this book is worth spending our time since we can learn how they lived, behaved and interacted in the court around a thousand years ago in Japan. As such, I think, we simply can't help but admire the nostalgic glimpses brilliantly penned by one of the highly-educated courtesans, a smart Japanese court lady named Sei Shonagon."}, {"userName": "Annie", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/38036772-annie", "userReview": "This review reads more like a review of Sei Shonagon as a person, which is accurate. The Pillow Book is Sei Shonagon, cut and bound into book form. With that in mind... Sei.You know how when you’re out, you meet someone who seems like a ditzy party girl—she’s super drunk and slutty and lots of fun, but doesn’t seem particularly intelligent? And you know how most of the time that’s an accurate assessment, but sometimes you start talking to her and she ends up quoting Hegel at you, or tipsily pointing out similarities between the respective poems of Catallus and Walt Whitman? That’s Sei Shonagon. Yes, she loves fashion and flirting and inane gossip. Wearing makeup and putting on perfume makes her disproportionately happy. She’s a snob who looks down on “common people\" and she's kind of an asshole (she publicly humiliates a guy whose house just burned down).But she’s so fucking smart and well-read and observant and intellectual. She spends a lot of time giving men well-deserved tongue lashes and intimidating them with obscure literary references. And she rescues a dog that the emperor (a cat person) exiled and then ordered beaten. Also, she’s such an egomaniac and I love it. She literally cannot comprehend why people might dislike her. It’s beyond the capacity of her mind to grasp. I love it.Sei really likes lists. About half of this book consists of little lists. She loves listing things that are delightful, dispiriting, infuriating, or amusing. Or common things that suddenly sound special. Or Things that lose by being painted (if you're curious: cherry blossoms, men and women described in tales as looking splendid) and things that gain by being painted (likewise: pine trees, autumn fields, mountain villages). One of the things she lists as “dispiriting” is adult children overhearing their parents have sex. Lol yes, Sei, that would definitely count as dispiriting. And she’s infuriated by dogs that bark when she’s trying to sneak her secret lovers into her bed. Fair enough. She also can’t stand bad morning-after sex etiquette, like a man leaving too soon or not soon enough. Or when they take too long to send the obligatory morning-after poem. I hear you, Sei, I do. Plus ça change, plus c'est la même chose. Everyone and everything is pure poetry when she perceives it, and they delight her as much as they annoy her. She likes everything just so. She’s fond of fresh paper, cherry blossoms, moonlight, anything violet, gossip, the empress, and poetry.She has an ex-husband. They never got divorced, they just kind of stopped being married when they felt like it. And now they’re chill and help each other get laid and he’s like her big brother (she actually says this) and they tease each other good-naturedly. Normal ex-spouse relationship. You know. (I actually think this is adorable). Sei’s very successful in the world she lives in, because she’s smart and well-read, and therefore writes excellent, witty poetry. And in Heian Japan, it’s poetry or die. Seriously, your skill as a poet makes or breaks your social position, your marriage prospects, your success in romance (totally unrelated to your marriage prospects—everybody is expected & assumed to have affairs regardless of gender and social class, and they’re kept almost in plain sight with more “wink wink nudge nudge” than shame attached), and everything else you can imagine. Heaven help you if you write bad poetry. Back to Sei. She makes me laugh. She makes me want to grab her hands and have a long, wild conversation that lasts until dawn, populated with many “I know! Isn’t that the worst?!” To your list of “things that make my heart beat fast,” Sei, I’m going to add “The Pillow Book.”"}, {"userName": "umberto", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/2580971-umberto", "userReview": "3.5 starsImpressively I found this translated book by Dr Ivan Morris interestingly enjoyable, informative and more in detail than the one by Dr Arthur Waley in the same title (Tuttle, 2011) since it totally comprises 185 topics followed by each translated text. Unfortunately, this book is not the complete translation because you have to read it in another one by another publisher, that is, Oxford University Press and Columbia University Press, 1967 (p. 16). In the meantime, I think we should be content with this fine rendering and these three extracts presented here are for you to try his English version:1. In Spring It Is the DawnIn Spring it is the dawn that is most beautiful. As the light creeps over the hills, their outlines are dyed a faint read and wisps of purplish cloud trail over them.In summer the nights. Not only when the moon shines, but on dark nights too, as the fireflies flit to and fro, and even when it rains, how beautiful it is!… (p. 21)13. Depressing ThingsA dog howling in the daytime. A wickerwork fish-net in spring. A res plum-blossom dress in the Third or Fourth Months. A lying-in room when the baby has died. A cold, empty brazier. An ox-driver who hates his oxen. A scholar whose wife has one girl child after another.One has gone to a friend’s house to avoid an unlucky direction, but nothing is done to entertain one; if this should happen at the time of a Seasonal Change, it is still more depressing.… (p. 40)29. Elegant ThingsA white coat worn over a violet waistcoat.Duck eggs.Shaved ice mixed with liana syrup and put it in a new silver bowl.A rosary of rock crystal.Wistaria blossoms. Plum blossoms covered with snow.A pretty child eating strawberries. (p. 69)"}, {"userName": "Akemi G.", "userReviewDate": "Aug 13, 2015", "userURL": "http://www.goodreads.com/user/show/28637268-akemi-g", "userReview": "Sei Shonagon is brilliant. She was a lady-in-waiting for Empress Teishi, the first empress of Emperor Ichijo. Ichijo loved her dearly, but when Teishi's father died prematurely due to infectious disease, his younger brother, Fujiwara no Michinaga, rose to power, and Michinaga pushed his daughter, Shoshi, as Ichijo's additional empress. Teishi stayed in His Majesty's palace (the emperor could have multiple wives and consorts anyway), but was distressed. Sei Shonagon tried to comfort Her Highness with her wit, which eventually resulted in this delightful collection of essays. (Teishi, by the way, died shortly after Shoshi came ...)You can sense Sei Shonagon's frustration in her sharp sense of humor. But then, this book is not about politics. It's about the joy of life. With all the unreasonable things happening in life, the world is beautiful, and there are moments when we can truly celebrate it. Sei Shonagon values \"okashi\" (delightful, enchanting, interesting) as opposed to \"aware\" in The Tale of Genji written by her contemporary Murasaki Shikibu. If you thought Genji was too watery with all the tears and morning dews, you might like this book better. Another major difference between the two is, of course, Genji is a giant novel whereas Pillow is a collection of short essays. Reading The Pillow Book is like reading your friend's FB updates--a friend who is witty, who is not afraid to say what she has to say, and who is fundamentally a good person. Re the English translationI read this in the original Japanese. There are several English translations, each by a different translator. I have not examined any of this, but the one by Meredith McKinney might be good--I've heard good things about her translation of Kusamakura. The one from Tuttle has anachronistic cover art--this book was written around 1000 and the cover shows Edo to early Meiji style woman, perhaps from the 19th century--which raises a question how sound the translation might be.UpdateI'm reading the translation by Ivan Morris. It's fair. However, note that he skips several chapters; so it's not a complete translation, and the chapter numbers don't match with the original."}, {"userName": "Justin Evans", "userReviewDate": "Apr 30, 2016", "userURL": "http://www.goodreads.com/user/show/2184529-justin-evans", "userReview": "It's always nice to find a classic that's entertaining; consider Don Quixote. It's even nicer when that classic can be read in ten minute increments just before bed, and I recommend that everyone do precisely that with The Pillow Book. There are plenty of novels out there, plenty of poetry collections, popular philosophy books, essay collections, lots of literary criticism, memoirs and so on. This combines all of those things, and does all of them well. I could quote at great length, but won't. Here's a couple of bits that I enjoyed: 185: Nothing in all the world could be worse than a man or woman who turns out to use words vulgarly... it's actually not a bad thing to use vulgar or unseemly words intentionally, knowing them for what they are. What's astonishing is when someone produces a word from their private store without pausing to consider its nature. 243: I particularly despise people who express themselves poorly in writing. Amen, Sei, Amen. I'd also like to recommend that everyone get this newer Penguin edition, translated by Meredith McKinney. Even if you knew nothing of Heian Japan (and I know very little), you'd still be able to enjoy the writing and wit thanks to McKinney's translation and notes. A model of scholarship for the common reader."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Jun 03, 2010", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I didn't expect to like this. But Sei Shonagon was blogging centuries before blogs existed. Her writings in her pillow book vary from lists of unpleasant things to descriptions of fashions to funny stories from the Japanese court life. The tone is a mixture of self-righteousness and wonder, which is why I kept thinking of Harriet the Spy. I learned a lot about Japanese culture at the time, almost by accident. And the Morris translation is heavily footnoted.\"There's really something sad about a woman with an ugly face.\"\"If I do not come first in people's affections, I had just as soon not be loved at all; in fact I would rather be hated or even maltreated. It is better to be dead than to be loved in the second or third place. Yes, I must be first.\"\"Whatever people may think of my book, I still regret that it ever came to light.\""}, {"userName": "Paige", "userReviewDate": "May 14, 2009", "userURL": "http://www.goodreads.com/user/show/719629-paige", "userReview": "What a marvellous tale of how Heian court life was. It was amazing how much I found myself relating to Shonagon even though her life was very very different than that of mine, let alone modern day society. Her lists and her style of writing have been somewhat inspiring (speaking as a writer) and have showed me how amazing the art of writing truly is and has always been. I can see why Aidan Chambers was inspired by the poems and the style of Shonagon's Pillow Book."}, {"userName": "Jennifer", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/3909756-jennifer", "userReview": "I've never read a book quite like this one. It's not a \"pick up and read in one sitting\" kind of book. But it does provide an interesting lens into late 10th, early 11th century Heian Japan (told from the point of view of a gentle woman who tends to an Empress)."}, {"userName": "Adéla", "userReviewDate": "Nov 02, 2013", "userURL": "http://www.goodreads.com/user/show/20092194-ad-la", "userReview": "Některé části docela zajímavé (jak se Paní Sei vsadila, že sněhová hora vydrží do určitého data, a jak ji zákeřně sabotovali:) jiné nuda (bez toho, že červené kabátky jsou slušivé a které stromy vypadají pěkně, bych se klidně obešla). Prostě deníček všeho možného."}, {"userName": "Heidi Nemo", "userReviewDate": "Jan 24, 2008", "userURL": "http://www.goodreads.com/user/show/722615-heidi-nemo", "userReview": "A window into the mind of a courtier from another time.She's by turns sharply observant, competitive, emotionally self-absorbed, and incredibly aesthetically finely honed. But simply as this--a diary, 1,000 years old--it is a valuable thing indeed."}, {"userName": "umberto", "userReviewDate": "May 26, 2014", "userURL": "http://www.goodreads.com/user/show/2580971-umberto", "userReview": "I preferred this memoir-like book less than its contemporary one \"The Gossamer Years\" (Tuttle, 1964) translated by Edward Seidensticker. Translated by Arthur Waley, one of the great Orientalists, its recorded episodes have been fragmentary, presumably newly compiled under headings for more ease in reading as well as following the author’s train of thought.This information related to “The Gossamer Years”, I think, should throw more light on our understanding:Very little is known of the author outside of what is related in her diary. Her name is unknown – but she was related to the Lady Murasaki, author of The Tale of Genji, and to Sei Shonagon, author of The Pillow Book. (Goodreads)Moreover, from the forward by Dennis Washburn, we know that this book presents “a vivid narrative voice in essays that present her views on many different topics dealing with proper etiquette, literary taste, or the ideal courtier.” (p. 17) Even though we can find another full-length English translations by Ivan Morris and Meredith McKinney, we should read this one since “ …, Waley continues to be revered and his work still read, and deservedly so – not simply because of his historical importance …, but because the beauty of his prose captures the artistic spirit of a brilliant and fascinating woman of Heian Japan.” (p. 19)However, having recently read its translation by Dr Ivan Morris in the same title (Penguin, 1981), I found this book has notably been supplemented by Dr Arthur Waley’s remarks followed by his translated texts, in other words, we would read his added explanatory lines then his translation deemed appropriate from the original Japanese book. Thus, its opening paragraph on page 23 and its subsequent 47.5 pages should be read as a lengthy introduction till we find the first topic, MASAHIRO. To allow my readers to be familiar with his style from its first paragraph extracted, the first topics are presented for you to try.MASAHIROEveryone laughs at Masahiro. It must really be very painful for his parents and friends. If he is seen anywhere with at all a decent-looking servant in attendance upon him, someone is sure to send for the fellow and ask him whether he can be in his senses, to wait upon such a master. Everything at his house is extremely well done and he chooses his clothes with unusually good taste; but the only result is to make people say: “How nice those things would look on anyone else!” … (p. 71)ANNOYING THINGSWhen one sends a poem or a kayeshi (“return-poem”) to someone and, after it has gone, thinks of some small alteration – perhaps only a couple of letters – that would have improved it. … (p. 76)VERY TIRESOME THINGSWhen a poem of one’s own, that one has allowed someone else to use as his, is singled out for praise.… (p. 81)etc.Furthermore, these are the following topics in which you may read as you like. MISCELLANEOUSNARINOBUTHE STORMPILGRIMAGE TO THE HASEDERASTRAY NOTESPRETTY THINGSCHILDRENTHINGS THAT GIVE ME AN UNCOMFROTABLE FEELINGTOOTHACHEILLNESS"}, {"userName": "Julie", "userReviewDate": "May 03, 2008", "userURL": "http://www.goodreads.com/user/show/65647-julie", "userReview": "I haven't finished this book yet, but have read a lot of it. I skip over some of the daily accounts in favor of the lists / observations / character sketches. I need to go back and fill in the blanks, but it might be awhile before I get to it. For now:A \"pillow book\" is a collection of random notes, character sketches, lists, poems, and observations that the Japanese upper class during the Heian period might have kept in the drawers of their wooden pillows. Having an example of the pillow book genre is so intriguing! It's a great snapshot of the life and attitude of the Japanese upper class at the time.There's tension in this pillow book because Shonagon claims she wants to keep her thoughts private while clearly writing for an outside audience. And oh, what colorful thoughts she has! Sei is arrogant, privileged, and oblivious or offensive to people she calls \"completely insignificant\" (think servants, common people, even lowly priests). At one point she mocks a man whose house has burned down by giving him what appears to be an alms slip -- he cannot read, so he thinks she has given him charity -- with a hateful poem written on it instead of alms. The fact that she writes this account in her (widely-read) pillow book and describes it with great mirth suggests that her attitude was common and acceptable among ladies of her rank.Despite her obvious flaws, Sei appreciates beauty and sympathy (okay, apparently only for the upper class) and humor. I was very surprised by the humorous, playful, confident tone in this text. If someone had mentioned a Japanese woman's diary from the year 900 to me, I'd have assumed it was dry and boring. Not so at all! For the history, Sei's colorful personality, and the fascinating genre of the pillow book itself, this text gets 4 stars."}, {"userName": "Bob", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/2432880-bob", "userReview": "The element of The Tale of Genji which appealed most to me was its exoticism, which The Pillow Book, or at least these extracts, captures without any of the effort of following the former's plot echoes, characterization, and psychological nuances. Sei Shonagon can't capture Murasaki's deep sense of the tragic evanescence of life, but the lack only makes her more appealing, in some ways, to a modern reader."}, {"userName": "Hal O'Brien", "userReviewDate": "Apr 24, 2012", "userURL": "http://www.goodreads.com/user/show/2797330-hal-o-brien", "userReview": "Written at the turn of the 10th Century CE, Shonagon is easily the first blogger. Lists, streams of consciousness, the minutiae of everyday life, insights on the larger culture of the Heian period of Japan... It's all here. The West wouldn't see anything like it until Montaigne and Pepys."}, {"userName": "Orinoco Womble (tidy bag and all)", "userReviewDate": "Oct 03, 2015", "userURL": "http://www.goodreads.com/user/show/20738920-orinoco-womble-tidy-bag-and-all", "userReview": "A calming, fascinating and hugely enjoyable read. I didn't know what to expect when I started this, but what I got was immensely satisfying. This is a book to be sipped slowly, like a fine brandy. Lots of footnotes, lots of things to think about. A thousand years old and really not much has changed, though so much has changed so much.Sei Shonagon was a lady in waiting (for lack of a better term) to the Empress in Kyoto, over a thousand years ago. The Pillow Book is very much like what used to be termed a \"pocket book\" in the 17th-19th centuries: personal notes, memories, poems the author wrote herself or liked, lists of things she liked or disliked. Ostensibly private, it was however a conscious effort at \"spin\": the author was a member of one ruling clan which felt threatened (with reason, as it turned out) by the rise of another. Sei Shonagon presents an intentionally crafted view of life at the Kyoto court, with emphasis on how \"delightful\" and charming it all was. (However, she's not above being catty at times, and even a bit petty: in her view \"the lower orders\" shouldn't even admire their betters, as praise coming from the mouths of the hoi polloi is actually degrading!) At a time when Buddhism and Shinto were officially at loggerheads, we are given many descriptions of pilgrimages and ceremonies, from processions to shamanistic healing sessions. Who knew that a thousand plus years ago, sleeves were so important! For men and women both, the layered effect of kimono sleeves was important enough to make sure they were carefully arranged and in the right colours. If no one was there to see the effect it could spoil an outing in a carriage! Women spent a lot of their time sitting behind blinds and screens, but they managed to see everything they wanted to see. They must have done most of their sleeping during the day, as there are repeated references to sitting up talking all night until the servants bring around the morning washing water. Sei was apparently married, though her husband disappears early in the narrative, and there are several references to amorous encounters that can't all be based on hearsay! Living in a traditional open-plan Japanese building without inner walls doesn't seem to have cramped anyone's sexual style, either. Though Sei had at least two children, they are never mentioned, probably because pregnancy and motherhood were not sophisticated and charming.The contrast between life in the court of Japan in about the year 970 and in Europe of the same period was intriguing. Over a thousand years ago the Japanese fascination with beautiful paper products and getting \"the correct paper\" for a particular use was already in place. Apparently it was the gift of a large quantity of top-quality paper that inspired the author to \"make a bound book\" (hand-bound, too) and start writing. Later she sent a draft of it to the princess, only to have the messenger fumble the parcel and drop it down the stairs!The translation by Meredith McKinney is absolutely wonderful, preserving the freshness of narration without using ultra-modern turns of phrase that would grate on the ear. Though the numerous footnotes require quite a lot of flipping back and forth, they add a great deal to the reader's understanding.This is a book that repays repeated readings, like listening to a favourite piece of music. It almost inspires me to start my own journal again, after a hiatus of nearly 40 years."}, {"userName": "Gwern", "userReviewDate": "Jul 13, 2016", "userURL": "http://www.goodreads.com/user/show/11004626-gwern", "userReview": "While the descriptions of natural beauty are admirable, and some of the anecdotes of court life are interesting, much of the material is boring and Shonagon herself has ugly streaks of elitism in her outright contempt for anyone lower than herself (eg casually declaring that lower-class women should not even be allowed long or medium-length hair, an opinion which is certainly not 'delightful') and fawning admiration over anyone higher than her, particular the thoroughly unimpressive emperor/empress, and her endless fascination with the emblems of rank such as expensive clothing, which she apparently considers to be the full measure of a human and little else about them requires description.For a skilled poet and one with such recall of Chinese & Japanese classics, it's distressing to see how little insight she apparently has into anything and anyone, how much learning without wisdom; the court and its pretensions and hanger-ons surely invited sharp criticism, or at least some awareness of its faults, but Shonagon manages to conceal any such insight. No wonder Murasaki Shikibu thought little of her. The translator warns that\"Similar opinions have continued to be expressed down the centuries, and modern scholars (men) have often been equally irritated by her. She has been dismissed by some as a mere chatterbox of a woman, and _The Pillow Book_ considered to be nothing more than a silly gentlewoman’s idle thoughts spilling themselves haphazardly on to the page. It is common in Japan to contrast her with Murasaki Shikibu, and those who side with Sei Shōnagon in this perceived rivalry are often characterized as vacuous and frivolous.\"Indeed."}, {"userName": "Sydney ", "userReviewDate": "Oct 15, 2016", "userURL": "http://www.goodreads.com/user/show/45380743-sydney", "userReview": "This is one of my favorite books to read again and again. Every time I read it, it's as if I'm floating down a calm river, just like the first time I read it.There is something so simple, yet so interesting about this book. I am pleasantly surprised that I like this book as much as I do, considering that Japan isn't usual a box that I tick when looking for reading material. (Maybe it should be?)The candid descriptions definitely help you imagine life as the writer tells you about her everyday life. You just feel 'involved' in the story. There are so many details that surround the simplest of chores; and the writer shares them all with you. I recommend it if you enjoy Japanese culture or history; or, even if you just enjoy reading journals. :)"}, {"userName": "Ανδρέας Μιχαηλίδης", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/56396157", "userReview": "Ομολογώ πως αδυνατώ να καταλάβω γιατί αυτό το βιβλίο θεωρείται αριστούργημα της ιαπωνικής πεζογραφίας, ή της πεζογραφίας γενικότερα (πρόκειται για μια αποσπασματική έκδοση που με έπεισε απόλυτα να μην διαβάσω το πλήρες κείμενο). Όπως ευθαρσώς λέει, είναι ένα ημερολόγιο. Περιγράφει εικόνες, προσωπικές εντυπώσεις κι ένα σωρό άλλα πράγματα. Αυτό είναι και το βασικό πρόβλημα: \"πρσωπικές\". Δυσκολεύομαι να καταλάβω γιατί κάποιος να βρίσκει τόσο ενδιαφέρουσες τις τετριμμένες σκέψεις ενός άλλου ανθρώπου, ακόμη κι αν ο άνθρωπος αυτός ήταν γυναίκα αυλικός στην Ιαπωνία του 11ου αιώνα. Πράγματι, είναι ένα παράθυρο στην εποχή και αυτό έχει κάποιο ακαδημαϊκό ενδιαφέρον, αλλά ως εκεί. Η ίδια η συγγραφέας λέει για το βιβλίο: \"Πώς θα τολμήσουν οι τυχαίες φλυαρίες μου να συγκριθούν με τα τόσα εντυπωσιακά βιβλία που υπάρχουν στις μέρες μας;\" Τείνω να συμφωνήσω μαζί της."}, {"userName": "sanny", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/8606081-sanny", "userReview": "Beautiful ThingsFlashes of wit, impunity, tenderness. Contradictions and multiple facets of Sei's character. Unabashed honesty, pettiness and surprising piety. Annoying ThingsIntrusions to the actual entries from the translator, which usually ended as abruptly as they started. The explanations were helpful, but the inconsistent way in which things were explained (some via footnotes, some directly slipped between the paragraphs) can be confusing. Definitely affected my enjoyment of reading this, therefore the 2 stars. I'm inclined to rate the content 4 stars actually.Things to PonderHow the most famous literature of this era had come from women rather than men, as opposed to China. Apparently this was attributed to the men usually trying to emulate the great Chinese poets, whereas the women were less restrained by norms and as a result produced more authentic, lasting works.The Value of TrivialitySei Shonagon fussed over the most trivial things, and perhaps she could be seen as shallow and aloof to the greater issues of the world. Hers might only have been a reflection of idyllic court life, and there might have been real suffering beyond the palace. Yet, I felt that what she's experiencing and her 'first-world complaints', so to speak, are bygone rarities that we in this current shambolic era do not have the luxury to express as nonchalantly as she did. We should be so lucky when our most pressing concerns consist of pretending to be asleep, to no avail, when someone you're not in the mood of seeing come a-knocking in the wee small hours of the morning, the nerve! Frankly I'm not sure which is better, living in trying times but developing a more wordly and magnanimous heart, with many suffering the consequences of dire decisions; or in an idyllic one where one is more self-centred, but the general populace happier on the whole in a simpler, small-minded world if you will. Well if anything, change will come. As Sei Shonagon's trivial but relatively peaceful era had passed, so will our erratic, exciting(?) one give way. When change does sweep through our current times, may it be for peace and joy. (gosh I sound like a beauty pageant contestant. But really.) I sure hope the complaints in my no-holds-barred pillow book would only be trivial, petty ones - not because I'm shallow (though I am a lot of the time ^^), but because it's afforded by a life and world well worth living."}, {"userName": "Maria Stancheva", "userReviewDate": "Nov 02, 2012", "userURL": "http://www.goodreads.com/user/show/5746944-maria-stancheva", "userReview": "Плавно и красиво потъване в живота на двора на японския император в началото на 11 век. Описания на случки и начин на мислене, които първоначално стряскат със своята различност, а малко по-късно очароват и стават все по-разбираеми с всяка прочетена страница. Сей Шонагон е една типична жена, било то и японка от свитата на японската императрица и като такава и позволява да се хвали и изтъква по един прекрасен начин,но винаги изискан, винаги. Учудиха ме и нравите в самия двор - можеш дълги години да си криеш лицето от най-близките ти хора от свитата - с помощта на паравани, ветрила или ръкавите на горните роби - но пък няма проблем да пратиш едно закачливо тристишие за цъфналата слива, снега навън и шумоленето на завивките на изгрев слънце, нещо което се осъществява бързо и в различни конфигурации. Понятието за вярност е тотално непознато като в шинтоистките, така и в будистките традиции на японците. Хубавото е, че има някаква честност в разпределението на благата. Прочетете книгата, странна е, но впечатлява с размисли и структура на речта."}, {"userName": "Laura", "userReviewDate": "Nov 19, 2010", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "Set in 10th Century Japan, this is the third thriller inspired by the diaries of Sei Shonagon.Lady Shonagon and Lieutenant Yukinari return to investigate a murder in the Palace of the Sun Goddess. A favourite of the Emperor is found drowned in a pool in the Palace Gardens. But before Yukinari can investigate, the body is given a ceremonial burial and all trace of the crime washed away by the spring rains.By Robert Forrest.Shonagon - Ruth GemmellYukinari - Mark BazeleyEmperor - Simon GintyEmpress - Laura ReesGisaku - Robin LaingProducer - Lu Kemp."}, {"userName": "Jan", "userReviewDate": "Mar 20, 2012", "userURL": "http://www.goodreads.com/user/show/8298408-jan", "userReview": "Sei Shōnagon was a terrible snob! I enjoyed the passages describing events at court, conversations, and love affairs. The lists of what is and isn't good were dull. Shōnagon's attitude to those of lower rank grated on me. She seems to embody all that is worst in the rich and vacuous. Perhaps something was lost in translation, but I didn't see how she came to have a reputation as a wit. I preferred the Diary of Lady Murasaki for its observations on court life and for its intelligence."}], "description": "\"The Pillow Book of Sei Shonagon\" is a fascinating, detailed account of Japanese court life in the eleventh century. Written by a lady of the court at the height of Heian culture, this book enthralls with its lively gossip, witty observations, and subtle impressions. Lady Shonagon was an erstwhile rival of Lady Murasaki, whose novel, \"The Tale of Genji,\" fictionalized the elite world Lady Shonagon so eloquently relates. Featuring reflections on royal and religious ceremonies, nature, conversation, poetry, and many other subjects, \"The Pillow Book\" is an intimate look at the experiences and outlook of the Heian upper class, further enriched by Ivan Morris's extensive notes and critical contextualization.", "title": "The Pillow Book of Sei Shonagon", "url": "http://www.goodreads.com/book/show/1193905.The_Pillow_Book_of_Sei_Shonagon", "average": 4.02, "cover": "https://images.gr-assets.com/books/1464244634l/1193905.jpg", "reviews": 411, "authors": [{"url": "https://www.goodreads.com/author/show/10983.Sei_Sh_nagon", "name": "Sei Shōnagon"}, {"url": "https://www.goodreads.com/author/show/4136952.Ivan_Morris", "name": "Ivan Morris"}], "type": ["Fiction", "Cultural", "Writing", "Historical", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/1193905.The_Pillow_Book_of_Sei_Shonagon", "http://www.goodreads.com/book/show/18185.The_Pillow_Book", "http://www.goodreads.com/book/show/6440058", "http://www.goodreads.com/book/show/322655.Notes_de_chevet", "http://www.goodreads.com/book/show/18187.The_Pillow_Book", "http://www.goodreads.com/book/show/8980058-the-pillow-book-of-sei-shonagon", "http://www.goodreads.com/book/show/22840437", "http://www.goodreads.com/book/show/15979963", "http://www.goodreads.com/book/show/36641314-el-libro-de-la-almohada", "http://www.goodreads.com/book/show/18104130", "http://www.goodreads.com/book/show/3996418-the-pillow-book-of-sei-shonagon", "http://www.goodreads.com/book/show/169352.The_Pillow_Book_of_Sei_Shonagon", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}