{"ratings": 196710, "userreviews": [{"userName": "sleeps9hours", "userReviewDate": "Jun 29, 2012", "userURL": "http://www.goodreads.com/user/show/1381799-sleeps9hours", "userReview": "I just read Kelly McGonigal's \"The Willpower Instinct\", so I can't help but compare the two.Duhigg is an investigative reporter for the NY Times, while McGonigal is a research psychologist, and the differences come across in the writing. McGonigal has a much better grasp on the research and how to apply it, while Duhigg brings in stories that are entertaining but stretch his powers of interpretation. His most annoying stylistic problem is that he breaks his stories up, stopping one to start another and then coming back to it later. I assume he's trying to add a sense of anticipation and drama to what should otherwise be a straightforward nonfiction book, but I found it frustrating for him to be jumping back and forth for no good reason.I did enjoy many of his stories though. The most interesting was in the section about social habits where he explains why the arrest of Rosa Parks was so influential while other black women at the same time had also refused to give up their seats but didn't spark much interest (Parks had social ties across dozens of groups, black and white, and knew some people of influence). The entire story of how Martin Luther King, Jr. became involved, and all the people who got the bus boycott rolling is so fascinating to hear in detail."}, {"userName": "Robert Chapman", "userReviewDate": "Sep 14, 2012", "userURL": "http://www.goodreads.com/user/show/12827408-robert-chapman", "userReview": "This is great book, and you need to read it. How is that for a definitive opening line? The reason it’s such a good book is because it uses research to explain how habits are formed and changed. Everyone knows someone who was out of shape, or was a smoker, and then in what appeared as if almost overnight, changed themselves in a short period of time. How did they do that? They formed new habits and changed old ones, that’s how.Do something enough and it becomes a habit, good or bad. This is explained in the book by research on memory loss. For example, the research found that patients suffering from memory loss could not show someone where the kitchen is when asked, but once they got hungry the would get up and go to the kitchen automatically.This is made possible by the habit loop of cue, routine, and reward. The cue makes the brain find the routine as it anticipates the reward. A classic example is stress and smoking, the cue is stress, the routine is smoking, the reward is the feeling the cigarette brings.I was most interested in how the book described changing a habit. Let’s face it, we all have habits we want to change. To accomplish this we need to keep the cue and reward, but change the routine. I’ll use an example from my own life to illustrate. I love chocolate, and to make it worse I love to eat at it night. Well I love to eat at night because that is how I formed the habit some time ago. I used the guidance from this book to change that habit. I kept the cue and reward, but I changed the routine to use apples instead of chocolate.This logic flows into much larger problem sets such as organizations and communities. Focus on changing one thing, the keystone habit from which a cascade of other habits will form. The author illustrates this example by discussing how the company Alcoa was transformed by the keystone habit of a singular focus on safety.The book flows really well and uses research throughout to substantiate the concepts presented. The audience who can benefit from this book is vast, from individuals to corporates to governments."}, {"userName": "K", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/373260-k", "userReview": "Read this because of fascinating NYT magazine excerpt on how Target tracks our buying habits. The rest of the book is not as compelling -- anecdotes sometimes don't support particular arguments he's attempting to illustrate (the Hey-Ya examples being the most egregious), and his section on how social movements occur is weak and unconvincing, and not really about habits, per se. Style and structure were often clunky, and the book seems a bit muddled as its ultimate purpose. I dunno, I guess I was expecting slightly more substantial psychology or social science and instead got more of a book solidly for businesses/manager types and people on the beginning of their self-help journeys. But I fall into the latter category, so why am I pooh pooh-ing this book so much? I dunno. Maybe I am just jealous of how $$$ money this dude's gonna make at corporate speaking gigs. Anyway, lessons I'll take away -- *making your bed every morning and committing to regular exercise are two habits that can transform your entire goddamn life*Diagram about mouse brain activity spike post-reward eventually arriving prior to reward (the origin of cravings)*Changing habits requires identifying the cues and rewards that trigger and support the habit behavior, then trying out various substitutes for the behavior that might achieve the same reward*deliberate advance plans for responding to challenging situations can be extremely helpful (ex Scottish knee/hip replacement patients, Michael Phelps, Starbucks)*With more challenging habits like alcoholism or stuff related to football, true belief and submission to some higher purpose is necessary*in general, it's more effective to change others' habits if you make them believe they have some power or authority over their decision than if you coerce them with force *casinos are super evil"}, {"userName": "Rhianna", "userReviewDate": "May 09, 2012", "userURL": "http://www.goodreads.com/user/show/1242918-rhianna", "userReview": "This may be a crappy review since its going up via iPhone. Sorry. First caveat: I work in research. A big part of my job is creating these habit loops and seeing if they can be altered or enhanced via medication. Second caveat: I'm a nerd and love journal articles, scientific writing, and technical reading, even off the job.Third caveat: I only got to chapter eight. I honestly don't know what I was expecting. By far and large, when there's big buzz about a book I inevitably dislike it with very few exceptions. I was hoping for something smart and eye opening; a different, more personal take on habits and addiction (which is really what a habit is if you think about it), and I was let down mostly by the writing and anecdotes. I realize this book isn't intended for scientific review, but when there were so many teasing moments of talking about the research going on, I guess I just expected a little more substance in laymans terms. The biggest problem I had with the book was that I probably could have only read the first few chapters and have a total grasp of the theory. While some stories were interesting, they reminded me of Grandpa Simpson's storytelling. I don't think we needed so many examples that all said the same thing. Think of all the trees that could have been saved if a few were omitted. Don't get me wrong, it wasn't a bad read. People with a non-neuroscience background can enjoy it and will learn something from it. Although how to apply it to your life is pretty much missing from the book (unless it was in the chapters I didn't get to yet). Yeah, find a new reward to break bad habits, but how? It would have been interesting to see those suggestions. Overall, not horrible. Had it not been a book club read I wouldn't have picked it up of my own volition, but I'm not upset that I read most of it. I am upset that I kept reading hoping to get something different in the next chapter, which didn't happen. Just save the time and money and read his NY Times article (at least I think it was there) instead."}, {"userName": "Riku Sayuj", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/1651956-riku-sayuj", "userReview": "Nothing Succeeds Like Success: A Case StudyHey. Have you heard of Thomas Baker? How about Carol Wright? Chris Cameron? Vineet Shaw? Let us discuss Baker.Thomas Baker was an average joe, but not without ambitions. A few years ago, acting on a tip, Tom, a competitive enough guy, decided to take his life into his own hands. What’s more, he decided to pick up one more Self-help book and this time follow up thoroughly on it. No holds barred. He asked around, looked in that wonderful site and finally decided on what seemed to him like the best out there right now. The ratings seemed to be out of the world too. The author, in the intro, even tries to reassure him against feeling overwhelmed by the excess of research in the book. This is exactly the sort of help that Tom needed. Tom read the book with great diligence. He made notes and he made placards and he even bought magnets for his fridge and special sticky tapes for his mirrors. He knew this could work. He only had to believe.He changed his routines, identified and included habit-forming cues. He created them, he played around with them, he even had some fun. He was very inventive and imaginative. The author would have commended the effort if he knew. Tom decide that he would write to Duhigg about his success once it pays off. A month passed. Tom had made slight improvements but no major pay-off seemed to be in the offing. He chided himself for expecting windfalls. He reminded himself that these things take time. He kept at it.6 months now. Even the minor gains he had made originally have fallen by the wayside now. He had read the book thrice in this time, trying to reaffirm his faith. He was discouraged now but he kept at it.2 years. The book is long forgotten. But Tom had taken the trouble to document his experiences and had sent a detailed case study to the author. He had requested that it be included in the next edition of the book. He wanted the author to include a chapter on failures - on how it might not work for everyone. He wanted a caveat, a mild statement of warning that just because a book worth of case studies of success is presented, there is no reason to expect that any approach (no matter how good) might work for everyone. Humans would be fulfilling Asimovesque dreams if that were the case. He thought this would add depth and realism to an otherwise fine book.He did not even get an auto-generated acknowledgment slip. But that was ok, he had discovered a new Gladwell book on another airport aisle. Apparently, it is not just habits that doesn’t stick, lessons don’t either."}, {"userName": "Trevor", "userReviewDate": "Mar 29, 2012", "userURL": "http://www.goodreads.com/user/show/175635-trevor", "userReview": "I need to start with the obvious – this guy is one of those writers. One of those writers that make you want to track him down and hurt him. And not just him, maybe even his pets too. He assumes you are as thick as dog-shit and that you won’t get what it is he is talking about unless he makes it painfully (PAINFULLY) clear. He has missed his calling. He really should have gone into the self-help book market – let’s face it, assuming your readers are dumb in that market is just ‘responding to reality’. You might be wondering why I gave this book three stars, given I wanted to find ways to hurt the author. Well, the problem is that some of the ideas here are not insane, in fact, some are really well worth thinking about. It’s just that someone (someone who also needs hunted down, now that I think about it) has told this guy you need to ‘tell a story’. And while this is often excellent advice – you also need to remember that people are reading your book for a reason and that reason isn’t to cry over the last moments of a drug addict’s life or to find out how the skunk lady got laid. No, it is to find out about the affect of habits and what we can do to change the habits of a life time that are stuffing up our lives.I’ve been reading lots of Bourdieu lately. He talks of Habitus – what he calls the ‘feel for the game’, but basically the habits we have that are so unconscious we don't even know they are habits and so, therefore, have no idea what a huge part they play in shaping the kinds of people we are. So we tend to think that because we wouldn’t do something someone else clearly has done that automatically qualifies us for the golden stamp of merit. Whereas, so much of what we do in life is either non-rational or automatic – having those automatic structures implanted in us from no age is more a matter of luck than of rational deliberation.This guy stuffs up his argument at the end by not having the conviction of what his view on habits was telling him. He tells a long, long, long story of a woman that lost everything through gambling. Terribly sad and all that. But obviously this book is written in America and so nothing can come between the rights of rich people to take money from poor people. So, the fact that casinos do everything to manipulate you so that you end up with nothing is YOUR fault, not theirs – have you no self control? Have you no free will? I think this guy should read Sam Harris’s new book. Either that or he needs to also argue that it should be ok for drug dealers to offer kids drugs at schools and in the streets – if one is wrong it isn’t at all obvious why the other is right. And if not drugs to kids, then drugs to adults – unless I’m missing something the same argument applies.This book is quite chilling in that it explains – in very long and all too often boring detail, in fact endless bloody detail, just how companies like Target are targeting you and manipulating you to buy and buy and buy. Yet again this is presented as if it was nothing to be concerned about – but I struggled to read it as something I should just shrug and get over. When I first learned about data warehousing it sent a cold shiver down my spine – I have never had ‘Fly Buys’ or any other of those ‘loyalty’ programs that give those arseholes all of my details so they can work out how to better market to people like me. I’m manipulated enough in life without needing to provide billionaires with better weapons to trip me up.The information in this book is very worthwhile. But if you ever needed proof that Gladwell has lots to answer for, this book is Item A on the case for the prosecution. And what the hell is it about American Football? I hope to God it isn’t nearly as uninteresting to watch as it is to read about. No wonder Americans invade countries at the drop of a hat – anything to get away from two down on the thirty-first yard line with a wingback on a hiding to nowhere blah, blah AHHHHH!!!!"}, {"userName": "Nandakishore Varma", "userReviewDate": "Feb 05, 2016", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "I remember reading a story by the famous Malayalam writer Padmarajan called Oru Sameepakala Durantham (\"A Tragedy of Recent Times\"). It tells of a housing colony in Kerala, bitten by the exercise bug in the early eighties. Someone gets up before sunrise and starts jogging. Soon, he is joined by more and more people until the whole colony is out running, every day. This leaves the houses unattended which comes to the notice of a group of thieves: and they conduct a spate of early morning robberies. The people of the colony, even after a couple of houses are robbed, continue their morning ritual - they can't stop, even after they know that their houses may be invaded any time.Padmarajan ostensibly wrote this seemingly absurd and Kafkaesque story to make fun of the urban animal, blindly following the latest fad. But he may have more true to life than he thought.Such is the power of habit.------------------------------This book by Duhigg, if you can get past the unnecessarily prolix prose, says a very simple but significant thing: habit is what drives you. From picking your nose to gambling away your life's savings, ingrained habits hard-coded into your brain makes you tick. It follows the \"cue-routine-reward\" loop as illustrated below:(Cue = a certain time; routine = eat a cookie; reward = diversion from work)Habits are not endemic to people alone - organisations and societies also have habits, which why they are so resistant to change.The key to getting rid of a destructive habit is to replace it with a constructive one. In the loop illustrated above, the cue and the reward would remain the same, but a different routine can be substituted. See below:(Here the routine of \"have a drink\" is replaced with \"have a chat\")This is easier said than done, however: it requires real effort to identify a habit, and great will power (which can be cultivated, according to Duhigg) to change it. But it can be done. Successful individuals have changed their lives by changing destructive habits: successful executives have turned around companies by changing corporate habits: and leaders have transformed societies. Examples abound in this book.And please note: supermarket chains and gambling dens monitor our habits and feed those which will drain our pockets and maximise their profits.------------------------------This book is well worth a read. I only wish that the author had cut the fluff and trimmed it down to a slimmer volume. But then, the HABIT of writing needlessly long books among American journalists is one that dies hard."}, {"userName": "Johnny", "userReviewDate": "Jul 23, 2012", "userURL": "http://www.goodreads.com/user/show/903066-johnny", "userReview": "Judging from the prologue of The Power of Habit: Why We Do What We Do in Life and Business, the first thing necessary in modifying one’s behavior is to note the actual components of that behavior. The author cites a visit with a military officer in charge of normalizing a village (Kufa) in Iraq. The officer started by observing video of how riots began and noticed that the trouble usually broke out after people had milled around for a while and food trucks and spectators arrived. He changed the behavior by asking the mayor not to allow food trucks into the areas where people were demonstrating (p. 13 on Sony eReader, as will be all pagination in the remainder of this review). Something as simple as the presence of food trucks threw off a habit of violence and allowed some normalization. This seemed amazing, but something resonated strongly with this truth.The Power of Habits begins with anecdotal accounts of people who changed destructive habits in their lives and one account of a man who had absolutely no short term memory but was able to function as a result of habits already ingrained within him. The latter case demonstrated that there was something distinctive between one part of our brain and another. So, the author takes the reader on a tour of a lab at M.I.T. where scientists have been researching a golf ball-sized lump in the brain called the basal ganglia since 1990 (p. 25). Apparently, the basal ganglia stores habits while the rest of the brain works less and less because the “chunks” of actions stored in that section of the brain takes over (p. 26). Arriving at this understanding, researchers were able to use different experiments to ascertain a “habit loop.” They noticed that a certain cue triggers a set of automatic reactions such that the being feels rewarded. As a result of being rewarded, there is an even stronger response to the same cue on the next occasion (p. 29) Of course, if reward can reinforce the habit whenever one senses that cue, changing the reward can eventually extinguish that habit (p. 30) as the researchers discovered by moving the chocolate around the maze to mess up the behaviors.So, what kinds of “cues” work? The Power of Habits tells the story of Claude Hopkins, an advertising legend who “created” the demand for toothpaste by creating a “craving.” Hopkins noticed in dental research that there is a film that forms on our teeth. He decided to get people to “feel” the mucin plaques on their teeth by calling them “the film” and suggesting that “beauty” comes from eliminating the film (p. 40). By identifying a “cue” (the film that is almost always there) and suggesting a “reward” (getting rid of that film), he established a multi-million dollar product. Sounds simple, doesn’t it? Yet, the book goes on to tell the story of Febreze, the air freshener that started out as a failure. Even though it was extremely effective in getting rid of odors, it wasn’t selling because people in odiferous situations became used to the odors. They weren’t getting the cue. So, there had to be a better way to cue the reward and that came to be with pleasant fragrances and the idea of “finishing” a task with beautiful smelling Febreze (a tactic that is still being used in dozens of new products in this product line to the present day (p. 56). The “habit loop” works even better when a “craving” is attached to it. It turns out that Pepsodent already had the craving element built in with the citric acid or mint taste that rewarded users with a tingling sense of feeling clean. It’s pretty masterful the way this author closes the loop in each chapter.Then, a chapter introduces the “Golden Rule” of habit change. It notes that you can never quite remove a bad habit, but you need to substitute a new routine between the cue and the reward (p. 61). In this chapter, Tony Dungy’s coaching philosophy of substituting a simpler playbook with more repetition for the old routine of over-thinking what one might be trying to do. In this way, the new routine would reside between the cue (hiking the ball?) and the reward (scoring a touchdown? Making a sack of the QB?) and more success would result (p. 62). Naturally, this chapter wraps Dungy’s experiences with turning around the Tampa Bay Buccaneers and Indianapolis Colts football teams around the history of Alcoholics Anonymous. Both Dungy as a coach and Bill Wilson who founded A.A. teach people to substitute new routines for the old ones (p. 68), bad football in the former and alcohol abuse in the latter.One of the keys to Dungy’s eventual success and one of the core tenets of A.A. (or any 12-step) program is that one must believe in something. Dungy complained early on that practice was going well and everything was coming together, but the training would disappear during the big games. When he heard the players saying that they went back to what they knew during critical games, Dungy said, “What they were really saying was that they trusted our system most of the time, but when everything was on the line, that belief broken down.” (p. 75) And, as one researching from the University of New Mexico noted, belief is critical in order for change to work in the long run (p. 78). The section on “habits” in business wasn’t as interesting to me, but even there I found some intriguing aspects. It was fascinating to read about how “keystone habits encourage widespread change: by creating cultures where new values become ingrained.” (p. 109) This section told the story of former U.S. Treasury Secretary Paul O’ Neill’s success at Alcoa. O’ Neill’s emphasis was safety. By placing the emphasis on safety, he gave the corporation something around which management (because of reducing lost work days) and unions (because of emphasizing the safety of the workers) could both agree upon. There was also an insight with regard to the gay liberation movement. Duhigg suggests that when the Library of Congress re-categorized books on homosexuality as its own subject matter rather than under mental illness, it provided a paradigm shift that fueled the movement (p. 100). It just shows how little shifts can have seismic effects, not only on individuals, but on society.Another corporate chapter used an experiment on willpower where half of the group was allowed to eat fresh-baked chocolate chip cookies while another group was forced to eat radishes. Sounds like the latter would have a healthy advantage when the group was asked to perform a complex problem which had no real solution! Sounds like they would be more mentally fresh! Wrong! Those who had eaten the radishes were most likely to quit after only a few minutes while the cookie eaters kept on for half an hour or so. Why? Researchers concluded that the first portion of the experiment had used up much of the finite willpower in the radish eaters (p. 119). A later study showed that using kindness to set up the willpower goals as opposed to ordering willpower allowed those who experienced kindness to concentrate longer (p. 130).Building on that idea, Duhigg recounted a Scottish rehabilitation study where the elderly patients who were most successful in learning to walk again in spite of excruciating pain had identified potential obstacles in advance and created their own ways of dealing with them. “Put another way, the patients’ plans were built around inflection points when they knew their pain—and thus the temptation to quit—would be the strongest.” (p. 124) Starbucks put this to work in what they called the LATTE method (Listen to the customer, Acknowledge their complaint, Take action by solving the problem, Thank them, and then, Explain why the problem occurred.) in dealing with irate customers (p. 126).Another chapter deals with destructive institutional habits: “There are no organizations without institutional habits. There are only places where they are deliberately designed, and places where they are created without forethought, so they often grow from rivalries or fear.” (p. 137) “Companies aren’t families. They’re battlefields in a civil war.” (p. 139) I was also fascinated with the chapter on consumer behavior. Did you know that almost everyone turns right after entering a retail establishment and that retailers stock their most profitable items on the right side of the store? (p. 157) Did you know that people’s buying habits change when they go through a major life event (marriage, having a child, divorce, moving)? (p. 162) And, in the facts are stranger than fiction department, Duhigg cites a company named Polyphonic HMI that statistically analyzes the mathematical characters of a song and predicts its popularity. (p. 167) Why is that strange? It’s because Norman Spinrad, a terrific science-fiction author, “predicts” it in his novel in the 1980s--Little Heroes. Sorry, Duhigg doesn’t cite Spinrad; that’s me. I was happy that Duhigg recounted a huge Polyphonic miscalculation. It also explained why I don’t listen to music on the radio very much: “Our brains crave familiarity in music because familiarity is how we manage to hear without becoming distracted by all the sound.” (p. 171) I actually listen to the radio for stimuli.The section on the habits of societies was particularly relevant to me because the first chapter dealt with churches, Dr. Martin Luther King, Jr.’s Montgomery church and Rick Warren’s Saddleback Community Church. Starting with the idea of a social network of friendships and growing through informal ties (Duhigg calls them “weak ties”) and changing community habits, social habits turn on personal integrity and relationships. Duhigg pointed out how Rosa Park’s ties that transcended the social stratifications of the black community through her volunteer involvement with many groups on many levels enabled her to become the catalyst that she was (p. 184) The important insight that was new to me was: “The habits of peer pressure … often spread through weak ties. And they gain their authority through communal expectations. If you ignore the social obligations of your neighborhood, if you shrug off the expected patterns of your community, you risk losing your social standing.” (p. 189) Sadly, I was disappointed in the section on Rick Warren. The book makes it sound like Warren selected Saddleback Community from a long way away by citing Warren’s seminary education in Texas and work as a volunteer missionary in Japan. Strangely, it doesn’t mention the fact that Saddleback was only a little more 30 minutes drive from where Warren attended college in Riverside or that Warren’s father had been a professional minister in California prior to his retirement. I did like the emphasis on small groups as the key to creating a “sticky” environment that “…drew on already-existing social urges and patterns.” (p. 198) One significant section of the book was dedicated to the idea of whether we are responsible for our habits. By juxtaposing the tale of a gambler (if you listen to This American Life on public radio, you probably heard this story) who went to court with a major casino chain by insisting that the casino operators were responsible for her problem alongside that of a British subject who killed his wife during sleep terrors, Duhigg raises the issue but concludes by stating that he believes it is possible to change habits—any habits. The gambler protested that she just wanted to feel good at something (p. 208) and the killer protested that he honestly thought his wife was a male intruder assaulting his wife (p. 209).This section pointed out that, for example, sleepwalking is a reminder that sleep and wakefulness aren't that separate so that the brain can accomplish complex activities and nothing is guiding the brain except patterns. (pp. 210-211) Even more powerful are the behaviors described as “sleep terrors.” Sleep terrors are primitive neurological patterns (p.212). It even points out that a 2010 MRI study of gamblers discovered that, to pathological gamblers, brain activity was so high that it treated near misses as wins (p.220) when, in fact, they were losses. So, can such ingrained perceptions be changed? Duhigg cites William James’ decision to believe in free will as opposed to surrendering to suicide (p. 226). As James tried his 12 month long experiment, he discovered that habits were based upon exercising them (pp. 226-227) much like a well-folded paper or an old pair of well-creased slacks. And all of these great narratives point the reader toward the most useful part of the book, learning to change behavior by identifying the routine, figuring out the cue that triggers the routine and the craving underlying that cue by experimenting with different rewards (p. 230). If you can figure out what you really want and substitute a better routine to satisfy that craving, you will be well on your way toward changing that habit. That doesn’t mean you won’t fall off the wagon, but it means you will be on your way to shaping your actions by your will as opposed to ingrained behaviors."}, {"userName": "Elyse", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Our local book club read this a few years ago. I thought I had a review....perhaps it disappeared? Maybe it's still here? I saw a friend currently reading it. I thought this book explained some useful information: Talked about success through good habits - organizational skills ----addictions- habits hard to break and how to create new ones --lots of repetition. ( some basic common sense - but also good tidbits and even validation in some areas) The personal stories of people's lives were interesting.... and my favorite part about reading this book was the book discussion with the people in my book club group after."}, {"userName": "Chad Warner", "userReviewDate": "Mar 17, 2013", "userURL": "http://www.goodreads.com/user/show/1586355-chad-warner", "userReview": "This long-winded book explains how habits form in individuals, organizations, and social groups. Despite the intriguing premise, the verbose anecdotes left me screaming, “I get the point already!” A better book (or article) would have resulted from taking the appendix (a short, practical guide to changing a habit) and adding some of the psychological research and a few brief examples. (After I wrote this review, I discovered Charles Duhigg's New York Times article, which is basically what I described). The book’s moral is a respectable one: once you’re aware of a bad habit, it’s your responsibility to change it.My favorite case study was the one about Target using predictive analytics and behavioral research to personalize its marketing to each shopper’s habits.• A habit is a cue that triggers a routine that results in a reward.• Habits can’t be eradicated; they can only be replaced.• The Golden Rule of Habit Change: to replace a habit, keep the cue and reward but replace the routine.• “For a habit to stay changed, people must believe change is possible. And most often, that belief only emerges with the help of a group.”• Studies show that willpower is a finite resource; it's like a muscle that tires with use. Willpower can be increased by exercising self-discipline. Increasing self-discipline in one area of life increases it in other areas.• To introduce new habits, “sandwich” them between existing ones so they feel familiar.• Habits are most susceptible to being altered when your life changes. Having a baby is the event that produces the most habit changes."}, {"userName": "peiman-mir5 rezakhani", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/42133960-peiman-mir5-rezakhani", "userReview": "‎دوستانِ گرانقدر، همانطور که از عنوان کتاب پیداست، نویسنده در این کتاب به موضوع <عادت> در انسانها پرداخته است و تلاش نموده تا با بهرده بردن از آزمایشات علمی که در خصوصِ این موضوع انجام شده است و رویدادهایِ معروفی که میتوانسته به موضوعِ <عادت> کمک نموده و به نوعی با این موضوع جالب توجه ارتباط داشته باشد، کتابِ قابلِ توجهی را تهیه کند‎در زیر بخش هایی از این کتاب را به انتخاب برایتان مینویسم----------------------------------------------‎عادتها به این دلیل به وجود می آیند که مغز مرتب به دنبال راههایی است تا سعی و تلاش را کم کرده و در انرژی مصرفی صرفه جویی کند. اگر تمام کارها به خودِ مغز واگذار شوند، مغز سعی میکند تقریباً هر کار روتین و معمولی را به شکلِ یک عادت درآورد، چون عادتها به ذهنِ ما اجازه میدهند اغلبِ اوقات تجزیه و تحلیلها را کاهش دهد. این غریزهٔ صرفه جویی، مزیتِ بزرگی است*****************************‎در ایجاد عادت هایِ جدید، ابتدا باید موضوع شروع کننده ای به نام سرنخ وجود داشته باشد و این سرنخ باید به پاداش برسد تا در نتیجه عادت در مغز شکل گیرد‎در محصولات بهداشتی مانندِ شامپو، کف کردن یک پاداشِ بزرگ است. لازم نیست که شامپو کف کند ولی چون هر بار که مردم موهایشان را با آن می شویند، انتظار دارند که کف کند، تولید کنندگان این محصولات به محصول مورد نظر مواد شیمیاییِ کف کننده اضافه میکنند. همین مورد در مورد پودرهای لباسشویی و خمیردندان هم به کار میرود... در حال حاضر همهٔ شرکتها به خمیردندان \"سدیم لورث سولفات\" اضافه میکنند تا بیشتر کف کند. این کار باعثِ تمیزتر شدن دندان نمیشود، امّا وقتی مقداری حبابِ کف، دور و بر دهانِ مصرف کنندگان باشد، آنها احساس بهتری دارند. وقتی که مشتری منتظر آن کف باشد، این عادت شروع به رشد کردن میکند‎تمایلات همان چیزی هستند که باعثِ تحریکِ عادتها میشوند و وقتی بفهمیم که چگونه میشود باعث بوجود آمدن یک تمایل شد، ایجاد عادت جدید ساده تر میشود*****************************‎ما میدانیم که نمیتوان از شر عادت خلاص شد، در عوض میبایست آن را تغییر داد و میدانیم که وقتی از قانون طلاییِ عادت استفاده شود، عادتها از هر چیز دیگری قابل انعطاف تر هستند: اگر ما ‎همان سرنخ و همان پاداش را نگه داریم، یک روتین جدید میتواند جایگزین شود‎ولی این کافی نیست. برای اینکه عادتی تغییریافته باقی بماند، افراد باید باور کنند که تغییر امکانپذیر است ---------------------------------------------‎امیدوارم این ریویو جهتِ آشنایی با این کتاب، کافی و مفید بوده باشه‎<پیروز باشید و ایرانی>"}, {"userName": "Arda", "userReviewDate": "Jan 28, 2013", "userURL": "http://www.goodreads.com/user/show/4810137-arda", "userReview": "Enjoyable. The book presents a framework of understanding how habits work, and serves as a guide to show how to change habits.  “Once you choose who you want to be, believe you want to change, and it becomes real.” “Visualize the kind of person you would like to become, focus on one habit you would potentially develop, and transform that into what would become natural; requiring no effort or thinking.” “To modify a habit, you must decide to change it. You must consciously accept the hard work of identifying the cues and rewards that drive the habit’s routines and find alternatives. You must know you have control, and be self conscious enough to use it.” And hence, the  power of habit. So far so good. At this point I’m thinking “which one, which one!” I have a big list of those things I’d be more than happy to trash, and a bigger list of habits I’d like to build. According to Duhigg, the habit loop is made up of: cue → routine → reward. \nLet’s assume  I have a habit of reviewing books on goodreads. This habit of reviewing would be a cue, which makes up the routine: logging into my account, adding books and reviewing them. Apparently, habits (cue and routine) often require a reward. What would my reward in this scenario possibly be? A like? A comment? I hardly get any of those. Perhaps the reward comes from the deeper  craving  I have to read more books. Craving apparently is what drives the habit loop. Hence: Cue → Routine → Reward. The driver is the craving. And the extra spices are belief, and will-power. (Self-discipline increases will-power.)The beauty of realizing this power is that “at first, the change comes with difficulty, then it is done more easily, then semi-mechanically or with hardly any consciousness.” Our actions are developed into habits when we stop thinking about them consciously. We just do them. Hence, we rebuild and transform them. Changing a keystone habit, like say, working out, can transform a person’s life, because with the habit of working out, one is going to simultaneously eat in a healthier way, possibly quit smoking, and live a better lifestyle which in turn could turn to a happier life.  EUREKA!  As based on the above, it would be fair to presume that due to my habit of writing reviews on goodreads, I will start to read more books, thanks to my craving, and this will in turn increase my reviews. I would have no idea what to do with those reviews, and so I might have a chance of reaching success and becoming famous by turning into a fraud replica of  Manny  who published a book about his reviews of books. And, to take it a little further, according to the habit loop, I may just as well meet the love of my life as a result of all this success, which would in turn stop me from eating so much ice cream.\nOn a serious note, Duhigg generously provides diverse examples to explain the habit loop. The examples range from personal experiences, such as depression/addiction (alcohol, gambling, overeating, etc) and memory-loss. And yet, some of the success stories got on my nerves at a certain point. I was a tad annoyed, early in the book, that he draws inspiration from the US Military and the ways through which habits are instilled in soldiers. Moreover, he includes a section on radio/music, concluding that the reason Outkast’s “Hey Ya” turned out to be such a hit despite the public’s initial disdain is because “the unfamiliar was made to seem familiar” through playing it with familiar songs. “If you dress a new something in an old habit,\" he explains, \"it is easier for the public to accept it.” (Which public?)He brings examples from sports games, shopping malls (like target) and coffee chains (like Starbucks) and others markets like Alcoa and Febreeze to display how the habit loop works. He mentions that \"companies predict and manipulate habits” and briefly remarks on how some customers do not like to be spied on for marketing purposes, yet it still seems as though Duhigg uses his examples as success stories. He does not seem to mind the data-mining and tracking of records or ethical standards so much, and focuses instead on how to make success out of this “secret”. [Speaking of which, did you know pregnant women are the biggest shoppers?] I was a little taken-aback by his corporate-success-mindedness and the ways in which he measures success. This would be a little too similar to the mind-set one finds in other self-help books, although I was hoping this one would be different. Unfortunately, most of these types of books seem to promote the sensation of becoming a driven, ambitious, goal-oriented, go-get-‘em tiger. I couldn’t help escape the idea that this man partly measures success by a person’s pay-check and exercise regimen.\nThat said, the book does have interesting viewpoints, particularly those related to how habits shape up societies. His take on habits within communities was eye-opening: He defines community as a giant collection of habits occurring among thousands of people that, depending on how they’re influenced, could result in violence or peace. He takes the example of Rosa Parks and the Montgomery Bus Boycott in Alabama in 1955, and states that it was not just an act of defiance that sparked the boycott, but that the successful boycott was also due to her varying and influential social circles. In this section, as in other sections, attention is given to the importance of social standing, which comes with obligations. Apparently, it is not just our friends who strengthen our social networks, but the friends of our friends [“weak ties”] too have a role in improving our chances for finding employment and improve our social standing. One of the integral points that will stand out for me from this book is that our actions are developed into habits when we stop thinking about them consciously. We just do them. Hence, we rebuild and transform them. Changing, or building, the most simple habit could have a direct impact on our mortal life. “However,\" Duhigg warns, \"there isn’t one formula. Individuals are different, habits are different, and cravings are different. What this book aspires to do is create a framework of understanding how a habit works, and serve as a guide to show how to change it.”"}, {"userName": "Diane", "userReviewDate": "Jul 06, 2012", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "This was an interesting collection of research about habits and routines. The book felt Gladwellian in that it combined a variety of case studies while arguing a central theme, just as Malcolm Gladwell tends to do in his books. I think my favorite sections were the ones on Starbucks' training programs, Procter & Gamble's attempts to market Febreze, the safety record at Alcoa, the applications of Hit Song Science, and the historic Montgomery bus boycott of 1955. The overall theme is about how habits shape our lives, and it is possible to change bad habits for positive routines. The trick is in identifying what is cueing you to the bad habit, to experiment with positive rewards, and then make a plan for how to adjust your routine. This material was also explored in Gretchen Rubin's charming book, Better Than Before, and I enjoyed revisiting the topic. Recommended for those interested in human behavior and popular psychology/sociology."}, {"userName": "Hesam", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/2484056-hesam", "userReview": "یکم- فردی به ویروس مغزی مبتلا می شود؛ ویروسی که کارش خوردن بافت مغز است. در نهایت پزشکان به این نتیجه میرسند که باید بافت آلوده را خارج کرد. بافتی که آلوده شده ، شامل حافظه بود و لذا پزشکان نگران از اینکه او بخش وسیعی از قابلیت هایش را از دست بدهد به همسرش هشدار می دهند که از او مراقبت کند. همسرش برای حفظ سلامتی جسمانی وی ، هر روز راس ساعت معینی او را از مسیر مشخصی به پیاده روی می برد و به خانه بازمیگرداند. یک روز در حالی که او از همسرش غافل می شود، وی از خانه خارج میشود. زن وحشت زده می شود. چرا؟ زیرا همسرش اکنون مردی بی حافظه است پس پیش بینی پزشکی این ست که وی به قطع مسیر بازگشت را به یاد نخواهد آورد و گم خواهد شد.مرد پس از مدت معمول پیاده روی هرروزه به خانه باز میگردد. علت چیست؟ پژوهشگران شگفت زده می شوند! علت را باید در ویژگی دیگری جست و جو کرد: عادتدوم- داستان مرد ِ بی حافظه ، عادت را در کانون توجهات پژوهشگران قرار میدهد. به راستی عادت چیست؟ چه فرآیندی منجر به شکل گیری عادت ها می شود؟ آیا عادت ها قابل تغییر اند؟ و .... پژوهش ها به نتیجه میرسد: عادت ها متشکل از یک سیکل سه مرحله ای ست : سرنخ، جریان عادی و پاداش. یک سیگاری را در نظر بگیرید : دیدن سیگار همان سرنخ یا محرّک است، جریان عادی حلقه ی شکل گیری ِ عادت با دست یافتن به سیگار و کشیدن ِ آن ادامه یافته و در نهایت پاداش که چیزی جزء لذت افزایش نیکوتین در خون نیست!سوم- همه ی ما مجموعه ای از عادت ها هستیم. عادت های هیچگاه از بین نمی روند و برای همیشه در بخش کوچکی در وسط مغز آدمی ثبت و رمزگذاری میشوند. عادت ها را می توان جایگزین کرد، اما آنها برای همیشه در مغز باقی می مانند. راز جایگزینی عادت در حفظ سرنخ و پاداش و تلاش برای جایگزین کردن جریان عادی است. فردی در یک اداره را در نظر بگیرید که پس از آنکه خسته و بی حوصله از کار میشود کشوی میز ِ خود را باز کرده و خوراکی ای می بیند و با خوشحالی خود را به خوردن آن مشغول می نماید. روز بعد در حالی که پس از کار احساس خمودگی می کند... دیلینگ!!... چیزی در مغزش صدا میکند: در کشویت را باز کن و باز هم خوراکی و رهایی از خستگی و بی حوصلگی ... پس از چند ماه حلقه ی عادت شگل گرفته است: بی حوصلگی(سرنخ) – تلاش برای یافتن و خوردن خوراکی (جریان عادی) – و درنهایت رهایی از بی حوصلگی با مشغول شدن به خوردن (پاداش)... و البته معضلی که فرد با آن مواجهه شده است: اضافه وزن! در این جا کافی ست در زمان بی حوصلگی(سرنخ) از پیش میز خود بلند شده و چرخی در محل کار خود بزند و یا در اینترنت تاب بخورد (جریان عادی جایگزین) تا دوره ی بی حوصلگی اش بگذرد(پاداش).چهارم- عادت ها پس از شکل گیری به صورت کاملا غیرارادی و ناآگانه و البته خودکار صورت می گیرند. برای همین است که فردی که رانندگی را فراگرفته و آن را به عادت تبدیل نموده است می تواند فارغ از استرس ها و نیاز به توجه کامل ابتدای دوره ی آموزش اش ، در حین رانندگی در یک بحث فلسفی داغ با همراه اش شرکت کند!پنجم- در جنگ جهانی دوم، دولت آمریکا مقدار زیادی از ذخایر گوشت بومی ملی را برای سربازان خود در اروپا فرستاد به طوری که در رستوران های آمریکا از گوشت اسب استفاده می کردند. بازار سیاه شگل گرفت و دولت از این نگران بود که اگر جنگ طولانی شود مردم از گرسنگی بمیرند. دولت با تاکید بر اینکه گوشت و چربی به اندازه تانک و هواپیما مهم است از جامعه شناسان، انسان شناسان و روان شناسان ده ها کشور دعوت کرد تا موضوعی را بررسی کنند: چگونه می توان مردم را قانع کرد دیگر اعضای چهارپایان را نیز بخورند و خانم های خانه دار به همسران و فرزندانشان جگر، دل، قلوه، مغز و دیگر اعضای غنی از پروتیین را بدهند؟!! مردم حاضر بودند از گرسنگی بمیرند تا اینکه بخواهند زبان وسیرابی بخورند!! در نهایت تلاش پژوهشگران به این نتیجه رسید: برای تغییر رژیم غدایی مردم کافی ست مسایل نامتعارف را آشنا ساخت. پس باید عادت های جدید را در بین عادت های معمول استتار کرد! لذا به خانم های خانه دار آموزش دادند که چه کنند تا ظاهر، طعم ومزه و بوی این غذاها به غذاهای لذیذ گذشتشان شباهت یابد. بزودی خانم ها نامه ای از طرف ِ دولت با عنوان \"همسرتان عاشق استیک قلوه خواهد شد\" و شامل دستور عمل پخت استیک قلوه دریافت کردند. طبق یک مطالعه مصرف امعا و احشا در آمریکا در طول جنگ جهانی دوم 32 درصد افزایش یافت و طی یک دهه بعد نه تنها قلوه به غذای اصلی مردم تبدیل شد که خوردن امعا و احشا مخصوص مراسمات خاص و نشانه رفاه خانواده های مصرف کننده به شمار می رفت!!ششم- حوزه ی نفوذ عادت بسیار بسیار فراتر از آن است که می اندیشید. از قریب به اتفاق رفتارهای ما گرفته تا جنبش های اجتماعی، از کنش های سیاسی گرفته تا جریان های فرهنگی، اقتصاد، تبلیغات، سنت ها، فرهنگ ها و همه حوزه های همگرا و واگرای مرتبط به آدمی ، همه وهمه متاثر از عادت های فردی یا جمعی اند. عادت ها مهّم اند. اگر ساختار و فرآیند شکل گیری شان را بشناسید می توانید – بسته به نوع آنها- با صرف زمان و تلاش آن ها را تغییر دهید.هفتم- کتابی درگیرکننده، روشنگر و امیدبخش است . بخوانیدش"}, {"userName": "Mohamed  Abo-Elgheit", "userReviewDate": "Aug 14, 2015", "userURL": "http://www.goodreads.com/user/show/2895056-mohamed-abo-elgheit", "userReview": "بيقولك (بس كلام أكيد يعني) لو جبت فار وحطيته في متاهة زي اللي في الصورة دي كده، وبعدين فجاة مع صوت الكليك شلت الحاجز اللي بيفصل بين الجزء اللي الفار محبوس فيه وبين الجزء اللي في حته الشوكولاته ... الفار هيبدأ يجري علي كل ركن ويشمشم في كل جتى وهياخد وقت طويل على ما هيوصل لنهاية المتاهة وياكل حتى الشوكولاته .. في المرة التانية اللي هتعمل فيها نفس التجربة لنفس الفار، هتلاحظ انه بقا اسرع وبقا بيضيع وقت اقل في التسكع في جنبات المتاهة لحد ما يوصل لحته الشوكولاته..في المرة التلاتين، هتتفاجأ! لأنك هتلاقي الفار بياخدها جري من مجرد ما بيسمع صوت الكليك لحد ما يوصل للشوكولاته ويقضم قضمه ...التجربة دي قام بيها علماء في MIT في أوائل التسعينات من القرن الماضي. بس هم مكتفوش بمراقبة سلوك الفار، لكن قاموا بتثبيت أقطاب/سلوك في دماغ الفار علشان يراقبوا النشاط العصبي الملازم للسلوك داه ... وزي ما سلوك الفار اختلف في الأيام الأولى عن الأيام الأخيرة ، برضه لاحظوا اختلاف مقابل في نشاط في المخ في الآخر عن الأول ... كان ايه بقا الاختلاف داه؟في الأيام الأولى كان المخ بيفضل نشط في اعلى مستوياته طوال الفترة من أول صوت الكليك حتى الحصول على قطعة الشيكولاته ..في الأيام الأخيرة وبعد التكرار والتكرار، الوضع اختلف ، كان المخ في أعلى مستويات نشاطه عند نقطتين فقط : مع صوت الكليك ( البداية) ، وعند الحصول على الشيكولاته (النهاية)...المثال بتاع الفار داه مثال جيد جدا لتحول النشاط الواعي إلى روتين .. وكلمة روتين تعني ان بقت بتتعمل من غير الحاجة لنشاط ذهني عالي، داه غير إنها بتتعمل باستمرار، وصعب ان يحصل خطأ في أدائها .. وتم وضع فرض جيد لتركيب العادات من 3 أجزاء بتكون حلقة : إشارة البدأ، والروتين، والمكافأة في النهاية . زي ما في الصورة التالية:وموضوع اكتساب العادات داه راجل لتركيب بدائي في مركز المخ تقريبا اسمه basal ganglia وكلمة بدائي معناها انه مشترك مع أنواع كتير من الحيوانات وأنه ـ وداه الأهم ـ مش بيعتمد على عمليات معقدة في المخ، وبيتساوى فيه الناس تقريبا من ناحية المقدرة العقلية ..الكلام داه تأكد ليهم من خلال حالة مرضية شهيرة كانت مرت بعدوى فيروسية في الجهاز العصبي والمخ ، وبعد العلاج كان جزء كبير من المخ تدمر ، لدرجة ان أي احداث حصلت بعد المرض ثم العلاج كانت بتتمسح من الذاكرة في ظرف دقايق، ومع ذلك كان المريض ، واللي اشتهر في كتب الطيب ب EP ، قادر انه يكتسب عادات جديدة فقط من التكرار والتكرار والتكرار إلى أن تتحول العادة إلى روتين.. إمكانية تحول فعل ما من نشاط بيحتاج مجهود عقلي إلى عادة روتين ، ليه فوايد هي: بتوفر طاقة المخ لأنشطة تانية أكثر تعقيدا، وانك وفقا لمفهوم العادة هتكون ضامن انك هتواظب على الفعل داه علطول مادام توفرت شروط معينة ... والشروط المعينة دي هنعرفها في مراجعة باقي الكتاب فانتظرونا :D"}, {"userName": "Thomas", "userReviewDate": "Jul 18, 2015", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "How do some of us wake up for 6 a.m. jogs every day? What leads people to develop gambling addictions? Why do people brush their teeth every day while never remembering to wear sunscreen? Charles Duhigg answers these questions and more in The Power of Habit, a well-researched book on what motivates us to make the decisions we do in everyday life and in business.Duhigg's background as a reporter shows in this book. He does a good job of stringing together a wide variety of topics to fit his thesis that revolves around habit, and for the most part he writes about the cue-routine-reward cycle. To illustrate how that pattern works and what we can do to change it, Duhigg explores ideas like smoking addiction, sleepwalking, Target tracking down pregnant women, and more. His writing shines when he compares the man who murdered his wife while asleep to the women who lost an enormous sum of money to compulsive gambling: I still find myself thinking about the neurological and moral implications of the distinction he presents.However, the writing in this book faltered at times. In certain sections Duhigg would break up anecdotes and combine them in odd, confusing ways. Sometimes he selected scenarios that did not align too well with his arguments, like his exploration of how \"Hey-Ya\" became popular. The book as a whole veered more toward reporting than research, so bear that in mind if you decide to pick it up.Overall, a decent read I wanted a little more from when I finished. Recommended to those who want to get their feet wet when it comes to habit formation or psychology that deals with motivation. I will end with a quote from The Power of Habit that stood out to me in a good way:That, in some ways, is the point of this book. Perhaps a sleepwalking murderer can plausibly argue that he wasn't aware of his habit, and so he doesn't bear responsibility for his crime. But almost all the other patterns that exist in most people's lives - how we eat and sleep and talk to our kids, how we unthinkingly spend our time, attention, and money - those are habits that we know exist. And once you understand that habits can change, you have the freedom - and the responsibility - to remake them. Once you understand that habits can be rebuilt, the power of habit becomes easier to grasp, and the only option left is to get to work."}, {"userName": "Ginger", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/14097149-ginger", "userReview": "I feel like I’ve just climbed Mt. Rainier. Why you ask? I finished a non-fiction book!So, I started this climbing excursion because I have bad habits. We all do most of the time. My bad habits are eating unhealthy food, drinking too much wine, not getting enough exercise or procrastinating at work. My hubby and I thought, let’s figure out WHY since we both have bad habits we want to stop. We started this buddy read in February. February?! And you're just finishing it? Now don’t let that sway you that it took over two months to finish this book. It’s not a bad read, I just took my time with it, it's non-fiction and of course, I read books in between. ;) hahahaSo, did it answer some of my questions? Will I put down the bag of Cheetos next time I drink too much wine?! Yeah, I think it did.The Power of Habit: Why We Do What We Do in Life and Business helped me understand that stopping a bad habit isn’t the easiest thing to do. Don't beat yourself up about it. They become routine, habitual and ingrained in your life. They are caused by stress, emotions and going back to creature comforts. The book addresses that one of the ways to break a bad habit is to replace it with a substitute. It’s one of the ways to make a lasting change.Technically, this book isn’t bad. The author jumps around a bit with stories, starting one narrative and then going to another. Depending on the subject matter, I was okay with this. When I was really into the subject matter, it annoyed the hell out of me.This book is also a good analysis about why people like what they do, buy from a certain store or buy merchandise. The businesses that are smart, they have tapped into the emotion of advertising and habits. This part of the book was fascinating and was interesting material to read. And it confirmed that a lot of our bad habits are subliminal because of ads, commercials and radio.Why 4 stars? I didn’t really need that much business data and could have used a bit more personal.We are creatures of habit and it’s really on to you and whether you can make the change or not. Belief plays a big role in our daily success. I hope that I can use some of the tips in this book to finally implement some changes."}, {"userName": "Amin Dorosti", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/1627772-amin-dorosti", "userReview": "این کتاب یکی از چهار/پنج کتابی‌ست که من در زمینه  موفقیت و رشد شخصی  و موضوعات مرتبط با آن در طول حدود ده سال اخیر مطالعه کرده‌ام، آن قبلی‌ها که هیچ کدام حتی ذره‌ای هم برایم آموزنده و جالب نبودند، و معمولا هم نیمه‌کاره رها شدند، اما این یکی کمی تا اندکی خوب بود و تا آخر خوانده شد درباره کتاب قدرت عادتنخست. من به طور کلی با فضای کتاب‌های حوزه موفقیت مشکل دارم (دلیل آن را خواهم گفت) و هیچ‌گاه هم نتوانستم با آن‌ها به قولی حال کنم. پس بی‌تردید گزارش من جهت‌گیری دارددوم. گذشته از این قضاوت‌های شخصی من! این کتاب البته با فضای رایج کتاب‌های ژانر موفقیت متفاوت بود و به همین دلیل هم تا حدی از آن خوشم آمد! در واقع این کتاب ساختاری تقریبا علمی دارد و بیش از آنکه درباره موفقیت باشد، درباره تلاش برای بهبود رفتارها و عملکردهای شخصی هست و از این رو می‌تواند در جای خود مفید هم باشد به طور مشخص ایدۀ اصلی کتاب چنین استبسیاری از رفتارها و کنش‌های روزانه ما ناشی از عادت‌های ماست. کنش‌های ناشی از عادت، دربردارندۀ سه بخش هستند: سرنخ، روتین، پاداش. نکته مهم دربارۀ چرخۀ عادت این است که ما در طول این چرخه از کنش‌های خود، آگاه نیستیم و بدون تصمیم‌گیری و سنجش و گزینش عمل می‌کنیم. به عنوان مثال فرآیند رانندگی یکی از این عادت‌هاست. نکته جالب در مورد چرخۀ عادت این است که در این چرخه‌ها می‌توان یک روتین جدید را جایگزین یک روتین دیگر کرد. بنابراین می‌توان با همان سرنخ و پاداش قبلی، یک روتین دیگر را جایگزین یک روتین مضر کرد. با این ترفند می‌توان بسیاری از عادت‌های نادرست همچون اعتیاد را از بین برد. البته در این میان برای ادامۀ چرخۀ عادت ِ روتین جدید، به یک عامل دیگر نیز نیازمندیم:  باور یا اعتقاد.  در واقع باور به اینکه می‌توانیم تغییر کنیم و می‌توانیم عادات نادرست خود را از بین ببریم یک تحلیل کلی درباره کتاب‌های ژانر موفقیت همانگونه که در بالا اشاره کردم، این کتاب درباه بهبود رفتارهای شخصی است و از این رو با سایر کتاب‌های ژانر موفقیت (کتاب‌های با عناوینی همچون یک شبه میلیونر شوید یا سه ساعته فیلسوف شوید و غیره) بسیار متفاوت است. با این حال با توجه به این که کتاب‌های ژانر موفقیت این روزها به شدت همه‌گیر شده‌اند در اینجا تحلیل و نقد کوتاهی از این کتاب‌ها می‌آورم. هر چند که این تحلیل چندان ارتباطی با کتاب قدرت عادت ندارداساسا منطقی که در پس کتاب‌های ژانر موفقیت نهفته است از بن و بنیاد ایراد دارد! اگر از گونه‌های مبتذل‌تر منطق آن‌ها (مثلا اینکه هر چه را که آرزو کنید و با تمام وجود خواهان آن باشید به واقعیت تبدیل می‌شود) بگذریم، این منطق به ساده‌ترین شکل چنین است: «هرکسی می‌تواند با تلاش شخصی خود موفق شود». این منطق به نظر من منطقی به شدت بی بنیاد و فریب‌دهنده است، چرا که می‌خواهد همه چیز را به خودِ فرد ارتباط دهد و سایر موارد موثر محیطی همچون شرایط سیاسی، اجتماعی ، اقتصادی، فرهنگی و غیره و به ویژه فاصله‌ طبقاتی و تقسیم ناعادلانه فرصت‌ها که ناشی از نظام‌های سرمایه‌سالار است را پنهان کند‍! در واقع نخستین نتیجه‌ای که بی‌درنگ از این منطق بیرون می‌آید چنین است: اگر آقای ایکس امروز میلیاردر است، این ثروت صرفا ناشی از تلاش و توانایی شخصی خود اوست و نه ناشی از شرایط خانوادگی خاص او و ثروتی که از پدرش به او رسیده و هزاران رانت و لابی و فرصت نابرابر و غیره؛ و اگر شمایی که امروز محتاج پول توجیبی ماهانه خودت هستی در این شرایط ناگور به سر میبری باز هم این شرایط صرفا ناشی از ناتوانی و بی‌لیاقتی و تلاش نکردن خود شخص ِ تو است و بس! و جامعه و شرایط و فرصت‌های اقتصادی و سیاست و فرهنگ و خانواده و هزار عامل کوچک و بزرگ دیگر هیچ نقشی در این بدبختی تو ندارند! خنده دار نیست؟؟ به باور من اتفاقا این منطق را بیش از همه همان آدم‌هایی که با بهره‌گیری از هزاران دوپینگ توانسته‌اند به ثروت و قدرت برسند تبلیغ می‌کنند! چرا که خودشان هم به خوبی می‌دانند که دوپینگ کرده‌اند و از این رو فرافکنی می‌کنند تا دوپینگ آن‌ها لو نرود. اما از این نقد کلی که بگذریم، فضای این‌گونه کتاب‌ها نیز به شدت فریب‌دهنده و به دور از واقعیت است، و بیش از هر چیز فرد را از واقعیت‌های زندگانی و جامعه جدا می‌سازد و در رویاهای دروغین غوطه‌ور می‌کند. افزون بر این ها، از نظر محتوا و به تعبیری حرف اصلی و لب کلام نیز فقری عجیب و غریب در این کتاب‌ها به چشم می‌خورد! به گونه‌ای که گاه می‌توان کل حرف حساب کتاب را در یک پاراگراف آورد! حال آن‌که نویسنده صدها صفحه را برای تکرار همین یک پارگراف سیاه کرده است! در تحلیل نهایی بر این باورم که این کتاب‌ها راست می‌گویند! آن‌ها راه موفقیت هستند! البته راه موفقیت برای نویسنده کتاب‌ها و نه خواننده آن‌ها! چرا که نویسنده با نوشتن و فروش همین کتاب‌ها پول خوبی به جیب می‌زند! البته نه در کشور ما، بلکه در کشورهای دارای قانون کپی رایت که بهای یک جلد از همین کتاب‌های موفقیت گاهی به صد تا دویست دلار می‌رسد جوینده و پاینده باشیدامین درستی"}, {"userName": "Scott", "userReviewDate": "Jul 06, 2012", "userURL": "http://www.goodreads.com/user/show/7236889-scott", "userReview": "Duhigg's Power of Habit offered a staggering statistic about our lives: 40% of what we do is habitual. 40 percent! That means that a huge majority of what we do in our lives is practically unconscious and habitually helping us progress or digress. The major takeaways for me include two main insights. First, identifying your habit's cues and rewards gives one understanding of why we do what we do. For example, when analyzing my habit of running, there are specific cues and rewards that both initiate and reward my exercising. My cues revolve around clearing my head and feeling accomplishment. I run either in the morning (after I wake up) or after work (after a long day at school/work) to clear my head. Also, I desire to accomplish something everyday, and running fulfills that craving. If I run in the morning, then I feel that I've already accomplished something that day. The second takeaway from this book is the principle of small victories. When you have a series of small victories, then your days can't help but to be filled with successful habits. For example, I feel accomplishment with a morning run. After a great start to the day, other small victories come more easily. I'm more positive,I want to eat healthy, I have more patience, and I work more efficiently. It's just a balanced way to live life. Identifying Cues/Rewards and earning Small victories changes habits and subsequently 40% of your life."}, {"userName": "Mahshid Parchami", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/60824074-mahshid-parchami", "userReview": "کتاب فوق العاده ای بود. خیلی بهتر از این دست کتابهای خودیاری و موفقیت. مبتنی بر پژوهش های بسیار درباره ریشه عادات در زندگی فردی، اجتماعی و سازمان ها. هر چند اطلاعات عمومی جالبی هم کسب کردم اما اگه حداقل یکی از عادت های نامطلوبم رو با روشش بررسی نکنم؛ خیلی کم کاری کردم درباره این کتاب"}, {"userName": "Zohreh Hanifeh", "userReviewDate": "Nov 23, 2016", "userURL": "http://www.goodreads.com/user/show/29667924-zohreh-hanifeh", "userReview": "با موبایل براش یک ساعت ریویو نوشتم failed داد!الان دیگه حوصله ندارم دوباره بنویسم باشه یه وقت دیگه :|"}, {"userName": "Nada EL Shabrawi", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/9361151-nada-el-shabrawi", "userReview": "Expect a video about this marvelous book soon."}, {"userName": "بسام عبد العزيز", "userReviewDate": "Jun 04, 2016", "userURL": "http://www.goodreads.com/user/show/13595172", "userReview": "معلومتان جديدتان مهمتان جدًا ستعرفهما بعد قراءة هذا الكتاب المعجزة:أولًا : الإنسان عندما يقوم بأي فعل فإنه يفكر مسبقًا فيما سيعود عليه من فائدة من فعله.ثانيًا : الإنسان عندما يقوم بفعل ما بشكل تكراري يصبح هذا الأمر عادة عنده.لحظة!من قال أنهما \"جديدتان\"؟أليس كل شخص يقوم بالفعل بالبحث عن الفائدة في كل ما يفعله؟ هل ننتظر مثلًا أن نجد شخصًا ما يقوم بفعل ما وهو يدرك أنه سيكون ضارًا به أو لن يعود عليه بأي فائدة أو متعة أو خير بأي شكل؟!!! أليس هذا بتعريف \"الجنون\"؟؟؟ هل الكاتب يوجه الكتاب إلى المجانين؟؟وماذا عن تحول \"الفعل التكراري\" إلى عادة؟ أليس تعريف كلمة \"عادة\" أصلًا هو \"فعل يقوم به الإنسان بشكل دوري\"؟! ما الإضافة الجبارة التي أتى بها الكاتب؟!! إذن فماذا لدينا هنا؟كتاب من مئتي صفحة من أجل إخبارنا بشيء كل شخص يدركه بالفعل!!فقط لنتخيل أن يقوم شخص ما بعمل عملية \"مط\" للمعلومتين \"العظيمتين المجهولتين\" السابق ذكرهما في مئتي صفحة! ما الذي ننتظره؟ حشوًا ثم حشوًا ثم حشوًا!وهذا بالفعل ما ستجده.. فالكاتب يقوم بتجميع عدة قصص مسلية من الصحف والجرائد ويحكيها في الكتاب.. طبعًا لا تسأل هل لهذه القصص علاقة بما يريد الكتاب أن يقوله أو لا.. فالسؤال لغير الله مذلة يا أخي! وإن كنت مصرًا على الذنب فالإجابة لا .. فما بين قصة عن طبيب أخطأ في عملية وما بين قصة عن صاحب ستاربكس الذي اشتراها عندما كانت خاسرة.. لن تستطيع أبدًا أن تصل إلى أي شيء يريد أن يقوله الكاتب!هل يريد أن يقول أن الشركات الكبيرة تهتم بوضع ثقافة داخلية لموظفيها؟ ياله من اكتشاف! ومن قال أن الشركات الكبيرة ليست لديها ثقافة ما؟! هل يريد أن يقول أن الإنسان عندما يغير عادة ما فإن هذا يؤثر على حياته؟ ياله من إكتشاف آخر! فطالما أن الإنسان قام بتغيير أي عادة ما فطبقًا لتعريف \"التغيير\" فقد غير حياته!! هل يريد أن ينصحنا بالطريقة الأمثل لاكتساب العادات؟؟ أعتقد أن الكاتب قد فشل تمامًا في هذا لأنه -وعلى حد تعبيره واعترافه- فكل إنسان حالة مختلفة والعادات لها ظروفها المختلفة وبالتالي لا توجد طريقة واحدة!!!إذن ما الذي ستخرج منه بعد إنتهائك من الكتاب؟آه.. هذا صحيح تمامًا :\"كتب التنمية البشرية أكبر عملية نصب منظمة في التاريخ\"!"}, {"userName": "Carol (Bookaria)", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/1880531-carol-bookaria", "userReview": "I thought this would be a self-help book on tips of how to improve habits and it is much more than that. The author analyzes habits on different levels such as in individuals, organizations, businesses and societies. He uses real-life examples and historic events to describe behavioral habits. Since the book was not what I expected I started getting distracted 20% in but pulled through to the end. About half-way of listening to the audiobook I started to do the review of the book I was expecting but did not get. I apologize in advance for the rambling. I read this book looking for tips on improving my personal habits, mainly eat healthier & exercise more. These two are very common goals for a lot of people but even though I understand intellectually what needs to be done, the plan is hard to execute on a daily basis. Mainly, I lack motivation to exercise because...As I was reading the book I was looking for a structured plan about habit modification but it was mostly about understanding habits and willpower. However, I believe that just the fact that there is the intention of improving behavior sets the wheels in motion and makes it easier to start the process and continue it.At least I have a better idea of how to manage cravings and keep in track."}, {"userName": "Zahra Taher", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/15378531-zahra-taher", "userReview": "من المثير للعجب كيف أن أكثر الأعمال أو العادات التي نقوم بها ولا ندرك الدوافع التي تحركها هي اعمال لها أنماط محددة واستجابات من قبل الدماغ . ولكن الأهم هو إمكانية التعرف على هذه الأنماط ثم التحكم بها للتخلص من العادات السيئة وتعزيز العادات الإيجابية والكتاب يرتكز على هذه الحلقة التي تبدو أنها أساس كل العادات مهما اختلفتفهناك عادة أو أمر روتيني نقوم به نحتاج أن نبحث عن الدليل الذي يثيره، كالمثال الذي أعطاه الكاتب عن نفسه، فأثناء تأليفه للكتاب كان معتاداً على النهوض من مكتبه والذهاب إلى الكافتيريا لشراء كعكة بالشوكولا وهي عادة سلبية تؤثر على وزنه. فكانت الخطوة الأولى هي البحث عن الدليل أو الدافع وراء هذه العادة؟ هل هو الجوع أو الملل أو الرغبة بمحادثة الأصدقاء الذين يلتقي بهم في الكافتيريا؟ أو أي سبب آخر؟ ،بعد تحديد الدليل والأمر الروتيني يحاول معرفة المكافأة التي يحصل عليها من القيام بذلك، وهنا ينبغي له أن يجرب العديد من المكافآت والهدف من ذلك هو معرفة الرغبة التي تشبعها المكافأة كل مرة، وعند تشخيص الرغبة بدقة يمكن إشباعها ببدائل تكون أفضل وأنسب. ففي حالة الكاتب قام بتجربة مكافآت مختلفة عند نهوضه من الكتب والتوجه إلى شراء الكعك، كالقيام بنزهة قصيرة، أو الذهاب إلى زميل في غرفة مجاورة للحديث معه لوقت قصير، أو تناول تفاحة أو شرب فنجان من القهوة. والفكرة هنا تجربة أمور مختلفة لتشخيص الرغبة التي تدفع الكاتب كل مرة للنهوض من مكانه لشراء الكعك.ويمكن هنا الاستعانة بورقة وقلم عند القيام بتجربة المكافآت ، بعد كل تجربة يمكن كتابة أول ثلاث أشياء تطرأ على البال، كما فعل الكاتب هنا:ثم يتم ضبط المنبه ليعمل بعد 15 دقيقة، وبعد مرور الوقت وانطلاق المنبه يسأل نفسه ما إن كان لا يزال راغباً في تناول الكعك.فإذا كان بعد خمس عشرة دقيقة لا يزال يشعر بالدافع للنهوض وشراء الكعك، فإن الرغبة في تناول السكريات لا تحفز العادة . وإذا كان بعد التحدث مع أحد الزملاء لا يزال تريد تناول الكعك فإن الرغبة في التواصل البشري لا توجه سلوكه. ولكن إن وجد أنه بعد الحديث مع أحد الأصدقاء إستطاع الرجوع بسهولة إلى العمل فإن المكافأة هنا هي الرغبة بتشتيت الإنتباه مؤقتاً من خلال العلاقات الاجتماعية. وبالتالي يمكنه التركيز على هذه المكافأة لإشباع الرغبة بدلاً من شراء الكعك. إذن فالأمر يتمحور حول عزل الرغبة التي يمكن من خلالها إعادة تنظيم العادة بشكل إيجابي.ومن الأمور الملفتة في الكتاب التي أرى أنها لا تقل أهمية عن تحديد حلقة العادة ومحاولة تحديد الرغبة هو \"الإرادة\" التي يحتاجها الفرد للإبقاء على الأثر الإيجابي الذي يحصل عليه بعد تغيير نمط العادة، وهنا أحد الأمثلة الجميلة التي يذكرها الكتاب:في عام 1992 قامت عالمة نفس بريطانية بإجراء تجربة في اثنين من مستشفيات جراحة تقويم العظام وأساس التجربة هو كيفية تعزيز قوة الإرادة لدى الأشخاص الذين يعارضون التغيير بشكل استثنائي. يبلغ متوسط أعمار الخاضعين للتجربة 68 عاماً أغلبهم انتظروا سنوات قبل القيام بعملية بسبب ظروف مالية أو حياتية كما أن التعافي من هذه العمليات يأخذ وقتاً ويكون صعباً لأنه يتطلب تدريبات رياضية معينة أو ما يسمى بالعلاج الفيزيائي. وقد كانت مشكلة هؤلاء الخاضعين للتجربة هو عدم خضوعهم لتعليمات الطبيب أكثر الأحيان بسبب الآلام الشديدة التي كانوا يعانون منها. لذلك كانوا يتركون هذه الجلسات ولا يواظبون عليها.قامت عالمة النفس بإعطاء كل مريض بعد العملية كتيباً يذكر بالتفصيل برنامج إعادة التأهيل وخلفه ثلاث عشر صفحة إضافية صفحة لكل أسبوع مع مساحات فارغة وتعليمات :\"أهدافي لهذا الأسبوع هي....\" اكتب بالضبط ما تنوي القيام به. بعدها قامت الباحثة بمقارنة تعافي الأشخاص الذين كتبوا أهدافاً مع الأشخاص الذين حصلوا على الكتيب ولم يكتبوا شيئاً.وبينما كانت تفحص الكتيبات رأت شيئاً مشتركاً: كيفية تعامل المرضى مع لحظة معينة من الألم المتوقع. أي أن المرضى كانوا يرصدون اللحظة التي يعلمون أنهم سيشعرون فيها بالألم لو قاموا بحركة معينة ثم يكتبون خطة مفصلة للطريقة التي سيتغلبون بها على هذا الألم لحظة وقوعه. مثلاً كان أحد المرضى يتدرب على المشي إلى دورة المياه وكان يعلم أنه كل مرة يقف فوق الأريكة يشعر بآلام شديدة. لذلك كتب خطة للتعامل مع ذلك: يقوم بالخطوة الأولى تلقائياً على الفور حتى لا يتعرض لإغراء الجلوس مرة أخرى عند البدء بالشعور بالألم.ما يفعله هؤلاء المرضى أنهم يحددون نقطة الانعطاف أي اللحظة التي تظهر فيها عقبة ما أو ألم أو صعوبة معينة، ويخبرون أنفسهم أنهم يرغبون بالتغلب عليها ويضعون الخطة مثال ذلك أحد المرضى يسير للقاء زوجته عند الظهيرة. الدليل: الساعة 3 والنصف وقت عودة زوجته إلى المنزل. المكافأة: لقاء زوجته. وهكذا ينضبط في المشي، أي يجعل من الانضباط الذاتي (عادة). الجميل أن هذا الأمر هو ما تحاول الشركات استغلاله لتعزيز قوة الإرادة لدى موظفيها حتى يصبح الانضباط الذاتي عادة. مثل شركة ستاربكس starbucks فمثلاً تدخل ضمن تدريبات الشركة خطة تعرف بإسم أسلوب LATTE (Listen استمع للعميل, acknowledge اعترف بشكواهم, Take action تصرف عن طريق حل المشكلة, Thank them اشكرهم, فسر سبب حدوث المشكلةExplain). تمتلك الشركة عشرات الأمور الروتينية التي يتعلم الموظفون استخدامها خلال نقاط الانعطاف التي تسبب الضغط. مثلاً عادات معينة يتعلمها الموظفون للتمييز بين الزبون المستعجل أو الزبون الدائم أو قليل الصبر، وتفعل الشركة ذلك أيضاً بإعطاء كتيبات فيها صفحات فارغة يمكن للموظف أن يكتب فيها خططاً لنقاط انعطاف تواجهه أثناء العمل ليتدرب بعدها على هذه الخطط حتى تصبح تلقائية. إذن حتى تصبح (قوة الإرادة) .. (عادة) ينبغي اختيار سلوك معين مسبقاً ثم اتباع الأمر الروتيني عند ظهور نقطة الانعطاف وهي النقطة التي قد تسبب عائقاً أمام الانضباط أو محاولة تجاوز عائق ما.خلاصة الكتاب هي في الملحق الموجود في نهايته أما باقي الكتاب فهو عبارة عن أمثلة ولكنها تستحق القراءة للاستفادة منها"}, {"userName": "Dagio_maya ", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/69893331-dagio-maya", "userReview": "\"\"Non esistono organizzazioni prive di abitudini istituzionali. Esistono luoghi dove le abitudini vengono deliberatamente studiate e altri dove invece si formano spontaneamente, spesso sulla rivalità e la paura.\"Ogni mattina ti alzi; ti lavi e bevi un caffè. La solita strada per recarti al lavoro, le solite facce che riempiono le tue giornate.Detta così la nostra vita è di una tristezza incredibile ma la routine non solo ci dà sicurezza ma ci identifica.Charles Duhigg – giornalista del  New York Times  che vanta un premio Pulitzer per il giornalismo divulgativo- analizza il mondo delle abitudini, ossia, quei comportamenti automatici che dopo un periodo di prova diventano titolari del nostro quotidiano.Ma come nascono le abitudini e come funzionano? E, soprattutto, possono essere modificate? In che modo?Il saggio di Duhigg si compone di tre parti:1) Le abitudini degli individui2) Le abitudini delle organizzazionidi successo 3) Le abitudini delle societàUn'ultima parte consiste in una guida che esemplifica i passi da compiere per modificare un abitudine che si vuole abbandonare.Un testo molto interessante scritto con un linguaggio accessibile e che prende in esame differenti aspetti sociali in cui le abitudini sono manipolate in un senso o nell'altro.Si legge quindi dell'Anonima Alcolisti, l'Esercito, le multinazionali- come ad esempio la catena di caffetterie Starbucks o i centri commerciali statunitensi Target- fino ad arrivare ai movimenti dei diritti civili. Un filo sottile ma resistente, quello delle abitudini, che si tende tra realtà così differenti.Duhigg manda un messaggio preciso: bisogna prendere coscienza del fatto che le abitudini apparentemente ci dominano (in una sorta di dittatura) ma in realtà siamo noi ad avere il controllo.Il comportamento di routine è assolutamente malleabile, manipolabile e, pertanto, se si vuole si può scegliere la strada del cambiamento. Ogni capitolo ruota attorno a un argomento centrale: le abitudini si possono cambiare, se capiamo come funzionano."}, {"userName": "Nyamka Ganni", "userReviewDate": "Feb 21, 2013", "userURL": "http://www.goodreads.com/user/show/2044236-nyamka-ganni", "userReview": "Сэтгэл судлал, хүний зан араншин сонирхдог хэдий ч нарийн мэдлэгээр маруухан надад үнэхээр таалагдлаа. Зуршил хэрхэн үүсдэг, түүнийг яаж өөрчилж болох зэргийг шинжлэх ухааны үүднээс нь тайлбарлаад бодит амьдрал дээрх жишээнүүдийг дурьдсан байна. Анхаарууштай:  - Аливаа үйлдлийг хангалттай олон удаа хийхэд зуршил болж хүнээс ямар ч шийдвэр гаргах шаардлагагүйгээр хийгддэг үйлдэл болж хувирч болно.  - Дээрх шинж чанарыг ашиглаж зуршил болгохыг хүсч байгаа үйлдлээ байнга давтан хийхэд өөрийн мэдэлгүй зуршил болон хувирна.  - Муу зуршлыг эртхэн засахгүй бол маш том аюулыг дагуулж мэднэ. Өөрөөр хэлбэл хүн өөрийгөө захирах чадваргүй болж зуршилдаа захирагдана гэсэн үг юм. Шинэ оноо ийм номоор эхлүүлсэн нь зөв болжээ."}, {"userName": "Schmacko", "userReviewDate": "Apr 11, 2012", "userURL": "http://www.goodreads.com/user/show/1242165-schmacko", "userReview": "Charles Duhigg has three fascinating half-books here. They’re all joined by the theme of habits. He speaks of habits from a personal perspective. Then he talks about business habits, switching from cognitive psychology to organizational psychology. And finally, he talks about sociology. What unifying pattern do these three have? That same old model I learned back in college in 1991… The idea of cues, actions, and rewards is throughout this book. It’s not very new nor very strong; in fact, Duhigg mentions that Claude Hopkins in his My Life in Advertising book first discussed this old, flimsy dusty model in 1927. So why does this book get 3 stars? Because Duhigg does find several fascinating stories about each section. He uses examples from AA attendees to overeaters to Target figuring out which person is pregnant and sending out the right kind of advertising without offending the person. This is some cool stuff, great fodder for cocktail conversations – scary in sort of a Big Brother way. (“We do not control ourselves!”)Duhigg could’ve made this book better, though. He says there isn’t enough research to say why some habits prevail and others are changeable. Why write a book then? Is this only a compendium of the most recent research? If it is, it misses some significant stuff. There are plenty of other sources he could’ve used as possible models. Malcolm Gladwell talks about how sociological influences because ubiquitous - social habit - in The Tipping Point (2000). Chip and Dan Heath talk about how to change when change is difficult in Switch (2007). I can also think of several other authors who’ve given more succinct processes to take the models and attempt to make them more useable. Duhigg seemed too scared to commit to some possibilities, some clear ways to influence the change of habit. He skirts it, and then he excuses himself, saying that habits are too multifaceted to offer possible models in detail.So his models are vague or old. He also doesn’t credit or discredit Gladwell or the Heaths or others who have had recent bestsellers talking about the same ideas. Then he writes three half-books that are barely bridged to each other. Still, his examples are good, and his style is infinitely readable. I would’ve liked to have him commit to some postulation that is more recent than Hopkins’ 1927 model. I also wish his bridge between the personal, organizational, and social was stronger."}, {"userName": "Joe Soltzberg", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/44279821-joe-soltzberg", "userReview": "A very good book about habit formation. My favorite parts were the various stories and anecdotes the author provided for each lesson about habits. The book is fairly cohesive and my only complaint is that the 'how to use this book' section at the end is a bit too simple and doesn't encompass the ideas in every chapter (such as incorporating keystone habits, etc.). Nonetheless, definitely worth a read. I didn't get this book to try and change any of my habits, but still learned a ton. Here's what you need to know:1. Habits are controlled in your brain by the basal ganglia and happen subconsciously.2. The habit loop has 3 components: the cue, the action, the reward.3. To change a habit, you cannot change the cue or the reward, just substitute a different action for that cue that produces a similar reward.4. Things we do out of habit we are better at and do more dutifully than those we must think about.5. To get people to use your product, establish a habit loop."}, {"userName": "Yousif Al Zeera", "userReviewDate": "Aug 21, 2012", "userURL": "http://www.goodreads.com/user/show/12086858-yousif-al-zeera", "userReview": "This book delves into some science behind the notion of \"habits\". It hands out the \"scientific\" process of changing habits. In between, there are interesting stories of how individuals, societies and companies can make the best use out of their habits or other people's habits."}], "description": "A young woman walks into a laboratory. Over the past two years, she has transformed almost every aspect of her life. She has quit smoking, run a marathon, and been promoted at work. The patterns inside her brain, neurologists discover, have fundamentally changed.Marketers at Procter & Gamble study videos of people making their beds. They are desperately trying to figure out how to sell a new product called Febreze, on track to be one of the biggest flops in company history. Suddenly, one of them detects a nearly imperceptible pattern—and with a slight shift in advertising, Febreze goes on to earn a billion dollars a year.An untested CEO takes over one of the largest companies in America. His first order of business is attacking a single pattern among his employees—how they approach worker safety—and soon the firm, Alcoa, becomes the top performer in the Dow Jones.What do all these people have in common? They achieved success by focusing on the patterns that shape every aspect of our lives. They succeeded by transforming habits.In The Power of Habit, award-winning New York Times business reporter Charles Duhigg takes us to the thrilling edge of scientific discoveries that explain why habits exist and how they can be changed. With penetrating intelligence and an ability to distill vast amounts of information into engrossing narratives, Duhigg brings to life a whole new understanding of human nature and its potential for transformation. Along the way we learn why some people and companies struggle to change, despite years of trying, while others seem to remake themselves overnight. We visit laboratories where neuroscientists explore how habits work and where, exactly, they reside in our brains. We discover how the right habits were crucial to the success of Olympic swimmer Michael Phelps, Starbucks CEO Howard Schultz, and civil-rights hero Martin Luther King, Jr. We go inside Procter & Gamble, Target superstores, Rick Warren’s Saddleback Church, NFL locker rooms, and the nation’s largest hospitals and see how implementing so-called keystone habits can earn billions and mean the difference between failure and success, life and death.At its core, The Power of Habit contains an exhilarating argument: The key to exercising regularly, losing weight, raising exceptional children, becoming more productive, building revolutionary companies and social movements, and achieving success is understanding how habits work. Habits aren’t destiny. As Charles Duhigg shows, by harnessing this new science, we can transform our businesses, our communities, and our lives.", "title": "The Power of Habit: Why We Do What We Do in Life and Business", "url": "https://www.goodreads.com/book/show/12609433-the-power-of-habit", "average": 4.05, "cover": "https://images.gr-assets.com/books/1366758683l/12609433.jpg", "reviews": 11238, "authors": [{"url": "https://www.goodreads.com/author/show/5201530.Charles_Duhigg", "name": "Charles Duhigg"}], "type": ["Nonfiction", "Psychology", "Self Help", "Business", "Self Help"], "outlinks": ["http://www.goodreads.com/book/show/12609433-the-power-of-habit", "http://www.goodreads.com/book/show/13133452-the-power-of-habit", "http://www.goodreads.com/book/show/17248798-the-power-of-habit", "http://www.goodreads.com/book/show/32799605", "http://www.goodreads.com/book/show/35484429", "http://www.goodreads.com/book/show/18594642-the-power-of-habit", "http://www.goodreads.com/book/show/12609434-the-power-of-habit", "http://www.goodreads.com/book/show/22386303", "http://www.goodreads.com/book/show/24856590-the-power-of-habit", "http://www.goodreads.com/book/show/20890366", "http://www.goodreads.com/book/show/19446436-la-dittatura-delle-abitudini", "http://www.goodreads.com/book/show/12609432-the-power-of-habit", "http://www.goodreads.com/book/show/25733966-smarter-faster-better", "http://www.goodreads.com/book/show/40389564-a-for-a-do-h-bito", "http://www.goodreads.com/book/show/38593519-pouk-adaj-sobie-ycie-jak-uporz-dkowa-siebie-i-sw-j-wiat", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}