{"ratings": 26930, "userreviews": [{"userName": "Margitte", "userReviewDate": "Jan 29, 2014", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "This is the story of Rahima and Shekiba. Rahima is our main storyteller, who became a child bride at the age of thirteen, and, together with her two older sisters, Shahla and Parwin, were sold into marriage by their father on the same day. Her life would be riddled with everything an Afghani woman could encounter as part of the cultural practices in their families. The picturesque prose would relate a story of fear, oppression, abuse, love, hope and freedom. Her aunt, Khala Shaima, crippled and man-less, became her mainstay with the ongoing narrative she told her nieces about their great-great-great grandmother, Shekiba, who worked as a girl-man guard to the king's harem a century earlier. Rahima herself became Rahim, a bacha posh, when her mother could not produce a son and it was decided that Rahima had to act as the boy in the family. Although it made their life easier, it also allowed Rahima a freedom of movement no other girl ever enjoyed. It planted the seed of her eventual decision to break free and fly away, like the birds in her sister, Parwin's paintings. But it also created the situation in which her whole life would become a tale devoid of poetry and prose in her new husband's house.Comments: I do not have the ability to describe the profound feelings this book has ignited. It was not meant as an emotional roller coaster ride for the reader at all, but for me it toggled all the buttons of every emotions in existence. There was not suppose to be soppy tears behind the prose. It is also one of those books, written so beautifully, which forces the reader to wander word for word through the lives of all the courageous women in Afghanistan. This is the story of a country's women, experiencing the political and social upheavals of a country's own weaknesses and strengths, and the role the people play in being forced to be the buffer zone between the competing external powers battling for control over the region and how the people adapt to the challenges and hardships. The detailed and rich prose ensure that the reader walks away with a much deeper understanding for a country we only see through the constant wars and upheavals in the media. This story contains all the elements that make a book a winner: smells, tastes, colors, emotions, history, traditions, politics: everything a good book needs to become a great one! Rahima became so real that I wanted to write her a letter after closing the book! Although it is a fictional tale, written with such grace and integrity, it portrays enough of reality to leave the reader informed and wiser in the end. I simply loved this book. Readers of Khaled Hosseini will dance for joy. This is the book for you! HIGHLY RECOMMENDED!This is an uncorrected e-proof in the Witness Impulse stall by HarperCollins Publishers. It was made available by http://edelweiss.abovethetreeline.com/ for review"}, {"userName": "Kevin McAllister", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/233482-kevin-mcallister", "userReview": "Reading this novel was an unusual experience in that it was a fascinating, but at the same time,a very painful and disturbing read. I would go as far as to say this was a real page turner. It focused on two different Afghani women. One living at the beginning of the 20th century and the other at the beginning of the 21st. I was always wondering what would happen next. But sadly most of the time it was just a case of their lives deteriorating further and further. The saddest and most painful aspect of this novel was that women living in modern day Afghanistan really have it no better than the women living centuries ago. The book ends with a glimmer of hope, but the overall message of the book left me wondering if the men of Afghanistan will ever realize the injustices they commit against their women ?"}, {"userName": "Crumb", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/53025065-crumb", "userReview": "I haven't found a book by Nadia Hashimi that I haven't liked. Maybe it is because I have a preference or fondness toward fiction set in the Middle East or maybe it is because Nadia Hashimi woos me in such a way with her writing, that it is impossible for me to put a book by her down. In The Pearl That Broke Its Shell there are two alternating story lines. Usually when I'm presented with a book written in such a way, I prefer one story to the other. Not this time. Both stories were equally mesmerizing and moving.The reason I like to read about the Middle East is because I find the culture so interesting. In this book, Nadia Hashimi writes about the custom of the Bacha Posh. A Bacha Posh is a girl that is dressed up as a boy when a family is unable to have a son. In the Middle East, having a male heir is of utmost importance and a family without one is looked upon as weak. Therefore, in this book, we meet Rahima and her family. They were unfortunately, cursed with all daughters. Finding themselves unable to produce a male heir, they turned Rahima, into Rahim. As Rahim, Rahima felt free. She could roam the streets unsupervised, attend school, and kick a ball around. Rahim represented everything that “Rahima” wasn’t in her female role. Unfortunately for Rahima, being a bacha posh doesn’t last forever. When a woman starts her bleeding or “illness” as it is known in the middle eastern culture, they must be turned back into their female selves. When Rahima is changed back.. her naseeb.. or her destiny.. is changed as well. This book would not be considered technically perfect in terms of its writing. It might not be precise or exact in terms of its grammar. But for me.. it was a perfect story. And that is why I read. I crave a good story, like my body craves nutrients. Nadia Hashimi nourishes me, she feeds my soul. I would settle for nothing less."}, {"userName": "Pouting Always", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/48650982-pouting-always", "userReview": "I really enjoyed the ideas behind the book but not so much the execution which is why I was kind of leaning towards three stars at first. The writing felt juvenile in places and then it would change and be very eloquent. I read this book completely and I wanted to finish it I just wish the editing was better and she had made the writing in the story more consistent and there were places where I felt like I didn't really get anything out of the scenes. I think it's a better read for someone younger but I think if you're well read it's not as satisfying because the author lacks the ability to use language in a more subtle way and build the story that way."}, {"userName": "Tania", "userReviewDate": "Apr 21, 2014", "userURL": "http://www.goodreads.com/user/show/6450088-tania", "userReview": "I was a little girl and then I wasn't. I was a bacha posh and then I wasn't. I was a daughter and then I wasn't. I was a mother and then I wasn't.3.5 stars. I am in two minds about this book. On the plus side I thought the two alternating stories was good, and it really made me think about women's life’s in Afghanistan. Even though we \"know\" that they have very little power or freedom, it is a shock to the system to read what this means when translated into someone's daily life. Some of the aspects I enjoyed the most were learning about what a bacha posh is, how the parliament works (or doesn't) and that disabilities are so abhorred. I was really upset about how cruel some women could be to other women, especially the mother-in-law characters. I understand that this is because they have no other power, but I still find it very sad.So why did I think this book was good and not great. I have to admit that I'm not a 100% sure. I suspect it has something to do with the author's writing style. I did not deeply connect with any of the characters. This is definitely not the general feeling out there when reading other reviews, so please try this book if you normally enjoy this genre. I am still glad that I read it even though it was not a 5 star read for me."}, {"userName": "Adina", "userReviewDate": "Nov 04, 2014", "userURL": "http://www.goodreads.com/user/show/22189348-adina", "userReview": "DNF at 25%I have a rule that I do not rate a book unless I read more than half and it is valid for this book as well. The rule does not mean that I will no write a my thoughts on the bit that I read. I decided to buy this because of its subject: the difficult life of women in Aghanistan. The novel is about the use of the bacha posh custom where young girls are dressed and treated as boys until they become of marriageable age. The custom is usually used to save the honor of daughter-only families and to allow the women/girls in the house to go outside. Although the subject was very harsh and my heart should have broken in front of the hardship the characters had to face I didn’t feel anything. I could not connect with Rahima or Shekiba, the main characters, they felt flat to me. The only emotion I acknowledged was anger with the grandmother of Shekiba. It is terrible how women tear each other apart. I understand they only have power over other weaker women but still, it is not an excuse to act heartless and treat someone so bad. I was not impressed by the writing and the dialog did not seem to add anything to the story. It could have been an ok read, maybe more, but I did not have the patience. I can read a book where the writing does not appeal to me if the plot is addictive but it was not the case here. The bacha posh custom interests me and I am planning to expand my knowledge on the subject by reading The Underground Girls of Kabul: In Search of a Hidden Resistance in Afghanistan ,which is non-fiction and I hope the quality is much better."}, {"userName": "Kevin Ansbro", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/43579369-kevin-ansbro", "userReview": "Writing legend and authority on all things Afghani, Khaled Hosseini, endorses this book, and generously wrote thus:\"Nadia Hashimi has written a tender and beautiful family story. Her always engaging multigenerational tale is a portrait of Afghanistan in all of its perplexing, enigmatic glory.\"Always engaging? Really? This unpolished pearl certainly succeeded in breaking my shell and I gave up on it after a charitably gallant effort. It's poorly edited, the writing is all over the place and there is a paucity of story, or character, development. I wasn't even sensorily transported to Afghanistan. It could have been anywhere!  I can only assume that the Hosseinis and the Hashimis must know each other from attending glitzy social events. The Kite Runner it ain't."}, {"userName": "Lori", "userReviewDate": "Jun 21, 2014", "userURL": "http://www.goodreads.com/user/show/3332895-lori", "userReview": "Bravo, Hashimi on a wonderful debut novel! I thoroughly enjoyed this... I do think 'Birds Fly Away' would have been a better title! I highly recommend this to fans of Khaled Hosseini and I look forward to reading more by her!"}, {"userName": "Maria Espadinha", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/20749430-maria-espadinha", "userReview": "A Ostra Quebrou e a Pérola RolouCom 5 filhas para criar e o Padar-Jan afectado pela guerra e viciado no ópio, a Madar-Jan nadava em aflições!- Esta família precisa dum filho -- interveio em seu auxílio Khala Shaima, a irmã mais velha da Madar-Jan.- Dum filho!? É esse o teu precioso conselho?! Estás-me a dizer aquilo que eu já sei, há que séculos! Há muito que isso teria acontecido, se a tua irmã soubesse ser melhor esposa! -- Fôra a réplica sacudida do Padar-JanAo invés de ripostar, Khala Shaima encetou uma história:Há um século atrás, Shekiba, a trisavó das raparigas, trabalhara incansável ao lado do pai. Executava todos os trabalhos pesados e lavrava a terra. Tornara-se forte, musculada e espadaúda que nem um rapaz. Transformara-se em Shekib -- o filho que o pai precisara...A história não convencera o Padar-Jan, que abominava as intromissões constantes de Khala Shaima. Porém, conquistara a Madar-Jan, que vira nela a solução para as dispensas vazias e as miúdas em casa, sem escola.Um filho poderia ir ao mercado regatear preços e acompanhar as irmãs nas saídas.E foi assim, que Rahima, a mais nova das cinco raparigas, virou Rahim. Aparou o cabelo e trocou a burca pelas calças, tornando-se o irmão e filho Salvador...A mulher afegã vive no inferno.O seu destino nasce com ela, num prolongamento do DNA que a sociedade lhe impõe:Casar, Parir e Trabalhar até Sucumbir!Fora de portas o oxigénio é-lhe negado, a não ser que saia atrelada a algum macho, nomeado pela família para o efeito.Vive em cativeiro , num estado de prisão permanente, e só lhe é permitido sair na companhia dum guarda.Mas há uma luz ao fundo do túnel -- a bacha posh, que em afegão significa disfarçar uma rapariga de rapaz...E esta é a história de duas bacha posh que se bateram pela liberdade -- arriscaram, sofreram, lutaram, e transitaram da Sobrevivência para a Vida!...Cada mulher afegã é uma pérola enclausurada na sua concha. Porém, há aquelas que se negam a uma vida bivalve -- partem a concha e rolam, permitindo-se um raio de luz nas suas vidas enegrecidas :)Para a Mulher Ocidental a Liberdade é um Direito!Para a Mulher Afegã a Liberdade é uma Conquista!"}, {"userName": "Donna", "userReviewDate": "Aug 10, 2014", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "I am torn between 3 and 4 stars. I liked the story, it is the writing that I had a problem with. I will start with the story portion.This story was told from the view point of two women in Afghanistan 100 years apart. Even though there was a huge gap between the two women, their stories were similar. It was all so sad, tragic and painful. It pained me straight to the heart, to read some of this. I felt the same way about this novel as I did about And the Mountains Echoed by Khaled Hosseini. It was like tragedy pinball, going from one painful and tragic moment straight to the next one. The author seemed set on 'high score'. Every single time these women had even a small glimmer of hope or happiness, it was ripped away from them in such a cruel manner. And it wasn't just the men who brought about their heart breaks. The women, too, were oppressive to the 'lesser' women in their keep. Here is an assignment if you read this. Every time these women have something good in their life, just say, \"uh-oh!\" And I kid you not, it will be ripped away from them. If you are looking for a warm fuzzy, this book is not it. Or if you like a big red bow to tie things up in the end, then this book may not be the one for you. Even with all the sadness, I would give the story 4 stars. Now for the writing. The writing was kind of rough and in other places it was almost poetic. The author relied heavily on dialog, which isn't such a bad thing. I love great dialog. But it wasn't enough to carry the entire book. In my review of the story portion of this book, I compared it to And the Mountains Echoed because of the similar theme on the tragedy scale, but the writing in this book was no where near as wonderful and descriptive as Khaled Hosseini's. I would read his work again in a heart beat. I don't feel that for this book. The writing was just, \"meh\".I thought the title was a little strange, but it makes total sense at the end. Over all, this was thought provoking. I wish these women had the same opportunities for freedom and happiness as the men. Life without love, respect, forgiveness and a soft place to fall is a deep dark void."}, {"userName": "Maria Espadinha", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/20749430-maria-espadinha", "userReview": "The Shell Breakers With 5 daughters to raise and a husband addicted to opium, Mother-Jan had plenty of worries material!- This family needs a son, advised Khala Shaima, the eldest sister of Mother-Jan- You really think so, Shaima? A son?! Is that your brilliant advice?! Telling me something I know for ages!?Mabey if your sister could be a better wife, we already had a boy playing around!?... - was the nasty reply from Father-Jan, that truely hated Khala Shaima always sniffing around!Instead of proceeding with such an unfruitful conversation, Khala Shaima began a story:A century ago, Bibi Shekiba, the great-great-grandmother of the girls, worked the fields, alongside with her father.She got strong muscles and a hard skin, just like any peasant male.Shekiba became the boy her father badly needed ...Shaima's story couldn't convince Father-Jan, but it conquered Mother-Jan, that saw in it the receipe for the empty food closets, and the possibility of girls going out for school!A boy could run errands and escort the girls out whenever required...So it was time for Rahima (the youngest of the girls) having a short haircut, trade the burka for trousers, and reborn Rahim, the so much needed son and brother, that could lead the family to salvation!..And this is the story of Rahima/Rahim and Shekiba/Shekib, two brave women that fought their way to freedom...An afghan woman is like a pearl imprisoned in the darkness of an oyster. But some of them are shell breakers, and roll towards the light!For Western Women Freedom is a Right!For Afghan Women Freedom is a Conquest!\"The pearl that broke its shell\" may be a fiction, but it's a story of Thousand Truths"}, {"userName": "Erin", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "3.5 stars Nadia Hashimi's debut novel is a dual storyline set in Afghanistan and centers around two women- Rahima(21st century) and Shekiba(20th century). Both women are trying to not lose sight of themselves in their male dominated world.  Having read Hashimi's second and third novels, I think this might be my least favorite of the trio. There was a bit of choppiness in the writing and the storylines dragged a bit in places. However, the voices of the character are captivating enough that a newcomer would be able to see that the women of Afghanistan are dear to the author."}, {"userName": "lisa", "userReviewDate": "May 02, 2014", "userURL": "http://www.goodreads.com/user/show/8851570-lisa", "userReview": "I feel I should have given this a higher rating since I read the whole thing, and it kept me fairly engrossed, especially toward the end. But the writing was so, so bad -- atrocious would be a good word. The dialog was stilted, and seemed so flat. The sentences were either too complex, or much too simple. The story was not told well at all. The editing was terrible. With two main points of view, from two different characters, one told in first person, one told in third person, you would think the author and the editor would have gone over every word with an eagle eye. However the first person/third person switch was jumbled many, many times, making this an incredibly confusing read. I enjoyed learning a bit more about Islam culture, but that's about all I can say for this book. I will absolutely not recommend it to anyone."}, {"userName": "Melissa Crytzer Fry", "userReviewDate": "Jun 26, 2014", "userURL": "http://www.goodreads.com/user/show/3857699-melissa-crytzer-fry", "userReview": "***I received this book as part of the First Reads Giveaway program.***If you’re a woman reading this book, it *will* make you think. I’d been aware of the treatment of women in Afghanistan for years (having worked for an international business school that supported the building of entrepreneurial skills for promising Afghan businesswomen). However, this story – while fiction – still put things in perspective for me. Mainly: that no matter how busy we are as American women – juggling family and career – or how neglected we may feel at times, we are still on a much more level playing field with our spouses and in our workplaces. We are free to make our own choices and have our own opinions.Our worth is not determined by our ability to bear sons. Our daughters are not disposable giveaways. We are not our husbands’ property and it is not our ‘duty’ to provide sex. This story of a granddaughter living in 2007 Afghanistan and her great-great grandmother living there a century earlier illustrates all of these injustices in an Afghanistan that, ironically, was moving more toward female equality 100 years ago than it was in 2007 (at least, that’s how I interpreted the story).The premise of this book intrigued me from the start: what happens to girls whose families participate in the ancient, long-accepted tradition, *bacha posh*, in which a daughter dresses and lives as a boy before puberty? What freedoms does a girl have when she changes her identity to behave as a boy and act as a man in a man’s world?Despite my interest in this story and its message, as well as my appreciation of the storyline itself, I have to admit to feeling distanced from the two main characters Shekiba and Rahima. I think this was largely due to the expository style of the writing (so many portions of the story would have played out well as scenes – and would really have created empathy between reader and character). Even so, the story is what kept me reading. Despite not being as close as I’d hoped with the characters, as a woman, I could empathize with the main characters, root for them, and care about them enough to be concerned bout their fates.And to be honest, at 450 pages, this book could have been more effective, I think, if tightened up. In many areas I found the pace waxing and my focus waning. And this is not a criticism of the author, because editing could have easily fixed this quibble of mine, but there are more exclamation points within dialogue of this story than in the past 50 books I’ve read (I don’t think that’s an exaggeration. I believe there were four or five exclamation points on the first page, alone). The author did a good job of interweaving the dual stories from differing timelines, and I think this book does a great job of shedding light on the circumstances of women in the Afghan culture – and it goes a long way in pointing out that all women deserve a say, deserve to be respected, and deserve to stand up for themselves."}, {"userName": "Terri", "userReviewDate": "Mar 13, 2014", "userURL": "http://www.goodreads.com/user/show/5963725-terri", "userReview": "Review also found at http://kristineandterri.blogspot.ca/I received an advanced copy of this book from the publisher William Morrow via Edelweiss in exchange for an honest review. The expected publication date is May 6 2014.It is not too often that a book will render me speechless. Many times I may find the wrong words but never speechless. This book has done that to me. I don't know where to start! To top it off, this is Hashimi's debut novel? You have to be kidding me! She really nailed it her first time out of the gate.This story was haunting, tragic and infuriating all in one shot. Hashimi weaves a tail of two different women years apart who suffered from the oppression experienced towards woman in Afghanistan. Many times I had to remind myself that this was just a story however sadly I feel that the way these woman were treated is not purely fiction. I will be honest and say I do not know a whole lot about Afghanistan aside from the current events of the last years and I know nothing of their culture. This story did not shed a positive light on that.To think that there are woman out there that have to endure what Rahima and Shekiba went through is the part that angered me. To know that this occurs while I am living the life of luxury also humbled me and made me thankful for what I have. This story opened my eyes to some of the \"ugly\" things out there in the world. To think that you have no real value because you are a daughter instead of a son. In my reality that would have made my father a failure as he had three daughters - who have all gone on to successful and fulfilling endeavours I might add.In my opinion the mark of a truly great read has two criteria. The first is it evokes emotion and the second is that it makes me think. This did just that. I was sad and angry throughout this read. More importantly is the thoughts that it put in my head. The majority of this review has been made up of my reaction to the story and less about the plot. That my friends means this is a winner.This was an emotional and moving read (I would say poignant however I never use the most overused word in the literary review world). I would recommend this book to anyone who wants a serious yet entertaining read. This is not for the light hearted however you are rewarded ten times over. I still cannot believe this is Hashimi's first novel. I wish a had a quarter of her talent. I truly hope she releases more work in her future"}, {"userName": "Carole", "userReviewDate": "May 22, 2014", "userURL": "http://www.goodreads.com/user/show/7630646-carole", "userReview": "I loved this debut novel by Hashimi! It is at times a heartbreaking story of the trials of 2 women in Afghanistan. I came to care for both of them, and hated for their tale to end. I usually stay away from long books (this was 452 pages) but it was so well worth it! If you like stories of strong women, this is for you. Highly recommend!!"}, {"userName": "Brooke Waite", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/850609-brooke-waite", "userReview": "4 1/2 stars.I have a pit in my stomach after finishing this book. It was painful, not to read but to know that this is real life for women in Afghanistan.The story weaves back and forth between two women, related by blood, but separated by 100 years. Sadly, the current story taking place in the 21st century really doesn't differ much from what happened in the early part of the 20th century with the main characters great-great grandmother....women abused, mistreated, and undervalued. Young girls not wanted, not allowed the education and freedom that the boys their same age are allowed, fathers 'selling' or 'gifting' their daughters in marriage or servitude so there's one less mouth to feed! That would never happen to a boy, not ever! It is a backwards culture that allows husbands to take wives, no matter how young they are and abuse them, emotionally and physically, and it is justified! Failure to produce a son is the worst possible shame (if these men only knew it is them that decides the sex of the baby...idiots!) The horrors women endured from other women was something I haven't read much about. It seems that instead of lifting each other up, for the most part they are tearing each other down to gain even the smallest bit of power...so sad!I've always been equally fascinated and horrified by the struggles and lives of afghan women and how they continue on as bravely as they can in the face of horrible injustices. I really enjoyed the story...I took my time reading it because it's a lot to take in. I'd definitely recommend this book but know that the violence and sadness is real, it will get to you."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Apr 22, 2014", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "I won this in a Goodreads Firstreads giveaway. I don't remember entering but that's neither here nor there. I don't remember when I started reading it so I just set it to today :-/ This book is about Rahima and her great, great grandmother Shekiba. The story goes back and forth between the two. They both lived sad, horrible lives. I think Shekiba got the worst because she was disfigured on her face as a toddler. Shekiba's brothers and sister died of cholera, her mother went mad and died, and she lived alone with her father working like a man. They were shunned because of this. After her father died, Shekiba lived with horrible relatives until she was given away to another home. Rahima had to pretend she was a boy since her family only had 5 girls but she was a strong character like Shekiba. I liked it okay. I'm sure there will be plenty to love it :-)"}, {"userName": "Maria", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/1217440-maria", "userReview": "This book is meaningful in that it traces the history of two women in Afghanistan, 100 years apart. Their plight indicates how nothing much has changed in their struggle: they are still subjugated to the whims of their fathers and husbands, misogynistic men who are afraid of women becoming liberated. It highlights clearly how men use force and fear to keep women under their control in abusive relationships and that some women are complicit in this arrangement because they know no other way and are so abused that they simply want to please the men so they can avoid abuse. The writing is clear and coherent, but not particularly poetic or outstanding. Much of it simply relays the story in simple language: this happened and I felt this and then this happened and I did this... Given all of the glowing reviews, I expected more. Some described the writing as beautiful, but to me it was plain and simple. There's nothing wrong with that, but I expected more than expository prose. It isn't written as a novel but more as a report of what happened. I wanted poetic language and in depth characterization that drew me in and made me feel empathy rather than sympathy. I wanted to care about these women on a personal level rather than on a global level. And it never quite got there."}, {"userName": "Ann Girdharry", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/13002277-ann-girdharry", "userReview": "This is the story of two young girls from the same family, who grow up to be women in Afghanistan - Shekiba and Rahima. The girls lived generations apart and so the story is told in two different times but with very similar experiences for each girl - the experience of a terrifying marriage as a child, the abuse of family-in-laws, the harshness and punishing attitude of their 'husbands', forced sex and rape, the drudgery and emptiness of their lives, their lowly status as women in a society that values men. There are a few brighter moments but there is much tragedy - the death of siblings, the death of children, the death of loved relatives, the death of all hope, and both women have times when they yearn for death as a way out. I enjoyed learning about the culture of Shekiba and Rahima and this window on their lives, whilst harrowing, was also enlightening. In addition, the story gives insight into some of the political changes that Afghanistan underwent, mirrored in the girls' lives. The only thing I wanted more of, was more of a sense of intimacy with Shekiba and Rahima. They were both incredibly strong young women, and I would have liked to know them better. For a wonderful interview with Nadia Hashimi, see  Five Things You Didn't Know about Nadia Hashimi over on my blog.http://anngirdharry.weebly.com/blog/3..."}, {"userName": "Andrea", "userReviewDate": "Mar 01, 2014", "userURL": "http://www.goodreads.com/user/show/1548050-andrea", "userReview": "The story, set in Afghanistan of the early 20th century and the present, tells the story of two women, Shekiba and Rahima. Shekiba, born at the end of the 19th century,suffers a deforming injury, is orphaned, and eventually becomes a guard in the king's harem. Unprotected and alone, she uses both her wits and her physical strength to survive in a place and time when many women suffered violent lives and deaths. At the end of the 20th century, Shekiba's great, great granddaughter, Rahima is born to a father fighting for a local warlord. Overwhelmed with the burden of five daughters, Rahima's father marries the oldest three away into the warlord's family. Rahima's life, never easy, becomes nearly unbearable in the warlord's tumultuous household. But, she remembers the words of an aunt who tells her, \"everyone must have an escape\" and watches for the chance to free herself. The stories of the two women not only echo their common heritage, but press home how little Afghani society has changed in it's view and treatment of women. The same rebellions and battles are fought over and over in different places and times by different women.Through the bravery and intelligence of the two protagonists, Hashimi creates a story that grips the reader's attention. The twists and turns of the plot kept me wondering, cheering and sometimes shedding a tear right down to the final page."}, {"userName": "Imi", "userReviewDate": "Nov 20, 2014", "userURL": "http://www.goodreads.com/user/show/3126915-imi", "userReview": "In The Pearl that Broke Its Shell two separate plots are told side by side and demonstrate how little has improved in a century for the daily life of women in Afghanistan. Rahima and Shekiba's stories and the issues they face are tragically similar, no matter that they were born about 100 years apart. Sadly, I don't really understand why the average rating for this is so high, as I found myself becoming consistently bored not with either of the stories, but with the writing itself, which seemed rather flat and plain. The characterisation was also very one-dimensional. It's written less like a novel, and more like a report, listing off the tragedies that were faced by both protagonists. Even worse, there were some points in Shekiba's storyline where I noticed that the person changed from first to third person within a paragraph. This was jarring and seemed like a mistake on the editor's part. This is a story that must be told, but I don't think this novel did a particularly good job in telling it."}, {"userName": "Христо Блажев", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/5091378", "userReview": "Перлата, която получи свобода за кратко: http://knigolandia.info/book-review/p...В “Перлата, която се освободи от черупката си” Надя Хашими проследява съдбата на две жени, разделени във времето, но не и в изборите, които стоят пред тях. И двете получават за кратко възможността да вкусят свободата на мъжете. Едната, Рахимà, е още дете, когато се подчинява на обичая бачè пуш, за да може да се движи свободно по улиците и да придружава своите четири сестри навън. Тя разбира какво е да си момче, да си любимец на баща си, да можеш да правиш всичко, което пожелаеш. Толкова по-жесток е ударът, когато е омъжена насила за военен главатар, част от сделка, при която бащата дава три от дъщерите си срещу доставки на опиум, към който е пристрастен. Рахимà се оказва неканен гост във вече устроено домакинство, отнета ѝ е първата любов, а единствената цел пред нея е да ражда момчета. Обречена е до края на живота си да чисти и готви, да гледа едни и същи стени и едни и същи хора. Обикновена съдба на обикновено афганистанско момиче.CIELA Bookshttp://knigolandia.info/book-review/p..."}, {"userName": "Sharon", "userReviewDate": "Sep 06, 2014", "userURL": "http://www.goodreads.com/user/show/1824973-sharon", "userReview": "An interesting concept but poorly executed. The writing was uninspired as was the development of the characters. Given all the awfulness that the two women experience, you'd think you would be very sympathetic. But, I just had no emotional connection to them. I read this for a friend's book club and though I didn't enjoy it, it is a great discussion book."}, {"userName": "Pamela", "userReviewDate": "Apr 18, 2014", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "Beautifully and compassionately written, “The Pearl that Broke Its Shell” is a heart-wrenching yet hopeful story exemplifying the oppressive, unjust and often brutal realities of women in Afghanistan. Nadia Hashimi has penned a masterpiece. And though it’s a lengthy read, it is well worth the vested time. The multi-generational stories of Rahima and Shekiba brought to light elements of Afghani laws, customs, and traditions that were relatively unknown to me: Women are entitled to inherit land and vote – however, laws are rarely acknowledge impartially or applied equitably as opium lords and warlords reign supreme with iron fists; a prescribed number of women are required to be seated in parliament – however, they are rarely called on in assembly to speak, and they are generally nothing more than puppets; And households where no son resides, a young daughter may become a ‘bocha posh’ (a girl posing as a boy until menses) in order to perform male duties for the household, unrestricted by female servitude/chattel rules. \"This life is difficult. We lose fathers, brothers, mothers, songbirds, and pieces of ourselves. Whips strike the innocent, honors go to the guilty, and there is too much loneliness . . . But I can pray for small things, like fertile fields, a mother's love, a child's smile - a life that's less bitter than sweet.\"This hauntingly powerful novel will linger long in my heart, mind, and prayers. My heart breaks with thoughts of the rampant generational anger and greed-driven hostilities and corruption in much of the Middle East region. It has certainly given me a greater appreciation for freedoms, privileges, and opportunities inherently afforded me as a born and bred American citizen. May the women of Afghanistan one day rise above gender bias and oppression, and come to know true freedom and the God of love, mercy, joy, and peace."}, {"userName": "Lisa", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/2099130-lisa", "userReview": "Yes, she is now your brother Rahim. You will forget about your sister Rahima and welcome your brother.\"With that Rahima's mother begins reorienting Rahima's sisters to Rahim. She has begun her life as a bachem posh, a girl assuming the identity of a boy. This is an ancient Afghani custom which allows a girl to live as a boy until she reaches puberty. Because of all the restrictions placed on females in their society, Rahima welcomes the new freedoms she has as a boy. Rahima's story is skillfully interwoven with that of her great-great grandmother Shekiba who shared a similar story. Nadia Hashimi brings to life the hardships of being a woman in Afghanistan by telling us the stories of these two amazing women. If you thought life was bad for women there, this book will only reinforce this belief by giving you a detailed picture of what that life is like. Even in translation, this book is replete with beautiful imagery and language. It's a must read."}, {"userName": "Vesela", "userReviewDate": "May 04, 2017", "userURL": "http://www.goodreads.com/user/show/5012583-vesela", "userReview": "Книгата много ми хареса! Всъщност тя се състои от двете истории на две различни афганистански жени, отдалечени във времето. Написана е увлекателно, на моменти наистина звучи малко като приказка, но това мен лично не ме подразни по никакъв начин. Напомни ми \"Моята орис\" на Паринуш Сании. И изобщо не бих я окачествила тази книга като \"трета цедка Хосейни\", а просто като \"първа цедка Надя Хашими\" :)С удоволствие бих прочела и друга нейна книга, ако такава бъде преведена и издадена :)"}, {"userName": "LibraryCin", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/12860715-librarycin", "userReview": "4.5 starsThis book tells the stories of two women in Afghanistan. Rahima and Shekiba. Rahima lives in the present-day and after a few years of living as a boy (not uncommon for a family with no sons), she is still only 13(?) when she is “sold” to a warlord as his 4th wife to pay her father’s debts (along with her two slightly older sisters, also sold to the warlords’ family as wives). Rahima’s hunchbacked aunt has been telling Rahima and her sisters the story of their ancestor, Shekiba, who lived in the early 20th century. Shekiba lost her family to cholera at a young age and wanted to take care of herself, but she wasn’t allowed. As she did not get along with her extended family, they gave her to another family as a housekeeper, but she got into trouble and was sent away from there, as well… This was really good. I am always more interested in a woman’s point of view in these kinds of books. Of course, there were some horrible things that happened in the book! I was interested in both stories, so switching back and forth didn’t bother me (it was clearly marked at the beginning of each chapter whom we were following). I was a bit appalled at how little seemed to have changed between the two time frames in the book, at least for women. The end was left just a little bit open, so that I’d love to read a sequel. This was the author’s debut novel and I do hope to read her next book, as well."}, {"userName": "Kavita", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/5858699-kavita", "userReview": "In a remote village in Afghanistan, Rahima is growing up with a bunch of sisters. When her mother realises there are not going to be any sons, she decides to take the advice of her rebel sister and make one of her daughters into a son. Following the age-old tradition of bacha posh, Rahima became Rahim and began to act like a boy, receiving all the benefits that a patriarchal system bestows on humans born with penises. But what Rahima does not realise that she would have to become a woman again eventually.The book was an interesting look at the way extremely patriarchal societies allow women to choose to be a man. These girls then gain respect in society and are allowed a lot of freedoms. The other way around is also possible when young boys are turned into girls. This custom is known as bacha bazi in Afghanistan and the young boys are then sexually exploited. Basically, being male brings freedom and being female brings humiliation and exploitation.The book explores life in remote Afghanistan and there are two parallel stories. While Rahima struggles to make sense of her life, she unearths the story of her ancestor, Shekiba, who was also a bit of a rebel in her time. I found Shekiba's story the more interesting because of the historical context. Nadia Hashimi makes the same mistake that many Afghan Americans novelists make - she paints life in Afghanistan as one single round of constant misery day in and day out. There were never any happy times when the characters were actually content and happy. It got a bit annoying after a while to read about Rahima whining about her life continuously. The book also left both stories slightly unfinished. After grumbling and moaning for pages, the characters were suddenly content at the end because politics happened (in Shekiba's case). Rahima's story was left unfinished as far as I am concerned. Certain incidents in her life that make it possible for Rahima to escape also appeared to be too convenient. In real cases, it's never that easy.This is a pretty decent book in many ways and the author has definitely done her research, but it could have done with a bit of polishing and addition of a few happy moments."}, {"userName": "Larry Bassett", "userReviewDate": "Sep 10, 2016", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "This is the story about women in Afghanistan. The protagonist is a woman at the beginning of the 21st-century as well as her great great grandmother at the beginning of the 20th century. The stories of the two women are woven together and in spite of the many years separating them the stories are discouragingly similar as they tell of being married off young and having difficult lives. The storytelling is vivid and distressing.A notable aspect of the story is how similar the circumstances of the two women are in spite of being separated by 100 years. There are minimal allusions to the presence of the US military in the current story but the US war in Afghanistan plays almost no role in the story. The story takes us into the harem of the king in the early 20th century and the parliament in the early 21st-century. The struggles and subservience of women in both eras is effectively shown. But the dominant husband with multiple wives is abusive and most wives are relegated to subservient tasks of cooking and cleaning and raising the children. A girl taking on the role of a boy in a family without any male children is the most interesting tradition, one that I was totally unaware of. This was presented as an actual benefit to the girl child since it meant she could go to school and go out of the house unescorted.The title of the book suggests the possibility of a positive outcome. And in fact the book ends with the young woman running away from her forced marriage to a warlord when it seems that he is about to reject her. She is the fourth wife and she believes that she is about to be replaced by another woman. She escapes to a women's center that helps abused women. Although she has been incredibly damaged in her young life including the death of a much loved young son, she has seen and heard about some positive role models in other women that give her hope for a better future."}], "description": "Afghan-American Nadia Hashimi's literary debut novel, The Pearl that Broke Its Shell is a searing tale of powerlessness, fate, and the freedom to control one's own fate that combines the cultural flavor and emotional resonance of the works of Khaled Hosseini, Jhumpa Lahiri, and Lisa See.In Kabul, 2007, with a drug-addicted father and no brothers, Rahima and her sisters can only sporadically attend school, and can rarely leave the house. Their only hope lies in the ancient custom of bacha posh, which allows young Rahima to dress and be treated as a boy until she is of marriageable age. As a son, she can attend school, go to the market, and chaperone her older sisters.But Rahima is not the first in her family to adopt this unusual custom. A century earlier, her great-aunt, Shekiba, left orphaned by an epidemic, saved herself and built a new life the same way.Crisscrossing in time, The Pearl the Broke Its Shell interweaves the tales of these two women separated by a century who share similar destinies. But what will happen once Rahima is of marriageable age? Will Shekiba always live as a man? And if Rahima cannot adapt to life as a bride, how will she survive?", "title": "The Pearl That Broke Its Shell", "url": "https://www.goodreads.com/book/show/18505784-the-pearl-that-broke-its-shell", "average": 4.12, "cover": "https://images.gr-assets.com/books/1384543130l/18505784.jpg", "reviews": 3134, "authors": [{"url": "https://www.goodreads.com/author/show/7273667.Nadia_Hashimi", "name": "Nadia Hashimi"}], "type": ["Fiction", "Historical", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/18505784-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/35056804-a-p-rola-que-partiu-a-concha", "http://www.goodreads.com/book/show/18735908-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/34404072", "http://www.goodreads.com/book/show/23447506-when-the-moon-is-low", "http://www.goodreads.com/book/show/27213250-a-house-without-windows", "http://www.goodreads.com/book/show/28217813-one-half-from-the-east", "http://www.goodreads.com/book/show/35068533-the-sky-at-our-feet", "http://www.goodreads.com/book/show/40487707-la-casa-senza-finestre"]}