{"ratings": 8076, "userreviews": [{"userName": "karen", "userReviewDate": "Jun 01, 2011", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "hmm...so i am giving this four stars because1)there is no option for three-and-a-half2)it was kind of the perfect book to suit my mood in the day-and-a-half it took me to read it3)in the spectrum of \"books that claim to be just like secret history\" this one takes home high marks.but really - it's just a fast-paced crime thriller and is not likely to stay with me for any real amount of time. it gets points for having the central character named karen. and having her be a genius of languages. but a lot of it is just a secret history tongue and groove DIY project. brilliant underachievers? crumbling mansion? wealthy layabouts sponsoring a poor friend?? mysterious happenings? moral blurriness? alcohol and drug anesthesia?yeah, it's all there. and i feel like i have written this review before, for all the books chasing donna tartt's tail. and i was nineteen or thereabouts when i read secret history. i remember being riveted at my temp job, sitting in front of the usually silent phone, occasionally being roused from the text to crisply say \"stewart, tabori and chang\" into the mouthpiece. but since then, i have met so many people who have been really ho-hum about it. am i wrong? is my memory of it making it out to be something better than it is? was i just impressed at the time because it was something \"new\" tossed into the previously mild pool of my reading up to that point?i hope not. i hope secret history is every bit as good as i remember it, and the haters are the same people who hate anything that falls into that \"ambitious without being highbrow\" category. if it wasn't good, why would there be so many people trying to imitate it?don't answer that.but - yeah- this book - a great diversion, definitely captivating, good characters. i don't know that i would encourage anyone to own it, but it would be an excellent library loaner. it is a fairly uncomplicated story about cause and effect, with some odd human behavior thrown in. just a lot of me second-guessing the characters with \"why didn't she...\" and \"but why not simply...\"but that is its own kind of fun.four stars for my own enjoyment, three if i am recommending it to someone else.like you."}, {"userName": "Misha  Mathew", "userReviewDate": "Nov 16, 2010", "userURL": "http://www.goodreads.com/user/show/3809685-misha-mathew", "userReview": "Following The Secret History, there has been an avalanche of books claiming to be like it or inspired by it. My attention was first drawn to The Poison Tree, after I read a review comparing it to The Secret History. My interest was immediately piqued because The Secret History, as some of you may know, is one of my all-time favorites.Though many elements of the book are reminiscent of The Secret History, The Poison Tree manages to hold its own. It's mesmerizing, unsettling and shocking. It's definitely going to be on my \"Best of 2011\" list at the end of the year.In 1997, Karen Clarke was what we call a \"good girl\". She had good grades and always did what her parents expected her to. All this changed when she met the charismatic Biba - stunning, carefree and so filled with life. Unlike Karen, Biba had a lifestyle that was glamorous and exciting. It made Karen's life look dull. What followed was that Karen was instantly and irresistibly drawn to Biba. Rex, Biba's brother, was exactly the opposite of her - overprotective and a worrier. Though he and his sister looked so alike, he almost disappeared next to his enigmatic sister. When Karen moved in with Biba and Rex in their home, she anticipated an adventure filled summer. Initially, it started off that way, but all that changed as the events of that summer turned out to have a life-changing impact. What Karen mistook for Biba's perfect story-book life was not so after all; Rex and Biba had a painful past. As Karen found out more about them, the more she became embroiled in a tangled web of secrets.Ten years later, Karen is living a life of paranoia. She is constantly on the edge, sensing danger everywhere. She lives with her daughter, Alice, whom she is fiercely protective of. Rex, Alice's father has been recently released from the prison after he was arrested for murder ten years ago. Karen and Rex desperately want a chance of living a \"normal\" life, which they were denied before. What Rex doesn't know is that Karen has secrets which she can't even reveal to him. She is scared and trying her best to protect Alice and Rex from all harm. She's afraid that anything can happen any time, afraid that her past will come to haunt her again. Karen might be constantly worried about what might happen, but she knows that she will do anything to protect Rex and Alice.As the story moves back and forth between 1997 and ten years later, more of the story is revealed and more edge-of-the-seat it gets. My heart was racing with every page I turned; I was almost as afraid as Karen of what was about to come. Tension increases with each chapter, as we get to know the events of the summer of 1997 which shaped Rex and Karen's present. The unexpected twists kept me glued to the book and sleep completely evaded me. We know that Rex went to prison for murder. What we don't know is whose murder it was. As questions after questions kept piling up in my head, I had to resist the urge to read the ending.None of the characters are perfect - every one of them is deeply flawed. Still, I felt for Karen and Rex. I cannot imagine living your whole life in fear, for what what you did when you were so young and naive. Karen , in some ways, reminded me of myself. She always does the right thing, the \"careful\" thing. Yet somewhere inside, she's yearning for an exciting life. Biba is a character who will grab your attention - she mesmerizes and disturbed me at the same time. Her reckless, selfish and dramatic nature causes trouble and chaos. Despite that, Rex and Karen would do anything for her. By the end of the book, she almost seems inhuman to me and her selfishness is beyond shocking.The best thing about The Poison Tree is the atmosphere that the author has created. Throughout the book, there's a feeling of impending danger, something dark lurking in the background. I was constantly worried about what I might find out and at the same time, I could not wait to see what happens next. To say that the ending was unexpected will be an understatement. I NEVER saw it coming. I didn't think what happened was possible to happen. My heart was pounding all the while I was reading the ending.The Poison Tree is one of the best psychological thrillers that I've read recently. The characters and the ending continued to haunt me long after I had finished reading the book. The morbid atmosphere of paranoia and fear that the author has created is definitely praiseworthy."}, {"userName": "Mary", "userReviewDate": "Jan 17, 2011", "userURL": "http://www.goodreads.com/user/show/1181579-mary", "userReview": "This book did not succeed for me, on several levels. Primarily I just didn't get the fascination the narrator, Karen, felt for the Capel siblings, Biba and Rex. Biba seemed spoiled and self-absorbed and Rex was jobless, wimpy, and ineffective at his self-appointed task of being Biba's caretaker. Their so-called Bohemian lifestyle was pretty tame by my child-of-the-70s's standards. There was drinking and a little pot-smoking, a couple hits of ectasy and a few lines of cocaine--hardly the drug-crazed debauchery I was led to expect. The house the erstwhile Bohemians lived in was described repeatedly as a filthy, rundown pigsty which I fail to believe anyone would find appealing. Karen seems like a nice, grounded, middle-class girl, not an insecure, troubled and easily-influenced sycophant who would fall under the dubious spell of people like Biba and Rex. She is fluent in several languages yet has a \"been there, done that\" attitude towards the idea of spending the summer abroad, rather than hanging around London with the dirty and faintly repulsive Capels. The twist at the end was nicely done, but that's about it. The majority of this novel was thinly plotted and not especially authentic (Ms. Kelly should probably actually smoke some hash herself before she makes any more attempts to describe the experience), and I didn't find any of the characters' motivations to be very credible."}, {"userName": "Lisa", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/17591646-lisa", "userReview": "[I can't understand why Karen is attracted to Biba. She is so spoilt, whiny, selfish and pretentious. I didn't get it at all. She treats Rex like absolute crap. And Rex - what a complete doormat. What Biba did was beyond stupid and she should have paid the price for it in the first place. Stupid little girl - you would think Karen would know better than that. And how did Rex think he could just go through life without a job? Odd. (hide spoiler)]"}, {"userName": "Vegantrav", "userReviewDate": "Jun 14, 2011", "userURL": "http://www.goodreads.com/user/show/834122-vegantrav", "userReview": "I seriously hope that Erin Kelly, the author of The Poison Tree, is not one of those writers who read the reviews of their books here at Goodreads (as I know some writers do) because I really did not like this book at all. I feel as if I have been robbed of the opportunity to read good novels by wasting my time reading this dreck.The Poison Tree is promoted as a brilliant, mysterious thriller. It is not.It is an excercise in emotionally overwrought tedium and long-winded ridiculousness. It attempts to build more and more tension (and does so rather poorly) as the novel advances, but the atmosphere of forbidding and fear with which the author tries infuse her story is extremely weak, and the mystery that she does ever so very, very, very slowly elaborate is really not that mysterious at all and is dull--just dull, pure and simple. Several times I resolved to simply stop reading The Poison Tree, but then I would re-read the reviews on the back cover and be inspired with a hope that the plot would soon take off, and I would at last find myself in the midst of a compelling mystery. Alas, that never happened.The secrets that the narrator, Karen, keeps, which she refers to often but without revealing their nature until near the end of the novel, lead the reader to believe that Karen is hiding some grave, serious sins. She is not: her secrets are actually things that she has done which are very praiseworthy and not even remotely bad; she also keeps us in the dark with a secret about her lover, Rex, which is also a secret that shows, basically, what a great guy Rex is instead of being some deep, dark, wicked secret about him.Karen, moreover, is one of the most socially inept, completely naive characters that I have ever encountered in literature. For example, Karen portrays herself as being, until she meets Rex and Rex's sister, Biba, a rarther quiet, shy person who has few really close friends. Upon meeting Rex and Biba, Karen immediately attaches herself to them and begins to act as if she has known them for years and, in fact, moves in with them within a matter of only a week or so of knowing them. And Karen is gravely hurt at the smallest slight and utterly thrilled at the subtlest praise from Biba, and after meeting Rex and Biba's friends--Nina, Tris, Jo--only a few times, Karen speaks of them as if she has known them for years and is very close friends with all of them and deeply concerned about every aspect of their lives. She barely knows these people and interacts with them for no more than a few days (with Rex and Biba's friends) or a few months (with Rex and Biba), yet she seems to think that they are all best friends and deeply concerned with each other and each other's lives. The immediate intimacy and tight-knit friendships that form among these characters in almost no time at all is not remotely realistic: it is so ludicrous that it borders on the incredible even for a work of fiction.The prologue to the novel sets a frightening tone that promises dark secrets, possibly even murder, and revenge as the heroine and narrator, Karen, flees from a grave danger. This tone ends with the prologue as the rest of the novel, until the very last few pages of the last chapter, proceeds in torpid fashion, challenging even the most charitable of readers to stay awake and to finish this exercise in boring drivel.****SPOILER ALERT****The only redeeming value in this novel is the climax. Here at last, Biba, an awful, horribly unbelievably selfish, shallow character gets her proverbial just desserts when Karen actually does something that we readers can finally cheer: Karen murders Biba. Finally, Karen, you have a real dark secret that you need to keep."}, {"userName": "Anna", "userReviewDate": "Oct 27, 2012", "userURL": "http://www.goodreads.com/user/show/1632609-anna", "userReview": "Naïve Karen. Hedonistic Biba. Respsonsible Rex. One long hot summer. Two dead bodies. A life time of secrets. The Poison Tree is narrated by Karen, both in the past and present. A decade earlier, she’s sensibly coming to the end of her degree when she meets the exotic Biba and her brother Rex. Mesmerised by Biba, Karen is seduced into a bohemian summer of love, drugs and parties in an old crumbling mansion. Feeling free for the first time in her life, she embraces her new experiences, becoming embroiled in the secrets of Biba and Rex’s estranged family. The summer comes to a sudden and shocking end when Rex is charged with double murder. In the present-day, Rex is released from prison after ten years and tentatively embarks on a normal life with Karen and their daughter Alice.But who died, and why? In a prologue set in the dead of night, why does Karen flee from their home? Who's been watching them? And what has Karen been hiding for all these years? This is an atmospheric and alluring read, with tantalising hints and clues to all the dark secrets, but with twists you’ll never see coming. There’s an impending sense of doom as the three main characters develop and entwine; although the plot had me second-guessing, it’s Karen, Biba and Rex who drive this story forward, who give it its heart and soul. An evocative, haunting, beautifully told story; I loved it!"}, {"userName": "Jennifer Williams", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/940936-jennifer-williams", "userReview": "I seem to be in a minority here, but skip it! The main characters are self indulgent, substance abusing, free wheelers who are wasting their lives. I really could have cared less about them. I would have quit reading within the first few chapters, but I bought into the psychological suspense hype and all of the good reviews and kept thinking it was going to get better. Nope! When their father kicks them out of their house (that they have trashed) and tells them to get jobs (they are adults), I stood up and cheered! But I got the feeling I was suppose to see how mean their father was and how awful he treated them and this was a major catalyst to the tragedy that follows. Although to be fair the writing was pretty solid, I just could not sympathize with the characters. There was a plot twist in the end but by that time I could only think, \"I am sorry I spent this time with you, and I am so glad you are not my neighbors!\" Oh, and the poison tree...there are a few paragraphs that talk about it, one was growing in their back yard, don't eat the leaves, any other connection was lost on me. Was it a metaphor for Biba or the whole book, either one-stay away!"}, {"userName": "Matthew", "userReviewDate": "Mar 05, 2014", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "When I originally rated this book, the author \"thanked\" me on Twitter for my review. I could not tell if it was a serious or sarcastic thank you . . . Her followers were not very happy with me!I am sure that some people will like this book a lot, but it seemed very contrived, forced, and unbelievable. It is in a genre that has been hit or miss for me (the \"books-like-Gone-Girl\" genre)"}, {"userName": "Judith", "userReviewDate": "Jun 11, 2012", "userURL": "http://www.goodreads.com/user/show/301768-judith", "userReview": "At the very beginning of this book, the reader learns that Karen is picking up her husband, Rex, who just served a 10-year term for murder. In the car with her is their daughter, Alice. The story unfolds with alternating chapters: present day and the summer ten years ago when the murder took place. Present day: Karen and Rex attempting to adjust to their new life and problems such as pesky journalists, Rex' s learning about the modern world outside and trying to find work, living in a small house, and trying to parent their child together. Summer ten years ago: Karen just graduated from college and met Rex and his sister, Biba, who are living a crazy Bohemian life together in a strange mansion in London. Karen falls in love with both Rex and Biba and they party with drugs and alcohol all summer till something bad happens which lands Rex in the slammer. How could I have stopped reading half-way through the book before I discovered the horrible crime? Did you ever hear someone take so long to set up a joke that you lost interest before the punchline was delivered? That's how I felt about this book. I just got tired of all these hints and build-ups to some horrific crime or accident and decided I had spent enough time with these characters. Sorry I spent as much time as I did. This book once again reminds me that you can have the best story in the world, but unless the story-teller captivates you, it won't matter. The reverse is also true: a good story teller can tell a story about nothing and it will be a great success. Look no further than \"Seinfeld\" for proof of this."}, {"userName": "Rachel Hall", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/28372189-rachel-hall", "userReview": "Erin Kelly’s debut psychological thriller of 2011, The Poison Tree, has often been cited as an example of a novel that readers respond strongly to and it has drawn a huge cross-section of reviews right across the board. Having enjoyed The Burning Air and intrigued to discover just why The Poison Rose seems to polarise readers, I dived into this one. The novel opens with Karen and her nine-year-old daughter, Alice, collecting husband and father, Rex, from a ten-year stint behind bars for manslaughter. As they drive home they detour to Highgate and cannot resist a moment of contemplation outside the formerly rambling and dilapidated home that witnessed Rex’s fall from grace. Flashback to the heady summer of 1997 when New Labour rose to power and the world felt full of possibilities for the young graduates at Queen Charlotte’s College and meet gauche seventeen-year-old, Karen Clarke. Fluent in a handful of languages and having passed an unremarkable four-years studying for a degree, even her dad thinks she is old before her time. Seeming to have gone from being sheltered throughout her school education she has blended into the background and found herself thrown together with a group of dreary girls all with their eyes on the bigger picture of marrying well. Yet for Karen her degree is just another qualification to add to her many and she is discombobulated by the enforced change that graduating presents. Undecided on her future she meets twenty-one-year-old drama student, Biba Capel, an effusive and bewitching breath of fresh air into her sterile world. Agreeing to tutor Biba in mastering the German accent, she is swept up into the hedonistic world she occupies and like a teenager in the midst of first love, she falls hard. As the long summer holidays loom, Karen takes her dad’s advice and has one final carefree summer as she moves into the ramshackle property that is home to Biba and her older brother, twenty-four-year old Rex and enters into their debauched world. However, that summer ends with the trio’s lives being changed forever and two people dead. Segueing effortlessly between the decades, melodrama is in no short supply all contributing to give the novel an angst ridden feel to the whole thing as the two narratives develop in parallel.I had a remarkably mixed reaction to The Poison Tree and for much of this novel I felt like I this was a reading a slightly different version of a story that I have previously read time and again. It is unoriginal, yes, but perhaps what makes it even more disappointing is that for a good three-quarters of the novel the plot follows an almost embarrassingly predictable course with a cast of awful stereotypes. There are few surprises as the plot heads down the familiar road of naive and gullible, Karen Clarke’s head being turned as she is drawn into the vastly different lifestyle of the Capel siblings. Dogsbody and provider of funds seems to sum Karen’s position up, but it is also the first time that she feels at home and welcomed into a social clique. For once Karen ‘fits’ and seems to have found her place amongst a like mindset, but she is wilfully blind to her obvious position as a pawn being employed in a incestuously close game of sibling affection. It is hard not to think that Karen is simply too young and has merely followed the path of least resistance and met her parents expectations and hence doesn’t have the wherewithal to handle what she quickly becomes embroiled in. Despite my reservations, however the double whammy of twists does deliver and is well worth waiting to see play out.The plot covers the well-trodden ground of a middle-class teenager becoming the first person in the the family to have the privilege of entering higher education and the weight of expectations. Prodigious Karen is a naturally gifted linguist, sometime to whom the skill comes effortlessly and the natural course is to do her parents proud and achieve great things. Karen herself is effectively a caricatured from her sycophantic fascination with the Capel siblings to her utter lack of backbone and the speed with which she forgets her working class parents and cringes at everything from their Midlands twang, their annual holidays right through to their reading of the newspaper ridiculed by liberals. The narrative is seen through the perspective of Karen with ten years separating the periods and in this sense readers will see how the events have impacted on Karen’s attitude and solidified into a fervid desire to protect her new and remarkably fragile family. Written in ludicrously pretentious prose, Erin Kelly guilty of attempting to demonstrate her mastery of the English language flowery language. Grandiose language does not always translate into a powerful narrative and and the effect here is to detract from the valid points that this union calls into question The Poison Tree is remarkably reminiscent of The Secret History by Donna Tartt, and having had a similar response to that novel I have concluded that much of my antipathy towards these novels which show the very different worlds of the upper class, responsibility shunning young adults colliding with the ‘awkward lower classes’ in higher education, stems from my own personal experiences. Worth reading if only for the final twists which surprised me immensely."}, {"userName": "Can", "userReviewDate": "Aug 20, 2015", "userURL": "http://www.goodreads.com/user/show/40487028-can", "userReview": "BU YORUM HUNHARCA DEVRİK CÜMLE VE İMLA HATASI BULUNDURUR.Ben bu kitabı okurken diyordum ki eh idare eder üç puanlık bir kitap... DURUN!!100 sayfa geçince ben bütün karakterlere ısınmaz mıyım?!?!? Plot twist üzerine plot twistten ölmez miyim!?!?! Yazarın diline aşık olmaz mıyım?!?!? Stephen King'in dediği kadar olan bir kitap... Şu an kafam iyi değil daha yeni bitirdim ama o son... Pegasus Yayınlarına da cömertliği ve gönderdiği için teşekkürler... Tur için olduğu için kesin kötü olur diyodum... Göte geldim allahım aşık oldum bu ne?!?"}, {"userName": "Blair", "userReviewDate": "Apr 10, 2011", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "The Poison Tree had been on my Amazon wishlist for months, and this sunny weekend I finally decided to treat myself to it. I was happy to find that, true to my expectations, it was hugely readable, so much that I'd finished it within 24 hours of my purchase. The book is divided up into two stories, flipping back and forth between the long, hot summer of 1997 and the present day. Both are narrated by Karen; in the 1997 story, she is a naive 20-year-old and, having recently finished her degree, becomes entangled with the decadent, overdramatic Biba Capel and her older, more reserved brother Rex. In the present-day plotline, we find Karen in her early thirties, living in a small country village with her nine-year-old daughter Alice, and adjusting to a new life with Rex, who has just been released from a long stint in prison (this isn't a spoiler, we learn it very early on). The rest of the book brings the two strands together, exploring exactly what happened in that fateful summer to lead to Rex's incarceration and Karen's paranoia - which, it quickly becomes clear, now dominates her life.The 1997 sections of the book, I absolutely loved. The atmosphere of this cloying, dreamlike summer is conjured with such flair; Karen's passion for Biba and Rex's lifestyle, how she falls in love with the two siblings and their romantic, ramshackle house, her transition from straight-laced student to companion of the hedonistic Biba and the feelings of power, release and abandon this gives her. The whole thing seems desperately romantic and utterly enchanting; I could easily appreciate how thoroughly Karen was drawn into the Capels' world because, as a reader, I was consumed by it too. Even when I put the book down, images of chaotic house parties, Highgate streets and sweltering summer days were so vividly imprinted on my mind I felt like I'd been there. I'm sure anyone of my generation will appreciate the way in which Kelly accurately portrays a time not long past and yet suffuses it with great nostalgia. I loved Karen, too; she's very believable and the narrative really gets under the character's skin. She's a self-confessed unremarkable girl who's had a sheltered existence, cosseted by a trio of vacuous friends and an equally boring boyfriend throughout university, and her revelatory entrance into a life where she no longer feels 'invisible' is wonderfully evoked. While there are some slightly irritating inconsistencies and mistakes (such as when Karen is given her first ecstasy tablet, has a wonderful time partying all night and then has absolutely no comedown?!), the overall effect is so arresting that small errors don't really dent its power.The present-day story is, however, much weaker. It has all the hallmarks of those chick-lit-cum-thriller books that seem to be so popular these days - told in present tense, there's a first-person female narrator, secrets involving a crime/murder, usually a child or family involved somewhere, the woman will do ANYTHING TO PROTECT HER FAMILY, etc. I don't really like this genre and found the style a turn-off; I think present tense is quite difficult to pull off effectively and, while I can understand that it made sense to differentiate the past from the present in this way, it didn't work for me. I can also understand why Karen's character was different, having been altered as a result of all she'd experienced, but I'm afraid I found this version of her quite dull. Whenever one of the present-day segments popped up I found myself comparatively bored, desperate to get back to the past; they seemed like unwanted interruptions in an otherwise flawless narrative. They didn't ring entirely true, either - I wasn't convinced that after so much time in prison, Rex would move straight into Karen's home and start playing happy families with a daughter he'd only previously encountered through short visits every few months. Crucially, I also disliked the ending. Where I had related to the younger Karen so much, I found the older version's final actions impossible to sympathise with.For me, this is a book of two halves - one half I consider worthy of five stars, the other is more like three (no prizes for guessing which is which), hence the overall rating of four. I hope that if Erin Kelly writes anything else, she draws on the original, fascinating portrayal of human relationships and new experiences demonstrated in the past segments of this novel, rather than the much more pedestrian and uninteresting (if perhaps more likely to shift units...) thriller element represented by the present segments."}, {"userName": "PuPilla", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/5443187-pupilla", "userReview": "Egy igazán remek regény szörnyű múltbéli titkokkal, bűnténnyel, barátsággal, testvérekkel és drámával a középpontban. Nagyon kedveltem a történetet, és azt, ahogy kibontakoztak az események, lassan és feszülten, a múltból indítva, hogy a szálak aztán összeérjenek a jelenben. Hamarosan bővebben a blogon."}, {"userName": "Pamela ", "userReviewDate": "Dec 14, 2011", "userURL": "http://www.goodreads.com/user/show/3925721-pamela", "userReview": "“Brilliant!” “A beautifully crafted, evocative psychological thriller.” “Dark and gripping.” Just some of the words used to describe this novel. After reading the book, I totally disagree. Long-winded and mundane is how I describe it. The story revolves around three main individuals, Karen, Biba and Rex – all of whom I thought were lifeless and quite mundane -- an odd bunch of characters all living under one roof. I thought Karen’s attraction to someone like Biba to be atypical. Yes, perhaps when they both first met, as Biba is the complete opposite of Karen; however, for Karen’s feelings to grow for Biba, even after observing Biba’s behaviour, doesn’t ring possible for me. Karen is an intelligent, kind, giving person; a gifted student and linguist who is destined for great success. She’s loved and supported by her parents. Biba and her brother, Rex, only have each other, both of whom rely on the fact that they will always be there for each other. Biba is self-absorbed, a narcissist, a person who only cares about herself. She doesn’t care about what others think, nor does she care about what havoc she brings with her or the consequences that follow. She says she cares and depends on Rex, that he is her rock. However, it is at a critical turning point that we witness her true colours, her selfishness and lack of care and love for others. Rex is Biba’s older brother and guardian, who also becomes Karen’s lover, falling head-over-heels for her. Once again, I don’t understand Karen’s attraction to Rex. He’s a layabout who’s never held a job, always cleans up Biba’s mess, is so unassertive and feeble, and who always lets Biba have her way. He’s obsessed with only thoughts of Biba if he doesn’t know where she is or when she’s coming back, ignoring everything and everyone around him. Everything about their sibling relationship struck me as quite odd. As for the story itself, it is told by Karen, and jumps back and forth from past to present. Usually books written between different time periods are broken down chapter-by-chapter, which the author does. However, she also jumps back and forth within the same chapter, even jumping from one paragraph to the next, which certainly doesn’t make for a smooth transition or easy read. Throughout the novel, I had to keep reminding myself that the past story actually took place in 1997. It is because of the author’s detailed descriptions of Biba and Rex, how they lived, behaved and socialized that made me think the story took place in the mid-1960s – the hippie era. I’m not going to recommend this book; at the same time I’m not going to say don’t read it. I’m actually surprised that I finished the novel as I found the story moved at a slow pace -- unable to hold my attention as it took me quite a while to finish it. I’m just glad it’s over."}, {"userName": "C.E. Trueman", "userReviewDate": "Aug 21, 2011", "userURL": "http://www.goodreads.com/user/show/5046527-c-e-trueman", "userReview": "In The Poison Tree, Erin Kelly creates an assortment of compelling and convincing characters. A year into her university degree, studious linguist Karen Clarke, the sensible and conservative narrator of the story, finds herself drawn into the chaotic and bohemian world of vivacious but self centred wannabe actress Biba Capel and her over protective brother Rex who live on their own in a ramshackle house in London following abandonment by their famous photographer father and the resulting suicide of their mother.As Karen turns increasingly away from her studies to spend more and more time at the house next to Queen's Wood with its laissez faire cocktail of drinking, recreational drug taking and endless parties, she unwittingly becomes embroiled in a fatal tragedy which will change the course of all of their lives forever.I loved the beautifully descriptive and poetic style of the narrative and the way it begins in the present and slowly reveals everything that has led up to this moment culminating with its twist at the end (although I must admit, I did see this coming a couple of chapters or so beforehand). Biba is one of the most captivating and colourful characters I have come across in literature - I would even go so far as to compare her with Becky Sharpe in Vanity Fair, so without Kelly's successful narrator development, protagonist Karen could have appeared lifeless and dull next to her dramatic glamorous friend. However, through Karen's eyes, and the subtle development of the plot, the book held me entranced until the final page."}, {"userName": "Alex Cantone", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/48050946-alex-cantone", "userReview": "The noise of the city falls away as we enter the secret sliver of wild wood, where the ancient trees muffle the sirens and the screeches of the street and the half-hidden houses occupy a dark green private universe, cushioned by money.... Released after serving ten years in jail for murder, Rex is trying to rebuild his life with Karen and their young daughter Annie. But who is making the phone calls and watching them, or him, or is it her? The book switches between the present (written in present tense) and the events of that summer when linguistics student Karen was drawn into the bohemian life of Biba and her brother Rex (written in the past tense). Oh dear. After raving about Erin Kelly's fourth book (The Ties That Bind), which held my attention from page 1, this her debut novel (The Poison Tree) I have picked up and put down so many times, and after page 97 I gave it away."}, {"userName": "Carol", "userReviewDate": "Feb 27, 2011", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "Erin Kelly's Poison Tree is publicized as a \"tight psychological thriller\". I'd drop the word thriller as this denotes to me a more fast paced tempo than is the case here. I'd read it alone for its in depth psychological character study. Erin Kelly gets this just right. Beginning at the end, the story flashes backwards and forwards in a space of ten years, rapidly and without warning, and yet it is easy to follow. I quickly became engrossed with the three main characters, Karen, Biba and Rex. I became a part of their lives, becoming a friend, even though I knew this was fiction. That's how powerful Kelly portrays each. You know these people, what makes them tick, and yet just as in real life, what they do might still surprise you.If this is not enough, the story is believable and satisfyingly justifiable; well thought out. It left me with things to think about, yet again, in my life long quest to understand the relationships of life; family, friends, lovers. I'm going to recommend this to all my Tana French, Sara Waters and Morag Joss reading friends."}, {"userName": "Kristin", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/5612264-kristin", "userReview": "This is one of those books where everything in the first half is all portentous foreshadowing--the characters living out the consequences of some unimaginable past horror only hinted at in passing (but set in, you know, the bohemian London world of a second-tier university of the late 90s; it was a terrible time before cell phones). This narrative style totally can work (e.g., The House at Riverton by Kate Morton, although I can't stomach any of her other work), but, in the end, with such a limited number of poorly-developed and, essentially, blank characters, it's very easy to see where everything is headed. And where that is is trite and fairly contrived. The book also suffers from competing identities; it can't quite decide whether it wants to be a mystery, a suspense thriller, or highbrow contemporary literary fiction, and, in the end, it serves none of these genres well. Unsatisfying overall, with a \"twist\" ending you can see coming a mile away. . . . *snooze*"}, {"userName": "Josie", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/2857951-josie", "userReview": "What a great atmospheric novel to settle into on a Saturday!I was in the right \"zone\" for reading this, and it was a novel that pulled on my own recollection of my late teens and the numerous eclectic mix of characters I can recall entering my \"normal\" orbit at that time.I found Biba fascinating at the beginning, her brother Rex a bore, and Karen irritating.Then half way through or so, Biba and Karen switches spots.Very clever on the author's part.The reasoning behind the name Alice was not lost on me.Interesting to learn that Broadchurch was written by Erin Kelly - this was a TV series I enjoyed a few years back and didn't know of the connection at the time."}, {"userName": "Bridgit Barger", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/41669702-bridgit-barger", "userReview": "I'm ultimately glad I read this mystery, I did find many of the twists fairly predictable and unoriginal. I do look forward to reading more from Erin Kelly, however... her writing style was addicting and fast-paced!"}, {"userName": "Susan Liston", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/630381-susan-liston", "userReview": "Okay this is the kind of book I don't want to bother reading this year, and here I am starting with one right off the bat. This wasn't terrible, it's decently written, but there is a lot of the same old. Flashing back, we meet a predictably dull scholarly girl who predictably gets a girl crush on a predictably bohemian wild girl, who you mainly just want to slap, and DS girl moves in with BW girl and her boring, overprotective brother to their predictably crumbling old manse. You know from the alternating chapters set in the present that the DS girl marries the boring brother who in the present day is just being released from serving a ten year sentence for murder. So begins a long slog to find out who got murdered and how and why. The answer was not what I expected, and the end was also not what I expected, so it gets an extra point for that, but it takes forever to get there."}, {"userName": "Melissa", "userReviewDate": "Mar 12, 2014", "userURL": "http://www.goodreads.com/user/show/287912-melissa", "userReview": "[strangles Biba & dumps her in the wet concrete at the housing development. Biba was so over the top horrid in the last few pages, of course there was no other way she should've gone out (hide spoiler)]"}, {"userName": "Lolly K Dandeneau", "userReviewDate": "Jan 13, 2011", "userURL": "http://www.goodreads.com/user/show/1412404-lolly-k-dandeneau", "userReview": "Eh. I enjoyed a few chapters. Karen meets Biba and is enthralled by her life, and falls too for her strange brother Rex. Drugs, parties, characters, rambling old house and suicidal tendencies. We know disaster will strike soon as foreshadowed throughout the novel in flashbacks. I had a hard time with Rex, because I couldn't decide what the writer wanted him to be, damaged and neurotic or mature and sensitive? Biba was your typical beautiful wild child much overplayed in literature. Karen was more realistic, her attraction to Biba's colorful life has been done before though. While much of the novel was formulaic, I will say the ending somewhat caught me off guard and almost made me like the book...almost. In fairness, sometimes the flashback thing irritates me no matter what I am reading but more so when it doesn't flow right. I think Karen should have been more tormented with her lying and choices in life, I didn't see much of that. I think it would have helped. I was hoping to love it, but I was not grabbed."}, {"userName": "Ruth Turner", "userReviewDate": "Apr 04, 2014", "userURL": "http://www.goodreads.com/user/show/17861817-ruth-turner", "userReview": "This wasn't a bad read, but it wasn't a particularly good one either. Most of the book I found a little tedious, but then the last chapter takes off, and before I knew it I was finished and left feeling \"so that's it?\"The story goes back and forth between the present and the events that happened ten years ago. I had difficulty throughout the book figuring out where I was. The formatting in the e-book edition I read was a nightmare. All the lines were double spaced so it was difficult to tell where paragraphs started and finished. On quite a few occasions sentences within a chapter would finish mid-line and the new sentence would take me to a different time. Very confusing, to say the least.None of the characters were particularly likable. Bibi came across as selfish and self-centered and her brother Rex irritated me no end and Karen was just...bland. A little disappointing."}, {"userName": "Lisbeth Davies", "userReviewDate": "Dec 02, 2012", "userURL": "http://www.goodreads.com/user/show/8106413-lisbeth-davies", "userReview": "An outstanding psychological thriller!The dogs almost didn't get their daily walk because of this book - having stayed up until silly o'clock on day 1, I kept sneaking off the computer the following day to snatch \"just another few pages\" until finally I got an uninterrupted block of time to finish it tonight. Phew.If you enjoys the novels of Sophie Hannah, Nicci French, Tana French et al then Erin Kelly's books are definitely for you.Once I've sorted out the Christmas budget, I'll undoubtedly succumb to temptation and get her second novel (The Sick Rose) and will definitely be queuing up to get #3,The Burning Air, in January 2013."}, {"userName": "Robin Mayerhoefer / October Woman", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/1164958-robin-mayerhoefer-october-woman", "userReview": "And another fantastic new to me author! Claire Seeber, Peter Swanson, and now Erin Kelly. I've already hunted down and collected most of Seeber's and Swanson's back list (plus preordered Swanson's newest), and now my Discover card will get another workout as I hunt down everything Ms. Kelly has written. For a long time my go to has been romance, but these three authors are sending me on a new and wonderful path! Told in first person POV by Karen, the narrative bounces back and forth between the present and the past. In the past, Karen meets Biba and is mesmerized by her, and by her Bohemian drug-fueled life's-a-party lifestyle. Not so much by Rex, though in the present we know that she and Rex are a couple and have a daughter. We also know that Rex was just released from prison for murder, but we don't know who died or when. I love Ms. Kelly's writing, it's as mesmerizing as Biba is to Karen. As Karen tells us her story, she drops tantalizing little hints or alludes to something that happens later, and I was constantly on the edge of my seat waiting for the big reveal, and grasping at each secret that finally came to light. Guessing who would die, and then second guessing myself. With good reason, as I was completely wrong. A five star read for me, and I'm upset that none of the platforms I subscribe to - Netflix, Amazon Video, Hulu, Acorn TV – have the movie version available! I need to see it!"}, {"userName": "Farshana", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/26511057-farshana", "userReview": "It was an easy read quite fast paced but sort of lacking the thrill factor. There was much mystery about the murders that happened in the past but when we actually get to the scene, it feels anti-climactic, a let down in steam sort of. The ending had a surprise which was quite unexpected and added another star to the rating. I did seriously wish Rex had a more substantial role than what was characterized at least after being released from prison."}, {"userName": "Margaret Madden", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/21224317-margaret-madden", "userReview": "When asked to pick a novel for our bookclub, this debut from Erin Kelly was the first that came to mind. It has been on my wishlist since its release in 2010 and I remember reading the most wonderful reviews in the newspapers. Only a couple of the members of our bookclub would be avid thriller readers, and I knew this was a perfect opportunity to get this genre introduced again.Karen is a language student in a run-of-the-mill college, her days are dull, her manner reserved and her boyfriend and flatmates are boring. She is extremely intelligent but lacks ambition. All this changes after a chance encounter with the enigmatic and bohemian Biba. A fellow student, but of a very different background, herself and her brother, Rex, live in a crumbling townhouse with an eclectic mix of characters. Their unusual lifestyle is frightening and alluring in equal measures and Karen quickly falls in love with the charm of Biba, Rex and the craziness of their home. Here begins a summer of cheap wine, recreational drugs and sexual adventure. Zipping around London in a decrepit Mini, parties and sleeping all day. The intense personality of Biba begins to seep into Karen's pores and they almost become one. Inevitably, something goes wrong. The comings and goings through the open house are a magnet for disaster and Karen is caught in the middle of it. But can this summer be wiped out of her memory? Can the deaths of two people be brushed under the carpet? One chance encounter has led Karen into a world of deceit, lies and death.From the beginning, the reader knows something big is going to happen. It is obviously something related to Biba and Karen, but the author uses such beautiful language and tone, that it doesn't really matter what happens. The main protagonists are so completely opposite that they could be from different generations. But they work so well together. One is calm, astute and reserved, the other is flighty, insecure and needy. The two girls spark off each other and the intense connection they have just oozes from the page. Rex, the older brother is harder to gauge. He adores his sister and watches over her, to an almost borderline addiction. When Karen is around, the trio struggle to gel and the atmosphere is not as relaxed as it should be. The writing of these scenes is dissected to fit the mood and makes the reader feel like a hidden spectator. The descriptions of the house and all its contents are trickled throughout the novel, which is part of the authors ingenious way of sucking us in to the story.When the deaths occur, there may not be a huge intake-of-breath moment, but what happens afterwards is again teased out, page by page, chapter by chapter, until you can barely take anymore.I can't believe it took me so long to get around to reading this amazing book. Beautifully crafted, with evocative narrative and clever balancing of detestable characters, placed alongside more sympathetic ones. The story hops off the page from the first chapter and pulls you into the hot, sticky summer in London that changed many lives forever. A powerful piece of fiction....Highly Recommended."}, {"userName": "Larry H", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "Language student Karen Clarke has a stable life, if not a particularly exciting one. She lives in a luxurious off-campus apartment with three friends, they play a lot of tennis, socialize with their boyfriends, and follow a fairly organized pattern. Just before her last year of college ends, Karen meets Biba Capel, a flamboyant aspiring actress, who quickly fascinates and draws Karen into her world. Karen moves into the dilapidated mansion Biba shares with her older brother, Rex, and any number of random friends. It is a world of excess, of drugs, alcohol, and late-night parties, and Karen cannot get enough of it. But the summer of paradise Karen dreams of doesn't quite pan out as she hopes. She begins a relationship with Rex but still longs for the exotic life Biba has, and she realizes that both Capel siblings have more issues than she imagined. One night, things go horribly awry, and Karen flees from her idyllic life back to reality. Ten years later, Karen and nine-year-old Alice pick Rex up from prison after his sentence for murder has ended. But some old ghosts resurface, ones that Karen is determined to keep hidden—no matter what the cost. Nothing will get between her and her family. The Poison Tree is enjoyable and a quick read. While Erin Kelly doesn't necessarily tread any new territory, she knows how to tell a compelling story, and you can easily see how someone as level-headed and intelligent as Karen could get drawn into the chaotic, dramatic lives of Biba and Rex. My only criticism of the book is I didn't feel it gave much depth to the present-day relationship and interactions between Karen and Rex. While I understand the bulk of the book needed to be spent on telling the story from start to finish, since the book interspersed past and present, I would have liked a little more exploration of the state of Karen and Rex's relationship, given her fears of it all coming undone. That being said, if you enjoy mysteries, this is one that draws out its suspense in a satisfying way."}, {"userName": "Yamma", "userReviewDate": "Aug 19, 2011", "userURL": "http://www.goodreads.com/user/show/6076453-yamma", "userReview": "Don't bother. I gave two stars as the writer uses good English and her descriptions are colourful and vivid. It's an easy read and the story is set in places that I know which made me feel comfortable. I got the impression that the clearly straight-laced young writer was trying to live out a fantasy of an exciting youth never had. Her drug references were poorly researched and were cringable in their inaccuracies. The main character, Karen's 'best night of her life' was a rather naff party which finished around 4 in the morning. Whoop. A few bottles of wine, the odd spliff and one off experimentation with Ecstasy hardly denotes hedonism.I was totally unconvinced by the life-long connections she made after meeting people with whom she had barely had a conversation once or twice.I didn't believe that Karen would have lied to Rex. There was no reason why he wouldn't have gone along with the story and doted on the child anyway. I felt that this was a weak device for the final twist. I was also unconvinced at Rex's demeanor after a ten year stint inside. I don't think it was 'creepy' was not 'gripped' and I thought that 'thriller' was a stretch."}], "description": "It is the sweltering summer of 1997, & Karen is a strait-laced, straight-A university student. When she meets the impossibly glamorous Biba, a bohemian orphan who lives in a crumbling old mansion in Highgate with her enigmatic brother Rex, she is soon drawn into their world - but something terrible is about to happen.", "title": "The Poison Tree", "url": "http://www.goodreads.com/book/show/8675215-the-poison-tree", "average": 3.67, "cover": "https://images.gr-assets.com/books/1327489537l/8675215.jpg", "reviews": 973, "authors": [{"url": "https://www.goodreads.com/author/show/1308914.Erin_Kelly", "name": "Erin Kelly"}], "type": ["Mystery", "Fiction", "Thriller", "Mystery", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/8675215-the-poison-tree", "http://www.goodreads.com/book/show/9209512-the-poison-tree", "http://www.goodreads.com/book/show/7049159-the-poison-tree", "http://www.goodreads.com/book/show/26131926-zehir-a-ac", "http://www.goodreads.com/book/show/11821538-the-poison-tree", "http://www.goodreads.com/book/show/31393997-he-said-she-said", "http://www.goodreads.com/book/show/15811533-the-burning-air", "http://www.goodreads.com/book/show/19561890-broadchurch", "http://www.goodreads.com/book/show/11797361-the-dark-rose", "http://www.goodreads.com/book/show/19884930-the-ties-that-bind"]}