{"ratings": 420, "userreviews": [{"userName": "Betsy", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/221050-betsy", "userReview": "The other day I was asked to come up with ten children’s book equivalents to Claudia Rankine’s book  Citizen (which, should anybody ask you, is not for kids). To do this, I wanted to include a range of different kinds of books at different ages. Picture books and nonfiction titles. Early chapter books and poetry. And, of course, socially conscious middle grade novels (books for kids between the ages of 9-12). But as it turns out, books for young people that take a long hard look at systematic oppression in America in the 21st century are nine times out of ten written for young adults. On the surface this makes sense. Parsing the complexity of racist systems requires brains. Still, I wanted to include something on the younger end of the scale. Something that’s interesting and fun, but also manages to bring up some pretty serious issues at the same time. You can see where I’m going with this, and it shouldn’t surprise you that that middle grade novel I selected in the end was, The Parker Inheritance by Varian Johnson. Until I read that book I’d never encountered a fun, casual middle grade puzzler that was, at the same time, socially conscious on the topic of race in America with a keen sense of how the past affects the present in every way. Come for the puzzle, then. Stay for the biting glimpse of America’s intolerant past. Candice’s grandmother wasn’t crazy or corrupt or anything like that but try telling that to the residents of Lambert, South Carolina. About ten years ago her grandma used her position in the city to dig up some tennis courts on some kind of a treasure hunt. When nothing was revealed she resigned and helped raise her granddaughter elsewhere. Now Candice and her mother have moved to Lambert, temporarily, for the summer while her father attempts to sell their house after the divorce. Candice knows for a fact that her grandma was never the loon some people in town still consider her to be, and she’s even more convinced of this when she finds a mysterious letter in her old things. A letter that insinuates that there’s a treasure to be found if you just look deep enough into the past. Now with the help of the boy next door, Candice is off to clear grandma’s name, find the treasure, and maybe even save Lambert itself. The natural comparison this book practically requires in blood is The Westing Game and that’s understandable. There are innumerable similarities. First and foremost, like Raskin’s classic, the clues aren’t linear or even all that comprehensible. This isn’t a book where each clue is neatly tucked away as a little rhyme in a little envelope, one leading to another. The letter contains all the clues and it’s up to the characters to pick that apart. There is good and bad to that. Unlike, say, an Agatha Christie book, the average child reader is not going to be able to figure out these clues on his or her own. You don’t read a book like this to actually solve the mystery yourself. That’s where the other readalike to this title comes in. As the action started to shift more regularly between Enoch Washington, Siobhan Washington, and other people from the past, to our present day heroes, I was reminded strongly of Holes by Louis Sachar. Think about it. The sins of the past have repercussions in the present day and it’s the kids that have to shoulder that burden. As an author, Varian Johnson doesn’t make this book easy on himself. It would have been the simplest thing in the world to just “Mr. Lemoncello” it and be done with it. You know. Focus on the puzzle, include a single main character with a problem and some bit characters on the side, and keep focused on the goal. Instead, Mr. Johnson prefers to give not just his main characters depth, not just his side characters depth, but the state of the city and, let’s face it, 21st century America as well. The danger he runs in doing this is bogging the story down. He works in a boy who may or may not be gay, divorce, loving but intolerant grandparents, police brutality, the act of passing (and its long-term emotional effects), and much much more. At times it can feel like Mr. Johnson is throwing in everything and the kitchen sink into his story, but as you read on, the plot stuff settles into place. Personally, I read this book in fits and starts, and I can tell you that that is not the way to read “The Parker Inheritance.” This book requires a dedicated, steady read without interruptions. Otherwise you find yourself saying, “Wait. Who’s Siobhan again?” The author also touches on topics that I’ve never seen any middle grade novel for kids discuss. Take the end of segregation. At one point the grandparents are explaining to our baffled heroes that when the black schools were dissolved it had an detrimental effect on the community. “…if you were black, Perkins was your school.” And they go on to mention that back then high school was like college to them and that it meant something to graduate from there. There are other examples. I’ve been looking for the middle grade equivalent to  The Hate U Give for a while now and though this book doesn’t really veer too deeply in that direction, it does address issues of police and the abuse of adults in power. Oh. And it mentions that the Hoo family in The Westing Game is stereotypical. Good points all. And I liked the character moments. Those little telling details that say so much more about a person than a thousand lines of text ever could. One great example comes in the description of Big Dub. Describing why he was a fan of tennis the book says, “He liked that he didn’t need to depend on anyone else to win a match.” The flashbacks to the past are interesting because in the present day you are seeing everything alongside Candice. You don’t know anything contemporary that she doesn’t know. The past is different. There the reader is omnipotent. You can get into the heads of every player, understand every motivation, and never be left in doubt of why they do what they do. The tradeoff for that kind of knowledge is that the author has to let you have everything in pieces with trust, on the reader’s part, that this is all going to make sense at the end. I am happy to report that though it’s a little shaky at the start, once the author gets going he really sucks the reader in. And, best of all, there’s not a single dangling plot thread left by the close. Plenty of questions for a sequel, oh yes indeed. But nothing dangling.I’m going to ask you a question now, and I want you to take it seriously. Here goes. Should a book that discusses incredibly serious topics have a sense of humor? The answer to that question is one that I’ve been pondering for a long time. I don’t limit it to books either. What is the role of humor, whatever its bent, in documentaries or novels or anything really? We’re living in an age of peak comedy, but writing a book with serious themes, and then working in some humor, poses a definite risk. Too flippant and the tone of the book is off entirely. The goal of an author unafraid of levity is to use it to break tension, humanize the characters, and endear the written pages to the reader. Yeah it’s a risk, but it’s a risk worth running. The Parker Inheritance isn’t what you’d call a laugh riot, but it definitely keeps things light and, many times, amusing. It’s all in the title, of course. The Parker Inheritance. It seems on first glance to be a reference to the actual monetary inheritance that would go to the person that solves the puzzle. Like a natural counterpoint to a title like The Westing Game (another story of rich men with multiple names and masks they hide behind). But take a closer look at that word. “Inheritance”. This whole book is about what we inherit from the past. We get the genes of our ancestors, sure, but we can also inherit their prejudices, views, and systems. Systems that ensure that some folks stay at the top and others at the bottom. I know almost no books that have found a way to clarify this point for young readers. Now I have one. It’s not a lot. Not nearly enough, but at least there’s one out there now. The puzzle may be impossible, but nothing about this book is implausible. The new required reading. For ages 9-12."}, {"userName": "Donalyn", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/829035-donalyn", "userReview": "I loved so many things about this book--the characters, the history, and the mystery. This would be a fabulous read aloud or a jumping off place for conversations about racism, family dynamics, and friendship."}, {"userName": "Kathie", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/9985756-kathie", "userReview": "‪This is definitely one of my favorite middle grade reads of 2018. Rich in detail and content, wonderfully written, and highly engaging."}, {"userName": "Cassie Thomas", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/58785788-cassie-thomas", "userReview": "What a fantastic story of friendship, differences, struggles, and love - with a dash of adventure, mystery, and history. I was so inspired by so many little comments throughout that it makes me want to do more, to inspire others to do better out there in the world."}, {"userName": "Jordan Henrichs", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/3427342-jordan-henrichs", "userReview": "What I liked:- Very ambitious story; Overall, I liked the structure, mixing in flashback point of views to fill in the gaps of the mystery- While not near as refined or effective as either, this reminded me more of Holes than The Westing Game (either way, good books to be compared to)- Reggie and Siobhan's relationship was emotionally effective- Big Dub was a fantastic anti-hero (adult Reggie too, was authentically flawed)- Candice and Brandon's relationship was sweet- Milo (the bully) was very realistic, two-faced, as was his mother (whom he probably learned his haughty bullish traits from)- The subplot of Brandon being bullied nicely mirrored the story unfolding in the flashbacksWhat I struggled with:- While the effort was ambitious, the result was highly convuluted; Lots of story details to keep track of and LOTS of characters to keep track of; Gets easier in the second half of the book- There is really no mystery to solve; Candice and Brandon don't really get to the \"puzzle\" until halfway into the book and even then, more is revealed to the reader in flashbacks than anything- In fact, I don't have any examples on hand, but often times it felt like Candice and Brandon made contrived leaps just to keep up with the pace with which the author was revealing information in the flashbacks- Candice and Brandon didn't behave like 12 year olds to me; They behaved much older- While I liked that the subplot of Brandon being bullied mirrored what was happening to the Washington's in the past, I still couldn't help but feel that it made the story a little too weighty"}, {"userName": "Barb Middleton", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/4361541-barb-middleton", "userReview": "A male high school student asked me to buy several romance ebooks for the Kindle. He didn't want to be \"seen\" carrying print copies just like the character, Brandon Jones, who likes to read \"girl\" stories. This is just one of many different social issues addressed in this novel giving it depth. Topics cover racism, marginalization, choices, LGBTQ, divorce, bullying and more; however, is written for readers ages 8-12. At the heart of the story is a puzzle being solved by the protagonist, Candice Miller, and her new friend, Brandon. When 12-year-old Candice moves to Lambert, S.C., for the summer after her parent's divorce, she finds a letter that promises millions of dollars to the city if it can be solved. Candice's grandmother tried to solve it ten years earlier and it cost her job and reputation as the first African-American manager of the city. The author does a terrific job shifting between complex themes bringing it together in a satisfying ending. The character arcs are distinct and the flashbacks reveal Lambert's history of injustice that is good for discussion. The puzzle is tied in with the book, The Westing Game, that the two characters love to read. As they problem solve they make connections with how the mystery was solved in that novel to solve their dilemma. It that made me want to go back and reread the book. The treasure hunt is fun and I particularly like how the author addresses the freedom people choose to live their lives and the consequences of those choices such as the grandmother and Candice's dad. A well-written book that can be as complex as the reader wants to make it."}, {"userName": "Abby Johnson", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/53329-abby-johnson", "userReview": "Kids who like puzzle mysteries and solving riddles are going to eat this up. And it's a story with meat on its bones. As Candice and Brandon are researching, they discover a lot of unsavory stuff that happened to the African Americans who started the whole thing in the 1950s. They learn a lot about their families and their town and themselves as they try to piece together where the fortune came from and where it might be hidden.Hand this to kids who love The Westing Game and other puzzle mysteries with high stakes fortunes."}, {"userName": "Bethany Turner", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/7564339-bethany-turner", "userReview": "Book People, an independent bookstore in Austin, Texas, sent me this book because I liked Greenglass House. The Parker Inheritance was a perfect fit. It takes the reader on a puzzling adventure full of surprises, delights, and a large dose of history."}, {"userName": "Nikki", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/3296780-nikki", "userReview": "One of the best middle grade books I've read in years. Fast-paced, fascinating, significant while staying fun. I want to read it all over again!"}, {"userName": "Laura Gardner", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/215964-laura-gardner", "userReview": "⭐️⭐️⭐️⭐️⭐️/5 for THE PARKER INHERITANCE by @mrvarianjohnson // thanks to the MA youth services blog for this review copy (#partner). This is headed to @kidlitexchange next! All opinions are my own._*_*_*_*_*Candice is spending the summer in Lambert, South Carolina in her grandmother's old home with her mother. Her father has stayed home in Atlanta because her parents are divorcing and he needs to fix up the house for a quick sale. Candice finds a mysterious letter in her deceased grandmother's attic and shares its contents with her new friend Brandon from across the street. Soon the two are off on an adventure, researching the history of race relations in Lambert, SC with millions of dollars as the reward for solving the puzzle. The letter leads them to learn about Siobhan Washington, a young African American woman who was much beloved, a secret 1957 tennis game that further inflamed racial tension, as well as the writer of the mysterious letter who is not who he appears to be. Can they solve the mystery and find the reward?_*_*_*_*_*What an amazing book! A first-rate mystery, The Parker Inheritance will keep kids guessing throughout the entire book. Flashback chapters to the 1950s bring more meaning to the text and add greater depth to the historical characters that Candice and Brandon learn about. This is an excellent book for learning about the historical and present day effects of racial discrimination. Author notes in the end provide additional context and help separate truth from fiction. _*_*_*_*_*Students who like puzzle mysteries and/or students who are interested in learning about the long lasting impact of racism will flock to this book. All elementary and middle schools should buy this book. _*_*_*_*_*#bookstagram #book #reading #bibliophile #bookworm #bookaholic #booknerd #bookgram #librarian #librariansfollowlibrarians #librariansofinstagram #booklove #booktography #bookstagramfeature #bookish #bookaddict #booknerdigans #booknerd #ilovereading #instabook #futurereadylibs #ISTElibs #TLChat"}, {"userName": "Ann", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/4877911-ann", "userReview": "[I knew as soon as I started reading the letter that it had too many details, that some of the rambling must be clues I was missing, and yet I still managed to miss them, which is my favorite sort of puzzle novel. I thought the characters were very well drawn, complicated and with multiple things going on in their lives. The insertion of the history sections were well placed and deepened the story, giving the reader more information than the children had, but emotional information rather than factual information. Knowing more didn't help to solve the puzzle, but it made everything resonate more deeply. I found the economic bits of the book confusing. Brandon and his family seem to think that Candice and her mother are very poor, despite watching her father go out and buy her a laptop. Granted, her mother did not do so and the divorce might mean there is a huge discrepancy between the incomes of the parents, but I got the impression this was a reasonably amicable divorce, with both parents trying hard to make sure that Candice had everything she needed. At no point are Candice or her mother in danger of not having food, clothing, or security. There are a couple of things that she and her mother are doing without for the summer, but there are tons of families for whom a second computer for the sole use of a twelve year old is really, really not on the agenda. There are families for whom a FIRST computer is not on the table. To start inviting Candice over to eat or buying her clothes simply on what we see happening seemed like a ridiculous overreaction. Perhaps Brandon's mother misinterpreted some things that were said off-page by Candice's mother, but even that seems weird. I hear other adults complain about bills all the time, and I'd especially expect a new divorcee to be still working through the financial impact of the divorce, but I don't automatically jump to the idea that I need to start providing for their children because they're so poor they can't afford basic necessities, especially when I know they're about to sell their house or that they had enough money to front the cost of major reconstruction to that house (even if they've got an in with the contractor, it's still going to cost them for materials.)It's kind of funny to me that Candice's father is gay, because for a while there I thought the \"we just weren't right for each other\" vibe was setting it up for Candice's mother to get together with Juanita. I guess children's book so rarely showcase mothers developing friendships I was putting too much weight on that relationship. I am a little frustrated with Candice's parents that in six months of divorce and \"even longer\" of separation no one has broached the subject with Candice. I do wish that the romance novel mother wasn't depicted as someone who doesn't like romance novels and only writes them for the money, so that as soon as money is off the table she, of course, will start her \"real\" novel (technically it never says that this isn't also a romance, but written for herself instead of on assignment, but that was definitely the impression I got.) (hide spoiler)]"}, {"userName": "Ms. Yingling", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/2636606-ms-yingling", "userReview": "E ARC provided by Edelweiss PlusCandice's grandmother was a city official in the small town of Lambert before she fell into disrepute. She thought there was treasure buried under the tennis courts and had them dug up. When no treasure appeared, she was relieved of her duties. Candice and her mother are spending the summer cleaning out her grandmother's house after her death, and Candice has some letters that indicate there is still a treasure out there. It's a rough summer-- her parents are separated, and her home in the city is being readied to sell, and there's no one to hang out with in Lambert while her mother is working on her book. Luckily, she finds bookish Brandon, and the two bond. She eventually shares the secret of her grandmother's letters with him, and the two follow the very detailed clues, learning a lot about the racial history of the town in the process. Will they finally find the treasure for which her grandmother was searching?Strengths: This offers an excellent view of what life was like in the 1950s for blacks in the South, and it was good to see this through the eyes of modern children. Candice's life has some challenges, since she misses her grandmother and her parents' separation has a bit of a twist to it, but her parents are supportive and present, and the mood is generally upbeat. The clues they follow are interesting, and the mystery itself is deliciously convoluted. Weaknesses: This took me about four days to read. I kept putting the book down and then thinking I was finished. This could have used some tighter editing to make it shorter and more fast paced. I wish the subplot with Brandon being bullied had been left out. What I really think: This reminded me VERY strongly of Things Too Huge to Fix by Saying Sorry by Susan Vaught. The investigative process was similar, it involved civil rights, but the end of the mysteries were different. I will buy because this author is popular in my library and the cover is great."}, {"userName": "Joy Smith", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/10093381-joy-smith", "userReview": "Great combination of mystery and history. I'm not fond of alternating time lines, and sometimes I read one story line at a time, but I went straight through this one. I've read books where the characters for each time period are listed separately at the beginning and identified. I would have appreciated that because sometimes I lost track of what was happening to whom and when in the historical chapters. I like the characters, including Tori (Brandon's sister) who enthusiastically joined Candice and Brandon in their search. (They needed her to ferry them now and then.) And I love the way Brandon's and Candice's relationship developed, plus the family relationships are interesting--and real.The search and research--with a real puzzle--is fascinating, and the racism really is effective and sad; and \"passing' is handled well. I was aware of it (some books on the subject are mentioned), but this brings out the reasons and the fear. (Btw, an episode of The Artful Detective included an example of that.) Worth reading for the mystery and the characters and their problems. Oh, and I put The Westing Game on my Amazon wish list."}, {"userName": "Susan", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/10717985-susan", "userReview": "I was expecting a story about two children working to solve a puzzle in order to win a fortune - which is the description in the book jacket. However, I feel like the puzzle was just a framework for writing a story with a number of serious topics - racial discrimination, mixed race relationships (historical situations - not current), homosexuality, divorce, and bullying. There were so many issues in this story that you lost the fact that this was story \"about a puzzle\". The two main characters were 11 and 12. I agree with another reviewer that stated that characters are usually older than the intended reader - but this book has topics that are much too mature for a 10 year old. School Library Journal recommended this story for grades 4-6. I highly recommend that you read this story first and have a good knowledge of your audience, their maturity and their exposure to topics before you give this story to a 9 or 10 year old. The story begins with an 11 year old boy who has read Are You There God, It's me Margaret at least 10 times. There are several homosexual characters. If one young character wins the fortune, they want to open a camp of LGBTQIA. One character has parents who are divorcing and she finds out her father is gay. She is happy that he is happy. I think the reaction of most 12 year old would be a vastly different experience from the simple and neat reaction in this story. The main theme of the book is racial discrimination, from the 1920's on (mostly 1950s) and today - with heavy beatings/violence - though not in graphic detail. There are characters who are so filled with bitterness that they are consumed with revenge because of discrimination. While I don't disagree that people have reacted to discrimination in that manner, just make sure your audience is mature enough for the topics."}, {"userName": "Lynn", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/935500-lynn", "userReview": "This lived up to the buzz! Wonderful intricate mystery loaded with puzzles, mysterious clues and kids doing research! Add a somewhat complicated structure, engaging characters (including adults) and the incorporated exploration of whole range of issues such as racism, segregation and its long term effect, identity, friendship, divorce and the civil rights movement and more and you've got quite a package. Johnson handles it all adroitly and the story never bogs down under the weight of all being managed. The mystery itself was truly a treat and there is an additional thread about the joy of reading that shines out."}, {"userName": "Alina Borger ", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/4341509-alina-borger", "userReview": "I cannot recommend this book enough. While they spend a lot of time (early) going to the library, so did Hermione. And yes, the opening is a bit slow, tied with the convention of moving between time periods--it's not an easy start. But it's worth it. SO worth it. I'll write a real review later.Edited to add: So this book is complicated--like really, really, really complicated. And it moves pretty slowly for the first third or so. But: it's a puzzle mystery, so I think that's to be expected. What's actually astonishing and powerful about the novel is that in order for Candice and Brandon to puzzle out the mystery, they must come to understand the racialized history of their community. In their quest, they encounter Jim Crow, Desegregation, The Great Migration, attempted lynchings, and affirmative action as well as issues of racial identity around \"passing\" and privilege. To have one of our premier black children's writers behind the wheel and two young, black protagonists on this case also means that the story is firmly pitched in own voices. It is richly nuanced, complex, and dynamic at every level.This is as much for adults and the YA set as it is for advanced middle graders. And I can't help but recommend the audio book here--the narration is straight up phenomenal. For younger/struggling readers, use audio accompanied with text--as color coding on the pages distinguishes the different time periods."}, {"userName": "Lesley Burnap", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/8770643-lesley-burnap", "userReview": "This book has all the feels and so many great messages for its readers. This is a beautiful story which moved me to tears. The mystery hooked me, but the masterful weaving of multiple stories kept me turning the pages. As much as I wanted to know where the mystery would lead, the stories of Candice, Brandon and the Washington family are what I'll hold in my heart. ❤️ This is a new favorite. Well done, Mr. Johnson. So much more I'd tell you, but I don't want to spoil it for you. Highly recommended. For grades 5+. Some 4th graders, perhaps. Know your readers."}, {"userName": "Debbie Tanner", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/2347035-debbie-tanner", "userReview": "Candice and her mom are moving to a small town in SC for the summer while the kitchen in their house in Atlanta is being renovated. The house belonged to her grandmother, who died a while back. Candice misses her terribly along with her friends and her dad. Candice makes friends with a boy who lives across the street who reads as widely as she does. Candice also finds a mysterious puzzle that her grandmother left her. This is a really interesting story that involves race relations, family connections, sexual identity as well as puzzles. It was a terrific read."}, {"userName": "Kari", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/3323003-kari", "userReview": "Liked but did not love it - I think it would have benefitted from a “cast of characters” list at the beginning. I’d love to hear from some kids who read it and what they thought. It’s hard for me to imagine that they wouldn’t have been mostly confused about characters and details."}, {"userName": "Joy Kirr", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/6593703-joy-kirr", "userReview": "This one was thick - a lot of characters to take in, and a bit of time shifting for me to get used to. If my 7th graders liked LIONS OF LITTLE ROCK, or even THE WESTING GAME I think this would be a good challenge for them. I loved the literary allusions in it."}, {"userName": "Brenda Kahn", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/2700654-brenda-kahn", "userReview": "Loved this and I'm not a huge fan of The Westing Game. This was so much better. More later. Look for it in March!"}, {"userName": "Hoover Public Library Kids and Teens", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/2775666-hoover-public-library-kids-and-teens", "userReview": "Explores the racial history of a town through a present-day scavenger hunt."}, {"userName": "Elizabeth Schwertfuehrer", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/13413542-elizabeth-schwertfuehrer", "userReview": "Wonderful puzzle book with strong role models and friendships. Race relations and discrimination is handled w/o sugarcoating and will be rough for younger/unaware readers- but should be discussed and not avoided."}, {"userName": "Debbie", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/1709540-debbie", "userReview": "Books are usually aimed at an audience slightly younger than the main characters in the book. Since the present-day heroine and hero are 12- and 11-years-old, that would indicate elementary school kids as the target audience. However, the writing level and issues discussed are at least high-school age to adult, IMO. The main characters from the 1957 era (with chapters from their points-of-view) were high schoolers and adults, so maybe that is the intended audience.Anyway, the present day (black) kids uncovered what happened in the period around 1957, which dealt with segregation in schools, racism against blacks, and how light-skinned people with black ancestry sometimes lived as whites. The present-day kids dealt with bullying around sexual-orientation issues. Some boys called Brandon names that made Candice think he was gay, Brandon's best friend was gay, and Candice's dad was gay. Candice stood up for Brandon against the bullying. Candice's mom and dad had just gotten divorced, but the reason why came as a surprise to her at the very end. Rather than actually deal with the complex reaction a child would feel at this news, the author had her quickly decide that she felt sad that her parents obviously would never get back together, but she was glad to see her dad with his new boyfriend because her dad was happy.I thought the 1957 story was interesting and showed the affects of racism and how difficult some choices could be. I enjoyed how Candice and Brandon doggedly solved the mystery. However, I felt like the issues the modern kids dealt with were given pat, politically-correct answers. I was disappointed that the author essentially pressured kids not to feel conflicted because they SHOULD feel happy for their gay parent, who will, of course, still totally love them. (In contrast, I recently finished a biography where the gay dad completely abandoned his children when he chose to divorce his wife and wasn't sorry about doing so.) Overall, I was disappointed by the ending, especially that the kids used the money to support sexual-orientation issues when it was intended to be used to help improve the lives and opportunities of the blacks in that area of the city.There was no sex. There was a minor amount of bad language. The racist slurs and gay name-calling was implied rather than actually printed out. I received a review copy of this book from the publisher through Amazon Vine."}, {"userName": "Shaye Miller", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/21793100-shaye-miller", "userReview": "The Parker Inheritance introduces us to 12-year-old Candace who is feeling stranded in Lambert, South Carolina for the summer while she and her mom stay in her deceased grandmother’s old house. Her parents are currently separated and she doesn’t know when she will go back home to Atlanta. She meets 11-year-old Brandon, the boy who lives across the street from her grandmother’s old house, and they initially connect through their love of books. While rummaging through her grandmother’s attic, she discovers a letter introducing the details of a mysterious treasure hunt. As it turns out, Candace’s grandmother was once the city manager and she lost her job trying to uncover this mystery! So once Candace and Brandon start on this journey together, there’s no turning back. What they DON’T expect is to uncover is a large chunk of history that most of the older town members would prefer be forgotten. In fact, part of winning the treasure will mean openly revealing this hidden history to the general public. The story flashes back and forth between the 1950s and modern times, which helps the reader better understand what the town of Lambert has experienced over the decades. At times we read a great deal about real life history as there was plenty of discussion on the experiences of school segregation and Brown v. Board of Education (and lesser known legal cases, such as Briggs v. Elliott). There are so many meaningful pieces to this story, including the evident pain of a splitting family, a beautiful friendship, mystery, adventure, a bit of romance, some sexism and homophobia, and a whole lot of racism. The Westing Game is also mentioned multiple times as the book they used to better understanding how complicated puzzles work (Guess what’s going on my TBR list…).My heartbeat was elevated and hands a bit shaky as I went into the final 1/3 of the book. I couldn’t wait to see how it ended and I kept wondering if I was going to find out part of the story was true because it all felt so real. At the conclusion of the book, Johnson provides an author’s note that separates true history from fiction — so you really don’t want to miss that! One thing that really rings true at the conclusion of the story is that, whether looking at history or modern day happenings, we so often see what we want to see and hear what we want to hear. That said, I’ll leave you with a favorite quote from the story:That night, Candace got up to find something to soothe her stomach. She heard her mother’s heavy breathing as she passed by her room. Both of her parents snored, but the two noises had always seemed to fit together. To her it sounded like melody and harmony. We hear what we want to hear. We see what we want to see. It seemed like everything that summer has been pointing to that. It was on the tip of everyone’s tongues. In the misunderstood lyrics of her favorite songs. And stamped on the jewelry she’d owned for almost half her life. Parker’s mystery was the perfect example of seeing what you wanted to see and hearing what you wanted to hear…"}, {"userName": "American Mensa", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/16573421-american-mensa", "userReview": "The Parker Inheritance by Varian Johnson is a realistic fiction novel that occurs in modern times yet examines the realities of history. While their house undergoes renovation, Candice Miller, a twelve-year-old African American girl, and her mother are forced to move to Lambert, South Carolina, for the summer. As Candice begrudgingly adjusts to life in Lambert, she discovers that her grandmother had previously served as the town’s first African American city manager, only to be fired for pursuing a mysterious treasure that was supposedly buried in the town. Intrigued by the puzzle and determined to restore her grandmother’s ruined reputation, Candice befriends Brandon Jones, the bullied bookworm who lives across the street, and embarks on a journey to solve the mystery of the Lambert treasure. As the pair investigate for decades-old clues, they discover truths about racism throughout history. Will the summer duo uncover the treasure that led to the downfall of Candice’s grandmother? What will they learn about themselves and the past along the way?\tThe Parker Inheritance is a fantastic book that brims with complex themes presented in a creative way. Almost seamlessly, Johnson weaves topics as heavy as racism and divorce throughout the novel without subtracting from its main plot: the treasure mystery. By placing emphasis on Candice and Brandon’s discoveries as they search for the treasure, the book provides evidence that the journey is often just as important as the destination. Further, The Parker Inheritance is not the typical, predicable mystery novel; instead, it is exciting and engaging, with unexpected twists around every corner. However, my favorite aspect of the book was Johnson’s extraordinary character development. From the main figures to people who only appear in the novel once, all of the book’s characters seem remarkably realistic. It is almost as though the reader were in Lambert herself, serving as the third member of Candice’s mystery-solving group.\tWith intermediate vocabulary and carefully presented themes, The Parker Inheritance is an excellent read for children in middle school, particularly those who enjoy mysteries. Overall, I encourage readers eager to delve into history and discover the past to open the pages of the novel and embark on the adventure of a lifetime.Review by Isabella T., age 16, Memphis Mensa"}, {"userName": "Cindy Mitchell *Kiss the Book*", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/19521241-cindy-mitchell-kiss-the-book", "userReview": "Johnson, Varian The Parker Inheritance, 331 pages. Arthur A. Levine Books, 2018. $17. Language: G; Mature Content: PG (race relations, homosexuality, bullying); Violence: PG.Candice and her mom just moved to Lambert, South Carolina for the summer to live in her grandma’s house. Candice’s grandma died a while back and Candice really misses her. When Candice asks her mom why her grandma moved to Atlanta to stay with them, her mom tells her that her grandma had been fired from her job as city manager. What could her grandma have done that would warrant being fired? Her mom explains that she dug up a local tennis court looking for a buried treasure. Candice cannot believe what she is hearing. Before she can ask too many questions, her mom cuts her off and tells her not to even think about looking for buried treasure. Well, Candice isn’t sure she can just ignore a mystery that includes a buried treasure. Later she finds a letter with clues to finding the treasure. Candice is intrigued, and with help from Brandon, the boy across the street, they delve into the mystery hoping to find a buried treasure.I loved this book. The characters were well developed and so likeable. The story was great, both the present day story with Candice and Brandon, as well as the story from the 1950’s about the Washington family. I love that as Candice and Brandon discover clues, the reader experiences the story unfolding from the Washington’s perspective. I love how it all connected. The mystery is intriguing with a few twists and a very satisfying ending. This is a solid middle school book; unfortunately I don’t know if they will pick it up. The cover doesn’t quite fit the story and intended audience. It may, however, appeal to younger students, and while there isn’t anything graphic or explicit, there is content to consider (see ratings). EL - ADVISABLE; MS - OPTIONAL. Reviewer: RBhttps://kissthebook.blogspot.com/2018..."}, {"userName": "Barbara", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/1222379-barbara", "userReview": "3.5 for me. It's terrific to see this author, who is fairly new on the publishing scene, stretching himself in a book like this one. While I enjoyed his earlier The Great Greene Heist and To Catch a Cheat, which are school-related, here he delves into a mystery surrounding a missing fortune and identity. While her parents move in different directions and the house she grew up in in Atlanta is readied for sale, twelve-year-old Candice Miller and her mother move to rural Lambert to stay in her grandmother's house for the summer. As she sorts through her grandmother's possessions, Candice stumbles upon a letter promising a great deal of money to whoever can solve the mystery it presents. Relying on only a handful of clues, including the name of someone named Siobhan Washington, and with some help from Brandon Jones, the bibliophile who lives next door, Candice is determined to get to the bottom of this mystery, especially since doing so could clear her grandmother's name. I won't say much more since I don't want to ruin the surprises for readers, but suffice it to say that the book tackles bullying, prejudices, and one man's attempts to gain revenge on those who wronged him and those he loved. It also is a love story about a love that survives against all odds and a lesson about how having a great deal of wealth may come at a high price. While I loved the glimpses into one small town and some of its citizens from 1914 to 1986, sometimes the author seems to have tried to tackle a little bit too much in one book what with the new relationship Candice's father has begun and Brandon's best friend and Candice's inability to tell her father how she really feels, even how she hates being called Candy. Still, this is a book that will fly off the shelves, most likely bringing new attention to Ellen Raskin's The Westing Game, published back in 1978, and in some ways responsible for the puzzles and clues in this one."}, {"userName": "Mary Louise Sanchez", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/2315127-mary-louise-sanchez", "userReview": "Candice, a Black girl, is at her late grandmother's house for the summer with her mom. Dad is home trying to get the house fixed up to sell upon the pending divorce. Then Candice discovers an old letter from her grandmother which mentions a hidden tresure in her town, Lambert, South Carolina. The grandmother tried to find the treasure years ago by having employees dig up a tennis court, only to lose her job as a city administrator.When Candice meets Brandon, the next door neighbor, plagued by bullies because they think he's gay. They pair up to research the clues because they both love solving puzzles and researching. Also, if they find the mystery treasure, it's worth over a million dollors and would clear up Candice's grandmother's name and help their families.Candice and Brandon learn there is a mysterious benefactor who is tied to a high school tennis match in 1957 between the white and African-American tennis teams where the Black team won. The Black coach was brutally attacked and his family moved away for safety's sake and a team member, Reggie, also disappeared. The Black coach's daughter, Siobhan Washington, was then separated from her boyfriend, Reggie, but she also had a white boy who liked her too. The relationship between Siobhan and Reggie factors into the mysteries Candice is trying to solve. There are many references to The Westing Game book, which both Reggie and Siobhan loved, as do Candice and Brandon. I liked the addition of the different colored pages in the book which deal with the past. Those visuals helped keep characters straight. I also appreciated that the kids in the story are Black, but they could be any race or ethnic group, as their race doesn't seem to be the main thing identifying them."}, {"userName": "grdel", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/8280770-grdel", "userReview": "I was really looking forward to The Parker Inheritance as myself (and my kid) both loved The Great Greene Heist & sequel. And The Parker Inheritance completely surpassed our expectations. The story of Candice, 12, who is returning with her mother to live in her dead grandma’s house in the small town of Lambert for a summer while their home is being renovated, it begins in time-honoured mystery fashion with a letter in the attic. The letter has been left by Candice’s grandma, and in it are a series of clues leading to a treasure–worth $40 million, with 10% going to the finder.What kid wouldn’t be intrigued by an opener like that?But there’s a whole lot more to The Parker Inheritance. First of all, Candice’s grandma was sacked and had to leave town after her own fruitless search for the treasure led her to dig up a tennis court…Second, both Candice, whose parents are divorcing, and Brandon, the kid across the street who joins Candice in the hunt are struggling with issues of their own.Third, the story of how the mysterious benefactor, James Parker, came to leave the treasure is one involving racial segregation, prejudice and tragedy in Lambert–the very town the kids are living in. The Westing Game (which I haven’t read but will seek out) is referenced in the book, but the book that came to mind was Holes by Louis Sachar. Johnson unfolds the past and makes it come to life with the same skill. The family drama is handled deftly, the mystery is engaging and it’s all wrapped up beautifully. A fabulous book 10+"}], "description": "\"A clever puzzle, a hidden treasure, and a couple of kids you'll wish were your friends...Dive in!\" - Sara Pennypacker, author of Pax\n\n\"A candid and powerful reckoning of history.\" -- Kirkus Reviews, starred review\nWhen Candice finds a letter in an old attic in Lambert, South Carolina, she isn't sure she should read it. It's addressed to her grandmother, who left the town in shame. But the letter describes a young woman. An injustice that happened decades ago. A mystery enfolding the letter-writer. And the fortune that awaits the person who solves the puzzle. So with the help of Brandon Jones, the quiet boy across the street, she begins to decipher the clues. The challenge will lead them deep into Lambert's history, full of ugly deeds, forgotten heroes, and one great love; and deeper into their own families, with their own unspoken secrets. Can they find the fortune and fulfill the letter's promise before the answers slip into the past yet again?", "title": "The Parker Inheritance", "url": "http://www.goodreads.com/book/show/38219002-the-parker-inheritance", "average": 4.28, "cover": "https://images.gr-assets.com/books/1517083453l/38219002.jpg", "reviews": 129, "authors": [{"url": "https://www.goodreads.com/author/show/851842.Varian_Johnson", "name": "Varian Johnson"}], "type": ["Mystery", "Childrens", "Historical", "Realistic Fiction", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/38219002-the-parker-inheritance", "http://www.goodreads.com/book/show/35238085-the-parker-inheritance", "http://www.goodreads.com/book/show/17928557-the-great-greene-heist", "http://www.goodreads.com/book/show/26623240-the-return", "http://www.goodreads.com/book/show/2348877.My_Life_as_a_Rhombus", "http://www.goodreads.com/book/show/6609845-saving-maddie", "http://www.goodreads.com/book/show/25582717-to-catch-a-cheat", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}