{"ratings": 132786, "userreviews": [{"userName": "Stacy", "userReviewDate": "Jul 16, 2007", "userURL": "http://www.goodreads.com/user/show/171387-stacy", "userReview": "Mr. Tolle spent two years sitting on park benches and simply \"living in the moment\" prior to writing this book. I doubt whether I will ever take the time in my life to do such a thing, however the suggestion he offers that we all spend a ridiculous amount of time either worrying about the future, or dwelling on the past has impacted me in a huge way. Until I read this book, I never noticed how in sane my mind can make me if I choose to let it. Tolle implores the reader to take the reigns of his own mind, focus on the beauty and love around him, just like we all did when we were children and the world was full of wonder. We are still in that same world, but our vision has been clouded by meetings, appointments, paperwork, debt, clocks ticking, deadlines approaching, past frustrations and dissapointments, the list goes on and on and on if you let it. Tolle suggest that we have the power to focus on this very moment, as it is the only one we really have. The past is past and the future is not here, and may not ever come. A very enlightening book. I highly recomdend it to anyone who would like to improve the quality of this moment of their life."}, {"userName": "Erin", "userReviewDate": "Jul 24, 2008", "userURL": "http://www.goodreads.com/user/show/722069-erin", "userReview": "There is no nice way to say this. I hated this book with a fiery passion. It did not make me feel at peace. Rather, it made me want to chew off my arm. I bet if we asked Eckhart Tolle why I felt that way, he'd say that I wasn't really listening to his message.My problems with the book were as follows. First off, the tone of the book was extremely condescending. Written in a question/answer format, many of the answers started out with \"You're not really listening\" or \"You don't understand what I'm saying.\" Way to kick someone when they're down, dude. Secondly, I felt that he frequently took philosophy and other spiritual messages and twisted them to fit his needs. Basically, he wants people to stop thinking so much. I get the idea that as a culture we over-analyze and whatnot, but his message was basically to stop thinking all together. Sorry Eckhart, but not all of us can wander around for years at a time, sleeping on park benches in a state of euphoria.Also, have you seen his picture on the back of the book? He looks like just the sort of guy who is plotting to take over the world. He wants us to stop thinking for ourselves so that he can think for us!Sorry, back to reality. Basically, I didn't feel like this book offered any real direction or advice to those who seek it."}, {"userName": "howl of minerva", "userReviewDate": "Mar 16, 2014", "userURL": "http://www.goodreads.com/user/show/4475418-howl-of-minerva", "userReview": "It would be easy to dismiss this book as a fruit-salad of New Age and pseudo-buddhist clichés, mashed to a fine purée of nonsense and sold as a cure for what ails you in our age of secular alienation. In fact, that is what it is and that is what I'll do. The book opens with what readers of religious texts, the erowid archives and Huxley's The Doors of Perception will recognise as a classic mystical experience, epiphany or trip:\"One night not long after my twenty-ninth birthday, I woke up in the early hours with a feeling of absolute dread... `Am I one or two? If I cannot live with myself, there must be two of me: the `I' and the `self' that `I' cannot live with.\" \"Maybe,\" I thought, \"only one of them is real.\"... I was so stunned by this strange realization that my mind stopped. I was fully conscious, but there were no more thoughts. Then I felt drawn into what seemed like a vortex of energy. It was a slow movement at first and then accelerated. I was gripped by an intense fear, and my body started to shake. I heard the words \"resist nothing,\" as if spoken inside my chest. I could feel myself being sucked into a void... Tears came into my eyes. I got up and walked around the room. I recognized the room, and yet I knew that I had never truly seen it before. Everything was fresh and pristine, as if it had just come into existence. I picked up things, a pencil, an empty bottle, marveling at the beauty and aliveness of it all.\"After this experience, Ulrich Tolle became a vagrant mystic for a period, rechristened himself Eckhart (presumably after 13th century Christian mystic Meister Eckhart) and eventually became a spiritual teacher, author and talk-show guest with extraordinary success. The primary thesis of the book is quite sensible, if unshattering. We exist only in the present; our past and the future are mental constructs. It is a shame that our enjoyment of the present is so often ruined by regrets about the past and worries about the future. By being more intensely focused on the present, we can be more content and more fulfilled. As this doesn't fill 229 pages we are treated to, among other things, lengthy discourses on the \"pain-body\", an interesting theory of menstrual flow as a means to enlightenment and the surprising finding that as a member of the human race, I carry personal complicity and responsibility for all crimes and genocides of the twentieth century including those carried out before my birth. The style is generally chatty, though Eckhart occasionally uses a faux-dialectic to bring up obvious objections to his line of thought, to which he responds with withering scorn. One helpful feature is the use of a pause symbol (§) to indicate points at which \"you may want to stop reading for a moment, become still, and feel and experience the truth of what has just been said\". The text is interspersed with brief analyses of quotations from various religious traditions, apparently garnered from many weeks studying fridge-magnets. §I am glad to have read the book, if only to have gained a greater understanding of contemporary popular New Age/spiritual literature. If this book changed your life, please do not attack me but have compassion for my ligatures to mind and pain-body which impede my understanding of it.___This is (unfortunately) one of my most-liked reviews. I'd just like to add that I don't automatically hate all writing on these themes. I would warmly recommend Zen Mind, Beginner's Mind (Shunryu Suzuki), The Miracle of Mindfulness (Thich Nhat Hanh) and The Courage to Be (Tillich) among others."}, {"userName": "Kristoffer", "userReviewDate": "Jul 02, 2008", "userURL": "http://www.goodreads.com/user/show/1291521-kristoffer", "userReview": "There is a point in our lives when we say enough is enough. This is what this book is about. In one of his greatest works Eckhart Tolle teaches us the real meaning of spirituality. He teaches us the importance of the present moment. Through the recognition of the ego he makes us aware of how it destroys our lives. I would recommend this to anyone who is looking for the real meaning of their lives and to anyone who is sick and tired of the usual thing. The first time I encountered this book was when Oprah was introducing her book club selection, a new earth. I heard her mention this and while I was searching in the online catalog of our school library here in the Philippines I found it available for borrowing. So I immediately read it in the course of five days. After reading it the first time I understood its message intellectually. This was the reason why I didn't apply it in my life. But a few days ago I started having panic attacks and I was on the verge of suicide. I was so frustrated because I made a wrong decision in shifting my courses here in my school. I was so depressed because I didn't really know what I wanted with my life. It seems that the world is so full of shit. When this became worse I consulted our school counselor. However it seems that it is not enough. So without any real reason at all I started watching Oprah's videos about A New Earth and I remembered this book. I borrowed it again yesterday and just awhile ago I finished reading it. Then I began to understand it not on the level of the mind but at the level of the spirit. And without incident I became enlightened. I am still starting to feel its benefits at this moment. I started accepting what is rather than identifying myself with the ego. I can't say that I'm happy after reading this book like some \"self-help\" books would like you to be. But I can say that I am at peace because I aware of the workings of the ego and not identified with it. So if you've had enough of the madness of this world I definitely recommend this book. But don't just understand it, apply it."}, {"userName": "Anna", "userReviewDate": "Jun 11, 2012", "userURL": "http://www.goodreads.com/user/show/5893835-anna", "userReview": "First of all, I must say I'm very much into all kinds of self-help books as well as new age stuff. I'm a believer! I read avidly all about OBE, reincarnations, karma, mindfulness, meditation practices and I try to make use of what I read in my everyday life. So, of course, I was looking forward to this book, especially as it was recommended to me by people whose opinion I value.And my oh my, wasn't it total deception. I made it until about half of the book when I realized I really could take no more of this rubbish. Mr Tolle preaches his \"wisdom\" (which is not actually his at all) with a condescending, \"I-know-it-all\" attitude. He is the only one enlightened (of course). We are all only to listen to his truths and follow on a \"as is\" basis. No thinking of your own is allowed. Actually, thinking is bad for you, so should be used sparingly anyway. If you disagree with any of his points, he just haughtily replies that \"you don't understand\", \"this cannot be accessed with your mind\" etc etc. He regularly reminds you that you are the one belonging to the horrible human species that kill millions of others. I agree with that - but I wonder why he thinks of himself as someone who is above those ugly humans? What, is he so much of a \"Being\" now that his ancestor's sins don't concern him? The next step will be to call him God and bring him your money because it's too materialistic for you anyway :) And actually it's not a joke - when you see how many people aggressively defend his \"great teachings\" and attack anyone who does not agree about the \"incredible spiritual value\" of this book... well, does that remind you of something?The basic ideas of this book - being in the now, not dwelling too much on your past and future, not giving too much power to your thoughts - are of course all highly relevant. But there are plenty of other books delivering the same message in much better style. Tolle is repeating the same things over and over again, mixing them up with bits and pieces of various religions and teachings. All that he had to say could be said in a couple of pages. But then again, writing a whole book is much better because you get to sell it to a lot of people. And although time may be an illusion, money for sure isn't ;) Do yourself a favour and read something else if you want to learn the power of now. A collection of simple meditations made me feel much more present and at peace than this boring mumbo-jumbo."}, {"userName": "Michael ", "userReviewDate": "Oct 23, 2011", "userURL": "http://www.goodreads.com/user/show/3724839-michael", "userReview": "Also on my bookshelf is a review of Tolle's THE NEW EARTH. I read it because of the recommendation from Oprah. In that review I said he used 300 pages to say what he could have said in a 10 page essay. I read this book because someone I know said it was great. I think it's just another bunch of psycho-babble bullshit this rich con-man threw together. Really people....if you have issues, go get help without throwing your money away on this kind of crap. No, I did not buy it....the book is a loaner that I will eagerly return.The message in both books, in my opinion is exactly the same...live for today. This guy is good at taking a cliche, wording it 43 different ways and calling it a book.Back in the mid-1960's....a group called 'The Grass Roots' said Live for Today in about three minutes. Great song...download it....Michael"}, {"userName": "Edwin B", "userReviewDate": "Sep 23, 2007", "userURL": "http://www.goodreads.com/user/show/322698-edwin-b", "userReview": "Upon 2nd reading of this book, I realized that any form of negativity I may have in the moment actually reflects a resistance to the present moment - a refusal to accept the here and now (which is the only reality).Previous to this, I had thought that negativity simply is - and therefore should simply be noticed and accepted as part of the current reality, and not struggled against.True, negativity shouldn't be railed at nor struggled against - but should instead be simply noticed. However, noticing negativity should include being aware that it involves my resistance to the here and now, and my choosing instead to be wrapped up in my thoughts - and that there is a liberating alternative that is actually what is true and real."}, {"userName": "Khadidja", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/21493936-khadidja", "userReview": "i loved this book so much i'll probably read it again, I agree with the author on so many things .... like the fact that the word “God” is misused and By misuse, I mean that people who have never even glimpsed the realm of the sacred, the infinite vastness behind that word, use it with great conviction, as if they knew what they are talking about. Or they argue against it, as if they knew what it is that they are denying. This misuse gives rise to absurd beliefs, assertions, and egoic delusions, such as \n“My or our God is the only true God, and your God is false,” or Nietzsche’s famous statement “God is dead.”\nand Lots of confusing moments like this ........... \n“I cannot live with myself any longer.” This was the thought that kept repeating itself in my mind. Then suddenly I became aware of what a peculiar thought it was. “Am I one or two? If I cannot live with myself, there must be two of me: the ‘I’ and the ‘self’ that ‘I’ cannot live with myself, there must be two of me: the ‘I’ and the ‘self’ that ‘I’ cannot live with.” “Maybe,” I thought, “only one of them is real."}, {"userName": "Amy Almarri", "userReviewDate": "Jun 10, 2010", "userURL": "http://www.goodreads.com/user/show/2871437-amy-almarri", "userReview": "صاحبني هذا الكتاب اسبوعا كاملا .. على رغم انشغالي الهائل .. كان تفكيري منصب حول ماهية الآن .. ربما التجربة التي مررت بها كانت قاسيه لتجعلني افكر بحلول \"الآن\" .. وهذا الكتاب كان بمثابة هدية من الله ان وهبني اياه بهذا الوقتطريقك للخلاص من الافكار والأنا التي تتماثل مع العقل لتتعسنا لترجعنا للماضي لتثبت اننا لانعيش إلا من بقاياه او بالمستقبل وكان السعادة ستأتي من خلال كذا وكذا .. او من خلال الماديات او ماسيأتي في المستقبل .. الكتاب بال 200 صفحة يحومون حول الفكرة التي مفادها كيف تعيش اللحظة وتنسجم معاها بحيث لاماضي ولامستقبل شكرا استاذي اكهارت .. شكرا ممتنه بأنك انقذتني من نفسي السلبيه .. لولا الله ثم كتابك الملهم لما اصبحت بنفس قوية تستطيع ان تمحو الماضي .. ملاحظة فقط :الترجمة للاسف ليست جيده .. عانيت جدا حتى افهم مابين السطور .. الكتاب لاشك انه عميق لكن الترجمة ظلمته .."}, {"userName": "Natali", "userReviewDate": "Dec 10, 2008", "userURL": "http://www.goodreads.com/user/show/584195-natali", "userReview": "I passed this book dozens of times in my yoga studio back in 2003. It was so popular and its praises so well sung by my yoga teacher, Steve Ross, that I thought it must be a bunch of new age mumbo jumbo. I didn't want to read it because I thought that it would entail jumping on some Los Angeles hippy bandwagon. I opened myself up to Eckhart Tolle after watching him on Oprah's Spirit Channel and I'm so glad that I did. This book is really great. It contains such simple philosophy that is so hard to practice in our Western society. I hate to say something banal like \"it changed my life,\" but I am really hoping that it did. I will definitely be referring back to it often."}, {"userName": "Jillian", "userReviewDate": "Jan 31, 2008", "userURL": "http://www.goodreads.com/user/show/756445-jillian", "userReview": "I've read a few books with similar messages about living in the present, being mindful, and grateful--it's a very zen-like message--but this book was different. Tolle explains that we are not our thoughts. \"The very fact that we can objectively observe our thinking, he reasoned, suggests that the constant and often negative dialogue in our heads is separate from who we are.\"That's a quote I took from the interview between Tolle and Oprah from the May article in O magazine since I think it sums up the powerful message of this book the best. I liked his explanation of being still, and the question and answer form of the book, where he explains how it helps people refocus on what matters."}, {"userName": "Jeff", "userReviewDate": "May 08, 2008", "userURL": "http://www.goodreads.com/user/show/1149777-jeff", "userReview": "I like Echkart Tolle. I recommend this book if you are into new age spirituality or not. Even if you aren't into spirituality at all, check it out. I mean, jeez, spiritual enlightenment for less than $20, how could you go wrong?I sometimes struggle with doubts about him, but I do this with all spiritual teachers. Another reviewer described him as a \"pompous fraud\" who \"steals the classic works of Eastern cultures and repackages them in a poorly-written and impossibly stupid manner.\" My consciousness isn't evolved enough to know absolutely for sure one way or the other.There are some very useful concepts in this book for me, presented in a very useful way. None of them are new, and E. Tolle says as much. The more I learn about the great wisdom teachings the more they seem to me to be the same, harmonious with each other. So, he is just adding his voice to the harmony.The way Tolle presents the teachings make intuitive sense to me and helps me make use of them. Your mind wants you to think it is in charge, don't be fooled. Be aware of your emotions, they provide interesting guidance and input. There is no reality but the present moment, everything else is either a memory about the past or a fantasy about the future.I would hang out with Eckhart Tolle, and reading his books might be as close as I'll ever get. I think hanging out with the little sprite is cool."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Power of Now, Eckhart TolleThe book is intended to be a guide for day-to-day living and stresses the importance of living in the present moment and avoiding thoughts of the past or future.عنوانهای ترجمه شده: آدمی دیگر؛ تجربه حضور در لحظه ی حال؛ تمرین برای رسیدن به جادوی اکنون؛ تمرین نیروی حال؛ زندگی ایده آل و آرامش درون؛ زیستن در حال؛ شور حال، قدرت اکنون، قدرت حال؛ قدرت حضور در حال؛ کلیدهایی برای زندگی سالم و بهتر، لذت حضور یا اقتدار اکنون؛ نیروی حال؛ نیروی حال رهنمونی برای روشن بینی معنوی؛شکوه زندگی در لحظه ی حال؛ نویسنده: اکهارت تول؛ تاریخ نخستین خوانش: پنجم ژوئن سال 2002 میلادیبا عنوان: تمرین نیروی حال؛ مترجم: فرناز فرود؛ تهران، کلک آزادگان، 1381؛ در 109 ص؛ شابک: 9649306331؛ چاپ چهارم 1384؛ پنجم 1386؛ شابک: 9789649306339؛ چاپ ششم 1389؛ چاپ دیگر 1393 در 111 ص؛ موضوع: زندگی معنوی - قرن 20 مبا عنوان: شور حال؛ مترجم: سوسن پیرنیا؛ تهران، بافکر، 1388؛ در 250 ص؛ شابک: 9789649098128؛با عنوان: زندگی ایده آل و آرامش درون؛ مترجم: پروین خیاط غیاثی؛ تهران، نوآور، 1389؛ در 248 ص؛ شابک: 9789642804498؛با عنوان: زیستن در حال؛ مترجم: مهدی الوانی؛ تهران، نشر نی، 1389؛ در 271 ص؛ شابک: 9789641851790؛با عنوان: قدرت حال؛ مترجم: غزال رمضانی؛ تهران، وانیا، 1393؛ در 280 ص؛ شابک: 9786006564296؛ با عنوان: تمرین نیروی حال؛ مترجم: فاطمه مشایخی؛ تهران، سیوا، 1394؛ در 130 ص؛ شابک: 9786006974118؛با عنوان: قدرت اکنون؛ مترجم: مهدی خاتمی؛ تهران، آرنا، 1394؛ در 249 ص؛ شابک: 9786003561373؛با عنوان: آدمی دیگر؛ مترجم: سیامک عاقلی؛ تهران، نامک، 1395؛ در 220 ص؛ شابک: 9786006721583؛ و ...؛یک شب در سال 1977 میلادی در سن بیست و نه سالگی پس از سالها رنج ناشی از افسردگی شدید (تمایل به خودکشی) یک دگرگونی عمیق را تجربه می‌کند. آن شب در حالی که با رنج غیرقابل تحمل افسردگی، از خواب برمی‌خیزد به یک شهود دگرگون کننده دست می‌یابد. او این تجربه را اینطور توضیح می‌دهد: «من نمی‌توانستم خودم را تحمل کنم. ناگهان سؤالی به ذهنم آمد که جوابی برایش نداشتم. این من کیست که نمی‌تواند خودم (سلف) را تحمل کند؟ ناگهان با یک فضای خالی روبرو شدم. در آن لحظه نمی‌دانستم که خود ساخته شده توسط ذهنم- با تمام سنگینی، مشکلات و زندگی کردن یا در گذشته ناخوشایند و یا آینده ترسناک - فروریخته و ناپدید شده است. فردا صبح که از خواب برخاستم همه چیز در صلح و آرامش بود. چون دیگر از خود (سلف) خبری نبود. تنها بودن و حضور را تجربه می‌کردم. تنها مشاهده گر بودم». این احساس ادامه پیدا کرد و او حسی نیرومندی از آرامش را در تمام موقعیت‌های زندگی تجربه کرد. تولی تحصیلات دکترای خود را نیمه کاره رها کرد، و به مدت تقریباً دو سال بیشتر وقت خود را در پارک راسل در مرکز لندن، در حالتی از سرخوشی عمیق به تماشای جهان نشستاکهارت تله (تولی) (زاده 16 فوریه 1948 میلادی در آلمان) نویسنده و معلم معنویِ شهروند کانادا است. او پس از انتشار دو کتاب پر فروش نیروی حال و زمین جدید به شهرت رسید. در سال 2011 میلادی از سوی واتکینز ریویو به عنوان تأثیر گذارترین شخصیت معنوی جهان معرفی شد. در سال 2008 میلادی ستون نویس نیویورک تایمز او را محبوبترین نویسنده کتابهای معنوی نامید. تولی ادعا می‌کند که بیشتر سالهای زندگی اش را تا پیش از بیست و نه سالگی، که دستخوش یک دگرگونی درونی شد، در افسردگی گذرانده است. پس از این تجربه، او چند سال را بدون کار و سرگردان اما در حالت سرخوشی درونی گذراند، و پس از آن یک معلم معنوی شد. بعدتر، او به آمریکای شمالی مهاجرت کرد، و کتاب نیروی حال را در سال 1997 میلادی منتشر کرد. او ده سال در ونکوور کانادا زندگی کرد. تا سال 2009 میلادی تنها در آمریکای شمالی سه میلیون نسخه از کتاب نیروی حال و پنج میلیون نسخه از کتاب زمینی نو به فروش رفته است. در سال 2008 میلادی حدوده سی و پنج میلیون نفر در ده وبینار که با حضور تله (تولی) و اپرا وینفری در تلویزیون برگزار شد شرکت کردند. در حالیکه او از تعالیم مختلف معنوی تأثیر گرفته است اما هیچ دینی را نمایندگی نمی‌کند. ا. شربیانی"}, {"userName": "Stephanie *Very Stable Genius*", "userReviewDate": "Jun 15, 2008", "userURL": "http://www.goodreads.com/user/show/1085121-stephanie-very-stable-genius", "userReview": "I am up at stupid o'clock because my redneck neighbors upstairs are fighting once again. I'm sure whatever it is about, it has nothing to do with \"Now\". It's got to be about something such as, who took who's cigarettes, beer, and baby mama yesterday and what they plan to do to each other tomorrow in revenge. But what they are really doing is ruining my \"now\"......you flippin' ASSHATS! *shakes her fist at the ceiling fan*Anyway......I digress.Eckhart Tolle had an epiphany, or, a complete mental break depending on which side of the spiritual fence you sit on. As a young man, Eckhart was all about the mind/intelligence. During the time he was a student one of his professors, who's mind he admired greatly up and committed suicide - undoubtedly due to the pressure he and others put on him. This puzzled Eckhart. How could such an intelligent person choose to end their life?This he put aside, as we all do, and went back inside his head and his anxieties. Then one night he woke up with an overwhelming sense of dread and anxiety. But instead of taking the same route as his professor took, he heard someone or something say \"accept everything\", and that's what he did. Just then he felt like he was sucked into a void, just nothing at all. When he woke up in the morning everything seemed brand new and fantastic......and he new all the stuff he put in this book.This book is full of good stuff such as....Nothing ever happened in the past, and nothing will happen in the future. Everything that happens only happens right now......so dwelling on it or worrying about it just messes with your head, so try not to do it.If you find yourself in an intolerable situation, you have three options. Remove yourself from it. If you can't do that, change it. If you can't do either, accept the situation completely (at least for now). Because bitching about it does no good.There is more good stuff, so read the book if you want to know.There are also lots of silly new agey terms like \"Pain body\", which is unfortunate since your too busy chuckling to take the serious stuff serious, but I really liked this book and got a lot of good information from it."}, {"userName": "Marcus Knight", "userReviewDate": "Sep 08, 2010", "userURL": "http://www.goodreads.com/user/show/4263343-marcus-knight", "userReview": "This is an awful, awful book. Sorry, there's no other way of putting it. And I can hear people saying already \"but it makes me feel better\".Whatever makes you feel in control, I guess. But sometimes things which make us feel better aren’t necessarily true or even good for us. Tolle and others like him are squarely in the camp of woo (as the great Randi would say!). They promote a watered down and ultimately meaningless new-age theology. (And of course Oprah loves him.) I expected more, but he sits right in there with Deepak Chopra as a prime examples of other equally useless anti-science hokum. I don’t usually torture myself with such media excretions.Tolle is kind of cultish. Worse, he uses scare tactics stating we’re all in some kind of race to obliterate the human ego and the “pain-body” before they destroy the earth. The ‘ticking clock’ once again…horse manure. We are our egos. We hold memories of pain for a good reason–to avoid repeating mistakes. That's how we evolved from our ape ancestors. And all his arguments fall down in exactly the same way as every other new-age guru I've ever read with the classic '3 card trick' as a means of argument:1. \"The Higher Level Card\" (i.e. sorry, it's just over your head). Sorry, but you're just not clever enough to realise Eckhart is cleverer than you, because you're on a lower (less divine/lower psychic vibration) level.2. \"The Projection Card\" (i.e., I know you are, but what am I?). By criticising Eckhart, you are really just criticising yourself, because any problem you see in Eckhart/the world at large is just a projection of a problem in yourself.3. \"The Skillful Means Card\" (i.e., it's all your own fault, idiot!). The most potent card of all. It's not abuse; it's not pathetic or ridiculous or wrong; it's a crazy to wise teaching method. So when Eckhart calls you an idiot, it's not because he's an pompous idiot, it's because you have a idiot-complex that you need to evolve past, and he's here to help you see that!It's just not healthy to read books like this. This dualistic zen-style thinking just doesn't hold water in the real world. Then there's the Eckhart Tolle “walk of death.” Allegedly after listening to Tolle’s Power of Now tapes repeatedly, Brianna Wilkins walked miles without warm clothing (thinking only of the present moment, I’m sure) in the middle of winter and…”Now,” she’s dead.Humans are not broken, they're mostly just confused. We may not know ourselves so well, but we’re operating exactly as nature intended. We’re greedy, competitive, with a short attention span, seeking instant gratification. But we’re also kind, long-suffering, generous, wise, and empathetic–with the two camps always in conflict within each of us. Solutions to human problems will come from realist introspection, critical thinking, rationality and acknowledging of the darkness, e.g. more rationality and less mysticism. We can start that process right here, right now–with our egos and pain-memories intact–not in some future idealised fantasy world. Change won’t come overnight but occurs through an evolutionary process. That’s what else ticks me off about the Tolle: he dresses it up in the conceit of spirituality, but actually panders to the very ordinary materialistic drive towards the “quick fix,” the effortless “new you.” Well, you don’t get something for nothing. Or much for £10! :)Apologies if this is ranty - but this was a terrible, self-absorbed, arrogant, pompous book. Avoid."}, {"userName": "Stephanie Macdonald", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/4363364-stephanie-macdonald", "userReview": "I was excited to read this book. I am drawn to the power of thought, the law of attraction mixed with letting go of the past and living in the moment. I thought this book would further teach about how living in the now is so important, as present moment really is all we have. However the way this book was constructed was poor. The Q & A weren't very helpful as the questions posted weren't even any questions I would have asked and oftentimes his answers were rude... say things like \"you don't understand what I am saying\"... I was like \"Hello, I didn't even say that so why am I reading a chapter on something \"the book says\" I don't understand. By the end it was as if he is saying we should be mindless, thoughtless drones who pay more attention to the leaves of the tree instead of the fact the tree is falling on us about to crush us. He did have several good points, such as not spending so much time worrying and thinking about the things that have already and have not happened yet. We do need to be more mindful of ourselves in the Now... really pay attention to our actions and the kinds of thoughts we have. Once we recognize a harmful pattern we can have the awareness to change those aspects of ourselves. Living in the present is so important, but the way it was written in this book was just not for me, it was simply as if I was being told what to do and any other way is wrong... not a good tone in my opinion."}, {"userName": "Steph", "userReviewDate": "Jun 30, 2008", "userURL": "http://www.goodreads.com/user/show/195981-steph", "userReview": "If you are looking for a self-help book, then go a head and read this one - it may actually help you. Otherwise, don't give it to someone else unless they are already actively seeking self-help/enlightenment advice.Honestly, I couldn't get past the first chapter of this book. An acquaintance gave it to me; apparently he was worried that I wasn't a happy camper. It's closer to the truth to say that he has a bad tendency to try to change people when they don't fit he pre-determined picture of how someone should think, act, and feel. I put it off several times when he asked if I had gotten to read it, but finally broke down after a few months.The book basically reads, to me, as a religious tome, written by the man who plays the Messiah of an atypical religious group - no second coming or new god here, just a set of ideals and beliefs that you should adhere to. He tells you in the first few paragraphs that regardless of who you are or what your situation is, 'your life is terrible and you must change it... and by the way, listen to me, 'cause I have all the answers.' I couldn't give the book much serious thought after that, but I did try. Not my cup of tea in the least."}, {"userName": "Laura", "userReviewDate": "Sep 23, 2007", "userURL": "http://www.goodreads.com/user/show/130991-laura", "userReview": "Another one of those awesome, life-changing books!"}, {"userName": "Andi", "userReviewDate": "May 01, 2007", "userURL": "http://www.goodreads.com/user/show/73904-andi", "userReview": "This book is an excellent guide to shutting of your brain noise. We let our brains run us mad most of the time, and never really stop to enjoy the space we are in. Always dwelling over the past, or fretting about the future. This book points out that the future is 100% unpredictable (so stop making up stories about what is going to happen when you have absolutely NO IDEA) and to stop worrying about the past because no amount of energy devoted to the past will change it. Instead, be in the now; be present - enjoy what you have right in front of you. Experience it, because in one second it is gone, and you will never have the chance to enjoy it again."}, {"userName": "Loy Machedo", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/7118702-loy-machedo", "userReview": "Loy Machedo’s Book Review – The Power of Now by Echkart Tolle.Before I start thrashing the book, let me give you a few interesting facts.•\tThe book was published in the late 1990.•\tInitially around 3000 copies were printed.•\tOprah Winfrey the great influencer recommended this book in her magazine (did she even understand the book?)•\tAfter this debacle, the sales shot up to 3 Million Copies translated into 33 languages. (Its no surprise why every author wants Oprah to recommend their book).So lets start my review. Yes folks, My gazillion dollar book review that may be only 300 people per day may read. The big emphasis is on the word ‘may’.Overview:The author tries to give an explanation into topics like:Life in the Now.Ego & Non Ego EnlightenmentThe Manifested & Not ManifestedTransformation & Just being.(not exactly in that order but that a small nutshell)So that’s about it. Now starts my Book Review.People like Deepak Chopra, Echkart Tolle, Joe Vitale should either be spanked until their bottoms become permanently so sore, that they should never be able to sit on their rear end or they should be hung upside down covered in a pile of stinking poo until they promise never to waste peoples time with their ‘woo-woo’ nonsense. All Echkart Tolle has tried to do is splatter some spiritual words, some hard to define concepts, mixed it up with some logical confusion, lots of mumbo-jumbo, defined and twisted words, peppered it with mysticism, cooked it up with some crack pot experience, sliced it with some anecdotes and repeated the same concept is so many different ways – you will assume you are enlightened in the end, simply because your brains are either fried or numb with nonsense. I mean in a world filled with people who are illogical and confused about the god myth, to the different kinds of gods and different versions of gods, you bring some cocaine induced neutral sounding deep nonsense and the next thing you know – everyone is holding hands, closing their eyes and feeling the warmth of the spirit flow through them – which is nothing but BS!!!I hated the book right from the time I read the first few lines. If you thought Wayne Dyer was nuts and Deepak Chopra was off his Cuckoo, then Echkart is on steroids of Self Delusion. What a bloody waste of money, time and space these people are with their nonsense. I think people should wake up, get real and stop following these woo-woo teachers with their nonsensical philosophies. Personally, he may appeal to a bunch of lost idiots on our planet (and I am sure there are many of them), but I’m sorry, I am not part of that mumbo-jumbo-om-chanting-peace-flowing-spiritual-seeking-delusional-club. I am as real as they get. Period.Overall RatingMinus 10 out of 10.What a bloody waste of time!And if anyone wants to purchase the books from me – PLEASE contact me ASAP!!!Loy Machedoloymachedo.com"}, {"userName": "Steven Walle", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/37850168-steven-walle", "userReview": "Eckhart Tolle is an excellent teacher. He teaches us a simple concept of living in the now and what happiness and blessings can be gleened from this practice. It is a very strait forward teaching but with Tolle's dynamic writing style he brings each page to life for the reader.I recommend this book to all.Yesterday is history;Tomorrow is a mystry;Today is a gift from God.That's why we call it the present.Enjoy and Be Blessed.Diamond"}, {"userName": "susie", "userReviewDate": "Mar 27, 2012", "userURL": "http://www.goodreads.com/user/show/26417-susie", "userReview": "This book came highly recommended on a blog I read, and it was recommended alongside another book in the same vein that I read and loved - so I thought, \"Why not?\" And here's why not: Although the book has a handful of insights and important concepts overall (which you could probably pick up from ANY book about meditation - you know, things about going through life consciously rather than unconsciously, aware of emotions and separate from judgement, accepting of the present rather than dwelling in the past or future) this book is written in the most circuitous, repetitive and bland way possible, using made up buzz words that barely make sense (\"pain body\", \"psychological time\", \"unmanifested\") and the author frequently comes across as short-tempered, pompous and condescending, ie \"I already told you that!\"As the book instructs you to make the use of time you spend waiting (in line, in traffic, etc) to become fully present and aware of yourself, your body and your surroundings as a type of mini-meditation, it also instructs you to be an annoying ass:P.87: \"Next time somebody says, 'Sorry to have kept you waiting,' you can reply, 'That's all right, I wasn't waiting. I was just standing here enjoying myself - in joy in myself.\"This book is also peppered with Bible quotes throughout for some reason, and an extensive intro about how much Oprah loves this guy so you should, too."}, {"userName": "Alex Ristea", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/1669785-alex-ristea", "userReview": "Eckhart Tolle is a fraud and a liar.I read this book because on a fundamental level, I agree with the principles. Living in the now, and not worrying too much about what has happened or what will happen.It’s something that I’ve really come to appreciate through my yoga practice, and has made its way into my day-to-day life. I find myself a happier person that I can simply enjoy whatever I am doing, be it having a coffee on a patio, or being with friends, or even something seemingly benign as grocery shopping. Turning my thinking mind off, and concentrating on what I am experiencing in the present.Anyway, don’t read this book, it’s a waste of time. Most of it is unintelligible mumbo-jumbo.But what really make me mad is the author’s utter disdain for critical and rational thinking. At one point he talks about curing health problems by something silly like resonating your body’s energy frequency or whatever.The question that came to mind is something he actually included (the book is written in a Q and A format).“Is there any scientific evidence to back this up?”His response, and I kid you not ladies and gentlemen: “Try it for yourself, and be the evidence.”Oh boy, shoot me now.Eckhart Tolle repeatedly makes unsubstantiated claims, and shows a clear ignorance of probability, the scientific method, critical thinking, and coming to rational conclusions.Don’t be a sucker. Don’t read The Power of Now."}, {"userName": "peiman-mir5 rezakhani", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/42133960-peiman-mir5-rezakhani", "userReview": "دوستانِ گرانقدر، این کتاب بیشتر حولِ محورِ « اهمیتِ زمانِ حال» و قدرِ هر ثانیه از زندگی رو دونستن، میچرخه ... صدالبته موضوعِ کتاب خیلی خوبه، ولی به نظر میرسه نویسندۀ این کتاب انگار تو این دنیا زندگی نمیکنه، نوشته هایِ کتاب میشه گفت از واقعیت دور بود، از کلّی جملاتِ به اصطلاح پیچیده که زیبا هم به نظر بیاد استفاده کرده و مهمتر از همه، سراسر شعار بود، شعارهایی که بعضاً عمل کردن به اونها سخت و دشوار هستش... به برخی از این جملات در کتاب اشاره کرده و برایِ شما خردگرایان، مینویسمدر صفحۀ 18 میگه: ««کاری را که بطورِ معمول فقط به منظورِ رسیدن به نتیجه ای انجام میدهید، با توجهِ کامل انجام دهید تا خودِ آن کار به نتیجه تبدیل شود، برای نمونه هربار از پله بالا و پایین میروید، به هر گام، هر لحظه و حتی هر نفس با دقت توجه کنید... یا هنگامِ شستنِ دست، به تمامیِ دریافت هایِ حسی مربوط به این کار توجه کنید: صدا و احساسِ آب، حرکتِ دستها ، عطرِ صابون و غیره»».......... خوب، دوستانِ گرامی، به نظرتون این کار شدنی هستش؟! یا اگر میشه انجام داد، آیا همیشه، میشه این کارها رو تکرار کرد؟! تصور کنید خسته از کارِ روزانه، واردِ منزل شده، و جهتِ شستنِ دست و صورت، میرید دستشویی، بعد با دقت به صدایِ آب گوش میدید، سپس به حرکت و در هم رفتنِ انگشتانِ دستتون و کشیده شدن دستها به هم در بینِ کف دقت میکنید... چشمها رو بسته و با آرامشِ خاطر، عطرِ صابون یا مایۀ دستشویی رو میبویید و میگید بَه بَه........ به نظرتون شعار دادن نیست؟ قبول کنید که فقط و فقط شعار و آرنگ هستشدر صفحۀ 107، میگه: ««راه صلیب، راهِ قدیمیِ روشنفکریست، صلیب به بهترین رویدادِ زندگیِ شما تبدیل میشود، به این ترتیب شما به تسلیم، به مرگ و به هیچ چیز بودن و الهی شدن وادار میشوید، راهِ صلیب یعنی روشن بینی از طریقِ رنج، مجبور میشوید دست و پا زنان و فریادکشان وارد ملکوت شوید»» ....... خووووب، دوستانِ خردمند، آخه الهی شدن یعنی چی؟ ملکوت چه چرت و پرتی هستش؟! از ملکوت و راهِ من درآوردی و مسخرۀ صلیب و خدا و این جور خزعبلات و موهومات صحبت کردن و به این خرافاتِ بی ارزش اندیشیدن «روشن بینی» در انسان به وجود میاره؟!!! ... اندیشیدن به مسائلِ خرافی، که زاییدۀ افکارِ بیمارِ موجوداتِ متوهم بوده و همچنین چیزهایی که نه دیده میشن و نه وجودشون قابلِ اثبات هستش، به نظرِ شما دوستانِ خردگرا، روشن بینی رو برایِ انسانها به ارمغان میاره؟ دوستان و عزیزانِ من، خواهشاً به طبقاتِ این زمین و خاکی که بر رویِ آن پای نهاده و ایستاده اید بیاندیشید، نه به ملکوتِ موهوم و طبقاتِ آسمان که نویدِ اون رو عده ای متقلب و دروغگو به شما دادندوستانِ خردمندِ من، در این کتاب با اینکه اصلِ موضوع بجا و درست بود ولی نویسنده فقط و فقط از جملات و کلماتِ به اصطلاح زیبا و آنچنانی و پر زرق و برق استفاده کرده، دوستانِ گرامی، خواهشاً فریب جملات و کلماتی که در بغچه هایِ زرّین و زیبا عرضه میشن رو نخورید، هر زمان در یک جمعِ در حالِ سخنرانی و یا با خواندنِ کتاب هایی که سرشار از این گونه جملات و کلماتِ گِریم شده و یا بَزَک شده هستش، برخورد کرده و با این نوع جملات مواجه شدید،حواستون را شش دانگ جمع کنید، چون بَزَک را در جایی خرج میکنن، که بی محتوایی در آنجا موج میزنهپیروز باشید و ایرانی"}, {"userName": "Jonathan", "userReviewDate": "Jul 11, 2011", "userURL": "http://www.goodreads.com/user/show/1287431-jonathan", "userReview": "The Power of Now is an appealingly written mix of powerful spiritual truths, meaningless babble, and falsehoods. Tolle has taken some good wisdom from the world's religions, dressed it in New Age language, personalized it with his own less impressive wisdom, and then used a powerful personal story* to sell the book.I gave it the second star because it really does emphasize some good aspects of spirituality (especially the freedom of living in the moment). If you already have a good grounding in spritual wisdom, you can probably pick out the good stuff from the nonsense. But if you already know the good stuff, why waste your time on this? And I can see how some uninformed people could be misled. So I really can't recommend the book to anyone. But there are some good things. Here are some examples:The Good: Direct all thoughts towards the present moment. Don't dwell on mistakes of the past or anxiety about the future.Meditation is good.Tap your subconscious for creativity.Self-awareness (being able to observe and reflect on your thinking and emotions as they occur) can be a powerful tool.Our ego gets in our way a lot.The Bad:All spiritual truth can be found inside yourself (he writes quite a long book and does a lot of lectures and workshops for him to really believe that)A number of misleading scientific \"examples\", especially concerning animals and spacetime (pages 24, 34, 99, 137-140)False interpretation of religious texts, especially the gospels (such as pages 95, 101, 105)Promotes belief in reincarnationThe Ugly:\"The pain-body consists of trapped life-energy that has split off from your total energy field and has temporarily become autonomous through the unnatural process of mind identification.\"\"You haven't yet grasped the essence of what I am saying because you are trying to understand it mentally. The mind cannot understand this. Only you can. Please just listen.\"\"In this way, you grow in presence power. It generates an energy field in you and around you of a high vibrational frequency. No unconsciousness, no negativity, no discord or violence can enter the field and survive,\"\"Even a stone has rudimentary consciousness; otherwise, it would not be, and its atoms and molecules would disperse. Everything is alive.\"\"Consciousness is evolving throughout the universe in billions of forms. So even if we didn't make it, this wouldn't matter on a cosmic scale. No gain in consciousness is ever lost, so it would simply express itself through some other form. But the very fact that I am speaking here and you are listening or reading this is a clear sign that the new consciousness is gaining a foothold on the planet.\"* Something I don't understand. In his story, he was utterly despondent and suicidal, then was fixed by a brilliant moment of enlightenment, and woke up in the morning happy and joyful. What does this book have to do with his own spiritual awakening? He seems to say that some people were \"lucky\" and fixed in a moment like him, while others have to work for it. But what makes him the authority on working towards enlightenment, when he's one of the people who didn't have to do it?Also, he is quite egotistical for a spiritual authority. He has a very outsized view of how \"enlightened\" he is compared to everyone else and how greatly the world will benefit from his personal work."}, {"userName": "Jason", "userReviewDate": "Jul 26, 2008", "userURL": "http://www.goodreads.com/user/show/1343925-jason", "userReview": "(orignally written in 2006)Books were a major part of my gift giving this year and, being slightly amazon.com obsessive, I used their gift guides to inform my purchases. The guides provided by magazine editors were especially helpful and despite myself, I bought a hell of a lot of the suggestions from O. When I received the box in the mail, I realized that all of the items I had purchased had intended recipients except for one: The Power of Now.I cracked the binding and read the first line of the introduction: I have little use for the past and rarely think about it.Whoa. In most conversations I have that are about life and how to live it, my lack of interest in the past is a common theme. Matter of factly, I thought to myself, \"Hmmm, I guess I bought this for me.\" I don't consider myself new age-y at all and struggle with the terminology Tolle uses -- it's hard for me to get down with the \"pain-body\" and \"portals\" -- but I do understand the interconnectedness of all things. That this book about the Now found it's way to me now didn't seem \"special\". It just was.The book itself is okay. It's significance for me has been in it's ability to get me to focus more on the spiritual concepts I already believe in even if I don't cotton to the namby pamby language. It affirmed some things. It provided some tools for staying in the moment which, as my work life has changed and become more challenging this year, has been a struggle. I'm not usually one for stress but have found myself stressing more as I adjust to new demands. The Power of Now (and my vacation) have helped calm those tendencies.I'm not a self-help guy and I doubt you will find me grabbing up tomes of spiritual enlightenment often in the future but for the serenity I felt as I closed this book today, I'm grateful.I recommend this if you're willing to check your cynicism at the door. I know. It was difficult for me, too. But, just for this following \"Eureka!\" quote, it is worth it: ...change the situation by taking action or by speaking out if necessary or possible; leave the situation or accept it. All else is madness.Namaste."}, {"userName": "Amany  A A ", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/5190403-amany-a-a", "userReview": "How Many time during the day have you caught you're self lost ? Lost in thoughts , memories or mental dialogues ? What should've happened ? What will happen ? Why didn't I say this ? Or Do that ? how many times have U caught yourself 20 minutes later completely indulged in thoughts and carried away with emotions about things that exist ONLY in your head ? Things that never happened , or happened a very long time ago ? In my case , many many many times !This book will help you to look up , look around and realize how many times during the day you drift to \" unconsciousness \" ,or carry yourself around with absence , almost hypnotized . so lost in your mind that you stop noticing beauty and things for what it is and People for who they are . A life changing book , one that you'll keep remembering your self before reading it and after reading it So deep , so true , so simple , so fascinating that every words resonate within you powerful , vivid and good .and Like many great books the name really does not do it , and where a title like \" the power of now \" may sound like an enthusiastic personL trainer who pushes you around shouting \" now now now ! \" , it's really not that type of books where the author seems to ask you to \" let go of the past \" and \" embrace the life \" and just shower you with all kind of possible clashes oozing Superficiality and unrealistic Attitudes ..Deep philosophy is envolved , understanding for many spiritual act in many religions , clear , coherent and such a deep elightment as best as it can be in a written form"}, {"userName": "Sara Alaee", "userReviewDate": "Aug 01, 2014", "userURL": "http://www.goodreads.com/user/show/3000932-sara-alaee", "userReview": "All I can say is that this is a life-changing book! Truly awesome! Highly recommended to those who would like to improve the quality of their lives by realizing their “Being” through dwelling in “Now”. The past is past and the future is not here, and may not ever come."}, {"userName": "Γιώργος Μπέλκος", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/52190348", "userReview": "Ένα υπέροχο βιβλίο έφτασε στο αναγνωστικό αλλά όχι στο συλλογιστικό πέρας του. Το μέτριο αισθητικά εξώφυλλό του, αλλά και ο τίτλος του παραπέμπουν σε φτηνό -νοηματικά- βιβλίο αυτοεξέλιξης, πράγμα που δεν ισχύει καθόλου. Στο συγκεκριμένο επιτυγχάνεται ένας συγκερασμός γνώσεων υπαρξιακής φύσεως που έχουν ως βάση τους διάφορες σχολές εσωτερισμού. Το καταπληκτικό είναι ότι όχι μόνο δεν αναιρούνται τέτοιου είδους συγγράματα μέσα από τις διαπιστώσεις της σύχρονης επιστήμης, αλλά επιβεβαιώνονται ως θεματοφύλακας παρελθούσας γνώσης που στο παρόν πλέον επαληθεύει την αξία της και πειραματικά (βλ. κβαντομηχανική). Από τα ελάχιστα βιβλία που η ανάγνωση δεν απευθύνεται στο νου αλλά καταφέρνει να διεισδύει στα ενδότερα της ανθρώπινης υπόστασης και να την συντονίσει με το ευρύτερο υπαρξιακό της πλαίσιο. Κεντρική ιδέα στο βιβλίο είναι η δύναμη του Τώρα ως μοναδική πύλη προς «Είναι, όν». Η ιδιότητα του παρατηρητή στο τώρα είναι αυτή που απαγκιστρώνει τον κίβδηλο εαυτό από το παρελθόν και το μέλλον. Το πρίν και το μετά είναι που δίνει υπόσταση στη ληθαργική ξεχωριστότητά του εαυτού, κάνοντάς τον να νομίζει πως αντλεί την αξία του από αυτή τη σχέση (παρελθόν, μέλλον). Ο συγγραφέας προσεγγίζει το θεμα ακραιφνώς, με προσήνεια απέναντι στον αναγνώστη, απαλλαγμένος από ιδεοληπτικούς ψυχαναγκασμούς."}, {"userName": "Katie Bananas", "userReviewDate": "Dec 25, 2016", "userURL": "http://www.goodreads.com/user/show/29868756-katie-bananas", "userReview": "After having read this book, I think it qualifies to be read multiple times. It really provides good essential tips to relax and just let go. I never really understood what letting go of emotions and feelings, past and future and living the moment. It's a pure mind declutter along with the Holy Book of your belief. The author is well researched and knowledgeable of the religions and beliefs, which made it so much easier to associate with what he was explaining throughout. It made so much sense to just read through it and think of the moment. I thought it was really good in the explanations of the roots of certain common behaviors and emotions as you lash them out or enjoy them along with their psychology. Reading it multiple times would provide a cleanse and clearer perspective to certain aspects of daily life. Very informative and impactful."}], "description": "Eckhart Tolle's message is simple: living in the now is the truest path to happiness and enlightenment. And while this message may not seem stunningly original or fresh, Tolle's clear writing, supportive voice and enthusiasm make this an excellent manual for anyone who's ever wondered what exactly \"living in the now\" means. Foremost, Tolle is a world-class teacher, able to explain complicated concepts in concrete language. More importantly, within a chapter of reading this book, readers are already holding the world in a different container--more conscious of how thoughts and emotions get in the way of their ability to live in genuine peace and happiness.Tolle packs a lot of information and inspirational ideas into The Power of Now. (Topics include the source of Chi, enlightened relationships, creative use of the mind, impermanence and the cycle of life.) Thankfully, he's added markers that symbolise \"break time\". This is when readers should close the book and mull over what they just read. As a result, The Power of Now reads like the highly acclaimed A Course in Miracles--a spiritual guidebook that has the potential to inspire just as many study groups and change just as many lives for the better. --Gail Hudson", "title": "The Power of Now: A Guide to Spiritual Enlightenment", "url": "http://www.goodreads.com/book/show/6708.The_Power_of_Now", "average": 4.12, "cover": "https://images.gr-assets.com/books/1386925535l/6708.jpg", "reviews": 6170, "authors": [{"url": "https://www.goodreads.com/author/show/4493.Eckhart_Tolle", "name": "Eckhart Tolle"}], "type": ["Nonfiction", "Spirituality", "Self Help", "Philosophy", "Psychology"], "outlinks": ["http://www.goodreads.com/book/show/6708.The_Power_of_Now", "http://www.goodreads.com/book/show/11371058", "http://www.goodreads.com/book/show/18366082", "http://www.goodreads.com/book/show/582248.Power_of_Now", "http://www.goodreads.com/book/show/2021966._", "http://www.goodreads.com/book/show/22606064", "http://www.goodreads.com/book/show/6512869-the-power-of-now", "http://www.goodreads.com/book/show/76334.A_New_Earth", "http://www.goodreads.com/book/show/6709.Practicing_the_Power_of_Now", "http://www.goodreads.com/book/show/67864.Stillness_Speaks", "http://www.goodreads.com/book/show/6389355-guardians-of-being", "http://www.goodreads.com/book/show/6716.Realizing_the_Power_of_Now", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}