{"ratings": 496, "userreviews": [{"userName": "Julieta", "userReviewDate": "May 03, 2009", "userURL": "http://www.goodreads.com/user/show/1939519-julieta", "userReview": "\"The top two reasons for happiness are gratitude and giving.\" That was my favorite lesson from the book.This is a good, common sense book for people who need to feed their head with positive self-help types of reading."}, {"userName": "Steven", "userReviewDate": "Aug 12, 2014", "userURL": "http://www.goodreads.com/user/show/3234932-steven", "userReview": "This book was worth way more than the $1 I paid for it. The author has renewed a dream of mine and enlightened me on the importance I play in the life of others whether it be to guide them or they guide me. It truly is a blessing to be able to give to others."}, {"userName": "CharityJ", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/1449396-charityj", "userReview": "The saying \"It's all who you know\" is what this book is all about. Despite being several years old and targeted to the business crowd, there are still lots of takeaways for everyone else. The writing style is approachable and conversational and the author draws on lots of personal stories from his experience to illustrate ideas. At its core it's a book about figuring out what you really want to do, how to achieve it and how to build a core group of people who can help you do it. Includes lots of tips on making a good impression in interviews as well. Not too long and very readable. Recommend for graduates, anyone looking to build their network and anyone wanting to do what they love."}, {"userName": "Scott Wozniak", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/5185619-scott-wozniak", "userReview": "This is a solid book about how to identify who is your inner circle and how to work with them to help each other succeed. It challenges us to stop networking and build real friendships, that you can't do that with lots of people but you don't need to--your \"few\" are enough.It's a good book. But it's not very specific on how to get into a new field that you don't already have connections into, so if your inner circle isn't connected where you want to go, this book isn't helpful. That's a huge enough gap that I dinged it a couple of stars. There are people who really don't know the people they need help from."}, {"userName": "Anna", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/1251636-anna", "userReview": "Recommended to me by a friend, I approached this book with some trepidation, as I don't really go for \"do it this way\" kind of books, especially ones that seem to be \"name it and claim it,\" as this one did. As I read, I found that I already live my life much in the way he describes, without the specific labels that he designates. It was mostly common sense, really, but some of the things he said were encouraging and caused me to think a little differently. It didn't change my life or anything, but it did serve as an affirmation to keep going the way that I am."}, {"userName": "Sarah Kleinwechter", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/5218276-sarah-kleinwechter", "userReview": "This book was very timely for me as I'm beginning my career and it really helped me re-frame my ideas about how I approach my job search. I'm very thankful to have read it when I did, and it's something I plan on revisiting in the future."}, {"userName": "Latasha", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/3155533-latasha", "userReview": "This is mostly for traditional business people looking to find jobs but it’s still pretty useful for anyone who runs their own business or contracts with businesses."}, {"userName": "Evette", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/10600070-evette", "userReview": "Great book; clarity and specificity on how to build your own network!"}, {"userName": "Leslie Shreve", "userReviewDate": "Jun 07, 2016", "userURL": "http://www.goodreads.com/user/show/56383748-leslie-shreve", "userReview": "Who should read this book? Anyone who participates in traditional networking and has questioned it as a means to reach their dreams, advance their business or achieve their goals. Here 19s what you can learn from this book:1. You can unleash the power of your existing relationships and learn how to build on them for a more successful business or life.2. You can discover and define the circles in your 18Who 19 world: Fans, Acquaintances, Advocates, Allies, your 18Who 19 Friends and your Inner Circle. Then discover how these connections can be instrumental in helping you reach your goals.3. You can learn how to cultivate, multiply and invest in your 18Who 19 world in order to market yourself better than ever.This book was great for answering the question of whether or not your local, traditional networking is paying off. The author states, 1CTake everything you have ever heard or learned about networking and just throw it out 26 Networking as we know it is crap. It doesn 19t work! 1D That 19s an interesting and bold statement to make, so if you think you might agree or you 19ve frequently thought about marketing yourself differently, then pick up this book and take a look. You may find that you already know everyone you need to know in order to move your business and your life forward successfully."}, {"userName": "Wyndy", "userReviewDate": "Jan 02, 2009", "userURL": "http://www.goodreads.com/user/show/1819740-wyndy", "userReview": "The main theme of the book is that old-fashioned networking is just that, \"old-fashioned\". You already know all the people who are going to help you accomplish your personal dream whether that includes a new job or not. People help people that they know. Mr. Beaudine is a man who places executives for a career, therefore, most of his examples are in the job obtaining category but his knowledge overlaps into any area where you have a dream. I must admit that for the first couple of chapters I felt like I was in Whoville with Dr. Seuss, Mr. Beaudine does use the \"Who\" factor a lot but once I was used to it, the annoyance disappeared. He uses many illustrations that make perfect sense like the character of Jimmy Stewart in \"Its a Wonderful LIfe\" who ended up asking his enemy for advice rather than his friends. Or the person who used a reference in a resume who mis-pronounced his name when called. Not exactly a \"good\" reference. His statement that \"Everyone has a \"WHO\" network, a community of friends\" really sums up the theme and he expands on this theme throughout the whole book. I found that this book had some really good information for someone who was wanting to find a new position or look for ways in which to accomplish their dreams. Information on a source that is often overlooked by everyone. 4 stars"}, {"userName": "Shaun", "userReviewDate": "Jul 11, 2012", "userURL": "http://www.goodreads.com/user/show/1031189-shaun", "userReview": "This is a motivational book and it motivated and inspired me. The author is a recruiter in the sprots and entertainment industry and is highly successful. This is a book about self-improvement and networking. The author shares a key point about networking, and that is that you already know who you need to know to help you network to reach your career goals and dreams. He tells you to throw away all you've heard up to now about networking. You need to network with your \"Who\" group or those people who truly know and love you. They will want to help you reach your goals and dreams unlike a stranger who you networked with on a bus or at a career fair. He's big on creating \"The 40 List\", which is a list of goals, dreams and aspirations, kind of like a bucket list. He says this list should be changed and updated frequently as you accomplish things and as you develop new goals, dreams and aspirations. I gained some excellent wisdom and insights through reading this book and I plan to read this book again for further motivation and inspiration."}, {"userName": "Khalid", "userReviewDate": "Dec 07, 2009", "userURL": "http://www.goodreads.com/user/show/2848781-khalid", "userReview": "Bob Beaudine believes “Networking” is an importuned factor neglegted in the American workplace. Beaudine is a well-connected head hunter and in this book he shares his philosophy on what really works in identifying what your dream in life is and how to get it. With his unique 100/40 principle, Beaudine takes the traditional networking concept, shakes it up and rebuilds it, explaining that individuals already know everyone they need to know. He shows readers that they have established a powerful network simply by interacting with people in their daily lives. Beaudine explains this new way to achieve dreams clearly, in a step-by step fashion using his well-tested knowledge to break it down and help readers tap into the Power of Who. Shahid highlighted that the essence of this networking and friendship building is the trust and sincerity of the relationships."}, {"userName": "Chris Munson", "userReviewDate": "Aug 15, 2012", "userURL": "http://www.goodreads.com/user/show/11867959-chris-munson", "userReview": "A great book about how to network using the people that you already know. The premise of the book is a simple one...you already know everyone that you need to know in order to achieve your dreams. Whether it is finding a new job, linking up with someone who can help you start your own business or someone that can provide you with expert advice in how to run your life...you already know someone that knows someone that can help you. A fairly quick read, but contains very valuable advice. The chapter about your Personal Board of Directors was pretty eye opening and probably worth the price of the book. Beaudine also does a good job of reminding us how powerful lists can be in our life. Overall, highly recommended for anyone that is looking to make a change in their life and is going to need the help of others to accomplish it."}, {"userName": "Stephanie", "userReviewDate": "May 26, 2011", "userURL": "http://www.goodreads.com/user/show/2542657-stephanie", "userReview": "If you are job hunting, know exactly what you want to do, thinking about making a change in your career, or are not specific about what you want to do- read this. Broad premise: your friends & family want to help you succeed- who do they know that can help you? Beaudine's experience in executive search has revealed most people under utilize personal connections- we tend to network with total strangers rather than ask a friend for help. In addition to that, are many other valuable insights and practical advice about career in this book. I recommend this for everyone 18 & up- I'm better off for reading it."}, {"userName": "Nic", "userReviewDate": "Aug 25, 2011", "userURL": "http://www.goodreads.com/user/show/4826510-nic", "userReview": "I started off scanning the first chapter, but then it caught my interest and so I began to read it word for word. This book is a motivator. It helps you begin to think of th people you already know in a different way. I have to agree with most everything Bob wrote - people are willing to help you if they know what you are trying to do and they already know and like you. I agree, spend more time focusing on people with whom you already have connections with than trying to meet more people for the sake of knowing more people. Much of what is written is Biblically based as well. The ancedotes used were nice to read too. Overall good book for something that makes perfect logical sense."}, {"userName": "Adam", "userReviewDate": "Mar 29, 2010", "userURL": "http://www.goodreads.com/user/show/3387371-adam", "userReview": "A good concise strategy to decide on a goal and pursue that goal with precision and focus. More importantly Beaudine explains how the Who you know is a key part of getting to the goal. By that he means who you really know on a personal level; not byway of online connections or resume/business card dumps. A good deal of touchy feely type stuff that reminds me of that SNL spoof....\"you're good, you're smart and dog-gone-it people like you\" However, with that sugary encouragement aside it is a helpful book."}, {"userName": "Rick", "userReviewDate": "Jan 01, 2014", "userURL": "http://www.goodreads.com/user/show/7213786-rick", "userReview": "There's a better way than going to events and \"networking\" with people who only care about what they can get. You already have people in your corner. I thought Bob's message was a little trite at first, but he's right. Even if you don't have a vested relationship with one who can directly open a door, they might know a person who can and will because your friend will be a genuine advocate. Bob gives great advice about interviewing and even finding a spouse. One of the best career (and life) books I've ever read. A great accompaniment to Adam Grant's Give and Take."}, {"userName": "Kyle", "userReviewDate": "Jan 18, 2012", "userURL": "http://www.goodreads.com/user/show/3700578-kyle", "userReview": "Very fast and engaging read. A new way to think about your network and the people in your life. I liked it because it is more my style of networking which feels more genuine and is more about building relationships and friendships rather than schmoozing or using the other, to borrow from another book, \"personality ethic\". I'm all about the character ethic and the sincerity that comes from having a relationship that can lead to an opportunity because of people caring about each other. And I love how he talks about pursuing your dream. Very inspiring."}, {"userName": "Barry Forrest", "userReviewDate": "Jun 16, 2014", "userURL": "http://www.goodreads.com/user/show/32297893-barry-forrest", "userReview": "This one was a game changer for me and many of my software friends. People intrinsically want to help other people and if you don't tell your friends and acquaintances (Who) the things that you want to do (What), then you are depriving them of an opportunity to assist you in reaching your goals and living your dreams. Just mentioning what you hope and dream of, without specifically asking for anything, can open doors for you by connecting you with either like minded folks or people who can actually further your progress. Amazing."}, {"userName": "Jeffrey", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/4303225-jeffrey", "userReview": "Powerful insights for you and your careerI really enjoyed this book, much more than I ever expected. Relying heavily upon examples and anecdotes, it showed how the power of your existing relationships, and taking care of those already in your circles can lead to greater success. This is one of the few books where I (1) shared examples with my bride; a sign the book resonated with me. (2) Made me want to buy copies for friends and acquaintances. And (3) gave me an insight I was able to apply the very next day."}, {"userName": "K.M. Carroll", "userReviewDate": "Nov 14, 2015", "userURL": "http://www.goodreads.com/user/show/8782447-k-m-carroll", "userReview": "I've been nibbling at this book for days, because there's so much good stuff here. It boils down to \"help your friends, be kind to everyone, and help other people get what they want.\" Apparently those simple things have huge, huge ramifications in business and personal life alike--they bring about success.This book and Linchpin, by Godin, both have a similar premise--do unto others as you would have them do unto you. Kindness. Generosity. Going the extra mile. Give and don't expect anything in return. Such simple ideas, so hard in practice, so revolutionary in our selfish world."}, {"userName": "Jason Denison", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/31253584-jason-denison", "userReview": "First book of the new 2012 year and by far one of my favorites. I highly recommend it to anyone. Anyone who is a human being, male or female, should read this at least once. It has some vital stuff that can impact your life in a very positive way both in business and in your personal arena. Bob reads the book on Audio and is a joy to listen to. You feel as though you are getting the undivided attention of someone that has much to teach you. I can't recommend it enough! Read it, listen to it, get it into your everyday life one way or another!!"}, {"userName": "Troy", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/5884074-troy", "userReview": "Decided to read this book again, needed a refresher on the point of the book. Wish there was not soo much negative attitudes about networking. Really helpful book. Makes you want to help others achieve their dreams, hopefully by doing so achieving yours. Since the first time I read this book I have become more altruistic. Since losing my job and career two years ago, seen that as much I could use networking and a help out. There are just others out there who needed my help more."}, {"userName": "Madison Mcgraw", "userReviewDate": "Jan 22, 2009", "userURL": "http://www.goodreads.com/user/show/1171692-madison-mcgraw", "userReview": "The Power of Who is a book filled with the same business lessons we've been taught before, but Beaudine puts his own short spin on it. A quick read, a feel good read. A book to buy for college grads or perhaps, in this economy, as a 'pick me up' for people recently laid off who might need a little inspiration. My favorite part of the book was Charlie the shoeshine man at the Philadelphia Airport. If only the world had more Charlies!"}, {"userName": "Lela Fagan", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/17020122-lela-fagan", "userReview": "I highly recommend this edition of \"The Power of Who: You Already Know Everyone You Need To Know\". I purchased the audio book edition at Audible.com. It was recommended to me because of my previous purchases. This edition is narrated by the author Bob Beaudine. By using anecdotes Mr. Beaudine's gives practical instruction on how to empower the people in your network and identify those that are your \"Who\"."}, {"userName": "Carolyn Gomez", "userReviewDate": "Sep 04, 2011", "userURL": "http://www.goodreads.com/user/show/6109074-carolyn-gomez", "userReview": "There were some good solid gems in this book, but the first couple of chapters felt like fluff. This book is not just about the Power of Who - building your network.... but more of a compilation of wise advice on various personal and professional topics. I had higher hopes for the book based on the other reviews that I read. The book wasn't terrible, but in my mind, it was just ok."}, {"userName": "Claudia", "userReviewDate": "Oct 26, 2009", "userURL": "http://www.goodreads.com/user/show/1355290-claudia", "userReview": "This book is a great reminder of everything we already know. It's an easy read and for those that need nudging to start doing what they've always dreamed of; it provides good structure and discipline. I'd recommend it if for nothing else, to remind you that it's never to late to start living your life"}, {"userName": "Fullfaun Faun", "userReviewDate": "Aug 28, 2015", "userURL": "http://www.goodreads.com/user/show/2749114-fullfaun-faun", "userReview": "really great. Lays out the 5+ circles of friendship.Starting with your Best Friend and 2 next closest friend, the family is next, then friends, the Advocates, then Acquaintances. Not everyone is a true friend, or even a close friend."}, {"userName": "Sherry", "userReviewDate": "Jun 21, 2010", "userURL": "http://www.goodreads.com/user/show/911969-sherry", "userReview": "Although a bit repetitive in syntax sometimes, this book is a fabulous read to remind you of what is most important in life: other people, giving and gratitude. Keep this in mind, and you will be most happy and fulfilled, not to mention successful in business."}, {"userName": "Brian", "userReviewDate": "Jul 31, 2010", "userURL": "http://www.goodreads.com/user/show/4091412-brian", "userReview": "Very Good; Dream big and reach your full potential"}], "description": "Bob Beaudine believes Networking is Not working for Americans any longer. This highly respected and well-connected head hunter shares his philosophy on what really works in identifying what your dream in life is and how to get it. With his unique 100/40 principle, Beaudine takes the traditional networking concept, shakes it up and rebuilds it, explaining that individuals already know everyone they need to know. He shows readers that they have established a powerful network simply by interacting with people in their daily lives. Beaudine explains this new way to achieve dreams clearly, in a step-by step fashion using his well-tested knowledge to break it down and help readers tap into the Power of Who.", "title": "The Power of Who: You Already Know Everyone You Need to Know", "url": "http://www.goodreads.com/book/show/6594067-the-power-of-who", "average": 4.03, "cover": "https://images.gr-assets.com/books/1328328607l/6594067.jpg", "reviews": 50, "authors": [{"url": "https://www.goodreads.com/author/show/1503384.Bob_Beaudine", "name": "Bob Beaudine"}], "type": ["Business", "Self Help", "Nonfiction", "Leadership"], "outlinks": ["http://www.goodreads.com/book/show/6594067-the-power-of-who", "http://www.goodreads.com/book/show/3553827-the-power-of-who", "http://www.goodreads.com/book/show/10530421-the-power-of-who", "http://www.goodreads.com/book/show/29434864-2-chairs", "http://www.goodreads.com/book/show/21119775-the-power-of-who-workbook"]}