{"ratings": 27686, "userreviews": [{"userName": "Miranda Reads", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/71848701-miranda-reads", "userReview": "In the main series, Queen Amberly is the epitome of poise, grace and love...BUT back in her day, she was quite the feisty girl (well, kind of) (okok, not really)I mean, she did shock the entire world  when she (a lowly Four) won the Selection and was granted the honor of marrying Prince Clarkson. But as far as being fiesty (or at the very least...interesting)? Nope. Nada. Zilch.When we read her own story, every bit of magic and love fizzled out - like a firework on the fifth of July. Nothing special, nothing wondrous and ultimately, a bit sad. \nFor as harsh as his words were, his voice seemed to caress my name.\nIt was depressing to watch this young girl so easily fall prey to the manipulative, cruel prince. When he finds out that Amberly was poisoned in her home country (air quality, etc) - he recoils in horror  at her infertility and her diseased body. And yet, as much of a victim Amberly is...I still couldn't stand her.  She chose her life. She lets Clarkson be her everything right away - no independent thinking, no attempt to assert herself. \n“His world looked like a storm. I was going to be its center.”\nShe's chosen not for her love, or for her looks...merely because she's willing to obey Prince Clarkson's every whim. He swears her to secrecy? She doesn't tell a soul. He tells her to cut her hair? She lobs off nearly a foot. He says to jump, and she's already jumping. \nBecause if it was a choice between him or me, I didn't think I'd be able not to put him first. He was the prince, and his life was invaluable to the country. But more than that, it was invaluable to me.\nThank goodness this one was short - I don't think I could've handled much more of it.Audiobook CommentsOkay, in Book 1 - Queen Amberly didn't have an accent but her sister had a strong southern twang (since they were Fours from the south). In this one, Amberly is said to be from Honduragua and has a fittingly strong native accent from that area. So, how did Amberly have a native Honduraguan accent while her sister is a southern belle? Somebody didn't plan out the audiobook too wellllllll....."}, {"userName": "Bookaholic (reads every mortal thing)", "userReviewDate": "Dec 09, 2014", "userURL": "http://www.goodreads.com/user/show/25058068-bookaholic-reads-every-mortal-thing", "userReview": "What the shit is this?This was supposed to be a heartfelt tale of how Maxon's mom, Amberly, went on to win the Selection and become Queen. Keyword: \nsupposed\n.This is not a love story; its a portrayal of an unhealthy relationship. Maxon's dad (he shall hereby be referred to as M'sD as I didnt bother to remember his name and I don't care enough to check) is one of the most assholic son of a bitches I have ever read about and Amberly is not only a human doormat, but also the most naïve idiot I have ever come across-\n\"From now on your only job is to show up, be a lady, sit there, and smile.\"[M'sD's mom] eyes met with mine as she ended her speech, and, stupidly, I thought that was a command. So I smiled. The queen was not amused...\nReally, Amberly? Really?And I mean it when I say they had an unhealthy relationship comment. M'sD shrivels up his face in disgust when he hears about the deformities people get in Amberly's hometown, and makes Amberly's feel extremely shitty when she finds out that she is infertile. And Amberly, naturally, curls up in a corner, weeps about how ruined her life is now that she can't make little demons with M'sD and laments about how it's all her fault. And I wish I was kidding, but that's exactly how it went."}, {"userName": "Laura", "userReviewDate": "Nov 06, 2014", "userURL": "http://www.goodreads.com/user/show/8429172-laura", "userReview": "|3.8 stars|This is going to a be a really short review.Overall I really enjoyed this novella and I was so curious about Queen Amberly but I just didn't feel like the book gave her the credit she deserved. Or maybe she didn't deserve so much after all and everything was in our heads? See? That's not right, so the book didn't do it for me. I wanted to know more about her.But can we talk about how Amberly was so like America? I mean, that makes it all worse because America was literally the little girl she could never have. Man, that was pretty hard.And if we're going to talk about freaking sad moments in this novella: “I respect him,” I defended. “He’s the prince.”“It’s more than that. You’d take a bullet for him if you had to.”I didn’t answer.Bad Kiera, bad.I still don't know what to make out of Clarkson, really. I mean, in this story he didn't seem to be that bad at all and yeah, I could see where he was coming from but still. He was way too much of an asshole to me to just forgive him like that.Anyhow, Amberly, you deserved so much more, darling. A lot more."}, {"userName": "Carol [Goodreads Addict]", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/10717098-carol-goodreads-addict", "userReview": "The Queen is #0.4 in The Selection series by Kiera Cass. It’s no secret how much I am in love with this series. I have been from the start. This little novella explains so much as to what made King Clarkson the man we know him as. It is the story of the previous Selection, when Queen Amberly met Clarkson while he was a Prince choosing his own future bride.\n Even though we get a good look at Clarkson’s own parents, the current King and Queen and their very dysfunctional relationship, I still have a little trouble putting that Clarkson together with the one that so brutally beat Maxon. \n“This was joy. This was love. So many words you hear about or read about, and now…now I knew them.”\nAmberly was clearly smittened with Clarkson before she even met him. But were the reasons Clarkson chose her for love, or just because she was submissive to him? \n“You’re soothing. I’m desperate for peace. I think you might be the only chance I have at that.”,/i>\n The Amberly we meet, though, is every bit the poised woman and future Queen we know her as. \n“You will be the only thing in this world that is truly mine. And I will put you on a pedestal so high, it will be impossible for anyone not to adore you.”"}, {"userName": "Veronika", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/13801365-veronika", "userReview": "UPDATE: Well, I kept putting this aside because I was afraid of it, as I mentioned. I mean Clarkson is a terrible person and how could I like someone who I know will hurt his son in the future? Here's the answer: I couldn't. And Queen Amberly creeped me out a bit too. I mean with America and Maxon the whole Selection didn't feel this... gross. Queen Amberly seemed like such a lady in The Selection but now I can't help seeing her like a submissive little girl. I have no idea why anyone would find a control freak crush worthy... no, just no. Oh my god we could see how Queen Amberly was before she became the Queen of Illéa she was so amazing in the books and I can't let go of this series just yet. But... what if the king wasn't an ass back then what if I actually start to like him? (sigh) No matter what I'm still going to read it, I can't let go of this series just yet... UPDATE: It says december 2nd which means... we have to wait 6 months to read this!I can't... I just can't."}, {"userName": "Maggie", "userReviewDate": "Jul 26, 2016", "userURL": "http://www.goodreads.com/user/show/51318038-maggie", "userReview": "“You’ve kept my secrets, and I assure you, if you marry me, there will be scores more to keep. You don’t judge me, or seem startled by much. You’re soothing.” His gaze traveled up to my eyes. “I’m desperate for peace. I think you might be the only chance I have at that.”\nI mean, I can see why King Clarkson was an actual jerk face in The Selection. He didn't like America, and he didn't like some of the girls. I'm pretty sure he got that from his mother, but pretty sure his attitude comes from his father. Even though the King and Queen before Clarkson and Amberly were mentioned like once (I think) in The Selection, there wasn't much said and nothing was needed. When Clarkson was a prince, he actually seemed nice and showed that he cared about the girls just like Maxon did! The difference is that Clarkson never smiled, never tried to laugh, and only smirked or showed half a grin once or twice. But suddenly Amberly is able to bring him peace and is able to do the things he's been waiting for: keep his secrets, bring him peace, and not act like a spoiled brat like the other selected girls.The Selection was not my favorite series. My favorite was definitely The One even though it had many flaws. I couldn't help but rate it a 5 just because it had more improvements and a lot of actual, shocking moments happened. I can see how The Selection came and was born from this, only being told from Queen Amberly's point of view. It's not like America where America doesn't want to enter the Selection and doesn't really care about marrying Prince Maxon, but Amberly has been in love with Clarkson since she was 7 and has wished to marry him, kiss him, have his arms wrapped around her, and yeah all that. Even though The Selection and The Prince are very different, Queen Amberly and America were different when they were selected, it makes sense as to why and how Kiera wrote the series. Queen Amberly has always been the loving and supporting Queen since introduced in the beginning. King Clarkson was known as someone who hardly smiles and pushes everything too hard, too much, and too far. Even though Amberly was the only one to lit his eyes and his world, I can see why he was an asshole. I never liked him, and never wished to try and like him. Luckily I didn't. But I understand why he acted the way he acted in the series and why. He had his reasons, mainly his parents to blame for since they were arguing and both were rude. Even though his mother was rude and would sometimes spoil herself and brag a little because she's Queen, Clarkson was easily able to catch her horrible personality and attitude. Nothing was really new, just made sense to the history of the beloved Amberly and Clarkson Schreave. It was interesting reading this and now I just want to know if Maxon really is Amberly's son. HA. HA. HA! Even though Amberly was told she may or may not be able to have children, there was still a possibility it was wrong. With that, I actually want to know how everything worked out and how Maxon was born. Not in the wrong way, I just want to know if Amberly took medication for this or if treatment was needed. If nothing was wrong, I want to know how it all worked out. Even though nothing was new and everything felt the same, there are still questions I have unanswered, but I guess it doesn't matter."}, {"userName": "Sarah", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/7591340-sarah", "userReview": "[ reading it knowing that Amberly and Clarkson are both now dead ☹  (hide spoiler)]"}, {"userName": "Julia", "userReviewDate": "Sep 06, 2014", "userURL": "http://www.goodreads.com/user/show/18979519-julia", "userReview": "Conclusion: King Clarkson has always been a huge asshole and Queen Amberly has always been a sweetheart."}, {"userName": "Thomas June", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/20500289-thomas-june", "userReview": "KIERA CASS, ARE YOU SERIOUS!?I THOUGHT AFTER YOU'VE FINISHED THE ONE, THATS IT!!NO MORE, NO EXCESS!!BUT I CAN'T CONTAIN MY FEELS WHEN I SAW THIS, THIS EFFING GORGEOUS NOVELLA WITH AN AMAZING COVER.!!!!OHHHH KIERA, NOW WHAT HAVE YOU DONE!!! YOU PUT ME INTO ANXIETY!!!! I'M EXCITED!!!*hyper-ventilates*"}, {"userName": "Ro", "userReviewDate": "Dec 18, 2014", "userURL": "http://www.goodreads.com/user/show/28984423-ro", "userReview": "Había preferido no hace reseña en Goodreads, pero al ver tanta gente amando este libro, no me puedo contener...Para empezar, Amberly es una compelta idiota. Sumisa, sosa y estúpida; se enamoró del príncipe por la tele y está dispuesta a lamerle las medias con tal de que le sonría ¡por favor!Amberly se la pasa llorando porque no puede tener un **** bebé, echándose la culpa de todo. ¿Qué acaso no se da cuenta de que ella no tiene la culpa de su decendencia? ¿Que en todo caso sería culpa del estado, por hacerla beber la maldita agua contaminada? UfffffY encima está colada por el príncipe Clarckson, que casualmente es idéntico al príncipe Maxon. Y no, no lo pude amar como a su hijo, porque sabía lo que haría después con él. ¿Qué le estaba pasando por la cabeza a Kiera para pensar que podríamos amar al hijo de puta que castigaba a Maxon?¡Sorpresa! Resulta que Clarkson también está pasando por una situación familiar horrible, con sus padre peleándose y su madre borracha, etc, etc, etc. TODO ES SÓLO UNA COPIA DE LA HISTORIA ORIGINAL. Qué coincidencia que ambos príncipes tengan la misma personalidad y los mismos problemas familiares ¿no?Y por si no pudiera odiar más a los personajes principales, resulta que los secundarios apenas tienen dos o tres líneas. No me sé el nombre de ningún personaje además de los principales porque no aparecían más que en un párrafo y porque me traían sin cuidado. ¡¡¡¿QUÉ NO LO VEN?!!!!!! CLARCKSON ES MAXON Y AMBERLY ES AMERICA. (eso iba dirigido a las fans de este libro).Y Kiera Cass podría haber aprovechado esta idiotez de libro poniénole más historia de Illéa. No sé. Podría haber puesto que las cosas antes eran un tanto diferentes o lo que fuera, pero todo se mantuvo exactamente igual.¿Y saben qué? ¿Saben la taradez que sucedió al final? Después de estar juntos como por dos horas, Clarckson de repente elige a Amberly para casarse con ella. No le importa que sea una idiota, no le importa que no pueda tener bebés, no le importa que apenas la conoce, simplemente le dice que la elije. ¿Saben por qué la eligió? Por ser la más sumisa. Por ser la que le haría caso pasase lo que pasase (no me lo estoy inventando, son palabras textuales del libro). Y Amberly feliz a más no poder por ser así de utilizada...Por lo que no es una historia de amor ¡¡no!! Es una historia machista de obediencia y sumición.Encima de toda esa mierda, hay algo que no me cierra: ¿por qué Clarkson elegiría a Amberly si no pueden tener herederos? Si no era por amor (como quedó bien claro) el matrimonio fue por conveniencia. Y entiendo que Amberly sea la más obediente ¿pero no le preocupó el hecho de no tener descendientes?. No es algo tan importante para una pareja normal, pero sería lo más coherente que un futuro rey quisiera tener su reinado y el de su familia asegurado.¿O sólo quería sexo salvaje sin condón?Sinceramente no lo sé. Y os juro que este libro me frustra mucho.Tiene buena pluma y se lee rápido, esas son las únicas razones por las que no le pongo al libro una estrella.Con esta reseña sólo espero hacer entrar en razón a los que amaron este libro. Sé que cada uno tiene sus opiniones y todo ese rollo, pero, chicas, nos la pasamos luchando siglo tras siglo para los derechos de las mujeres, para la igualdad de género, ¿y nos dejamos degradar por un libro así?Porque básicamente Kiera Cass nos pone a las mujeres como una máquina de hacer bebés obediente que sólo está para complacer a su marido. Y me niego a ser eso. Me niego a volver al siglo XVIII, me niego a que aunque sea en un libro de mierda volvamos a ser utilizadas así.No es romance, no es acción, no es misterio, este libro no es nada. Ni siquiera se puede decir que es una distopía con todas las letras, ya que no se dice prácticamente nada acerca de Illéa. A esto sólo le falta el sexo y ya es Cincuenta Sombras de Grey (no lo digo de mala leche, es la verdad). UfffffffffffffffffEste libro la caga ¿entienden? la caga. La Selección era una hermosa trilogía hasta que ¡BOOM! aparece The Queen y la caga.Estoy indignada.Y odio este libro."}, {"userName": "Jennifer", "userReviewDate": "May 12, 2014", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "The Queen is a prequel novella in Kiera Cass's young adult, dystopian series titled: The Selection Series. This short story features Maxon's father and mother, King Clarkson and Queen Amberly, and includes the story of how they met through their generation's selection process. I think most readers don't like King Clarkson in The Selection Series, so I was curious if he would be portrayed any differently during his younger years as prince. The answer is...I have to admit though, Ms. Cass was much more subtle in her character development of Clarkson, but his need to control and his hard-handed threats are still shown through his interactions with others in this prequel. The cycle of violence rings loud and clear within the portrait of this royal family, but any suggestion that Clarkson is a victim rang on deaf ears with me. Amberly is the perfect little submissive, which is something I didn't really view her as in the series, but maybe I just forgot. Through Amberly's point of view, the two of them have a very promising future together, and they may very well be just what each other needs. The Queen gives quite a bit of insight into these two characters, and when compared to the series, does a great job of reinforcing the fairytale aspect of Maxon and America's love story. This novella is a wonderful addition to the series and I would recommend it to fans.My favorite quote:“But shouldn't there be a least? Shouldn't there be a bare minimum that life should give you?\""}, {"userName": "Lilly Herondale", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/24061249-lilly-herondale", "userReview": "OMFG WE GET TO READ THIS ABOUT OUR ADORED QUEEN AMBERLY!?!??!?!?!?!?!????!!!!!!!!!!!!?!?!??!!???!?!?!I WANT IT!!!!!!!!!!!!!!!NOW NOW NOW NOW NOW NOW!!!!!!!!!!!!!KIERA I WANT IT NOW!!!!!!!!!! EDIT: MAY 16DID THAT JUST FREAKING SAY DECEMBER 2!?!??!?!?!??!?!?!??!?!WTF!!?!??!??!?!?!??!NO!!!!!!!!!!!!!!!!!!!!!!!!!!I WANT IT NOW NOW NOW NOW NOW NOW NOW NOW NOW NOW!!!!!!!!!!!!!!!!!!!!!"}, {"userName": "Francisca Viegas", "userReviewDate": "Dec 12, 2014", "userURL": "http://www.goodreads.com/user/show/2816955-francisca-viegas", "userReview": "This was such a disappointment. I ended up loathing the one character that I actually liked in the Selection series, Queen Amberly. She turned out to be a shallow and totally deprived of self-respect little twit.I don't even think I can explain it. Just please, don't read this."}, {"userName": "Amber Robertson", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/30813900-amber-robertson", "userReview": "If I can agree on anything with anyone, it's that Clarkson is a grade A creep and awful human being. Even during his own selection."}, {"userName": "Yoda", "userReviewDate": "Nov 09, 2016", "userURL": "http://www.goodreads.com/user/show/7508449-yoda", "userReview": "I really liked to start The Selection series with this one, it's nice to know more about the King and Queen before jumping in with the first book."}, {"userName": "Chelsey the crazy cat lady", "userReviewDate": "May 29, 2015", "userURL": "http://www.goodreads.com/user/show/43438271-chelsey-the-crazy-cat-lady", "userReview": "Loved seeing Queen Amberly go through the Selection and loved seeing how King Clarkson treated her and how he told her she was the one"}, {"userName": "Steysha Kravits", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/9946057-steysha-kravits", "userReview": "This is the suckest book I`ve read in a year. It`s only 72 pages long and almost each one of them made me scream internally. We get a glimpse of the life of Maxon`s parents: Queen Amberly and King Clarkson. Only she`s not a Queen yet and he`s just a Prince, looking for a wife. Amberly is a part of the Selection. She barely knows Clarkson (only thanks to TV) but he was the love of her life since before she could walk. Every night she prayed on his photo and picked names for their future babies. The story starts some time after she started to live in a palace as a Selected. Their first interaction with the Prince went somewhat like that:-\tCut your hair.-\tYou don`t like it?-\tMeh, I think you`ll look better with a short hair.-\tWell, even though I like my long hair, I would go bald if you asked to. So, my first expression was that Amberly is a naïve, boneless fool and Clarkson is a son of a bitch (which turned out to be true, but I won`t even start with his mother, this is a complete shit). My expression only grows stronger after he starts to treat her like trash because of her caste, and she continues to see him as God.\n«You are never to tell anyone what you do. If anyone asks, your family owns a coffee plantation, and you help run it. Be vague and never, ever let on that you do manual labor. Are we clear?”“Yes, Your Highness.”He eyed me a moment longer, as if to reinforce the point. But his command was all I needed. I’d never not do anything he asked me to.»\nHe`s a controlling jerk who can compete with Mr. Gray with his 50 shades, only without BDSM factor. His parents are constantly fighting and, because he doesn`t want to be like them, he`s looking for a wife that won`t ever say “no” to him. Yay, problem solved, no fighting! A husband everyone`s been dreaming for! His character can be described by one quote:\n«I’m the prince, and one day I will be king. My word is law.»\nMoreover, Amberly turned out to be infertile. How do you think he should`ve reacted? Obviously not by ignoring her while she felt depressed and needed his help. But everything ends fine – Clarkson doesn`t like kids anyway. If you thought The Selection was awful – try this one. Just for fun. Okay, seriously, don`t read it. I was pleased by the first book, but this novel only spoiled everything, especially my opinion about Maxon`s parents. And I thought I liked Queen Amberly."}, {"userName": "Thyago | MrsMargotBlog", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/36562929-thyago-mrsmargotblog", "userReview": "This story explains a lot about the King Clarkson behavior, but brings us a Queen so submissive that is difficult we like her."}, {"userName": "Maddison", "userReviewDate": "Jun 25, 2016", "userURL": "http://www.goodreads.com/user/show/5128911-maddison", "userReview": "[Amberly was obsessed with Clarkson growing up. That's slightly strange, but good for her, it all working out. (hide spoiler)]"}, {"userName": "Maisie", "userReviewDate": "Dec 18, 2014", "userURL": "http://www.goodreads.com/user/show/28108460-maisie", "userReview": "This novella was so good! I love queen Amberly and it was awesome to read her story during her own selection! Really great read!"}, {"userName": "Colette", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/1481661-colette", "userReview": "I really enjoyed this story, but would have rather seen it as a prequel series or full length book rather than a packed novella. When it ended I felt like it had hardly begun."}, {"userName": "Jennie ", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/28100741-jennie", "userReview": "Όταν έμαθα στην αρχή ότι θα διαβάζαμε και την επιλογή της μαμάς του Μειξον i was like *give it to me*! Ήταν από εκείνες τις νουβέλες που ήθελα πολύ να τις διαβάσω. Πρώτη φορά ανυπομονούσα τόσο πολύ να διαβάσω νουβέλα στη ζωή μου.Και τώρα που διάβασα το \"The Queen\" I'm like *hmm...* .Και αυτό για τους εξής λόγους:1) (θα αρχίσω από τα εύκολα). Δεν μου άρεσε και πάρα πολύ ο χαρακτήρας της Άμπερλι. Αξιαγάπητη ναι μεν, καλή, γλυκιά κοπέλα, ερωτευμένη με τον Κλάρκσον αλλά αρκετά αφελής δε, ηττοπαθής και υπάκουη αλλά σε σημείο όμως που φαινόταν λες και είναι χαλάκι του Κλάρκσον (το καταλαβαίνω ερωτευμένη ήταν αλλά δική της βούληση για κάποια πράγματα τίποτα;) . Ναι μεν τη συμπάθησα αλλά υπήρξαν και κάποιες φορές που με εκνεύρισε. 2) (Και τώρα πάμε για τα δύσκολα :( ) . Στα κανονικά βιβλία της σειράς και στις υπόλοιπες νουβέλες αυτής (The Prince, The Guard) έχουμε δει ότι ο Κλάρκσον φερόταν άσχημα , με κακία , με χειριστικό τρόπο και χωρίς να δείχνει και τον ιδιαίτερο σεβασμό προς το γιο και τη γυναίκα του αλλά και προς την Αμέρικα και τον οποιονδήποτε άλλο. Εδώ όμως η συγγραφέας, με αυτή τη νουβέλα, μας δείχνει ,ουσιαστικά, την αιτία που οδήγησε σε αυτή την άσχημη συμπεριφορά του Κλάρκσον προς σχεδόν όλους όσους γνώριζε. Ήταν και αυτός λίγο ψώνιο από μόνος του δεν λέω αλλά αυτή η αιτία ήταν ένας σημαντικός λίθος στο να \"δημιουργηθεί\" αυτή η συμπεριφορά του Κλάρκσον. Ένα θα πω, ήταν πολύ τυχεράκιας που αγάπησε αυτόν τον τύπο με τα ψυχολογικά (θα τον πω εγώ) η Άμπερλι. Εγώ αν τα έβλεπα αυτά και ειδικά κάποια συγκεκριμένα πράγματα που έλεγε και -κυρίως- έκανε θα έφευγα. :P Βέβαια δεν πρέπει να ξεχάσω να αναφέρω ότι κατά βάθος αγάπησε την Άμπερλι, απλώς με έναν δικό του τρόπο. Από εκεί και πέρα έβαλα τρία αστεράκια γιατί είχε ενδιαφέρουσα υπόθεση αλλά και ένα σχετικά όμορφο τέλος."}, {"userName": "Isa Cantos (Crónicas de una Merodeadora)", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/20954985-isa-cantos-cr-nicas-de-una-merodeadora", "userReview": "Esta historia corta es... extraña. Vamos, todos los que hemos leído The Selection sabemos qué clase de persona y de rey es Clarkson. Y muchísimas veces nos preguntamos cómo alguien tan dulce como Amberly llegó a ganar la Selección y destinar el resto de su vida a ser la esposa de un hombre como Clarkson.The Queen nos muestra todo eso. Conocemos el origen humilde de Amberly, su profundo enamoramiento en el príncipe desde que tenía siete años, su personalidad calmada, sus problemas de salud, su temple. Además, también conocemos a un Clarkson joven, lleno de ideas y de energía para dirigir a un país; pero también conocemos a un Clarkson perturbado por la horrorosa relación de sus padres, obligado a ser fuerte, mentir y tener todos sus movimientos absolutamente calculados. Es extrañísimo leer este relato y ver que Amberly, aún entendiendo y siendo partícipe de las explosiones en el carácter de Clarkson, haya querido ser su princesa, su reina, y estar a su lado. Es un relato duro de leer porque se desmorona un poco la idea que teníamos de la Reina Amberly gracias a los libros de The Selection, pero tampoco creo que debamos juzgar rápidamente. No todas las parejas son perfectas y, como en la realidad, los libros tampoco pueden escapar de eso. Y, más importante aún, el que un escritor plasme relaciones abusivas en un relato o libro, no quiere decir que las condone."}, {"userName": "Marla", "userReviewDate": "Nov 02, 2014", "userURL": "http://www.goodreads.com/user/show/4021000-marla", "userReview": "I enjoyed learning a little more of how Maxon's Mom became Queen and what her selection was like. This gives a small glimpse into that."}, {"userName": "Tijana", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/45530304-tijana", "userReview": "My entire relationship with the Selection series is pretty hard to describe.I can't say I'm in love with it, but at the same time I feel this weird obsession-like attachment to it.So yes, I devoured this one too.It was as good as all the other books and even though I (we all) hate Prince/King Clarckson, it was something that was easy to forget due to Amberly's love for him.Plus, I've never seen the Bachelor so hit me up with as many different Selections and I'll be on my toes, cheering!"}, {"userName": "Carmen de la Rosa", "userReviewDate": "Mar 13, 2016", "userURL": "http://www.goodreads.com/user/show/28935449-carmen-de-la-rosa", "userReview": "No es una mala historia. Fue muy interesante ver a la Reina Amberly y al Rey Clarkson antes de casarse, en su selección. Ambos no son muy agradables en especial el Rey Clarkson, ambos tienen muchos defectos. En cierto modo los comprendo a los dos más ahora, pero todavía no me agrada ninguno, especialmente Clarkson."}, {"userName": "Neil (or bleed)", "userReviewDate": "Aug 14, 2014", "userURL": "http://www.goodreads.com/user/show/14057379-neil-or-bleed", "userReview": "I gave it four stars because of King Clarkson. I'm a fan, okay. There are parts I loathed but there are also parts I really liked. And yes, I won't still read The Heir."}, {"userName": "Lizzie-flynn", "userReviewDate": "May 31, 2014", "userURL": "http://www.goodreads.com/user/show/31655409-lizzie-flynn", "userReview": "I NEED TO READ THIS!!! You know how people have fictional boyfriends, I think Queen Amberly is now our fictional mother."}, {"userName": "Courtney Wells", "userReviewDate": "Sep 21, 2014", "userURL": "http://www.goodreads.com/user/show/19433724-courtney-wells", "userReview": "I just keep giving this woman my money and I fail to regret it every time."}, {"userName": "Fuzaila", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/55299343-fuzaila", "userReview": "Another one of The Selection series? A book on Queen Amberly? Yes please!The Queen is the story of Queen Amberly, a glimpse of her life while she was competing in the selection for Prince Clarkson’s hand. We get to see her life, her family and the real Amberly beneath all the façade of grandiose we saw of her in The Selection. It was plainly obvious that Amberly was going to be the queen but it still was delightful to read of how she came to the throne. Prince Clarkson doesn’t seem as bad as he was, as a king. But his thirst for power and his desire to have control is obvious here too, even though the impact is slightly lessened while seeing it through the rose-colored eyes of Amberly. Eitherway, this was fun and delightful :)"}], "description": "Before America Singer's story began, another girl came to the palace to compete for the hand of a different prince….Don't miss this digital original novella set in the captivating world of Kiera Cass's #1 New York Times bestselling Selection series. This prequel story takes place before the events of The Selection and is told from the point of view of Prince Maxon's mother, Amberly. Discover a whole new Selection with this inside look at how Maxon's parents met—and how an ordinary girl named Amberly became a beloved queen.", "title": "The Queen\n      \n          (The Selection 0.4)", "url": "http://www.goodreads.com/book/show/22054340-the-queen", "average": 3.93, "cover": "https://images.gr-assets.com/books/1399581012l/22054340.jpg", "reviews": 2002, "authors": [{"url": "https://www.goodreads.com/author/show/2987125.Kiera_Cass", "name": "Kiera Cass"}], "type": ["Young Adult", "Romance", "Science Fiction", "Novella"], "outlinks": ["http://www.goodreads.com/book/show/22054340-the-queen", "http://www.goodreads.com/book/show/23655854-the-queen", "http://www.goodreads.com/book/show/10507293-the-selection", "http://www.goodreads.com/book/show/16248068-the-elite", "http://www.goodreads.com/book/show/18635016-the-one", "http://www.goodreads.com/book/show/22918050-the-heir", "http://www.goodreads.com/book/show/26074181-the-crown", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}