{"ratings": 602, "userreviews": [{"userName": "Bibi", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/33411728-bibi", "userReview": "*Spoiler, maybe*There are people who would absolutely love this book, particularly those who want the tortured (more like abusive) hero. Tristan and Isabel, our protagonists (both 24 yo) fell in love while in high school, rather, Isabel fell in love, while Tristan was just happy to be getting laid. So, of course, he calls off their relationship upon graduation and thereafter enrols in the Army.Fast forward six yrs and Isabel is on the run, hiding somewhere in Rio, and Tristan, now an assassin, is hired to kill her.Pause here. Think about it. Think about the probability of Tristan being the one chosen (in the multitude of God knows how many) to kill Isabel. I mean, come on.Meanwhile, Isabel still has strong feelings for the boy who got away, which basically has her perpetually heartbroken, unwilling to even contemplate falling in love with someone else. The thing is, Tristan lost his memory -due to a head trauma- and he's shocked when Isabel calls his name.Sensing a deeper story, he more or less kidnaps her because, you know, reasons.What ensues is nothing short of comical, except, I think the intent was not to amuse. To think there are 5 more serials. *chuckles* Oh well."}, {"userName": "SueBee★bring me an alpha!★", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/15735368-suebee-bring-me-an-alpha", "userReview": "LIVE! | AMZ US | AMZ UK |COLOR ME INTRIGUED!Book 1.LIVE! | AMZ US | AMZ UK |Blurb: He’s death for hire… Some people measure life in hours. Days. Weeks. I measure mine in kills. A covert military mission gone wrong robbed me of my memory and any link to my past. This is my existence now. I execute and survive. Nothing more, nothing less. I was ready to write Isabel Foster’s name in my ledger of unfortunate souls until she uttered the one word that could stop the bullet meant for her. My name. She knows my face. She knows me. She’s the key to the memories I’m not sure I want back. Now nothing is simple. I still have a job to do, and my soul isn’t worth saving. I’m not the man she thinks I am. I can’t love her. And sparing her life puts us both in the crosshairs."}, {"userName": "Angel Payne", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/7616506-angel-payne", "userReview": "I always tear through my Meredith Wild books at the speed of light. She's just that good. And riveting. And romantic. And heart-breaking. And about a thousand other adjectives that add up to one inescapable truth: the woman can tell a story like few others on my keeper shelf. If she's on yours--and even if she isn't--this is the book that will have you placing the author into a different stratosphere of greatness.The Red Ledger is Wild's most daring, suspenseful, and brilliantly executed work to date--she has said this series is like the Hacker books on crack, and she REALLY means it--so just clear your schedule and expect to be doing nothing else as you turn pages on this book as fast as you can. This is romantic suspense at the genre's finest, earning the woman a solid place beside Nora Roberts, Sandra Brown, and Julie Garwood for take-no-prisoners, leave-me-alone-I'm reading, grab-me-in-the-heart-and-don't-let-go plotting, pacing, and technical excellence. I am completely HOOKED on this story--but more than that, I am solidly invested in these two incredible characters, who have to face eye-popping odds to find their way to each other. They're both crafted with layers of such intricate care and beautiful detail, you're invested in them as people and not just names on a page. A truly stunning book, serving as the gateway to what's sure to be an amazing romance suspense series. I devoured every word."}, {"userName": "Bex (Beckie Bookworm)", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/9460945-bex-beckie-bookworm", "userReview": "⭐️⭐️⭐️⭐️STARS.ARC BOOK REVIEW Release Date-21/5/18Meredith Wild was a new author for me so I was going in blind here.And for such a short read \"The Red Ledger\" was surprisingly packed full of twists and turns from start to finish.there was never a dull moment here and the initial blurb for this didn't disappoint; so many are less than what is described and built up.So this delivered on its promise and definitely left me wanting much more, and with so many questions left unanswered, I am really looking forward to devouring the next piece.Still, Have no clue why Isobel Foster has been targeted by persons unknown; discluding the obvious of course of her father's job.And also still a trifle bemused how Isobel's lost love Tristan ended up with the contract for her ultimate demise.And this shadowy organisation Tristan is now contracted to; that has now placed a bounty on both there heads.Who is Jay? And what does she hope to achieve here?Because I'm damn sure there more to her agenda than she is actually disclosing.I'm hoping all these questions and more will finally get answered in the next instalment; can't wait.This was such a fascinating read and the only thing that pulled it down slightly for me was I wasn't entirely convinced at how swiftly Tristan went from cold to caring in regards to Isobel.Despite that slight nitpick this is one that I highly recommend.Thank You to the Author for providing me with an ARC of \"The Red Ledger: (Part 1)\" of which I have reviewed voluntary.All opinions expressed are entirely my own.Reviewed By Beckie Bookwormhttps://www.facebook.com/beckiebookworm/www.beckiebookworm.com"}, {"userName": "Martha", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/4407158-martha", "userReview": "WOW! This book was phenomenal. Meredith Wild has done it again. The story and the writing were both flawless and impeccable. I could not put this one down. Isabel has never gotten over her one true love.. She has tried for years to move on, but she just cannot seem to heal all that was broken when she lost Tristan. Through many twists, turns and surprises he is brought back into her life....What if you could not remember your old life? What if your job was to just execute and thrive on your own survival.. That is the life Tristan Red is used to... He has had no issues until he goes to his next job...Isabel How does she know his name? His simple life is suddenly very complicated. Your adrenaline will be pumping as you read this book. I did not know what to expect page after page. TRUST ME you need this book in your life. This is some of Meredith Wild's best work to date. I cannot wait to continue this story!"}, {"userName": "Megan  ~The Never Ending Book Basket", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/26580588-megan-the-never-ending-book-basket", "userReview": "Meredith Wild is one of my all-time favorite authors for a reason. Her books perfectly weave together unforgettable characters, consuming stories, and a palpable heat that is brought to life through her spectacular writing. I have loved each and every one of her stories, but what she has begun with this new series and what she has so exceptionally created in this first part is in a league of its own. The Red Ledger is one of the most addicting reads I have ever read. This book took me on one helluva whirlwind from start to finish, and made for one serious intense and consuming read that I could not get enough of. I loved every part of this story. I loved the literal fire it sent through me as I read it. I loved how it left me breathless at times. I loved that it gave me a story unlike any other I've ever read before. And I loved that it started what I know will be one of my favorite series.The first part of this series follows the suspenseful story of Isabel and Tristan. He's murder for hire, and her name is at the top of his list. Yet the moment he goes to do the deed, her breathless whisper of his name, his real name changes everything. You see Tristan and Isabel have a past, yet he doesn't remember any of it. She does though, and the more time he hesitates, the more he wonders about that past and the world of feeling that lays in that past that he can still feel the edges of. He also can't seem to stop thinking about her and wondering more about what he's forgotten. This story follows them as they set off on the run, as he tries to find the answers he seeks, and as she tries to see if the Tristan she loved all those years ago is somehow still in the man who was hired to kill her.Every word of this story will pull you in something fierce, and the more you get with these two, the more you will need more. Meredith Wild makes this world, these characters, and their story addicting to say the least, and she will have you beyond ready to see what will unfold in this new world and series. This world in this book and series is darker, its grittier and more complicated, yet there is a tangible and palpable fire that will pull your mind and heart into every breathtaking word. From start to finish this book will have you on the edge of your seat ready to see where that next turn of the page will bring you, and trust me when I say that you will be so enraptured by it all. The Red Ledger was fantastic. It was a phenomenal, quick, utterly suspenseful and fiery read that was intense as all get out and one of the most consuming reads I've read in such a long time. I loved getting every word of Isabel and Tristan's story, and I can't wait to see where those next chapters will take them both. Through every twist and turn, every action packed moment, and through every ounce of connection she created between these two characters, Meredith Wild created such an unforgettable read that I loved with all that I had! The Red Ledger is a book that will have you so in it all ready for more, and that is just part of what makes it such an incredible read."}, {"userName": "Melissa Crump", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/22088997-melissa-crump", "userReview": "Meredith Wild is pulling out all the stops with this new series! Thrilling, suspenseful and heart stopping! This book had me from the beginning and still hasn’t let go. I cannot wait to find out what happens in the second book. Exceptional!"}, {"userName": "Sue", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/70157664-sue", "userReview": "What an incredible start to a new series! This is going to be epic! Full of suspense, intrigue, and heat.I could not turn the pages fast enough to find out what was going to happen next yet never wanted it to end. I can’t wait to read the rest of this fantastic series."}, {"userName": "Linda Dunn", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/56892109-linda-dunn", "userReview": "Assassin UnmaskedThere has been immense anticipation for this book. I was really excited to have had the opportunity to read this myself. Meredith Wild did not disappoint.Isabel's life has been freeze framed in time. She fell in love with Tristan years ago and cannot break out of the memories that she still holds for him in her heart. While in the military Tristan was badly wounded and is now in a place where he is constantly treading water and has lost his way as well as his memories. He has become a paid Assassin and his next hit is none other than Isabel. Everything changes his plans when Isabel recognizes him. When they meet eye to eye Isabel discovers he is not the same Tristen she knew and loved.Meredith has ventured outside of the box with this book and I am so glad she did. This story is filled with suspense and intrigue that had me on the edge of my seat. I am looking forward to reading the next story in this series."}, {"userName": "Danielle Rose", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/4566961-danielle-rose", "userReview": "The Red Ledger by Meredith Wild follows the journey of Tristan Red, an assassin with amnesia, and Isabel Foster, the woman who once claimed his heart. Unable to remember his past and uncaring to drive down Memory Lane, Red spends his days in a blur, working for a top secret company that accepts only the highest paying kills. Red is sent to kill his former love, Foster, but is unable to after realizing she holds the secrets to the past he never knew he wanted to relive. Soon, they both become targets in a conspiracy so well-developed I never saw the twists and turns coming.I'm absolutely obsessed with this story line, these characters, their lives, and this romance. Waiting for the other installments is the definition of true torture at this point! I read both part one and two back to back; I could not put them down, because this story has everything a reader craves: fast-pacing, a mind-numbing mystery, thrilling action, steamy romance, and moments of such intensity you're aching for more. From an author who has made a career in writing the best romance fiction available, The Red Ledger, her first venture into true thriller fiction, is absolutely my favorite read of 2018."}, {"userName": "Curtis E Evans", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/69576397-curtis-e-evans", "userReview": "Family vs “Tristan & Isabel”I cannot remember ever having to decide which was more important; spending the evening with family . . . in from out of state . . . or sitting down and turning the pages that make up this story. Truly a difficult decision. I am happy to say, family understood!What a story, what a rush, what a heart pulsing adrenaline pumping masterpiece. If my heading doesn’t get your attention, do these superlatives? Meredith WIld has always been an awesome writer, but for this story, she dug deep into her bag of tricks and brought out a new style. Just amazing! I can NOT say it enough . . . just amazing.From the very beginning of this book I was held captive; drawn in tighter with each word passed and each page turned. Understanding the dark side of humanity, and realizing we are not as safe as we seem had me all in. Meredith takes us back in time to show how this came about for our characters, twisting us deeper into their saga. Tristan’s inner struggles haunt him still. Isabel battles to deal with love lost at a young age. Circumstances beyond their control have caused them to find each other again. The resurgence of their connection left me speechless. Anyone who knows me, knows that is a feat with itself.As I write this review understand you need to carve some time out of your day/night to read this story, because once started, it will not easily be put down.What a wonderful story Meredith. Five stars is not enough, not enough by far. Thanks again family for your understanding!"}, {"userName": "Sissy's Romance Book Review ", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/1831318-sissy-s-romance-book-review", "userReview": "The Red Ledger #1 by Meredith Wild is Part 1 of a 6 Book Series. This book starts the story of Isabel Foster and Tristan \"Red\" Stone and will continue throughout the other books. This was a exciting page turning book for sure that you won't be able to put down!Isabel is still dealing with the lost of a man she truly loved a few years ago. Now working in as a teacher her loss of him is still holding her back from a relationship with Kolt. Kolt is a friend who wants more from Isabel but she can't give him more because she doesn't have it to give. When by accident she happens to see Tristan and goes running after him to find out what happened to him all those years ago. Tristan lost time in his life and doesn't know who he was but for the past three years he has been a killing machine. Next on his list to be killed is Isabel Foster. When he sneaks into her apartment to do the job he hears her call his name. Tristan sneaks out before killing her and goes on a research spree to find out who she is. Then he goes to see her in the daylight and is caught by her. Tristan takes her with him to find out how she knows him and to finish the job he started of killing her. I cannot wait for more of their story!!!!"}, {"userName": "Courtney", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/13045881-courtney", "userReview": "I know who Meredith Wild is and have heard nothing but amazing things about her and her books. But, I have never had the time to read anything by her, til now. I saw that she was starting a new series and that it was a thriller/suspense. And when I read the blurb, I was all in.Meredith Wild does not disappoint with this one. This book is quick and fast paced and there is no slowing down either. There are 6 parts to this series and they are expected to release this year, so YAY on not waiting long to see how this all pans out.Tristan remembers nothing of his life except the last three years. The three years he's been a killer for hire. He has no emotion, has no qualms over what he does. He's a robot in all sense of how he goes about life. Isabel remembers who Tristan was before he went off grid. But that's not who he is anymore. But she can't walk away from, because he won't let her. And not for the reasons you think.Meredith delivers a suspenseful story full of twists, unknown possibilities and a lot of information that has you already trying to figure out who is behind everything. Part 1 gives us just nuts and blots to this captivating story with a Jason Bourne-like plot line.The Red Ledger is a series you won't be able to walk away from once you start reading!"}, {"userName": "Bookgasms Book Blog", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/60005052-bookgasms-book-blog", "userReview": "I absolutely love Meredith Wild since her Hacker series and I honestly could not get enough of the first book in the Red Ledger series. I thought Tristan and Isabel were sexy, mysterious and their attraction and connection was palpable!!Isabel Foster is an incomplete woman, not fully whole since she lost the love of her life years ago. Now she is in Rio de Janeiro, Brazil trying to heal from a loss she still feels years later. But when her former lover, Tristan Stone, reappears she realizes the man she knew is no longer the assassin in front of her. With the enemy on their trail, will Isabel be able to help unlock Tristan's forgotten memories before it's too late? GAHH!! I was hooked on this from the getgo. I absolutely loved the story and seriously felt like I was watching The Bourne Identity right before my eyes. It was fantastic, sexy, mysterious and so addicting. Bring on book two because I am locked are loaded!! Bravo! 4 stars! ~Ratula"}, {"userName": "Beyond The Covers Blog", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/42370665-beyond-the-covers-blog", "userReview": "Meredith Wild took the plunge into the world of suspense and did not disappoint.I was so excited to get to read an arc of this and was hooked from the first word. Simply amazing writing, she has a way of making it seem like you are right there with Isabel and Tristan as they run for there lives.I loved that Isabel never forgot Tristan no matter how hard she tried. Though Tristan has no memory of his past he still felt he knew Isabel. I can't wait to see what happens in the next books the suspense is killing me! I wish I could give more than 5 stars because that's what this book deserves!!!"}, {"userName": "Mina Kalidas", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/36256546-mina-kalidas", "userReview": "This story was unbelievably good and left me wanting more. Tristan and Isabel are two lost souls who are meant to be together. This story started off with a bang. The twists and turns kept me on the edge of my seat. I couldn't stop reading until I finished this thrilling sexy story. The sexy times were super hot. Meredith Wild has definitely hit a homerun with this series and I can't wait to read more."}, {"userName": "Tiffany", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/60856651-tiffany", "userReview": "I received a copy of The Red Ledger: Part 1 via Bare Naked Words in exchange for my honest review.Meredith Wild, what am I supposed to do now woman?!This is a MUST READ. No argument about it. Tristan Red just bypassed Blake Landon (Wild’s Hacker Series) in my book. Who is Tristan Red? And why is there a price on Isobel Foster’s head?The Red Ledger keeps you on your toes from start to finish. It is jam packed with suspense, mystery, and action. It is unlike anything you have ever read by Meredith Wild, that’s for sure.We are left with a wild cliffhanger ending that is sure to keep you up at night until you get your hands on part 2!"}, {"userName": "Karen Aguilera", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/17776240-karen-aguilera", "userReview": "Another SUPERB book by Meredith Wild.This book is heart pounding will have you gripping the edge of chair until the very last page.Isabel has never gotten over her one true love and then she spots him and is ready to reconnect with him but things are not as easy as they seem.Tristan was a good guy turned dangerous. What happens if you can't remember your old life or the girl you used to love and was always there for you. What happens when you have one mission to complete but can't bring yourself to complete it. This page turning book will leave you wanting more and more."}, {"userName": "Kate's Corner ", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/13603287-kate-s-corner", "userReview": "6 book series. Really?"}, {"userName": "Tiffany Davis", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/22666042-tiffany-davis", "userReview": "Omg!!! Meredith has done it yet again with this book. I need more of Tristan!!!!! It was just starting to get good and then bam. I was sucked in from the very beginning like all of her books. I can't wait for the next ones so I can find out what happens with Tristan and Isabel."}, {"userName": "Cleida R", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/12421569-cleida-r", "userReview": "A must read! Read this book, take this ride, let these characters steal your heart. I am sure you love this book like I did."}, {"userName": "Kathleen R.", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/8063169-kathleen-r", "userReview": "Short and sweet with an ending that will make you question whether you should throw your kindle across the room because you know you'll have to wait until the next instalment to find out what'll happen to Tristan and Isabel. And the biggest question of it all is: will he get his memory back by spending as much time as possible with Isabel? I do have my doubts, but at the same time, i've heard of weirder things. So maybe sights, smells or even sounds will jog his memory so he'll remember just what she meant to him. Here's the other kicker - this man is a trained for hire assassin and someone wants Isabel gone for good, and for some reason, Tristan didn't go through with it. So here's my question: where will readers be taken if Tristan is so damn cautious? Will he really sit back and let the memories arrive one after the other or will he get hit with all of them at once or is it a lost cause? I really have no idea and will have to keep reading this series to find out for certain. \n*ARC provided by Author in exchange for an honest review. Reviewed by Kathleen, The Small Girl from A small girl, her man and her books\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n  Goodreads |    Amazon |    Facebook | Twitter | Pinterest | Instagram  | Our Amazon Store| Contact Us Today: smallgirlandherbooks@gmail.com"}, {"userName": "Renita McKinney", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/12000607-renita-mckinney", "userReview": "One of the things I can always expect from Meredith Wild is a story that will captivate me. A tale that will be full of romance, passion, heat and every now and then a dirty talking Alpha male. Trust me, she can bring the heat!Yet, this time Meredith decided to venture from her norm. To open a door she had not been through and to do something a little different. And truly that has paid off for her with The Red Ledger Series.Tristan: A damaged man swiped from the throes of death only to return as the giver of death. Isabella: A scorned woman on a mission to forget the love she lost only to fall prey to him again.Sounds like a simple love story, correct? Boy meets girl, girl loses boy, they reconnect, girl saves boy, boy saves girl and they ride off into the wild blue yonder and all's right with the world. Umm, not so much. The journey that brings these two lost souls back together is not as simple as one would expect. She remembers him, he’s forgotten her. She’s learning to trust, he’s trying to remember. So many battles, so many roads, so much distrust, and yet somehow they must find a way to work together, all while fighting the undeniable attraction.Meredith has started this series with me on the edge of my seat, heart palpitating, and the hunger for more taking over!This is the 1st of 6 books in a series . . . so as the story continues . . . so will my reviews. What a phenomenal 5 star read! Keep them coming, because I am sure there are 5 more 5-star reviews waiting in the wings!"}, {"userName": "Cindy M. Green", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/56143978-cindy-m-green", "userReview": "Suspense, mystery, intrigue, sexy moments…The Red Ledger Part 1 has it all. This was a fantastic start to a new series by Meredith Wild. I loved everything about this. Meredith does a fantastic job of immediately drawing you into the story, rest assured you will devour this in one sitting. Part 1 is not long, but it packs a punch that will have you anxious for more.Tristan is living a solitary life, but doesn’t question how he’s in this profession until Isabel enters his life. She’s another job for him, yet something seems familiar about her. The way Meredith slowly unravels the mystery connection between these two is so engaging and exciting. I love a well told story that has heat and suspense intertwined. This is going to be a slowwww burn that will be worth the journey. It’s exciting to anticipate what will happen next for Tristan and Isabel.I don’t want to give to much away, this is one of those stories you must read and embrace every moment. This is magnificent work by Meredith! She has indicated this will be like The Hacker Series, which is one of my favorites of all time, so I know I’m in for the ride of my life. I’m really excited for the rest of this series. I highly recommend taking a chance on Tristan Red, it might be a matter of life or death but worth every precious moment!"}, {"userName": "Melissa R", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/59020979-melissa-r", "userReview": "If you love meredith wild then this book will be no different! For me its hard to find a book I absolutely cant put down until I finish it.... this book one definitely one I couldn't put down till I was done. the suspense, heartbreak, love, the need to remember and the fight to protect what once was will pull your heart strings, fill you will all kinds of emotion and remind you that sometimes things are worth risking it all for. I didn't want it to end. I wanted to keep reading and find out what happened next. i can not wait until I can read the rest of this series."}, {"userName": "Janise ~Janise's Jivin' Book Blog~", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/28277088-janise-janise-s-jivin-book-blog", "userReview": "The Red Ledger by Meredith Wild is suspenseful, it is truly a phenomenal book. Tristan aka Red and Isabel have to face so many odds when they are thrown back into each other lives. Isabel can not move on from her broken heart and Tristan can not remember his past. When they are thrown together unexpectedly things start getting heated up, Will these two be able to help each other out conquer their past and move forward?The Red Ledger is action-packed and addictive. Nothing can compare to Meredith and her books. It was a page turner from the beginning to the end, I can not wait to read part 2 and 3."}, {"userName": "Susan", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/2328189-susan", "userReview": "This book grabs you by the throat from the very beginning and doesn't let you go. I was pulled right into the world of this book and felt the danger and suspense like I was being followed. Meredith Wild has written some of my favorite stories, I am a huge fan. This, however, is my new favorite. Romantic suspense can be hard to get right, too much romance, not enough nail-biting drama or there is so much action there is no time for the sexy bits. Ms. Wild nailed it, a perfect blend of both; I am looking forward to reading the other books in this series. Never before have I rooted for a hit man and a potential victim.....first time for everything!! I give this book five enthusiastic stars!!"}, {"userName": "Joanie Lawrence", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/43932813-joanie-lawrence", "userReview": "Omg!! I just love this storyline. I have not read a storyline like this. And the way the story goes and the ending. AMAZING!! I can not wait for the second part!!"}, {"userName": "Kathy Coopmans", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/12488855-kathy-coopmans", "userReview": "I am addicted to this story. My heart is invested in these two characters, who have so much against them.They're both intricately woven with Meredith’s words and detail that you can’t help but fall. A perfectly written book that twisted my heart. Such an amazing story from a masterful mind.Kathy CoopmansUSA Today Best-Selling AuthorPanty Dropping Book Blog"}, {"userName": "Kendra Krusmark", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/53528940-kendra-krusmark", "userReview": "OMG! I love this book and can’t wait for the rest of the series. Red Ladger will keep you up at night waiting to see what happens next."}], "description": "He’s death for hire… Some people measure life in hours. Days. Weeks. I measure mine in kills. A covert military mission gone wrong robbed me of my memory and any link to my past. This is my existence now. I execute and survive. Nothing more, nothing less. I was ready to write Isabel Foster’s name in my ledger of unfortunate souls until she uttered the one word that could stop the bullet meant for her. My name. She knows my face. She knows me. She’s the key to the memories I’m not sure I want back. Now nothing is simple. I still have a job to do, and my soul isn’t worth saving. I’m not the man she thinks I am. I can’t love her. And sparing her life puts us both in the crosshairs.", "title": "The Red Ledger: Part 1\n      \n          (The Red Ledger #1)", "url": "http://www.goodreads.com/book/show/39021058-the-red-ledger", "average": 4.36, "cover": "https://images.gr-assets.com/books/1522680442l/39021058.jpg", "reviews": 234, "authors": [{"url": "https://www.goodreads.com/author/show/7190965.Meredith_Wild", "name": "Meredith Wild"}], "type": ["Suspense", "Romance", "Contemporary", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/39021058-the-red-ledger", "http://www.goodreads.com/book/show/25208536-hardwired", "http://www.goodreads.com/book/show/25312405-hardpressed", "http://www.goodreads.com/book/show/25313804-hardline", "http://www.goodreads.com/book/show/25904478-hard-love", "http://www.goodreads.com/book/show/25519820-hard-limit", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}