{"ratings": 29, "userreviews": [{"userName": "Darlene Owens", "userReviewDate": "Feb 09, 2013", "userURL": "http://www.goodreads.com/user/show/17099918-darlene-owens", "userReview": "I inadvertently read The Raven, more youth friendly version of Indian Hill. I'll continue the series with the adult version.I found the author and his characters to be a good read. The beginning seemed a little slow as the main character, Mike Talbot, was developed but it gave you insight into who this person was that you would be cheering for."}, {"userName": "Devin Brodhagen", "userReviewDate": "Nov 15, 2012", "userURL": "http://www.goodreads.com/user/show/12757924-devin-brodhagen", "userReview": "The adventure of Mr. Talbot continues. Good book, I enjoyed it, kept my attention and the novels are relatively short."}], "description": "Indian Hill YA version This story is about an ordinary boy, who grows up in relatively normal times to find himself thrust into an extra-ordinary position. Growing up in suburban Boston he enjoys the trials and tribulations that all adolescents go through. From the seemingly tyrannical mother, to girl problems to run-ins with the law. He escapes to college out in Colorado with his best friend, Paul, where they begin to forge new relationships with those around them. It is one girl in particular that has caught the eye of Michael. It is on their true 'first' date that things go strangely askew. Mike soon finds himself fighting for his very survival in gladiator type games. Follow Mike as he battles for his life and Paul has he battles to keep main stream US safe.", "title": "The Ravin\n      \n          (Michael Talbot Adventures)", "url": "http://www.goodreads.com/book/show/15892734-the-ravin", "average": 4.52, "cover": "https://images.gr-assets.com/books/1355073186l/15892734.jpg", "reviews": 2, "authors": [{"url": "https://www.goodreads.com/author/show/2990843.Mark_Tufo", "name": "Mark Tufo"}], "type": ["Horror", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/15892734-the-ravin", "http://www.goodreads.com/book/show/8167001-zombie-fallout", "http://www.goodreads.com/book/show/15756383-a-plague-upon-your-family", "http://www.goodreads.com/book/show/10867262-the-end", "http://www.goodreads.com/book/show/12855784-the-end-has-come-and-gone", "http://www.goodreads.com/book/show/13506310-alive-in-a-dead-world"]}