{"ratings": 885, "userreviews": [{"userName": "Book Concierge", "userReviewDate": "Jun 24, 2016", "userURL": "http://www.goodreads.com/user/show/1628041-book-concierge", "userReview": "Book on CD narrated by Elaina Erica Davis.This coming-of-age novel opens on Memorial Day. Alice McCauley is the youngest child, having five older brothers who dote on and protect her. Her father is a Shakespeare scholar at the local college; her mother died when Alice was a baby. On the morning of her tenth birthday, she senses that her world is about the change. At her party Alice meets two people unlike any she’s known to date. Theo is the bi-racial, New York City kid who has come to this small Vermont town to spend the summer with his grandparents. Kenneth also hails from New York, where he has worked as a renowned set designer and artist in the city; suffering from AIDS he has come home to live with his sister. Over the summer the three will form a lasting bond, and Alice will begin to leave childhood behind. The novel has a somewhat slow pace, but it brought back many fond memories of the idyllic summers of youth. Long days spent doing “nothing” and “everything.” Exploring the endless wonders of our environment, making friends, learning new skills, gaining confidence in our abilities to handle adversity, and also coming to terms with loss. One of the difficulties with choosing a child narrator, however, is that the adult reader will clearly see certain plot elements coming long before the innocent (or perhaps less-experienced) child. Still, I thought Brown did a good job of revealing the plot elements, and the changing relationships. Elaina Erica Davis does a reasonably good job performing the audio. She makes me believe it is narrated by a 10-year-old. I wasn’t a fan of Kenneth’s voice and didn’t understand why one of Alice’s older brothers had a British accent. But those were minor. I loved Alice and Theo as Davis portrayed them."}, {"userName": "Suzy ", "userReviewDate": "Jun 01, 2010", "userURL": "http://www.goodreads.com/user/show/2706319-suzy", "userReview": "Carrie Brown is such a fabulous writer. Every sentence is so perfected. And the story as a whole is--as I try to think of what to say here, I am actually forming my hands into the shape of a snow globe--as if I were carefully holding a beautiful, fragile thing. That is what Carrie Brown's story is. 10-yr. old Alice's inner life is so real and recognizable. It is to Brown's credit that she can remember (for she must) and recapture that in a novel. Alice's summer friend, Theo, is a wonderful character too. I highly recommend this book to my women friends--don't know how a male would find it. It'd be interesting to find out. The book reminded me, all along, of To Kill a Mockingbird, both in the feel of the telling and similarities in the story: a widowed father, race prejudice, a small town, a sensitive tomboy with a forlorn boy as a bosom buddy....and then, to my surprise, Brown has Alice reading To Kill a Mockingbird in one of the last chapters! So, maybe the connection was in her mind too?The only thing I thought was weird was the way Alice spent her time: Even though it took place in the present, with references to terrorists, war in Iraq, etc., she spent her free time only in old fashioned ways, which seemed unrealistic. One time she is facing having to go to the university with her dad and laments that she will only be able to read or color there. Um...get on the computer? These sorts of misses sort of jolted me now and then."}, {"userName": "Mind the Book", "userReviewDate": "Apr 29, 2015", "userURL": "http://www.goodreads.com/user/show/22692958-mind-the-book", "userReview": "You had me at \"...coming-of-age during a crucial summer in New England\". Trots detta infann sig visst initialt tvivel: men hallå, jag gillar ju inte att läsa om b a r n! men åh, så mycket anspråksfullt, platskrävande bildspråk och så lååånga kapitel!On her windowsill, Alice waited, watching. The full energy of the day, like a parade assembling its drums and cymbals and marching players, lay just out of sight, gathering strength at the end of the world. Any moment now, the day's brimming cup would spill over the far treetops and flood the hour with light.Sedan drogs jag in i den sommardoftande storyn, som också innehåller existentiellt mörker, sjukdom, död och weltschmerzigt uppvaknande. Jfr. Stand by Me eller Io non ho paura, vid sidan av Alice i Underlandet/To Kill a Mockingbird-motivet.#BOTNS-bingo: 'Recommended in a BOTNS episode'"}, {"userName": "Carolyn", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/756111-carolyn", "userReview": "So I know that imitation is the highest form of flattery, but to profit from that is pretty corrupt. This book tries to knock off To Kill a Mockingbird so blantly that I cannot believe it was published. The plot mimics TKAM well. A quirky, tall tale telling boy comes to visit for the summer in a small quaint town where the main character's family shun phones and tv and they get into mischief. The mischief is notoriously bland and leaves you feeling like you just ate a dry cracker when you had been craving warm, homemade bread seeping with rich butter (or olive oil). There are required readings to an old ill person; the crisis of the book takes place right after a town dance (TKAM it was a play); the girl even reads TKAM in the final blessed chapter. The main character's father is a shadow of Atticus Finch. His name is Archie MacCauley & his gestures rip the glasses right off Atticus. There are just too many things that do not add up. I truly do not know how a professor supports 6 to 7 kids as well as full time help. Why would he and his now deceased wife have had 6 children. The dead mother apparently dies 1 month after giving birth by falling off a horse. Who goes on a horse a month after giving birth? Then there was the tangential exposition. The author takes 5 chapters and 79 pages to talk about the birthday of a 10 year old girl. Really, the book is just drivel with an original idea or two but no soul. Very happy to be done. The zen of it ia that I plan on putting a lot more consideration imto choosing my books."}, {"userName": "Karen", "userReviewDate": "May 29, 2008", "userURL": "http://www.goodreads.com/user/show/294515-karen", "userReview": "Finished this one awhile back. It's a slow start but a good read. As the main character (whose name is now totally forgotten to me) turns ten, she experiences a summer that changes her life and brings her out of innocence and into a painful understanding of the complexities of the world.  Two strangers come to town: Theo (I don't know why I remember his name but not hers) ends up living with the girl and her family after his grandmother, a close friend and neighbor, suffers a stroke. Theo is half black and his grandfather seems to have a problem with this. As Main Character develops a close friendship with Theo, she realizes some painful truths about racism. The second stranger is the elderly brother of another neigbor, an artist named Kenneth who is dying from AIDs. Main Character and Theo spend much time with Kenneth, reading to him. The kids bring Kenneth a much needed infusion of youthful energy. Wanting to do something nice for Kenneth, the children decide to build him a rope walk, extending from his home into the woods. This way, they think, Kenneth can leave the stuffy and claustrophobic home of his sister and venture out into the world. A child's act of generosity sets the stage for a tragedy that the reader sees coming almost immediately, though the children cannot fathom it. This was a beautiful, if slighly over-written book that really captures the beginning of a loss of innocence. I loved Main Character and Theo. I also found the relationship between Kenneth and his sister sad and haunting. I wish the book had been a little less lengthy--it could have used some editing--but overall I found it a gorgeous read."}, {"userName": "Jane", "userReviewDate": "Jul 04, 2011", "userURL": "http://www.goodreads.com/user/show/371167-jane", "userReview": "An \"assigned\" book for me, as our book club is to discuss this later in the month. Because most of the action takes place during the summer, this is a good season in which to read it. In the small Vermont town of Grange, Alice, the protagonist, is celebrating her 10th birthday as the book opens. And suddenly nothing is quite like it has been before.... her five older brothers are about to take off again for the summer (most already are out of the house, in college, anyway) but at her party, Alice meets Theo, a mixed-race boy from New York City who is just her age, and Kenneth, an ailing cosmopolitan artist who has returned to Grange to live with his eccentric sister, Hope Fitzgerald. When Theo's grandma--the beloved-by-Alice Helen O'Brien-- is stricken with a debilitating stroke, Theo is plopped into Alice's household and the pair are dispatched to cheer the housebound and depressed Kenneth. The plot turns on their most innocent decision to create a \"rope walk\" into the woods in the hope that Kenneth might be able to use it to enjoy a little nature on his own (once again). The relationships between Alice and all the other characters-- her widowed father, Archie; the smart but seemingly unloved Theo; her brothers; Kenneth; her family's housekeeper, Elizabeth; other community members; fill the book, which is an easy read, somewhat thought-provoking, but definitely not over-taxing for a summer's afternoon. There is more going on than what appears on the surface, of course, but you can take from it what you like."}, {"userName": "Patty", "userReviewDate": "Oct 25, 2009", "userURL": "http://www.goodreads.com/user/show/1020899-patty", "userReview": "It wasn't until my book group discussed this book that I realized why I liked it so much. It is really To Kill A Mockingbird in many ways. Yes, I know there is not so much about race relations and Archie is certainly no Atticus, but Brown really has written an homage to Scout and her story.This is not a bad thing. Many authors have been influenced by Harper Lee and her amazing book. Many authors have written wonderful coming of age stories. And we need to add Carrie Brown to that list of writers.Alice is 10 when this novel opens - matter of fact it is her birthday. Unfortunately the day does not bring just good, there are major changes underway in Alice's life. Those changes: a boy who comes to live at Alice's house a neighbor and her dying brother and the creation of an amazing gift among other issues help Alice see that she is growing up.What I liked most about this book was the language. I think Carrie Brown is able to tell so much with a descriptive sentence. I wish I had listened to the novel - I might have caught even more wonderful sentences. I may have to listen to another of Brown's stories."}, {"userName": "Iowa City Public Library", "userReviewDate": "Jul 21, 2010", "userURL": "http://www.goodreads.com/user/show/3427891-iowa-city-public-library", "userReview": "The Rope Walk by Carrie Brown is a wonderful journey with two ten-year-olds, Alice and Theo, during their summer break in New England. Left alone for many hours, they begin a friendship with a cosmopolitan neighbor, Kenneth, who has returned home to convalesce. Alice and Theo’s affection for Kenneth lead them to create a rope walk for his enjoyment of the nearby woods where Kenneth spent a lot of time as a child. But just as rope sometimes unravels, good intentions lead to unexpected consequences. Alice’s love of books and time spent at the library brought back many wonderful memories of my childhood.I had the pleasure of listening to a recording of this book and was very sorry when it came to an end. The narration by Elaina Erika Davis was wonderful and added to my enjoyment of the book. This was an unexpected pick for All Iowa Reads but a very good choice. ~~Enjoy~~ --KaraFrom ICPL Staff Picks Blog"}, {"userName": "Candice", "userReviewDate": "Jul 16, 2007", "userURL": "http://www.goodreads.com/user/show/189647-candice", "userReview": "No one writes descriptions like Carrie Brown. When I read her books, I have to pause and think about how beautifully she has described the trees after a rain, or the way the sunlight comes through a window or any number of things. The Rope Walk abounds with such descriptions and I reveled in reading them.Reading about Alice and Theo, I was reminded of those long summers of childhood that I had consigned to the back of my mind. Playing outside all day, getting dirty and sweaty, waking up in the morning and knowing that the whole day stretched ahead, unstructured. Those children were so endearing, too, and Alice's family life was so loving. Great characters, all of them.I admired Kenneth's courage, but do not want to say too much more so as not to spoil the book for others."}, {"userName": "Angie", "userReviewDate": "Apr 08, 2009", "userURL": "http://www.goodreads.com/user/show/842569-angie", "userReview": "This is one of those books you either really like or really dislike - personally , I really disliked it . The story was lacking depth. It was hidden behind never-ending sentences and flowery discriptions that lost my attention . I wanted to sharpie marker through all of the author's \" like ...\" 's and \" as if ....\" 's !"}, {"userName": "Patrick Barry", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/66625767-patrick-barry", "userReview": "Two motherless 11 year olds are at the center of this novel. Shortly after Alice was born, her mother died in a horse riding accident. Alice is beloved by her five brothers and her father Archie, but the world of her childhood is disappearing and she is slowly getting drawn into the more dangerous world of adults. Theo is biracial and comes to Alice's Vermont town because his mother has been hospitalized with depression. He is staying at his grandparents who are good friends with Archie. When Theo's grandmother is suddenly incapacitated with a stroke and his grandfather's time becomes too constrained with his wife's illness, Theo is taken in by Alice's family. Both Alice and Theo have great creativity; in particular Theo's manifests itself in engineering. They form an immediate friendship. A friend of Archie's returns to Vermont that summer. He is a painter and has worked on Broadway in set designs. He is also in the end stage of Aids. Archie sends the two youngsters to read books to the painter to help ease his day, but eventually the children have a greater gift in mind. This is an excellent coming of age story and the writing is top notch. I enjoyed it immensely."}, {"userName": "Rachel ", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/31771519-rachel", "userReview": "I picked up this book out of curiosity, mainly owing to the fact that the author is one of my English professors at college and a wonderful woman. I wasn't sure what to expect from the book, but I was excited to see more of the author side of Carrie Brown than what she showed in the classroom. The Rope Walk is a summer novel in the most pure and undiluted sense of the phrase. It transports you into Alice's life handles a growing up and loss of innocence with the naiveté and candor of a young child. I was in some ways reminded of To Kill A Mockingbird, but Carrie has created a story that is all her own. A beautiful, lyrical, and poignant piece of contemporary fiction, I would not hesitate to recommend this book to anyone."}, {"userName": "Carolyn S", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/2578447-carolyn-s", "userReview": "Wonderful Vermont writer who shows you the compassion of two ten year old kids that help a man with aids live and die. Lots of feels in this book. The unfairness of being good looking and having a sister that is not good looking. Being half Black and getting shunned by your White grandparents. Going through a divorce along with your mom and dad. Losing a mom you never really met. But regardless of the unhappiness two kids make a miracle happen and share a lot in one summer. Plus is your life that bad, these kids survive and you can feel the love in this book."}, {"userName": "Robbi Portela", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/5291423-robbi-portela", "userReview": "Wonderful, very thoughtfully written! I hope to read more Carrie Brown creations soon!"}, {"userName": "Dawn", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/12275609-dawn", "userReview": "Her device of story telling at first put me off. There would be a sentence advancing the plot, followed by memories and impressions and associations in Alice’s mind. The omniscient author constantly told us what Alice thought and felt. The descriptions and imagery were beautiful but at first struck me as excessive. I came to enjoy it more."}, {"userName": "Therese", "userReviewDate": "Nov 16, 2011", "userURL": "http://www.goodreads.com/user/show/6721602-therese", "userReview": "Read for book club (11/2010) at Crystal Lake Public Library. I found this book to be touching, sweet, and introspective. I really enjoyed it!The main character is Alice, and the novel takes place around Memorial day, her 10th birthday. She is the lone girl in a house with her father, a Shakespeare professor, and 5 older brothers. She is a bit of a tomboy but quite smart and kind. During the summer she meets and becomes friends with a few special people. The first is Theo, a mixed-race boy from NYC, who ends up becoming a good friend of hers after a little time. The second is Kenneth, a \"cool\" artist who makes nifty mobiles (reminded me of Alexander Calder a bit) and is unfortunately sick and has lost his site.This brings the three of them together because Alice and Theo end up visiting Kenneth daily to read to him from books, which begins a great friendship and a love for Lewis and Clarke. The two children end up creating a rope walk for Kenneth so he would be able to go for a walk in the woods and not get too close to a dangerous waterfall (where the book title comes from).You definitely feel a sense of childhood wonder and innocence while reading this book (like Alice dreamily looking at the beautiful mobile in the library). Eventually you see some of the realities of life creep in and how the children have to deal with the mistakes of adults. It is endearing and hopeful though, and I would certainly recommend it to those who enjoy a good story!"}, {"userName": "Charlotte", "userReviewDate": "Jan 28, 2012", "userURL": "http://www.goodreads.com/user/show/580517-charlotte", "userReview": "I read this book in the large print edition, and the larger print seemed quite fitting for the age of the main character.  It bothered me some that Alice did not have more supervision and that the housekeeping at her own home was less than desirable; but if she had had more supervision and a home that had more stringent housekeeping rules, Alice could not have had all the adventures she did have. After reading about another house Alice visited, I wanted to put the book down until I had cleaned my own house. I did not like some of the language used by Alice's brothers and the neighbor man that Alice and her friend Theo visited and thought perhaps a mother would have put a stop to that. As for Theo, it seemed that Alice's family accepted the little fellow and his way of doing things pretty well, not knowing when he would be leaving. I could see why Alice would be fascinated with Theo. Although I was irritated with an action of Kenneth, I thought the author created a satisfactory ending that was believable. The little girl pictured on the cover seems the right age for Alice, but where are her springy red curls? I can't imagine daffodils blooming in Vermont as late as the end of May and haven't seen any daffodils that keep their trumpets upright so that they could catch hailstones, but maybe there are different daffodils in Vermont. I found a few typos, also, but I am still glad I read the book."}, {"userName": "Shonna Froebel", "userReviewDate": "Nov 18, 2012", "userURL": "http://www.goodreads.com/user/show/14633278-shonna-froebel", "userReview": "This is a delightful read. Most of it takes place over the summer right after Alice turns ten. If it wasn't for her age, I'd be tempted to call it a coming of age novel. It is over this time period that Alice becomes aware of the adult world and the issues and worries that are present there in a way she hadn't perceived before. This is due to the presence of two new friends in her life. Theo is the mixed race grandson of the older couple next door. He was supposed to be spending the summer with his grandparents, but ends up spending it with Alice's family. Theo is both more adventurous and more fearful than Alice, and coming from New York City is more worldly than she is. Kenneth is an older man, who has come home to live with his middle-aged sister from a cosmopolitan life as an artist. Kenneth has AIDS and is physically frail, and asks Alice to come and read to him. The three choose the journals of Lewis and Clark as reading matter, and Alice and Theo are inspired to build a rope walk for Kenneth so that he can walk alone in the woods behind his house. Alice has grown up with five older brothers and her father, a university professor, so in some ways is older than many children her age, but they have also protected her from the outside world in many ways. Her development over the summer is engrossing to witness and I thoroughly enjoyed this book"}, {"userName": "Valerie", "userReviewDate": "Feb 23, 2009", "userURL": "http://www.goodreads.com/user/show/1662241-valerie", "userReview": "This is the All Iowa Reads book for 2009. According to the website: \"the purpose of All Iowa Reads is to encourage Iowans statewide to read and talk about a single title in the same year. Libraries and other local organizations are encouraged to sponsor discussions of the title.\" I'm not sure why this would be a good thing, but it is a good book--I actually would have given 4 1/2 stars if it were an option, but thought the scale tipped closer to five that down to four.I thought the book started rather slow and I couldn't help thinking that the author was pretty gutsy when she made the characters so reminiscent of the great \"To Kill a Mockingbird\". At one point it is even mentioned in passing that the main character, Alice, is rereading \"To Kill a Mockingbird\", so I don't think the similarities were at all accidental. The story begins at the end of May on Alice's 10th birthday. Her mother died when she was a baby and so she lives with her father. She has 5 college aged brothers who are all preparing to be gone for the summer. An unexpected friend comes into her life and the summer unfolds in a dramatic way. Fortunately after the slow start everything about the book gets better and better all the way to the end. There's a lot to think about here that would make for a good discussion--so you Iowans, go forth to read and discuss!"}, {"userName": "Jen Julian", "userReviewDate": "Apr 16, 2012", "userURL": "http://www.goodreads.com/user/show/2477570-jen-julian", "userReview": "Motherless Alice, the only girl in a family of teen boys, befriends a mixed child, Theo, while he is visiting his grandparents over the summer. Alice and Theo befriend Kenneth, an artist neighbor who has AIDS. As an act of kindness, the children decide to create a rope walk for Kenneth, leading to a series of events that dramatically alter their perceptions of the world. This is a somewhat heavy read, but the beauty of its payoff is worth it.I am not usually a fan of child protagonists, or really child characters in general, but Carrie Brown knew what she was doing when she crafted ten-year-old Alice. Vibrant and curious, Alice and Theo are a joy to observe; their friendship feels immediate and pure, tinged with the nuances of their differences and the underlying pain of their inevitable separation.Brown's prose is clean and beautiful, and the story itself is heartbreaking; Alice emerges early from the chrysalis of childhood, experiencing an event that could drive an adult to self-destruction. The story speaks wonders about death, generosity, fairness, and the sharp, agonizing point at which the child world and adult world converge."}, {"userName": "Eli Brooke", "userReviewDate": "Jun 30, 2008", "userURL": "http://www.goodreads.com/user/show/36986-eli-brooke", "userReview": "The Rope Walk is a beautifully told story, very realistic in its portrayal of the confusion of that point in childhood when the magic and mystery of the world begins to butt up against the harsher realities of life. I finished it two days ago and am still thinking about all the characters, how little details seeped through the edges of the 10-year-old protagonist's viewpoint to hint at larger issues looming but not always explained. I absolutely agree with the claim in the cover blurb that the \"narrative is a profound experience of innocence, of perception balanced between childhood and adulthood.\" There are lots of novels about \"the loss of innocence\" and \"coming of age\" but this is the truest-feeling exploration of the inner experience of that pivotal age that I've read in a long time; possibly ever. The fact that it is told in 3rd person but very much from one character's viewpoint really helps; a 10-year-old girl might not be able to express as directly what she is feeling as the author does from a slight remove, but she does it in such a delicate way that it rings perfectly true."}, {"userName": "Patricia", "userReviewDate": "Mar 22, 2008", "userURL": "http://www.goodreads.com/user/show/664515-patricia", "userReview": "Alice turns 10 at the beginning of this book. She leans out the window at her birthday party and as she leans, we are introduced to her five older brothers, her professor father and the house keeper Elizabeth who came to work when Alice's mother died one month after her birth. We also meet other sundry characters including Theo, the grandchild of Alice's neighbors Helen and O'Brien, who is staying with them for the summer. Theo and Alice become friends and together they befriend Kenneth, an older neighbor.The book is best when describing Alice's feelings and emotions. There are so many great examples of being 10 years old. I especially loved the friendship that developed between Theo and Alice and this was another book I didn't want to finish. The closer I got to the ending, the more I set it down.On an unrelated side note, the author's picture fascinated me. It may have been because her hair was pinned up, but her steely expression to me seemed to be straight out of a frontier photograph from the 1850s. And I mean that as a compliment."}, {"userName": "Linda", "userReviewDate": "Apr 15, 2009", "userURL": "http://www.goodreads.com/user/show/2225443-linda", "userReview": "Alice lives in Vermont with her father and much older brothers; the novel begins on her tenth birthday in June. At her party, she meets Kenneth, who has come home to Vermont to live with his sister because he is dying of AIDS, and Theo, the mixed race grandson of neighbors, who don’t approve of their black son-in-law. Theo’s grandmother has a stroke and spends the summer in the hospital, so Theo goes to live with Alice’s family. He and Alice spend all their time together and become close friends. They befriend Kenneth and visit him often; one of their activities is to read to him, because his eyesight is failing. One day he mentions that he would like to walk in the woods, but he is too unsteady on his feet to do so. Theo and Alice want to do something special for him and build a walk in the woods with rope handles so that he can navigate. The rope walk leads to tragedy for Kenneth, and Alice and Theo learn many lessons from their experiences. The tone of the book reminded me of Sue Monk Kidd’s novels. I liked it very much."}, {"userName": "Katie", "userReviewDate": "Jan 13, 2009", "userURL": "http://www.goodreads.com/user/show/1177902-katie", "userReview": "The writing in this book is so fresh. I love the childlike descriptions and similes. I was so disappointed about 50 pages before the end. I really was mad at Archie for blaming Alice for the death of Kenneth. I thought he should have known Kenneth's state of mind from his quote about being out of love with life. His judgment was clouded by two things, his own dislike of being the center of gossip and attention, and his personal relationship with Kenneth. In book club we made the point that we as parents are often harder on kids when other people are judging us (as parents) by their actions. I really liked the resolution to the book though. The whole theme of the book, of a child awakening to the bad things out in the real world was kind of resolved by Theo when they were talking on the phone and Alice hears the sirens in the background \"like impending disaster\" (or something like that) and Theo says, \"Don't worry, you get used to it.\""}, {"userName": "Clare", "userReviewDate": "May 27, 2012", "userURL": "http://www.goodreads.com/user/show/340856-clare", "userReview": "Brown is a very talented writer. She nails the characters, their introspection and interactions perfectly. This book was a delight to read. It really takes the reader back to a time when he or she may have tried to \"lick your knee.\"My only hesitation in this praise - and the reason I can only give 4 stars instead of 5 - is that the story got off to a very slow start. For the first 80 pages, or so, I had a hard time staying with the story as I was wondering, \"when is something going to happen?\" Also, some of her descriptions are a little long-winded.Brown does a great job of weaving Lewis and Clark's story into the environment and into the kids' activities in this story. The parallels are clear and not contrived.During our book club discussion today, it was very interesting to hear that we each had different expectations for how the story was going to end. This book makes for a very engaging group discussion.I plan to read more of Carrie Brown's work."}, {"userName": "Catherine Woodman", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/5912889-catherine-woodman", "userReview": "I was really surprised by how much I liked this book. My SIL gives me 4 books each year that she has read that she thinks I will like, and this was from the 2008 batch--the story is told from the perspective of a 10 to 11 year old girl and the voice is very good--right on as who she should sound like and how she would think, and the story is well told and very good. The friendships she develops over a summer with a man who is dying of AIDS and a boy who is exiled by his family are different from each other, very intense, and complimentary in a way that works but you wouldn't predict that it would. When things go wrong at one point, her father has the worst possible reaction, and despite that, she manages to see that he is indeed wrong, and she goes about figuring out why. i had a great reading vacation and this was just one of the highlights."}, {"userName": "Patty", "userReviewDate": "Mar 14, 2014", "userURL": "http://www.goodreads.com/user/show/2314153-patty", "userReview": "It is such a rare pleasure to find an author that I like that I have never read before, especially one with several other books for me to anticipate reading! The protagonist in this novel is a 10-year-old girl. This is not, however, a children's book, or even the so-called Young Adult, as I understand it. It is about love and sorrow, beauty and wisdom...the joys of childhood and growing up. I lost several hours of sleep last night because of it, and yet I think I gained more than I lost. I don't know how to measure the benefit of reading a really well-written book. The house and the setting are so well described that I know them almost as well as the ones I grew up in...but Carrie's descriptions (and lessons) are written with a light touch, slipped in with the actions. A beautiful and powerful experience."}, {"userName": "Cheryl", "userReviewDate": "Jan 19, 2010", "userURL": "http://www.goodreads.com/user/show/165321-cheryl", "userReview": "I thought this \"coming of age\" book was beautifully written, and in the case of this audio CD, well read. At first I anticipated being bored; but the story of Alice and her friend Theo, and their adventures together that one summer totally sucked me in. There was so much that Alice and Theo described feeling that I recalled feeling myself as a young person, and even as a grown woman - - the queasiness of looking at a dead animal, the horribly pity and sorrow one feels when dealing with the terminally ill, the awful injustice when you know your intentions were nothing but good but the result is nothing short of disastrous. And frankly, I liked the ending too. Nothing neatly wrapped up and tied with a bow here, but real life. For its prose and its insight, \"The Rope Walk\" is something I would put on my recommended reading list."}, {"userName": "Susan", "userReviewDate": "Jul 10, 2011", "userURL": "http://www.goodreads.com/user/show/4430565-susan", "userReview": "Overall, I liked this book. Parts of it made me think back to when I was 10; the things my friends and I did and the way we saw the world then.However, it also made me think about how different things are for kids today than they were back then. Some parts were really sad for me, as I realized today's 10 year olds have never known the world without AIDS, and before 9-11-2001. I'm not sure whether that's why Alice's and Theo's thoughts sometimes seem overly worldly and complicated for 10 year olds, or if the author actually should have used 12, when I recall it happening for me. The other thing that I noticed was that references to the Internet, cell phones, CD's/DVD's and even TV were few and far between, and in some cases, even absent, although the story was set in 2005. What's up with that? All in all, touching story, though."}, {"userName": "AdultFiction Teton County Library", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/3658021-adultfiction-teton-county-library", "userReview": "TCL Call #: F Brown CCindy's rating: 5 starsIf you love character driven novels, this read is all that and more. The author's multilayered descriptions of all the unique characters make this a rich story, reminiscent of \"To Kill a Mockingbird\".I love books that have such an incongruous mix of people involved...Alice the 10 year old narrator and her father, a Shakespeare scholar, Theo the mixed race grandson of friends who came from NYC for the summer, Kenneth Fitzgerald, a prominent artist with AIDS who came home to die....and reading through to see how the author weaves them all together for the climax of the story.Wonderful descriptions, great character development and thought provoking themes make this book very satisfying....I read it twice."}], "description": "The Rope Walk brings us the dazzling story of a pivotal summer in the life of Alice, a redheaded tomboy and motherless girl who is beloved and protected by her five older brothers and her widower father, a professor of Shakespeare. On Memorial Day, at her tenth birthday party in the garden of her Vermont village home, Alice meets two people unlike any she’s known before. Theo is a mixed-race New York City kid visiting his white grandparents for the summer. Kenneth is a cosmopolitan artist with AIDS who has come home to convalesce with his middle-aged sister. Alice and Theo form an instant bond and, almost as quickly, find themselves drawn into the orbit of the magisterial Kenneth. When the children begin a daily routine of reading aloud to the artist, who is losing his eyesight, they discover the journals of Lewis and Clark and decide to embark on their own wilderness adventure: they plan and secretly build a “rope walk” through the woods for Kenneth and in the process learn the first of many hard truths about the way adults see the world, no matter that they are often wrong. The great gift of The Rope Walk is its exquisitely poised writing. Alice’s narrative is a profound experience of innocence, of perception balanced between childhood and adulthood. The flying spark of new friendship, the first intimation of adult love, the consolation of devotion, which allow Alice and Theo to shed light in the midst of darkness and to find joy in mutual understanding: these glistening threads are drawn together in a timeless story–profound, seductive, wise, and moving, from first to last.", "title": "The Rope Walk", "url": "https://www.goodreads.com/book/show/490621.The_Rope_Walk", "average": 3.63, "cover": "https://images.gr-assets.com/books/1175192387l/490621.jpg", "reviews": 181, "authors": [{"url": "https://www.goodreads.com/author/show/170342.Carrie_Brown", "name": "Carrie Brown"}], "type": ["Fiction", "Young Adult", "Contemporary", "Young Adult", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/490621.The_Rope_Walk", "http://www.goodreads.com/book/show/8357815-the-rope-walk", "http://www.goodreads.com/book/show/3335546-the-rope-walk", "http://www.goodreads.com/book/show/1074780.The_Rope_Walk", "http://www.goodreads.com/book/show/9249784-the-rope-walk", "http://www.goodreads.com/book/show/25430659-the-stargazer-s-sister", "http://www.goodreads.com/book/show/17288602-the-last-first-day", "http://www.goodreads.com/book/show/827203.Lamb_in_Love", "http://www.goodreads.com/book/show/827210.The_Hatbox_Baby", "http://www.goodreads.com/book/show/295084.Rose_s_Garden"]}