{"ratings": 1492, "userreviews": [{"userName": "Kemper", "userReviewDate": "Apr 28, 2012", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "“I haven’t taken the time-mower out for a spin lately. I’ll just fire it up and ….Hey, who are you? How did you get in my garage? And why are you pointing that gun at me? If you need a weed-eater that bad, just take it.”“Don’t play dumb with me, hag.”“Hag? Why are you calling me a female witch?”“You’re going to pretend that you belong in this timeline with your time machine sitting right there, hag?”“Again with the hag? Look, my name is Kemper and this is my timeline. I’ve got a time-mower because of a freak accident involving a lightning strike fusing my laptop to my lawn mower.”“That’s the stupidest thing I’ve ever heard, hag.”“I can’t disagree with you there, but it’s true. I got his time machine by accident and sometimes I go traveling like a half-assed version of Doctor Who.”“Hmmmmm.. My files are telling me that there is indeed a Kemper from this time in this area so I guess you’re not a hag after all.”“Why are you acting like you've checked some files? You’re just standing there with a gun. And I‘m guessing you‘re a time traveler, too? And what’s with this ‘hag’ business? You can tell me because I think we’re part of the same club.”“Very well. My name is Zed, but I’m operating under the name Troy Jones in this time. I’m from the future, and I’ve been sent back into the past by my government to prevent historical agitators, that we call ‘hags’, from changing events in our past.”“Wow. So these hags are back here causing a bunch of trouble and you’re like some kind of time-cop that stops them?”“Not exactly. You see, there are some dark times ahead for the world during a period we call the Great Conflagration.”“Well, that doesn’t sound like much fun. These hags cause it?”“No, the hags are trying to stop it. I’m here to make sure it happens by killing the hags before they can change events.”“Uh….you’re not really sounding like the good guy in this story, Zed.”“The world does suffer mightily in the Great Conflagration, but eventually humanity rebuilds and forms the Perfect Present that I come from. We’ve eliminated war, hunger, racism and all the other problems that have caused conflicts in the past.”“Damn, how did they manage that?”“Mainly by wiping out the historical records. With no history, there are no old grudges of one group against another. Plus, all the different ethnic groups that you have today will eventually breed into one homogenous people.”“If it’s so awesome in the Perfect Present, why do the hags come back to the past to destroy it?”“They think of all the death and destruction as preventable with no regard as to what it would do to the future. So they’ll come back and try to stop an event like 9/11 because they think that saving those lives will somehow build a better future. Plus, they are delusional and think that our government is somehow restrictive.”“And what are you doing in this timeline now?”“I was in the Washington DC area. Events are occurring that are critical to the Great Conflagration. There’s a disgraced former CIA officer who now works for one of the private intelligence firms that have become so prevalent during America’s war on terror. He’s trying to help an Indonesian maid who is essentially a slave to a South Korean diplomat as well as use her to get intelligence. I’ve also met a young woman whose brother was recently killed in Iraq, and she is conflicted about spending her days as a lawyer for companies profiting from the war. All of these people seem to have some kind of role to play in events. However, I received a blow to the head while stopping a hag plot and the files and hardware loaded into me seem to be malfunctioning so I’m having a hard time sorting it out. There seems to be a great deal of confusion among these people about American society and the roles they play in it. Then I got a reading that someone was prepping a time machine of some kind so I came here.”“Yeah, that was me.”“Mr. Kemper, I must insist that you do nothing to stop the coming Great Conflagration.”Oh, you don’t have to worry about me, Zed. I just like playing tourist in history. I got no interest in changing it. Thinking about that stuff gives me a headache. But now that you’ve told me all this, I think I’ve met some of these hags during my time travels.”“You think you know of some hag activity? When and where did his happen?”“It was London during the Blitz in World War II. I bumped into these three asshats….er.. I mean suspicious people who admitted to being time travelers from the future.”“World War II is an era when the hags like to disrupt the timeline. This sounds like a real threat. I should check it out and deal with them immediately.”“Yeah, you do that, Zed. They seemed pretty dangerous so you should probably just whack them as soon as you get the chance.”“Thank you for your concern and the information. I hope your upcoming death in the Great Conflagration isn’t too painful.”“Me too. Good luck.”“Goodbye, Mr. Kemper.”“Goodbye, Zed.”Thank goodness, he’s gone. That guy was a crazy as a shithouse rat. Or at least I hope he was. This Great Conflagration sounds pretty grim. On the other hand, if he really was a time traveler, I might have just settled up with those three nitwits in London. That would almost be worth the destruction of society."}, {"userName": "Jim", "userReviewDate": "Mar 13, 2016", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "Time travel stories have been done to death, but this latest addition to the genre might well become a classic. Z (Zed) is a protector - a man who does bad things so worse won't happen - travels back to our present to protect his Perfect Society from the HAGs (Historical Agitators). His job is difficult, lonely, & important. He KNOWS this. He's performed other, similar missions, but this is the most critical job ever.Thus the novel starts from Zed's point of view. Other chapters show the times from a couple of different contemps (contemporary people - people of our time). The details are sketchy at first. Mullen does a masterful job of slowly filling in the picture. The picture changes & everything is turned around while keeping the characters sympathetic. Disinformation, ignorance, & bias all twist together to create a nightmarish scenario. Are they bit players or pivotal figures? If you like tidy endings, don't read this. Oh, it wraps up pretty well, but a lot of questions are left unanswered & are worth pondering. What makes a perfect society? Are the costs worth it? What is the price of historical knowledge & how accurate is it? Can free will exist in a scientific frame work of time travel or is there just Fate?I'll be thinking about this book for a long time & will probably read it again. I'm also going to search out other works by this author. This is his third novel, but he's also written some nonfiction that should be interesting.Fass did a great job of narrating this audio book, too. His voices were perfect."}, {"userName": "Debbie Zapata", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/22110057-debbie-zapata", "userReview": "Hags, contemps, Protectors, Events.....paranoia and suspicion. What a world. Is it the future? Is it the present? A little bit of both. Imagine people from our future (which to them is known as the Perfect Present) returning to try to change history. Hags (historical agitators) come to try to save the contemps who were lost in horrendous Events such as the Holocaust. But Protectors come back to ensure that history unfolds exactly the way it did, because if anything was changed, then the Perfect Present would be something else entirely. So the Protectors make sure that Events happen, no matter what.Each chapter follows a different character, and we switch from Zed, a Protector who in our time is known as Troy, to a lawyer by the name of Tasha, to ex-CIA operative Leo, to Sari, who is basically a slave to a diplomat. All these people are tied together by different Events, that unfold as they are supposed to...or do they?The government of the Perfect Present insisted that its citizens were not allowed access to the past, even to the point of having special crews who cleared away all mementoes of dearly departed loved ones, so that there was nothing left: no pictures, no clothes, nothing that might leave the surviving family with anything to remember the person by. And yet this government was obsessed with protecting history, to make sure that Events unfolded in just the right way to allow the Perfect Present to develop. How ironic.I was struck by a thought Tasha had during a cab ride. The cab driver was a man from another country, as is quite common in large cities like Washington D.C., where this story takes place. He is speaking into a cel phone in his own language, one that Tasha does not understand. She has just left a meeting that has left her overwrought, and she starts off thinking that the man could be either innocently telling his wife that he will bring home the bread and milk she needs, or he could be plotting a terrorist attack. Then she simply tunes him out: \"It was easy to tune it all out when you didn't know what they were saying.\"I wonder how many of us react that way? If I don't understand your language, are you really Present? And if I do understand your language, but not the ideas behind your words, am I really Present? If we cannot or will not communicate, are any of we Present? I don't always go off on such tangents when reading, but this book seemed made for such thoughts. It is fast moving and interesting, but also brings up many ideas that I wantto explore more thoroughly the next time I read it."}, {"userName": "Ben Babcock", "userReviewDate": "Jul 12, 2011", "userURL": "http://www.goodreads.com/user/show/1188122-ben-babcock", "userReview": "“The Revisionists” is the name of my next band.Time travel is a very broad trope in science fiction. There are so many stories to tell using time travel and so many ways of doing it. I love time travel stories (particularly Doctor Who), the nitty-gritty, wibbly-wobbley, timey-wimey type of stories that can leave you utterly confused and gasping for breath by the end. For all their intricate potentialities, however, time travel is really only good for two things: observing history, and fucking with history. Everything else is just variations upon the theme.Since stories always need conflict, and conflict is hard to do when one is an observer, most time travel stories lean toward the latter. (You can still do clever things with an observer premise, but it’s seldom as fun.) When one travels back in time, it’s to change the past—hopefully with an eye of making the present better. In The Revisionists, our protagonist wants to stop people from changing the past. Zed works for the Government, who have taken Leibniz literally and believe they have found the best of all possible worlds. So Zed stops “historical agitators”, or hags, from screwing up that utopia. Except, as he protects various important Events in contemporary Washington, D.C. that lead up to the catastrophic Great Conflagration, Zed begins to learn things make him question his loyalties.From here, The Revisionists can go one of two ways. Through Zed’s first person (and therefore unreliable) narration and the limited omniscient narration following Tasha, Leo, and Sari, Thomas Mullen presents two possibilities. First, Zed is a time traveller from an undisclosed time in the future, as he claims. Second, Zed is actually his cover identity—Troy Jones—suffering from paranoid delusions brought on by the trauma of losing his ex-wife and daughter in a traffic collision. The time travel trappings are all part of an elaborate conspiracy fantasy Troy has constructed and is now living. True to postmodern form, Mullen declines to collapse the wavefunction and tell us which interpretation is “true”, leaving us to decide for ourselves. This is supposed to be artsy and clever and make the book that much more appealing. Unfortunately, neither interpretation leads to a satisfying experience.Let’s assume, then, that Zed is actually from the future. Thomas Mullen tells us exactly nothing about how time travel actually works in this universe. Apparently there is a “ritual” of some kind that allows Zed to be recalled to the future (or a future). But we’re spared any of the technobabble infodumps characteristic of most time-travel stories. Mullen is similarly vague about the technology Zed possesses. He appears to have cybernetic enhancements: he can communicate telepathically and wirelessly infilitrate neary computer systems; he has some kind of internal database that he can access using mental commands or eye gestures; and he can detect non-contemporary individuals by scanning for the DNA. He doesn’t carry a lot of futuristic technology on his person—ostensibly to avoid accidental contamination of the timeline—with the most exotic tool being “flashers”, small grenades that appear to disintegrate everything within a limited radius.None of this is very impressive or satisfying from a science-fiction standpoint. Furthermore, the monolithic and suspect Government that Zed protects is a very vague sort of dystopia. I’m tired of this trend: it’s lazy worldbuilding. There’s something to be said for not specifying the nature of the cataclysm preceding one’s post-apocalyptic society—perhaps it makes the author’s vision of the future more accessible. However, this does not excuse a failure to explain the post-apocalyptic society itself.All Mullen tells us is that it’s called “the Government” (almost as original as the Capitol, that) and it does not allow its citizens access to much in the way of history. According to Zed, this is for their own good—ignorance, after all, is bliss. Indeed, after his wife and daughter die in an all-too-convenient accident, minions come around to Zed’s abode and eliminate any traces of their persons, from photographs to toys to clothing and scents. This is all very sinister, but it’s still far too vague. We get no sense of who is in charge of the Government, and we meet fewer than five characters aside from Zed.So, as a time-time travel story, I have to give The Revisionists a failing mark. It’s just so incredibly vague that it’s more the outline of a story than an actual story. This is not good enough to keep me occupied until Doctor Who comes back in the fall. I’ll go watch some episodes of Stargate SG-1 or something.Then what if we regard Zed as the somewhat deranged Troy Jones? Does this make the book any better? The problem with normalizing The Revisionists and interpreting its science-fictional elements as hallucinatory is that it forces us to view the book as a conspiracy thriller. And, while I admit that I am somewhat of a snob when it comes to thrillers, I suspect that I would not be alone in concluding that this is a fairly lacklustre thriller. The characters are dull. Removed from its trappings of temporal preservation, the plot becomes one of counter-terrorism and counter-espionage, a commentary on the conflict between capitalism’s commitment to globalization and the patriotism expected of the American intelligence ecosystem. There’s never really a sense of impending danger, though. Neither Leo nor Tasha are very good at what they do, and while I suppose they are likeable enough as far as people go, I never became emotionally invested in their stories. I did like Sari and wished she would come to a good end but wasn’t particularly optimistic.Then there’s the fulcrum of The Revisionists: the tension between the Great Man theory of history and the theory that people are merely the product of their times. I think this issue would be a lot more interesting when explored through the lens of time travel. Attempting to sort through the machinations of Enhanced Awareness, Ltd., or Leo’s employer, Targeted Executive Solutions, doesn’t really provide the same sort of epic scope that such a discussion deserves. As a straight-up thriller, then, there is very little in the way of purpose to The Revisionists.I take issue neither with Mullen’s writing nor with his ideas, which are themselves pretty good. Rather, he has managed to construct a plot that can be interpreted in two ways yet fails to work on either level. I guess I’m disappointed because I was looking forward to an intense time-travel-themed thriller. Instead, I got a book that wants to pretend to be an intense time-travel-themed thriller and … isn’t quite convincing at it."}, {"userName": "Lou", "userReviewDate": "Jun 25, 2011", "userURL": "http://www.goodreads.com/user/show/3699303-lou", "userReview": "Within these pages you will find a complex cerebral thriller. A thriller post 9/11 and a government where agents hunt down and kill those that plot to unbalance the peace. A world of espionage, secrets and cover ups. Don't expect a visceral thriller, from the title and book cover I was expecting more of a cinematic kind of thriller instead it turned out to be a thinking mans tale of truth and power. You have a couple of searches for truth here, one a dead brother in the army and secondly a diplomat while is in the midst of deals with a foreign enemy, his maid has been the recipient of some abuse. It is a long haul to read and at times wanted a bit more accelerated pace, in the end I would say I found it was crafted together quite cleverly.http://more2read.com/?review=the-revisionists-by-thomas-mullen"}, {"userName": "Catherine", "userReviewDate": "Oct 08, 2011", "userURL": "http://www.goodreads.com/user/show/867628-catherine", "userReview": "[As I'm fascinated by mental illness, I choose to believe that Troy/Zed is not from the future, but has created this all in his own mind. Of course, that leaves the question of what actually happened all of the times when \"Zed\" believed he was killing hags and wiping out the evidence with \"Flashers.\" I suppose it was all in his head, just like his conversations with Wills, stints in other time periods, etc., etc. (hide spoiler)]"}, {"userName": "switterbug (Betsey)", "userReviewDate": "May 19, 2012", "userURL": "http://www.goodreads.com/user/show/2843912-switterbug-betsey", "userReview": "Mullen's third novel, a dystopian time-travel, was drowned out in the literary world by Stephen King's time travel epic, 11/22/63. Actually, both novels are ideal as bookends; in King's book, the protagonist goes back in time to try and alter history, whereas Mullen's protagonist, Zed, is an agent from the future employed to preserve history exactly as it is and prevent disruption or changes. If you add Orwell's 1984 (constant surveillance) and Farenheit 451 (destruction of historical documents), you have a riff of Mullen's themes. However, he created his own artistic, original, and literary novel that asks disturbing questions from all sides and parallels many of the contemporary concerns of our post 9/11 world.Date unknown, but we have survived the \"Great Conflagration,\" a period of warfare and global destruction that started in Washington, D.C. during the 21st century and led to the now \"Perfect Present.\" The Perfect Present is canny once you understand that this semi-utopian existence is a mixed bag. Yes, there is world peace, no hunger, and no religious wars (and no religion), and race is essentially a non-issue, as everyone is mixed.But, at what cost this Perfect Present? For one thing, all history is sacred, yet exiled from citizens' knowledge. The past is considered dangerous, because it is psychologically and socially harmful to dwell on the events that caused wars and disasters. The government forbids historical knowledge to circulate; moreover, when a loved one dies, all traces of them are erased in a haunting and treacherous manner.Zed, a government-employed time-traveler, is known as a Protector, another sly term used to denote the active preservation of history, a euphemism for protecting atrocities such as the Holocaust, 9/11, and World Wars--necessary in order to ensure that the Perfect Present now exists. Zed is cybernetically enhanced with the power of GPS and superhuman surveillance skills. His \"contemp\" (21st century) name is Troy Jones.Certain rebels or \"hags\" are anti-government agitators who believe that people deserve to know their history, and part of their job is finding ways to access hidden and confidential historical documents. The hags travel back to the past and attempt to prevent specific horrors from occurring. These time travels provoke cat-and-mouse chases between the Protectors and the hags. Zed's job is to eliminate the hags and protect the Perfect Present.This is as much a novel of ideas as it is a spy thriller. Characters wrestle with themes of protection vs power, of morality vs truth, and also grapple with identity, memory, and loss. In addition, the question of life's narrative is ubiquitous in the story--continuity, progression, recall, and interpretation. Moreover, how do you preserve history, when you are standing in it? What happens if you get involved with a person from the past? Supposedly, some people count more than others, and minor changes with insignificant members of the population don't necessarily affect the future. But Zed is standing close to the precipice, facing a steep chasm of people and history, flirting with fissures.Tasha is a young corporate lawyer in D.C. grieving for her soldier brother's death in Iraq, and troubled by the information she was given. She doesn't believe the government's story about what happened, which leads her to a mission of her own, and a potentially perilous breach of ethics. She meets Zed at a demonstration. He is breaking the rules by consorting with \"contemps,\" but figures that there will be no butterfly effect from his interactions with her.Leo is a former CIA spy now working for a morally ambiguous security company. He is asked to tail some anti-government/anti-war activists in the D.C. area. While grocery shopping, he meets a beautiful Indonesian nanny, Sari, who works for a Korean diplomat and his wife. Her inscrutable air fails to conceal some ugly facial bruises, but she isn't talking.The twists and turns are about two steps ahead of the reader, but with a casual pace that burns slowly and effectively, allowing time for character building and depth, and for ideas to flesh out. And, no matter how refined the technology, everyone is damaged and, to some extent, working with crude tools. And, as in life, not all questions can be resolved. But there's love, and a knock at the door. Will (s)he answer it?"}, {"userName": "David", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/3335664-david", "userReview": "I wasn't quite sure what to expect from this book that I decided to read on a whim. A mix of time travel and modern-day politics? Okay, let's see how the author handles it. To my surprise, he handled it very well indeed. Usually anyone who decides they're going to take on 9/11, gentrification, racial issues, and historical revisionism has an axe to grind, but Mullen's axe is hard to figure out. What politics there are in the novel are not overt, which means you can sit back and enjoy the story, and it's a very good story.Basically, there is an agent \"Z\" from a future society whose job is to prevent a group of would-be revisionists from Z's time from changing the past and thus destroying the society of the future. Initially Z is presented to us as a good guy defending an advanced, peaceful society from possibly devastating historical changes. As the story goes on, however, we learn that Z's society isn't as wonderful as we've been led to believe -- indeed, as Z has been led to believe. Increasingly, he questions his mission and the truth behind it, and through flashbacks we learn just how dark the future really is.Paralleling Z's story is that of a former CIA agent in our own time who, like Z, increasingly found the ideals he was supposedly working for in conflict with the work he was actually doing. There is also a young Washington, D.C. lawyer searching for the truth about her younger brother who died in Iraq, and a domestic worker trapped in Washington by her abusive employer who has diplomatic immunity.Weaving all these different threads together would be complicated enough in a plain old thriller, but as it is a science fiction novel as well, I feared it would either be a mess or something resolved with some kind of deux ex machina. In fact, everything ties together quite well, and the overall tone of the novel does not even feel that much like a science fiction novel, more like a literary thriller. This would be a good book to hand someone who likes mysteries and thrillers but not science fiction particularly. The time travel elements are so unobtrusive you don't even find yourself worrying about the sorts of things you usually do in time travel stories like the Grandfather Paradox, etc.There is some philosophizing by all the characters, each of whom is basically a good person who sometimes acts out of self-interest and has to weigh how much guilt and responsibility they can bear. Overall, a good and somewhat intellectual read with a fast-paced story. This one really surprised me. Recommended for a change of pace for anyone who likes science fiction, and worth trying even by those who don't."}, {"userName": "Lisa Wolf", "userReviewDate": "Jan 04, 2012", "userURL": "http://www.goodreads.com/user/show/4103395-lisa-wolf", "userReview": "\"The Revisionists\" was not at all what I'd expected, yet I couldn't put it down -- hence the four stars.I have a soft spot for all things time-travel, and the basic synopses I'd read of this book seemed to put it squarely into that genre: Main character Zed works for a post-disaster society at some point in time several centuries from now. In the \"Perfect Present\", there is no war, no racial tension, no hate. Zed's government agency works to keep the perfect present perfect, by sending agents into the past to thwart \"hags\" -- historical agitators -- whose mission is to stop disasters (think 9/11, concentration camps, etc) before they can happen, on the assumption that all these calamities were a necessary step in history in order for the perfect present to come to be. Confusing? You bet.And strangely, that's not at all what this book is really about. Much more than anything else, I'd describe \"The Revisionists\" as an espionage-thriller set in DC, filled with intrigue, shadowy quasi-governmental intelligence outfits working against one another, multiple layers of pawns and spymasters, and a reality that slips and shifts from chapter to chapter.This is not a sci-fi book, when you get right down to it. Zed's mission is the driving narrative, yet we get no information whatsoever about the mechanics of his time travel and only the barest of descriptions of some futuristic technology. Without saying anything that might inadvertently be a spoiler, I will say that the entire time travel premise is not necessarily what it appears to be, depending on how you choose to interpret certain events and passages.I was fascinated by this book, and it will probably take me some time to mull over all the twists and turns and come to terms with what may or may not have happened. I do recommend \"The Revisionists\", although I worry that its perfect target audience -- people who enjoy a good spy thriller -- won't ever discover it if it continues to be described as a time-travel novel."}, {"userName": "Jonathan", "userReviewDate": "Dec 14, 2011", "userURL": "http://www.goodreads.com/user/show/4500433-jonathan", "userReview": "I wanted to like The Revisionists. Great premise: an agent from a dystopian future (known as the Perfect Present) is sent back in history to stop agitators from stopping events that change the course of history, such as 9-11 or the JFK assassination. In our story, the protagonist Z (pronounced as the English Zed) is sent to protect a terrible war known as The Conflagration. This sets off my first bone with the story, so I'll just get it out of the way: we're told that Z has to make sure this war happens within a deadline, giving the story the urgency that a thriller needs. I mentally counted down the days as Z stayed in our present, waiting for the Conflagration to begin, or to at least start building...And got nothing. It seems as if halfway through the book, Mullen decided that Z was really there to ensure a series of events that would sort of touch off the Conflagration. I won't spoil it, but the steps that lead to the war in this book are flimsy. If I wanted to prevent the war, there would seem to be a dozen more likely targets in that distant somewhere future in which he set the war. This drains the story of its urgency right before the important third act. I think this decision doomed the story to a fizzle of an ending. I don't know why he decided to do this, but it's disappointing.Pacing is this story's greatest enemy, but other problems creep in, as well.Some reviews said that the characters are indistinguishable at the front of the book. I don't agree. They all seem to have their reasons for doing what they do, along with emotional landscapes. The problem is that almost all are entirely unlikable, such as the moronic former CIA agent Leo, who stumbles his way through the story doing selfish, stupid things and never learns from his - or others' - suffering. I didn't buy Z's \"redemption\" either, but I think that's partially because of another problem with the story: too many POV characters. We jump between the heads of four characters, some of which are only tenuously connected. I found myself frustrated as I settled into one POV only to be ripped into another, possibly in a different part of the story, making us catch up with events from which he cut away. In the case of Z, we never see the actual events that lead to his redemption, just a few hints when we're in his POV. Again, the plot had potential, but it seemed like he had trouble deciding which elements should rule: political thriller or romance? Combining the two is very tricky, but it can work. Unfortunately, it doesn't work here. The romantic elements drag away the urgency as soon as they hit, and in the end the thriller elements feel sacrificed to those parts. The ending itself provides a big hint of what knocked the plot down a few pegs, as it focuses on the character at the center of the romance subplot...or plot. It's never clear which is which. But it's not all bad. Good premise, at least one intriguing character, another character who has a complete arc and grows, and some interesting sci-fi elements. It desperately needed a rewrite. If you like dystopian fantasy it's worth checking out, but with the caveat of all of the issues mentioned above."}, {"userName": "Ryandake", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/4057623-ryandake", "userReview": "i'm trying to figure out why i found this book kind of... boring.it's an interesting setup: guy from the future comes back to present-day Washington D.C. with a mission to make sure that certain events leading to a cataclysm continue to happen. our protag, Z., is sort of like a spook doing a nasty bit of wetwork for a good cause. or so he believes.our contemporary characters, Tasha, Leo, and Sari, are all folk mixed up in things they really don't understand, but which all lead back to Z.until we find out that Z. also may not actually know what's happening...the characters are all decently-drawn enough, each with their own desires and skeletons in the closet. but i found it quite impossible to actually warm to any of them. they somehow felt flat to me.and the plot, which gets murky from time to time, with the left hand not knowing whose hand wields the gun-with-silencer, moves along at a respectable clip. occasional forays into polemic or philosophy can be skimmed, since they don't strike me as particularly deep. Mullen's themes are intriguing--do we know how much we are truly free agents? what are we allowing, through inattention, our government to get away with? why are corporations increasingly quasi-government agencies, and what does Blackwater mean, anyway? yet i feel the themes were all on the surface--they didn't play out in the characters' actions.in total, i guess the flatness of the characters, the muddle of the plot, and the disconnection of the themes from the bones of the story just leave me feeling rather like i'd just read a political screed warmed over and served as a novel."}, {"userName": "Alan", "userReviewDate": "Apr 03, 2012", "userURL": "http://www.goodreads.com/user/show/1153204-alan", "userReview": "Apparently, time travel is easy, once you stumble across the trick. The hard part is making your past hold still, afterwards (assuming that \"afterwards\" continues to mean something). The past you remember from yesterday may not be the past you will have had tomorrow, especially once your opponents start using their own versions of the same trick. This book could easily have been called The Santayana Inversion—those who can remember history are condemned to enforce it—though I'll admit that The Revisionists is a better title.Zed is an agent of a possible future which has learned the trick of time travel. The Perfect Present is a utopian society that arose from the ashes of the great Conflagration, an event slated to have occurred sometime in our near future—exactly when isn't specified, but it's a lot closer to our time than to Zed's. Only by allowing the old order to burn itself away (and then cauterizing the stump) can Zed's perfect present—technically advanced, freed from nationalism and racism, orderly, and committed to a more sustainable, less materialistic way of life—come into being. His mission is simple, really: Zed is one of those who ensures that the Conflagration takes place, despite its cost to us, we \"contemps\" (only one letter away from \"contempt,\" which is telling) living obliviously in our 21st-Century \"beat.\"Sometimes the money quote comes late in a book:\"So when that utopia comes, people like you will be out of work, huh? That must mess with your motivations.\" (p.351)Zed is not at all likely to work himself out of a job. Even Perfection has enemies. Historical agitators—hags—have stolen the government's time travel technology, and are using it to disrupt the very Events that Zed is dedicated to preserving. And even though time is surprisingly resilient, and even though Zed is carrying around a headful of helpful technologies, it's getting harder instead of easier to push back the hags. Eventually it starts seeming as if almost everyone is a revisionist of one sort or another...The Revisionists is slow to get rolling, verbose, and—for a time-travel thriller—oddly uneventful. This is understandable, to some extent—Zed's mission, after all, is to preserve the status quo against all comers. And plenty of things do happen eventually... but the pace still seems slower than it needs to be, especially in the first half of the book.My other major problem with the book primarily involves how Mullen handles the technology he posits for his time travelers. Early on, for example, Zed takes a convenient blow to the head, which disables just enough of Zed's internal devices to make the story more interesting. That seems awfully contrived.Another bit of future tech, the \"flashers\" Zed and his colleagues use to dispose of inconvenient corpses, leave burn marks like spontaneous combustion or a mini-IED. This is, after all, a thriller of sorts, and like all such is full of failures of imagination, replete with murders committed where persuasion might actually have worked instead. But surely the rash of such traces occurring in the D.C. area would make some contemps nervous? Or are Zed and his fellow agents simply relying on no one ever connecting the dots?The technology really isn't the point, though. Unlike a more traditional time-travel novel, The Revisionists focuses on the small scale, showing us relatively little of the great sweep of history or of the consequences of Events gone awry. Zed's lonely vigil and memories of personal loss lead him to try to connect with contemporary souls, in defiance of his own department's rules. Their own lonelinesses lead them to respond.It is in those small spaces where Mullen's novel really shines—when he's writing about 'Troy Jones' and Tasha Wilson, for example, or in perceptive lines like this one from p.80: \"I remember once you called me a very skilled actor. At the time I was so full of myself I took it as a compliment.\"The grand central themes of this book, to the extent that it seems to have any such, are twofold: first, some version of the adage, \"The perfect is the enemy of the good\" (Voltaire), and, second, the weary observation that no one—not Zed, not the hags, not the contemps who live in our own beat—has a dependable grasp on the big picture. Everyone in Mullen's world is a would-be revisionist, but no one has the perfect knowledge and detached perspective necessary to revise reality with a clear conscience.The Revisionists may founder from lack of focus—it's not quite thrilling enough to be a thriller, not scientific enough for a science-fiction novel, nor yet romantic enough to be a time-tangled love story—but I thought it picked up speed in the second half and ended up having some worthwhile things to say. Even if it could, perhaps, have used a little more... revision."}, {"userName": "Steve", "userReviewDate": "Sep 14, 2011", "userURL": "http://www.goodreads.com/user/show/322183-steve", "userReview": "This is a pretty good story in various ways. But as another reviewer has noted, \"Without saying anything that might inadvertently be a spoiler, I will say that the entire time travel premise is not necessarily what it appears to be, depending on how you choose to interpret certain events and passages.\" Too few reviewers here appear to appreciate that.Maybe the most important paragraph is halfway through the book, when one of the supporting characters gives a somewhat random little speech about a president as \"an unreliable narrator,\" which ultimately isn't really about presidents after all:\"He's the one who tells us how it is, right? And we fall for it, we read along with his story and let him construct the reality around us. We want to be entertained, soothed. Until one day, we hit that certain chapter, right, and suddenly we see the light and realize, Holy shit, we've been lied to the whole time. Reality ain't like that at all. His story was bullshit. But by then, it's too late. We've all been suckered, and we just have to follow along with his little plot.\"I think author Thomas Mullen has just told us here how to interpret things.Consider this book if you're open to science fiction and time travel stories, but don't read it FOR the time travel aspect. Read it instead for a story with some good plot twists, interesting characters, and brief narrative consideration of some worthwhile ideas.Or, you know, read something else if you want. I'm not saying it's magnificent. But it is pretty good."}, {"userName": "JBP", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/143331-jbp", "userReview": "The fact that it took me about three weeks to slog through Thomas Mullen's sort-of time travel book should tell you how much I liked it. A few nights, battling the desire to sleep, I forced myself to pick it up only to find myself about to drift off to sleep soon after. My reading pace was slow due to the book's meandering quality and the fact it doesn't have much action as it tells the story of multiple characters as they connect and disconnect with one another in Washington DC. Lifeless. Dull. Characters that aren't really all that captivating. The false promise of one of my favorite sci-fi elements--time travel--also gets the short shrift. Mullen, I read online near the end of the book, isn't really a fan of science fiction and you know what? It shows. It's almost as if he put in the whole time travel aspect as a gimmick to put these people together in the story. Give me fun, action-packed, low-brow time travel story any day over a ponderously plotted dud like this. I just didn't like it at all!"}, {"userName": "Jennifer", "userReviewDate": "Jun 17, 2012", "userURL": "http://www.goodreads.com/user/show/7716395-jennifer", "userReview": "I read this book twice- and I still can't figure out just who the main character really is. You think you know who he is, until nearly the end, and then a big curveball comes along. I found myself going through an internal debate- either he's really Zed from the future borrowing Troy Jones' identity, or he's really Troy Jones, from Philadelphia, who think that he's Zed from the future.The premise of the story is that the main character, Zed, has been tasked with making sure the future really happens the way that it happened. Other individuals (or Zed believes that other individuals) are attempting to make sure that the future doesn't happen the way that it happens, because that might jeopardize a perfect future in which humankind lives in perfect harmony- or so we're told. But it becomes apparent that the perfect future maybe isn't so perfect- if in fact, it is the real future. Confused?"}, {"userName": "Julie H.", "userReviewDate": "Oct 05, 2011", "userURL": "http://www.goodreads.com/user/show/1492430-julie-h", "userReview": "The Revisionists was positively brilliant in concept, but not as outstanding in execution. I read it, I forced myself to finish it, but it bailed in a mishmash of uncertainty as to what was happening--and not in an acceptable way given my investment of 400+ pages of attentive reading. Admittedly, I brought to the encounter some very high expectations. Sadly, they were not met. If you're a sci-fi or alternative history fan, there are better books out there, but don't necessarily take my word for it. The whole time that I was reading this, I was casting it as a movie and--suprisingly--trying to figure out ways to improve the context for certain actions/decisions. (And that's not usually the way the shift from book to movie goes.) Mullen is a good writer, and I'm not ready to give up on him just yet. I'll give him a second chance--and you should, too--but this one just didn't live up to the hype for me."}, {"userName": "Fred Hughes", "userReviewDate": "Dec 08, 2015", "userURL": "http://www.goodreads.com/user/show/7119280-fred-hughes", "userReview": "A soft ending, but other than that lots of action and thinking. Two groups from the future are trying to protect the status quo as they see it. One group, the Revisionists, want everything bad that happened to contribute to happen. The so called hags want to fix all the bad things that contributed to the status quo.Which group is right ?One of the Revisionists is starting to change his mind about what is right and wrong. But is it too late to change things ?You'll just have to read it to see"}, {"userName": "Terra", "userReviewDate": "Apr 21, 2011", "userURL": "http://www.goodreads.com/user/show/854870-terra", "userReview": "THE REVISIONISTS has got that amazing, and incredibly difficult combination of spot-on realism (and real life issues that will make you THINK), plus an astoundingly complex, real-feeling, imaginary-world element to it too. Mullen put a lot of thought into this book, and it absolutely shows."}, {"userName": "Kadir Kılıç", "userReviewDate": "Dec 21, 2015", "userURL": "http://www.goodreads.com/user/show/39801714-kadir-k-l", "userReview": "Beklediğimden daha güzel geçti kitap.Kitapta çok geç tahmin ettiğim için çok şaşırdığım olaylar oldu.Kitap ABD'de geçmese 5 puanlık kitap."}, {"userName": "Dwight Davis", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/4591728-dwight-davis", "userReview": "This book feels like if a sophomore philosophy major just discovered determinism and thought it was like, totally deep man and also liked James Bond and hated politics and especially hated liberals and millenials and decided to write a really bad novel. It thinks it's brilliant and full of astute observations about human nature and technology and philosophy but really it's just a bag of potato chips: you keep eating until the bag's empty and then you feel sick from the empty calories."}, {"userName": "Paul", "userReviewDate": "Nov 30, 2011", "userURL": "http://www.goodreads.com/user/show/4882193-paul", "userReview": "This is an interesting time-travel story in that it is less concerned about the future, from whence the time-traveler comes, than with the present we live in. A \"protector,\" an operative of some future government's security services, is sent back to present-day Washington DC to ensure that various calamitous events leading to a worldwide conflagration occur on schedule, thereby ensuring that the future is unaltered. You see, other forces in the future society are also sending operatives back to our time, but these operatives are trying to undo key events, prevent the conflagration, and make a different future. The glimpses we get of the future society are disturbing, and it is hard to believe anyone living in it wouldn't want to see it changed, even if it meant their grandparents had never met and they no longer existed ... it sounds something like present-day North Korea. But our operative, Z, is determined to do his job and do it well ... until he begins to get involved with the contemps.The story is told by Z and three present-day inhabitants of Washington DC. The three contemps are important if unknowing actors in the key events the future government wants to protect. As Z gets more and more involved with them, he begins to doubt the importance of what he's doing, and to understand why others from his time time want to change the past.We never find out what happens to the future, and that's okay. The interesting action is what's happening today, with a burgeoning number of essentially uncontrolled and lawless clandestine contractor security firms operating in American society, spying on domestic citizens with impunity, all under the guise of the Patriot Act and the \"war on terror.\" Really, the novel is about what's going on now, and its grim hints of a totalitarian future are a warning that if we don't stop these security excesses we are going to get exactly that future, because power loves nothing more than looking out for itself, and, as George Carlin would say, it doesn't give a shit about you, or me, or life, liberty, and the pursuit of happiness.That's not to say the science fiction angle to the story is slighted. In fact, the more you realize the pickle Z is in, the more you begin to suspect his future masters sent him back in order to be part of the events leading to the conflagration that makes their future totalitarian society possible ... he's meant to be expendable, but damn it takes him hella long to figure that out!The Revisionists is an involving and exciting read, right up to the last few pages, where it inexplicably begins to drag ... the death of one of the contemps, Leo, goes on for several maudlin pages, and for some reason the author insists on giving us romantic closure between Z and another contemp, Tasha. Frankly, I thought the romance between Z and Tasha detracted from the story, as did Tasha's quest to find out more about her brother, killed in action in Afghanistan (his story, when Tasha finally learns it, is even more distracting and unsatisfying ... you wonder why Mullen even bothered to include it in the novel).But these are minor quibbles. I quite enjoyed the book, and if Mullen's intent was to make readers sit up and take notice of the out-of-control growth of the domestic American security apparatus, he succeeds in a most gripping way."}, {"userName": "usagi ☆ミ", "userReviewDate": "May 30, 2011", "userURL": "http://www.goodreads.com/user/show/1101220-usagi", "userReview": "Just a warning, guys, if you don’t like books that make you think, you should probably avoid this one. This is not exactly the most feel-good book of the year, but it is one of the most thought-provoking. It’s puzzles within puzzles, and it asks us what history really is – is it fashioned by the victors? The losers? And are we all just footnotes in something larger? I had a lot of fun with this book, that’s for sure.I do have to say, though, that the first part of the second half of the book did get a bit muddled in politics and the turf wars between all of the different American clandestine intelligence divisions, as well as the question of the real identity of Troy Jones (and why is he so important?), and then there’s an overlaying of the layer of is Zed going native (well, in terms of time), what really is the Perfect Present, and so forth. This is not an easy book to navigate, but it is very thrilling, and full of adventure. The character cast is pretty large, but it’s not difficult to keep track of everyone, and Mullen very masterfully connects the dots in the webs-within-webs of characters that he’s created. Once the pieces started coming together, it was really quite impressive, and I enjoyed myself even more. And the way Mullen phrases certain events (like the way he phrased 9/11) is absolutely chilling in its clarity and startling to behold. But not off-putting. If anything, it just made me want to finish the book faster, devour the story quicker, and understand everything he was trying to say with Zed’s journey.I really liked the fact that the author, through the voice of Zed/Troy Jones and other characters was really challenging us to think on what defines history and how small we are within the passage of time. How everything can be changed in a moment – turning left instead of right, talking to someone you don’t know instead of not, and how all of this can literally change your future (and past) and present all at once. He doesn’t muddle us down with the actual science of time travel itself, so I think that for the average thriller and/or sci-fi fan, this will be pretty easy to navigate, but if you’re not really into time-travel books, it might get a bit confusing. Hell, it’s confusing for Zed/Troy Jones himself, and he more than once questions if this is all just a delusion he’s cooked himself into rather than real life, or a mindgame that his co-workers are trying to angle him into. Mullen is not afraid to really mess with his characters’ minds, and that’s refreshing. Torturing one’s character is not easy to do, but when you do it, it shows you’re dedicated. And I like that in my authors.Even with the minor confusion in certain points in the book, and the question of what the Perfect Present really is (or how far it is from now) never being answered, I really enjoyed this book. This book is about the ones who go back to make sure history happens, and Mullen portrays that story well. My own questions about this future don’t really matter because they were never the aim of this book. Definitely a book you should read when you get some serious time you can set aside for pondering and mulling over after you’ve reached the end.(posted to librarything, goodreads, shelfari, and witchoftheatregoing.wordpress.com)"}, {"userName": "Grace", "userReviewDate": "Oct 29, 2011", "userURL": "http://www.goodreads.com/user/show/102840-grace", "userReview": "Author: Thomas MullenTitle: The RevisionistsDescription : The books opens as we meet Z, a “revisionist” who has been sent from the “Perfect Future” to make sure that the future stays that way. His opponents are the “hags,” time-traveling rebels who attempt to change the future by preventing certain events from happening. After Z makes sure that a certain journalist will indeed be murdered, the point of view shifts to three other protagonists: Sari, a beautiful young Indonesian domestic worker who is trapped in her horrific employment by her lack of documentation and her inability to speak or understand English; Leo, a former CIA agent who, a bit at loose ends after his CIA gig went bad, works for some kind of intelligence-gathering company; and Tasha, a lawyer on the fringes of activism who is of interest to both Leo and Z.Review source: NetgalleyPlot: The plot is riveting. Even though the action alternates among the four main characters, the reader is not confused about what’s going on. Mullen manages to describe the action clearly without revealing motives too soon. During a good amount of the book, the reader wonders how all four of these characters will eventually connect, but there is no doubt that will eventually happen.Characters: The four main characters form two loose couples: Z and Tasha know one another, and Leo and Sari know one another. As the point of view moves from one to another, each character reveals enough of his or her past to become familiar and sympathetic to the reader. Z is the only character who is written in first-person, and there is no doubt that he is the primary protagonist. He also has the most backstory, though all of the characters have some history.Writing style: This was my first book by Mullen, and I thought it was brilliant. He kept the plot spinning, drew the characters finely, and still managed to ask the big philosophical questions that make a book memorable. Audience: While its genre is technically time-travel sci fi, this book will be of interest to readers of literary fiction as well.Wrap-up: What is the nature of history? If people lose their past, how much of themselves do they lose with it? Is murder ever justified? Do we live in the best of all possible worlds? These questions are the kind that keep getting raised by this book; all the while we’re trying to fight off fiendish bosses, mourning lost loved ones, and trying to figure out the moral conundrums of postmodern life with the characters of The Revisionists. 4/5*"}, {"userName": "Lee", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/9914336-lee", "userReview": "The Revisionists is that rarest of rare birds...a literary Sci-Fi novel. And it's a really good one too, deserving a place on the shelf along side the likes of A Handmaid's Tale, Cloud Atlas, The Sparrow, Oryx & Crake, The Book of Strange New Things.Zed is an agent sent back in time to preserve events as they had already happened, while there is a subversive group going back in time to try to alter the future. A \"Cataclysm\" is mentioned and even though a shit ton of people died, this must be preserved in order not to compromise the perfect world humanity has constructed out of its ashes. Thus begins a kind of conspiracy thriller sort of plot involving several present day people (\"contemps\") and others sent back from the future. For some reason I had expected a more freewheeling adventure type story, but it has more of an elegiac tone, though certainly not stiffly written and overwrought like books with similar themes (looking straight at you, The Age of Miracles).The writing is in fact quite exquisite, smart, erudite, poignant, yet concise, with precise language, but there is also a looseness to the writing that is natural and not the slightest bit belabored or pretentious (looking in your direction once more, Age of Miracles by Karen Thompson Walker). The viewpoint shift between four diverse, incredibly well drawn characters. it was a real treat to get into the minds of four fictional characters in one book that are not only vivid, but have their own distinct ways of thinking and interpreting the world around them. Bravo, Thomas Mullen, for some great, perceptive character development. Very very minor weaknesses: The future world seems like standard Orwellian Big Brother stuff. Almost a cliche of Utopian societies where everyone lives in perfect harmony and it seems great except for the fact that no one gets to actually, you know, be human. And any deviation from the norm can get you Taken Away. Also, I liked, but didn't quite love, the way it all wrapped up.That said, I really enjoyed this novel and would strongly recommend it it, particularly to anyone who is a fan of the books mentioned in the first paragraph. This is my first book by Thomas Mullen. Mullen seems to genre hop to some extent with his books, which I totally respect, and I plan to search out all of them, as he is a really gifted writer."}, {"userName": "Leanna", "userReviewDate": "Aug 19, 2012", "userURL": "http://www.goodreads.com/user/show/6178789-leanna", "userReview": "[what Zed's world was really like - we got hints when Wills described things as continually being changed to benefit the select few rulers, but what exactly was it like? I'd be interested to know. (hide spoiler)]"}, {"userName": "Lauren Smith", "userReviewDate": "Sep 19, 2011", "userURL": "http://www.goodreads.com/user/show/2109160-lauren-smith", "userReview": "Zed is a government agent from a future he knows as ‘our Perfect Present’, a semi-utopia built out of the ruins of ‘the Great Conflagration’ – a global disaster that occurs in our own time and begins in Washington D.C. It’s Zed’s job to ‘protect the Events’ – key moments in history that eventually lead up to the Great Conflagration and need to occur if the Perfect Present is to be realised.Leo too is a secret agent doing morally questionable things in the name of national security. He was kicked out of the CIA after daring to actually ask moral questions about his work, and he’s now employed by a company that handles outsourced intelligence operations.Tasha is a hard-working young lawyer in a corporation with powerful but shady clients. Her brother was recently killed fighting America’s war with Iraq, and she suspects that the military’s story about his death is just a cover-up for something more sinister and most likely profitable. So when she stumbles across confidential information suggesting that one of her firm’s clients may have let soldiers die just to cut costs, she risks her career by leaking the information to the press.Sari is an Indonesian immigrant who has practically been enslaved by an abusive South Korean diplomat and his wife. Powerless to do anything about it, she agrees to spy on the couple in return for help.The stories of these four characters intertwine in Washington D.C., in a post 9/11 world characterised by paranoia, innumerable secret agents, anti-war protests and the question of whether the US government is protecting its citizens or its own power. This plot has the potential to be a dense political thriller, but it turned out to be a sophisticated literary novel about how to deal with the past and the individual’s role in an incomprehensibly complex and powerful system.Read the full review on my blog Violin in a Void"}, {"userName": "Luanne Ollivier", "userReviewDate": "Nov 07, 2011", "userURL": "http://www.goodreads.com/user/show/1621569-luanne-ollivier", "userReview": "When I first started to read The Revisionists by Thomas Mullen, I immediately thought of the film/novel The Adjustment Bureau . Although there are similarities in the beginning, The Revisionists takes the story much farther, questioning many things in our society, but the ultimate question is - does the means justify the end?Operative \"Z\" is from the future - a time they call the Perfect Present. His job is to make sure that things progress as they should - marching towards the Great Conflagration the marks the beginning of the Perfect Present. But others, known as hags (historical agitators) are also ﻿working - but to alter events and therefore change history. Although he is supposed to leave no trace of having been there, Z finds himself involved with Tasha - a young lawyer whose brother died in Iraq while serving in the military. As she questions the government's role in his death, Z begins to question his own society and sacrifices in fulfilling the role he has been assigned. An almost parallel story is of Leo, a disillusioned operative who also questioned his role in the CIA and left under cloudy circumstances. He too see a chance for redemption when he offers to help a young Indonesian woman escape her tyranical employers.Although The Revisionists falls under the sci-fi umbrella, I really found the time travel aspect to be a vehicle for an exploration of what is happening in the world now and what the future may hold for the global village. The characters's explorations of their own beliefs, emotions and actions will provide many questions readers will find themselves asking.I read the ending more than once, as I think it could go several ways. I quite enjoyed the uncertainty Mullen left me with. This was definitely a different read for me."}, {"userName": "Lydia Presley", "userReviewDate": "Sep 04, 2011", "userURL": "http://www.goodreads.com/user/show/50581-lydia-presley", "userReview": "Original review posted hereLately I seem to be reading a lot of time manipulative books. Between The Revisionists, The Map of Time and the newest Lawhead series, someone seems to have put out a memo screaming … “MESS WITH TIME, IT WILL MESS WITH YOUR READERS!”. Because that’s what messing with time does; it messes with my head.The Revisionists is a fascinating look at “what if”. What if you could go back in time to fix a wrong, to stop Hitler, to prevent the assassination of Lincoln.. you get the point. What if, in fixing those wrongs and saving those lives – from one to millions, you changed a world that was “perfect” in the future to an “unknown” type of future. Would it be worth it? Who makes that decision?Thomas Mullen deals with those questions and more in The Revisionists. The “good guys” are those who are going back in time to stop the past from being rewritten. There’s action, adventure, quite a bit of science and a whole lot of fun in this book. But, again, it messed with my mind, as all time traveling stories seem to do.I think, though, that The Revisionists puts a really new, interesting twist on it all. It addresses new and old political crises, as well as puts the reader in the spot of needing to choose a side as they read through the story. Fascinating book and I’ll be on the lookout for more from Mullen in the future."}, {"userName": "Lisa Murray", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/955919-lisa-murray", "userReview": "I was really torn between ranking this at a 2 or a 3. Why? I liked it, but it was a really bumpy ride. More than once I considered putting the book away, but I had just enough connection to 1 or 2 of the characters that I kept going. Pieces of this were really strung together as the reader bounces among all the characters. I struggled to determine motivations and even in my 'willing suspension of disbelief' I was frustrated. I felt like I needed a chart showing how each of the characters relates and where they originate from. But of course that couldn't be done since the actual situation was shrouded in questions. Was this a true time traveler or an intelligence agent with schizophrenia? Was this telecom industry deal something real or imaginary? the servant who is guided by her mother's ghost only blurs the lines of reality even further.I didn't need to know what really happened or how each person was motivated. But at the end of an action-based book I expect to have a better idea of what I just finished reading. This wasn't set up as a drama that explores relationships or disease and yet it does just that within the typical action-packed, shoot them up adventure genre tossed into a science fiction context. Not a bad book, but not a satisfying read either."}, {"userName": "Joanne", "userReviewDate": "Nov 08, 2011", "userURL": "http://www.goodreads.com/user/show/655304-joanne", "userReview": "Loved this thriller at first, but it sort of petered out towards the end. Great premise: that a post-conflageration utopian government sends people back in time to protect historical events so that the utopian future can be preserved, since historical agitators (aka \"hags\") also go back in time to try to disrupt them. Reminds me of The Adjustment Bureau, and was apparently similar to the plot of the Terminator movies too (?). Anyway, one of the Protectors likes to muse about God and Free Will, as well as the morality of letting bad events such as 9/11 or the Great Conflageration occur, where lots of people die, in order to preserve the future. The NSA and CIA and FBI all get involved, and there's a love story. Also, in good SF tradition, some commentary on contemporary society, e.g., \"Here he was, in a cramped Glover Park apartment that struggled to contain all the brilliant theories and witty takes on society that its partyers were offering\" (p. 61). Different from The Many Deaths of the Firefly Brothers, but good. Looking forward to the next Mullen offering."}], "description": "A fast-paced literary thriller that recalls dystopian classics such as 1984 and Fahrenheit 451, from the award-winning author of The Last Town on Earth.Zed is an agent from the future. A time when the world's problems have been solved. No hunger. No war. No despair.His mission is to keep it that way. Even if it means ensuring every cataclysm throughout history runs its course-especially The Great Conflagration, an imminent disaster in our own time that Zed has been ordered to protect at all costs.Zed's mission will disrupt the lives of a disgraced former CIA agent; a young Washington lawyer grieving over the loss of her brother, a soldier in Iraq; the oppressed employee of a foreign diplomat; and countless others. But will he finish his final mission before the present takes precedence over a perfect future? One that may have more cracks than he realizes?The Revisionists puts a fresh spin on today's global crises, playing with the nature of history and our own role in shaping it. It firmly establishes Mullen as one of the most exciting and imaginative writers of his generation.", "title": "The Revisionists", "url": "http://www.goodreads.com/book/show/10789142-the-revisionists", "average": 3.37, "cover": "https://images.gr-assets.com/books/1393198658l/10789142.jpg", "reviews": 299, "authors": [{"url": "https://www.goodreads.com/author/show/43391.Thomas_Mullen", "name": "Thomas Mullen"}], "type": ["Science Fiction", "Fiction", "Science Fiction", "Thriller", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/10789142-the-revisionists", "http://www.goodreads.com/book/show/12763452-the-revisionists", "http://www.goodreads.com/book/show/10789143-the-revisionists", "http://www.goodreads.com/book/show/22616094-sapt-r-c-lar", "http://www.goodreads.com/book/show/11614292-the-revisionists", "http://www.goodreads.com/book/show/76336.The_Last_Town_on_Earth", "http://www.goodreads.com/book/show/27274326-darktown", "http://www.goodreads.com/book/show/6589672-the-many-deaths-of-the-firefly-brothers", "http://www.goodreads.com/book/show/32895284-lightning-men", "http://www.goodreads.com/book/show/31573230-atria-mystery-sampler-2016"]}