{"ratings": 12, "userreviews": [{"userName": "Έλενα Σελιώνη", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/55639590", "userReview": "A book worth reading!!!! I loved it and it made me believe in its cause from the first page!«The Right To the Truth» is about the fundamental right of every human being, the right to know his true medical condition! The book reaches out to all cancer patients who try to cope with the fact that their health is failing, as well as people who find out bad news for a loved one and feel lost and even the patient's caregivers who must deliver him the bad news...How should they do it and most importantly, why is the truth absolutely necessary, despite its bitterness? All answers in «The Right To the Truth»"}, {"userName": "Έλενα Σελιώνη", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/55639590", "userReview": "Loved this book, loved the straightforward manner it approaches such a delicate issue, the right to know the truth. In fact, it denounces the disastrous tactics of concealing a patient's diagnosis from him, or even worse, lying shamelessly to him. The author reports numerous examples from his long experience of patients who ended up completely ruined, not physically, by the oblivious state their doctors or their family members had deliberately put them into. Caught myself being 100% absorbed reading the stories by the lively narration and the author's excellent writing skills. Certainly recommend it not only to patients, but to medical - paramedical staff and relatives of patients."}, {"userName": "Tasos", "userReviewDate": "Jun 11, 2016", "userURL": "http://www.goodreads.com/user/show/52567468-tasos", "userReview": "Touching. Very useful."}, {"userName": "Τασος Καυχιτσας", "userReviewDate": "Jun 06, 2016", "userURL": "http://www.goodreads.com/user/show/16403533", "userReview": "Συγκινητικό. Λέει τα πράγματα με τ' όνομά τους, στα ίσια.Προσφέρει λεπτομερείς οδηγίες για τον τρόπο, για το πώς πρέπει να γίνεται ενημέρωση ασθενούς με καρκίνο, αφού πρώτα έχει ξεδιαλύνει κάθε αμφιβολία για την αναγκαιότητα αυτής.Με τα αντιπαραδείγματα καυτηριάζει πολλά κακώς κείμενα, ώστε να ευαισθητοποιηθεί ο αναγνώστης. Να προστατευτεί."}, {"userName": "Bory", "userReviewDate": "Jun 25, 2016", "userURL": "http://www.goodreads.com/user/show/57140118-bory", "userReview": "roman"}, {"userName": "Jason Papaioannou", "userReviewDate": "Jun 23, 2016", "userURL": "http://www.goodreads.com/user/show/57070224-jason-papaioannou", "userReview": "The book provides valuable info for the benefit of cancer patients. It isn’t written by a mere outsider, but by a medical practitioner. He discreetly blows the whistle, within some limits, of course... He bravely exposes some dysfunctional aspects of the establishment of Medicine!The author’s criticism of shoddy record keeping is priceless. His condemnation of permitting multiple resuscitations and deaths, poignant. Revelations that physicians are human and subject to temptations of their darker angels, (like Avarice, Pride, Jealousy, Covetousness, Etc.) are amazing."}, {"userName": "I.C. Papachristos,MD", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/52539628-i-c-papachristos-md", "userReview": "Interactive “author’s notes” are included in this ePub edition, instead of conventional footnotes (paperback). They were created by using the “pop-up widget.”This ePub edition is available on iBooks Store by Apple in 51 countries. Link:https://itunes.apple.com/book/id13353..."}], "description": "Provocative book reveals widespread abuse of cancer patients’ rights.\nShould\n all patients be informed when they’ve been diagnosed with \ncancer?\n If the answer is “yes,” \nWho\n should break the bad news to them? And \nHow\n is such news best delivered? \nHow much\n of the truth can a patient handle?Patients’ inalienable right to know the truth about their condition ought to be guaranteed the world over. Yet this right is routinely violated. In Greece, for example, cancer patients are frequently kept in the dark about their diagnosis. In fact, this right is routinely disregarded all over the globe with appalling consequences.In “The Right To The Truth,” the author—a thoracic surgeon—presents Counterexamples inspired by events observed during 33 years of clinical experience, and he addresses each with well-crafted Arguments \nin favor of the patients’ Right to know :\n► for Trust► for Protection from predators who would exploit vulnerable patients► for understanding that Sacrifices are sometimes required to achieve cure► for acquiring well-founded Hope ► for Overcoming fear of the unknownThe book :► offers advice to family members of cancer patients, as it is usually they who shoulder the burden of deciding whether or not to have their loved one informed.► offers thought-provoking ideas for those who care for cancer patients. Physicians, nurses, psychologists, clergy, and \nfriends\n are all urged to be truthful with patients; lying leads only to suffering.► repudiates hypocritical arguments that claim withholding the truth from patients “spares them avoidable distress,” when the exact opposite is true. The hypocrisy behind brazen deceit inevitably becomes a source of harm to the patient. Myriad unethical, even illegal, wrongdoings \nare exposed\n that they should be banned from clinical practice once and for all.—http://www.papachristos.eu/righttothe...", "title": "The Right To The Truth: For families and friends of patients with cancer", "url": "http://www.goodreads.com/book/show/36329959-the-right-to-the-truth", "average": 4.5, "cover": "https://images.gr-assets.com/books/1507484830l/36329959.jpg", "reviews": 7, "authors": [{"url": "https://www.goodreads.com/author/show/14980420.I_C_Papachristos", "name": "I.C. Papachristos"}, {"url": "https://www.goodreads.com/author/show/2966722.Peter_Goldstraw", "name": "Peter Goldstraw"}, {"url": "https://www.goodreads.com/author/show/17162659.George_A_Rossetti", "name": "George A. Rossetti"}], "type": ["Health"], "outlinks": ["http://www.goodreads.com/book/show/36329959-the-right-to-the-truth", "http://www.goodreads.com/book/show/30359816", "http://www.goodreads.com/book/show/36322419-the-right-to-the-truth", "http://www.goodreads.com/book/show/38203601-the-right-to-the-truth", "http://www.goodreads.com/book/show/29074833-differential-clinical-significance-of-medical-information"]}