{"ratings": 406, "userreviews": [{"userName": "Linda", "userReviewDate": "Mar 23, 2015", "userURL": "http://www.goodreads.com/user/show/1790184-linda", "userReview": "This is book #5 in Christy Barritt's Squeaky Clean Mystery series and I swear that the books just keep getting better! This was my favorite so far and it was really dramatic and tense. It read like an episode of Criminal minds. Gabby isn't looking for any mysteries this time. She's just concerned with getting crime scenes cleaned up with her main helper away on s honeymoon. But her fiance Riley was a top prosecutor in California before he moved to Virginia to a practice to help others less fortunate. But a serial killer he put away in his old life has escaped prison and is a very wily cold-blooded killer. He has determined to make Riley pay by going after anybody close to Riley, and in turn, to anybody close to Gabby. The suspense in this book is fierce! In one scene I just shuddered when Gabby awoke in her bed to find the serial killer on top of her. And the final scene is enough to give one nightmares!"}, {"userName": "JaneReads", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/5179050-janereads", "userReview": "This book was tense. Not one to read before going to bed because you just might not be able to sleep. Every chapter ends with a cliff-hanger which drew you into wanting to continue reading to find out what was going to happen next. A serial killer has escaped from prison and has Riley and Gabby in his sights and always seems to be one step ahead of them. When Riley and Gabby found the murderer's hideout I was on the edge of my seat waiting to see if there were going to be able to catch him or would the he follow through on his revenge plan. I liked the ending, but I have a feeling that this might not be last we have heard of this killer. I look forward to the next book and hope Riley and Grabby finally get their happy ending."}, {"userName": "Suzie", "userReviewDate": "Oct 01, 2013", "userURL": "http://www.goodreads.com/user/show/7431258-suzie", "userReview": "I know I've said this in pretty much every review I have posted on The Squeaky Clean Mysteries series but I love this main character. Gabby St. Clair is intelligent, up on her pop culture and musicals and humorously sarcastic and snarky. She reminds me a little bit of Veronica Mars.In \"The Scum of All Fears,\" we get to see a little more involvement from Riley Thomas, Gabby's fiance, as well. Gabby and Riley seem to be working more as a team in this book and it works. It shows how their relationship has evolved. It's been a pretty full year for Gabby and Riley as all five books take place over the course of a year but I really hope there will be more of their adventures in the future."}, {"userName": "Laura", "userReviewDate": "Jan 29, 2016", "userURL": "http://www.goodreads.com/user/show/2521894-laura", "userReview": "THE SCUM OF ALL FEARS is book five in Ms. Barritt's Squeaky Clean Mystery series, but it easily stands alone. THE SCUM OF ALL FEARS is edge of your seat fiction that held my attention from start to finish. Scary at times and with plenty of twists I never saw coming. This read a lot like a horror -- almost two scary for me. I was totally engrossed though and couldn't put it down. I enjoyed getting reacquainted with Gabby and Riley and going through this mystery with them."}, {"userName": "Cathy Daniel", "userReviewDate": "Oct 14, 2013", "userURL": "http://www.goodreads.com/user/show/7218096-cathy-daniel", "userReview": "This one was creepy since it involved a serial killer but an excellent book! As always! I hope this series doesn't end for a long time."}, {"userName": "Lyndi", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/1849994-lyndi", "userReview": "A super quick read. Gabby is growing up a little and not quite so willing to jump and search for mysteries herself. She is trusting others a little more in this book. Plus, this is the first book in this series that you know from the beginning who the killer is. Only bad part is this mystery isn’t completely wrapped up and now I have to go on to the next book to find the answer. I suppose there are worse things in this world than being stuck reading yet another book."}, {"userName": "Regina Watts", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/50795888-regina-watts", "userReview": "Great StorylineI love the storyline with making it appear there could be several accomplices. I would recommend this to those who love a murder mystery romance."}, {"userName": "Sherry Sellers", "userReviewDate": "Apr 28, 2017", "userURL": "http://www.goodreads.com/user/show/62642767-sherry-sellers", "userReview": "Love this seriesGreat book in this series. Can not wait to read the next book in this series. Thank you for writing these books..:) :):):)"}, {"userName": "Liz Lovesrainbows", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/3744237-liz-lovesrainbows", "userReview": "Wonderful, slightly funny Christian murder mystery!! Each one is slightly stand alone but work much better read in order."}, {"userName": "Nicole Couch", "userReviewDate": "Aug 23, 2016", "userURL": "http://www.goodreads.com/user/show/56298084-nicole-couch", "userReview": "Good, but too intense for meI've enjoyed reading the previous 4 books in this series, they're written well, quickly get into the main story & keep your interest. Book 5 had all of these qualities, but was just way to intense for me to consider it to be a \"cozy\" mystery. And maybe that's not what the author intended. It was too scary (for lack of a better word) for me to enjoy. That said, the book was clean as far as language & morality go."}, {"userName": "Doreen Marr", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/39211932-doreen-marr", "userReview": "Christy has done it again with Book #5 in her Squeaky Clean Series! Gabby, crime scene cleaner, seems to run into trouble everywhere she goes, but this time trouble comes to her from out of Riley's past. Will a serial killer be able to scare Gabby off? Will Riley and Gabby be able to stop him before he kills people close to Gabby? I love reading mystery with a little romance thrown in, and this one kept me on the edge of my seat, wondering what would happen next."}, {"userName": "Jo Ann Tiller", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/32052254-jo-ann-tiller", "userReview": "Another great Squeaky Clean read!As usual Gabby and Riley are good together; Tim remains an interesting and fun addition. This story was quite suspenseful, but still a quick, easy read. I recommend these books to anyone from teens and older who loves mysteries and crime solving. The Christian growth in Gabby is great; she reminds us to pray all the time too.I gave it four stars because at times the actions and/or thought processes were a little wordy. But still a fun read."}, {"userName": "Rose De Reamer", "userReviewDate": "Oct 30, 2014", "userURL": "http://www.goodreads.com/user/show/36444636-rose-de-reamer", "userReview": "Suspense for a lazy day.That Gabby Sinclair books are a great way to spend some down time. They have suspense that keeps you guessing. There is also subtle romance that makes you wish you were Gabby. The stories also include biblical principles on wholesome living- which seems to be almost a thing of the past. Am already looking forward to reading the next book in this series."}, {"userName": "Katharine Showman", "userReviewDate": "Jan 07, 2016", "userURL": "http://www.goodreads.com/user/show/11256818-katharine-showman", "userReview": "I love the suspense in Christy Barritt's books. The Scum of All Fears was scary from the first page! Gabby learns a killer has escaped who tortures and murders women. It seems to be starting again. How will she find the women who have been abducted? Why is he choosing these women? It is suspenseful until the last page. Read to find out what happens."}, {"userName": "Julia Lance", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/35943853-julia-lance", "userReview": "This book introduces you to a serial killer. He follows Gabby around, threatens her and sneaks into her apartment. It will have you creeped out and on the edge of your seat but you still won’t want to stop reading. Christy has a way of grabbing your interest all while creeping you out and makes it fun!"}, {"userName": "Carol Lee", "userReviewDate": "Sep 30, 2016", "userURL": "http://www.goodreads.com/user/show/17286324-carol-lee", "userReview": "Wow, Gabby really has her hands full this time. She has to find help with her crime scene cleaning since her partner is out of time and a serial killer is after Riley. She doesn't feel threatened at first since she feels the killer will be caught before he makes it to Virginia, but soon finds out different. The suspense and scenes will leave you wanting to finish this in one reading."}, {"userName": "Claudia Rosa", "userReviewDate": "May 25, 2016", "userURL": "http://www.goodreads.com/user/show/7158549-claudia-rosa", "userReview": "Christian Suspense with a lot of action!The previous books are a lot better: Less action and more mystery!This book is so creep that gave me nightmares (serial killers is not my ideia of fun)I will continue reading the series. I love Gabi!I hope the next books will be more cozy mystery than suspense"}, {"userName": "Andrea", "userReviewDate": "Apr 26, 2016", "userURL": "http://www.goodreads.com/user/show/333533-andrea", "userReview": "I was really happy with this book getting back to classic Gabby. The mystery was back on her turf, and it was intense (a serial killer coming after you is nothing to sneeze at). I really liked the interactions between the characters, and the addition of new characters keeps things interesting. This was a fast and fun read."}, {"userName": "Marylin", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/28126915-marylin", "userReview": "If Gabby ever had an easy day it just won't be the same. This book was so full of suspense and twists that it would make my head spin. I also kept checking my window and door locks. When I finished the book I just wanted Riley and Gabby to have one calm day! Maybe that will happen in the next book. Which, by the way, I can't wait to read! Christy please write faster!"}, {"userName": "Stacy", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/1243520-stacy", "userReview": "Next in the Squeaky Clean Murder mysteries, cozy Christian murder mysteries. I think I've only skipped one that was not available on Prime. This was my Prime loan for March, will read the next one next month. This one really amped up quite a bit, with a serial killer after crime scene cleaner Gabby and her fiancé, former prosecutor Riley. Hard to put down :)"}, {"userName": "Dawn", "userReviewDate": "Jun 05, 2015", "userURL": "http://www.goodreads.com/user/show/23228031-dawn", "userReview": "I'm addicted to this series and this was my favorite book yet. Although all the books have murder in them, this book was a bit more serious and was quite the page turner. I like how the author incorporated a few Biblical scriptures into Gabby's thoughts."}, {"userName": "Dina", "userReviewDate": "Jan 01, 2014", "userURL": "http://www.goodreads.com/user/show/2062707-dina", "userReview": "Wow, this may he my favorite in the series so far. Great read! Lots of suspense.Finished 1/17/14Best in the series as far as suspense! A serial killer that Riley helped put behind bars in California escapes prison and is coming for Gabby. Absolutely love this series!"}, {"userName": "Allison Kohn", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/21184249-allison-kohn", "userReview": "This is a fast paced mystery thriller with a sense of humor midst all the fear and trembling. I recommend it to anyone who enjoys a good mystery - and doubly so to anyone who enjoys a good mystery with a Christian foundation."}, {"userName": "Terre Forsyth", "userReviewDate": "Jun 04, 2015", "userURL": "http://www.goodreads.com/user/show/37128487-terre-forsyth", "userReview": "Fast pacedI couldn't stop reading. I read it in one day had to find out what happened next. It kept me guessing who was involved, even though you who the villain was, you didn't know who was helping him."}, {"userName": "Robin Resch", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/53941237-robin-resch", "userReview": "I like that the author introduces new characters one or two at a time and does not overload the reader with new characters. Love Gabby as the hero!"}, {"userName": "Julia", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/11231376-julia", "userReview": "Squeaky Clean Mysteries, Book #5. A good story, but much darker than previous books. I missed some of the humor and characters."}, {"userName": "Bree", "userReviewDate": "Sep 12, 2014", "userURL": "http://www.goodreads.com/user/show/24445160-bree", "userReview": "Gabby has upset a series killer. Riley prosecuted a series killer back in LA. He is escaped from jail and looking at payback against Riley, with his sights set on a Gabby."}, {"userName": "Candy", "userReviewDate": "Oct 29, 2013", "userURL": "http://www.goodreads.com/user/show/5589144-candy", "userReview": "another good addition to this fun series"}, {"userName": "Ollie", "userReviewDate": "May 17, 2015", "userURL": "http://www.goodreads.com/user/show/25981057-ollie", "userReview": "It is not often that when you read a series the books get better and better, but this is the case for these squeaky clean mysteries. This book was by far my favourite!"}, {"userName": "Deb", "userReviewDate": "Jun 05, 2015", "userURL": "http://www.goodreads.com/user/show/10154615-deb", "userReview": "An intense read. Good & disturbing at the same time."}], "description": "“I’ll get out, and I’ll get even.”Gabby St. Claire is back to crime-scene cleaning, at least temporarily. With her business partner on his honeymoon, she needs help after a weekend killing spree fills up her work docket. She quickly realizes she has bigger problems than finding temporary help.A serial killer her fiancé, a former prosecutor, put behind bars has escaped. His last words to Riley were: I’ll get out, and I’ll get even. Pictures of Gabby are found in the man’s prison cell, and Riley fears the sadistic madman has Gabby in his sights.Gabby tells herself there’s no way the Scum River Killer will make it across the country from California to Virginia without being caught. But then messages are left for Gabby at crime scenes, and someone keeps slipping in and out of her apartment.When Gabby’s temporary assistant disappears, Gabby must figure out who’s behind these crimes. The search for answers becomes darker when Gabby realizes she’s dealing with a criminal who’s more than evil. He’s truly the scum of the earth, and he’ll do anything to make Gabby and Riley’s lives a living nightmare.Fiction/Mystery/Christian", "title": "The Scum of All Fears\n      \n          (Squeaky Clean Mysteries #5)", "url": "https://www.goodreads.com/book/show/18870692-the-scum-of-all-fears", "average": 4.36, "cover": "https://images.gr-assets.com/books/1384951135l/18870692.jpg", "reviews": 39, "authors": [{"url": "https://www.goodreads.com/author/show/770315.Christy_Barritt", "name": "Christy Barritt"}], "type": ["Mystery", "Christian Fiction", "Christian", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/18870692-the-scum-of-all-fears", "http://www.goodreads.com/book/show/15761785-hazardous-duty", "http://www.goodreads.com/book/show/17856528-home-before-dark", "http://www.goodreads.com/book/show/22699759-random-acts-of-murder", "http://www.goodreads.com/book/show/37943214-hidden-currents", "http://www.goodreads.com/book/show/3030218-suspicious-minds"]}