{"ratings": 8, "userreviews": [{"userName": "David", "userReviewDate": "Aug 30, 2008", "userURL": "http://www.goodreads.com/user/show/1479051-david", "userReview": "FULL DISCLOSURE: I am the publisher of this wonderful, obscure novel. It was originally published in 1923 and has been out of print until 2008. Heywood Broun is one of the great characters of the modern era - he was an active member of the Algonquin Roundtable, and was considered one of the wittiest and most intelligent writers of his time. He wrote for a wide range of newspapers and was one of the founders and first President of The Newspaper Guild. The Sun Field is highly autobiographical, with a thinly disguised main character who is Broun, another who is the woman he married (Ruth Hale, a brilliant writer and early feminist leader), and a baseball player clearly modeled on Babe Ruth. The story holds up very well, and resonates for modern readers. This edition has an introduction by novelist Darryl Brock."}, {"userName": "Jacob", "userReviewDate": "Mar 27, 2016", "userURL": "http://www.goodreads.com/user/show/20462112-jacob", "userReview": "This is a strange but charming novel by Heywood Broun, one of the most famous writers of his era but long forgotten today. \"The Sun Field\" -- out of print since it was first published in 1923 but restored by Rvive Books in 2008 -- revolves around a love triangle between the narrator, a frail newspaperman named George Wallace, the record-breaking home run king Tiny Tyler (loosely based on Babe Ruth), and the independent feminist writer Judith Winthrop (based on Broun's real-life wife, Ruth Hale.) Judith is the star of the book and its most fascinating character, and she offers significant insight into the turbulent evolution of women's lives in the Roaring Twenties. Her resistance against society's demands to make her an \"honest woman\" drive the plot -- but her impulsive marriage to the Ruthian ballplayer-hero is as unlikely as it sounds. Since the story is told from the often-jealous eyes of George Wallace, it also takes on the appearance of a cuckold fantasy, which gets old after a while. The simple-minded Tiny Tyler character is a caricature of Babe Ruth, although not necessarily an inaccurate one. Tyler's escapades on and off the field only scratch the surface of what the real Ruth must have been like. From a baseball perspective, there is some interesting foreshadowing here of Ruth's later marriage to Claire Hodgson and her impact on his life and career. Thankfully, the book is a quick read and is redeemed by Judith's vivacity and independent spirit. She is a tour de force and a memorable character in an otherwise unmemorable novel."}, {"userName": "Tammy", "userReviewDate": "Dec 07, 2011", "userURL": "http://www.goodreads.com/user/show/962385-tammy", "userReview": "Recommended in the book, Tolstoy and the Purple Chair: My Year of Magical Reading."}], "description": "A long out of print novel (originally published in 1923 and never reprinted), with a new introduction by best selling novelist Darryl Brock (author of \"If I Never Get Back\"). Heywood Campbell Broun was a well known American newspaper writer, who helped found the American Newspaper Guild. Broun championed the underdog, criticized social injustice, and supported labor unions. He died in 1939. The Sun Field is a very modern novel, with a strong feminist character, a complicated love story, and New York baseball of the 1920's at its center, with another lead character plainly modeled on Babe Ruth. Broun was a sportswriter, whose love of baseball and brilliant writing style shines through this book. A treat for contemporary readers.", "title": "The Sun Field", "url": "http://www.goodreads.com/book/show/4461593-the-sun-field", "average": 3.25, "cover": "https://images.gr-assets.com/books/1328763908l/4461593.jpg", "reviews": 3, "authors": [{"url": "https://www.goodreads.com/author/show/106121.Heywood_Broun", "name": "Heywood Broun"}, {"url": "https://www.goodreads.com/author/show/138826.Darryl_Brock", "name": "Darryl Brock"}], "type": ["Fiction"], "outlinks": ["http://www.goodreads.com/book/show/4461593-the-sun-field", "http://www.goodreads.com/book/show/3030513-the-fifty-first-dragon", "http://www.goodreads.com/book/show/6505121-seeing-things-at-night", "http://www.goodreads.com/book/show/18906418-the-a-e-f-with-general-pershing-and-the-american-forces", "http://www.goodreads.com/book/show/3028544-a-shepherd-s-whisper-with-cd", "http://www.goodreads.com/book/show/10109466-our-army-at-the-front"]}