{"ratings": 6250, "userreviews": [{"userName": "Michael", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/65909643-michael", "userReview": "This book is a sheer marvel. Set in the 1600s, it's awash in lyrical excess, bawdy humor, historical satire, human vice, roguish fools, epic intent, and pirates and Indians and prostitutes and poets, oh my! The sheer life force of this novel is amazing, the prose is masterful and wickedly funny, and the journey is like nothing I've ever been on before. Now I'll shut up and let the far more eloquent Mr. Barth take over. Here's the opening line:\"In the last years of the Seventeenth Century there was to be found among the fops and fools of the London coffee-houses one rangy, gangling flitch called Ebenezer Cooke, more ambitious than talented, and yet more talented than prudent, who, like his friends-in-folly, all of whom were supposed to be educating at Oxford or Cambridge, had found the sound of Mother English more fun to game with than her sense to labor over, and so rather than applying himself to the pains of scholarship, had learned the knack of versifying, and ground out quires of couplets after the fashion of the day, afroth with Joves and Jupiters, aclang with jarring rhymes, and string-taut with similes stretched to the snapping-point.\""}, {"userName": "Franco  Santos", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/29931457-franco-santos", "userReview": "Luego de nueve días y más de 1200 páginas puedo decir con total seguridad que El plantador de tabaco es una obra maestra. Una historia declamada por decenas de personajes variopintos que entran en escena para luego salir y volver a entrar cientos de páginas después, piratas, esclavos, indios, personajes históricos como Charles Calvert, Francis Nicholson o el mismo Ebenezer Cooke y múltiples relatos dentro de relatos. Una locura llevada a su grado máximo, en la que la identidad carece de valor real y su suplantación es moneda corriente, la virginidad es un prestigio ilusorio entre el trasfondo de la masacre entre nativos y conquistadores, el límite entre lo salvaje y lo civilizado se difumina y una intriga política tan enrevesada y desesperante que no se tiene nunca constancia de lo que sucede.La escritura de Barth me resultó extraordinaria, en especial por su manejo de los tiempos para hacer determinadas revelaciones. Cuando el libro comienza a lentificarse, saca una sorpresa debajo de la manga que propulsa la historia por unos cuantos capítulos que hacen del proceso de lectura un viaje de lo más adictivo. Sus descripciones envuelven al lector en la atmósfera del Maryland del siglo XVII e inicios del XVIII y los diálogos, aunque a veces pecan de artificiales, se sienten reales a pesar de las exageraciones propias de la sátira.Lo principal de El plantador de tabaco es la burla al sentido de la vida, de la conexión de los hechos y de la seriedad con la que (quizá) debería tomarse la existencia. Todo lo que ocurre en este relato (y en parte epopeya) es un delirio que sobrepasa cualquier esencia significativa. Barth se sienta sobre miles de años de escritos filosóficos y proclama desde la altura un nuevo orden: el caos. La endeblez de la historia y de lo que nos hace ser quienes somos. Rompe la moralidad impuesta, la ética absurda y la inocencia inconcebible y despliega una sucesión de aventuras no solo grandiosa sino también inquietante.En fin. El plantador de tabaco es una obra maestra plagada de humor, inteligencia y profundidad, que recomiendo sin dudarlo."}, {"userName": "Fionnuala", "userReviewDate": "Jun 30, 2015", "userURL": "http://www.goodreads.com/user/show/5498525-fionnuala", "userReview": "[ (hide spoiler)]"}, {"userName": "Richard Derus", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Well-loved books from my pastRating: 5 golden stars of five, with a rapturous yodel cluster The Publisher Says: Considered by critics to be Barth's most distinguished masterpiece, The Sot-Weed Factor has acquired the status of a modern classic. Set in the late 1600s, it recounts the wildly chaotic odyssey of hapless, ungainly Ebenezer Cooke, sent to the New World to look after his father's tobacco business and to record the struggles of the Maryland colony in an epic poem. On his mission, Cooke experiences capture by pirates and Indians; the loss of his father's estate to roguish impostors; love for a farmer prostitute; stealthy efforts to rob him of his virginity, which he is (almost) determined to protect; and an extraordinary gallery of treacherous characters who continually switch identities. A hilarious, bawdy tribute to all the most insidious human vices, The Sot-Weed Factor has lasting relevance for readers of all times. My Review: The book description is a bit weak-kneed, but I can't find a better one, and I detest writing the book reports with a passion.A couple months ago, I started a re-read of this book that did not go well. I sighed. I snorted. I rolled my eyes, and cut up rough whenever we got into the book's faux-antique Englysshe. I was responding to it like it was a phauntaiysee nawvelle with majgickq and other such borderline-criminal goins-on. I put it aside, and I forgot it, except to renew it online from the Port Washington liberry.Damn me anyway! Why can't I listen to my REAL self?! John Barth, my Real Self murmured, John Barth of The Floating Opera and this book which you adored thirty years ago, he deserves better than this, to which Angry Self replied, “Shut up you! Seven hundred plus pages of this phauntaaahsticall-ness will make us homicidal! Why not encourage me to read Dickens or Tolkien if all you want to is encourage me to massacre random strangers? Silence! Begone!”Damn me! What an ass! I read the first six chapters and tossed the book aside! But...I did keep renewing it....And today, today with two days left on my final renewal, to-goddam-day I pick the book up again. And I read the first paragraph/line. And oh damn me! Damn me! How beautiful, how simply and completely perfect it is, and how I wish I could boil Angry Me in oil!In the last years of the seventeenth century there was to be found among the fops and fools of the London coffee-houses one rangy, gangling flitch called Ebenezer Cooke, more ambitious than talented, and yet more talented than prudent, who, like his friends-in-folly, all of whom were supposed to be educating at Oxford or Cambridge, had found the sound of Mother English more fun to game with than her sense to labor over, and so rather than applying himself to the pains of scholarship, had learned the knack of versifying, and ground out quires of couplets after the fashion of the day, afroth with Joves and Jupiters, aclang with jarring rhymes, and string-taut with similes stretched to the snapping-point.Oh. Oh oh oh oh. I just had a crisis.Now I *could* just power through the seven hundred-plus remaining pages in the next two days, ignoring all other beings and duties...to the detriment of our carpets, as the dog would be on her own re: eliminatory functions, and the complete bumfuzzlement of my houseys as I would not be showing up at the station to fetch them...but it's not on. It's just not. This isn't a book to be got through, it is a book to be appreciated, savored, delighted in.I will await the tides of fortune washing a copy of my own back up on the shores of my private liberry. It is worth the wait. The rapturous narcosis of my first immersion has returned. Thirty years are as but a moment. John Barth is still there, his words as gorgeously deployed as ever they were. Delightful. Delightful.Damn me anyway!\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License."}, {"userName": "B0nnie", "userReviewDate": "Jul 01, 2012", "userURL": "http://www.goodreads.com/user/show/7355135-b0nnie", "userReview": "What a fun book. I'd like to compare it to Bob Dylan’s 115th Dream, but alas it's already been done. The song's plot is not all that far from what John Barth is up to in The Sot-Weed Factor, but Barth is far more (dare I say it) exhausting. This is a mock history of the real life poet Ebenezer Cooke, who wrote the Hudibrastic poem \"The sot-weed factor: or, A voyage to Maryland. A satyr. In which is describ'd the laws, government, courts and constitutions of the country, and also the buildings, feasts, frolicks, entertainments and drunken humours of the inhabitants of that part of America. In burlesque verse\".That title is sort of a plot outline for the novel, with the million little twists and turns left out.\n\nBarth's meticulous attention to historical detail and his excellent imitation of the tone and style of the 18th c. novel had me believing this world. Slightly. The plot is outrageous! There is a crazy coincidence on nearly every page. And it's so dense and complicated that you need a chart to figure it all out. On one level Barth is a serious storyteller, but he pushes his writing to the outer limits of the sensible - as in this delightful chapter heading, \"The Poet Wonders Whether the Course of Human History Is a Progress, a Drama, a Retrogression, a Cycle, an Undulation, a Vortex, a Right- or Left-Handed Spiral, a Mere Continuum, or What Have You. Certain Evidence Is Brought Forward, but of an Ambiguous and Inconclusive Nature.\" If you read this book with a straight face it's very satisfying - but a silly grin with occasional laughter works too.Ah, except for poor Joan Toast.It's like this song - you can laugh...or just go with it.There are stories within stories, characters within characters, plots within plots. Books within books. Things either go horribly wrong or wondrously right, as if there were an outside hand always intervening. \nJohn BarthFrom how many ships must a man get tossed,Before you call him drowned??Get the ebook here."}, {"userName": "Ian \"Marvin\" Graystik", "userReviewDate": "Aug 23, 2011", "userURL": "http://www.goodreads.com/user/show/5022264-ian-marvin-graystik", "userReview": "[plucked. (hide spoiler)]"}, {"userName": "Mona", "userReviewDate": "Mar 29, 2015", "userURL": "http://www.goodreads.com/user/show/7020601-mona", "userReview": "Boisterous, Hilarious, Satirical, Epic Frolic Set in Seventeenth Century London and Colonial MarylandA Goodreads buddy described this book as \"a rollicking tale\". Good description.Don't expect brevity or logic here.I already knew Barth was a formidable and unique writer, since I'd read and loved Lost in the Funhouse a long time ago.The Sot-Weed Factor is an entirely different type of novel. So Barth, like the most brilliant writers, is extremely versatile and has proven he can write well in completely different styles. Barth's lengthy novel, written with very authentic dialogue (and, in the texts-within-the texts, written style) of the times, tracks the innumerable adventures of one Ebenezer Cooke, who was born in England in 1666 and died in Maryland in 1732 (or at least that's the arc of the novel). Our hero is based on a real poet, Ebenezer Cook (sometimes spelled Cooke) who lived around the same time and wrote a biting satirical poem scourging life in Maryland entitled \"The Sot-Weed Factor\". (In the idiom of that time, a sot-weed factor is a tobacco dealer). Little is known of the real Ebenezer Cook. This real poem and poet are obviously the source of Barth's title and his main character. The poem is also the source of certain basic plot elements. But that's like saying a vegetable is the source of a culinary masterpiece or a simple tune is the source of a complex jazz piece. Barth, our chef/jazzman (expressing himself through his characters) creates complex riffs on the original undreamed of by the real Cook.Ebenezer Cooke is a genuine horse's ass at the beginning of the novel. He's pompous, pretentious, and hoarding his innocence (both of life and of sex) like it's gold (although at least in the beginning of the book, he's quite reserved). Only later on does he start trumpeting his virtues. He's about to flunk out of Cambridge, since he's started dabbling with writing verse . Ebenezer is also paralyzed by a lack of direction. His problem is that he finds every path in life equally appealing and cannot decide between them.In the book's opening paragraph, Barth describes Ebenezer thus:\"IN THE LAST YEARS OF THE SEVENTEENTH CENTURY THERE WAS TO BE found among the fops and fools of the London coffee-houses one rangy, gangling flitch called Ebenezer Cooke, more ambitious than talented, and yet more talented than prudent, who, like his friends-in-folly, all of whom were supposed to be educating at Oxford or Cambridge, had found the sound of Mother English more fun to game with than her sense to labor over, and so rather than applying himself to the pains of scholarship, had learned the knack of versifying, and ground out quires of couplets after the fashion of the day, afroth with Joves and Jupiters, aclang with jarring rhymes, and string-taut with similes stretched to the snapping-point\"Ebenezer gets a surprise visit in his Cambridge rooms from his former tutor, Henry Burlingame. Burlingame had disappeared for no apparent reason after teaching Ebenezer and his twin sister, Anna, at the estate of their father, Andrew, in St. Giles in the Fields. Burlingame was a fantastic teacher and curious about all subjects and the world in general. Ebenezer's indecision about his life's path is in part a result of Burlingame's eclectic tutelage, that made all life paths seem equally desirable.Burlingame, hearing that Ebenezer is about to be kicked out of Cambridge, explains his disappearance (Andrew Cooke had presumed that Burlingame had designs on Anna, and fired him on the spot). He also proposes a business venture: that Ebenezer should join him in London in a tutoring business. \"Unhappy day!\" laughed Ebenezer. \"I've no skill in any craft or tradewhatever. I cannot even play Flow My Tears on the guitar. I can do nothing/'\"Then 'tis plain you'll be a teacher, like myself.\"\"'Sheart! Twould be the blind leading the blind!\"\"Aye,* smiled Burlingame. \"Who better grasps the trials of sightlessnessthan he whose eyes are gone?\"\"But what teach? I know something of many things, and enough ofnaught.\"\"I'faith, then the field is open, and you may graze where you list.\"\"Teach a thing I know naught of?\" exclaimed Ebenezer.\"And raise thy fee for't,\" replied Burlingame.Ebenezer decides he's no teacher, and goes home to face his father. Andrew Cooke decrees that Ebenezer must apprentice as a clerk for a time in London and then sail to Maryland to oversee Andrew Cooke's estate there, Malden.Ebenezer has no talent for or interest in, clerking either: \"He would begin to add a column of totally meaningless figures and realize five minutes later that he'd been staring ata wen on the neck of the boy in front of him, or rehearsing in his mind areal or imaginary conversation between himself and Burlingame, or drawingmazes on a bit of scratch-paper. For the same reason, though he hadby no means the troublemaker's temperament, his untamable fancy morethan once led him to be charged with irresponsibility: one day, for example, scarcely conscious of what he was about, he involved himself entirely in a game with a small black ant that had wandered across the page.\"He spends several years in London and \"fares unspectacularly\" in Barth's words.He then gets himself into more trouble (he seems to have a knack for getting into trouble and dragging everyone around him into it). He falls in love with a whore, the humorously named Joan Toast, and refuses to pay John McEvoy, her pimp and lover, on the grounds that he cannot bring himself to pay for a woman he has fallen in love with.McEvoy then mails a letter to Andrew declaring that Ebenezer has been spending time with whores, not advancing in his job, etc. As a result, Andrew sends Ebenezer to Maryland.Before Ebenezer leaves London, he dresses up in his best (and humorously depicted) finery and pays a call on Lord Baltimore, persuading him to make him Poet Laureate of Maryland.Ebenezer commences to have many misadventures, including multiple captures by pirates, several near drownings, being robbed of all his worldly goods (several times), being captured by Indians, etc. He also commits a petty theft of his own after nearly getting in a duel with a stationery/book seller who drives him crazy by offering him too many notebook options (slim cardboard quarto with unlined paper, thick leather quarto with lined paper, etc.) Ebenezer hates options because, since they are all equally attractive to him, he can never choose between them. He encounters various shady characters (such as the aptly named Captains Slye and Scurry), shysters, quacks, shady lawyers, golden-hearted whores and disreputable women, pirates, thieves, spies, traitors, imposters, rebellious Natives and slaves, Indian kings, etc. But others often take Eben himself for a madman.The novel is a comedy of errors (albeit with a somewhat sobering postscript).The themes of trickster, criminals, and especially disguises and mistaken and faked identities pervade the entire book (as well as that of twins). We also have changes in social and cultural identities occurring on a regular basis (certain characters switch between being Indians and being English colonists; others morph from being servants to being gentlemen (and vice versa). Burlingame disappears and reappears at regular intervals in both England and Maryland. He assumes various disguises and identities (many of which don't become obvious until later in the book). He's a master trickster. He's also clearly a spy, although for whom is not clear until the novel's end. Orphaned Burlingame is also obsessed with finding his parentage and origins. Ebenezer helps with this task.The Laureateship causes multiple problems. It engenders numerous \"Ebenezer Cooke\" impersonators, who of course, also cause Ebenezer trouble.Also, coincidences abound (many of which strain credulity, but credulity is not the point here). Or as Barth puts it:” Lest it be objected by a certain stodgy variety of squint-minded antiquarians that he has in this lengthy history played more fast and loose with Clio, the chronicler's muse, than ever Captain John Smith dared, the Author here posits in advance, by way of surety, three blue-chip replies arranged in order of decreasing relevancy. In the first place be it remembered, as Burlingame himself observed, that we all invent our pasts, more or less, as we go along, at the dictates of Whim and Interest; the happenings of former times are a clay in the present moment that will-we, nill-we, the lot of us must sculpt... Moreover, this Clio was already a scarred and crafty trollop when the Author found her; it wants a nice-honed casuist, with her sort, to separate seducer from seduced. But if, despite all, he is convicted at the Public Bar of havingforced what slender virtue the strumpet may make claim to, then the Authorjoins with pleasure the most engaging company imaginable, his fellow fornicators, whose ranks include the noblest in poetry, prose, and politics\"Ebenezer runs into many of the same people he met in London (or who showed up in others' tales) again and again in Maryland. Many of them turn out to have (previously unknown) connections to others in Ebenezer's life. Ebenezer also encounters new characters in Maryland , such as Mary Mungommery \"The Travelling Whore of Dorchester\" and Harvey Russecks, a trapper. There are a couple of key players who (possibly---we are never certain) never actually appear in person in the novel. We are not really sure if they exist or not. The themes of shifting and uncertain identities were also explored by Barth in Lost in the Funhouse There's plenty of meta here. There are innumerable (and very entertaining) tales within tales. In fact, it seems like almost every person Ebenezer encounters has a yarn to tell. There are also a couple of manuscripts (memoirs) within the novel, not to mention Ebenezer's poetry. Maybe that's why Barth insists this is \"postmodern\", although I really don't see that it is. Ebenezer does evolve through the novel. He goes from being a terrible poet to a pretty good one. He also realizes that the innocence he's set such store on is not worth as much as he thought. Innocence (and its loss) is also a theme throughout the book.This is a kind of picaresque novel crossed with a Bildungsroman. And it's remiscent of novels of that time period, such as The Life and Opinions of Tristram Shandy, Gentleman. Anyway, this novel is hilarious and great fun to read, although I do admit it seemed a bit long (although its length is probably appropriate for its epic sweep).Kevin Pariseau does an absolutely masterful job of reading the audio and voicing the different characters. I read along in the Kindle book and the PDF version, both of which are available free online, since I think this novel might now be in the public domain.Here's a link to the original poem: http://pages.uoregon.edu/rbear/sotwee...Thanks to Ian Pagan-Szary for this link. Also thanks to Ian for suggesting we do a \"buddy read\" on this, which inspired me to tackle this long book sooner rather than later."}, {"userName": "Mariel", "userReviewDate": "Dec 20, 2012", "userURL": "http://www.goodreads.com/user/show/647547-mariel", "userReview": "We sit here on a blind rock careening through space; we are all of us rushing headlong to the grave. Think you the worms will care, when anon they make a meal of you, whether you spent your moment sighing wigless in your chamber, or sacked the golden tombs of Montezuma? Lookee, the day’s nigh spent; ’tis gone careering into time forever… We are dying men: i’faith, there’s time for naught but bold resolves!It kills me when I go to the movies and I'm sitting next to some little kid that has to study my reaction to the story for their cue to laugh or whatever reaction is appropriate. I'll start to look at the kid to see if they are doing what I'm doing. I'll get distracted looking at the adult they are with and wondering what relationship dynamic they share that they aren't studying what they are doing. Why choose me? Then there's that feeling when someone is watching you and you feel pressured to give them that big laugh. They'll repeat the joke if you didn't laugh hard enough. Didn't you get it? It's hilarious! These feelings aren't conducive for that blissful wrapped up in a story feeling that I can't get enough. I don't want to be prodded into laughing over endless dick and fart jokes. I want to roll over and go to sleep and not wake up with a vegetable poking me into a further vegetated state.I can't remember the last time that I really laughed. I mean a full on bellyaching sidesplitting laugh. It may be me. My goodreads friends list seem to love this one to pieces. The whole thing and the ensuing of hilarity. If it were a film I'd expect the sound bites to read something like \"The thrill ride of the summer!\" and \"I laughed until I cried!\" Reviews all over the internet suggest it is a book to be loved. Ribald, raunchy, corset poppin', romps, sweaty, sheets, rolling, rollicking, over the side, walk the plank, tied up, buttered up, tarred, feathered, skinned, scalped, pokered, buggered, roped, raped, underneath, hole, fit it, in, penis, vagina, poop. Blah blah blah. It was okay enough, at first. I started out wondering why this blank faced young man was looking at everyone else in the movie theatre for his cue to look like he felt about anything. I didn't really find it hilarious but I wasn't desperately bored, yet. Have you ever read series fiction? And you have to get through a lot of boring bits that reiterate information from previous volumes? One that I used to read before I got bored with it was Michelle Sagara's Elantra series (an excellent example, if you are familiar with it, because I doubt it'll ever end, or at least it seemed that way when I gave up). Every damned time I had to sit through scenes of the lead character being late to everything. She's always late! Look, she's a klutz! Scene after scene of this. In case you forgot (which I hadn't). The Sot-Weed Factor is one book. I got really damned bored reading about stuff that just happened as if I had read about it years ago in an earlier volume when I hadn't because it was the same book that I was reading at that time (I read it while waiting all day and into night for emergency car service. If I had had ANY other book with me I would have given up). I guess it is probably a satire of serial series too? You know how back in the day (or now, if it is the awful The Hobbit film(s)) they would stretch out stories beyond (en)durability to milk out the most money? Yeah. I felt like I was rereading books that I read in my teen series or early twenties. I probably would be less moany about this one if I wasn't writing a review of it. It's the energy it takes to have a reaction to something and finding out you didn't really care that much. I don't feel like writing reviews of Tristam Shandy or any of the J.P. Donleavy books. I'm really reminded of Philip from Of Human Bondage. It's a \"history\" of a life, same as that book, and the hero is a cypher for a parade of other people's stories. I liked Megha's nicer way of seeing it that it was an echo of the storytelling nature of lives past. To me it felt like going from soap box to soap box to espouse whatever the author felt like talking about, and not much of a life for the hero. He's always looking to everyone else and then he writes about it. He would probably hold a quill to his lip and dream dreamy dreams about love and life and not understand any of it because he never lived any of it. Ebeneezer depressed me. I just saw him as some dick waving asshole confronting the prostitute Joan with his \"virtue\". It is supposed to be like this! Tell me what it is supposed to be like, somebody. Somebody live up to something so I don't have to get in the dirt. The poor girl on the ship that he is disappointed was not a virgin when the other guy rapes her before he had meant to rape her himself. (Like Phillip's entitlement to a hot girl despite his bum leg. It amazes me he's not seen as a dick for wanting a hot girl instead of the supposedly ugly girls who loved him but Mildred was evil because she wanted a hot guy instead of him.) I don't know. This is innocence? I saw a monster face hiding behind not having one. He wonders about his own halted desires and stilted virtues. Sure, he notices it to talk about it. Talking a lot and making claims on the future and meaning isn't innocence to me. Of course, the fictional Ebeneezer Cooke (there was a real one) likes to run around and call himself a poet (I grew so tired of how often Barth refers to him as \"the poet\" as a name). Names aren't art. Innocence would be living in spite of it and art would be making something in spite of it, or just having something else to live in along with it. Some place to go. What was all of these hijinks and antics and adventures and scenes scenes scenes saying? No, don't look at the face of the person next to you, Mariel. You didn't like it that much.His twin sister moves between serenity of listening to her father, or her brother, or their tutor Burlingame. Another no expression. She has Burlingame's baby and their neighbors believe it is her brother's child. They have to live with faces coming up with conclusions. I was interested from time to time in the horrors of indentured servitude. I am fascinated by the corruption and cruelty enacted on fellow men in \"contracts\" (not feeding people to \"save money\"). But then I never thought that colonization was a pure thing without warts on the ass. I sort of cared about Mary and the Inn-keeper's daughter. They tried to live anyway (mirroring the wet nurse who fell into trouble with a man because another authority male figure kept her locked up from life. So they took lives for their own). I liked that Joan could live as herself and like sex anyway, even as Ebeneezer hearing the story of the rape by trickery from her uncle (after her first bleeding) tells her that she should feel the horror and shame. I don't care about what anyone says anyone else should be feeling. There wasn't anyone alive then who didn't have to live with something. I guess I don't give any kind of damn about satirizing other novels. If they aren't living their life that says a lot more about them than it does about their teachers or parents or that life wasn't handed to them on a clean silver platter. I was just happy to finish it and never have to read it again.At least the prostitutes were diseased. It is refreshing to read about prostitutes in novels that aren't just dream girls for some man, no matter what Ebeneezer thought. It sucks and they do get haggard and have sexually transmitted diseases (Thomas Pynchon in Inherent Vice I am talking to you). Of course, I don't need an enormous book to tell me that either. I would have been better off reading a book about the colony of Maryland and imagining stories out of that myself then trying to squint and imagine history and stories out of why aren't you laughing? I just made another sex joke.P.s. I read The Sound and the Fury that is an intensely style focused novel obsessed with virginity after reading this intensely stylized novel about a man obsessed with his own virginity. Uh oh. Is this a sign of my wet blanket existence going further into my future? I never find Kristen's penis drawings funny. She thought I thought they were obscene and that's why I disliked them. I just didn't feel anything at all. Pubic hair in the pictures was too intimate for me, though. I can imagine it getting into food, for some reason. Burlingame's suggestion for vegetables and penis will ruin this vegetarian's appetite. I just don't find it funny. I feel nothing. I don't want to think about not feeling anything like I'm lacking. I just don't have the same sense of humor. Maybe this book is for everyone else and I'm on another ship going to another colony where they scalp Princess Tiger Lilly."}, {"userName": "Edward", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/12933866-edward", "userReview": "Unlike many other reviewers, I did not have the experience of being pleasurably catapulted headlong into the world of Ebenezer Cooke and his associates. In fact, I struggled with this novel for hundreds of pages before I started to enjoy it. I dislike the particular style the book parodies and resembles, and found the plot and characters to be overtly silly, the adventures unbelievable. It took a long time for me to suspend my cynicism and allow myself just to roll with the punches. While the style never really stopped feeling like a chore to read, what won me over was simply the incredible story , whose endless twists and turns cannot but eventually ensnare and immerse even a resistant reader. By the end I was cheering for poor Ebenezer, and hoping for neat and satisfying conclusion to his misadventures. I ended up enjoying The Sot-Weed Factor despite myself, but was left with the feeling that the enjoyment was mostly superficial. The book does present some matter for contemplation, but on the whole there are not too many layers to tease apart. In this regard I think the novel is limited by its adherence to Seventeenth Century literary styles, which though charming in themselves, are perhaps not as nuanced or flexible as modern ones. For me, The Sot-Weed Factor was wonderfully constructed fun, if somewhat frivolous."}, {"userName": "Mala", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/5960716-mala", "userReview": "[\"But not with mankind,\" Timothy declared. \"Europa, Leda, and Pasiphae are my sisters; my offspring are the Minotaur, and the Gorgons, and the Centaurs, the beast-headed gods of the Egyptians, and all the handsome royalty of the fairy tales, that must be loved in the form of toads and geese and bears. I love the world, sir, and so make love to it! I have sown my seed in men and women, in a dozen sorts of beasts, in the barky boles of trees and the honeyed wombs of flowers; I have dallied on the black breast of the earth, and clipped her fast; I have wooed the waves of the sea, impregnated the four winds, and flung my passion skywards to the stars!\" (P. 346)\"Two things alone can save a man from madness.\" He indicated the other patrons of the inn. \"Dull-headedness is one, and far the commoner: the truth that drives men mad must be sought for ere it's found, and it eludes the doltish or myopic hunter. But once 'tis caught and looked on, whether by insight or instruction, the captor's sole expedient is to force his will upon't ere it work his ruin! Why is't you set such store by innocence and rhyming, and I by searching out my father and battling Coode? One must needs make and seize his soul, and then cleave fast to't, or go babbling in the corner; one must choose his gods and devils on the run, quill his own name upon the universe, and declare, ' 'Tis I, and the world stands such-a-way!' One must assert, assert, assert, or go screaming mad. What other course remains?\"( P.364)\"Who knows what manner of sloven huts the real Troy was composed of, or cares to know?\" his friend replied. \" 'Tis the genius of the poet to transcend his material; and it wants small eloquence to argue that the meaner the subject, the greater must be the transcension.\" (P.406)\"He would versify his voyage to Maryland from beginning to end, as he had planned before, but so far from writing a panegyric, he would scourge the Province with the lash of Hudibrastic as a harlot is scourged at the public post, catalogue her every wickedness, and expose her every trap laid for the trusting, the unwary, the innocent!\t\"Thus might others be instructed by my loss.\" (P.477)\"we swim in an ocean of story, but a tumblerful slakes our thirst.\"( P. 560)\"To say naught of that truth, whereto Augustine and other Fathers beare witnesse: that true virtue lieth not in innocence, but in full knowledge of the Devils subtile arts.\" (P. 772) (hide spoiler)]"}, {"userName": "Megha", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/1727205-megha", "userReview": "This book is kind of nuts.In a good, hilarious way, I mean.\"I am Ebenzer Cooke, Poet and Laureate of this province.\"\"Well, I was once called the Traveling Whore o' Dorset, but I don't boast of't.\" Ebenzer Cooke has been waving his title in everyone's faces. So have been many others. Maryland is infested with poet laureates called Ebenzer Cooke. Henry Burlingame, on the other hand, is singlehandedly filling many shoes as he goes on a Mission Impossible-esque spree of changing disguises. Joan Toast is diligently working at supplying pox to the Indians. King Hicktopeake's ravenous Queen had been keeping, not only the king, but all men in the town perpetually fatigued. Highly confusing provincial politics and conspiracies are constantly afoot. An uproarious cast of characters is strewn all over the province. Their paths often criss-cross in such ways as to make it look like a bad case of Twister - where the proprietorship of hands, feet, torsos is difficult to ascertain. Hilarity ensues.Unlearned in matters of the real world, Ebenezer Cooke soars high on wings of fancy and blissful ignorance. When forced to come up with an improvised bum-swab, he summons his knowledge of philosophy, history and literature. He has a way of jumping out of frying pan to land straight into the fire, a bit of a 'wrong place wrong time' syndrome. When he is is lucky enough, someone comes along to pull him out of the ditch, only to drop him into a bog later.\"His chair rose from the floor, passed through the roof of Malden, and shot into the opalescent sky. As for Maryland, it turned blue and flattened into an immense musical surface, which suavely slid northwestwards under seagulls.\"Perhaps my favorite thing about The Sot-Weed Factor is how it upholds the tradition of oral storytelling. Several episodes are incidents being leisurely related by one character to another, each story-teller adding a bit of his/her own color to the story. Some even care to drop a nugget of wisdom or two.“Only the wittol can know he is no cuckold and only a dead man is safe from death.”Some of the stories being told are incredible enough to find a place in 'Ripley's Believe it or Not'. Many of the episodes that I was convinced could only be tall tales concocted to fool Ebenezer, turned out to be true. While some things I had believed, were revealed to be made-up truths. Who am I to call Ebenzer gullible then! There is no telling how the tide will turn in Barth's world. One small happenstance can set a contraption in motion leading to big, comic consequences.Barth's ribald, irreverent, comic adventure has a lot going for it. Except the length, methinks. After a point, it does exude a 'joke being told one time too many' feeling. In any case, I did make it to the end of the story where the oh so polite author apologized. Ebenzer's ordeal ended and he had a chance to lie down to rest and perhaps sink back into his dreams and reveries. “To me she is a woman. To you she’s a hallucination.”___________________________________I am willing to turn a blind eye if someone*** wants to steal a bunch of pages from my copy. This thing is too damn long. Though tons of fun, too.*** Jay Rubin - wink wink nudge nudge."}, {"userName": "George", "userReviewDate": "Dec 16, 2013", "userURL": "http://www.goodreads.com/user/show/9225700-george", "userReview": "HEAR YE, HEAR YE! I am starting a rebellion against all who do not want to wear periwigs. I feel that these are a classy way to display ones self, as well as carrying a sword to defend one's honor. I shall call my new land BARTHLANDIA. The national book shall be The Sot-Weed Factor, we shall eat eggplant every Friday, and drink away our sorrows with rum with much merry making. Our national currency shall be poetry, and ALL of the elected officials shall be elected through eating contests, (Kobaysahi shall reign forever!) Our day of national celebration will be every May 27, in honor of the terrific, witty writer, John Simmons Barth.This was an amazing read, and told as a bildungsroman story. It is a funny read, and it is full of love, honor, hate, deception, REBELLION, pirates, kidnapping, opium, Indians, sot-weed(my pipe smoking increased significantly with this read), hell, its full of life. I am hard pressed to decide what to like most about it, but I would choose the characters, and it has a slew of amazing characters. In his the Paris Review interview, in 1985, Barth was asked, about his perusing of the libraries at John Hopkins: Interviewer: In browsing the libraries, was it the concept of simply telling stories that fascinated you, or was it the characters that came through the works you read?Barth: It was not the characters. Perhaps I would be a better novelists in the real of characterization had it been.http://www.theparisreview.org/interviews/2910/the-art-of-fiction-no-86-john-barthI have to disagree with Ole John, here. I think he has some of the best characters I have ever had the pleasure to read about, hell, many of characters \"played\" multiple characters themselves. Even Ebenezer's father at one point was afraid he would change in front of his eyes:\"From time to time he cast(Andrew Cooke) great frowning glances at his children, as if they might vanish before his eyes or change into someone else.\" p. 712I think he is a master of character development. I loved his develoment of Ebenezer; I thought that Eben grew throughout the novel, and I did not like him at first, but he grew on me. Mary Mungummory is a sage of the world, and boy does she know whats going on in the world. Burlingame, a mastermind, thats all you need to know.Barth's story telling was great; he used stories within stories to tell his story. His use of Early Modern English used worried me at first, but grew on me throughout. I wish I spoke as well as these here folks.I would have rather read this in American Literature during high school rather than some of the other things that are required. It was funnny, and was not difficult to read. EVERYONE WILL READ THIS ONCE THE REBELLION IS OVER!\nHere moulds a posing fopping Actor,Author of THE SOT-WEED FACTOR,Falsely prais'd. Take Heed, who sees thisEpitaph; looke ye to Jesus!Labour not for Earthly Glory:Fame's a fickle slut, and whoryfrom Thy Fancy's chast couch drive her:He's a fool who'll strive to swive her!E.C., Gent, Pt& Lt of Md"}, {"userName": "·Karen·", "userReviewDate": "Dec 11, 2010", "userURL": "http://www.goodreads.com/user/show/1652898-karen", "userReview": "Local man rewrites Maryland history.'Dsheart, b' Truth, but I do believe that the gentleman known as John Barth Esquire was surely bit in the arse by Clio herself, which Fine Lady curst him with such a fever and ague and ashivering that could ne'er be shaken off, but only worked up and out, out into a tale the size of an Ocean and Beyond, encompassing a whole World, nay a Galaxy, nay a Cosmos no less, of the Incautious, the Devious, the Opportune, the Cockamamy, the Resourceful, the Shameless, the Salvage, the Exalted, the Craven, the Duplicitous and e'en, rare though 'tis, the Prudent. In sooth I mun allow that this be no pap for pups bare past the age of pissing their own nest. 'Twere not the stuff of moral tales to sweet the tongue of thy purse-lipped aunt (heaven forfend!), but a stronger, rougher brew mor'n likely to turn the heads of ye as art unaccustomed to such heady delights, and turn the stomach beside. For 'tis true that here the men are driven by lust and take their pleasures where they can, and, indeed, no less where they can't. Such a lurching parade of caulking the fantail, bumping the bacon, swiving from turnip to Twycross, from stump to stoolbutt, from betsy to bitstern; such a lurching parade of cod and wand and egg-plant, of rogering and basting and spiking.What knowledge is it that is root and stem of all? 'Twas carnal knowledge that caused man's fall!Prithee, let us go no farther. Take pity on the one who tries, i'Faith, to hold out agin the tide that washes o'er him. Canute did no better than he; valiant, hopeless. Ebenezer Cooke, Poet and Virgin.\"'Tis e'er the lot of the innocent in the world to fly to the wolf for succor from the lion! Innocence is like youth, which is given us only to expend and takes its very meaning from its loss.\""}, {"userName": "MJ Nicholls", "userReviewDate": "Feb 11, 2010", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "Health Warning!This novel is nothing like Sorrentino’s 1983 novel Blue Pastoral. After extensive talks with leaders of the Nathan “N.R.” Public Evisceration & Associated Critical Dismantling-For-Jollies Corporation, we at the MJ Nicholls 20-Second Knocked-Off Reviews-for-the-sake-of-them Organisation & Affiliated Dunces Inc. would like to issue an apology for anyone who read a certain review of Blue Pastoral and emerged from the experience with the opinion this novel in any way resembled Sorrentino’s 1983 novel Blue Pastoral, which—of course—it doesn’t. The Sot-Weed Factor is a faithful homage to the picaresque novel à la Henry Fielding or Tobias Smollett, it is not like the extended homage to the Oxen of the Sun section of Ulysses that comprises Sorrentino’s patchy 1983 novel Blue Pastoral. We would like to apologise for this misunderstanding and reassure the reader The Sot-Weed Factor can be read exclusively on its own merits, not merely as a false comparison point with a lesser novel published in 1983 by Sorrentino entitled Blue Pastoral. Thank you."}, {"userName": "David Lentz", "userReviewDate": "Jun 11, 2011", "userURL": "http://www.goodreads.com/user/show/3604115-david-lentz", "userReview": "This true American masterpiece is written like a 17th century literary novel. The style could well be Fielding, except that Barth is even more hilarious.At a time when minimalist novelists seem to be in vogue, I revelled in the intelligent richness of the elaborate quixotic tale woven by Barth. When a novelist can write as well as peers like Saul Bellow or V.S. Naipaul, then a maximalist style like Barth's is to be savoured. Poor chaste poet laureate, Ebenezer Cooke, encounters harsh reality at every turn, including capture by pirates and Indians. His dreams drive him to ridiculous ends where his ambitions are constantly confounded by greater existential powers. \"The road to Heaven's beset with thistles, and methinks there's many a cowpat on't.\" The dialogue is delicious and well-constructed with an authenticity and wit and bawdy truth. You have to marvel at the construction of such credible characters as Joan Toast, Bertrand, Boabdil, Andrew, Pocahontas and the pirate captain. Barth's dialogue on various letters of the alphabet, the trading of ancient insults and the scene where Ebenezer fears drowning in Chesapeake Bay were uproariously funny. Barth obviously knows the Eastern Shore near the Choptank River intimately: it's a lovely setting for his novel. For any true lover of great American literary novels, The Sotweed Factor should be on your must-read list."}, {"userName": "Kyle", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/48112788-kyle", "userReview": "One of the best books I've ever read. I'll need a while to think about it before trying to articulate my thoughts. I'll just say that it was much better than I could ever have hoped, and I think it's required reading for anyone at all into long, postmodern novels."}, {"userName": "Michael", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "I read this several years back so cannot make a real review. A prospective reader asks about the kind of humor it contains and whether it suffers from an ailment of early (1960) postmodern literature from being \"bizarre to the point of fantasy.\" A definite \"no\" to that.This is the story of a new English immigrant, Ebenezer Cooke, who has become a tobacco merchant (aka sot-weed factor) in colonial Maryland at the beginning of the 19th century. He is absurd in feeling special virtue over his celibacy, but that doesn't stop him being curious over the power of lust. The man is delusional enough to aspire to writing a heroic poem about the presumed noble virtues of the colony (a real Cook did so, but nothing is know of him). He is puffed up over his own importance like a Don Quixote and self-blinded to the human misery and venality around him like a Candide. He makes a tour of the towns and country, interviewing people and intersecting with their capers as an innocent abroad. The viciousness and lechery of folks like Miles Standish, corruption of the governing class, and wisdom of prostitutes eventually gets through to his thick head. But we love him anyway as the sweet idiot he is at heart. He eats dirt to meditate on his new land. He actually does have poetry in his soul, overblown but sincere. Barth's cleverness and mastery of language come through his voice in these quotes stolen from the few by readers at the review page:“Is man a savage at heart, skinned o'er with fragile Manners? Or is savagery but a faint taint in the natural man's gentility, which erupts now and again like pimples on an angel's arse?” “The difference here 'twixt simple and witty folk, if the truth be known, is that your plain man cares much for what stand ye take and not a fart for why ye take it, while your smart wight leaves ye whate'er stand ye will, sobeit ye defend it cleverly.” I see the book as a national treasure. I don't know why it didn't make the 1001 Books You Should Read list. I also don't know why I haven't taken up \"Giles Goat Boy\" yet."}, {"userName": "Jonathan", "userReviewDate": "Mar 13, 2013", "userURL": "http://www.goodreads.com/user/show/531153-jonathan", "userReview": "Poesy/Prosey perfection. More fun than a barrel-full 'o brandy, and saucier than the Traveling Whore 'O Dorset on a particularly randy morn."}, {"userName": "Sentimental Surrealist", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/9707921-sentimental-surrealist", "userReview": "One part revival of the so-called \"anatomy novel\" (big, rambling books without much by way of plot); part all-important postmodern tome; part study on topics such as identity, loyalty, naivete, colonialism and art; part experiment with seventeenth-century English (which gets a lot easier to read once you've sunk into the book); part metafictional hall-of-mirrors; part rip-roaring adventure story; part bildingsroman and one hundred percent ribald joke to rival Portnoy's Complaint. Gravity's Rainbow is the most intellectually dazzling entry in the postmodern canon and Infinite Jest is the most emotionally affecting, but this is the most fun."}, {"userName": "Camille Stein", "userReviewDate": "Dec 27, 2013", "userURL": "http://www.goodreads.com/user/show/19308897-camille-stein", "userReview": "The Sot-Weed Factor - http://ow.ly/y2ByS Era ciertamente un espectáculo de lo más insólito: más flaco aún que de costumbre debido al rigor de los meses que había pasado embarcado, Ebenezer avanzaba por la carretera de troncos dando zancadas como una cigüeña con las plumas erizadas. Llevaba los pies desnudos y llenos de ampollas, la camisa y los pantalones hechos jirones; rapado y afeitado cuando lo raptaron del ‘Poseidón’, ahora le había crecido salvaje el pelo del cuero cabelludo y de la barbilla, de modo que, si bien no muy largo, lo tenía completamente enmarañado y sin cuidar. Añádase a esto que estaba más quemado por el sol que los plantadores y, por lo menos, igual de sucio, que era la viva estampa del descastado y que su apresuramiento resultaba aún más grotesco debido al modo en que llevaba los brazos cruzados por delante de la pechera de la camisa, donde aún llevaba las arrugadas páginas del diario.… Epopeya monumental, parodia temeraria y procaz de la novela dieciochesca, John Barth afronta un reto de inverosimilitudes y acoplamientos de realidades que se alargan y ramifican hasta la extenuación. Ejerciendo de maestro de ceremonias de la 'literatura del agotamiento', el autor asciende y desciende sinuosas escaleras de un ingenio admirable, saturado de consideraciones políticas y filosóficas, una suerte de desmantelamiento y desmitificación de lógica y principios, del propio concepto de novela. Ironías, digresiones, constantes suplantaciones de identidad... Episodios como el desembarco de Ebenezer Cooke y de Bertrand Burton en las costas de Maryland y su posterior encuentro con Drakepecker, la historia y martirio del jesuita FitzMaurice o la relación entre la puta ambulante Mary Mungummory y su amante Charley Mattassin, constituyen en sí mismos ejemplos soberbios de la capacidad narrativa que atesora 'El plantador de tabaco'. Pero por encima de todo prevalece el placer de contar. Y desde luego, el placer de leer, de sumergirse en esta odisea endiablada y neurasténica."}, {"userName": "Rayroy", "userReviewDate": "Feb 18, 2012", "userURL": "http://www.goodreads.com/user/show/4622891-rayroy", "userReview": "This book is getting away from me, kind of like things in my life at the moment. It’s real good but I left it unread for too long. Fucking books I love them but they consume me. At bars I tell other drinkers, the serious and casual alike about books, I met women, go on dates, talk more about books then I do myself. I got this reading thing pretty bad, but I think it’s good for me. I wish life was like a novel, but it ain’t. I’m just rambling, been single longer then I’d like to admit, it could be one reason why I read so much. Relationships are hell and the dating scene is a game I have grown tired of playing, give um space, what day, played hard to get, don’t talk down, ask them stuff about themselves, I feel like John Fravreau in the movie “Swingers” he’s not over his ex, meets this chick at the bar, goes home then calls, keeps calling her leaving massages on her answering machine, like l had fun, confessing his love. What does this have to do with “The Sot-Weed Factor” not much, but just like Ebenezer Cooke, I’m torturing myself over women, escaping in literature, not knowing who the people I come across really are."}, {"userName": "Jonfaith", "userReviewDate": "Jun 13, 2010", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "Joel bought me something several years ago for xmas. I already owned it. He kept that copy and asked, teeth gritted, what I wanted. I suggested this and read it over the holidays, particularly one hungover party at my parents'. Punning and ribald, it must be situated just below Pynchon, specifically Mason and Dixon. It is disquieting how polarizing otherwise literate people are concerning Mason and Dixon. One should read the Sot-Weed Factor if at all concerned with the undulating comic possibilities of the Pox."}, {"userName": "Suzanne", "userReviewDate": "May 08, 2010", "userURL": "http://www.goodreads.com/user/show/3695758-suzanne", "userReview": "My third or fourth read of this -- I’m not sure, but really, who the hell can keep track of things like that anymore? The important thing is, I still  dearly  love this book, it’s still sheer pleasure, a perfect delight, from page 1 to page 756. (OK,there was a tiny span where Lord Baltimore is talking about Maryland's history that got a bit boring, a handful of pages, but other than that, perfect. Really.)"}, {"userName": "Geoff", "userReviewDate": "Oct 07, 2013", "userURL": "http://www.goodreads.com/user/show/126266-geoff", "userReview": ""}, {"userName": "Zorro", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/64863697-zorro", "userReview": "Θα μπορούσε να υψώσει ανάστημα απέναντι στον Οδυσσέα του Τζους."}, {"userName": "Lisa Reads & Reviews", "userReviewDate": "Jul 26, 2012", "userURL": "http://www.goodreads.com/user/show/5395843-lisa-reads-reviews", "userReview": "“In the last years of the Seventeenth Century there was to be found among the fops and fools of the London coffee-houses one rangy, gangling flitch called Ebenezer Cooke…”The Sot-Weed Factor hooked me from the first sentence.John Barth's novel was inspired by a poem of the same name written by Ebenezer Cooke in 1708. The novel itself draws on official archives of Maryland, but its historical account is animated by a whirlpool of imagination. The plot pivots and twirls with intrigue, counter-intrigue, masquerades, farce and melodrama, and adventure--lots of adventure. The characters are many, but primarily Ebenezer Cooke, his twin sister, Anna, and Henry Burlingame, a complex man of many guises.The dialogue alone I would award 5 stars--formal, yet hysterically funny, insightful, and often bawdy--I admit to having dialogue envy.This is a long novel, about 500K words, so it easily suits lots of themes:The existentialist notions of action, choice, and value.The lawlessness of early America with its connection to European political conspiracies complicated by a disregard for morality juxtaposition with desires for upper class wealth and prestige.Coming of age and the development of a coherent sense of self.Sex and society. (Women's roles, prostitution, rape, incest, buddy love, lust....)I could go on. For criticisms, I have 2. First, extensive text of a journal is produced on the page in all manner of glorious misspellings, which made for difficult reading, which amounted to me skimming. Second, the ending epilogues wrapped everything up with a nice little bow, which was anti-climatic and devoid of all the wonderful character and dialogue that made the novel so enjoyable. That's it. Grand read. I think you'd enjoy it."}, {"userName": "Mariano Hortal", "userReviewDate": "Jun 13, 2013", "userURL": "http://www.goodreads.com/user/show/7377752-mariano-hortal", "userReview": "Publicado en http://lecturaylocura.com/el-plantado...Si algo tenía claro era que la vuelta al blog después de las vacaciones tenía que ser a lo grande; ya que este post es el número ciento cincuenta y para tal acontecimiento era necesario que el comentario se refiriese a una “magna” obra. Dicho y hecho, aprovecharemos el momento para hablar de “El plantador de tabaco” del norteamericano John Barth.plantador_gdeDesde que empecé Filología Inglesa tengo una pequeña obsesión con pintar, rellenar todos los huecos de la narrativa anglosajona; cosa harto difícil, habida cuenta del número de obras que permanecen inéditas todavía en este, nuestro querido país. Dentro de ese fascinante mundo anglosajón las piezas del puzle se van ensamblando cada vez más, gracias a la labor de editoriales pequeñas independientes: ahí tenemos el caso de Pálido Fuego que va a publicar en no mucho tiempo el “House of leaves” de Danielewski, obras de David Foster Wallace e incluso de Robert Coover en el futuro; e, igualmente, gracias a Sexto Piso estamos viendo la aparición de la obra literaria del gran William Gaddis, Kurt Vonnegut y, ahora, de John Barth. De hecho, estamos hablando de la que siempre se ha considerado la obra maestra del escritor y prometen más obras de él en adelante. No puedo más que relamerme los dedos y desesperarme con la (gozosa) espera.“El plantador de tabaco” (“The Sot-Weed Factor”) fue publicada en 1960 e inicialmente Barth la concibió como la conclusión a una trilogía nihilista, siendo las dos primeras novelas de la trilogía “The Floating Opera” (1956) y “The End of the Road” (1958); y tomó su título del poema “The Sotweed Factor, or a Voyage to Maryland, A Satyr” de 1708 realizado por el poeta inglés Ebenezer Cooke (c. 1665-c.1732) del que prácticamente no se sabe nada.Resumiendo a grandes rasgos la trama, la novela (ubicada en la década de 1680 a 1690 en Londres y Maryland) es una narración épica satírica de la colonización de Maryland basada en la vida ficcionalizada de Ebenezer Cooke; honrado con el título de Poeta Laureado de Maryland, y al que se le manda para cantar las alabanzas del proceso y que vivirá una serie de aventuras en su viaje a la colonia ( ¡y en ella!) mientras preserva, con no pocos problemas, su virginidad intacta.Barth también tenía la idea de dar un epitafio al poeta, en sus propias palabras: “The Sot–Weed Factor began with the title and, of course, Ebenezer Cooke’s original poem. . . . Nobody knows where the real chap is buried; I made up a grave for Ebenezer because I wanted to write his epitaph”. A pesar de lo comentado, el resultado final fue por otros derroteros. Como dijo Barth en 1994: “Looking back, I am inclined to declare grandly that I needed to discover, or to be discovered by, Postmodernism.” (“Mirando atrás, me inclino a pensar mayormente que necesitaba descubrir, o ser descubierto por el Postmodernismo”). A partir de ese momento, de hecho, las obras de los períodos siguientes se inclinarían cada vez más a la fabulación, la metaficcionalidad, en conclusión: lo postmoderno.Tras leer la obra, no puedo más que estar de acuerdo con lo anterior. Y me gustaría incidir en lo que considero sus virtudes, aquellas características que la hacen tan especial y, por qué no decirlo, una obra imprescindible del postmodernismo y, extendiéndolo aún más, de la literatura universal.En primer lugar hay que tener en cuenta la estructura: la trama principal, ese tour de force de nuestro querido poeta, se convierte en un juego de cambios de identidad, mascaradas y equívocos altamente humorísticos por momentos que alternan con digresiones, historias dentro de historias e incluso listas (esotéricas, ingredientes de comidas, insultos…). Se puede comprobar fácilmente cómo la historia comienza de una manera más realista (como en sus obras anteriores) y va desencadenando una narración cada vez más postmoderna según avanza la obra: esas digresiones, esas historias dentro de historias, son elementos clásicos de este estilo. La novela toma como referencia los géneros (y formas) del siglo XVIII y las parodia, imita, recupera y reescribe: en esta parodia entran el Bildugnsrroman o relato de formación, el Künstlerroman o relato de formación de un artista y del género picaresco, convirtiendo toda la obra, en sí, en una farsa satírica de proporciones épicas. Luego volveré sobre este tema, ya que hay que indicar para qué le sirve esto.En este texto que pongo a continuación de la fabulosa traducción de Eduardo Lago (que además hace el prólogo y de la que proceden todos los textos que voy a reproducir) para esta edición de “El plantador de tabaco” de Sexto Piso, encuentro dos hechos reseñables:“En los años finales del siglo XVII había entre los juerguistas y petimetres que frecuentaban los cafés londinenses un individuo delgaducho y zanquilargo llamado Ebenezer Cooke, con más ambición que talento y, sin embargo, más talento que prudencia, el cual, al igual que sus compañeros de juerga, que en teoría estaban educándose en Oxford o Cambridge, encontraba en los sonidos de la madre lengua inglesa más un motivo de juerga y diversión que algo con sentido, con lo que se podía trabajar y, en consecuencia, en lugar de entregarse a los sinsabores de la erudición, el tal Ebenezer aprendió el arte de versificar, dando en desgranar, conforme a la moda de entonces, cuadernillos de pareados plagados de Joves y Júpiteres espumeantes, entre el estruendo de las rimas estridentes y símiles que de tanto tensar la cuerda, a punto estaban de romperla.”Uno, sin dudarlo, el estilo, que imita las formas de novelas anteriores de Fielding, Sterne y su “Tristan Shandy” o de Samuel Richardson; requiere mayor esfuerzo lector por lo estrambótico, por la réplica del estilo antiguo; pero compensa debido al increíble lirismo de cada descripción, a la minuciosidad narrativa, al humor que destila en cada palabra, en cada metáfora. Una joya, de la que no te cansas y que te ayuda a disfrutar aún más. Dos, los personajes, este es el primer párrafo y asistimos a la presentación, cuál Quijote, de este poeta “de pelo y ojos claros, huesudo, los pómulos hundidos” “hombre garza, de patas flacas y pico largo, caminaba y se sentaba con pose descoyuntada; su porte mismo era una sorpresa angulosa, cada uno de sus gestos, una semiagitación.”El triángulo de protagonistas que forma junto con Henry Burlingame (que en algún momento llegué a identificar con Sancho Panza) y la hermana del poeta, Anna, llevan el peso de buena parte de la obra y son parte de su encanto; sin perder de vista al criado traidor, Bertrand, que le pone en más de una situación comprometida y a Joan Toast, una suerte de Dulcinea grotescamente desahuciada, a la que ama sin reparo:“-¡Y vos sabed que os amo por ser mi salvadora y mi inspiración! –repuso Ebenezer-. Pues hasta esta noche en que habéis venido a mí, jamás fui hombre, sino un mero patán chocho y un currutaco; y hasta el momento en que os abracé jamás había sido poeta, sino poetastro fatuo y huero. Con vos Joan, ¿qué proezas no ejecutaré? ¿Qué versos no escribiré? […] Despreciadme, Joan, que entonces seré un loco egregio, un don Quijote que se tambalea por causa de su ignorante Dulcinea; pero aquí os desafío (si tenéis la vida y el fuego y el ingenio suficientes) a que me améis sinceramente, como yo os amo a vos, y entonces lucharé contra gigantes de verdad, y los sojuzgaré. Amadme y os juro lo siguiente: ¡Yo seré Poeta laureado de Inglaterra!”No se puede negar la influencia “cervantina”, patente en ese protagonista y en sus compañeros; el ser conocedor del texto ayuda a disfrutar aún más de esta reescritura en clave satírica. También la “Ilíada” de Homero es musa inspiradora y nos lleva al hilo principal de la obra que además se convierte en otra cualidad reseñable:“¿Hubiera tenido el mundo noticia alguna de Agamenón, o del fiero Aquiles, o del ingenioso Odiseo, o del cornudo Menelao, o del circo, todo lleno de griegos y troyanos que se iban pavoneando por ahí, de no ser porque el gran Homero habló de ellos en verso? ¿Cuántas batallas de mayor importancia creéis vos que se han perdido en el polvo de la historia por falta de un poeta que las cantara para la posteridad? […] Los héroes perecen, las estatuas sucumben, los imperios se desmoronan; pero la Ilíada se ríe del tiempo, y los veros de Virgilio son hoy tan verdaderos como el día en que fueron compuestos. […] ¡Sería una composición épica como jamás se ha escrito ninguna! ¡La Marilandíada, por mi fe!”De la Ilíada deriva en esa “Marilandíada” y nos muestra su interés por ensalzar la labor del poeta y de la literatura en general como atestiguan estos momentos:“Entre todas las artes y ciencias la literatura era la única que tenía como dominio propio el campo entero de la experiencia y el comportamiento humanos (de la cuna a la tumba y aún más allá; del emperador a la puta barata; desde la quema de ciudades hasta el modo de luchar contra el viento), así como los problemas de toda magnitud que afectan al hombre.” “¿Quién tiene más necesidad que el poeta de todos los dones divinos? El poeta posee el ojo del pintor, el oído del músico, la inteligencia del filósofo, la persuasión del letrado; cual un dios atisba el alma secreta de las cosas, la esencia que se oculta bajo la forma de las mismas, su más recónditos recodos. Cual un dios conoce las fuentes del bien y del mal: ve la semilla de la santidad en la cabeza de un asesino, el gusano de la lujuria en el corazón de una monja. Y aún voy más lejos: así como el poeta es entre los caballeros como una perla entre piedras pulimentadas, así también debe el Laureado ser un diamante entre las perlas, un príncipe entre los príncipes.”“¿Quién tiene más necesidad que el poeta de todos los dones divinos? El poeta posee el ojo del pintor, el oído del músico, la inteligencia del filósofo, la persuasión del letrado; cual un dios atisba el alma secreta de las cosas, la esencia que se oculta bajo la forma de las mismas, su más recónditos recodos. Cual un dios conoce las fuentes del bien y del mal: ve la semilla de la santidad en la cabeza de un asesino, el gusano de la lujuria en el corazón de una monja. Y aún voy más lejos: así como el poeta es entre los caballeros como una perla entre piedras pulimentadas, así también debe el Laureado ser un diamante entre las perlas, un príncipe entre los príncipes.”  “¿Quién lee mejor el corazón de los hombres, el filósofo o el poeta? ¿ cuál de los dos está en más estrecha armonía con el mundo?”Me gusta la idea de esta defensa del arte literario pero no por el arte, sino como único repositorio del testimonio y la experiencia de la humanidad; y del poeta como focalizador de todo lo que proviene de Dios, al menos lo virtuoso, poniéndolo incluso por encima de la filosofía. Es lógico, por otra parte, esta afinidad; no en vano la literatura es mi mayor pasión y esta idea está cargada de romanticismo literario.Barth, nada ajeno a la tradición norteamericana, no se olvida en esta obra de señalar uno de los temas más recurrentes en la literatura norteamericana: la identificación del protagonista con Adán:“Me refiero a que lo que vos estáis haciendo es volver a representar la historia de Adán. Tanta importancia le concedéis a vuestra inocencia que por causa de la misma habéis perdido vuestro paraíso terrenal. Pero aún he de llevar esta idea más lejos: vuestra aventura no solo os ha dejado sin hogar, sino que al igual que sucedió con Adán, habéis probado vuestro primer bocado de Sabiduría y experiencia; de ahora en adelante no os será fácil coger frutos con que llenaros las tripas sino que ganaréis el pan con el sudor de la culpa, como hacen las masas humanas. Vuestro padres, si lo conozco bien, no dejará pasar esta ocasión de expulsaros del jardín del Edén.”Este Adán americano, es colonizador, hombre hecho a sí mismo, ahí está el Sueño Americano.Me encanta cómo la obra, ya lo indiqué anteriormente, va avanzando en forma y temas, y evoluciona del realismo al postmodernismo; los momentos en los que me di cuenta de ello empiezan a aconteceren la parte final aunque empiezan con la falibilidad del recuerdo:“-En suma, pues: ¿se es lo que se recuerda?-Sí –convino Ebenezer-. O mejor yo no sé lo que soy, pero sé que soy y que he sido merced a la memoria. El recuerdo es el hilo que ensarta los abalorios, constituyendo el collar; o como el hilo de Ariadna, del cual hizo entrega el ingrato Teseo: indica qué camino he seguido por el laberinto de la vida, me vincula con el punto de partida.” (ese recuerdo, esa memoria se torna aún más falible según se avanza en la obra, por los trastornos de identidades)Y se extiende a la propia realidad como vemos en este diálogo entre Burlingame y Ebenezer:“Sólo quería dejar bien sentado que toda aserción sobre el tú y el yo, incluso de cara a uno mismo, es un acto de fe imposible de verificar” a lo que Ebenezer responderá anonadado “¡Santo cielo, tu discurso me ha robado los símiles: no conozco nada que sea inmutable y seguro!”: la realidad que conocemos, fragmentada, es irreal, nunca podemos conocerla de manera absoluta e inmutable, se resquebraja: “-¡Todo esto es sumamente cambiante y confuso! […] ¡Nadie es quien ni lo que yo creo que es! -Pasan muchas cosas –asintió crípticamente el criado- que a gentes como vos y como yo se nos escapan. Maldita sea si las cosas son los lo que aparentan.”Realidad, apariencia y recuerdo se mezclan cada vez más y a la luz de este relativismo, se enfatizan cosas menos universales. Lejos todavía del inicio del postcolonialismo que surgiría en 1978 con la obra de Edward Said “Orientalism”; Barth, con todo lo indicado anteriormente acomete una reescritura postcolonialista de los clásicos para modificar y subvertir el diálogo tradicional; de ahí el uso de la parodia y la ironía; todo se convierte en una farsa, sólo hay que ver el segundo nivel de lectura que nos da con los fragmentos de los diarios íntimos de sir Henry (de 1608), que van pintando la historia del antepasado de Henry y que no es más que una reescritura del cuento de John Smith y Pocahontas aunque con “algunas diferencias” como podemos ver en este párrafo: “Comenzó entonces Attonce a darse de palmotadas en la panza con el fin de despertar un mayor apetito de viandas y, en viéndolo, otro tanto hizo Burlingame, hasta que el estruendo de las tripas de uno y otro resonó por sobre las ciénagas como fragor de volcán. Acto seguido, Attonce, cruzado de piernas, dio en rebotar con las posaderas sobre el suelo, para agradar aún más su apetito; hizo otro tanto Burlingame que no daba cuartel a su rival, y la misma tierra entremecíase bajo el peso de sus espantables traseros. […] Y ansí estuviéronse un buen espacio, efectuando numerosos rituales con que azuzaban el hambre, en tanto nuestra compañía los observaba, atónita, sin saber qué estaban presenciando, e los salvages batían palmas e danzaban en derredor, y Pokatawetussan miraba con lascivia a uno y otro rival.”En clave de humor, la lucha entre los dos comilones dará un ganador que desflorará a Pokatawetussan. Esta visión desarma el porte apuesto y viril de una persona de principios, un gran americano, para igualarlo con la tribu de indios; es insólito, pero se produce durante el texto una lectura en contra del imperialismo británico dando aún más importancia a los personajes de otras razas y poniendo a los colonos al nivel de los indios. Por si no nos quedara claro, en la parte final el norteamericano clarifica la reescritura del texto: “Otrosí fue tan osado que me mostró una relación escrita donde se refería cómo salvó a Pocahontas , cuya relación pensaba incluir en su mendaz Historia; aquella versión no hacía mención ninguna de la infamante desfloración de la princesa, sino meramente daba a entender que la doncella había sucumbido al porte viril y hermoso rostros de mi capitán. Así pues yo debía fingir que creía en aquella farsa burlesca y fue ello mismo lo que hame movido, con la esperanza de así apaciguar mi angustiada consciencia, a llevar a cabo aquesta relación verdadera en mi diario, en cuyas páginas ruego a Dios jamás pose mi capitán sus lúbricos ojos.”La dicotomía “history-story” se hace presente, cobrando aún mayor importancia la segunda parte (“story”, esos cuentos dentro de otros cuentos) debido a la falta de fiabilidad de la primera.En un principio pensé sobre todo en lo anterior como motivo principal de la obra, sin embargo, ya acabando el libro me encontré con esto:“El plantador de tabaco gozó de una popularidad constante entre las gentes de letras de Londres, bien que no era la clase de popularidad que hubiera deseado su autor. Los críticos lo consideraban un buen ejemplo de la clase de farsa satírica entonces en boga; elogiaban la rima y el ingenio; aplaudían las caracterizaciones y lo grotesco de la acción…, pero ni uno solo se tomaba en serio el poema.”En un texto como este donde todo es farsa, ironía y parodia, ¿podría pensarse que precisamente nos quería mostrar algo serio? Según el texto de Edmund Fuller “The Joke is on Mankind” para el New York times, con el que estoy bastante de acuerdo, quizá el autor quería expresar a través de esta obra lo que es la humanidad: una sátira, un conglomerado de fragmentos que a veces no se pueden discernir y que constituyen, como nuestras vidas, una (tragi)comedia en sí mismos.Infinitas posibilidades y reflexiones las que nos ofrece esta obra que, en mi opinión, es capital e imprescindible. Una obra mastodóntica que constituye un hito único por su influencia posterior y, cómo no, por sí misma. Necesitamos más de John Barth."}, {"userName": "Simon Robs", "userReviewDate": "Dec 17, 2015", "userURL": "http://www.goodreads.com/user/show/50133154-simon-robs", "userReview": "This thoroughly enthralling tale set mostly in the British colony of 17th century Maryland - a telling of fledgling willy-nilly poet Laureate of same and his \"Marylaniad\" one Ebeneezer Cooke who with his vast cast of characters (some who often as not act impersonator to EC) including his twin sister and a blithering plot of vicissitude and philosophical turnabout would mystify a Merlin. Methinks this ye yea nay tale o' yore style an allegory on karma withal existential precepts. A fair look to the historical muddled free-for-all of early American frontier slog and bog. The tobacco trade mixed with the commodity of human beings on the block vying elements of greed and whimsy in the new world that's a melting pot of animosity. That it's chock-full o' debauchery and low brow hijinks there can be no doubt and much to the delight of the reader better for it as it careens into full hilarity at points throughout. This was a moral high ground telling that took its time for getting there to some final if leavened heaven. These characters suffered their comedies and joyed in their misery. The book soared at reading a hundred pages a day 'twas masterful Mesmer for its carpet riding beholder. Fun forsooth ye swiving would-be rascal rousers read it and be carried away."}, {"userName": "Sean", "userReviewDate": "Sep 14, 2008", "userURL": "http://www.goodreads.com/user/show/688965-sean", "userReview": "A completely preposterous, hilarious and brilliant book about, among a million other things, the evils of innocence. Written beautifully in 17th century prose, in which time the book is set. About Ebeneezer Cooke, possibly the poet laureate of the colony of Maryland, depending on whom you believe, which in this book should be no one at all. Every character he meets has at least one lengthy story to tell, always fascinating, about events seemingly distant from Cooke's story, yet which inevitably relate directly to the plot in all sorts of wonderfully unlikely ways. Also includes a re-telling of John Smith's adventures with Pocahantas and finally, if you're patient, the Secret of The Eggplant is revealed. The set-up of the story is a little slow, and one must get used to the language, but stick with it past 50 pages. Once the plot kicks in, it's awesome all the way through.Update to add upon second reading: Still fantastic."}, {"userName": "Emma", "userReviewDate": "Apr 18, 2012", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "This is a substantial and detailed farce of sorts or comedy of errors at least. There was an actual Ebeneezer Cooke who wrote the poem although this is a work of fiction. I read it first 25 years ago and loved it. I tried to reread this and just got snagged by all the detail and found I don't have the time or mental energy to complete the reread. It IS wonderful but maybe once is enough!"}], "description": "Considered by critics to be Barth's masterpiece, The Sot-Weed Factor has acquired the status of a modern classic. Set in the late 1600s, it recounts the wildly chaotic odyssey of hapless, ungainly Ebenezer Cooke, sent to the New World to look after his father's tobacco business & to record the struggles of the Maryland colony in an epic poem. On his mission, Cooke experiences capture by pirates & Indians; the loss of his father's estate to roguish impostors; love for a farmer prostitute; stealthy efforts to rob him of his virginity, which he's almost determined to protect; & an extraordinary gallery of treacherous characters who continually switch identities. A hilarious, bawdy tribute to all the most insidious human vices, The Sot-Weed Factor has lasting relevance for all readers.", "title": "The Sot-Weed Factor", "url": "http://www.goodreads.com/book/show/1222741.The_Sot_Weed_Factor", "average": 4.08, "cover": "https://images.gr-assets.com/books/1331678872l/1222741.jpg", "reviews": 355, "authors": [{"url": "https://www.goodreads.com/author/show/8113.John_Barth", "name": "John Barth"}], "type": ["Fiction", "Historical", "Literature", "Classics", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/1222741.The_Sot_Weed_Factor", "http://www.goodreads.com/book/show/24835.The_Sot_Weed_Factor", "http://www.goodreads.com/book/show/144641.El_plantador_de_tabaco", "http://www.goodreads.com/book/show/469361.The_Sot_Weed_Factor", "http://www.goodreads.com/book/show/3246225-the-sot-weed-factor", "http://www.goodreads.com/book/show/25254521-the-sot-weed-factor", "http://www.goodreads.com/book/show/1222743.The_Sot_Weed_Factor", "http://www.goodreads.com/book/show/18071568-el-plantador-de-tabaco", "http://www.goodreads.com/book/show/130290.The_Sot_Weed_Factor", "http://www.goodreads.com/book/show/16057724", "http://www.goodreads.com/book/show/12885.Lost_in_the_Funhouse", "http://www.goodreads.com/book/show/24836.The_Floating_Opera_and_The_End_of_the_Road", "http://www.goodreads.com/book/show/24840.Chimera", "http://www.goodreads.com/book/show/144629.Giles_Goat_Boy", "http://www.goodreads.com/book/show/144634.The_Floating_Opera"]}